[
    {
        "year": "2021",
        "name": "16th FG 2021",
        "info": "Jodhpur, India",
        "venues": []
    },
    {
        "year": "2020",
        "name": "15th FG 2020",
        "info": "Buenos Aires, Argentina",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2020",
                "sub_name": "15th IEEE International Conference on Automatic Face and Gesture Recognition, FG 2020, Buenos Aires, Argentina, November 16-20, 2020.",
                "count": 146,
                "papers": [
                    "Message from the General and Program Chairs FG 2020.",
                    "Image Enhancement for Remote Photoplethysmography in a Low-Light Environment.",
                    "Toward fast and accurate human pose estimation via soft-gated skip connections.",
                    "Head2Head: Video-based Neural Head Synthesis.",
                    "Real-time Facial Expression Recognition \"In The Wild\" by Disentangling 3D Expression from Identity.",
                    "ATFaceGAN: Single Face Image Restoration and Recognition from Atmospheric Turbulence.",
                    "Gesture Agreement Assessment Using Description Vectors.",
                    "IF-GAN: Generative Adversarial Network for Identity Preserving Facial Image Inpainting and Frontalization.",
                    "A recurrent cycle consistency loss for progressive face-to-face synthesis.",
                    "FT-RCNN: Real-time Visual Face Tracking with Region-based Convolutional Neural Networks.",
                    "Face Video Generation from a Single Image and Landmarks.",
                    "DriverMHG: A Multi-Modal Dataset for Dynamic Recognition of Driver Micro Hand Gestures and a Real-Time Recognition Framework.",
                    "How are attributes expressed in face DCNNs?",
                    "End-to-end Facial and Physiological Model for Affective Computing and Applications.",
                    "Generative Model-Based Loss to the Rescue: A Method to Overcome Annotation Errors for Depth-Based Hand Pose Estimation.",
                    "Clustering based Contrastive Learning for Improving Face Representations.",
                    "Face Denoising and 3D Reconstruction from A Single Depth Image.",
                    "Gated Variational AutoEncoders: Incorporating Weak Supervision to Encourage Disentanglement.",
                    "Recognizing Gestures from Videos using a Network with Two-branch Structure and Additional Motion Cues.",
                    "DeepVI: A Novel Framework for Learning Deep View-Invariant Human Action Representations using a Single RGB Camera.",
                    "DeeSCo: Deep heterogeneous ensemble with Stochastic Combinatory loss for gaze estimation.",
                    "MoDuL: Deep Modal and Dual Landmark-wise Gated Network for Facial Expression Recognition.",
                    "EV-Action: Electromyography-Vision Multi-Modal Action Dataset.",
                    "Hybrid Video and Image Hashing for Robust Face Retrieval.",
                    "Robustness Analysis of Face Obscuration.",
                    "Block Mobilenet: Align Large-Pose Faces with <1MB Model Size.",
                    "Deep Entwined Learning Head Pose and Face Alignment Inside an Attentional Cascade with Doubly-Conditional fusion.",
                    "End-to-end Spatial Attention Network with Feature Mimicking for Head Detection.",
                    "Spatio-Temporal Attention and Magnification for Classification of Parkinson's Disease from Videos Collected via the Internet.",
                    "PAS-Net: Pose-based and Appearance-based Spatiotemporal Networks Fusion for Action Recognition.",
                    "Neural Sign Language Translation by Learning Tokenization.",
                    "Set Operation Aided Network for Action Units Detection.",
                    "Recognizing Perceived Emotions from Facial Expressions.",
                    "Learning Monocular Face Reconstruction using Multi-View Supervision.",
                    "Dual-Attention GAN for Large-Pose Face Frontalization.",
                    "Taking Control of Intra-class Variation in Conditional GANs Under Weak Supervision.",
                    "Synthesising 3D Facial Motion from \"In-the-Wild\" Speech.",
                    "Pseudo-Convolutional Policy Gradient for Sequence-to-Sequence Lip-Reading.",
                    "Attention Fusion for Audio-Visual Person Verification Using Multi-Scale Features.",
                    "Semi-supervised Emotion Recognition using Inconsistently Annotated Data.",
                    "Self-supervised Deformation Modeling for Facial Expression Editing.",
                    "Landmarks-assisted Collaborative Deep Framework for Automatic 4D Facial Expression Recognition.",
                    "Face Attributes as Cues for Deep Face Recognition Understanding.",
                    "3D Face Mask Anti-spoofing via Deep Fusion of Dynamic Texture and Shape Clues.",
                    "CLIFER: Continual Learning with Imagination for Facial Expression Recognition.",
                    "Slim-CNN: A Light-Weight CNN for Face Attribute Prediction.",
                    "An EEG-Based Multi-Modal Emotion Database with Both Posed and Authentic Facial Actions for Emotion Analysis.",
                    "Multimodal Deep Learning Framework for Mental Disorder Recognition.",
                    "Modelling the Statistics of Cyclic Activities by Trajectory Analysis on the Manifold of Positive-Semi-Definite Matrices.",
                    "Can We Read Speech Beyond the Lips? Rethinking RoI Selection for Deep Visual Speech Recognition.",
                    "Deformation Flow Based Two-Stream Network for Lip Reading.",
                    "Automatic Detection of Self-Adaptors for Psychological Distress.",
                    "Temporal Triplet Mining for Personality Recognition.",
                    "Towards automatic monitoring of disease progression in sheep: A hierarchical model for sheep facial expressions analysis from video.",
                    "Hand tracking from monocular RGB with dense semantic labels.",
                    "3D Landmark Localization in Point Clouds for the Human Ear.",
                    "Metric-Scale Truncation-Robust Heatmaps for 3D Human Pose Estimation.",
                    "First Investigation into the Use of Deep Learning for Continuous Assessment of Neonatal Postoperative Pain.",
                    "Mutual Information Maximization for Effective Lip Reading.",
                    "Leveraging Shared and Divergent Facial Expression Behavior Between Genders in Deception Detection.",
                    "Dynamic versus Static Facial Expressions in the Presence of Speech.",
                    "Generative Video Face Reenactment by AUs and Gaze Regularization.",
                    "Simple and Effective Approaches for Uncertainty Prediction in Facial Action Unit Intensity Regression.",
                    "Beyond MAGIC: Matching Collaborative Gestures using an optimization-based Approach.",
                    "Learning Guided Attention Masks for Facial Action Unit Recognition.",
                    "Deep Weakly Supervised Domain Adaptation for Pain Localization in Videos.",
                    "A General Remote Photoplethysmography Estimator with Spatiotemporal Convolutional Network.",
                    "Apathy Classification by Exploiting Task Relatedness.",
                    "Learning privacy-enhancing face representations through feature disentanglement.",
                    "Using a Skeleton Gait Energy Image for Pathological Gait Classification.",
                    "Kinematic Tracking of Rehabilitation Patients With Markerless Pose Estimation Fused with Wearable Inertial Sensors.",
                    "A video is worth more than 1000 lies. Comparing 3DCNN approaches for detecting deepfakes.",
                    "Towards a visual Sign Language dataset for home care services.",
                    "Visual Saliency Detection guided by Neural Signals.",
                    "Image-based Pose Representation for Action Recognition and Hand Gesture Recognition.",
                    "Estimation of Orofacial Kinematics in Parkinson's Disease: Comparison of 2D and 3D Markerless Systems for Motion Tracking.",
                    "Emotion or expressivity? An automated analysis of nonverbal perception in a social dilemma.",
                    "Video2Report: A Video Database for Automatic Reporting of Medical Consultancy Sessions.",
                    "Nonverbal Behavioral Patterns Predict Social Rejection Elicited Aggression.",
                    "Mood Versus Identity: Studying the Influence of Affective States on Mobile Biometrics.",
                    "A Computational View of the Emotional Regulation of Disgust using Multimodal Sensors.",
                    "iSAM: Personalizing an Artificial Intelligence Model for Emotion with Pleasure-Arousal-Dominance in Immersive Virtual Reality.",
                    "Multimodal Fusion of Physiological Signals and Facial Action Units for Pain Recognition.",
                    "Learning a Privacy-Preserving Global Feature Set for Mood Classification Using Smartphone Activity and Sensor Data.",
                    "Summarizing Driving Behavior to Support Driver Stress Analysis.",
                    "Multitask Emotion Recognition with Incomplete Labels.",
                    "Two-Stream Aural-Visual Affect Analysis in the Wild.",
                    "Latent-Based Adversarial Neural Networks for Facial Affect Estimations.",
                    "Multi-modal Sequence-to-sequence Model for Continuous Affect Prediction in the Wild Using Deep 3D Features.",
                    "Facial Expression Recognition for In-the-wild Videos.",
                    "Unique Class Group Based Multi-Label Balancing Optimizer for Action Unit Detection.",
                    "Affective Expression Analysis in-the-wild using Multi-Task Temporal Statistical Deep Learning Model.",
                    "Multi-modal Expression Recognition in the Wild Using Sequence Modeling.",
                    "M3F: Multi-Modal Continuous Valence-Arousal Estimation in the Wild.",
                    "Analysing Affective Behavior in the First ABAW 2020 Competition.",
                    "How are you feeling? Multimodal Emotion Learning for Socially-Assistive Robot Navigation.",
                    "The FaceChannel: A Light-weight Deep Neural Network for Facial Expression Recognition.",
                    "A weightless regression system for predicting multi-modal empathy.",
                    "Vision-based Individual Factors Acquisition for Thermal Comfort Assessment in a Built Environment.",
                    "Impairments in decoding facial and vocal emotional expressions in high functioning autistic adults and adolescents.",
                    "Introduction and Analysis of an Event-Based Sign Language Dataset.",
                    "Feature Selection for Zero-Shot Gesture Recognition.",
                    "SILFA: Sign Language Facial Action Database for the Development of Assistive Technologies for the Deaf.",
                    "Explainable Early Stopping for Action Unit Recognition.",
                    "FineHand: Learning Hand Shapes for American Sign Language Recognition.",
                    "Spectral Correspondence Framework for Building a 3D Baby Face Model.",
                    "Seniors' ability to decode differently aged facial emotional expressions.",
                    "The MAGIC of E-Health: A Gesture-Based Approach to Estimate Understanding and Performance in Remote Ultrasound Tasks.",
                    "Automatic stress detection evaluating models of facial action units.",
                    "Spatio-temporal fusion for Macro- and Micro-expression Spotting in Long Video Sequences.",
                    "Spotting Macro-and Micro-expression Intervals in Long Video Sequences.",
                    "Local Bilinear Convolutional Neural Network for Spotting Macro- and Micro-expression Intervals in Long Video Sequences.",
                    "Typical and Reverse Other-Race Effect on Tibetan Students' Emotional Face Recognition.",
                    "The Ability to Recognize Microexpression and Detect Deception in the Elderly.",
                    "Adaptive Mask for Region-based Facial Micro-Expression Recognition.",
                    "SAMM Long Videos: A Spontaneous Facial Micro- and Macro-Expressions Dataset.",
                    "MEGC2020 - The Third Facial Micro-Expression Grand Challenge.",
                    "Using Deep 3D Features and an LSTM Based Sequence Model for Automatic Pain Detection in the Wild.",
                    "Exploring Multidimensional Measurements for Pain Evaluation using Facial Action Units.",
                    "Automatic Pain Detection on Horse and Donkey Faces.",
                    "ChaLearn LAP 2020 Challenge on Identity-preserved Human Detection: Dataset and Results.",
                    "Noise Robust Hard Example Mining for Human Detection with Efficient Depth-Thermal Fusion.",
                    "Multimodality Pain and related Behaviors Recognition based on Attention Learning.",
                    "LSTM-DNN based Approach for Pain Intensity and Protective Behaviour Prediction.",
                    "ALANet: Autoencoder-LSTM for pain and protective behaviour detection.",
                    "A Curriculum Learning Approach for Pain Intensity Recognition from Facial Expressions.",
                    "Automatic Recognition of Low-Back Chronic Pain Level and Protective Movement Behaviour using Physical and Muscle Activity Information.",
                    "Three-level Training of Multi-Head Architecture for Pain Detection.",
                    "Multimodal Multilevel Fusion for Sequential Protective Behavior Detection and Pain Estimation.",
                    "EMOPAIN Challenge 2020: Multimodal Pain Evaluation from Facial and Bodily Expressions.",
                    "Recognizing Families In the Wild (RFIW): The 4th Edition.",
                    "A Multi-Task Comparator Framework for Kinship Verification.",
                    "Challenge report Recognizing Families In the Wild Data Challenge.",
                    "Achieving Better Kinship Recognition Through Better Baseline.",
                    "Multi-view Deep Features for Robust Facial Kinship Verification.",
                    "Retrieval of Family Members Using Siamese Neural Network.",
                    "Recognizing Families through Images with Pretrained Encoder.",
                    "Deep Fusion Siamese Network for Automatic Kinship Verification.",
                    "Two-stage Recognition and Beyond for Compound Facial Emotion Recognition.",
                    "Challenge report: Compound Emotion challenge.",
                    "Multimodal(Audio, Facial and Gesture) based Emotion Recognition challenge.",
                    "Two Stage Emotion Recognition using Frame-level and Video-level Features.",
                    "Real-time Action Unit Intensity Detection.",
                    "Sign Language Recognition in Virtual Reality.",
                    "ReenactNet: Real-time Full Head Reenactment.",
                    "Understanding consumer attention on mobile devices."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "14th FG 2019",
        "info": "Lille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2019",
                "sub_name": "14th IEEE International Conference on Automatic Face & Gesture Recognition, FG 2019, Lille, France, May 14-18, 2019.",
                "count": 119,
                "papers": [
                    "Large Scale Sign Language Interpretation.",
                    "Photo-Realistic Exemplar-Based Face Ageing.",
                    "Characterization of the Handwriting Skills as a Biomarker for Parkinson's Disease.",
                    "Automated Measurement of Head Movement Synchrony during Dyadic Depression Severity Interviews.",
                    "FaceSurv: A Benchmark Video Dataset for Face Detection and Recognition Across Spectra and Resolutions.",
                    "Domain Adaptation based Topic Modeling Techniques for Engagement Estimation in the Wild.",
                    "Skeleton-Based Hand Gesture Recognition by Learning SPD Matrices with Neural Networks.",
                    "Analyze Spontaneous Gestures for Emotional Stress State Recognition: A Micro-gesture Dataset and Analysis with Deep Learning.",
                    "Your Fellows Matter: Affect Analysis across Subjects in Group Videos.",
                    "Boundary-sensitive Network for Portrait Segmentation.",
                    "Performance Analysis of Unimodal and Multimodal Models in Valence-Based Empathy Recognition.",
                    "Fast Facial Image Analogy with Spatial Guidance.",
                    "Representation Learning Through Cross-Modality Supervision.",
                    "When Computers Decode your Social Intention.",
                    "Fusion of Hand-crafted and Deep Features for Empathy Prediction.",
                    "LPM: Learnable Pooling Module for Efficient Full-Face Gaze Estimation.",
                    "Discriminative Attention-based Convolutional Neural Network for 3D Facial Expression Recognition.",
                    "Active Authentication using an Autoencoder regularized CNN-based One-Class Classifier.",
                    "The Deeper, the Better: Analysis of Person Attributes Recognition.",
                    "Matching Thermal to Visible Face Images Using a Semantic-Guided Generative Adversarial Network.",
                    "Kinship Verification using Deep Siamese Convolutional Neural Network.",
                    "Toward Automated Classroom Observation: Predicting Positive and Negative Climate.",
                    "Analyzing group performance in small group interaction: Linking personality traits and group performance through the verbal content.",
                    "Towards a Multimodal Time-Based Empathy Prediction System.",
                    "The Ingroup Disadvantage in the Recognition of Micro-Expressions.",
                    "MAGIC: A Fundamental Framework for Gesture Representation, Comparison and Assessment.",
                    "Hand range of motion evaluation for Rheumatoid Arthritis patients.",
                    "A CNN Model for Head Pose Recognition using Wholes and Regions.",
                    "Tree-gated Deep Regressor Ensemble For Face Alignment In The Wild.",
                    "Simultaneous Adversarial Training - Learn from Others' Mistakes.",
                    "Learning to Detect Genuine versus Posed Pain from Facial Expressions using Residual Generative Adversarial Networks.",
                    "A Boost in Revealing Subtle Facial Expressions: A Consolidated Eulerian Framework.",
                    "Segmentation Guided Image-to-Image Translation with Adversarial Networks.",
                    "Cross-domain AU Detection: Domains, Learning Approaches, and Measures.",
                    "CapsuleNet for Micro-Expression Recognition.",
                    "Characterizing the State of Apathy with Facial Expression and Motion Analysis.",
                    "Exploring Features and Attributes in Deep Face Recognition Using Visualization Techniques.",
                    "Revisiting a single-stage method for face detection.",
                    "Database of Gesture Attributes: Zero Shot Learning for Gesture Recognition.",
                    "Are You Speaking: Real-Time Speech Activity Detection via Landmark Pooling Network.",
                    "Visual Scene-aware Hybrid Neural Network Architecture for Video-based Facial Expression Recognition.",
                    "GF-CapsNet: Using Gabor Jet and Capsule Networks for Facial Age, Gender, and Expression Recognition.",
                    "Group Emotion Recognition in Adverse Face Detection.",
                    "Robust Remote Heart Rate Estimation from Face Utilizing Spatial-temporal Attention.",
                    "Extended Gaze Following: Detecting Objects in Videos Beyond the Camera Field of View.",
                    "Learning Temporal Information From A Single Image For AU Detection.",
                    "Heatmap-Guided Balanced Deep Convolution Networks for Family Classification in the Wild.",
                    "Facial Expression Editing with Continuous Emotion Labels.",
                    "Deep Conditional Variational Estimation for Depth-Based Hand Poses.",
                    "The Many Variations of Emotion.",
                    "Robust Video Face Recognition From a Single Still Using a Synthetic Plus Variational Model.",
                    "Face and Emotion Recognition with Neural Networks on Mobile Devices: Practical Implementation on Different Platforms.",
                    "Improving Face Sketch Recognition via Adversarial Sketch-Photo Transformation.",
                    "Learning Interpretable Expression-sensitive Features for 3D Dynamic Facial Expression Recognition.",
                    "Towards Facial Expression Analysis in a Driver Assistance System.",
                    "Advanced Motion-Tracking System with Multi-Layers Deep Learning Framework for Innovative Car-Driver Drowsiness Monitoring.",
                    "Shallow Triple Stream Three-dimensional CNN (STSTNet) for Micro-expression Recognition.",
                    "Combining Global and Local Convolutional 3D Networks for Detecting Depression from Facial Expressions.",
                    "shallowCNN-LE: A shallow CNN with Laplacian Embedding for face anti-spoofing.",
                    "Equipping social robots with culturally-sensitive facial expressions of emotion using data-driven methods.",
                    "Facial Expression Recognition Using Deep Siamese Neural Networks with a Supervised Loss function.",
                    "Multi-task human analysis in still images: 2D/3D pose, depth map, and multi-part segmentation.",
                    "Hierarchical Group-level Emotion Recognition in the Wild.",
                    "Deformable Face Net: Learning Pose Invariant Feature with Pose Aware Feature Alignment for Face Recognition.",
                    "Real-time Hand Gesture Detection and Classification Using Convolutional Neural Networks.",
                    "A Multimodal LSTM for Predicting Listener Empathic Responses Over Time.",
                    "Hand Gesture Recognition using Deep Root Nodal Architecture (DRONA).",
                    "Dual-Inception Network for Cross-Database Micro-Expression Recognition.",
                    "Expression Empowered ResiDen Network for Facial Action Unit Detection.",
                    "MobiFace: A Novel Dataset for Mobile Face Tracking in the Wild.",
                    "LRW-1000: A Naturally-Distributed Large-Scale Benchmark for Lip Reading in the Wild.",
                    "A Neural Micro-Expression Recognizer.",
                    "Encoding Visual Behaviors with Attentive Temporal Convolution for Depression Prediction.",
                    "Video Prediction with Bidirectional Constraint Network.",
                    "Attribute-Guided Sketch Generation.",
                    "Bounded Residual Gradient Networks (BReG-Net) for Facial Affect Computing.",
                    "Micro-expression detection in long videos using optical flow and recurrent neural networks.",
                    "Improving Viseme Recognition with GAN-based Muti-view Mapping.",
                    "Stacked Hourglass Network Joint with Salient Region Attention Refinement for Face Alignment.",
                    "Modeling and Synthesizing Idiopathic Facial Paralysis.",
                    "Driver Gaze Zone Dataset With Depth Data.",
                    "DroneSURF: Benchmark Dataset for Drone-based Face Recognition.",
                    "Pain Expression Recognition Using Occluded Faces.",
                    "On the effect of age perception biases for real age regression.",
                    "Generalizing to Unseen Head Poses in Facial Expression Recognition and Action Unit Intensity Estimation.",
                    "Estimation of Missing Human Body Parts Via Bidirectional LSTM.",
                    "Learning Discriminative and Complementary Patches for Face Recognition.",
                    "Audio-Visual Emotion Forecasting: Characterizing and Predicting Future Emotion Using Deep Learning.",
                    "G2-VER: Geometry Guided Model Ensemble for Video-based Facial Expression Recognition.",
                    "Event-based Visual Gesture Recognition with Background Suppression running on a smart-phone.",
                    "Social Relationship Recognition Based on A Hybrid Deep Neural Network.",
                    "Coarse to Fine 3D Face Reconstruction from Single Image.",
                    "Discovering Identity Specific Activation Patterns in Deep Descriptors for Template Based Face Recognition.",
                    "Improving Head Pose Estimation with a Combined Loss and Bounding Box Margin Adjustment.",
                    "FCSR-GAN: End-to-end Learning for Joint Face Completion and Super-resolution.",
                    "Reparameterising 3D Statistical Shape Models.",
                    "Self-Supervised Learning of Face Representations for Video Face Clustering.",
                    "Facial Action Unit Analysis through 3D Point Cloud Neural Networks.",
                    "MEGC 2019 - The Second Facial Micro-Expressions Grand Challenge.",
                    "Towards an EmoCog Model for Multimodal Empathy Prediction.",
                    "Deformable Synthesis Model for Emotion Recognition.",
                    "A Graph-Structured Representation with BRNN for Static-based Facial Expression Recognition.",
                    "Local Feature Tensor Based Deep Learning for 3D Face Recognition.",
                    "2D Landmark-Based Facial Asymmetry Assessment in the Clinical Case of Facial Paralysis.",
                    "Time-series Clustering with Jointly Learning Deep Representations, Clusters and Temporal Boundaries.",
                    "Valence and Arousal Estimation In-The-Wild with Tensor Methods.",
                    "AutoRate: How attentive is the driver?",
                    "Integrating Facial Images, Speeches and Time for Empathy Prediction.",
                    "Analysis of temporal alignment for Video Classification.",
                    "AFAR: A Deep Learning Based Tool for Automated Facial Affect Recognition.",
                    "Affect-driven Learning Outcomes Prediction in Intelligent Tutoring Systems.",
                    "DemogPairs: Quantifying the Impact of Demographic Imbalance in Deep Face Recognition.",
                    "Spotting Micro-Expressions on Long Videos Sequences.",
                    "Kinship Verification based Deep and Tensor Features through Extreme Learning Machine.",
                    "Improving in-car emotion classification by NIR database augmentation.",
                    "Multimodal Deep Feature Aggregation for Facial Action Unit Recognition using Visible Images and Physiological Signals.",
                    "Fully End-to-End Composite Recurrent Convolution Network for Deformable Facial Tracking In The Wild.",
                    "IdenNet: Identity-Aware Facial Action Unit Detection.",
                    "Using Photorealistic Face Synthesis and Domain Adaptation to Improve Facial Expression Analysis."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "13th FG 2018",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2018",
                "sub_name": "13th IEEE International Conference on Automatic Face & Gesture Recognition, FG 2018, Xi'an, China, May 15-19, 2018.",
                "count": 121,
                "papers": [
                    "One-Shot Face Recognition via Generative Learning.",
                    "RGB-D Face Recognition via Deep Complementary and Common Feature Learning.",
                    "Visualizing and Quantifying Discriminative Features for Face Recognition.",
                    "Automatic 4D Facial Expression Recognition Using Dynamic Geometrical Image Network.",
                    "Unsupervised Domain Adaptation with Regularized Optimal Transport for Multimodal 2D+3D Facial Expression Recognition.",
                    "Biomechanical-Based Approach to Data Augmentation for One-Shot Gesture Recognition.",
                    "Kinematic Constrained Cascaded Autoencoder for Real-Time Hand Pose Estimation.",
                    "Large-Scale Isolated Gesture Recognition Using a Refined Fused Model Based on Masked Res-C3D Network and Skeleton LSTM.",
                    "OpenFace 2.0: Facial Behavior Analysis Toolkit.",
                    "VGGFace2: A Dataset for Recognising Faces across Pose and Age.",
                    "Morphable Face Models - An Open Framework.",
                    "High-Quality Facial Photo-Sketch Synthesis Using Multi-Adversarial Networks.",
                    "Symmetric Shape Morphing for 3D Face and Head Modelling.",
                    "On Face Segmentation, Face Swapping, and Face Perception.",
                    "Deep Learning for Hand Gesture Recognition on Skeletal Data.",
                    "Learning to Recognize Touch Gestures: Recurrent vs. Convolutional Features and Dynamic Sampling.",
                    "ExpNet: Landmark-Free, Deep, 3D Facial Expressions.",
                    "Cross-Generating GAN for Facial Identity Preserving.",
                    "Unsupervised Learning of Face Representations.",
                    "Kinship Classification through Latent Adaptive Subspace.",
                    "Automatic Detection of Amyotrophic Lateral Sclerosis (ALS) from Video-Based Analysis of Facial Movements: Speech and Non-Speech Tasks.",
                    "Human Behaviour-Based Automatic Depression Analysis Using Hand-Crafted Statistics and Deep Learned Spectral Features.",
                    "Harnessing Label Uncertainty to Improve Modeling: An Application to Student Engagement Recognition.",
                    "Edge Convolutional Network for Facial Action Intensity Estimation.",
                    "Perceptual Facial Expression Representation.",
                    "Facial Action Unit Recognition Augmented by Their Dependencies.",
                    "Generative Multimodal Models of Nonverbal Synchrony in Close Relationships.",
                    "The What, When, and Why of Facial Expressions: An Objective Analysis of Conversational Skills in Speed-Dating Videos.",
                    "Face Alignment across Large Pose via MT-CNN Based 3D Shape Reconstruction.",
                    "Deep and Deformable: Convolutional Mixtures of Deformable Part-Based Models.",
                    "Enhancing Interior and Exterior Deep Facial Features for Face Detection in the Wild.",
                    "PersonRank: Detecting Important People in Images.",
                    "The OBF Database: A Large Face Video Database for Remote Physiological Signal Measurement and Atrial Fibrillation Detection.",
                    "Deep Multimodal Pain Recognition: A Database and Comparison of Spatio-Temporal Visual Modalities.",
                    "Face Verification: Strategies for Employing Deep Models.",
                    "Emotion-Preserving Representation Learning via Generative Adversarial Network for Multi-View Facial Expression Recognition.",
                    "Task Specific Networks for Identity and Face Variation.",
                    "Context-Sensitive Prediction of Facial Expressivity Using Multimodal Hierarchical Bayesian Neural Networks.",
                    "Spotting the Details: The Various Facets of Facial Expressions.",
                    "Identity-Adaptive Facial Expression Recognition through Expression Regeneration Using Conditional Generative Adversarial Networks.",
                    "Island Loss for Learning Discriminative Features in Facial Expression Recognition.",
                    "An Empirical Study of Face Recognition under Variations.",
                    "Attributes in Multiple Facial Images.",
                    "Versatile Model for Activity Recognition: Sequencelet Corpus Model.",
                    "Energy and Computation Efficient Audio-Visual Voice Activity Detection Driven by Event-Cameras.",
                    "Predicting Body Movement and Recognizing Actions: An Integrated Framework for Mutual Benefits.",
                    "A Study on the Suppression of Amusement.",
                    "Say CHEESE: Common Human Emotional Expression Set Encoder and Its Application to Analyze Deceptive Communication.",
                    "Facial Expression Grounded Conversational Dialogue Generation.",
                    "A Multi-Task Cascaded Network for Prediction of Affect, Personality, Mood and Social Context Using EEG Signals.",
                    "Letter-Level Writer Identification.",
                    "Online Attention for Interpretable Conflict Estimation in Political Debates.",
                    "Rich Convolutional Features Fusion for Crowd Counting.",
                    "Cascade Multi-View Hourglass Model for Robust 3D Face Alignment.",
                    "A Data-Augmented 3D Morphable Model of the Ear.",
                    "Expressive Speech-Driven Lip Movements with Multitask Learning.",
                    "Deep Transfer Network with 3D Morphable Models for Face Recognition.",
                    "Hand-Crafted Feature Guided Deep Learning for Facial Expression Recognition.",
                    "A Parametric Freckle Model for Faces.",
                    "What Is the Challenge for Deep Learning in Unconstrained Face Recognition?",
                    "Barycentric Representation and Metric Learning for Facial Expression Recognition.",
                    "Reverse Engineering Psychologically Valid Facial Expressions of Emotion into Social Robots.",
                    "Deep Unsupervised Domain Adaptation for Face Recognition.",
                    "Multi-Channel Pose-Aware Convolution Neural Networks for Multi-View Facial Expression Recognition.",
                    "Accurate Facial Parts Localization and Deep Learning for 3D Facial Expression Recognition.",
                    "Eigen-Evolution Dense Trajectory Descriptors.",
                    "Improve Accurate Pose Alignment and Action Localization by Dense Pose Estimation.",
                    "Toward Marker-Free 3D Pose Estimation in Lifting: A Deep Multi-View Solution.",
                    "Linear and Non-Linear Multimodal Fusion for Continuous Affect Estimation In-the-Wild.",
                    "Detecting Decision Ambiguity from Facial Images.",
                    "Predicting Folds in Poker Using Action Unit Detectors and Decision Trees.",
                    "A New Computational Approach to Identify Human Social Intention in Action.",
                    "An Immersive System with Multi-Modal Human-Computer Interaction.",
                    "Clinical Valid Pain Database with Biomarker and Visual Information for Pain Level Analysis.",
                    "Toward Visual Behavior Markers of Suicidal Ideation.",
                    "Semi-Supervised Learning for Monocular Gaze Redirection.",
                    "Head Pose Estimation on Low-Quality Images.",
                    "LCANet: End-to-End Lipreading with Cascaded Attention-CTC.",
                    "HeadNet: Pedestrian Head Detection Utilizing Body in Context.",
                    "Hands on the wheel: A Dataset for Driver Hand Detection and Tracking.",
                    "Analysis of Yawning Behaviour in Spontaneous Expressions of Drowsy Drivers.",
                    "Continuous Real-Time Vehicle Driver Authentication Using Convolutional Neural Network Based Face Recognition.",
                    "Towards Understanding Emotional Reactions of Driver-Passenger Dyads in Automated Driving.",
                    "Predicting When Teachers Look at Their Students in 1-on-1 Tutoring Sessions.",
                    "A Multi-View Learning Approach to Deception Detection.",
                    "Analyzing the Impact of Gender on the Automation of Feedback for Public Speaking.",
                    "Visual Tracking Based on Cooperative Model.",
                    "Changes in Facial Expression as Biometric: A Database and Benchmarks of Identification.",
                    "Investigating Deep Neural Forests for Facial Expression Recognition.",
                    "LTP-ML: Micro-Expression Detection by Recognition of Local Temporal Pattern of Facial Movements.",
                    "Objective Micro-Facial Movement Detection Using FACS-Based Regions and Baseline Evaluation.",
                    "Micro-Expression Motion Magnification: Global Lagrangian vs. Local Eulerian Approaches.",
                    "From Macro to Micro Expression Recognition: Deep Learning on Small Datasets Using Transfer Learning.",
                    "Facial Micro-Expressions Grand Challenge 2018: Evaluating Spatio-Temporal Features for Classification of Objective Classes.",
                    "Enriched Long-Term Recurrent Convolutional Network for Facial Micro-Expression Recognition.",
                    "Facial Micro-Expressions Grand Challenge 2018 Summary.",
                    "Smile Detection in the Wild Based on Transfer Learning.",
                    "A Dyadic Conversation Dataset on Moral Emotions.",
                    "Leveraging Large Face Recognition Data for Emotion Classification.",
                    "Multifaceted Engagement in Social Interaction with a Machine: The JOKER Project.",
                    "Non-Contact Reflectance Photoplethysmography: Progress, Limitations, and Myths.",
                    "Head Movements in Context of Speech during Stress Induction.",
                    "Deep Learned Cumulative Attribute Regression.",
                    "JEMImE: A Serious Game to Teach Children with ASD How to Adequately Produce Facial Expressions.",
                    "A Quantitative Comparison of Methods for 3D Face Reconstruction from 2D Images.",
                    "Detecting Depression Severity by Interpretable Representations of Motion Dynamics.",
                    "Convolutional Neural Network-Based Video Super-Resolution for Action Recognition.",
                    "GLADNet: Low-Light Enhancement Network with Global Awareness.",
                    "Contextual Weighting of Patches for Local Matching in Still-to-Video Face Recognition.",
                    "SDM: Semantic Distortion Measurement for Video Encryption.",
                    "Survey of Face Detection on Low-Quality Images.",
                    "Landmark-Based 3D Face Reconstruction from an Arbitrary Number of Unconstrained Images.",
                    "Evaluation of Dense 3D Reconstruction from 2D Face Images in the Wild.",
                    "Real-Time Emotion Recognition on Mobile Devices.",
                    "Fast Face and Saliency Aware Collage Creation for Mobile Phones.",
                    "Human Computer Interaction with Head Pose, Eye Gaze and Body Gestures.",
                    "Attention Based Residual Network for Micro-Gesture Recognition.",
                    "Holoscopic 3D Micro-Gesture Recognition Based on Fast Preprocessing and Deep Learning Techniques.",
                    "Holoscopic 3D Micro-Gesture Database for Wearable Device Interaction.",
                    "Hybrid Neural Networks Based Approach for Holoscopic Micro-Gesture Recognition in Images and Videos.",
                    "Classification of Holoscopic 3D Micro-Gesture Images and Videos."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "12th FG 2017",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2017",
                "sub_name": "12th IEEE International Conference on Automatic Face & Gesture Recognition, FG 2017, Washington, DC, USA, May 30 - June 3, 2017.",
                "count": 143,
                "papers": [
                    "Template Adaptation for Face Verification and Identification.",
                    "LDF-Net: Learning a Displacement Field Network for Face Recognition across Pose.",
                    "An All-In-One Convolutional Neural Network for Face Analysis.",
                    "Learning Spatial and Temporal Cues for Multi-Label Facial Action Unit Detection.",
                    "What Will Your Future Child Look Like? Modeling and Synthesis of Hereditary Patterns of Facial Dynamics.",
                    "Local Shape Spectrum Analysis for 3D Facial Expression Recognition.",
                    "Eliminating Physiological Information from Facial Videos.",
                    "PPGSecure: Biometric Presentation Attack Detection Using Photopletysmograms.",
                    "The Impact of Video Compression on Remote Cardiac Pulse Measurement Using Imaging Photoplethysmography.",
                    "Color-Distortion Filtering for Remote Photoplethysmography.",
                    "Small Sample Deep Learning for Newborn Gestational Age Estimation.",
                    "Apparent and Real Age Estimation in Still Images with Deep Residual Regressors on Appa-Real Database.",
                    "Fast, Dense Feature SDM on an iPhone.",
                    "EAC-Net: A Region-Based Deep Enhancing and Cropping Approach for Facial Action Unit Detection.",
                    "Self-Error-Correcting Convolutional Neural Network for Learning with Noisy Labels.",
                    "FaceNet2ExpNet: Regularizing a Deep Face Recognition Net for Expression Recognition.",
                    "A Joint Discriminative Generative Model for Deformable Model Construction and Classification.",
                    "Multi-Output Random Forests for Facial Action Unit Detection.",
                    "A Feedback Estimation Approach for Therapeutic Facial Training.",
                    "Video-Based Face Association and Identification.",
                    "Ordinal Deep Feature Learning for Facial Age Estimation.",
                    "Nested Shallow CNN-Cascade for Face Detection in the Wild.",
                    "Deep Multi-Task Learning for Joint Prediction of Heterogeneous Face Attributes.",
                    "Automatic Semantic Face Recognition.",
                    "Learning Deep Features for Hierarchical Classification of Mobile Phone Face Datasets in Heterogeneous Environments.",
                    "Fast k-Nearest Neighbor Search for Face Identification Using Bounds of Residual Score.",
                    "A Fully End-to-End Cascaded CNN for Facial Landmark Detection.",
                    "Towards Estimating the Upper Bound of Visual-Speech Recognition: The Visual Lip-Reading Feasibility Database.",
                    "Kinship Verification on Families in the Wild with Marginalized Denoising Metric Learning.",
                    "EPAT: Euclidean Perturbation Analysis and Transform - An Agnostic Data Adaptation Framework for Improving Facial Landmark Detectors.",
                    "Occlusion Aware Hand Pose Recovery from Sequences of Depth Images.",
                    "Gesture Recognition Using Enhanced Depth Motion Map and Static Pose Map.",
                    "Sequential Subspace Clustering via Temporal Smoothness.",
                    "A Coupled Encoder-Decoder Network for Joint Face Detection and Landmark Localization.",
                    "KEPLER: Keypoint and Pose Estimation of Unconstrained Faces by Learning Efficient H-CNN Regressors.",
                    "Multi-Task Convolutional Neural Network for Patient Detection and Skin Segmentation in Continuous Non-Contact Vital Sign Monitoring.",
                    "Non-Contact Simultaneous Photoplethysmogram and Ballistocardiogram Video Recording towards Real-Time Blood Pressure and Abnormal Heart Rhythm Monitoring.",
                    "Non-Contact Vital Sign Monitoring in the Clinic.",
                    "Non-Contact Monitoring of Respiration in the Neonatal Intensive Care Unit.",
                    "A Proximity-Aware Hierarchical Clustering of Faces.",
                    "Exploiting feature Representations Through Similarity Learning and Ranking Aggregation for Person Re-identification.",
                    "Assessing Public Speaking Ability from Thin Slices of Behavior.",
                    "BoxFlow: Unsupervised Face Detector Adaptation from Images to Videos.",
                    "Rule-Based Facial Makeup Recommendation System.",
                    "Fusion of Valence and Arousal Annotations through Dynamic Subjective Ordinal Modelling.",
                    "Large-scale Affective Content Analysis: Combining Media Content Features and Facial Reactions.",
                    "Extreme Value Analysis for Mobile Active User Authentication.",
                    "Towards Multiple User Active Authentication in Mobile Devices.",
                    "An Online Tool for the Annotation of 3D Models.",
                    "Large Margin Multi-Modal Triplet Metric Learning.",
                    "Evaluation of Automated Identity Masking Method (AIM) in Naturalistic Driving Study (NDS).",
                    "Multi-attribute Residual Network (MAResNet) for Soft-Biometrics Recognition in Surveillance Scenarios.",
                    "Estimating Sheep Pain Level Using Facial Action Unit Detection.",
                    "Computer Analysis of Sentiment Interpretation in Musical Conducting.",
                    "3D Hand-Object Pose Estimation from Depth with Convolutional Neural Networks.",
                    "EGGNOG: A Continuous, Multi-modal Data Set of Naturally Occurring Gestures with Ground Truth Labels.",
                    "Modout: Learning Multi-Modal Architectures by Stochastic Regularization.",
                    "Recognizing Words from Gestures: Discovering Gesture Descriptors Associated with Spoken Utterances.",
                    "Pose for Action - Action for Pose.",
                    "Deep Refinement Convolutional Networks for Human Pose Estimation.",
                    "Human Postural Sway Estimation from Noisy Observations.",
                    "3D Multistroke Mapping (3DMM): Transfer of Hand-Drawn Pattern Representation for Skeleton-Based Gesture Recognition.",
                    "Recurrent Human Pose Estimation.",
                    "A Survey on Deep Learning Based Approaches for Action and Gesture Recognition in Image Sequences.",
                    "Seeing Skin in Reduced Coordinates.",
                    "Temporal Archetypal Analysis for Action Segmentation.",
                    "The DAily Home LIfe Activity Dataset: A High Semantic Activity Dataset for Online Recognition.",
                    "Curriculum Learning for Facial Expression Recognition.",
                    "Generic to Specific Recognition Models for Membership Analysis in Group Videos.",
                    "Predicting First Impressions with Deep Learning.",
                    "Group Activity Recognition with Differential Recurrent Convolutional Neural Networks.",
                    "Clothing and People - A Social Signal Processing Perspective.",
                    "Lend Me a Hand: Auxiliary Image Data Helps Interaction Detection.",
                    "Noisy Face Image Sets Refining Collaborated with Discriminant Feature Space Learning.",
                    "A Quantum Probability Inspired Framework for Image-Set Based Face Identification.",
                    "Identity-Aware Convolutional Neural Network for Facial Expression Recognition.",
                    "A Study of Convolutional Sparse Feature Learning for Human Age Estimate.",
                    "Head Pose and Expression Transfer Using Facial Status Score.",
                    "Sayette Group Formation Task (GFT) Spontaneous Facial Expression Database.",
                    "3D Facial Geometric Attributes Based Anti-Spoofing Approach against Mask Attacks.",
                    "Unleash the Black Magic in Age: A Multi-Task Deep Neural Network Approach for Cross-Age Face Verification.",
                    "Rapid Synthesis of Massive Face Sets for Improved Face Recognition.",
                    "OULU-NPU: A Mobile Face Presentation Attack Database with Real-World Variations.",
                    "Robust Facial Landmark Localization Using LBP Histogram Correlation Based Initialization.",
                    "Deformable Models of Ears in-the-Wild for Alignment and Recognition.",
                    "Pooling Facial Segments to Face: The Shallow and Deep Ends.",
                    "Joint Head Pose Estimation and Face Alignment Framework Using Global and Local CNN Features.",
                    "Face Detection with the Faster R-CNN.",
                    "Apathy Is the Root of All Expressions.",
                    "Local-Global Landmark Confidences for Face Recognition.",
                    "Face and Image Representation in Deep CNN Features.",
                    "Fusing Multilabel Deep Networks for Facial Action Unit Detection.",
                    "Fusing Deep Learned and Hand-Crafted Features of Appearance, Shape, and Dynamics for Automatic Pain Estimation.",
                    "Constrained Ensemble Initialization for Facial Landmark Tracking in Video.",
                    "A Cross Benchmark Assessment of a Deep Convolutional Neural Network for Face Recognition.",
                    "Robust and Accurate 3D Head Pose Estimation through 3DMM and Online Head Model Reconstruction.",
                    "Historical Heterogeneity Predicts Smiling: Evidence from Large-Scale Observational Analyses.",
                    "Implicit Media Tagging and Affect Prediction from RGB-D Video of Spontaneous Facial Expressions.",
                    "Five Principles for Crowd-Source Experiments in Face Recognition.",
                    "Improving Children's Gaze Prediction via Separate Facial Areas and Attention Shift Cue.",
                    "What Makes a Gesture a Gesture? Neural Signatures Involved in Gesture Recognition.",
                    "A Video-Based Facial Behaviour Analysis Approach to Melancholia.",
                    "Automatic Detection of ADHD and ASD from Expressive Behaviour in RGBD Data.",
                    "Investigating Facial Behavior Indicators of Suicidal Ideation.",
                    "Supervised Learning of Gesture-Action Associations for Human-Robot Collaboration.",
                    "One-Shot Gesture Recognition: One Step Towards Adaptive Learning.",
                    "Spatio-Temporal Facial Expression Recognition Using Convolutional Neural Networks and Conditional Random Fields.",
                    "A Semantical & Analytical Approach for Zero Shot Gesture Learning.",
                    "A Simple Geometric-Based Descriptor for Facial Expression Recognition.",
                    "Joint Challenge on Dominant and Complementary Emotion Recognition Using Micro Emotion Features and Head-Pose Estimation: Databases.",
                    "Multi-modality Network with Visual and Geometrical Information for Micro Emotion Recognition.",
                    "Head Pose Estimation Based on 3-D Facial Landmarks Localization and Regression.",
                    "Automatic Hidden Sadness Detection Using Micro-Expressions.",
                    "Dominant and Complementary Multi-Emotional Facial Expression Recognition Using C-Support Vector Classification.",
                    "FERA 2017 - Addressing Head Pose in the Third Facial Expression Recognition and Analysis Challenge.",
                    "Multi View Facial Action Unit Detection Based on CNN and BLSTM-RNN.",
                    "Support Vector Regression of Sparse Dictionary-Based Features for View-Independent Action Unit Intensity Estimation.",
                    "Facial Action Units Detection with Multi-Features and -AUs Fusion.",
                    "AUMPNet: Simultaneous Action Units Detection and Intensity Estimation on Multipose Facial Images Using a Single Convolutional Neural Network.",
                    "Pose-Independent Facial Action Unit Intensity Regression Based on Multi-Task Deep Transfer Learning.",
                    "View-Independent Facial Action Unit Detection.",
                    "Heterogeneous Face Recognition: Recent Advances in Infrared-to-Visible Matching.",
                    "Cross-Modal Facial Attribute Recognition with Geometric Features.",
                    "Deep Network Shrinkage Applied to Cross-Spectrum Face Recognition.",
                    "On Matching Visible to Passive Infrared Face Images Using Image Synthesis & Denoising.",
                    "Lower Resolution Face Recognition in Surveillance Systems Using Discriminant Correlation Analysis.",
                    "Multi-level Feature Learning for Face Recognition under Makeup Changes.",
                    "Extended Spectral to Visible Comparison Based on Spectral Band Selection Method for Robust Face Recognition.",
                    "Foreword.",
                    "Learning CNNs for Face Recognition from Weakly Annotated Images.",
                    "Attention-Based Template Adaptation for Face Verification.",
                    "Learning Local Responses of Facial Landmarks with Conditional Variational Auto-Encoder for Face Alignment.",
                    "Age, Gender, and Fine-Grained Ethnicity Prediction Using Convolutional Neural Networks for the East Asian Face Dataset.",
                    "Metric-Promoted Siamese Network for Gender Classification.",
                    "Boosting-POOF: Boosting Part Based One vs One Feature for Facial Expression Recognition in the Wild.",
                    "Context-Aware Person Re-Identification in the Wild Via Fusion of Gait and Anthropometric Features.",
                    "Exploiting Data Redundancy for Error Detection in Degraded Biometric Signatures Resulting From in the Wild Environments.",
                    "Training Convolutional Neural Networks with Limited Training Data for Ear Recognition in the Wild.",
                    "Open-Source Software for Continuous Measurement and Media Annotation.",
                    "Gestural Interactions of Embodied Educational Technology Using One-Shot Machine Learning.",
                    "Monitoring Patients in the Wild.",
                    "Automatic Immersion of Brands in Videos.",
                    "Predicting First Impressions With Deep Learning."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "11th FG 2015",
        "info": "Ljubljana, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2015",
                "sub_name": "11th IEEE International Conference and Workshops on Automatic Face and Gesture Recognition, FG 2015, Ljubljana, Slovenia, May 4-8, 2015.",
                "count": 139,
                "papers": [
                    "Event detection: Ultra large-scale clustering of facial expressions.",
                    "Perinasal indicators of deceptive behavior.",
                    "Exploiting sparsity and co-occurrence structure for action unit recognition.",
                    "IntraFace.",
                    "Improved weak labels using contextual cues for person identification in videos.",
                    "Hierarchical 3D kernel descriptors for action recognition using depth sequences.",
                    "Triangular similarity metric learning for face verification.",
                    "The beauty of capturing faces: Rating the quality of digital portraits.",
                    "Block-wise constrained sparse graph for face image representation.",
                    "Discriminative low-rank metric learning for face recognition.",
                    "Hierarchical hybrid statistic based video binary code and its application to face retrieval in TV-series.",
                    "Automatic 3D facial expression recognition using geometric scattering representation.",
                    "Multiple feature representations from multi-layer geometric shape for hand gesture analysis.",
                    "Fast sign language recognition benefited from low rank approximation.",
                    "Shared representation learning for heterogenous face recognition.",
                    "Spontaneous facial expression analysis based on temperature changes and head motions.",
                    "Detecting bids for eye contact using a wearable camera.",
                    "Discriminative 3D morphable model fitting.",
                    "A hierarchical training and identification method using Gaussian process models for face recognition in videos.",
                    "Facial expression recognition under a wide range of head poses.",
                    "Human pose search using deep poselets.",
                    "Inference of personality traits and affect schedule by analysis of spontaneous reactions to affective videos.",
                    "Pairwise linear regression: An efficient and fast multi-view facial expression recognition.",
                    "Predicting video-conferencing conversation outcomes based on modeling facial expression synchronization.",
                    "Sparse low-rank fusion based deep features for missing modality face recognition.",
                    "Facial makeup detection technique based on texture and shape analysis.",
                    "Sports Videos in the Wild (SVW): A video dataset for sports analysis.",
                    "How much training data for facial action unit detection?",
                    "Three dimensional binary edge feature representation for pain expression analysis.",
                    "Joint regularized nearest points for image set based face recognition.",
                    "Three-dimensional head pose estimation in-the-wild.",
                    "A new hand representation based on kernels for hand posture recognition.",
                    "Dynamic facial expression recognition by joint static and multi-time gap transition classification.",
                    "Siamese neural network based similarity metric for inertial gesture classification and rejection.",
                    "Cross-cultural detection of depression from nonverbal behaviour.",
                    "Fully automated facial picture evaluation using high level attributes.",
                    "3D local derivative pattern for hyperspectral face recognition.",
                    "Multi-instance Hidden Markov Model for facial expression recognition.",
                    "Enhanced facial expression recognition by age.",
                    "Adaptive LPQ: An efficient descriptor for blurred face recognition.",
                    "Age estimation via unsupervised neural networks.",
                    "3D interaction design: Increasing the stimulus-response correspondence by using stereoscopic vision.",
                    "Robust gaze estimation based on adaptive fusion of multiple cameras.",
                    "Analyzing trajectories on Grassmann manifold for early emotion detection from depth videos.",
                    "Efficient and effective human action recognition in video through motion boundary description with a compact set of trajectories.",
                    "Exploration of the correlations of attributes and features in faces.",
                    "Lessons from collecting a million biometric samples.",
                    "A random forest approach to segmenting and classifying gestures.",
                    "Automated prediction and analysis of job interview performance: The role of what you say and how you say it.",
                    "Realistic inverse lighting from a single 2D image of a face, taken under unknown and complex lighting.",
                    "Play with me - Measuring a child's engagement in a social interaction.",
                    "Modeling transition patterns between events for temporal human action segmentation and classification.",
                    "Multi-view discriminant analysis with tensor representation and its application to cross-view gait recognition.",
                    "Multi-sensor system for driver's hand-gesture recognition.",
                    "Domain adaptive sparse representation-based classification.",
                    "On video based face recognition through adaptive sparse dictionary.",
                    "Hand detection in American Sign Language depth data using domain-driven random forest regression.",
                    "Speeding up 2D-warping for pose-invariant face recognition.",
                    "Variable-state latent conditional random fields for facial expression recognition and action unit detection.",
                    "Probabilistic nearest neighbor search for robust classification of face image sets.",
                    "Face recognition under pose variation with active shape model to adjust Gabor filter kernels and to correct feature extraction location.",
                    "Where is my friend? - Person identification in social networks.",
                    "Combining discriminative and model based approaches for hand pose estimation.",
                    "Dense 3D face alignment from 2D videos in real-time.",
                    "On the quantitative analysis of craniofacial asymmetry in 3D.",
                    "Expression robust 3D face recognition by matching multi-component local shape descriptors on the nasal and adjoining cheek regions.",
                    "Multi-level classification of emotional body expression.",
                    "Robust multimodal recognition via multitask multivariate low-rank representations.",
                    "Leveraging geometry and appearance cues for recognizing family photos.",
                    "Pose-invariant face recognition using 3D multi-depth generic elastic models.",
                    "Correcting radial and perspective distortion by using face shape information.",
                    "Supervised learning approach to remote heart rate estimation from facial videos.",
                    "The more the merrier: Analysing the affect of a group of people in images.",
                    "Action unit intensity estimation using hierarchical partial least squares.",
                    "To skip or not to skip? A dataset of spontaneous affective response of online advertising (SARA) for audience behavior analysis.",
                    "Prediction gradients for feature extraction and analysis from convolutional neural networks.",
                    "OuluVS2: A multi-view audiovisual database for non-rigid mouth motion analysis.",
                    "Report on the FG 2015 Video Person Recognition Evaluation.",
                    "FG2015 age progression evaluation.",
                    "Fine-grained evaluation on face detection in the wild.",
                    "The FG 2015 Kinship Verification in the Wild Evaluation.",
                    "Optical flow based lip reading using non rectangular ROI and head motion reduction.",
                    "Active nonrigid ICP algorithm.",
                    "A survey on mouth modeling and analysis for Sign Language recognition.",
                    "Perinasal indicators of malevolence.",
                    "3D interaction design: Increasing the stimulus-response correspondence by using stereoscopic vision.",
                    "Real-time dense 3D face alignment from 2D video with automatic facial action unit coding.",
                    "Controllable face privacy.",
                    "Semi-transparent mirror with hidden camera to assess human emotions.",
                    "A live video analytic system for affect analysis in public space.",
                    "3D face recognition utilizing a low-cost depth sensor.",
                    "Faces and thoughts: An empathic dairy.",
                    "Let me tell you about your personality!: Real-time personality prediction from nonverbal behavioural cues.",
                    "Who do you want to be? Real-time face swap.",
                    "Real-time facial character animation.",
                    "Foreword - Biometrics in the Wild 2015.",
                    "Real-time multi-view facial landmark detector learned by the structured output SVM.",
                    "Oscillating patterns based face antispoofing approach against video replay.",
                    "Location matters: A study of the effects of environment on facial recognition for biometric security.",
                    "Trial Somaliland voting register de-duplication using iris recognition.",
                    "A multi-perspective holistic approach to Kinship Verification in the Wild.",
                    "Face recognition in the wild with the Probabilistic Gabor-Fisher Classifier.",
                    "A reference-based framework for pose invariant face recognition.",
                    "Side-Information based Exponential Discriminant Analysis for face verification in the wild.",
                    "Towards context based affective computing introduction to the third international CBAR 2015 workshop.",
                    "The influence of context on emotion recognition in humans.",
                    "Detecting social context: A method for social event classification using naturalistic multimodal data.",
                    "Person-specific behavioural features for automatic stress detection.",
                    "A multi-level context-based modeling of engagement in Human-Robot Interaction.",
                    "Foreword - De-identification for Privacy Protection in Multimedia 2015.",
                    "An overview of face de-identification in still images and videos.",
                    "Controllable Face Privacy.",
                    "Distinguishable de-identified faces.",
                    "De-identifying facial images using projections on hyperspheres.",
                    "Speaker de-identification using diphone recognition and speech synthesis.",
                    "Secure JPEG scrambling enabling privacy in photo sharing.",
                    "Privacy in mini-drone based video surveillance.",
                    "Comparing categorical and dimensional ratings of emotional speech.",
                    "Pain assessment in infants: Towards spotting pain expression based on infants' facial strain.",
                    "An HMM-based speech-smile synthesis system: An approach for amusement synthesis.",
                    "Automatic affective dimension recognition from naturalistic facial expressions based on wavelet filtering and PLS regression.",
                    "Automatic 3D facial expression recognition using geometric and textured feature fusion.",
                    "Automatic gaze analysis in multiparty conversations based on Collective First-Person Vision.",
                    "Group-level arousal and valence recognition in static images: Face, body and context.",
                    "FERA 2014 chairs' welcome.",
                    "Facial Action Unit intensity prediction via Hard Multi-Task Metric Learning for Kernel Regression.",
                    "Cross-dataset learning and person-specific normalisation for automatic Action Unit detection.",
                    "Facial Action Units intensity estimation by the fusion of features with multi-kernel Support Vector Machine.",
                    "Discriminant multi-label manifold embedding for facial Action Unit detection.",
                    "Learning to combine local models for facial Action Unit detection.",
                    "Deep learning based FACS Action Unit occurrence and intensity estimation.",
                    "FERA 2015 - second Facial Expression Recognition and Analysis challenge.",
                    "3D hand shape analysis for palm and fingers identification.",
                    "Combined shape analysis of human poses and motion units for action segmentation and recognition.",
                    "Abnormal gait detection with RGB-D devices using joint motion history features.",
                    "Reconstructing high-resolution face models from Kinect depth sequences acquired in uncooperative contexts.",
                    "Human-object interaction recognition by learning the distances between the object and the skeleton joints.",
                    "Suitability of a low cost system for quantitative motion capture applications.",
                    "MSP-AVATAR corpus: Motion capture recordings to study the role of discourse functions in the design of intelligent virtual agents."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th FG 2013",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2013",
                "sub_name": "10th IEEE International Conference and Workshops on Automatic Face and Gesture Recognition, FG 2013, Shanghai, China, 22-26 April, 2013.",
                "count": 126,
                "papers": [
                    "Discriminative dictionary learning with low-rank regularization for face recognition.",
                    "Hierarchical hyperlingual-words for multi-modality face classification.",
                    "Inferring hand pose: A comparative study of visual shape features.",
                    "Relative dense tracklets for human action recognition.",
                    "A talking profile to distinguish identical twins.",
                    "Approximate structured output learning for Constrained Local Models with application to real-time facial feature detection and tracking on low-power devices.",
                    "Prototype based feature learning for face image set classification.",
                    "Structural models for face detection.",
                    "Low-rank embedding for semisupervised face classification.",
                    "Face and landmark detection by using cascade of classifiers.",
                    "Activity recognition by learning structural and pairwise mid-level features using random forest.",
                    "Skin detection using a modified Self-Organizing Mixture Network.",
                    "Making the most of the self-quotient image in face recognition.",
                    "Encoding Local Binary Patterns using the re-parametrization of the second order Gaussian jet.",
                    "Learning individual-specific dictionaries with fused multiple features for face recognition.",
                    "Tone-aware sparse representation for face recognition.",
                    "Gender and 3D facial symmetry: What's the relationship?",
                    "Real time 3D face alignment with Random Forests-based Active Appearance Models.",
                    "Fast and scalable enrollment for face identification based on Partial Least Squares.",
                    "Distribution-sensitive learning for imbalanced datasets.",
                    "Album-oriented face recognition for online social networks.",
                    "A Spontaneous Micro-expression Database: Inducement, collection and baseline.",
                    "Multiple feature fusion for face recognition.",
                    "Assessment of facial wrinkles as a soft biometrics.",
                    "Learning from a single labeled face and a stream of unlabeled data.",
                    "Illumination invariant human face recognition: frequency or resonance?",
                    "Automatic fetal face detection by locating fetal facial features from 3D ultrasound images for navigating fetoscopic tracheal occlusion surgeries.",
                    "Explicit occlusion detection based deformable fitting for facial landmark localization.",
                    "Multiview discriminative learning for age-invariant face recognition.",
                    "Isomorphic Manifold Inference for hair segmentation.",
                    "Head yaw estimation via symmetry of regions.",
                    "Face recognition based on regularized nearest points between image sets.",
                    "Person appearance modeling and orientation estimation using Spherical Harmonics.",
                    "Face alignment using local hough voting.",
                    "Person-specific face tracking with online recognition.",
                    "Decoding mixed emotions from expression map of face images.",
                    "Spatio-temporal steerable pyramid for human action recognition.",
                    "Fast propagation-based skin regions segmentation in color images.",
                    "AU-aware Deep Networks for facial expression recognition.",
                    "Combining first-person and third-person gaze for attention recognition.",
                    "The temporal connection between smiles and blinks.",
                    "Joint estimation of age, gender and ethnicity: CCA vs. PLS.",
                    "Logarithm Gradient Histogram: A general illumination invariant descriptor for face recognition.",
                    "Deformable face ensemble alignment with robust grouped-L1 anchors.",
                    "Early facial expression recognition using early RankBoost.",
                    "Body communicative cue extraction for conversational analysis.",
                    "Measuring the engagement level of TV viewers.",
                    "3D face recognition for partial data using Semi-Coupled Dictionary Learning.",
                    "Multi-attribute sparse representation with group constraints for face recognition under different variations.",
                    "Supervised dictionary learning for action localization.",
                    "Nebula feature: A space-time feature for posed and spontaneous 4D facial behavior analysis.",
                    "Face recognition with occlusion using Dynamic Image-to-Class Warping (DICW).",
                    "Social risk and depression: Evidence from manual and automatic facial expression analysis.",
                    "An automatic 3D expression recognition framework based on sparse representation of conformal images.",
                    "Predicting online media effectiveness based on smile responses gathered over the Internet.",
                    "Recognizing people by face and body in Photo Collections.",
                    "Feature and model level compensation of lexical content for facial emotion recognition.",
                    "A scalable metric learning-based voting method for expression recognition.",
                    "Histogram of 3D Facets: A characteristic descriptor for hand gesture recognition.",
                    "Ensemble of Randomized Linear Discriminant Analysis for face recognition with single sample per person.",
                    "Integrating multi-stage depth-induced contextual information for human action recognition and localization.",
                    "A unified probabilistic framework for measuring the intensity of spontaneous facial action units.",
                    "Video based activity recognition in trauma resuscitation.",
                    "Iterative online subspace learning for robust image alignment.",
                    "Extremal human curves: A new human body shape and pose descriptor.",
                    "Countermeasure for the protection of face recognition systems against mask attacks.",
                    "Weakly supervised pain localization using multiple instance learning.",
                    "Non-linear predictors for facial feature tracking across pose and expression.",
                    "Improving recognition and identification of facial areas involved in Non-Verbal Communication by feature selection.",
                    "Synthesis of spatio-temporal descriptors for dynamic hand gesture recognition using genetic programming.",
                    "Privileged information-based conditional regression forest for facial feature detection.",
                    "Implicit video multi-emotion tagging by exploiting multi-expression relations.",
                    "Accurate static pose estimation combining direct regression and geodesic extrema.",
                    "Using color texture sparsity for facial expression recognition.",
                    "Hierarchical approach to weight equations in face tracking and recognition framework.",
                    "Emotional tagging of videos by exploring multiple emotions' coexistence.",
                    "Multi-feature ordinal ranking for facial age estimation.",
                    "Improved local binary pattern based action unit detection using morphological and bilateral filters.",
                    "Improving facial expression analysis using histograms of Log-Transformed Nonnegative Sparse Representation with a Spatial Pyramid Structure.",
                    "Perceptual effects of damped and exaggerated facial motion in animated characters.",
                    "Smile or smirk? Automatic detection of spontaneous asymmetric smiles to understand viewer experience.",
                    "May the force be with you: Force-aligned signwriting for automatic subunit annotation of corpora.",
                    "Multi-touchless: Real-time fingertip detection and tracking using geodesic maxima.",
                    "Transfer learning to account for idiosyncrasy in face and body expressions.",
                    "From dials to facial coding: Automated detection of spontaneous facial expressions for media research.",
                    "Recognizing eyebrow and periodic head gestures using CRFs for non-manual grammatical marker detection in ASL.",
                    "Illumination alignment using lighting ratio: Application to 3D-2D face recognition.",
                    "Multi-layer joint gait-pose manifold for human motion modeling.",
                    "Sequential emotion recognition using Latent-Dynamic Conditional Neural Fields.",
                    "Dimensional affect recognition using Continuous Conditional Random Fields.",
                    "Joint optimization of manifold learning and sparse representations.",
                    "Video-based face recognition via joint sparse representation.",
                    "A high-resolution spontaneous 3D dynamic facial expression database.",
                    "Automatic behavior descriptors for psychological disorder analysis.",
                    "Improving action units recognition using dense flow-based face registration in video.",
                    "Robust part-based face matching with multiple templates.",
                    "Felt emotion and social context determine the intensity of smiles in a competitive video game.",
                    "Temporal coordination of head motion in couples with history of interpersonal violence.",
                    "Maximum margin GMM learning for facial expression recognition.",
                    "A comparison of alternative classifiers for detecting occurrence and intensity in spontaneous facial expression of infants with their mothers.",
                    "Can body expressions contribute to automatic depression analysis?",
                    "On combining gait features.",
                    "Online learning and fusion of orientation appearance models for robust rigid object tracking.",
                    "CASME database: A dataset of spontaneous micro-expressions collected from neutralized faces.",
                    "Telling the difference between deceiving and truth telling: An experiment in a public space.",
                    "Imposing cognitive load to unmask prepared lies.",
                    "Automated analysis of interactional synchrony using robust facial tracking and expression recognition.",
                    "A database for facial behavioural analysis.",
                    "Annotation and processing of continuous emotional attributes: Challenges and opportunities.",
                    "Introducing the RECOLA multimodal corpus of remote collaborative and affective interactions.",
                    "Laughter induction techniques suitable for generating motion capture data of laughter associated body movements.",
                    "Facial expression recognition using HessianMKL based multiclass-SVM.",
                    "Continuous AU intensity estimation using localized, sparse facial feature space.",
                    "Decoding affect in videos employing the MEG brain signal.",
                    "Margin-constrained multiple kernel learning based multi-modal fusion for affect recognition.",
                    "A facial expression based continuous emotional state monitoring system with GPU acceleration.",
                    "Analyzing perceived empathy/antipathy based on reaction time in behavioral coordination.",
                    "Proposal on an image haptization system based on emotional effects of color.",
                    "Cross-pose facial expression recognition.",
                    "Facial ethnicity classification based on boosted local texture and shape descriptions.",
                    "Combining 3D face representations using region covariance descriptors and statistical models.",
                    "A robust and isotropic curved surface representation for 3D faces description.",
                    "Compensating inaccurate annotations to train 3D facial landmark localization models.",
                    "Benchmarking asymmetric 3D-2D face recognition systems.",
                    "A stable and accurate multi-reference representation for surfaces of R3: Application to 3D faces description.",
                    "Fully automatic 3D facial expression recognition using differential mean curvature maps and histograms of oriented gradients."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "9th FG 2011",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2011",
                "sub_name": "Ninth IEEE International Conference on Automatic Face and Gesture Recognition (FG 2011), Santa Barbara, CA, USA, 21-25 March 2011.",
                "count": 151,
                "papers": [
                    "A novel geometric facial representation based on multi-scale extended local binary patterns.",
                    "Beyond simple features: A large-scale feature search approach to unconstrained face recognition.",
                    "Output-associative RVM regression for dimensional and continuous emotion prediction.",
                    "Lie to Me: Deceit detection via online behavioral learning.",
                    "Automated measurement of children's facial expressions during problem solving tasks.",
                    "Hierarchical ranking of facial attributes.",
                    "Analyzing empathetic interactions based on the probabilistic modeling of the co-occurrence patterns of facial expressions in group meetings.",
                    "Macro- and micro-expression spotting in long videos using spatio-temporal strain.",
                    "Painful data: The UNBC-McMaster shoulder pain expression archive database.",
                    "Multimodal identification using Markov logic networks.",
                    "Kernel spectral regression of perceived age from hybrid facial features.",
                    "Combination of age and head pose for adult face verification.",
                    "Demographic effects on estimates of automatic face recognition performance.",
                    "Recent advances in age and height estimation from still images and video.",
                    "Tangent bundle for human action recognition.",
                    "The human motion database: A cognitive and parametric sampling of human motion.",
                    "Capturing the relative distribution of features for action recognition.",
                    "Real-time avatar animation from a single image.",
                    "Realistic head motion synthesis for an image-based talking head.",
                    "Person identification using behavioral features from lip motion.",
                    "Active conditional models.",
                    "Action recognition by learnt class-specific overcomplete dictionaries.",
                    "Sparsely Encoded Local Descriptor for face recognition.",
                    "Person identification using behavioral features from lip motion.",
                    "Local frequency descriptor for low-resolution face recognition.",
                    "A novel biometric via hand structure using near-field microwave imaging.",
                    "Face recognition using phase-based correspondence matching.",
                    "Local matching Gabor entropy weighted face recognition.",
                    "Distinguishing identical twins by face recognition.",
                    "Adaptive discriminant analysis for face recognition from single sample per person.",
                    "Facial feature fusion and model selection for age estimation.",
                    "Can discriminative cues aid face recognition across age?",
                    "Real-time avatar animation from a single image.",
                    "Realistic head motion synthesis for an image-based talking head.",
                    "Human head-shoulder segmentation.",
                    "A novel coarse-to-fine hair segmentation method.",
                    "Face alignment robust to occlusion.",
                    "Optimal gradient pursuit for face alignment.",
                    "LPSM: Fitting shape model by linear programming.",
                    "Tracking facial feature points with prediction-assisted view-based active shape model.",
                    "Multiple kernel learning SVM and statistical validation for facial landmark detection.",
                    "Sparse shape registration for occluded facial feature localization.",
                    "Facial component-landmark detection.",
                    "MAGIC 2.0: A web tool for false positive prediction and prevention for gesture recognition systems.",
                    "The optimal camera arrangement by a performance model for gait recognition.",
                    "The computer expression recognition toolbox (CERT).",
                    "Towards view-invariant expression analysis using analytic shape manifolds.",
                    "Action unit detection using sparse appearance descriptors in space-time video volumes.",
                    "String-based audiovisual fusion of behavioural events for the assessment of dimensional affect.",
                    "Segment and recognize expression phase by fusion of motion area and neutral divergence features.",
                    "Facial action unit recognition with sparse representation.",
                    "Face recognition with consideration of aging.",
                    "Real-time face recognition demonstration.",
                    "Veering around the Uncanny Valley: Revealing the underlying structure of facial expressions.",
                    "An introduction to the good, the bad, & the ugly face recognition challenge problem.",
                    "Acted vs. natural frustration and delight: Many people smile in natural frustration.",
                    "Data-driven animation of hand-object interactions.",
                    "Robust 3D hand tracking for human computer interaction.",
                    "Prop-free pointing detection in dynamic cluttered environments.",
                    "Automated facial affect analysis for one-on-one tutoring applications.",
                    "Multi-signal gesture recognition using temporal smoothing hidden conditional random fields.",
                    "One-class label propagation using local cone based similarity.",
                    "Facial feature detection with 3D convex local models.",
                    "A dynamic approach to the recognition of 3D facial expressions and their temporal models.",
                    "Expression recognition from 3D dynamic faces using robust spatio-temporal shape features.",
                    "Reshaping 3D facial scans for facial appearance modeling and 3D facial expression analysis.",
                    "Learning sparse feature for eyeglasses problem in face recognition.",
                    "Face liveness detection by learning multispectral reflectance distributions.",
                    "Improving the recognition of faces occluded by facial accessories.",
                    "Robust skin detection using multi-spectral illumination.",
                    "Warp that smile on your face: Optimal and smooth deformations for face recognition.",
                    "The multifactor extension of Grassmann manifolds for face recognition.",
                    "Learning discriminative local binary patterns for face recognition.",
                    "Multilinear projection for face recognition via canonical decomposition.",
                    "The POETICON enacted scenario corpus - A tool for human and computational experiments on action understanding.",
                    "Motion divergence fields for dynamic hand gesture recognition.",
                    "Tracking body and hands for gesture recognition: NATOPS aircraft handling signals database.",
                    "Fast and robust appearance-based tracking.",
                    "Eye localization through multiscale sparse dictionaries.",
                    "A new method for combined face detection and identification using interest point descriptors.",
                    "Exploiting long-term observations for track creation and deletion in online multi-face tracking.",
                    "High resolution face sequences from a PTZ network camera.",
                    "A co-training framework for visual tracking with multiple instance learning.",
                    "Online multiple support instance tracking.",
                    "Principal component analysis of image gradient orientations for face recognition.",
                    "Comparative evaluation of wavelet-based super-resolution from video for face recognition at a distance.",
                    "Scalable face labeling in online social networks.",
                    "When high-quality face images match poorly.",
                    "Margin Emphasized Metric Learning and its application to Gabor feature based face recognition.",
                    "Improved SIFT matching for pose robust facial expression recognition.",
                    "Acume: A new visualization tool for understanding facial expression and gesture data.",
                    "Recognizing facial expressions from 3D video: Current results and future prospects.",
                    "3D facial expression recognition: A perspective on promises and challenges.",
                    "Effect of illumination on automatic expression recognition: A novel 3D relightable facial database.",
                    "Prediction-based classification for audiovisual discrimination between laughter and speech.",
                    "Constraint-based gaze estimation without active calibration.",
                    "Rapid 3D face modeling using a frontal face and a profile face for accurate 2D pose synthesis.",
                    "Mapping and manipulating facial dynamics.",
                    "Come and have an emotional workout with sensitive artificial listeners!",
                    "CopyCat: An American Sign Language game for deaf children.",
                    "Real-time social interaction analysis.",
                    "Sparse eigentracker augmented by associative mapping to 3D shape.",
                    "Hierarchical CRF with product label spaces for parts-based models.",
                    "Unsupervised learning of human expressions, gestures, and actions.",
                    "Context constrained facial landmark localization based on discontinuous Haar-like feature.",
                    "A hierarchical framework for simultaneous facial activity tracking.",
                    "Human pose estimation using patch-based candidate generation and model-based verification.",
                    "A robust composite metric for head pose tracking using an accurate face model.",
                    "Estimating human 3D pose from Time-of-Flight images based on geodesic distances and optical flow.",
                    "Recognizing face sketches by a large number of human subjects: A perception-based study for facial distinctiveness.",
                    "Robust semantic analysis by synthesis of 3D facial motion.",
                    "Evolutionary granular approach for recognizing faces altered due to plastic surgery.",
                    "Face recognition: Some challenges in forensics.",
                    "Exploiting observers' judgements for nonverbal group interaction analysis.",
                    "Attention driven face recognition: A combination of spatial variant fixations and glance.",
                    "Modeling hidden dynamics of multimodal cues for spontaneous agreement and disagreement recognition.",
                    "Approaches for global-based action representations for games and action understanding.",
                    "An efficient approach to smile detection.",
                    "Facial and bodily expressions for control and adaptation of games (ECAG'11).",
                    "HCI⁁2 Workbench: A development tool for multimodal human-computer interaction systems.",
                    "Motion capture for realtime control of virtual actors in live, distributed, theatrical performances.",
                    "A novel perceptual feature set for audio emotion recognition.",
                    "Bilingual acoustic feature selection for emotion estimation using a 3D continuous model.",
                    "On dimensions in emotion psychology.",
                    "Individual identification based on facial dynamics during expressions using active-appearance-based Hidden Markov Models.",
                    "Continuous emotion detection in response to music videos.",
                    "Expression of emotional states during locomotion based on canonical parameters.",
                    "A SSIM-based approach for finding similar facial expressions.",
                    "Emotional nodes among lines of lyrics.",
                    "Emotion representation, analysis and synthesis in continuous space: A survey.",
                    "Obtaining speech assets for judgement analysis on low-pass filtered emotional speech.",
                    "Benchmarking classification models for emotion recognition in natural speech: A multi-corporal study.",
                    "Analysis and synthesis of facial expressions using decomposable nonlinear generative models.",
                    "Threat determines affective startle potentiation.",
                    "Emotion recognition by two view SVM_2K classifier on dynamic facial expression features.",
                    "Combining AAM coefficients with LGBP histograms in the multi-kernel SVM framework to detect facial action units.",
                    "Facial expression recognition using emotion avatar image.",
                    "Emotion recognition from an ensemble of features.",
                    "Emotion recognition using PHOG and LPQ features.",
                    "Emotion recognition using dynamic grid-based HoG features.",
                    "Action unit recognition transfer across datasets.",
                    "The motion in emotion - A CERT based approach to the FERA emotion challenge.",
                    "Accumulated motion images for facial expression recognition in videos.",
                    "Real-time inference of mental states from facial expressions and upper body gestures.",
                    "Person-independent facial expression detection using Constrained Local Models.",
                    "The first facial expression recognition and analysis challenge.",
                    "Building up child-robot relationship for therapeutic purposes: From initial attraction towards long-term social engagement.",
                    "Discovering social interactions in real work environments.",
                    "Predicting dominance judgements automatically: A machine learning approach.",
                    "Extraction of relations between behaviors by lecturer and students in lectures.",
                    "Visualisation and prediction of conversation interest through mined social signals."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th FG 2008",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2008",
                "sub_name": "8th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2008), Amsterdam, The Netherlands, 17-19 September 2008.",
                "count": 167,
                "papers": [
                    "Rotated Profile Signatures for robust 3D feature detection.",
                    "A high-resolution 3D dynamic facial expression database.",
                    "Spontaneous facial expression classification with facial motion vectors.",
                    "Non-rigid registration using free-form deformations for recognition of facial actions and their temporal dynamics.",
                    "Facial feature detection with optimal pixel reduction SVM.",
                    "Facial feature localization usingweighted vector concentration approach.",
                    "Robustly classifying facial components using a set of adjusted pixel features.",
                    "3D face recognition from multiple images: A shape-from-motion approach.",
                    "A collaborative face recognition framework on a social network platform.",
                    "Unsupervised learning from local features for video-based face recognition.",
                    "Illumination-robust face recognition using tensor-based active appearance model.",
                    "Statistical appearance models for automatic pose invariant face recognition.",
                    "A non-intrusive method for user focus of attention estimation in front of a computer monitor.",
                    "A fast and robust 3D head pose and gaze estimation system.",
                    "A real time system for model-based interpretation of the dynamics of facial expressions.",
                    "Automatic bi-modal emotion recognition system based on fusion of facial expressions and emotion extraction from speech.",
                    "Computer Expression Recognition Toolbox.",
                    "Emotionally aware automated portrait painting demonstration.",
                    "The looking back screens.",
                    "Real-time face blending by automatic facial feature point detection.",
                    "Communicating with a virtual human or a skin-based robot head.",
                    "Learning image alignment without local minima for face detection and tracking.",
                    "Deformable Face Fitting with Soft Correspondence Constraints.",
                    "Generalized adaptive view-based appearance model: Integrated framework for monocular head pose estimation.",
                    "Robust face tracking with occlusion detection and varying intensity.",
                    "On the sustained tracking of human motion.",
                    "Modeling shape and textural variations in aging faces.",
                    "Face recognition with temporal invariance: A 3D aging model.",
                    "Evaluating the performance of face-aging algorithms.",
                    "Biometric enhancements: Template aging error score analysis.",
                    "Demo: Robust face recognition via sparse representation.",
                    "Face recognition for smart interactions.",
                    "Robust real-time 3D time-of-flight based gesture navigation.",
                    "A learning environment for sign language.",
                    "A system for teaching sign language using live gesture feedback.",
                    "HMM parameter reduction for practical gesture recognition.",
                    "Building the databases needed to understand rich, spontaneous human behaviour.",
                    "Recognizing human actions based on silhouette energy image and global motion description.",
                    "Human action recognition using discriminative models in the learned hierarchical manifold space.",
                    "Boosting EigenActions: A new algorithm for human action categorization.",
                    "Multi-PIE.",
                    "Focus on quality, predicting FRVT 2006 performance.",
                    "Evaluation of face recognition techniques for application to facebook.",
                    "Meeting behavior detection in smart environments: Nonverbal cues that help to obtain natural interaction.",
                    "Tracking identities and attention in smart environments - contributions and progress in the CHIL project.",
                    "Identifying dominant people in meetings from audio-visual sensors.",
                    "Ambient intelligence as the bridge to the future of pervasive computing.",
                    "Emotional contagion for unseen bodily expressions: Evidence from facial EMG.",
                    "Inverse mapping the neuronal correlates of facial expression processing.",
                    "Investigating the production of emotional facial expressions: a combined electroencephalographic (EEG) and electromyographic (EMG) approach.",
                    "Complementary computing for visual tasks: Meshing computer vision with human visual processing.",
                    "Automatic 3D face reconstruction from single images or video.",
                    "Simultaneous tracking and facial expression recognition using multiperson and multiclass autoregressive models.",
                    "RBF shape histograms and their application to 3D face processing.",
                    "View-invariant human-body detection with extension to human action recognition using component-wise HMM of body parts.",
                    "3D facial expression recognition based on properties of line segments connecting facial feature points.",
                    "Colour invariants for machine face recognition.",
                    "Complex human motion estimation using visibility.",
                    "Towards more accurate 3D face registration under the guidance of prior anatomical knowledge on human faces.",
                    "Symmetry-based face pose estimation from a single uncalibrated view.",
                    "Face recognition using multiple interest point detectors and SIFT descriptors.",
                    "Design sparse features for age estimation using hierarchical face model.",
                    "An active boosting-based learning framework for real-time hand detection.",
                    "Humans versus algorithms: Comparisons from the Face Recognition Vendor Test 2006.",
                    "More robust face recognition by considering occlusion information.",
                    "Face recognition with Neighboring Discriminant Analysis.",
                    "Facial and bodily expressions for control and adaptation of games (ECAG'08).",
                    "Person-independent face tracking based on dynamic AAM selection.",
                    "Children's sensitivity to configural cues in faces undergoing rotational motion.",
                    "Real-time facial expression recognition with illumination-corrected image sequences.",
                    "Normalized LDA for semi-supervised learning.",
                    "Personalized facial attractiveness prediction.",
                    "Bilinear elastically deformable models with application to 3D face and facial expression recognition.",
                    "Multi Subspaces Active Appearance Models.",
                    "Recognizing partial facial action units based on 3D dynamic range data for facial expression recognition.",
                    "Non-linear fusion of local matching scores for face verification.",
                    "3D Morphable Model fitting from multiple views.",
                    "Bi-channel sensor fusion for automatic sign language recognition.",
                    "Recognizing hand gestures using dynamic Bayesian network.",
                    "Omni-directional multiperson tracking in meeting scenarios combining simulated annealing and particle filtering.",
                    "Fast viewpoint-invariant articulated hand detection combining curve and graph matching.",
                    "A bottom-up framework for robust facial feature detection.",
                    "Adaptive particle filter with body part segmentation for full body tracking.",
                    "Acceptability ratings by humans and automatic gesture recognition for variations in sign productions.",
                    "Tracking a walking person using activity-guided annealed particle filtering.",
                    "Automatic estimation of the dynamics of facial expression using a three-level model of intensity.",
                    "Person-specific face recognition in unconstrained environments: a combination of offline and online learning.",
                    "Gabor volume based local binary pattern for face representation and recognition.",
                    "Gesture stroke recognition using computer vision and linear accelerometer.",
                    "3D facial geometry recovery via group-wise optical flow.",
                    "MVAAM (multi-view active appearance model) optimized by multi-objective genetic algorithm.",
                    "Component-based registration with curvature descriptors for expression insensitive 3d face recognition.",
                    "Activity detection in conversational sign language video for mobile telecommunication.",
                    "Model-based reconstruction for illumination variation in face images.",
                    "Image-set matching using a geodesic distance and cohort normalization.",
                    "Markerless view independent gait analysis with self-camera calibration.",
                    "Accurate single view model-based head pose estimation.",
                    "Profile-based face recognition.",
                    "Biased discriminant analysis using composite vectors for eye detection.",
                    "An efficient and accurate hierarchical ICIA fitting method for 3D Morphable Models.",
                    "Expression invariant 3D face recognition with a Morphable Model.",
                    "The POSTECH face database (PF07) and performance evaluation.",
                    "Local features based facial expression recognition with face registration errors.",
                    "Illumination transfer using homomorphic wavelet filtering and its application to light-insensitive face recognition.",
                    "Large scale learning and recognition of faces in web videos.",
                    "Accurate eye localization in low and standard definition content.",
                    "Towards understanding the uniqueness of gait biometric.",
                    "Pixel selection in a face image based on discriminant features for face recognition.",
                    "Recovering face shape and reflectance properties from single images.",
                    "Real-time face recognition for human-robot interaction.",
                    "Spatiotemporal pyramid representation for recognition of facial expressions and hand gestures.",
                    "Classifier fusion for robust ICAO compliant face analysis.",
                    "Gait Analysis using Independent Components of image motion.",
                    "Face reconstruction using fixation positions and foveated imaging.",
                    "An adaptive learning method for face hallucination using Locality Preserving Projections.",
                    "Exploratory factor analysis of gait recognition.",
                    "A discriminative approach to frame-by-frame head pose tracking.",
                    "Auto Associative Neural Network based Active Shape Models.",
                    "Reducing the other-race effect through caricatures.",
                    "Qualification of arm gestures using hidden Markov models.",
                    "Logit-RankBoost with pruning for face recognition.",
                    "Recovering 3D facial shape via coupled 2D/3D space learning.",
                    "Facial image analysis using local feature adaptation prior to learning.",
                    "2D-3D face matching using CCA.",
                    "Face recognition with occlusions in the training and testing sets.",
                    "Training high dimension ternary features with GA in boosting cascade detector for object detection.",
                    "A real-time facial expression recognition system based on Active Appearance Models using gray images and edge images.",
                    "Using an adaptive VAR Model for motion prediction in 3D hand tracking.",
                    "Feature subspace determination in video-based mismatched face recognition.",
                    "Face recognition and alignment using support vector machines.",
                    "Discriminant analysis for perceptionally comparable classes.",
                    "Regularized active shape model for shape alignment.",
                    "Workshop on psychology of face and gesture recognition.",
                    "Robust facial expression recognition based on 3-d supported feature extraction and SVM classification.",
                    "Modelling human perception of static facial expressions.",
                    "Motion recognition approach to solve overwriting in complex actions.",
                    "Markov random field models for hair and face segmentation.",
                    "Emotional entrainment in music performance.",
                    "Predicting driver operations inside vehicles.",
                    "Generation of emotional feature space based on topological characteristics of facial expression images.",
                    "Motion image segmentation using global criteria and DP.",
                    "Multimodal preserving embedding for face recognition.",
                    "Efficient approximations to model-based joint tracking and recognition of continuous sign language.",
                    "Real-time face blending by automatic facial feature point detection.",
                    "Markovian mixture face recognition with discriminative face alignment.",
                    "Multi-attribute robust facial feature localization.",
                    "Multi-view facial expression recognition.",
                    "Discriminative human action recognition using pairwise CSP classifiers.",
                    "Real-time 3D pointing gesture recognition in mobile space.",
                    "Using targeted statistics for face regeneration.",
                    "Learning to recognize a sign from a single example.",
                    "Nearest-Subspace Patch Matching for face recognition under varying pose and illumination.",
                    "Statistical body height estimation from a single image.",
                    "Confidence assessment on eyelid and eyebrow expression recognition.",
                    "Face detection by cascade of Gaussian derivates classifiers calculated with a half-octave pyramid.",
                    "A method of multi-factorization for recognizing emotions from gestures.",
                    "Robust hand tracking using a skin tone and depth joint probability model.",
                    "Multi-scale dynamic human fatigue detection with feature level fusion.",
                    "Automatic hand trajectory segmentation and phoneme transcription for sign language.",
                    "Unsupervised clustering for google searches of celebrity images.",
                    "Tracking facial features under occlusions and recognizing facial expressions in sign language.",
                    "An ASM fitting method based on machine learning that provides a robust parameter initialization for AAM fitting.",
                    "Aligned Cluster Analysis for temporal segmentation of human motion.",
                    "Dominance modulates the effects of eye gaze on the perception of threatening facial expressions.",
                    "Recognizing talking faces from acoustic Doppler reflections.",
                    "The significance of facial features for automatic sign language recognition.",
                    "Subsurface scattering deconvolution for improved NIR-visible facial image correlation."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th FGR 2006",
        "info": "Southampton, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2006",
                "sub_name": "Seventh IEEE International Conference on Automatic Face and Gesture Recognition (FGR 2006), 10-12 April 2006, Southampton, UK.",
                "count": 103,
                "papers": [
                    "Graph Embedded Analysis for Head Pose Estimation.",
                    "Local Binary Patterns as an Image Preprocessing for Face Authentication.",
                    "Preliminary Face Recognition Grand Challenge Results.",
                    "Face Recognition from Unconstrained Images: Progress with Prototypes.",
                    "Using Feature Combination and Statistical Resampling for Accurate Face Recognition Based on Frequency Domain Representation of Facial Asymmetry.",
                    "Face Recognition from a Tabula Rasa Perspective.",
                    "Subspace-based Age-group Classification Using Facial Images under Various Lighting Conditions.",
                    "Face Recognition Using the Classified Appearance-based Quotient Image.",
                    "Relighting of Facial Images.",
                    "Database Size Effects on Performance on a Smart Card Face Verification System.",
                    "Face Alignment with Unified Subspace Optimization of Active Statistical Models.",
                    "A Landmark Paper in Face Recognition.",
                    "Weighted Gabor Features in Unitary Space for Face Recognition.",
                    "Video-Based Face Recognition Evaluation in the CHIL Project - Run 1.",
                    "Hierarchical Ensemble of Gabor Fisher Classifier for Face Recognition.",
                    "Haar Features for FACS AU Recognition.",
                    "Robust Face Recognition by Multiscale Kernel Associative Memory Models Based on Hierarchical Spatial-Domain Gabor Transforms.",
                    "Making 2D Face Recognition MoreRobust Using AAMs for Pose Compensation.",
                    "Photometric Normalisation for Component-based Face Verification.",
                    "Optimised Landmark Model Matching for Face Recognition.",
                    "Color Face Recognition by Hypercomplex Gabor Analysis.",
                    "Face Verification using External Features.",
                    "Making Recognisable Faces.",
                    "Facial Features Extraction in Color Images Using Enhanced Active Shape Model.",
                    "Evaluating Error Functions for Robust Active Appearance Models.",
                    "AAM Derived Face Representations for Robust Facial Action Recognition.",
                    "Face Recognition by Projection-based 3D Normalization and Shading Subspace Orthogonalization.",
                    "Robust Method for Real-time, Continuous, 3D Detection of Obstructed Faces in Indoors Environments.",
                    "Face Recognition with Image Sets Using Hierarchically Extracted Exemplars from Appearance Manifolds.",
                    "Adding Holistic Dimensions to a Facial Composite System.",
                    "Rejection of Non-meaningful Activities.",
                    "Joint Spatial and Frequency Domain Motion Analysis.",
                    "Registration of Expressions Data using a 3D Morphable Model.",
                    "A 3D Facial Expression Database For Facial Behavior Research.",
                    "Using a Tensor Framework for the Analysis of Facial Dynamics.",
                    "Fully Automatic Facial Action Recognition in Spontaneous Behavior.",
                    "Robust Spotting of Key Gestures from Whole Body Motion Sequence.",
                    "Automatic Skin Segmentation for Gesture Recognition Combining Region and Support Vector Machine Active Learning.",
                    "A Full-Body Gesture Database for Automatic Gesture Recognition.",
                    "A Layered Deformable Model for Gait Analysis.",
                    "Optimal Hand Gesture Vocabulary Design Using Psycho-Physiological and Technical Factors.",
                    "The Isometric Self-Organizing Map for 3D Hand Pose Estimation.",
                    "Towards Recognizing Emotion with Affective Dimensions Through Body Gestures.",
                    "Framework for a Portable Gesture Interface.",
                    "One-Class Classification for Spontaneous Facial Expression Analysis.",
                    "Head and Facial Action Tracking: Comparison of Two Robust Approaches.",
                    "Tracking Using Dynamic Programming for Appearance-Based Sign Language Recognition.",
                    "Human and Machine Recognition of Fourier-Bessel Filtered Face Images.",
                    "Learning to Identify Facial Expression During Detection Using Markov Decision Process.",
                    "Fast Learning for Customizable Head Pose Recognition in Robotic Wheelchair Control.",
                    "Bayesian Classification of Task-Oriented Actions Based on Stochastic Context-Free Grammar.",
                    "Expanding Training Set for Chinese Sign Language Recognition.",
                    "Articulated Hand Tracking by PCA-ICA Approach.",
                    "Robust Head Tracking Based on a Multi-State Particle Filter.",
                    "MORPH: A Longitudinal Image Database of Normal Adult Age-Progression.",
                    "Facial Expression Classification using Gabor and Log-Gabor Filters.",
                    "Hand Posture Classification and Recognition using the Modified Census Transform.",
                    "Local versus Global Segmentation for Facial Expression Recognition.",
                    "Toward an Efficient and Accurate AAM Fitting on Appearance Varying Faces.",
                    "Accurate Face Localisation for Faces under Active Near-IR Illumination.",
                    "Gesture Spotting in Low-Quality Video with Features Based on Curvature Scale Space.",
                    "Sign Recognition using Depth Image Streams.",
                    "A Decision-Theoretic Video Conference System Based on Gesture Recognition.",
                    "Cascaded Classification of Gender and Facial Expression using Active Appearance Models.",
                    "Learning Sparse Features in Granular Space for Multi-View Face Detection.",
                    "Robust Multi-View Multi-Camera Face Detection inside Smart Rooms Using Spatio-Temporal Dynamic Programming.",
                    "Component-based robust face detection using AdaBoost and decision tree.",
                    "Reliable and Fast Tracking of Faces under Varying Pose.",
                    "Facial Feature Detection and Tracking with Automatic Template Selection.",
                    "Multi-template ASM Method for Feature Points Detection of Facial Image with Diverse Expressions.",
                    "Regression and Classification Approaches to Eye Localization in Face Images.",
                    "A New Look at Filtering Techniques for Illumination Invariance in Automatic Face Recognition.",
                    "A Near-infrared Image Based Face Recognition System.",
                    "Incremental Kernel SVD for Face Recognition with Image Sets.",
                    "Face Classification based on Shannon Wavelet Kernel and Modified Fisher Criterion.",
                    "Automatic Gait Recognition using Dynamic Variance Features.",
                    "Dance Posture Recognition Using Wide-baseline Orthogonal Stereo Cameras.",
                    "Towards Automatic Body Language Annotation.",
                    "A Multiview Face Identification Model With No Geometric Constraints.",
                    "Estimation of Anthropomeasures from a Single Calibrated Camera.",
                    "A Realtime Shrug Detector.",
                    "A General Framework For Tracking People.",
                    "Gait Recognition Using Multiple Projections.",
                    "Human Action Recognition Using Multi-View Image Sequences Features.",
                    "3D Gait Recognition Using Multiple Cameras.",
                    "Automatic Impression Transformation of Faces in 3D Shape - A Perceptual Comparison with Processing on 2D Images.",
                    "Comparison of Silhouette Shape Descriptors for Example-based Human Pose Recovery.",
                    "Minimum Variance Estimation of 3D Face Shape from Multi-view.",
                    "Gait Tracking and Recognition Using Person-Dependent Dynamic Shape Model.",
                    "Robust Distance Measures for Face-Recognition Supporting Revocable Biometric Tokens.",
                    "Kernel Particle Filter for Real-Time 3D Body Tracking in Monocular Color Images.",
                    "Accurate Head Pose Tracking in Low Resolution Video.",
                    "Gait Recognition by Two-Stage Principal Component Analysis.",
                    "Automatic Feature Extraction for Multiview 3D Face Recognition.",
                    "A Vision Based Interface for Local Collaborative Music Synthesis.",
                    "Morphable Face Reconstruction with Multiple Images.",
                    "Multi-Scale Primal Feature Based Facial Expression Modeling and Identification.",
                    "Self Correcting Tracking for Articulated Objects.",
                    "Face Recognition based on a 3D Morphable Model.",
                    "Multi-View Face Recognition By Nonlinear Dimensionality Reduction And Generalized Linear Models.",
                    "Local Linear Regression (LLR) for Pose Invariant Face Recognition.",
                    "Combining PCA and LFA for Surface Reconstruction from a Sparse Set of Control Points.",
                    "Automatic Gesture Recognition for Intelligent Human-Robot Interaction."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th FGR 2004",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2004",
                "sub_name": "Sixth IEEE International Conference on Automatic Face and Gesture Recognition (FGR 2004), May 17-19, 2004, Seoul, Korea.",
                "count": 145,
                "papers": [
                    "Model-Based and Image-Based Methods for Facial Image Synthesis, Analysis and Recognition.",
                    "On Automated Model-Based Extraction and Analysis of Gait.",
                    "3D Tracking for Gait Characterization and Recognition.",
                    "Amplitude Spectrum-based Gait Recognition.",
                    "Finding Optimal Views for 3D Face Shape Modeling.",
                    "Adaptive Learning of an Accurate Skin-Color Model.",
                    "Multi-biometrics Using Facial Appearance, Shape and Temperature.",
                    "Image-based Photorealistic 3-D Face Modeling.",
                    "Trainable Videorealistic Speech Animation.",
                    "Affine-Invariant Face Detection and Localization Using GMM-based Feature Detector and Enhanced Appearance Model.",
                    "Expand Training Set for Face Detection by GA Re-sampling.",
                    "Fast Rotation Invariant Multi-View Face Detection Based on Real Adaboost.",
                    "Face Alignment Under Variable Illumination.",
                    "Face Detection with the Modified Census Transform.",
                    "Particle Filtering with Factorized Likelihoods for Tracking Facial Features.",
                    "Interactive Analysis and Synthesis of Facial Expressions based on Personal Facial Expression Space.",
                    "An Automated Face Reader for Fatigue Detection.",
                    "Video-Rate Capture of Dynamic Face Shape and Appearance.",
                    "A Model of Facial Behaviour.",
                    "Multimodal Coordination of Facial Action, Head Rotation, and Eye Motion during Spontaneous Smiles.",
                    "Advances in Automatic Gait Recognition.",
                    "Gait Style and Gait Content: Bilinear Models for Gait Recognition Using Gait Re-sampling.",
                    "Components for Face Recognition.",
                    "Integrating Independent Components and Linear Discriminant Analysis for Gender Classification.",
                    "Recent Advances in Ear Biometrics.",
                    "Gabor Feature Based Face Recognition Using Kernel Methods.",
                    "Enhanced Human Face Image Searching System using Relevance Feedback.",
                    "Parallelization between Face Localization and Person Identification.",
                    "False Alarm Rate: a Critical Performance Measure for Face Recognition.",
                    "Ethnicity Estimation with Facial Images.",
                    "Sparse Models for Gender Classification.",
                    "A Symmetric Transformation for LDA-based Face Verification.",
                    "Evaluation of Face Alignment Solutions Using Statistical Learning.",
                    "Face Recognition Algorithm on the Basis of truncated Walsh-Hadamard Transform and Synthetic Discriminant Functions.",
                    "Nearest Manifold Approach for Face Recognition.",
                    "Illuminating Light Field: Image-based Face Recognition Across Illuminations and Poses.",
                    "Intra-Personal Kernel Space for Face Recognition.",
                    "Robust Face Recognition by Combining Projection-Based Image Correction and Decomposed Eigenface.",
                    "Decision Making in the LDA Space: Generalised Gradient Direction Metric.",
                    "A Comparison of Photometric Normalisation Algorithms for Face Verification.",
                    "Conic-Based Algorithm for Visual Line Estimation from One Image.",
                    "Integration of 2D and 3D Images for Enhanced Face Authentication.",
                    "Authenticating Corrupted Face Image Based on Noise Model.",
                    "Performance Evaluation of Face Recognition Algorithms on Asian Face Database.",
                    "Using Random Subspace to Combine Multiple Features for Face Recognition.",
                    "Subspace Analysis and Optimization for AAM Based Face Alignment.",
                    "Eigen-Harmonics Faces: Face Recognition under Generic Lighting.",
                    "3D Shape Constraint for Facial Feature Localization Using Probabilistic-like Output.",
                    "Automatic 3D Face Recognition Combining Global Geometric Features with Local Shape Variation Information.",
                    "Curse of Mis-alignment in Face Recognition: Problem and a Novel Mis-alignment Learning Solution.",
                    "Evaluation of Automatic 4D Face Recognition Using Surface and Texture Registration.",
                    "Kernel Subspace LDA with Optimized Kernel Parameters on Face Recognition.",
                    "Empirical Remarks on Output Coding Methods for Face Recognition.",
                    "Robust Precise Eye Location Under Probabilistic Framework.",
                    "Video Based Face Recognition Using Multiple Classifiers.",
                    "Database Construction & Recognition for Multi-view face.",
                    "Face Recognition Using Ada-Boosted Gabor Features.",
                    "Towards Race-Related Face Identification: Research On Skin Color Transfer.",
                    "Null Space-based Kernel Fisher Discriminant Analysis for Face Recognition.",
                    "A Comparison of Shape Constrained Facial Feature Detectors.",
                    "Face Detection Based on Kernel Fisher Discriminant Analysis.",
                    "Multiple Face Contour Detection Based on Geometric Active Contours.",
                    "A Proposal for a Person/Photograph Distinction Method with Applications to Security Systems.",
                    "Classification-Based Face Detection Using Gabor Filter Features.",
                    "Real-Time Face and Head Detection using Four Directional Features.",
                    "A Fast and Robust Face Detection based on Module Switching Network.",
                    "Robust Lip Contour Extraction using Separability of Multi-Dimensional Distributions.",
                    "Using Component Features for Face Recognition.",
                    "Hierarchical Face Tracking by Using PTZ camera.",
                    "A Two-Step Approach to Multiple Facial Feature Tracking: Temporal Particle Filter and Spatial Belief Propagation.",
                    "Facial Feature Extraction Using PCA and Wavelet Multi-Resolution Images.",
                    "AdaBoost with Totally Corrective Updates for Fast Face Detection.",
                    "Face Contour Construction with Multiple Information.",
                    "Face Detection Using One-Class-Based Support Vectors.",
                    "Skin Detection using Neighborhood Information.",
                    "A Robust Elliptical Head Tracker.",
                    "Portable Facial Information Measurement System and Its Application to Human Modeling and Human Interfaces.",
                    "Learning System of Human Facial Expression for a Family Robot.",
                    "3D Model Based Expression Tracking in Intrinsic Expression Space.",
                    "Synthesis and Recognition of Facial Expressions in Virtual 3D Views.",
                    "Facial Expression Recognition Using Fisher Weight Maps.",
                    "Recognizing Facial Actions Using Gabor Wavelets with Neutral Face Average Difference.",
                    "Realistic Multi-View Face Animation with aid of 3D PDM.",
                    "Authentic Facial Expression Analysis.",
                    "Subject-independent Natural Action Recognition.",
                    "Hand Gesture Recognition using Depth Data.",
                    "3-D Hand Trajectory Recognition for Signing Exact English.",
                    "Gesture Recognition Using Laser-Based Tracking System.",
                    "A New Instrumented Approach For Translating American Sign Language Into Sound And Text.",
                    "Transition Movement Models for Large Vocabulary Continuous Sign Language Recognition.",
                    "Deciphering Gestures with Layered Meanings and Signer Adaptation.",
                    "3D-Tracking of Head and Hands for Pointing Gesture Recognition in a Human-Robot Interaction Scenario.",
                    "Recognition of Isolated Complex Mono- and Bi-Manual 3D Hand Gestures.",
                    "Real-Time Pointing Gesture Recognition for an Immersive Environment.",
                    "Gesture Recognition Using Auto-Regressive Coefficients of Higher-Order Local Auto-Correlation Features.",
                    "Hand Shape Estimation under Complex Backgrounds for Sign Language Recognition.",
                    "Canonical Sequence Extraction and HMM Model Building Based on Hierarchical Clustering 1.",
                    "Bayesian Fusion of Hidden Markov Models for Understanding Bimanual Movements.",
                    "Finding Temporal Patterns by Data Decomposition.",
                    "Robust Hand Detection.",
                    "Towards a One-Way American Sign Language Translator.",
                    "Head Pose Estimation Using Stereo Vision For Human-Robot Interaction.",
                    "Affine Correspondence Based Head Pose Estimation for a Sequence of Images by Using a 3D Model.",
                    "Registration of Infra-red and Visible-spectrum Imagery for Face Recognition.",
                    "Learning 3D Appearance Models from Video.",
                    "Estimating Face Pose by Facial Asymmetry and Geometry.",
                    "Human Tracking using Multiple-Camera-Based Head Appearance Modeling.",
                    "Parametric Tracking of Human Contour by Exploiting Intelligent Edge.",
                    "Real Time Hand Tracking by Combining Particle Filtering and Mean Shift.",
                    "Smart Particle Filtering for 3D Hand Tracking.",
                    "Multiple-Person Tracker with a Fixed Slanting Stereo Camera.",
                    "Estimating Complicated and Overlapped Human Body Postures by Wearing a Multiple-Colored Suit Using Color Information Processing.",
                    "3D Model-Based Hand Tracking Using Stochastic Direct Search Method.",
                    "Combining Motion Segmentation with Tracking for Activity Analysis.",
                    "Mouth State Estimation in Mobile Computing Environment.",
                    "Impression Transformation of a Face Based on Discriminant Analysis on Separately Coded Representations of Facial Shape and Texture.",
                    "Recognizing Song-Based Blink Patterns: Applications for Restricted and Universal Access.",
                    "Face Hallucination with Pose Variation.",
                    "Visual Hand Motion Capture for Guiding A Dexterous Hand.",
                    "Realistic 3D Facial Animation Using Parameter-based Deformation and Texture Remapping.",
                    "On Efficient Multi-Angle Face Prototype Collection.",
                    "Extraction and Manipulation of Wrinkles and Spots for Facial Image Synthesis.",
                    "Oriented Filters for Object Recognition: an Empirical Study.",
                    "Modeling Face Appearance With Nonlinear Independent Component Analysis.",
                    "Influence of The Observation Likelihood Function on Particle Filtering Performance in Tracking Applications.",
                    "Red-Handed: Collaborative Gesture Interaction with a Projection Table.",
                    "Hierarchical Recognition of Daily Human Actions Based on Continuous Hidden Markov Models.",
                    "Non-intrusive Eye Gaze Estimation without Knowledge of Eye Pose.",
                    "Human Face Orientation Detection Using Power Spectrum Based Measurements.",
                    "Affine-Invariant Pattern Recognition using Momentums in Log-Polar Images.",
                    "Video-Based Tracking of User's Motion for Augmented Desk Interface.",
                    "From Still Image to Video-Based Face Recognition: An Experimental Analysis.",
                    "Face Recognition under Varying Lighting Conditions Using Self Quotient Image.",
                    "Face Verification Using Adapted Generative Models.",
                    "Resolution Enhancement of Facial Image Using An Error Back-Projection of Example-based Learning.",
                    "Active Morphable Model: An Efficient Method for Face Analysis.",
                    "Automatic 3D Reconstruction for Face Recognition.",
                    "A Development and Evaluation of Reactive Motion Capture System with Haptic Feedback.",
                    "Detecting Dance Motion Structure through Music Analysis.",
                    "Monocular Reconstruction of Human Motion by Qualitative Selection.",
                    "Tracking Humans using Prior and Learned Representations of Shape and Appearance.",
                    "Multiple Frame Motion Inference Using Belief Propagation.",
                    "Automated Gesture Segmentation From Dance Sequences.",
                    "A Boosted Classifier Tree for Hand Shape Detection.",
                    "3-D Hand Posture Recognition by Training Contour Variation."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th FGR 2002",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2002",
                "sub_name": "5th IEEE International Conference on Automatic Face and Gesture Recognition (FGR 2002), with CD-ROM, 20-21 May 2002, Washington, D.C., USA.",
                "count": 68,
                "papers": [
                    "Eigen Light-Fields and Face Recognition Across Pose.",
                    "Real-Time, Fully Automatic Upper Facial Feature Tracking.",
                    "A Unified Learning Framework for Real Time Face Detection and Classification.",
                    "Consistency and Coupling in Human Model Likelihoods.",
                    "An Investigation into the Use of Partial-Faces for Face Recognition.",
                    "Human Detection using Geometrical Pixel Value Structures.",
                    "An Appearance-Based Framework for 3D Hand Shape Classification and Camera Viewpoint Estimation.",
                    "The CMU Pose, Illumination, and Expression (PIE) Database.",
                    "Smiling Faces are Better for Face Recognition.",
                    "Face Database Retrieval Using Pseudo 2D Hidden Markov Models.",
                    "Pose-Invariant Face Recognition with Parametric Linear Subspaces.",
                    "Recognition of Human Body Posture from a Cloud of 3D Data Points using Wavelet Transform Coefficients.",
                    "Facial Component Extraction and Face Recognition with Support Vector Machines.",
                    "Head Tracking by Active Particle Filtering.",
                    "An Automatic Method For Determining Quaternion Field Boundaries for Ball-and-Socket Joint Limits.",
                    "Non-Contact Eye Gaze Tracking System by Mapping of Corneal Reflections.",
                    "Multi-View Face Pose Estimation Based on Supervised ISA Learning.",
                    "Robust Facial Expression Recognition Using a State-Based Model of Spatially-Localised Facial Dynamics.",
                    "Mode-based Multi-Hypothesis Head Tracking Using Parametric Contours.",
                    "Hierarchical Wavelet Networks for Facial Feature Localization.",
                    "Subpixel Eye Gaze Tracking.",
                    "Baseline Results for the Challenge Problem of Human ID Using Gait Analysis.",
                    "Algorithms for Inference in Specialized Maps for Recovering 3D Hand Pose.",
                    "Real-Time Multi-View Face Detection.",
                    "Gait Analysis for Recognition and Classification.",
                    "Robust Full-Motion Recovery of Head by Dynamic Templates and Re-Registration Techniques.",
                    "An HMM-based Temporal Difference Learning with Model-Updating Capability for Visual Tracking of Human Communicational Behaviors.",
                    "On Probabilistic Combination of Face and Gait Cues for Identification.",
                    "Exemplar-Based Face Recognition from Video.",
                    "On Importance of Nose for Face Tracking.",
                    "Face Recognition Using Kernel Based Fisher Discriminant Analysis.",
                    "Face Identification across Different Poses and Illuminations with a 3D Morphable Model.",
                    "Facial Asymmetry Quantification for Expression Invariant Human Identification.",
                    "Kernel Eigenfaces vs. Kernel Fisherfaces: Face Recognition Using Kernel Methods.",
                    "Face Recognition from Video: A CONDENSATION Approach.",
                    "Evaluation of Gabor-Wavelet-Based Facial Action Unit Recognition in Image Sequences of Increasing Complexity.",
                    "Meta-Analysis of Face Recognition Algorithms.",
                    "A Comparison of Gabor Filter Methods for Automatic Detection of Facial Landmarks.",
                    "Adaptive Color Space Switching for Face Tracking in Multi-Colored Lighting Environments.",
                    "Model-Based Head Pose Tracking With Stereovision.",
                    "An Adaptive Fusion Architecture for Target Tracking.",
                    "Motion-Based Recognition of People in EigenGait Space.",
                    "Two-Handed Gesture Tracking Incorporating Template Warping with Static Segmentation.",
                    "Generative and Discriminative Face Modelling for Detection.",
                    "Model-Based Face Tracking for View-Independent Facial Expression Recognition.",
                    "A PCA/MDA Scheme for Hand Posture Recognition.",
                    "A Modification of Kernel-based Fisher Discriminant Analysis for Face Detection.",
                    "A New Robust Face Detection in Color Images.",
                    "A SRN/HMM System for Signer-Independent Continuous Sign Language Recognition.",
                    "Hand Gesture Recognition Following the Dynamics of a Topology-Preserving Network.",
                    "Multi-View Face Alignment Using Direct Appearance Models.",
                    "An Efficient Method for Recognition of Human Faces Using Higher Orders Pseudo Zernike Moment Invariant.",
                    "Gait-Based Recognition of Humans Using Continuous HMMs.",
                    "Robust Face Detection at Video Frame Rate Based on Edge Orientation Features.",
                    "Recognition of Arm Movements.",
                    "Clustering Contextual Facial Display Sequences.",
                    "An Approach to Automatic Recognition of Spontaneous Facial Actions.",
                    "Silhouette-Based Human Identification from Body Shape and Gait.",
                    "Stride and Cadence as a Biometric in Automatic Person Identification and Verification.",
                    "Detection of People Carrying Objects: A Motion-Based Recognition Approach.",
                    "On Modeling Variations for Face Authentication.",
                    "Fast Stereo-Based Head Tracking for Interactive Environments.",
                    "Visual Prosody: Facial Movements Accompanying Speech.",
                    "Interacting with Steerable Projected Displays.",
                    "An Approach Based on Phonemes to Large Vocabulary Chinese Sign Language Recognition.",
                    "Human Action Recognition in Smart Classroom.",
                    "Hand Gesture Recognition using Multi-Scale Colour Features, Hierarchical Models and Particle Filtering.",
                    "Real-Time Tracking of Multiple Fingertips and Gesture Recognition for Augmented Desk Interface Systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "4th FG 2000",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/2000",
                "sub_name": "4th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2000), 26-30 March 2000, Grenoble, France.",
                "count": 87,
                "papers": [
                    "Using Computer Graphics to Study the Recognition of Facial Attributions.",
                    "Robust Facial Feature Localization by Coupled Features.",
                    "Real-Time Multiple Face Detection Using Active Illumination.",
                    "Face Detection Using Multi-Modal Information.",
                    "Viewpoint-Invariant Learning and Detection of Human Heads.",
                    "Face Shape Extraction and Recognition Using 3D Morphing and Distance Mapping.",
                    "Face Matching through Information Theoretical Attention Points and Its Applications to Face Detection and Classification.",
                    "Real-Time Detection of Nodding and Head-Shaking by Directly Detecting and Tracking the \"Between-Eyes\".",
                    "Comprehensive Database for Facial Expression Analysis.",
                    "Comparative Performance of Different Skin Chrominance Models and Chrominance Spaces for the Automatic Detection of Human Faces in Color Images.",
                    "Estimation of the Illuminant Color from Human Skin Color.",
                    "Face Detection Using Mixtures of Linear Subspaces.",
                    "A Fast and Accurate Face Detector for Indexation of Face Images.",
                    "Hallucinating Faces.",
                    "Robust Face Tracking Using Color.",
                    "Learning-Based Approach to Real Time Tracking and Analysis of Faces.",
                    "Self-Organized Integration of Adaptive Visual Cues for Face Tracking.",
                    "Dual-State Parametric Eye Tracking.",
                    "Detection and Tracking of Facial Features in Real Time Using a Synergistic Approach of Spatio-Temporal Models and Generalized Hough-Transform Techniques.",
                    "Real-Time Stereo Tracking for Head Pose and Gaze Estimation.",
                    "Improving Face Tracking with 2D Template Warping.",
                    "Dynamic Facial Caricaturing System Based on the Gaze Direction of Gallery.",
                    "Analysis and Synthesis of Pose Variations of Human Faces by a Linear PCMAP Model and its Application for Pose-Invariant Face Recognition System.",
                    "Human Head Tracking Using Adaptive Appearance Models with a Fixed-Viewpoint Pan-Tilt-Zoom Camera.",
                    "Focus of Attention for Face and Hand Gesture Recognition Using Multiple Cameras.",
                    "Comparative Evaluation of Face Sequence Matching for Content-Based Video Access.",
                    "A Robust Model-Based Approach for 3D Head Tracking in Video Sequences.",
                    "Robust 3D Head Tracking Under Partial Occlusion.",
                    "Wide-Range, Person- and Illumination-Insensitive Head Orientation Estimation.",
                    "Face Analysis for the Synthesis of Photo-Realistic Talking Heads.",
                    "Gesture in Conversation: Problems in Description and Interpretation.",
                    "Face Recognition by Support Vector Machines.",
                    "Classifying Facial Attributes Using a 2-D Gabor Wavelet and Discriminant Analysis.",
                    "Learning Support Vectors for Face Verification and Recognition.",
                    "Memory-Based Face Recognition for Visitor Identification.",
                    "Performance Assessment of a Face Verification Based Access Control System.",
                    "View-Based Active Appearance Models.",
                    "3D Human Face Recognition Using Point Signature.",
                    "Face Recognition Based on Multiple Facial Features.",
                    "Pose Invariant Face Recognition.",
                    "An Incremental Learning Method for Face Recognition under Continuous Video Stream.",
                    "Comparison of Confidence Measures for Face Recognition.",
                    "The Global Dimensionality of Face Space.",
                    "Determining Correspondences for Statistical Models of Facial Appearance.",
                    "From Few to Many: Generative Models for Recognition Under Variable Pose and Illumination.",
                    "SFS Based View Synthesis for Robust Face Recognition.",
                    "Face Recognition in a Meeting Room.",
                    "Support Vector Regression and Classification Based Multi-View Face Detection and Recognition.",
                    "Gender Classification with Support Vector Machines.",
                    "A Probabilistic Sensor for the Perception of Activities.",
                    "Video Annotation for Content-based Retrieval using Human Behavior Analysis and Domain Knowledge.",
                    "Human Body Postures from Trinocular Camera Images.",
                    "Bimodal Emotion Recognition.",
                    "Tracking a Person with 3-D Motion by Integrating Optical Flow and Depth.",
                    "Person Tracking in Real-World Scenarios Using Statistical Methods.",
                    "Tracking Interacting People.",
                    "Human Action Tracking Guided by Key-Frames.",
                    "Multiple Cues used in Model-Based Human Motion Capture.",
                    "A Framework for Modeling the Appearance of 3D Articulated Figures.",
                    "Understanding Purposeful Human Motion.",
                    "Audio-Visual Speaker Detection Using Dynamic Bayesian Networks.",
                    "Towards Automatic Face Identification Robust to Ageing Variation.",
                    "What Are Faces and Hands Good for Anyway.",
                    "Crane Gesture Recognition Using Pseudo 3-D Hidden Markov Models.",
                    "Automatic Handwriting Gestures Recognition Using Hidden Markov Models.",
                    "Gesture Modeling and Recognition Using Finite State Machines.",
                    "Towards Model-Based Gesture Recognition.",
                    "Exploiting Speech/Gesture Co-occurrence for Improving Continuous Gesture Recognition in Weather Narration.",
                    "A Continuous Chinese Sign Language Recognition System.",
                    "A Method for Recognizing a Sequence of Sign Language Words Represented in a Japanese Sign Language Sentence.",
                    "Relevant Features for Video-Based Continuous Sign Language Recognition.",
                    "Segmenting Hands of Arbitrary Color.",
                    "Hand Gesture Recognition Using Input-Output Hidden Markov Models.",
                    "Fast Tracking of Hands and Fingertips in Infrared Images for Augmented Desk Interface.",
                    "Detection and Estimation of Pointing Gestures in Dense Disparity Maps.",
                    "Constraint-Conscious Smoothing Framework for the Recovery of 3D Articulated Motion from Image Sequences.",
                    "Recognizing Lower Face Action Units for Facial Expression Analysis.",
                    "A Probabilistic Framework for Rigid and Non-Rigid Appearance Based Tracking and Recognition.",
                    "An Algorithm for Real-Time Stereo Vision Implementation of Head Pose and Gaze Direction Measurement.",
                    "Learning and Synthesizing Human Body Motion and Posture.",
                    "Evaluation of Sensor Calibration in a Biometric Person Recognition Framework Based on Sensor Fusion.",
                    "Extraction of Parametric Human Model for Posture Recognition Using Genetic Algorithm.",
                    "Automatic Face Modeling from Monocular Image Sequences Using Modified Non Parametric Regression and an Affine Camera Model.",
                    "Virtual View Face Image Synthesis Using 3D Spring-Based Face Model from a Single Image.",
                    "A Virtual 3D Blackboard: 3D Finger Tracking Using a Single Camera.",
                    "Toward Real-Time Human-Computer Interaction with Continuous Dynamic Hand Gestures.",
                    "Face Recognition Algorithms as Models of Human Face Processing."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "3rd FG 1998",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/1998",
                "sub_name": "3rd International Conference on Face & Gesture Recognition (FG '98), April 14-16, 1998, Nara, Japan.",
                "count": 99,
                "papers": [
                    "Nonverbal Information Recognition and Its Application to Communications.",
                    "Extracting Gestural Motion Trajectories.",
                    "Recognizing Temporal Trajectories Using the Condensation Algorithm.",
                    "Dynamic Models of Human Motion.",
                    "Beyond Eigenfaces: Probabilistic Matching for Face Recognition.",
                    "Face Verification based on Morphological Shape Decomposition.",
                    "A Robust Face Identification against Lighting Fluctuation for Lock Control.",
                    "The FERET Verification Testing Protocol for Face Recognition Algorithms.",
                    "A Multi-Scale Morphological Method for Human Posture Recognition.",
                    "Face Indexing on Video Data - Extraction, Recognition, Tracking and Modeling.",
                    "Scale Invariant Face Detection Method Using Higher-Order Local Autocorrelation Features Extracted from Log-Polar Image.",
                    "Object Oriented Face Detection Using Range and Color Information.",
                    "Detecting Head Pose from Stereo Image Sequence for Active Face Recognition.",
                    "3D Head Pose Estimation without Feature Tracking.",
                    "Integration of Eigentemplate and Structure Matching for Automatic Facial Feature Detection.",
                    "Head Pose Determination from One Image Using a Generic Model.",
                    "Human Face Structure Estimation from Multiple Images Using the 2D Affine Space.",
                    "Automatic Detection of Human Faces in Natural Scene Images by Use of a Skin Color Model and of Invariant Moments.",
                    "A Similarity-Based Method for the Generalization of Face Recognition over Pose and Expression.",
                    "Locating Facial Region of a Head-and-Shoulders Color Image.",
                    "Face Detection Based on Color and Local Symmetry Information.",
                    "Automatic Pose Estimation System for Human Faces Based on Bunch Graph Matching Technology.",
                    "3-D Facial Pose and Gaze Point Estimation Using a Robust Real-Time Tracking Paradigm.",
                    "3D Face Modeling from Stereo and Differential Constraints.",
                    "Lip Movement Synthesis from Speech Based on Hidden Markov Models.",
                    "A Qualitative Approach to Classifying Gaze Direction.",
                    "Tracking Facial Features Using Probabilistic Network.",
                    "Wavelet-Domain Principal Component Analysis Applied to Facial Similarity Trees, Caricaturing, and Nonlinear Illumination-Invariant Processing.",
                    "Face Similarity Space as Perceived by Humans and Artificial Systems.",
                    "Synthesis of Facial Images with Lip Motion from Several Real Views.",
                    "Lip Motion Capture and Its Application to 3-D Molding.",
                    "Gender and Ethnic Classification of Face Images.",
                    "Coding Facial Expressions with Gabor Wavelets.",
                    "Temporal Differences in Eye and Mouth Movements Classifying Facial Expressions of Smiles.",
                    "1ms VLSI Vision Chip System and Its Applications.",
                    "W4: Who? When? Where? What? A Real Time System for Detecting and Tracking People.",
                    "Tracking and Segmenting People in Varying Lighting Conditions Using Colour.",
                    "Reach Out and Touch Space (Motion Learning).",
                    "Locating Salient Facial Features Using Image Invariants.",
                    "Spatiotemporal Analysis of Face Profiles: Detection, Segmentation, and Registration.",
                    "Facial Contour Extraction Model.",
                    "Learning to Identify and Track Faces in Image Sequences.",
                    "Hand Gesture Estimation and Model Refinement Using Monocular Camera - Ambiguity Limitation by Inequality Constraints.",
                    "Tracking Hand Dynamics in Unconstrained Environments.",
                    "Evolution of Optimal Projection Axes (OPA) for Face Recognition.",
                    "Partial Face Recognition Using Radial Basis Function Networks.",
                    "Face Recognition Using Binary Image Metrics.",
                    "Interpreting Face Images Using Active Appearance Models.",
                    "Face Identification Using a 3D Gray-Scale Image - A Method for Lessening Restrictions on Facial Directions.",
                    "Real-Time Face Recognition Using Feature Combination.",
                    "Face Recognition Using Temporal Image Sequence.",
                    "Expression Recognition from Time-Sequential Facial Images by Use of Expression Change Model.",
                    "Hatched Image Representation of Human Faces Based on a Cognitive Model.",
                    "Discriminant Analysis of Principal Components for Face Recognition.",
                    "Facial Image Reconstruction by Estimated Muscle Parameter.",
                    "Face Recognition from Unfamiliar Views: Subspace Methods and Pose Dependency.",
                    "Online Facial Expression Recognition Based on Personalized Galleries.",
                    "Statistical Analysis of Gabor-Filter Representation.",
                    "Multimodal Human Emotion/Expression Recognition.",
                    "Curvature-Based Face Surface Recognition Using Spherical Correlation - Principal Directions for Curved Object Recognition.",
                    "Facial Expression Space for Smooth Tele-Communications.",
                    "Toward Automation of Learning: The State Self-Organization Problem for a Face Recognizer.",
                    "Automated Facial Expression Recognition Based on FACS Action Units.",
                    "Feature-Point Tracking by Optical Flow Discriminates Subtle Differences in Facial Expression.",
                    "Generalizing Capacity of Face Database for Face Recognition.",
                    "Comparisons between Human and Computer Recognition of Faces.",
                    "View-Based Interpretation of Real-Time Optical Flow for Gesture Recognition.",
                    "Gesture Recognition Using HLAC Features of PARCOR Images and HMM Based Recognizer.",
                    "Real Time Gesture Recognition Using Eigenspace from Multi Input Image Sequence.",
                    "Gaze Estimation Using Morphable Models.",
                    "Spotting Segments Displaying Facial Expression from Image Sequences Using HMM.",
                    "Physical Facial Model Based on 3D-CT Data for Facial Image Analysis and Synthesis.",
                    "Comparison Between Geometry-Based and Gabor-Wavelets-Based Facial Expression Recognition Using Multi-Layer Perceptron.",
                    "Color-Based Hands Tracking System for Sign Language Recognition.",
                    "Manipulative Hand Gesture Recognition Using Task Knowledge for Human Computer Interaction.",
                    "Cue Circles: Image Feature for Measuring 3-D Motion of Articulated Objects Using Sequential Image Pair.",
                    "Geometric-Imprints: A Significant Points Extraction Method for the Scan&Track Virtual Environment.",
                    "User Localisation for Visually-Based Human-Machine-Interaction.",
                    "Real-Time Human Posture Estimation Using Monocular Thermal Images.",
                    "Multiple-Human Tracking Using Multiple Cameras.",
                    "A Prototype System for Intuitive Film Planning.",
                    "View Alignment with Dynamically Updated Affine Tracking.",
                    "PersonSpotter - Fast and Robust System for Human Detection, Tracking and Recognition.",
                    "3-D Human Motion Sensing by Artificial Retina Chips.",
                    "A New Robust Real-Time Method for Extracting Human Silhouettes from Color Images.",
                    "Design and Evaluation of Gesture Interface of an Immersive Walk-through Application for Exploring Cyberspace.",
                    "MMID: Multimodal Multi-view Integrated Database for Human Behavior Understanding.",
                    "A Gesture Interface for Human-Robot-Interaction.",
                    "Description and Recognition of Human Gestures Based on the Transition of Curvature from Motion Images.",
                    "A Real-Time Continuous Gesture Recognition System for Sign Language.",
                    "Panorama: A What I See Is What I Want Contactless Visual Interface.",
                    "Active Hand Tracking.",
                    "Realtime Gesture Recognition under the Multi-Layered Parallel Recognition Framework of QVIPS.",
                    "Finding Pose of Hand in Video Images: A Stereo-Based Approach.",
                    "Meaningful Gestures for Human Computer Interaction: Beyond Hand Postures.",
                    "Priority and Segmentation Algorithm for the 3-D Motion Estimation of Two Heads Partly Overlapped.",
                    "Skill Recognition.",
                    "Iamascope: A Musical Application for Image Processing.",
                    "A Virtual Mirror Interface Using Real-Time Robust Face Tracking."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "2nd FG 1996",
        "info": "Killington, Vermont, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fgr/1996",
                "sub_name": "2nd International Conference on Automatic Face and Gesture Recognition (FG '96), October 14-16, 1996, Killington, Vermont, USA.",
                "count": 66,
                "papers": [
                    "Invited Speech: \"Speechreading: An Overview of Image Processing, Feature Extraction, Sensory Intergration and Pattern Recognition Techiques.",
                    "Manifold Caricatures: on the Psychological Consistency of Computer Face Recognition.",
                    "Face distinctiveness in recognition across viewpoint: An analysis of the statistical structure of face spaces.",
                    "A probabilistic framework for perceptual grouping of features for human face detection.",
                    "Learning novel views to a single face image.",
                    "Invited Speech: \"Gestural Interface to a visual computing Environment for Molecular biologists\".",
                    "Cardboard People: A Parameterized Model of Articulated Image Motion.",
                    "Recognizing Articulated Objects with Information Theoretic Methods.",
                    "Pfinder: real-time tracking of the human body.",
                    "Vision-Based HCI - What's Next and What are the Difficult Problems?",
                    "Dynamical system representation, generation, and recognition of basic oscillatory motion gestures.",
                    "Recovering the Temporal Structure of Natural Gesture.",
                    "A Theoretical Consideration of Pattern Space Trajectory for Gesture Spotting Recognition.",
                    "Inductive learning in hand pose recognition.",
                    "What You Need to Know about Spontaneous Gesture, and You Need to Know It.",
                    "Multi-Modal System for Locating Heads and Faces.",
                    "Understanding manipulation in video.",
                    "Computer vision for computer games.",
                    "Coordination of Perceptual Processes for Computer Mediated Communication.",
                    "Trends in Understanding and Perception of Humans.",
                    "Facial Analysis and Synthesis Using Image-Based Models.",
                    "Eigen-points: Control-point Location using Principle Component Analyses.",
                    "Automatic interpolation and recognition of face images by morphing.",
                    "Face Recognition: Where are We Now and Where are We Going?",
                    "Towards 3D hand tracking using a deformable model.",
                    "Deformable Model-Based Face Shape and Motion Estimation.",
                    "Toward the use of gesture in traditional user interfaces.",
                    "Invariant features for 3-D gesture recognition.",
                    "Face and Hand Gesture Recognition Using Hybrid Classifiers.",
                    "Robust classification of hand postures against complex backgrounds.",
                    "Tracking and Learning Graphs and Pose on Image Sequences of Faces.",
                    "Comparison of visible and infra-red imagery for face recognition.",
                    "Standards for Automatic Face and Gesture Recognition.",
                    "Discriminant analysis and eigenspace partition tree for face and object recognition from views.",
                    "Information Theoretic View-Based and Modular Face Detection.",
                    "Locating Faces Using Statistical Feature Detectors.",
                    "Edge and Keypoint Detection in Facial Regions.",
                    "Visual Filters for Face Recognition.",
                    "Towards unconstrained face recognition from image sequences.",
                    "Locating Facial Features in Image Sequences using Neural Networks.",
                    "Segmentation and Tracking of Faces in Color Images.",
                    "Computing 3-D head orientation from a monocular image sequence.",
                    "Detection of human faces using decision trees.",
                    "Happy Patrons Make Better Tippers: Creating a Robot Waiter Using Perseus and the Animate Agent Architecture.",
                    "Hand sign recognition from intensity image sequences with complex backgrounds.",
                    "An Investigation into Face Pose Distributions.",
                    "Tracking Faces.",
                    "Adaptive Automatic Facial Feature Segmentation.",
                    "LISTEN: A System for Locating and Tracking Individual Speakers.",
                    "Recognition of Social Dancing from Auditory and Visual Information.",
                    "Detection of human faces under scale, orientation and viewpoint variations.",
                    "From 2D Images to 3D Face Geometry.",
                    "Maximum Likelihood Face Detection.",
                    "Finding skin in color images.",
                    "Spotting recognition of human gestures from time-varying images.",
                    "Real-Time Hand-Arm Motion Analysis using a single Video Camera.",
                    "Modelling the variability in face images.",
                    "Face detection using local maxima.",
                    "Real-Time Facial Analysis for Virtual Teleconferencing.",
                    "Face and Facial Feature Extraction from Color Image.",
                    "Real-Time Visual Recognition of Facial Gestures for Human-Computer Interaction.",
                    "Robust face feature analysis for automatic speechreading and character animation.",
                    "Automatic Spoken Affect Classification and Analysis.",
                    "Visual Interaction With Lifelike Characters.",
                    "Example-based head tracking.",
                    "Toward Robust Skin Identification in Video Images."
                ]
            }
        ]
    }
]