[
    {
        "year": "2021",
        "name": "31st ICAPS 2021",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2021",
                "sub_name": "Proceedings of the Thirty-First International Conference on Automated Planning and Scheduling, ICAPS 2021, Guangzhou, China (virtual), August 2-13, 2021.",
                "count": 77,
                "papers": [
                    "Blind Decision Making: Reinforcement Learning with Delayed Observations.",
                    "The Consistent Case in Bidirectional Search and a Bucket-to-Bucket Algorithm as a Middle Ground between Front-to-End and Front-to-Front.",
                    "Conflict-Free Multi-Agent Meeting.",
                    "Block Compression and Invariant Pruning for SAT-based Totally-Ordered HTN Planning.",
                    "A Closer Look at Causal Links: Complexity Results for Delete-Relaxation in Partial Order Causal Link (POCL) Planning.",
                    "On Planning with Qualitative State-Trajectory Constraints in PDDL3 by Compiling them Away.",
                    "Computing Opportunities to Augment Plans for Novel Replanning during Execution.",
                    "Explaining Path Plan Optimality: Fast Explanation Methods for Navigation Meshes Using Full and Incremental Inverse Optimization.",
                    "Exploiting Cyclic Dependencies in Landmark Heuristics.",
                    "Fully Observable Nondeterministic HTN Planning - Formalisation and Complexity Results.",
                    "S*: A Heuristic Information-Based Approximation Framework for Multi-Goal Path Finding.",
                    "Delete-Relaxation Heuristics for Lifted Classical Planning.",
                    "Improving AlphaZero Using Monte-Carlo Graph Search.",
                    "OMCoRP: An Online Mechanism for Competitive Robot Prioritization.",
                    "Compositional Approach to Translate LTLf/LDLf into Deterministic Finite Automata.",
                    "Subset-Saturated Transition Cost Partitioning.",
                    "Multiple Plans are Better than One: Diverse Stochastic Planning.",
                    "Approximate Bi-Criteria Search by Efficient Representation of Subsets of the Pareto-Optimal Frontier.",
                    "Translating Totally Ordered HTN Planning Problems to Classical Planning Problems Using Regular Approximation of Context-Free Languages.",
                    "Loop Detection in the PANDA Planning System.",
                    "Endomorphisms of Lifted Planning Problems.",
                    "Jump Point Search with Temporal Obstacles.",
                    "Total Completion Time Minimization for Scheduling with Incompatibility Cliques.",
                    "Pattern Databases for Goal-Probability Maximization in Probabilistic Planning.",
                    "LM-cut and Operator Counting Heuristics for Optimal Numeric Planning with Simple Conditions.",
                    "Width-Based Backward Search.",
                    "Decentralized Refinement Planning and Acting.",
                    "A Competitive Analysis of Online Multi-Agent Path Finding.",
                    "Rule-based Shielding for Partially Observable Monte-Carlo Planning.",
                    "Translations from Discretised PDDL+ to Numeric Planning.",
                    "Scheduling with Complete Multipartite Incompatibility Graph on Parallel Machines.",
                    "Dantzig-Wolfe Decomposition for Cost Partitioning.",
                    "Distributed Fair Scheduling for Information Exchange in Multi-Agent Systems.",
                    "Flexible FOND Planning with Explicit Fairness Assumptions.",
                    "Non-Deterministic Conformant Planning Using a Counterexample-Guided Incremental Compilation to Classical Planning.",
                    "Knowledge Compilation for Nondeterministic Action Languages.",
                    "Online Saturated Cost Partitioning for Classical Planning.",
                    "Contracting and Compressing Shortest Path Databases.",
                    "Iterative-deepening Bidirectional Heuristic Search with Restricted Memory.",
                    "Situated Temporal Planning Using Deadline-aware Metareasoning.",
                    "Approximate Novelty Search.",
                    "On the Compilability and Expressive Power of State-Dependent Action Costs.",
                    "Scheduling Stochastic Jobs - Complexity and Approximation Algorithms.",
                    "Automatic Instance Generation for Classical Planning.",
                    "Conflict-Based Increasing Cost Search.",
                    "Online Hedge Reservation for Diverse Plans and Competitive Analysis.",
                    "Towards Time-Optimal Any-Angle Path Planning With Dynamic Obstacles.",
                    "Temporal Reasoning with Kinodynamic Networks.",
                    "Privacy-Preserving Algorithm for Decoupling of Multi-Agent Plans with Uncertainty.",
                    "A Simulator-based Planning Framework for Optimizing Autonomous Greenhouse Control Strategy.",
                    "Automated Design of fMRI Paradigms.",
                    "In-Station Train Dispatching: A PDDL+ Planning Approach.",
                    "GRAND-VISION: An Intelligent System for Optimized Deployment Scheduling of Law Enforcement Agents.",
                    "A Deep Ensemble Method for Multi-Agent Reinforcement Learning: A Case Study on Air Traffic Control.",
                    "Scalable Rail Planning and Replanning: Winning the 2020 Flatland Challenge.",
                    "vPlanSim: An Open Source Graphical Interface for the Visualisation and Simulation of AI Systems.",
                    "Autonomous Building of Structures in Unstructured Environments via AI Planning.",
                    "Automated Production Scheduling for Artificial Teeth Manufacturing.",
                    "DeepFreight: A Model-free Deep-reinforcement-learning-based Algorithm for Multi-transfer Freight Delivery.",
                    "Hierarchical Width-Based Planning and Learning.",
                    "Speeding Up Search-Based Motion Planning using Expansion Delay Heuristics.",
                    "RePReL: Integrating Relational Planning and Reinforcement Learning for Effective Abstraction.",
                    "Integrating Knowledge Compilation with Reinforcement Learning for Routes.",
                    "Meta Reinforcement Learning for Heuristic Planing.",
                    "Abstraction-Guided Policy Recovery from Expert Demonstrations.",
                    "Generalized Planning as Heuristic Search.",
                    "Robust Opponent Modeling via Adversarial Ensemble Reinforcement Learning.",
                    "Learning and Exploiting Shaped Reward Models for Large Scale Multiagent RL.",
                    "Learning Heuristic Selection with Dynamic Algorithm Configuration.",
                    "Data-Driven Decision-Theoretic Planning using Recurrent Sum-Product-Max Networks.",
                    "Predicted Composite Signed-Distance Fields for Real-Time Motion Planning in Dynamic Environments.",
                    "Guiding Robot Exploration in Reinforcement Learning via Automated Planning.",
                    "E2Coop: Energy Efficient and Cooperative Obstacle Detection and Avoidance for UAV Swarms.",
                    "Task-Aware Waypoint Sampling for Robotic Planning.",
                    "PLGRIM: Hierarchical Value Learning for Large-scale Exploration in Unknown Environments.",
                    "Hierarchical Freespace Planning for Navigation in Unfamiliar Worlds.",
                    "Verifying Plans and Scripts for Robotics Tasks Using Performance Level Profiles."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "30th ICAPS 2020",
        "info": "Nancy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2020",
                "sub_name": "Proceedings of the Thirtieth International Conference on Automated Planning and Scheduling, Nancy, France, October 26-30, 2020.",
                "count": 69,
                "papers": [
                    "Hierarchical Graph Traversal for Aggregate k Nearest Neighbors Search in Road Networks.",
                    "Observation Decoding with Sensor Models: Recognition Tasks via Classical Planning.",
                    "Stochastic Fairness and Language-Theoretic Fairness in Planning in Nondeterministic Domains.",
                    "Probabilistic Robust Multi-Agent Path Finding.",
                    "Through the Lens of Sequence Submodularity.",
                    "Multiple-Environment Markov Decision Processes: Efficient Analysis and Applications.",
                    "Adaptive Informative Path Planning with Multimodal Sensing.",
                    "Multi-Tier Automated Planning for Adaptive Behavior.",
                    "Solving the Longest Simple Path Problem with Heuristic Search.",
                    "Lifted Successor Generation Using Query Optimization Techniques.",
                    "Certified Unsolvability for SAT Planning with Property Directed Reachability.",
                    "EFP 2.0: A Multi-Agent Epistemic Solver with Multiple E-State Representations.",
                    "Solving K-MDPs.",
                    "A Novel Lookahead Strategy for Delete Relaxation Heuristics in Greedy Best-First Search.",
                    "Strengthening Potential Heuristics with Mutexes and Disambiguations.",
                    "Online Computation of Euclidean Shortest Paths in Two Dimensions.",
                    "A Simple and Fast Bi-Objective Search Algorithm.",
                    "Faster Dynamic-Consistency Checking for Conditional Simple Temporal Networks.",
                    "Algorithm Selection for Optimal Multi-Agent Pathfinding.",
                    "Sequencing Operator Counts with State-Space Search.",
                    "Analyzing and Avoiding Pathological Behavior in Parallel Best-First Search.",
                    "New Valid Inequalities in Branch-and-Cut-and-Price for Multi-Agent Path Finding.",
                    "New Techniques for Pairwise Symmetry Breaking in Multi-Agent Path Finding.",
                    "Efficient Robot Planning for Achieving Multiple Independent Partially Observable Tasks That Evolve over Time.",
                    "On the Computational Complexity of Multi-Agent Pathfinding on Directed Graphs.",
                    "Convex Hull Monte-Carlo Tree-Search.",
                    "Search-Guidance Mechanisms for Numeric Planning Through Subgoaling Relaxation.",
                    "POMDP + Information-Decay: Incorporating Defender's Behaviour in Autonomous Penetration Testing.",
                    "Incremental Search for Counterexample-Guided Cartesian Abstraction Refinement.",
                    "Solving the Watchman Route Problem on a Grid with Heuristic Search.",
                    "Privacy Preserving Planning in Stochastic Environments.",
                    "When Perfect Is Not Good Enough: On the Search Behaviour of Symbolic Heuristic Search.",
                    "TLdR: Policy Summarization for Factored SSP Problems Using Temporal Abstractions.",
                    "Predicting the Effectiveness of Bidirectional Heuristic Search.",
                    "Computing Close to Optimal Weighted Shortest Paths in Practice.",
                    "Revisiting Bounded-Suboptimal Safe Interval Path Planning.",
                    "Contention-Aware Mapping and Scheduling Optimization for NoC-Based MPSoCs.",
                    "Dynamic Controllability and (J, K)-Resiliency in Generalized Constraint Networks with Uncertainty.",
                    "Multi-Agent Path Finding with Mutex Propagation.",
                    "Bounded Suboptimal Path Planning with Compressed Path Databases.",
                    "New Developments for Robert - Assisting Novice Users Even Better in DIY Projects.",
                    "Scheduling with Complex Consumptive Resources for a Planetary Rover.",
                    "Solving the Test Laboratory Scheduling Problem with Variable Task Grouping.",
                    "Online Traffic Signal Control through Sample-Based Constrained Optimization.",
                    "Driver Activity Recognition by Means of Temporal HTN Planning.",
                    "Optimal and Heuristic Approaches for Constrained Flight Planning under Weather Uncertainty.",
                    "Deep Reinforcement Learning Approach to Solve Dynamic Vehicle Routing Problem with Stochastic Customers.",
                    "Exploring Context-Free Languages via Planning: The Case for Automating Machine Learning.",
                    "An AI-Based Planning Framework for HAPS in a Time-Varying Environment.",
                    "Solving Large Real-Life Bus Driver Scheduling Problems with Complex Break Constraints.",
                    "A Decentralised Strategy for Heterogeneous AUV Missions via Goal Distribution and Temporal Planning.",
                    "PDDLStream: Integrating Symbolic Planners and Blackbox Samplers via Optimistic Adaptive Planning.",
                    "Generating Explanations for Temporal Logic Planner Decisions.",
                    "Real Time Crowd Navigation from First Principles of Probability Theory.",
                    "Refining Process Descriptions from Execution Data in Hybrid Planning Domain Models.",
                    "Integrating Acting, Planning, and Learning in Hierarchical Operational Models.",
                    "- D3WA+ - A Case Study of XAIP in a Model Acquisition Task for Dialogue Planning.",
                    "We Mind Your Well-Being: Preventing Depression in Uncertain Social Networks by Sequential Interventions.",
                    "Learning Sequences of Approximations for Hierarchical Motion Planning.",
                    "Imitation Learning over Heterogeneous Agents with Restraining Bolts.",
                    "Learning Neural Search Policies for Classical Planning.",
                    "Learning Model Parameters for Decentralized Schedule-Driven Traffic Control.",
                    "Symbolic Plans as High-Level Instructions for Reinforcement Learning.",
                    "Reinforcement Learning for Zone Based Multiagent Pathfinding under Uncertainty.",
                    "Utilising Uncertainty for Efficient Learning of Likely-Admissible Heuristics.",
                    "Generating and Exploiting Cost Predictions in Heuristic State-Space Planning.",
                    "Learning Domain-Independent Planning Heuristics with Hypergraph Networks.",
                    "Guidelines for Action Space Definition in Reinforcement Learning-Based Traffic Signal Control Systems.",
                    "Joint Inference of Reward Machines and Policies for Reinforcement Learning."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "29th ICAPS 2019",
        "info": "Berkeley, CA, USA",
        "venues": []
    },
    {
        "year": "2018",
        "name": "28th ICAPS 2018",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2019",
                "sub_name": "Proceedings of the Twenty-Ninth International Conference on Automated Planning and Scheduling, ICAPS 2018, Berkeley, CA, USA, July 11-15, 2019.",
                "count": 91,
                "papers": [
                    "DREAM: An Algorithm for Mitigating the Overhead of Robust Rescheduling.",
                    "Model Recognition as Planning.",
                    "Quantifying Degrees of Controllability in Temporal Networks with Uncertainty.",
                    "Planning under LTL Environment Specifications.",
                    "A Logical Semantics for PDDL+.",
                    "Cyber-Physical Planning: Deliberation for Hybrid Systems with a Continuous Numeric State.",
                    "Towards a Unified View of AI Planning and Reactive Synthesis.",
                    "Approximate Gradient Descent Convergence Dynamics for Adaptive Control on Heterogeneous Networks.",
                    "Relaxed BDDs: An Admissible Heuristic for Delete-Free Planning Based on a Discrete Relaxation.",
                    "Explicability? Legibility? Predictability? Transparency? Privacy? Security? The Emerging Landscape of Interpretable Agent Behavior.",
                    "Efficiently Exploring Ordering Problems through Conflict-Directed Search.",
                    "Cutting the Size of Compressed Path Databases with Wildcards and Redundant Symbols.",
                    "An Empirical Study of Perfect Potential Heuristics.",
                    "Stochastic Planning with Lifted Symbolic Trajectory Optimization.",
                    "Foundations for Restraining Bolts: Reinforcement Learning with LTLf/LDLf Restraining Specifications.",
                    "Mixed Discrete Continuous Non-Linear Planning through Piecewise Linear Approximation.",
                    "An Exact Algorithm to Make a Trade-Off between Cost and Probability in SSPs.",
                    "Lazy CBS: Implicit Conflict-Based Search Using Lazy Clause Generation.",
                    "Best-First Width Search for Multi Agent Privacy-Preserving Planning.",
                    "On the Relation between Star-Topology Decoupling and Petri Net Unfolding.",
                    "A Multi-Label A* Algorithm for Multi-Agent Pathfinding.",
                    "Tabu-Based Large Neighbourhood Search for Time/Sequence-Dependent Scheduling Problems with Time Windows.",
                    "Temporal Planning as Refinement-Based Model Checking.",
                    "Using Bi-Directional Information Exchange to Improve Decentralized Schedule-Driven Traffic Control.",
                    "Improving the Combination of JPS and Geometric Containers.",
                    "Online Risk-Bounded Motion Planning for Autonomous Vehicles in Dynamic Environments.",
                    "Propagating Piecewise-Linear Weights in Temporal Networks.",
                    "Planning with Global State Constraints and State-Dependent Action Costs.",
                    "Oversubscription Planning as Classical Planning with Multiple Cost Functions.",
                    "Efficient Heuristic Search for Optimal Environment Redesign.",
                    "On the Pathological Search Behavior of Distributed Greedy Best-First Search.",
                    "Measuring and Optimizing Durability against Scheduling Disturbances.",
                    "Backward Sequence Analysis for Single-Armed Cluster Tools.",
                    "Using FastMap to Solve Graph Problems in a Euclidean Space.",
                    "Disjoint Splitting for Multi-Agent Path Finding with Conflict-Based Search.",
                    "Error-Tolerant Anytime Approach to Plan Recognition Using a Particle Filter.",
                    "Discovery of Optimal Solution Horizons in Non-Stationary Markov Decision Processes with Unbounded Rewards.",
                    "A Multi-Agent Framework to Solve Energy-Aware Unrelated Parallel Machine Scheduling Problems with Machine-Dependent Energy Consumption and Sequence-Dependent Setup Time.",
                    "Eliminating Redundant Actions in Partially Ordered Plans - A Complexity Analysis.",
                    "On Compiling Away PDDL3 Soft Trajectory Constraints without Using Automata.",
                    "Landmark-Enhanced Heuristics for Goal Recognition in Incomplete Domain Models.",
                    "Lagrangian Decomposition for Optimal Cost Partitioning.",
                    "Finding Centroids and Minimum Covering States in Planning.",
                    "A Stochastic Dual Dynamic Integer Programming for the Uncapacitated Lot-Sizing Problem with Uncertain Demand and Costs.",
                    "Counterexample-Guided Abstraction Refinement for Pattern Selection in Optimal Classical Planning.",
                    "Robust Operations Management on Mars.",
                    "Advanced Factoring Strategies for Decoupled Search Using Linear Programming.",
                    "Tree-REX: SAT-Based Tree Exploration for Efficient and High-Quality HTN Planning.",
                    "Subset-Saturated Cost Partitioning for Optimal Classical Planning.",
                    "Learning Scheduling Models from Event Data.",
                    "Robust and Adaptive Planning under Model Uncertainty.",
                    "A Factored Approach to Deterministic Contingent Multi-Agent Planning.",
                    "On Computational Complexity of Automorphism Groups in Classical Planning.",
                    "Algorithm Selection in Optimization and Application to Angry Birds.",
                    "Theoretical Foundations for Structural Symmetries of Lifted PDDL Tasks.",
                    "A Theoretical and Algorithmic Analysis of Configurable MDPs.",
                    "Symbolic Planning with Axioms.",
                    "Bridging the Gap between Abstractions and Critical-Path Heuristics via Hypergraphs.",
                    "Privacy Leakage of Search-Based Multi-Agent Planning Algorithms.",
                    "Personalized Medication and Activity Planning in PDDL+.",
                    "Optimizing Parameters for Uncertain Execution and Rescheduling Robustness.",
                    "The Clustered Dial-a-Ride Problem.",
                    "Exact Methods for Extended Rotating Workforce Scheduling Problems.",
                    "ZAC: A Zone Path Construction Approach for Effective Real-Time Ridesharing.",
                    "Towards Automating Crime Prevention through Environmental Design (CPTED) Analysis to Predict Burglary.",
                    "Mixed Integer Programming versus Evolutionary Computation for Optimizing a Hard Real-World Staff Assignment Problem.",
                    "Reinforcement Learning Based Querying in Camera Networks for Efficient Target Tracking.",
                    "Temporal Brittleness Analysis of Task Networks for Planetary Rovers.",
                    "Solution Approaches for an Automotive Paint Shop Scheduling Problem.",
                    "Unsupervised Grounding of Plannable First-Order Logic Representation from Images.",
                    "Towards Stable Symbol Grounding with Zero-Suppressed State AutoEncoder.",
                    "Fast Feature Selection for Linear Value Function Approximation.",
                    "Resource Constrained Deep Reinforcement Learning.",
                    "Learning Interpretable Models Expressed in Linear Temporal Logic.",
                    "Size Independent Neural Transfer for RDDL Planning.",
                    "Learning Classical Planning Strategies with Policy Gradient.",
                    "Deep Policies for Width-Based Planning in Pixel Domains.",
                    "Entropy Based Independent Learning in Anonymous Multi-Agent Settings.",
                    "Replanning for Situated Robots.",
                    "Speeding Up Search-Based Motion Planning via Conservative Heuristics.",
                    "Trajectory Tracking Control for Robotic Vehicles Using Counterexample Guided Training of Neural Networks.",
                    "Clothoidal Local Path Template for Intention Estimation by Assistive Mobile Robots.",
                    "POMDP-Based Candy Server: Lessons Learned from a Seven Day Demo.",
                    "Mars On-Site Shared Analytics Information and Computing.",
                    "Provable Indefinite-Horizon Real-Time Planning for Repetitive Tasks.",
                    "Open-World Reasoning for Service Robots.",
                    "POMHDP: Search-Based Belief Space Planning Using Multiple Heuristics.",
                    "Generalized Lazy Search for Robot Motion Planning: Interleaving Search and Edge Evaluation via Event-Based Toggles.",
                    "Goal Reasoning in the CLIPS Executive for Integrated Planning and Execution.",
                    "Learning Heuristic Functions for Mobile Robot Path Planning Using Deep Neural Networks.",
                    "A Hierarchical Approach to Active Semantic Mapping Using Probabilistic Logic and Information Reward POMDPs."
                ]
            },
            {
                "sub_name_abbr": "conf/aips/2018",
                "sub_name": "Proceedings of the Twenty-Eighth International Conference on Automated Planning and Scheduling, ICAPS 2018, Delft, The Netherlands, June 24-29, 2018.",
                "count": 65,
                "papers": [
                    "A TIL-Relaxed Heuristic for Planning with Time Windows.",
                    "Validation of Hierarchical Plans via Parsing of Attribute Grammars.",
                    "Scalability of Route Planning Techniques.",
                    "Finite LTL Synthesis as Planning.",
                    "Temporal Planning while the Clock Ticks.",
                    "Sensor Synthesis for POMDPs with Reachability Objectives.",
                    "Algorithms and Conditional Lower Bounds for Planning Problems.",
                    "A Proof System for Unsolvable Planning Tasks.",
                    "MS-Lite: A Lightweight, Complementary Merge-and-Shrink Method.",
                    "Adding Heuristics to Conflict-Based Search for Multi-Agent Path Finding.",
                    "Compact Policies for Fully Observable Non-Deterministic Planning as SAT.",
                    "Sampling Strategies for Conformant Planning.",
                    "The Provable Virtue of Laziness in Motion Planning.",
                    "A Generic Method to Guide HTN Progression Search with Classical Heuristics.",
                    "New Perspectives on Flexibility in Simple Temporal Planning.",
                    "A Novel Iterative Approach to Top-k Planning.",
                    "Strong Stubborn Sets for Efficient Goal Recognition Design.",
                    "Compiling Probabilistic Model Checking into Probabilistic Planning.",
                    "Batch Random Walk for GPU-Based Classical Planning.",
                    "EFP and PG-EFP: Epistemic Forward Search Planners in Multi-Agent Domains.",
                    "Value Driven Landmarks for Oversubscription Planning.",
                    "Planning with Temporal Uncertainty, Resources and Non-Linear Control Parameters.",
                    "Planning for Partial Observability by SAT and Graph Constraints.",
                    "Local Search for Flowshops with Setup Times and Blocking Constraints.",
                    "Symmetry-Based Task Reduction for Relaxed Reachability Analysis.",
                    "Bootstrapping LPs in Value Iteration for Multi-Objective and Partially Observable MDPs.",
                    "Two-Oracle Optimal Path Planning on Grid Maps.",
                    "Representing and Planning with Interacting Actions and Privacy.",
                    "Simulated Penetration Testing as Contingent Planning.",
                    "Symbolic Planning with Edge-Valued Multi-Valued Decision Diagrams.",
                    "Online Algorithms for POMDPs with Continuous State, Action, and Observation Spaces.",
                    "Integrating Resource Management and Timeline-Based Planning.",
                    "An On-Line Planner for POMDPs with Large Discrete Action Space: A Quantile-Based Approach.",
                    "Plan Relaxation via Action Debinding and Deordering.",
                    "On Stubborn Sets and Planning with Resources.",
                    "A Hybrid Genetic Algorithm for Parallel Machine Scheduling at Semiconductor Back-End Production.",
                    "CHAP-E: A Plan Execution Assistant for Pilots.",
                    "Embedding a Scheduler in Execution for a Planetary Rover.",
                    "Aligning Partially-Ordered Process-Execution Traces and Models Using Automated Planning.",
                    "Reserved Optimisation: Handling Incident Priorities in Emergency Response Systems.",
                    "Footprint Placement for Mosaic Imaging by Sampling and Optimization.",
                    "A Scheduling Tool for Bridging the Gap Between Aircraft Design and Aircraft Manufacturing.",
                    "Route Planning with Breaks and Truck Driving Bans Using Time-Dependent Contraction Hierarchies.",
                    "Comparing and Integrating Constraint Programming and Temporal Planning for Quantum Circuit Compilation.",
                    "Bounded Rank Optimization for Effective and Efficient Emergency Response.",
                    "Compiling Optimal Numeric Planning to Mixed Integer Linear Programming.",
                    "The Integrated Last-Mile Transportation Problem (ILMTP).",
                    "Learning STRIPS Action Models with Classical Planning.",
                    "Learning Generalized Reactive Policies Using Deep Neural Networks.",
                    "An Approximate Bayesian Reinforcement Learning Approach Using Robust Control Policy and Tree Search.",
                    "Training Deep Reactive Policies for Probabilistic Planning Problems.",
                    "A General Approach for Configuring PDDL Problem Models.",
                    "A Local Search Approach to Observation Planning with Multiple UAVs.",
                    "Monte-Carlo Planning for Agile Legged Locomotion.",
                    "Minimizing Movement to Establish the Connectivity of Randomly Deployed Robots.",
                    "Planning Robust Manual Tasks in Hierarchical Belief Spaces.",
                    "RMPD - A Recursive Mid-Point Displacement Algorithm for Path Planning.",
                    "Lazy Receding Horizon A* for Efficient Path Planning in Graphs with Expensive-to-Evaluate Edges.",
                    "A Loosely-Coupled Approach for Multi-Robot Coordination, Motion Planning and Control.",
                    "AD*-Cut: A Search-Tree Cutting Anytime Dynamic A* Algorithm.",
                    "Effective Footstep Planning for Humanoids Using Homotopy-Class Guidance.",
                    "ASP-Based Time-Bounded Planning for Logistics Robots.",
                    "Handling Model Uncertainty and Multiplicity in Explanations via Model Reconciliation.",
                    "The Factored Shortest Path Problem and Its Applications in Robotics.",
                    "A Log-Approximation for Coverage Path Planning with the Energy Constraint."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "27th ICAPS 2017",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2017",
                "sub_name": "Proceedings of the Twenty-Seventh International Conference on Automated Planning and Scheduling, ICAPS 2017, Pittsburgh, Pennsylvania, USA, June 18-23, 2017.",
                "count": 71,
                "papers": [
                    "A State-Space Acyclicity Property for Exponentially Tighter Plan Length Bounds.",
                    "Exploration among and within Plateaus in Greedy Best-First Search.",
                    "This Is a Solution! (... But Is It Though?) - Verifying Solutions of Hierarchical Planning Problems.",
                    "Boosting Search Guidance in Problems with Semantic Attachments.",
                    "Completeness of Online Planners for Partially Observable Deterministic Tasks.",
                    "A Temporal Relaxed Planning Graph Heuristic for Planning with Envelopes.",
                    "Planning Time to Think: Metareasoning for On-Line Planning with Durative Actions.",
                    "Dynamic Controllability of Controllable Conditional Temporal Problems with Uncertainty.",
                    "Efficient Decision-Theoretic Target Localization.",
                    "Sufficient Conditions for Node Expansion in Bidirectional Heuristic Search.",
                    "Unsolvability Certificates for Classical Planning.",
                    "The Two-Edged Nature of Diverse Action Costs.",
                    "Complete Local Search: Boosting Hill-Climbing through Online Relaxation Refinement.",
                    "Complexity of Timeline-Based Planning.",
                    "Symmetry Breaking in Star-Topology Decoupled Search.",
                    "Accelerating SAT Based Planning with Incremental SAT Solving.",
                    "Multi-Objective Optimization in a Job Shop with Energy Costs through Hybrid Evolutionary Techniques.",
                    "Improving MPGAA* for Extended Visibility Ranges.",
                    "Coping with Large Traffic Volumes in Schedule-Driven Traffic Signal Control.",
                    "Automated Verification of Social Law Robustness in STRIPS.",
                    "Adapting Novelty to Classical Planning as Heuristic Search.",
                    "Analytic Decision Analysis via Symbolic Dynamic Programming for Parameterized Hybrid MDPs.",
                    "Multiagent Online Planning with Nested Beliefs and Dialogue.",
                    "A Polynomial Planning Algorithm that Beats LAMA and FF.",
                    "Online Repositioning in Bike Sharing Systems.",
                    "Increased Privacy with Reduced Communication in Multi-Agent Planning.",
                    "Automatic Extraction of Axioms for Planning.",
                    "Abstraction Heuristics, Cost Partitioning and Network Flows.",
                    "Submodular Function Maximization for Group Elevator Scheduling.",
                    "Multi-Agent Ergodic Coverage with Obstacle Avoidance.",
                    "Compressed Path Databases with Ordered Wildcard Substitutions.",
                    "A Comparison of Cost Partitioning Algorithms for Optimal Classical Planning.",
                    "Beyond Red-Black Planning: Limited-Memory State Variables.",
                    "Tailoring Pattern Databases for Unsolvable Planning Instances.",
                    "Critical-Path Dead-End Detection versus NoGoods: Offline Equivalence and Online Learning.",
                    "A New Approach to Temporal Planning with Rich Metric Temporal Properties.",
                    "The Limits of Strong Privacy Preserving Multi-Agent Planning.",
                    "Occupation Measure Heuristics for Probabilistic Planning.",
                    "Using Hierarchical Constraints to Avoid Conflicts in Multi-Agent Pathfinding.",
                    "An Investigation of Phase Transitions in Single-Machine Scheduling Problems.",
                    "Stubborn Sets for Fully Observable Nondeterministic Planning.",
                    "Approximately-Optimal Queries for Planning in Reward-Uncertain Markov Decision Processes.",
                    "Minimizing Maximum Regret in Commitment Constrained Sequential Decision Making.",
                    "Tackling Large-Scale Home Health Care Delivery Problem with Uncertainty.",
                    "Automated Planning and Control for High-Density Parking Lots.",
                    "Incentivizing the Use of Bike Trailers for Dynamic Repositioning in Bike Sharing Systems.",
                    "New Results for the GEO-CAPE Observation Scheduling Problem.",
                    "Embedding Automated Planning within Urban Traffic Management Operations.",
                    "On the Exploitation of Automated Planning for Reducing Machine Tools Energy Consumption between Manufacturing Operations.",
                    "Augmenting Decisions of Taxi Drivers through Reinforcement Learning for Improving Revenues.",
                    "State-Regularized Policy Search for Linearized Dynamical Systems.",
                    "Performance Modelling of Planners from Homogeneous Problem Sets.",
                    "Framer: Planning Models from Natural Language Action Descriptions.",
                    "Learning to Speed Up Query Planning in Graph Databases.",
                    "Unsupervised Classification of Planning Instances.",
                    "What Can I Not Do? Towards an Architecture for Reasoning about and Learning Affordances.",
                    "Integrating Mission and Task Planning in an Industrial Robotics Framework.",
                    "Planning with Abstract Markov Decision Processes.",
                    "An Operational Method Toward Efficient Walk Control Policies for Humanoid Robots.",
                    "Initial Results on Generating Macro Actions from a Plan Database for Planning on Autonomous Mobile Robots.",
                    "Multi-Objective Policy Generation for Mobile Robots under Probabilistic Time-Bounded Guarantees.",
                    "Cooperative Multi-Robot Sampling-Based Motion Planning with Dynamics.",
                    "Heuristic Search on Graphs with Existence Priors for Expensive-to-Evaluate Edges.",
                    "Efficient Motion Planning for Problems Lacking Optimal Substructure.",
                    "Short-Term Human-Robot Interaction through Conditional Planning and Execution.",
                    "Dealing with On-line Human-Robot Negotiations in Hierarchical Agent-Based Task Planner.",
                    "Plan-Time Multi-Model Switching for Motion Planning.",
                    "Hybrid Task Planning Grounded in Belief: Constructing Physical Copies of Simple Structures.",
                    "Learning to Avoid Local Minima in Planning for Static Environments.",
                    "Path Planning for Multiple Agents under Uncertainty.",
                    "Any-Angle Pathfinding for Multiple Agents Based on SIPP Algorithm."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "26th ICAPS 2016",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2016",
                "sub_name": "Proceedings of the Twenty-Sixth International Conference on Automated Planning and Scheduling, ICAPS 2016, London, UK, June 12-17, 2016.",
                "count": 64,
                "papers": [
                    "A Multi-Parameter Complexity Analysis of Cost-Optimal and Net-Benefit Planning.",
                    "Search Portfolio with Sharing.",
                    "Bound to Plan: Exploiting Classical Heuristics via Automatic Translations of Tail-Recursive HTN Problems.",
                    "OGA-UCT: On-the-Go Abstractions in UCT.",
                    "Change the Plan - How Hard Can That Be?",
                    "Leveraging Probabilistic Reasoning in Deterministic Planning for Large-Scale Autonomous Search-and-Tracking.",
                    "A Semantic Notion of Interference for Planning Modulo Theories.",
                    "From FOND to Robust Probabilistic Planning: Computing Compact Policies that Bypass Avoidable Deadends.",
                    "Online Algorithms for the Linear Tape Scheduling Problem.",
                    "A Compilation of the Full PDDL+ Language into SMT.",
                    "Indefinite-Horizon Reachability in Goal-DEC-POMDPs.",
                    "Have I Been Here Before? State Memoization in Temporal Planning.",
                    "Practical Undoability Checking via Contingent Planning.",
                    "Bayesian Optimization with Resource Constraints and Production.",
                    "Robust Partial Order Schedules for RCPSP/max with Durational Uncertainty.",
                    "Placement of Loading Stations for Electric Vehicles: Allowing Small Detours.",
                    "Abstractions for Planning with State-Dependent Action Costs.",
                    "Domain Model Acquisition in Domains with Action Costs.",
                    "Assessing the Expressivity of Planning Formalisms through the Comparison to Formal Languages.",
                    "Multi-Agent Sensor Data Collection with Attrition Risk.",
                    "Checking the Dynamic Consistency of Conditional Temporal Networks with Bounded Reaction Times.",
                    "Automated Creation of Efficient Work Distribution Functions for Parallel Best-First Search.",
                    "Hierarchical Linearly-Solvable Markov Decision Problems.",
                    "Dual Formulations for Optimizing Dec-POMDP Controllers.",
                    "Traps, Invariants, and Dead-Ends.",
                    "Online Macro Generation for Privacy Preserving Planning.",
                    "Stronger Privacy Preserving Projections for Multi-Agent Planning.",
                    "Heuristic Guidance for Forward-Chaining Planning with Numeric Uncertainty.",
                    "Learning Relational Dynamics of Stochastic Domains for Planning.",
                    "The Mathematics of Dispatchability Revisited.",
                    "Strict Theta*: Shorter Motion Path Planning Using Taut Paths.",
                    "Efficient Representation of Pattern Databases Using Acyclic Random Hypergraphs.",
                    "PARIS: A Polynomial-Time, Risk-Sensitive Scheduling Algorithm for Probabilistic Simple Temporal Networks with Uncertainty.",
                    "Numeric Planning with Disjunctive Global Constraints via SMT.",
                    "Generalized Planning with Procedural Domain Control Knowledge.",
                    "An Analysis of Merge Strategies for Merge-and-Shrink Heuristics.",
                    "Revisiting Goal Probability Analysis in Probabilistic Planning.",
                    "Potential Heuristics for Multi-Agent Planning.",
                    "Recursive Polynomial Reductions for Classical Planning.",
                    "Heuristic Search in Dual Space for Constrained Stochastic Shortest Path Problems.",
                    "A Formal Analysis of Required Cooperation in Multi-Agent Planning.",
                    "Optimal Scheduling of a Constellation of Earth-Imaging Satellites, for Maximal Data Throughput and Efficient Human Management.",
                    "Planning Curtailment of Renewable Generation in Power Grids.",
                    "A Planning-Based Architecture for a Reconfigurable Manufacturing System.",
                    "Computing Trace Alignment against Declarative Process Models through Planning.",
                    "Scheduling Ocean Color Observations for a GEO-Stationary Satellite.",
                    "Strategic Planning for Setting Up Base Stations in Emergency Medical Systems.",
                    "Cell Design and Routing of Jobs in a Multisite Make-to-Order Enterprise.",
                    "More Shuttles, Less Cost: Energy Efficient Planning for Scalable High-Density Warehouse Environments.",
                    "Towards Next Generation Touring: Personalized Group Tours.",
                    "Solving Realistic Unit Commitment Problems Using Temporal Planning: Challenges and Solutions.",
                    "Planning and Control of Marine Floats in the Presence of Dynamic, Uncertain Currents.",
                    "Integrating Planning and Control for Efficient Path Planning in the Presence of Environmental Disturbances.",
                    "Path Planning under Interface-Based Constraints for Assistive Robotics.",
                    "A Unifying Formalism for Shortest Path Problems with Expensive Edge Evaluations via Lazy Best-First Search over Paths with Edge Selectors.",
                    "Real-Time Stochastic Optimal Control for Multi-Agent Quadrotor Systems.",
                    "Multi-Agent Path Finding with Kinematic Constraints.",
                    "A Practical Framework for Robust Decision-Theoretic Planning and Execution for Service Robots.",
                    "Evaluation of Auction-Based Multi-Robot Routing by Parallel Simulation.",
                    "Online Learning of Robot Soccer Free Kick Plans Using a Bandit Approach.",
                    "Experience-Based Robot Task Learning and Planning with Goal Inference.",
                    "Robot Motion Planning for Pouring Liquids.",
                    "Speeding Up A* Search on Visibility Graphs Defined Over Quadtrees to Enable Long Distance Path Planning for Unmanned Surface Vehicles.",
                    "Task and Motion Policy Synthesis as Liveness Games."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "25th ICAPS 2015",
        "info": "Jerusalem, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2015",
                "sub_name": "Proceedings of the Twenty-Fifth International Conference on Automated Planning and Scheduling, ICAPS 2015, Jerusalem, Israel, June 7-11, 2015.",
                "count": 50,
                "papers": [
                    "A Reminder about the Importance of Computing and Exploiting Invariants in Planning.",
                    "Tight Bounds for HTN Planning.",
                    "Solving Large-Scale Planning Problems by Decomposition and Macro Generation.",
                    "On the Complexity of HTN Plan Verification and Its Implications for Plan Recognition.",
                    "Iterated Local Search Heuristics for Minimizing Total Completion Time in Permutation and Non-permutation Flow Shops.",
                    "PDDL+ Planning with Hybrid Automata: Foundations of Translating Must Behavior.",
                    "Don't Split, Try To Work It Out: Bypassing Conflicts in Multi-Agent Pathfinding.",
                    "Optimising Bounds in Simple Temporal Networks with Uncertainty under Dynamic Controllability Constraints.",
                    "Sequencing Operator Counts.",
                    "Modeling and Computation in Planning: Better Heuristics from More Expressive Languages.",
                    "Dynamic Redeployment to Counter Congestion or Starvation in Vehicle Sharing Systems.",
                    "Beating LM-Cut with hmax (Sometimes): Fork-Decoupled State Space Search.",
                    "Domain Model Acquisition in the Presence of Static Relations in the LOP System.",
                    "On the Expressive Power of Non-Linear Merge-and-Shrink Representations.",
                    "Explicit Conjunctions without Compilation: Computing hFF(PiC) in Polynomial Time.",
                    "Hindsight Optimization for Probabilistic Planning with Factored Actions.",
                    "Temporal Planning With Required Concurrency Using Classical Planning.",
                    "Temporal Landmarks: What Must Happen, and When.",
                    "Beliefs In Multiagent Planning: From One Agent to Many.",
                    "History-Based Controller Design and Optimization for Partially Observable MDPs.",
                    "Schedule Generation Schemes and Genetic Algorithm for the Scheduling Problem with Skilled Operators and Arbitrary Precedence Relations.",
                    "Temporal Flexibility Revisited: Maximizing Flexibility by Computing Bipartite Matchings.",
                    "Moving Target Search with Subgoal Graphs.",
                    "A Normal Form for Classical Planning Tasks.",
                    "New Optimization Functions for Potential Heuristics.",
                    "Individual Planning in Agent Populations: Exploiting Anonymity and Frame-Action Hypergraphs.",
                    "Admissible Landmark Heuristic for Multi-Agent Planning.",
                    "A Compilation Based Approach to Conformant Probabilistic Planning with Stochastic Actions.",
                    "Global Heuristics for Distributed Cooperative Multi-Agent Planning.",
                    "Speeding-Up Any-Angle Path-Planning on Grids.",
                    "Identifying and Exploiting Features for Effective Plan Retrieval in Case-Based Planning.",
                    "Understanding and Improving Local Exploration for GBFS.",
                    "PLEASE: Palm Leaf Search for POMDPs with Large Observation Spaces.",
                    "An Online Replanning Approach for Crop Fields Mapping with Autonomous UAVs.",
                    "Contingent versus Deterministic Plans in Multi-Modal Journey Planning.",
                    "Ground and Onboard Decision-Making on Satellite Data Downloads.",
                    "Planning-Based Reasoning for Automated Large-Scale Data Analysis.",
                    "Heuristic Search and Receding-Horizon Planning in Complex Spacecraft Orbit Domains.",
                    "In-silico Behavior Discovery System: An Application of Planning in Ethology.",
                    "Goal-Based Action Priors.",
                    "Mixed-Initiative Planning and Execution for Multiple Drones in Search and Rescue Missions.",
                    "Complete Decentralized Method for On-Line Multi-Robot Trajectory Planning in Well-formed Infrastructures.",
                    "ROSPlan: Planning in the Robot Operating System.",
                    "Robust Execution of Plans for Human-Robot Teams.",
                    "Multi-UAV Monitoring with Priorities and Limited Energy Resources.",
                    "Journal Track Paper Abstracts.",
                    "Policy Evaluation with Temporal Differences: A Survey and Comparison (Extended Abstract).",
                    "Interactive Relational Reinforcement Learning of Concept Semantics (Extended Abstract).",
                    "Simulated Penetration Testing: From \"Dijkstra\" to \"Turing Test++\".",
                    "Improving the Design and Discovery of Dynamic Treatment Strategies Using Recent Results in Sequential Decision-Making."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "24th ICAPS 2014",
        "info": "Portsmouth, New Hampshire, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2014",
                "sub_name": "Proceedings of the Twenty-Fourth International Conference on Automated Planning and Scheduling, ICAPS 2014, Portsmouth, New Hampshire, USA, June 21-26, 2014.",
                "count": 74,
                "papers": [
                    "Sponsors.",
                    "Preface.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "On the Feasibility of Planning Graph Style Heuristics for HTN Planning.",
                    "Optimizing Planning Domains by Automatic Action Schema Splitting.",
                    "Fully Automated Cyclic Planning for Large-Scale Manufacturing Domains.",
                    "Thompson Sampling Based Monte-Carlo Planning in POMDPs.",
                    "Overcoming the Utility Problem in Heuristic Generation: Why Time Matters.",
                    "Flow-Based Heuristics for Optimal Planning: Landmarks and Merges.",
                    "Landmark-Based Plan Distance Measures for Diverse Planning.",
                    "MUM: A Technique for Maximising the Utility of Macro-operators by Constrained Generation and Use.",
                    "PDDL+ Planning with Events and Linear Processes.",
                    "Fragment-Based Planning Using Column Generation.",
                    "A Novel Priority Rule Heuristic: Learning from Justification.",
                    "Symbolic and Explicit Search Hybrid through Perfect Hash Functions - A Case Study in Connect Four.",
                    "Optimization Model and Heuristic Approach for Blocks Retrieval Processes in Warehouses.",
                    "On MABs and Separation of Concerns in Monte-Carlo Planning for MDPs.",
                    "Improving Jump Point Search.",
                    "Revisiting Risk-Sensitive MDPs: New Algorithms and Results.",
                    "Optimal Planning with Global Numerical State Constraints.",
                    "Goal Recognition Design.",
                    "Partially Observable Online Contingent Planning Using Landmark Heuristics.",
                    "On the Use of Temporal Landmarks for Planning with Deadlines.",
                    "Bootstrapping Simulation-Based Algorithms with a Suboptimal Policy.",
                    "A Heuristic Approach to Planning with Incomplete STRIPS Action Models.",
                    "EfficientIDC: A Faster Incremental Dynamic Controllability Algorithm.",
                    "PA*SE: Parallel A* for Slow Expansions.",
                    "Planning Under Uncertainty Using Reduced Models: Revisiting Determinization.",
                    "LP-Based Heuristics for Cost-Optimal Planning.",
                    "Directed Fixed-Point Regression-Based Planning for Non-Deterministic Domains.",
                    "Heuristic Evaluation Based on Lifted Relaxed Planning Graphs.",
                    "Evaluating Diversity in Classical Planning.",
                    "Bounded Approximations for Linear Multi-Objective Planning Under Uncertainty.",
                    "Chance-Constrained Consistency for Probabilistic Temporal Plan Networks.",
                    "Plan Repair for Resource Constrained Tasks via Numeric Macro Actions.",
                    "Diverse and Additive Cartesian Abstraction Heuristics.",
                    "Relaxation Heuristics for Multiagent Planning.",
                    "The Complexity of Partial-Order Plan Viability Problems.",
                    "Computing Solutions in Infinite-Horizon Discounted Adversarial Patrolling Games.",
                    "Efficient Stubborn Sets: Generalized Algorithms and Selection Strategies.",
                    "Spatially Distributed Multiagent Path Planning.",
                    "Resolving Uncontrollable Conditional Temporal Problems Using Continuous Relaxations.",
                    "Analyzing the Impact of Partial States on Duplicate Detection and Collision of Frontiers.",
                    "Improved Features for Runtime Prediction of Domain-Independent Planners.",
                    "Plan and Activity Recognition from a Topic Modeling Perspective.",
                    "Under-Approximation Refinement for Classical Planning.",
                    "Non-Deterministic Planning With Conditional Effects.",
                    "A Comparison of Knowledge-Based GBFS Enhancements and Knowledge-Free Exploration.",
                    "Discriminatively Reranking Abductive Proofs for Plan Recognition.",
                    "Plan, Repair, Execute, Explain - How Planning Helps to Assemble your Home Theater.",
                    "Near-Optimal Nonmyopic Contact Center Planning Using Dual Decomposition.",
                    "Planning for Mining Operations with Time and Resource Constraints.",
                    "The Route Not Taken: Driver-Centric Estimation of Electric Vehicle Range.",
                    "Automated Planning for Multi-Objective Machine Tool Calibration: Optimising Makespan and Measurement Uncertainty.",
                    "Satellite Data Download Management with Uncertainty about the Generated Volumes.",
                    "Planning meets Data Cleansing.",
                    "Planning the Behaviour of Low-Cost Quadcopters for Surveillance Missions.",
                    "A Robotic Execution Framework for Online Probabilistic (Re)Planning.",
                    "Integrated Motion Planning and Coordination for Industrial Vehicles.",
                    "Planning in Action Language BC while Learning Action Costs for Mobile Robots.",
                    "A Tree-Based Algorithm for Construction Robots.",
                    "Concurrent Plan Recognition and Execution for Human-Robot Teams.",
                    "Finding Ways to Get the Job Done: An Affordance-Based Approach.",
                    "Making A* Run Faster than D*-Lite for Path-Planning in Partially Known Terrain.",
                    "Path Planning for Dexterous Mobility.",
                    "Decentralized Multi-Robot Cooperation with Auctioned POMDPs.",
                    "Single- and Dual-Arm Motion Planning with Heuristic Search.",
                    "Building Virtual Behaviors from Partially Controllable Available Behaviors in Nondeterministic Environments.",
                    "The Complexity of Optimal Monotonic Planning: The Bad, The Good, and The Causal Graph.",
                    "Towards Robust Task Execution for Domestic Service Robots.",
                    "C-FOREST: Parallel Shortest-Path Planning with Super Linear Speedup.",
                    "Time-Dependent Simple Temporal Networks: Properties and Algorithms.",
                    "Property Directed Reachability for Automated Planning."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "23rd ICAPS 2013",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2013",
                "sub_name": "Proceedings of the Twenty-Third International Conference on Automated Planning and Scheduling, ICAPS 2013, Rome, Italy, June 10-14, 2013.",
                "count": 71,
                "papers": [
                    "Constricting Insertion Heuristic for Traveling Salesman Problem with Neighborhoods.",
                    "Distributed Algorithms for Incrementally Maintaining Multiagent Simple Temporal Networks.",
                    "Multi-Modal Journey Planning in the Presence of Uncertainty.",
                    "Partially Grounded Planning as Quantified Boolean Formula.",
                    "Searching for Good Solutions in Goal-Dense Search Spaces.",
                    "Automated Agent Decomposition for Classical Planning.",
                    "An Approach for Efficient Planning of Robotic Manipulation Tasks.",
                    "Fault Tolerant Planning: Complexity and Compilation.",
                    "New Encoding Methods for SAT-Based Temporal Planning.",
                    "Incremental Planning with Adaptive Dimensionality.",
                    "An Efficient Memetic Algorithm for the Flexible Job Shop with Setup Times.",
                    "Faster Optimal Planning with Partial-Order Pruning.",
                    "A Generic Technique for Synthesizing Bounded Finite-State Controllers.",
                    "When Acyclicity Is Not Enough: Limitations of the Causal Graph.",
                    "Who Said We Need to Relax All Variables?",
                    "Trial-Based Heuristic Tree Search for Finite Horizon MDPs.",
                    "Optimally Scheduling Small Numbers of Identical Parallel Machines.",
                    "Abstractions for Oversubscription Planning.",
                    "Incremental LM-Cut.",
                    "Dynamic Online Planning and Scheduling Using a Static Invariant-Based Evaluation Model.",
                    "Behavior Composition as Fully Observable Non-Deterministic Planning.",
                    "Scheduling with Contingent Resources and Tasks.",
                    "Compiling Conformant Probabilistic Planning Problems into Classical Planning.",
                    "Transition Trees for Cost-Optimal Symbolic Planning.",
                    "Hybrid Queueing Theory and Scheduling Models for Dynamic Environments with Sequence-Dependent Setup Times.",
                    "Subgoal Graphs for Optimal Pathfinding in Eight-Neighbor Grids.",
                    "Using Alternative Suboptimality Bounds in Heuristic Search.",
                    "Exploiting Fully Observable and Deterministic Structures in Goal POMDPs.",
                    "The Relative Pruning Power of Strong Stubborn Sets and Expansion Core.",
                    "A Flexible Approach to Modeling Unpredictable Events in MDPs.",
                    "Better Time Constrained Search via Randomization and Postprocessing.",
                    "A Reformulation for the Problem of Scheduling Unrelated Parallel Machines with Sequence and Machine Dependent Setup Times.",
                    "De-Cycling Cyclic Scheduling Problems.",
                    "Moving Target Search with Compressed Path Databases.",
                    "Path Planning with Compressed All-Pairs Shortest Paths Data.",
                    "Symmetry Breaking: Satisficing Planning and Landmark Heuristics.",
                    "Stronger Abstraction Heuristics Through Perimeter Search.",
                    "An Optimal Any-Angle Pathfinding Algorithm.",
                    "Heuristics for Bounded-Cost Search.",
                    "Safe, Strong, and Tractable Relevance Analysis for Planning.",
                    "On Adversarial Policy Switching with Experiments in Real-Time Strategy Games.",
                    "What's in It for My BDD? On Causal Graphs and Variable Orders in Planning.",
                    "Domain Predictive Control Under Uncertain Numerical State Information.",
                    "Incremental Dynamic Controllability Revisited.",
                    "Automatic Reductions from PH into STRIPS or How to Generate Short Problems with Very Long Solutions.",
                    "Counterexample-Guided Cartesian Abstraction Refinement.",
                    "Autonomous Search and Tracking via Temporal Planning.",
                    "Planning-Based Social Partners for Children with Autism.",
                    "Timeline-Based Planning for Engaging Training Experiences.",
                    "Planning Personalised Museum Visits.",
                    "Planning for Social Interaction in a Robot Bartender Domain.",
                    "Combining a Temporal Planner with an External Solver for the Power Balancing Problem in an Electricity Network.",
                    "Planning Spacecraft Activities: An Automated Approach.",
                    "Integrated Operations (Re-)Scheduling from Mine to Ship.",
                    "Planning under Uncertainty for Coordinating Infrastructural Maintenance.",
                    "Smart Urban Signal Networks: Initial Application of the SURTRAC Adaptive Traffic Signal Control System.",
                    "HTN Planning for the Composition of Stream Processing Applications.",
                    "Challenge: Modelling Unit Commitment as a Planning Problem.",
                    "Task Sequencing for Remote Laser Welding in the Automotive Industry.",
                    "The Windy Domain - A Challenging Real-World Application of Integrated Planning and Scheduling.",
                    "Modeling and Reasoning about Business Processes under Authorization Constraints: A Planning-Based Approach.",
                    "Planning Solar Array Operations on the International Space Station.",
                    "Optimal Control as a Graphical Model Inference Problem.",
                    "Linear Fitted-Q Iteration with Multiple Reward Functions.",
                    "A Min-Flow Algorithm for Minimal Critical Set Detection in Resource Constrained Project Scheduling.",
                    "An Optimal Constraint Programming Approach to the Open-Shop Problem.",
                    "Paper Summary: Probabilistic Planning for Continuous Dynamic Systems under Bounded Risk.",
                    "A Constraint-Based Approach for Proactive, Context-Aware Human Support.",
                    "An Investigation of Actions, Change and Space.",
                    "Temporal-Difference Search in Computer Go.",
                    "Solving the Traveling Tournament Problem with Iterative-Deepening A."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "22nd ICAPS 2012",
        "info": "Atibaia, São Paulo, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2012",
                "sub_name": "Proceedings of the Twenty-Second International Conference on Automated Planning and Scheduling, ICAPS 2012, Atibaia, São Paulo, Brazil, June 25-19, 2012.",
                "count": 50,
                "papers": [
                    "Sponsors.",
                    "Preface.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "Special Track on Continuous Planning.",
                    "Temporal Planning with Preferences and Time-Dependent Continuous Costs.",
                    "MDD Propagation for Disjunctive Scheduling.",
                    "Tractable Monotone Temporal Planning.",
                    "Sampling-Based Coverage Path Planning for Inspection of Complex Structures.",
                    "Plan-Based Policy-Learning for Autonomous Feature Tracking.",
                    "Using AI Planning to Enhance E-Learning Processes.",
                    "Pruning Methods for Optimal Delete-Free Planning.",
                    "Planning Modulo Theories: Extending the Planning Paradigm.",
                    "Incremental Lower Bounds for Additive Cost Planning Problems.",
                    "Risk-Variant Policy Switching to Exceed Reward Thresholds.",
                    "Optimal Search with Inadmissible Heuristics.",
                    "How to Relax a Bisimulation?",
                    "CP and MIP Methods for Ship Scheduling with Time-Varying Draft.",
                    "PROST: Probabilistic Planning Based on UCT.",
                    "Semi-Relaxed Plan Heuristics.",
                    "Integrating Vehicle Routing and Motion Planning.",
                    "Reverse Iterative Deepening for Finite-Horizon MDPs with Large Branching Factors.",
                    "Predicting Optimal Solution Cost with Bidirectional Stratified Sampling.",
                    "A Planning Based Framework for Controlling Hybrid Systems.",
                    "Improved Non-Deterministic Planning by Exploiting State Relevance.",
                    "Resource-Constrained Planning: A Monte Carlo Random Walk Approach.",
                    "On Computing Conformant Plans Using Classical Planners: A Generate-And-Complete Approach.",
                    "Iterative Improvement Algorithms for the Blocking Job Shop.",
                    "ITOMP: Incremental Trajectory Optimization for Real-Time Replanning in Dynamic Environments.",
                    "The Application of Automated Planning to Machine Tool Calibration.",
                    "Making Hybrid Plans More Clear to Human Users - A Formal Approach for Generating Sound Explanations.",
                    "Route Planning for Bicycles - Exact Constrained Shortest Paths Made Practical via Contraction Hierarchy.",
                    "Incremental ARA*: An Incremental Anytime Search Algorithm for Moving-Target Search.",
                    "Fast Incremental Policy Compilation from Plans in Hybrid Probabilistic Domains.",
                    "Long-Run Stability in Dynamic Scheduling.",
                    "Faster Bounded-Cost Search Using Inadmissible Estimates.",
                    "Automated Planning for Liner Shipping Fleet Repositioning.",
                    "Short-Sighted Stochastic Shortest Path Problems.",
                    "About Partial Order Reduction in Planning and Computer Aided Verification.",
                    "Bandit-Based Planning and Learning in Continuous-Action Markov Decision Processes.",
                    "Planning Via Random Walk-Driven Local Search.",
                    "Schedule-Driven Coordination for Real-Time Traffic Network Control.",
                    "Anticipatory On-Line Planning.",
                    "Optimizing Plans through Analysis of Action Dependencies and Independencies.",
                    "Enhanced Symmetry Breaking in Cost-Optimal Planning as Forward Search.",
                    "On Modeling the Tactical Planning of Oil Pipeline Networks.",
                    "Minimal Landmarks for Optimal Delete-Free Planning.",
                    "Optimally Relaxing Partial-Order Plans with MaxSAT.",
                    "Optimal Planning for Delete-Free Tasks with Incremental LM-Cut.",
                    "Learning Portfolios of Automatically Tuned Planners."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "21st ICAPS 2011",
        "info": "Freiburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2011",
                "sub_name": "Proceedings of the 21st International Conference on Automated Planning and Scheduling, ICAPS 2011, Freiburg, Germany June 11-16, 2011.",
                "count": 50,
                "papers": [
                    "Preface.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "Effective Heuristics and Belief Tracking for Planning with Incomplete Information.",
                    "Scheduling an Aircraft Repair Shop.",
                    "Limits for Compact Representation of Plans.",
                    "LPRPG-P: Relaxed Plan Heuristics for Planning with Preferences.",
                    "Cost-Sensitive Concurrent Planning Under Duration Uncertainty for Service-Level Agreements.",
                    "Generalised Domain Model Acquisition from Action Traces.",
                    "Online Planning for a Material Control System for Liquid Crystal Display Manufacturing.",
                    "Ensemble Monte-Carlo Planning: An Empirical Study.",
                    "Planning Multi-Modal Transportation Problems.",
                    "Automatic Construction of Efficient Multiple Battery Usage Policies.",
                    "A Path Planning Algorithm for an AUV Guided with Homotopy Classes.",
                    "Distributed Control of Situated Assistance in Large Domains with Many Tasks.",
                    "Where Ignoring Delete Lists Works, Part II: Causal Graphs.",
                    "The Multi-Round Balanced Traveling Tournament Problem.",
                    "Scaling Up Multiagent Planning: A Best-Response Approach.",
                    "When Optimal Is Just Not Good Enough: Learning Fast Informative Action Cost Partitionings.",
                    "Heuristic Search for Generalized Stochastic Shortest Path MDPs.",
                    "Planning for Loosely Coupled Agents Using Partial Order Forward-Chaining.",
                    "Efficient Policy Construction for MDPs Represented in Probabilistic PDDL.",
                    "Searching for Plans with Carefully Designed Probes.",
                    "Scalable Scheduling for Hardware-Accelerated Functional Verification.",
                    "Computing All-Pairs Shortest Paths by Leveraging Low Treewidth.",
                    "Automatic Polytime Reductions of NP Problems into a Fragment of STRIPS.",
                    "Visual Programming of Plan Dynamics Using Constraints and Landmarks.",
                    "Closing the Gap: Improved Bounds on Optimal POMDP Solutions.",
                    "Trade-Offs in Sampling-Based Adversarial Planning.",
                    "Heuristics for Planning with SAT and Expressive Action Definitions.",
                    "Theoretical Aspects of Scheduling Coupled-Tasks in the Presence of Compatibility Graph.",
                    "Directed Search for Generalized Plans Using Classical Planners.",
                    "Potential Search: A Bounded-Cost Search Algorithm.",
                    "Exploiting the Computational Power of the Graphics Card: Optimal State Space Planning on the GPU.",
                    "Learning Inadmissible Heuristics During Search.",
                    "Contingent Planning as AND/OR Forward Search with Disjunctive Representation.",
                    "Planning to Perceive: Exploiting Mobility for Robust Object Detection.",
                    "Planning and Acting in Incomplete Domains.",
                    "Markov Decision Processes with Ordinal Rewards: Reference Point-Based Preferences.",
                    "Dynamic State-Space Partitioning in External-Memory Graph Search.",
                    "Cross-Domain Action-Model Acquisition for Planning via Web Search.",
                    "Partial-Order Support-Link Scheduling.",
                    "Abstraction Heuristics Extended with Counting Abstractions.",
                    "A Complete Algorithm for Generating Landmarks.",
                    "The Minimal Seed Set Problem.",
                    "An Effective Approach to Realizing Planning Programs.",
                    "Fast Subgoaling for Pathfinding via Real-Time Search.",
                    "A Polynomial All Outcome Determinization for Probabilistic Planning.",
                    "Sample-Based Planning for Continuous Action Markov Decision Processes.",
                    "Planning Problems for Social Robots."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "20th ICAPS 2010",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2010",
                "sub_name": "Proceedings of the 20th International Conference on Automated Planning and Scheduling, ICAPS 2010, Toronto, Ontario, Canada, May 12-16, 2010.",
                "count": 42,
                "papers": [
                    "Using Backwards Generated Goals for Heuristic Planning.",
                    "Planning for Concurrent Action Executions Under Action Duration Uncertainty Using Dynamically Generated Bayesian Networks.",
                    "An Evolutionary Metaheuristic Based on State Decomposition for Domain-Independent Satisficing Planning.",
                    "A Comparison of Algorithms for Solving the Multiagent Simple Temporal Problem.",
                    "Timeline-Based Space Operations Scheduling with External Constraints.",
                    "Forward-Chaining Partial-Order Planning.",
                    "When Abstractions Met Landmarks.",
                    "Perfect Hashing for State Space Exploration on the GPU.",
                    "Cost-Optimal Factored Planning: Promises and Pitfalls.",
                    "Towards Finding Robust Execution Strategies for RCPSP/max with Durational Uncertainty.",
                    "Coming Up With Good Excuses: What to do When no Plan Can be Found.",
                    "Self-Taught Decision Theoretic Planning with First Order Decision Diagrams.",
                    "Classical Planning in MDP Heuristics: with a Little Help from Generalization.",
                    "Pattern Database Heuristics for Fully Observable Nondeterministic Planning.",
                    "Partially Informed Depth-First Search for the Job Shop Problem.",
                    "Action Elimination and Plan Neighborhood Graph Search: Two Algorithms for Plan Improvement.",
                    "Incrementally Solving STNs by Enforcing Partial Path Consistency.",
                    "The Joy of Forgetting: Faster Anytime Search via Restarting.",
                    "Handling Goal Utility Dependencies in a Satisfiability Framework.",
                    "Constraint Propagation in Propositional Planning.",
                    "Computing Applicability Conditions for Plans with Loops.",
                    "A New Approach to Conformant Planning Using CNF*.",
                    "Simultaneously Searching with Multiple Settings: An Alternative to Parameter Tuning for Suboptimal Single-Agent Search Algorithms.",
                    "Influence-Based Policy Abstraction for Weakly-Coupled Dec-POMDPs.",
                    "Choosing Path Replanning Strategies for Unmanned Aircraft Systems.",
                    "Iterative Learning of Weighted Rule Sets for Greedy Search.",
                    "Improving Determinization in Hindsight for On-line Probabilistic Planning.",
                    "When Policies Can Be Trusted: Analyzing a Criteria to Identify Optimal Policies in MDPs with Unknown Model Parameters.",
                    "A PDDL+ Benchmark Problem: The Batch Chemical Plant.",
                    "Temporal Planning with Problems Requiring Concurrency through Action Graphs and Local Search.",
                    "Shopper: A System for Executing and Simulating Expressive Plans.",
                    "The Scanalyzer Domain: Greenhouse Logistics as a Planning Problem.",
                    "Waking Up a Sleeping Rabbit: On Natural-Language Sentence Generation with FF.",
                    "On Adversarial Search Spaces and Sampling-Based Planning.",
                    "The More, the Merrier: Combining Heuristic Estimators for Satisficing Planning.",
                    "Genome Rearrangement and Planning: Revisited.",
                    "Combined Task and Motion Planning for Mobile Manipulation.",
                    "G-Value Plateaus: A Challenge for Planning.",
                    "Construction Management Applications: Challenges in Developing Execution Control Plans.",
                    "Computer-Aided Algorithm Design: Automated Tuning, Configuration, Selection, and Beyond.",
                    "Robotic Agents for Disaster Response Robotics.",
                    "From Automated Verification to Automated Design."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "19th ICAPS 2009",
        "info": "Thessaloniki, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2009",
                "sub_name": "Proceedings of the 19th International Conference on Automated Planning and Scheduling, ICAPS 2009, Thessaloniki, Greece, September 19-23, 2009.",
                "count": 55,
                "papers": [
                    "Incremental Policy Generation for Finite-Horizon DEC-POMDPs.",
                    "Improving Planning Performance Using Low-Conflict Relaxed Plans.",
                    "Continuous Orchestration of Web Services via Planning.",
                    "Lower Bounding Klondike Solitaire with Monte-Carlo Planning.",
                    "Automatic Derivation of Memoryless Policies and Finite-State Controllers Using Classical Planners.",
                    "Suboptimal and Anytime Heuristic Search on Multi-Core Machines.",
                    "Enhancing the Context-Enhanced Additive Heuristic with Precedence Constraints.",
                    "A Human-Aware Robot Task Planner.",
                    "Extending the Use of Inference in Temporal Planning as Forwards Search.",
                    "Flexible Execution of Plans with Choice.",
                    "Focused Topological Value Iteration.",
                    "Composition of Partially Observable Services Exporting their Behaviour.",
                    "Efficient Solutions to Factored MDPs with Imprecise Transition Probabilities.",
                    "UPMurphi: A Tool for Universal Planning on PDDL+ Problems.",
                    "Semantic Attachments for Domain-Independent Planning Systems.",
                    "Dynamic Controllability of Temporally-flexible Reactive Programs.",
                    "Using the Context-enhanced Additive Heuristic for Temporal and Numeric Planning.",
                    "The Influence of k-Dependence on the Complexity of Planning.",
                    "A Semantics for HTN Methods.",
                    "Improved Local Search for Job Shop Scheduling with uncertain Durations.",
                    "Landmarks, Critical Paths and Abstractions: What's the Difference Anyway?",
                    "Optimality Properties of Planning Via Petri Net Unfolding: A Formal Analysis.",
                    "An Optimal Temporally Expressive Planner: Initial Results and Application to P2P Network Optimization.",
                    "Structural-Pattern Databases.",
                    "Minimal Sufficient Explanations for Factored Markov Decision Processes.",
                    "Scalable, Parallel Best-First Search for Optimal Sequential Planning.",
                    "Navigation Planning in Probabilistic Roadmaps with Uncertainty.",
                    "Inference and Decomposition in Planning Using Causal Consistent Chains.",
                    "Pervasive Model Adaptation: The Integration of Planning and Information Gathering in Dynamic Production Systems.",
                    "Information-Theoretic Approach to Efficient Adaptive Path Planning for Mobile Robotic Environmental Sensing.",
                    "Just-In-Time Scheduling with Constraint Programming.",
                    "Using Physics- and Sensor-based Simulation for High-Fidelity Temporal Projection of Realistic Robot Behavior.",
                    "Thinking Ahead in Real-Time Search.",
                    "Forward Constraint-Based Algorithms for Anytime Planning.",
                    "Preferred Operators and Deferred Evaluation in Satisficing Planning.",
                    "SAT-Based Parallel Planning Using a Split Representation of Actions.",
                    "Fast Distributed Multi-agent Plan Execution with Dynamic Task Assignment and Scheduling.",
                    "A Decision-Theoretic Approach to Dynamic Sensor Selection in Camera Networks.",
                    "A Conformant Planner with Explicit Disjunctive Representation of Belief States.",
                    "Exploiting Coordination Locales in Distributed POMDPs via Social Model Shaping.",
                    "Multi-Agent Online Planning with Communication.",
                    "Integrating Planning and Scheduling in a CP Framework: A Transition-Based Approach.",
                    "Ant Search Strategies For Planning Optimization.",
                    "Acquisition of Object-Centred Domain Models from Planning Examples.",
                    "Multi-Goal Planning for an Autonomous Blasthole Drill.",
                    "Computing Robust Plans in Continuous Domains.",
                    "An Automatically Configurable Portfolio-based Planner with Macro-actions: PbP.",
                    "hm(P) = h1(Pm): Alternative Characterisations of the Generalisation From hmax To hm.",
                    "Path-Adaptive A* for Incremental Heuristic Search in Unknown Terrain.",
                    "Extended Goals for Composing Services.",
                    "From Discrete Mission Schedule to Continuous Implicit Trajectory using Optimal Time Warping.",
                    "Learning User Plan Preferences Obfuscated by Feasibility Constraints.",
                    "Exploiting N-Gram Analysis to Predict Operator Sequences.",
                    "Solving Resource-Constrained Project Scheduling Problems with Time-Windows Using Iterative Improvement Algorithms.",
                    "Using Distance Estimates in Heuristic Search."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "18th ICAPS 2008",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2008",
                "sub_name": "Proceedings of the Eighteenth International Conference on Automated Planning and Scheduling, ICAPS 2008, Sydney, Australia, September 14-18, 2008.",
                "count": 51,
                "papers": [
                    "The Compression Power of Symbolic Pattern Databases.",
                    "A Probabilistic Planner for the Combat Power Management Problem.",
                    "Exact Dynamic Programming for Decentralized POMDPs with Lossless Policy Compression.",
                    "From One to Many: Planning for Loosely Coupled Multi-Agent Systems.",
                    "Causal Graphs and Structurally Restricted Planning.",
                    "Additive-Disjunctive Heuristics for Optimal Planning.",
                    "A Hybrid Relaxed Planning Graph'LP Heuristic for Numeric Planning Domains.",
                    "Learning Relational Decision Trees for Guiding Heuristic Planning.",
                    "Planning for Modular Printers: Beyond Productivity.",
                    "Scheduling Meetings at Trade Events with Complex Preferences.",
                    "Generating Robust Schedules Subject to Resource and Duration Uncertainties.",
                    "A New Probabilistic Plan Recognition Algorithm Based on String Rewriting.",
                    "In Search of the Tractability Boundary of Planning Problems.",
                    "Multi-Objective Evolutionary Algorithms for Scheduling the James Webb Space Telescope.",
                    "A New Hybrid Genetic Algorithm for the Job Shop Scheduling Problem with Setup Times.",
                    "A New Local Search for the Job Shop Problem with Uncertain Durations.",
                    "A New Approach to Tractable Planning.",
                    "Unifying the Causal Graph and Additive Heuristics.",
                    "Rank-Dependent Probability Weighting in Sequential Decision Problems under Uncertainty.",
                    "Stochastic Planning with First Order Decision Diagrams.",
                    "Planning 3D Task Demonstrations of a Teleoperated Space Robot Arm.",
                    "Optimal Additive Composition of Abstraction-based Admissible Heuristics.",
                    "Structural Patterns Heuristics via Fork Decomposition.",
                    "Using Classical Planners to Solve Nondeterministic Planning Problems.",
                    "A Temporal Logic-Based Planning and Execution Monitoring System.",
                    "Generative Planning for Hybrid Systems Based on Flow Tubes.",
                    "Criticality Metrics for Distributed Plan and Schedule Management.",
                    "Angelic Hierarchical Planning: Optimal and Online Algorithms.",
                    "CircuitTSAT: A Solver for Large Instances of the Disjunctive Temporal Problem.",
                    "Bounded-Parameter Partially Observable Markov Decision Processes.",
                    "Learning Heuristic Functions through Approximate Linear Programming.",
                    "P3C: A New Algorithm for the Simple Temporal Problem.",
                    "Filtering for a Continuous Multi-Resources cumulative Constraint with Resource Consumption and Production.",
                    "Using Constraint Networks on Timelines to Model and Solve Planning and Scheduling Problems.",
                    "The Complexity of Optimal Planning and a More Efficient Method for Finding Solutions.",
                    "What Makes Planners Predictable?.",
                    "A Compact and Efficient SAT Encoding for Planning.",
                    "Realizing Multiple Autonomous Agents through Scheduling of Shared Devices.",
                    "Effective Information Value Calculation for Interruption Management in Multi-Agent Scheduling.",
                    "Fast Dynamic Scheduling of Disjunctive Temporal Constraint Networks through Incremental Compilation.",
                    "Efficient ADD Operations for Point-Based Algorithms.",
                    "Multiagent Planning Under Uncertainty with Stochastic Communication Delays.",
                    "HiPPo: Hierarchical POMDPs for Planning Information Processing and Sensing Actions on a Robot.",
                    "Faster than Weighted A*: An Optimistic Approach to Bounded Suboptimal Search.",
                    "Linear Relaxation Techniques for Task Management in Uncertain Settings.",
                    "Decentralized Online Scheduling of Combination-Appointments in Hospitals.",
                    "Fast and Memory-Efficient Multi-Agent Pathfinding.",
                    "Useless Actions Are Useful.",
                    "Stochastic Enforced Hill-Climbing.",
                    "An Online Learning Method for Improving Over-Subscription Planning.",
                    "Fast Planning for Dynamic Preferences."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "17th ICAPS 2007",
        "info": "Providence, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2007",
                "sub_name": "Proceedings of the Seventeenth International Conference on Automated Planning and Scheduling, ICAPS 2007, Providence, Rhode Island, USA, September 22-26, 2007.",
                "count": 45,
                "papers": [
                    "Planning Robust Temporal Plans: A Comparison Between CBTP and TGA Approaches.",
                    "Concurrent Probabilistic Temporal Planning with Policy-Gradients.",
                    "Mixed Integer Linear Programming for Exact Finite-Horizon Planning in Decentralized Pomdps.",
                    "Exploiting Procedural Domain Control Knowledge in State-of-the-Art Planners.",
                    "A Hybrid Linear Programming and Relaxed Plan Heuristic for Partial Satisfaction Planning Problems.",
                    "FF + FPG: Guiding a Policy-Gradient Planner.",
                    "Dynamic Control in Path-Planning with Real-Time Heuristic Search.",
                    "An Innovative Product for Space Mission Planning: An A Posteriori Evaluation.",
                    "Online Planning for Resource Production in Real-Time Strategy Games.",
                    "Act Local, Think Global: Width Notions for Tractable Planning.",
                    "Planning with Respect to an Existing Schedule of Events.",
                    "A New Local-Search Algorithm for Forward-Chaining Planning.",
                    "Online Identification of Useful Macro-Actions for Planning.",
                    "Evaluating Temporal Planning Domains.",
                    "Prioritizing Bellman Backups without a Priority Queue.",
                    "The Manpower Allocation Problem with Time Windows and Job-Teaming Constraints.",
                    "External Memory Value Iteration.",
                    "Bounding the Resource Availability of Activities with Linear Resource Impact.",
                    "Monitoring Plan Optimality During Execution.",
                    "On the Hardness of Planning Problems with Simple Causal Graphs.",
                    "Towards a Heuristic for Scheduling the James Webb Space Telescope.",
                    "Gradient-Based Relational Reinforcement Learning of Temporally Extended Policies.",
                    "Flexible Abstraction Heuristics for Optimal Sequential Planning.",
                    "Constructing Conflict-Free Schedules in Space and Time.",
                    "Temporally-Expressive Planning as Constraint Satisfaction Problems.",
                    "Structural Patterns of Tractable Sequentially-Optimal Planning.",
                    "Robust Local Search and Its Application to Generating Robust Schedules.",
                    "Planning with Diversified Models for Fault-Tolerant Robots.",
                    "Learning to Plan Using Harmonic Analysis of Diffusion Models.",
                    "Angelic Semantics for High-Level Actions.",
                    "Cost-Sharing Approximations for h+.",
                    "Transformational Planning for Everyday Activity.",
                    "Learning Macro-Actions for Arbitrary Planners and Domains.",
                    "From Conformant into Classical Planning: Efficient Translations that May Be Complete Too.",
                    "Managing Personal Tasks with Time Constraints and Preferences.",
                    "Complexity of Concurrent Temporal Planning.",
                    "Approximate Solution Techniques for Factored First-Order MDPs.",
                    "A Fast Incremental Algorithm for Maintaining Dispatchability of Partially Controllable Plans.",
                    "Generating Exponentially Smaller POMDP Models Using Conditionally Irrelevant Variable Abstraction.",
                    "Using Decision Procedures Efficiently for Optimization.",
                    "Using Adaptive Priority Weighting to Direct Search in Probabilistic Scheduling.",
                    "Context-Aware Logistic Routing and Scheduling.",
                    "itSIMPLE 2.0: An Integrated Tool for Designing Planning Domains.",
                    "Discovering Relational Domain Features for Probabilistic Planning.",
                    "FF-Replan: A Baseline for Probabilistic Planning."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "16th ICAPS 2006",
        "info": "Cumbria, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2006",
                "sub_name": "Proceedings of the Sixteenth International Conference on Automated Planning and Scheduling, ICAPS 2006, Cumbria, UK, June 6-10, 2006.",
                "count": 61,
                "papers": [
                    "An Affectively Driven Planner for Synthetic Characters.",
                    "Bringing Users and Planning Technology Together. Experiences in SIADEX.",
                    "Predictive Planning for Supply Chain Management.",
                    "Scalable Planning for Distributed Stream Processing Systems.",
                    "Bounded Branching and Modalities in Non-Deterministic Planning.",
                    "New Complexity Results for Classical Planning Benchmarks.",
                    "Efficiently Handling Temporal Knowledge in an HTN Planner.",
                    "Tractable Optimal Competitive Scheduling.",
                    "On Some Tractable Cases of Logical Filtering.",
                    "Optimal Rectangle Packing: A Meta-CSP Approach.",
                    "Lemma Reusing for SAT based Planning and Scheduling.",
                    "Solving Factored MDPs with Exponential-Family Transition Models.",
                    "Stochastic Over-Subscription Planning Using Hierarchies of MDPs.",
                    "Optimal Route Planning under Uncertainty.",
                    "Learning Depth-First Search: A Unified Approach to Heuristic Search in Deterministic and Non-Deterministic Settings, and Its Application to MDPs.",
                    "Explanation-Based Acquisition of Planning Operators.",
                    "Learning Heuristic Functions from Relaxed Plans.",
                    "Evaluating Mixed-Initiative Systems: An Experimental Approach.",
                    "Metatheoretic Plan Summarization and Comparison.",
                    "Safe LTL Assumption-Based Planning.",
                    "Goal Achievement in Partially Known, Partially Observable Domains.",
                    "Plan Stability: Replanning versus Plan Repair.",
                    "Incremental Scheduling to Maximize Quality in a Dynamic Environment.",
                    "Sequential Monte Carlo in Probabilistic Planning Reachability Heuristics.",
                    "Fast Probabilistic Planning through Weighted Model Counting.",
                    "Combining Knowledge Compilation and Search for Conformant Probabilistic Planning.",
                    "Concurrent Probabilistic Planning in the Graphplan Framework.",
                    "An Empirical Study of Multi-Point Constructive Search for Constraint-Based Scheduling.",
                    "Structure and Problem Hardness: Goal Asymmetry and DPLL Proofs in SAT-Based Planning.",
                    "Friends or Foes? An AI Planning Perspective on Abstraction and Search.",
                    "Memory-Efficient Symbolic Heuristic Search.",
                    "Looking for Shortcuts: Infeasible Search Analysis for Oversubscribed Scheduling Problems.",
                    "Exploiting the Power of Local Search in a Branch and Bound Algorithm for Job Shop Scheduling.",
                    "A Multi-Start Very Large Neighbourhood Search Approach with Local Search Methods for Examination Timetabling.",
                    "SEMAPLAN: Combining Planning with Semantic Matching to Achieve Web Service Composition.",
                    "Planning with Temporally Extended Goals Using Heuristic Search.",
                    "Run-Time Monitoring of the Execution of Plans for Web Service Composition.",
                    "Incremental Maintenance of Double Precedence Graphs: A Constraint-Based Approach.",
                    "Towards Strong Cyclic Planning under Partial Observability.",
                    "Automated Web Service Composition by On-the-Fly Belief Space Search.",
                    "RRT-Plan: A Randomized Algorithm for STRIPS Planning.",
                    "Motion Economy and Planning.",
                    "Lessons Learned in Applying Domain-Independent Planning to High-Speed Manufacturing.",
                    "On the Compilation of Plan Constraints and Preferences.",
                    "Reusing and Building a Policy Library.",
                    "Durative Planning in HTNs.",
                    "Robust Execution of Temporally Flexible Plans for Bipedal Walking Devices.",
                    "Learning to Do HTN Planning.",
                    "Learning Behaviors Models for Robot Execution Control.",
                    "Planning for PDDL3 - An OCSP Based Approach.",
                    "A New Principle for Incremental Heuristic Search: Theoretical Results.",
                    "Resource Contention Metrics for Oversubscribed Scheduling Problems.",
                    "Probabilistic Planning with Nonlinear Utility Functions.",
                    "Challenges for Temporal Planning with Uncertain Durations.",
                    "Automated Planning Using Quantum Computation.",
                    "Knowledge-based Middleware as an Architecture for Planning and Scheduling Systems.",
                    "Combining Stochastic Task Models with Reinforcement Learning for Dynamic Scheduling.",
                    "Spacetrack: Trading off Quality and Utilization in Oversubscribed Schedules.",
                    "On the Use of UML.P for Modeling a Real Application as a Planning Problem.",
                    "Reconfigurable Path Planning for an Autonomous Unmanned Aerial Vehicle.",
                    "Optimal STRIPS Planning by Maximum Satisfiability and Accumulative Learning."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "15th ICAPS 2005",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2005",
                "sub_name": "Proceedings of the Fifteenth International Conference on Automated Planning and Scheduling (ICAPS 2005), June 5-10 2005, Monterey, California, USA.",
                "count": 33,
                "papers": [
                    "Automated Composition of Web Services by Planning in Asynchronous Domains.",
                    "Course of Action Generation for Cyber Security Using Classical Planning.",
                    "Minimizing Breaks in Sport Scheduling with Local Search.",
                    "On-line Planning and Scheduling for High-speed Manufacturing.",
                    "Activity Planning for the Mars Exploration Rovers.",
                    "External Symbolic Heuristic Search with Pattern Databases.",
                    "Charecterizing the Distribution of Low-Makespan Schedules in the Job Shop Scheduling Problem.",
                    "Contingent Planning via Heuristic Forward Search witn Implicit Belief States.",
                    "Randomized Large Neighborhood Search for Cumulative Scheduling.",
                    "Beam-Stack Search: Integrating Backtracking with Beam Search.",
                    "A Generalized Framework for Lifelong Planning A* Search.",
                    "On the Tractability of Restricted Disjunctive Temporal Problems.",
                    "Concurrent Probabilistic Temporal Planning.",
                    "Search Control in Planning for Temporally Extended Goals.",
                    "Pruning Conformant Plans by Counting Models on Compiled d-DNNF Representations.",
                    "Fast Exact Planning in Markov Decision Processes.",
                    "Plan Repair as an Extension of Planning.",
                    "Online Stochastic Optimization Without Distributions.",
                    "Planning with Goal Preferences and Constraints.",
                    "Planning Graph Heuristics for Selecting Objectives in Over-subscription Planning Problems.",
                    "Solving Over-constrained Disjunctive Temporal Problems with Preferences.",
                    "Retaining Flexibility to Maximize Quality: When the Scheduler Has the Right to Decide Activity Durations.",
                    "Discovering Planning Invariants as Anomalies in State Descriptions.",
                    "Learning Partial-Order Macros from Solutions.",
                    "Learning Actions Models from Plan Examples with Incomplete Knowledge.",
                    "Enabling Fast Flexible Planning through Incremental Temporal Reasoning with Conflict Extraction.",
                    "Anytime Dynamic A*: An Anytime, Replanning Algorithm.",
                    "Maximizing Availability: A Commitment Heuristic for Oversubscribed Scheduling Problems.",
                    "Planning as Mixed-Initiative Goal Manipulation.",
                    "Satisfiability Planning with Constraints on the Number of Actions.",
                    "A Hierarchical Task-Network Planner based on Symbolic Model Checking.",
                    "Reviving Integer Programming Approaches for AI Planning: A Branch-and-Cut Framework.",
                    "Genetic Planning Using Variable Length Chromosomes."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "14th ICAPS 2004",
        "info": "Whistler, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2004",
                "sub_name": "Proceedings of the Fourteenth International Conference on Automated Planning and Scheduling (ICAPS 2004), June 3-7 2004, Whistler, British Columbia, Canada.",
                "count": 43,
                "papers": [
                    "Extending the Knowledge-Based Approach to Planning with Incomplete Information and Sensing.",
                    "Knowledge of Other Agents and Communicative Actions in the Fluent Calculus.",
                    "Precondition Control and the Progression Algorithm.",
                    "A Preference-Based Interpretation of Other Agents' Actions.",
                    "From Hybrid Systems to Universal Plans via Domain Compilation.",
                    "Planning Graphs and Knowledge Compilation.",
                    "Domain-Specific Preferences for Causal Reasoning and Planning.",
                    "Learning Probabilistic Relational Planning Rules.",
                    "An Improved Integer Local Search for Complex Scheduling Problems.",
                    "Breadth-First Heuristic Search.",
                    "Phase Transitions in Classical Planning: An Experimental Study.",
                    "A Polynomial Time Algorithm for Constructing k-Maintainable Policies.",
                    "Multiple Pattern Databases.",
                    "A Linear Search Strategy using Bounds.",
                    "Optimal Rectangle Packing: New Results.",
                    "A Lookahead Strategy for Heuristic Search Planning.",
                    "A Planning Heuristic Based on Causal Graph Analysis.",
                    "An Empirical Analysis of Some Heuristic Features for Local Search in LPG.",
                    "Using Component Abstraction for Automatic Generation of Macro-Actions.",
                    "Learning Domain-Specific Control Knowledge from Random Walks.",
                    "Iterative Relaxations for Iterative Flattening in Cumulative Scheduling.",
                    "Generating Robust Schedules through Temporal Flexibility.",
                    "The Value of Consensus in Online Stochastic Scheduling.",
                    "Trading Places: How to Schedule More in a Multi-Resource Oversubscribed Scheduling Problem.",
                    "Task Swapping for Schedule Improvement: A Broader Analysis.",
                    "Price Prediction Strategies for Market-Based Scheduling.",
                    "Two-Job Shop Scheduling Problems with Availability Constraints.",
                    "Incremental Maximum Flows for Fast Envelope Computation.",
                    "Planning with Extended Goals and Partial Observability.",
                    "Guiding Planner Backjumping Using Verifier Traces.",
                    "Probabilistic Plan Recognition in Multiagent Systems.",
                    "Statistical Goal Parameter Recognition.",
                    "Heuristic Refinements of Approximate Linear Programming for Factored Continuous-State Markov Decision Processes.",
                    "Optimal Resource Allocation and Policy Formulation in Loosely-Coupled Markov Decision Processes.",
                    "Policy Generation for Continuous-time Stochastic Domains with Concurrency.",
                    "Fault Tolerant Planning: Toward Probabilistic Uncertainty Models in Symbolic Non-Deterministic Planning.",
                    "Complexity of Planning with Partial Observability.",
                    "Conformant Planning via Heuristic Forward Search: A New Approach.",
                    "Heuristic Guidance Measures for Conformant Planning.",
                    "Plays as Effective Multiagent Plans Enabling Opponent-Adaptive Play Selection.",
                    "Distributed Feedback Control for Decision Making on Supply Chains.",
                    "Choosing Objectives in Over-Subscription Planning.",
                    "Decision-Theoretic Military Operations Planning."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "13th ICAPS 2003",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2003",
                "sub_name": "Proceedings of the Thirteenth International Conference on Automated Planning and Scheduling (ICAPS 2003), June 9-13, 2003, Trento, Italy.",
                "count": 30,
                "papers": [
                    "Automated Planning and Scheduling using Calculus of Variations in Discrete Space.",
                    "Labeled RTDP: Improving the Convergence of Real-Time Dynamic Programming.",
                    "Branching Matters: Alternative Branching in Graphplan.",
                    "Symmetry Reduction for SAT Representations of Transition Systems.",
                    "Improving Temporal Flexibility of Position Constrained Metric Temporal Plans.",
                    "Exploiting a Graphplan Framework in Temporal Planning.",
                    "Local Search Techniques for Temporal Planning in LPG.",
                    "Localizing Planning with Functional Process Models.",
                    "Learning Rules for Adaptive Planning.",
                    "GIPO II: HTN Planning in a Tool-supported Knowledge Engineering Environment.",
                    "GPT Meets PSR.",
                    "Synthesis of Hierarchical Finite-State Controllers for POMDPs.",
                    "Guided Symbolic Universal Planning.",
                    "Decision-Theoretic Group Elevator Scheduling.",
                    "Reasoning about Autonomous Processes in an Estimated-Regression Planner.",
                    "The Role of Planning in Grid Computing.",
                    "Recommendation as a Stochastic Sequential Decision Problem.",
                    "Planning for Marketing Campaigns.",
                    "Expressive Equivalence of Formalisms for Planning with Sensing.",
                    "A Framework for Planning in Continuous-time Stochastic Domains.",
                    "Conformant Probabilistic Planning via CSPs.",
                    "A Framework for Planning with Extended Goals under Partial Observability.",
                    "SOFIA's Choice: Scheduling Observations for an Airborne Observatory.",
                    "A Multi-Heuristic GA for Schedule Repair in Precast Plant Production.",
                    "A Multi-Agent System-driven AI Planning Approach to Biological Pathway Discovery.",
                    "A Mixed-initiative Framework for Robust Plan Sketching.",
                    "Vehicle Routing and Job Shop Scheduling: What's the Difference?",
                    "Quality and Utility - Towards a Generalization of Deadline and Anytime Scheduling.",
                    "Optimal Rectangle Packing: Initial Results.",
                    "Economically Augmented Job Shop Scheduling."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "6th AIPS 2002",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2002",
                "sub_name": "Proceedings of the Sixth International Conference on Artificial Intelligence Planning Systems, April 23-27, 2002, Toulouse, France.",
                "count": 34,
                "papers": [
                    "Planning Graph-based Heuristics for Cost-sensitive Temporal Planning.",
                    "LPG: A Planner Based on Local Search for Planning Graphs with Action Costs.",
                    "Analyzing Plans with Conditional Effects.",
                    "Structure and Complexity in Planning with Unary Operators.",
                    "Decidability and Undecidability Results for Planning with Numerical State Variables.",
                    "On the Role of Ground Actions in Refinement Planning.",
                    "Active Coordination of Distributed Human Planners.",
                    "Planning for Distributed Execution through Use of Probabilistic Opponent Models.",
                    "Extending the Exploitation of Symmetries in Planning.",
                    "Local Search Topology in Planning Benchmarks: A Theoretical Analysis.",
                    "Applying Domain Analysis Techniques for Domain-Dependent Control in TALplanner.",
                    "On Control Knowledge Acquisition by Exploiting Human-Computer Interaction.",
                    "An Interactive Method for Inducing Operator Descriptions.",
                    "CaMeL: Learning Method Preconditions for HTN Planning.",
                    "Improving Heuristics for Planning as Search in Belief Space.",
                    "Fragment-based Conformant Planning.",
                    "Faster Probabilistic Planning through More Efficient Stochastic Satisfiability Problem Encodings.",
                    "Backward Plan Construction for Planning with Partial Observability.",
                    "Speculative Execution for Information Gathering Plans.",
                    "Execution Monitoring with Quantitative Temporal Dynamic Bayesian Networks.",
                    "Estimated-Regression Planning for Interactions with Web Services.",
                    "A Knowledge-Based Approach to Planning with Incomplete Information and Sensing.",
                    "Plan Representation for Robotic Agents.",
                    "Universal Quantification in a Constraint-Based Planner.",
                    "A Plan-Based Personalized Cognitive Orthotic.",
                    "The Logic of Reachability.",
                    "On the Identification and Use of Hierarchical Resources in Planning and Scheduling.",
                    "Symbolic Pattern Databases in Heuristic Search Planning.",
                    "Constraint Model-based Planning and Scheduling with Multiple Resources and Complex Collaboration Schema.",
                    "Heuristic Search-Based Replanning.",
                    "The FAR-OFF System: A Heuristic Search Case-Based Planning.",
                    "Filtering Algorithms for Batch Processing with Sequence Dependent Setup Times.",
                    "Planning Technology for Intelligent Cognitive Orthotics.",
                    "The Third International Planning Competition: Temporal and Metric Planning."
                ]
            },
            {
                "sub_name_abbr": "conf/aips/2002w2",
                "sub_name": "AIPS 2002 Workshop on Planning for Temporal Domains, Toulous, France, April 24, 2002.",
                "count": 13,
                "papers": [
                    "Temporal Planning through Mixed Integer Programming.",
                    "Fast Temporal Planning in a Graphplan Framework.",
                    "Encoding Temporal Planning as CSP.",
                    "An Incremental Temporal Partial-Order Planner.",
                    "Handling Durative Actions in a Continuous Planning Framework.",
                    "Improving the Temporal Flexibility of Position Constrained Temporal Plans.",
                    "Mixed Propositional and Numeric Planning in the Model Checking Integrated Planning System.",
                    "A Temporal Planning System for Level 3 Durative Actions of PDDL+.",
                    "Timed Automata as an Underlying Model for Planning and Scheduling.",
                    "Temporal Constraints and the \"Physics versus Advice\" Issue from a Practical Perspective.",
                    "Timeline: An HTN Planner that can Reason about Time.",
                    "One Step on the Left, One Step on the Right, and Back to the Middle: Exploring Temporal Domains in a POP Fashion.",
                    "Planning Under Continuous Time and Resource Uncertainty: A Challenge for AI."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "5th AIPS 2000",
        "info": "Breckenridge, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/2000",
                "sub_name": "Proceedings of the Fifth International Conference on Artificial Intelligence Planning Systems, Breckenridge, CO, USA, April 14-17, 2000.",
                "count": 44,
                "papers": [
                    "Learning Plan Rewriting Rules.",
                    "DPPlan: An Algorithm for Fast Solutions Extraction from a Planning Graph.",
                    "Heuristics for Constraint-Directed Scheduling with Inventory.",
                    "Mixed-Initiative Resource Management: The AMC Barrel Allocator.",
                    "Probabilistic Hybrid Action Models for Predicting Concurrent Percept-Driven Robot Behavior.",
                    "Planning with Incomplete Information as Heuristic Search in Belief Space.",
                    "On-line Scheduling via Sampling.",
                    "A New Perspective on Algorithms for Optimizing Policies under Uncertainty.",
                    "Solving Planning-Graph by Compiling It into CSP.",
                    "Solving Scheduling Problems with Setup Times and Alternative Resources.",
                    "Utilizing Automatically Inferred Invariants in Graph Construction and Search.",
                    "Fast Plan Adaptation through Planning Graphs: Local and Systematic Search Techniques.",
                    "The Complexity of Model Aggregation.",
                    "Dynamic Programming for POMDPs Using a Factored State Representation.",
                    "Admissible Heuristics for Optimal Planning.",
                    "Planning with Reduced Operator Sets.",
                    "Computing Global Strategies for Multi-Market Commodity Trading.",
                    "OBDD-Based Universal Planning for Multiple Synchronized Agents in Non-Deterministic Domains.",
                    "Planning in Interplanetary Space: Theory and Practice.",
                    "Representations of Decision-Theoretic Planning Tasks.",
                    "Automatic Synthesis and Use of Generic Types in Planning.",
                    "New Advances in GraphHTN: Identifying Independent Subproblems in Large HTN Domains.",
                    "Object Transition Sequences: A New Form of Abstraction for HTN Planners.",
                    "Plan Generation for GUI Testing.",
                    "Using Generic Preferences to Incrementally Improve Plan Quality.",
                    "Learning Planning Operators in Real-World, Partially Observable Environments.",
                    "Challenges and Methods in Testing the Remote Agent Planner.",
                    "Merging Plans with Quantitative Temporal Constraints, Temporally Extended Actions, and Conditional Branches.",
                    "New Results about LCGP, a Least Committed GraphPlan.",
                    "Dispatchable Execution of Schedules Involving Consumable Resources.",
                    "PSIPLAN: Open World Planning with y-Forms.",
                    "Using Iterative Repair to Improve the Responsiveness of Planning and Scheduling.",
                    "Investigating the Effect of Relevance and Reachability Constraints on SAT Encodings of Planning.",
                    "Distance-Based Goal-Ordering Heuristics for Graphplan.",
                    "Approximate Solutions to Factored Markov Decision Processes via Greedy Search in the Space of Finite State Controllers.",
                    "Elevator Control as a Planning Problem.",
                    "Computing Valid Intervals for Collections of Activities with Shared States and Resources.",
                    "A Planning Fully Based on Linear Time Logic.",
                    "Planning with Conflicting Advice.",
                    "Exploiting State Constraints in Heuristic State-Space Planning.",
                    "Applying Inductive Program Synthesis to Macro Learning.",
                    "Using AI Planning Technology for Army Small Unit Operations.",
                    "Vision-Servoed Localization and Behavior-Based Planning for an Autonomous Quadruped Legged Robot.",
                    "A Unified Dynamic Approach for Dealing with Temporal Uncertainty and Conditional Planning."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "4th AIPS 1998",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/1998",
                "sub_name": "Proceedings of the Fourth International Conference on Artificial Intelligence Planning Systems, Pittsburgh, Pennsylvania, USA, 1998.",
                "count": 27,
                "papers": [
                    "Flexible and Scalable Query Planning in Distributed and Heterogeneous Environments.",
                    "AsbruView: Visualization of Time-Oriented, Skeletal Plans.",
                    "Multi-Agent Coalition Formation in Power Transmission Planning: A Bilateral Shapley Value Approach.",
                    "Generation of Multiple Qualitatively Different Plan Options.",
                    "Strong Planning in Non-Deterministic Domains Via Model Checking.",
                    "Conditional Effects in Graphplan.",
                    "Making Forward Chaining Relevant.",
                    "Solving Complex Planning Tasks Through Extraction of Subproblems.",
                    "Leap Before You Look: Information Gathering in the PUCCINI Planner.",
                    "A Complete Bidirectional Planner.",
                    "MAXPLAN: A New Approach to Probabilistic Planning.",
                    "Search Control of Plan Generation in Decision-Theoretic Planners.",
                    "Solving Stochastic Planning Problems with Large State and Action Spaces.",
                    "A Modular Structured Approach to Conditional Decision-Theoretic Planning.",
                    "Planning, Execution and Learning in a Robotic Agent.",
                    "How to Solve It Automatically: Selection Among Problem Solving Methods.",
                    "Genetic Programming of Control Knowledge for Planning.",
                    "Solving Robot Navigation Problems with Initial Pose Uncertainty Using Real-Time Heuristic Search.",
                    "A Multiagent Planning Architecture.",
                    "Causal Models of Mobile Service Robot Behavior.",
                    "Rationale-Based Monitoring for Planning in Dynamic Environments.",
                    "The Role of Domain-Specific Knowledge in the Planning as Satisfiability Framework.",
                    "Encoding HTN Planning in Propositional Logic.",
                    "The \"Limit\" Domain.",
                    "Randomization in Backtrack Search: Exploiting Heavy-Tailed Profiles for Solving Hard Scheduling Problems.",
                    "Profile-Based Algorithms to Solve Multiple Capacitated Metric Scheduling Problems.",
                    "A Conditional Scheduling Approach to Designing Real-Time Systems."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3rd AIPS 1996",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/1996",
                "sub_name": "Proceedings of the Third International Conference on Artificial Intelligence Planning Systems, Edinburgh, Scotland, May 29-31, 1996.",
                "count": 35,
                "papers": [
                    "On-line Planning Simulation.",
                    "Modeling Planning Tasks.",
                    "Local Planning of Ongoing Activities.",
                    "Event-Based Decompositions for Reasoning about External Change in Planners.",
                    "ITAS: A Portable, Interactive Transportation Scheduling Tool Using a Search Engine Generated from Formal Specifications.",
                    "A Constraint Satisfaction Approach to Makespan Scheduling.",
                    "Static and Completion Analysis for Planning Knowledge Base Development and Verification.",
                    "Modeling Probabilistic Actions for Practical Decision-Theoretic Planning.",
                    "TRAINS-95: Towards a Mixed-Initiative Planning Assistant.",
                    "Modularity Issues in Reactive Planning.",
                    "Least-Commitment Action Selection.",
                    "Computing Parameter Domains as an Aid to Planning.",
                    "Planning Experiments: Resolving Interactions between Two Planning Spaces.",
                    "Expressive Planning and Explicit Knowledge.",
                    "Using Loops in Decision-Theoretic Refinement Planners.",
                    "A Candidate Set Based Analysis of Subgoal Interactions in Conjunctive Goal Planning.",
                    "Building a Planner for Information Gathering: A Report from the Trenches.",
                    "A Heuristic Estimator for Means-Ends Analysis in Planning.",
                    "Planning for Manufacturing Workpieces by Storing, Indexing and Replaying Planning Decisions.",
                    "A Procedural Knowledge Approach to Task-Level Control.",
                    "A Cooperative Repair Method for a Distributed Scheduling System.",
                    "Comparing Heuristic, Evolutionary and Local Search Approaches to Scheduling.",
                    "Suspending Recursion in Causal-Link Planning.",
                    "Algorithms for Solving Distributed Constraint Satisfaction Problems (DCSPs).",
                    "A Discipline for Reactive Rescheduling.",
                    "A Planner for Exploratory Data Analysis.",
                    "Deduction-Based Refinement Planning.",
                    "Representing Plans as a Set of Constraints - the <I-N-OVA> Model.",
                    "Planning While Learning Operators.",
                    "Flaw Selection Strategies for Value-Directed Planning.",
                    "Segmenting Reactions to Improve the Behavior of a Planning/Reacting Agent.",
                    "Controlling Deliberation with the Success Probability in a Dynamic Environment.",
                    "Proof Planning.",
                    "Planning-Based Control of Software Agents.",
                    "Model-Based Autonomous Systems in the New Millenium."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2nd AIPS 1994",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/1994",
                "sub_name": "Proceedings of the Second International Conference on Artificial Intelligence Planning Systems, University of Chicago, Chicago, Illinois, USA, June 13-15, 1994.",
                "count": 59,
                "papers": [
                    "Generating Plans To Succeed in Uncertain Environments.",
                    "Improving Robot Plans During Their Execution.",
                    "Managing Dynamic Temporal Constraint Networks.",
                    "Constructing Simplified Plans Via Truth Criteria Approximation.",
                    "Solving Time-critical Decision-making Problems with Predictable Computational Demands.",
                    "Probabilistic Planning with Information Gathering and Contingent Execution.",
                    "Plan Execution Motivation in Multi-agent Systems.",
                    "Arguing about Plans: Plan Representation and Reasoning for Mixed-initiative Planning.",
                    "Task Networks for Controlling Continuous Processes.",
                    "The Intentional Planning System: ItPlanS.",
                    "Representation and Control in IxTeT, a Temporal Planner.",
                    "Approximate Planning (Extended Abstract).",
                    "Planning with Failure.",
                    "Conditional Linear Planning.",
                    "Reasoning About When to Start Acting.",
                    "Design Tradeoffs in Partial Order (Plan space) Planning.",
                    "Generating Parallel Execution Plans with a Partial-order Planner.",
                    "Avoiding Pitfalls in Case-based Planning.",
                    "Action-based Planning.",
                    "Testing Incremental Adaptation.",
                    "Real-time Planning by Interleaving Real-time Search with Subgoaling.",
                    "Embedded Planning.",
                    "Toward a Plan Steering Agent: Experiments with Schedule Maintenance.",
                    "Incremental Search Algorithms for Real-time Decision Making.",
                    "Synthesizing Protection Monitors from Causal Structure.",
                    "Becoming Increasingly Reliable.",
                    "The Use of Supervenience in Dynamic-world Planning.",
                    "The Need for Different Domain-independent Heuristics.",
                    "Linkability: Examining Causal Link Commitments in Partial-order Planning.",
                    "Optimal Planning with a Goal-directed Utility Model.",
                    "Delaying Variable Binding Commitments in Planning.",
                    "Decomposition and Causality in Partial-order Planning.",
                    "Planning-based Integrated Decision Support Systems.",
                    "Decision-theoretic Control of Failure Recovery.",
                    "The Design of ALPS: An Adaptive Learning and Planning System.",
                    "Producing Satisficing Solutions to Scheduling Problems: An Interactive Constraint Relaxation Approach.",
                    "Using AI Planning Techniques to Automatically Generate Image Processing Procedures.",
                    "Reconfiguration of Multi-agent Planning Systems.",
                    "Branching Continuous Time and the Semantics of Continuous Action.",
                    "Automatic Derivation of World Update Schemes.",
                    "The Use of Optimistic and Pessimistic Resource Profiles to Inform Search in an Activity Based Planner.",
                    "UMCP: A Sound and Complete Procedure for Hierarchical Task-network Planning.",
                    "Adapting Routines to Improve Task Coordination.",
                    "Robot Motion Planning Integrating Planning Strategies and Learning Methods.",
                    "Decision-theoretic Refinement Planning Using Inheritance Abstraction.",
                    "Planning for Dynamic Configuration of Component-based Architectures.",
                    "Planning, Behaviours, Decomposition, and Monitoring Using Graph Grammars and Fuzzy Logic.",
                    "A Planner with Quality Goal and Its Speed-up Learning for Optimization Problem.",
                    "Planning with Thematic Actions.",
                    "How to Make Probabilistic Planners Risk-sensitive (Without Altering Anything).",
                    "Reactive and Automatic Behavior in Plan Execution.",
                    "Human Frontal Lobes and AI Planning Systems.",
                    "Quantitative Operator Selection for Planning Under Uncertainty.",
                    "Splitting Multiple Situations in Conditional Planning.",
                    "Control Knowledge to Improve Plan Quality.",
                    "Opportunities: A Unifying Framework for Planning and Execution.",
                    "Learning Planning Operators by Observation and Practice.",
                    "Case Adaptation in a Case-based Process Planning System.",
                    "A Framework for Automatic Problem Decomposition in Planning."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "1st AIPS 1992",
        "info": "College Park, Maryland, USA",
        "venues": []
    },
    {
        "year": "1990",
        "name": "Expert Planning Systems 1990",
        "info": "Brighton, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/aips/1990",
                "sub_name": "Proceedings of the First International Conference on Expert Planning Systems, Brighton, UK, June 27-29, 1990.",
                "count": 48,
                "papers": [
                    "Operations research and artificial intelligence cooperation to solve scheduling problems: the OPAL and OSCAR systems.",
                    "Planning for the manufacturing domain: Long-term and reactive scheduling.",
                    "ReDS: A planning and scheduling environment for manufacturing.",
                    "Resolving conflicting objectives in factory scheduling.",
                    "An evaluation function to compare alternative commitments during manufacturing planning and scheduling.",
                    "A production planning expert system in manufacturing.",
                    "The use of decision support systems in manufacturing management.",
                    "Advances in A I applications for power system planning.",
                    "Decision support systems for planners of water supply systems.",
                    "Multi-service digital access network planning with the expert system RAMSES.",
                    "A planning approach in building a computer aided design system.",
                    "AEROPLAN - An expert system for planning supply and storage of jet fuel.",
                    "An AI-assisted geographical planner.",
                    "PlanERS-1: An expert planning system for generating spacecraft mission plane.",
                    "Mission scheduling for spacecraft: Diaries of T-SCHED.",
                    "A knowledge based scheduler.",
                    "Knowledge based master production scheduler.",
                    "Mott's business-management expert planning system.",
                    "RBD - Rule based job dispatching software for implementing production plans.",
                    "A rule based planning and scheduling system for manufacturing industries.",
                    "A knowledge based planning and scheduling toolkit for the process industry.",
                    "Constraint knowledge for construction scheduling.",
                    "Resource and activity simulation in a knowledge-based planning system.",
                    "An approach to production flow analysis using concepts from information theory.",
                    "EXCAP: an expert process planning system for turned components.",
                    "Expert planning system for copper smelter.",
                    "Expert system for process planning int the cold forging of steel.",
                    "Adaptive production planning environments using decision rules and simulation.",
                    "Complete, consistent goal sets: Controlling the research within non-linear plan generation.",
                    "Modal logics for AI planning.",
                    "A structure for an interactive project management system.",
                    "Interacting with an intelligent planning system using English sentences.",
                    "Interactive planning system design, a model and an application.",
                    "Knowledge-based planning systems: An engineering perspective.",
                    "Using domain knowledge to restrict search in an AI planner.",
                    "Planning and reasoning with processes.",
                    "Representing parts hierarchies for expert systems in engineering project management.",
                    "Contingency handling in project planning.",
                    "A decision support system for timetable construction: Automated lesson planning using a special scheduling algorithm.",
                    "Another timetabling approach.",
                    "Case based planning for simulation.",
                    "Knowledge based decision support system for the selection of industrial robots.",
                    "Decision support system class for R&D planning.",
                    "Executive decision support systems business goal seeking.",
                    "Knowledge based strategic planning system.",
                    "A constraint-based approach to construction planning of multi-storey buildings.",
                    "Investment priority criteria in energy subtransmission and distribution systems at EMCALI.",
                    "Structuring techniques for knowledge-based planning systems in environmental impact assessment."
                ]
            }
        ]
    }
]