[
    {
        "year": "2021",
        "name": "IJCB 2021",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2021",
                "sub_name": "International IEEE Joint Conference on Biometrics, IJCB 2021, Shenzhen, China, August 4-7, 2021.",
                "count": 72,
                "papers": [
                    "Child Face Age Progression and Regression using Self-Attention Multi-Scale Patch GAN.",
                    "Preserving Gender and Identity in Face Age Progression of Infants and Toddlers.",
                    "Learning Discriminative Speaker Embedding by Improving Aggregation Strategy and Loss Function for Speaker Verification.",
                    "CAS-AIR-3D Face: A Low-Quality, Multi-Modal and Multi-Pose 3D Face Database.",
                    "On the Effectiveness of Vision Transformers for Zero-shot Face Anti-Spoofing.",
                    "Orientation Field Estimation for Latent Fingerprints with Prior Knowledge of Fingerprint Pattern.",
                    "Self-Augmented Heterogeneous Face Recognition.",
                    "NIR Iris Challenge Evaluation in Non-cooperative Environments: Segmentation and Localization.",
                    "MFR 2021: Masked Face Recognition Competition.",
                    "Federated Learning-based Active Authentication on Mobile Devices.",
                    "High Quality Facial Data Synthesis and Fusion for 3D Low-quality Face Recognition.",
                    "An End-to-End Autofocus Camera for Iris on the Move.",
                    "YakReID-103: A Benchmark for Yak Re-Identification.",
                    "Attention-guided Progressive Mapping for Profile Face Recognition.",
                    "Iris Presentation Attack Detection by Attention-based and Deep Pixel-wise Binary Supervision Network.",
                    "Multi-subband and Multi-subepoch Time Series Feature Learning for EEG-based Sleep Stage Classification.",
                    "Concealable Biometric-based Continuous User Authentication System An EEG Induced Deep Learning Model.",
                    "Does Face Recognition Error Echo Gender Classification Error?",
                    "ReSGait: The Real-Scene Gait Dataset.",
                    "Vulnerability Assessment and Presentation Attack Detection Using a Set of Distinct Finger Vein Recognition Algorithms.",
                    "RamFace: Race Adaptive Margin Based Face Recognition for Racial Bias Mitigation.",
                    "Simultaneous Face Hallucination and Translation for Thermal to Visible Face Verification using Axial-GAN.",
                    "Conditional Identity Disentanglement for Differential Face Morph Detection.",
                    "Robust End-to-End Hand Identification via Holistic Multi-Unit Knuckle Recognition.",
                    "A Large-scale Database for Less Cooperative Iris Recognition.",
                    "Gender-Invariant Face Representation Learning and Data Augmentation for Kinship Verification.",
                    "Face Liveness Detection Competition (LivDet-Face) - 2021.",
                    "STERLING: Towards Effective ECG Biometric Recognition.",
                    "Estimation of Gait Relative Attribute Distributions using a Differentiable Trade-off Model of Optimal and Uniform Transports.",
                    "On the use of automatically generated synthetic image datasets for benchmarking face recognition.",
                    "Optimizing contactless to contact-based fingerprint comparison using simple parametric warping models.",
                    "A Temporal Memory-based Continuous Authentication System.",
                    "Defending Touch-based Continuous Authentication Systems from Active Adversaries Using Generative Adversarial Networks.",
                    "Face Morphing of Newborns Can Be Threatening Too : Preliminary Study on Vulnerability and Detection.",
                    "PointFace: Point Set Based Feature Learning for 3D Face Recognition.",
                    "LFMB-3DFB: A Large-scale Finger Multi-Biometric Database and Benchmark for 3D Finger Biometrics.",
                    "Sequential Interactive Biased Network for Context-Aware Emotion Recognition.",
                    "SADet: Learning An Efficient and Accurate Pedestrian Detector.",
                    "Feasibility of Morphing-Attacks in Vascular Biometrics.",
                    "MixFaceNets: Extremely Efficient Face Recognition Networks.",
                    "Collaborative Feature Learning and Credible Soft Labeling for Unsupervised Domain Adaptive Person Re-Identification.",
                    "HID 2021: Competition on Human Identification at a Distance 2021.",
                    "Static and Dynamic Features Analysis from Human Skeletons for Gait Recognition.",
                    "3D Face Point Cloud Super-Resolution Network.",
                    "Universal Adversarial Spoofing Attacks against Face Recognition.",
                    "Refining Single Low-Quality Facial Depth Map by Lightweight and Efficient Deep Model.",
                    "A Unified Model for Fingerprint Authentication and Presentation Attack Detection.",
                    "Leveraging Adversarial Learning for the Detection of Morphing Attacks.",
                    "Joint Feature Distribution Alignment Learning for NIR-VIS and VIS-VIS Face Recognition.",
                    "FedFace: Collaborative Learning of Face Recognition Model.",
                    "DFGC 2021: A DeepFake Game Competition.",
                    "Contrastive Uncertainty Learning for Iris Recognition with Insufficient Labeled Samples.",
                    "Exploiting Non-uniform Inherent Cues to Improve Presentation Attack Detection.",
                    "TDS-Net: Towards Fast Dynamic Random Hand Gesture Authentication via Temporal Difference Symbiotic Neural Network.",
                    "BioCanCrypto: An LDPC Coded Bio-Cryptosystem on Fingerprint Cancellable Template.",
                    "Face Sketch Synthesis via Semantic-Driven Generative Adversarial Network.",
                    "Structure Destruction and Content Combination for Face Anti-Spoofing.",
                    "Practical Face Swapping Detection Based on Identity Spatial Constraints.",
                    "A Dense Pyramid Convolution Network for Infant Fingerprint Super-Resolution and Enhancement.",
                    "Attention Aware Wavelet-based Detection of Morphed Face Images.",
                    "LivDet 2021 Fingerprint Liveness Detection Competition - Into the unknown.",
                    "Identifying Rhythmic Patterns for Face Forgery Detection and Categorization.",
                    "Finger Vein Verification using Intrinsic and Extrinsic Features.",
                    "Avoiding Spectacles Reflections on Iris Images Using A Ray-tracing Method.",
                    "Deep Multi-loss Hashing Network for Palmprint Retrieval and Recognition.",
                    "MiDeCon: Unsupervised and Accurate Fingerprint and Minutia Quality Assessment based on Minutia Detection Confidence.",
                    "Video-Based Physiological Measurement Using 3D Central Difference Convolution Attention Network.",
                    "FDeblur-GAN: Fingerprint Deblurring using Generative Adversarial Network.",
                    "Visual-Semantic Transformer for Face Forgery Detection.",
                    "Bita-Net: Bi-temporal Attention Network for Facial Video Forgery Detection.",
                    "Deception Detection and Remote Physiological Monitoring: A Dataset and Baseline Experimental Results.",
                    "Contrastive Self-supervised Learning for Sensor-based Human Activity Recognition."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "IJCB 2020",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2020",
                "sub_name": "2020 IEEE International Joint Conference on Biometrics, IJCB 2020, Houston, TX, USA, September 28 - October 1, 2020.",
                "count": 85,
                "papers": [
                    "Assessing the Quality of Swipe Interactions for Mobile Biometric Systems.",
                    "SSBC 2020: Sclera Segmentation Benchmarking Competition in the Mobile Environment.",
                    "Backdooring Convolutional Neural Networks via Targeted Weight Perturbations.",
                    "Human Activity Analysis: Iterative Weak/Self-Supervised Learning Frameworks for Detecting Abnormal Events.",
                    "Cross-Spectral Iris Matching Using Conditional Coupled GAN.",
                    "Dense-View GEIs Set: View Space Covering for Gait Recognition based on Dense-View GAN.",
                    "Open Source Iris Recognition Hardware and Software with Presentation Attack Detection.",
                    "On the Influence of Ageing on Face Morph Attacks: Vulnerability and Detection.",
                    "On Benchmarking Iris Recognition within a Head-mounted Display for AR/VR Applications.",
                    "Fingerprint Synthesis: Search with 100 Million Prints.",
                    "AdvFaces: Adversarial Face Synthesis.",
                    "Face Quality Estimation and Its Correlation to Demographic and Non-Demographic Bias in Face Recognition.",
                    "3DPC-Net: 3D Point Cloud Network for Face Anti-spoofing.",
                    "Fingerprint Feature Extraction by Combining Texture, Minutiae, and Frequency Spectrum Using Multi-Task CNN.",
                    "FEBA - An Anatomy Based Finger Vein Classification.",
                    "Iris Liveness Detection Competition (LivDet-Iris) - The 2020 Edition.",
                    "Analysing the Performance of LSTMs and CNNs on 1310 nm Laser Data for Fingerprint Presentation Attack Detection.",
                    "Feature map masking based single-stage face detection.",
                    "Are Gabor Kernels Optimal for Iris Recognition?",
                    "How Do the Hearts of Deep Fakes Beat? Deep Fake Source Detection via Interpreting Residuals with Biological Signals.",
                    "Sensitivity of Age Estimation Systems to Demographic Factors and Image Quality: Achievements and Challenges.",
                    "TypeNet: Scaling up Keystroke Biometrics.",
                    "A Brief Literature Review and Survey of Adult Perceptions on Biometric Recognition for Infants and Toddlers.",
                    "Leveraging Auxiliary Tasks for Height and Weight Estimation by Multi Task Learning.",
                    "How Does Gender Balance In Training Data Affect Face Recognition Accuracy?",
                    "Gait Recognition Based on 3D Skeleton Data and Graph Convolutional Network.",
                    "Distinctive Feature Representation for Contactless 3D Hand Biometrics using Surface Normal Directions.",
                    "Is Face Recognition Safe from Realizable Attacks?",
                    "Development of deep clustering model to stratify occurrence risk of diabetic foot ulcers based on foot pressure patterns and clinical indices.",
                    "Finding the Suitable Doppelgänger for a Face Morphing Attack.",
                    "Cross-Spectral Periocular Recognition with Conditional Adversarial Networks.",
                    "White-Box Evaluation of Fingerprint Matchers: Robustness to Minutiae Perturbations.",
                    "Unconstrained Face Identification using Ensembles trained on Clustered Data.",
                    "Beyond Identity: What Information Is Stored in Biometric Face Templates?",
                    "3D Iris Recognition using Spin Images.",
                    "Identity Document to Selfie Face Matching Across Adolescence.",
                    "IHashNet: Iris Hashing Network based on efficient multi-index hashing.",
                    "Analysis of Dilation in Children and its Impact on Iris Recognition.",
                    "Fingerprint Presentation Attack Detection: A Sensor and Material Agnostic Approach.",
                    "Domain Private and Agnostic Feature for Modality Adaptive Face Recognition.",
                    "Leveraging edges and optical flow on faces for deepfake detection.",
                    "Recognition Oriented Iris Image Quality Assessment in the Feature Space.",
                    "Biometric Identification and Presentation-Attack Detection using Micro- and Macro-Movements of the Eyes.",
                    "PF -cpGAN: Profile to Frontal Coupled GAN for Face Recognition in the Wild.",
                    "A Metric Learning Approach to Eye Movement Biometrics.",
                    "All-in-Focus Iris Camera With a Great Capture Volume.",
                    "Resist: Reconstruction of irises from templates.",
                    "Cross-Domain Identification for Thermal-to-Visible Face Recognition.",
                    "Micro Stripes Analyses for Iris Presentation Attack Detection.",
                    "Anomaly Detection-Based Unknown Face Presentation Attack Detection.",
                    "FGAN: Fan-Shaped GAN for Racial Transformation.",
                    "Learning to Learn Face-PAD: a lifelong learning approach.",
                    "Is Warping-based Cancellable Biometrics (still) Sensible for Face Recognition?",
                    "How Confident Are You in Your Estimate of a Human Age? Uncertainty-aware Gait-based Age Estimation by Label Distribution Learning.",
                    "Mobile Twin Recognition.",
                    "DVRNet: Decoupled Visible Region Network for Pedestrian Detection.",
                    "Specular- and Diffuse-reflection-based Face Spoofing Detection for Mobile Devices.",
                    "Baracca: a Multimodal Dataset for Anthropometric Measurements in Automotive.",
                    "Fingerprint Spoof Detection: Temporal Analysis of Image Sequence.",
                    "Diversity Blocks for De-biasing Classification Models.",
                    "D-NetPAD: An Explainable and Interpretable Iris Presentation Attack Detector.",
                    "Face Recognition Oak Ridge (FaRO): A Framework for Distributed and Scalable Biometrics Applications.",
                    "A Progressive Stack Face-based Network for Detecting Diabetes Mellitus and Breast Cancer.",
                    "Swipe Dynamics as a Means of Authentication: Results From a Bayesian Unsupervised Approach.",
                    "Occlusion-Adaptive Deep Network for Robust Facial Expression Recognition.",
                    "Inverse Biometrics: Reconstructing Grayscale Finger Vein Images from Binary Features.",
                    "Touch Behavior Based Age Estimation Toward Enhancing Child Safety.",
                    "Cross Modal Person Re-identification with Visual-Textual Queries.",
                    "LDM-DAGSVM: Learning Distance Metric via DAG Support Vector Machine for Ear Recognition Problem.",
                    "iLGaCo: Incremental Learning of Gait Covariate Factors.",
                    "Modeling Score Distributions and Continuous Covariates: A Bayesian Approach.",
                    "Generating Master Faces for Use in Performing Wolf Attacks on Face Recognition Systems.",
                    "Characterizing Light-Adapted Pupil Size in the NIR Spectrum.",
                    "Pixel Sampling for Style Preserving Face Pose Editing.",
                    "DeformGait: Gait Recognition under Posture Changes using Deformation Patterns between Gait Feature Pairs.",
                    "Partial Fingerprint Verification via Spatial Transformer Networks.",
                    "An Assessment of GANs for Identity-related Applications.",
                    "Long-Term Face Tracking for Crowded Video-Surveillance Scenarios.",
                    "Facial landmark detection on thermal data via fully annotated visible-to-thermal data synthesis.",
                    "Using Deep Learning for Fusion of Eye and Mouse Movement based User Authentication.",
                    "All-in-one \"HairNet\": A Deep Neural Model for Joint Hair Segmentation and Characterization.",
                    "Gender and Ethnicity Classification based on Palmprint and Palmar Hand Images from Uncontrolled Environment.",
                    "Clustered Dynamic Graph CNN for Biometric 3D Hand Shape Recognition.",
                    "DBLFace: Domain-Based Labels for NIR-VIS Heterogeneous Face Recognition.",
                    "Your Tattletale Gait Privacy Invasiveness of IMU Gait Data."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ICB 2019",
        "info": "Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2019",
                "sub_name": "2019 International Conference on Biometrics, ICB 2019, Crete, Greece, June 4-7, 2019.",
                "count": 93,
                "papers": [
                    "SEFD: A Simple and Effective Single Stage Face Detector.",
                    "Regressing 3D Face Shapes from Arbitrary Image Sets with Disentanglement in Shape Space.",
                    "OU-ISIR Wearable Sensor-based Gait Challenge: Age and Gender.",
                    "PRNU-based finger vein sensor identification: On the effect of different sensor croppings.",
                    "Gait-Based Age Estimation with Deep Convolutional Neural Network.",
                    "Audio-Visual Kinship Verification in the Wild.",
                    "Adversarial Iris Super Resolution.",
                    "Fingerprint Quality: Mapping NFIQ1 Classes and NFIQ2 Values.",
                    "Gender Classification from Iris Texture Images Using a New Set of Binary Statistical Image Features.",
                    "Domain Adaptation in Multi-Channel Autoencoder based Features for Robust Face Anti-Spoofing.",
                    "Likelihood Ratio based Loss to finetune CNNs for Very Low Resolution Face Verification.",
                    "Improving Cross-database Face Presentation Attack Detection via Adversarial Domain Adaptation.",
                    "FaceQnet: Quality Assessment for Face Recognition based on Deep Learning.",
                    "Crafting A Panoptic Face Presentation Attack Detector.",
                    "Multi-Modal Fingerprint Presentation Attack Detection: Analysing the Surface and the Inside.",
                    "Iris + Ocular: Generalized Iris Presentation Attack Detection Using Multiple Convolutional Neural Networks.",
                    "Obtaining Stable Iris Codes Exploiting Low-Rank Tensor Space and Spatial Structure Aware Refinement for Better Iris Recognition.",
                    "Directed Adversarial Attacks on Fingerprints using Attributions.",
                    "Multibiometrics User Recognition using Adaptive Cohort Ranking.",
                    "ScleraSegNet: an Improved U-Net Model with Attention for Accurate Sclera Segmentation.",
                    "A New Approach for EEG-Based Biometric Authentication Using Auditory Stimulation.",
                    "OGCTL: Occlusion-guided compact template learning for ensemble deep network-based pose-invariant face recognition.",
                    "A Feasibility Study on Utilizing Toe Prints for Biometric Verification of Children.",
                    "RoPAD: Robust Presentation Attack Detection through Unsupervised Adversarial Invariance.",
                    "Periocular Recognition in the Wild with Orthogonal Combination of Local Binary Coded Pattern in Dual-stream Convolutional Neural Network.",
                    "Latent Fingerprint Enhancement Based on DenseUNet.",
                    "LivDet in Action - Fingerprint Liveness Detection Competition 2019.",
                    "Face Anti-spoofing using Hybrid Residual Learning Framework.",
                    "Face Recognition from Sequential Sparse 3D Data via Deep Registration.",
                    "SANet: Smoothed Attention Network for Single Stage Face Detector.",
                    "FLDet: A CPU Real-time Joint Face and Landmark Detector.",
                    "Generalized Presentation Attack Detection: a face anti-spoofing evaluation proposal.",
                    "Deep Contactless Fingerprint Unwarping.",
                    "Deceiving the Protector: Fooling Face Presentation Attack Detection Algorithms.",
                    "Face Sketch Colorization via Supervised GANs.",
                    "Fingerprint Presentation Attack Detection utilizing Time-Series, Color Fingerprint Captures.",
                    "Iris Recognition with Image Segmentation Employing Retrained Off-the-Shelf Deep Neural Networks.",
                    "Dense Fingerprint Registration via Displacement Regression Network.",
                    "Cross Spectral Periocular Matching using ResNet Features.",
                    "NIR-to-VIS Face Recognition via Embedding Relations and Coordinates of the Pairwise Features.",
                    "Some Research Problems in Biometrics: The Future Beckons.",
                    "Learning Lightweight Face Detector with Knowledge Distillation.",
                    "BioPass-UFPB: a Novel Multibiometric Database.",
                    "Hunting for Fashion via Large Scale Soft Biometrics Analysis.",
                    "To Detect or not to Detect: The Right Faces to Morph.",
                    "Gait Recognition from Markerless 3D Motion Capture.",
                    "Generalizing Fingerprint Spoof Detector: Learning a One-Class Classifier.",
                    "Universal Material Translator: Towards Spoof Fingerprint Generalization.",
                    "Combining Multiple one-class Classifiers for Anomaly based Face Spoofing Attack Detection.",
                    "Polarimetric Thermal to Visible Face Verification via Self-Attention Guided Synthesis.",
                    "PPG2Live: Using dual PPG for active authentication and liveness detection.",
                    "Suppressing Gender and Age in Face Templates Using Incremental Variable Elimination.",
                    "The Harms of Demographic Bias in Deep Face Recognition Research.",
                    "The Unconstrained Ear Recognition Challenge 2019.",
                    "In Defense of Color Names for Small-Scale Person Re-Identification.",
                    "The Nipple-Areola Complex for Criminal Identification.",
                    "SeLENet: A Semi-Supervised Low Light Face Enhancement Method for Mobile Face Unlock.",
                    "End-to-End Protocols and Performance Metrics For Unconstrained Face Recognition.",
                    "Cross-spectrum thermal to visible face recognition based on cascaded image synthesis.",
                    "Cooperative Orientation Generative Adversarial Network for Latent Fingerprint Enhancement.",
                    "Hyperspectral Band Selection for Face Recognition Based on a Structurally Sparsified Deep Convolutional Neural Networks.",
                    "Alignment Free and Distortion Robust Iris Recognition.",
                    "Deep Pixel-wise Binary Supervision for Face Presentation Attack Detection.",
                    "Gesture-based User Identity Verification as an Open Set Problem for Smartphones.",
                    "Fingerprint Presentation Attack Detection: Generalization and Efficiency.",
                    "Vulnerability assessment and detection of Deepfake videos.",
                    "Learning-Free Iris Segmentation Revisited: A First Step Toward Fast Volumetric Operation Over Video Samples.",
                    "Iris Feature Extraction and Matching Method for Mobile Biometric Applications.",
                    "Permanence of ECG Biometric: Experiments Using Convolutional Neural Networks.",
                    "On the Extent of Longitudinal Finger Rotation in Publicly Available Finger Vein Data Sets.",
                    "Video Face Recognition: Component-wise Feature Aggregation Network (C-FAN).",
                    "Learning Global Fingerprint Features by Training a Fully Convolutional Network with Local Patches.",
                    "Does Generative Face Completion Help Face Recognition?",
                    "Adversarial Examples to Fool Iris Recognition Systems.",
                    "A novel scheme to address the fusion uncertainty in multi-modal continuous authentication schemes on mobile devices.",
                    "Merged Multi-CNN with Parameter Reduction for Face Attribute Estimation.",
                    "Adversarial Perturbations Against Fingerprint Based Authentication Systems.",
                    "Making the most of what you have! Profiling biometric authentication on mobile devices.",
                    "Mobile Face Recognition Systems: Exploring Presentation Attack Vulnerability and Usability.",
                    "Seg-Edge Bilateral Constraint Network for Iris Segmentation.",
                    "Mobile Biometrics, Replay Attacks, and Behavior Profiling: An Empirical Analysis of Impostor Detection.",
                    "Conditional Perceptual Adversarial Variational Autoencoder for Age Progression and Regression on Child Face.",
                    "Multi-sample Compression of Finger Vein Images using H.265 Video Coding.",
                    "Sclera Segmentation Benchmarking Competition in Cross-resolution Environment.",
                    "Improving Face Anti-Spoofing by 3D Virtual Synthesis.",
                    "Attribute-Guided Deep Polarimetric Thermal-to-visible Face Recognition.",
                    "Authenticating Phone Users Using a Gait-Based Histogram Approach on Mobile App Sessions.",
                    "Understanding Confounding Factors in Face Detection and Recognition.",
                    "On the Impact of Different Fabrication Materials on Fingerprint Presentation Attack Detection.",
                    "On the Effectiveness of Laser Speckle Contrast Imaging and Deep Neural Networks for Detecting Known and Unknown Fingerprint Presentation Attacks.",
                    "Deep Learning from 3DLBP Descriptors for Depth Image Based Face Recognition.",
                    "Actions Speak Louder Than (Pass)words: Passive Authentication of Smartphone* Users via Deep Temporal Features.",
                    "Thermal and Cross-spectral Palm Image Matching in the Visual Domain by Robust Image Transformation."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ICB 2018",
        "info": "Gold Coast, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2018",
                "sub_name": "2018 International Conference on Biometrics, ICB 2018, Gold Coast, Australia, February 20-23, 2018.",
                "count": 42,
                "papers": [
                    "Fingerprint Distortion Rectification Using Deep Convolutional Neural Networks.",
                    "Robust Minutiae Extractor: Integrating Deep Networks and Fingerprint Domain Knowledge.",
                    "Comparative Study of Digital Fingerprint Quality Assessment Metrics.",
                    "Filter Design Based on Spectral Dictionary for Latent Fingerprint Pre-enhancement.",
                    "Fingerprint Synthesis: Evaluating Fingerprint Search at Scale.",
                    "Evolutionary Methods for Generating Synthetic MasterPrint Templates: Dictionary Attack in Fingerprint Recognition.",
                    "Hierarchical Multi-class Iris Classification for Liveness Detection.",
                    "Securing Minutia Cylinder Codes for Fingerprints through Physically Unclonable Functions: An Exploratory Study.",
                    "Protecting Your Faces: MeshFaces Generation and Removal via High-Order Relation-Preserving CycleGAN.",
                    "De-Mark GAN: Removing Dense Watermark with Generative Adversarial Network.",
                    "On Effectiveness of Anomaly Detection Approaches against Unseen Presentation Attacks in Face Anti-spoofing.",
                    "Semi-adversarial Networks: Convolutional Autoencoders for Imparting Privacy to Face Images.",
                    "Two-Stream Part-Based Deep Representation for Human Attribute Recognition.",
                    "Fine-Grained Multi-Attribute Adversarial Learning for Face Generation of Age, Gender and Ethnicity.",
                    "Predicting Eye Color from Near Infrared Iris Images.",
                    "A Meta-Recognition Based Skin Marks Matching Algorithm with Feature Fusion for Forensic Identification.",
                    "Metadata-Based Feature Aggregation Network for Face Recognition.",
                    "Conformal Mapping of a 3D Face Representation onto a 2D Image for CNN Based Face Recognition.",
                    "Boosting Face in Video Recognition via CNN Based Key Frame Extraction.",
                    "Improving 2D Face Recognition via Discriminative Face Depth Estimation.",
                    "Fully Associative Patch-Based 1-to-N Matcher for Face Recognition.",
                    "IARPA Janus Benchmark - C: Face Dataset and Protocol.",
                    "Deep Cross Polarimetric Thermal-to-Visible Face Recognition.",
                    "TV-GAN: Generative Adversarial Network Based Thermal to Visible Face Recognition.",
                    "The Dark Side of the Face: Exploring the Ultraviolet Spectrum for Face Biometrics.",
                    "Multi-spectral Iris Segmentation in Visible Wavelengths.",
                    "Multi-spectral Imaging for Robust Ocular Biometrics.",
                    "Detection of Glasses in Near-Infrared Ocular Images.",
                    "Verifying the Newborns without Infection Risks Using Contactless Palmprints.",
                    "The Impact of Age and Threshold Variation on Facial Recognition Algorithm Performance Using Images of Children.",
                    "Longitudinal Study of Child Face Recognition.",
                    "Context-Aware Fusion for Continuous Biometric Authentication.",
                    "Person Recognition beyond the Visible Spectrum: Combining Body Shape and Texture from mmW Images.",
                    "Improving Face Recognition by Exploring Local Features with Visual Attention.",
                    "Multifactor User Authentication with In-Air-Handwriting and Hand Geometry.",
                    "Style Signatures to Combat Biometric Menagerie in Stylometry.",
                    "Exploiting Linguistic Style as a Cognitive Biometric for Continuous Verification.",
                    "Evaluation of PPG Biometrics for Authentication in Different States.",
                    "Shedding Light on the Veins - Reflected Light or Transillumination in Hand-Vein Recognition.",
                    "Multi-sample Compression of Iris Images Using High Efficiency Video Coding.",
                    "LivDet 2017 Fingerprint Liveness Detection Competition 2017.",
                    "SSBC 2018: Sclera Segmentation Benchmarking Competition."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "IJCB (ICB+BTAS) 2017",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2017",
                "sub_name": "2017 IEEE International Joint Conference on Biometrics, IJCB 2017, Denver, CO, USA, October 1-4, 2017.",
                "count": 101,
                "papers": [
                    "FaceBoxes: A CPU real-time face detector with high accuracy.",
                    "KAZE features via fisher vector encoding for offline signature verification.",
                    "Risk assessment in the face-based watchlist screening in e-borders.",
                    "Fingerprint minutiae extraction using deep learning.",
                    "Optimizing resources on smartphone gait recognition.",
                    "SREFI: Synthesis of realistic example face images.",
                    "Multi-iris indexing and retrieval: Fusion strategies for bloom filter-based search structures.",
                    "Feature map pooling for cross-view gait recognition based on silhouette sequence images.",
                    "Spoofing analysis of mobile device data as behavioral biometric modalities.",
                    "Using associative classification to authenticate mobile device users.",
                    "An anomaly detection approach to face spoofing detection: A new formulation and evaluation protocol.",
                    "AFFACT: Alignment-free facial attribute classification technique.",
                    "Generative adversarial network-based synthesis of visible faces from polarimetrie thermal faces.",
                    "FingerNet: An unified deep network for fingerprint minutiae extraction.",
                    "Latent fingerprint minutia extraction using fully convolutional network.",
                    "2.5D cascaded regression for robust facial landmark detection.",
                    "Deep 3D face identification.",
                    "On the vulnerability of ECG verification to online presentation attacks.",
                    "On the feasibility of creating morphed iris-codes.",
                    "Local classifier chains for deep face recognition.",
                    "LOTS about attacking deep features.",
                    "Continuous user authentication via unlabeled phone movement patterns.",
                    "Deep expectation for estimation of fingerprint orientation fields.",
                    "Boosting cross-age face verification via generative age normalization.",
                    "Fingerprint indexing based on pyramid deep convolutional feature.",
                    "You are how you walk: Uncooperative MoCap gait identification for video surveillance with incomplete and noisy data.",
                    "Handwriting watcher: A mechanism for smartwatch-driven handwriting authentication.",
                    "Full 3D touchless fingerprint recognition: Sensor, database and baseline performance.",
                    "Location-sensitive sparse representation of deep normal patterns for expression-robust 3D face recognition.",
                    "Learning face similarity for re-identification from real surveillance video: A deep metric solution.",
                    "Biometric Jammer: Preventing surreptitious fingerprint photography without inconveniencing users.",
                    "Deep person re-identification with improved embedding and efficient training.",
                    "Fingerprint pose estimation based on faster R-CNN.",
                    "Multi-Siamese networks to accurately match contactless to contact-based fingerprint images.",
                    "Tracking user information using motion data through smartphones.",
                    "Identifying the origin of Iris images based on fusion of local image descriptors and PRNU based techniques.",
                    "Accuracy evaluation of handwritten signature verification: Rethinking the random-skilled forgeries dichotomy.",
                    "Score normalization in stratified biometric systems.",
                    "Face anti-spoofing using patch and depth-based CNNs.",
                    "Formulae for consistent biometric score level fusion.",
                    "End-to-End convolutional neural network-based voice presentation attack detection.",
                    "Multi-dim: A multi-dimensional face database towards the application of 3D technology in real-world scenarios.",
                    "Fingerprint presentation attacks detection based on the user-specific effect.",
                    "Towards pre-alignment of near-infrared iris images.",
                    "On the guessability of binary biometric templates: A practical guessing entropy based approach.",
                    "Finger vein image retrieval via affinity-preserving K-means hashing.",
                    "Deep learning with time-frequency representation for pulse estimation from facial videos.",
                    "Cross-pose landmark localization using multi-dropout framework.",
                    "Deep Dense Multi-level feature for partial high-resolution fingerprint matching.",
                    "Liveness detection on touchless fingerprint devices using texture descriptors and artificial neural networks.",
                    "Single 2D pressure footprint based person identification.",
                    "General borda count for multi-biometric retrieval.",
                    "Generative convolutional networks for latent fingerprint reconstruction.",
                    "Fingerprint indexing and matching: An integrated approach.",
                    "Evaluation of a 3D-aided pose invariant 2D face recognition system.",
                    "Subspace selection to suppress confounding source domain information in AAM transfer learning.",
                    "UMDFaces: An annotated face dataset for training deep networks.",
                    "Demography-based facial retouching detection using subclass supervised sparse autoencoder.",
                    "Multi-view 3D face reconstruction with deep recurrent neural networks.",
                    "Facial 3D model registration under occlusions with sensiblepoints-based reinforced hypothesis refinement.",
                    "A method for 3D iris reconstruction from multiple 2D near-infrared images.",
                    "Iris and periocular recognition in arabian race horses using deep convolutional neural networks.",
                    "Repeatability and reproducibility of forensic likelihood ratio methods when sample size ratio varies.",
                    "Shared dataset on natural human-computer interaction to support continuous authentication research.",
                    "A data driven in-air-handwriting biometric authentication system.",
                    "Fast multi-view face alignment via multi-task auto-encoders.",
                    "Deep features-based expression-invariant tied factor analysis for emotion recognition.",
                    "Face morphing versus face averaging: Vulnerability and detection.",
                    "Soft biometric privacy: Retaining biometric utility of face images while perturbing gender.",
                    "Unconstrained visible spectrum iris with textured contact lens variations: Database and benchmarking.",
                    "Fingerprint spoof detection using minutiae-based local patches.",
                    "DNA2FACE: An approach to correlating 3D facial structure and DNA.",
                    "In defense of low-level structural features and SVMs for facial attribute classification: Application to detection of eye state, Mouth State, and eyeglasses in the wild.",
                    "Extracting sub-glottal and Supra-glottal features from MFCC using convolutional neural networks for speaker identification in degraded audio signals.",
                    "Computing an image Phylogeny Tree from photometrically modified iris images.",
                    "Multimodal biometric recognition for toddlers and pre-school children.",
                    "Towards open-set face recognition using hashing functions.",
                    "Continuous heart rate measurement from face: A robust rPPG approach with distribution learning.",
                    "Robust face presentation attack detection on smartphones : An approach based on variable focus.",
                    "SWAPPED! Digital face presentation attack detection via weighted local magnitude pattern.",
                    "Gender and ethnicity classification of Iris images using deep class-encoder.",
                    "Synthetic iris presentation attack using iDCGAN.",
                    "Periocular recognition in cross-spectral scenario.",
                    "A competition on generalized software-based face presentation attack detection in mobile scenarios.",
                    "Unconstrained Face Detection and Open-Set Face Recognition Challenge.",
                    "ICFVR 2017: 3rd international competition on finger vein recognition.",
                    "The unconstrained ear recognition challenge.",
                    "Cross-eyed 2017: Cross-spectral iris/periocular recognition competition.",
                    "LivDet iris 2017 - Iris liveness detection competition 2017.",
                    "SSERBC 2017: Sclera segmentation and eye recognition benchmarking competition.",
                    "Deep convolutional dynamic texture learning with adaptive channel-discriminability for 3D mask face anti-spoofing.",
                    "Convolutional neural network for age classification from smart-phone based ocular images.",
                    "On fine-tuning convolutional neural networks for smartphone based ocular recognition.",
                    "Conditional random fields incorporate convolutional neural networks for human eye sclera semantic segmentation.",
                    "Learning optimised representations for view-invariant gait recognition.",
                    "Linking face images captured from the optical phenomenon in the wild for forensic science.",
                    "Learning-based local-patch resolution reconstruction of iris smart-phone images.",
                    "A decision-level fusion strategy for multimodal ocular biometric in visible spectrum based on posterior probability.",
                    "Age and gender classification using local appearance descriptors from facial components.",
                    "Gender classification from multispectral periocular images.",
                    "On matching skulls to digital face images: A preliminary approach."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ICB 2016",
        "info": "Halmstad, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2016",
                "sub_name": "International Conference on Biometrics, ICB 2016, Halmstad, Sweden, June 13-16, 2016.",
                "count": 51,
                "papers": [
                    "Message from the general chairs.",
                    "Message from the Program Chairs.",
                    "Performance analysis of a Hybrid fingerprint extracted from optical coherence tomography fingertip scans.",
                    "Compression standards in finger vein recognition.",
                    "Textured detailed graph model for dorsal hand vein recognition: A holistic approach.",
                    "Exploiting privileged information for facial expression recognition.",
                    "Enhanced segmentation and complex-sclera features for human recognition with unconstrained visible-wavelength imaging.",
                    "Tattoo detection based on CNN and remarks on the NIST database.",
                    "FVRC2016: The 2nd Finger Vein Recognition Competition.",
                    "Reliable face anti-spoofing using multispectral SWIR imaging.",
                    "Calculating a boundary for the significance from the equal-error rate.",
                    "Learning compact binary quantization of Minutia Cylinder Code.",
                    "Accurate iris segmentation in non-cooperative environments using fully convolutional networks.",
                    "Binary search path of vocabulary tree based finger vein image retrieval.",
                    "Fine-grained LFW database.",
                    "Multi-task ConvNet for blind face inpainting with application to face verification.",
                    "A practical technique for gait recognition on curved and straight trajectories.",
                    "GEINet: View-invariant gait recognition using a convolutional neural network.",
                    "3D feature array involved registration algorithm for multi-pose hand vein authentication.",
                    "Lock3DFace: A large-scale database of low-cost Kinect 3D faces.",
                    "TripleA: Accelerated accuracy-preserving alignment for iris-codes.",
                    "Transferring deep representation for NIR-VIS heterogeneous face recognition.",
                    "Single pulse ECG-based small scale user authentication using guided filtering.",
                    "ICB-RW 2016: International challenge on biometric recognition in the wild.",
                    "Influence of cataract surgery on iris recognition: A preliminary study.",
                    "SSRBC 2016: Sclera Segmentation and Recognition Benchmarking Competition.",
                    "Biometric recognition of surgically altered periocular region: A comprehensive study.",
                    "Multi-scale dictionaries based fingerprint orientation field estimation.",
                    "Post-mortem human iris recognition.",
                    "Real world expression recognition: A highly imbalanced detection problem.",
                    "User individuality based cost-sensitive learning: A case study in finger vein recognition.",
                    "Latent fingerprint segmentation based on linear density.",
                    "Scale space texture analysis for face anti-spoofing.",
                    "Exploring complementary features for iris recognition on mobile devices.",
                    "Experimental results on multi-modal fusion of EEG-based personal verification algorithms.",
                    "User-specific effects in Fingerprint Presentation Attacks Detection: Insights for future research.",
                    "Gender and ethnicity classification using deep learning in heterogeneous face recognition.",
                    "Extending non-negative matrix factorisation to 3D registered data.",
                    "Automatic latent value determination.",
                    "Discriminative Feature Adaptation for cross-domain facial expression recognition.",
                    "Meandering energy potential to locate singular point of fingerprint.",
                    "Towards resolution invariant face recognition in uncontrolled scenarios.",
                    "Bootstrapping Joint Bayesian model for robust face verification.",
                    "A study on the individuality of finger vein based on statistical analysis.",
                    "Gait collector: An automatic gait data collection system in conjunction with an experience-based long-run exhibition.",
                    "Face recognition using scattering wavelet under Illicit Drug Abuse variations.",
                    "Face attribute prediction using off-the-shelf CNN features.",
                    "Methodology for partial fingerprint enrollment and authentication on mobile devices.",
                    "Two-step calibration method for multi-algorithm score-based face recognition systems by minimizing discrimination loss.",
                    "Bayesian Belief models for integrating match scores with liveness and quality measures in a fingerprint verification system.",
                    "IrisSeg: A fast and robust iris segmentation framework for non-ideal iris images."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ICB 2015",
        "info": "Phuket, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2015",
                "sub_name": "International Conference on Biometrics, ICB 2015, Phuket, Thailand, 19-22 May, 2015.",
                "count": 77,
                "papers": [
                    "Recompression effects in iris segmentation.",
                    "A biomechanical approach to iris normalization.",
                    "Cross-sensor iris verification applying robust fused segmentation algorithms.",
                    "Predicting segmentation errors in an iris recognition system.",
                    "On fusion for multispectral iris recognition.",
                    "Authentication based on a changeable biometric using gesture recognition with the Kinect™.",
                    "I know that voice: Identifying the voice actor behind the voice.",
                    "Discriminative regularized metric learning for person re-identification.",
                    "One-handed Keystroke Biometric Identification Competition.",
                    "Appearance-based person re-identification by intra-camera discriminative models and rank aggregation.",
                    "Viewpoint invariant subject retrieval via soft clothing biometrics.",
                    "Fine-grained face verification: Dataset and baseline results.",
                    "The ICB-2015 Competition on Finger Vein Recognition.",
                    "VT-KFER: A Kinect-based RGBD+time dataset for spontaneous and non-spontaneous facial expression recognition.",
                    "Live face video vs. spoof face video: Use of moiré patterns to detect replay video attacks.",
                    "Annotated crowd video face database.",
                    "Sensor ageing impact on finger-vein recognition.",
                    "Harnessing social context for improved face recognition.",
                    "Hierarchical multi-label framework for robust face recognition.",
                    "Continuous authentication of mobile user: Fusion of face image and inertial Measurement Unit data.",
                    "Multi-modal authentication system for smartphones using face, iris and periocular.",
                    "A touch-less fingerphoto recognition system for mobile hand-held devices.",
                    "Touch-interaction behavior for continuous user authentication on smartphones.",
                    "Optimal feature selection and inter-operability compensation for on-line biometric signature authentication.",
                    "Gait regeneration for recognition.",
                    "Color local phase quantization (CLPQ)- A new face representation approach using color texture cues.",
                    "Illumination-normalized face recognition using Chromaticity Intrinsic Image.",
                    "Example-based 3D face reconstruction from uncalibrated frontal and profile images.",
                    "3D face analysis for demographic biometrics.",
                    "Sparse support faces.",
                    "A longitudinal study of automatic face recognition.",
                    "A verify-correct approach to person re-identification based on Partial Least Squares signatures.",
                    "Unconstrained face detection: State of the art baseline and challenges.",
                    "Recognition at a long distance: Very low resolution face recognition and hallucination.",
                    "An efficient approach for clustering face images.",
                    "Composite sketch recognition via deep network - a transfer learning approach.",
                    "Quaternion-based Local Binary Patterns for illumination invariant face recognition.",
                    "Annotating Unconstrained Face Imagery: A scalable approach.",
                    "Discriminative transfer learning for single-sample face recognition.",
                    "Attribute preserved face de-identification.",
                    "Large Margin Coupled Feature Learning for cross-modal face recognition.",
                    "A transfer learning approach to cross-database facial expression recognition.",
                    "Secure face template generation via local region hashing.",
                    "Correlation based fingerprint liveness detection.",
                    "The relation between the secrecy rate of biometric template protection and biometric recognition performance.",
                    "On the vulnerability of palm vein recognition to spoofing attacks.",
                    "Improving feature based dorsal hand vein recognition through Random Keypoint Generation and fine-grained matching.",
                    "Palm region extraction for contactless palmprint recognition.",
                    "Exploring dorsal finger vein pattern for robust person recognition.",
                    "Latent orientation field estimation via convolutional neural network.",
                    "Latent fingerprint match using Minutia Spherical Coordinate Code.",
                    "Crowd powered latent Fingerprint Identification: Fusing AFIS with examiner markups.",
                    "Latent fingerprints segmentation based on Rearranged Fourier Subbands.",
                    "On the spatial inhomogeneity of fingerprint minutiae: A regression approach.",
                    "k-Nearest Neighborhood Structure (k-NNS) based alignment-free method for fingerprint template protection.",
                    "Touchless multiview fingerprint quality assessment: rotational bad-positioning detection using Artificial Neural Networks.",
                    "Fingerprint classification using a simplified rule-set based on directional patterns and singularity features.",
                    "Vectorized fingerprint representation using Minutiae Relation Code.",
                    "Band selection for Gabor feature based hyperspectral palmprint recognition.",
                    "Towards Bloom filter-based indexing of iris biometric data.",
                    "Grid structured morphological pattern spectrum for off-line signature verification.",
                    "Algorithms for a novel touchless bimodal palm biometric system.",
                    "Superpixel based finger vein ROI extraction with sensor interoperability.",
                    "Contactless biometric hand geometry recognition using a low-cost 3D camera.",
                    "Swipe gesture based Continuous Authentication for mobile devices.",
                    "3D face recognition with asymptotic cones based principal curvatures.",
                    "Face retriever: Pre-filtering the gallery via deep neural net.",
                    "Subspace learning with frequency regularizer: Its application to face recognition.",
                    "Combining view-based pose normalization and feature transform for cross-pose face recognition.",
                    "Audio-visual twins database.",
                    "Enhanced on-line signature verification based on skilled forgery detection using Sigma-LogNormal Features.",
                    "Fast and robust self-training beard/moustache detection and segmentation.",
                    "The 1st Competition on Counter Measures to Finger Vein Spoofing Attacks.",
                    "Single sensor-based multi-quality multi-modal biometric score database and its performance evaluation.",
                    "Security analysis of Bloom filter-based iris biometric template protection.",
                    "Multi-label CNN based pedestrian attribute learning for soft biometrics.",
                    "Guidelines for best practices in biometrics research."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "IJCB (ICB+BTAS) 2014",
        "info": "Clearwater, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2014",
                "sub_name": "IEEE International Joint Conference on Biometrics, Clearwater, IJCB 2014, FL, USA, September 29 - October 2, 2014.",
                "count": 80,
                "papers": [
                    "Towards anomaly detection for increased security in multibiometric systems: Spoofing-resistant 1-median fusion eliminating outliers.",
                    "An optimal strategy for dilation based iris image enrollment.",
                    "Continuous authentication with cognition-centric text production and revision features.",
                    "The first ICB* competition on iris recognition.",
                    "Segmenting the periocular region using a hierarchical graphical model fed by texture / shape information and geometrical constraints.",
                    "The value of posture, build and dynamics in gesture-based user authentication.",
                    "Semi-coupled basis and distance metric learning for cross-domain matching: Application to low-resolution face recognition.",
                    "2D ear classification based on unsupervised clustering.",
                    "Cross-view gait recognition using view-dependent discriminative analysis.",
                    "Presentation attack detection on visible spectrum iris recognition by exploring inherent characteristics of Light Field Camera.",
                    "Establishing a test set and initial comparisons for quantitatively evaluating synthetic age progression for adult aging.",
                    "A low-cost multimodal biometric sensor to capture finger vein and fingerprint.",
                    "A framework for improving the performance of verification algorithms with a low false positive rate requirement and limited training data.",
                    "Similarity score computation for minutiae-based fingerprint recognition.",
                    "Randomized Intraclass-Distance Minimizing Binary Codes for face recognition.",
                    "A novel eyebrow segmentation and eyebrow shape-based identification.",
                    "The magic passport.",
                    "Sensor orientation invariant mobile gait biometrics.",
                    "Effects of severe image compression on iris segmentation performance.",
                    "Finger vein verification based on a personalized best patches map.",
                    "Audio-visual gender recognition in uncontrolled environment using variability modeling techniques.",
                    "Privacy-preserving population-enhanced biometric key generation from free-text keystroke dynamics.",
                    "A new locally linear KNN method with an improved marginal Fisher analysis for image classification.",
                    "Aiding face recognition with social context association rule based re-ranking.",
                    "MobILive 2014 - Mobile Iris Liveness Detection Competition.",
                    "Learning to predict match scores for iris image quality assessment.",
                    "Automatic adaptation of fingerprint liveness detector to new spoof materials.",
                    "Assessment of psychophysiological characteristics using heart rate from naturalistic face video data.",
                    "Iris pattern obfuscation in digital images.",
                    "Use of language as a cognitive biometric trait.",
                    "MDLFace: Memorability augmented deep learning for video face recognition.",
                    "Impact of sensor ageing on iris recognition.",
                    "Unconstrained face recognition: Establishing baseline human performance via crowdsourcing.",
                    "Towards efficient privacy-preserving two-stage identification for fingerprint-based biometric cryptosystems.",
                    "Fingerprint liveness detection based on histograms of invariant gradients.",
                    "LPIDB v1.0 - Latent palmprint identification database.",
                    "GETSEL: Gallery entropy for template selection on large datasets.",
                    "Aggregate channel features for multi-view face detection.",
                    "Still-to-Video face recognition via weighted scenario oriented discriminant analysis.",
                    "Suspect identification based on descriptive facial attributes.",
                    "Generalizing face quality and factor measures to video.",
                    "Non-negative sparse coding based scalable access control using fingertip ECG.",
                    "Robust face recognition by an albedo based 3D morphable model.",
                    "An optimal set of code words and correntropy for rotated least squares regression.",
                    "Iris recognition using block local binary patterns and relational measures.",
                    "On latent fingerprint minutiae extraction using stacked denoising sparse AutoEncoders.",
                    "A coarse-to-fine approach to robust 3D facial landmarking via curvature analysis and Active Normal Model.",
                    "The IJCB 2014 PaSC video face and person recognition competition.",
                    "Generalized textured contact lens detection by extracting BSIF description from Cartesian iris images.",
                    "Kinship verification in the wild: The first kinship verification competition.",
                    "A Bayesian model for predicting face recognition performance using image quality.",
                    "Theoretical vulnerability in likelihood-ratio-based biometric verification.",
                    "Ten-print fingerprint self-captures: Graphics-only user guidance without language.",
                    "Multi-finger knuckle recognition from video sequence: Extracting accurate multiple finger knuckle regions.",
                    "Fingerprint matching based on global minutia cylinder code.",
                    "Score-level fusion by generalized Delaunay triangulation.",
                    "A benchmark study of large-scale unconstrained face recognition.",
                    "Efficient auto-refocusing of iris images for light-field cameras.",
                    "Enhancing latent fingerprints on banknotes.",
                    "LivDet-iris 2013 - Iris Liveness Detection Competition 2013.",
                    "Soft biometrics for subject identification using clothing attributes.",
                    "Gaze estimation as a framework for iris liveness detection.",
                    "The Second Eye Movements Verification and Identification Competition.",
                    "Efficient face retrieval using synecdoches.",
                    "Recognizing composite sketches with digital face images via SSD dictionary.",
                    "A robust algorithm for colour iris segmentation based on 1-norm regression.",
                    "GARP-face: Balancing privacy protection and utility preservation in face de-identification.",
                    "Dictionary based framework for face recognition, designed mutually for single training sample (STS) and degraded set (DS).",
                    "Age invariant face recognition based on texture embedded discriminative graph model.",
                    "The relationship between handwritten signature production and personality traits.",
                    "Classification and authentication of one-dimensional behavioral biometrics.",
                    "Quality of fingerprint scans captured using Optical Coherence Tomography.",
                    "Shuffling is not sufficient: Security analysis of cancelable iriscodes based on a secret permutation.",
                    "Performance evaluation of fingerprint open-set identification algorithms.",
                    "Multi-modal biometrics for mobile authentication.",
                    "Finger vein recognition with superpixel-based features.",
                    "Shared research dataset to support development of keystroke authentication.",
                    "Recognizing infants and toddlers using fingerprints: Increasing the vaccination coverage.",
                    "Discriminating projections for estimating face age in wild images.",
                    "A study on the influence of body weight changes on face recognition."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ICB 2013",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2013",
                "sub_name": "International Conference on Biometrics, ICB 2013, 4-7 June, 2013, Madrid, Spain.",
                "count": 76,
                "papers": [
                    "A compact discriminative representation for efficient image-set classification with application to biometric recognition.",
                    "Human identification using facial comparative descriptions.",
                    "Volume structured ordinal features with background similarity measure for video face recognition.",
                    "Can we do better in unimodal biometric systems? A novel rank-based score normalization framework for multi-sample galleries.",
                    "Robust localization of ears by feature level fusion and context information.",
                    "Synthetic off-line signature image generation.",
                    "Formant trajectories in linguistic units for text-independent speaker recognition.",
                    "Biometric authentication via keystroke sound.",
                    "Face liveness detection with component dependent descriptor.",
                    "Face liveness detection using 3D structure recovered from a single camera.",
                    "Extended clique models: A new matching strategy for fingerprint recognition.",
                    "Multi-scale block local ternary patterns for fingerprints vitality detection.",
                    "Human face shape analysis under spherical harmonics illumination considering self occlusion.",
                    "Complementary countermeasures for detecting scenic face spoofing attacks.",
                    "Real-time high performance deformable model for face detection in the wild.",
                    "Towards fingerprints as strings: Secure indexing for fingerprint matching.",
                    "Haar-like rectangular features for biometric recognition.",
                    "Complex eye movement pattern biometrics: Analyzing fixations and saccades.",
                    "Automated classification of contact lens type in iris images.",
                    "Silhouette-based online signature verification using pen tip trajectory and pen holding style.",
                    "Cancelable iris-templates using key-dependent wavelet transforms.",
                    "Hill-climbing attack: Parametric optimization and possible countermeasures. An application to on-line signature recognition.",
                    "A robust speed-invariant gait recognition system for walker and runner identification.",
                    "A high quality finger vascular pattern dataset collected using a custom designed capturing device.",
                    "The 2013 face recognition evaluation in mobile environment.",
                    "The 2013 speaker recognition evaluation in mobile environment.",
                    "The 2nd competition on counter measures to 2D face spoofing attacks.",
                    "LivDet 2013 Fingerprint Liveness Detection Competition 2013.",
                    "Alignment-free cancelable iris biometric templates based on adaptive bloom filters.",
                    "Liveness detection via oculomotor plant characteristics: Attack of mechanical replicas.",
                    "A feature-level solution to off-angle iris recognition.",
                    "Quality factors affecting iris segmentation and matching.",
                    "Multi-view multi-modal person authentication from a single walking image sequence.",
                    "Gender classification using automatically detected and aligned 3D ear range data.",
                    "Tattoo based identification: Sketch to image matching.",
                    "Age estimation from face images: Human vs. machine performance.",
                    "Local salient patterns - A novel local descriptor for face recognition.",
                    "A hierarchical registration algorithm for fingerprints from multi-type capture sensors.",
                    "A coarse-fine fingerprint scaling method.",
                    "Sift-based image alignment for contactless palmprint verification.",
                    "Sketch based face recognition: Forensic vs. composite sketches.",
                    "Automatic facial makeup detection with application in face recognition.",
                    "Bits extraction for palmprint template protection with Gabor magnitude and multi-bit quantization.",
                    "A facial symmetry prior for improved illumination fitting of 3D morphable model.",
                    "Practical identification with encrypted biometric data using oblivious RAM.",
                    "Limbus impact on off-angle iris degradation.",
                    "Revisiting iris recognition with color cosmetic contact lenses.",
                    "The impact of diffuse illumination on iris recognition.",
                    "Biometric verification based on hand thermal images.",
                    "Deformed iris recognition using bandpass geometric features and lowpass ordinal features.",
                    "Offline text-independent writer identification using stroke fragment and contour based features.",
                    "Predict and improve iris recognition performance based on pairwise image quality assessment.",
                    "Fingerprint quality assessment using frequency and orientation subbands of block-based fourier transform.",
                    "A feedback paradigm for latent fingerprint matching.",
                    "Poisoning attacks to compromise face templates.",
                    "BioSAKE: Biometrics-based secure authentication and key exchange.",
                    "CS-3DLBP and geometry based person independent 3D facial action unit detection.",
                    "A new perspective - Face recognition with light-field camera.",
                    "Can face anti-spoofing countermeasures work in a real world scenario?",
                    "Generating face images under multiple illuminations based on a single front-lighted sample without 3D models.",
                    "Face liveness detection using variable focusing.",
                    "Evaluation of minutia cylinder-code on fingerprint cross-matching and its improvement with scale.",
                    "Improving faces/non-faces discrimination in video sequences by using a local spatio-temporal representation.",
                    "Performance improvement of face recognition algorithms using occluded-region detection.",
                    "Construction of dictionaries to reconstruct high-resolution images for face recognition.",
                    "Disguise detection and face recognition in visible and thermal spectrums.",
                    "A generative model for fingerprint minutiae.",
                    "Is there a fingerprint pattern in the image?",
                    "Biometric system design under zero and non-zero effort attacks.",
                    "Vein minutia cylinder-codes (V-MCC).",
                    "Secure hamming distance based biometric authentication.",
                    "The prediction of old and young subjects from iris texture.",
                    "Assessment of the quality of handwritten signatures based on multiple correlations.",
                    "A novel approach of gait recognition through fusion with footstep information.",
                    "Perceptions of interfaces for eye movement biometrics.",
                    "Variations of handwritten signatures with time: A sigma-lognormal analysis."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ICB 2012",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2012",
                "sub_name": "5th IAPR International Conference on Biometrics, ICB 2012, New Delhi, India, March 29 - April 1, 2012.",
                "count": 79,
                "papers": [
                    "A method for heterogeneous face image synthesis.",
                    "An improved coupled spectral regression for heterogeneous face recognition.",
                    "Discriminant analysis with Gabor phase for robust face recognition.",
                    "A hierarchical framework for image-based human age estimation by weighted and OHRanked Sparse Representation-based classification.",
                    "A face antispoofing database with diverse attacks.",
                    "Head pose estimation by bootstrapping generalized discriminant analysis with SIFT flow alignment criterion.",
                    "Face verification put to test: A hill-climbing attack based on the uphill-simplex algorithm.",
                    "Label diffusion on graph for face identification.",
                    "Histograms of Gabor Ordinal Measures for face representation and recognition.",
                    "Context-patch for difficult face recognition.",
                    "Face liveness detection based on texture and frequency analyses.",
                    "Moving face spoofing detection via 3D projective invariants.",
                    "Heterogeneous face image matching using multi-scale features.",
                    "Impact of out-of-focus blur on face recognition performance based on modular transfer function.",
                    "Nose tip detection from 3D facial mesh data using a rotationally invariant local shape descriptor.",
                    "An efficient technique for ear detection in 3D: Invariant to rotation and scale.",
                    "3D face recognition: A robust multi-matcher approach to data degradations.",
                    "Robust 3D face recognition in the presence of realistic occlusions.",
                    "Which 3D geometric facial features give up your identity?",
                    "Oriented Gradient Maps based automatic asymmetric 3D-2D face recognition.",
                    "3D morphable model fitting for low-resolution facial images.",
                    "Towards automated caricature recognition.",
                    "Facial behavior as a soft biometric.",
                    "Fingerprint enhancement using contextual iterative filtering.",
                    "Gabor filters as candidate quality measure for NFIQ 2.0.",
                    "The enhancement of low quality fingerprint based on fractional calculus mask.",
                    "A novel measure of fingerprint image quality using Principal Component Analysis(PCA).",
                    "Fingerprint orientation modeling by sparse coding.",
                    "Evaluation of fusion methods for latent fingerprint matchers.",
                    "Latent fingerprint segmentation with adaptive total variation model.",
                    "Texture based fingerprint BioHashing: Attacks and robustness.",
                    "Generalized fingerprint minutiae vicinities.",
                    "LivDet 2011 - Fingerprint liveness detection competition 2011.",
                    "Fingerprint matching based on minutiae phase spectrum.",
                    "On matching altered fingerprints.",
                    "Iris-sensor authentication using camera PRNU fingerprints.",
                    "Retrieving secrets from iris fuzzy commitment.",
                    "Extracting sclera features for cancelable identity verification.",
                    "A generic computer platform for efficient iris recognition.",
                    "Faster secure computation for biometric identification using filtering.",
                    "Tensor decomposition of SIFT descriptors for person identification.",
                    "Iris liveness detection based on quality related features.",
                    "Impact of common ophthalmic disorders on iris segmentation.",
                    "Weighted adaptive Hough and ellipsopolar transforms for real-time iris segmentation.",
                    "A novel method for low-constrained iris boundary localization.",
                    "Iris-biometric comparators: Exploiting comparison scores towards an optimal alignment under Gaussian assumption.",
                    "Human identification from at-a-distance face images using sparse representation of local iris features.",
                    "The Viterbi algorithm at different resolutions for enhanced iris segmentation.",
                    "Robust iris segmentation based on learned boundary detectors.",
                    "Lef3a: Pupil segmentation using Viterbi search algorithm.",
                    "Extraction of fractal dimension for iris texture.",
                    "Iris recognition under alcohol influence: A preliminary study.",
                    "A biometric-based covert warning system using EEG.",
                    "Semiautomatic dental recognition using a graph-based segmentation algorithm and teeth shapes features.",
                    "Marionette mass-spring model for 3D gait biometrics.",
                    "Performance evaluation of gait recognition using the largest inertial sensor-based gait database.",
                    "Hand vein recognition based on multiple keypoints sets.",
                    "Significance of magnitude and phase information via VTEO for humming based biometrics.",
                    "On the effectiveness and applicability of mouse dynamics biometric for static authentication: A benchmark study.",
                    "Ethnicity classification based on fusion of face and gait.",
                    "Combined face and gait recognition using alpha matte preprocessing.",
                    "Biometric based personal authentication using fuzzy binary decision tree.",
                    "Evaluation of multimodal biometric score fusion rules under spoof attacks.",
                    "The one-to-many multi-modal fusion challenge.",
                    "Biometric authentication via oculomotor plant characteristics.",
                    "Palmprint verification and identification using pyramidal HOG feature and fast tree based matching.",
                    "Improving radial triangulation-based forensic palmprint recognition according to point pattern comparison by relaxation.",
                    "Identification of multi-spectral palmprints using energy compaction by Hybrid wavelet.",
                    "Periocular recognition: Analysis of performance degradation factors.",
                    "Matching highly non-ideal ocular images: An information fusion approach.",
                    "Estimating individuality in feature point based retina templates.",
                    "Security EvaBio: An analysis tool for the security evaluation of biometric authentication systems.",
                    "Joint inference of soft biometric features.",
                    "Speaker identification using optimal lip biometrics.",
                    "Speaker verification with long-term ageing data.",
                    "A joint factor analysis model for handling mismatched recording conditions in forensic automatic speaker recognition.",
                    "Biometric access control using Near Field Communication and smart phones.",
                    "Criteria towards metrics for benchmarking template protection algorithms.",
                    "Modeling biometric template update with Ant Colony Optimization."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "IJCB (ICB+BTAS) 2011",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2011",
                "sub_name": "2011 IEEE International Joint Conference on Biometrics, IJCB 2011, Washington, DC, USA, October 11-13, 2011.",
                "count": 106,
                "papers": [
                    "Can facial metrology predict gender?",
                    "Generic 3D face pose estimation using facial shapes.",
                    "Offline signature verification using classifier combination of HOG and LBP features.",
                    "Robustness of multi-modal biometric verification systems under realistic spoofing attacks.",
                    "Biometric recognition of newborns: Identification using palmprints.",
                    "Facial recognition of identical twins.",
                    "Facial landmark detection in uncontrolled conditions.",
                    "Person-specific face representation for recognition.",
                    "Biometric zoos: Theory and experimental evidence.",
                    "An investigation of keystroke and stylometry traits for authenticating online test takers.",
                    "Comparison of quality-based fusion of face and iris biometrics.",
                    "Latent fingerprint enhancement via robust orientation field estimation.",
                    "Latent fingerprint matching using descriptor-based hough transform.",
                    "Long range iris acquisition system for stationary and mobile subjects.",
                    "Study on the BeiHang Keystroke Dynamics Database.",
                    "NFRAD: Near-Infrared Face Recognition at a Distance.",
                    "BioSecure Signature Evaluation Campaign (ESRA'2011): evaluating systems on quality-based categories of skilled forgeries.",
                    "Fingerprint verification competition at IJCB2011.",
                    "A Bayesian approach to fingerprint minutia localization and quality assessment using adaptable templates.",
                    "Fusing with context: A Bayesian approach to combining descriptive attributes.",
                    "Twins 3D face recognition challenge.",
                    "Fast speaker verification on mobile phone data using boosted slice classifiers.",
                    "Model-based 3D shape recovery from single images of unknown pose and illumination using a small number of feature points.",
                    "Heterogeneous information fusion: A novel fusion paradigm for biometric systems.",
                    "Real-time feedback for usable fingerprint systems.",
                    "Fundamental statistics of relatively permanent pigmented or vascular skin marks for criminal and victim identification.",
                    "Do you see what i see? A more realistic eyewitness sketch recognition.",
                    "Face verification using large feature sets and one shot similarity.",
                    "A robust eye localization method for low quality face images.",
                    "A comparative evaluation of iris and ocular recognition methods on challenging ocular images.",
                    "3D face sketch modeling and assessment for component based face recognition.",
                    "Dynamic signature for a closed-set identification based on nonlinear analysis.",
                    "Counter-measures to photo attacks in face recognition: A public database and a baseline.",
                    "Gait energy volumes and frontal gait recognition using depth images.",
                    "Palmprint indexing based on ridge features.",
                    "Retina features based on vessel graph substructures.",
                    "Robust face recognition with class dependent factor analysis.",
                    "Competition on counter measures to 2-D facial spoofing attacks.",
                    "Face spoofing detection from single images using micro-texture analysis.",
                    "Eyebrow shape-based features for biometric recognition and gender classification: A feasibility study.",
                    "Combination of multiple samples utilizing identification model in biometric systems.",
                    "Using comparative human descriptions for soft biometrics.",
                    "Face recognition in low-resolution videos using learning-based likelihood measurement model.",
                    "Fusion of directional transitional features for off-line signature verification.",
                    "Two faces are better than one: Face recognition in group photographs.",
                    "Graph modeling based local descriptor selection via a hierarchical structure for biometric recognition.",
                    "A framework for quality-based biometric classifier selection.",
                    "On co-training online biometric classifiers.",
                    "Face recognition for look-alikes: A preliminary study.",
                    "UR3D-C: Linear dimensionality reduction for efficient 3D face recognition.",
                    "Fusion of multiple clues for photo-attack detection in face recognition systems.",
                    "Prediction and validation of indexing performance for biometrics.",
                    "Is gender classification across ethnicity feasible using discriminant functions?",
                    "On matching latent to latent fingerprints.",
                    "Dilation aware multi-image enrollment for iris biometrics.",
                    "Phase registration in a gallery improving gait authentication.",
                    "Unconditionally provably secure cancelable biometrics based on a quotient polynomial ring.",
                    "Robust head pose estimation via semi-supervised manifold learning with ℓ1-graph regularization.",
                    "Gait recognition using periodic temporal super resolution for low frame-rate videos.",
                    "Gait-based age estimation using a whole-generation gait database.",
                    "Score-level fusion based on the direct estimation of the Bayes error gradient distribution.",
                    "Fingerprint feature extraction from gray scale images by ridge tracing.",
                    "Face synthesis from near-infrared to visual light via sparse representation.",
                    "Reliability-balanced feature level fusion for fuzzy commitment scheme.",
                    "Biometric identification via eye movement scanpaths in reading.",
                    "Fingerprint matching by incorporating minutiae discriminability.",
                    "Mining patterns of orientations and magnitudes for face recognition.",
                    "Symmetric surface-feature based 3D face recognition for partial data.",
                    "Fingerprint enhancement using Hierarchical Markov Random Fields.",
                    "Towards automated pose invariant 3D dental biometrics.",
                    "Identity leakage mitigation on asymmetric secure sketch.",
                    "Quantifying privacy and security of biometric fuzzy commitment.",
                    "Evaluation of gender classification methods on thermal and near-infrared face images.",
                    "Synthesis-based recognition of low resolution faces.",
                    "Latent-to-full palmprint comparison based on radial triangulation under forensic conditions.",
                    "Face recognition across time lapse: On learning feature subspaces.",
                    "Analysis of facial features in identical twins.",
                    "Spectral minutiae for vein pattern recognition.",
                    "On the evidential value of fingerprints.",
                    "Difficult imaging covariates or difficult subjects? - An empirical investigation.",
                    "Continuous and non-intrusive identity verification in real-time environments based on free-text keystroke dynamics.",
                    "Speech cryptographic key regeneration based on password.",
                    "Improved face recognition using super-resolution.",
                    "Learning weighted sparse representation of encoded facial normal information for expression-robust 3D face recognition.",
                    "Partial face recognition: An alignment free approach.",
                    "Model-based 3D gait biometrics.",
                    "Towards incremental and large scale face recognition.",
                    "The effect of time on ear biometrics.",
                    "3D to 2D fingerprints: Unrolling and distortion correction.",
                    "Cross-spectral face recognition in heterogeneous environments: A case study on matching visible to short-wave infrared imagery.",
                    "On-line signature verification using wavelet packet.",
                    "Fusion of structured projections for cancelable face identity verification.",
                    "Hierarchical and discriminative bag of features for face profile and ear based gender classification.",
                    "Fast and accurate biometric identification using score level indexing and fusion.",
                    "Face spoofing detection through partial least squares and low-level descriptors.",
                    "Face and eye detection on hard datasets.",
                    "Wet fingerprint recognition: Challenges and opportunities.",
                    "Low-resolution face recognition via Simultaneous Discriminant Analysis.",
                    "A robust eye-corner detection method for real-world data.",
                    "Fingerprint template protection with Minutia Vicinity Decomposition.",
                    "An adaptive resolution voxelization framework for 3D ear recognition.",
                    "Inter-session variability modelling and joint factor analysis for face authentication.",
                    "Investigating age invariant face recognition based on periocular biometrics.",
                    "Contourlet appearance model for facial age estimation.",
                    "Fusion of region-based representations for gender identification.",
                    "Palm vein recognition with Local Binary Patterns and Local Derivative Patterns."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ICB 2009",
        "info": "Alghero, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2009",
                "sub_name": "Advances in Biometrics, Third International Conference, ICB 2009, Alghero, Italy, June 2-5, 2009. Proceedings.",
                "count": 130,
                "papers": [
                    "Facial Geometry Estimation Using Photometric Stereo and Profile Views.",
                    "3D Signatures for Fast 3D Face Recognition.",
                    "On Decomposing an Unseen 3D Face into Neutral Face and Expression Deformations.",
                    "Pose Normalization for Local Appearance-Based Face Recognition.",
                    "Bayesian Face Recognition Based on Markov Random Field Modeling.",
                    "Pixelwise Local Binary Pattern Models of Faces Using Kernel Density Estimation.",
                    "Improvements and Performance Evaluation Concerning Synthetic Age Progression and Face Recognition Affected by Adult Aging.",
                    "Binary Biometric Representation through Pairwise Polar Quantization.",
                    "Manifold Learning for Gender Classification from Face Sequences.",
                    "A Random Network Ensemble for Face Recognition.",
                    "Extraction of Illumination-Invariant Features in Face Recognition by Empirical Mode Decomposition.",
                    "A Discriminant Analysis Method for Face Recognition in Heteroscedastic Distributions.",
                    "Robust Face Recognition Using Color Information.",
                    "Face Age Classification on Consumer Images with Gabor Feature and Fuzzy LDA Method.",
                    "The Big Brother Database: Evaluating Face Recognition in Smart Home Environments.",
                    "A Confidence-Based Update Rule for Self-updating Human Face Recognition Systems.",
                    "Facial Comparisons by Subject Matter Experts: Their Role in Biometrics and Their Training.",
                    "Face Gender Classification on Consumer Images in a Multiethnic Environment.",
                    "Multi-View Face Alignment Using 3D Shape Model for View Estimation.",
                    "Analysis of Eigenvalue Correction Applied to Biometrics.",
                    "Multi-Region Probabilistic Histograms for Robust and Scalable Identity Inference.",
                    "Heterogeneous Face Recognition from Local Structures of Normalized Appearance.",
                    "Sparse Representation for Video-Based Face Recognition.",
                    "Face Image Quality Evaluation for ISO/IEC Standards 19794-5 and 29794-5.",
                    "Upper Facial Action Unit Recognition.",
                    "Automatic Partial Face Alignment in NIR Video Sequences.",
                    "Parts-Based Face Verification Using Local Frequency Bands.",
                    "Local Gabor Binary Pattern Whitened PCA: A Novel Approach for Face Recognition from Single Image Per Person.",
                    "3D Face Recognition Using Joint Differential Invariants.",
                    "A Model Based Approach for Expressions Invariant Face Recognition.",
                    "Why Is Facial Occlusion a Challenging Problem?.",
                    "Nasal Region-Based 3D Face Recognition under Pose and Expression Variations.",
                    "An Analysis-by-Synthesis Method for Heterogeneous Face Biometrics.",
                    "Face Recognition with LWIR Imagery Using Local Binary Patterns.",
                    "A Classification Framework for Large-Scale Face Recognition Systems.",
                    "Synthesizing Frontal Faces on Calibrated Stereo Cameras for Face Recognition.",
                    "Nasal Region Contribution in 3D Face Biometrics Using Shape Analysis Framework.",
                    "Generic versus Salient Region-Based Partitioning for Local Appearance Face Recognition.",
                    "Near Infrared Face Based Biometric Key Binding.",
                    "Fuzzy 3D Face Ethnicity Categorization.",
                    "Faceprint: Fusion of Local Features for 3D Face Recognition.",
                    "Combining Illumination Normalization Methods for Better Face Recognition.",
                    "Bayesian Networks to Combine Intensity and Color Information in Face Recognition.",
                    "Combining Facial Skin Mark and Eigenfaces for Face Recognition.",
                    "Analysis of the Utility of Classical and Novel Speech Quality Measures for Speaker Verification.",
                    "Impact of Prior Channel Information for Speaker Identification.",
                    "Minimising Speaker Verification Utterance Length through Confidence Based Early Verification Decisions.",
                    "Scatter Difference NAP for SVM Speaker Recognition.",
                    "Data-Driven Impostor Selection for T-Norm Score Normalisation and the Background Dataset in SVM-Based Speaker Verification.",
                    "Support Vector Machine Regression for Robust Speaker Verification in Mismatching and Forensic Conditions.",
                    "Scores Selection for Emotional Speaker Recognition.",
                    "Automatic Cross-Biometric Footstep Database Labelling Using Speaker Recognition.",
                    "Towards Structured Approaches to Arbitrary Data Selection and Performance Prediction for Speaker Recognition.",
                    "Beyond Minutiae: A Fingerprint Individuality Model with Pattern, Ridge and Pore Features.",
                    "Active Fingerprint Ridge Orientation Models.",
                    "FM Model Based Fingerprint Reconstruction from Minutiae Template.",
                    "Robust Biometric System Using Palmprint for Personal Verification.",
                    "Accurate Palmprint Recognition Using Spatial Bags of Local Layered Descriptors.",
                    "Pose Invariant Palmprint Recognition.",
                    "Palmprint Recognition Based on Regional Rank Correlation of Directional Features.",
                    "Direct Pore Matching for Fingerprint Recognition.",
                    "A Novel Fingerprint Matching Algorithm Using Ridge Curvature Feature.",
                    "Fingerprint Matching Based on Neighboring Information and Penalized Logistic Regression.",
                    "A Novel Region Based Liveness Detection Approach for Fingerprint Scanners.",
                    "Focal Point Detection Based on Half Concentric Lens Model for Singular Point Extraction in Fingerprint.",
                    "Robust Fingerprint Matching Using Spiral Partitioning Scheme.",
                    "Performance and Computational Complexity Comparison of Block-Based Fingerprint Enhancement.",
                    "Reference Point Detection for Arch Type Fingerprints.",
                    "Palmprint Verification Using Circular Gabor Filter.",
                    "Kernel Principal Component Analysis of Gabor Features for Palmprint Recognition.",
                    "Latent Fingerprint Matching: Fusion of Rolled and Plain Fingerprints.",
                    "Overview of the Multiple Biometrics Grand Challenge.",
                    "Face Video Competition.",
                    "Fingerprint and On-Line Signature Verification Competitions at ICB 2009.",
                    "Partial Face Matching between Near Infrared and Visual Images in MBGC Portal Challenge.",
                    "Fusion in Multibiometric Identification Systems: What about the Missing Data?.",
                    "Challenges and Research Directions for Adaptive Biometric Recognition Systems.",
                    "Modelling FRR of Biometric Verification Systems Using the Template Co-update Algorithm.",
                    "Bipartite Biotokens: Definition, Implementation, and Analysis.",
                    "Fusion of LSB and DWT Biometric Watermarking Using Offline Handwritten Signature for Copyright Protection.",
                    "Audio-Visual Identity Verification and Robustness to Imposture.",
                    "Theoretical Framework for Constructing Matching Algorithms in Biometric Authentication Systems.",
                    "A Biometric Menagerie Index for Characterising Template/Model-Specific Variation.",
                    "An Usability Study of Continuous Biometrics Authentication.",
                    "A First Approach to Contact-Based Biometrics for User Authentication.",
                    "Template Update Methods in Adaptive Biometric Systems: A Critical Review.",
                    "Simulating the Influences of Aging and Ocular Disease on Biometric Recognition Performance.",
                    "Cancelable Biometrics with Perfect Secrecy for Correlation-Based Matching.",
                    "An Information Theoretic Framework for Biometric Security Systems.",
                    "Constructing Passwords from Biometrical Data.",
                    "Efficient Biometric Verification in Encrypted Domain.",
                    "A New Approach for Biometric Template Storage and Remote Authentication.",
                    "A Biometric Key-Binding and Template Protection Framework Using Correlation Filters.",
                    "Security-Enhanced Fuzzy Fingerprint Vault Based on Minutiae's Local Ridge Information.",
                    "Systematic Construction of Iris-Based Fuzzy Commitment Schemes.",
                    "Parallel versus Serial Classifier Combination for Multibiometric Hand-Based Identification.",
                    "Robust Multi-modal and Multi-unit Feature Level Fusion of Face and Iris Biometrics.",
                    "Robust Human Detection under Occlusion by Integrating Face and Person Detectors.",
                    "Multibiometric People Identification: A Self-tuning Architecture.",
                    "Covariate Analysis for View-Point Independent Gait Recognition.",
                    "Dynamic Texture Based Gait Recognition.",
                    "Gender Recognition Based on Fusion of Face and Multi-view Gait.",
                    "Unsupervised Real-Time Unusual Behavior Detection for Biometric-Assisted Visual Surveillance.",
                    "Multilinear Tensor-Based Non-parametric Dimension Reduction for Gait Recognition.",
                    "Quantifying Gait Similarity: User Authentication and Real-World Challenge.",
                    "40 Years of Progress in Automatic Speaker Recognition.",
                    "Robust Biometric Key Extraction Based on Iris Cryptosystem.",
                    "Iris Matching by Local Extremum Points of Multiscale Taylor Expansion.",
                    "Efficient Iris Spoof Detection via Boosted Local Binary Patterns.",
                    "Custom Design of JPEG Quantisation Tables for Compressing Iris Polar Images to Improve Recognition Accuracy.",
                    "Improving Compressed Iris Recognition Accuracy Using JPEG2000 RoI Coding.",
                    "Image Averaging for Improved Iris Recognition.",
                    "Iris Recognition Using 3D Co-occurrence Matrix.",
                    "A New Fake Iris Detection Method.",
                    "Eyelid Localization in Iris Images Captured in Less Constrained Environment.",
                    "Noisy Iris Verification: A Modified Version of Local Intensity Variation Method.",
                    "An Automated Video-Based System for Iris Recognition.",
                    "Empirical Evidence for Correct Iris Match Score Degradation with Increased Time-Lapse between Gallery and Probe Matches.",
                    "Practical On-Line Signature Verification.",
                    "On-Line Signature Matching Based on Hilbert Scanning Patterns.",
                    "Static Models of Derivative-Coordinates Phase Spaces for Multivariate Time Series Classification: An Application to Signature Verification.",
                    "Feature Selection in a Low Cost Signature Recognition System Based on Normalized Signatures and Fractional Distances.",
                    "Feature Selection and Binarization for On-Line Signature Recognition.",
                    "Writer Identification of Chinese Handwriting Using Grid Microstructure Feature.",
                    "Enhancement and Registration Schemes for Matching Conjunctival Vasculature.",
                    "Entropy of the Retina Template.",
                    "Lips Recognition for Biometrics.",
                    "Biometrics Method for Human Identification Using Electrocardiogram.",
                    "Real-Time Model-Based Hand Localization for Unsupervised Palmar Image Acquisition.",
                    "Palm Vein Verification System Based on SIFT Matching."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ICB 2007",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2007",
                "sub_name": "Advances in Biometrics, International Conference, ICB 2007, Seoul, Korea, August 27-29, 2007, Proceedings.",
                "count": 125,
                "papers": [
                    "Super-Resolved Faces for Improved Face Recognition from Surveillance Video.",
                    "Face Detection Based on Multi-Block LBP Representation.",
                    "Color Face Tensor Factorization and Slicing for Illumination-Robust Recognition.",
                    "Robust Real-Time Face Detection Using Face Certainty Map.",
                    "Motion Compensation for Face Recognition Based on Active Differential Imaging.",
                    "Face Recognition with Local Gabor Textons.",
                    "Speaker Verification with Adaptive Spectral Subband Centroids.",
                    "Similarity Rank Correlation for Face Recognition Under Unenrolled Pose.",
                    "Feature Correlation Filter for Face Recognition.",
                    "Face Recognition by Discriminant Analysis with Gabor Tensor Representation.",
                    "Fingerprint Enhancement Based on Discrete Cosine Transform.",
                    "Biometric Template Classification: A Case Study in Iris Textures.",
                    "Protecting Biometric Templates with Image Watermarking Techniques.",
                    "Factorial Hidden Markov Models for Gait Recognition.",
                    "A Robust Fingerprint Matching Approach: Growing and Fusing of Local Structures.",
                    "Automatic Facial Pose Determination of 3D Range Data for Face Model and Expression Identification.",
                    "SVDD-Based Illumination Compensation for Face Recognition.",
                    "Keypoint Identification and Feature-Based 3D Face Recognition.",
                    "Fusion of Near Infrared Face and Iris Biometrics.",
                    "Multi-Eigenspace Learning for Video-Based Face Recognition.",
                    "Error-Rate Based Biometrics Fusion.",
                    "Online Text-Independent Writer Identification Based on Stroke's Probability Distribution Function.",
                    "Arm Swing Identification Method with Template Update for Long Term Stability.",
                    "Walker Recognition Without Gait Cycle Estimation.",
                    "Comparison of Compression Algorithms' Impact on Iris Recognition Accuracy.",
                    "Standardization of Face Image Sample Quality.",
                    "Blinking-Based Live Face Detection Using Conditional Random Fields.",
                    "Singular Points Analysis in Fingerprints Based on Topological Structure and Orientation Field.",
                    "Robust 3D Face Recognition from Expression Categorisation.",
                    "Fingerprint Recognition Based on Combined Features.",
                    "MQI Based Face Recognition Under Uneven Illumination.",
                    "Learning Kernel Subspace Classifier.",
                    "A New Approach to Fake Finger Detection Based on Skin Elasticity Analysis.",
                    "An Algorithm for Biometric Authentication Based on the Model of Non-Stationary Random Processes.",
                    "Identity Verification by Using Handprint.",
                    "Reducing the Effect of Noise on Human Contour in Gait Recognition.",
                    "Partitioning Gait Cycles Adaptive to Fluctuating Periods and Bad Silhouettes.",
                    "Repudiation Detection in Handwritten Documents.",
                    "A New Forgery Scenario Based on Regaining Dynamics of Signature.",
                    "Curvewise DET Confidence Regions and Pointwise EER Confidence Intervals Using Radial Sweep Methodology.",
                    "Bayesian Hill-Climbing Attack and Its Application to Signature Verification.",
                    "Wolf Attack Probability: A New Security Measure in Biometric Authentication Systems.",
                    "Evaluating the Biometric Sample Quality of Handwritten Signatures.",
                    "Outdoor Face Recognition Using Enhanced Near Infrared Imaging.",
                    "Latent Identity Variables: Biometric Matching Without Explicit Identity Estimation.",
                    "2Ns Discretisation of BioPhasor in Cancellable Biometrics.",
                    "Probabilistic Random Projections and Speaker Verification.",
                    "On Improving Interoperability of Fingerprint Recognition Using Resolution Compensation Based on Sensor Evaluation.",
                    "Demographic Classification with Local Binary Patterns.",
                    "Distance Measures for Gabor Jets-Based Face Authentication: A Comparative Evaluation.",
                    "Fingerprint Matching with an Evolutionary Approach.",
                    "Stability Analysis of Constrained Nonlinear Phase Portrait Models of Fingerprint Orientation Images.",
                    "Effectiveness of Pen Pressure, Azimuth, and Altitude Features for Online Signature Verification.",
                    "Tracking and Recognition of Multiple Faces at Distances.",
                    "Face Matching Between Near Infrared and Visible Light Images.",
                    "User Classification for Keystroke Dynamics Authentication.",
                    "Statistical Texture Analysis-Based Approach for Fake Iris Detection Using Support Vector Machines.",
                    "A Novel Null Space-Based Kernel Discriminant Analysis for Face Recognition.",
                    "Changeable Face Representations Suitable for Human Recognition.",
                    "\"3D Face\": Biometric Template Protection for 3D Face Recognition.",
                    "Quantitative Evaluation of Normalization Techniques of Matching Scores in Multimodal Biometric Systems.",
                    "Keystroke Dynamics in a General Setting.",
                    "A New Approach to Signature-Based Authentication.",
                    "Biometric Fuzzy Extractors Made Practical: A Proposal Based on FingerCodes.",
                    "On the Use of Log-Likelihood Ratio Based Model-Specific Score Normalisation in Biometric Authentication.",
                    "Predicting Biometric Authentication System Performance Across Different Application Conditions: A Bootstrap Enhanced Parametric Approach.",
                    "Selection of Distinguish Points for Class Distribution Preserving Transform for Biometric Template Protection.",
                    "Minimizing Spatial Deformation Method for Online Signature Matching.",
                    "Pan-Tilt-Zoom Based Iris Image Capturing System for Unconstrained User Environments at a Distance.",
                    "Fingerprint Matching with Minutiae Quality Score.",
                    "Uniprojective Features for Gait Recognition.",
                    "Cascade MR-ASM for Locating Facial Feature Points.",
                    "Reconstructing a Whole Face Image from a Partially Damaged or Occluded Image by Multiple Matching.",
                    "Robust Hiding of Fingerprint-Biometric Data into Audio Signals.",
                    "Correlation-Based Fingerprint Matching with Orientation Field Alignment.",
                    "Vitality Detection from Fingerprint Images: A Critical Survey.",
                    "Optimum Detection of Multiplicative-Multibit Watermarking for Fingerprint Images.",
                    "Fake Finger Detection Based on Thin-Plate Spline Distortion Model.",
                    "Robust Extraction of Secret Bits from Minutiae.",
                    "Fuzzy Extractors for Minutiae-Based Fingerprint Authentication.",
                    "Coarse Iris Classification by Learned Visual Dictionary.",
                    "Nonlinear Iris Deformation Correction Based on Gaussian Model.",
                    "Shape Analysis of Stroma for Iris Recognition.",
                    "Biometric Key Binding: Fuzzy Vault Based on Iris Images.",
                    "Multi-scale Local Binary Pattern Histograms for Face Recognition.",
                    "Histogram Equalization in SVM Multimodal Person Verification.",
                    "Learning Multi-scale Block Local Binary Patterns for Face Recognition.",
                    "Horizontal and Vertical 2DPCA Based Discriminant Analysis for Face Verification Using the FRGC Version 2 Database.",
                    "Video-Based Face Tracking and Recognition on Updating Twin GMMs.",
                    "Fast Algorithm for Iris Detection.",
                    "Pyramid Based Interpolation for Face-Video Playback in Audio Visual Recognition.",
                    "Face Authentication with Salient Local Features and Static Bayesian Network.",
                    "Fake Finger Detection by Finger Color Change Analysis.",
                    "Feeling Is Believing: A Secure Template Exchange Protocol.",
                    "SVM-Based Selection of Colour Space Experts for Face Authentication.",
                    "An Efficient Iris Coding Based on Gauss-Laguerre Wavelets.",
                    "Hardening Fingerprint Fuzzy Vault Using Password.",
                    "GPU Accelerated 3D Face Registration / Recognition.",
                    "Frontal Face Synthesis Based on Multiple Pose-Variant Images for Face Recognition.",
                    "Optimal Decision Fusion for a Face Verification System.",
                    "Robust 3D Head Tracking and Its Applications.",
                    "Multiple Faces Tracking Using Motion Prediction and IPCA in Particle Filters.",
                    "An Improved Iris Recognition System Using Feature Extraction Based on Wavelet Maxima Moment Invariants.",
                    "Color-Based Iris Verification.",
                    "Real-Time Face Detection and Recognition on LEGO Mindstorms NXT Robot.",
                    "Speaker and Digit Recognition by Audio-Visual Lip Biometrics.",
                    "Modelling Combined Handwriting and Speech Modalities.",
                    "A Palmprint Cryptosystem.",
                    "On Some Performance Indices for Biometric Identification System.",
                    "Automatic Online Signature Verification Using HMMs with User-Dependent Structure.",
                    "A Complete Fisher Discriminant Analysis for Based Image Matrix and Its Application to Face Biometrics.",
                    "SVM Speaker Verification Using Session Variability Modelling and GMM Supervectors.",
                    "3D Model-Based Face Recognition in Video.",
                    "Robust Point-Based Feature Fingerprint Segmentation Algorithm.",
                    "Automatic Fingerprints Image Generation Using Evolutionary Algorithm.",
                    "Audio Visual Person Authentication by Multiple Nearest Neighbor Classifiers.",
                    "Improving Classification with Class-Independent Quality Measures: Q-stack in Face Verification.",
                    "Biometric Hashing Based on Genetic Selection and Its Application to On-Line Signatures.",
                    "Biometrics Based on Multispectral Skin Texture.",
                    "Application of New Qualitative Voicing Time-Frequency Features for Speaker Recognition.",
                    "Palmprint Recognition Based on Directional Features and Graph Matching.",
                    "Tongue-Print: A Novel Biometrics Pattern.",
                    "Embedded Palmprint Recognition System on Mobile Devices.",
                    "Template Co-update in Multimodal Biometric Systems.",
                    "Continual Retraining of Keystroke Dynamics Based Authenticator."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ICB 2006",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icb/2006",
                "sub_name": "Advances in Biometrics, International Conference, ICB 2006, Hong Kong, China, January 5-7, 2006, Proceedings.",
                "count": 105,
                "papers": [
                    "Performance Characterisation of Face Recognition Algorithms and Their Sensitivity to Severe Illumination Changes.",
                    "Assessment of Blurring and Facial Expression Effects on Facial Image Recognition.",
                    "Ambient Illumination Variation Removal by Active Near-IR Imaging.",
                    "Rapid 3D Face Data Acquisition Using a Color-Coded Pattern and a Stereo Camera System.",
                    "Face Recognition Issues in a Border Control Environment.",
                    "Face Recognition Using Ordinal Features.",
                    "Specific Sensors for Face Recognition.",
                    "Fusion of Infrared and Range Data: Multi-modal Face Images.",
                    "Recognize Color Face Images Using Complex Eigenfaces.",
                    "Face Verification Based on Bagging RBF Networks.",
                    "Improvement on Null Space LDA for Face Recognition: A Symmetry Consideration.",
                    "Automatic 3D Face Recognition Using Discriminant Common Vectors.",
                    "Face Recognition by Inverse Fisher Discriminant Features.",
                    "3D Face Recognition Based on Facial Shape Indexes with Dynamic Programming.",
                    "Revealing the Secret of FaceHashing.",
                    "Person Authentication from Video of Faces: A Behavioral and Physiological Approach Using Pseudo Hierarchical Hidden Markov Models.",
                    "Cascade AdaBoost Classifiers with Stage Optimization for Face Detection.",
                    "Facial Image Reconstruction by SVDD-Based Pattern De-noising.",
                    "Pose Estimation Based on Gaussian Error Models.",
                    "A Novel PCA-Based Bayes Classifier and Face Analysis.",
                    "Highly Accurate and Fast Face Recognition Using Near Infrared Images.",
                    "Background Robust Face Tracking Using Active Contour Technique Combined Active Appearance Model.",
                    "Ensemble LDA for Face Recognition.",
                    "Information Fusion for Local Gabor Features Based Frontal Face Verification.",
                    "Using Genetic Algorithms to Find Person-Specific Gabor Feature Detectors for Face Indexing and Recognition.",
                    "The Application of Extended Geodesic Distance in Head Poses Estimation.",
                    "Improved Parameters Estimating Scheme for E-HMM with Application to Face Recognition.",
                    "Component-Based Active Appearance Models for Face Modelling.",
                    "Incorporating Image Quality in Multi-algorithm Fingerprint Verification.",
                    "A New Approach to Fake Finger Detection Based on Skin Distortion.",
                    "Model-Based Quality Estimation of Fingerprint Images.",
                    "A Statistical Evaluation Model for Minutiae-Based Automatic Fingerprint Verification Systems.",
                    "The Surround ImagerTM: A Multi-camera Touchless Device to Acquire 3D Rolled-Equivalent Fingerprints.",
                    "Extraction of Stable Points from Fingerprint Images Using Zone Could-be-in Theorem.",
                    "Fingerprint Image Enhancement Based on a Half Gabor Filter.",
                    "Fake Fingerprint Detection by Odor Analysis.",
                    "Ridge-Based Fingerprint Recognition.",
                    "Fingerprint Authentication Based on Matching Scores with Other Data.",
                    "Effective Fingerprint Classification by Localized Models of Support Vector Machines.",
                    "Fingerprint Ridge Distance Estimation: Algorithms and the Performance.",
                    "Enhancement of Low Quality Fingerprints Based on Anisotropic Filtering.",
                    "K-plet and Coupled BFS: A Graph Based Fingerprint Representation and Matching Algorithm.",
                    "A Fingerprint Recognition Algorithm Combining Phase-Based Image Matching and Feature-Based Matching.",
                    "Fast and Robust Fingerprint Identification Algorithm and Its Application to Residential Access Controller.",
                    "Design of Algorithm Development Interface for Fingerprint Verification Algorithms.",
                    "The Use of Fingerprint Contact Area for Biometric Identification.",
                    "Preprocessing of a Fingerprint Image Captured with a Mobile Camera.",
                    "A Phase-Based Iris Recognition Algorithm.",
                    "Graph Matching Iris Image Blocks with Local Binary Pattern.",
                    "Localized Iris Image Quality Using 2-D Wavelets.",
                    "Iris Authentication Using Privatized Advanced Correlation Filter.",
                    "Extracting and Combining Multimodal Directional Iris Features.",
                    "Fake Iris Detection by Using Purkinje Image.",
                    "A Novel Method for Coarse Iris Classification.",
                    "Global Texture Analysis of Iris Images for Ethnic Classification.",
                    "Modeling Intra-class Variation for Nonideal Iris Recognition.",
                    "A Model Based, Anatomy Based Method for Synthesizing Iris Images.",
                    "Study and Improvement of Iris Location Algorithm.",
                    "Applications of Wavelet Packets Decomposition in Iris Recognition.",
                    "Iris Image Real-Time Pre-estimation Using Compound BP Neural Network.",
                    "Iris Recognition in Mobile Phone Based on Adaptive Gabor Filter.",
                    "Robust and Fast Assessment of Iris Image Quality.",
                    "Efficient Iris Recognition Using Adaptive Quotient Thresholding.",
                    "A Novel Iris Segmentation Method for Hand-Held Capture Device.",
                    "Iris Recognition with Support Vector Machines.",
                    "Multi-level Fusion of Audio and Visual Features for Speaker Identification.",
                    "Online Signature Verification with New Time Series Kernels for Support Vector Machines.",
                    "Generation of Replaceable Cryptographic Keys from Dynamic Handwritten Signatures.",
                    "Online Signature Verification Based on Global Feature of Writing Forces.",
                    "Improving the Binding of Electronic Signatures to the Signer by Biometric Authentication.",
                    "A Comparative Study of Feature and Score Normalization for Speaker Verification.",
                    "Dynamic Bayesian Networks for Audio-Visual Speaker Recognition.",
                    "Identity Verification Through Palm Vein and Crease Texture.",
                    "Multimodal Facial Gender and Ethnicity Identification.",
                    "Continuous Verification Using Multimodal Biometrics.",
                    "Fusion of Face and Iris Features for Multimodal Biometrics.",
                    "The Role of Statistical Models in Biometric Authentication.",
                    "Technology Evaluations on the TH-FACE Recognition System.",
                    "Study on Synthetic Face Database for Performance Evaluation.",
                    "Gait Recognition Based on Fusion of Multi-view Gait Sequences.",
                    "A New Representation for Human Gait Recognition: Motion Silhouettes Image (MSI).",
                    "Reconstruction of 3D Human Body Pose for Gait Recognition.",
                    "Artificial Rhythms and Cues for Keystroke Dynamics Based Authentication.",
                    "Retraining a Novelty Detector with Impostor Patterns for Keystroke Dynamics-Based Authentication.",
                    "Biometric Access Control Through Numerical Keyboards Based on Keystroke Dynamics.",
                    "Keystroke Biometric System Using Wavelets.",
                    "GA SVM Wrapper Ensemble for Keystroke Dynamics Authentication.",
                    "Enhancing Login Security Through the Use of Keystroke Input Dynamics.",
                    "A Study of Identical Twins' Palmprints for Personal Authentication.",
                    "A Novel Hybrid Crypto-Biometric Authentication Scheme for ATM Based Banking Applications.",
                    "An Uncorrelated Fisherface Approach for Face and Palmprint Recognition.",
                    "Fast and Accurate Segmentation of Dental X-Ray Records.",
                    "Acoustic Ear Recognition.",
                    "Classification of Bluffing Behavior and Affective Attitude from Prefrontal Surface Encephalogram During On-Line Game.",
                    "A Novel Strategy for Designing Efficient Multiple Classifier.",
                    "Hand Geometry Based Recognition with a MLP Classifier.",
                    "A False Rejection Oriented Threat Model for the Design of Biometric Authentication Systems.",
                    "A Bimodal Palmprint Verification System.",
                    "Feature-Level Fusion of Hand Biometrics for Personal Verification Based on Kernel PCA.",
                    "Human Identification System Based on PCA Using Geometric Features of Teeth.",
                    "An Improved Super-Resolution with Manifold Learning and Histogram Matching.",
                    "Invertible Watermarking Algorithm with Detecting Locations of Malicious Manipulation for Biometric Image Authentication.",
                    "The Identification and Recognition Based on Point for Blood Vessel of Ocular Fundus.",
                    "A Method for Footprint Range Image Segmentation and Description.",
                    "Human Ear Recognition from Face Profile Images."
                ]
            }
        ]
    }
]