[
    {
        "year": "2021",
        "name": "ICCBR 2021",
        "info": "Salamanca, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2021",
                "sub_name": "Case-Based Reasoning Research and Development - 29th International Conference, ICCBR 2021, Salamanca, Spain, September 13-16, 2021, Proceedings.",
                "count": 21,
                "papers": [
                    "The Bites Eclectic: Critique-Based Conversational Recommendation for Diversity-Focused Meal Planning.",
                    "Evaluation of Similarity Measures for Flight Simulator Training Scenarios.",
                    "Instance-Based Counterfactual Explanations for Time Series Classification.",
                    "User Evaluation to Measure the Perception of Similarity Measures in Artworks.",
                    "Measuring Financial Time Series Similarity with a View to Identifying Profitable Stock Market Opportunities.",
                    "A Case-Based Reasoning Approach to Predicting and Explaining Running Related Injuries.",
                    "Bayesian Feature Construction for Case-Based Reasoning: Generating Good Checklists.",
                    "Revisiting Fast and Slow Thinking in Case-Based Reasoning.",
                    "Harmonizing Case Retrieval and Adaptation with Alternating Optimization.",
                    "Adaptation Knowledge Discovery Using Positive and Negative Cases.",
                    "When Revision-Based Case Adaptation Meets Analogical Extrapolation.",
                    "Inferring Case-Based Reasoners' Knowledge to Enhance Interactivity.",
                    "A Case-Based Approach for the Selection of Explanation Algorithms in Image Classification.",
                    "Towards Richer Realizations of Holographic CBR.",
                    "Handling Climate Change Using Counterfactuals: Using Counterfactuals in Data Augmentation to Predict Crop Growth in an Uncertain Climate Future.",
                    "A Case-Based Approach to Data-to-Text Generation.",
                    "On Combining Knowledge-Engineered and Network-Extracted Features for Retrieval.",
                    "Task and Situation Structures for Case-Based Planning.",
                    "Learning Adaptations for Case-Based Classification: A Neural Network Approach.",
                    "Similar Questions Correspond to Similar SQL Queries: A Case-Based Reasoning Approach for Text-to-SQL Translation.",
                    "Deciphering Ancient Chinese Oracle Bone Inscriptions Using Case-Based Reasoning."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2021w",
                "sub_name": "Workshops Proceedings for the 29th International Conference on Case-Based Reasoning co-located with the 29th International Conference on Case-Based Reasoning (ICCBR 2021), Salamanca (Spain) / Online, September 13-16, 2021.",
                "count": 11,
                "papers": [
                    "Longitudinal Distance: Towards Accountable Instance Attribution.",
                    "Explanations on Smart Stores.",
                    "A Systematic Review on Model-agnostic XAI Libraries.",
                    "Evaluating CBR Explanation Capabilities: Survey and Next Steps.",
                    "Explanation Container in Case-Based Biomedical Question-Answering.",
                    "Actionable Feature Discovery in Counterfactuals using Feature Relevance Explainers.",
                    "Knowledge-based XAI through CBR: There is More to Explanations than Models Can Tell.",
                    "A System to Assist Semantic Web Data Editing Through the Use of Case-Based Reasoning.",
                    "Upcycling Formal Specifications for Similar Implementations with Arís.",
                    "Prototype Application to Detect Malicious Network Traffic with Case-based Reasoning and SEASALT.",
                    "VISAB - a Visualization Tool for CBR Agent Behavior in Games."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ICCBR 2020",
        "info": "Salamanca, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2020",
                "sub_name": "Case-Based Reasoning Research and Development - 28th International Conference, ICCBR 2020, Salamanca, Spain, June 8-12, 2020, Proceedings.",
                "count": 23,
                "papers": [
                    "Learning to Compare with Few Data for Personalised Human Activity Recognition.",
                    "A*-Based Similarity Assessment of Semantic Graphs.",
                    "A Time-Series Similarity Measure for Case-Based Deviation Management to Support Flexible Workflow Execution.",
                    "Process Trace Classification for Stroke Management Quality Assessment.",
                    "Using Case-Based Reasoning to Predict Marathon Performance and Recommend Tailored Training Plans.",
                    "Classifying Breast Cancer Tissue Through DNA Methylation and Clinical Covariate Based Retrieval.",
                    "A New Adaptation Phase for Thresholds in a CBR System Associated to a Region Growing Algorithm to Segment Tumoral Kidneys.",
                    "Predicting the Personal-Best Times of Speed Skaters Using Case-Based Reasoning.",
                    "Clood CBR: Towards Microservices Oriented Case-Based Reasoning.",
                    "Holographic Case-Based Reasoning.",
                    "Good Counterfactuals and Where to Find Them: A Case-Based Technique for Generating Counterfactuals for Explainable AI (XAI).",
                    "CBR-LIME: A Case-Based Reasoning Approach to Provide Specific Local Interpretable Model-Agnostic Explanations.",
                    "A User-Centric Evaluation to Generate Case-Based Explanations Using Formal Concept Analysis.",
                    "Improved and Visually Enhanced Case-Based Retrieval of Room Configurations for Assistance in Architectural Design Education.",
                    "Using Siamese Graph Neural Networks for Similarity-Based Retrieval in Process-Oriented Case-Based Reasoning.",
                    "Applying Class-to-Class Siamese Networks to Explain Classifications with Supportive and Contrastive Cases.",
                    "Building Non-player Character Behaviors By Imitation Using Interactive Case-Based Reasoning.",
                    "Case-Based Approach to Automated Natural Language Generation for Obituaries.",
                    "Case-Based Gesture Interface for Multiagent Formation Control.",
                    "The French Correction: When Retrieval Is Harder to Specify than Adaptation.",
                    "Learning to Improve Efficiency for Adaptation Paths.",
                    "On Bringing Case-Based Reasoning Methodology to Deep Learning.",
                    "Opportunities for Case-Based Reasoning in Personal Flow and Productivity Management."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ICCBR 2019",
        "info": "Otzenhausen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2019",
                "sub_name": "Case-Based Reasoning Research and Development - 27th International Conference, ICCBR 2019, Otzenhausen, Germany, September 8-12, 2019, Proceedings.",
                "count": 26,
                "papers": [
                    "Comparing Similarity Learning with Taxonomies and One-Mode Projection in Context of the FEATURE-TAK Framework.",
                    "An Algorithm Independent Case-Based Explanation Approach for Recommender Systems Using Interaction Graphs.",
                    "Explanation of Recommenders Using Formal Concept Analysis.",
                    "FLEA-CBR - A Flexible Alternative to the Classic 4R Cycle of Case-Based Reasoning.",
                    "Lazy Learned Screening for Efficient Recruitment.",
                    "On the Generalization Capabilities of Sharp Minima in Case-Based Reasoning.",
                    "CBR Confidence as a Basis for Confidence in Black Box Systems.",
                    "Probabilistic Selection of Case-Based Explanations in an Underwater Mine Clearance Domain.",
                    "A Data-Driven Approach for Determining Weights in Global Similarity Functions.",
                    "Personalized Case-Based Explanation of Matrix Factorization Recommendations.",
                    "How Case-Based Reasoning Explains Neural Networks: A Theoretical Analysis of XAI Using Post-Hoc Explanation-by-Example from a Survey of ANN-CBR Twin-Systems.",
                    "Predicting Grass Growth for Sustainable Dairy Farming: A CBR System Using Bayesian Case-Exclusion and Post-Hoc, Personalized Explanation-by-Example (XAI).",
                    "Learning Workflow Embeddings to Improve the Performance of Similarity-Based Retrieval for Process-Oriented Case-Based Reasoning.",
                    "On Combining Case Adaptation Rules.",
                    "Semantic Textual Similarity Measures for Case-Based Retrieval of Argument Graphs.",
                    "An Approach to Case-Based Reasoning Based on Local Enrichment of the Case Base.",
                    "Improving Analogical Extrapolation Using Case Pair Competence.",
                    "Towards Finding Flow in Tetris.",
                    "Scoring Performance on the Y-Balance Test.",
                    "An Optimal Case-Base Maintenance Method for Compositional Adaptation Applications.",
                    "Towards Human-Like Bots Using Online Interactive Case-Based Reasoning.",
                    "Show Me Your Friends, I'll Tell You Who You Are: Recommending Products Based on Hidden Evidence.",
                    "A Tale of Two Communities: An Analysis of Three Decades of Case-Based Reasoning Research.",
                    "Going Further with Cases: Using Case-Based Reasoning to Recommend Pacing Strategies for Ultra-Marathon Runners.",
                    "NOD-CC: A Hybrid CBR-CNN Architecture for Novel Object Discovery.",
                    "Adaptation of Scientific Workflows by Means of Process-Oriented Case-Based Reasoning."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2019w",
                "sub_name": "Workshops Proceedings for the Twenty-seventh International Conference on Case-Based Reasoning co-located with the Twenty-seventh International Conference on Case-Based Reasoning (ICCBR 2019), Otzenhausen, Germany, September 8-12, 2019.",
                "count": 31,
                "papers": [
                    "Workshop preface.",
                    "Human Activity Recognition with Deep Metric Learners.",
                    "A CBR-ANN hybrid for dynamic environments.",
                    "Representing Temporal Dependencies in Human Activity Recognition.",
                    "Seen the villains: Detecting Social Engineering Attacks using Case-based Reasoning and Deep Learning.",
                    "Workshop preface.",
                    "Recent Trends in XAI: A Broad Overview on current Approaches, Methodologies and Interactions.",
                    "Workshop preface.",
                    "Ontology-based transfer learning in the airport and warehouse logistics domains.",
                    "Service Switching in Case-based Decisions following Bad Experiences: Online reviews data of Japanese hairdressing salons.",
                    "Workshop preface.",
                    "Hypothyroid Disease Diagnosis with Causal Explanation using Case-based Reasoning and Domain-specific Ontology.",
                    "Improving Medical Coding with Case-Based Reasoning - Evaluation for Cancer Registries.",
                    "Case-based Reasoning for the Analysis of Methylation Data in Oncology.",
                    "Workshop preface.",
                    "SAFEWAY: An explainable context-aware recommender system for safe routes.",
                    "A Novel Interface for the Explanation of Group Recommendations using Augmented Reality.",
                    "Workshop preface.",
                    "Demonstrating the myCBR Rest API.",
                    "ProCAKE: A Process-Oriented Case-Based Reasoning Framework.",
                    "Workshop preface.",
                    "Dynamic Difficulty Adjustment in Video Games.",
                    "Visiting structural differences of explanations.",
                    "Autonomous Explainable Agents.",
                    "An IDSS to identify and implement actions to protect drinking water sources in land use planning: Exploration and use of knowledge and past experiences.",
                    "Employing Multi-Modal Sensors for Personalised Smart Home Health Monitoring.",
                    "Case-Base Maintenance Beyond Case Deletion.",
                    "Exploiting Relationship Among Cases to Make the Best Use of Users Feedback.",
                    "Constructing prototypes for classification using epigenetic and genetic analysis.",
                    "Interactive Assistance for Scientic Workflow Modeling by Case-Based Reasoning.",
                    "Activity Profiling and Phenotypes of Physical Activity and Sleep."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ICCBR 2018",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2018",
                "sub_name": "Case-Based Reasoning Research and Development - 26th International Conference, ICCBR 2018, Stockholm, Sweden, July 9-12, 2018, Proceedings.",
                "count": 40,
                "papers": [
                    "Adaptive Goal Driven Autonomy.",
                    "Answering with Cases: A CBR Approach to Deep Learning.",
                    "CEC-Model: A New Competence Model for CBR Systems Based on the Belief Function Theory.",
                    "The Case for Case Based Learning.",
                    "Case Based Reasoning as a Model for Cognitive Artificial Intelligence.",
                    "Explainable Distributed Case-Based Support Systems: Patterns for Enhancement and Validation of Design Recommendations.",
                    "Tangent Recognition and Anomaly Pruning to TRAP Off-Topic Questions in Conversational Case-Based Dialogues.",
                    "Combining Case-Based Reasoning with Complex Event Processing for Network Traffic Classification.",
                    "AI-VT: An Example of CBR that Generates a Variety of Solutions to the Same Problem.",
                    "A Textual Recommender System for Clinical Data.",
                    "Harnessing Hundreds of Millions of Cases: Case-Based Prediction at Industrial Scale.",
                    "Case Base Elicitation for a Context-Aware Recommender System.",
                    "The SECCO Ontology for the Retrieval and Generation of Security Concepts.",
                    "Exploration vs. Exploitation in Case-Base Maintenance: Leveraging Competence-Based Deletion with Ghost Cases.",
                    "Dynamic Detection of Radical Profiles in Social Networks Using Image Feature Descriptors and a Case-Based Reasoning Methodology.",
                    "Segmentation of Kidneys Deformed by Nephroblastoma Using Case-Based Reasoning.",
                    "FITsense: Employing Multi-modal Sensors in Smart Homes to Predict Falls.",
                    "Embedded Word Representations for Rich Indexing: A Case Study for Medical Records.",
                    "Case-Based Data Masking for Software Test Management.",
                    "A CBR Approach for Imitating Human Playing Style in Ms. Pac-Man Video Game.",
                    "Perks of Being Lazy: Boosting Retrieval Performance.",
                    "Bayesian-Supported Retrieval in BNCreek: A Knowledge-Intensive Case-Based Reasoning System.",
                    "Personalised Human Activity Recognition Using Matching Networks.",
                    "Why Did Naethan Pick Android over Apple? Exploiting Trade-offs in Learning User Preferences.",
                    "An Analysis of Case Representations for Marathon Race Prediction and Planning.",
                    "Dynamic Case Bases and the Asymmetrical Weighted One-Mode Projection.",
                    "Novel Object Discovery Using Case-Based Reasoning and Convolutional Neural Networks.",
                    "Modelling Similarity for Comparing Physical Activity Profiles - A Data-Driven Approach.",
                    "Investigating Textual Case-Based XAI.",
                    "Improving kNN for Human Activity Recognition with Privileged Learning Using Translation Models.",
                    "Considering Nutrients During the Generation of Recipes by Process-Oriented Case-Based Reasoning.",
                    "An Effective Method for Identifying Unknown Unknowns with Noisy Oracle.",
                    "On the Role of Similarity in Analogical Transfer.",
                    "Predicting Preferences by Means of Analogical Proportions.",
                    "A Fast Mapper as a Foundation for Forthcoming Conceptual Blending Experiments.",
                    "Production of Large Analogical Clusters from Smaller Example Seed Clusters Using Word Embeddings.",
                    "Case-Based Translation: First Steps from a Knowledge-Light Approach Based on Analogy to a Knowledge-Intensive One.",
                    "Making the Best of Cases by Approximation, Interpolation and Extrapolation.",
                    "Opening the Parallelogram: Considerations on Non-Euclidean Analogies.",
                    "Experiments in Learning to Solve Formal Analogical Equations."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ICCBR 2017",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2017",
                "sub_name": "Case-Based Reasoning Research and Development - 25th International Conference, ICCBR 2017, Trondheim, Norway, June 26-28, 2017, Proceedings.",
                "count": 29,
                "papers": [
                    "Encouraging Curiosity in Case-Based Reasoning and Recommender Systems.",
                    "Analogical Proportions and Analogical Reasoning - An Introduction.",
                    "A Hybrid CBR Approach for the Long Tail Problem in Recommender Systems.",
                    "Extending the Flexibility of Case-Based Design Support Tools: A Use Case in the Architectural Domain.",
                    "A Reasoning Model Based on Perennial Crop Allocation Cases and Rules.",
                    "A SPARQL Query Transformation Rule Language - Application to Retrieval and Adaptation in Case-Based Reasoning.",
                    "Similar Users or Similar Items? Comparing Similarity-Based Approaches for Recommender Systems in Online Judges.",
                    "Tetra: A Case-Based Decision Support System for Assisting Nuclear Physicians with Image Interpretation.",
                    "Case-Based Team Recognition Using Learned Opponent Models.",
                    "The Mechanism of Influence of a Case-Based Health Knowledge System on Hospital Management Systems.",
                    "Scaling Up Ensemble of Adaptations for Classification by Approximate Nearest Neighbor Retrieval.",
                    "A CBR System for Efficient Face Recognition Under Partial Occlusion.",
                    "Time Series and Case-Based Reasoning for an Intelligent Tetris Game.",
                    "Case-Based Reasoning for Inert Systems in Building Energy Management.",
                    "Semantic Trace Comparison at Multiple Levels of Abstraction.",
                    "On the Pros and Cons of Explanation-Based Ranking.",
                    "A User Controlled System for the Generation of Melodies Applying Case Based Reasoning.",
                    "Towards a Case-Based Reasoning Approach to Dynamic Adaptation for Large-Scale Distributed Systems.",
                    "Evolutionary Inspired Adaptation of Exercise Plans for Increasing Solution Variety.",
                    "Intelligent Control System for Back Pain Therapy.",
                    "Dependency Modeling for Knowledge Maintenance in Distributed CBR Systems.",
                    "Case-Based Recommendation for Online Judges Using Learning Itineraries.",
                    "kNN Sampling for Personalised Human Activity Recognition.",
                    "Case-Based Interpretation of Best Medical Coding Practices - Application to Data Collection for Cancer Registries.",
                    "Running with Cases: A CBR Approach to Running Your Best Marathon.",
                    "Weighted One Mode Projection of a Bipartite Graph as a Local Similarity Measure.",
                    "SCOUT: A Case-Based Reasoning Agent for Playing Race for the Galaxy.",
                    "Conversational Process-Oriented Case-Based Reasoning.",
                    "Maintenance for Case Streams: A Streaming Approach to Competence-Based Deletion."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2017w",
                "sub_name": "Proceedings of ICCBR 2017 Workshops (CAW, CBRDL, PO-CBR), Doctoral Consortium, and Competitions co-located with the 25th International Conference on Case-Based Reasoning (ICCBR 2017), Trondheim, Norway, June 26-28, 2017.",
                "count": 31,
                "papers": [
                    "A Study of the Saturation of Analogical Grids Agnostically Extracted from Texts.",
                    "Character-Position Arithmetic for Analogy Questions between Word Forms.",
                    "Analogical Localization: Flexible Plan Execution in Open Worlds.",
                    "Towards a Domain-Independent Method for Evaluating and Scoring Analogical Inferences.",
                    "A Complexity Based Approach for Solving Hofstadter's Analogies.",
                    "A Language of Case Differences.",
                    "A Discussion of Analogical-Proportion Based Inference.",
                    "A Convolutional Siamese Network for Developing Similarity Knowledge in the SelfBACK Dataset.",
                    "Learning Deep Features for kNN-Based Human Activity Recognition.",
                    "Data Driven Case Base Construction for Prediction of Success of Marine Operations.",
                    "Automatic Selection of Optimization Algorithms for Energy Resource Scheduling using a Case-Based Reasoning System.",
                    "A Workflow Cloud Management Framework with Process-Oriented Case-Based Reasoning.",
                    "Project EVER: Extraction and Processing of Procedural Experience Knowledge in Workflows.",
                    "Behavioural Analytics using Process Mining in On-line Advertising.",
                    "Case Representation and Similarity Assessment in a Recommender System to Support Dementia Caregivers in Geriatric and Palliative Care.",
                    "Recommendation System based on CBR algorithm for the Promotion of Healthier Habits.",
                    "A framework for Multi-level Trace Abstraction and Semantic Process Mining.",
                    "A Case-Based Real-Time Adaptive Engineer Site Support System.",
                    "Building an Integrated CBR-Big Data Oriented Architecture for Case-Based Reasoning Systems.",
                    "A Collaborative CBR Recommender System to Support Patients, its Relatives and Caregivers in Chronic and Palliative Care.",
                    "Case-Based Interpretation of Best Medical Coding Practices: Application to Data Collection for Cancer Registries.",
                    "Knowledge Transfer in Artificial Learning.",
                    "Exploiting Data to Support Operations of EXPOSED Aquaculture Installations.",
                    "Maintenance of Case Contents and Adaptation Rules.",
                    "AToM: An Analogical Theory of Mind.",
                    "Cooking Made Easy: On a Novel Approach to Complexity-Aware Recipe Generation.",
                    "Conversational Retrieval of Cooking Recipes.",
                    "A Proposed General Formula to Create and Analyze Baking Recipes.",
                    "Adaptation of TAAABLE to the CCC'2017 Mixology and Salad Challenges, Adaptation of the Cocktail Names.",
                    "Cooking On The Margins: Probabilistic Soft Logics for Recommending and Adapting Recipes.",
                    "IntelliMeal - Enhancing Creativity by Reusing Domain Knowledge in the Adaptation Process."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ICCBR 2016",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2016",
                "sub_name": "Case-Based Reasoning Research and Development - 24th International Conference, ICCBR 2016, Atlanta, GA, USA, October 31 - November 2, 2016, Proceedings.",
                "count": 29,
                "papers": [
                    "Searching Museum Routes Using CBR.",
                    "Comparative Evaluation of Rule-Based and Case-Based Retrieval Coordination for Search of Architectural Building Designs.",
                    "Case Representation and Similarity Assessment in the selfBACK Decision Support System.",
                    "Accessibility-Driven Cooking System.",
                    "Inferring Users' Critiquing Feedback on Recommendations from Eye Movements.",
                    "Eager to be Lazy: Towards a Complexity-guided Textual Case-Based Reasoning System.",
                    "Personalized Opinion-Based Recommendation.",
                    "Concept Discovery and Argument Bundles in the Experience Web.",
                    "Incorporating Transparency During Trust-Guided Behavior Adaptation.",
                    "Inferring Student Coding Goals Using Abstract Syntax Trees.",
                    "Combining CBR and Deep Learning to Generate Surprising Recipe Designs.",
                    "Qualitative Case-Based Reasoning for Humanoid Robot Soccer: A New Retrieval and Reuse Algorithm.",
                    "Ensemble of Adaptations for Classification: Learning Adaptation Rules for Categorical Features.",
                    "Similarity Metrics from Social Network Analysis for Content Recommender Systems.",
                    "Analogical Transfer in RDFS, Application to Cocktail Name Adaptation.",
                    "Adaptation-Guided Feature Deletion: Testing Recoverability to Guide Case Compression.",
                    "Applicability of Case-Based Reasoning for Selection of Cyanide-Free Gold Leaching Methods.",
                    "Competence Guided Casebase Maintenance for Compositional Adaptation Applications.",
                    "On the Transferability of Process-Oriented Cases.",
                    "Case Completion of Workflows for Process-Oriented Case-Based Reasoning.",
                    "Refinement-Based Similarity Measures for Directed Labeled Graphs.",
                    "FEATURE-TAK - Framework for Extraction, Analysis, and Transformation of Unstructured Textual Aircraft Knowledge.",
                    "Knowledge Extraction and Annotation for Cross-Domain Textual Case-Based Reasoning in Biologically Inspired Design.",
                    "Predicting the Electricity Consumption of Buildings: An Improved CBR Approach.",
                    "Case Representation and Retrieval Techniques for Neuroanatomical Connectivity Extraction from PubMed.",
                    "Compositional Adaptation of Explanations in Textual Case-Based Reasoning.",
                    "Relevance Matrix Generation Using Sensitivity Analysis in a Case-Based Reasoning Environment.",
                    "Combining Case-Based Reasoning and Reinforcement Learning for Tactical Unit Selection in Real-Time Strategy Game AI.",
                    "Defining the Initial Case-Base for a CBR Operator Support System in Digital Finishing - A Methodological Knowledge Acquisition Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2016w",
                "sub_name": "Workshops Proceedings for the Twenty-fourth International Conference on Case-Based Reasoning (ICCBR 2016), Atlanta, Georgia, USA, October 31 - November 2, 2016.",
                "count": 33,
                "papers": [
                    "Elements of a Data-Driven Approach to Adaptation.",
                    "Natural Language Instruction for Analogical Reasoning: An Initial Report.",
                    "Scaling up Analogy with Crowdsourcing and Machine Learning.",
                    "LDA v. LSA: A Comparison of Two Computational Text Analysis Tools for the Functional Categorization of Patents.",
                    "Morphological Predictability of Unseen Words Using Computational Analogy.",
                    "Abstraction for Analogical Reasoning in Robotic Agents.",
                    "Solving Analogical Equations Between Strings of Symbols Using Neural Networks.",
                    "Efficient Identification of Formal Analogies.",
                    "Reducing Noise Sensitivity of Formal Analogical Reasoning Applied to Language Transfers.",
                    "Analogies from Function, Flow and Performance Metrics.",
                    "Automatic Generation of Analogous Problems to Help Resolving Misconceptions in an Intelligent Tutor System for Written Subtraction.",
                    "Evaluating Distributed Methods for CBR Systems for Monitoring Business Process Workflows.",
                    "Exploiting Time Series Data for Task Prediction and Diagnosis in an Intelligent Guidance System.",
                    "Case Representation and Adaptation for Short-Term Load Forecasting at a Container Terminal.",
                    "Case-Based Comparison of Career Trajectories.",
                    "Diagnosing Root Causes and Generating Graphical Explanations by Integrating Temporal Causal Reasoning and CBR.",
                    "Challenges for the Similarity-Based Comparison of Human Physical Activities Using Time Series Data.",
                    "Evaluating Case-Based Reasoning Knowledge Discovery in Fraud Detection.",
                    "A Context-aware Miner for Medical Processes.",
                    "Goal Trajectories for Knowledge Investigations.",
                    "Learning a Region of User's Preference for Product Recommendation.",
                    "Case-Base Maintenance: A Streaming Approach.",
                    "Meal Planning from an Abstraction Hierarchy of Menus and Recipes.",
                    "Distributed Case-based Support for the Architectural Conceptualization Phase.",
                    "A Framework for Interactive Mining and Retrieval from Process Traces.",
                    "Short-Term Load Forecasting Methods for Maritime Container Terminals.",
                    "Knowledge Modelling and Comparison of Cyanide-free Gold Leaching Processes - Research Summary.",
                    "Episodic Memory in a Cognitive Model.",
                    "Workflow Modelling Assistance by Means of Process-oriented Case-based Reasoning.",
                    "Prediction and Explanation by Combined Model-Based and Case-Based Reasoning.",
                    "Similarity-based Approaches to Learning from Demonstration.",
                    "Feature-Centric Approaches to Case-Base Maintenance.",
                    "Automated Similarity Modeling for Real-World Applications."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ICCBR 2015",
        "info": "Frankfurt am Main, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2015",
                "sub_name": "Case-Based Reasoning Research and Development - 23rd International Conference, ICCBR 2015, Frankfurt am Main, Germany, September 28-30, 2015, Proceedings.",
                "count": 26,
                "papers": [
                    "Case Base Maintenance in Preference-Based CBR.",
                    "Learning to Estimate: A Case-Based Approach to Task Execution Prediction.",
                    "Case-Based Policy and Goal Recognition.",
                    "Adapting Sentiments with Context.",
                    "Aspect Selection for Social Recommender Systems.",
                    "Music Recommendation: Audio Neighbourhoods to Discover Music in the Long Tail.",
                    "Goal-Driven Autonomy with Semantically-Annotated Hierarchical Cases.",
                    "Evaluating a Textual Adaptation System.",
                    "Visual Case Retrieval for Interpreting Skill Demonstrations.",
                    "Improving Trust-Guided Behavior Adaptation Using Operator Feedback.",
                    "Top-Down Induction of Similarity Measures Using Similarity Clouds.",
                    "Improving Case Retrieval Using Typicality.",
                    "CBR Meets Big Data: A Case Study of Large-Scale Adaptation Rule Generation.",
                    "Addressing the Cold-Start Problem in Facial Expression Recognition.",
                    "Flexible Feature Deletion: Compacting Case Bases by Selectively Compressing Case Contents.",
                    "A Case-Based Approach for Easing Schema Semantic Mapping.",
                    "Great Explanations: Opinionated Explanations for Recommendations.",
                    "Learning and Applying Adaptation Operators in Process-Oriented Case-Based Reasoning.",
                    "Fault Diagnosis via Fusion of Information from a Case Stream.",
                    "Argument-Based Case Revision in CBR for Story Generation.",
                    "CBR Model for Predicting a Building's Electricity Use: On-Line Implementation in the Absence of Historical Data.",
                    "Modelling Hierarchical Relationships in Group Recommender Systems.",
                    "Semi-automatic Knowledge Extraction from Semi-structured and Unstructured Data Within the OMAHA Project.",
                    "Evidence-Driven Retrieval in Textual CBR: Bridging the Gap Between Retrieval and Reuse.",
                    "Maintaining and Analyzing Production Process Definitions Using a Tree-Based Similarity Measure.",
                    "Case-Based Plan Recognition Under Imperfect Observability."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2015w",
                "sub_name": "Workshop Proceedings from The Twenty-Third International Conference on Case-Based Reasoning (ICCBR 2015), Frankfurt, Germany, September 28-30, 2015.",
                "count": 36,
                "papers": [
                    "I Know What You're Doing: A Case Study on Case-Based Opponent Modeling and Low-Level Action Prediction.",
                    "Case-based Local and Global Percept Processing for Rebel Agents.",
                    "Predicting the Outcome of Small Battles in StarCraft.",
                    "Multi-Agent Case-Based Diagnosis in the Aircraft Domain.",
                    "A Case-Based Framework for Task Demonstration Storage and Adaptation.",
                    "Case Based Disruption Monitoring.",
                    "A CBR Approach to the Angry Birds Game.",
                    "Flexible Plan-Subplan Matching for Plan Recognition in Case-Based Agents.",
                    "Automated Blend Naming Based on Human Creativity Examples.",
                    "Generating Plots for a Given Query Using a Case-Base of Narrative Schemas.",
                    "Seeking Divisions of Domains on Semantic Networks by Evolutionary Bridging.",
                    "Case-Based Slogan Production.",
                    "Conceptual Blending in Case Adaptation.",
                    "Calibrating a Metric for Similarity of Stories against Human Judgement.",
                    "Creative Systems as Dynamical Systems.",
                    "Schematic Processing as a Framework for Learning and Creativity in CBR and CC.",
                    "Generation of Concept-Representative Symbols.",
                    "Trace Retrieval as a Tool for Operational Support in Medical Process Management.",
                    "Case-Based Reasoning as a Prelude to Big Data Analysis: A Case Study.",
                    "Data Mining Methods for Case-Based Reasoning in Health Sciences.",
                    "Why Hybrid Case-Based Reasoning Will Change the Future of Health Science and Healthcare.",
                    "Improving Ingredient Substitution using Formal Concept Analysis and Adaptation of Ingredient Quantities with Mixed Linear Optimization.",
                    "CookingCAKE: A Framework for the Adaptation of Cooking Recipes Represented as Workflows.",
                    "CooCo, What Can I Cook Today? Surprise Me.",
                    "Enriching Cooking Workflows with Multimedia Data from a High Security Cloud Storage.",
                    "Distributed Case-based Support for the Architectural Conceptualization Phase.",
                    "Interactively Learning Moral Norms via Analogy.",
                    "Support to Continuous Improvement Process in Manufacturing Plants of Multinational Companies through Problem Solving Methods and Case-Based Reasoning Integrated within a Product Lifecycle Management Infrastructure.",
                    "Aspect-based Sentiment Analysis for Social Recommender System.",
                    "Toward a Case-Based Framework for Imitation Learning in Robotic Agents.",
                    "Virtuosity in Computational Performance.",
                    "System to Design Context-Aware Social Recommender Systems.",
                    "Experience-Based Recommendation for a Personalised e-Learning System.",
                    "Workflow Adaptation in Process-oriented Case-based Reasoning.",
                    "Opinionated Explanations of Recommendations from Product Reviews.",
                    "Integrated Maintenance with Case Factories for Distributed Case-Based Reasoning Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ICCBR 2014",
        "info": "Cork, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2014",
                "sub_name": "Case-Based Reasoning Research and Development - 22nd International Conference, ICCBR 2014, Cork, Ireland, September 29, 2014 - October 1, 2014. Proceedings.",
                "count": 37,
                "papers": [
                    "What I Talk about When I Talk about CBR.",
                    "Running with Scissors: Cut-Ups, Boundary Friction and Creative Reuse.",
                    "Learning Solution Similarity in Preference-Based CBR.",
                    "Case-Based Parameter Selection for Plans: Coordinating Autonomous Vehicle Teams.",
                    "Automatic Case Capturing for Problematic Drilling Situations.",
                    "Algorithm for Adapting Cases Represented in a Tractable Description Logic.",
                    "Sentiment and Preference Guided Social Recommendation.",
                    "A Hybrid CBR-ANN Approach to the Appraisal of Internet Domain Names.",
                    "Further Experiments in Opinionated Product Recommendation.",
                    "How Much Do You Trust Me? Learning a Case-Based Model of Inverse Trust.",
                    "Tuuurbine: A Generic CBR Engine over RDFS.",
                    "How Case-Based Reasoning on e-Community Knowledge Can Be Improved Thanks to Knowledge Reliability.",
                    "Case-Based Object Placement Planning.",
                    "On the Role of Analogy in Resolving Cognitive Dissonance in Collaborative Interdisciplinary Design.",
                    "On Retention of Adaptation Rules.",
                    "Case-Based Reasoning for Improving Traffic Flow in Urban Intersections.",
                    "Estimating Case Base Complexity Using Fractal Dimension.",
                    "CBR Tagging of Emotions from Facial Expressions.",
                    "A Proposal of Temporal Case-Base Maintenance Algorithms.",
                    "Using Case-Based Reasoning to Detect Risk Scenarios of Elderly People Living Alone at Home.",
                    "An Algorithm for Conversational Case-Based Reasoning in Classification Tasks.",
                    "Towards Process-Oriented Cloud Management with Case-Based Reasoning.",
                    "Workflow Streams: A Means for Compositional Adaptation in Process-Oriented CBR.",
                    "Collective Classification of Posts to Internet Forums.",
                    "NudgeAlong: A Case Based Approach to Changing User Behaviour.",
                    "Explaining Probabilistic Fault Diagnosis and Classification Using Case-Based Reasoning.",
                    "Case-Based Prediction of Teen Driver Behavior and Skill.",
                    "Adapting Propositional Cases Based on Tableaux Repairs Using Adaptation Knowledge.",
                    "Least Common Subsumer Trees for Plan Retrieval.",
                    "Supervised Semantic Indexing Using Sub-spacing.",
                    "Estimation of Machine Settings for Spinning of Yarns - New Algorithms for Comparing Complex Structures.",
                    "Linking Cases Up: An Extension to the Case Retrieval Network.",
                    "Acquisition and Reuse of Reasoning Knowledge from Textual Cases for Automated Analysis.",
                    "Enriching Case Descriptions Using Trails in Conversational Recommenders.",
                    "Case-Based Plan Recognition Using Action Sequence Graphs.",
                    "Combining Case-Based Reasoning and Reinforcement Learning for Unit Navigation in Real-Time Strategy Game AI.",
                    "Exploring the Space of Whole-Group Case Retrieval in Making Group Recommendations."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ICCBR 2013",
        "info": "Saratoga Springs, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2013",
                "sub_name": "Case-Based Reasoning Research and Development - 21st International Conference, ICCBR 2013, Saratoga Springs, NY, USA, July 8-11, 2013. Proceedings.",
                "count": 26,
                "papers": [
                    "Preference-Based CBR: A Search-Based Problem Solving Framework.",
                    "Applying MapReduce to Learning User Preferences in Near Real-Time.",
                    "Case-Based Goal Selection Inspired by IBM's Watson.",
                    "Opinionated Product Recommendation.",
                    "Mining Features and Sentiment from Review Experiences.",
                    "Multi-Agent, Multi-Case-Based Reasoning.",
                    "Case-Based Learning of Applicability Conditions for Stochastic Explanations.",
                    "Case-Based Reasoning on E-Community Knowledge.",
                    "On the Plan-Library Maintenance Problem in a Case-Based Planner.",
                    "Learning Feature Weights from Positive Cases.",
                    "User Perceptions of Relevance and Its Effect on Retrieval in a Smart Textile Archive.",
                    "Case-Based Goal-Driven Coordination of Multiple Learning Agents.",
                    "On Deriving Adaptation Rule Confidence from the Rule Generation Process.",
                    "Extending Case Adaptation with Automatically-Generated Ensembles of Adaptation Rules.",
                    "iCaseViz: Learning Case Similarities through Interaction with a Case Base Visualizer.",
                    "A Multi-Objective Evolutionary Algorithm Fitness Function for Case-Base Maintenance.",
                    "Mining and Retrieving Medical Processes to Assess the Quality of Care.",
                    "Leveraging Historical Experience to Evaluate and Adapt Courses of Action.",
                    "The COLIBRI Open Platform for the Reproducibility of CBR Applications.",
                    "Refinement-Based Similarity Measure over DL Conjunctive Queries.",
                    "Should Term-Relatedness Be Used in Text Representation?",
                    "Recommending Audio Mixing Workflows.",
                    "An Agent Based Framework for Multiple, Heterogeneous Case Based Reasoning.",
                    "Learning-Based Adaptation for Personalized Mobility Assistance.",
                    "Biological Solutions for Engineering Problems: A Study in Cross-Domain Textual Case-Based Reasoning.",
                    "Similarity Measures to Compare Episodes in Modeled Traces."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ICCBR 2012",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2012",
                "sub_name": "Case-Based Reasoning Research and Development - 20th International Conference, ICCBR 2012, Lyon, France, September 3-6, 2012. Proceedings.",
                "count": 34,
                "papers": [
                    "Case-Based Reasoning and Expert Systems.",
                    "Reproducibility and Efficiency of Scientific Data Analysis: Scientific Workflows and Case-Based Reasoning.",
                    "A Computer Aided System for Post-operative Pain Treatment Combining Knowledge Discovery and Case-Based Reasoning.",
                    "Developing Case-Based Reasoning Applications Using myCBR 3.",
                    "Diverse Plan Generation by Plan Adaptation and by First-Principles Planning: A Comparative Study.",
                    "Case-Based Appraisal of Internet Domains.",
                    "Harnessing the Experience Web to Support User-Generated Product Reviews.",
                    "Adapting Spatial and Temporal Cases.",
                    "eCo: Managing a Library of Reusable Behaviours.",
                    "Toward Measuring the Similarity of Complex Event Sequences in Real-Time.",
                    "Case-Based Project Scheduling.",
                    "Adapting Numerical Representations of Lung Contours Using Case-Based Reasoning and Artificial Neural Networks.",
                    "Adaptation in a CBR-Based Solver Portfolio for the Satisfiability Problem.",
                    "A Local Rule-Based Attribute Weighting Scheme for a Case-Based Reasoning System for Radiotherapy Treatment Planning.",
                    "Learning and Reusing Goal-Specific Policies for Goal-Driven Autonomy.",
                    "Custom Accessibility-Based CCBR Question Selection by Ongoing User Classification.",
                    "Feature Weighting and Confidence Based Prediction for Case Based Reasoning Systems.",
                    "A Case-Based Approach to Mutual Adaptation of Taxonomic Ontologies.",
                    "A Lazy Learning Approach to Explaining Case-Based Reasoning Solutions.",
                    "Confidence in Workflow Adaptation.",
                    "Retrieval and Clustering for Business Process Monitoring: Results and Improvements.",
                    "A Case-Based Approach to Cross Domain Sentiment Classification.",
                    "GENA: A Case-Based Approach to the Generation of Audio-Visual Narratives.",
                    "On Knowledge Transfer in Case-Based Inference.",
                    "Case-Based Aggregation of Preferences for Group Recommenders.",
                    "A Case-Based Solution to the Cold-Start Problem in Group Recommenders.",
                    "Opponent Type Adaptation for Case-Based Strategies in Adversarial Games.",
                    "Exploiting Extended Search Sessions for Recommending Search Experiences in the Social Web.",
                    "Event Extraction for Reasoning with Text.",
                    "Explanation-Aware Design of Mobile myCBR-Based Applications.",
                    "A Competitive Measure to Assess the Similarity between Two Time Series.",
                    "Case-Based Reasoning Applied to Textile Industry Processes.",
                    "Natural Language Generation through Case-Based Text Modification.",
                    "Case-Based Reasoning for Turbine Trip Diagnostics."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ICCBR 2011",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2011",
                "sub_name": "Case-Based Reasoning Research and Development - 19th International Conference on Case-Based Reasoning, ICCBR 2011, London, UK, September 12-15, 2011. Proceedings.",
                "count": 35,
                "papers": [
                    "Reasoning as Search: Supporting Reasoning with Distributed Memory.",
                    "Structure Mapping for Jeopardy! Clues.",
                    "Ontologies and Similarity.",
                    "Retrieval of Semantic Workflows with Knowledge Intensive Similarity Measures.",
                    "Qualitative vs. Quantitative Plan Diversity in Case-Based Planning.",
                    "On Dataset Complexity for Case Base Maintenance.",
                    "Improving Case Retrieval by Enrichment of the Domain Ontology.",
                    "Preference-Based CBR: First Steps toward a Methodological Framework.",
                    "How Many Cases Do You Need? Assessing and Predicting Case-Base Coverage.",
                    "A Case-Based Approach to Open-Ended Collective Agreement with Rational Ignorance.",
                    "Amalgam-Based Reuse for Multiagent Case-Based Reasoning.",
                    "The 4 Diabetes Support System: A Case Study in CBR Research and Development.",
                    "Learning More from Experience in Case-Based Reasoning.",
                    "Acquiring Adaptation Cases for Scientific Workflows.",
                    "Combining Expert Knowledge and Learning from Demonstration in Real-Time Strategy Games.",
                    "Selective Integration of Background Knowledge in TCBR Systems.",
                    "User Satisfaction in Long Term Group Recommendations.",
                    "Using Personality to Create Alliances in Group Recommender Systems.",
                    "Analogy-Making for Solving IQ Tests: A Logical View.",
                    "Using Case-Based Tests to Detect Gray Cygnets.",
                    "Recommending Case Bases: Applications in Social Web Search.",
                    "Measuring Similarity in Description Logics Using Refinement Operators.",
                    "Term Similarity and Weighting Framework for Text Representation.",
                    "Fast Subgraph Isomorphism Detection for Graph-Based Retrieval.",
                    "Representation, Indexing, and Retrieval of Biological Cases for Biologically Inspired Design.",
                    "Ontology-Aided Product Classification: A Nearest Neighbour Approach.",
                    "A Case-Based Reasoning Approach for Providing Machine Diagnosis from Service Reports.",
                    "CBR with Commonsense Reasoning and Structure Mapping: An Application to Mediation.",
                    "Comparison of Reuse Strategies for Case-Based Classification in Bioinformatics.",
                    "Integration of Sequence Learning and CBR for Complex Equipment Failure Prediction.",
                    "Time Series Case Based Reasoning for Image Categorisation.",
                    "CBRSHM - A Case-Based Decision Support System for Semi-Automated Assessment of Structures in Terms of Structural Health Monitoring.",
                    "A Case Base Planning Approach for Dialogue Generation in Digital Movie Design.",
                    "Successful Performance via Decision Generalisation in No Limit Texas Hold'em.",
                    "Rule-Based Impact Propagation for Trace Replay."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "9. ICCBR 2010",
        "info": "Alessandria, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2010",
                "sub_name": "Case-Based Reasoning. Research and Development, 18th International Conference on Case-Based Reasoning, ICCBR 2010, Alessandria, Italy, July 19-22, 2010. Proceedings.",
                "count": 38,
                "papers": [
                    "Translational Bioinformatics: Challenges and Opportunities for Case-Based Reasoning and Decision Support.",
                    "Why and How Knowledge Discovery Can Be Useful for Solving Problems with CBR.",
                    "Real-Time Case-Based Reasoning for Interactive Digital Entertainment.",
                    "Applying Machine Translation Evaluation Techniques to Textual CBR.",
                    "Intelligent Data Interpretation and Case Base Exploration through Temporal Abstractions.",
                    "An Algorithm for Adapting Cases Represented in an Expressive Description Logic.",
                    "Case-Based Plan Diversity.",
                    "Reducing the Memory Footprint of Temporal Difference Learning over Finitely Many States by Using Case-Based Generalization.",
                    "Text Adaptation Using Formal Concept Analysis.",
                    "Visualization for the Masses: Learning from the Experts.",
                    "Imitating Inscrutable Enemies: Learning from Stochastic Policy Observation, Retrieval and Reuse.",
                    "The Utility Problem for Lazy Learners - Towards a Non-eager Approach.",
                    "EGAL: Exploration Guided Active Learning for TCBR.",
                    "Introspective Knowledge Revision in Textual Case-Based Reasoning.",
                    "A General Introspective Reasoning Approach to Web Search for Case Adaptation.",
                    "Detecting Change via Competence Model.",
                    "CBTV: Visualising Case Bases for Similarity Measure Design and Selection.",
                    "Goal-Driven Autonomy with Case-Based Reasoning.",
                    "Case Retrieval with Combined Adaptability and Similarity Criteria: Application to Case Retrieval Nets.",
                    "Amalgams: A Formal Approach for Combining Multiple Case Solutions.",
                    "Recognition of Higher-Order Relations among Features in Textual Cases Using Random Indexing.",
                    "Extending CBR with Multiple Knowledge Sources from Web.",
                    "Taxonomic Semantic Indexing for Textual Case-Based Reasoning.",
                    "A Case for Folk Arguments in Case-Based Reasoning.",
                    "Reexamination of CBR Hypothesis.",
                    "Case Based Reasoning with Bayesian Model Averaging: An Improved Method for Survival Analysis on Microarray Data.",
                    "User Trace-Based Recommendation System for a Digital Archive.",
                    "On-the-Fly Adaptive Planning for Game-Based Learning.",
                    "A Case Based Reasoning Approach for the Monitoring of Business Workflows.",
                    "A Case-Based Reasoning Approach to Automating the Construction of Multiple Choice Questions.",
                    "Towards Case-Based Adaptation of Workflows.",
                    "A Method Based on Query Caching and Predicate Substitution for the Treatment of Failing Database Queries.",
                    "Case Acquisition from Text: Ontology-Based Information Extraction with SCOOBIE for myCBR.",
                    "Similarity-Based Retrieval and Solution Re-use Policies in the Game of Texas Hold'em.",
                    "Experience-Based Critiquing: Reusing Critiquing Experiences to Improve Conversational Recommendation.",
                    "Improving Pervasive Application Behavior Using Other Users' Information.",
                    "a.SCatch: Semantic Structure for Architectural Floor Plan Retrieval.",
                    "Runtime Estimation Using the Case-Based Reasoning Approach for Scheduling in a Grid Environment."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "8. ICCBR 2009",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2009",
                "sub_name": "Case-Based Reasoning Research and Development, 8th International Conference on Case-Based Reasoning, ICCBR 2009, Seattle, WA, USA, July 20-23, 2009, Proceedings.",
                "count": 36,
                "papers": [
                    "We're Wiser Together.",
                    "Black Swans, Gray Cygnets and Other Rare Birds.",
                    "Case Retrieval Reuse Net (CR2N): An Architecture for Reuse of Textual Solutions.",
                    "Case-Based Reasoning in Transfer Learning.",
                    "Toward Modeling and Teaching Legal Case-Based Adaptation with Expert Examples.",
                    "Opportunistic Adaptation Knowledge Discovery.",
                    "Improving Reinforcement Learning by Using Case Based Heuristics.",
                    "Dimensions of Case-Based Reasoner Quality Management.",
                    "Belief Merging-Based Case Combination.",
                    "Maintenance by a Committee of Experts: The MACE Approach to Case-Base Maintenance.",
                    "The Good, the Bad and the Incorrectly Classified: Profiling Cases for Case-Base Editing.",
                    "An Active Approach to Automatic Case Generation.",
                    "Four Heads Are Better than One: Combining Suggestions for Case Adaptation.",
                    "Adaptation versus Retrieval Trade-Off Revisited: An Analysis of Boundary Conditions.",
                    "Boosting CBR Agents with Genetic Algorithms.",
                    "Using Meta-reasoning to Improve the Performance of Case-Based Planning.",
                    "Multi-level Abstractions and Multi-dimensional Retrieval of Cases with Time Series Features.",
                    "On Similarity Measures Based on a Refinement Lattice.",
                    "An Overview of the Deterministic Dynamic Associative Memory (DDAM) Model for Case Representation and Retrieval.",
                    "Robust Measures of Complexity in TCBR.",
                    "S-Learning: A Model-Free, Case-Based Algorithm for Robot Learning and Control.",
                    "Quality Enhancement Based on Reinforcement Learning and Feature Weighting for a Critiquing-Based Recommender.",
                    "Abstraction in Knowledge-Rich Models for Case-Based Planning.",
                    "A Scalable Noise Reduction Technique for Large Case-Based Systems.",
                    "Conceptual Neighborhoods for Retrieval in Case-Based Reasoning.",
                    "CBR Supports Decision Analysis with Uncertainty.",
                    "Constraint-Based Case-Based Planning Using Weighted MAX-SAT.",
                    "A Value Supplementation Method for Case Bases with Incomplete Information.",
                    "Efficiently Implementing Episodic Memory.",
                    "Integration of a Methodology for Cluster-Based Retrieval in jColibri.",
                    "Case-Based Collective Inference for Maritime Object Classification.",
                    "Case-Based Reasoning for Situation-Aware Ambient Intelligence: A Hospital Ward Evaluation Study.",
                    "Spatial Event Prediction by Combining Value Function Approximation and Case-Based Reasoning.",
                    "Case-Based Support for Forestry Decisions: How to See the Wood from the Trees.",
                    "A Case-Based Perspective on Social Web Search.",
                    "Determining Root Causes of Drilling Problems by Combining Cases and General Knowledge."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7. ICCBR 2007",
        "info": "Belfast, Northern Ireland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2007",
                "sub_name": "Case-Based Reasoning Research and Development, 7th International Conference on Case-Based Reasoning, ICCBR 2007, Belfast, Northern Ireland, UK, August 13-16, 2007, Proceedings.",
                "count": 36,
                "papers": [
                    "Cases in Robotic Soccer.",
                    "A Case-Based Framework for Collaborative Semantic Search in Knowledge Sifter.",
                    "Usages of Generalization in Case-Based Reasoning.",
                    "Team Playing Behavior in Robot Soccer: A Case-Based Reasoning Approach.",
                    "Acquiring Word Similarities with Higher Order Association Mining.",
                    "Label Ranking in Case-Based Reasoning.",
                    "When Similar Problems Don't Have Similar Solutions.",
                    "Mixed-Initiative Relaxation of Constraints in Critiquing Dialogues.",
                    "A Methodology for Analyzing Case Retrieval from a Clustered Case Memory.",
                    "Using Cases Utility for Heuristic Planning Improvement.",
                    "Case-Based Reasoning Adaptation for High Dimensional Solution Space.",
                    "Case-Based Planning and Execution for Real-Time Strategy Games.",
                    "Case Authoring: From Textual Reports to Knowledge-Rich Cases.",
                    "Case Provenance: The Value of Remembering Case Sources.",
                    "Mining Large-Scale Knowledge Sources for Case Adaptation Knowledge.",
                    "Representation and Structure-Based Similarity Assessment for Agile Workflows.",
                    "Application of the Revision Theory to Adaptation in Case-Based Reasoning: The Conservative Adaptation.",
                    "Methodological Assistance for Integrating Data Quality Evaluations into Case-Based Reasoning Systems.",
                    "Case-Based Anomaly Detection.",
                    "Case-Based Reasoning in Robot Indoor Navigation.",
                    "Case-Based Group Recommendation: Compromising for Success.",
                    "Catching the Drift: Using Feature-Free Case-Based Reasoning for Spam Filtering.",
                    "Enhancing Case-Based, Collaborative Web Search.",
                    "An Analysis of Case-Based Value Function Approximation by Approximating State Transition Graphs.",
                    "From Anomaly Reports to Cases.",
                    "Assessing Classification Accuracy in the Revision Stage of a CBR Spam Filtering System.",
                    "Intelligent Guidance and Suggestions Using Case-Based Planning.",
                    "Case-Based Reasoning for Invoice Analysis and Recognition.",
                    "Watershed Segmentation Via Case-Based Reasoning.",
                    "A Case-Based Song Scheduler for Group Customised Radio.",
                    "Helping Software Engineers Reusing UML Class Diagrams.",
                    "Failure Analysis for Domain Knowledge Acquisition in a Knowledge-Intensive CBR System.",
                    "Classify and Diagnose Individual Stress Using Calibration and Fuzzy Case-Based Reasoning.",
                    "Prototypical Cases for Knowledge Maintenance in Biomedical CBR.",
                    "Case-Based Support for Library Reference Services.",
                    "Knowledge Extraction and Summarization for an Application of Textual Case-Based Interpretation."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2007cacoa",
                "sub_name": "Proceedings of the 2nd International Workshop on Case Based Reasoning and Context-Awareness Colocated with the 7th International Conference on Case Based Reasoning (ICCBR), Belfast, Northern Ireland, August 15, 2007.",
                "count": 4,
                "papers": [
                    "Preface.",
                    "Explanations and Case-Based Reasoning in Ambient Intelligent Systems.",
                    "Implicit Profiling for Contextual Reasoning About Users' Spatial Preferences.",
                    "The Role of Context Models in Association with Flexible Design Processes - Position Paper."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6. ICCBR 2005",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2005",
                "sub_name": "Case-Based Reasoning, Research and Development, 6th International Conference, on Case-Based Reasoning, ICCBR 2005, Chicago, IL, USA, August 23-26, 2005, Proceedings.",
                "count": 48,
                "papers": [
                    "The Virtue of Reward: Performance, Reinforcement and Discovery in Case-Based Reasoning.",
                    "Learning to Optimize Plan Execution in Information Agents.",
                    "Cased-Based Reasoning by Human Experts.",
                    "Learning to Win: Case-Based Plan Selection in a Real-Time Strategy Game.",
                    "An Ensemble of Case-Based Classifiers for High-Dimensional Biological Domains.",
                    "Language Games: Solving the Vocabulary Problem in Multi-Case-Base Reasoning.",
                    "Evaluation and Monitoring of the Air-Sea Interaction Using a CBR-Agents Approach.",
                    "A Comparative Analysis of Query Similarity Metrics for Community-Based Web Search.",
                    "A Case-Based Approach for Indoor Location.",
                    "P2P Case Retrieval with an Unspecified Ontology.",
                    "Autonomous Internal Control System for Small to Medium Firms.",
                    "The Application of a Case-Based Reasoning System to Attention-Deficit Hyperactivity Disorder.",
                    "Reasoning with Textual Cases.",
                    "Using Ensembles of Binary Case-Based Reasoners.",
                    "Transfer in Visual Case-Based Problem Solving.",
                    "Generating Estimates of Classification Confidence for a Case-Based Spam Filter.",
                    "Improving Gene Selection in Microarray Data Analysis Using Fuzzy Patterns Inside a CBR System.",
                    "CBR for State Value Function Approximation in Reinforcement Learning.",
                    "Using CBR to Select Solution Strategies in Constraint Programming.",
                    "Case-Based Art.",
                    "Supporting Conversation Variability in COBBER Using Causal Loops.",
                    "Opportunities for CBR in Learning by Doing.",
                    "Navigating Through Case Base Competence.",
                    "A Knowledge-Intensive Method for Conversational CBR.",
                    "Re-using Implicit Knowledge in Short-Term Information Profiles for Context-Sensitive Tasks.",
                    "Acquiring Similarity Cases for Classification Problems.",
                    "A Live-User Evaluation of Incremental Dynamic Critiquing.",
                    "Case Based Representation and Retrieval with Time Dependent Features.",
                    "The Best Way to Instil Confidence Is by Being Right.",
                    "Cooperative Reuse for Compositional Cases in Multi-agent Systems.",
                    "Evaluating the Effectiveness of Exploration and Accumulated Experience in Automatic Case Elicitation.",
                    "HYREC: A Hybrid Recommendation System for E-Commerce.",
                    "Extending jCOLIBRI for Textual CBR.",
                    "Critiquing with Confidence.",
                    "Mapping Goals and Kinds of Explanations to the Knowledge Containers of Case-Based Reasoning Systems.",
                    "An Approach for Temporal Case-Based Reasoning: Episode-Based Reasoning.",
                    "How to Combine CBR and RBR for Diagnosing Multiple Medical Disorder Cases.",
                    "Case-Based Student Modeling Using Concept Maps.",
                    "Learning Similarity Measures: A Formal View Based on a Generalized CBR Model.",
                    "Knowledge-Rich Similarity-Based Classification.",
                    "Autonomous Creation of New Situation Cases in Structured Continuous Domains.",
                    "Retrieval and Configuration of Life Insurance Policies.",
                    "Analogical and Case-Based Reasoning for Predicting Satellite Task Schedulability.",
                    "Case Adaptation by Segment Replanning for Case-Based Planning Systems.",
                    "Selecting the Best Units in a Fleet: Performance Prediction from Equipment Peers.",
                    "CCBR-Driven Business Process Evolution.",
                    "CBR for Modeling Complex Systems.",
                    "CBE-Conveyor: A Case-Based Reasoning System to Assist Engineers in Designing Conveyor Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/2005w",
                "sub_name": "6th International Conference on Case-Based Reasoning, ICCBR 2005, Chicago, IL, USA, August 23-26, 2005, Workshop Proceedings.",
                "count": 29,
                "papers": [
                    "A Case-Based Approach Using Behavioural Biometrics to Determine a User's Stress Level.",
                    "Memory Organization as the Missing Link between Case Based Reasoning and Information Retrieval in Biomedicine.",
                    "An Evaluation of the Usefulness of Explanation in a CBR System for Decision-Support in Bronchiolitis Treatment.",
                    "Knowledge Discovery and Case Based Reasoning in Medical Applications with Time Series.",
                    "Learning of general cases.",
                    "Knowledge Intensive Case Based Support for Automated Explanation of Biological Phenomena.",
                    "Detecting Breaths in Capnography Time Series.",
                    "Memory-based understanding of user utterances in a spoken dialogue system: Effects of Feature selection and co-learning.",
                    "Generative Sublanguage Ontologies for Textual CBR.",
                    "SOPHIA: A textual CBR perspective.",
                    "Learning Semantic Annotations for Textual Cases.",
                    "Textual Feature Construction from Keywords.",
                    "The Role of Syntactic Analysis in Textual Case Retrieval.",
                    "Learning and Linking Textual Cases.",
                    "A Low-Effort, Collaborative Maintenance Model for Textual CBR.",
                    "Identifying Facts for TCBR.",
                    "Advertising Strategies: Learning Competence through Cooperative Game Playing.",
                    "Game-Based Learning as a New Domain for Case-Based Reasoning.",
                    "On the Effectiveness of Automatic Case Elicitation in a More Complex Domain.",
                    "Combining Case-Based Memory with Genetic Algorithm Search for Competent Game AI.",
                    "Evaluating Case-Based Systems in Virtual Games.",
                    "A CBR Module for a Strategy Videogame.",
                    "Abstracting Reusable Cases from Reinforcement Learning.",
                    "CBR Support for Semi-Structured Product Development Processes as an Element of Knowledge Oriented Management.",
                    "Fuzzy-Set-Based Modeling of Business Process Cases.",
                    "A Similarity Measure for Task Contexts.",
                    "CBR-based Execution and Planning Support for Collaborative Workflows.",
                    "Using Casual Knowledge in Case Based Reasoning about Dynamic Processes.",
                    "Identifying Process Similarities in Cooperative Workflows - A Case Study from Urban Planning."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5. ICCBR 2003",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2003",
                "sub_name": "Case-Based Reasoning Research and Development, 5th International Conference on Case-Based Reasoning, ICCBR 2003, Trondheim, Norway, June 23-26, 2003, Proceedings.",
                "count": 54,
                "papers": [
                    "Human-Centered CBR: Integrating Case-Based Reasoning with Knowledge Construction and Extension.",
                    "On the Role of the Cases in Case-Based Planning.",
                    "From Manual Knowledge Engineering to Bootstrapping: Progress in Information Extraction and NLP.",
                    "SOFT-CBR: A Self-Optimizing Fuzzy Tool for Case-Based Reasoning.",
                    "Extracting Performers' Behaviors to Annotate Cases in a CBR System for Musical Tempo Transformations.",
                    "Case-Based Ranking for Decision Support Systems.",
                    "Analogical Reasoning for Reuse of Object-Oriented Specifications.",
                    "Combining Case-Based and Model-Based Reasoning for Predicting the Outcome of Legal Cases.",
                    "Measuring the Similarity of Labeled Graphs.",
                    "Global Grade Selector: A Recommender System for Supporting the Sale of Plastic Resin.",
                    "Maximum Likelihood Hebbian Learning Based Retrieval Method for CBR Systems.",
                    "An Evaluation of the Usefulness of Case-Based Explanation.",
                    "Adaptation Guided Retrieval Based on Formal Concept Analysis.",
                    "Club [clubsuit] (Trèfle): A Use Trace Model.",
                    "Case-Based Plan Recognition in Computer Games.",
                    "Solution Verification in Software Design: A CBR Approach.",
                    "Evaluation of Case-Based Maintenance Strategies in Software Design.",
                    "Optimal Case-Based Refinement of Adaptation Rule Bases for Engineering Design.",
                    "Detecting Outliers Using Rule-Based Modeling for Improving CBR-Based Software Quality Classification Models.",
                    "An Empirical Analysis of Linear Adaptation Techniques for Case-Based Prediction.",
                    "A Framework for Historical Case-Based Reasoning.",
                    "An Investigation of Generalized Cases.",
                    "On the Role of Diversity in Conversational Recommender Systems.",
                    "Similarity and Compromise.",
                    "The General Motors Variation-Reduction Adviser: Evolution of a CBR System.",
                    "Diversity-Conscious Retrieval from Generalized Cases: A Branch and Bound Algorithm.",
                    "Assessing Elaborated Hypotheses: An Interpretive Case-Based Reasoning Approach.",
                    "Soft Interchangeability for Case Adaptation.",
                    "Supporting the IT Security of eServices with CBR-Based Experience Management.",
                    "Improving Similarity Assessment with Entropy-Based Local Weighting.",
                    "Collaborative Case Retention Strategies for CBR Agents.",
                    "Efficient Real Time Maintenance of Retrieval Knowledge in Case-Based Reasoning.",
                    "Incremental Learning of Retrieval Knowledge in a Case-Based Reasoning System.",
                    "Case Base Management for Analog Circuits Diagnosis Improvement.",
                    "Empirical Analysis of Case-Based Reasoning and Other Prediction Methods in a Social Science Domain: Repeat Criminal Victimization.",
                    "A Hybrid System with Multivariate Data Validation and Case Base Reasoning for an Efficient and Realistic Product Formulation.",
                    "Product Recommendation with Interactive Query Management and Twofold Similarity.",
                    "Unifying Weighting and Case Reduction Methods Based on Rough Sets to Improve Retrieval.",
                    "A Knowledge Representation Format for Virtual IP Marketplaces.",
                    "Managing Experience for Process Improvement in Manufacturing.",
                    "Using Evolution Programs to Learn Local Similarity Measures.",
                    "Playing Mozart Phrase by Phrase.",
                    "Using Genetic Algorithms to Discover Selection Criteria for Contradictory Solutions Retrieved by CBR.",
                    "Using Case-Based Reasoning to Overcome High Computing Cost Interactive Simulations.",
                    "Predicting Software Development Project Outcomes.",
                    "An SQL-Based Approach to Similarity Assessment within a Relational Database.",
                    "Knowledge Capture and Reuse for Geo-spatial Imagery Tasks.",
                    "Index Driven Selective Sampling for CBR.",
                    "Case Base Reduction Using Solution-Space Metrics.",
                    "CBM-Gen+: An Algorithm for Reducing Case Base Inconsistencies in Hierarchical and Incomplete Domains.",
                    "Maintaining Consistency in Project Planning Reuse.",
                    "Case Mining from Large Databases.",
                    "Case Base Maintenance for Improving Prediction Quality.",
                    "Context-Awareness in User Modelling: Requirements Analysis for a Case-Based Reasoning Application."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4. ICCBR 2001",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/2001",
                "sub_name": "Case-Based Reasoning Research and Development, 4th International Conference on Case-Based Reasoning, ICCBR 2001, Vancouver, BC, Canada, July 30 - August 2, 2001, Proceedings.",
                "count": 53,
                "papers": [
                    "Highlights of the European INRECA Projects.",
                    "The Synthesis of Expressive Music: A Challenging CBR Application.",
                    "Why Case-Based Reasoning Is Attractive for Image Interpretation.",
                    "Similarity Assessment for Relational CBR.",
                    "Acquiring Customer Preferences from Return-Set Selections.",
                    "The Role of Information Extraction for Textual CBR.",
                    "Case-Based Reasoning in Course Timetabling: An Attribute Graph Approach.",
                    "Ranking Algorithms for Costly Similarity Measures.",
                    "A Fuzzy-Rough Approach for Case Base Maintenance.",
                    "Learning and Applying Case-Based Adaptation Knowledge.",
                    "Case Representation Issues for Case-Based Reasoning from Ensemble Research.",
                    "A Declarative Similarity Framework for Knowledge Intensive CBR.",
                    "Classification Based Retrieval Using Formal Concept Analysis.",
                    "Conversational Case-Based Planning for Agent Team Coordination.",
                    "A Hybrid Approach for the Management of FAQ Documents in Latin Languages.",
                    "Taxonomic Conversational Case-Based Reasoning.",
                    "A Case-Based Reasoning View of Automated Collaborative Filtering.",
                    "A Case-Based Approach to Tailoring Software Processes.",
                    "The Conflict Graph for Maintaining Case-Based Reasoning Systems.",
                    "Issues on the Effective Use of CBR Technology for Software Project Prediction.",
                    "Incremental Case-Based Plan Recognition Using State Indices.",
                    "A Similarity-Based Approach to Attribute Selection in User-Adaptive Sales Dialogs.",
                    "When Two Case Bases Are Better than One: Exploiting Multiple Case Bases.",
                    "COBRA: A CBR-Based Approach for Predicting Users Actions in a Web Site.",
                    "Similarity vs. Diversity.",
                    "Collaborative Case-Based Reasoning: Applications in Personalised Route Planning.",
                    "Helping a CBR Program Know What It Knows.",
                    "Precision and Recall in Interactive Case-Based Reasoning.",
                    "Meta-case-Based Reasoning: Using Functional Models to Adapt Case-Based Agents.",
                    "Exploiting Interchangeabilities for Case Adaptation.",
                    "Ensemble Case-Based Reasoning: Collaboration Policies for Multiagent Cooperative CBR.",
                    "MAMA: A Maintenance Manual for Case-Based Reasoning Systems.",
                    "Rough Sets Reduction Techniques for Case-Based Reasoning.",
                    "Sequential Instance-Based Learning for Planning in the Context of an Imperfect Information Game.",
                    "Learning Feature Weights from Case Order Feedback.",
                    "Adaptation by Applying Behavior Routines and Motion Strategies in Autonomous Navigation.",
                    "An Accurate Adaptation-Guided Similarity Metric for Case-Based Planning.",
                    "Releasing Memory Space through a Case-Deletion Policy with a Lower Bound for Residual Competence.",
                    "Using Description Logics for Designing the Case Base in a Hybrid Approach for Diagnosis Integrating Model and Case-Based Reasoning.",
                    "T-Air: A Case-Based Reasoning System for Designing Chemical Absorption Plants.",
                    "Benefits of Case-Based Reasoning in Color Matching.",
                    "CBR for Dimensional Management in a Manufacturing Plant.",
                    "Real-Time Creation of Frequently Asked Questions.",
                    "Managing Diagnostic Knowledge in Text Cases.",
                    "CBR Adaptation for Chemical Formulation.",
                    "A Case-Based Reasoning Approach for Due-Date Assignment in a Wafer Fabrication Factory.",
                    "DubLet: An Online CBR System for Rental Property Recommendation.",
                    "Improved Performance Support through an Integrated Task-Based Video Case Library.",
                    "Transforming Electronic Mail Folders into Case Bases.",
                    "Case-Based Reasoning in the Care of Alzheimer's Disease Patients.",
                    "Prototype of an Intelligent Failure Analysis System.",
                    "Applying CBR and Object Database Techniques in Chemical Process Design.",
                    "Mining High-Quality Cases for Hypertext Prediction and Prefetching."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "3. ICCBR 1999",
        "info": "Seeon Monastery, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/1999",
                "sub_name": "Case-Based Reasoning and Development, Third International Conference, ICCBR-99, Seeon Monastery, Germany, July 27-30, 1999, Proceedings.",
                "count": 43,
                "papers": [
                    "Affect-Driven CBR to Generate Expressive Music.",
                    "Probability Based Metrics for Nearest Neighbor Classification and Case-Based Reasoning.",
                    "Active Exploration in Instance-Based Preference Modeling.",
                    "A Multiple-Domain Evaluation of Stratified Case-Based Reasoning.",
                    "Bootstrapping Case Base Development with Annotated Case Summaries.",
                    "Activating CBR Systems Through Autonomous Information Gathering.",
                    "Integrating CBR and Heuristic Search for Learning and Reusing Solutions in Real-Time Task Scheduling.",
                    "Towards a Unified Theory of Adaption in Case-Based Reasoning.",
                    "A Knowledge-Level Task Model of Adaption in Case-Based Reasoning.",
                    "Development and Utilization of a Case-Based Help-Desk Support System in a Corporate Environment.",
                    "Modelling the CBR Life Cycle Using Description Logics.",
                    "An Evolutionary Approach to Case Adaption.",
                    "REMEX - A Case-Based Approach for Reusing Software Measurement Experienceware.",
                    "A Unified Long-Term Memory System.",
                    "Combining CBR with Interactive Knowledge Acquisition, Manipulation and Reuse.",
                    "When Experience Is Wrong: Examining CBR for Changing Tasks and Environments.",
                    "Case Library Reduction Applied to Pile Foundations.",
                    "Case Representation, Acquisition, and Retrieval in SIROCCO.",
                    "Flexibly Interleaving Processes.",
                    "A Case Retention Policy Based on Detrimental Retrieval.",
                    "Using Guidelines to Constrain Interactive Case-Based HTN Planning.",
                    "Speed-Up, Quality and Competence in Multi-modal Case-Based Reasoning.",
                    "A Case-Based Methodology for Planning Individualized Case Oriented Tutoring.",
                    "Building Compact Competent Case-Bases.",
                    "Footprint-Based Retrieval.",
                    "Is CBR Applicable to the Coordination of Search and Rescue Operations? A Feasibility Study.",
                    "Integrating Case-Based Reasoning and Hypermedia Documentation: An Application for the Diagnosis of a Welding Robot at Odense Steel Shipyard.",
                    "Integrating Rule-Based and Case-Based Decision Making in Diabetic Patient Management.",
                    "Managing Complex Knowledge in Natural Sciences.",
                    "ELSI: A Medical Equipment Diagnostic System.",
                    "Case-Based Reasoning for Candidate List Extraction in a Marketing Domain.",
                    "CBR for the Reuse of Image Processing Knowledge: A Recursive Retrieval/ Adaptation.",
                    "Virtual Function Generators: Representing and Reusing Underlying Design Concepts in Conceptual Synthesis of Mechanisms for Function Generation.",
                    "Shaping a CBR View with XML.",
                    "Integrating Information Resources: A Case Study of Engineering Design Support.",
                    "A Hybrid Case-Based Reasoner for Footwear Design.",
                    "Fault Management in Computer Networks Using Case-Based Reasoning: DUMBO System.",
                    "An Architecture for a CBR Image Segmentation System.",
                    "Supporting Reusability in a System Design Environment by Case-Based Reasoning Techniques.",
                    "Case-Based Reasoning for Antibiotics Therapy Advice.",
                    "Surfing the Digital Wave.",
                    "Case-Based Quality Management System Using Expectation Values.",
                    "ICARUS: Design and Deployment of a Case-Based Reasoning System for Locomotive Diagnostics."
                ]
            },
            {
                "sub_name_abbr": "conf/iccbr/1999w",
                "sub_name": "Challenges for Case-Based Reasoning - Proceedings of the ICCBR'99 Workshops, Seeon Monastery, Germany, July 27-30, 1999.",
                "count": 18,
                "papers": [
                    "Cases with a Life-Cycle.",
                    "A Lifecycle Process for Experience Databases.",
                    "Using Scenarios to Envisage the Impact of CBR on Decision-Making Processes.",
                    "Cases as Knowledge Assets.",
                    "Case-Based Workflow.",
                    "An Object Oriented Case-Based Expert System for Awarding Punishment for Serious Descipline Cases.",
                    "Constructing and Transforming CBR Implementations: Techniques for Corporate Memory Management.",
                    "Case-Based Reasoning for Reuse and Validation of System Development Processes.",
                    "Automatic Conversion of VHDL Programs into Cases.",
                    "The AAAI-99 KM/CBR Workshop: Summary of Contributions.",
                    "Adaptation-Dependent Retrieval Problem: A Formal Definition.",
                    "A Knowledge-level Analysis of Adaptation in CBR.",
                    "A Substitution-based Adaptation Model.",
                    "Reformulations and Adaptation Decomposition.",
                    "Constraint Satisfaction for Case Adaptation.",
                    "Hybrid AI Techniques for Automated Software Reuse.",
                    "Using CBR for Clinical Incident Management.",
                    "A Hybrid Case-Based Architecture for Information Filtering on the Web."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "2. ICCBR 1997",
        "info": "Providence, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/1997",
                "sub_name": "Case-Based Reasoning Research and Development, Second International Conference, ICCBR-97, Providence, Rhode Island, USA, July 25-27, 1997, Proceedings.",
                "count": 59,
                "papers": [
                    "Case-Based Reasoning in Color Matching.",
                    "Estimating Software Development Effort with Case-Based Reasoning.",
                    "Applying Case-Based Reasoning to Automated Deduction.",
                    "A Case-Based Approach for Elaboration of Design Requirements.",
                    "Case-Based Reasoning in an Ultrasonic Rail-Inspection System.",
                    "CBR in a Changing Environment.",
                    "Case-Based Reasoning for Information System Design.",
                    "Applying Memory-Based Learning to Indexing of Reference Ships for Case-Based Conceptual Ship Design.",
                    "CBR for Document Retrieval: The FALLQ Project.",
                    "Combining Medical Records with Case-Based Reasoning in a Mixed Paradigm Design -- TROPIX Architecture & Implementation.",
                    "Ocram-CBR: A Shell for Case-Based Educational Systems.",
                    "From Troubleshooting to Process Design: Closing the Manufacturing Loop.",
                    "ForMAT and Parka: A Technology Integration Experiment and Beyond.",
                    "Encouraging Self-Explanation Through Case-Based Tutoring: A Case Study.",
                    "Lessons Learned from Deployed CBR Systems and Design Decisions Made in Building a Commercial CBR Tool.",
                    "Using Case-Based Reasoning for Reusing Software Knowledge.",
                    "New Technology Bliss and Plain in a Large Customer Service Center.",
                    "An Engineering Approach for Troubleshooting Case Bases.",
                    "A Large Case-Based Reasoner for Legal Cases.",
                    "A Scalable Approach for Question Based Indexing of Encyclopedic Texts.",
                    "An Explicit Representation of Reasoning Failures.",
                    "On the Admissibility of Concrete Domains for CBR Based on Description Logics.",
                    "Similarity Metrics: A Formal Unification of Cardinal and Non-Cardinal Similarity Measures.",
                    "The Case for Graph-Structured Representations.",
                    "The Evaluation of a Hierachical Case Representation Using Context Guided Retrieval.",
                    "Refining Conversational Case Libraries.",
                    "Perspectives: A Declarative Bias Mechanism for Case Retrieval.",
                    "Using Introspective Learning to Improve Retrieval in CBR: A Case Study in Air Traffic Control.",
                    "Using Machine Learning for Assigning Indices to Textual Cases.",
                    "How Case-Based Reasoning and Cooperative Query Answering Techniques Support RICAD ?",
                    "What You Saw Is What You Want: Using Cases to Seed Information Retrieval.",
                    "On the Relation between the Context of a Feature and the Domain Theory in Case-Based Planning.",
                    "Theoretical Analysis of Case Retrieval Method Based on Neighborhood of a New Problem.",
                    "The Adaption Knowledge Bottleneck: How to Ease it by Learning from Cases.",
                    "A Case Study of Case-Based CBR.",
                    "Solution-Relevant Abstractions Constrain Retrieval and Adaptation.",
                    "Selecting Most Adaptable Diagnostic Solutions through Pivoting-Based Retrieval.",
                    "Towards Improving Case Adaptability with a Genetic Algorithm.",
                    "Merge Strategies for Multiple Case Plan Replay.",
                    "Loose Coupling of Failure Explanarion and Repair: Using Learning Goals to Sequence Learning Models.",
                    "Using a Case Base of Surfaces to Speed-Up Reinforcement Learning.",
                    "PAC Analyses of a 'Similarity Learning' IBL Algorithm.",
                    "Examining Locally Varying Weights for Nearest Neighbor Algorithms.",
                    "Case-Based Planning to Learn.",
                    "A Utility-Based Approach to Learning in a Mixed Case-Base and Model-Based Reasoning Architecture.",
                    "Qualitative Knowledge to Support Reasoning About Cases.",
                    "Integrating Rule Induction and Case-Based Reasoning to Enhance Problem Solving.",
                    "Using Software Process Modeling for Building a Case-Based Reasoning Methodology: Basis Approach and Case Study.",
                    "Stratified Case-Based Reasoning in Non-Refinable Abstraction Hierarchies.",
                    "Supporting Combined Human and Machine Planning: An Interface for Planning by Analogical Reasoning.",
                    "Using Case-Based Reasoning for Argumentation with Multiple Viewpoints.",
                    "Maintaining Unstructured Case Base.",
                    "An Analogical Theory of Creativity in Design.",
                    "Experimental Study of a Similarity Metric for Retrieving Pieces from Structured Plan Cases: Its Role in the Originality of Plan Case Solutions.",
                    "Creative Design: Reasoning and Understanding.",
                    "Fuzzy Modelling of Case-Based Reasoning and Decision.",
                    "Probabilistic Indexing for Case-Based Prediction.",
                    "A Probabilistic Model for Case-Based Reasoning.",
                    "Case Based Reasoning, Fuzzy Systems Modeling and Solution Composition."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "1. ICCBR 1995",
        "info": "Sesimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/1995",
                "sub_name": "Case-Based Reasoning Research and Development, First International Conference, ICCBR-95, Sesimbra, Portugal, October 23-26, 1995, Proceedings.",
                "count": 52,
                "papers": [
                    "Integration of Case Based Retrieval with a Relational Database System in Aircraft Technical Support.",
                    "Cost Estimation of Software Projects through Case Base Reasoning.",
                    "Operator Decision Aiding by Adaption of Supervision Strategies.",
                    "PROFIL: a decision support tool for metallic sections using a CBR approach.",
                    "MacRad: Radiology Image Resource with a Case-Based Retrieval System.",
                    "Representing and Indexing Building Refurbishment Cases for Multiple Retrieval of Adaptable Pieces of Cases.",
                    "Large-Scale Fault Diagnosis for On-Board Train Systems.",
                    "Case-Based Reasoning for Expertise Relocation in Support of Rural Health Workers in Developing Countries.",
                    "Spatial composition using cases: IDIOM.",
                    "CBR and Machine Learning for Combustion System Design.",
                    "KBS Maintenance as Learning Two-Tiered Domain Representation.",
                    "A Case-Based Approach for Developing Writing Tools Aimed at Non-native English Users.",
                    "Reasoning with Reasons in Case-Based Comparisons.",
                    "Towards the Integration of Case-Based, Schema-Based and Model-Based Reasoning for Supporting Complex Design Tasks.",
                    "Separating the Cases from the Data: Towards More Flexible Case-Based Reasoning.",
                    "Route Planning by Analogy.",
                    "Case Adaption Using an Incomplete Causal Model.",
                    "Evaluating the Application of CBR in Mesh Design for Simulation Problems.",
                    "Case Memory and Retrieval Based on the Immune System.",
                    "Using Case Data to Improve on Rule-based Function Approximation.",
                    "Learning to Improve Case Adaption by Introspective Reasoning and CBR.",
                    "Retrieving Cases in Structured Domains by Using Goal Dependencies.",
                    "An Average-Case Analysis of k-Nearest Neighbor Classifier.",
                    "Cases as terms: A feature term approach to the structured representation of cases.",
                    "ADAPtER: An Integrated Diagnostic System Combining Case-Based and Abductive Reasoning.",
                    "Adaptation Using Constraint Satisfaction Techniques.",
                    "Learning a Local Similarity Metric for Case-Based Reasoning.",
                    "Experiments On Adaptation-Guided Retrieval In Case-Based Design.",
                    "Integration Rules and Cases for the Classification Task.",
                    "Reuse of Knowledge: Emperical Studies.",
                    "Weighting Features.",
                    "An Investigation of Marker-Passing Algorithms for Analogue Retrieval.",
                    "INRECA: A Seamlessly Integrated System Based on Inductive Inference and Case-Based Reasoning.",
                    "DOM-ArC: An Active Decision Support System for Quality Assessment of Cases.",
                    "A Case-Based Reasoner Adaptive to Different Cognitive Tasks.",
                    "On the use of CBR in optimisation problems such as the TSP.",
                    "Case-Based Diagnosis of Multiple Faults.",
                    "On the Automatic Generation of Cases Libraries by Chunking Chess Games.",
                    "Learning to Refine Indexing by Introspective Reasoning.",
                    "Problem Solving with \"The Incredible Machine\" - An Experiment in Case-Based Reasoning.",
                    "Integrating Case Based Reasoning and Tabu Search for Solving Optimisation Problems.",
                    "Systems, Tasks and Adaptation Knowledge: Revealing Some Revealing Dependencies.",
                    "Some Limitations of Feature-Based Recognition in Case-Based Design.",
                    "A Case Based Method for Solving Relatively Stable Dynamic Constraint Satisfaction Problems.",
                    "Learning Strategies for Explanation Patterns: Basic Game Patterns with Application to Chess.",
                    "A Memory-Based Hierarchical Planner.",
                    "Case-Based Reasoning for Cash-Flow Forecasting using Fuzzy Retrieval.",
                    "A Connectionist Indexing Approach for CBR Systems.",
                    "Using a Neutral Network to Learn General Knowledge in a Case-Based System.",
                    "\"Fish and Sink\" - An Anytime-Algorithm to Retrieve Adequate Cases.",
                    "Knowledge Engineering for CBR systems from a Cognitive Science Perspective.",
                    "Towards using a Single Uniform Metric in Instance-Based Learning."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "Case-Based Reasoning Technology, 1998",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/iccbr/1998",
                "sub_name": "Case-Based Reasoning Technology, From Foundations to Applications.",
                "count": 13,
                "papers": [
                    "Introduction.",
                    "Extending some Concepts of CBR - Foundations of Case Retrieval Nets.",
                    "Diagnosis and Decision Support.",
                    "Intelligent Sales Support with CBR.",
                    "Textual CBR.",
                    "Using Configuration Techniques for Adaptation.",
                    "CBR Applied to Planning.",
                    "CBR for Design.",
                    "CBR for Experimental Software Engineering.",
                    "CBR for Tutoring and Help Systems.",
                    "CBR in Medicine.",
                    "Methodology for Building CBR Applications.",
                    "Related Areas."
                ]
            }
        ]
    }
]