[
    {
        "name": "IDA",
        "year": "2022",
        "info": "Volume 26: 2022",
        "count": 15,
        "papers": [
            "Editorial.",
            "Improvements of bat algorithm for optimal feature selection: A systematic literature review.",
            "Information granularity-based incremental feature selection for partially labeled hybrid data.",
            "Robust multi-class feature selection via l2, 0-norm regularization minimization.",
            "Intelligent data integration from heterogeneous relational databases containing incomplete and uncertain information.",
            "Clustering based on adaptive local density with evidential assigning strategy.",
            "Contextual emotion detection on text using gaussian process and tree based classifiers.",
            "Tree based Ensemble for Enhanced Prediction (TEEP) of epileptic seizures.",
            "The overlapping community discovery algorithm based on the local interaction model.",
            "Temporal link prediction in directed networks based on self-attention mechanism.",
            "Particle swarm optimization pattern recognition neural network for transmission lines faults classification.",
            "ComIM: A community-based algorithm for influence maximization under the weighted cascade model on social networks.",
            "DDREL: From drug-drug relationships to drug repurposing.",
            "An adaptive simulated annealing and artificial fish swarm algorithm for the optimization of multi-depot express delivery vehicle routing.",
            "Combining pattern-based CRFs and weighted context-free grammars."
        ]
    },
    {
        "name": "IDA",
        "year": "2021",
        "info": "Volume 25: 2021",
        "count": 86,
        "papers": [
            "Editorial.",
            "Real-time adaptive fuzzy density clustering for multi-target data association.",
            "A lazy feature selection method for multi-label classification.",
            "A novel approach to fully representing the diversity in conditional dependencies for learning Bayesian network classifier.",
            "Classification from positive and unlabeled data based on likelihood invariance for measurement.",
            "Energy modeling of Hoeffding tree ensembles.",
            "Comparative study on credit card fraud detection based on different support vector machines.",
            "Using the beta distribution technique to detect attacked items from collaborative filtering.",
            "Efficient facial expression recognition based on convolutional neural network.",
            "Using optimized statistical distances to confront distributed denial of service attacks in software defined networks.",
            "A time series approach to player churn and conversion in videogames.",
            "Hierarchical features-based targeted aspect extraction from online reviews.",
            "A citation recommendation method based on context correlation.",
            "Editorial.",
            "A robust anomaly detection algorithm based on principal component analysis.",
            "Quadratic hyper-surface kernel-free least squares support vector regression.",
            "Suffix array for multi-pattern matching with variable length wildcards.",
            "A parametric approximation algorithm for spatial group keyword queries.",
            "A model to estimate the Self-Organizing Maps grid dimension for Prototype Generation.",
            "Deep multiple non-negative matrix factorization for multi-view clustering.",
            "Multi-task prediction model based on ConvLSTM and encoder-decoder.",
            "Similarity-based sales forecasting using improved ConvLSTM and prophet.",
            "Microbloggers' interest inference using a subgraph stream.",
            "Deep spatial-temporal fusion network for fine-grained air pollutant concentration prediction.",
            "An efficient method for time series similarity search using binary code representation and hamming distance.",
            "Automatic image detection of multi-type surface defects on wind turbine blades based on cascade deep learning network.",
            "An adaptive node embedding framework for multiplex networks.",
            "Editorial.",
            "Efficient n-gram construction for text categorization using feature selection techniques.",
            "Multi-modal neuroimaging feature fusion via 3D Convolutional Neural Network architecture for schizophrenia diagnosis.",
            "Optimization of SMOTE for imbalanced data based on AdaRBFNN and hybrid metaheuristics.",
            "Sentiment classification based on weak tagging information and imbalanced data.",
            "A new perceptual evaluation method of video quality based on neural network.",
            "Unsupervised latent event representation learning and storyline extraction from news articles based on neural networks.",
            "A novel krill herd algorithm with orthogonality and its application to data clustering.",
            "An attention network based on feature sequences for cross-domain sentiment classification.",
            "Bagging k-dependence Bayesian network classifiers.",
            "Cross-modal variable-length hashing based on hierarchy.",
            "Regression trees with splitting based on changes of dependencies among covariates.",
            "W-MMP2Vec: Topic-driven network embedding model for link prediction in content-based heterogeneous information network.",
            "A directed link prediction method using graph convolutional network based on social ranking theory.",
            "Editorial.",
            "Methods for detecting and correcting contextual data quality problems.",
            "Development of a data generator for multivariate numerical data with arbitrary correlations and distributions.",
            "Human interaction recognition method based on parallel multi-feature fusion network.",
            "Handling incomplete data classification using imputed feature selected bagging (IFBag) method.",
            "Manifold regularization ensemble clustering with many objectives using unsupervised extreme learning machines.",
            "A new semi-supervised algorithm combined with MCICA optimizing SVM for motion imagination EEG classification.",
            "A graphical approach for multiclass classification and for correcting the labeling errors in mislabeled training data.",
            "Content-aware data distribution over cluster nodes.",
            "C_CART: An instance confidence-based decision tree algorithm for classification.",
            "The prediction of online time series with concept drift based on dynamic intuitionistic fuzzy cognitive map.",
            "Quantitative predicting propagation breadth and depth of microblog users' forwarding behavior.",
            "TextureMask: A merged architecture for low-resolution instance segmentation.",
            "Feature-based multi-criteria recommendation system using a weighted approach with ranking correlation.",
            "Multimodal emotion recognition with hierarchical memory networks.",
            "Editorial.",
            "Improving discretization based pattern discovery for multivariate time series by additional preprocessing.",
            "Predictive modelling of hospital readmission: Evaluation of different preprocessing techniques on machine learning classifiers.",
            "A non-binary hierarchical tree overlapping community detection based on multi-dimensional similarity.",
            "Attribute interaction aware matrix factorization method for recommendation.",
            "ADAW: Age decay accuracy weighted ensemble method for drifting data stream mining.",
            "Biogc: A novel framework for biological network classification via machine learning.",
            "A two-stage clustering-based cold-start method for active learning.",
            "Location prediction for facility placement by incorporating multi-characteristic information.",
            "GOW-Stream: A novel approach of graph-of-words based mixture model for semantic-enhanced text stream clustering.",
            "Robust face recognition based on a new Kernel-PCA using RRQR factorization.",
            "Personalized trajectory privacy-preserving method based on sensitive attribute generalization and location perturbation.",
            "Virtual samples based robust block-diagonal dictionary learning for face recognition.",
            "Ensemble machine learning methods for spatio-temporal data analysis of plant and ratoon sugarcane.",
            "Efficient computation of target-oriented link criticalness centrality in uncertain graphs.",
            "Editorial.",
            "Analyzing mixed-type data by using word embedding for handling categorical features.",
            "Privacy preserving defect prediction using generalization and entropy-based data reduction.",
            "Detecting a multigranularity event in an unequal interval time series based on self-adaptive segmenting.",
            "Alleviating the independence assumptions of averaged one-dependence estimators by model weighting.",
            "An improved OPTICS clustering algorithm for discovering clusters with uneven densities.",
            "Differential evolution algorithm-based multiple-factor optimization methods for data assimilation.",
            "Time-series data dynamic density clustering.",
            "MD-SPKM: A set pair k-modes clustering algorithm for incomplete categorical matrix data.",
            "Mutual information-based multi-output tree learning algorithm.",
            "MEGA: Predicting the best classifier combination using meta-learning and a genetic algorithm.",
            "An improved YOLOv3 model for detecting location information of ovarian cancer from CT images.",
            "Forecasting emergency department admissions.",
            "Attention mechanism based LSTM in classification of stressed speech under workload.",
            "Multidimensional indexing technique for medical images retrieval."
        ]
    },
    {
        "name": "IDA",
        "year": "2020",
        "info": "Volume 24: 2020",
        "count": 79,
        "papers": [
            "Editorial.",
            "Balanced training/test set sampling for proper evaluation of classification models.",
            "DNN models based on dimensionality reduction for stock trading.",
            "Detailed investigation of deep features with sparse representation and dimensionality reduction in CBIR: A comparative study.",
            "Label distribution learning with climate probability for ensemble forecasting.",
            "An end-to-end distance measuring for mixed data based on deep relevance learning.",
            "A latent-label denoising method for relation extraction with self-directed confidence learning.",
            "Community detection in dynamic networks using constraint non-negative matrix factorization.",
            "A study on rare fraud predictions with big Medicare claims fraud data.",
            "EEG-based tonic cold pain assessment using extreme learning machine.",
            "Storyline extraction from news articles with dynamic dependency.",
            "A new optimization layer for real-time bidding advertising campaigns.",
            "Editorial.",
            "Domain sentiment dictionary construction and optimization based on multi-source information fusion.",
            "A cross-lingual sentiment topic model evolution over time.",
            "A comparison study on nonlinear dimension reduction methods with kernel variations: Visualization, optimization and classification.",
            "Hybridization of population-based ant colony optimization via data mining.",
            "An improved opposition based learning firefly algorithm with dragonfly algorithm for solving continuous optimization problems.",
            "Mining sequences in activities for time use analysis.",
            "An intrusion detection method based on active transfer learning.",
            "Efficient heuristics for learning Bayesian network from labeled and unlabeled data.",
            "Biased transfer matching for less overlapping degree for unsupervised domain adaptation.",
            "Learning labeling functions in distantly supervised relation extraction.",
            "Knowledge-embodied attention for distantly supervised relation extraction.",
            "MAPK-means: A clustering algorithm with quantitative preferences on attributes.",
            "Editorial.",
            "Distributed frequent subgraph mining on evolving graph using SPARK.",
            "Online analytical processsing on graph data.",
            "Unsupervised learning of textual pattern based on Propagation in Bipartite Graph.",
            "Estimating a one-class naive Bayes text classifier.",
            "An efficient and robust bat algorithm with fusion of opposition-based learning and whale optimization algorithm.",
            "An active learning ensemble method for regression tasks.",
            "An improvement of SAX representation for time series by using complexity invariance.",
            "Extraction of qualitative behavior rules for industrial processes from reduced concept lattice.",
            "Analyzing concept drift: A case study in the financial sector.",
            "Bayesian approach to linear state space model with unknown measurement matrix.",
            "A semantic-aware collaborative filtering recommendation method for emergency plans in response to meteorological hazards.",
            "User-item content awareness in matrix factorization based collaborative recommender systems.",
            "Editorial.",
            "An outlier ensemble for unsupervised anomaly detection in honeypots data.",
            "An advanced profile hidden Markov model for malware detection.",
            "Two deterministic selection methods for the initial centers in fuzzy c-means based algorithms.",
            "RobustRepStream: Robust stream clustering using self-controlled connectivity graph.",
            "An efficient algorithm for hiding sensitive-high utility itemsets.",
            "A hybrid node classification mechanism for influential node prediction in Social Networks.",
            "Feature learning for representing sparse networks based on random walks.",
            "A comparative analysis of Bayesian network structure learning algorithms applied to crime data.",
            "A novel adaptive k-NN classifier for handling imbalance: Application to brain MRI.",
            "Real-time detection and trend tracing of burst topics based on Negative Binomial Distribution on spark.",
            "Multi-fuzzy-constrained graph pattern matching with big graph data.",
            "A community-based algorithm for influence maximization on dynamic social networks.",
            "Editorial.",
            "Bayesian hierarchical K-means clustering.",
            "Canal-LASSO: A sparse noise-resilient online linear regression model.",
            "Boosting meta-learning with simulated data complexity measures.",
            "A novel algorithm for searching frequent gradual patterns from an ordered data set.",
            "Could spatial features help the matching of textual data?",
            "Recognition of speech emotion using custom 2D-convolution neural network deep learning algorithm.",
            "An efficient Bayesian network structure learning algorithm using the strategy of two-stage searches.",
            "Fourier neural networks: A comparative study.",
            "Spatial-time motifs discovery.",
            "Twitter sentiment analysis for the estimation of voting intention in the 2017 Chilean elections.",
            "On the profitability and errors of predicted prices from deep learning via program trading.",
            "Autonomous self-evolving forecasting models for price movement in high frequency trading: Evidence from Taiwan.",
            "W-Com2Vec: A topic-driven meta-path- based intra-community embedding for content-based heterogeneous information network.",
            "Editorial.",
            "Entropy difference and kernel-based oversampling technique for imbalanced data learning.",
            "Sentiment analysis via dually-born-again network and sample selection.",
            "Multiclass spectral feature scaling method for dimensionality reduction.",
            "Explainable and unexpectable recommendations using relational learning on multiple domains.",
            "Plant leaf recognition with shallow and deep learning: A comprehensive study.",
            "Hybrid recommendation model based on deep learning and Stacking integration strategy.",
            "Reinforcement learning based metric filtering for evolutionary distance metric learning.",
            "Parameter evolution of the classifiers for disease diagnosis with offline data-driven hybrid systems.",
            "A hybrid deep learning model for predicting and targeting the less immunized area to improve childrens vaccination rate.",
            "Uni- and multivariate probability density models for numeric subgroup discovery.",
            "DAF: An adaptive computing framework for multimedia data streams analysis.",
            "Improving multi-view facial expression recognition through two novel texture-based feature representations.",
            "Content boosted hybrid filtering for solving pessimistic user problem in recommendation systems."
        ]
    },
    {
        "name": "IDA",
        "year": "2019",
        "info": "Volume 23: 2019",
        "count": 84,
        "papers": [
            "Feature selection using a set based discrete particle swarm optimization and a novel feature subset evaluation criterion.",
            "The search of conditional outliers.",
            "Integrating expert knowledge for Bayesian network structure learning based on intuitionistic fuzzy set and Genetic Algorithm.",
            "GPU-based swarm intelligence for Association Rule Mining in big databases.",
            "Efficient resource scheduling for the analysis of Big Data streams.",
            "Efficient frequent subgraph mining on large streaming graphs.",
            "Ant colony optimization for text feature selection in sentiment analysis.",
            "A review of feature selection techniques in sentiment analysis.",
            "Sentiment analysis and opinion mining applied to scientific paper reviews.",
            "Classification of patients and controls based on stabilogram signal data.",
            "An efficient density-based clustering with side information and active learning: A case study for facial expression recognition task.",
            "Gene selection for enhanced classification on microarray data using a weighted k-NN based algorithm.",
            "Utilizing Recurrent Neural Network for topic discovery in short text scenarios.",
            "NgramSPD: Exploring optimal n-gram model for sentiment polarity detection in different languages.",
            "Diversity, accuracy and efficiency in ensemble learning: An unexpected result.",
            "Reducing the synchronizing communication overhead for distributed graph-parallel computing.",
            "A framework for generating condensed co-location sets from spatial databases.",
            "Cost-sensitive convolutional neural networks for imbalanced time series classification.",
            "A general framework for multi-label learning towards class correlations and class imbalance.",
            "Cluster Width of probability Density functions.",
            "Community recommendation for text post in social media: A case study on Reddit.",
            "Efficient resource management for non-orthogonal multiple access: A novel approach towards green hetnets.",
            "When multiple weather variables matter: Intelligent STLF of electricity demand for smart homes.",
            "Bayesian optimization of support vector machine for regression prediction of short-term traffic flow.",
            "TPPG: Privacy-preserving trajectory data publication based on 3D-Grid partition.",
            "Multivariate dynamic time warping in automotive applications: A review.",
            "Multi-view deep unsupervised transfer leaning via joint auto-encoder coupled with dictionary learning.",
            "Local linear regression-based unsupervised truth discovery.",
            "An extension to association rules using a similarity-based approach in semantic vector spaces.",
            "Semantic knowledge LDA with topic vector for recommending hashtags: Twitter use case.",
            "Bayesian recommender system for social information sharing: Incorporating tag-based personalized interest and social relationships.",
            "Tag-aware recommendation based on Bayesian personalized ranking and feature mapping.",
            "On the use of word embedding for cross language plagiarism detection.",
            "A joint model of extended LDA and IBTM over streaming Chinese short texts.",
            "A practical algorithm for solving the sparseness problem of short text clustering.",
            "Hybrid data stream clustering by controlling decision error.",
            "Improving data quality with label noise correction.",
            "Hephaistos: A fast and distributed outlier detection approach for big mixed attribute data.",
            "Learning of indiscriminate distributions of document embeddings for domain adaptation.",
            "Unsupervised distance learning for extended self-organizing map and visualization of mixed-type data.",
            "Scalable k-means for large-scale clustering.",
            "Multi-label learning vector quantization for semi-supervised classification.",
            "Adaptive geometric median prototype selection method for k-nearest neighbors classification.",
            "Attributed network representation learning via DeepWalk.",
            "Predictive models for cognitive rehabilitation of patients with traumatic brain injury.",
            "Discovering context specific causal relationships.",
            "A semantic textual similarity measurement model based on the syntactic-semantic representation.",
            "The relationship determination between the Bayesian networks nodes based on the intuitionistic fuzzy set.",
            "Editorial.",
            "An on-demand service aggregation and service recommendation method based on RGPS.",
            "A clustering algorithm for fuzzy numbers based on fast search and find of density peaks.",
            "Futures price prediction modeling and decision-making based on DBN deep learning.",
            "Improved ELM optimization model for automobile insurance fraud identification based on AFSA.",
            "On a new polynomial algorithm for solving NPC problems.",
            "Representing and reasoning fuzzy spatio- temporal knowledge with description logics: A survey.",
            "Collaborative filtering recommendation system based on trust-aware and domain experts.",
            "An efficient frequent pattern mining algorithm using a highly compressed prefix tree.",
            "A GPS location data clustering approach based on a niche genetic algorithm and hybrid K-means.",
            "A fuzzy mixed data clustering algorithm by fast search and find of density peaks.",
            "An outlier detection algorithm based on an integrated outlier factor.",
            "Variational autoencoder-based outlier detection for high-dimensional data.",
            "Guidelines for enhancing data locality in selected machine learning algorithms.",
            "Ship trajectory anomaly detection.",
            "Identification of fixations, saccades and smooth pursuits based on segmentation and clustering.",
            "Evaluation of data analytics based clustering algorithms for knowledge mining in a student engagement data.",
            "On time series classification with dictionary-based classifiers.",
            "An attention-gated convolutional neural network for sentence classification.",
            "Facing the full model selection problem in high volume datasets employing intelligent proxy models.",
            "Image concept detection in imbalanced datasets with ensemble of convolutional neural networks.",
            "Distant supervision of relation extraction in sparse data.",
            "Subspace k-anonymity algorithm for location-privacy preservation based on locality-sensitive hashing.",
            "Editorial.",
            "Sequential prediction for imbalanced data stream via weighted OS-ELM and dynamic GAN.",
            "An anti-noise ensemble algorithm for imbalance classification.",
            "Probabilistic maximal frequent itemset mining methods over uncertain databases.",
            "Source code-based defect prediction using deep learning and transfer learning.",
            "Kernelized evolutionary distance metric learning for semi-supervised clustering.",
            "Summarizing significant subgraphs by probabilistic logic programming.",
            "The comparison network model for cyber anomaly detection.",
            "Drug-target interaction data cluster analysis based on improving the density peaks clustering algorithm.",
            "Credit scoring for microfinance using behavioral data in emerging markets.",
            "Interpolative self-training approach for link prediction.",
            "Hierarchical interpolation point anonymity for trajectory privacy protection.",
            "Real-time incremental recommendation for streaming data based on apache flink."
        ]
    },
    {
        "name": "IDA",
        "year": "2018",
        "info": "Volume 22: 2018",
        "count": 70,
        "papers": [
            "A scalable community detection algorithm for large graphs using stochastic block models.",
            "A weighted collaboration network generalization method for privacy protection in C-DBLP.",
            "Beyond accuracy - A SMART approach to site-based spatio-temporal data quality assessment.",
            "An enhanced feature representation based on linear regression model for stock market prediction.",
            "A co-evolutionary framework for adaptive multidimensional data clustering.",
            "Multi-label classification of documents using fine-grained weights and modified co-training.",
            "Mining Twitter data for crime trend prediction.",
            "Mining multi-relational high utility itemsets from star schemas.",
            "Predicting burglars' risk exposure and level of pre-crime preparation using crime scene data.",
            "Fault diagnosis method based on supervised particle swarm optimization classification algorithm.",
            "A framework for semantic connection based topic evolution with DeepWalk.",
            "Hybrid outlier detection (HOD) method in sensor data for human activity classification.",
            "List sampling for large graphs.",
            "An efficient semi-supervised graph based clustering.",
            "Feature clustering dimensionality reduction based on affinity propagation.",
            "Comprehensive concept description based on association rules: A meta-learning approach.",
            "An eye detection method based on convolutional neural networks and support vector machines.",
            "An adaptive genomic difference based genetic algorithm and its application to memetic continuous optimization.",
            "Topic mining of tourist attractions based on a seasonal context aware LDA model.",
            "An influence-based fast preceding questionnaire model for elderly assessments.",
            "USI-AUC: An evaluation criterion of community detection based on a novel link-prediction method.",
            "Detecting manifold dependences of multivariate data with total correlation.",
            "Collaborative data mining for clinical trial analytics.",
            "Microblog oriented interest extraction with both content and network structure.",
            "Task-specific word identification from short texts using a convolutional neural network.",
            "Bayesian exploratory clustering with entropy Chinese restaurant process.",
            "Hierarchical clustering of heavy-tailed data using a new similarity measure.",
            "An efficient heuristic approach for learning a set of composite graph classification rules.",
            "Understanding time use via data mining: A clustering-based framework.",
            "Applying various distance functions and feature extraction schemes to ambiguity resolution.",
            "Which is more influential, \"Who\" or \"When\" for a user to rate in online review site?",
            "A discernibility matrix approach to fuzzy soft sets based decision making problems.",
            "A novel fuzzy linear discriminant analysis for face recognition.",
            "Active learning support vector machines with low-rank transformation.",
            "De-noising documents with a novelty detection method utilizing class vectors.",
            "Data clustering with stochastic cellular automata.",
            "Spectral clustering with adaptive similarity measure in Kernel space.",
            "RLS: An efficient time series clustering method based on u-shapelets.",
            "An online adaptive classifier ensemble for mining non-stationary data streams.",
            "TFI-Apriori: Using new encoding to optimize the apriori algorithm.",
            "Efficient pattern matching with periodical wildcards in uncertain sequences.",
            "A deep belief network based precipitation forecast approach using multiple environmental factors.",
            "Towards semi-automatic human performance evaluation: The case study of a contact center.",
            "Personalized news recommendation using graph-based approach.",
            "A stacking model for variation prediction of public bicycle traffic flow.",
            "Improved over-sampling techniques based on sparse representation for imbalance problem.",
            "Ensemble based on feature projection and under-sampling for imbalanced learning.",
            "Visualized mixed-type data analysis via dimensionality reduction.",
            "Heat Map Based Feature Ranker: In depth comparison with popular methods.",
            "A bounded-size clustering algorithm on fully-dynamic streaming graphs.",
            "A probabilistic model selection criterion for spectral clustering.",
            "Fast multi-label SVM training based on approximate extreme points.",
            "Host-based misuse intrusion detection using PCA feature extraction and kNN classification algorithms.",
            "Finite population Bayesian bootstrapping in high-dimensional classification via logistic regression.",
            "Implied volatility parameterization based on a machine learning polynomial approach.",
            "Social community evolution by combining gravitational relationship with community structure.",
            "A neural reordering model based on phrasal dependency tree for statistical machine translation.",
            "Editorial.",
            "Feature selection using forest optimization algorithm based on contribution degree.",
            "A hybrid filter-wrapper feature selection method for DDoS detection in cloud computing.",
            "A more time-efficient gibbs sampling algorithm based on SparseLDA for latent dirichlet allocation.",
            "A novel approach for hiding sensitive utility and frequent itemsets.",
            "Discovering frequent induced subgraphs from directed networks.",
            "Embedding of the Hamming space into a sphere with weighted quadrance metric and c-means clustering of nominal-continuous data.",
            "A dependency-graph based approach for finding justification in OWL 2 EL.",
            "Schema induction from incomplete semantic data.",
            "Improving acute kidney injury detection with conditional probabilities.",
            "Collaborative social deep learning for celebrity recommendation.",
            "Stock price prediction through sentiment analysis of corporate disclosures using distributed representation.",
            "Probabilistic optimal projection partition KD-Tree k-anonymity for data publishing privacy protection."
        ]
    },
    {
        "name": "IDA",
        "year": "2017",
        "info": "Volume 21: 2017",
        "count": 88,
        "papers": [
            "A synergetic semantic role labeling model with the introduction of fluctuating force accompanied with word sense information.",
            "Joint learning of ontology and semantic parser from text.",
            "Extracting domain-specific stopwords for text classifiers.",
            "FERHD: A feasible approach for extracting fuzzy classification rules from high-dimensional data.",
            "Uncertainty measures of interval-valued intuitionistic fuzzy soft sets and their applications in decision making.",
            "Maximum likelihood parameter estimation of dynamic systems by heuristic swarm search.",
            "Incremental maintenance of discovered association rules and approximate dependencies.",
            "Empirical study of symbolic aggregate approximation for time series classification.",
            "Identifying multi-variable relationships based on the maximal information coefficient.",
            "A novel density-based ensemble learning algorithm with application to protein structural classification.",
            "LFDA model for the assessment of water quality through Microtox® using excitation-emission matrices.",
            "Behavior-based indices for evaluating communities in online social networks.",
            "Editorial.",
            "Clustering multi-typed objects in extended star-structured heterogeneous data.",
            "CD-Tree: A clustering-based dynamic indexing and retrieval approach.",
            "A social influence based trust model for recommender systems.",
            "Scalable and practical One-Pass clustering algorithm for recommender system.",
            "Collaborative filtering recommendation algorithm based on user fuzzy similarity.",
            "A multi-core computing approach for large-scale multi-label classification.",
            "Adaptive algorithms applied to accelerometer biometrics in a data stream context.",
            "Feature bundling in decision tree algorithm.",
            "Community detection in social network by using a multi-objective evolutionary algorithm.",
            "Knowledge discovery of frequent itemsets with low utility for revenue analysis.",
            "An evidential data fusion method for affective music video retrieval.",
            "Incorporating Wikipedia concepts and categories as prior knowledge into topic models.",
            "Editorial.",
            "Ensembles of classifiers based on dimensionality reduction.",
            "Instance reduction for time series classification using MDL principle.",
            "Combining diverse one-class classifiers by means of dynamic weighted average for multi-class pattern classification.",
            "Active seed selection for constrained clustering.",
            "Fuzzy c-Least Medians clustering for discovery of web access patterns from web user sessions data.",
            "Scalable data-driven modeling of spatio-temporal systems: Weather forecasting.",
            "An effective method for approximate representation of frequent itemsets.",
            "Financial distress prediction using SVM ensemble based on earnings manipulation and fuzzy integral.",
            "An association rules based method for classifying product offers from e-shopping.",
            "A feature selection method based on a neighborhood approach for contending with functional and anatomical variability in fMRI group analysis of cognitive states.",
            "Deceptive text detection using continuous semantic space models.",
            "Forecasting, clustering and patrolling criminal activities.",
            "A crowdsourcing approach for personalization in human activities recognition.",
            "Impulsive noise filtering using a Median Redescending M-Estimator.",
            "A framework for detecting deviations in complex event logs.",
            "Multidimensional benchmarking in data warehouses.",
            "A novel data reduction method based on information theory and the Eclectic Genetic Algorithm.",
            "ClusterMPP: An unsupervised density-based clustering algorithm via Marked Point Process.",
            "Unsupervised event exploration from social text streams.",
            "Learning speed of supervised neural networks as similarity measurement in unsupervised cluster analysis.",
            "Nonparametric multi-assignment clustering.",
            "Instance-based classification with Ant Colony Optimization.",
            "Assessing university enrollment and admission efforts via hierarchical classification and feature selection.",
            "Dynamic sparsity control in Deep Belief Networks.",
            "Apriori and GUHA - Comparing two approaches to data mining with association rules.",
            "A guidance of data stream characterization for meta-learning.",
            "Improving session-based temporal recommendation by using dynamic clustering.",
            "Unsupervised active learning techniques for labeling training sets: An experimental evaluation on sequential data.",
            "A parallel approach for the training stage of the Viola-Jones face detection algorithm.",
            "A graph model based feature set selection from short texts with application to document novelty detection.",
            "Classification rule-based models for malicious activity detection.",
            "Exploiting statistically significant dependent rules for associative classification.",
            "PGNBC: Pearson Gaussian Naïve Bayes classifier for data stream classification with recurring concept drift.",
            "Mammogram content-based image retrieval based on malignancy classification.",
            "Distant supervised relation extraction via long short term memory networks with sentence embedding.",
            "Entropy-based link selection strategy for multidimensional complex networks.",
            "Multidimensional skyline analysis based on agree concept lattices.",
            "An algebra for OLAP.",
            "Editorial.",
            "Cluster-Indistinguishability: A practical differential privacy mechanism for trajectory clustering.",
            "Davies Bouldin Index based hierarchical initialization K-means.",
            "A weight-adjusted-voting framework on an ensemble of classifiers for improving sensitivity.",
            "Multi-modal deep distance metric learning.",
            "Multi-label text classification based on the label correlation mixture model.",
            "On the need of hierarchical emotion classification: Detecting the implicit feature using constrained topic model.",
            "Efficiently mining of skyline frequent-utility patterns.",
            "Possibilistic interest discovery from uncertain information in social networks.",
            "An application of a practical neural network model for solving support vector regression problems.",
            "A scalable community detection algorithm for large graphs using stochastic block models.",
            "Hybrid recommender systems: A systematic literature review.",
            "Editorial.",
            "Single channel source separation using graph sparse NMF and adaptive dictionary learning.",
            "Analysis of privacy and utility tradeoffs in anonymized mobile context streams.",
            "Individual learner big data based cloud role player game learning.",
            "Word co-occurrence augmented topic model in short text.",
            "Mining spatio-temporal chaining patterns in non-identity event databases.",
            "Efficiently mining high utility sequential patterns in static and streaming data.",
            "Membrane computing inspired feature selection model for microarray cancer data.",
            "A fast method for frequent pattern discovery with secondary memory.",
            "GIAMS: A generic approach for mining indirect association rules in data streams1.",
            "Effective social content-based collaborative filtering for music recommendation.",
            "An efficient and effective approach for mining a group stock portfolio using mapreduce."
        ]
    },
    {
        "name": "IDA",
        "year": "2016",
        "info": "Volume 20: 2016",
        "count": 82,
        "papers": [
            "Query-sensitive distance measure selection for time series nearest neighbor classification.",
            "A cluster boundary detection algorithm based on shadowed set.",
            "Prototype/topic based clustering method for weblogs.",
            "An iterative self-training support vector machine algorithm in brain-computer interfaces.",
            "Variable selection using support vector regression and random forests: A comparative study.",
            "Multi-objective association rule mining with binary bat algorithm.",
            "A coevolutionary approach to many objective optimization based on a novel ranking method.",
            "Fuzzy Krill Herd (FKH): An improved optimization algorithm.",
            "Improving particle swarm optimization: Using neighbor heuristic and Gaussian cloud learning.",
            "Using a Human Drug Network for generating novel hypotheses about drugs.",
            "Maximizing the spread of positive influence in signed social networks.",
            "Graph dependency construction based on interval-event dependencies detection in data streams.",
            "Mining multi-dimensional concept-drifting data streams using Bayesian network classifiers.",
            "Optimized aggregation function in hierarchical clustering combination.",
            "Spatio-sequential patterns mining: Beyond the boundaries.",
            "A new algorithm for computing reducts based on the binary discernibility matrix.",
            "Identifying socio-demographically favourable area types for early hybrid electric vehicle adoption through mining of public sector data.",
            "Classification-based prediction models for stock price index movement.",
            "A spatial-temporal trajectory clustering algorithm for eye fixations identification.",
            "Fast algorithm for high utility pattern mining with the sum of item quantities.",
            "Effective social graph visualization techniques using friend and hierarchical matching.",
            "A local search approach for generating directional data.",
            "Entity resolution in disjoint graphs: An application on genealogical data.",
            "Multi-kernel maximum entropy discrimination for multi-view learning.",
            "Association rule hiding based on evolutionary multi-objective optimization.",
            "Statistical relational learning for workflow mining.",
            "Privacy preserving anonymization of social networks using eigenvector centrality approach.",
            "A novel cluster ensemble approach effected by subspace similarity.",
            "m-CADE: A mobile based cardiovascular abnormality detection engine using efficient multi-domain feature combinations.",
            "Railway accidents analysis based on the improved algorithm of the maximal information coefficient.",
            "Probabilistic relational model benchmark generation: Principle and application.",
            "Global graph matching using diffusion maps.",
            "An efficient algorithm to maintain the discovered frequent sequences with record deletion.",
            "Multiphase vs. single-phase variational level set approach for video data association.",
            "Toward robust activity recognition: Hierarchical classifier based on Gaussian Process.",
            "Approximations and uncertainty measure- ments in ordered information systems.",
            "Closed world specialisation inside the induction process.",
            "Fuzzy min-max neural network based decision trees.",
            "Efficient local search for L1 and L2 binary matrix factorization.",
            "Link prediction algorithm based on the Choquet fuzzy integral.",
            "Incremental SVM-based classification in dynamic streaming networks.",
            "Grid-based dynamic clustering with grid proximity measure.",
            "Cascading randomized weighted majority: A new online ensemble learning algorithm.",
            "A fast maintenance algorithm of the discovered high-utility itemsets with transaction deletion.",
            "Binary partition for itemsets expansion in mining high utility itemsets.",
            "A hierarchical clustering method: Applications to educational data.",
            "HHFS: Hyper-heuristic feature selection.",
            "Reduce or remove: Individual sensor reliability profiling and data cleaning.",
            "Matrix compression using the Nyström method.",
            "Data reduction for classification with ant colony algorithms.",
            "The GridOPTICS clustering algorithm.",
            "Bag of little bootstraps on features for enhancing classification performance.",
            "SPaC-NF: A classifier based on sequential patterns with high netconf.",
            "Semi-supervised GSOM integrated with extreme learning machine.",
            "Extending the hybridization of metaheuristics with data mining: Dealing with sequences.",
            "Mining high utility itemsets based on the time decaying model.",
            "ToPoMine: A graph miner for analysis of atom-dynamics simulation data in material science.",
            "A discriminating study between three categories of banks based on statistical learning approaches.",
            "Electricity load forecasting in a smart grid system.",
            "Editorial.",
            "About estimation of quality of clustering results via its stability.",
            "Multi-directional and multi-scale perturbation approaches for blind forensic median filtering detection.",
            "EMOPG+FS: Evolutionary multi-objective prototype generation and feature selection.",
            "Improving pattern classification of DNA microarray data by using PCA and logistic regression.",
            "Conformal geometric method for voting.",
            "Speaker recognition using temporal information and session variability compensation in a binary framework.",
            "Geometric indexing for recognition of places based on expanded delaunay triangulation.",
            "Quaternion support vector classifier.",
            "Hybrid adaptation for detecting skin in color images.",
            "Multi-face tracking based on spatio-temporal detections.",
            "Neighborhood relevant outlier detection approach based on information entropy.",
            "An assessment method for the impact of missing data in the rough set-based decision fusion.",
            "EuDiC SVM: A novel support vector machine classification algorithm.",
            "Simple nonparallel laplacian SVM for semi-supervised learning on binary classification problem.",
            "A novel concept drift detection method in data streams using ensemble classifiers.",
            "Answering ad-hoc continuous aggregate queries over data streams using Dynamic Prefix Aggregate Tree.",
            "Box search for the data mining of the key parameters of an industrial process.",
            "A test sample oriented two-phase discriminative dictionary learning algorithm for face recognition.",
            "Multiclass cancer diagnosis in microarray gene expression profile using mutual information and Support Vector Machine.",
            "The Markov-exponential grey model for efficient forecasting management.",
            "Optimal estimates for short horizon travel time prediction in urban areas.",
            "Multilingual emotion classifier using unsupervised pattern extraction from microblog data."
        ]
    },
    {
        "name": "IDA",
        "year": "2015",
        "info": "Volume 19: 2015",
        "count": 90,
        "papers": [
            "Editorial.",
            "Instantiated First Order Qualitative Choice Logic for an efficient handling of alerts correlation.",
            "Artificial neural networks applied for estimating a probability density function.",
            "Mining high utility itemsets for transaction deletion in a dynamic database.",
            "Scalable anomaly detection in graphs.",
            "Bag of frequent subgraphs approach for image classification.",
            "Small network completion using frequent subnetworks.",
            "A semantic recommender system based on frequent tag pattern.",
            "Comparative study of classifier ensembles for cost-sensitive credit risk assessment.",
            "Outlier detection based on transitive closure.",
            "Semantic-enriched visual vocabulary construction in a weakly supervised context.",
            "HC-MOEA: A hierarchical clustering approach for increasing the solution's diversity in multiobjective evolutionary algorithms.",
            "Editorial.",
            "Towards reinforcement learning for holonic multi-agent systems.",
            "Ant colony algorithms for constructing Bayesian multi-net classifiers.",
            "Post-analysis of multi-objective optimization solutions using decision trees.",
            "A co-training algorithm based on modified Fisher's linear discriminant analysis.",
            "Probabilistic clustering of interval data.",
            "Constrained matrix factorization for financial data clustering.",
            "A batch-mode active learning SVM method based on semi-supervised clustering.",
            "Efficient mining of new concise representations of rare correlated patterns\\m{1}.",
            "Network anomaly detection by continuous hidden markov models: An evolutionary programming approach.",
            "Tightening upper bounds for mining weighted frequent itemsets.",
            "Recognition of logical units in log files.",
            "Incremental RotBoost algorithm: An application for spam filtering.",
            "Editorial.",
            "A consistency-based validation for data clustering.",
            "Wisdom of Crowds cluster ensemble.",
            "Kernel based simple regularized multiple criteria linear program for binary classification and regression.",
            "A comparative assessment of data standardization on support vector machine for classification problems.",
            "A multi-phase approach for classifying multi-dimensional sequence data.",
            "Editing the nearest feature line classifier.",
            "Automatically estimating iSAX parameters.",
            "EigenEvent: An algorithm for event detection from complex data streams in syndromic surveillance.",
            "Density-based graph model summarization: Attaining better performance and efficiency.",
            "A fast and flexible instance selection algorithm adapted to non-trivial database sizes.",
            "Locality structure preserving based feature selection for prognostics.",
            "Using a principal component analysis for multi-currencies-trading in the foreign exchange market.",
            "Editorial.",
            "Multi-view twin support vector machines.",
            "A novel multi-class classification algorithm based on one-class support vector machine.",
            "Low density separation as a stopping criterion for active learning SVM.",
            "Effective algorithms of the Moore-Penrose inverse matrices for extreme learning machine.",
            "Software understanding: Automatic classification of software identifiers.",
            "Instance-based ensemble pruning for imbalanced learning.",
            "Optimization overlap clustering based on the hybrid rough discernibility concept and rough K-Means.",
            "Scaling up the hybrid Particle Swarm Optimization algorithm for nominal data-sets.",
            "Experimenting switching hybrid recommender systems.",
            "Intelligent stock market instability index: Application to the Korean stock market.",
            "Using a Human Disease Network for augmenting prior knowledge about diseases.",
            "OCMiner: A density-based overlapping community detection method for social networks.",
            "Editorial.",
            "Fast and space-efficient shapelets-based time-series classification.",
            "A lazy associative classifier for time series.",
            "Expectation maximization based ordering aggregation for improving the K2 structure learning algorithm.",
            "Learning algorithm selection for comprehensible regression analysis using datasetoids.",
            "Improving PART algorithm with K-L divergence for imbalanced classification.",
            "An improved approach of particle swarm optimization and application in data clustering.",
            "Incrementally updating the discovered sequential patterns based on pre-large concept.",
            "Metric concentration search procedure using reduced matrix of pairwise distances.",
            "LDA-based probabilistic graphical model for excitation-emission matrices.",
            "A novel page ranking algorithm based on triadic closure and hyperlink-induced topic search.",
            "Evaluating feature ranking methods in text classifiers.",
            "Mining multidimensional contextual outliers from categorical relational data.",
            "Erratum.",
            "Editorial.",
            "A robust parzen window mutual information estimator for feature selection with label noise.",
            "Piecewise-linear manifold learning: A heuristic approach to non-linear dimensionality reduction.",
            "A geometric density-based sample reduction method.",
            "An embedded feature selection approach for support vector classification via second-order cone programming.",
            "Comparing clustering solutions: The use of adjusted paired indices.",
            "Mining patterns for clustering using unsupervised decision trees.",
            "OverDBC: A new density-based clustering method with the ability of detecting overlapped clusters from gene expression data.",
            "Differential privacy preserving clustering in distributed datasets using Haar wavelet transform.",
            "Bias reduction through conditional conformal prediction.",
            "An efficient framework based on usage and semantic data for next page prediction.",
            "Differential scorecards for binary and ordinal data.",
            "Improving Random Forest and Rotation Forest for highly imbalanced datasets.",
            "Author Index Volume 19 (2015).",
            "Editorial.",
            "Classification of credit scoring data with privacy constraints.",
            "A text mining system for deviation detection in financial documents.",
            "The use of data reduction techniques to assess systemic risk: An application to the Chilean banking system.",
            "Topic factor models: Uncovering thematic structure in equity market data.",
            "How much effort should be spent to detect fraudulent applications when engaged in classifier-based lending?",
            "Partially ordered rough ensemble clustering for multigranular representations.",
            "Robust feature selection for multiclass Support Vector Machines using second-order cone programming.",
            "Churn prediction via support vector classification: An empirical comparison.",
            "Combining regression models and metaheuristics to optimize space allocation in the retail industry.",
            "Domain knowledge based segmentation of online banking customers."
        ]
    },
    {
        "name": "IDA",
        "year": "2014",
        "info": "Volume 18: 2014",
        "count": 76,
        "papers": [
            "Special Issue on Business Analytics and Intelligent Optimization.",
            "Profit optimizing customer churn prediction with Bayesian network classifiers.",
            "Evolutionary refinement approaches for band selection of hyperspectral images with applications to automatic monitoring of animal feed quality.",
            "Identifying user sessions from web server logs with integer programming.",
            "Evolutionary approach for automated component-based decision tree algorithm design.",
            "An approach to the mean shift outlier model by Tikhonov regularization and conic programming.",
            "Robust classification of imbalanced data using one-class and two-class SVM-based multiclassifiers.",
            "Editorial.",
            "Optimizing star-coordinate visualization models for effective interactive cluster exploration on big data.",
            "An alternative approach for clustering web user sessions considering sequential information.",
            "Density estimation of high dimensional data using ICA and Bayesian networks.",
            "Unsupervised density-based behavior change detection in data streams.",
            "Estimating harmfulness of class imbalance by scatter matrix based class separability measure.",
            "Region-based association measures for ranking mined news relations.",
            "Efficient negative association rule mining based on chance thresholds.",
            "On the dangers of default implementations: The case of radial basis function networks.",
            "A central tendency-based privacy preserving model for sensitive XML association rules using Bayesian networks.",
            "Transition regions detection from satellite images based on evolutionary region growing segmentation.",
            "Editorial.",
            "Local feature selection using Gaussian process regression.",
            "Detecting concept drift: An information entropy based method using an adaptive sliding window.",
            "Graph anonymization via metric embed-dings: Using classical anonymization for graphs.",
            "Cluster ensemble selection based on a new cluster stability measure.",
            "New dynamic clustering approaches within belief function framework.",
            "Condensed fuzzy nearest neighbor methods based on fuzzy rough set technique.",
            "Predicting the number of nearest neighbors for the k-NN classification algorithm.",
            "Support vector regression for rate prediction in distributed video coding.",
            "Mining useful association rules from questionnaire data.",
            "Community discovery and importance analysis in social network.",
            "Expertness framework in multi-agent systems and its application in credit assignment problem.",
            "Editorial.",
            "An algorithm to estimate the stability of the individual clusters in the hierarchical context.",
            "Comparing weighted combination of hierarchical clustering based on Cophenetic measure.",
            "Interactive document clustering with feature supervision through reweighting.",
            "Differential privacy preserving clustering based on Haar wavelet transform.",
            "Discovery of temporal neighborhoods through discretization methods.",
            "Finding longest frequent trajectory of dynamic objects using association approaches.",
            "Mining maximal frequent patterns from univariate uncertain data.",
            "A variant of n-gram based language- independent text categorization.",
            "A new loss function for robust classification.",
            "Hierarchical multi-label classification with SVMs: A case study in gene function prediction.",
            "An integrative gene selection with association analysis for microarray data classification.",
            "Editorial.",
            "Understanding episode mining techniques: Benchmarking on diverse, realistic, artificial data.",
            "Clustering of large time series datasets.",
            "Using genetic algorithms for attribute grouping in multivariate microaggregation.",
            "Leveraging additional knowledge to support coherent bicluster discovery in gene expression data.",
            "Ensemble learning with trees and rules: Supervised, semi-supervised, unsupervised.",
            "Input dependent prediction intervals for supervised regression.",
            "A parameter-free approach for one-class classification using binary decision diagrams.",
            "A probabilistic methodology for multilabel classification.",
            "Online discriminative component analysis feature extraction from stream data with domain knowledge.",
            "A tag-based recommender system using rule-based collaborative profile enrichment.",
            "Using model-based collaborative filtering techniques to recommend the expected best strategy to defeat a simulated soccer opponent.",
            "Erratum.",
            "Editorial.",
            "Frequent item set mining for sequential data: Synchrony in neuronal spike trains.",
            "Efficient updating of sequential patterns with transaction insertion.",
            "Discovering high utility itemsets with multiple minimum supports.",
            "Frequent positive and negative (FPN) itemset approach for outlier detection.",
            "Modeling the diversity and log-normality of data.",
            "Hybrid probabilistic sampling with random subspace for imbalanced data learning.",
            "Cluster-based sampling of multiclass imbalanced data.",
            "Distributed matrix completion for large-scale multi-label classification.",
            "Q*-based state abstraction and knowledge discovery in reinforcement learning.",
            "A brief review of the main approaches for treatment of missing data.",
            "Toward an integrated framework for automated development and optimization of online advertising campaigns.",
            "Special Issue of IDA devoted to CIARP 2013.",
            "An empirical comparison among quality measures for pattern based classifiers.",
            "Generalizing the Mahalanobis distance via density kernels.",
            "Addressing the validation of overlapping clustering algorithms.",
            "Constraint acquisition methods for data clustering.",
            "Deep auto-encoder based clustering.",
            "How to improve the convergence on sigmoid Fuzzy Cognitive Maps?",
            "Combining hybrid rule ordering strategies based on netconf and a novel satisfaction mechanism for CAR-based classifiers.",
            "Image indexing using regularized online non-negative semantic embedding."
        ]
    },
    {
        "name": "IDA",
        "year": "2013",
        "info": "Volume 17: 2013",
        "count": 60,
        "papers": [
            "Guest Editorial.",
            "Internal link prediction: A new approach for predicting links in bipartite graphs.",
            "Evolving networks: Eras and turning points.",
            "Discovering descriptive rules in relational dynamic graphs.",
            "Mining spatiotemporal patterns in dynamic plane graphs.",
            "Learning probabilistic real-time automata from multi-attribute event logs.",
            "Story graphs: Tracking document set evolution using dynamic graphs.",
            "Towards combating rumors in social networks: Models and metrics.",
            "Editorial.",
            "Structure/attribute computation of similarities between nodes of a RDF graph with application to linked data clustering.",
            "Interestingness measures for association rules within groups.",
            "A random projection approach for estimation of the betweenness centrality measure.",
            "Modeling financial dependence with support vector regression.",
            "A two-phase hybrid of semi-supervised and active learning approach for sequence labeling.",
            "A new utility-emphasized analysis for stock trading rules.",
            "Inferring signaling pathways using interventional data.",
            "Automated detection of diabetes using higher order spectral features extracted from heart rate signals.",
            "Comparative analysis of the use of chemoinformatics-based and substructure-based descriptors for quantitative structure-activity relationship (QSAR) modeling.",
            "Expectation maximization over binary decision diagrams for probabilistic logic programs.",
            "Editorial.",
            "Semi-supervised text categorization: Exploiting unlabeled data using ensemble learning algorithms.",
            "Sharpened graph ensemble for semi-supervised learning.",
            "Semi-supervised learning on closed set lattices.",
            "Influence of class distribution on cost-sensitive learning: A case study of bankruptcy analysis.",
            "Data stream dynamic clustering supported by Markov chain isomorphisms.",
            "Comparison and evaluation of source code mining tools and techniques: A qualitative approach.",
            "A study of K-Means-based algorithms for constrained clustering.",
            "Incremental mining of sequential patterns: Progress and challenges.",
            "ROC analysis of classifiers in machine learning: A survey.",
            "Editorial.",
            "Genetic programming as strategy for learning image descriptor operators.",
            "UT-Tree: Efficient mining of high utility itemsets from data streams.",
            "Estimating the predominant number of clusters in a dataset.",
            "Discovering generalized association rules from Twitter.",
            "Extending twin support vector machine classifier for multi-category classification problems.",
            "Automatic selection of classification learning algorithms for data mining practitioners.",
            "Smooth support vector learning for fuzzy rule-based classification systems.",
            "Diverse accurate feature selection for microarray cancer diagnosis.",
            "Feature identification for topical relevance assessment in feed search engines.",
            "Editorial.",
            "A procedure for the detection of anomalous input-output patterns.",
            "A methodological approach to mining and simulating data in complex information systems.",
            "Using statistical tools to determine the significance and relative importance of the main parameters of an evolutionary algorithm.",
            "Efficiently explaining the predictions of a probabilistic radial basis function classification network.",
            "A novel feature subset selection algorithm based on association rule mining.",
            "Entity ranking using click-log information.",
            "Mining semantic trajectories.",
            "Incorporating frequency, recency and profit in sequential pattern based recommender systems.",
            "Efficient mining of maximal correlated weight frequent patterns.",
            "Editorial.",
            "Discovering frequent pattern pairs.",
            "Genetic algorithm-based optimized association rule mining for multi-relational data.",
            "Theoretical aspects of mapping to multidimensional optimal regions as a multi-classifier.",
            "Mutual information evaluation: A way to predict the performance of feature weighting on clustering.",
            "Enhancing K-Means using class labels.",
            "Effective email network visualization techniques by means of user behaviors.",
            "Unsupervised categorization of human motion sequences.",
            "Causality-based cost-effective action mining.",
            "A genre-based fuzzy inference approach for effective filtering of movies.",
            "Impact of noise on credit risk prediction: Does data quality really matter?"
        ]
    },
    {
        "name": "IDA",
        "year": "2012",
        "info": "Volume 16: 2012",
        "count": 57,
        "papers": [
            "Editorial.",
            "A new methodology for the automatic creation of adaptive hybrid algorithms.",
            "Optimal leverage association rules with numerical interval conditions.",
            "CAR-NF: A classifier based on specific rules with high netconf.",
            "On clustering large number of data streams.",
            "A framework to monitor clusters evolution applied to economy and finance problems.",
            "Automatic skill acquisition in reinforcement learning using graph centrality measures.",
            "Functional characterization of drug-protein interactions network.",
            "Mapping atmospheric pollutants emissions in European countries.",
            "Editorial.",
            "An improved particle swarm optimization for feature selection.",
            "Complementary distribution BPSO for feature selection.",
            "Improving case-based reasoning in solving optimization problems using Bayesian optimization algorithm.",
            "A dynamic clustering algorithm for building overlapping clusters.",
            "A design heuristic for hybrid classification ensembles in machine learning.",
            "Obtaining accurate and comprehensible classifiers using oracle coaching.",
            "A hybrid customer prediction system based on multiple forward stepwise logistic regression mode.",
            "A scale fuzzy windowing comparison applied to multivariate descriptive analysis.",
            "An intelligent data pre-processing of complex datasets.",
            "Web site keywords: A methodology for improving gradually the web site text content.",
            "Editorial.",
            "Support vector class description (SVCD): Classification in kernel space.",
            "An incremental approach for maintaining functional dependencies.",
            "A linear transform scheme for building weighted scoring rules.",
            "Does independent component analysis perform well for iris recognition?",
            "Comparing state-of-the-art regression methods for long term travel time prediction.",
            "Sequential pattern mining algorithms review.",
            "Employing Kullback-Leibler divergence and Latent Dirichlet Allocation for fraud detection in telecommunications.",
            "Deviation detection in text using conceptual graph interchange format and error tolerance dissimilarity function.",
            "Knowledge discovery in ontologies.",
            "Editorial.",
            "Human action categorization using discriminative local spatio-temporal feature weighting.",
            "To feature space and back: Identifying top-weighted features in polynomial Support Vector Machine models.",
            "Key roles of closed sets and minimal generators in concise representations of frequent patterns.",
            "A new fuzzy rule-based classification system for word sense disambiguation.",
            "Building fast decision trees from large training sets.",
            "Learning compositional decision rules using the KEX algorithm.",
            "Interactive state-transition diagrams for visualization of multimodal annotation.",
            "A comparison of clustering quality indices using outliers and noise.",
            "MaskedPainter: Feature selection for microarray data analysis.",
            "Erratum.",
            "Combined learning methods and mining complex data.",
            "Improving multi-view semi-supervised learning with agreement-based sampling.",
            "Combining multiple predictive models using genetic algorithms.",
            "IIvotes ensemble for imbalanced data.",
            "Tracking recurrent concepts using context.",
            "Gene-pair representation and incorporation of GO-based semantic similarity into classification of gene expression data.",
            "Editorial.",
            "Determining dependence relations using a new score based on imprecise probabilities.",
            "Measuring similarity of graph nodes by neighbor matching.",
            "Feature ranking fusion for text classifier.",
            "Fast classification for large data sets via random selection clustering and Support Vector Machines.",
            "Compact classification of optimized Boolean reasoning with Particle Swarm Optimization.",
            "Effective sanitization approaches to hide sensitive utility and frequent itemsets.",
            "Mining of closed frequent subtrees from frequently updated databases.",
            "A comparative study of novel robust clustering algorithms.",
            "Periodic pattern analysis of non-uniformly sampled stock market data."
        ]
    },
    {
        "name": "IDA",
        "year": "2011",
        "info": "Volume 15: 2011",
        "count": 55,
        "papers": [
            "Ubiquitous Knowledge Discovery.",
            "Clustering distributed sensor data streams using local processing and reduced communication.",
            "Mining frequent closed trees in evolving data streams.",
            "PSO driven collaborative clustering: A clustering algorithm for ubiquitous environments.",
            "A parallel, distributed algorithm for relational frequent pattern discovery from very large data sets.",
            "Atypicity detection in data streams: A self-adjusting approach.",
            "Editorial.",
            "Measure based metrics for aggregated data.",
            "A plan classifier based on Chi-square distribution tests.",
            "Active learning and subspace clustering for anomaly detection.",
            "Evaluating association rules and decision trees to predict multiple target attributes.",
            "Operative assessment of predicted generalization errors on non-stationary distributions in data-intensive applications.",
            "An exploration of learning when data is noisy and imbalanced.",
            "A stable credit rating model based on learning vector quantization.",
            "Exploring discrepancies in findings obtained with the KDD Cup '99 data set.",
            "Editorial.",
            "Bayesian network classifiers: Beyond classification accuracy.",
            "A memory efficient semi-Naive Bayes classifier with grouping of cases.",
            "A novel SVM modeling approach for highly imbalanced and overlapping classification.",
            "Grid-based mode seeking procedure.",
            "Robust mixture model-based clustering with genetic algorithm approach.",
            "Feature selection based on inference correlation.",
            "A novel information fusion method based on Dempster-Shafer evidence theory for conflict resolution.",
            "Data mining in software engineering.",
            "Leukemia identification from bone marrow cells images using a machine vision and data mining strategy.",
            "Editorial.",
            "Data clustering using variable precision rough set.",
            "Unsupervised hierarchical probabilistic segmentation of discrete events.",
            "A privacy preserving clustering technique for horizontally and vertically distributed datasets.",
            "Subgroup discovery in data sets with multi-dimensional responses.",
            "Weighted approximate sequential pattern mining within tolerance factors.",
            "EclatDS: An efficient sliding window based frequent pattern mining method for data streams.",
            "Combining similarity in time and space for training set formation under concept drift.",
            "Data set preprocessing and transformation in a database system.",
            "Learning information diffusion model in a social network for predicting influence of nodes.",
            "Editorial.",
            "Classifying evolving data streams with partially labeled data.",
            "Component-based decision trees for classification.",
            "Tensor clustering via adaptive subspace iteration.",
            "Lazy attribute selection: Choosing attributes at classification time.",
            "A greedy algorithm for dimensionality reduction in polynomial regression to forecast the performance of a power plant condenser.",
            "Automated error detection using association rules.",
            "A fuzzy-neural approach for global CO2 concentration forecasting.",
            "Trend forecasting of financial time series using PIPs detection and continuous HMM.",
            "Robust learning intrusion detection for attacks on wireless networks.",
            "Editorial.",
            "A metric for unsupervised metalearning.",
            "Irrelevant attributes and imbalanced classes in multi-label text-categorization domains.",
            "Adapting non-hierarchical multilabel classification methods for hierarchical multilabel classification.",
            "Mining sequential patterns with extensible knowledge representation.",
            "Exploration strategies in n-Person general-sum multiagent reinforcement learning with sequential action selection.",
            "An intelligent approach to handle False-Positive Radio Frequency Identification Anomalies.",
            "Alert correlation: Severe attack prediction and controlling false alarm rate tradeoffs.",
            "Selecting different protein representations and classification algorithms in hierarchical protein function prediction.",
            "Future trends in business analytics and optimization."
        ]
    },
    {
        "name": "IDA",
        "year": "2010",
        "info": "Volume 14: 2010",
        "count": 46,
        "papers": [
            "Towards incremental classifier fusion.",
            "Extraction of unexpected sentences: A sentiment classification assessed approach.",
            "Hiding collaborative recommendation association rules on horizontally partitioned data.",
            "Evolutionary data analysis for the class imbalance problem.",
            "GA-stacking: Evolutionary stacked generalization.",
            "Multi-dimensional data construction method with its application to learning from small-sample-sets.",
            "Integrating rating-based collaborative filtering with customer lifetime value: New product recommendation technique.",
            "Knowledge discovery in bioinformatics.",
            "PROMETHEUS: Technology for rapid development of biological databases.",
            "From digital genetics to knowledge discovery: Perspectives in genetic network understanding.",
            "Independent component analysis algorithms for microarray data analysis.",
            "CliDaPa: A new approach to combining clinical data with DNA microarrays.",
            "Fuzzy-rough approaches for mammographic risk analysis.",
            "Mining consequence events in temporal health data.",
            "Editorial.",
            "Empirical evaluation of feature selection methods in classification.",
            "Outlier detection in transactional data.",
            "Ensemble missing data techniques for software effort prediction.",
            "Learning hybridization strategies in evolutionary algorithms.",
            "Using learning algorithm behavior to chart task space: The DICES distance.",
            "Fingerprint classification based on subclass analysis using multiple templates of support vector machines.",
            "A new algorithm for mining frequent connected subgraphs based on adjacency matrices.",
            "A new class of attacks on time series data mining\\m{1}.",
            "Algorithms for mining frequent itemsets in static and dynamic datasets.",
            "Editorial.",
            "Three alternative combinatorial formulations of the theory of evidence.",
            "Statistical model for Japanese abbreviations.",
            "Clustering with feature order preferences.",
            "New composite evolutionary computation algorithm using interactions among genetic evolution, individual learning and social learning.",
            "Map building without localization by estimation of inter-feature distances.",
            "Guest Editorial.",
            "Genre classification of music by tonal harmony.",
            "Discovery of distinctive patterns in music.",
            "Identifying violin performers by their expressive trends.",
            "Modeling violin performances using inductive logic programming.",
            "An approach to predicting bowing control parameter contours in violin performance.",
            "Editorial.",
            "Frequent tree pattern mining: A survey.",
            "Rules for contrast sets.",
            "Relevant subtask learning by constrained mixture models.",
            "Mining monolingual and bilingual corpora.",
            "EDLRT: Entropy-based dummy variables logistic regression tree.",
            "The effect of cooling functions on ensemble clustering using simulated annealing.",
            "An efficient preprocessing stage for the relationship-based clustering framework.",
            "A comparison between approximate counting and sampling methods for frequent pattern mining on data streams.",
            "A hybrid fraud scoring and spike detection technique in streaming data."
        ]
    },
    {
        "name": "IDA",
        "year": "2009",
        "info": "Volume 13: 2009",
        "count": 47,
        "papers": [
            "The ROC isometrics approach to construct reliable classifiers.",
            "Adaptive Bayesian network classifiers.",
            "Effective spatial clustering methods for optimal facility establishment.",
            "Spatial outlier detection in heterogeneous neighborhoods.",
            "Mining constraint-based patterns using automatic relaxation.",
            "Artificial neural network reduction through oracle learning.",
            "Intelligent forecasting for financial time series subject to structural changes.",
            "Efficient rule based structural algorithms for classification of tree structured data.",
            "Outlier detection based on rough sets theory.",
            "Searching for interacting features in subset selection.",
            "A new ranking procedure by incomplete pairwise comparisons using preference subsets.",
            "Automatically evolving rule induction algorithms tailored to the prediction of postsynaptic activity in proteins.",
            "SOM-based data analysis of speculative attacks' real effects.",
            "Mining periodic patterns in spatio-temporal sequences at different time granularities.",
            "Models for association rules based on clustering and correlation.",
            "On pushing weight constraints deeply into frequent itemset mining.",
            "An overview of advances in reliability estimation of individual predictions in machine learning.",
            "Knowledge discovery from data streams.",
            "Novelty detection with application to data streams.",
            "Context-aware adaptive data stream mining.",
            "Anomaly detection using manifold embedding and its applications in transportation corridors.",
            "Spatio-Temporal Sensor Graphs (STSG): A data model for the discovery of spatio-temporal patterns.",
            "A system for analysis and prediction of electricity-load streams.",
            "A probabilistic framework for automatic term recognition.",
            "A new clustering approach using similarity of patterns texture.",
            "Tree mining: Equivalence classes for candidate generation.",
            "Approximate minimum spanning tree clustering in high-dimensional space.",
            "Prototype selection based on sequential search.",
            "A new generic basis of \"factual\" and \"implicative\" association rules.",
            "Fuzzy linear and nonlinear discriminant analysis algorithms for face recognition.",
            "Cancer class prediction: Two stage clustering approach to identify informative genes.",
            "Exploiting association and correlation rules parameters for learning Bayesian networks.",
            "Feature selection for aiding glass forensic evidence analysis.",
            "Quality indices for (practical) clustering evaluation.",
            "Bariatric surgery performance: A predictive informatics case study.",
            "Using graph partitioning to discover regions of correlated spatio-temporal change in evolving graphs.",
            "Textual features for corpus visualization using correspondence analysis.",
            "Comparison of similarity measures for clustering Turkish documents.",
            "A novel multimedia data mining framework for information extraction of a soccer video stream.",
            "On the window size for classification in changing environments.",
            "Multiple correspondence analysis for \"tall\" data sets.",
            "Metric learning for semi-supervised clustering using pairwise constraints and the geometrical structure of data.",
            "Meta-conformity approach to reliable classification.",
            "Using correspondence analysis with a large set of transition matrices. Example with eye movement data and fuzzy space windowing.",
            "The use of hidden semi-Markov models in clinical diagnosis maze tasks.",
            "Time series: Empirical characterization and artificial neural network-based selection of forecasting techniques.",
            "Stock market stability index: An intelligent approach."
        ]
    },
    {
        "name": "IDA",
        "year": "2008",
        "info": "Volume 12: 2008",
        "count": 35,
        "papers": [
            "A comprehensive analysis of hyper-heuristics.",
            "Contiguous item sequential pattern mining using UpDown Tree.",
            "A modular information extraction system.",
            "The fitness-rough: A new attribute reduction method based on statistical and rough set theory.",
            "Use of data envelopment analysis and clustering in multiple criteria optimization.",
            "Analyzing currency crises' real effects with partial least squares sensitivity analysis.",
            "A hybrid intelligent approach for output projection in a semiconductor fabrication plant.",
            "Formal structures for data mining, knowledge discovery and communication in a knowledge management environment.",
            "Symbolic methodology for numeric data mining.",
            "Relational methodology for data mining and knowledge discovery.",
            "Bridging the gap between data mining and decision support: A case-based reasoning and ontology approach.",
            "Towards more relevance-oriented data mining research.",
            "Knowledge discovery from data streams.",
            "Schema matching on streams with accuracy guarantees.",
            "Modeling dynamic substate chains among massive states.",
            "Mining frequent items in a stream using flexible windows.",
            "Improving the performance of an incremental algorithm driven by error margins.",
            "Index-CloseMiner: An improved algorithm for mining frequent closed itemset.",
            "Distributed anomaly detection, using cooperative learners and association rule analysis.",
            "Dielectric composite multimodal optimization using a multipopulation cultural algorithm.",
            "Discovering numeric laws, a case study: CO_2 fugacity in the ocean.",
            "Estimating the depth of anesthesia using fuzzy soft computation applied to EEG features.",
            "Comparing identification methods for DNA investigations of crimes and accidents.",
            "Using string kernels to identify famous performers from their playing style.",
            "TRRD: Technology for extraction, storage, and use of knowledge about the structural-functional organization of the transcriptional regulatory regions in the eukaryotic genes.",
            "Approaches to the computer reconstruction of the biological networks.",
            "ExpertDiscovery system application for the hierarchical analysis of eukaryotic transcription regulatory regions based on DNA codes of transcription.",
            "Transcription factor binding site recognition by regularity matrices based on the natural classification method.",
            "Genetic algorithm and optimized weight matrix application for peroxisome proliferator response elements recognition: Prerequisites of accuracy growth for wide genome research.",
            "A comprehensive validity index for clustering.",
            "A new method for hierarchical clustering combination.",
            "Image-mapped data clustering: An efficient technique for clustering large data sets.",
            "NPClu: An approach for clustering spatially extended objects.",
            "AD-Miner: A new incremental method for discovery of minimal approximate dependencies using logical operations.",
            "Finding sporadic rules in the diagnosis of the Erythemato-Squamous diseases."
        ]
    },
    {
        "name": "IDA",
        "year": "2007",
        "info": "Volume 11: 2007",
        "count": 36,
        "papers": [
            "Boosting classifiers for drifting concepts.",
            "Statistical supports for mining sequential patterns and improving the incremental update process on data streams.",
            "Approximate mining of frequent patterns on streams.",
            "Collaborative filtering on streaming data with interest-drifting.",
            "A fuzzy approach for interpretation of ubiquitous data stream clustering and its application in road safety.",
            "A statistical approach for selecting discriminative features of spatial regions of interest.",
            "WWW traffic measure and its properties.",
            "Mixture-model cluster analysis using information theoretical criteria.",
            "An unsupervised clustering approach for leukaemia classification based on DNA micro-arrays data.",
            "Iterative imputation algorithms for process modeling with incomplete data.",
            "Sequential nonlinear manifold learning.",
            "Second-order uncertainty calculations by using the imprecise Dirichlet model.",
            "The multiple imputation quantitative noise corrector.",
            "An efficient incremental mining algorithm-QSD.",
            "Maintenance of informative ruler sets for predictions.",
            "Classification of intrusion detection alerts using abstaining classifiers.",
            "In search of deterministic methods for initializing K-means and Gaussian mixture clustering.",
            "Fuzzy rule base for consumer trustworthiness in Internet marketing: An interactive fuzzy rule classification approach.",
            "A heuristic algorithm for clustering rooted ordered trees.",
            "Inference of node replacement graph grammars.",
            "An active learning system for mining time-changing data streams.",
            "Solving inverse problems using Particle Swarm Optimization: An application to aircraft fuel measurement considering sensor failure.",
            "New probabilistic interest measures for association rules.",
            "Removing biases in unsupervised learning of sequential patterns.",
            "Selective dissemination of XML documents based on genetically learned user model and Support Vector Machines.",
            "An evaluation of Naive Bayes variants in content-based learning for spam filtering.",
            "Wrapper discretization by means of estimation of distribution algorithms.",
            "An iterative refinement approach for data cleaning.",
            "Toward accurate dynamic time warping in linear time and space.",
            "An overview of clustering methods.",
            "Voting experts: An unsupervised algorithm for segmenting sequences.",
            "Efficient instance-based learning on data streams.",
            "Distribution-free discriminant analysis.",
            "Anomaly detection in data represented as graphs.",
            "Image texture classification using wavelet packet transform and probabilistic neural network.",
            "High performance computing for spatial outliers detection using parallel wavelet transform."
        ]
    },
    {
        "name": "IDA",
        "year": "2006",
        "info": "Volume 10: 2006",
        "count": 34,
        "papers": [
            "Feature salience definition and estimation and its use in feature subset selection.",
            "Decision trees for mining data streams.",
            "Pruning extensions to stacking.",
            "Structural hidden Markov models: An application to handwritten numeral recognition.",
            "Knowledge representation and reasoning based on entity and relation propagation diagram/tree.",
            "Searching for high-support itemsets in itemset trees.",
            "A neural network based CBIR system using STI features and relevance feedback.",
            "Performance of data resampling methods for robust class discovery based on clustering.",
            "Combining advantages of new chromosome representation scheme and multi-objective genetic algorithms for better clustering.",
            "Computerized retrieval and classification: An application to reasons for late filings with the securities and exchange commission.",
            "Sequential patterns for text categorization.",
            "A simple regression based heuristic for learning model trees.",
            "Minimum sum-squared residue for fuzzy co-clustering.",
            "Determining noisy instances relative to attributes of interest.",
            "Supervised evaluation of Voronoi partitions.",
            "Bond rating using support vector machine.",
            "Symbolic and spatial data analysis: Mining complex data structures.",
            "Classification of symbolic objects: A lazy learning approach.",
            "The criterion of Kolmogorov-Smirnov for binary decision tree: Application to interval valued variables.",
            "An algebraic method for compressing symbolic data tables.",
            "Materialized aR-Tree in Distributed Spatial Data Warehouse.",
            "Towards symbolic mining of images with association rules: Preliminary results on textures.",
            "Introduction.",
            "Backward chaining rule induction.",
            "Learning from ambiguously labeled examples.",
            "Temporal Bayesian classifiers for modelling muscular dystrophy expression data.",
            "Supporting bi-cluster interpretation in 0/1 data by means of local patterns.",
            "Detecting groups of anomalously similar objects in large data sets.",
            "Class noise detection using frequent itemsets.",
            "A neural network approach to normality testing.",
            "A comprehensive survey of numeric and symbolic outlier mining techniques.",
            "Analyzing a class of pseudo-random bit generator through inductive machine learning paradigm.",
            "A data mining based method for web site maintenance.",
            "Prediction of solar conditions by emotional learning."
        ]
    },
    {
        "name": "IDA",
        "year": "2005",
        "info": "Volume 9: 2005",
        "count": 33,
        "papers": [
            "Enhancing software quality estimation using ensemble-classifier based noise filtering.",
            "Mining for weak periodic signals in time series databases.",
            "Analysis and summarization of correlations in data cubes and its application in microarray data analysis.",
            "Constraint-based concept mining and its application to microarray data analysis.",
            "Automatic discovery of locally frequent itemsets in the presence of highly frequent itemsets.",
            "Combining statistical data analysis techniques to extract topical keyword classes from corpora.",
            "Feature set decomposition for decision trees.",
            "Data-based revision of probability distributions in qualitative multi-attribute decision models.",
            "Optimal bin number for equal frequency discretizations in supervized learning.",
            "A New Singly Connected Network Classifier based on Mutual Information.",
            "Fuzzy taxonomy, quantitative database and mining generalized association rules.",
            "Mining scientific literature to predict new relationships.",
            "A novel feature selection method for large-scale data sets.",
            "A threshold criterion, auto-detection and its use in MST-based clustering.",
            "Association mining in time-varying domains.",
            "The discovery of association rules from tabular databases comprising nominal and ordinal attributes.",
            "Evaluating indirect and direct classification techniques for network intrusion detection.",
            "A linear wrapper for sample subset selection in atypical detection.",
            "Detecting noisy instances with the rule-based classification model.",
            "Scalable document classification.",
            "Finding association rules that trade support optimally against confidence.",
            "Raising data for improved support in rule mining: How to raise and how far to raise.",
            "Performing clustering analysis on collaborative models.",
            "Dynamic Association Rule Mining using Genetic Algorithms.",
            "Detecting and identifying ambiguities in regression problems: An approach using a modified mountain method.",
            "Web outlier mining: Discovering outliers from web datasets.",
            "Evaluating noise elimination techniques for software quality estimation.",
            "Selective fusion of heterogeneous classifiers.",
            "Efficient and interpretable fuzzy classifiers from data with support vector learning.",
            "Consensus clustering.",
            "Structural geography of the space of emerging patterns.",
            "Identifying noisy features with the Pairwise Attribute Noise Detection Algorithm.",
            "Learning quantifiable associations via principal sparse non-negative matrix factorization."
        ]
    },
    {
        "name": "IDA",
        "year": "2004",
        "info": "Volume 8: 2004",
        "count": 36,
        "papers": [
            "A dynamic approach to adjusting lengths of intervals in fuzzy time series forecasting.",
            "Using multiple windows to track concept drift.",
            "Weighted Instance Typicality Search (WITS): A nearest neighbor data reduction algorithm.",
            "A trimmed mean approach to finding spatial outliers.",
            "Identification of discriminative features in the EEG.",
            "Growing kernel-based self-organized maps trained with supervised bias.",
            "A new approach to hierarchical clustering and structuring of data with Self-Organizing Maps.",
            "A global optimal algorithm for class-dependent discretization of continuous data.",
            "Efficiently mining Maximal Frequent Sets in dense databases for discovering association rules.",
            "Prediction of oil well production: A multiple-neural-network approach.",
            "Multiscale rough set data analysis with application to stock performance modeling.",
            "Incremental learning and concept drift: Editor's introduction.",
            "Incremental learning and concept drift in INTHELEX.",
            "Adaptive Ripple Down Rules method based on minimum description length principle.",
            "Towards a machine learning approach based on incremental concept formation.",
            "Learning drifting concepts: Example selection vs. example weighting.",
            "Sequential learning in neural networks: A review and a discussion of pseudorehearsal based methods.",
            "A Tabu Clustering algorithm for Intrusion Detection.",
            "A comparative analysis on the bisecting K-means and the PDDP clustering algorithms.",
            "Modified hierarchical genetic algorithm for relevance feedback in image retrieval.",
            "An improved genetic algorithm adopting immigration operator.",
            "Why machine learning algorithms fail in misuse detection on KDD intrusion detection data set.",
            "Maintenance of generalized association rules with multiple minimum supports.",
            "Guest Editorial: \"Advances in intelligent data analysis\".",
            "Perceptron and SVM learning with generalized cost models.",
            "Resolving rule conflicts with double induction.",
            "A Bayesian network approach to explaining time series with changing structure.",
            "Email answering assistance by semi-supervised text classification.",
            "Large scale mining of molecular fragments with wildcards.",
            "Topology and intelligent data analysis.",
            "A surface-based approach for classification of 3D neuroanatomic structures.",
            "Visualization of evolutionary computation processes from a population perspective.",
            "Improving the prediction performance of customer behavior through multiple imputation.",
            "On the relationships between user profiles and navigation sessions in virtual communities: A data-mining approach.",
            "Nonmetric multidimensional scaling: Neural networks versus traditional techniques.",
            "A comprehensive review of recursive Naïve Bayes Classifiers."
        ]
    },
    {
        "name": "IDA",
        "year": "2003",
        "info": "Volume 7: 2003",
        "count": 37,
        "papers": [
            "Editorial.",
            "A comparison of two data mining techniques to predict abnormal stock market returns.",
            "A genetic algorithm for cluster analysis.",
            "Fast rule extraction with binary-coded relations.",
            "A new mutual information based measure for feature selection.",
            "Integrating rough set theory and fuzzy neural network to discover fuzzy rules.",
            "Editorial.",
            "Iceberg-cube algorithms: An empirical evaluation on synthetic and real data.",
            "Rule quality for multiple-rule classifier: Empirical expertise and theoretical methodology.",
            "Connectionist construction of prototypes from decision trees for graph classification.",
            "Decision trees for web log mining.",
            "A new approach for the generation of fuzzy summaries based on fuzzy multidimensional databases.",
            "Editorial.",
            "Characterising Data Mining software.",
            "Prototype induction and attribute selection via evolutionary algorithms.",
            "Association-based similarity testing and its applications.",
            "Iterative cross-training: An algorithm for web page categorization.",
            "Indirect sensing through abstractive learning.",
            "Editorial.",
            "A taxonomy of Self-organizing Maps for temporal sequence processing.",
            "Selecting representative examples and attributes by a genetic algorithm.",
            "Algorithms for clustering high dimensional and distributed data.",
            "Symbolic adaptive neuro-fuzzy inference for data mining of heterogenous data.",
            "Measuring the interestingness of discovered knowledge: A principled approach.",
            "Editorial.",
            "Round robin ensembles.",
            "Non-Euclidean c-means clustering algorithms.",
            "Setting attribute weights for k-NN based binary classification via quadratic programming.",
            "Weighted Local Similarity Pattern as image similarity model incorporated in GA-based relevance feedback mechanism.",
            "Identity verification through dynamic keystroke analysis.",
            "Guest-editorial: Mining official data.",
            "Utilisation of administrative registers using scientific knowledge discovery.",
            "Mining census data for spatial effects on mortality.",
            "Discovery of spatial association rules in geo-referenced census data: A relational mining approach.",
            "Bayesian regression mixtures of experts for geo-referenced data.",
            "An introduction to symbolic data analysis and the SODAS software.",
            "Calculating economic indexes per household and censal section from official Spanish databases."
        ]
    },
    {
        "name": "IDA",
        "year": "2002",
        "info": "Volume 6: 2002",
        "count": 37,
        "papers": [
            "Editorial.",
            "Analysing company performance using templates.",
            "Grade correspondence analysis applied to contingency tables and questionnaire data.",
            "Building neural network forecasting models from time series ARIMA models: A procedure and a comparative analysis.",
            "Dynamic support vector machines for non-stationary time series forecasting.",
            "The Bilipschitz criterion for dimension reduction mapping design.",
            "Editorial.",
            "Convexity dependant hyperbolic filtering scheme for mode detection in pattern classification.",
            "Online classification of nonstationary data streams.",
            "Boosting strategy for classification.",
            "Piecewise nonlinear model for financial time series forecasting with artificial neural networks.",
            "A new PCA-based method for data compression and enhancement of multi-frequency polarimetric SAR imagery.",
            "Guest-editorial.",
            "Communities of interest.",
            "Measuring the accuracy and interest of association rules: A new framework.",
            "Finding informative rules in interval sequences.",
            "Predicting time-varying functions with local models.",
            "A framework for modelling virus gene expression data.",
            "Matryoshka: A HMM based temporal data clustering methodology for modeling system dynamics.",
            "Editorial.",
            "Instance-based data reduction for improved identification of difficult small classes.",
            "Generalization of Rough sets and its applications in information system.",
            "Optimization of association rule mining queries.",
            "Sampling from databases using B^+-Trees.",
            "Fast ordering of large categorical datasets for visualization.",
            "Editorial.",
            "Maintenance of discovered sequential patterns for record deletion.",
            "Behaviour of protein secondary structure types in the sequence space of a certain length.",
            "The class imbalance problem: A systematic study.",
            "Detecting graph-based spatial outliers.",
            "Adaptive delivery of E-commerce web sites.",
            "Editorial.",
            "Classification with sparse grids using simplicial basis functions.",
            "Evolutionary algorithms for grouping high dimensional Email data.",
            "Classification and filtering of spectra: A case study in mineralogy.",
            "Evolutionary model selection in unsupervised learning.",
            "Missing values prediction with K2."
        ]
    },
    {
        "name": "IDA",
        "year": "2001",
        "info": "Volume 5: 2001",
        "count": 37,
        "papers": [
            "Editorial.",
            "Satellite data processing for meteorological nowcasting and very short range forecasting using neural networks.",
            "A neural network-based software sensor for coagulation control in a water treatment plant.",
            "From local trend extraction to symbolization of time-series.",
            "Parameter extraction by parallel neural networks.",
            "IGLUE: A lattice-based constructive induction system.",
            "Editorial.",
            "Rule mining with prior knowledge - a belief networks approach.",
            "A new incremental data mining algorithm using pre-large itemsets.",
            "Discovering functional dependencies from similarity-based fuzzy relational databases.",
            "An application of machine learning and statistics to defect detection.",
            "A statistical approach to multivariate measurement validation.",
            "Editorial.",
            "A comparative study of saliency analysis and genetic algorithm for feature selection in support vector machines.",
            "Mining weighted association rules.",
            "Hybrid systems of local basis functions.",
            "Boosting interval based literals.",
            "Neural-morphological approach for pattern classification.",
            "Editorial.",
            "Adaptive boosting techniques in heterogeneous and spatial databases.",
            "Mining association rules using clustering.",
            "A graph-based clustering algorithm in large transaction databases.",
            "Improved financial time series forecasting by combining Support Vector Machines with self-organizing feature map.",
            "Automated defect inspection and classification of leather fabric.",
            "Editorial.",
            "On the use of self-organizing maps for clustering and visualization.",
            "Neuronal principal component analysis for an optimal representation of multispectral images.",
            "Data set Editing by Ordered Projection.",
            "IP algorithms in compact rough classification modeling.",
            "A discretization method for rough sets theory.",
            "Learning to reason about data: The spring school on intelligent data analysis.",
            "Editorial.",
            "Inductive learning from numerical and symbolic data: An integrated framework.",
            "A reduction technique for nearest-neighbor classification: Small groups of examples.",
            "Improvement of the Parzen classifier in small training sample size situations.",
            "An algorithm for correcting mislabeled data.",
            "A fuzzy model for the representation and recognition of linguistically described trends."
        ]
    },
    {
        "name": "IDA",
        "year": "2000",
        "info": "Volume 4: 2000",
        "count": 36,
        "papers": [
            "Generalized rough sets based feature selection.",
            "Dependency-based feature selection for clustering symbolic data.",
            "A nearest neighborhood algebra for probabilistic databases.",
            "Determining appropriate membership functions to simplify fuzzy induction.",
            "Indexing time series using signatures.",
            "Advances in intelligent data analysis.",
            "Decision trees for ordinal classification.",
            "Monitoring human information processing via intelligent data analysis of EEG recordings.",
            "Relation-based aggregation: finding objects in large spatial datasets.",
            "ProbMap - A probabilistic approach for mapping large document collections.",
            "Adjusted estimation for the combination of classifiers.",
            "A coevolutionary genetic algorithm using fuzzy clustering.",
            "Discovery of multivalued dependencies from relations.",
            "Supervised model-based visualization of high-dimensional data.",
            "Reducing redundancy in characteristic rule discovery by using integer programming techniques.",
            "Unsupervised fuzzy learning and cluster seeking.",
            "Reducing decision tree fragmentation through attribute value grouping: A comparative study.",
            "A fast fuzzy K-nearest neighbour algorithm for pattern classification.",
            "Knowledge acquisition from quantitative data using the rough-set theory.",
            "Vector decision trees.",
            "Induction of decision trees in numeric domains using set-valued attributes.",
            "Rule discovery for event histories.",
            "From machine learning to knowledge discovery: Survey of preprocessing and postprocessing.",
            "An architectural framework for hybrid intelligent systems: Implementation issues.",
            "Editorial.",
            "Tree structured classifiers, interconnected data, and predictive accuracy.",
            "Intelligent document classification.",
            "A novel similarity measure for data clustering.",
            "Determination of data dimensionality in hyperspectral imagery - A noise-adjusted transformed Derschgorin disk approach.",
            "Genetic learner: Discretization and fuzzification of numerical attributes.",
            "Editorial.",
            "Boosting the differences: A fast Bayesian classifier neural network.",
            "Iterative Bayes.",
            "Improving information retrieval system performance by combining different text-mining techniques.",
            "An event set approach to sequence discovery in medical data.",
            "An application of radial basis function networks in operation of home appliances."
        ]
    },
    {
        "name": "IDA",
        "year": "1999",
        "info": "Volume 3: 1999",
        "count": 31,
        "papers": [
            "Linear tree.",
            "The application of non-parametric techniques to solve classification problems in complex data sets in veterinary epidemiology - An example.",
            "Constructing fuzzy graphs from examples.",
            "DistAl: An inter-pattern distance-based constructive learning algorithm.",
            "A piecewise regression analysis with automatic change-point detection.",
            "Welcome to Volume 3(2) of Intelligent Data Analysis.",
            "Integrating models of discrimination and characterization.",
            "SOM-based data visualization methods.",
            "Decomposition of a fuzzy controller based on the inference break-up method.",
            "Effect of merging order on performance of fuzzy induction.",
            "Editior-in-Chief: Welcome to Volume 3(3) of Intelligent Data Analysis journal!.",
            "Using artificial intelligence planning to automate science image data analysis.",
            "A simulated annealing technique for generating artificial data to assess concept learning algorithms.",
            "Nearest neighbor classification from multiple feature subsets.",
            "Dimensionality optimization by heuristic greedy learning vs. genetic algorithms in knowledge discovery and data mining.",
            "Decision tree based induction of decision lists.",
            "Editorial.",
            "MICSL: Multiple Iterative Constraint Satisfaction based Learning.",
            "Process data de-noising using wavelet transform.",
            "Brain tumor classification based on EEG hidden dynamics.",
            "A kernel-based Adaline for function approximation.",
            "NOEMON: Design, implementation and performance results of an intelligent assistant for classifier selection.",
            "Layered dynamic probabilistic networks for spatio-temporal modelling.",
            "Mining association rules from quantitative data.",
            "Mining consumer product data via latent semantic indexing.",
            "Knowledge acquisition from batch semiconductor manufacturing data.",
            "Knowledge discovery in molecular biology: Identifying structural regularities in proteins.",
            "Mining a large database with a parallel database server.",
            "Maintaining the performance of a learned classifier under concept drift.",
            "Aggregation and maintenance for database mining.",
            "Evaluating a clustering solution: An application in the tourism market."
        ]
    },
    {
        "name": "IDA",
        "year": "1998",
        "info": "Volume 2: 1998",
        "count": 24,
        "papers": [
            "Letter From the Editor.",
            "Using NLP for Machine Learning of User Profiles.",
            "Fast Estimation of the Modal Position for Unimodally Distributed Data.",
            "Inductive Genetic Programming with Decision Trees.",
            "Predicting Phase Transitions of Binary Constraint Satisfaction Problems with Constraint Graph Information.",
            "Editorial: Reasoning About Data.",
            "Intelligent Data Analysis: Issues and Opportunities.",
            "Decomposition of Heterogeneous Classification Problems.",
            "Temporal Abstractions for Interpreting Diabetic Patients Monitoring Data.",
            "Reasoning about Sensor Data for Automated System Identification.",
            "Parameter Estimation in Bayesian Networks from Incomplete Databases.",
            "Letter From the Editor.",
            "Mining Classification Rules in Multistrategy Learning Approach.",
            "Knowledge Discovery Via Multiple Models.",
            "Fast Dimensionality Reduction and Simple PCA.",
            "Extraction of Experts' Decision Rules from Clinical Databases Using Rough Set Model.",
            "Interactive Interpretation of Hierarchical Clustering.",
            "A Review of the Fourteenth International Conference on Machine Learning.",
            "Letter From the Editor.",
            "ARCADE: A Prediction Method for Nominal Variables.",
            "Self-Organized-Expert Modular Network for Classification of Spatiotemporal Sequences.",
            "Estimating Performance Gains for Voted Decision Trees.",
            "Application of Machine Learning in Water Distribution Networks.",
            "Knowledge Visualization Techniques for Machine Learning."
        ]
    },
    {
        "name": "IDA",
        "year": "1997",
        "info": "Volume 1: 1997",
        "count": 21,
        "papers": [
            "Letter From the Editor.",
            "Data Preprocessing and Intelligent Data Analysis.",
            "Compound Key Word Generation from Document Databases Using A Hierarchical Clustering ART Model.",
            "Summary SQL - A Fuzzy Tool For Data Mining.",
            "A Classification Approach Incorporating Misclassification Costs.",
            "Letter From the Editor.",
            "Pattern Recognition by Splitting Images Into Trees of Fuzzy Regions.",
            "PCA of Wavelet Transformed Process Data for Monitoring.",
            "Machine Recognition of Hand-Printed Chinese Characters.",
            "Possibilistic Testing of Distribution Functions for Change Detection.",
            "Letter From the Editor.",
            "Feature Selection for Classification.",
            "Analyzing Discretizations of Continuous Attributes Given a Monotonic Discrimination Function.",
            "Decision Combination Based on the Characterisation of Predictive Accuracy.",
            "Monotonicity of Entropy Computations in Belief Functions.",
            "Erratum.",
            "Letter to the Editor.",
            "IMPUT: An Interactive Learning Tool Based on Program Specialization.",
            "Dynamic Probabilistic Networks for Modelling and Identifying Dynamic Systems: a MCMC Approach.",
            "Counting by Statistics on Search Trees: Application to Constraint Satisfaction Problems.",
            "Regression Using Classification Algorithms."
        ]
    }
]