[
    {
        "name": "IJAR",
        "year": "2022",
        "info": "2022: Volumes\n140,\n141,\n142,\n143,",
        "count": 65,
        "papers": [
            "Formal concept analysis, rough sets, and three-way decisions.",
            "AMG-DTRS: Adaptive multi-granulation decision-theoretic rough sets.",
            "Interval-valued kriging for geostatistical mapping with imprecise inputs.",
            "A formal study of a generalized rough set model based on subset approximation structure.",
            "Random sampling accelerator for attribute reduction.",
            "Strudel: A fast and accurate learner of structured-decomposable probabilistic circuits.",
            "Learning context-dependent choice functions.",
            "Hierarchical sequential three-way decision model.",
            "Ensuring reference independence and cautious monotony in abstract argumentation.",
            "Dilation properties of coherent Nearly-Linear models.",
            "Attributes reduction algorithms for m-polar fuzzy relation decision systems.",
            "Coherent and Archimedean choice in general Banach spaces.",
            "Clustering-based simultaneous forecasting of life expectancy time series through Long-Short Term Memory Neural Networks.",
            "Conditional sum-product networks: Modular probabilistic circuits via gate functions.",
            "Probability and statistics: Foundations and history. Special Issue in honor of Glenn Shafer.",
            "Glenn Shafer - A short biography.",
            "One-dimensional game-theoretic differential equations.",
            "Randomness is inherently imprecise.",
            "Log-optimal anytime-valid E-values.",
            "Testing exchangeability: Fork-convexity, supermartingales and e-processes.",
            "Validity, consonant plausibility measures, and conformal prediction.",
            "Homeostasis phenomenon in conformal prediction and predictive distribution functions.",
            "W.E. Johnson and Cambridge thought on probability.",
            "Kameda Toyojiro and the transfer of the Western theory of probability to Japan.",
            "The notion of event in probability and causality: Situating myself relative to Bruno de Finetti.",
            "Causal interpretation of graphical models.",
            "\"So much data. Who needs probability?\" Have we been here before?",
            "Rough L-fuzzy sets: Their representation and related structures.",
            "A new type of dyad fuzzy β-covering rough set models base on fuzzy information system and its practical application.",
            "Notes on integer partitions.",
            "Abduction with probabilistic logic programming under the distribution semantics.",
            "LCM from FCA point of view: A CbO-style algorithm with speed-up features.",
            "Coherent checking and updating of Bayesian models without specifying the model space: A decision-theoretic semantics for possibility theory.",
            "Tensor approximation of cooperative games and their semivalues.",
            "An improved three-way decision model based on prospect theory.",
            "Cautious classification based on belief functions theory and imprecise relabelling.",
            "Learning and planning in partially observable environments without prior domain knowledge.",
            "A general bi-clustering algorithm for object data with an application to the analysis of a Lombardy railway line.",
            "Phenotyping OSA: a time series analysis using fuzzy clustering and persistent homology.",
            "Optimization problems on posets with regard to formal concept analysis.",
            "Incremental updating probabilistic approximations under multi-level and multi-dimensional variations in hybrid incomplete decision systems.",
            "Granular rough sets and granular shadowed sets: Three-way approximations in Pawlak approximation spaces.",
            "A Bayesian hierarchical score for structure learning from related data sets.",
            "Novel AQM analysis approach based on similarity and dissimilarity measures of interval set for multi-expert multi-criterion decision making.",
            "Conditional distributivity equation of semi-uninorms over uninorms.",
            "Lattice-valued tree pushdown automata: Pumping lemma and closure properties.",
            "Three-way approximate reduct based on information-theoretic measure.",
            "Steps towards causal Formal Concept Analysis.",
            "Typicality: A formal concept analysis account.",
            "A study of algorithms relating distributive lattices, median graphs, and Formal Concept Analysis.",
            "Information algebras in the theory of imprecise probabilities.",
            "Few-shot learning based on hierarchical classification via multi-granularity relation networks.",
            "OWA fuzzy regression.",
            "Various fuzzy connections and fuzzy concepts in complete co-residuated lattices.",
            "Knowledge transfer for causal discovery.",
            "Bayesian nonparametric change point detection for multivariate time series with missing observations.",
            "Distributivity between uni-nullnorms and Mayor's aggregation operators.",
            "Three-way decision based on confidence level change in rough set.",
            "GLRM: Logical pattern mining in the case of inconsistent data distribution based on multigranulation strategy.",
            "Multiple attribute group decision making based on multigranulation probabilistic models, MULTIMOORA and TPOP in incomplete q-rung orthopair fuzzy information systems.",
            "The generalized sigmoid function and its connection with logical operators.",
            "Solving possibilistic games with incomplete information.",
            "Degenerate Gaussian factors for probabilistic inference.",
            "Belief functions and rough sets: Survey and new insights.",
            "Intuitionistic fuzzy (⊗, N)-general regular languages and their minimization implementation."
        ]
    },
    {
        "name": "IJAR",
        "year": "2021",
        "info": "2021: Volumes\n128,\n129,\n130,\n131,\n132,\n133,\n134,\n135,\n136,\n137,\n138,\n139",
        "count": 129,
        "papers": [
            "On a distribution form of subcopulas.",
            "Observability in locally vague environments.",
            "Label distribution feature selection for multi-label classification with rough set.",
            "Asymmetric dependence in the stochastic frontier model using skew normal copula.",
            "Scaling-invariant maximum margin preference learning.",
            "On interval RO- and (G, O, N)-implications derived from interval overlap and grouping functions.",
            "Local regression smoothers with set-valued outcome data.",
            "Fuzzy extensions of the dominance-based rough set approach.",
            "Nondeterministic finite automata based on quantum logic: Language equivalence relation and robustness.",
            "Note on topologies induced by coverings of approximation spaces.",
            "A logical reasoning based decision making method for handling qualitative knowledge.",
            "An evolutionary strategic weight manipulation approach for multi-attribute decision making: TOPSIS method.",
            "Credal sets representable by reachable probability intervals and belief functions.",
            "Two clustering methods based on the Ward's method and dendrograms with interval-valued dissimilarities for interval-valued data.",
            "A spatial filtering inspired three-way clustering approach with application to outlier detection.",
            "Some further results about uninorms on bounded lattices.",
            "Limited approximate bisimulations and the corresponding rough approximations.",
            "Semi-monolayer covering rough set on set-valued information systems and its efficient computation.",
            "Variable-precision three-way concepts in L-contexts.",
            "Rough set reasoning using answer set programs.",
            "Multivariate statistical matching using graphical modeling.",
            "Double-quantitative rough sets, optimal scale selection and reduction in multi-scale dominance IF decision tables.",
            "A Bayesian method for calibration and aggregation of expert judgement.",
            "On nonlinear expectations and Markov chains under model uncertainty.",
            "On the cross-migrativity of uninorms revisited.",
            "AH3: An adaptive hierarchical feature representation model for three-way decision boundary processing.",
            "Belief rule mining using the evidential reasoning rule for medical diagnosis.",
            "A note on the relationships between generalized rough sets and topologies.",
            "Semantic classification of qualitative conditionals and calculating closures of nonmonotonic inference relations.",
            "Gaussian fuzzy theoretic analysis for variational learning of nested compositions.",
            "A particular upper expectation as global belief model for discrete-time finite-state uncertain processes.",
            "Graphoid properties of concepts of independence for sets of probabilities.",
            "Multiple multidimensional linguistic reasoning algorithm based on property-oriented linguistic concept lattice.",
            "A semi-supervised deep learning image caption model based on Pseudo Label and N-gram.",
            "The measurement of relations on belief functions based on the Kantorovich problem and the Wasserstein metric.",
            "On standard completeness and finite model property for a probabilistic logic on Łukasiewicz events.",
            "Large-scale empirical validation of Bayesian Network structure learning algorithms with noisy data.",
            "Distributivity of N-ordinal sum fuzzy implications over t-norms and t-conorms.",
            "Revealed preference in argumentation: Algorithms and applications.",
            "Detection of rare events with uncertain outcomes.",
            "Classifying and completing word analogies by machine learning.",
            "On (IO, O)-fuzzy rough sets based on overlap functions.",
            "New measures of alliance and conflict for three-way conflict analysis.",
            "Spatiotemporal adaptive neural network for long-term forecasting of financial time series.",
            "Special Issue on Probabilistic Logic Programming (PLP 2018).",
            "Conflict analysis based on three-way decision for triangular fuzzy information systems.",
            "Feature selection and threshold method based on fuzzy joint mutual information.",
            "Erratum to \"Fubini theorem and generalized Minkowski inequality for the pseudo-integral\" [Int. J. Approx. Reason. 122 (2020) 9-23].",
            "Graded polygons of opposition in fuzzy formal concept analysis.",
            "Logics of imprecise comparative probability.",
            "Average behaviour in discrete-time imprecise Markov chains: A study of weak ergodicity.",
            "A robust support vector regression with exact predictors and fuzzy responses.",
            "Rule extraction based on linguistic-valued intuitionistic fuzzy layered concept lattice.",
            "A test to compare interval time series.",
            "Dynamic panel fuzzy time series model and its application to econometric time series.",
            "Analysis and enhanced prediction of the Spanish Electricity Network through Big Data and Machine Learning techniques.",
            "Characterization of n-uninorms with continuous underlying functions via z-ordinal sum construction.",
            "A unified approach to four important classes of unary operators.",
            "Improving and benchmarking of algorithms for Γ-maximin, Γ-maximax and interval dominance.",
            "Fast semi-supervised evidential clustering.",
            "A universal approach to imprecise probabilities in possibility theory.",
            "Instance weighting through data imprecisiation.",
            "Fundamental properties of relative entropy and Lin divergence for Choquet integral.",
            "On classifying the effects of policy announcements on volatility.",
            "Model-based fuzzy time series clustering of conditional higher moments.",
            "A knowledge based system for the management of a time stamped uncertain observation set with application on preserving mobility.",
            "Information structures in a fuzzy set-valued information system based on granular computing.",
            "Residuated implications derived from quasi-overlap functions on lattices.",
            "Construction of nullnorms on some special classes of bounded lattices.",
            "Robust moving object detection based on fusing Atanassov's Intuitionistic 3D Fuzzy Histon Roughness Index and texture features.",
            "Characterizing fuzzy simulations for fuzzy labeled transition systems in fuzzy propositional dynamic logic.",
            "Adversarial domain adaptation network for tumor image diagnosis.",
            "Three-way recommendation model based on shadowed set with uncertainty invariance.",
            "Defining rough sets as core-support pairs of three-valued functions.",
            "Trust recommendation mechanism-based consensus model for Pawlak conflict analysis decision making.",
            "Modal systems for covering semantics and boundary operator.",
            "Constructing uninorms on bounded lattices by using additive generators.",
            "Probability over Płonka sums of Boolean algebras: States, metrics and topology.",
            "Textural dependency and concept lattices.",
            "A decomposition-based algorithm for learning the structure of multivariate regression chain graphs.",
            "When a combination of convexity and continuity forces monotonicity of preferences.",
            "On the distributivity of fuzzy implications and the weighted S-implications.",
            "N-vertical generated implications and their distributivities over t-norms and t-conorms.",
            "Rough set-based feature selection for weakly labeled data.",
            "Compound conditionals, Fréchet-Hoeffding bounds, and Frank t-norms.",
            "A rule-based granular model development for interval-valued time series.",
            "Robust fuzzy clustering of time series based on B-splines.",
            "Special issue on Knowledge Enhanced Data Analytics for Autonomous Decision Making (KEDA for DM).",
            "Information graphs and their use for Bayesian network graph construction.",
            "A novel kernelized total Bregman divergence-based fuzzy clustering with local information for image segmentation.",
            "Special issue on Reasoning under Partial Knowledge.",
            "Some thoughts on knowledge-enhanced machine learning.",
            "Clustering nonlinear time series with neural network bootstrap forecast distributions.",
            "Deciding when to quit the gambler's ruin game with unknown probabilities.",
            "Aggregation functions on n-dimensional ordered vectors equipped with an admissible order and an application in multi-criteria group decision-making.",
            "Generalized inferential models for censored data.",
            "Computing with confidence.",
            "Multi-attribute group three-way decision making with degree-based linguistic term sets.",
            "Spark solutions for discovering fuzzy association rules in Big Data.",
            "Special Issue on Robustness in Probabilistic Graphical Models.",
            "Cophenetic-based fuzzy clustering of time series by linear dependency.",
            "On topologies defined by neighbourhood operators of approximation spaces.",
            "Belief functions clustering for epipole localization.",
            "Similarity of intuitionistic fuzzy sets and its applications.",
            "A trivariate Gaussian copula stochastic frontier model with sample selection.",
            "On the classification of financial data with domain agnostic features.",
            "Multi-attribute three-way decisions based on ideal solutions under interval-valued intuitionistic fuzzy environment.",
            "A compositional approach to probabilistic knowledge compilation.",
            "A retrospective on Isaac Levi: June 30, 1930 - December 25, 2018.",
            "Special issue from the 15th European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2019).",
            "Rough set approaches in knowledge structures.",
            "A copula-based uncertainty propagation method for structures with correlated parametric p-boxes.",
            "A constraint-based algorithm for the structural learning of continuous-time Bayesian networks.",
            "Evidential instance selection for K-nearest neighbor classification of big data.",
            "Learning Bayesian networks from incomplete data with the node-average likelihood.",
            "A novel multi-granularity three-way decision making approach in q-rung orthopair fuzzy information systems.",
            "The dual polyhedron to the chordal graph polytope and the rebuttal of the chordal graph conjecture.",
            "Clustering high dimensional meteorological scenarios: Results and performance index.",
            "Three-way conflict analysis based on hesitant fuzzy information systems.",
            "Simple contrapositive assumption-based argumentation part II: Reasoning with preferences.",
            "Efficient vectors for simple perturbed consistent matrices.",
            "Incremental fuzzy rough sets based feature subset selection using fuzzy min-max neural network preprocessing.",
            "Hierarchical time series clustering on tail dependence with linkage based on a multivariate copula approach.",
            "Migrativity properties of uninorms over 2-uninorms.",
            "A relative uncertainty measure for fuzzy rough feature selection.",
            "Efficient algorithms for Risk-Sensitive Markov Decision Processes with limited budget.",
            "Characteristic numbers and approximation operators in generalized rough approximation system.",
            "The extended Recursive Noisy OR model: Static and dynamic considerations.",
            "Pairwise comparisons matrix decomposition into approximation and orthogonal component using Lie theory."
        ]
    },
    {
        "name": "IJAR",
        "year": "2020",
        "info": "2020: Volumes\n116,\n117,\n118,\n119,\n120,\n121,\n122,\n123,\n124,\n125,\n126,\n127",
        "count": 130,
        "papers": [
            "Sequential decision making under ordinal uncertainty: A qualitative alternative to the Hurwicz criterion.",
            "Ordinal sums of the main classes of fuzzy negations and the natural negations of t-norms, t-conorms and fuzzy implications.",
            "Preservation of preferences intensity of an inconsistent Pairwise Comparison Matrix.",
            "Solving the nondeterministic static governing equations of structures subjected to various forces under fuzzy and interval uncertainty.",
            "Binary topological relations on the digital sphere.",
            "Optimal granule level selection: A granule description accuracy viewpoint.",
            "Three-way granular computing, rough sets, and formal concept analysis.",
            "Accuracy of approximation operators during covering evolutions.",
            "A bias-variance based heuristic for constructing a hybrid logistic regression-naïve Bayes model for classification.",
            "Discovering causal graphs with cycles and latent confounders: An exact branch-and-bound approach.",
            "Special issue from the 5th International Conference on Belief Functions (BELIEF 2018).",
            "Copulas and fuzzy implications.",
            "Preference disaggregation for multiple criteria sorting with partial monotonicity constraints: Application to exposure management of nanomaterials.",
            "A novel T-S fuzzy particle filtering algorithm based on fuzzy C-regression clustering.",
            "Quantitative three-way class-specific attribute reducts based on region preservations.",
            "Multi-attribute group decision-making method based on multi-granulation weights and three-way decisions.",
            "Discernibility matrix based incremental feature selection on fused decision tables.",
            "Constructing copulas from shock models with imprecise distributions.",
            "Variance based three-way clustering approaches for handling overlapping clustering.",
            "Finding strongly connected components of simple digraphs based on granulation strategy.",
            "New transformations of aggregation functions based on monotone systems of functions.",
            "On the construction of uninorms by paving.",
            "Effectiveness assessment of Cyber-Physical Systems.",
            "Complexity results for probabilistic answer set programming.",
            "Indices for rough set approximation and the application to confusion matrices.",
            "Incremental concept-cognitive learning based on attribute topology.",
            "The linear algebra of pairwise comparisons.",
            "Testing the degree of overlap for the expected value of random intervals.",
            "A new rule reduction and training method for extended belief rule base based on DBSCAN algorithm.",
            "Data meaning and knowledge discovery: Semantical aspects of information systems.",
            "Belief function of Pythagorean fuzzy rough approximation space and its applications.",
            "Multilevel surrogate modeling approach for optimization problems with polymorphic uncertain parameters.",
            "A correctness result for synthesizing plans with loops in stochastic domains.",
            "Extending characteristic relations on an incomplete data set by the three-way decision theory.",
            "Accelerator for supervised neighborhood based attribute reduction.",
            "Modeling agent's conditional preferences under objective ambiguity in Dempster-Shafer theory.",
            "A multiple attribute decision making three-way model for intuitionistic fuzzy numbers.",
            "Probabilistic abstract argumentation frameworks, a possible world view.",
            "Partially observable game-theoretic agent programming in Golog.",
            "A rule-based framework for risk assessment in the health domain.",
            "On properties of a new decomposable entropy of Dempster-Shafer belief functions.",
            "Strategy selection under entropy measures in movement-based three-way decision.",
            "The three-way-in and three-way-out framework to treat and exploit ambiguity in data.",
            "The relationships between topologies and generalized rough sets.",
            "Incremental reasoning in probabilistic Signal Temporal Logic.",
            "On distributive laws between 2-uninorms and overlap (grouping) functions.",
            "Generalized transitivity: A systematic comparison of concepts with an application to preferences in the Babington Smith model.",
            "A decoupled design approach for complex systems under lack-of-knowledge uncertainty.",
            "Incremental updating probabilistic neighborhood three-way regions with time-evolving attributes.",
            "A short note on decomposition and composition of knowledge.",
            "Non-parametric learning of lifted Restricted Boltzmann Machines.",
            "Learning directed acyclic graph SPNs in sub-quadratic time.",
            "A binary water wave optimization for feature selection.",
            "Monotonicity of the system function of a SISO FRI system with neutrality and ordering property preserving fuzzy implications.",
            "Mean-entropy-based shadowed sets: A novel three-way approximation of fuzzy sets.",
            "A heuristic representation learning based on evidential memberships: Case study of UCI-SPECTF.",
            "Topological operators of MW-topological rough approximations.",
            "Three-way decision with incomplete information based on similarity and satisfiability.",
            "A model of three-way decisions for Knowledge Harnessing.",
            "Attribute implications in L-concept analysis with positive and negative attributes: Validity and properties of models.",
            "Prejudice in uncertain information merging: Pushing the fusion paradigm of evidence theory further.",
            "An Ant Colony Optimization approach for symbolic regression using Straight Line Programs. Application to energy consumption modelling.",
            "On consistent functions for neighborhood systems.",
            "Label distribution learning: A local collaborative mechanism.",
            "On the fictitious default algorithm in fuzzy financial networks.",
            "Simple contrapositive assumption-based argumentation frameworks.",
            "L-partial metrics and their topologies.",
            "A min-max regret approach to maximum likelihood inference under incomplete data.",
            "Probabilities of conditionals and previsions of iterated conditionals.",
            "Constructing three-way concept lattice based on the composite of classical lattices.",
            "A variable and a fixed ordering of intervals and their application in optimization with interval-valued functions.",
            "Interval-valued fuzzy reasoning full implication algorithms based on the t-representable t-norm.",
            "Fubini theorem and generalized Minkowski inequality for the pseudo-integral.",
            "On the quantification and efficient propagation of imprecise probabilities with copula dependence.",
            "Multi-granulation method for information fusion in multi-source decision information system.",
            "Probabilistic stability analyses of slope reinforced with piles in spatially variable soils.",
            "Dependence space models to construct concept lattices.",
            "Aggregation of experts' opinions and conditional consensus opinion by the Steiner point.",
            "Depth-bounded Belief functions.",
            "Weighted partial order oriented three-way decisions under score-based common voting rules.",
            "Non-linear failure rate: A Bayes study using Hamiltonian Monte Carlo simulation.",
            "New two-sided confidence intervals for binomial inference derived using Walley's imprecise posterior likelihood as a test statistic.",
            "Double-quantitative variable consistency dominance-based rough set approach.",
            "Granulation in Rough Set Theory: A novel perspective.",
            "Left and right distributivity between semi-uninorms and semi-S-uninorms.",
            "On the use of group theory to generalize elements of pairwise comparisons matrix: A cautionary note.",
            "Discriminative training of feed-forward and recurrent sum-product networks by extended Baum-Welch.",
            "New results of fuzzy implications satisfying I(x, I(y, z))=I(I(x, y), I(x, z)).",
            "Dynamic Łukasiewicz Logic and Dynamic MV-algebras.",
            "Entropy and monotonicity in artificial intelligence.",
            "Consistent projections and indicators in pairwise comparisons.",
            "On the approximation of a membership function by empirical quantile functions.",
            "Three-way decision models based on multigranulation support intuitionistic fuzzy rough sets.",
            "Type-2 fuzzy multigranulation rough sets.",
            "An interval-valued utility theory for decision making with Dempster-Shafer belief functions.",
            "Special issue on 9th International Conference on Soft Methods in Probability and Statistics (SMPS).",
            "Distributivity between extended nullnorms and uninorms on fuzzy truth values.",
            "Toward a Dempster-Shafer theory of concepts.",
            "Tractable inference in credal sentential decision diagrams.",
            "Modelling epistemic irrelevance with choice functions.",
            "An axiomatic framework for influence diagram computation with partially ordered preferences.",
            "Observational nonidentifiability, generalized likelihood and free energy.",
            "The Fuzzy Logic Programming language FASILL: Design and implementation.",
            "BWM and MULTIMOORA-based multigranulation sequential three-way decision model for multi-attribute group decision-making problem.",
            "Heuristic-based feature selection for rough set approach.",
            "Constructions of overlap functions on bounded lattices.",
            "The joy of Probabilistic Answer Set Programming: Semantics, complexity, expressivity, inference.",
            "On generating random Gaussian graphical models.",
            "n-Dimensional (S, N)-implications.",
            "Fuzzy β-covering approximation spaces.",
            "Couple fuzzy covering rough set models and their generalizations to CCD lattices.",
            "Deterministic and stochastic damage detection via dynamic response analysis.",
            "Dynamic reliability analysis of nonlinear structures using a Duffing-system-based equivalent nonlinear system method.",
            "Algebraic aspects and coherence conditions for conjoined and disjoined conditionals.",
            "Notes on the lattice of fuzzy rough sets with crisp reference sets.",
            "Thirty years of credal networks: Specification, algorithms and complexity.",
            "Efficient algorithms for robustness analysis of maximum a posteriori inference in selective sum-product networks.",
            "Semiring programming: A semantic framework for generalized sum product problems.",
            "Efficient approaches for maintaining dominance-based multigranulation approximations with incremental granular structures.",
            "The dynamic update method of attribute-induced three-way granular concept in formal contexts.",
            "A probabilistic deontic argumentation framework.",
            "A lattice-based representation of independence relations for efficient closure computation.",
            "Extended belief rule-based model for environmental investment prediction with indicator ensemble selection.",
            "Partial-overall dominance three-way decision models in interval-valued decision systems.",
            "From equivalence queries to PAC learning: The case of implication theories.",
            "A practical reliability design method considering the compound weight and load-sharing.",
            "A novel quantum grasshopper optimization algorithm for feature selection.",
            "Modus tollens with respect to uninorms: U-Modus Tollens.",
            "On subjective expected value under ambiguity.",
            "Relationships between relation-based rough sets and belief structures."
        ]
    },
    {
        "name": "IJAR",
        "year": "2019",
        "info": "2019: Volumes\n104,\n105,\n106,\n107,\n108,\n109,\n110,\n111,\n112,\n113,\n114,\n115",
        "count": 152,
        "papers": [
            "A correspondence between belief function combination and knowledge base merging.",
            "Granular maximum decision entropy-based monotonic uncertainty measure for attribute reduction.",
            "Cost-sensitive feature selection via the ℓ2, 1-norm.",
            "An optimal safety assessment model for complex systems considering correlation and redundancy.",
            "Free algebras, states and duality for the propositional GödelΔ and Drastic Product logics.",
            "A hybrid method based on F-transform for robust estimators.",
            "Independent natural extension for infinite spaces.",
            "A sequential three-way approach to multi-class decision.",
            "Matrix approaches for some issues about minimal and maximal descriptions in covering-based rough sets.",
            "Corrigendum to \"Fuzzy implication functions based on powers of continuous t-norms\" [Int. J. Approx. Reason. 83 (2017) 265-279].",
            "Cost-sensitive approximate attribute reduction with three-way decisions.",
            "Evidential query-by-committee active learning for pedestrian detection in high-density crowds.",
            "A factor graph approach to automated design of Bayesian signal processing algorithms.",
            "Revision of defeasible preferences.",
            "An argumentation-based approach for identifying and dealing with incompatibilities among procedural goals.",
            "The law of O-conditionality for fuzzy implications constructed from overlap and grouping functions.",
            "Cost-sensitive active learning with a label uniform distribution model.",
            "Selecting strategic partner for tax information systems based on weight learning with belief structures.",
            "A cost-sensitive three-way combination technique for ensemble learning in sentiment classification.",
            "Errors bounds for finite approximations of coherent lower previsions on finite probability spaces.",
            "Pseudo-label neighborhood rough set: Measures and attribute reductions.",
            "Sum-of-squares for bounded rationality.",
            "Cost-sensitive three-way class-specific attribute reduction.",
            "Direct causal structure extraction from pairwise interaction patterns in NAT modeling Bayesian networks.",
            "Belief and plausibility functions of type-2 fuzzy rough sets.",
            "Confluence and convergence modulo equivalence in probabilistically terminating reduction systems.",
            "Assessing the accuracy of diagnostic probability estimation: Evidence for defeasible modus ponens.",
            "A general reduction method for fuzzy objective relation systems.",
            "From fine-grained properties to broad principles for gradual argumentation: A principled spectrum.",
            "Robust topological policy iteration for infinite horizon bounded Markov Decision Processes.",
            "Models for pessimistic or optimistic decisions under different uncertain scenarios.",
            "Multi-objective attribute reduction in three-way decision-theoretic rough set model.",
            "Approximation of incoherent probabilities.",
            "Multi-granularity principal curves extraction based on improved spectral clustering of complex distribution data.",
            "Roughness measures of locally finite covering rough sets.",
            "Information-gain computation in the Fifth system.",
            "Multigranulation sequential three-way decisions based on multiple thresholds.",
            "FANCFIS: Fast adaptive neuro-complex fuzzy inference system.",
            "A fast attribute reduction method for large formal decision contexts.",
            "Attribute reduction based on k-nearest neighborhood rough sets.",
            "Speeding up parameter and rule learning for acyclic probabilistic logic programs.",
            "From pairwise comparisons to consistency with respect to a group operation and Koczkodaj's metric.",
            "On indexing evidential data.",
            "Probabilistic Logic Programming (PLP 2017).",
            "Diversity-induced fuzzy clustering.",
            "A capacity-based framework encompassing Belnap-Dunn logic for reasoning about multisource information.",
            "Evaluating betting odds and free coupons using desirability.",
            "Chebyshev inequality for q-integrals.",
            "On binary relations induced from overlap and grouping functions.",
            "Computational method for fuzzy arithmetic operations on triangular fuzzy numbers by extension principle.",
            "D number theory based game-theoretic framework in adversarial decision making under a fuzzy environment.",
            "Marcus-Wyse topological rough sets and their applications.",
            "Design methodology for Radial Basis Function Neural Networks classifier based on locally linear reconstruction and Conditional Fuzzy C-Means clustering.",
            "A three-way decision ensemble method for imbalanced data oversampling.",
            "Quantile and expectile smoothing based on L1-norm and L2-norm fuzzy transforms.",
            "Special issue from the 4th International Conference on Belief Functions (BELIEF 2016), September 21-23, 2016, Prague, CZ.",
            "Safety case confidence propagation based on Dempster-Shafer theory.",
            "Polynomial copula transformations.",
            "Uncertainty Management in Machine Learning Applications.",
            "Typicalities and probabilities of exceptions in nonmotonic Description Logics.",
            "Improving Bayesian network local structure learning via data-driven symmetry correction methods.",
            "Indirect disjunctive belief rule base modeling using limited conjunctive rules: Two possible means.",
            "Surrogate outcomes and transportability.",
            "Long-term prediction of time series based on stepwise linear division algorithm and time-variant zonary fuzzy information granules.",
            "Learning Bayesian network parameters via minimax algorithm.",
            "A new approach for probability calculation of fuzzy events in Bayesian Networks.",
            "Fuzzy four-fold tables: Their properties and use in fuzzy association analysis.",
            "Solving sequential collective decision problems under qualitative uncertainty.",
            "Compact structures for continuous time Bayesian networks.",
            "Decision reducts and bireducts in a covering approximation space and their relationship to set definability.",
            "A comprehensive study of argumentation frameworks with sets of attacking arguments.",
            "Decision-making with belief functions: A review.",
            "Learning with imprecise probabilities as model selection and averaging.",
            "A new class of continuous Bayesian networks.",
            "Outer approximating coherent lower probabilities with belief functions.",
            "Three-way group decisions with interval-valued decision-theoretic rough sets based on aggregating inclusion measures.",
            "From set relations to belief function relations.",
            "Object-oriented interval-set concept lattices.",
            "Liberalism and dictatorship in the problem of fuzzy classification.",
            "Characteristics and applications of JI, B-implications via some classical logic tautologies.",
            "The finite model theory of Bayesian network specifications: Descriptive complexity and zero/one laws.",
            "Residual operations of monotone binary operations over complete lattices.",
            "Multi-source multiple change on belief bases.",
            "Complementary Lipschitz continuity results for the distribution of intersections or unions of independent random sets in finite discrete spaces.",
            "New constructions of uninorms on bounded lattices.",
            "Certain information granule system as a result of sets approximation by fuzzy context.",
            "L-equivalence relations on L-fuzzy sets, L-partitions of L-fuzzy sets and their one-to-one connections.",
            "A general approach to reasoning with probabilities.",
            "Corrigendum to \"A Bayesian network interpretation of the Cox's proportional hazard model\" [Int. J. Approx. Reason. 103 (2018) 195-211].",
            "Special issue on \"Uncertainty in Cloud Computing: Concepts, Challenges and Current Solutions\".",
            "An empirical evaluation of the approximation of subjective logic operators using Monte Carlo simulations.",
            "Designing fuzzy time series forecasting models: A survey.",
            "Special issue on the tenth International Symposium on Imprecise Probability: Theories and Applications (ISIPTA '17).",
            "Editorial: Defeasible and Ampliative Reasoning.",
            "Bayesian inference using stochastic logic: A study of buffering schemes for mitigating autocorrelation.",
            "Cutting levels of the winning probability relation of random variables pairwisely coupled by a same Frank copula.",
            "Imperfect information as a source of non-symmetry in the two envelope problem.",
            "EMIL: Extracting Meaning from Inconsistent Language: Towards argumentation using a controlled natural language interface.",
            "Eliminating overfitting of probabilistic topic models on short and noisy text: The role of dropout.",
            "Linear fuzzy rule base interpolation using fuzzy geometry.",
            "The contradiction between belief functions: Its description, measurement, and correction based on generalized credal sets.",
            "Multifunctions determined by integrable functions.",
            "Empirical analysis of the maximum asymptotic bias of location estimators for fuzzy number-valued data.",
            "Conditional submodular Choquet expected values and conditional coherent risk measures.",
            "False confidence, non-additive beliefs, and valid statistical inference.",
            "Interval-valued fuzzy inference based on aggregation functions.",
            "Improving and benchmarking of algorithms for decision making with lower previsions.",
            "Sensitivity analysis beyond linearity.",
            "Some new properties of inconsistent pairwise comparisons matrices.",
            "Adversarial classification: An adversarial risk analysis approach.",
            "Missing values and dragonfly operations in fuzzy relational compositions.",
            "Soft dominance based rough sets with applications in information systems.",
            "Multiple-rules reasoning based on Triple I method on Atanassov's intuitionistic fuzzy sets.",
            "Delegated updates in epistemic graphs for opponent modelling.",
            "A hierarchy of sum-product networks using robustness.",
            "On the convexity of preferences in decisions and games under (quasi-)convex/concave imprecise probability correspondences.",
            "A new evidential K-nearest neighbor rule based on contextual discounting with partially supervised learning.",
            "On the relative expressiveness of Bayesian and neural networks.",
            "Three-way decisions based feature fusion for Chinese irony detection.",
            "Developing an online general type-2 fuzzy classifier using evolving type-1 rules.",
            "Gait recognition using fuzzy ontologies and Kinect sensor data.",
            "On the application of T-norms to gravitational wave data fusion: A confirmatory study.",
            "Nearly-Linear uncertainty measures.",
            "A representation of continuous domains via relationally approximable concepts in a generalized framework of formal concept analysis.",
            "Three-way fuzzy matroids and granular computing.",
            "Sufficient and necessary conditions for solution finding in valuation-based systems.",
            "Learning Bayesian network structures using weakest mutual-information-first strategy.",
            "Statistical inference for time series with non-precise data.",
            "An adaptive granulation algorithm for community detection based on improved label propagation.",
            "Fuzzy information granular structures: A further investigation.",
            "Three-way dual concept analysis.",
            "Control charts based on fuzzy costs for monitoring short autocorrelated time series.",
            "Textural formal context.",
            "Possibilistic randomisation in strategic-form games.",
            "The reducibility of matrix sweeping operations: A computational issue in linear belief functions.",
            "General form of Chebyshev type inequality for generalized Sugeno integral.",
            "A review and proposal of (fuzzy) clustering for nonlinearly separable data.",
            "A three-way cluster ensemble approach for large-scale data.",
            "Large-scale local causal inference of gene regulatory relationships.",
            "Learning Bayesian networks with local structure, mixed variables, and exact algorithms.",
            "Bounding inferences for large-scale continuous-time Markov chains: A new approach based on lumping and imprecise Markov chains.",
            "Estimation of classification probabilities in small domains accounting for nonresponse relying on imprecise probability.",
            "Maps between covering approximation spaces and the product space of two covering approximation spaces.",
            "Generalized multi-granulation double-quantitative decision-theoretic rough set of multi-source information system.",
            "Six-Set Approximation Theorem of neighborhood related rough sets.",
            "Generalized multi-scale decision tables with multi-scale decision attributes.",
            "Knowledge structure preserving fuzzy attribute reduction in fuzzy formal context.",
            "Towards quantification of incompleteness in the pairwise comparisons methods.",
            "Who learns better Bayesian network structures: Accuracy and speed of structure learning algorithms.",
            "New methods to construct uninorms on bounded lattices.",
            "A polynomial-time fragment of epistemic probabilistic argumentation.",
            "Fuzzy Lasso regression model with exact explanatory variables and fuzzy responses."
        ]
    },
    {
        "name": "IJAR",
        "year": "2018",
        "info": "2018: Volumes\n92,\n93,\n94,\n95,\n96,\n97,\n98,\n99,\n100,\n101,\n102,\n103",
        "count": 154,
        "papers": [
            "Bivariate quadratic copula constructions.",
            "A method to construct fuzzy implications-rotation construction.",
            "Idempotent conjunctive and disjunctive combination of belief functions by distance minimization.",
            "A new definition of entropy of belief functions in the Dempster-Shafer theory.",
            "A novel weighted defence and its relaxation in abstract argumentation.",
            "A new definition of order relation for the introduction of algebraic fuzzy closure operators.",
            "Lexicographic choice functions.",
            "On the impact of configuration on abstract argumentation automated reasoning.",
            "SELP: Semi-supervised evidential label propagation algorithm for graph data clustering.",
            "On conditional truncated densities Bayesian networks.",
            "Feature selection using rough set-based direct dependency calculation by avoiding the positive region.",
            "An empirical study of Bayesian network inference with simple propagation.",
            "On the α(u, v)-symmetric implicational method for R- and (S, N)-implications.",
            "Frequency-calibrated belief functions: Review and new insights.",
            "Evidential probability of signals on a price herd predictions: Case study on solar energy companies.",
            "An empirical study of testing independencies in Bayesian networks using rp-separation.",
            "A new framework for the statistical analysis of set-valued random elements.",
            "Blankets Joint Posterior score for learning Markov network structures.",
            "A framework for learning fuzzy rule-based models with epistemic set-valued data and generalized loss functions.",
            "Approximate classification with web ontologies through evidential terminological trees and forests.",
            "On pruning with the MDL Score.",
            "On multivariate asymmetric dependence using multivariate skew-normal copula-based regression.",
            "UC-LTM: Unidimensional clustering using latent tree models for discrete data.",
            "Modelling incomplete information in Boolean games using possibilistic logic.",
            "Opinion diffusion and influence: A logical approach.",
            "Evidential box particle filter using belief function theory.",
            "A fuzzy-based strategy for multi-domain sentiment analysis.",
            "Tractability of most probable explanations in multidimensional Bayesian network classifiers.",
            "Likelihood-fuzzy analysis: From data, through statistics, to interpretable fuzzy classifiers.",
            "Probabilistic inferences from conjoined to iterated conditionals.",
            "Approximate inference in Bayesian networks: Parameterized complexity results.",
            "Efficient belief propagation in second-order Bayesian networks for singly-connected graphs.",
            "Fast approximation of variational Bayes Dirichlet process mixture using the maximization-maximization algorithm.",
            "A general unified framework for interval pairwise comparison matrices.",
            "Towards a probability theory for product logic: States, integral representation and reasoning.",
            "Advantages of M-estimators of location for fuzzy numbers based on Tukey's biweight loss function.",
            "A general framework for maximizing likelihood under incomplete data.",
            "On the characterizations of fuzzy implications satisfying I(x, I(y, z))=I(I(x, y), I(x, z)).",
            "Skyline queries over possibilistic RDF data.",
            "Approximating maxmin strategies in imperfect recall games using A-loss recall property.",
            "Special issue on \"Uncertainty Reasoning for the Web\".",
            "Ambiguous games without a state space and full rationality.",
            "Ontological query answering under many-valued group preferences in Datalog+/-.",
            "On the relationship between fuzzy description logics and many-valued modal logics.",
            "An extension-based approach to belief revision in abstract argumentation.",
            "Three-way decisions approach to multiple attribute group decision making with linguistic information-based decision-theoretic rough fuzzy set.",
            "A novel incremental attribute reduction approach for dynamic incomplete decision systems.",
            "Adaptive fuzzy partitions for evolving association rules in big data stream.",
            "Empirical evaluation of abstract argumentation: Supporting the need for bipolar and probabilistic approaches.",
            "Statistical properties of the fuzzy p-value.",
            "Learning to rank in PRISM.",
            "An analogical hexagon.",
            "Axiomatization of inconsistency indicators for pairwise comparisons.",
            "New methods for small area estimation with linkage uncertainty.",
            "Labeled fuzzy approximations based on bisimulations.",
            "Robust, fuzzy, and parsimonious clustering, based on mixtures of Factor Analyzers.",
            "A characterization of types of support between structured arguments and their relationship with support in abstract argumentation.",
            "Uncertain Logic Processing: logic-based inference and reasoning using Dempster-Shafer models.",
            "Nguyen type theorem for extension principle based on a joint possibility distribution.",
            "Inconsistency of special cases of pairwise comparisons matrices.",
            "An interval-based approach to model input uncertainty in M/M/1 simulation.",
            "Collaborative Topic Model for Poisson distributed ratings.",
            "An efficient algorithm for Hiding High Utility Sequential Patterns.",
            "An improved method for solving Hybrid Influence Diagrams.",
            "Covering-based rough sets and modal logics. Part II.",
            "The capacitated vehicle routing problem with evidential demands.",
            "Efficient learning of bounded-treewidth Bayesian networks from complete and incomplete data sets.",
            "Discovery of statistical equivalence classes using computer algebra.",
            "Deterministic annealing process for pLSA-induced fuzzy co-clustering and cluster splitting characteristics.",
            "An uncertainty perspective to PCM and APCM clustering.",
            "Decision analysis networks.",
            "Special issue on soft methods in probability and statistics (SMPS 2016).",
            "Performance analysis of fuzzy systems based on quintuple implications method.",
            "Partial data querying through racing algorithms.",
            "Probabilistic logic programming (PLP) 2016.",
            "Matrix representations and interdependency on L-fuzzy covering-based approximation operators.",
            "Handling noise in Boolean matrix factorization.",
            "An incremental approach for data quality measurement with insufficient information.",
            "A study of (T, N)-implications and its use to construct a new class of fuzzy subsethood measure.",
            "Explicit analytical formulae of ranking indices without the requirement of multiplicative compatibility.",
            "Local rough set: A solution to rough data analysis in big data.",
            "Fuzzy approximations of fuzzy relational structures.",
            "A three-way clustering approach for handling missing data using GTRS.",
            "Notions from rough set theory in a generalized dependency relation context.",
            "A generic framework to include belief functions in preference handling and multi-criteria decision.",
            "A probabilistic procedure for quantifying the relative importance of model inputs characterized by second-order probability models.",
            "Upper and lower probabilistic preferences in the graph model for conflict resolution.",
            "Concepts for decision making under severe uncertainty with partial ordinal and partial cardinal preferences.",
            "Kurt Weichselberger's contribution to imprecise probabilities and statistical inference.",
            "Towards an understanding of cloud services under uncertainty: A possibilistic approach.",
            "Eigenfrequency and deflection analysis of layered structure using uncertain elastic properties - a fuzzy finite element approach.",
            "Approximations of arbitrary relations by partial orders.",
            "Improving multi-armed bandit algorithms in online pricing settings.",
            "Double-quantitative decision-theoretic approach to multigranulation approximate space.",
            "Bisimulations for fuzzy transition systems revisited.",
            "Robust fuzzy clustering of multivariate time trajectories.",
            "Evaluation of arguments in weighted bipolar graphs.",
            "Probabilistic spatio-temporal knowledge bases: Capacity constraints, count queries, and consistency checking.",
            "A review of applications of fuzzy sets to safety and reliability engineering.",
            "New distributions for modeling subjective lower and upper probabilities.",
            "The investigation of covering rough sets by Boolean matrices.",
            "Exchangeable choice functions.",
            "Copulas, uncertainty, and false discovery rate control.",
            "Scalable importance sampling estimation of Gaussian mixture posteriors in Bayesian networks.",
            "On interval (G, N)-implications and (O, G, N)-implications derived from interval overlap and grouping functions.",
            "A combined scoring and ranking approach for determining overall food quality.",
            "Logical foundation of the quintuple implication inference methods.",
            "Bsmooth: Learning from user feedback to disambiguate query terms in interactive data retrieval.",
            "Imprecise Monte Carlo simulation and iterative importance sampling for the estimation of lower previsions.",
            "Linear criterion for testing the extremity of an exact game based on its finest min-representation.",
            "Identification of elastic properties in the belief function framework.",
            "A residue-based approach for resource provisioning by horizontal scaling across heterogeneous clouds.",
            "Basic operations for fuzzy multisets.",
            "Information structures and uncertainty measures in a fully fuzzy information system.",
            "Agreeing to disagree and dilation.",
            "Robustifying sum-product networks.",
            "2-Monotone outer approximations of coherent lower probabilities.",
            "Distance-based double-quantitative rough fuzzy sets with logic operations.",
            "Analogical proportions: From equality to inequality.",
            "Dicovering approximation spaces and definability.",
            "Feature selection based on composition of rough sets induced by feature granulation.",
            "Improved linear programming methods for checking avoiding sure loss.",
            "Explanatory relations in arbitrary logics based on satisfaction systems, cutting and retraction.",
            "The Collapsing Defuzzifier for discretised generalised type-2 fuzzy sets.",
            "Unsupervised segmentation of hidden Markov fields corrupted by correlated non-Gaussian noise.",
            "AC-RRNS: Anti-collusion secured data sharing scheme for cloud storage.",
            "On scoring Maximal Ancestral Graphs with the Max-Min Hill Climbing algorithm.",
            "Towards a Fuzzy Bigraphical Multi Agent System for Cloud of Clouds Elasticity Management.",
            "Type-2 fuzzy implications and fuzzy-valued approximation reasoning.",
            "Exploiting multiple word embeddings and one-hot character vectors for aspect-based sentiment analysis.",
            "Partial meet pseudo-contractions.",
            "Reasoning in the Defeasible Description Logic εℒ - computing standard inferences under rational and relevant semantics.",
            "Hierarchical two-part MDL code for multinomial distributions.",
            "A correlation coefficient for belief functions.",
            "Three-way decision and granular computing.",
            "Evenly convex credal sets.",
            "The uncertain cloud: State of the art and research challenges.",
            "An online sequential procurement mechanism under uncertain demands in multi-cloud environment.",
            "How to modify a fuzzy implication function to satisfy a desired property.",
            "An evaluation of probabilistic approaches to inference to the best explanation.",
            "A Bayesian network interpretation of the Cox's proportional hazard model.",
            "A fast analytical approximation type-reduction method for a class of spiked concave type-2 fuzzy sets.",
            "GPS trajectory data segmentation based on probabilistic logic.",
            "Geometrical aggregation of finite fuzzy sets.",
            "Corrigendum to \"Towards a probability theory for product logic: States, integral representation and reasoning\" [Int. J. Approx. Reason. 93 (2018) 199-218].",
            "Adaptive decision making via entropy minimization.",
            "Adaptive multidimensional fuzzy sets for texture modeling.",
            "Evidential split-and-merge: Application to object-based image analysis.",
            "2CoBel: A scalable belief function representation for 2D discernment frames.",
            "Lexicographic refinements in stationary possibilistic Markov Decision Processes.",
            "PRISM revisited: Declarative implementation of a probabilistic programming language using multi-prompt delimited control.",
            "Axiomatization of covering-based approximation operators generated by general or irreducible coverings.",
            "A three-way selective ensemble model for multi-label classification.",
            "Communication between fuzzy information systems using fuzzy covering-based rough sets."
        ]
    },
    {
        "name": "IJAR",
        "year": "2017",
        "info": "2017: Volumes\n80,\n81,\n82,\n83,\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91",
        "count": 193,
        "papers": [
            "A novel Chow-Liu algorithm and its application to gene differential analysis.",
            "Bayesian nonparametric clustering and association studies for candidate SNP observations.",
            "Bridging the intuition gap in Cox's theorem: A Jaynesian argument for universality.",
            "Distributional logic programming for Bayesian knowledge representation.",
            "Bayesian nonparametric system reliability using sets of priors.",
            "The unwalked path between quasi-copulas and copulas: Stepping stones in higher dimensions.",
            "Comparison of reduction in formal decision contexts.",
            "On the implications of integrating linear tracing procedure with imprecise probabilities.",
            "Computing lower and upper expected first-passage and return times in imprecise birth-death chains.",
            "A double-copula stochastic frontier model with dependent error components and correction for sample selection.",
            "Information fusion from multiple databases using meta-association rules.",
            "Bounds on skyline probability for databases with uncertain preferences.",
            "Note on \"A rough set approach to the characterization of transversal matroids\" [Int. J. Approx. Reason. 70(2016) 1-12].",
            "Interval type-2 fuzzy decision making.",
            "Two-probabilities focused combination in recommender systems.",
            "Bayes linear kinematics in a dynamic survival model.",
            "Nonparametric adaptive Bayesian regression using priors with tractable normalizing constants and under qualitative assumptions.",
            "Efficient score-based Markov Blanket discovery.",
            "An extended depth-first search algorithm for optimal triangulation of Bayesian networks.",
            "A survey of lifted inference approaches for probabilistic logic programming under the distribution semantics.",
            "Fuzzy topology via fuzzy geometric logic with graded consequence.",
            "Relations arising from coverings and their topological structures.",
            "ECSQARU 2015 special issue.",
            "Balanced sensitivity functions for tuning multi-dimensional Bayesian network classifiers.",
            "Concise representations and construction algorithms for semi-graphoid independency models.",
            "Evaluating interval-valued influence diagrams.",
            "Efficient learning of Bayesian networks with bounded tree-width.",
            "Contraction in propositional logic.",
            "On an MCS-based inconsistency measure.",
            "Hybrid time Bayesian networks.",
            "A two-phase method for extracting explanatory arguments from Bayesian networks.",
            "Long-term forecasting of time series based on linear fuzzy information granules and fuzzy inference system.",
            "Incremental fuzzy probabilistic rough sets over two universes.",
            "Rough approximations based on bisimulations.",
            "Uses and computation of imprecise probabilities from statistical data and expert arguments.",
            "Three-way group decision making based on multigranulation fuzzy decision-theoretic rough set over two universes.",
            "Gini objective functions for three-way classifications.",
            "Self-dual operators and a general framework for weighted nilpotent operators.",
            "Theory and computations for the Dirichlet process and related models: An overview.",
            "An inquiry into approximate operations on fuzzy numbers.",
            "Envelopes of conditional probabilities extending a strategy and a prior probability.",
            "Generalized comonotonicity and new axiomatizations of Sugeno integrals on bounded distributive lattices.",
            "Revisiting Karnik-Mendel Algorithms in the framework of Linear Fractional Programming.",
            "Nondeterministic fuzzy automata with membership values in complete residuated lattices.",
            "Scalable learning and inference in Markov logic networks.",
            "Quick general reduction algorithms for inconsistent decision tables.",
            "Oddness/evenness-based classifiers for Boolean or numerical data.",
            "Uncertain logical gates in possibilistic networks: Theory and application to human geography.",
            "Local multigranulation decision-theoretic rough sets.",
            "Propositional syntax and semantics induced knowledge re-structuring in a fuzzy logic network for ad hoc reasoning.",
            "Robustness in Bayesian nonparametrics.",
            "QL-operations and QL-implication functions constructed from tuples (O, G, N) and the generation of fuzzy subsethood and entropy measures.",
            "Interpretation of approximate numerical expressions: Computational model and empirical study.",
            "A three-way approach for learning rules in automatic knowledge-based topic models.",
            "Partial identification in statistical matching with misclassification.",
            "An approach to characterize graded entailment of arguments through a label-based framework.",
            "A multiple-valued logic approach for multigranulation rough set model.",
            "On two novel types of three-way decisions in three-way decision spaces.",
            "Indian Buffet Process dictionary learning: Algorithms and applications to image processing.",
            "Learning Gaussian graphical models with fractional marginal pseudo-likelihood.",
            "Negative probabilities in probabilistic logic programs.",
            "Algorithms for reasoning in very expressive description logics under infinitely valued Gödel semantics.",
            "Robust identification of highly persistent interest rate regimes.",
            "ERBlox: Combining matching dependencies with machine learning for entity resolution.",
            "Generalized three-way decision models based on subset evaluation.",
            "Topological structures of L-fuzzy rough sets and similarity sets of L-fuzzy relations.",
            "Characterization of uninorms with continuous underlying t-norm and t-conorm by means of the ordinal sum construction.",
            "Introduction to the special issue on Bayesian Nonparametrics.",
            "Short-term load forecasting method based on fuzzy time series, seasonality and long memory process.",
            "Three-way concept learning based on cognitive operators: An information fusion viewpoint.",
            "Repairing inconsistent answer set programs using rules of thumb: A gene regulatory networks case study.",
            "Fuzzy implication functions based on powers of continuous t-norms.",
            "Special Issue: Ninth International Symposium on Imprecise Probability: Theory and Applications (ISIPTA'15).",
            "Towards a geometry of imprecise inference.",
            "On the complexity of propositional and relational credal networks.",
            "The multilabel naive credal classifier.",
            "First-order under-approximations of consistent query answers.",
            "Exploiting collective knowledge with three-way decision theory: Cases from the questionnaire-based research.",
            "Tri-partition neighborhood covering reduction for robust classification.",
            "Cell signaling as a probabilistic computer.",
            "Quick and energy-efficient Bayesian computing of binocular disparity using stochastic digital signals.",
            "Particle MCMC algorithms and architectures for accelerating inference in state-space models.",
            "A survey on learning approaches for Undirected Graphical Models. Application to scene object recognition.",
            "Bipolarity in temporal argumentation frameworks.",
            "Interval-valued quintuple implication principle of fuzzy reasoning.",
            "Minimal solutions of generalized fuzzy relational equations: Clarifications and corrections towards a more flexible setting.",
            "Imprecise probability: Theories and applications.",
            "On repairing and querying inconsistent probabilistic spatio-temporal databases.",
            "Decision bireducts and decision reducts - a comparison.",
            "Labellings for assumption-based and abstract argumentation.",
            "Optimal design of priors constrained by external predictors.",
            "Partial orderings for hesitant fuzzy sets.",
            "Graded cubes of opposition and possibility theory with fuzzy events.",
            "An argumentation system for defeasible reasoning.",
            "Weighted argumentation for analysis of discussions in Twitter.",
            "Uncertainty and reduction of variable precision multigranulation fuzzy rough sets based on three-way decisions.",
            "Copulas with given values on the tails.",
            "Cost-sensitive sequential three-way decision modeling using a deep neural network.",
            "Rough cognitive ensembles.",
            "Perspective-oriented data analysis through the development of information granules of order 2.",
            "Credal networks under epistemic irrelevance.",
            "Approximation enhancement for stochastic Bayesian inference.",
            "Dealing with under-reported variables: An information theoretic solution.",
            "The effect of combination functions on the complexity of relational Bayesian networks.",
            "Attribute reduction for sequential three-way decisions under dynamic granulation.",
            "Measuring inconsistency with many-valued logics.",
            "Management of uncertainty in Artificial Intelligence and databases.",
            "Note on \"Frequentistic approximations to Bayesian prevision of exchangeable random elements\" [Int. J. Approx. Reason. 78 (2016) 138-152].",
            "Cost-sensitive three-way recommendations by learning pair-wise preferences.",
            "Collaborative fuzzy clustering algorithm: Some refinements.",
            "Possibility and necessity measures and integral equivalence.",
            "On normalization of inconsistency indicators in pairwise comparisons.",
            "Learning preferences from paired opposite-based semantics.",
            "A Bayesian hierarchy for robust gaze estimation in human-robot interaction.",
            "Formal methods for reasoning and uncertainty reduction in evidential grid maps.",
            "Generalizing type-2 fuzzy ontologies and type-2 fuzzy description logics.",
            "Efficient probabilistic inference in Bayesian networks with multi-valued NIN-AND tree local models.",
            "A three-way decisions model with probabilistic rough sets for stream computing.",
            "Possibilistic and fuzzy clustering methods for robust analysis of non-precise data.",
            "On the belief structures and reductions of multigranulation spaces with decisions.",
            "Plausible reasoning and plausibility monitoring in language comprehension.",
            "Weak Dutch Books with imprecise previsions.",
            "Interval-valued implications and interval-valued strong equality index with admissible orders.",
            "Learning structures of Bayesian networks for variable groups.",
            "Hypothesis testing-based comparative analysis between rating scales for intrinsically imprecise data.",
            "Logics with lower and upper probability operators.",
            "Asymmetric hidden Markov models.",
            "A Banzhaf value for games with a proximity relation among the agents.",
            "Inconsistency-tolerant reasoning over linear probabilistic knowledge bases.",
            "Uncertain lightweight ontologies in a product-based possibility theory framework.",
            "Towards using the chordal graph polytope in learning decomposable models.",
            "Probabilistic squares and hexagons of opposition under coherence.",
            "Notes on covering-based rough sets from topological point of view: Relationships with general framework of dual approximation operators.",
            "Unconventional computing for Bayesian inference.",
            "From propositional logic to plausible reasoning: A uniqueness theorem.",
            "Dependency structures for decision tables.",
            "Estimating bounds on causal effects in high-dimensional and possibly confounded systems.",
            "Advances in Weighted Logics for Artificial Intelligence.",
            "Basic ideas underlying conglomerability and disintegrability.",
            "Three-way attribute reducts.",
            "Scaling up Bayesian variational inference using distributed computing clusters.",
            "Imprecise continuous-time Markov chains.",
            "Workshop on Uncertainty Processing - WUPES 15.",
            "Hierarchical models as marginals of hierarchical models.",
            "Fuzzy memberships as likelihood functions in a possibilistic framework.",
            "Influence diagrams for speed profile optimization.",
            "Representing independence models with elementary triplets.",
            "An empirical comparison of popular structure learning algorithms with a view to gene network inference.",
            "Composition operator for densities of continuous variables.",
            "A new method for tackling asymmetric decision problems.",
            "Introduction to the special issue on theories of inconsistency measures and their applications.",
            "Analysing inconsistent information using distance-based measures.",
            "Quantifying conflicts in propositional logic through prime implicates.",
            "Using inconsistency measures for estimating reliability.",
            "A distance-based framework for inconsistency-tolerant reasoning and inconsistency measurement in DL-Lite.",
            "Generalized interval-valued OWA operators with interval weights derived from interval-valued overlap functions.",
            "Multi-Target PHD Tracking and Classification Using Imprecise Likelihoods.",
            "A novel divergence for sensitivity analysis in Gaussian Bayesian networks.",
            "Causal effect identification in acyclic directed mixed graphs and gated models.",
            "Logic-based argumentation with existential rules.",
            "Coimplications derived from pseudo-uninorms on a complete lattice.",
            "System ZFO: Default reasoning with system Z-like ranking functions for unary first-order conditional knowledge bases.",
            "Fuzzy alternating Büchi automata over distributive lattices.",
            "Inference procedures and engine for probabilistic argumentation.",
            "Generalized matroids based on three-way decision models.",
            "A constraint optimization approach to causal discovery from subsampled time series data.",
            "Causes for query answers from databases: Datalog abduction, view-updates, and integrity constraints.",
            "Disjunctive interaction in continuous time Bayesian networks.",
            "Introduction to the special issue on statistical and computational methods for genomics and integrative genomics.",
            "Efficient clustering of large uncertain graphs using neighborhood information.",
            "On the testability of coarsening assumptions: A hypothesis test for subgroup independence.",
            "On linearity of pan-integral and pan-integrable functions space.",
            "Structured probabilistic rough set approximations.",
            "The likelihood interpretation as the foundation of fuzzy set theory.",
            "Typology of axioms for a weighted modal logic.",
            "Compositional models for credal sets.",
            "Analyzing real-world SPARQL queries and ontology-based data access in the context of probabilistic data.",
            "Fuzzy C-Means clustering based on dual expression between cluster prototypes and reconstructed data.",
            "Weighted positive binary decision diagrams for exact probabilistic inference.",
            "The use of uncertainty to choose matching variables in statistical matching.",
            "Closure structures parameterized by systems of isotone Galois connections.",
            "Learning Bayesian network parameters from small data sets: A further constrained qualitatively maximum a posteriori method.",
            "Analogy-based classifiers for nominal or numerical data.",
            "PR-OWL - a language for defining probabilistic ontologies.",
            "Atanassov's intuitionistic fuzzy histon for robust moving object detection.",
            "New definitions of mean value and variance of fuzzy numbers: An application to the pricing of life insurance policies and real options.",
            "Possibilistic testing of OWL axioms against RDF data.",
            "Monotonicity-based consensus states for the monometric rationalisation of ranking rules and how they are affected by ties.",
            "Counter-deception in information fusion.",
            "Clusterwise linear regression modeling with soft scale constraints.",
            "The complexity of fuzzy EL under the Łukasiewicz T-norm.",
            "Face pixel detection using evidential calibration and fusion.",
            "Causal inference in cplint."
        ]
    },
    {
        "name": "IJAR",
        "year": "2016",
        "info": "2016: Volumes\n68,\n69,\n70,\n71,\n72,\n73,\n74,\n75,\n76,\n77,\n78,\n79",
        "count": 101,
        "papers": [
            "On some types of covering rough sets from topological points of view.",
            "Measures of the functional dependence of random vectors.",
            "The middle-parametric representation of fuzzy numbers and applications to fuzzy interpolation.",
            "Some formal relationships among soft sets, fuzzy sets, and their extensions.",
            "Using the WOWA operator in robust discrete optimization problems.",
            "Stream-based inconsistency measurement.",
            "Special Issue on the Seventh Probabilistic Graphical Models Conference (PGM 2014).",
            "On expressiveness of the chain graph interpretations.",
            "Learning marginal AMP chain graphs under faithfulness revisited.",
            "Bayesian network inference using marginal trees.",
            "Learning extended tree augmented naive structures.",
            "Decision functions for chain classifiers based on Bayesian networks for multi-label classification.",
            "Hierarchical multilabel classification based on path evaluation.",
            "A scalable pairwise class interaction framework for multidimensional classification.",
            "Equivalences between maximum a posteriori inference in Bayesian networks and maximum expected utility computation in influence diagrams.",
            "Fast local search methods for solving limited memory influence diagrams.",
            "Neighborhood based decision-theoretic rough set models.",
            "Learning from incomplete data in Bayesian networks with qualitative influences.",
            "Online streaming feature selection using rough sets.",
            "Gated Bayesian networks for algorithmic trading.",
            "Inconsistency indicator maps on groups for pairwise comparisons.",
            "The role of local partial independence in learning of Bayesian networks.",
            "On efficiently estimating the probability of extensions in abstract argumentation frameworks.",
            "Searching secrets rationally.",
            "Structural learning of Bayesian networks by bacterial foraging optimization.",
            "A rough set approach to the characterization of transversal matroids.",
            "Improvements to Variable Elimination and Symbolic Probabilistic Inference for evaluating Influence Diagrams.",
            "Geometric views on conflicting mass functions: From distances to angles.",
            "Automated prover for attribute dependencies in data with grades.",
            "Combined analysis of unique and repetitive events in quantitative risk assessment.",
            "Stock market forecasting by using a hybrid model of exponential fuzzy time series.",
            "Uncertain and negative evidence in continuous time Bayesian networks.",
            "Modeling women's menstrual cycles using PICI gates in Bayesian network.",
            "Corrigendum to \"Belief functions contextual discounting and canonical decompositions\" [International Journal of Approximate Reasoning 53 (2012) 146-158].",
            "Optimal approximations with Rough Sets and similarities in measure spaces.",
            "Interpreting evidential distances by connecting them to partial orders: Application to belief function approximation.",
            "Multi-objective optimization method for learning thresholds in a decision-theoretic rough set model.",
            "Logics for Approximate Entailment in ordered universes of discourse.",
            "Finitely maxitive T-conditional possibility theory: Coherence and extension.",
            "Compound approximation spaces for relational data.",
            "Belief functions: Theory and applications (BELIEF 2014).",
            "Proposition and learning of some belief function contextual correction mechanisms.",
            "Active classification using belief functions and information gain maximization.",
            "Evidential calibration of binary SVM classifiers.",
            "Prediction of future observations using belief functions: A likelihood-based approach.",
            "Causal compositional models in valuation-based systems with examples in specific theories.",
            "An evidential approach to SLAM, path planning, and active exploration.",
            "Block relations in formal fuzzy concept analysis.",
            "Computation of general correlation coefficients for interval data.",
            "Random walks on graphs with interval weights and precise marginals.",
            "Representations of votes facilitating monotonicity-based ranking rules: From votrix to votex.",
            "Enhancing evolutionary fuzzy systems for multi-class problems: Distance-based relative competence weighting with truncated confidences (DRCW-TC).",
            "RU and (U, N)-implications satisfying Modus Ponens.",
            "Probabilistic graded rough set and double relative quantitative decision-theoretic rough set.",
            "Dempster-Shafer fusion of evidential pairwise Markov fields.",
            "Robust probability updating.",
            "Efficient approximation of probability distributions with k-order decomposable models.",
            "A new modularity measure for Fuzzy Community detection problems based on overlap and grouping functions.",
            "Extended rough set model based on known same probability dominant valued tolerance relation.",
            "Special Issue on selected papers from the IFSA-EUSFLAT2015 conference.",
            "Deep kernel dimensionality reduction for scalable data integration.",
            "Forecasting portfolio returns using weighted fuzzy time series methods.",
            "Data volume reduction in covering approximation spaces with respect to twenty-two types of covering based rough sets.",
            "Preferential Multi-Context Systems.",
            "Argumentation update in YALLA (Yet Another Logic Language for Argumentation).",
            "On fuzzy-qualitative descriptions and entropy.",
            "Ordinal sum construction for uninorms and generalized uninorms.",
            "Imprecise stochastic processes in discrete time: global models, imprecise Markov chains, and ergodic theorems.",
            "The decompositions of rank-dependent poverty measures using ordered weighted averaging operators.",
            "Dynamic consistency in incomplete information games under ambiguity.",
            "An incremental attribute reduction approach based on knowledge granularity under the attribute generalization.",
            "Ordinal classification based on the sequential covering strategy.",
            "The distribution semantics for normal programs with function symbols.",
            "Fuzzy temporal fault tree analysis of dynamic systems.",
            "The uncertainty of probabilistic rough sets in multi-granulation spaces.",
            "Covering-based rough sets and modal logics. Part I.",
            "2-Coherent and 2-convex conditional lower previsions.",
            "Bayesian selection of graphical regulatory models.",
            "A general framework for defining and extending actual causation using CP-logic.",
            "Robust Bayesian analysis in partially ordered plausibility calculi.",
            "TP-Compilation for inference in probabilistic logic programs.",
            "Design and evaluation of norm-aware agents based on Normative Markov Decision Processes.",
            "A semantically sound approach to Pawlak rough sets and covering-based rough sets.",
            "Optimization of dialectical outcomes in dialogical argumentation.",
            "Advances in integrative statistics for logic programming.",
            "Learning Bayesian networks from datasets joining continuous and discrete variables.",
            "Conformity and independence with coherent lower previsions.",
            "Frequentistic approximations to Bayesian prevision of exchangeable random elements.",
            "A prior near-ignorance Gaussian process model for nonparametric regression.",
            "Nonparametric Bayesian topic modelling with the hierarchical Pitman-Yor processes.",
            "Mining information from time series in the form of sentences of natural language.",
            "A Dirichlet process functional approach to heteroscedastic-consistent covariance estimation.",
            "Probabilistic abductive logic programming using Dirichlet priors.",
            "The scorix: A popular representation of votes revisited.",
            "Imprecise random variables, random sets, and Monte Carlo simulation.",
            "Looking-ahead in backtracking algorithms for abstract argumentation.",
            "40 years of Dempster-Shafer theory.",
            "A Mathematical Theory of Evidence turns 40.",
            "Dempster's rule of combination.",
            "The problem of dependent evidence.",
            "Constructive decision theory."
        ]
    },
    {
        "name": "IJAR",
        "year": "2015",
        "info": "2015: Volumes\n56,\n57,\n58,\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67",
        "count": 83,
        "papers": [
            "On the problem of computing the conglomerable natural extension.",
            "Lattice-valued simulations for quantitative transition systems.",
            "Connections between covering-based rough sets and concept lattices.",
            "Some twin approximation operators on covering approximation spaces.",
            "A category approach to relation preserving functions in rough set theory.",
            "Scheduling results applicable to decision-theoretic troubleshooting.",
            "Generalizing the Wilcoxon rank-sum test for interval data.",
            "The choice of generalized Dempster-Shafer rules for aggregating belief functions.",
            "On truth-gaps, truth-gluts, and bipolar propositions.",
            "Imprecise Probability: Theories and Applications (ISIPTA'13).",
            "Coherent updating of non-additive measures.",
            "Credal networks under epistemic irrelevance: The sets of desirable gambles approach.",
            "Characterizing coherence, correcting incoherence.",
            "Statistical modeling under partial identification: Distinguishing three types of identification regions in regression analysis with interval data.",
            "Robust classification of multivariate time series by imprecise hidden Markov models.",
            "Credal model averaging for classification: representing prior ignorance and expert opinions.",
            "New prior near-ignorance models on the simplex.",
            "Using interval information granules to improve forecasting in fuzzy time series.",
            "Natural language of uncertainty: numeric hedge words.",
            "A note on \"Adaptive fuzzy fitness granulation for evolutionary optimization\".",
            "Time-critical interactive dynamic influence diagram.",
            "Notes on \"A survey of fuzzy implication algebras and their axiomatization\".",
            "Accept & reject statement-based uncertainty models.",
            "Special Issue on the Twelfth European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2013).",
            "Representing qualitative capacities as families of possibility measures.",
            "Approximate credal network updating by linear programming with applications to decision making.",
            "Chain graph interpretations and their relations revisited.",
            "Probabilistic satisfiability and coherence checking through integer programming.",
            "Coherence in the aggregate: A betting method for belief functions on many-valued events.",
            "On the equivalence between logic programming semantics and argumentation semantics.",
            "Possibilistic nested logic programs and strong equivalence.",
            "A belief revision framework for revising epistemic states with partial epistemic states.",
            "Monotonic uncertainty measures for attribute reduction in probabilistic rough set model.",
            "Matrix-based set approximations and reductions in covering decision information systems.",
            "A differential harmony search based hybrid interval type2 fuzzy EGARCH model for stock market volatility prediction.",
            "Willingness-to-pay estimation using generalized maximum-entropy: A case study.",
            "Variational preferences and equilibria in games under ambiguous belief correspondences.",
            "Fuzzy inequational logic.",
            "Integral representation of belief measures on compact spaces.",
            "Keypoint descriptor fusion with Dempster-Shafer theory.",
            "An interval estimator for the unmixing of mixtures with set-based source descriptions.",
            "Propagation effects of model-calculated probability values in Bayesian networks.",
            "Marginal filtering in large state spaces.",
            "Robustness analysis of logic metrics on F(X).",
            "Responsibility for inconsistency.",
            "Existence, uniqueness, calculus and properties of triangular approximations of fuzzy numbers under a general condition.",
            "Decision making under uncertainty comprising complete ignorance and probability.",
            "Fuzzy sets on 2D spaces for fineness representation.",
            "Robustness of full implication algorithms based on interval-valued fuzzy inference.",
            "Probabilism, entropies and strictly proper scoring rules.",
            "On the complexity of second-best abductive explanations.",
            "An intercausal cancellation model for Bayesian-network engineering.",
            "Sklar's theorem for minitive belief functions.",
            "Tabulation proof procedures for fuzzy linguistic logic programming.",
            "Interactive error correction in implicative theories.",
            "Efficient approximate linear programming for factored MDPs.",
            "Granular fuzzy models: Analysis, design, and evaluation.",
            "A rule-based development of incremental models.",
            "Logic of approximate entailment in quasimetric spaces.",
            "Semantic-based construction of arguments: An answer set programming approach.",
            "Value-based argumentation framework built from prioritized qualitative choice logic.",
            "Coherent conditional measures of risk defined by the Choquet integral with respect to Hausdorff outer measure and stochastic independence in risk management.",
            "A measure of mutual complete dependence in discrete variables through subcopula.",
            "Multivariate dependence concepts through copulas.",
            "Modeling dependence between error components of the stochastic frontier model using copula: Application to intercrop coffee production in Northern Thailand.",
            "Performance fees and hedge fund return dynamics.",
            "Joint distributions of random sets and their relation to copulas.",
            "Mixed aleatory and epistemic uncertainty quantification using fuzzy set theory.",
            "Robustness of reverse triple I algorithms based on interval-valued fuzzy inference.",
            "Central points and approximation in residuated lattices.",
            "Approximation of centroid end-points and switch points for replacing type reduction algorithms.",
            "Inference after checking multiple Bayesian models for data conflict and applications to mitigating the influence of rejected priors.",
            "Comparative analysis of logic operators: A perspective of statistical testing and granular computing.",
            "A least deviation method for priority derivation in group decision making with incomplete reciprocal preference relations.",
            "Can belief structures improve our understanding of safety climate survey data?",
            "Multi-adjoint algebras versus non-commutative residuated structures.",
            "Corrigendum to \"Marginal AMP chain graphs\" [Int. J. Approx. Reason. 55 (5) (2014) 1185-1206].",
            "Conditioning, updating and lower probability zero.",
            "An interpretability improvement for fuzzy rule bases obtained by the iterative rule learning approach.",
            "Probabilistic Logic Programming (PLP'14).",
            "An OpenCL implementation of a forward sampling algorithm for CP-logic.",
            "Learning failure-free PRISM programs.",
            "foxPSL: A Fast, Optimized and eXtended PSL implementation."
        ]
    },
    {
        "name": "IJAR",
        "year": "2014",
        "info": "2014: Volume 55",
        "count": 134,
        "papers": [
            "Preface.",
            "Bayesian network modeling of the consensus between experts: An application to neuron classification.",
            "Bayesian network models in brain functional connectivity analysis.",
            "Relational approach to knowledge engineering for POMDP-based assistance systems as a translation of a psychological model.",
            "Exploiting causal functional relationships in Bayesian network modelling for personalised healthcare.",
            "A tool based on Bayesian networks for supporting geneticists in plant improvement by controlled pollination.",
            "Anomaly detection in vessel tracks using Bayesian networks.",
            "Decision-theoretic rough sets and beyond.",
            "An automatic method to determine the number of clusters using decision-theoretic rough set.",
            "An extension to Rough c-means clustering based on decision-theoretic Rough Sets model.",
            "An axiomatic characterization of probabilistic rough sets.",
            "Analyzing uncertainties of probabilistic rough set regions with game-theoretic rough sets.",
            "On an optimization representation of decision-theoretic rough set model.",
            "Feature selection with test cost constraint.",
            "Generalized probabilistic approximations of incomplete data.",
            "Incorporating logistic regression to decision-theoretic rough sets for classifications.",
            "Multi-class decision-theoretic rough sets.",
            "Multigranulation decision-theoretic rough sets.",
            "Qualitative and quantitative combinations of crisp and rough clustering schemes using dominance relations.",
            "Rule acquisition and complexity reduction in formal decision contexts.",
            "Editorial.",
            "Compositional models in valuation-based systems.",
            "Imaginary numbers for combining linear equation models via Dempster's rule.",
            "Belief function and multivalued mapping robustness in statistical estimation.",
            "Large scale two sample multinomial inferences and its applications in genome-wide association studies.",
            "Combining statistical and expert evidence using belief functions: Application to centennial sea level estimation taking into account climate change.",
            "Controlling Remanence in Evidential Grids Using Geodata for Dynamic Scene Perception.",
            "Dealing with uncertainty and imprecision in image segmentation using belief function theory.",
            "International Journal of Approximate Reasoning Special Issue on \"Rough Sets and Logic\".",
            "A temporal semantics for Nilpotent Minimum logic.",
            "Membership function based rough set.",
            "Multi-adjoint fuzzy rough sets: Definition, properties and attribute selection.",
            "Representing expansions of bounded distributive lattices with Galois connections in terms of rough sets.",
            "An update logic for information systems.",
            "An algebraic study of exactness in partial contexts.",
            "Duality, conjugacy and adjointness of approximation operators in covering-based rough sets.",
            "On the rough consistency measures of logic theories and approximate reasoning in rough logic.",
            "Policy-based inconsistency management in relational databases.",
            "Approaches to measuring inconsistency for stratified knowledge bases.",
            "Inconsistency-tolerant reasoning with OWL DL.",
            "Rich preference-based argumentation frameworks.",
            "Probabilistic qualification of attack in abstract argumentation.",
            "A simple logic for reasoning about incomplete knowledge.",
            "Probabilistic inference for multiple testing.",
            "Kuznetsov independence for interval-valued expectations and sets of probability distributions: Properties and algorithms.",
            "Real-valued Choquet integrals for set-valued mappings.",
            "A choice model with imprecise ordinal evaluations.",
            "Using possibilistic logic for modeling qualitative decision: Answer Set Programming algorithms.",
            "Semantics for possibilistic answer set programs: Uncertain rules versus rules with uncertain conclusions.",
            "A construction of sound semantic linguistic scales using 4-tuple representation of term semantics.",
            "On robustness of the full implication triple I inference method with respect to finer measurements.",
            "Simulation for lattice-valued doubly labeled transition systems.",
            "Forecasting stock index price based on M-factors fuzzy time series and particle swarm optimization.",
            "Set-based granular computing: A lattice model.",
            "A novel cognitive system model and approach to transformation of information granules.",
            "Updating attribute reduction in incomplete decision systems with the variation of attribute set.",
            "A categorical representation of algebraic domains based on variations of rough approximable concepts.",
            "A comparison of parallel large-scale knowledge acquisition using rough set theory on different MapReduce runtime systems.",
            "Evidence-theory-based numerical algorithms of attribute reduction with neighborhood-covering rough sets.",
            "Special Issue on PGM-2012.",
            "Two optimal strategies for active learning of causal models from interventional data.",
            "Learning mixtures of truncated basis functions from data.",
            "Qualitative chain graphs and their application.",
            "Decision-theoretic troubleshooting: Hardness of approximation.",
            "Learning mixtures of polynomials of multidimensional probability densities from data using B-spline interpolation.",
            "Learning AMP chain graphs and some marginal models thereof under faithfulness.",
            "Co-variation for sensitivity analysis in Bayesian networks: Properties, consequences and alternatives.",
            "Learning Bayesian network structure: Towards the essential graph by integer linear programming tools.",
            "Probabilistic inference with noisy-threshold models based on a CP tensor decomposition.",
            "New distances between bodies of evidence based on Dempsterian specialization matrices and their consistency with the conjunctive combination rule.",
            "Forecasting using belief functions: An application to marketing econometrics.",
            "Decomposition of conflict as a distribution on hypotheses in the framework on belief functions.",
            "A label semantics approach to linguistic hedges.",
            "Probability, fuzziness and borderline cases.",
            "Marginal AMP chain graphs.",
            "Diagnosis for uncertain, dynamic and hybrid domains using Bayesian networks and arithmetic circuits.",
            "Bayesian robustness under a skew-normal class of prior distribution.",
            "Bayesian network approach to multinomial parameter learning using data and expert judgments.",
            "Possibilistic sequential decision making.",
            "Min-max decision rules for choice under complete uncertainty: Axiomatic characterizations for preferences over utility intervals.",
            "Evolutionary learning of fuzzy grey cognitive maps for the forecasting of multivariate, interval-valued time series.",
            "Efficient modeling of MIMO systems through Timed Automata based Neuro-Fuzzy Inference Engine.",
            "Exact analytical inversion of TSK fuzzy systems with singleton and linear consequents.",
            "Triple I method of approximate reasoning on Atanassov's intuitionistic fuzzy sets.",
            "Introducing validity in fuzzy probability for judicial decision-making.",
            "On multi-granulation covering rough sets.",
            "Rough sets determined by tolerances.",
            "Interpretation of association rules in multi-tier structures.",
            "Optimal strategic reasoning with McNaughton functions.",
            "An integral with respect to probabilistic-valued decomposable measures.",
            "Harnessing the information contained in low-quality data sources.",
            "SMIRE Research Group at the University of Oviedo: A distance-based statistical analysis of fuzzy number-valued data.",
            "Statistical reasoning with set-valued information: Ontic vs. epistemic views.",
            "Learning from imprecise and fuzzy observations: Data disambiguation through generalized loss minimization.",
            "Likelihood-based belief function: Justification and some extensions to low-quality data.",
            "Imprecise probability models for learning multinomial distributions from data. Applications to learning credal networks.",
            "On various ways of tackling incomplete information in statistics.",
            "Comments on \"A distance-based statistical analysis of fuzzy number-valued data\" by the SMIRE research group.",
            "Comments on \"Statistical reasoning with set-valued information: Ontic vs. epistemic view\" by Inés Couso and Didier Dubois.",
            "Comments on \"Statistical reasoning with set-valued information: Ontic vs. epistemic views\".",
            "Comments on \"Learning from imprecise and fuzzy observations: Data disambiguation through generalized loss minimization\" by Eyke Hüllermeier.",
            "Comments on \"Learning from imprecise and fuzzy observations: Data disambiguation through generalized loss minimization\" by Eyke Hüllermeier.",
            "Comments on \"Likelihood-based belief function: Justification and some extensions to low-quality data\" by Thierry Denœux.",
            "Learning imprecise probability models: Conceptual and practical challenges.",
            "Comments on \"Imprecise probability models for learning multinomial distributions from data. Applications to learning credal networks\" by Andrés R. Masegosa and Serafín Moral.",
            "Rejoinder on \"A distance-based statistical analysis of fuzzy number-valued data\".",
            "Rejoinder on \"Statistical reasoning with set-valued information: Ontic vs. epistemic views\".",
            "Rejoinder on \"Learning from imprecise and fuzzy observations: Data disambiguation through generalized loss minimization\".",
            "Rejoinder on \"Likelihood-based belief function: Justification and some extensions to low-quality data\".",
            "Rejoinder on \"Imprecise probability models for learning multinomial distributions from data. Applications to learning credal networks\".",
            "Interval MV-algebras and generalizations.",
            "A survey of fuzzy implication algebras and their axiomatization.",
            "Computational approaches to finding and measuring inconsistency in arbitrary knowledge bases.",
            "The Goodman-Nguyen relation within imprecise probability theory.",
            "Inclusion-exclusion principle for belief functions.",
            "Learning continuous time Bayesian network classifiers.",
            "Lukasiewicz-based merging possibilistic networks.",
            "A rough set-based incremental approach for learning knowledge in dynamic incomplete information systems.",
            "Multi-confidence rule acquisition and confidence-preserved attribute reduction in interval-valued decision systems.",
            "A modified rough c-means clustering algorithm based on hybrid imbalanced measure of distance and density.",
            "Weighted logics for artificial intelligence - an introductory discussion.",
            "Hierarchies of probabilistic logics.",
            "Conditional p-adic probability logic.",
            "Borderline vs. unknown: comparing three-valued representations of imperfect information.",
            "On finitely-valued Fuzzy Description Logics.",
            "Consistency reasoning in lattice-based fuzzy Description Logics.",
            "Completion-based generalization inferences for the Description Logic ELOR with subjective probabilities.",
            "Complexity of fuzzy answer set programming under Łukasiewicz semantics.",
            "Valued preference-based instantiation of argumentation frameworks with varied strength defeats.",
            "Postulates for logic-based argumentation systems.",
            "Reasoning about norms under uncertainty in dynamic environments.",
            "A weighted causal theory for acquiring and utilizing open knowledge.",
            "Sum-based weighted belief base merging: From commensurable to incommensurable framework.",
            "Combining dependent evidential bodies that share common knowledge."
        ]
    },
    {
        "name": "IJAR",
        "year": "2013",
        "info": "2013: Volume 54",
        "count": 95,
        "papers": [
            "A genetic design of linguistic terms for fuzzy rule based classifiers.",
            "Towards linguistic descriptions of phenomena.",
            "A generalization of Yager's f-generated implications.",
            "A probabilistic approach to modelling uncertain logical arguments.",
            "Argue to agree: A case-based argumentation approach.",
            "From inconsistency handling to non-canonical requirements management: A logical perspective.",
            "Formal approaches to rule-based systems in medicine: The case of CADIAG-2.",
            "Incomplete decision contexts: Approximate concept construction, rule acquisition and knowledge reduction.",
            "The concept lattice functors.",
            "Fuzzy similarity-based nearest-neighbour classification as alternatives to their fuzzy-rough parallels.",
            "Model-based clustering of high-dimensional data: Variable selection versus facet determination.",
            "Reading dependencies from covariance graphs.",
            "Generalized information theory for hints.",
            "Exact inversion of decomposable interval type-2 fuzzy logic systems.",
            "A 2uFunction representation for non-uniform type-2 fuzzy sets: Theory and design.",
            "Some remarks on the distributive equation of fuzzy implication and the contrapositive symmetry for continuous, Archimedean t-norms.",
            "Axiomatic systems for rough set-valued homomorphisms of associative rings.",
            "Soft clustering - Fuzzy and rough approaches and their extensions and derivatives.",
            "Bayesian networks for mathematical models: Techniques for automatic construction and efficient inference.",
            "Inconsistency-Tolerant Bunched Implications.",
            "Special issue: Nonlinear Mathematics for Uncertainty and its Applications.",
            "Discrete pseudo-integrals.",
            "A strong law of large numbers for non-additive probabilities.",
            "Large and moderate deviations for random sets and random upper semicontinuous functions.",
            "Maximal (Minimal) Conditional Expectation and European Option Pricing with Ambiguous Return Rate and Volatility.",
            "Set-valued stochastic integrals with respect to Poisson processes in a Banach space.",
            "The Choquet integral representability of comonotonically additive functionals in locally compact spaces.",
            "Special Issue on the Eleventh European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2011).",
            "Scaling up the Greedy Equivalence Search algorithm by constraining the search space of equivalence classes.",
            "Overriding subsuming rules.",
            "Probabilistic stit logic and its decomposition.",
            "Independence and 2-monotonicity: Nice to have, hard to keep.",
            "Logics for belief functions on MV-algebras.",
            "Probabilistic entailment in the setting of coherence: The role of quasi conjunction and inclusion relation.",
            "Locally averaged Bayesian Dirichlet metrics for learning the structure and the parameters of Bayesian networks.",
            "A socio-cognitive model of trust using argumentation theory.",
            "LTC: A latent tree approach to classification.",
            "Non-standard probability, coherence and conditional probability on many-valued events.",
            "Probabilistic compositional models: Solution of an equivalence problem.",
            "DemocraticOP: A Democratic way of aggregating Bayesian network parameters.",
            "A proof for the positive definiteness of the Jaccard index matrix.",
            "How different are ranking methods for fuzzy numbers? A numerical study.",
            "Triple I algorithms based on Schweizer-Sklar operators in fuzzy reasoning.",
            "Robustness analysis of full implication inference method.",
            "Arguing about social evaluations: From theory to experimentation.",
            "Axiomatic characterizations of dual concept lattices.",
            "Uncertainty in financial econometrics: Editorial.",
            "Four theorems and a financial crisis.",
            "Granularity adjustment for risk measures: Systematic vs unsystematic risks.",
            "A measure of multivariate mutual complete dependence.",
            "Essential closures and supports of multivariate copulas.",
            "Subsampling tests of parameter hypotheses and overidentifying restrictions with possible failure of identification.",
            "Modeling volatility and dependency of agricultural price and production indices of Thailand: Static versus time-varying copulas.",
            "Factors affecting economic output in developed countries: A copula approach to sample selection with panel data.",
            "Editorial: Uncertainty in Artificial Intelligence and Databases.",
            "A temporal database forecasting algebra.",
            "Unifying ontological similarity measures: A theoretical and empirical investigation.",
            "Bipolarity in argumentation graphs: Towards a better understanding.",
            "Speeding-up structured probabilistic inference using pattern mining.",
            "An informational distance for estimating the faithfulness of a possibility distribution, viewed as a family of probability distributions, with respect to data.",
            "Sub-sample swapping for sequential Monte Carlo approximation of high-dimensional densities in the context of complex object tracking.",
            "Editorial: Uncertain reasoning FLAIRS 2011.",
            "Learning temporal nodes Bayesian networks.",
            "Dealing with external actions in belief causal networks.",
            "Bayesian knowledge base tuning.",
            "Accuracy and complexity evaluation of defuzzification strategies for the discretised interval type-2 fuzzy set.",
            "Symmetric implicational method of fuzzy reasoning.",
            "On a new class of implications: (g, u)(g, u)-implications and the distributive equations.",
            "Bilattices for deductions in multi-valued logic.",
            "Triangular fuzzy decision-theoretic rough sets.",
            "Optimal scale selection for multi-scale decision tables.",
            "Two basic double-quantitative rough set models of precision and grade and their investigation using granular computing.",
            "A granular neural network: Performance analysis and application to re-granulation.",
            "An interactive approach for Bayesian network learning using domain/expert knowledge.",
            "Ordering arc-reversal operations when eliminating variables in lazy AR propagation.",
            "Discounted combination of unreliable evidence using degree of disagreement.",
            "Parametric regression analysis of imprecise and uncertain data in the fuzzy belief function framework.",
            "Countably additive Möbius transforms for belief functions on Polish spaces.",
            "Decomposition integrals.",
            "Independence for full conditional probabilities: Structure, factorization, non-uniqueness, and Bayesian networks.",
            "Energy distribution view for monotonic dual decomposition.",
            "Refining a Bayesian Network using a Chain Event Graph.",
            "Pricing and hedging in a single period market with random interval valued assets.",
            "Conglomerable coherence.",
            "A consistent set of infinite-order probabilities.",
            "Four matroidal structures of covering and their relationships with rough sets.",
            "Neighborhood rough sets based multi-label classification for automatic image annotation.",
            "Generalized fuzzy rough approximation operators determined by fuzzy implicators.",
            "Fuzzy probabilistic rough set model on two universes and its applications.",
            "A closed form type reduction method for piecewise linear interval type-2 fuzzy sets.",
            "An efficient multi-objective evolutionary fuzzy system for regression problems.",
            "A fuzzy real-time temporal logic.",
            "On fuzzy implications: An axiomatic approach.",
            "Hierarchical structure and applications of fuzzy logical systems.",
            "Ordinally equivalent data: A measurement-theoretic look at formal concept analysis of fuzzy attributes."
        ]
    },
    {
        "name": "IJAR",
        "year": "2012",
        "info": "2012: Volume 53",
        "count": 91,
        "papers": [
            "Modelling uncertainties in limit state functions.",
            "An interval set model for learning rules from incomplete information table.",
            "Decision with Dempster-Shafer belief functions: Decision under ignorance and sequential consistency.",
            "Learning Fuzzy Grey Cognitive Maps using Nonlinear Hebbian-based approach.",
            "A framework and a mean-field algorithm for the local control of spatial processes.",
            "The reduction and fusion of fuzzy covering systems based on the evidence theory.",
            "Comparative study of variable precision rough set model and graded rough set model.",
            "Editorial.",
            "Distances in evidence theory: Comprehensive survey and generalizations.",
            "Belief functions contextual discounting and canonical decompositions.",
            "Relevance and truthfulness in information correction and fusion.",
            "Constructing and evaluating alternative frames of discernment.",
            "Auditors' evidence evaluation and aggregation using beliefs and probabilities.",
            "Nearness approximation space based on axiomatic fuzzy sets.",
            "Mixtures of truncated basis functions.",
            "On Providing Quality of Service in Grid Computing through Multi-objective Swarm-Based Knowledge Acquisition in Fuzzy Schedulers.",
            "Learning Bayesian network classifiers by risk minimization.",
            "Precisely imprecise: A collection of papers dedicated to Henry E. Kyburg Jr.",
            "The logic of risky knowledge, reprised.",
            "Inductivism and Parmenidean epistemology: Kyburg's way.",
            "Belief and probability: A general theory of probability cores.",
            "Abnormality and randomness.",
            "Reference classes and relational learning.",
            "Imprecise probabilities for representing ignorance about a parameter.",
            "Exchangeability and sets of desirable gambles.",
            "Revising beliefs on the basis of evidence.",
            "Generalizing inference rules in a coherence-based probabilistic default reasoning.",
            "States in Łukasiewicz logic correspond to probabilities of rational polyhedra.",
            "A latent model for collaborative filtering.",
            "Intersection of Yager's implications with QL and D-implications.",
            "A generalized bi-criteria fuzzy integer flow sharing problem.",
            "Non-exclusive hypotheses in Dempster-Shafer Theory.",
            "Graph-based multi-agent decision making.",
            "Matroidal approaches to rough sets via closure operators.",
            "Entropy and co-entropy of a covering approximation space.",
            "Bayesian rough set model: A further investigation.",
            "Definability and textures.",
            "Characterisation of ergodic upper transition operators.",
            "The impact of diversity on the accuracy of evidential classifier ensembles.",
            "Probabilistic rough set over two universes and rough entropy.",
            "Rough sets based matrix approaches with dynamic attribute variation in set-valued information systems.",
            "A skin detection approach based on the Dempster-Shafer theory of evidence.",
            "A core language for fuzzy answer set programming.",
            "A new fuzzy based algorithm for solving stereo vagueness in detecting and tracking people.",
            "Inference about constrained parameters using the elastic belief method.",
            "Theory of evidence for face detection and tracking.",
            "Evidential evolving Gustafson-Kessel algorithm for online data streams partitioning using belief function theory.",
            "The conjunctive combination of interval-valued belief structures from dependent sources.",
            "On the relative belief transform.",
            "Nearest interval, triangular and trapezoidal approximation of a fuzzy number preserving ambiguity.",
            "Formalization of implication based fuzzy reasoning method.",
            "Two issues in using mixtures of polynomials for inference in hybrid Bayesian networks.",
            "A bipolar model of vague concepts based on random set and prototype theory.",
            "Game-theoretic probability combination with applications to resolving conflicts between statistical methods.",
            "Algebraic structures of interval-valued fuzzy (S, N)-implications.",
            "On some types of neighborhood-related covering rough sets.",
            "An efficient rough feature selection algorithm with a multi-granulation view.",
            "Special section - Uncertain reasoning FLAIRS 2010.",
            "Modelling and inference with Conditional Gaussian Probabilistic Decision Graphs.",
            "Structured probabilistic inference.",
            "Efficient indexing methods for recursive decompositions of Bayesian networks.",
            "Non-impeding noisy-AND tree causal models over multi-valued variables.",
            "Mathematical foundations for a theory of confidence structures.",
            "Generalized representation theorem and its application to the construction of fuzzy sets: Existence and uniqueness.",
            "Mathematical morphology on bipolar fuzzy sets: general algebraic framework.",
            "Granular fuzzy models: a study in knowledge management in fuzzy modeling.",
            "NMGRS: Neighborhood-based multigranulation rough sets.",
            "Generalization of Pawlak's rough approximation spaces by using δβ-open sets.",
            "Editorial - Imprecise probability.",
            "Bruno de Finetti - an Italian on the border.",
            "Bruno de Finetti and imprecision: Imprecise probability does not exist!",
            "Incoherence correction strategies in statistical matching.",
            "Likelihood-based Imprecise Regression.",
            "Local computations in Dempster-Shafer theory of evidence.",
            "Partially identified prevalence estimation under misclassification using the kappa coefficient.",
            "Updating credal networks is approximable in polynomial time.",
            "Conglomerable natural extension.",
            "Characterizing joint distributions of random sets by multivariate capacities.",
            "Forecasting with imprecise probabilities.",
            "Never say \"not\": Impact of negative wording in probability phrases on imprecise probability judgments.",
            "Robust detection of exotic infectious diseases in animal herds: A comparative study of three decision methodologies under severe uncertainty.",
            "Evaluating credal classifiers by utility-discounted predictive accuracy.",
            "Special Issue on the Fifth European Workshop on Probabilistic Graphical Models (PGM-2010).",
            "Conservative independence-based causal structure learning in absence of adjacency faithfulness.",
            "Learning undirected graphical models from multiple datasets with the generalized non-rejection rate.",
            "Characteristic imsets for learning Bayesian network structure.",
            "All roads lead to Rome - New search methods for the optimal triangulation problem.",
            "Learning recursive probability trees from probabilistic potentials.",
            "Information enhancement - A tool for approximate representation of optimal strategies from influence diagrams.",
            "Efficient sensitivity analysis in hidden markov models.",
            "Same-decision probability: A confidence measure for threshold-based decisions."
        ]
    },
    {
        "name": "IJAR",
        "year": "2011",
        "info": "2011: Volume 52",
        "count": 97,
        "papers": [
            "Special issue on the Tenth European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2009).",
            "Acyclic directed graphs representing independence models.",
            "AFRA: Argumentation framework with recursive attacks.",
            "Strict and tolerant antidivision queries with ordinal layered preferences.",
            "Approximate inference in Bayesian networks using binary probability trees.",
            "Extending possibilistic logic over Gödel logic.",
            "A bipolar model of assertability and belief.",
            "Ensemble clustering in the belief functions framework.",
            "Extending Removed Sets Revision to partially preordered belief bases.",
            "A betting interpretation for probabilities and Dempster-Shafer degrees of belief.",
            "Imaging and Sleeping Beauty: A case for double-halfers.",
            "J.-H. Lambert's theory of probable syllogisms.",
            "Propensities and conditional probabilities.",
            "Change rules for hierarchical beliefs.",
            "A framework for reasoning under uncertainty based on non-deterministic distance semantics.",
            "Hybrid approaches to attribute reduction based on indiscernibility and discernibility relation.",
            "Topology vs generalized rough sets.",
            "Mark-recapture techniques in statistical tests for imprecise data.",
            "A probability maximization model based on rough approximation and its application to the inventory problem.",
            "Rough approximations of vague sets in fuzzy approximation space.",
            "Special section on dependence issues in knowledge-based systems.",
            "Belief functions combination without the assumption of independence of the information sources.",
            "Compositional models and conditional independence in evidence theory.",
            "A belief function classifier based on information provided by noisy and dependent features.",
            "Classifier fusion in the Dempster-Shafer framework using optimized t-norm based combination rules.",
            "A decision theory for partially consonant belief functions.",
            "Hesitant fuzzy information aggregation in decision making.",
            "Rough set based maximum relevance-maximum significance criterion and Gene selection from microarray data.",
            "Generalized Lebesgue integral.",
            "A Chebyshev type inequality for Sugeno integral and comonotonicity.",
            "Conflict management in Dempster-Shafer theory using the degree of falsity.",
            "Covering rough sets based on neighborhoods: An approach without using neighborhoods.",
            "Relating De Morgan triples with Atanassov's intuitionistic De Morgan triples via automorphisms.",
            "Metric properties of the nearest extended parametric fuzzy number and applications.",
            "Interpretability assessment of fuzzy knowledge bases: A cointension based approach.",
            "Data compression with homomorphism in covering information systems.",
            "Approximate reasoning and finite state machines to the detection of actions in video sequences.",
            "Fuzzy analytic hierarchy process: A logarithmic fuzzy preference programming methodology.",
            "Reasoning with doubly uncertain soft constraints.",
            "Editorial.",
            "Exploiting independencies to compute semigraphoid and graphoid structures.",
            "Inferential models and relevant algorithms in a possibilistic framework.",
            "Characteristic properties of equivalent structures in compositional models.",
            "Support sets in exponential families and oriented matroid theory.",
            "On open questions in the geometric approach to structural learning Bayesian nets.",
            "Inference in hybrid Bayesian networks using mixtures of polynomials.",
            "Combining marginal probability distributions via minimization of weighted sum of Kullback-Leibler divergences.",
            "Algorithms for generating arguments and counterarguments in propositional logic.",
            "Multi-dimensional classification with Bayesian networks.",
            "Intelligent data analysis and model interpretation with spectral analysis fuzzy symbolic modeling.",
            "A genetic tuning to improve the performance of Fuzzy Rule-Based Classification Systems with Interval-Valued Fuzzy Sets: Degree of ignorance and lateral position.",
            "Probability boxes on totally preordered spaces for multivariate modelling.",
            "Eliciting density ratio classes.",
            "Extended Shenoy-Shafer architecture for inference in hybrid bayesian networks with deterministic conditionals.",
            "Parametric aggregation in ordered weighted averaging.",
            "Measuring and repairing inconsistency in probabilistic knowledge bases.",
            "Linguistic cost-sensitive learning of genetic fuzzy classifiers for imprecise data.",
            "Core-generating approximate minimum entropy discretization for rough set feature selection in pattern classification.",
            "A sequential pattern mining algorithm using rough set theory.",
            "A historical review of evolutionary learning methods for Mamdani-type fuzzy rule-based systems: Designing interpretable genetic fuzzy systems.",
            "Special section - Uncertain reasoning track FLAIRS 2009.",
            "A framework for managing uncertain inputs: An axiomization of rewarding.",
            "Fusing multiple Bayesian knowledge sources.",
            "Join tree propagation utilizing both arc reversal and variable elimination.",
            "Multiagent bayesian forecasting of structural time-invariant dynamic systems with graphical models.",
            "A Syntax-based approach to measuring the degree of inconsistency for belief bases.",
            "Using mathematical programming to solve Factored Markov Decision Processes with Imprecise Probabilities.",
            "Finite-valued indistinguishability operators.",
            "Sets of desirable gambles: Conditioning, representation, and precise probabilities.",
            "Determination of the threshold value β of variable precision rough set by fuzzy algorithms.",
            "Fuzzy ontology representation using OWL 2.",
            "Extreme events and entropy: A multiple quantile utility model.",
            "Diverse reduct subspaces based co-training for partially labeled data.",
            "Chebyshev type inequality for Choquet integral and comonotonicity.",
            "Particle filtering in the Dempster-Shafer theory.",
            "Estimating sample mean under interval uncertainty and constraint on sample variance.",
            "A logical characterization of coherence for imprecise probabilities.",
            "A ranking model in uncertain, imprecise and multi-experts contexts: The application of evidence theory.",
            "A note on \"Generalized fuzzy rough approximation operators based on fuzzy coverings\".",
            "Dynamically consistent updating of multiple prior beliefs - An algorithmic approach.",
            "State morphism MV-algebras.",
            "Special issue: Handling incomplete and fuzzy information in data analysis and decision processes.",
            "Possibility distributions: A unified representation of usual direct-probability-based parameter estimation methods.",
            "Centrality as a gradual notion: A new bridge between fuzzy sets and statistics.",
            "A Midpoint-Radius approach to regression with interval data.",
            "Nonparametric criteria for supervised classification of fuzzy data.",
            "Dominance-based fuzzy rough set analysis of uncertain and possibilistic data tables.",
            "Possibilistic bottleneck combinatorial optimization problems with ill-known weights.",
            "Possibilistic analysis of arity-monotonic aggregation operators and its relation to bibliometric impact assessment of individuals.",
            "On distorted probabilities and m-separable fuzzy measures.",
            "On standard models of fuzzy region connection calculus.",
            "On the space of measurable functions and its topology determined by the Choquet integral.",
            "Generating possible intentions with constrained argumentation systems.",
            "The use of Markov operators to constructing generalised probabilities.",
            "Classification systems based on rough sets under the belief function framework.",
            "Singular sources mining using evidential conflict analysis.",
            "Most probable explanations in Bayesian networks: Complexity and tractability."
        ]
    },
    {
        "name": "IJAR",
        "year": "2010",
        "info": "2010: Volume 51",
        "count": 81,
        "papers": [
            "An argument-based approach to reasoning with clinical knowledge.",
            "Concepts and fuzzy sets: Misunderstandings, misconceptions, and oversights.",
            "Representation theorems for probability functions satisfying spectrum exchangeability in inductive logic.",
            "On characterization of generalized interval-valued fuzzy rough sets on two universes of discourse.",
            "Fuzzy qualitative trigonometry.",
            "Attribute dependency functions considering data efficiency.",
            "Real-time moving object segmentation in H.264 compressed domain based on approximate reasoning.",
            "Looking for a good fuzzy system interpretability index: An experimental approach.",
            "New general extensions of Chebyshev type inequalities for Sugeno integrals.",
            "Nonparametric predictive pairwise comparison for real-valued data with terminated tails.",
            "Algebraic aspects of generalized approximation spaces.",
            "Corrigendum to \"Dynamic intuitionistic fuzzy multi-attribute decision making\" [Int. J. Approx. Reasoning 48 (2008) 246-262].",
            "Introduction to the special issue on Bayesian model views.",
            "\"I can name that Bayesian network in two matrixes!\".",
            "Supporting reliability engineers in exploiting the power of Dynamic Bayesian Networks.",
            "Library-style ontologies to support varying model views.",
            "Envisioning uncertainty in geospatial information.",
            "A Bayesian network model for spatial event surveillance.",
            "A framework for ontologically-grounded probabilistic matching.",
            "Decision-theoretic harmony: A first step.",
            "Visualization of network structure by the application of hypernodes.",
            "The coherence of Lukasiewicz assessments is NP-complete.",
            "The orness measures for two compound quasi-arithmetic mean aggregation operators.",
            "Reduction about approximation spaces of covering generalized rough sets.",
            "Tractable approximate knowledge fusion using the Horn fragment of serial propositional dynamic logic.",
            "Erratum to \"Concepts and fuzzy sets: Misunderstandings, misconceptions, and oversights\" [IJAR 15 (2009) 23-34].",
            "Corrigendum to: \"Consensus and dissention: A measure of ordinal dispersion\" [Int. J. Approx. Reasoning 45 (2007) 531-545].",
            "Measures of uncertainty for imprecise probabilities: An axiomatic approach.",
            "Granular computing applied to ontologies.",
            "Hierarchical and conditional combination of belief functions induced by visual tracking.",
            "On the upper semicontinuity of Choquet capacities.",
            "Measuring consensus in group decisions by means of qualitative reasoning.",
            "Gaussian kernel based fuzzy rough sets: Model, uncertainty measures and applications.",
            "Special Issue on PGM-2008.",
            "Generalized loopy 2U: A new algorithm for approximate inference in credal networks.",
            "Parameter estimation and model selection for mixtures of truncated exponentials.",
            "Improvements to message computation in lazy propagation.",
            "Structural-EM for learning PDG models from incomplete data.",
            "Logical and algorithmic properties of stable conditional independence.",
            "Learning locally minimax optimal Bayesian networks.",
            "On the robustness of Bayesian networks to learning from non-conjugate sampling.",
            "A geometric view on learning Bayesian network structures.",
            "A PGM framework for recursive modeling of players in simple sequential Bayesian games.",
            "Comparison of tightly and loosely coupled decision paradigms in multiagent expedition.",
            "Variable elimination for influence diagrams with super value nodes.",
            "Fuzzy Description Logics and t-norm based fuzzy logics.",
            "Fuzzy extensions of OWL: Logical properties and reduction to fuzzy description logics.",
            "On varieties of MV-algebras with internal states.",
            "Feature selection for Bayesian network classifiers using the MDL-FS score.",
            "Correction of incoherent conditional probability assessments.",
            "A fuzzy random forest.",
            "Independence concepts in evidence theory.",
            "A linear regression model for imprecise response.",
            "Supply chain coordination for fuzzy random newsboy problem with imperfect quality.",
            "Combining content-based and collaborative recommendations: A hybrid approach based on Bayesian networks.",
            "Arc refractor methods for adaptive importance sampling on large Bayesian networks under evidential reasoning.",
            "Parameterized OWA operator weights: An extreme point approach.",
            "Measures of inconsistency and defaults.",
            "Belief Scheduler based on model failure detection in the TBM framework. Application to human activity recognition.",
            "Editorial.",
            "Decision making with imprecise parameters.",
            "Aggregating multiple classification results using fuzzy integration and stochastic feature selection.",
            "Heuristic algorithm for interpretation of multi-valued attributes in similarity-based fuzzy relational databases.",
            "Fuzzy uncertainty modeling for grid based localization of mobile robots.",
            "Imprecise expectations for imprecise linear filtering.",
            "Agent based e-commerce systems that react to buyers' feedbacks - A fuzzy approach.",
            "An inventory model with backorders with fuzzy parameters and decision variables.",
            "Belief linear programming.",
            "Distributive equations of implications based on nilpotent triangular norms.",
            "Diagnosis of dyslexia with low quality data with genetic fuzzy systems.",
            "Imprecise probability in statistical inference and decision making.",
            "An aggregation framework based on coherent lower previsions: Application to Zadeh's paradox and sensor networks.",
            "Epistemic irrelevance in credal nets: The case of imprecise Markov trees.",
            "A tree augmented classifier based on Extreme Imprecise Dirichlet Model.",
            "Concentration inequalities and laws of large numbers under epistemic and regular irrelevance.",
            "Imprecise Markov chains with absorption.",
            "Sensitivity of decisions with imprecise utility trade-off parameters using boundary linear utility.",
            "A minimum distance estimator in an imprecise probability model - Computational aspects and applications.",
            "Possibilistic signal processing: How to handle noise?",
            "Inference and risk measurement with the pari-mutuel model.",
            "On solutions of stochastic differential equations with parameters modeled by random sets."
        ]
    },
    {
        "name": "IJAR",
        "year": "2009",
        "info": "2009: Volumes\n50,\n51",
        "count": 189,
        "papers": [
            "Special issue on recent advances in soft computing in image processing.",
            "A soft computing-based approach to spatio-temporal prediction.",
            "Approximation by Shepard type pseudo-linear operators and applications to Image Processing.",
            "An unsupervised context-sensitive change detection technique based on modified self-organizing feature map neural network.",
            "Quality-augmented fusion of level-2 and level-3 fingerprint information using DSm theory.",
            "Selected papers from NAFIPS 2006, 2006 Annual Conference of the North American Fuzzy Information Processing Society.",
            "Sets with type-2 operations.",
            "Ontological approach to development of computing with words based systems.",
            "An anytime deduction algorithm for the probabilistic logic and entailment problems.",
            "On the transitivity of a parametric family of cardinality-based similarity measures.",
            "Fuzzy scheduling of job orders in a two-stage flowshop with batch-processing machines.",
            "MV-algebras with internal states and probabilistic fuzzy logics.",
            "A comparison of two approaches for solving unconstrained influence diagrams.",
            "Knowledge structure, knowledge granulation and knowledge distance in a knowledge base.",
            "Commutativity and self-duality: Two tales of one equation.",
            "The imprecise Dirichlet model.",
            "Representation insensitivity in immediate prediction under exchangeability.",
            "A nonparametric predictive alternative to the Imprecise Dirichlet Model: The case of a known number of categories.",
            "Practical robust estimators for the imprecise Dirichlet model.",
            "Learning in games using the imprecise Dirichlet model.",
            "Applying the imprecise Dirichlet model in cases with partial observations and dependencies in failure data.",
            "Preface.",
            "Importance sampling for Bayesian sensitivity analysis.",
            "Numerical treatment of Bayesian robustness problems.",
            "A computation method in robust Bayesian decision theory.",
            "Optimal actions in problems with convex loss functions.",
            "Bayesian robustness for decision making problems: Applications in medical contexts.",
            "A fuzzy constraint satisfaction approach for signal abstraction.",
            "Bayesian classifiers based on kernel density estimation: Flexible classifiers.",
            "Dealing with non-metric dissimilarities in fuzzy central clustering algorithms.",
            "A reconstruction algorithm for the essential graph.",
            "Preface.",
            "Planning for success: The interdisciplinary approach to building Bayesian models.",
            "Verifying monotonicity of Bayesian networks with domain experts.",
            "Modeling human reasoning about meta-information.",
            "Bayesian networks: A teacher's view.",
            "Preventing knowledge transfer errors: Probabilistic decision support systems through the users' eyes.",
            "Triangulation of Bayesian networks with recursive estimation of distribution algorithms.",
            "An analytical solution to a fuzzy economic order quantity problem.",
            "Fuzzy description logics under Gödel semantics.",
            "A closer look at the Russian roulette problem: A re-examination of the nonlinearity of the prospect theory's decision weight pi.",
            "A comparison of two types of rough sets induced by coverings.",
            "Fuzzy economic order time models with random demand.",
            "Learning weighted linguistic fuzzy rules by using specifically-tailored hybrid estimation of distribution algorithms.",
            "Hierarchical fuzzy rule based classification systems with genetic rule selection for imbalanced data-sets.",
            "Comments on \"Stability analysis for a class of Takagi-Sugeno fuzzy control systems with PID controllers\".",
            "Imprecise probability models and their applications.",
            "Updating under unknown unknowns: An extension of Bayes' rule.",
            "Limits of learning about a categorical latent variable under prior near-ignorance.",
            "Williams coherence and beyond.",
            "An extension of chaotic probability models to real-valued variables.",
            "Data-based decisions under imprecise probability and least favorable models.",
            "Finite approximations to coherent choice.",
            "Credal networks for military identification problems.",
            "Classical and imprecise probability methods for sensitivity analysis in engineering: A case study.",
            "Concept lattices of fuzzy contexts: Formal concept analysis vs. rough set theory.",
            "Inference in qualitative probabilistic networks revisited.",
            "Multi-sample test-based clustering for fuzzy random variables.",
            "Multi-camera people tracking using evidential filters.",
            "Reduction of uncertainty using sensitivity analysis methods for infinite random sets of indexable type.",
            "Arc reversals in hybrid Bayesian networks with deterministic variables.",
            "Computing expectations with continuous p-boxes: Univariate case.",
            "Efficient triangular type-2 fuzzy logic systems.",
            "Comparing approximate reasoning and probabilistic reasoning using the Dempster-Shafer framework.",
            "Special Issue on the Ninth European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2007).",
            "An analysis of Ruspini partitions in Gödel logic.",
            "Description logic programs under probabilistic uncertainty and fuzzy vagueness.",
            "Skepticism relations for comparing argumentation semantics.",
            "Measures of ruleset quality for general rules extraction methods.",
            "Making Discrete Sugeno Integrals More Discriminant.",
            "Dependencies between players in Boolean games.",
            "On efficient WOWA optimization for decision support under risk.",
            "Introduction to the special issue on Graphical Models and Information Retrieval.",
            "Bayesian network models for hierarchical text classification from a thesaurus.",
            "Using scatterplots to understand and improve probabilistic models for text categorization and retrieval.",
            "Possibilistic networks for information retrieval.",
            "Semantic hashing.",
            "Monotonic Variable Consistency Rough Set Approaches.",
            "Combination of partially non-distinct beliefs: The cautious-adaptive rule.",
            "The expected value models on Sugeno measure space.",
            "VC dimension and inner product space induced by Bayesian networks.",
            "Heterogeneous uncertainties in cholesterol management.",
            "Learning concurrently partition granularities and rule bases of Mamdani fuzzy systems in a multi-objective evolutionary framework.",
            "Piecewise parametric polynomial fuzzy sets.",
            "Conditional independence structure and its closure: Inferential rules and algorithms.",
            "Finite approximations of data-based decision problems under imprecise probabilities.",
            "A new probabilistic fuzzy model: Fuzzification-Maximization (FM) approach.",
            "Interval/Probabilistic Uncertainty: Editorial.",
            "Inconsistency as qualified truth: A probability logic approach.",
            "Trade-off between sample size and accuracy: Case of measurements under interval uncertainty.",
            "Linguistic modelling and information coarsening based on prototype theory and label semantics.",
            "Variable-precision dominance-based rough set approach and attribute reduction.",
            "A granularity-based framework of deduction, induction, and abduction.",
            "Operation properties and delta-equalities of complex fuzzy sets.",
            "Optimal triangular decompositions of matrices with entries from residuated lattices.",
            "Building a binary outranking relation in uncertain, imprecise and multi-experts contexts: The application of evidence theory.",
            "On generalized Bonferroni mean operators for multi-criteria aggregation.",
            "Normalizing rank aggregation method for priority of a fuzzy preference relation and its effectiveness.",
            "Crisp sets as classes of discontinuous fuzzy sets.",
            "Faithfulness in chain graphs: The discrete case.",
            "Discrete time Markov chains with interval probabilities.",
            "Special Track on Uncertain Reasoning of the 19th International Florida Artificial Intelligence Research Symposium (FLAIRS 2006).",
            "Formal similarities and differences among qualitative conditional semantics.",
            "Deliberation scheduling using GSMDPs in stochastic asynchronous domains.",
            "Warp effects on calculating interval probabilities.",
            "Automated compilation of Object-Oriented Probabilistic Relational Models.",
            "A formal framework for description logics with uncertainty.",
            "Methods for constructing balanced elimination trees and other recursive decompositions.",
            "An argument-based approach to reasoning with clinical knowledge.",
            "Concepts and fuzzy sets: Misunderstandings, misconceptions, and oversights.",
            "Representation theorems for probability functions satisfying spectrum exchangeability in inductive logic.",
            "On characterization of generalized interval-valued fuzzy rough sets on two universes of discourse.",
            "Fuzzy qualitative trigonometry.",
            "Attribute dependency functions considering data efficiency.",
            "Real-time moving object segmentation in H.264 compressed domain based on approximate reasoning.",
            "Looking for a good fuzzy system interpretability index: An experimental approach.",
            "New general extensions of Chebyshev type inequalities for Sugeno integrals.",
            "Nonparametric predictive pairwise comparison for real-valued data with terminated tails.",
            "Algebraic aspects of generalized approximation spaces.",
            "Corrigendum to \"Dynamic intuitionistic fuzzy multi-attribute decision making\" [Int. J. Approx. Reasoning 48 (2008) 246-262].",
            "Introduction to the special issue on Bayesian model views.",
            "\"I can name that Bayesian network in two matrixes!\".",
            "Supporting reliability engineers in exploiting the power of Dynamic Bayesian Networks.",
            "Library-style ontologies to support varying model views.",
            "Envisioning uncertainty in geospatial information.",
            "A Bayesian network model for spatial event surveillance.",
            "A framework for ontologically-grounded probabilistic matching.",
            "Decision-theoretic harmony: A first step.",
            "Visualization of network structure by the application of hypernodes.",
            "The coherence of Lukasiewicz assessments is NP-complete.",
            "The orness measures for two compound quasi-arithmetic mean aggregation operators.",
            "Reduction about approximation spaces of covering generalized rough sets.",
            "Tractable approximate knowledge fusion using the Horn fragment of serial propositional dynamic logic.",
            "Erratum to \"Concepts and fuzzy sets: Misunderstandings, misconceptions, and oversights\" [IJAR 15 (2009) 23-34].",
            "Corrigendum to: \"Consensus and dissention: A measure of ordinal dispersion\" [Int. J. Approx. Reasoning 45 (2007) 531-545].",
            "Measures of uncertainty for imprecise probabilities: An axiomatic approach.",
            "Granular computing applied to ontologies.",
            "Hierarchical and conditional combination of belief functions induced by visual tracking.",
            "On the upper semicontinuity of Choquet capacities.",
            "Measuring consensus in group decisions by means of qualitative reasoning.",
            "Gaussian kernel based fuzzy rough sets: Model, uncertainty measures and applications.",
            "Special Issue on PGM-2008.",
            "Generalized loopy 2U: A new algorithm for approximate inference in credal networks.",
            "Parameter estimation and model selection for mixtures of truncated exponentials.",
            "Improvements to message computation in lazy propagation.",
            "Structural-EM for learning PDG models from incomplete data.",
            "Logical and algorithmic properties of stable conditional independence.",
            "Learning locally minimax optimal Bayesian networks.",
            "On the robustness of Bayesian networks to learning from non-conjugate sampling.",
            "A geometric view on learning Bayesian network structures.",
            "A PGM framework for recursive modeling of players in simple sequential Bayesian games.",
            "Comparison of tightly and loosely coupled decision paradigms in multiagent expedition.",
            "Variable elimination for influence diagrams with super value nodes.",
            "Fuzzy Description Logics and t-norm based fuzzy logics.",
            "Fuzzy extensions of OWL: Logical properties and reduction to fuzzy description logics.",
            "On varieties of MV-algebras with internal states.",
            "Feature selection for Bayesian network classifiers using the MDL-FS score.",
            "Correction of incoherent conditional probability assessments.",
            "A fuzzy random forest.",
            "Independence concepts in evidence theory.",
            "A linear regression model for imprecise response.",
            "Supply chain coordination for fuzzy random newsboy problem with imperfect quality.",
            "Combining content-based and collaborative recommendations: A hybrid approach based on Bayesian networks.",
            "Arc refractor methods for adaptive importance sampling on large Bayesian networks under evidential reasoning.",
            "Parameterized OWA operator weights: An extreme point approach.",
            "Measures of inconsistency and defaults.",
            "Belief Scheduler based on model failure detection in the TBM framework. Application to human activity recognition.",
            "Editorial.",
            "Decision making with imprecise parameters.",
            "Aggregating multiple classification results using fuzzy integration and stochastic feature selection.",
            "Heuristic algorithm for interpretation of multi-valued attributes in similarity-based fuzzy relational databases.",
            "Fuzzy uncertainty modeling for grid based localization of mobile robots.",
            "Imprecise expectations for imprecise linear filtering.",
            "Agent based e-commerce systems that react to buyers' feedbacks - A fuzzy approach.",
            "An inventory model with backorders with fuzzy parameters and decision variables.",
            "Belief linear programming.",
            "Distributive equations of implications based on nilpotent triangular norms.",
            "Diagnosis of dyslexia with low quality data with genetic fuzzy systems.",
            "Imprecise probability in statistical inference and decision making.",
            "An aggregation framework based on coherent lower previsions: Application to Zadeh's paradox and sensor networks.",
            "Epistemic irrelevance in credal nets: The case of imprecise Markov trees.",
            "A tree augmented classifier based on Extreme Imprecise Dirichlet Model.",
            "Concentration inequalities and laws of large numbers under epistemic and regular irrelevance.",
            "Imprecise Markov chains with absorption.",
            "Sensitivity of decisions with imprecise utility trade-off parameters using boundary linear utility.",
            "A minimum distance estimator in an imprecise probability model - Computational aspects and applications.",
            "Possibilistic signal processing: How to handle noise?",
            "Inference and risk measurement with the pari-mutuel model.",
            "On solutions of stochastic differential equations with parameters modeled by random sets."
        ]
    },
    {
        "name": "IJAR",
        "year": "2008",
        "info": "2008: Volumes\n47,\n48,\n49",
        "count": 136,
        "papers": [
            "Preface.",
            "Prototype based fuzzy classification in clinical proteomics.",
            "Machine learning-based receiver operating characteristic (ROC) curves for crisp and fuzzy classification of DNA microarrays in cancer research.",
            "Protein secondary structure prediction using distance based classifiers.",
            "Improving fuzzy clustering of biological data by metric learning with side information.",
            "Integrating gene expression profiling and clinical data.",
            "Clustering and visualization approaches for human cell cycle gene expression data analysis.",
            "Active learning for microarray data.",
            "Gene expression modeling through positive boolean functions.",
            "Distance measures for biological sequences: Some recent approaches.",
            "Merging the local and global approaches to probabilistic satisfiability.",
            "A new fuzzy genetic algorithm for the dynamic bi-objective cell formation problem considering passive and active strategies.",
            "Preference relation approach for obtaining OWA operators weights.",
            "On triangular norms and uninorms definable in Pi 1/2.",
            "An approach to hybrid probabilistic models.",
            "Reasoning about topological relations between regions with broad boundaries.",
            "A rough set approach for the discovery of classification rules in interval-valued information systems.",
            "Approximation and robustness of fuzzy finite automata.",
            "Least-square method to priority of the fuzzy preference relations with incomplete information.",
            "Corrigendum to: Influence of fuzzy norms and other heuristics on \"Mixed fuzzy rule formation\" [Int. J. Approx. Reasoning 35 (2004) 195-202].",
            "Preface.",
            "A view on conditional measures through local representability of binary relations.",
            "Management of uncertainty in Statistical Reasoning: The case of Regression Analysis.",
            "On the cycle-transitive comparison of artificially coupled random variables.",
            "Projective MV-algebras.",
            "Probabilistic abduction without priors.",
            "Fuzzy integrals and linearity.",
            "Probabilistic partial knowledge handling.",
            "Generalized real analysis and its applications.",
            "De Finetti's contribution to the theory of random functions.",
            "Perception based data mining and decision support systems.",
            "Mining pure linguistic associations from numerical data.",
            "Refinement of temporal constraints in fuzzy associations.",
            "Fuzzy transform in the analysis of data.",
            "Linguistic object-oriented web-usage mining.",
            "Ontology-based intelligent decision support agent for CMMI project monitoring and control.",
            "Orness and parameterized RIM quantifier aggregation with OWA operators: A summary.",
            "Fuzzy orders and fuzzifying topologies.",
            "An image coding/decoding method based on direct and inverse fuzzy transforms.",
            "Finitely additive extensions of distribution functions and moment sequences: The coherent lower prevision approach.",
            "Rule reduction for efficient inferencing in similarity based reasoning.",
            "Some properties of a random set approximation to upper and lower distribution functions.",
            "Dynamic multiagent probabilistic inference.",
            "A generic qualitative characterization of independence of causal influence.",
            "Geometry of possibility measures on finite sets.",
            "Dynamic intuitionistic fuzzy multi-attribute decision making.",
            "Prioritized aggregation operators.",
            "Approximate algorithms for credal networks with binary variables.",
            "On improving trapezoidal and triangular approximations of fuzzy numbers.",
            "Fuzzy region connection calculus: Representing vague topological information.",
            "Fuzzy region connection calculus: An interpretation based on closeness.",
            "Special issue in memory of Philippe Smets (1938-2005).",
            "A definition of subjective possibility.",
            "The Dempster-Shafer calculus for statisticians.",
            "An algebraic theory for statistical information based on the theory of hints.",
            "Inference in directed evidential networks based on the transferable belief model.",
            "Least committed basic belief density induced by a multivariate Gaussian: Formulation with applications.",
            "Defining belief functions using mathematical morphology - Application to image fusion under imprecision.",
            "Clustering decomposed belief functions using generalized weights of conflict.",
            "Non-adaptability measures in the pseudo-questionnaires context.",
            "RC_Link: Genetic linkage analysis using Bayesian networks.",
            "Fuzzy classifier identification using decision tree and multiobjective evolutionary algorithms.",
            "Generalized rough approximations in PI 1/2.",
            "Linguistic quantifiers based on Choquet integrals.",
            "On the representation of fuzzy rules.",
            "A general model of parameterized OWA aggregation with given orness level.",
            "A survey of the theory of coherent lower previsions.",
            "Bayesian networks with a logistic regression model for the conditional probabilities.",
            "Special Issue on Choquet integration in honor of Gustave Choquet (1915-2006).",
            "The extreme points of the set of belief measures.",
            "A Yosida-Hewitt decomposition for totally monotone set functions on locally compact sigma-compact topological spaces.",
            "Some Fubini Theorems on product sigma-algebras for non-additive measures.",
            "Dual volatility and dependence parameters and the copula.",
            "Editorial - Special issue on nonmonotonic and uncertain reasoning.",
            "Formalizing argumentative reasoning in a possibilistic logic programming setting with fuzzy unification.",
            "Preference-based argumentation: Arguments supporting multiple values.",
            "Predicting causality ascriptions from background knowledge: model and experimental validation.",
            "Distance-based paraconsistent logics.",
            "Decision trees as possibilistic classifiers.",
            "A hybrid approach to semantic web services matchmaking.",
            "Fuzzy Chebyshev type inequality.",
            "Generalized fuzzy rough approximation operators based on fuzzy coverings.",
            "Axiomatic systems for rough sets and fuzzy rough sets.",
            "Generalisation of roughness bounds in rough set operations.",
            "Complexity results for enhanced qualitative probabilistic networks.",
            "Logical approaches to imprecise probabilities.",
            "Probabilistic logic with independence.",
            "Probabilistic description logic programs under inheritance with overriding for the Semantic Web.",
            "Specifying and reasoning about uncertain agents.",
            "A logic with approximate conditional probabilities that can model default reasoning.",
            "Handling uncertainty and defeasibility in a possibilistic logic setting.",
            "Extending uncertainty formalisms to linear constraints and other complex formalisms.",
            "Imprecise probabilities in finance and economics.",
            "Portfolio management under epistemic uncertainty using stochastic dominance and information-gap theory.",
            "Information processing under imprecise risk with an insurance demand illustration.",
            "Coherent and convex fair pricing and variability measures.",
            "American option pricing with imprecise risk-neutral probabilities.",
            "The fundamental theorems of prevision and asset pricing.",
            "Financial risk measurement with imprecise probabilities.",
            "The game-theoretic capital asset pricing model.",
            "New geometric inference techniques for type-2 fuzzy sets.",
            "Bayesian learning for a class of priors with prescribed marginals.",
            "Implementing semantic merging operators using binary decision diagrams.",
            "Probabilistic rough sets: Approximations, decision-makings, and applications.",
            "Probabilistic rough set approximations.",
            "Probabilistic approach to rough sets.",
            "Parameterized rough set model using rough membership and Bayesian confirmation measures.",
            "Fuzzy rough approximations of process data.",
            "Approximate reasoning in the algebra of bounded rational agents.",
            "Variable precision rough set for group decision-making: An application.",
            "Editorial Note.",
            "Decision-theoretic specification of credal networks: A unified language for uncertain modeling with sets of Bayesian networks.",
            "Estimation of causal effects using linear non-Gaussian causal models with hidden variables.",
            "Adapting Bayes network structures to non-stationary domains.",
            "Evidence and scenario sensitivities in naive Bayesian classifiers.",
            "A generalization of additive generator of triangular norms.",
            "Modus ponens and modus tollens in discrete implications.",
            "Efficient non-myopic value-of-information computation for influence diagrams.",
            "A linear goal programming priority method for fuzzy analytic hierarchy process and its applications in new product screening.",
            "Formal reasoning with rough sets in multiple-source approximation systems.",
            "A characterization of interval-valued residuated lattices.",
            "Modeling time-varying uncertain situations using Dynamic Influence Nets.",
            "Belief update in CLG Bayesian networks with lazy propagation.",
            "Adaptive fuzzy fitness granulation for evolutionary optimization.",
            "Description and classification of complex structured objects by applying similarity measures.",
            "Hierarchical fusion of expert opinions in the Transferable Belief Model, application to climate sensitivity.",
            "Constructing consonant belief functions from sample data using confidence sets of pignistic probabilities.",
            "Logics from Galois connections.",
            "Mutual information-based feature selection and partition design in fuzzy rule-based classifiers from vague data.",
            "Dependence-space-based attribute reductions in inconsistent decision information systems.",
            "Structural and parametric design of fuzzy inference systems using hierarchical fair competition-based parallel genetic algorithms and information granulation.",
            "Unifying practical uncertainty representations - I: Generalized p-boxes.",
            "Unifying practical uncertainty representations. II: Clouds.",
            "A theoretical investigation of regular equivalences for fuzzy graphs.",
            "Rough sets approach to symbolic value partition.",
            "Statistical matching of multiple sources: A look through coherence."
        ]
    },
    {
        "name": "IJAR",
        "year": "2007",
        "info": "2007: Volumes\n44,\n45,\n46",
        "count": 94,
        "papers": [
            "Special Issue on Genetic Fuzzy Systems and the Interpretability-Accuracy Trade-off.",
            "Analysis of interpretability-accuracy tradeoff of fuzzy systems by multiobjective fuzzy genetics-based machine learning.",
            "Improving the accuracy while preserving the interpretability of fuzzy function approximators by means of multi-objective evolutionary algorithms.",
            "Genetic learning of accurate and compact fuzzy rule based systems based on the 2-tuples linguistic representation.",
            "Interpretability-preserving genetic optimization of linguistic terms in fuzzy models for fuzzy ordered classification: An ecological case study.",
            "Fuzzy decision-making applications.",
            "A fuzzy approach to R&D project portfolio selection.",
            "Decision tree search methods in fuzzy modeling and classification.",
            "Prioritization of organizational capital measurement indicators using fuzzy AHP.",
            "Sensory evaluation based on linguistic decision analysis.",
            "A fuzzy-set approach to treat determinacy and consistency of linguistic terms in multi-criteria decision making.",
            "A fuzzy approach to value and culture assessment and an application.",
            "Reasoning with imprecise probabilities.",
            "Fast algorithms for robust classification with Bayesian nets.",
            "Hybrid possibilistic networks.",
            "Computing lower and upper expectations under epistemic independence.",
            "Hill-climbing and branch-and-bound algorithms for exact and approximate inference in credal networks.",
            "A probabilistic logic based on the acceptability of gambles.",
            "Nonmonotonic probabilistic logics under variable-strength inheritance with overriding: Complexity, algorithms, and implementation.",
            "Decision making under incomplete data using the imprecise Dirichlet model.",
            "Extreme points of coherent probabilities in finite spaces.",
            "Notes on \"Notes on conditional previsions\".",
            "Notes on conditional previsions.",
            "Multisensor triplet Markov chains and theory of evidence.",
            "Decision making under uncertainty using imprecise probabilities.",
            "Interpolating between fuzzy rules using improper S-implications.",
            "On the soundness of altering granular information.",
            "The solution equivalence of minimax disparity and minimum variance problems for OWA operators.",
            "Joint propagation of probability and possibility in risk analysis: Towards a formal framework.",
            "Degree of imprecision: Geometric and algorithmic approaches.",
            "Analytical formulas for risk assessment for a class of problems where risk depends on three interrelated variables.",
            "Fuzzy lattice reasoning (FLR) classifier and its application for ambient ozone estimation.",
            "Special Issue on the Eighth European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU 2005).",
            "Approximate probability propagation with mixtures of truncated exponentials.",
            "Towards scalable and data efficient learning of Markov boundaries.",
            "Bayesian network learning algorithms using structural restrictions.",
            "On-line alert systems for production plants: A conflict based approach.",
            "Non-deterministic semantics for logics with a consistency operator.",
            "Probabilistic description logic programs.",
            "Remedying inconsistent sets of premises.",
            "An argumentation framework for merging conflicting knowledge bases.",
            "Comparative models ruled by possibility and necessity: A conditional world.",
            "Comparing probability measures using possibility theory: A notion of relative peakedness.",
            "Racing algorithms for conditional independence inference.",
            "APPSSAT: Approximate probabilistic planning using stochastic satisfiability.",
            "North American Fuzzy Information Processing Society Annual Conference NAFIPS'2005, June 22-25, Ann Arbor, MI.",
            "Context representation using word sequences extracted from a news corpus.",
            "Fuzzy clustering in parallel universes.",
            "Fuzzy variant of a statistical test point Kalman filter.",
            "A study on the modeling ability of the IDS method: A soft computing technique using pattern-based information processing.",
            "Fuzzy modelling through logic optimization.",
            "Characterizing the result of the division of fuzzy relations.",
            "Consensus and dissention: A measure of ordinal dispersion.",
            "Fuzzy component based object detection.",
            "Using expert knowledge in solving the seismic inverse problem.",
            "Random sets and imprecise probabilities.",
            "On Choquet theorem for random upper semicontinuous functions.",
            "Uncertain information: Random variables in graded semilattices.",
            "Decomposition and representation theorem of set-valued amarts.",
            "On metrization of the hit-or-miss topology using Alexandroff compactification.",
            "On some metrics compatible with the Fell-Matheron topology.",
            "Decoupled sliding-mode with fuzzy-neural network controller for nonlinear systems.",
            "Determination of the degrees of P-property and nonnegative invertibility for a fuzzy matrix.",
            "Stability analysis for a class of Takagi-Sugeno fuzzy control systems with PID controllers.",
            "Similarity measures of intuitionistic fuzzy sets based on Lp metric.",
            "Weighted triangular approximation of fuzzy numbers.",
            "Robust H2 fuzzy output feedback control for discrete-time nonlinear systems with parametric uncertainties.",
            "Operating with potentials of discrete variables.",
            "Marginal extension in the theory of coherent lower previsions.",
            "A fuzzy linguistic model to evaluate the quality of Web sites that store XML documents.",
            "Erratum to \"A fuzzy-set approach to treat determinacy and consistency of linguistic terms in multi-criteria decision making\" [Int. J. Approx. Reasoning 44 (2007) 165-181].",
            "Editorial.",
            "Does non-correlation imply non-causation?",
            "Inference in multi-agent causal models.",
            "Convergence in Markovian models with implications for efficiency of inference.",
            "Theoretical analysis and practical insights on importance sampling in Bayesian networks.",
            "Maximal prime subgraph decomposition of Bayesian networks: A relational database perspective.",
            "Complexity measurement of fundamental pseudo-independent models.",
            "A paraconsistent logic programming approach for querying inconsistent databases.",
            "Distribution of expected utility in decision trees.",
            "Pfanzagl exchanges diagnose an anomaly in expected utility decision theory.",
            "Aggregation operators.",
            "Generalized conjunction/disjunction.",
            "Basic generated universal fuzzy measures.",
            "On representation and aggregation of social evaluations in computational trust and reputation models.",
            "Geometric programming with fuzzy parameters in engineering optimization.",
            "Towards adding probabilities and correlations to interval computations.",
            "ET-lipschitzian and ET-kernel aggregation operators.",
            "Qualitative kinematics of planar robots: Intelligent connection.",
            "Facial expression classification: An approach based on the fusion of facial deformations using the transferable belief model.",
            "Pruning belief decision tree methods in averaging and conjunctive approaches.",
            "k-lp-Lipschitz t-norms.",
            "De Finetti theorem and Borel states in [0, 1]-valued algebraic logic.",
            "Probabilistic independence with respect to upper and lower conditional probabilities assigned by Hausdorff outer and inner measures."
        ]
    },
    {
        "name": "IJAR",
        "year": "2006",
        "info": "2006: Volumes\n41,\n42,\n43",
        "count": 51,
        "papers": [
            "Aggregation operators and decision modeling.",
            "LSP method and its use for evaluation of Java IDEs.",
            "Unsupervised construction of fuzzy measures through self-organizing feature maps and its application in color image segmentation.",
            "The interpretation of fuzzy integrals and their application to fuzzy systems.",
            "Fuzzy adaptive search method for parallel genetic algorithm with island combination process.",
            "Advances in fuzzy sets and rough sets.",
            "Spatial reasoning under imprecision using fuzzy set theory, formal logics and mathematical morphology.",
            "Possibilistic clustering approach to trackless ring Pattern Recognition in RICH counters.",
            "Concepts and fuzzy models for behavior-based robotics.",
            "Interface optimality in fuzzy inference systems.",
            "Fuzzy relational neural network.",
            "Modelling and implementation of fuzzy systems based on VHDL.",
            "Fuzzy rough sets and multiple-premise gradual decision rules.",
            "Rough fuzzy set based scale space transforms and their use in image analysis.",
            "A rough set-based case-based reasoner for text categorization.",
            "Philippe Smets (1938-2005).",
            "Inference in hybrid Bayesian networks with mixtures of truncated exponentials.",
            "Reasoning under uncertainty with FIR methodology.",
            "On the plausibility transformation method for translating belief function models to probability models.",
            "Computing best-possible bounds for the distribution of a sum of several variables is NP-hard.",
            "Fuzzy-hybrid modelling of an Ackerman steered electric vehicle.",
            "Special issue on PGM'04: Second European workshop on probabilistic graphical models 2004.",
            "Compiling relational Bayesian networks for exact inference.",
            "Operations for inference in continuous Bayesian networks with linear deterministic variables.",
            "Learning Bayesian network parameters under order constraints.",
            "Learning hybrid Bayesian networks using mixtures of truncated exponentials.",
            "Learning parameters of Bayesian networks from incomplete data via importance sampling.",
            "Learning probabilistic decision graphs.",
            "Sequential influence diagrams: A unified asymmetry framework.",
            "A forward-backward Monte Carlo method for solving influence diagrams.",
            "Generalizing variance to allow the inclusion of decision attitude in decision making under uncertainty.",
            "Fuzzy local independent component analysis with external criteria and its application to knowledge discovery in databases.",
            "UPGMA clustering revisited: A weight-driven approach to transitive approximation.",
            "Jeffrey's conditioning rule in neighbourhood models.",
            "Computing mean and variance under Dempster-Shafer uncertainty: Towards faster algorithms.",
            "Constructing belief functions from sample data using multinomial confidence regions.",
            "Supervised classification with conditional Gaussian networks: Increasing the structure complexity from naive Bayes.",
            "The design of self-organizing neural networks based on PNs and FPNs with the aid of genetic optimization and extended GMDH method.",
            "Multi-objective evolutionary computation and fuzzy optimization.",
            "An asymptotically tight bound on countermodels for Lukasiewicz logic.",
            "On the properties of equidifferent OWA operator.",
            "Comments on the paper: \"On the properties of equidifferent OWA operator\" by Xinwang Liu.",
            "Reply to \"Comments on the paper: On the properties of equidifferent OWA operator\".",
            "Consistency degrees of theories and methods of graded reasoning in n-valued R0-logic (NM-logic).",
            "Possibilistic conditioning framed in fuzzy logics.",
            "The nearest trapezoidal form of a generalized left right fuzzy number.",
            "Value versus damage of information release: A data privacy perspective.",
            "Extraction of similarity based fuzzy rules from artificial neural networks.",
            "Bookmaking over infinite-valued events.",
            "On the calculation of the bounds of probability of events using infinite random sets.",
            "Extensions of the multicriteria analysis with pairwise comparison under a fuzzy environment."
        ]
    },
    {
        "name": "IJAR",
        "year": "2005",
        "info": "2005: Volumes\n38,\n39,\n40",
        "count": 50,
        "papers": [
            "A fuzzy noise-rejection data partitioning algorithm.",
            "Multiplication and comultiplication of beliefs.",
            "Anytime anyspace probabilistic inference.",
            "Value differences using second-order distributions.",
            "A fuzzy-based tool for modelization and analysis of the vulnerability of aquifers: a case study.",
            "Fuzzy control with limited control opportunities and response delay - a production-inventory control scenario.",
            "Decision making in the TBM: the necessity of the pignistic transformation.",
            "A distance measure for bounding probabilistic belief change.",
            "New directions in fuzzy automata.",
            "Special Issue on ECSQARU-2003: The Seventh European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty: Message from the Guest Editors.",
            "A representation theorem and applications to measure selection and noninformative priors.",
            "Dynamic importance sampling in Bayesian networks based on probability trees.",
            "Solving linear-quadratic conditional Gaussian influence diagrams.",
            "Characterization of inclusion neighbourhood in terms of the essential graph.",
            "Effective dimensions of partially observed polytrees.",
            "Introducing situational signs in qualitative probabilistic networks.",
            "Using probabilistic argumentation for key validation in public-key cryptography.",
            "Behavioral design to model a reactive decision of an expert in geothermal wells.",
            "The development of a robust fuzzy inference mechanism.",
            "Foundations of probabilistic inference with uncertain evidence.",
            "Representing human uncertainty by subjective likelihood estimates.",
            "An adaptive fuzzy observer-based approach for chaotic synchronization.",
            "Credibility via imprecise probability.",
            "An introduction to the imprecise Dirichlet model for multinomial data.",
            "Partial identification with missing data: concepts and findings.",
            "Graphical models for imprecise probabilities.",
            "Utilizing belief functions for the estimation of future climate change.",
            "Benefits of embedding structural constraints in coherent diagnostic processes.",
            "Upper entropy of credal sets. Applications to credal classification.",
            "Dynamic programming for deterministic discrete-time systems with uncertain gain.",
            "Inference in credal networks: branch-and-bound methods and the A/R+ algorithm.",
            "Uncertainty modelling and conditioning with convex imprecise previsions.",
            "Introduction to special issues on data mining and granular computing.",
            "Design of nearest neighbor classifiers: multi-objective approach.",
            "Rough representation of a region of interest in medical images.",
            "Rough set theory for topological spaces.",
            "Mining association rules with multiple minimum supports using maximum constraints.",
            "A simplicial complex, a hypergraph, structure in the latent semantic space of document clustering.",
            "The investigation of the Bayesian rough set model.",
            "The structure analysis of fuzzy sets.",
            "A new fuzzy clustering algorithm for optimally finding granular prototypes.",
            "Editorial.",
            "A generalization of local divergence measures.",
            "An uncertainty interchange format with imprecise probabilities.",
            "Belief functions on real numbers.",
            "Hinfinity estimation for fuzzy membership function optimization.",
            "Dynamic projection network for supervised pattern classification.",
            "On two types of discrete implications.",
            "Soft computing optimization methods applied to logistic processes.",
            "A new approach to fuzzy wavelet system modeling."
        ]
    },
    {
        "name": "IJAR",
        "year": "2004",
        "info": "2004: Volumes\n35, 36, 37",
        "count": 37,
        "papers": [
            "Nonparametric regression analysis of uncertain and imprecise data using belief functions.",
            "Stability of continuous value discretisation: an application within rough set theory.",
            "Implication in intuitionistic fuzzy and interval-valued fuzzy set theory: construction, classification, application.",
            "Comments on \"Constructing a logic of plausible inference: a guide to Cox's Theorem\", by Kevin S. Van Horn.",
            "Response to Shafer's comments.",
            "On precise and correct qualitative probabilistic inference.",
            "A diffusion-neural-network for learning from small samples.",
            "On the properties of parametric geometric OWA operator.",
            "A practical approach to fuzzy utilities comparison in fuzzy multicriteria analysis.",
            "Influence of fuzzy norms and other heuristics on \"Mixed fuzzy rule formation\".",
            "Special issue on integration of methods and hybrid systems.",
            "Imprecise specification of ill-known functions using gradual rules.",
            "Adaptive multiresolution search: How to beat brute force?",
            "Different approaches to fuzzy clustering of incomplete datasets.",
            "Combining labelled and unlabelled data in the design of pattern classification systems.",
            "An approach for fuzzy rule-base adaptation using on-line clustering.",
            "Financial markets analysis by using a probabilistic fuzzy modelling approach.",
            "Integration of intelligent systems in development of smart adaptive systems.",
            "Equivalence of methods for uncertainty propagation of real-valued random variables.",
            "Bounding probabilistic relationships in Bayesian networks using qualitative influences: methods and applications.",
            "Conditioning and updating evidence.",
            "Decision making using minimization of regret.",
            "Elementary calculus in Riesz MV-algebras.",
            "Fusion of expert and learnt knowledge in a framework of fuzzy labels.",
            "Optimization problems in multivariable fuzzy predictive control.",
            "Hyperrelations in version space.",
            "Function estimation using a neural-fuzzy network and an improved genetic algorithm.",
            "Goal programming models for obtaining the priority vector of incomplete fuzzy preference relation.",
            "Ordered valuation algebras: a generic framework for approximating inference.",
            "A process monitoring module based on fuzzy logic and pattern recognition.",
            "The philosophical significance of Cox's theorem.",
            "Standard theories of fuzzy sets with the law (mu Lambda sigma) = (mu Lambda sigma).",
            "Evaluation of quantified propositions in generalized models of fuzzy quantification.",
            "Component-wise robust linear fuzzy clustering for collaborative filtering.",
            "Indistinguishability relations in Dempster-Shafer theory of evidence.",
            "KPCA-based training of a kernel fuzzy classifier with ellipsoidal regions.",
            "Active Hebbian learning algorithm to train fuzzy cognitive maps."
        ]
    },
    {
        "name": "IJAR",
        "year": "2003",
        "info": "2003: Volumes\n32, 33, 34",
        "count": 42,
        "papers": [
            "Data-driven generation of compact, accurate, and linguistically sound fuzzy classifiers based on a decision-tree initialization.",
            "Epistemic independence in numerical possibility theory.",
            "Multi-interpretation operators and approximate classification.",
            "Information mining.",
            "Mixed fuzzy rule formation.",
            "Improved fuzzy partitions for fuzzy regression models.",
            "Fuzzy data analysis with NEFCLASS.",
            "FS-FOIL: an inductive learning method for extracting interpretable fuzzy descriptions.",
            "A hierarchical recurrent neuro-fuzzy model for system identification.",
            "Approximate symbolic pattern matching for protein sequence data.",
            "Linguistic modeling with hierarchical systems of weighted linguistic rules.",
            "Web mining with relational clustering.",
            "Symbolic state transducers and recurrent neural preference machines for text mining.",
            "Enhancement of topology preservation and hierarchical dynamic self-organising maps for data visualisation.",
            "A new understanding of subjective probability and its generalization to lower and upper prevision.",
            "Fuzzy active noise modeling and control.",
            "Implicitly preserving semantics during incremental knowledge base acquisition under uncertainty.",
            "Extreme points of credal sets generated by 2-alternating capacities.",
            "Evaluation of a verbal-numerical probability scale.",
            "Searching for the dimension of valued preference relations.",
            "On implicative closure operators in approximate reasoning.",
            "A survey on universal approximation and its limits in soft computing techniques.",
            "On the measurability of knowledge acquisition, query processing.",
            "An alternative characterization of a Bayesian network.",
            "Comparison of multiagent inference methods in multiply sectioned Bayesian networks.",
            "Fusion of possibilistic knowledge bases from a postulate point of view.",
            "The reasonableness of necessity.",
            "Constructing a logic of plausible inference: a guide to Cox's theorem.",
            "Level sets and minimum volume sets of probability density functions.",
            "Definition and classification of semi-fuzzy quantifiers for the evaluation of fuzzy quantified sentences.",
            "Special issue on soft computing applications to intelligent information retrieval on the Internet.",
            "Information retrieval in the Web: beyond current search engines.",
            "Soft approaches to distributed information retrieval.",
            "P-FCM: a proximity-based fuzzy clustering for user-centered web applications.",
            "Rules and fuzzy rules in text: concept, extraction and usage.",
            "Bayesian belief networks for IR.",
            "Proximity measures for terms based on fuzzy neighborhoods in document sets.",
            "An application of the FIS-CRM model to the FISS metasearcher: Using fuzzy synonymy and fuzzy generality for representing concepts in documents.",
            "A model of fuzzy linguistic IRS based on multi-granular linguistic information.",
            "A review on the application of evolutionary computation to information retrieval.",
            "The BNR model: foundations and performance of a Bayesian network-based retrieval model.",
            "Comparison of neural models for document clustering."
        ]
    },
    {
        "name": "IJAR",
        "year": "2002",
        "info": "2002: Volumes\n29, 30, 31",
        "count": 31,
        "papers": [
            "Using probability trees to compute marginals with imprecise probabilities.",
            "Belief function independence: I. The marginal case.",
            "Soft evidential update for probabilistic multiagent systems.",
            "Troubleshooting using probabilistic networks and value of information.",
            "On the transformation between possibilistic logic bases and possibilistic causal networks.",
            "Some relationships between fuzzy and random set-based classifiers and models.",
            "Constructing a fuzzy flow-shop sequencing model based on statistical data.",
            "A realistic (non-associative) logic and a possible explanations of 7 pm 2 law.",
            "A two-stage approach to self-learning direct fuzzy controllers.",
            "The L-separation criterion for description of cs-independence models.",
            "Evaluation of Bayesian networks with flexible state-space abstraction methods.",
            "Design of fuzzy logic controllers for Takagi-Sugeno fuzzy model based system with guaranteed performance.",
            "A general class of triangular norm-based aggregation operators: quasi-linear T-S operators.",
            "Fuzzy robust tracking control for uncertain nonlinear systems.",
            "Divergence measure between fuzzy sets.",
            "Contradiction sensitive fuzzy model-based adaptive control.",
            "A heuristic algorithm for computing the max-min inverse fuzzy relation.",
            "Neuro-fuzzy approach to processing inputs with missing values in pattern recognition problems.",
            "Networks of probabilistic events in discrete time.",
            "A parametric representation of linguistic hedges in Zadeh's fuzzy logic.",
            "The application of the matrix calculus to belief functions.",
            "Belief function independence: II. The conditional case.",
            "Approximating the combination of belief functions using the fast Mo\"bius transform in a coarsened frame.",
            "Resource bounded and anytime approximation of belief function computations.",
            "Synergies between evolutionary computation and probabilistic graphical models.",
            "Evolutionary optimization and the estimation of search distributions with applications to graph bipartitioning.",
            "Using a priori knowledge to create probabilistic models for optimization.",
            "Scalability of the Bayesian optimization algorithm.",
            "Multi-objective optimization with diversity preserving mixture-based iterated density estimation evolutionary algorithms.",
            "Ant colony optimization for learning Bayesian networks.",
            "Mathematical modelling of UMDAc algorithm with tournament selection. Behaviour on linear and quadratic functions."
        ]
    },
    {
        "name": "IJAR",
        "year": "2001",
        "info": "2001: Volumes\n26, 27, 28",
        "count": 29,
        "papers": [
            "A commutative l-monoid for classification with fuzzy attributes.",
            "A generalized real-valued measure of the inequality associated with a fuzzy random variable.",
            "Similarity-based inference as evidential reasoning.",
            "Cost-bounded argumentation.",
            "Fuzzy control of a class of multivariable nonlinear systems subject to parameter uncertainties: model reference approach.",
            "Elkan's theoretical argument, reconsidered.",
            "Paradoxes of fuzzy logic, revisited.",
            "Comments to \"Paradoxes of fuzzy logic, revisited\".",
            "Constant-space reasoning in dynamic Bayesian networks.",
            "Multidimensional and multideme genetic algorithms for the construction of fuzzy systems.",
            "Function approximation using non-normalized SISO fuzzy systems.",
            "Takagi-Sugeno fuzzy model development of batch biotechnological processes.",
            "Fuzzy automaton induction using neural network.",
            "Information sharing between heterogeneous uncertain reasoning models in a multi-agent environment: a case study.",
            "Fuzzy modeling by hierarchically built fuzzy rule bases.",
            "Editorial: Special Issue on causal networks: papers from the Second CaNew Workshop.",
            "Bayesian model-based diagnosis.",
            "Accelerating chromosome evaluation for partial abductive inference in Bayesian networks by means of explanation set absorption.",
            "Feature subset selection by Bayesian networks: a comparison with genetic and sequential algorithms.",
            "Learning Bayesian network parameters from small data sets: application of Noisy-OR gates.",
            "Estimating probability values from an incomplete dataset.",
            "Spatial relations between indeterminate regions.",
            "A hybrid methodology for learning belief networks: BENEDICT.",
            "Partial abductive inference in Bayesian belief networks by simulated annealing.",
            "Automatic derivation of probabilistic inference rules.",
            "Performance evaluation of compromise conditional Gaussian networks for data clustering.",
            "A methodology for computing with words.",
            "Belief decision trees: theoretical foundations.",
            "Fuzzy decision support system knowledge base generation using a genetic algorithm."
        ]
    },
    {
        "name": "IJAR",
        "year": "2000",
        "info": "2000: Volumes\n23, 24, 25",
        "count": 34,
        "papers": [
            "Belief updating in multiply sectioned Bayesian networks without repeated local propagations.",
            "Fuzzy cardinality based evaluation of quantified sentences.",
            "A genetic algorithm to obtain the optimal recurrent neural network.",
            "GA-based learning for a model-based object recognition system.",
            "Classificatory filtering in decision systems.",
            "Indicator of inclusion grade for interval-valued fuzzy sets. Application to approximate reasoning based on interval-valued fuzzy sets.",
            "New perspectives on Causal Networks: the first CaNew workshop.",
            "A new approach for learning belief networks using independence criteria.",
            "Priors on network structures. Biasing the search for Bayesian networks.",
            "A justification of local conditioning in Bayesian networks.",
            "Graphical dynamic linear models: specification, use and graphical transformations.",
            "Prior knowledge for learning networks in non-probabilistic settings.",
            "Reasoning with imprecise probabilities.",
            "Towards a unified theory of imprecise probability.",
            "The theory of interval-probability as a unifying concept for uncertainty.",
            "Probabilistic satisfiability with imprecise probabilities.",
            "Computing posterior upper expectations.",
            "Axiomatic characterization of partial ordinal relations.",
            "A survey of some applications of the idea of ambiguity aversion in economics.",
            "Epistemic independence for imprecise probabilities.",
            "A generalization of the fundamental theorem of de Finetti for imprecise conditional probability assessments.",
            "Totally monotone core and products of monotone measures.",
            "Ambiguity reduction through new statistical data.",
            "MV-algebras, multiple bets and subjective states.",
            "Approximate reasoning and conflict resolution.",
            "Monetary unit sampling: a belief-function implementation for audit and accounting applications.",
            "Nonlinear nonnegative multiregressions based on Choquet integrals.",
            "A neural model for fuzzy Dempster-Shafer classifiers.",
            "Minimal approximate hitting sets and rule templates.",
            "Design and rule base reduction of a fuzzy filter for the estimation of motor currents.",
            "Optimal scheduling of progressive processing tasks.",
            "Analysis and guidelines to obtain a good uniform fuzzy partition granularity for fuzzy rule-based systems using simulated annealing.",
            "Fuzzy types: a framework for handling uncertainty about types of objects.",
            "Fuzzy behaviors for mobile robot navigation: design, coordination and fusion."
        ]
    },
    {
        "name": "IJAR",
        "year": "1999",
        "info": "1999: Volumes\n20, 21, 22",
        "count": 34,
        "papers": [
            "Performance evaluation of fuzzy classification methods designed for real time application.",
            "A proposal on reasoning methods in fuzzy rule-based classification systems.",
            "Logic of agreement: foundations, semantic system and proof theory.",
            "Reasoning with imprecise belief structures.",
            "Using propositional logic to compute probabilities in multistate systems.",
            "A genetic-fuzzy approach for mobile robot navigation among moving obstacles.",
            "On the possibility theory-based semantics for logics of preference.",
            "Interpreting membership functions: A constructive approach.",
            "A graphical characterization of the largest chain graphs.",
            "Fuzzy projection pursuit density estimation by eigenvalue method.",
            "Solutions to fuzzy integral equations with arbitrary kernels.",
            "Probabilistic temporal networks: A unified framework for reasoning with time and uncertainty.",
            "Including decision attitude in probabilistic decision making.",
            "Local probabilistic deduction from taxonomic and probabilistic knowledge-bases over conjunctive events.",
            "Coherence of rules for defining conditional possibility.",
            "New methodology for the development of adaptive and self-learning fuzzy controllers in real time.",
            "A note on negations and nilpotent t-norms.",
            "Dempster-Shafer theory framed in modal logic.",
            "Design of hybrid architectures based on neural classifier and RBF pre-processing for ECG analysis.",
            "Decision model formulation of subjective classification problem-solving knowledge using a neuro-fuzzy classifier and its effectiveness.",
            "Multicriteria analysis with fuzzy pairwise comparison.",
            "Dealing with uncertainty and imprecision by means of fuzzy numbers.",
            "Potential approach in marginalizing Gibbs models.",
            "IJAR Special Issue dedicated to the International Summer School: Fuzzy logic control advances in methodology.",
            "Fuzzy model-based predictive control using Takagi-Sugeno models.",
            "Soft modelling and fuzzy logic control of wheeled skid-steer electric vehicles with steering prioritisation.",
            "Fuzzy fusion between fluidodynamic and neural models for monitoring multiphase flows.",
            "Supervision and c-Means clustering of PID controllers for a solar power plant.",
            "Improving fuzzy systems identification with data transformations.",
            "Controlling with words using automatically identified fuzzy Cartesian granule feature models.",
            "Parameter identification for piecewise-affine fuzzy models in noisy environment.",
            "Talking probabilities: communicating probabilistic information with words and numbers.",
            "Decision making under interval probabilities.",
            "Local computation of Gaussian belief functions."
        ]
    },
    {
        "name": "IJAR",
        "year": "1998",
        "info": "1998: Volumes\n18, 19",
        "count": 41,
        "papers": [
            "Theory of evidence and non-exhaustive frames of discernment: Plausibilities correction methods.",
            "Robust optimization under softness in a fuzzy linear programming problem.",
            "Fusion of ordinal information using weighted median aggregation.",
            "A Monte Carlo algorithm for probabilistic propagation in belief networks based on importance sampling and stratified simulation techniques.",
            "Simple data filtering in rough set systems.",
            "Specialisation calculus and communication.",
            "Using fuzzy logic for performance evaluation in reinforcement learning.",
            "Possibilistic conditional independence: A similarity-based measure and its application to causal network learning.",
            "Preface Algebraic models and MV-algebras for fuzzy reasoning.",
            "Representation of an MV-algebra by its triangular norms.",
            "Some fuzzy concepts of BCI, BCK and MV-algebras.",
            "Open theories, consistency and related results in fuzzy logic.",
            "Probabilities on Lukasiewicz-Moisil algebras.",
            "MV-algebras embedded in a CL-algebra.",
            "Coupling an MV-algebra with a Boolean algebra.",
            "Strict Archimedean t-norms and t-conorms as universal approximators.",
            "A parallel algorithm for building possibilistic causal networks.",
            "Fuzzy management of user actions during hypermedia navigation.",
            "Approximate reasoning in scheduling.",
            "Genetic multi-criteria approach to flexible line scheduling.",
            "Scheduling of parallel programs on configurable multiprocessors by genetic algorithms.",
            "The GST load balancing algorithm for parallel and distributed systems.",
            "Approximating scheduling for multimedia applications under overload conditions.",
            "Arranging program statements for locality on the basis of neighbourhood preferences.",
            "Criteria-directed task scheduling.",
            "Fuzzy system models for aggregate scheduling analysis.",
            "Multi-site scheduling with fuzzy concepts.",
            "A reusable iterative optimization software library to solve combinatorial problems with approximate reasoning.",
            "A fuzzy theory refinement algorithm.",
            "Extensionality based approximate reasoning.",
            "A note on conditional logics and entropy.",
            "Uncertain inference using interval probability theory.",
            "A proof theoretic approach to qualitative probabilistic reasoning.",
            "Quantized norms and generalized relational composition on dense universes.",
            "A voting mechanism for fuzzy logic.",
            "Independence of causal influence and clique tree propagation.",
            "A note about redundancy in influence diagrams.",
            "Analysis of the operators involved in the definition of the implication functions and in the fuzzy inference process.",
            "An overview of membership function generation techniques for pattern recognition.",
            "On generalized Hamacher families of triangular operators.",
            "Towards qualitative approaches to multi-stage decision making."
        ]
    },
    {
        "name": "IJAR",
        "year": "1997",
        "info": "1997: Volumes\n16, 17",
        "count": 38,
        "papers": [
            "Preface: Fuzzy logic applications.",
            "Numerical stability analysis for fuzzy control.",
            "Adaptation of cross-direction basis-weight control in paper machines using fuzzy decision logic.",
            "Knowledge-based fuzzy model for performance prediction of a rock-cutting trencher.",
            "Fuzzy logic and neural network applications to fault diagnosis.",
            "Comparison of different intelligent methods for process and quality monitoring.",
            "A model-based machine vision system using fuzzy logic.",
            "Choquet integrals and natural extensions of lower probabilities.",
            "A comparative study of possibilistic conditional independence and lack of interaction.",
            "Approximate topological relations.",
            "An inductive method for inexact reasoning.",
            "Editorial.",
            "Classes of fuzzy sets with the same material conditional.",
            "A modal account of similarity-based reasoning.",
            "Obtaining solutions in fuzzy constraint networks.",
            "A model for CAGD using fuzzy logic.",
            "Linguistic measures based on fuzzy coincidence for reaching consensus in group decision making.",
            "A Fuzzy logic controller with learning through the evolution of its knowledge base.",
            "Fuzzy control of a sailboat.",
            "Some methods to model fuzzy systems for inference purposes.",
            "A logical approach to interpolation based on similarity relations.",
            "Increased robustness of Bayesian networks through probability intervals.",
            "In defense of the maximum entropy inference process.",
            "Special issue on the 1996 uncertainty in AI (UAI'96) conference--preface.",
            "A characterization of Markov equivalence for directed cyclic graphs.",
            "Estimating extreme probabilities using tail simulated data.",
            "Hybrid algorithms for approximate belief updating in Bayes nets.",
            "Approximation algorithms and decision making in the Dempster-Shafer theory of evidence - An empirical study.",
            "Binary join trees for computing marginals in the Shenoy-Shafer architecture.",
            "A recovery algorithm for chain graphs.",
            "A synthetic view of belief revision with uncertain inputs in the framework of possibility theory.",
            "Special issue on genetic fuzzy systems for control and robotics-- Preface.",
            "Adapting the gain of an FLC with genetic algorithms.",
            "A cascaded genetic algorithm for improving fuzzy-system design.",
            "A three-stage evolutionary process for learning descriptive and approximate fuzzy-logic-controller knowledge bases from examples.",
            "Learning to compose fuzzy behaviors for autonomous agents.",
            "Coordination between autonomous robots.",
            "Evolutionary design of a fuzzy knowledge base for a mobile robot."
        ]
    },
    {
        "name": "IJAR",
        "year": "1996",
        "info": "1996: Volumes\n14, 15",
        "count": 31,
        "papers": [
            "Tuning of a fuzzy classifier derived from data.",
            "Exploiting case-based independence for approximating marginal probabilities.",
            "A modified simulation scheme for inference in Bayesian networks.",
            "Modal logic interpretation of Dempster-Shafer theory: An infinite case.",
            "A theory of Gaussian belief functions.",
            "On the normalization of fuzzy belief structures.",
            "Reasoning in evidential networks with conditional belief functions.",
            "A case study in the qualitative verification and debugging of numerical uncertainty.",
            "Texts on evidence theory: Comparative review.",
            "Heuristics and normative models of judgment under uncertainty.",
            "On the use of hierarchical clustering in fuzzy modeling.",
            "A generic ATMS.",
            "Development and evaluation of five fuzzy multiattribute decision-making methods.",
            "Training the fuzzy integral.",
            "A new model for linguistic modifiers.",
            "Bounded recursive decomposition: a search-based method for belief-network inference under limited resources.",
            "Importance sampling algorithms for the propagation of probabilities in belief networks.",
            "Fusion of fuzzy information with considerations for compatibility, partial aggregation, and reinforcement.",
            "Avoiding triviality: Fuzzy implications and conditional events.",
            "Constructing probabilistic ATMSs using extended incidence calculus.",
            "An improvement to Kóczy and Hirota's interpolative reasoning in sparse fuzzy rule bases.",
            "Fundamentals and Bayesian analyses of decision problems with fuzzy-valued utilities.",
            "Inference in belief networks: A procedural guide.",
            "On evidence absorption for belief networks.",
            "Introduction to the special issue on rough sets.",
            "Two views of the theory of rough sets in finite universes.",
            "Global discretization of continuous attributes as preprocessing for machine learning.",
            "Rough mereology: A new paradigm for approximate reasoning.",
            "A rough logic based on incomplete information and its application.",
            "Interpretation preservation of adaptive fuzzy inference systems.",
            "A rough logic formalism for fuzzy controllers: A hard and soft computing view."
        ]
    },
    {
        "name": "IJAR",
        "year": "1995",
        "info": "1995: Volumes\n12, 13",
        "count": 31,
        "papers": [
            "A qualitative fuzzy possibilistic logic.",
            "Assignment methods for incidence calculus.",
            "Conditional independence and natural conditional functions.",
            "Nonstandard conjunctions and implications in fuzzy logic.",
            "An alternative proof method for possibilistic logic and its application to terminological logics.",
            "Construction of Bayesian network structures from data: A brief survey and an efficient algorithm.",
            "Two characterizations of a minimum-information principle for possibilistic reasoning.",
            "Guest editor's page.",
            "Algorithmic aspects of fuzzy control.",
            "Developing a fuzzy logic controller in case of sparse testimonies.",
            "An approach to ordinal decision making.",
            "Linguistically oriented fuzzy logic control and its design.",
            "An alternative approach for generation of membership functions and fuzzy rules based on radial and cubic basis function networks.",
            "Tuning fuzzy logic controllers by genetic algorithms.",
            "Controlling retrieval through a user-adaptive representation of documents.",
            "Incremental conditioning of lower and upper probabilities.",
            "The role of relevance in explanation II: Disjunctive assignments and approximate independence.",
            "Local expression languages for probabilistic dependence.",
            "Modeling unforeseen events with similarity templates changes Bayesian probabilities into pignistic probabilities.",
            "Refinement of Uncertain Rule Bases via Reduction.",
            "Bayesian Network Implementation of Levi's Epistemic Utility Decision Theory.",
            "A complete, flexible fuzzy-based approach to the classification problem.",
            "On varrho in a decision-theoretic apparatus of Dempster-Shafer theory.",
            "A resolution-based system for symbolic approximate reasoning.",
            "Preface: 3rd international conference on fuzzy logic, neural nets, and soft computing.",
            "A new type of fuzzy neural network based on a truth space approach for automatic acquisition of fuzzy rules with linguistic hedges.",
            "Neurofuzzy controller design using neurofuzzy identifier.",
            "A neurofuzzy approach to variational problems by using Gaussian membership functions.",
            "Adaptive tree-structured self-generating radial basis function network and its performance evaluation.",
            "Learning by fuzzified neural networks.",
            "Fuzzy aggregation of modular neural networks with ordered weighted averaging operators."
        ]
    },
    {
        "name": "IJAR",
        "year": "1994",
        "info": "1994: Volumes\n10, 11",
        "count": 28,
        "papers": [
            "Preface: International Conference on fuzzy logic and Neural Networks (IIZUKA '92).",
            "Interpolation of fuzzy if-then rules by neural networks.",
            "A new neuro-fuzzy identification model of nonlinear dynamic systems.",
            "An adaptive fuzzy current controller with neural network for a field-oriented controller induction machine.",
            "Approximations between fuzzy expert systems and neural networks.",
            "Approximate case-based reasoning on neural networks.",
            "An emotion-processing system based on fuzzy inference and its subjective observations.",
            "Hierarchies of intensity preference aggregations.",
            "Further contributions to the study of the average value for ranking fuzzy numbers.",
            "On conditional belief functions.",
            "Modal logics for qualitative possibility theory.",
            "Conditional independence in valuation-based systems.",
            "Inducing implication relations.",
            "Potential influence diagrams.",
            "Identifying key missing data for inference under uncertainty.",
            "Relating and extending semantical approaches to possibilistic reasoning.",
            "An alternative method for inducing a membership function of a category.",
            "On measuring the specificity of IF-THEN rules.",
            "Efficient inference in Bayes networks as a combinatorial optimization problem.",
            "A computational theory of decision networks.",
            "A frequency model in a fuzzy environment.",
            "On the RAGE aggregation method with applications to neural networks and decision making.",
            "An algorithm directly finding the K most probable configurations in Bayesian networks.",
            "Patterns of fuzzy rule-based inference.",
            "Fuzzy refutations for probability and multivalued logics.",
            "From inheritance relation to nonaxiomatic logic.",
            "A neural system for deforestation monitoring on Landsat images of the Amazon Region.",
            "Bounded rationality and search over small-world models."
        ]
    },
    {
        "name": "IJAR",
        "year": "1993",
        "info": "1993: Volumes\n8, 9",
        "count": 28,
        "papers": [
            "Uncertainty measures for evidential reasoning II: A new measure of total uncertainty.",
            "A recurrence local computation approach towards ordering composite beliefs in bayesian belief networks.",
            "Heuristic reasoning and relative incompleteness.",
            "On dynamics of cautious belief and conditional objects.",
            "A key to fuzzy-logic inference.",
            "Evidence theory of exponential possibility distributions.",
            "The object recognition problem when features fail to be homogeneous.",
            "Integrating case- and rule-based reasoning.",
            "REL - a logic for relative evidential support.",
            "Relation-based evidential reasoning.",
            "An axiomatic framework for propagating uncertainty in directed acyclic networks.",
            "The role of relevance in explanation I: Irrelevance as statistical independence.",
            "A characterization of rational amalgamation operations.",
            "Belief functions: The disjunctive rule of combination and the generalized Bayesian theorem.",
            "Dempster's rule for evidence ordered in a complete directed acyclic graph.",
            "An algebraic approximation to the classification with fuzzy attributes.",
            "The approximation of implicates and explanations.",
            "Generalized fuzzy method-of-cases.",
            "A fuzzy inference model based on an uncertainty forward propagation approach.",
            "Foreword: Special issue on fuzzy expert systems.",
            "Rule base reorganization and search with a fuzzy cluster analysis.",
            "Approximate reasoning by linear rule interpolation and general approximation.",
            "A neuro-fuzzy approach to data analysis of pairwise comparisons.",
            "On reduction of transitive fuzzy matrices and its applications.",
            "Consistency checking for fuzzy expert systems.",
            "The context model: An integrating view of vagueness and uncertainty.",
            "An approximate reasoning system: Design and implementation.",
            "Proof methods for reasoning about possibility and necessity."
        ]
    },
    {
        "name": "IJAR",
        "year": "1992",
        "info": "1992: Volumes\n6, 7",
        "count": 32,
        "papers": [
            "Computing generalized belief functions for continuous fuzzy sets.",
            "A study on approximate reasoning mechanisms via fuzzy relation equations.",
            "A new algorithm for fuzzy multicriteria decision making.",
            "Statistical consistency with Dempster's rule on diagnostic trees having uncertain performance parameters.",
            "On the relationship between neural networks, pattern recognition and intelligence.",
            "Neural networks and dynamical systems.",
            "A space-time neural network.",
            "Fuzzy logic in autonomous orbital operations.",
            "Neurocontrol and fuzzy logic: Connections and designs.",
            "Implementation of conjunctive and disjunctive fuzzy logic rules with neural networks.",
            "Construction of fuzzy inference rules by NDF and NDFL.",
            "A reinforcement learning--based architecture for fuzzy logic control.",
            "Evidence, knowledge, and belief functions.",
            "Resolving misunderstandings about belief functions.",
            "How much do you believe?",
            "Comments on shafer's \"perspectives on the theory and practice of belief functions\".",
            "The combination of belief: When and how fast?",
            "The validity of Dempster-Shafer belief functions.",
            "Understanding evidential reasoning.",
            "Rejoinder to comments on \"reasoning with belief functions: An analysis of compatibility\".",
            "Rejoinders to comments on \"perspectives on the theory and practice of belief functions\".",
            "Usuality, regularity, and fuzzy set logic.",
            "A computational normative theory of scientific evidence.",
            "Some remarks on approximate entailment.",
            "A method for updating that justifies minimum cross entropy.",
            "The consistency of Dempster-Shafer updating.",
            "On considerations of credibility of evidence.",
            "Algorithms for combining belief functions.",
            "Interval probability propagation.",
            "On the complexity of belief network synthesis and refinement.",
            "Parameter estimation for process control with neural networks.",
            "Uncertainty measures for evidential reasoning I: A review."
        ]
    },
    {
        "name": "IJAR",
        "year": "1991",
        "info": "1991: Volume\n5",
        "count": 25,
        "papers": [
            "A statistical representation of imprecision in expert judgments.",
            "Probabilities and reasoning about possibilities.",
            "On the semantics of fuzzy logic.",
            "Spatial uncertainty management for a mobile robot.",
            "Some results on the computational complexity of refining confidence factors.",
            "On Spohn's rule for revision of beliefs.",
            "The international workshop on fuzzy system applications.",
            "NN-driven fuzzy reasoning.",
            "A study on subjective evaluations of printed color images.",
            "An expert system prototype for inventory capacity planning: An approximate reasoning approach.",
            "Fuzzy logic in development of fundamentals of pattern recognition.",
            "Fuzzy reliability assessment considering the influence of many factors on reliability.",
            "Fuzzy modeling of complex systems.",
            "Fuzzy acceptors for syntactic pattern recognition.",
            "Approximate spatial reasoning: Integrating qualitative and quantitative constraints.",
            "A practical application of fuzzy control for an air-conditioning system.",
            "Instruction and cognition analysis applying fuzzy graphs.",
            "Approximate reasoning by analogy to answer null queries.",
            "A simplified technique for using necessity-possibility measures.",
            "Mechanical proof systems for logic: Reaching consensus by groups of intelligent agents.",
            "Propagating belief functions through constraint system.",
            "A system for reasoning with imprecise linguistic information.",
            "Graphoids and natural conditional functions.",
            "Fuzzy control of pH using NAL.",
            "A combination of exact algorithms for inference on Bayesian belief networks."
        ]
    },
    {
        "name": "IJAR",
        "year": "1990",
        "info": "1990: Volume\n4",
        "count": 18,
        "papers": [
            "Resolution principles in possibilistic logic.",
            "The logical view of conditioning and its application to possibility and evidence theories.",
            "Fuzzy reasoning in a multidimensional space of hypotheses.",
            "Ranking dimensionless groups in fluidized-bed reactor scale-up.",
            "Probabilistic arithmetic. I. Numerical methods for calculating convolutions and dependency bounds.",
            "Comparing fuzzy numbers: The proportion of the optimum method.",
            "A note on the inevitability of maximum entropy.",
            "An interpretation of Shenoy and Shafer's axioms for local computation.",
            "Incremental construction and evaluation of defeasible probabilistic models.",
            "Adapting connectionist learning to Bayes networks.",
            "Probabilistic inference in multiply connected belief networks using loop cutsets.",
            "Influence of the fuzzy implication operator on the method-of-cases inference rule.",
            "Belief functions and belief maintenance in artificial intelligence.",
            "Perspectives on the theory and practice of belief functions.",
            "Reasoning with belief functions: An analysis of compatibility.",
            "Decision analysis using belief functions.",
            "Consonant approximations of belief functions.",
            "A logic-based analysis of Dempster-Shafer theory."
        ]
    },
    {
        "name": "IJAR",
        "year": "1989",
        "info": "1989: Volume\n3",
        "count": 19,
        "papers": [
            "On the applicability of maximum entropy to inexact reasoning.",
            "Epistemic necessity, possibility, and truth. Tools for dealing with imprecision and uncertainty in fuzzy knowledge-based systems.",
            "Uncertainty management in a pyramid vision system.",
            "Causality and maximum entropy updating.",
            "Four methods of approximate reasoning with interval-valued fuzzy sets.",
            "Jeffrey-like rules of conditioning for the Dempster-Shafer theory of evidence.",
            "Approximate reasoning and prototypical knowledge.",
            "Fundamentals of Fuzzy Prolog.",
            "Semantics and computation of the generalized modus ponens: The long paper.",
            "Pluralistic evaluation of belief plausibility and its application to nonmonotonic reasoning.",
            "A conceptual model for inexact reasoning in rule-based systems.",
            "An aspect of discrepancy in the implementation of modus ponens in the presence of fuzzy quantities.",
            "On nearness measures in fuzzy relational data models.",
            "Explaining evidential analyses.",
            "Presumption and prejudice in logical inference.",
            "A valuation-based language for expert systems.",
            "Some extensions of constraint propagation of label sets.",
            "Fusion of probabilistic evidence.",
            "Knowledge representation in medicine and clinical behavioural science : L. J. Kohout and W. Bandler, Eds., Abacus Press, Tunbridge Wells, Kent, 1988, $24.50 ."
        ]
    },
    {
        "name": "IJAR",
        "year": "1988",
        "info": "1988: Volume\n2",
        "count": 109,
        "papers": [
            "The provision of induction in data model systems: II. Symmetric comparison.",
            "Mixed-initiative, goal-directed dialog in a fuzzy knowledge based consultant system.",
            "A hybrid approach to reasoning under uncertainty.",
            "Linguistic assessment of welded structures with fatigue damage.",
            "On the combination of uncertain or imprecise pieces of information in rule-based systems-A discussion in the framework of possibility theory.",
            "Logics for artificial intelligence: Raymond Turner, Ellis Horwood Ltd., West Sussex, England, First Printing 1984, Second Printing 1985.",
            "Guest editors' preface.",
            "A fuzzy set-theoretic approach to decision making.",
            "Integrating expert systems using fuzzy numbers.",
            "Fuzzy regression for electrical resistivity-hydraulic conductivity relationships.",
            "Approximate fuzzy C-means (AFCM) cluster analysis of medical Magnetic Resonance Image (MRI) data.",
            "A fuzzy logic programming environment for real-time control.",
            "Reliability of existing framed structures using fuzzy sets.",
            "The problem of linguistic approximation in clinical decision making.",
            "On fuzzy probabilities and interactive fuzzy variables.",
            "On incomplete conjunctive information.",
            "Fuzzy medical diagnosis decision making revisited.",
            "An approach to the automated acquisition of production rules.",
            "A utility-valued logic for decision making.",
            "An improved method of performing fuzzy arithmetic for computer vision.",
            "On the choice of ply operators for modus ponens generation in fuzzy intelligent systems.",
            "Field testing the STRATASSIST prototype.",
            "Risk assessment for gas pipelines using fuzzy sets.",
            "Inference engines for fuzzy rule-based control.",
            "Development and implementation of a fuzzy system for bid tender evaluation on microcomputers.",
            "Network flow models with fuzzy auxiliary edge and vertex attributes.",
            "On properties of the V uncertainty.",
            "An unusual property of a square matrix of fuzzy sets.",
            "Incorporating confidence measures into fuzzy classifier.",
            "Multiple spectral image segmentation using fuzzy techniques.",
            "A comparison of fuzzy set theory and rough set theory in the context of automatic object classification.",
            "Fuzzy sets approach to the design of engineering systems.",
            "Fuzzy decisions in building investments.",
            "Set-valued temporal knowledge representation for fuzzy temporal retrieval in ICAI.",
            "Decision making and fuzzy windows.",
            "Backward chaining with fuzzy goals and rules.",
            "A new concept of fuzzy rule-based expert systems.",
            "On fuzzy graph searching.",
            "Fuzzy process modeling.",
            "Extending features of the fuzzy integral.",
            "Matching attributed fuzzy graphs and applications in scene analysis.",
            "Fuzzy multicriteria programming in economic systems analysis.",
            "Application of possibility theory to learning in knowledge-based systems with an imperfect teacher.",
            "Combining stochastic uncertainty and linguistic inexactness: Theory and experimental evaluation.",
            "A utility-valued logic for decision making.",
            "The problem of linguistic approximation in clinical decision making.",
            "A fuzzy logic programming environment for real-time control.",
            "Inference engines for fuzzy rule-based control.",
            "Guest editor's preface.",
            "Higher order probabilities and intervals.",
            "On probability intervals.",
            "Choosing uncertainty representations in artificial intelligence.",
            "Uniform accountability for multiple modes of reasoning.",
            "Decision theory in expert systems and artificial intelligenc.",
            "The centrality of autonomous agents in theories of action under uncertainty.",
            "An interesting uncertainty-based combinatoric problem in spare parts forecasting: The FRED system.",
            "Bayesian inference in model-based machine vision.",
            "Using the Dempster-shafer scheme in a diagnostic expert system shell.",
            "Is shafer general bayes?",
            "Using T-norm-based uncertainty calculi in a naval situation assessment application.",
            "Implementing a bayesian scheme for revising belief commitments.",
            "Integrating logical and probabilistic reasoning for decision making.",
            "Decision tree induction systems: A Bayesian analysis.",
            "The automatic training of rule bases that use numerical uncertainty representations.",
            "A study of associative evidential reasoning.",
            "Stochastic simulation of Bayesian belief networks.",
            "Compiling fuzzy logic control rules to hardware implementations.",
            "Modifiable combining functions.",
            "Steps toward programs that manage uncertainty.",
            "An algorithm for computing probabilistic propositions.",
            "Combining symbolic and numeric approaches to uncertainty management.",
            "The inductive logic of information systems.",
            "Explanation of probabilistic inference for decision support systems.",
            "Automated generation of connectionist expert systems for problems involving noise and redundancy.",
            "A measure-free approach to conditioning.",
            "Convergent deduction for probabilistic logic.",
            "Estimation procedures for robust sensor control.",
            "Temporal reasoning about uncertain worlds.",
            "A perspective on confidence and its use in focusing attention during knowledge acquisition.",
            "Practical issues in constructing a Bayes belief network.",
            "NAIVE: A method for representing uncertainty and temporal relationships in an automated reasoner.",
            "Reasoning about beliefs and actions under computational resource constraints.",
            "Dempster-shafer versus probabilistic logic.",
            "Higher order probabilities.",
            "Objective probability.",
            "Belief in belief functions: An examination of Shafer's canonical examples.",
            "Comparisons of reasoning mechanisms for computer vision.",
            "Nilson's probabilistic entailment extended to Dempster-Shafer theory.",
            "A knowledge engineer's comparison of three evidence aggregation methods.",
            "Towards solving the multiple extension problem: Combining defaults and probabilities.",
            "Do we need higher-order probabilities, and, if so, what do they mean?",
            "The recovery of causal poly-trees from statistical data.",
            "Bayesian prediction for artificial intelligence.",
            "A heuristic Bayesian approach to knowledge acquisition: Application to analysis of tissue-type plasminogen activator.",
            "Efficient inference on generalized fault diagrams.",
            "Advantages and a limitation of using LEG nets in a real-time problem.",
            "Theory-based inductive learning: An integration of symbolic and quantitative methods.",
            "Problem structure and evidential reasoning.",
            "Coefficients of relation for probabilistic reasoning.",
            "The role of calculi in uncertain reasoning.",
            "The role of tuning uncertain inference systems.",
            "Satisfaction of assumptions is a weak predictor of performance.",
            "Structuring causal tree models with continuous variables.",
            "Implementing evidential reasoning in expert systems.",
            "Can evidence Be combined in the Dempster-shafer theory?",
            "Evidential reasoning in image understanding.",
            "Logical aspects of learning concepts.",
            "Attributes and rough properties in information systems.",
            "Hidden patterns in combined and adaptive knowledge networks."
        ]
    },
    {
        "name": "IJAR",
        "year": "1987",
        "info": "1987: Volume\n1",
        "count": 21,
        "papers": [
            "A message from the editor.",
            "The provision of induction in data model systems: I. Analogy.",
            "On the knowledge structure of multi-solution variables, including quantified statements.",
            "Summarizing and propagating uncertain information with triangular norms.",
            "Management of uncertainty in medicine.",
            "The Paninian approach to natural language processing.",
            "A reduction methodology for a differential diagnosis expert system.",
            "Review: Introduction to fuzzy arithmetic: Theory and applications : Arnold Kaufmann and Madan M. Gupta, Van Nostrand Reinhold, New York, 1985.",
            "Response: Introduction to fuzzy arithmetic: Theory and applications : Arnold Kaufmann and Madan M. Gupta, Van Nostrand Reinhold, New York, 1985.",
            "Architecture of an expert system for composite document analysis, representation, and retrieval .",
            "Extended fuzzy relations: Application to fuzzy expert systems.",
            "Fuzzy logic approach in metals fatigue.",
            "Measures of similarity among fuzzy concepts: A comparative analysis.",
            "Heuristic reasoning about uncertainty: An artificial intelligence approach : Paul R. Cohen, Pitman, Boston and London, 1985.",
            "Heuristic reasoning about uncertainty: An artificial intelligence approach : Paul R. Cohen, Pitman, Boston and London, 1985.",
            "A fuzzy approach to aggregating military assessments.",
            "Properties of fuzzy implication operators.",
            "Membership functions I: Comparing methods of measurement.",
            "Membership functions II: Trends in fuzziness and implications.",
            "Implication in fuzzy logic.",
            "Propagating belief functions in qualitative Markov trees."
        ]
    }
]