[
    {
        "name": "IJCIA",
        "year": "2021",
        "info": "Volume 20, 2021",
        "count": 12,
        "papers": [
            "One-Class Fault Detection Using Multi-Layer Elm-Based Auto-Encoder.",
            "Gradient Descent Optimization Algorithms for Decoding SCMA Signals.",
            "Supervised Retinal Vessel Segmentation Based Average Filter and Iterative Self Organizing Data Analysis Technique.",
            "A Computer Vision-Based Method for Classification of Red Meat Quality After Nitrosamine Appendage.",
            "Performance Analysis Using a Deep Belief Network by a Self-Organizing Map.",
            "Hybrid Fuzzy-Genetic Model for Fitness-Based Performance Optimization in Wireless Networks.",
            "Decision Support System Based on Fuzzy Logic for Assessment of Expected Corporate Income Performance.",
            "Stretch Sensor-Based Facial Expression Recognition and Classification Using Machine Learning.",
            "A Novel Adaptive Sampling Strategy for Deep Reinforcement Learning.",
            "GA2RM: A GA-Based Action Rule Mining Method.",
            "Regularized Semi-Supervised Metric Learning with Latent Structure Preserved.",
            "A Multi-Swarm ABC Algorithm for Parameters Optimization of SOFM Neural Network in Dynamic Environment."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2020",
        "info": "Volume 19, 2020",
        "count": 32,
        "papers": [
            "Predicting Maintenance and Rehabilitation Cost for Buildings Based on Artificial Neural Network and Fuzzy Logic.",
            "Variational Autoencoder-Based Dimensionality Reduction for High-Dimensional Small-Sample Data Classification.",
            "Modified Selfish Herd Optimizer for Function Optimization.",
            "Determining Subcategories of Facial Expressions for Improved Performance in Practical Applications.",
            "Optimizing Design of Fuzzy Model for Software Cost Estimation Using Particle Swarm Optimization Algorithm.",
            "Feature Selection in GPCR Classification Using BAT Algorithm.",
            "A Robust Deep Neural Network Based Breast Cancer Detection and Classification.",
            "A Memetic Artificial Bee Colony Algorithm for High Dimensional Problems.",
            "Optimizing Nonlinear Parameters of Sugeno Type Fuzzy Rules using GWO for Data Classification.",
            "Calendar of Events.",
            "A Novel Nature-Inspired Technique Based on Mushroom Reproduction for Constraint Solving and Optimization.",
            "Spatial Relational Attention Using Fully Convolutional Networks for Image Caption Generation.",
            "A Hybrid Machine Learning Approach for Flood Risk Assessment and Classification.",
            "Deep Network based on Long Short-Term Memory for Time Series Prediction of Microclimate Data inside the Greenhouse.",
            "Application of a Chaotic Quantum Bee Colony and Support Vector Regression to Multipeak Maximum Power Point Tracking Control Method Under Partial Shading Conditions.",
            "A Multilevel Image Thresholding Approach Based on Crow Search Algorithm and Otsu Method.",
            "Application of Deep Learning Technique in an Intrusion Detection System.",
            "Enhanced Forecasting Accuracy of Fuzzy Time Series Model Based on Combined Fuzzy C-Mean Clustering with Particle Swam Optimization.",
            "A Fuzzy Logic-Based Method to Avert Intrusions in Wireless Sensor Networks Using WSN-DS Dataset.",
            "A Novel Energy-Efficient Clustering Protocol Using Two-Stage Genetic Algorithm for Improving the Lifetime of Wireless Sensor Networks.",
            "Optimistic Variants of Single-Objective Bilevel Optimization for Evolutionary Algorithms.",
            "Improved Flower Pollination Algorithm for Optimal Groundwater Management.",
            "Mine Pressure Prediction Study Based on Fuzzy Cognitive Maps.",
            "Arrhythmias Prediction Using an Hybrid Model Based on Convolutional Neural Network and Nonlinear Regression.",
            "Prediction of Highly Volatile Cryptocurrency Prices Using Social Media.",
            "Arbitrary Back-Projection Networks for Image Super-Resolution.",
            "A Novel Method to Identify Golgi Protein Types Based on Hybrid Feature and SVM Algorithm.",
            "Prediction of Mechanical Properties of Seamless Steel Tubes Using Artificial Neural Networks.",
            "Identification of Circulating Fluidized Bed Boiler Bed Temperature Based on Hyper-Plane-Shaped Fuzzy C-Regression Model.",
            "A Self-Adaptive Weighted Fuzzy c-Means for Mixed-Type Data.",
            "An Enhanced Sentiment Analysis Framework Based on Pre-Trained Word Embedding.",
            "A Particle Fuzzy Decisive Framework for Moving Target Detection in the Multichannel SAR Framework."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2019",
        "info": "Volume 18, 2019",
        "count": 27,
        "papers": [
            "An Efficient Hybrid Self-Learning Intrusion Detection System Based on Neural Networks.",
            "The Modeling of Interval-Valued Time Series: A Method Based on Fuzzy Set Theory and Artificial Neural Networks.",
            "Customer Churn Prediction with Feature Embedded Convolutional Neural Network: An Empirical Study in the Internet Funds Industry.",
            "A Self-Adaptive Step Glowworm Swarm Optimization Approach.",
            "Improving the Cognitive Agent Intelligence by Deep Knowledge Classification.",
            "MLP Modeling and Prediction of IP Subnet Packets Forwarding Performance.",
            "An Improved Quick Artificial Bee Colony Algorithm for Portfolio Selection.",
            "A Self-Adaptive FCM for the Optimal Fuzzy Weighting Exponent.",
            "Top-Down Saliency Detection Based on Deep-Learned Features.",
            "A Semi-Supervised Learning Approach for Tackling Twitter Spam Drift.",
            "Fractional Krill-Lion Algorithm Based Actor Critic Neural Network for Face Recognition in Real Time Surveillance Videos.",
            "Backstepping Sliding Mode Controller Improved with Interval Type-2 Fuzzy Logic Applied to the Dual Star Induction Motor.",
            "Self-Adaptive Firefly Algorithm with Pole Zero Cancellation Method for Controlling SMIB Power System.",
            "Neural Network-Based Diagnostic Tool for Identifying the Factors Responsible for Depression.",
            "Water Body Semantic Information Description and Recognition Based on Multimodal Models.",
            "Frequency Graphs for Travelling Salesman Problem Based on Ant Colony Optimization.",
            "Sentiment Analysis on Microblogging with K-Means Clustering and Artificial Bee Colony.",
            "Automated Detection of Brain Stroke in MRI with Hybrid Fuzzy C-Means Clustering and Random Forest Classifier.",
            "Application of the Shuffled Frog Leaping Algorithm (SFLA) in Constructing Fuzzy Classification Systems.",
            "A New Hybrid Feature Subset Selection Framework Based on Binary Genetic Algorithm and Information Theory.",
            "A Joint Approach to Detect Malicious URL Based on Attention Mechanism.",
            "Touch-Based Active Cloud Authentication Using Traditional Machine Learning and LSTM on a Distributed Tensorflow Framework.",
            "Efficient Computation Offloading in Mobile Cloud Computing with Nature-Inspired Algorithms.",
            "Regressive Whale Optimization for Workflow Scheduling in Cloud Computing.",
            "An Empirical Evaluation of User Movement Data on Smartphones.",
            "WOADF: Whale Optimization Integrated Adaptive Dragonfly Algorithm Enabled with the TDD Properties for Model Transformation.",
            "Pruning High-Similarity Clusters to Optimize Data Diversity when Building Ensemble Classifiers."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2018",
        "info": "Volume 17, 2018",
        "count": 22,
        "papers": [
            "A Novel Approach of Weighted Support Vector Machine with Applied Chance Theory for Forecasting Air Pollution Phenomenon in Egypt.",
            "Focus Group: An Optimization Algorithm Inspired by Human Behavior.",
            "FSLLE: A Fast K Selection Algorithm for Locally Linear Embedding.",
            "Fusion of Color Images Based on Fuzzy Transform and Spatial Frequency.",
            "Interval-Valued Dual Hesitant Fuzzy Heronian Mean Aggregation Operators and their Application to Multi-Attribute Decision Making.",
            "Deep Learning Technique-Based Steering of Autonomous Car.",
            "Intelligent Intrusion Detection System Through Combined and Optimized Machine Learning.",
            "Speeding up the Hyperparameter Optimization of Deep Convolutional Neural Networks.",
            "Handling Forecasting Problems Based on Combining High-Order Time-Variant Fuzzy Relationship Groups and Particle Swam Optimization Technique.",
            "A Strength Pareto Evolutionary Algorithm for Optimizing System-On-Chip Test Schedules.",
            "Similarity Learning Based on Sparse Representation for Semi-Supervised Boosting.",
            "Prediction of Anti-Malarial Activity Based on Deep Belief Network.",
            "Solving Classification Problems Using Projection-Based Learning Algorithm with Fuzzy Radial Basis Function Neural Network.",
            "A New Method for Emulating Self-Organizing Maps for Visualization of Datasets.",
            "An Iterative Hard Thresholding Algorithm based on Sparse Randomized Kaczmarz Method for Compressed Sensing.",
            "A Hybrid Grey Wolf Optimization for Job Shop Scheduling Problem.",
            "Acoustic Emission-Based Tool Condition Classification in a Precision High-Speed Machining of Titanium Alloy: A Machine Learning Approach.",
            "Supervised Convolutional Matrix Factorization for Document Recommendation.",
            "A New High-Order Approach for Forecasting Fuzzy Time Series Data.",
            "A Slow-Wave Structure Optimization with Variable Helix Section Length in STWT Based on CI-NMCSO Algorithm.",
            "Wild Animal Detection from Highly Cluttered Images Using Deep Convolutional Neural Network.",
            "Multidirectional Grey Wolf Optimizer Algorithm for Solving Global Optimization Problems."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2017",
        "info": "Volume 16, 2017",
        "count": 27,
        "papers": [
            "Convolutional Neural Networks for Water Body Extraction from Landsat Imagery.",
            "Classification of Cytochrome P450 1A2 Inhibitors and Noninhibitors Based on Deep Belief Network.",
            "Particle Swarm Optimization with Intelligent Mutation for Nonlinear Mixed-Integer Reliability-Redundancy Allocation.",
            "Recursive Feature Elimination with Ensemble Learning Using SOM Variants.",
            "A Population Size Reduction Approach for Nondominated Sorting-Based Optimization Algorithms.",
            "On Benchmark Problems and Metrics for Decision Space Performance Analysis in Multi-Objective Optimization.",
            "The Effectiveness of Reward and Punishment in Spatial Social Games.",
            "Swarm Optimized Grey SVR and ARIMA for Modeling of Larceny-Theft Rate with Economic Indicators.",
            "Smart Fire Detection System with Early Notifications Using Machine Learning.",
            "Analysis of Effect of Machining Parameters During Electrical Discharge Machining Using Taguchi-Based Multi-Objective PSO.",
            "Availability Improvement Method for Repairable Systems Using Modified Ant Colony Optimisation.",
            "Hybrid Grey Wolf Optimizer Using Elite Opposition-Based Learning Strategy and Simplex Method.",
            "A Weighted Genetic Approach for Feature Selection in Sentiment Analysis.",
            "An Improved Pigeon-Inspired Optimization for Clustering Analysis Problems.",
            "Shipboard Power System Stabilizer Optimization Using GA and QPSO Algorithm.",
            "Anaphoricity Determination of Anaphora Resolution in Uygur Pronoun Based on CNN-LSTM Model.",
            "A New Fuzzy Firefly Algorithm with Adaptive Parameters.",
            "A Novel Variable Population Size Artificial Bee Colony Algorithm with Convergence Analysis for Optimal Parameter Tuning.",
            "Neural Skyline Filtering for Imbalance Features Classification.",
            "Computational Intelligence Approaches for Energy Optimization in Wireless Sensor Networks.",
            "An Intelligent Computer Assistance System for Artifact Restoration Based on Genetic Algorithms with Plane Image Features.",
            "A Self-Adaptive Hybrid Optimization Algorithm for Solving Consecutive Reaction Problem.",
            "Fuzzy Logic-Based Quality of Service Evaluation for Multimedia Transmission over Wireless Ad Hoc Networks.",
            "An Efficient Classification Algorithm Based on T-Cells Maturation with No Parameters.",
            "Immigrants Based Adaptive Genetic Algorithms for Task Allocation in Multi-Robot Systems.",
            "Wind Power Prediction Using Cluster Based Ensemble Regression.",
            "A Crossover Improved Genetic Algorithm and Its Application in Non-Uniform Linear Antenna Arrays."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2016",
        "info": "Volume 15, 2016",
        "count": 24,
        "papers": [
            "A PSO-Based Approach with Fuzzy Obstacle Avoidance for Cooperative Multi-Robots in Unknown Environments.",
            "Diversifying Search Moves in a Shuffled Differential Evolution Algorithm.",
            "Combining Sentiment Analysis with Socialization Bias in Social Networks for Stock Market Trend Prediction.",
            "Persian Handwritten Number Recognition Using Adapted Framing Feature and Support Vector Machines.",
            "Noise Robust Speech Recognition Using Deep Belief Networks.",
            "Drug Delivery Based on Swarm Microrobots.",
            "Architecture Optimization Model for the Probabilistic Self-Organizing Maps and Speech Compression.",
            "Differential Evolution-Based Synthesis of Dynamic Quantizers with Fixed-Structures.",
            "Implementation of Fuzzy Time Series in Forecasting of the Non-Stationary Data.",
            "A Novel Approach for Optimization in Dynamic Environments Based on Modified Artificial Fish Swarm Algorithm.",
            "A New Stochastic Optimization Approach - Dolphin Swarm Optimization Algorithm.",
            "Efficient Energy Management System Based on GA and Classical Boolean Approach.",
            "BP Neural Network with Genetic Algorithm Optimization for Prediction of Geo-Stress State from Wellbore Pressures.",
            "Integration of Cat Swarm Optimization and Borda Ranking Method for Solving Dynamic Multi-Objective Problems.",
            "Hybrid Optimization Algorithm to Combine Neural Network for Rainfall-Runoff Modeling.",
            "Modified Chaotic Bat Algorithm Based Counter Propagation Neural Network for Uncertain Nonlinear Discrete Time System.",
            "A New Parallel GA-Based Method for Constraint Satisfaction Problems.",
            "Design of FIR Digital Filter with Two Dimensions Using Particle Swarm Optimization.",
            "Hybrid Hierarchical Clustering - Piecewise Aggregate Approximation, with Applications.",
            "Multi-Objective Cuckoo Search Under Multiple Archiving Strategies.",
            "A Novel Method for Classification of ECG Arrhythmias Using Deep Belief Networks.",
            "Newton's Law of Universal Gravitation Based Genetic Algorithm for Graph Distribution.",
            "A Multi-Phase Hybrid Metaheuristics Approach for the Exam Timetabling.",
            "Fuzzy Time Series Customers Prediction: Case Study of an E-Commerce Cash Flow Service Provider."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2015",
        "info": "Volume 14, 2015",
        "count": 25,
        "papers": [
            "Collaborative Fuzzy Clustering of Variational Bayesian Generative Topographic Mapping.",
            "Collaborative Parallel Hybrid Metaheuristics on Graphics Processing Unit.",
            "A Genetic Algorithm with the Mixed Heuristics for Traveling Salesman Problem.",
            "Advanced Intelligence Tuning Using Hybrid of Clonal Selection and Genetic Algorithm, GM and PM.",
            "SVM-Based Segmentation-Verification of Handwritten Connected Digits Using the Oriented Sliding Window.",
            "A Novel Algorithm for Detection and Classification of Brain Tumors.",
            "Probabilistic Self-Organizing Map for Clustering and Visualizing non-i.i.d Data.",
            "A Comprehensive Comparison on Evolutionary Feature Selection Approaches to Classification.",
            "FPGA Implementation of Fuzzy Inference System Based Edge Detection Algorithm.",
            "Fraud Detection Life Cycle Model: A Systematic Fuzzy Approach to Fraud Management.",
            "Optimal Generator Maintenance Scheduling Using a Hybrid Metaheuristic Approach.",
            "Extractive Summarization Technique Based on Fuzzy Membership Calculation Using Rough Sets.",
            "Coagulant Dosage Determination in a Water Treatment Plant Using Dynamic Neural Network Models.",
            "Convolutional Neural Networks with Fused Layers Applied to Face Recognition.",
            "Semantic Similarity-Based Clustering of Web Documents Using Fuzzy C-Means.",
            "Neuro-Fuzzy-Based Auto-Tuning Proportional Integral Controller for Induction Motor Drive.",
            "General Relativity Search Algorithm: A Global Optimization Approach.",
            "An Experimental Analysis of a New Interval-Based Mutation Operator.",
            "A Novel Interactively Recurrent Self-Evolving Fuzzy CMAC and Its Classification Applications.",
            "A Scalable Meta-Classifier Combining Search and Classification Techniques for Multi-Level Text Categorization.",
            "Using Sample Selection to Improve Accuracy and Simplicity of Rules Extracted from Neural Networks for Credit Scoring Applications.",
            "A Cluster-Based Data Balancing Ensemble Classifier for Response Modeling in Bank Direct Marketing.",
            "Hebbian Network of Self-Organizing Receptive Field Neurons as Associative Incremental Learner.",
            "A Soft Sensor Based on the Integration of Tikhonov Extreme Learning Machine and Accelerated Kernels for Real-Time Estimation of Automotive Catalyst Temperatures.",
            "Survey of Uses of Evolutionary Computation Algorithms and Swarm Intelligence for Network Intrusion Detection."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2014",
        "info": "Volume 13, 2014",
        "count": 25,
        "papers": [
            "A Hybrid Optimization Method Based on differential Evolution and Harmony Search.",
            "An Adapted Cuckoo Optimization Algorithm and Genetic Algorithm Approach to the University Course Timetabling Problem.",
            "Image thresholding using Fuzzy Correlation criterion and Harmony Search Algorithm.",
            "Adaptive Zoning Design by Supervised Learning using Multi-objective Optimization.",
            "Training Neural Networks to predict Student Academic Performance: a Comparison of Cuckoo Search and Gravitational Search Algorithms.",
            "Automatic Analysis of Corporate Sustainability Reports and Intelligent Scoring.",
            "Fuzzy Logic and Neural Network Based indoor Fingerprint Positioning Algorithms in WiFi.",
            "Parallel Hybrid Metaheuristic on Shared Memory System for Real-Time UAV Path Planning.",
            "Binary PSO and Rough Set Theory for Feature Selection: a Multi-objective filter Based Approach.",
            "Artificial Bee Colony Algorithm with Improved Explorations: a Novel Approach for numerical Optimization.",
            "Clustering Stock Data for Multi-objective portfolio Optimization.",
            "Svm against GMM/SVM for dialect Influence on Automatic speaker Recognition Task.",
            "Software Development Effort estimation using Classical and fuzzy Analogy: a Cross-Validation Comparative Study.",
            "An Effective Model for carbon dioxide emissions Prediction: Comparison of Artificial Neural Networks Learning Algorithms.",
            "A Dual-stage Sampling Based Artificial Neural Network response Surface Methodology and its Application to Tubular Permanent-Magnet Linear Synchronous Motor.",
            "Modeling of input-output Relationships for electron beam butt welding of dissimilar materials using Neural Networks.",
            "An Intelligent System by fuzzy reliability Algorithm in Fault Tree Analysis for nuclear Power plant Probabilistic Safety Assessment.",
            "Semantic Search Techniques for Learning Smaller Boolean Expression Trees in Genetic Programming.",
            "Optimized Neural Incremental Attribute Learning for Classification Based on Statistical discriminability.",
            "A New Distance for Interval Type-2 fuzzy Sets with an Application to Clustering.",
            "Application of Computational Intelligence Method in Petroleum geomechanics Characterization.",
            "Developing fuzzy Bayesian Game Model for Optimizing Negotiation Price.",
            "Pi-Sigma Neural Network for a One-Step-Ahead temperature Forecasting.",
            "Performance Evaluation of Parallel Genetic and Particle Swarm Optimization Algorithms within the Multicore Architecture.",
            "A Novel Approach for Solving the Dynamic Vehicle Routing Problem Based on Hierarchical Self-Organizing Maps."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2013",
        "info": "Volume 12, 2013",
        "count": 24,
        "papers": [
            "A Three-Step Combined Genetic Programming and Neural Networks Method of Forecasting the S&p/Case-Shiller Home Price Index.",
            "A Novel Optimization Algorithm Based on Atmosphere Clouds Model.",
            "Fuzzy bridged Refinement Domain Adaptation: Long-Term Bank Failure Prediction.",
            "Test Data Generation for Software Testing Based on Quantum-Inspired Genetic Algorithm.",
            "Improved Weight Fuzzy Time Series as used in the Exchange rates Forecasting of US Dollar to Ringgit Malaysia.",
            "Comparison of Parallel Particle Swarm Optimizers for Graphical Processing Units and Multicore Processors.",
            "A Hybrid Method of modified Cat Swarm Optimization and Gradient Descent Algorithm for Training ANFIS.",
            "Algae Growth Prediction through Identification of Influential Environmental Variables: a Machine Learning Approach.",
            "Black-Box Tool for nonlinear System Identification Based upon Fuzzy System.",
            "Group Outlier factor: a New Score using Self-Organising Map for Group-Outlier and Novelty Detection.",
            "Modified Fuzzy Neural Network for the Classification of murder Cases in Criminal Law using Gaussian Membership Function.",
            "Hybrid of Genetic Algorithm and Simulated Annealing for Support Vector Regression Optimization in Rainfall Forecasting.",
            "Using Particle Swarm Optimization to Evolve Cooperation in Multiple Choices Iterated Prisoner's Dilemma Game.",
            "The Linguistic Forecasting of Time Series using Improved Fuzzy Cognitive Map.",
            "Classification of Arrhythmia in Electrocardiogram using EMD Based Features and Support Vector Machine with Margin Sampling.",
            "Inter-quartile Range Approach to Length-Interval Adjustment of Enrollment Data in Fuzzy Time Series Forecasting.",
            "Efficient DNA Motif Discovery using modified Genetic Algorithm.",
            "Hierarchical Structure Based convolutional Neural Network for Face Recognition.",
            "Online Class Imbalance Learning and its Applications in Fault Detection.",
            "Learning under Concept Drift using a Neuro-Evolutionary Ensemble.",
            "Cluster Based Ensemble Classifier Generation by Joint Optimization of accuracy and Diversity.",
            "Svm and NN Based Offline Signature Verification.",
            "Relationship between Data Size, accuracy, Diversity and Clusters in Neural Network Ensembles.",
            "Neural Network Rule Extraction by a New Ensemble Concept and its Theoretical and Historical Background: a Review."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2012",
        "info": "Volume 11, 2012",
        "count": 26,
        "papers": [
            "Detection of Web Server Attacks Using Principles of Immunocomputing.",
            "An Artificial Immune System for Classifying Aerodynamic Instabilities of Centrifugal Compressors.",
            "Outlier Detection Using humoral-Mediated Clustering (HAIS).",
            "Humoral Artificial Immune System (HAIS) for Supervised Learning.",
            "A Fuzzy Inference System to Determine the Number of Clones in a Class of Artificial Immune Systems.",
            "Cpsclass: a Constructive Particle Swarm Classifier.",
            "Immune-Inspired Cooperative Mechanism with Refined Low-Level Behaviors for Multi-Robot Shepherding.",
            "Aisttp: an Artificial Immune Algorithm to Solve Traveling Tournament Problems.",
            "Evolutionary Tuning of Modular Fuzzy Controller for Two-wheeled Wheelchair.",
            "A Novel Violent Videos Classification Scheme Based on the Bag of Audio Words Features.",
            "A Genetic Programming-Based Learning Algorithms for Pruning Cost-Sensitive Classifiers.",
            "A Multi-Colony Ant System for Combinatorial Optimization Problem.",
            "Performance Evaluation of Three Pattern Classification Techniques Used for water Quality Monitoring.",
            "A Comparison of Mathematical and Artificial Neural Network Modeling for ROSA Petals Using Hot Air drying Method.",
            "Monotonous Tasks and alcohol Consumption Effects on the Brain by EEG Analysis using Neural Networks.",
            "A Comparison between Quantum Inspired bacterial Foraging Algorithm and GA-like Algorithm for Global Optimization.",
            "Collaborative Clustering using Prototype-Based Techniques.",
            "Svm-DSmT Combination for the Simultaneous Verification of Off-Line and on-Line Handwritten Signatures.",
            "Credit Scoring using Multi-Kernel Support Vector Machine and Chaos Particle Swarm Optimization.",
            "A New Multimodal Particle Swarm Optimization Algorithm Based on Greedy Algorithm.",
            "Yield Prediction Technique using Hybrid Adaptive Neural Genetic Network.",
            "An Area defuzzification Technique to Assess nuclear Event Reliability Data from Failure Possibilities.",
            "A New Genetic Algorithm for Multiple sequence Alignment.",
            "A Scalable Neural-Network Modular-Array Architecture for Real-Time Multi-parameter damage Detection in Plate Structures using Single Sensor output.",
            "Non-Invasive nocturnal hypoglycemia Detection for insulin-Dependent Diabetes mellitus using Genetic Fuzzy Logic Method.",
            "Protein superfamily Classification using Adaptive Evolutionary Radial Basis Function Network."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2011",
        "info": "Volume 10, 2011",
        "count": 23,
        "papers": [
            "Classification of High-Dimensional microarray Data with a Two-Step Procedure via a Wilcoxon Criterion and Multilayer Perceptron.",
            "Choquet Integral-OWA Based Adaptive Neural Fuzzy Inference System with Application.",
            "A Generalized Hybrid Generation Scheme of Differential Evolution for Global Numerical Optimization.",
            "Stabilized Nonlinear Discrete-Time Adaptive Controller Based on Fuzzy Rules Emulated Networks and Time Varying Learning Rate.",
            "Improved Web Page Identification Method Using Neural Networks.",
            "Cultural Multiobjective PSO with Sensitivity Analysis for Parameters Using Additive Binary epsilon Indicator.",
            "A Study on Genetic Algorithm Based Hybrid Softcomputing Model for Benignancy/Malignancy Detection of Masses Using Digital Mammogram.",
            "Visual Speech Recognition Using Optical Flow and Support Vector Machines.",
            "Modeling Method Using Combined Artificial Neural Network.",
            "A Seasonal Auto-Regressive Model Based Support Vector Regression Prediction Method for H5N1 avian Influenza Animal Events.",
            "Arithmetic Mean Based Compensatory Fuzzy Logic.",
            "A Neural Mechanism for Function Application in Visual Awareness Models.",
            "Support Vector Regression and Functional Networks for viscosity and Gas/Oil Ratio Curves Estimation.",
            "A Clustering-Based Niching Framework for the Approximation of Equivalent Pareto-Subsets.",
            "Fuzzy Measure Based Adaptive Methods for Illumination Invariant Face Recognition.",
            "Hybrid Fuzzy Logic-Based Particle Swarm Optimization for Flow shop Scheduling Problem.",
            "Virtual Instrumentation Based Systems for Real-Time Path Planning of Mobile Robots Using Bio-Inspired Neural Networks.",
            "Application of Genetic Algorithm-Support Vector Machine (GA-SVM) for Damage Identification of Bridge.",
            "Adaptive Neuro-Fuzzy Inference System Approach for Fault Detection and Diagnosis of Pneumatic Valve in Cement Industry.",
            "Joint Sub-Classifiers One Class Classification Model for avian Influenza Outbreak Detection.",
            "Solving Constrained Optimization Problems Using Probability Collectives and a Penalty Function Approach.",
            "Supervised Classification of White Blood Cells by Fusion of Color Texture Features and Neural Network.",
            "Multi-Cluster Support Vector Machine Classifier for the Classification of Suspicious Areas in Digital Mammograms."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2010",
        "info": "Volume 9, 2010",
        "count": 20,
        "papers": [
            "Combining Statistical and Geometric Features for Colonic Polyp Detection in Ctc Based on Multiple Kernel Learning.",
            "Hybrid Approach for Brain Tumor Segmentation in Magnetic Resonance Images Using Cellular Neural Networks and Optimization Techniques.",
            "The shaky Ladder Hyperplane-Defined Functions and Classic Dynamic Problems.",
            "Mixed Genetic Algorithm Approach for Fuzzy Classifier Design.",
            "Graphical Representation of Cause-Effect Relationships among Chemical Process Variables Using a Neural Network Approach.",
            "A Hybrid Support Vector Regression Approach for Rainfall Forecasting Using Particle Swarm Optimization and Projection Pursuit Technology.",
            "Gk Based Fuzzy Clustering for the Diagnosis of Cardiac Arrhythmia.",
            "A Genetic Algorithm for Improving Accuracy of Software Quality Predictive Models: a Search-Based Software Engineering Approach.",
            "Design of Experiments in Neuro-Fuzzy Systems.",
            "Knowledge-Based Methods for Optimum Approximation of Geometric dilution of Precision.",
            "Introducing Type-2 Fuzzy Sets for Image Texture Modeling.",
            "Fuzzy-Based Analysis of Microscopic Color Cervical Pap Smear Images: Nuclei Detection.",
            "Interactive Registration of Intracellular Volumes with Radial Basis Functions.",
            "Ignorance-Based Fuzzy Clustering Algorithm.",
            "Toward Analyzing the Impact of Advertisement Billboards on Soccer Telecast Viewers.",
            "Comparison of Support Vector Machines and Bayesian Neural Networks Performance for Breast Tissues Using geostatistical Functions in Mammographic Images.",
            "Dialog Act Classification Using Acoustic and Discourse Information of Maptask Data.",
            "Hybrid Computational Intelligence Models for Porosity and Permeability Prediction of Petroleum reservoirs.",
            "On Label Information Incorporated Metric Learning for Regressions.",
            "Relational Topological Map."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2009",
        "info": "Volume 8, 2009",
        "count": 29,
        "papers": [
            "Editorial - Hybrid Soft Computing and Applications.",
            "Fully Evolved Kernel Method Employing SVM Assessment for Feature Computation from Multisensor Signals.",
            "A Branch and Bound Algorithm for Finding the Modes in Kernel Density Estimates.",
            "Combining Genetic Programming and Model-Driven Development.",
            "Evaluation Functions for the Evolutionary Design of Multiclass Support Vector Machines.",
            "Artificial Intelligence Methods in Electrocardiogram and Electroencephalogram Data Clustering.",
            "Editorial: Applications of Computational Intelligence.",
            "Bi-Comforward: bivariate Complex Fourier-Wavelet Regularized deconvolution for Medical Imaging.",
            "Qrs Complex Detection Using Optimal Discrete Wavelet.",
            "Ga-Based Optimization of tapering Windows for Artifact Reduction in Fourier electron Magnetic Resonance Images.",
            "Multi-Objective GA-Optimized Interpolation Kernels for Reconstruction of High Resolution EMR Images from Low-sampled k-Space Data.",
            "Constrained Disjoint Paths in Geometric Networks.",
            "On the Use of Intelligent Agents to Guide Test Sequence Selection and Optimization.",
            "Software Reliability Prediction Using Intelligent Techniques: Application to Operational Risk Prediction in Firms.",
            "Prediction of emissions Using Combustion Parameters in a Diesel Engine through Fuzzy Logic Techniques.",
            "Stabilizing Networked Pneumatic Control Systems with Time Delays.",
            "Neural Network-Based Interpolation and Extrapolation of Wind Tunnel Test Data.",
            "Symbiotic Evolutionary Algorithm, a Remedy for Linkage Problem.",
            "New Method of Neuron Design Based on Discrete Z-Function to Adapt the Change of Integrated Vehicle Stability Control Order.",
            "Cellular Learning Automata Based Dynamic Channel Assignment Algorithms.",
            "Arabic Script Web Page Language Identification Using Hybrid-KNN Method.",
            "A New Fault Pattern Recognition Method Based on WPT and Dagsvm.",
            "Interpretation of Handwritten Single-Stroke Graffiti Using Support Vector Machines.",
            "A Vector Matrix Real Time Recursive Backpropagation Algorithm for Recurrent Neural Networks that Approximate Multi-Valued Periodic Functions.",
            "Fuzzy Operator Trees for Modeling Rating Functions.",
            "Annealed Chaotic Learning for Time Series Prediction in Improved Neuro-Fuzzy Network with Feedbacks.",
            "Building Customer Models from Business Data: an Automatic Approach Based on Fuzzy Clustering and Machine Learning.",
            "A Compositional Method Using an Evolutionary Algorithm for Finding Fuzzy Rules in 3-Layered Hierarchical Fuzzy Structure.",
            "A Two-State Ant Colony Algorithm for Solving the Minimum Graph Bisection Problem."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2008",
        "info": "Volume 7, 2008",
        "count": 27,
        "papers": [
            "A Speech synthesizer Using Facial EMG Signals.",
            "Rough Morphology Hybrid Approach for Mammography Image Classification and Prediction.",
            "Anafs Computation of H-Component of the Earth's Magnetic Field.",
            "Diversity-Based Information Exchange among Multiple Swarms in Particle Swarm Optimization.",
            "Systematic versus Local Search and GA Techniques for Incremental SAT.",
            "Book Review: \"digital Soul: Intelligent Machines and Human Values\", by Thomas M. Georges.",
            "Book Review: \"complexity Management in Fuzzy Systems: a Rule Base Compression Approach\", Alexander Gegov.",
            "Genetic Algorithms with Dynamic Mutation Rates and their Industrial Applications.",
            "A Multi-Objective Hw-sw Co-Synthesis Algorithm Based on Quantum-Inspired Evolutionary Algorithm.",
            "Rotated Problems and Rotationally Invariant Crossover in Evolutionary Multi-Objective Optimization.",
            "A Hybrid Estimation of Distribution Algorithm for CDMA Cellular System Design.",
            "Explicitly Simplifying Evolved Genetic Programs during Evolution.",
            "Book Review: \"decisions Uncertainty and the Brain: the Science of Neuroeconomics\", P. W. Glimcher.",
            "Noninvasive Detection of Suction in an implantable Rotary Blood Pump Using Neural Networks.",
            "Intelligent Data Analysis for the Classification of Body Surface Potential Maps.",
            "Segmentation of Lung Patterns in High-Resolution Computed Tomography Images of the Lung.",
            "Limitations and Applications of ICA for Surface electromyogram for Identifying Hand Gestures.",
            "On the Complexity and Energy Analyses in EEG between Alcoholic and Control Subjects during Delayed Matching to Sample Paradigm.",
            "Svm Models for Diagnosing Balance Problems Using Statistical Features of the Mtc Signal.",
            "Prediction of Elbow Trajectory from Shoulder Angles Using Neural Networks.",
            "Adaptive Filtering Algorithms Enhance the Accuracy of Low-Cost Inertial/Magnetic Sensing in Pedestrian Navigation Systems.",
            "A Probabilistic Self-Organizing Map for Binary Data Topographic Clustering.",
            "Hybrid-Neural-Network-Based Estimation of Line Overloading.",
            "Cogbroker - a Cognitive Approach to Intelligent Product Brokering for E-Commerce.",
            "Iteration-Free Fractal Coding for Image Compression Using Genetic Algorithm.",
            "Designing Relevant Features for Continuous Data Sets Using ICA.",
            "An Improved Genetic-Algorithm-Based Neural-Tuned Neural Network."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2006",
        "info": "Volume 6, 2006",
        "count": 32,
        "papers": [
            "Weighted Threshold-Based Clustering for Intrusion Detection Systems.",
            "Integrated Algorithms for Image Analysis and Classification of Nuclear Division for High-Content Cell-Cycle Screening.",
            "Application of SiCONnets to Handwritten Digit Recognition.",
            "Neural Classification of Mass Abnormalities with Different Types of Features in Digital Mammography.",
            "Genetic Programming Approach for Multi-Category Pattern Classification Applied to Network Intrusions Detection.",
            "Appearance Feature Extraction versus Image Transform-Based Approach for Visual Speech Recognition.",
            "Functional Decomposition - the Value and Implication for Both Neural Networks and Digital Designing.",
            "The Detection of Persons in Cluttered Beach Scenes Using Digital Video Imagery and Neural Network-Based Classification.",
            "Enhanced Frame-Based Video Coding to Support Content-Based Functionalities.",
            "Abnormality Detection in Brain MR Images Using Minimum Error Thresholding Method.",
            "Concept-Based Term Weighting for Web Information Retrieval.",
            "Calibration of an Artificial Mouth for Automatic Performance of a Trumpet Using a Genetic Algorithm.",
            "A Probabilistic Approach to Multi-Document Summarization for Generating a Tiled Summary.",
            "A New Lecture Allocation Support System Based on Users' Multiple Preferences in Campus Information Systems.",
            "Multilevel Synthesis of Finite State Machines Based on Symbolic Functional Decomposition.",
            "Distributed Adaptive Multivariate Function Visualization.",
            "Realization Problem for Positive Continuous-Time Systems with Delays.",
            "A Cerebellar Model Classifier for Data Mining with Linear Time Complexity.",
            "Multiobjective Optimization of Process Plant Using Genetic Algorithm.",
            "Two-Dimensional IIR Filter Design with Modern Search Heuristics: a Comparative Study.",
            "Support Vector Machine Based Automatic Classification of Human Brain Using MR Image Features.",
            "A Knowledge-Based Lung Nodule Detection System for Helical CT Images.",
            "Direct Adaptive Type-2 Fuzzy Control for Nonlinear Systems.",
            "Fuzzy State Aggregation and Policy Hill Climbing for Stochastic Environments.",
            "Multi-Learner Based Recursive Supervised Training.",
            "An Incremental Approach to MSE-Based Feature Selection.",
            "A Memetic Algorithm for Performing Memory Assignment in Dual-Bank DSPs.",
            "A Novel Algorithm for Solving the String Matching Problem.",
            "A Simulated Annealing Algorithm for System-on-Chip Test Scheduling with, Power and Precedence Constraints.",
            "Systematic Design Procedure of TS-Type Fuzzy Controllers.",
            "Protein Secondary Structure Prediction Using Support Vector Machines and a New Feature Representation.",
            "Book Review: \"complex Worlds from Simpler Nervous Systems\", by Frederick R. Prete (Editor)."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2005",
        "info": "Volume 5, 2005",
        "count": 29,
        "papers": [
            "Direct Adaptive Fuzzy Moving Sliding Mode Controller Design for Robotic Manipulators.",
            "On Generalized Multiple-instance Learning.",
            "Improving Supervised Learning by Sample Decomposition.",
            "Face Recognition in Colour Images Using Neural Networks and Genetic Algorithms.",
            "Genetic-algorithm Memory Minimisation for Designing Reconfigurable Ip Address Lookup Engine.",
            "A Hybrid of Genetic Algorithm and Support Vector Machine for Features Selection and Classification of Gene Expression Microarray.",
            "Calendar of Events.",
            "Editorial.",
            "Qcolony: a Multi-pheromone Best-fit Qos Routing Algorithm as an Alternative to Shortest-path Routing Algorithms.",
            "Using Ant Agents to Combine Reactive and Proactive Strategies for Routing in Mobile Ad-hoc Networks.",
            "An Ant-based Multicasting Protocol in Mobile Ad-hoc Network.",
            "Novel Low-complexity Ant Colony Based Multiuser Detector for Direct Sequence Code Division Multiple Access.",
            "A Multiple-objectives Evolutionary Perspective to Interdomain Traffic Engineering.",
            "Metaheuristic Approaches to Traffic Grooming in Wdm Optical Networks.",
            "Reliable Communication Network Design with Evolutionary Algorithms.",
            "A Genetic Algorithm for the Design of Minimum-cost Two-connected Networks with Bounded Rings.",
            "Support Vector Machines Based on the Orthogonal Projection Kernel of Father Wavelet.",
            "Using Competitive Co-evolution to Evolve Better Pattern Recognisers.",
            "Fuzzy Knnmodel Applied to Predictive Toxicology Data Mining.",
            "Computing Two Linchpins of Topological Degree by a Novel Differential Evolution Algorithm.",
            "Similarity-based Combination of Multiple Clusterings.",
            "Computational Intelligence Techniques for Home Electric Load Forecasting and Balancing.",
            "Classifier Combination Applied for Understanding of Eyes Images.",
            "Book Review: \"artificial War: Multiagent-based Simulation of Combat\", by Andrew Ilachinski.",
            "Setting up a Probabilistic Neural Network for Classification of Highway Vehicles.",
            "Multiobjective Optimization of Process Plant Using Genetic Algorithm.",
            "New Self-organizing Maps for Multivariate Sequences Processing.",
            "Classification of Cirrhosis from B-scan Images Using Pyramid Neural Network.",
            "Sagaxsearch: an Xml Information Retrieval Mechanism Using Self Adaptive Genetic Algorithms."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2004",
        "info": "Volume 4, 2004",
        "count": 29,
        "papers": [
            "Features Extraction For Protein Homology Detection Using Hidden Markov Models Combining Scores.",
            "Industrial Production Planning Using Interactive Fuzzy Linear Programming.",
            "Comparison Of Systems Based On Evolutionary Search And Simulated Annealing To Solve The Vrptw Problem.",
            "Stability Analysis Of Nonlinear Interconnected Systems Via T-S Fuzzy Models.",
            "Modular Feature Selection Using Relative Importance Factors.",
            "Neural Networks And Genetic Algorithms For Domain Independent Multiclass Object Detection.",
            "Book Review: A New Kind Of Science By Stephen Wolfram.",
            "A Non-Parametric Trainable Object-Detection Model Using A Concept Of Retinotopic Sampling.",
            "Texture Segmentation Using Semi-Supervised Support Vector Machines.",
            "Keywords Specification For Images Using Sandglass-Type Neural Networks.",
            "Recognition Of Smiling Faces Using Neural Networks And Spca.",
            "Vq-Based Gray Watermark Embedding Scheme With Genetic Index Assignment.",
            "Robust Digital Watermarking Based On Principal Component Analysis.",
            "Real-Time Blind Source Separation Of Acoustic Signals With A Recursive Approach.",
            "Blind Separation Of Mixed Kurtosis Signed Signals Using Partial Observations And Low Complexity Activation Functions.",
            "Evolving Emotions In Animal And Robot.",
            "Evolutionary Multi-Objective Optimisation Of Neural Networks For Face Detection.",
            "Evaluation Of Selecting Interval Values Of Input Variables In Connectionist Networks.",
            "Integrated Unsupervised And Error-Driven Learning For Incremental Process Identification With Neural Singleton Models.",
            "An Emergence Of Game Strategy In Multiagent Systems.",
            "Fuzzy Rule Extraction From Simple Evolving Connectionist Systems.",
            "Evolutionary Computation For On-Line And Off-Line Parameter Tuning Of Evolving Fuzzy Neural Networksc.",
            "Optimal Control Of A Hysteresis System By Means Of Co-Operative Co-Evolution.",
            "A Hybrid Evolutionary Algorithm For Multiple-Destinations Routing Problem.",
            "An Unsupervised Kernel Based Fuzzy C-Means Clustering Algorithm With Kernel Normalisation.",
            "A Parallel Genetic Algorithm For The Geometrically Constrained Site Layout Problem With Unequal-Size Facilities.",
            "Rotational Matching Problems.",
            "Finding Conserved Well-Ordered RNA Structures In Genomic Sequences.",
            "Sumomo: A Protein Surface Motif Mining Module."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2003",
        "info": "Volume 3, 2003",
        "count": 27,
        "papers": [
            "Application of Genetic Algorithms to a Large-Scale Multiple-Constraint Vehicle Routing Problem.",
            "On Operating Strategies of the Fuzzy Artmap Neural Network: A Comparative Study.",
            "Mapping Reference Code to Irregular DSPS within the Retargetable, Optimizing Compiler Cogen(T).",
            "Data Acquisition and Recognition of Fingerprints with LVQ.",
            "Automatic Facial Feature Extraction Using Edge Distribution and Genetic Search.",
            "Increasing the Autonomy of Deliberative Agents with a Case-Based Reasoning System.",
            "Fuzzy Logic in Web Data Mining for Website Assessment.",
            "Artificial Life: An Introduction.",
            "Critical Density in a Fire Spread Model Under Environmental Influence.",
            "Imitating Human Visual Attention and Reproducing Optical Illusions by Ant Scan.",
            "Open-Ended Artificial Evolution.",
            "Evolutionary Analysis on Spatial Locality in N-Person Iterated Prisoner's Dilemma.",
            "The Accumulated Experience Ant Colony for the Traveling Salesman Problem.",
            "A True Annealing Approach to the Marriage in Honey-Bees Optimization Algorithm.",
            "Hierarchical Rank Density Genetic Algorithm for Radial-Basis Function Neural Network Design.",
            "Optimization of Production Systems Using Genetic Algorithms.",
            "Fuzzy Moves Using Compensatory Granular Reasoning.",
            "Fuzzy System and CMAC Network with B-Spline Membership/Basis Functions can Approximate A Smooth Function and its Derivatives.",
            "An Extension of epsilon-Insensitive Hebbian Learning to Form a Non-Interfering Basis.",
            "Distributed Neural Networks for Quality of Service Estimation in Communication Networks.",
            "Evolutionary Optimization (Evopt): A Brief Review And Analysis.",
            "Hybrid Evolutionary And Annealing Algorithms For Nonlinear Discrete Constrained Optimization.",
            "Evolutionary Network Design: Hybrid Genetic Algorithms Approach.",
            "An Asynchronous Parallel Evolution Strategy.",
            "A Port System Simulation Facility With An Optimization Capability.",
            "Evolutionary Algorithms For Resource Constrained Non-Serial Mixed Flow Shops.",
            "Scheduling Flexible Job-Shops: A Worst Case Analysis And An Evolutionary Algorithm."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2002",
        "info": "Volume 2, 2002",
        "count": 32,
        "papers": [
            "Co-Evolution of Finite State Machines for Optimization: Promotion of Devices Which Search Globally.",
            "On the Co-Evolution of Evolving Expressions.",
            "A Novel Hybrid Framework of Coevolutionary GA and Machine Learning.",
            "A Comparison of Evolutionary and Coevolutionary Search.",
            "Co-Evolution in Social Interactions.",
            "Co-Evolution in Iterated Prisoner's Dilemma with Intermediate Levels of Cooperation: Application to Missile Defense.",
            "Extraction of Independent Causes Using Lateral Connections.",
            "Passphrase Authentication Based on Typing Style Through an Art 2 Neural Network.",
            "Time-Optimal Path Planning and Control Using Neural Networks and a Genetic Algorithm.",
            "An Intelligent Hybrid Approach for Content-Based Image Retrieval.",
            "Simplification, Merging and Division of Fuzzy Cognitive Maps.",
            "Mining Web Usage Graphs Using Example Search Space.",
            "Stability of Information Granulation and Information Granules.",
            "Using Computation Tree Logic for Intelligent Information Search on the Web.",
            "Mining Web Data Using Clustering Technique for Web Personalization.",
            "A Similarity-Based Model for Topic Distillation.",
            "Identifying Topics for Web Documents through Fuzzy Association Learning.",
            "Automatic Competitor Identification from Public Information Sources.",
            "Approximate Information Filtering with Multiple Classification Hierarchies.",
            "Prediction of Navigation Profiles in a Distributed Internet Environment through Learning of Graph Distributions.",
            "An Architecture of e-Butler: A Consumer-Centric Online Personalization System.",
            "XML Query by Example.",
            "An Evolutionary Approach to Mining Robust Multi-Resolution Web Profiles and Context Sensitive URL Associations.",
            "Supply Chain Formation in Open, Market-Based Multi-Agent Systems.",
            "An Approach to Explain Neural Networks using Symbolic Algorithms.",
            "Segmentation Versus Non-Segmentation Based Neural Techniques for Cursive Word Recognition: An Experimental Analysis.",
            "Knowledge Acquisition and Strategy Generation with LG Wargaming Tools.",
            "No Free Lunches in Multi-Agent Systems.",
            "Towards a High Reliability of the PCR Amplification Process in DNA Computing.",
            "Construction and Analysis of Stock Market Model Using ADG; Automatically Defined Groups.",
            "Local Search by Concentration-Controlled DNA Computing.",
            "Macroscopic Quantitative Observation of Multi-Robot Behavior."
        ]
    },
    {
        "name": "IJCIA",
        "year": "2001",
        "info": "Volume 1, 2001",
        "count": 26,
        "papers": [
            "Feedback Self-Organizing Map and its Application to Spatio-Temporal Pattern Classification.",
            "Learning of Fuzzy Automata.",
            "Hybrid Instance-Based System for Predicting Ocean Temperatures.",
            "Modular Connectionist Modelling and Classification Approaches for Local Diagnosis in Telecommunication Traffic Management.",
            "Using Case Retrieval to Seed Genetic Algorithms.",
            "The Application of Feedforward Neural Networks in VLSI Fabrication Process Optimization.",
            "An Enhanced Genetic Algorithm for Solving the High-Level Synthesis Problems of Scheduling, Allocation, and Binding.",
            "A New Control Scheme for Combustion Processes Using Reinforcement Learning Based on Neural Networks.",
            "A Neural Network-Based Image Retrieval Using Nonlinear Combination of Heterogeneous Features.",
            "Fuzzy Power Command Enhancement in Mobile Communications Systems.",
            "Automatic Frog Calls Monitoring System: A Machine Learning Approach.",
            "Prediction of Drug Dissolution Profiles Using Artificial Neural Networks.",
            "A Hybrid Approach to Knowledge Acquisition Using Neural Petri Nets and DS Theory.",
            "Immune and Neural Network Models: Theoretical and Empirical Comparisons.",
            "Functional Decomposition and Its Applications in Machine Learning and Neural Networks.",
            "Learning Naive Physics by Visual Observation: Using Qualitative Spatial Representations and Probabilistic Reasoning.",
            "Predicting Unknown Motion for Model Independent Visual Servoing.",
            "Compensation Competitive Learning.",
            "Combining Regression Estimators: GA-Based Selective Neural Network Ensemble.",
            "Neural Logic Network Learning Using Genetic Programming.",
            "The Extraction and Comparison of Knowledge from Local Function Networks.",
            "Violation-Guided Neural-Network Learning for Constrained Formulations in Time-Series Predictions.",
            "A General Updating Rule for Discrete Hopfield-Type Neural Network with Time-Delay and the Corresponding Search Algorithm.",
            "Learning Delayed Response Tasks Through Unsupervised Event Extraction.",
            "Learning Iterative Image Reconstruction in the Neural Abstraction Pyramid.",
            "NORN Predictor - Stock Prediction Using a Neural Oscillatory-based Recurrent Network."
        ]
    }
]