[
    {
        "name": "IJCV",
        "year": "2022",
        "info": "2022: Volume\n130",
        "count": 44,
        "papers": [
            "Editorial for Special Issue on Computer Vision in the Wild.",
            "Physical Representation Learning and Parameter Identification from Video Using Differentiable Physics.",
            "Inferring Bias and Uncertainty in Camera Calibration.",
            "Rescaling Egocentric Vision: Collection, Pipeline and Challenges for EPIC-KITCHENS-100.",
            "Learning a Robust Part-Aware Monocular 3D Human Pose Estimator via Neural Architecture Search.",
            "Dual-Attention-Guided Network for Ghost-Free High Dynamic Range Imaging.",
            "Distribution-Aware Margin Calibration for Semantic Segmentation in Images.",
            "View-Invariant, Occlusion-Robust Probabilistic Embedding for Human Pose.",
            "Joint Bilateral-Resolution Identity Modeling for Cross-Resolution Person Re-Identification.",
            "Memory-Efficient Hierarchical Neural Architecture Search for Image Restoration.",
            "Semantic Edge Detection with Diverse Deep Supervision.",
            "Preface to the Special Issue on Human Pose, Motion, Activities and Shape in 3D.",
            "Towards Compact 1-bit CNNs via Bayesian Learning.",
            "AdaStereo: An Efficient Domain-Adaptive Stereo Matching Approach.",
            "Bridging Composite and Real: Towards End-to-End Deep Image Matting.",
            "CODON: On Orchestrating Cross-Domain Attentions for Depth Super-Resolution.",
            "Action2video: Generating Videos of Human 3D Actions.",
            "SensatUrban: Learning Semantics from Urban-Scale Photogrammetric Point Clouds.",
            "Personalized Convolution for Face Recognition.",
            "Estimating 3D Motion and Forces of Human-Object Interactions from Internet Videos.",
            "Real-Time Multi-Car Localization and See-Through System.",
            "AutoScale: Learning to Scale for Crowd Counting.",
            "Perspectives and Prospects on Transformer Architecture for Cross-Modal Tasks with Language and Vision.",
            "Adaptive Deep Disturbance-Disentangled Learning for Facial Expression Recognition.",
            "Robust Geodesic Regression.",
            "Instance-Aware Scene Layout Forecasting.",
            "Continuous and Diverse Image-to-Image Translation via Signed Attribute Vectors.",
            "Joint Classification and Regression for Visual Tracking with Fully Convolutional Siamese Networks.",
            "Procrustes Analysis with Deformations: A Closed-Form Solution by Eigenvalue Decomposition.",
            "Inextensible Surface Reconstruction Under Small Relative Deformations from Distributed Angle Measurements.",
            "RePCD-Net: Feature-Aware Recurrent Point Cloud Denoising Network.",
            "Learning 3D Semantic Scene Graphs with Instance Embeddings.",
            "CMSNet: Deep Color and Monochrome Stereo.",
            "Learning Scene Dynamics from Point Cloud Sequences.",
            "Multi-frame Motion Segmentation by Combining Two-Frame Results.",
            "Learning to Detect Instance-Level Salient Objects Using Complementary Image Labels.",
            "Wide-Angle Image Rectification: A Survey.",
            "A Unified B-Spline Framework for Scale-Invariant Keypoint Detection.",
            "From Individual to Whole: Reducing Intra-class Variance by Feature Aggregation.",
            "Network Adjustment: Channel and Block Search Guided by Resource Utilization Ratio.",
            "A Survey on Intrinsic Images: Delving Deep into Lambert and Beyond.",
            "Consensus-Based Optimization for 3D Human Pose Estimation in Camera Coordinates.",
            "Correction to: Instance-Aware Scene Layout Forecasting.",
            "Correction to: AdaStereo: An Efficient Domain-Adaptive Stereo Matching Approach."
        ]
    },
    {
        "name": "IJCV",
        "year": "2021",
        "info": "2021: Volume\n129",
        "count": 168,
        "papers": [
            "View Transfer on Human Skeleton Pose: Automatically Disentangle the View-Variant and View-Invariant Information for Pose Representation Learning.",
            "Image Matching from Handcrafted to Deep Features: A Survey.",
            "A Camera Model for Line-Scan Cameras with Telecentric Lenses.",
            "Solving Rolling Shutter 3D Vision Problems using Analogies with Non-rigidity.",
            "Temporally Coherent General Dynamic Scene Reconstruction.",
            "Recursive Context Routing for Object Detection.",
            "Scene Text Detection and Recognition: The Deep Learning Era.",
            "Improving Image Description with Auxiliary Modality for Visual Localization in Challenging Conditions.",
            "DeepVS2.0: A Saliency-Structured Deep Learning Method for Predicting Dynamic Visual Attention.",
            "Pixel-Wise Crowd Understanding via Synthetic Data.",
            "Talk2Nav: Long-Range Vision-and-Language Navigation with Dual Attention and Spatial Memory.",
            "Unsupervised Domain Adaptation in the Wild via Disentangling Representation Learning.",
            "Volume Sweeping: Learning Photoconsistency for Multi-View Shape Reconstruction.",
            "Beyond Covariance: SICE and Kernel Based Visual Feature Representation.",
            "JÂA-Net: Joint Facial Action Unit Detection and Face Alignment Via Adaptive Attention.",
            "Rain Rendering for Evaluating and Improving Robustness to Bad Weather.",
            "A Comprehensive Analysis of Weakly-Supervised Semantic Segmentation in Different Image Domains.",
            "Face Image Reflection Removal.",
            "Unsupervised Deep Representation Learning for Real-Time Tracking.",
            "Deep Hashing with Hash-Consistent Large Margin Proxy Embeddings.",
            "LaSOT: A High-quality Large-scale Single Object Tracking Benchmark.",
            "Benchmarking the Robustness of Semantic Segmentation Models with Respect to Common Corruptions.",
            "Fine-Grained Instance-Level Sketch-Based Image Retrieval.",
            "Binarized Neural Architecture Search for Efficient Object Recognition.",
            "Image Matching Across Wide Baselines: From Paper to Practice.",
            "HOTA: A Higher Order Metric for Evaluating Multi-object Tracking.",
            "Deformable Kernel Networks for Joint Image Filtering.",
            "Progressive Multi-granularity Analysis for Video Prediction.",
            "Residual Dual Scale Scene Text Spotting by Fusing Bottom-Up and Top-Down Processing.",
            "Progressive DARTS: Bridging the Optimization Gap for NAS in the Wild.",
            "Entrack: Probabilistic Spherical Regression with Entropy Regularization for Fiber Tractography.",
            "Weakly Supervised Group Mask Network for Object Detection.",
            "AdaFuse: Adaptive Multiview Fusion for Accurate Human Pose Estimation in the Wild.",
            "Viewpoint and Scale Consistency Reinforcement for UAV Vehicle Re-Identification.",
            "Compositional Convolutional Neural Networks: A Robust and Interpretable Model for Object Recognition Under Occlusion.",
            "CDTD: A Large-Scale Cross-Domain Benchmark for Instance-Level Image-to-Image Translation and Domain Adaptive Object Detection.",
            "Deep Nets: What have They Ever Done for Vision?",
            "Correction to: Rooted Spanning Superpixels.",
            "Learning Extremal Representations with Deep Archetypal Analysis.",
            "Reference Pose Generation for Long-term Visual Localization via Learned Features and View Synthesis.",
            "MOTChallenge: A Benchmark for Single-Camera Multiple Target Tracking.",
            "A Benchmark and Evaluation of Non-Rigid Structure from Motion.",
            "Learning to Reconstruct HDR Images from Events, with Applications to Depth and Flow Prediction.",
            "Hierarchical Visual-Textual Knowledge Distillation for Life-Long Correlation Learning.",
            "Adding Knowledge to Unsupervised Algorithms for the Recognition of Intent.",
            "Separating Content from Style Using Adversarial Learning for Recognizing Text in the Wild.",
            "Evaluation of Inpainting and Augmentation for Censored Image Queries.",
            "Rectified Binary Convolutional Networks with Generative Adversarial Learning.",
            "Beyond Brightening Low-light Images.",
            "The MVTec Anomaly Detection Dataset: A Comprehensive Real-World Dataset for Unsupervised Anomaly Detection.",
            "Parallel Single-Pixel Imaging: A General Method for Direct-Global Separation and 3D Shape Reconstruction Under Strong Global Illumination.",
            "AutoDet: Pyramid Network Architecture Search for Object Detection.",
            "Rectifying Pseudo Label Learning via Uncertainty Estimation for Domain Adaptive Semantic Segmentation.",
            "A Shape Transformation-based Dataset Augmentation Framework for Pedestrian Detection.",
            "Excitation Dropout: Encouraging Plasticity in Deep Neural Networks.",
            "Benchmarking Low-Light Image Enhancement and Beyond.",
            "Label-Free Robustness Estimation of Object Detection CNNs for Autonomous Driving Applications.",
            "Incremental Rotation Averaging.",
            "Complete Singularity Analysis for the Perspective-Four-Point Problem.",
            "Unified Quality Assessment of in-the-Wild Videos with Mixed Datasets Training.",
            "Comparison of Full-Reference Image Quality Models for Optimization of Image Processing Systems.",
            "Selective Wavelet Attention Learning for Single Image Deraining.",
            "A Comprehensive Benchmark Analysis of Single Image Deraining: Current Challenges and Future Perspectives.",
            "DeepFlux for Skeleton Detection in the Wild.",
            "Deformable Image Registration Based on Functions of Bounded Generalized Deformation.",
            "Adaptive Channel Selection for Robust Visual Object Tracking with Discriminative Correlation Filters.",
            "Towards Balanced Learning for Instance Recognition.",
            "Letter-Level Online Writer Identification.",
            "Manhattan Room Layout Reconstruction from a Single $360^{\\circ }$ Image: A Comparative Study of State-of-the-Art Methods.",
            "ACTNET: End-to-End Learning of Feature Activations and Multi-stream Aggregation for Effective Instance Image Retrieval.",
            "Semantic Hierarchy Emerges in Deep Generative Representations for Scene Synthesis.",
            "LAMP-HQ: A Large-Scale Multi-pose High-Quality Database and Benchmark for NIR-VIS Face Recognition.",
            "Spatial-Temporal Relation Reasoning for Action Prediction in Videos.",
            "Real-Time Semantic Segmentation via Auto Depth, Downsampling Joint Decision and Feature Aggregation.",
            "Visual Interestingness Prediction: A Benchmark Framework and Literature Review.",
            "EfficientPS: Efficient Panoptic Segmentation.",
            "Intra-Camera Supervised Person Re-Identification.",
            "Enhanced 3D Human Pose Estimation from Videos by Using Attention-Based Neural Network with Dilated Convolutions.",
            "An Exploration of Embodied Visual Exploration.",
            "Context-Enhanced Representation Learning for Single Image Deraining.",
            "Mimetics: Towards Understanding Human Actions Out of Context.",
            "Successive Graph Convolutional Network for Image De-raining.",
            "Evaluation Metrics for Conditional Image Generation.",
            "Evaluating Visual Properties via Robust HodgeRank.",
            "You Only Look Yourself: Unsupervised and Untrained Single Image Dehazing Neural Network.",
            "Exposing Semantic Segmentation Failures via Maximum Discrepancy Competition.",
            "Correction to: Parallel Single-Pixel Imaging: A General Method for Direct-Global Separation and 3D Shape Reconstruction Under Strong Global Illumination.",
            "Knowledge Distillation: A Survey.",
            "Learning Deep Patch representation for Probabilistic Graphical Model-Based Face Sketch Synthesis.",
            "Development and Validation of an Unsupervised Feature Learning System for Leukocyte Characterization and Classification: A Multi-Hospital Study.",
            "Vote-Based 3D Object Detection with Context Modeling and SOB-3DNMS.",
            "Guided Attention in CNNs for Occluded Pedestrian Detection and Re-identification.",
            "Visual Structure Constraint for Transductive Zero-Shot Learning in the Wild.",
            "Polysemy Deciphering Network for Robust Human-Object Interaction Detection.",
            "Learning Adaptive Classifiers Synthesis for Generalized Few-Shot Learning.",
            "Object Priors for Classifying and Localizing Unseen Actions.",
            "Exploring the Capacity of an Orderless Box Discretization Network for Multi-orientation Scene Text Detection.",
            "Deep Human-Interaction and Association by Graph-Based Learning for Multiple Object Tracking in the Wild.",
            "Renormalization for Initialization of Rolling Shutter Visual-Inertial Odometry.",
            "Guest Editorial: Special Issue on Performance Evaluation in Computer Vision.",
            "Guest Editorial: Special Issue on \"Computer Vision for All Seasons: Adverse Weather and Lighting Conditions\".",
            "Segmentation by Continuous Latent Semantic Analysis for Multi-structure Model Fitting.",
            "A Shape-Aware Retargeting Approach to Transfer Human Motion and Appearance in Monocular Videos.",
            "CNN-Based RGB-D Salient Object Detection: Learn, Select, and Fuse.",
            "Quo Vadis, Skeleton Action Recognition?",
            "Continuous 3D Multi-Channel Sign Language Production via Progressive Transformers and Mixture Density Networks.",
            "VPR-Bench: An Open-Source Visual Place Recognition Evaluation Framework with Quantifiable Viewpoint and Appearance Change.",
            "Attention Guided Low-Light Image Enhancement with a Large Scale Low-Light Simulation Dataset.",
            "The Isowarp: The Template-Based Visual Geometry of Isometric Surfaces.",
            "Scale-Aware Domain Adaptive Faster R-CNN.",
            "Unsupervised Domain Adaptation with Background Shift Mitigating for Person Re-Identification.",
            "Synthetic Humans for Action Recognition from Unseen Viewpoints.",
            "Mitigating Demographic Bias in Facial Datasets with Style-Based Multi-attribute Transfer.",
            "Cross-Modal Pyramid Translation for RGB-D Scene Recognition.",
            "Deep CockTail Networks.",
            "Saliency Detection Inspired by Topological Perception Theory.",
            "OCNet: Object Context for Semantic Segmentation.",
            "MADAN: Multi-source Adversarial Domain Aggregation Network for Domain Adaptation.",
            "A Numerical Framework for Elastic Surface Matching, Comparison, and Interpolation.",
            "ShadingNet: Image Intrinsics by Fine-Grained Shading Decomposition.",
            "SODA: Weakly Supervised Temporal Action Localization Based on Astute Background Response and Self-Distillation Learning.",
            "Deep Unsupervised 3D Human Body Reconstruction from a Sparse set of Landmarks.",
            "Multi-level Motion Attention for Human Motion Prediction.",
            "Learning Regression and Verification Networks for Robust Long-term Tracking.",
            "Unsupervised Scale-Consistent Depth Learning from Video.",
            "Learned Collaborative Stereo Refinement.",
            "Tracking by Deblatting.",
            "Semantics-to-Signal Scalable Image Compression with Learned Revertible Representations.",
            "Structure-Measure: A New Way to Evaluate Foreground Maps.",
            "Towards High Performance Human Keypoint Detection.",
            "Learning to Caricature via Semantic Shape Transform.",
            "Shape My Face: Registering 3D Face Scans by Surface-to-Surface Translation.",
            "Learning Adaptive Attribute-Driven Representation for Real-Time RGB-T Tracking.",
            "Correction to: Long-Short Temporal-Spatial Clues Excited Network for Robust Person Re-identification.",
            "Cascaded Split-and-Aggregate Learning with Feature Recombination for Pedestrian Attribute Recognition.",
            "Spectral Shape Recovery and Analysis Via Data-driven Connections.",
            "SDNet: A Versatile Squeeze-and-Decomposition Network for Real-Time Image Fusion.",
            "Pluralistic Free-Form Image Completion.",
            "A Decomposable Winograd Method for N-D Convolution Acceleration in Video Analysis.",
            "Deep Maximum a Posterior Estimator for Video Denoising.",
            "SportsCap: Monocular 3D Human Motion Capture and Fine-Grained Understanding in Challenging Sports Videos.",
            "DLOW: Domain Flow and Applications.",
            "Just Recognizable Distortion for Machine Vision Oriented Image and Video Coding.",
            "Adaptive Dimension-Discriminative Low-Rank Tensor Recovery for Computational Hyperspectral Imaging.",
            "Context and Structure Mining Network for Video Object Detection.",
            "Deep Learning Geometry Compression Artifacts Removal for Video-Based Point Cloud Compression.",
            "A Coarse-to-Fine Framework for Resource Efficient Video Recognition.",
            "Predicting Visual Political Bias Using Webly Supervised Data and an Auxiliary Task.",
            "Guest Editorial: Special Issue: Computer Vision and Pattern Recognition (DAGM GCPR 2019).",
            "3D Scene Reconstruction with an Un-calibrated Light Field Camera.",
            "Hierarchical Conditional Relation Networks for Multimodal Video Question Answering.",
            "BiSeNet V2: Bilateral Network with Guided Aggregation for Real-Time Semantic Segmentation.",
            "FairMOT: On the Fairness of Detection and Re-identification in Multiple Object Tracking.",
            "Assignment Flow for Order-Constrained OCT Segmentation.",
            "The Fishyscapes Benchmark: Measuring Blind Spots in Semantic Segmentation.",
            "Semantic Bottlenecks: Quantifying and Improving Inspectability of Deep Representations.",
            "Norm-Aware Embedding for Efficient Person Search and Tracking.",
            "Computer Vision and Pattern Recognition 2020.",
            "Guest Editorial: Special Issue on Deep Learning for Video Analysis and Compression.",
            "Pixel-in-Pixel Net: Towards Efficient Facial Landmark Detection in the Wild.",
            "Visiting the Invisible: Layer-by-Layer Completed Scene Decomposition.",
            "Hierarchical Domain-Adapted Feature Learning for Video Saliency Prediction.",
            "Dual-Constrained Deep Semi-Supervised Coupled Factorization Network with Enriched Prior.",
            "Deep Trajectory Post-Processing and Position Projection for Single & Multiple Camera Multiple Object Tracking.",
            "Dual-view Snapshot Compressive Imaging via Optical Flow Aided Recurrent Neural Network.",
            "NAS-FCOS: Efficient Search for Object Detection Architectures.",
            "3D-FUTURE: 3D Furniture Shape with TextURE.",
            "DeMoCap: Low-Cost Marker-Based Motion Capture."
        ]
    },
    {
        "name": "IJCV",
        "year": "2020",
        "info": "2020: Volume\n128",
        "count": 157,
        "papers": [
            "ARBEE: Towards Automated Recognition of Bodily Expression of Emotion in the Wild.",
            "Synchronization Problems in Computer Vision with Closed-Form Solutions.",
            "Robust Attentional Aggregation of Deep Feature Sets for Multi-view 3D Reconstruction.",
            "Temporal Action Detection with Structured Segment Networks.",
            "Tracking Persons-of-Interest via Unsupervised Representation Adaptation.",
            "Shape-From-Template with Curves.",
            "Classifier and Exemplar Synthesis for Zero-Shot Learning.",
            "Bi-Real Net: Binarizing Deep Network Towards Real-Network Performance.",
            "Predicting Intentions from Motion: The Subject-Adversarial Adaptation Approach.",
            "Single Image Dehazing via Multi-scale Convolutional Neural Networks with Holistic Edges.",
            "Deep Learning for Generic Object Detection: A Survey.",
            "Semantically Coherent 4D Scene Flow of Dynamic Scenes.",
            "Grad-CAM: Visual Explanations from Deep Networks via Gradient-Based Localization.",
            "Dual L1-Normalized Context Aware Tensor Power Iteration and Its Applications to Multi-object Tracking and Multi-graph Matching.",
            "Semantic Image Networks for Human Action Recognition.",
            "Deep Insights into Convolutional Networks for Video Recognition.",
            "Corner Detection Using Multi-directional Structure Tensor with Multiple Scales.",
            "Recognizing Profile Faces by Imagining Frontal View.",
            "Adaptive Importance Learning for Improving Lightweight Image Super-Resolution Network.",
            "Hallucinating Unaligned Face Images by Multiscale Transformative Discriminative Networks.",
            "SceneFlowFields++: Multi-frame Matching, Visibility Prediction, and Robust Interpolation for Scene Flow Estimation.",
            "Statistical Modeling of Craniofacial Shape and Texture.",
            "Special Issue: Advances in Architectures and Theories for Computer Vision.",
            "Robust Fitting in Computer Vision: Easy or Hard?",
            "Learning SO(3) Equivariant Representations with Spherical CNNs.",
            "EKLT: Asynchronous Photometric Feature Tracking Using Events and Frames.",
            "Correction to: EKLT: Asynchronous Photometric Feature Tracking Using Events and Frames.",
            "Jointly Discovering Visual Objects and Spoken Words from Raw Sensory Input.",
            "CornerNet: Detecting Objects as Paired Keypoints.",
            "DeepIM: Deep Iterative Matching for 6D Pose Estimation.",
            "Differential Scene Flow from Light Field Gradients.",
            "GANimation: One-Shot Anatomically Consistent Facial Animation.",
            "Augmented Autoencoders: Implicit 3D Orientation Learning for 6D Object Detection.",
            "Convolutional Networks with Adaptive Inference Graphs.",
            "Group Normalization.",
            "DeepTAM: Deep Tracking and Mapping with Convolutional Neural Networks.",
            "Editorial: Special Issue on Machine Vision with Deep Learning.",
            "Learning on the Edge: Investigating Boundary Filters in CNNs.",
            "A Simple and Light-Weight Attention Module for Convolutional Neural Networks.",
            "Simultaneous Deep Stereo Matching and Dehazing with Feature Attention.",
            "Pixelated Semantic Colorization.",
            "Learning Single-Image 3D Reconstruction by Generative Modelling of Shape, Pose and Shading.",
            "Modeling Human Motion with Quaternion-Based Neural Networks.",
            "Learning Multi-human Optical Flow.",
            "Text2Sign: Towards Sign Language Production Using Neural Machine Translation and Generative Adversarial Networks.",
            "Guest Editorial: Special Issue on ACCV 2018.",
            "EdgeStereo: An Effective Multi-task Learning Network for Stereo Matching and Edge Detection.",
            "VOSTR: Video Object Segmentation via Transferable Representations.",
            "Minimal Solvers for Rectifying from Radially-Distorted Scales and Change of Scales.",
            "Editor's Note.",
            "KS(conf): A Light-Weight Test if a Multiclass Classifier Operates Outside of Its Specifications.",
            "Correction to: KS(conf): A Light-Weight Test if a Multiclass Classifier Operates Outside of Its Specifications.",
            "End-to-End Learning of Decision Trees and Forests.",
            "3D Fluid Flow Estimation with Integrated Particle Reconstruction.",
            "Scaling up the Randomized Gradient-Free Adversarial Attack Reveals Overestimation of Robustness Using Established Attacks.",
            "Inference, Learning and Attention Mechanisms that Exploit and Preserve Sparsity in CNNs.",
            "Efficient Object Annotation via Speaking and Pointing.",
            "Learning to Draw Sight Lines.",
            "Refractive Two-View Reconstruction for Underwater 3D Vision.",
            "Loss-Sensitive Generative Adversarial Networks on Lipschitz Densities.",
            "The Unmanned Aerial Vehicle Benchmark: Object Detection, Tracking and Baseline.",
            "Special Issue on Deep Learning for Robotic Vision.",
            "Learning 3D Shape Completion Under Weak Supervision.",
            "Curriculum Model Adaptation with Synthetic and Real Data for Semantic Foggy Scene Understanding.",
            "Image-Based Geo-Localization Using Satellite Imagery.",
            "Semi-supervised Semantic Mapping Through Label Propagation with Semantic Texture Meshes.",
            "Self-Supervised Model Adaptation for Multimodal Semantic Segmentation.",
            "SeDAR: Reading Floorplans Like a Human - Using Deep Learning to Enable Human-Inspired Localisation.",
            "Cognitive Mapping and Planning for Visual Navigation.",
            "Deep Multicameral Decoding for Localizing Unoccluded Object Instances from a Single RGB Image.",
            "Model-Based Robot Imitation with Future Image Similarity.",
            "Correction to: Model-Based Robot Imitation with Future Image Similarity.",
            "Special Issue on Generating Realistic Visual Data of Human Behavior.",
            "Adversarial Framework for Unsupervised Learning of Motion Dynamics in Videos.",
            "Realistic Speech-Driven Facial Animation with GANs.",
            "A Weakly Supervised Multi-task Ranking Framework for Actor-Action Semantic Segmentation.",
            "Masked Linear Regression for Learning Local Receptive Fields for Facial Expression Synthesis.",
            "Deep Neural Network Augmentation: Generating Faces for Affect Analysis.",
            "Towards High Fidelity Face Frontalization in the Wild.",
            "Generating Human Action Videos by Coupling 3D Game Engines and Probabilistic Graphical Models.",
            "DGPose: Deep Generative Models for Human Body Analysis.",
            "A Face Fairness Framework for 3D Meshes.",
            "GMS: Grid-Based Motion Statistics for Fast, Ultra-robust Feature Correspondence.",
            "Real-Time Multi-person Motion Capture from Multi-view Video and IMUs.",
            "Representation Learning on Unit Ball with 3D Roto-translational Equivariance.",
            "Scalable Person Re-Identification by Harmonious Attention.",
            "Fine-Grained Person Re-identification.",
            "Siamese Dense Network for Reflection Removal with Flash and No-Flash Image Pairs.",
            "Gated Fusion Network for Degraded Image Super Resolution.",
            "Discriminative Training of Conditional Random Fields with Probably Submodular Constraints.",
            "Weakly-Supervised Semantic Segmentation by Iterative Affinity Learning.",
            "Visual Social Relationship Recognition.",
            "RGB-IR Person Re-identification by Cross-Modality Similarity Preservation.",
            "Bottom-Up Scene Text Detection with Markov Clustering Networks.",
            "Multi-task Generative Adversarial Network for Detecting Small Objects in the Wild.",
            "Exploiting Semantics for Face Image Deblurring.",
            "Is There Anything New to Say About SIFT Matching?",
            "Deep Image Prior.",
            "Light Structure from Pin Motion: Geometric Point Light Source Calibration.",
            "MAP Inference Via ℓ 2-Sphere Linear Program Reformulation.",
            "Semi-online Multi-people Tracking by Re-identification.",
            "The Open Images Dataset V4.",
            "Enhanced Balanced Min Cut.",
            "Efficient Visual Recognition.",
            "A Survey of Deep Facial Attribute Analysis.",
            "Hardware-Centric AutoML for Mixed-Precision Quantization.",
            "Spatially-Adaptive Filter Units for Compact and Efficient Deep Neural Networks.",
            "HetConv: Beyond Homogeneous Convolution Kernels for Deep CNNs.",
            "Learning an Evolutionary Embedding via Massive Knowledge Distillation.",
            "SSN: Learning Sparse Switchable Normalization via SparsestMax.",
            "Rectified Wing Loss for Efficient and Robust Facial Landmark Localisation with Convolutional Neural Networks.",
            "Multi-task Compositional Network for Visual Relationship Detection.",
            "Disentangled Representation Learning of Makeup Portraits in the Wild.",
            "Fine-Grained Multi-human Parsing.",
            "A General Framework for Deep Supervised Discrete Hashing.",
            "Learning Multifunctional Binary Codes for Personalized Image Retrieval.",
            "Unified Binary Generative Adversarial Network for Image Retrieval and Compression.",
            "Weakly-supervised Semantic Guided Hashing for Social Image Retrieval.",
            "Hadamard Matrix Guided Online Hashing.",
            "Anchor-Based Self-Ensembling for Semi-Supervised Deep Pairwise Hashing.",
            "Product Quantization Network for Fast Visual Search.",
            "Tensorized Multi-view Subspace Representation Learning.",
            "Guest Editorial: Generative Adversarial Networks for Computer Vision.",
            "Discriminative Region Proposal Adversarial Network for High-Quality Image-to-Image Translation.",
            "Handwritten Mathematical Expression Recognition via Paired Adversarial Learning.",
            "DRIT++: Diverse Image-to-Image Translation via Disentangled Representations.",
            "Layout2image: Image Generation from Layout.",
            "Discriminator Feature-Based Inference by Recycling the Discriminator of GANs.",
            "MimicGAN: Robust Projection onto Image Manifolds with Corruption Mimicking.",
            "Pix2Shape: Towards Unsupervised Learning of 3D Scenes from Images Using a View-Based Representation.",
            "Adversarial Confidence Learning for Medical Image Segmentation and Synthesis.",
            "Towards Image-to-Video Translation: A Structure-Aware Approach via Multi-stage Generative Adversarial Networks.",
            "3DFaceGAN: Adversarial Nets for 3D Face Representation, Generation, and Translation.",
            "High-Quality Video Generation from Static Structural Annotations.",
            "Compositional GAN: Learning Image-Conditional Binary Composition.",
            "Train Sparsely, Generate Densely: Memory-Efficient Unsupervised Training of High-Resolution Temporal GAN.",
            "Multimodal Image Synthesis with Conditional Implicit Maximum Likelihood Estimation.",
            "SliderGAN: Synthesizing Expressive Face Images by Sliding 3D Blendshape Parameters.",
            "Inferring 3D Shapes from Image Collections Using Adversarial Networks.",
            "RoCGAN: Robust Conditional GAN.",
            "Semantically Tied Paired Cycle Consistency for Any-Shot Sketch-Based Image Retrieval.",
            "Densifying Supervision for Fine-Grained Visual Comparisons.",
            "GADE: A Generative Adversarial Approach to Density Estimation and its Applications.",
            "Towards Photo-Realistic Facial Expression Manipulation.",
            "CR-Net: A Deep Classification-Regression Network for Multimodal Apparent Personality Analysis.",
            "Necessary and Sufficient Polynomial Constraints on Compatible Triplets of Essential Matrices.",
            "Learning the Clustering of Longitudinal Shape Data Sets into a Mixture of Independent or Branching Trajectories.",
            "Transferrable Feature and Projection Learning with Class Hierarchy for Zero-Shot Learning.",
            "Gradient Shape Model.",
            "Mix and Match Networks: Cross-Modal Alignment for Zero-Pair Image-to-Image Translation.",
            "Learning the spatiotemporal variability in longitudinal shape data sets.",
            "Incorporating Side Information by Adaptive Convolution.",
            "Pix2Vox++: Multi-scale Context-aware 3D Object Reconstruction from Single and Multiple Images.",
            "Long-Short Temporal-Spatial Clues Excited Network for Robust Person Re-identification.",
            "Rooted Spanning Superpixels.",
            "Zero-Shot Object Detection: Joint Recognition and Localization of Novel Concepts.",
            "Video Based Face Recognition by Using Discriminatively Learned Convex Models."
        ]
    },
    {
        "name": "IJCV",
        "year": "2019",
        "info": "2019: Volume\n127",
        "count": 94,
        "papers": [
            "Structural Constraint Data Association for Online Multi-object Tracking.",
            "An Approximate Shading Model with Detail Decomposition for Object Relighting.",
            "Combining Multiple Cues for Visual Madlibs Question Answering.",
            "Fast Diffeomorphic Image Registration via Fourier-Approximated Lie Algebras.",
            "From BoW to CNN: Two Decades of Texture Representation for Texture Classification.",
            "Appreciation to IJCV Reviewers of 2018.",
            "Facial Landmark Detection: A Literature Survey.",
            "Complete 3D Scene Parsing from an RGBD Image.",
            "Equivalent Constraints for Two-View Geometry: Pose Solution/Pure Rotation Identification and 3D Reconstruction.",
            "Group Collaborative Representation for Image Set Classification.",
            "Efficiently Annotating Object Images with Absolute Size Information Using Mobile Devices.",
            "Zoom Out-and-In Network with Map Attention Decision for Region Proposal and Object Detection.",
            "Context-Based Path Prediction for Targets with Switching Dynamics.",
            "Pointly-Supervised Action Localization.",
            "Learning to Segment Moving Objects.",
            "Semantic Understanding of Scenes Through the ADE20K Dataset.",
            "Superpixel-Guided Two-View Deterministic Geometric Model Fitting.",
            "Second-order Temporal Pooling for Action Recognition.",
            "Leveraging Prior-Knowledge for Weakly Supervised Object Detection Under a Collaborative Self-Paced Curriculum Learning Framework.",
            "Fusing Visual and Inertial Sensors with Semantics for 3D Human Pose Estimation.",
            "Making the V in VQA Matter: Elevating the Role of Image Understanding in Visual Question Answering.",
            "Robust and Optimal Registration of Image Sets and Structured Scenes via Sum-of-Squares Polynomials.",
            "Deep Appearance Models: A Deep Boltzmann Machine Approach for Face Modeling.",
            "Understanding Image Representations by Measuring Their Equivariance and Equivalence.",
            "Kernel Cuts: Kernel and Spectral Clustering Meet Regularization.",
            "Locality Preserving Matching.",
            "Editorial: Special Issue on Deep Learning for Face Analysis.",
            "Single-Shot Scale-Aware Network for Real-Time Face Detection.",
            "Hierarchical Attention for Part-Aware Face Detection.",
            "Real-Time 3D Head Pose Tracking Through 2.5D Constrained Local Models with Local Neural Fields.",
            "The Menpo Benchmark for Multi-pose 2D and 3D Facial Landmark Localisation and Tracking.",
            "Face Mask Extraction in Video Sequence.",
            "Face-Specific Data Augmentation for Unconstrained Face Recognition.",
            "A Comprehensive Study on Center Loss for Deep Face Recognition.",
            "Large-Scale Bisample Learning on ID Versus Spot Face Recognition.",
            "Learning Discriminative Aggregation Network for Video-Based Face Recognition and Person Re-identification.",
            "Detecting and Mitigating Adversarial Perturbations for Robust Face Recognition.",
            "An Adversarial Neuro-Tensorial Approach for Learning Disentangled Representations.",
            "Wavelet Domain Generative Adversarial Network for Multi-scale Face Hallucination.",
            "Joint Face Hallucination and Deblurring via Structure Generation and Detail Enhancement.",
            "Motion Deblurring of Faces.",
            "Disentangling Geometry and Appearance with Regularised Geometry-Aware Generative Adversarial Networks.",
            "Synthesis of High-Quality Visible Faces from Polarimetric Thermal Faces using Generative Adversarial Networks.",
            "Identity-Preserving Face Recovery from Stylized Portraits.",
            "Blended Emotion in-the-Wild: Multi-label Facial Expression Recognition Using Crowdsourced Annotations and Deep Locality Feature Learning.",
            "Deep Affect Prediction in-the-Wild: Aff-Wild Database and Challenge, Deep Architectures, and Beyond.",
            "Deep, Landmark-Free FAME: Face Alignment, Modeling, and Expression Estimation.",
            "Learning from Longitudinal Face Demonstration - Where Tractable Deep Modeling Meets Inverse Reinforcement Learning.",
            "A Robust Monocular 3D Object Tracking Method Combining Statistical and Photometric Constraints.",
            "Fast Abnormal Event Detection.",
            "An Exact Robust Method to Localize a Known Sphere by Means of One Image.",
            "Blind Image Deblurring via Deep Discriminative Priors.",
            "Online Mutual Foreground Segmentation for Multispectral Stereo Videos.",
            "Rank-1 Tensor Approximation for High-Order Association in Multi-target Tracking.",
            "Exploiting the Anisotropy of Correlation Filter Learning for Visual Tracking.",
            "Video Enhancement with Task-Oriented Flow.",
            "One-Day Outdoor Photometric Stereo Using Skylight Estimation.",
            "Correction to: One-Day Outdoor Photometric Stereo Using Skylight Estimation.",
            "Contrast Invariant SNR and Isotonic Regressions.",
            "Visibility Enhancement by Integrating Refocusing and Direct-Global Separation with Contact Imaging.",
            "Lucid Data Dreaming for Video Object Segmentation.",
            "Predicting How to Distribute Work Between Algorithms and Humans to Segment an Image Batch.",
            "Deep Supervised Hashing for Fast Image Retrieval.",
            "Which and How Many Regions to Gaze: Focus Discriminative Regions for Fine-Grained Visual Categorization.",
            "Deep Learning Approach in Aerial Imagery for Supporting Land Search and Rescue Missions.",
            "Unsupervised Learning of Foreground Object Segmentation.",
            "Multi-target Tracking in Multiple Non-overlapping Cameras Using Fast-Constrained Dominant Sets.",
            "Click Carving: Interactive Object Segmentation in Images and Videos with Point Clicks.",
            "Efficient Feature Matching via Nonnegative Orthogonal Relaxation.",
            "Repetition Estimation.",
            "Video Question Answering with Spatio-Temporal Reasoning.",
            "A Spatiotemporal Convolutional Neural Network for Automatic Pain Intensity Estimation from Facial Dynamics.",
            "Joint Estimation of Camera Orientation and Vanishing Points from an Image Sequence in a Non-Manhattan World.",
            "CU-Net: Component Unmixing Network for Textile Fiber Identification.",
            "What Does 2D Geometric Information Really Tell Us About 3D Face Shape?",
            "Motion-Compensated Spatio-Temporal Filtering for Multi-Image and Multimodal Super-Resolution.",
            "Estimation of 3D Category-Specific Object Structure: Symmetry, Manhattan and/or Multiple Images.",
            "Learning Transparent Object Matting.",
            "Learning Human Pose Models from Synthesized Data for Robust RGB-D Action Recognition.",
            "Tensor Decomposition and Non-linear Manifold Modeling for 3D Head Pose Estimation.",
            "LCEval: Learned Composite Metric for Caption Evaluation.",
            "Special Issue on Machine Vision.",
            "Unsupervised Binary Representation Learning with Deep Variational Networks.",
            "Stochastic Quantization for Learning Accurate Low-Bit Deep Neural Networks.",
            "Slanted Stixels: A Way to Represent Steep Streets.",
            "End-to-End Learning of Latent Deformable Part-Based Representations for Object Detection.",
            "A Differential Approach to Shape from Polarisation: A Level-Set Characterisation.",
            "The Devil is in the Decoder: Classification, Regression and GANs.",
            "Reflectance and Shape Estimation with a Light Field Camera Under Natural Illumination.",
            "Understanding and Improving Kernel Local Descriptors.",
            "Cross-Domain Image Matching with Deep Feature Maps.",
            "Which is the Better Inpainted Image?Training Data Generation Without Any Manual Operations.",
            "You Said That?: Synthesising Talking Faces from Audio.",
            "Learning to Predict 3D Surfaces of Sculptures from Single and Multiple Views."
        ]
    },
    {
        "name": "IJCV",
        "year": "2018",
        "info": "2018: Volume\n126",
        "count": 77,
        "papers": [
            "Learning to Detect Good 3D Keypoints.",
            "Baseline and Triangulation Geometry in a Standard Plenoptic Camera.",
            "Graph-Based Slice-to-Volume Deformable Registration.",
            "Efficient Label Collection for Image Datasets via Hierarchical Clustering.",
            "Attentive Systems: A Survey.",
            "On the Beneficial Effect of Noise in Vertex Localization.",
            "Looking at People Special Issue.",
            "Deep Expectation of Real and Apparent Age from a Single Image Without Facial Landmarks.",
            "Real-Time Accurate 3D Head Tracking and Pose Estimation with Consumer RGB-D Cameras.",
            "Toward Personalized Modeling: Incremental and Ensemble Alignment for Sequential Faces in the Wild.",
            "A Comprehensive Performance Evaluation of Deformable Face Tracking \"In-the-Wild\".",
            "Large Scale 3D Morphable Models.",
            "Confidence-Weighted Local Expression Predictions for Occlusion Handling in Expression Recognition and Action Unit Detection.",
            "Unconstrained Still/Video-Based Face Verification with Deep Convolutional Neural Networks.",
            "Subjects and Their Objects: Localizing Interactees for a Person-Centric View of Importance.",
            "Space-Time Tree Ensemble for Action Recognition and Localization.",
            "Dynamic Behavior Analysis via Structured Rank Minimization.",
            "Prediction of Manipulation Actions.",
            "Every Moment Counts: Dense Detailed Labeling of Actions in Complex Videos.",
            "Transferring Deep Object and Scene Representations for Event Recognition in Still Images.",
            "Joint Estimation of Human Pose and Conversational Groups from Social Scenes.",
            "Beyond Temporal Pooling: Recurrence and Temporal Convolutions for Gesture Recognition in Video.",
            "Deep Multimodal Fusion: A Hybrid Approach.",
            "Appreciation to IJCV Reviewers of 2017.",
            "Dense Reconstruction of Transparent Objects by Altering Incident Light Paths Through Refraction.",
            "Do Semantic Parts Emerge in Convolutional Neural Networks?",
            "Classification of Multi-class Daily Human Motion using Discriminative Body Parts and Sentence Descriptions.",
            "Visual Tracking via Subspace Learning: A Discriminative Approach.",
            "No-Reference Image Quality Assessment for Image Auto-Denoising.",
            "From Facial Expression Recognition to Interpersonal Relation Prediction.",
            "Defining the Pose of Any 3D Rigid Object and an Associated Distance.",
            "Hallucinating Compressed Face Images.",
            "SDF-2-SDF Registration for Real-Time 3D Reconstruction from RGB-D Data.",
            "RAW Image Reconstruction Using a Self-contained sRGB-JPEG Image with Small Memory Overhead.",
            "Separable Anisotropic Diffusion.",
            "Discriminative Correlation Filter Tracker with Channel and Spatial Reliability.",
            "Label Propagation with Ensemble of Pairwise Geometric Relations: Towards Robust Large-Scale Retrieval of Object Instances.",
            "Predicting Foreground Object Ambiguity and Efficiently Crowdsourcing the Segmentation(s).",
            "Scale-Free Registrations in 3D: 7 Degrees of Freedom with Fourier Mellin SOFT Transforms.",
            "Hierarchical Cellular Automata for Visual Saliency.",
            "Adaptive Correlation Filters with Long-Term and Short-Term Memory for Object Tracking.",
            "Cluster Sparsity Field: An Internal Hyperspectral Imagery Prior for Reconstruction.",
            "Robust Detection and Affine Rectification of Planar Homogeneous Texture for Scene Understanding.",
            "Semi-supervised Region Metric Learning for Person Re-identification.",
            "Multi-label Learning with Missing Labels Using Mixed Dependency Graphs.",
            "Correction to: Lie-X: Depth Image Based Articulated Object Pose Estimation, Tracking, and Action Recognition on Lie Groups.",
            "The Reasonable Effectiveness of Synthetic Visual Data.",
            "Sim4CV: A Photo-Realistic Simulator for Computer Vision Applications.",
            "Configurable 3D Scene Synthesis and 2D Image Rendering with Per-pixel Ground Truth Using Stochastic Grammars.",
            "What Makes Good Synthetic Training Data for Learning Disparity and Optical Flow Estimation?",
            "Augmented Reality Meets Computer Vision: Efficient Data Generation for Urban Driving Scenes.",
            "Semantic Foggy Scene Understanding with Synthetic Data.",
            "Image-Based Synthesis for Deep 3D Human Pose Estimation.",
            "3D Interpreter Networks for Viewer-Centered Wireframe Modeling.",
            "Synthesizing a Scene-Specific Pedestrian Detector and Pose Estimator for Static Video Surveillance - Can We Learn Pedestrian Detectors and Pose Estimators Without Real Data?",
            "Virtual Training for a Real Application: Accurate Object-Robot Relative Localization Without Calibration.",
            "Editor's Note: Special Issue on Novel Representations and Learning Methods in Computer Vision.",
            "Focal Flow: Velocity and Depth from Differential Defocus Through Motion.",
            "Top-Down Neural Attention by Excitation Backprop.",
            "RED-Net: A Recurrent Encoder-Decoder Network for Video-Based Face Alignment.",
            "Learning Sight from Sound: Ambient Sound Provides Supervision for Visual Learning.",
            "Subspace Learning by ℓ0-Induced Sparsity.",
            "On Unifying Multi-view Self-Representations for Clustering by Tensor Multi-rank Minimization.",
            "Depth-Based Hand Pose Estimation: Methods, Data, and Challenges.",
            "Artistic Style Transfer for Videos and Spherical Images.",
            "Elastic Alignment of Triangular Surface Meshes.",
            "Joint Contour Filtering.",
            "Editorial: Special Issue on Machine Vision.",
            "Occlusion-Aware 3D Morphable Models and an Illumination Prior for Face Image Analysis.",
            "Person Re-identification in Identity Regression Space.",
            "Deep Sign: Enabling Robust Statistical Continuous Sign Language Recognition via Hybrid CNN-HMMs.",
            "Learning Latent Representations of 3D Human Pose with Deep Neural Networks.",
            "Combining Shape from Shading and Stereo: A Joint Variational Method for Estimating Depth, Illumination and Albedo.",
            "Feedback and Surround Modulated Boundary Detection.",
            "Real-Time Intensity-Image Reconstruction for Event Cameras Using Manifold Regularisation.",
            "EMVS: Event-Based Multi-View Stereo - 3D Reconstruction with an Event Camera in Real-Time.",
            "Describing Upper-Body Motions Based on Labanotation for Learning-from-Observation Robots."
        ]
    },
    {
        "name": "IJCV",
        "year": "2017",
        "info": "2017: Volumes\n121,\n122,\n123,\n124,\n125",
        "count": 104,
        "papers": [
            "Appreciation to IJCV Reviewers of 2016.",
            "Spatially Coherent Interpretations of Videos Using Pattern Theory.",
            "A Unified Framework for Compositional Fitting of Active Appearance Models.",
            "Learning a Distance Metric from Relative Comparisons between Quadruplets of Images.",
            "Hollywood 3D: What are the Best 3D Features for Action Recognition?",
            "Fast-Match: Fast Affine Template Matching.",
            "Image Annotation by Propagating Labels from Semantic Neighbourhoods.",
            "Convolutional Patch Representations for Image Retrieval: An Unsupervised Approach.",
            "A Discrete MRF Framework for Integrated Multi-Atlas Registration and Segmentation.",
            "Weighted Nuclear Norm Minimization and Its Applications to Low Level Vision.",
            "Minimal Basis Subspace Representation: A Unified Framework for Rigid and Non-rigid Motion Segmentation.",
            "MultiCol Bundle Adjustment: A Generic Method for Pose Estimation, Simultaneous Self-Calibration and Reconstruction for Arbitrary Multi-Camera Systems.",
            "Large-Scale Gaussian Process Inference with Generalized Histogram Intersection Kernels for Visual Recognition Tasks.",
            "A Portable Bio-Inspired Architecture for Efficient Robotic Vergence Control.",
            "Behavior Discovery and Alignment of Articulated Object Classes from Unstructured Video.",
            "Subspace Procrustes Analysis.",
            "Mining Mid-level Visual Patterns with Deep CNN Activations.",
            "GRMA: Generalized Range Move Algorithms for the Efficient Optimization of MRFs.",
            "2D Sub-pixel Point Spread Function Measurement Using a Virtual Point-Like Source.",
            "On the Existence of Epipolar Matrices.",
            "Refining Geometry from Depth Sensors using IR Shading Images.",
            "Fast Algorithms for Fitting Active Appearance Models to Unconstrained Images.",
            "Active Rectification of Curved Document Images Using Structured Beams.",
            "Generalizing the Prediction Sum of Squares Statistic and Formula, Application to Linear Fractional Image Warp and Surface Fitting.",
            "Semantic Decomposition and Recognition of Long and Complex Manipulation Action Sequences.",
            "Partially Camouflaged Object Tracking using Modified Probabilistic Neural Network and Fuzzy Energy based Active Contour.",
            "Maximum-Margin Structured Learning with Deep Networks for 3D Human Pose Estimation.",
            "Free-Hand Sketch Synthesis with Deformable Stroke Models.",
            "Guest Editorial: Machine Vision Applications.",
            "Domain Adaptation for Automatic OLED Panel Defect Detection Using Adaptive Support Vector Data Description.",
            "Automatic Sleep System Recommendation by Multi-modal RBG-Depth-Pressure Anthropometric Analysis.",
            "Adaptive Spatial-Spectral Dictionary Learning for Hyperspectral Image Restoration.",
            "A Practical and Highly Optimized Convolutional Neural Network for Classifying Traffic Signs in Real-Time.",
            "Robust Statistical Frontalization of Human and Animal Faces.",
            "Growing Regression Tree Forests by Classification for Continuous Object Pose Estimation.",
            "Multi-Camera Multi-Target Tracking with Space-Time-View Hyper-graph.",
            "Complex Activity Recognition Via Attribute Dynamics.",
            "Combining Local-Physical and Global-Statistical Models for Sequential Deformable Shape from Motion.",
            "3D Human Pose Tracking Priors using Geodesic Mixture Models.",
            "Recognition, Tracking, and Optimisation.",
            "Sketch-a-Net: A Deep Neural Network that Beats Humans.",
            "Deep Perceptual Mapping for Cross-Modal Face Recognition.",
            "Latent Structure Preserving Hashing.",
            "Global Minimum for a Finsler Elastica Minimal Path Approach.",
            "Learning Optimal Parameters for Multi-target Tracking with Contextual Interactions.",
            "Spatiotemporal Deformable Prototypes for Motion Anomaly Detection.",
            "Applying Detection Proposals to Visual Tracking for Scale and Aspect Ratio Adaptability.",
            "Automated Visual Fin Identification of Individual Great White Sharks.",
            "Guest Editorial: Image and Language Understanding.",
            "VQA: Visual Question Answering - www.visualqa.org.",
            "Visual Genome: Connecting Language and Vision Using Crowdsourced Dense Image Annotations.",
            "Flickr30k Entities: Collecting Region-to-Phrase Correspondences for Richer Image-to-Sentence Models.",
            "Movie Description.",
            "A Comprehensive and Versatile Camera Model for Cameras with Tilt Lenses.",
            "Markov Chain Monte Carlo for Automated Face Image Analysis.",
            "Particle-SfT: A Provably-Convergent, Fast Shape-from-Template Algorithm.",
            "Parametric Surface Representation with Bump Image for Dense 3D Modeling Using an RBG-D Camera.",
            "Towards Reversal-Invariant Image Representation.",
            "Salient Object Detection: A Discriminative Regional Feature Integration Approach.",
            "Generating Fluttering Patterns with Low Autocorrelation for Coded Exposure Imaging.",
            "Structured Learning of Binary Codes with Column Generation for Optimizing Ranking Measures.",
            "Transductive Zero-Shot Action Recognition by Word-Vector Embedding.",
            "Visual Object Detection Using Cascades of Binary and One-Class Classifiers.",
            "Max-Margin Heterogeneous Information Machine for RGB-D Action Recognition.",
            "A Branch-and-Bound Framework for Unsupervised Common Event Discovery.",
            "Exemplar-Guided Similarity Learning on Polynomial Kernel Feature Map for Person Re-identification.",
            "Directed Acyclic Graph Continuous Max-Flow Image Segmentation for Unconstrained Label Orderings.",
            "Iterative Multiplicative Filters for Data Labeling.",
            "Lie-X: Depth Image Based Articulated Object Pose Estimation, Tracking, and Action Recognition on Lie Groups.",
            "Empowering Simple Binary Classifiers for Image Set Based Face Recognition.",
            "Crowd Behavior Analysis via Curl and Divergence of Motion Trajectories.",
            "Editorial Note.",
            "A TV Prior for High-Quality Scalable Multi-View Stereo Reconstruction.",
            "Colour Helmholtz Stereopsis for Reconstruction of Dynamic Scenes with Arbitrary Unknown Reflectance.",
            "Trajectory-Based Place-Recognition for Efficient Large Scale Localization.",
            "Structure from Motion with Line Segments Under Relaxed Endpoint Constraints.",
            "Real-Time Tracking of Single and Multiple Objects from Depth-Colour Imagery Using 3D Signed Distance Functions.",
            "Multi-view Performance Capture of Surface Details.",
            "DeepProposals: Hunting Objects and Actions by Cascading Deep Convolutional Layers.",
            "LRA: Local Rigid Averaging of Stretchable Non-rigid Shapes.",
            "SDE: A Novel Selective, Discriminative and Equalizing Feature Representation for Visual Recognition.",
            "Salient Object Subitizing.",
            "Pose-Invariant Face Alignment via CNN-Based Dense 3D Model Fitting.",
            "Joint Image Denoising and Disparity Estimation via Stereo Structure PCA and Noise-Tolerant Cost.",
            "Auto-Calibrated Gaze Estimation Using Human Gaze Patterns.",
            "End-to-End Learning of Deep Visual Representations for Image Retrieval.",
            "Modeling Multi-object Configurations via Medial/Skeletal Linking Structures.",
            "A Closed-Form Focus Profile Model for Conventional Digital Cameras.",
            "Tubelets: Unsupervised Action Proposals from Spatiotemporal Super-Voxels.",
            "Sentence Directed Video Object Codiscovery.",
            "Discriminatively Learned Hierarchical Rank Pooling Networks.",
            "Zero-Shot Visual Recognition via Bidirectional Latent Embedding.",
            "The TPS Direct Transport: A New Method for Transporting Deformations in the Size-and-Shape Space.",
            "Uncovering the Temporal Context for Video Question Answering.",
            "Guest Editorial: Best Papers from ICCV 2015.",
            "Holistically-Nested Edge Detection.",
            "Mutual-Structure for Joint Filtering.",
            "Depth Sensing Using Geometrically Constrained Polarization Normals.",
            "3D Time-Lapse Reconstruction from Internet Photos.",
            "Automatic Registration of Images to Untextured Geometry Using Average Shading Gradients.",
            "Global, Dense Multiscale Reconstruction for a Billion Points.",
            "How Good Is My Test Data? Introducing Safety Analysis for Computer Vision.",
            "Ask Your Neurons: A Deep Learning Approach to Visual Question Answering.",
            "Learning Image Representations Tied to Egomotion from Unlabeled Video."
        ]
    },
    {
        "name": "IJCV",
        "year": "2016",
        "info": "2016: Volumes\n116,\n117,\n118,\n119,\n120",
        "count": 89,
        "papers": [
            "Reading Text in the Wild with Convolutional Neural Networks.",
            "Estimate Hand Poses Efficiently from Single Depth Images.",
            "When the a contrario approach becomes generative.",
            "A Comprehensive Performance Evaluation of 3D Local Feature Descriptors.",
            "Unsupervised Feature Learning for Dense Correspondences Across Scenes.",
            "A Bayesian Approach to Multi-view 4D Modeling.",
            "A Joint Gaussian Process Model for Active Visual Recognition with Expertise Estimation in Crowdsourcing.",
            "Geometry-Based Symbolic Approximation for Fast Sequence Matching on Manifolds.",
            "Ray Saliency: Bottom-Up Visual Saliency for a Rotating and Zooming Camera.",
            "Covariant Image Representation with Applications to Classification Problems in Medical Imaging.",
            "Guest Editorial: Large Scale Visual Media Geo-Localization.",
            "Image Based Geo-localization in the Alps.",
            "Geo-localization using Volumetric Representations of Overhead Imagery.",
            "Image Search with Selective Match Kernels: Aggregation Across Single and Multiple Images.",
            "Erratum to: Image Search with Selective Match Kernels: Aggregation Across Single and Multiple Images.",
            "Automatic Geolocation Correction of Satellite Imagery.",
            "Integrating Geometrical Context for Semantic Labeling of Indoor Scenes using RGBD Images.",
            "Multi-Cue Illumination Estimation via a Tree-Structured Group Joint Sparse Representation.",
            "Online Approximate Model Representation Based on Scale-Normalized and Fronto-Parallel Appearance.",
            "Hierarchical Geodesic Models in Diffeomorphisms.",
            "Visual Saliency Detection Using Group Lasso Regularization in Videos of Natural Scenes.",
            "Vanishing Point Estimation and Line Classification in a Manhattan World with a Unifying Camera Model.",
            "Local Variation as a Statistical Hypothesis Test.",
            "Data-Dependent Higher-Order Clique Selection for Artery-Vein Segmentation by Energy Minimization.",
            "A Logarithmic Image Prior for Blind Deconvolution.",
            "ROML: A Robust Feature Correspondence Approach for Matching Objects in A Set of Images.",
            "Midrange Geometric Interactions for Semantic Segmentation - Constraints for Continuous Multi-label Optimization.",
            "Complex Non-rigid 3D Shape Recovery Using a Procrustean Normal Distribution Mixture Model.",
            "Learning from Multiple Sources for Video Summarisation.",
            "Efficient Semidefinite Branch-and-Cut for MAP-MRF Inference.",
            "Learning Grammars for Architecture-Specific Facade Parsing.",
            "Caliber: Camera Localization and Calibration Using Rigidity Constraints.",
            "ATLAS: A Three-Layered Approach to Facade Parsing.",
            "Poselet-Based Contextual Rescoring for Human Pose Estimation via Pictorial Structures.",
            "Deep Filter Banks for Texture Recognition, Description, and Segmentation.",
            "2D-3D Pose Estimation of Heterogeneous Objects Using a Region Based Approach.",
            "Guest Editorial: Human Activity Understanding from 2D and 3D Data.",
            "Kernelized Multiview Projection for Robust Action Recognition.",
            "Exploiting Privileged Information from Web Data for Action and Event Recognition.",
            "Fusing ℝ Features and Local Features with Context-Aware Kernels for Action Recognition.",
            "Capturing Hands in Action Using Discriminative Salient Points and Physics Simulation.",
            "Gaze Estimation in the 3D Space Using RGB-D Sensors - Towards Head-Pose and User Invariance.",
            "Multi-modal RGB-Depth-Thermal Human Body Segmentation.",
            "A Hierarchical Video Description for Complex Activity Understanding.",
            "A Deep Structured Model with Radius-Margin Bound for 3D Human Activity Recognition.",
            "Cyclic Schemes for PDE-Based Image Analysis.",
            "Correctness Prediction, Accuracy Improvement and Generalization of Stereo Matching Using Supervised Learning.",
            "Learning and Calibrating Per-Location Classifiers for Visual Place Recognition.",
            "Similarity Fusion for Visual Tracking.",
            "Bounding Multiple Gaussians Uncertainty with Application to Object Tracking.",
            "Spectral Generalized Multi-dimensional Scaling.",
            "Guest Editorial: Big Data.",
            "SUN Database: Exploring a Large Collection of Scene Categories.",
            "Joint Inference in Weakly-Annotated Image Datasets via Dense Correspondence.",
            "Large Scale Retrieval and Generation of Image Descriptions.",
            "Sparse Output Coding for Scalable Visual Recognition.",
            "Do We Need More Training Data?",
            "Schwarps: Locally Projective Image Warps Based on 2D Schwarzian Derivatives.",
            "Robust Tracking via Locally Structured Representation.",
            "Visualizing Object Detection Features.",
            "Hierarchical Adaptive Structural SVM for Domain Adaptation.",
            "Linear Time Illumination Invariant Stereo Matching.",
            "Pictorial Human Spaces: A Computational Study on the Human Perception of 3D Articulated Poses.",
            "Guest Editorial: Video Recognition.",
            "A Robust and Efficient Video Representation for Action Recognition.",
            "EXMOVES: Mid-level Features for Efficient Action Recognition and Video Analysis.",
            "MoFAP: A Multi-level Representation for Action Recognition.",
            "LIBSVX: A Supervoxel Library and Benchmark for Early Video Processing.",
            "Circulant Temporal Encoding for Video Retrieval and Temporal Alignment.",
            "First-Person Activity Recognition: Feature, Temporal Structure, and Prediction.",
            "Learning Relevance Restricted Boltzmann Machine for Unstructured Group Activity and Event Understanding.",
            "Recognizing Fine-Grained and Composite Activities Using Hand-Centric Features and Script Data.",
            "Accurate Image Search with Multi-Scale Contextual Evidences.",
            "Learning Mutual Visibility Relationship for Pedestrian Detection with a Deep Model.",
            "Multiple Granularity Modeling: A Coarse-to-Fine Framework for Fine-grained Action Analysis.",
            "Measuring Visual Surprise Jointly from Intrinsic and Extrinsic Contexts for Image Saliency Estimation.",
            "Recognizing an Action Using Its Name: A Knowledge-Based Approach.",
            "Foveated Nonlocal Self-Similarity.",
            "Learning Dictionary of Discriminative Part Detectors for Image Categorization and Cosegmentation.",
            "Trinocular Geometry Revisited.",
            "Large-Scale Data for Multiple-View Stereopsis.",
            "Shape Retrieval of Non-rigid 3D Human Models.",
            "Convex Low Rank Approximation.",
            "Detection of Co-salient Objects by Looking Deep and Wide.",
            "Visualizing Deep Convolutional Neural Networks Using Natural Pre-images.",
            "Occlusion-Aware Stereo Matching.",
            "A Riemannian Bayesian Framework for Estimating Diffusion Tensor Images.",
            "DeepMatching: Hierarchical Deformable Dense Matching.",
            "Multiview Differential Geometry of Curves."
        ]
    },
    {
        "name": "IJCV",
        "year": "2015",
        "info": "2015: Volumes\n111,\n112,\n113,\n114,\n115",
        "count": 92,
        "papers": [
            "Affine Invariant Geometry for Non-rigid Shapes.",
            "Efficient Learning of Linear Predictors for Template Tracking.",
            "Personalized Graphical Models for Anatomical Landmark Localization in Whole-Body Medical Images.",
            "Learning Collective Crowd Behaviors with Dynamic Pedestrian-Agents.",
            "3DNN: 3D Nearest Neighbor.",
            "The Pascal Visual Object Classes Challenge: A Retrospective.",
            "An Elastic Deformation Field Model for Object Detection and Tracking.",
            "Learning Complementary Saliency Priors for Foreground Object Segmentation in Complex Scenes.",
            "Robust Visual Tracking Via Consistent Low-Rank Sparse Learning.",
            "Local Alignments for Fine-Grained Categorization.",
            "Locally Orderless Tracking.",
            "Pose Adaptive Motion Feature Pooling for Human Action Analysis.",
            "Confidence Sets for Fine-Grained Categorization and Plant Species Identification.",
            "Order Statistics of RANSAC and Their Practical Application.",
            "SEEDS: Superpixels Extracted Via Energy-Driven Sampling.",
            "Practical Matrix Completion and Corruption Recovery Using Proximal Alternating Robust Subspace Minimization.",
            "Mapping Appearance Descriptors on 3D Body Models for People Re-identification.",
            "Neither Global Nor Local: Regularized Patch-Based Representation for Single Sample Per Person Face Recognition.",
            "Combination of Piecewise-Geodesic Paths for Interactive Segmentation.",
            "Monocular Extraction of 2.1D Sketch Using Constrained Convex Optimization.",
            "Robust Temporally Coherent Laplacian Protrusion Segmentation of 3D Articulated Bodies.",
            "Utilizing Local Phase Information to Remove Rain from Video.",
            "Continuous Action Recognition Based on Sequence Alignment.",
            "Tractable Algorithms for Robust Model Estimation.",
            "Erratum to: Continuous Action Recognition Based on Sequence Alignment.",
            "Guest Editorial: Scene Understanding.",
            "Indoor Scene Understanding with RGB-D Images: Bottom-up Segmentation, Object Detection and Semantic Segmentation.",
            "Scene Parsing with Object Instance Inference Using Regions and Per-exemplar Detectors.",
            "Labeling Complete Surfaces in Scene Understanding.",
            "Towards Scene Understanding with Detailed 3D Object Representations.",
            "Indoor Scene Understanding with Geometric and Semantic Contexts.",
            "Scene Understanding by Reasoning Stability and Safety.",
            "Graph-Based Discriminative Learning for Location Recognition.",
            "Combinatorial Resampling Particle Filter: An Effective and Efficient Method for Articulated Object Tracking.",
            "Distances and Means of Direct Similarities.",
            "Constant Time Median and Bilateral Filtering.",
            "Sequential Monte Carlo for Maximum Weight Subgraphs with Application to Solving Image Jigsaw Puzzles.",
            "Efficient Focus Sampling Through Depth-of-Field Calibration.",
            "Rationalizing Efficient Compositional Image Alignment - The Constant Jacobian Gauss-Newton Optimization Algorithm.",
            "Guest Editorial: Deep Learning.",
            "Stacked Predictive Sparse Decomposition for Classification of Histology Sections.",
            "Heterogeneous Multi-task Learning for Human Pose Estimation with Deep Convolutional Neural Network.",
            "Discriminative Deep Face Shape Model for Facial Point Detection.",
            "Spiking Deep Convolutional Neural Networks for Energy-Efficient Object Recognition.",
            "A Neural Autoregressive Approach to Attention-based Recognition.",
            "An Incremental Procedure for the Lateral Calibration of a Time-of-Flight Camera by One Image of a Flat Surface.",
            "Shape Description and Matching Using Integral Invariants on Eccentricity Transformed Images.",
            "Multi-Class Active Learning by Uncertainty Sampling with Diversity Maximization.",
            "Towards 3D Face Recognition in the Real: A Registration-Free Approach Using Fine-Grained Matching of 3D Keypoint Descriptors.",
            "SPHORB: A Fast and Robust Binary Feature on the Sphere.",
            "Correspondence, Matching and Recognition.",
            "Metric Regression Forests for Correspondence Estimation.",
            "Relatively-Paired Space Analysis: Learning a Latent Common Space From Relatively-Paired Observations.",
            "Label Embedding: A Frugal Baseline for Text Recognition.",
            "A Spline-Based Trajectory Representation for Sensor Fusion and Rolling Shutter Cameras.",
            "Morphologically Invariant Matching of Structures with the Complete Rank Transform.",
            "Efficient Dense Rigid-Body Motion Segmentation and Estimation in RGB-D Video.",
            "Discovering Beautiful Attributes for Aesthetic Image Analysis.",
            "Lq-Closest-Point to Affine Subspaces Using the Generalized Weiszfeld Algorithm.",
            "Automatic Line Extraction in Uncalibrated Omnidirectional Cameras with Revolution Symmetry.",
            "Predicting Important Objects for Egocentric Video Summarization.",
            "Discovering Attribute Shades of Meaning with the Crowd.",
            "Change-Based Image Cropping with Exclusion and Compositional Features.",
            "Guest Editorial: Sparse Coding.",
            "Learning Sparse FRAME Models for Natural Image Patterns.",
            "Extrinsic Methods for Coding and Dictionary Learning on Grassmann Manifolds.",
            "Structured Overcomplete Sparsifying Transform Learning with Convergence Guarantees and Applications.",
            "Efficient Dictionary Learning with Sparseness-Enforcing Projections.",
            "Toward Fast Transform Learning.",
            "Image Restoration via Simultaneous Sparse Coding: Where Structured Sparsity Meets Gaussian Scale Mixture.",
            "A Bimodal Co-sparse Analysis Model for Image Processing.",
            "Image Deblurring with Coupled Dictionary Learning.",
            "Sparse Illumination Learning and Transfer for Single-Sample Face Recognition with Image Corruption and Misalignment.",
            "Generalized Dictionaries for Multiple Instance Learning.",
            "Dictionary Learning for Fast Classification Based on Soft-thresholding.",
            "Collaborative Linear Coding for Robust Image Classification.",
            "3D Scene Flow Estimation with a Piecewise Rigid Scene Model.",
            "Predicting Entry-Level Categories.",
            "Theory and Practice of Hierarchical Data-driven Descent for Optimal Deformation Estimation.",
            "Diffeomorphic Metric Landmark Mapping Using Stationary Velocity Field Parameterization.",
            "A Generalized Projective Reconstruction Theorem and Depth Constraints for Projective Factorization.",
            "3D Trajectory Reconstruction under Perspective Projection.",
            "DaLI: Deformation and Light Invariant Descriptor.",
            "A Comparative Study of Modern Inference Techniques for Structured Discrete Energy Minimization Problems.",
            "WhittleSearch: Interactive Image Search with Relative Attribute Feedback.",
            "ImageNet Large Scale Visual Recognition Challenge.",
            "Fast Approximations of Shift-Variant Blur.",
            "A Robust Tracking System for Low Frame Rate Video.",
            "Erratum to: A Robust Tracking System for Low Frame Rate Video.",
            "A 3D Scene Registration Method via Covariance Descriptors and an Evolutionary Stable Strategy Game Theory Solver - Fusing Photometric and Shape-Based Features.",
            "SuperCNN: A Superpixelwise Convolutional Neural Network for Salient Object Detection.",
            "Learning Good Regions to Deblur Images."
        ]
    },
    {
        "name": "IJCV",
        "year": "2014",
        "info": "2014: Volumes\n106,\n107,\n108,\n109,\n110",
        "count": 95,
        "papers": [
            "Appreciation to IJCV Reviewers.",
            "A Comprehensive Survey to Face Hallucination.",
            "Accurate Junction Detection and Characterization in Natural Images.",
            "Detecting parametric objects in large scenes by Monte Carlo sampling.",
            "Spline-Based Hybrid Image Registration using Landmark and Intensity Information based on Matrix-Valued Non-radial Basis Functions.",
            "Sampling Minimal Subsets with Large Spans for Robust Estimation.",
            "Erratum to: Learning Vocabularies over a Fine Quantization.",
            "A Quantitative Analysis of Current Practices in Optical Flow Estimation and the Principles Behind Them.",
            "Closed-Form Solution of Visual-Inertial Structure from Motion.",
            "A Wavelet Perspective on Variational Perceptually-Inspired Color Enhancement.",
            "A Super-Resolution Framework for High-Accuracy Multiview Reconstruction.",
            "Smoke Detection in Video: An Image Separation Approach.",
            "A Multi-View Embedding Space for Modeling Internet Images, Tags, and Their Semantics.",
            "Objects, Actions, Places.",
            "Object and Action Classification with Latent Window Parameters.",
            "Branch&Rank for Efficient Object Detection.",
            "Regressing Local to Global Shape Properties for Online Segmentation and Tracking.",
            "Detecting People Looking at Each Other in Videos.",
            "Generative Methods for Long-Term Place Recognition in Dynamic Scenes.",
            "Active Rare Class Discovery and Classification Using Dirichlet Processes.",
            "Demisting the Hough Transform for 3D Shape Recognition and Registration.",
            "Rotation-Invariant HOG Descriptors Using Fourier Analysis in Polar and Spherical Coordinates.",
            "Hough Pyramid Matching: Speeded-Up Geometry Re-ranking for Large Scale Image Retrieval.",
            "Object Bank: An Object-Level Image Representation for High-Level Visual Recognition.",
            "Probabilistic Joint Image Segmentation and Labeling by Figure-Ground Composition.",
            "Anisotropy Preserving DTI Processing.",
            "A Klein-Bottle-Based Dictionary for Texture Representation.",
            "Guest Editorial: Geometry, Lighting, Motion, and Learning.",
            "A Simple Prior-Free Method for Non-rigid Structure-from-Motion Factorization.",
            "Decomposing Global Light Transport Using Time of Flight Imaging.",
            "A Closed-Form, Consistent and Robust Solution to Uncalibrated Photometric Stereo Via Local Diffuse Reflectance Maxima.",
            "The Shape Boltzmann Machine: A Strong Model of Object Shape.",
            "Face Alignment by Explicit Shape Regression.",
            "Max-Margin Early Event Detectors.",
            "Multi-Target Tracking by Online Learning a CRF Model of Appearance and Motion Patterns.",
            "Activity representation with motion hierarchies.",
            "Visual Saliency with Statistical Priors.",
            "Spectral Log-Demons: Diffeomorphic Image Registration with Very Large Deformations.",
            "Shape from Sharp and Motion-Blurred Image Pair.",
            "Visual Focus of Attention in Non-calibrated Environments using Gaze Estimation.",
            "Editorial: Special Issue on Active and Interactive Methods in Computer Vision.",
            "The Ignorant Led by the Blind: A Hybrid Human-Machine Vision System for Fine-Grained Categorization.",
            "Putting the User in the Loop for Image-Based Modeling.",
            "An Interactive Approach to Solving Correspondence Problems.",
            "The SUN Attribute Database: Beyond Categories for Deeper Scene Understanding.",
            "Part and Attribute Discovery from Relative Annotations.",
            "Large-Scale Live Active Learning: Training Object Detectors with Crawled Data and Crowds.",
            "Iterative Category Discovery via Multiple Kernel Metric Learning.",
            "Active Image Clustering with Pairwise Constraints from Humans.",
            "Collaborative Personalization of Image Enhancement.",
            "A New Approach to Two-View Motion Segmentation Using Global Dimension Minimization.",
            "Mining Mid-level Features for Image Classification.",
            "Unstructured Light Scanning Robust to Indirect Illumination and Depth Discontinuities.",
            "Understanding, Optimising, and Extending Data Compression with Anisotropic Diffusion.",
            "A Shape Reconstructability Measure of Object Part Importance with Applications to Object Detection and Localization.",
            "Erratum to: Interesting Interest Points - A Comparative Study of Interest Point Performance on a Unique Data Set.",
            "Guest Editor's Introduction to the Special Issue on Domain Adaptation for Vision Applications.",
            "Learning Kernels for Unsupervised Domain Adaptation with Applications to Visual Object Recognition.",
            "Asymmetric and Category Invariant Feature Transformations for Domain Adaptation.",
            "Weakly-Supervised Cross-Domain Dictionary Learning for Visual Recognition.",
            "Harnessing Lab Knowledge for Real-World Action Recognition.",
            "Generalized Transfer Subspace Learning Through Low-Rank Constraint.",
            "Domain Adaptation for Face Recognition: Targetize Source Domain Bridged by Common Subspace.",
            "Model-Driven Domain Adaptation on Product Manifolds for Unconstrained Face Recognition.",
            "Domain Adaptation for Structured Regression.",
            "Exploring Transfer Learning Approaches for Head Pose Classification from Multi-view Surveillance Images.",
            "Graph Matching by Simplified Convex-Concave Relaxation Procedure.",
            "SymStereo: Stereo Matching using Induced Symmetry.",
            "Sparse Representation Based Fisher Discrimination Dictionary Learning for Image Classification.",
            "Reduced Analytic Dependency Modeling: Robust Fusion for Visual Recognition.",
            "Infinitesimal Plane-Based Pose Estimation.",
            "Guest Editorial: Tracking, Detection and Segmentation.",
            "PMBP: PatchMatch Belief Propagation for Correspondence Field Estimation.",
            "Mixture of Trees Probabilistic Graphical Model for Video Segmentation.",
            "Learning Discriminative Space-Time Action Parts from Weakly Labelled Videos.",
            "Using Bounded Diameter Minimum Spanning Trees to Build Dense Active Appearance Models.",
            "Detection and Tracking of Occluded People.",
            "Automatic and Efficient Human Pose Estimation for Sign Language Videos.",
            "Editorial note.",
            "Accidental Pinhole and Pinspeck Cameras - Revealing the Scene Outside the Picture.",
            "Computational Schlieren Photography with Light Field Probes.",
            "Ultra-fast Lensless Computational Imaging through 5D Frequency Analysis of Time-resolved Light Transport.",
            "Acquisition of High Spatial and Spectral Resolution Video with a Hybrid Camera System.",
            "Rainbow Flash Camera: Depth Edge Extraction Using Complementary Colors.",
            "Fast Spectral Reflectance Recovery Using DLP Projector.",
            "Deblurring Shaken and Partially Saturated Images.",
            "Exposing Region Splicing Forgeries with Blind Local Noise Estimation.",
            "Contrast Preserving Decolorization with Perception-Based Quality Metrics.",
            "Special Issue on Large-Scale Computer Vision: Geometry, Inference, and Learning.",
            "Reconstructing the World's Museums.",
            "People Watching: Human Actions as a Cue for Single View Geometry.",
            "Photo Sequencing.",
            "Filter-Based Mean-Field Inference for Random Fields with Higher-Order Terms and Product Label-Spaces.",
            "Low-Rank Bilinear Classification: Efficient Convex Optimization and Extensions.",
            "ImageNet Auto-Annotation with Segmentation Propagation."
        ]
    },
    {
        "name": "IJCV",
        "year": "2013",
        "info": "2013: Volumes\n101,\n102,\n103,\n104,\n105",
        "count": 95,
        "papers": [
            "Appreciation to IJCV Reviewers.",
            "Multi-view Scene Flow Estimation: A View Centered Variational Approach.",
            "Beyond Independence: An Extension of the A Contrario Decision Procedure.",
            "Quasi-Parallax for Nearly Parallel Frontal Eyes - A Possible Role of Binocular Overlap During Rapid Locomotion.",
            "Shape and Refractive Index from Single-View Spectro-Polarimetric Images.",
            "A Computational Learning Theory of Active Object Recognition Under Uncertainty.",
            "Object-Colour Manifold.",
            "Sparse Adaptive Parameterization of Variability in Image Ensembles.",
            "Efficiently Scaling up Crowdsourced Video Annotation - A Set of Best Practices for High Quality, Economical Video Labeling.",
            "Modeling Coverage in Camera Networks: A Survey.",
            "Stratified Generalized Procrustes Analysis.",
            "A Linear Optimal Transportation Framework for Quantifying and Visualizing Variations in Sets of Images.",
            "A Two-Layer Framework for Piecewise Linear Manifold-Based Head Pose Estimation.",
            "Verifying Global Minima for L 2 Minimization Problems in Multiple View Geometry.",
            "Recognizing Interactive Group Activities Using Temporal Interaction Matrices and Their Riemannian Statistics.",
            "Superparsing - Scalable Nonparametric Image Parsing with Superpixels.",
            "Shadow Casting Out Of Plane (SCOOP) Candidates for Human and Vehicle Detection in Aerial Imagery.",
            "Robust Visual Tracking via Structured Multi-Task Sparse Learning.",
            "On Plenoptic Multiplexing and Reconstruction.",
            "Guest Editorial: Human-Computer Interaction: Real-Time Vision Aspects of Natural User Interfaces.",
            "Attention Based Detection and Recognition of Hand Postures Against Complex Backgrounds.",
            "Exploring the Trade-off Between Accuracy and Observational Latency in Action Recognition.",
            "Random Forests for Real Time 3D Face Analysis.",
            "Improving Head Movement Tolerance of Cross-Ratio Based Eye Trackers.",
            "Using Segmented 3D Point Clouds for Accurate Likelihood Approximation in Human Pose Tracking.",
            "Euler Principal Component Analysis.",
            "Virtual Volumetric Graphics on Commodity Displays Using 3D Viewer Tracking.",
            "Guest Editorial: 3D Imaging, Processing and Modelling.",
            "Depth from Refraction Using a Transparent Medium with Unknown Pose and Refractive Index.",
            "A 3D Imaging Framework Based on High-Resolution Photometric-Stereo and Low-Resolution Depth.",
            "A Practical Approach to 3D Scanning in the Presence of Interreflections, Subsurface Scattering and Defocus.",
            "GD&T-Based Characterization of Short-Range Non-contact 3D Imaging Systems.",
            "A Theory of Minimal 3D Point to 3D Plane Registration and Its Generalization.",
            "Fully Automatic Registration of Image Sets on Approximate Geometry.",
            "Online Detection of Repeated Structures in Point Clouds of Urban Scenes for Compression and Registration.",
            "A Scale Independent Selection Process for 3D Object Recognition in Cluttered Scenes.",
            "A Machine-Learning Approach to Keypoint Detection and Landmarking on 3D Meshes.",
            "A Performance Evaluation of Volumetric 3D Interest Point Detectors.",
            "Performance Evaluation of 3D Keypoint Detectors.",
            "Feature-Preserved 3D Canonical Form.",
            "Direct Model-Based Tracking of 3D Object Deformations in Depth and Color Video.",
            "Global Non-rigid Alignment of Surface Sequences.",
            "Consistent Binocular Depth and Scene Flow with Chained Temporal Profiles.",
            "Depth Mapping for Stereoscopic Videos.",
            "Structure-Sensitive Superpixels via Geodesic Distance.",
            "Toward a Comprehensive Framework for the Spatiotemporal Statistical Analysis of Longitudinal Shape Data.",
            "Dense Trajectories and Motion Boundary Descriptors for Action Recognition.",
            "Divergence-Free Wavelets and High Order Regularization.",
            "A Sequential Topic Model for Mining Recurrent Activities from Long Term Video Logs.",
            "A Variational Model for Gradient-Based Video Editing.",
            "Learning Vocabularies over a Fine Quantization.",
            "Novel Representations, Methods, and Algorithms in Computer Vision.",
            "Error-Tolerant Image Compositing.",
            "Ambrosio-Tortorelli Segmentation of Stochastic Images: Model Extensions, Theoretical Investigations and Numerical Methods.",
            "Inference Methods for CRFs with Co-occurrence Statistics.",
            "Adaptive Non-rigid Registration and Structure from Motion from Image Trajectories.",
            "Multilinear Factorizations for Multi-Camera Rigid Structure from Motion Problems.",
            "Rotation Averaging.",
            "Exhaustive and Efficient Constraint Propagation: A Graph-Based Learning Approach and Its Applications.",
            "Training Effective Node Classifiers for Cascade Classification.",
            "Recognizing Materials Using Perceptually Inspired Features.",
            "Self-Calibration Under the Cayley Framework.",
            "Linearized Alternating Direction Method with Adaptive Penalty and Warm Starts for Fast Solving Transform Invariant Low-Rank Textures.",
            "SLEDGE: Sequential Labeling of Image Edges for Boundary Detection.",
            "Recovering Relative Depth from Low-Level Features Without Explicit T-junction Detection and Interpretation.",
            "Coupling Image Restoration and Segmentation: A Generalized Linear Model/Bregman Perspective.",
            "3D Scene Reconstruction from Multiple Spherical Stereo Pairs.",
            "Multiscale Symmetric Part Detection and Grouping.",
            "Scale and Object Aware Image Thumbnailing.",
            "Selective Search for Object Recognition.",
            "SIFER: Scale-Invariant Feature Detector with Error Resilience.",
            "Multiframe Many-Many Point Correspondence for Vehicle Tracking in High Density Wide Area Aerial Videos.",
            "Guest Editorial: Energy Optimization Methods.",
            "A Survey and Comparison of Discrete and Continuous Multi-label Optimization Approaches for the Potts Model.",
            "Discrete and Continuous Models for Partitioning Problems.",
            "Combinatorial Optimization of the Discretized Multiphase Mumford-Shah Functional.",
            "A Variational Approach to Video Registration with Subspace Constraints.",
            "A Distributed Mincut/Maxflow Algorithm Combining Path Augmentation and Push-Relabel.",
            "Optimization of Robust Loss Functions for Weakly-Labeled Image Taxonomies.",
            "Categorization of Multiple Objects in a Scene Using a Biased Sampling Strategy.",
            "Dynamic Template Tracking and Recognition.",
            "The \"shading twist, \" a dynamical shape cue.",
            "Rotational Projection Statistics for 3D Local Surface Description and Object Recognition.",
            "Passive Three Dimensional Face Recognition Using Iso-Geodesic Contours and Procrustes Analysis.",
            "Mathematical Methods for Medical Imaging.",
            "Geodesics, Parallel Transport & One-Parameter Subgroups for Diffeomorphic Image Registration.",
            "Flexible Shape Matching with Finite Element Based LDDMM.",
            "Geodesic Warps by Conformal Mappings.",
            "Teichmüller Shape Descriptor and Its Application to Alzheimer's Disease Study.",
            "Geodesic Regression and the Theory of Least Squares on Riemannian Manifolds.",
            "Camera Spectral Sensitivity and White Balance Estimation from Sky Images.",
            "Coloring Action Recognition in Still Images.",
            "Image Classification with the Fisher Vector: Theory and Practice.",
            "An Improved Hierarchical Dirichlet Process-Hidden Markov Model and Its Application to Trajectory Modeling and Retrieval.",
            "Variational Recursive Joint Estimation of Dense Scene Structure and Camera Motion from Monocular High Speed Traffic Sequences."
        ]
    },
    {
        "name": "IJCV",
        "year": "2012",
        "info": "2012: Volumes\n96, 97, 98, 99, 100",
        "count": 94,
        "papers": [
            "Fast Approximate Energy Minimization with Label Costs.",
            "Unsupervised Learning for Graph Matching.",
            "The Visual Extent of an Object - Suppose We Know the Object Locations.",
            "Face Recognition from Caption-Based Supervision.",
            "Harmony Potentials - Fusing Global and Local Scale for Semantic Image Segmentation.",
            "Multi-view 3D Human Pose Estimation in Complex Environment.",
            "Exploiting DLP Illumination Dithering for Reconstruction and Photography of High-Speed Scenes.",
            "Simultaneous Camera Pose and Correspondence Estimation with Motion Coherence.",
            "Planar Motion Estimation and Linear Ground Plane Rectification using an Uncalibrated Generic Camera.",
            "The Non-parametric Sub-pixel Local Point Spread Function Estimation Is a Well Posed Problem.",
            "Radial Multi-focal Tensors - Applications to Omnidirectional Camera Calibration.",
            "Dense versus Sparse Approaches for Estimating the Fundamental Matrix.",
            "From the Rendering Equation to Stratified Light Transport Inversion.",
            "Optimal Metric Projections for Deformable and Articulated Structure-from-Motion.",
            "Introduction to the Special Issue on Mobile Vision.",
            "Real-Time Facial Feature Tracking on a Mobile Device.",
            "Location Discriminative Vocabulary Coding for Mobile Landmark Search.",
            "Leveraging 3D City Models for Rotation Invariant Place-of-Interest Recognition.",
            "Efficient Video Rectification and Stabilisation for Cell-Phones.",
            "OSCAR: On-Site Composition and Aesthetics Feedback Through Exemplars for Photographers.",
            "Compressed Histogram of Gradients: A Low-Bitrate Descriptor.",
            "Editorial for the Special Issue on 3D Data Processing, Visualization and Transmission.",
            "Physical Scale Keypoints: Matching and Registration for Combined Intensity/Range Images.",
            "Interesting Interest Points - A Comparative Study of Interest Point Performance on a Unique Data Set.",
            "Imposing Semi-Local Geometric Constraints for Accurate Correspondences Selection in Structure from Motion: A Game-Theoretic Perspective.",
            "Feature-Based Deformable Surface Detection with Self-Occlusion Reasoning.",
            "On Camera Calibration with Linear Programming and Loop Constraint Linearization.",
            "Self-calibrated, Multi-spectral Photometric Stereo for 3D Face Capture.",
            "Automatic Real-Time Video Matting Using Time-of-Flight Camera and Multichannel Poisson Equations.",
            "Energy-Based Geometric Multi-model Fitting.",
            "c-Velocity: A Flow-Cumulating Uncalibrated Approach for 3D Plane Detection.",
            "Towards Unrestrained Depth Inference with Coherent Occlusion Filling.",
            "Accurate Object Recognition with Shape Masks.",
            "Pre-organizing Shape Instances for Landmark-Based Shape Correspondence.",
            "Diffeomorphic 3D Image Registration via Geodesic Shooting Using an Efficient Adjoint Calculation.",
            "Viewpoint Selection for Human Actions.",
            "Intrackability: Characterizing Video Statistics and Pursuing Video Representations.",
            "Learning Behavioural Context.",
            "Geometric Image Parsing in Man-Made Environments.",
            "Sparse Occlusion Detection with Optical Flow.",
            "Impact of Landmark Parametrization on Monocular EKF-SLAM with Points and Lines.",
            "Multi-label Moves for MRFs with Truncated Convex Priors.",
            "Loose-limbed People: Estimating 3D Human Pose and Motion Using Non-parametric Belief Propagation.",
            "Modulating Shape Features by Color Attention for Object Recognition.",
            "Dense Neighborhoods on Affinity Graph.",
            "Explaining Activities as Consistent Groups of Events - A Bayesian Framework Using Attribute Multiset Grammars.",
            "Completely Convex Formulation of the Chan-Vese Image Segmentation Model.",
            "Estimating the Natural Illumination Conditions from a Single Outdoor Image.",
            "A Combined Theory of Defocused Illumination and Global Light Transport.",
            "Non-uniform Deblurring for Shaken Images.",
            "Rotation Invariant Curvelet Features for Region Based Image Retrieval.",
            "Egomotion Estimation Using Assorted Features.",
            "Scale Invariant Feature Transform on the Sphere: Theory and Applications.",
            "Object Recognition by Sequential Figure-Ground Ranking.",
            "Bayesian Defogging.",
            "Globally Optimal Estimation of Nonrigid Image Distortion.",
            "Video Behaviour Mining Using a Dynamic Topic Model.",
            "What Are You Looking at? - Improving Visual Gaze Estimation by Saliency.",
            "PWP3D: Real-Time Segmentation and Tracking of 3D Objects.",
            "TILT: Transform Invariant Low-Rank Textures.",
            "Fast Human Pose Detection Using Randomized Hierarchical Cascades of Rejectors.",
            "A Linear Framework for Region-Based Image Segmentation and Inpainting Involving Curvature Penalization.",
            "Creating Large-Scale City Models from 3D-Point Clouds: A Robust Approach with Hybrid Representation.",
            "How to Compare Noisy Patches? Patch Similarity Beyond Gaussian Noise.",
            "A Reparameterisation Based Approach to Geodesic Constrained Solvers for Curve Matching.",
            "Shape-Based Object Detection via Boundary Structure Segmentation.",
            "A Fisher-Rao Metric for Paracatadioptric Images of Lines.",
            "A Self-Training Approach for Visual Tracking and Recognition of Complex Human Activity Patterns.",
            "2D Articulated Human Pose Estimation and Retrieval in (Almost) Unconstrained Still Images.",
            "Embedded Voxel Colouring with Adaptive Threshold Selection Using Globally Minimal Surfaces.",
            "3D Geometric Scale Variability in Range Images: Features and Descriptors.",
            "Guest Editorial: Special Issue on Structured Prediction and Inference.",
            "Discriminative Appearance Models for Pictorial Structures.",
            "On Taxonomies for Multi-class Image Categorization.",
            "Fast Structured Prediction Using Large Margin Sigmoid Belief Networks.",
            "On Learning Conditional Random Fields for Stereo - Exploring Model Structures and Approximate Inference.",
            "Sparse Modeling of Human Actions from Motion Imagery.",
            "Coupled Action Recognition and Pose Estimation from Multiple Views.",
            "Minimizing Energies with Hierarchical Costs.",
            "Improving Image Classification Using Semantic Attributes.",
            "Keypoints and Local Descriptors of Scalar Functions on 2D Manifolds.",
            "Optimal Image and Video Closure by Superpixel Grouping.",
            "Guest Editorial: Scenes, Images and Objects.",
            "Joint Optimization for Object Class Segmentation and Dense Stereo Reconstruction.",
            "Learning the Relative Importance of Objects from Tagged Images for Retrieval and Cross-Modal Search.",
            "Object Detection using Geometrical Context Feedback.",
            "On Using Anisotropic Diffusion for Skeleton Extraction.",
            "Motion Coherent Tracking Using Multi-label MRF Optimization.",
            "Making a Shallow Network Deep: Conversion of a Boosting Classifier into a Decision Tree by Boolean Optimisation.",
            "Hybrid Linear Modeling via Local Best-Fit Flats.",
            "Stel Component Analysis: Joint Segmentation, Modeling and Recognition of Objects Classes.",
            "User-Centric Learning and Evaluation of Interactive Segmentation Systems.",
            "Weakly Supervised Localization and Learning with Generic Knowledge.",
            "Boosting k-NN for Categorization of Natural Scenes."
        ]
    },
    {
        "name": "IJCV",
        "year": "2011",
        "info": "2011: Volumes\n91, 92, 93, 94, 95",
        "count": 95,
        "papers": [
            "Robust Gait Recognition by Learning and Exploiting Sub-gait Characteristics.",
            "Cost-Sensitive Active Visual Category Learning.",
            "Multi-Camera Tracking with Adaptive Resource Allocation.",
            "Measuring and Predicting Object Importance.",
            "Efficient Suboptimal Solutions to the Optimal Triangulation.",
            "Learning Real-Time Perspective Patch Rectification.",
            "Generic Self-calibration of Central Cameras from Two Rotational Flows.",
            "Plane-Based Calibration for Linear Cameras.",
            "Omnidirectional Image Stabilization for Visual Object Recognition.",
            "A Generic Error Model and Its Application to Automatic 3D Modeling of Scenes Using a Catadioptric Camera.",
            "Deformable Model Fitting by Regularized Landmark Mean-Shift.",
            "Incremental Linear Discriminant Analysis Using Sufficient Spanning Sets and Its Applications.",
            "A Quaternion Framework for Color Image Smoothing and Segmentation.",
            "The Canny Edge Detector Revisited.",
            "ROSy+: 3D Object Pose Normalization Based on PCA and Reflective Object Symmetry with Application in 3D Object Retrieval.",
            "Variable-Source Shading Analysis.",
            "Incremental Tensor Subspace Learning and Its Applications to Foreground Segmentation and Tracking.",
            "Recovering Occlusion Boundaries from an Image.",
            "A Database and Evaluation Methodology for Optical Flow.",
            "Model-Based Multiple Rigid Object Detection and Registration in Unstructured Range Data.",
            "A Local Algorithm for the Computation of Image Velocity via Constructive Interference of Global Fourier Components.",
            "Digital Image Forgery Detection Based on Lens and Sensor Aberration.",
            "iLogDemons: A Demons-Based Registration Algorithm for Tracking Incompressible Elastic Biological Tissues.",
            "Global Minimization for Continuous Multiphase Partitioning Problems Using a Dual Approach.",
            "Highly Accurate Schemes for PDE-Based Morphology with General Convex Structuring Elements.",
            "Adaptive Continuous-Scale Morphology for Matrix Fields.",
            "Partial Differential Equations for Zooming, Deinterlacing and Dejittering.",
            "An Anisotropic Fourth-Order Diffusion Filter for Image Noise Removal.",
            "Tubular Structure Segmentation Based on Minimal Path Method and Anisotropic Enhancement.",
            "Primal and Dual Bregman Methods with Application to Optical Nanoscopy.",
            "Left-Invariant Diffusions on the Space of Positions and Orientations and their Application to Crossing-Preserving Smoothing of HARDI images.",
            "Operator Splittings, Bregman Methods and Frame Shrinkage in Image Processing.",
            "An Elasticity-Based Covariance Analysis of Shapes.",
            "A Multi-Scale Vectorial Lτ-TV Framework for Color Image Restoration.",
            "Orientation-Matching Minimization for Image Denoising and Inpainting.",
            "Finsler Geometry on Higher Order Tensor Fields and Applications to High Angular Resolution Diffusion Imaging.",
            "Max Margin Learning of Hierarchical Configural Deformable Templates (HCDTs) for Efficient Object Parsing and Pose Estimation.",
            "Human Action Segmentation and Recognition Using Discriminative Semi-Markov Models.",
            "Feature-Driven Direct Non-Rigid Image Registration.",
            "Coded Aperture Pairs for Depth from Defocus and Defocus Deblurring.",
            "Joint Multi-Layer Segmentation and Reconstruction for Free-Viewpoint Video Applications.",
            "Calibration of Central Catadioptric Cameras Using a DLT-Like Approach.",
            "Editorial.",
            "Context, Computation, and Optimal ROC Performance in Hierarchical Models.",
            "Predicate Logic Based Image Grammars for Complex Pattern Recognition.",
            "Mining Layered Grammar Rules for Action Recognition.",
            "Stochastic Representation and Recognition of High-Level Group Activities.",
            "Inference and Learning with Hierarchical Shape Models.",
            "A Numerical Study of the Bottom-Up and Top-Down Inference Processes in And-Or Graphs.",
            "Random Exploration of the Procedural Space for Single-View 3D Modeling of Buildings.",
            "Interactively Co-segmentating Topically Related Images with Intelligent Scribble Guidance.",
            "A Continuum Mechanical Approach to Geodesics in Shape Space.",
            "A Variational Framework for Exemplar-Based Image Inpainting.",
            "Rain or Snow Detection in Image Sequences Through Use of a Histogram of Orientation of Streaks.",
            "Optic Flow in Harmony.",
            "Fast and Accurate 3D Face Recognition - Using Registration to an Intrinsic Coordinate System and Fusion of Multiple Region Classifiers.",
            "Image Guided Reconstruction of Un-sampled Data: A Filling Technique for Cultural Heritage Models.",
            "Image-Based Network Rendering of Large Meshes for Cloud Computing.",
            "3D Line Drawing for Archaeological Illustration.",
            "Capturing Village-level Heritages with a Hand-held Camera-Laser Fusion Sensor.",
            "Lightness Recovery for Pictorial Surfaces.",
            "3D Archive System for Traditional Performing Arts - Application of 3D Reconstruction Method Using Graph-cuts.",
            "Prominent Field for Shape Processing and Analysis of Archaeological Artifacts.",
            "Analyzing Ancient Maya Glyph Collections with Contextual Shape Descriptors.",
            "Identifying Join Candidates in the Cairo Genizah.",
            "Near-Infrared Ink Differentiation in Medieval Manuscripts.",
            "Coding Images with Local Features.",
            "Fast PRISM: Branch and Bound Hough Transform for Object Class Detection.",
            "RSLAM: A System for Large-Scale Mapping in Constant-Time Using Stereo.",
            "Skeleton Search: Category-Specific Object Recognition and Segmentation Using a Skeletal Shape Model.",
            "Binary Histogrammed Intensity Patches for Efficient and Robust Matching.",
            "Coding of Image Feature Descriptors for Distributed Rate-efficient Visual Correspondences.",
            "The Key to Three-View Geometry.",
            "Simultaneous Motion Detection and Background Reconstruction with a Conditional Mixed-State Markov Random Field.",
            "Predicting Articulated Human Motion from Spatial Processes.",
            "Evaluation of Interest Point Detectors and Feature Descriptors for Visual Tracking.",
            "Line Localization from Single Catadioptric Images.",
            "Erratum to: Robust Pose Recognition of the Obscured Human Body.",
            "Discriminative Models for Multi-Class Object Layout.",
            "Looking Around the Corner using Ultrafast Transient Imaging.",
            "Stereoscopic Scene Flow Computation for 3D Motion Understanding.",
            "Efficient Detection and Recognition of 3D Ears.",
            "1-Point-RANSAC Structure from Motion for Vehicle-Mounted Cameras by Exploiting Non-holonomic Constraints.",
            "Segmentation of Natural Images by Texture and Boundary Compression.",
            "Gradient Flows for Optimizing Triangular Mesh-based Surfaces: Applications to 3D Reconstruction Problems Dealing with Visibility.",
            "Monocular Template-based Reconstruction of Inextensible Surfaces.",
            "Geometric Latent Dirichlet Allocation on a Matching Graph for Large-scale Image Datasets.",
            "Linear Regression and Adaptive Appearance Models for Fast Simultaneous Modelling and Tracking.",
            "Upper Body Detection and Tracking in Extended Signing Sequences.",
            "An Efficient Approach to Semantic Segmentation.",
            "Modeling and Recognition of Landmark Image Collections Using Iconic Scene Graphs.",
            "Recovery and Reasoning About Occlusions in 3D Using Few Cameras with Applications to 3D Tracking.",
            "Geodesics on the Manifold of Multivariate Generalized Gaussian Distributions with an Application to Multicomponent Texture Discrimination.",
            "Trajectory Analysis and Semantic Region Modeling Using Nonparametric Hierarchical Bayesian Models.",
            "Special Issue on Probabilistic Models for Image Understanding, Part II."
        ]
    },
    {
        "name": "IJCV",
        "year": "2010",
        "info": "2010: Volumes\n86, 87, 88, 89, 90",
        "count": 103,
        "papers": [
            "From Local Kernel to Nonlocal Multiple-Model Image Denoising.",
            "Global Intensity Correction in Dynamic Scenes.",
            "General Geometric Good Continuation: From Taylor to Laplace via Level Sets.",
            "Implicit Moment Invariants.",
            "When Discrete Meets Differential.",
            "Group-Wise Point-Set Registration Using a Novel CDF-Based Havrda-Charvát Divergence.",
            "Editorial for the Special Issue on Photometric Analysis for Computer Vision.",
            "Generalized Gamut Mapping using Image Derivative Structures for Color Constancy.",
            "Multi-Spectral Imaging by Optimized Wide Band Illumination.",
            "Estimating Facial Reflectance Properties Using Shape-from-Shading.",
            "Wavelet-Texture Method: Appearance Compression by Polarization, Parametric Reflection Model, and Daubechies Wavelet.",
            "Joint Estimation of Shape and Reflectance using Multiple Images with Known Illumination Conditions.",
            "A Multi-Image Shape-from-Shading Framework for Near-Lighting Perspective Endoscopes.",
            "Median Photometric Stereo as Applied to the Segonko Tumulus and Museum Objects.",
            "On the Apparent Transparency of a Motion Blurred Object.",
            "Analysis of Rain and Snow in Frequency Space.",
            "Guest Editorial: State of the Art in Image- and Video-Based Human Pose and Motion Estimation.",
            "HumanEva: Synchronized Video and Motion Capture Dataset and Baseline Algorithm for Evaluation of Articulated Human Motion.",
            "Twin Gaussian Processes for Structured Prediction.",
            "A Study on Smoothing for Particle-Filtered 3D Human Body Tracking.",
            "Optimization and Filtering for Human Motion Capture.",
            "A Study of Parts-Based Object Class Detection Using Complete Graphs.",
            "Coupled Visual and Kinematic Manifold Models for Tracking.",
            "Physics-Based Person Tracking Using the Anthropomorphic Walker.",
            "Markerless Motion Capture through Visual Hull, Articulated ICP and Subject Specific Model Generation.",
            "3D Human Motion Tracking with a Coordinated Mixture of Factor Analyzers.",
            "Generalizing Inverse Compositional and ESM Image Alignment.",
            "Quasi-perspective Projection Model: Theory and Application to Structure and Motion Factorization from Uncalibrated Image Sequences.",
            "3-D B-spline Wavelet-Based Local Standard Deviation (BWLSD): Its Application to Edge Detection and Vascular Segmentation in Magnetic Resonance Angiography.",
            "Camera Network Calibration and Synchronization from Silhouettes in Archived Video.",
            "From Images to Shape Models for Object Detection.",
            "A Combinatorial Method for Topology Adaptations in 3D Deformable Models.",
            "Improving Bag-of-Features for Large Scale Image Search.",
            "An Approach to the Parameterization of Structure for Fast Categorization.",
            "Using the Particle Filter Approach to Building Partial Correspondences Between Shapes.",
            "What Do the Sun and the Sky Tell Us About the Camera?",
            "Non-Parametric Mixture Model Based Evolution of Level Sets and Application to Medical Images.",
            "Metric Learning for Image Alignment.",
            "Generalized Thin-Plate Spline Warps.",
            "Extended Phase Field Higher-Order Active Contour Models for Networks - Its Application to Road Network Extraction from VHR Satellite Images.",
            "Tracking in a Dense Crowd Using Multiple Cameras.",
            "Editorial: Special Issue on Probabilistic Models for Image Understanding.",
            "OPTIMOL: Automatic Online Picture Collection via Incremental Model Learning.",
            "Gaussian Processes for Object Categorization.",
            "Learning to Match: Deriving Optimal Template-Matching Algorithms from Probabilistic Image Models.",
            "Learning Articulated Structure and Motion.",
            "Category Level Object Segmentation by Combining Bag-of-Words Models with Dirichlet Processes and Random Fields.",
            "A Hierarchical and Contextual Model for Aerial Image Parsing.",
            "Unsupervised Object Discovery: A Comparison.",
            "The Pascal Visual Object Classes (VOC) Challenge.",
            "Volumetric Features for Video Event Detection.",
            "Study of a Robust Feature: The Pointwise Lipschitz Regularity.",
            "Shape-based Invariant Texture Indexing.",
            "Rigid Structure from Motion from a Blind Source Separation Perspective.",
            "Robust Algebraic Segmentation of Mixed Rigid-Body and Planar Motions from Two Views.",
            "Using Basic Image Features for Texture Classification.",
            "Image Comparison by Compound Disjoint Information with Applications to Perceptual Visual Quality Assessment, Image Registration and Tracking.",
            "Two-View Motion Segmentation with Model Selection and Outlier Removal by RANSAC-Enhanced Dirichlet Process Mixture Models.",
            "Rejecting Mismatches by Correspondence Function.",
            "Full and Partial Symmetries of Non-rigid Shapes.",
            "Dinkelbach NCUT: An Efficient Framework for Solving Normalized Cuts Problems with Priors and Convex Constraints.",
            "Nonlinear Dimensionality Reduction by Topologically Constrained Isometric Embedding.",
            "A Computational Model of Multidimensional Shape.",
            "Unified Direct Visual Tracking of Rigid and Deformable Surfaces Under Generic Illumination Changes in Grayscale and Color Images.",
            "Multi-view Superpixel Stereo in Urban Environments.",
            "Model Fitting with Sufficient Random Sample Coverage.",
            "IJCV Special Issue on 3D Object Retrieval - Foreword by the Guest Editors.",
            "Rectilinearity of 3D Meshes.",
            "From 3D Point Clouds to Pose-Normalised Depth Maps.",
            "PANORAMA: A 3D Shape Descriptor Based on Panoramic Views for Unsupervised 3D Object Retrieval.",
            "Spherical Correlation of Visual Representations for 3D Model Retrieval.",
            "Real-time Object Recognition in Sparse Range Images Using Error Surface Embedding.",
            "A 3D Shape Retrieval Framework Supporting Multimodal Queries.",
            "Spectral-Driven Isometry-Invariant Matching of 3D Shapes.",
            "A Gromov-Hausdorff Framework with Diffusion Geometry for Topologically-Robust Non-rigid Shape Matching.",
            "Hierarchical Shape Segmentation and Registration via Topological Features of Laplace-Beltrami Eigenfunctions.",
            "Contextual Part Analogies in 3D Objects.",
            "Thesaurus-based 3D Object Retrieval with Part-in-Whole Matching.",
            "On the Repeatability and Quality of Keypoints for Local Feature-based 3D Object Retrieval from Cluttered Scenes.",
            "Shape Similarity for 3D Video Sequences of People.",
            "Ethnicity- and Gender-based Subject Retrieval Using 3-D Face-Recognition Techniques.",
            "Similarity Learning for 3D Object Retrieval Using Relevance Feedback and Risk Minimization.",
            "Learning Robust Similarity Measures for 3D Partial Shape Retrieval.",
            "A Solution of the Dichromatic Model for Multispectral Photometric Invariance.",
            "3D Reconstruction of Periodic Motion from a Single View.",
            "Learning Photometric Invariance for Object Detection.",
            "Generalised Nonlocal Image Smoothing.",
            "Baselines for Image Annotation.",
            "Time-Delayed Correlation Analysis for Multi-Camera Activity Understanding.",
            "Adaptive Variational Method for Restoring Color Images with High Density Impulse Noise.",
            "Probabilistic Multi-Task Learning for Visual Saliency Estimation in Video.",
            "3-D Symmetry Detection and Analysis Using the Pseudo-polar Fourier Transform.",
            "A Basis Illumination Approach to BRDF Measurement.",
            "Learning Active Basis Model for Object Detection and Recognition.",
            "Globally Optimal Algorithms for Stratified Autocalibration.",
            "Population Shape Regression from Random Design Data.",
            "On the Length and Area Regularization for Multiphase Level Set Segmentation.",
            "Multi-view Occlusion Reasoning for Probabilistic Silhouette-Based Dynamic Scene Reconstruction.",
            "Illuminance Flow Estimation by Regression.",
            "Robust Pose Recognition of the Obscured Human Body.",
            "Anthropometric 3D Face Recognition.",
            "Euclidean Upgrading from Segment Lengths.",
            "Perspective Reconstruction of a Spheroid from an Image Plane Ellipse."
        ]
    },
    {
        "name": "IJCV",
        "year": "2009",
        "info": "2009: Volumes\n81, 82, 83, 84, 85",
        "count": 96,
        "papers": [
            "Editorial Special Issue ECCV 2006.",
            "TextonBoost for Image Understanding: Multi-Class Object Recognition and Segmentation by Jointly Modeling Texture, Layout, and Context.",
            "A Fast Approximation of the Bilateral Filter Using a Signal Processing Approach.",
            "Carved Visual Hulls for Image-Based Modeling.",
            "Multi-Reference Shape Priors for Active Contours.",
            "Confocal Stereo.",
            "Learning to Combine Bottom-Up and Top-Down Segmentation.",
            "Direct Calibration by Fitting of Cuboids to a Single Image Using Differential Evolution.",
            "Drift-Free Real-Time Sequential Mosaicing.",
            "An Alternative Approach to Computing Shape Orientation with an Application to Compound Shapes.",
            "EPnP: An Accurate O(n) Solution to the PnP Problem.",
            "An Improved FoE Model for Image Deblurring.",
            "Stereo Image Analysis of Non-Lambertian Surfaces.",
            "Optimal Local Basis: A Reinforcement Learning Approach for Face Recognition.",
            "Rank Constraints for Homographies over Two Views: Revisiting the Rank Four Constraint.",
            "Adaptive Stochastic Gradient Descent Optimisation for Image Registration.",
            "Robust Factorization Methods Using a Gaussian/Uniform Mixture Model.",
            "The Theory and Practice of Coplanar Shadowgram Imaging for Acquiring Visual Hulls of Intricate Objects.",
            "Topology-Invariant Similarity of Nonrigid Shapes.",
            "An Expression Deformation Approach to Non-rigid 3D Face Recognition.",
            "Spectral Curvature Clustering (SCC).",
            "Intrinsic Bayesian Active Contours for Extraction of Object Boundaries in Images.",
            "Semantic Representation and Recognition of Continued and Recursive Human Activities.",
            "Local Image Features Resulting from 3-Dimensional Geometric Features, Illumination, and Movement: I.",
            "Dynamic Texture Detection Based on Motion Analysis.",
            "Global Optimization through Rotation Space Search.",
            "An Intrinsic Framework for Analysis of Facial Surfaces.",
            "Shape of Elastic Strings in Euclidean Space.",
            "Geodesic Matting: A Framework for Fast Interactive Image and Video Segmentation and Matting.",
            "A Shape Representation with Elastic Quadratic Polynomials - Preservation of High Curvature Points under Noisy Conditions.",
            "Cayley Transformation and Numerical Stability of Calibration Equation.",
            "Detection and Segmentation of Multiple, Partially Occluded Objects by Grouping, Merging, Assigning Part Detection Responses.",
            "Fields of Experts.",
            "Modelling Spatio-Temporal Saliency to Predict Gaze Direction for Short Videos.",
            "3D Target Scale Estimation and Target Feature Separation for Size Preserving Tracking in PTZ Video.",
            "Four-Color Theorem and Level Set Methods for Watershed Segmentation.",
            "Action Recognition Using a Bio-Inspired Feedforward Spiking Network.",
            "Robust Higher Order Potentials for Enforcing Label Consistency.",
            "Occlusion Boundaries from Motion: Low-Level Detection and Mid-Level Reasoning.",
            "Image Fusion for Enhanced Visualization: A Variational Approach.",
            "Contour Grouping Based on Contour-Skeleton Duality.",
            "Replicator Dynamics in the Iterative Process for Accurate Range Image Matching.",
            "Seeing the Objects Behind the Dots: Recognition in Videos from a Moving Camera.",
            "Real-Time Body Pose Recognition Using 2D or 3D Haarlets.",
            "Viewpoint Invariant Texture Description Using Fractal Analysis.",
            "Issues About Retinex Theory and Contrast Enhancement.",
            "Learning Generative Models for Multi-Activity Body Pose Estimation.",
            "Shape Reconstruction and Camera Self-Calibration Using Cast Shadows and Scene Geometries.",
            "Learning Fast Emulators of Binary Decision Processes.",
            "A Regularized Framework for Feature Selection in Face Detection and Authentication.",
            "Pose-Invariant Facial Expression Recognition Using Variable-Intensity Templates.",
            "Stereo Matching Using Population-Based MCMC.",
            "Shape Based Detection and Top-Down Delineation Using Image Segments.",
            "Improving Border Localization of Multi-Baseline Stereo Using Border-Cut.",
            "Segmentation using Appearance of Mesostructure Roughness.",
            "Reconstruction from Projections Using Grassmann Tensors.",
            "A Predual Proximal Point Algorithm Solving a Non Negative Basis Pursuit Denoising Model.",
            "Nonlinear Mean Shift over Riemannian Manifolds.",
            "Linear Quasi-Parallax SfM Using Laterally-Placed Eyes.",
            "Shape-Based Object Localization for Descriptive Classification.",
            "A Moving Grid Framework for Geometric Deformable Models.",
            "Continuous Global Optimization in Multiview 3D Reconstruction.",
            "Local Histogram Based Segmentation Using the Wasserstein Distance.",
            "New Possibilities with Sobolev Active Contours.",
            "Reversible Interpolation of Vectorial Images by an Anisotropic Diffusion-Projection PDE.",
            "Cooperative Object Segmentation and Behavior Inference in Image Sequences.",
            "Partial Similarity of Objects, or How to Compare a Centaur to a Horse.",
            "On Local Region Models and a Statistical Interpretation of the Piecewise Smooth Mumford-Shah Functional.",
            "Scale Selection for Compact Scale-Space Representation of Vector-Valued Images.",
            "Linear Image Reconstruction by Sobolev Norms on the Bounded Domain.",
            "Local and Nonlocal Discrete Regularization on Weighted Graphs for Image and Mesh Processing.",
            "Fast and Stable Polynomial Equation Solving and Its Application to Computer Vision.",
            "Accurate Camera Calibration from Multi-View Stereo and Bundle Adjustment.",
            "Shape from Shading Using Probability Functions and Belief Propagation.",
            "On Total Variation Minimization and Surface Evolution Using Parametric Maximum Flows.",
            "Optimizing Gabor Filter Design for Texture Edge Detection and Classification.",
            "Matching Trajectories of Anatomical Landmarks Under Viewpoint, Anthropometric and Temporal Transforms.",
            "Easy Calibration of a Multi-projector Display System.",
            "Simplex Mesh Diffusion Snakes: Integrating 2D and 3D Deformable Models and Statistical Shape Knowledge in a Variational Framework.",
            "Entropy Minimization for Shadow Removal.",
            "Recovering Shape by Shading and Stereo Under Lambertian Shading Model.",
            "Hybrid Dynamical Models of Human Motion for the Recognition of Human Gaits.",
            "A Statistical Overlap Prior for Variational Image Segmentation.",
            "On Computing the Prediction Sum of Squares Statistic in Linear Least Squares Problems with Multiple Parameter or Measurement Sets.",
            "Foreground Focus: Unsupervised Learning from Partially Matching Images.",
            "Benchmarking Image Segmentation Algorithms.",
            "An Adaptive Method for Recovering Image from Mixed Noisy Data.",
            "Active, Foveated, Uncalibrated Stereovision.",
            "Editorial.",
            "Fast GL(n)-Invariant Framework for Tensors Regularization.",
            "3D Topology Preserving Flows for Viewpoint-Based Cortical Unfolding.",
            "Bilinear Models for Spatio-Temporal Point Distribution Analysis.",
            "Crossing-Preserving Coherence-Enhancing Diffusion on Invertible Orientation Scores.",
            "Consistency Clustering: A Robust Algorithm for Group-wise Registration, Segmentation and Automatic Atlas Construction in Diffusion MRI.",
            "Registration of Anatomical Images Using Paths of Diffeomorphisms Parameterized with Stationary Vector Field Flows.",
            "Rectified Surface Mosaics."
        ]
    },
    {
        "name": "IJCV",
        "year": "2008",
        "info": "2008: Volumes\n76, 77, 78, 79, 80",
        "count": 96,
        "papers": [
            "On the Local Behavior of Spaces of Natural Images.",
            "A Theory of Refractive and Specular 3D Shape by Light-Path Triangulation.",
            "A General Method for Sensor Planning in Multi-Sensor Systems: Extension to Random Occlusion.",
            "3-D Depth Reconstruction from a Single Still Image.",
            "Facial Shape-from-shading and Recognition Using Principal Geodesic Analysis and Robust Statistics.",
            "Using Biologically Inspired Features for Face Processing.",
            "Editorial.",
            "Probabilistic Fusion of Stereo with Color and Contrast for Bi-Layer Segmentation.",
            "Fast Non-Rigid Surface Detection, Registration and Realistic Augmentation.",
            "Nonlocal Image and Movie Denoising.",
            "Video Epitomes.",
            "FLIRT with Rigidity - Image Registration with a Local Non-rigidity Penalty.",
            "Model of Frequency Analysis in the Visual Cortex and the Shape from Texture Problem.",
            "Multi-View AAM Fitting and Construction.",
            "Over-Parameterized Variational Optical Flow.",
            "A Tensor Approximation Approach to Dimensionality Reduction.",
            "Prior Knowledge, Level Set Representations & Visual Grouping.",
            "3-D Reconstruction of Shaded Objects from Multiple Images Under Unknown Illumination.",
            "Simultaneous Facial Action Tracking and Expression Recognition in the Presence of Head Motion.",
            "High Resolution Tracking of Non-Rigid Motion of Densely Sampled 3D Data Using Harmonic Maps.",
            "Learning Layered Motion Segmentations of Video.",
            "Guest Editorial.",
            "Learning to Locate Informative Features for Visual Identification.",
            "Nonparametric Bayesian Image Segmentation.",
            "Learning Probabilistic Models for Contour Completion in Natural Images.",
            "On the Design of Cascades of Boosted Ensembles for Face Detection.",
            "Fast Transformation-Invariant Component Analysis.",
            "Learning and Inferring Motion Patterns using Parametric Segmental Switching Linear Dynamic Systems.",
            "Incremental Learning for Robust Visual Tracking.",
            "From Aardvark to Zorro: A Benchmark for Mammal Image Classification.",
            "LabelMe: A Database and Web-Based Tool for Image Annotation.",
            "Efficient Learning of Relational Object Class Models.",
            "Evaluation of Localized Semantics: Data, Methodology, and Experiments.",
            "Learning to Recognize Objects with Little Supervision.",
            "Hybrid Generative-Discriminative Visual Categorization.",
            "Robust Object Detection with Interleaved Categorization and Segmentation.",
            "Describing Visual Scenes Using Transformed Objects and Parts.",
            "Pairwise Matching of 3D Fragments Using Cluster Trees.",
            "Multilevel Image Coding with Hyperfeatures.",
            "A Deformable Object Tracking Algorithm Based on the Boundary Element Method that is Robust to Occlusions and Spurious Edges.",
            "Region-Based Hierarchical Image Matching.",
            "Analysis of Two-Dimensional Non-Rigid Shapes.",
            "Identical Projective Geometric Properties of Central Catadioptric Line Images and Sphere Images with Applications to Calibration.",
            "Mutual Information-Based 3D Object Tracking.",
            "Modeling and Representations of Large-Scale 3D Scenes.",
            "3D Urban Scene Modeling Integrating Recognition and Reconstruction.",
            "Detailed Real-Time Urban 3D Reconstruction from Video.",
            "Scanning Depth of Route Panorama Based on Stationary Blur.",
            "Minimal Aspect Distortion (MAD) Mosaicing of Long Scenes.",
            "Flying Laser Range Sensor for Large-Scale Site-Modeling and Its Applications in Bayon Digital Archival Project.",
            "Architectural Modeling from Sparsely Scanned Range Data.",
            "Integrating Automated Range Registration with Multiview Geometry for the Photorealistic Modeling of Large-Scale Scenes.",
            "Building Illumination Coherent 3D Models of Large-Scale Outdoor Scenes.",
            "Keypoint Detection and Local Feature Matching for Textured 3D Face Recognition.",
            "Color Subspaces as Photometric Invariants.",
            "From Inpainting to Active Contours.",
            "Local Adaptivity to Variable Smoothness for Exemplar-Based Image Regularization and Representation.",
            "Dynamic Shape and Appearance Modeling via Moving and Deforming Layers.",
            "Multiframe Motion Segmentation with Missing Data Using PowerFactorization and GPCA.",
            "Active Contours Under Topology Control - Genus Preserving Level Sets.",
            "Regularized Reconstruction of Shapes with Statistical a priori Knowledge.",
            "Inter-Image Statistics for 3D Environment Modeling.",
            "A Model-Selection Framework for Multibody Structure-and-Motion of Image Sequences.",
            "A Light Scattering Model for Layered Dielectrics with Rough Surface Boundaries.",
            "Detecting and Handling Unreliable Points for Camera Parameter Estimation.",
            "Evaluation of Face Datasets as Tools for Assessing the Performance of Face Recognition Methods.",
            "Shape-Based Mutual Segmentation.",
            "Human Motion Tracking with a Kinematic Parameterization of Extremal Contours.",
            "Practical Global Optimization for Multiview Geometry.",
            "Simultaneous Segmentation and Pose Estimation of Humans Using Dynamic Graph Cuts.",
            "Unsupervised Learning of Human Action Categories Using Spatial-Temporal Words.",
            "Editorial.",
            "Putting Objects in Perspective.",
            "Learning an Alphabet of Shape and Appearance for Multi-Class Object Detection.",
            "Object Class Recognition and Localization Using Sparse Features with Limited Receptive Fields.",
            "A Viewpoint Invariant, Sparsely Registered, Patch Based, Face Verifier.",
            "Particle Video: Long-Range Motion Estimation Using Point Trajectories.",
            "Performance Modeling and Algorithm Characterization for Robust Image Segmentation.",
            "A Unified Curvature Definition for Regular, Polygonal, and Digital Planar Curves.",
            "Optimization Algorithms on Subspaces: Revisiting Missing Data Problem in Low-Rank Matrix.",
            "Perceptual Scale-Space and Its Applications.",
            "Partial Linear Gaussian Models for Tracking in Image Sequences Using Sequential Monte Carlo Methods.",
            "Statistical Optimization for Geometric Fitting: Theoretical Accuracy Bound and High Order Error Analysis.",
            "Modeling the World from Internet Photo Collections.",
            "Initialization of Model-Based Vehicle Tracking in Video Sequences of Inner-City Intersections.",
            "Shape from Specular Reflection and Optical Flow.",
            "Motion and Appearance Nonparametric Joint Entropy for Video Segmentation.",
            "Pose Robust Face Tracking by Combining Active Appearance Models and Cylinder Head Models.",
            "Guided Sampling via Weak Motion Models and Outlier Sample Generation for Epipolar Geometry Estimation.",
            "Variational Segmentation of Image Sequences Using Region-Based Active Contours and Deformable Shape Priors.",
            "Multi-Class Segmentation with Relative Location Prior.",
            "Large Deformation Diffeomorphic Metric Curve Mapping.",
            "Searching for Complex Human Activities with No Visual Examples.",
            "Translated Poisson Mixture Model for Stratification Learning.",
            "Building Blocks for Computer Vision with Stochastic Partial Differential Equations.",
            "Limits of Learning-Based Superresolution Algorithms."
        ]
    },
    {
        "name": "IJCV",
        "year": "2007",
        "info": "2007: Volumes\n71, 72, 73, 74, 75",
        "count": 95,
        "papers": [
            "Critical Configurations for Projective Reconstruction from Multiple Views.",
            "Centralized and Distributed Multi-view Correspondence.",
            "Learning Shape Correspondence for n-D curves.",
            "Efficient Dense Stereo with Occlusions for New View-Synthesis by Four-State Dynamic Programming.",
            "Boosting Sex Identification Performance.",
            "Guest Editorial: Object Tracking and Classification Beyond the Visible Spectrum.",
            "Kernel Spectral Matched Filter for Hyperspectral Imagery.",
            "Pedestrian Detection via Periodic Motion Analysis.",
            "Background-Subtraction in Thermal Imagery Using Contour Saliency.",
            "Detection and Tracking of Multiple Metallic Objects in Millimetre-Wave Images.",
            "Imaging Facial Physiology for the Detection of Deceit.",
            "Multiscale Fusion of Visible and Thermal IR Images for Illumination-Invariant Face Recognition.",
            "Multi-sensory and Multi-modal Fusion for Sentient Computing.",
            "A Coupled Minimization Problem for Medical Image Segmentation with Priors.",
            "Weakly Supervised Scale-Invariant Learning of Models for Visual Recognition.",
            "3D Reconstruction by Shadow Carving: Theory and Practical Evaluation.",
            "Global Detection of Salient Convex Boundaries.",
            "Image Registration with Guaranteed Displacement Regularity.",
            "Editorial: ECOVISION: Challenges in Early-Cognitive Vision.",
            "A Roadmap to the Integration of Early Visual Modules.",
            "Disambiguating Visual Motion by Form-Motion Interaction - a Computational Model.",
            "Pre-Attentive and Attentive Detection of Humans in Wide-Field Scenes.",
            "Fixation as a Mechanism for Stabilization of Short Image Sequences.",
            "Image Analysis and Reconstruction using a Wavelet Transform Constructed from a Reducible Representation of the Euclidean Motion Group.",
            "Building Outline Extraction from Digital Elevation Models Using Marked Point Processes.",
            "Semantic Modeling of Natural Scenes for Content-Based Image Retrieval.",
            "Implicit Meshes for Effective Silhouette Handling.",
            "Multi-View Stereo Reconstruction and Scene Flow Estimation with a Global Image-Based Matching Score.",
            "A Review of Statistical Approaches to Level Set Segmentation: Integrating Color, Texture, Motion and Shape.",
            "Information Theoretic Deformable Registration Using Local Image Information.",
            "Photometric Stereo with General, Unknown Lighting.",
            "Discovering Shape Classes using Tree Edit-Distance and Pairwise Clustering.",
            "Application of the Fisher-Rao Metric to Ellipse Detection.",
            "Prior-based Segmentation and Shape Registration in the Presence of Perspective Distortion.",
            "On the Wiberg Algorithm for Matrix Factorization in the Presence of Missing Components.",
            "Image Registration of Sectioned Brains.",
            "Multi-cue Pedestrian Detection and Tracking from a Moving Vehicle.",
            "Image Segmentation Using Some Piecewise Constant Level Set Methods with MBO Type of Projection.",
            "A Framework for Automatically Recovering Object Shape, Reflectance and Light Sources from Calibrated Images.",
            "Binet-Cauchy Kernels on Dynamical Systems and its Application to the Analysis of Dynamic Scenes.",
            "Shape and View Independent Reflectance Map from Multiple Views.",
            "A Framework for Model-Based Tracking Experiments in Image Sequences.",
            "A Behavioral Analysis of Computational Models of Visual Attention.",
            "Extrapolative Spatial Models for Detecting Perceptual Boundaries in Colour Images.",
            "Constraints Between Distant Lines in the Labelling of Line Drawings of Polyhedral Scenes.",
            "Local Features and Kernels for Classification of Texture and Object Categories: A Comprehensive Study.",
            "Three-Dimensional Shape Knowledge for Joint Image Segmentation and Pose Tracking.",
            "Evaluation of Features Detectors and Descriptors based on 3D Objects.",
            "Human Pose Estimation Using Partial Configurations and Probabilistic Regions.",
            "On Shape of Plane Elastic Curves.",
            "Generalized Gradients: Priors on Minimization Flows.",
            "Sobolev Active Contours.",
            "Editorial: Marr Prize and Honorable Mentions at ICCV 2005.",
            "Globally Optimal Estimates for Geometric Reconstruction Problems.",
            "Detecting Irregularities in Images and in Video.",
            "On the Spatial Statistics of Optical Flow.",
            "The CLEF 2005 Automatic Medical Image Annotation Task.",
            "Automatic Panoramic Image Stitching using Invariant Features.",
            "Partial Linear Gaussian Models for Tracking in Image Sequences Using Sequential Monte Carlo Methods.",
            "Tree Structure for Contractible Regions in R3.",
            "Essential Matrix Estimation Using Gauss-Newton Iterations on a Manifold.",
            "Projective Visual Hulls.",
            "A Component-based Framework for Face Detection and Identification.",
            "Efficient Shape Modeling: epsilon-Entropy, Adaptive Coding, and Boundary Curves -vs- Blum's Medial Axis.",
            "Non-Rigid Multi-Modal Image Registration Using Cross-Cumulative Residual Entropy.",
            "Editorial: Special Issue on Vision and Robotics, Parts I and II.",
            "Omnidirectional Vision Based Topological Navigation.",
            "Monocular Vision for Mobile Robot Localization and Autonomous Navigation.",
            "Detecting Loop Closure with Scene Sequences.",
            "Reverse Optical Flow for Self-Supervised Adaptive Autonomous Robot Navigation.",
            "A Study of the Rao-Blackwellised Particle Filter for Efficient and Accurate Vision-Based SLAM.",
            "Design Through Operation of an Image-Based Velocity Estimation System for Mars Landing.",
            "Vision-Based SLAM: Stereo and Monocular Approaches.",
            "Editorial.",
            "Vision and Rain.",
            "Appearance Sampling of Real Objects for Variable Illumination.",
            "Stereo for Image-Based Rendering using Image Over-Segmentation.",
            "Computer Vision on Mars.",
            "2D vs. 3D Deformable Face Models: Representational Power, Construction, and Real-Time Fitting.",
            "Face Hallucination: Theory and Practice.",
            "Image-Based Modeling by Joint Segmentation.",
            "Recovering Surface Layout from an Image.",
            "Live 3D Video in Soccer Stadium.",
            "The Great Buddha Project: Digitally Archiving, Restoring, and Analyzing Cultural Heritage Objects.",
            "Multivariate Statistical Models for Image Denoising in the Wavelet Domain.",
            "Self-Invertible 2D Log-Gabor Wavelets.",
            "Detection and Tracking of Multiple, Partially Occluded Humans by Bayesian Combination of Edgelet based Part Detectors.",
            "POP: Patchwork of Parts Models for Object Recognition.",
            "A Performance Study on Different Cost Aggregation Approaches Used in Real-Time Stereo Matching.",
            "A Unified Gradient-Based Approach for Combining ASM into AAM.",
            "Correspondence-free Structure from Motion.",
            "A Low Dimensional Fluid Motion Estimator.",
            "Registration of 3D Points Using Geometric Algebra and Tensor Voting.",
            "Symmetrical Dense Optical Flow Estimation with Occlusions Detection.",
            "Statistical Multi-Object Shape Models."
        ]
    },
    {
        "name": "IJCV",
        "year": "2006",
        "info": "2006: Volumes\n66, 67, 68, 69, 70",
        "count": 95,
        "papers": [
            "Iterative Image Restoration Combining Total Variation Minimization and a Second-Order Functional.",
            "A Novel Representation and Feature Matching Algorithm for Automatic Pairwise Registration of Range Images.",
            "A Riemannian Framework for Tensor Computing.",
            "A Multiphase Dynamic Labeling Model for Variational Recognition-driven Image Segmentation.",
            "View Invariance for Human Action Recognition.",
            "Editorial.",
            "Stabilizing the Focal Length Computation for 3-D Reconstruction from Two Uncalibrated Views.",
            "Recovering Multiple View Geometry from Mutual Projections of Multiple Cameras.",
            "A Surface Reconstruction Method Using Global Graph Cut Optimization.",
            "Appearance-Cloning: Photo-Consistent Scene Recovery from Multi-View Images.",
            "Non-Rigid Stereo Factorization.",
            "Non-Single Viewpoint Catadioptric Cameras: Geometry and Analysis.",
            "3D Object Modeling and Recognition Using Local Affine-Invariant Image Descriptors and Multi-View Spatial Constraints.",
            "3D Structure Recovery and Unwarping of Surfaces Applicable to Planes.",
            "The Absolute Line Quadric and Camera Autocalibration.",
            "Projective Reconstruction from Multiple Views with Minimization of 2D Reprojection Error.",
            "The Characterization of Sufficient Visibility in the Direct Reference Plane Approach for Multiple Views with Missing Data.",
            "Beyond Tracking: Modelling Activity and Understanding Behaviour.",
            "Segmentation of Planar Objects and Their Shadows in Motion Sequences.",
            "Shape from Texture without Boundaries.",
            "Gamut Constrained Illuminant Estimation.",
            "Structure-Texture Image Decomposition - Modeling, Algorithms, and Parameter Selection.",
            "Editorial: Selection of Papers for the ECCV 2004 Special Issue.",
            "Highly Accurate Optic Flow Computation with Theoretically Justified Warping.",
            "Simultaneous Object Recognition and Segmentation from Single or Multiple Model Views.",
            "Object Level Grouping for Video Shots.",
            "Four Points in Two or Three Calibrated Views: Theory and Practice.",
            "A Closed-Form Solution to Non-Rigid Shape and Motion Recovery.",
            "Combining Generative and Discriminative Models in a Framework for Articulated Pose Estimation.",
            "Geometry and Convergence Analysis of Algorithms for Registration of 3D Shapes.",
            "Representation Analysis and Synthesis of Lip Images Using Dimensionality Reduction.",
            "On Single-Sequence and Multi-Sequence Factorizations.",
            "Multi-Parameter Simultaneous Estimation on Area-Based Matching.",
            "A General Framework for Combining Visual Trackers - The \"Black Boxes\" Approach.",
            "Editorial.",
            "Two-View Multibody Structure from Motion.",
            "Multi-body Factorization with Uncertainty: Revisiting Motion Consistency.",
            "Wide Baseline Matching between Unsynchronized Video Sequences.",
            "Feature-Based Sequence-to-Sequence Matching.",
            "Fast Anisotropic Smoothing of Multi-Valued Images using Curvature-Preserving PDE's.",
            "An Analysis of Linear Subspace Approaches for Computer Vision and Pattern Recognition.",
            "Piecewise-Smooth Dense Optical Flow via Level Sets.",
            "A Feature-based Approach for Dense Segmentation and Estimation of Large Disparity Motion.",
            "A Variational Model for Object Segmentation Using Boundary Information and Shape Prior Driven by the Mumford-Shah Functional.",
            "An a contrario Decision Framework for Region-Based Motion Detection.",
            "Discriminative Random Fields.",
            "When are Simple LS Estimators Enough? An Empirical Study of LS, TLS, and GTLS.",
            "Automated Alignment of Robotic Pan-Tilt Camera Units Using Vision.",
            "Generalized Camera Calibration Including Fish-Eye Lenses.",
            "Efficient Discriminant Viewpoint Selection for Active Bayesian Recognition.",
            "Scale-Sets Image Analysis.",
            "Estimate Large Motions Using the Reliability-Based Motion Estimation Algorithm.",
            "Editorial.",
            "Stochastic Motion and the Level Set Method in Computer Vision: Stochastic Active Contours.",
            "Higher Order Active Contours.",
            "A Variational Model for P+XS Image Fusion.",
            "Contextual Inference in Contour-Based Stereo Correspondence.",
            "Basis Tensor Decomposition for Restoring Intra-Voxel Structure and Stochastic Walks for Inferring Brain Connectivity in DT-MRI.",
            "Curvature-Driven PDE Methods for Matrix-Valued Images.",
            "Visual Acuity in Day for Night.",
            "A Metric Approach to Vector-Valued Image Segmentation.",
            "Fast Constrained Surface Extraction by Minimal Paths.",
            "Contour Inferences for Image Understanding.",
            "Geodesic Remeshing Using Front Propagation.",
            "Behavioral Priors for Detection and Tracking of Pedestrians in Video Sequences.",
            "Model Selection for Unsupervised Learning of Visual Context.",
            "Object Recognition as Many-to-Many Feature Matching.",
            "Parsing Images into Regions, Curves, and Curve Groups.",
            "A Critical View of Context.",
            "Reconstructing Open Surfaces from Image Data.",
            "Robust Tracking Using Foreground-Background Texture Discrimination.",
            "An A Contrario Decision Method for Shape Element Recognition.",
            "Affine Approximation for Direct Batch Recovery of Euclidian Structure and Motion from Sparse Data.",
            "Kernel Density Estimation and Intrinsic Alignment for Shape Priors in Level Set Segmentation.",
            "Hand Motion Gesture Frequency Properties and Multimodal Discourse Analysis.",
            "Editorial.",
            "Programmable Imaging: Towards a Flexible Camera.",
            "Corneal Imaging System: Environment from Eyes.",
            "Efficient Belief Propagation for Early Vision.",
            "2D-Shape Analysis Using Conformal Mapping.",
            "Unsupervised Learning of Image Manifolds by Semidefinite Programming.",
            "Random Sampling for Subspace Face Recognition.",
            "Editorial: Special Issue on Vision and Medical Imaging Activities at Siemens Corporate Research.",
            "Graph Cuts and Efficient N-D Image Segmentation.",
            "Canonical Representation and Multi-View Geometry of Cylinders.",
            "Automatic Segmentation of the Left Ventricle in Cardiac MR and CT Images.",
            "Comprehensive Cardiovascular Image Analysis Using MR and CT at Siemens Corporate Research.",
            "Reality Augmentation for Medical Procedures: System Architecture, Single Camera Marker Tracking, and System Evaluation.",
            "Editorial: Special issue for the 5th International Conference on Scale-Space and PDE Methods in Computer Vision.",
            "Multiscale Active Contours.",
            "Hypotheses for Image Features, Icons and Textons.",
            "A Linear Image Reconstruction Framework Based on Sobolev Type Inner Products.",
            "Splines in Higher Order TV Regularization.",
            "A Multigrid Platform for Real-Time Motion Computation with Discontinuity-Preserving Variational Methods.",
            "Image Deblurring in the Presence of Impulsive Noise."
        ]
    },
    {
        "name": "IJCV",
        "year": "2005",
        "info": "2005: Volumes\n61, 62, 63, 64, 65",
        "count": 61,
        "papers": [
            "Illuminant-Dependence of Von Kries Type Quotients.",
            "Adaptive Grid Refinement Procedures for Efficient Optical Flow Computation.",
            "Pictorial Structures for Object Recognition.",
            "Building Roadmaps of Minima and Transitions in Visual Models.",
            "The Amsterdam Library of Object Images.",
            "The Raxel Imaging Model and Ray-Based Calibration.",
            "Computing Large Deformation Metric Mappings via Geodesic Flows of Diffeomorphisms.",
            "Data Processing Algorithms for Generating Textured 3D Building Facade Meshes from Laser Scans and Camera Images.",
            "Articulated Body Motion Capture by Stochastic Search.",
            "Lucas/Kanade Meets Horn/Schunck: Combining Local and Global Optic Flow Methods.",
            "Efficient Fourier-Based Approach for Detecting Orientations and Occlusions in Epipolar Plane Images for 3D Scene Modeling.",
            "The Least-Squares Error for Structure from Infinitesimal Motion.",
            "Editorial: Special Issue on \"Texture Analysis and Synthesi\".",
            "A Six-Stimulus Theory for Stochastic Texture.",
            "Bidirectional Texture Contrast Function.",
            "Shadow Graphs and 3D Texture Reconstruction.",
            "A Statistical Approach to Texture Classification from Single Images.",
            "Classifying Surface Texture while Simultaneously Estimating Illumination Direction.",
            "Skin Texture Modeling.",
            "What are Textons?",
            "The Promise and Perils of Near-Regular Texture.",
            "Composite Texture Synthesis.",
            "Capture and Synthesis of 3D Surface Texture.",
            "Information-Theoretic Active Polygons for Unsupervised Texture Segmentation.",
            "Shape-From-Silhouette Across Time Part I: Theory and Algorithms.",
            "Motion Competition: A Variational Approach to Piecewise Parametric Motion Segmentation.",
            "Pose Estimation of 3D Free-Form Contours.",
            "Natural Image Statistics for Natural Image Segmentation.",
            "Shape-from-Shading Under Perspective Projection.",
            "Determining the Geometry of Boundaries of Objects from Medial Data.",
            "The Local Projective Shape of Smooth Surfaces and Their Outlines.",
            "Dual Norms and Image Decomposition Models.",
            "Editorial: Selection of Marr Prize Papers at ICCV'03.",
            "Image Parsing: Unifying Segmentation, Detection, and Recognition.",
            "Image-Based Rendering Using Image-Based Priors.",
            "Detecting Pedestrians Using Patterns of Motion and Appearance.",
            "Multi-View Stereo Reconstruction of Dense Shape and Complex Appearance.",
            "The Fisher-Rao Metric for Projective Transformations of the Line.",
            "Sub-Pixel Estimation Error Cancellation on Area-Based Matching.",
            "Shape-From-Silhouette Across Time Part II: Applications to Human Modeling and Markerless Motion Tracking.",
            "Three-Dimensional Face Recognition.",
            "Local Shape from Mirror Reflections.",
            "Wireframe Projections: Physical Realisability of Curved Objects and Unambiguous Reconstruction of Simple Polyhedra.",
            "Editorial.",
            "Temporal Scale Spaces.",
            "On Space-Time Interest Points.",
            "Scale-Space Image Analysis Based on Hermite Polynomials Theory.",
            "Least Squares and Robust Estimation of Local Image Structure.",
            "An Explanation for the Logarithmic Connection between Linear and Morphological System Theory.",
            "Diffusion-Inspired Shrinkage Functions and Stability Results for Wavelet Denoising.",
            "The Monogenic Scale Space on a Rectangular Domain and its Features.",
            "Analysis of Iterative Methods for Solving a Ginzburg-Landau Equation.",
            "On the Evolution of Vector Distance Functions of Closed Curves.",
            "Detecting Codimension - Two Objects in an Image with Ginzburg-Landau Models.",
            "A Comparison of Affine Region Detectors.",
            "Tone Reproduction: A Perspective from Luminance-Driven Perceptual Grouping.",
            "A Generic and Provably Convergent Shape-from-Shading Method for Orthographic and Pinhole Cameras.",
            "Motion Recovery by Integrating over the Joint Image Manifold.",
            "Shape and the Stereo Correspondence Problem.",
            "Measuring the Information Content of Fracture Lines.",
            "An Efficient and Accurate Method for 3D-Point Reconstruction from Multiple Views."
        ]
    },
    {
        "name": "IJCV",
        "year": "2004",
        "info": "2004: Volumes\n56, 57, 58, 59, 60",
        "count": 67,
        "papers": [
            "Guest Editorial.",
            "Weakly Supervised Learning of Visual Models and Its Application to Content-Based Retrieval.",
            "Boosting Image Retrieval.",
            "Constraint Based Region Matching for Image Retrieval.",
            "Towards Data-Adaptive and User-Adaptive Image Retrieval by Peer Indexing.",
            "Learning from User Behavior in Image Retrieval: Application of Market Basket Analysis.",
            "Semantic-Friendly Indexing and Quering of Images Based on the Extraction of the Objective Semantic Cues.",
            "Visualization and User-Modeling for Browsing Personal Photo Libraries.",
            "Image Navigation: A Massively Interactive Model for Similarity Retrieval of Images.",
            "Object Detection Using the Statistics of Parts.",
            "Twist Based Acquisition and Tracking of Animal and Human Kinematics.",
            "Multiple View Geometry of General Algebraic Curves.",
            "Lucas-Kanade 20 Years On: A Unifying Framework.",
            "A Similarity-Based Aspect-Graph Approach to 3D Object Recognition.",
            "A General Framework for the Selection of World Coordinate Systems in Perspective and Catadioptric Imaging Applications.",
            "Segmented Linear Subspaces for Illumination-Robust Face Recognition.",
            "The Relevance of Non-Generic Events in Scale Space Models.",
            "Displacement Following of Hidden Objects in a Video Sequence.",
            "A New Hybrid Approach to Handwritten Address Verification.",
            "A Gibbs Point Process for Road Extraction from Remotely Sensed Images.",
            "Robust Real-Time Face Detection.",
            "The 3D Line Motion Matrix and Alignment of Line Reconstructions.",
            "Methods for Volumetric Reconstruction of Visual Scenes.",
            "A Probabilistic Criterion to Detect Rigid Point Matches Between Two Images and Estimate the Fundamental Matrix.",
            "Camera Autocalibration and Horopter Curves.",
            "Guest Editorial: Computer Vision Research at the Beckman Institute for Advanced Science and Technology.",
            "Split Aperture Imaging for High Dynamic Range.",
            "Image Interpolation Using Enhanced Multiresolution Critical-Point Filters.",
            "A Differential Geometric Approach to Multiple View Geometry in Spaces of Constant Curvature.",
            "Robust Visual Tracking by Integrating Multiple Cues Based on Co-Inference Learning.",
            "Curve and Surface Duals and the Recognition of Curved 3D Objects from their Silhouettes.",
            "Guest Editorial: Computer Vision Research at Microsoft Corporation.",
            "Robust and Rapid Generation of Animated Faces from Video Images: A Model-Based Modeling Approach.",
            "A Geometric Analysis of Light Field Rendering.",
            "Extracting View-Dependent Depth Maps from a Collection of Images.",
            "Editorial: Research in Japan on Omni-Directional Sensors and Their Applications.",
            "Real-Time Omnidirectional Image Sensors.",
            "Baseline Detection and Localization for Invisible Omnidirectional Cameras.",
            "Full-Surround Image Display Technologies.",
            "Constructing Virtual Cities by Using Panoramic Images.",
            "Structure from Motion Using Sequential Monte Carlo Methods.",
            "3D Texture Recognition Using Bidirectional Feature Histograms.",
            "Matching Widely Separated Views Based on Affine Invariant Regions.",
            "Deformable Contour Method: A Constrained Optimization Approach.",
            "Rank Conditions on the Multiple-View Matrix.",
            "MDPE: A Very Robust Estimator for Model Fitting and Range Image Segmentation.",
            "Efficient Graph-Based Image Segmentation.",
            "Generalized Hough Transform Using Regions with Homogeneous Color.",
            "Visual Modeling with a Hand-Held Camera.",
            "The Contracting Curve Density Algorithm: Fitting Parametric Curve Models to Images Using Local Self-Adapting Separation Criteria.",
            "SoftPOSIT: Simultaneous Pose and Correspondence Determination.",
            "Reconstruction of a Scene with Multiple Linearly Moving Objects.",
            "Editorial.",
            "In Memory of Hugh Christopher Longuet-Higgins.",
            "In Memory of Azriel Rosenfeld.",
            "An Automated Method for Large-Scale, Ground-Based City Model Acquisition.",
            "Noise Reduction in Surface Reconstruction from a Given Gradient Field.",
            "Learning Generative Models of Scene Features.",
            "Scale & Affine Invariant Interest Point Detectors.",
            "Distinctive Image Features from Scale-Invariant Keypoints.",
            "Modelling and Interpretation of Architecture from Several Images.",
            "Active Appearance Models Revisited.",
            "Untwisting a Projective Reconstruction.",
            "On the Influence of Scale Selection on Feature Detection for the Case of Linelike Structures.",
            "Area-Based Medial Axis of Planar Curves.",
            "Optimal Mass Transport for Registration and Warping.",
            "On Symmetry and Multiple-View Geometry: Structure, Pose, and Calibration from a Single Image."
        ]
    },
    {
        "name": "IJCV",
        "year": "2003",
        "info": "2003: Volumes\n51, 52, 53, 54, 55",
        "count": 52,
        "papers": [
            "Geometry and Texture from Thousands of Images.",
            "Tracking While Zooming Using Affine Transfer and Multifocal Tensors.",
            "Self-Consistency and MDL: A Paradigm for Evaluating Point-Correspondence Algorithms, and Its Application to Detecting Changes in Surface Elevation.",
            "Dynamic Textures.",
            "Understanding the Behavior of SFM Algorithms: A Geometric Approach.",
            "Polyhedral Object Localization in an Image by Referencing to a Single Model View.",
            "Uncalibrated Motion Capture Exploiting Articulated Structure Constraints.",
            "M2Tracker: A Multi-View Approach to Segmenting and Tracking People in a Cluttered Scene.",
            "Satellite Image Deblurring Using Complex Wavelet Packets.",
            "Velocity-Guided Tracking of Deformable Contours in Three Dimensional Space.",
            "Editorial.",
            "A Variational Framework for Retinex.",
            "Observing Shape from Defocused Images.",
            "Constrained Structure and Motion From Multiple Uncalibrated Views of a Piecewise Planar Scene.",
            "Guest Editorial: Special Issue on Scale-Space and Morphology.",
            "Feature-Based Image Analysis.",
            "A Distance Measure and a Feature Likelihood Map Concept for Scale-Invariant Model Matching.",
            "Algebraic and PDE Approaches for Lattice Scale-Spaces with Global Constraints.",
            "Adjunctions in Pyramids, Curve Evolution and Scale-Spaces.",
            "A Note on Two Classical Enhancement Filters and Their Associated PDE's.",
            "The Vector Distance Functions.",
            "Selection of Optimal Stopping Time for Nonlinear Diffusion Filtering.",
            "Modeling Visual Patterns by Integrating Descriptive and Generative Methods.",
            "Stereoscopic Segmentation.",
            "DREAM2S: Deformable Regions Driven by an Eulerian Accurate Minimization Method for Image and Video Segmentation.",
            "Constructing Facial Identity Surfaces for Recognition.",
            "Calibrated, Registered Images of an Extended Urban Area.",
            "Tele-Graffiti: A Camera-Projector Based Remote Sketching System with Hand-Based User Interface and Automatic Session Summarization.",
            "Robust Photometric Invariant Region Detection in Multispectral Images.",
            "Deformotion: Deforming Motion, Shape Average and the Joint Registration and Approximation of Structures in Images.",
            "Contextual Priming for Object Detection.",
            "Human Body Model Acquisition and Tracking Using Voxel Data.",
            "Regularized Laplacian Zero Crossings as Optimal Edge Integrators.",
            "Generalized Mosaicing: High Dynamic Range in a Wide Field of View.",
            "Guest Editorial: Computational Vision at Brown.",
            "A Dynamical Model of Visually-Guided Steering, Obstacle Avoidance, and Route Selection.",
            "Symmetry Maps of Free-Form Curve Segments via Wave Propagation.",
            "The Nonlinear Statistics of High-Contrast Patches in Natural Images.",
            "Implicitization of Parametric Curves by Matrix Annihilation.",
            "A Framework for Robust Subspace Learning.",
            "On the Local Form and Transitions of Symmetry Sets, Medial Axes, and Shocks.",
            "Euler Spiral for Shape Completion.",
            "Learning the Statistics of People in Images and Video.",
            "Perceptual Grouping by Selection of a Logically Minimal Model.",
            "Stochastic Approximation and Rate-Distortion Analysis for Robust Structure and Motion Estimation.",
            "Optical Snow.",
            "Guest Editorial-Medial & Medical: A Good Match for Image Analysis.",
            "Deformable M-Reps for 3D Medical Image Segmentation.",
            "Automatic and Robust Computation of 3D Medial Models Incorporating Object Variability.",
            "Registration and Analysis of Vascular Images.",
            "Untangling the Blum Medial Axis Transform.",
            "Multiscale Medial Loci and Their Properties."
        ]
    },
    {
        "name": "IJCV",
        "year": "2002",
        "info": "2002: Volumes\n46, 47, 48, 49, 50",
        "count": 78,
        "papers": [
            "3D Object Recognition in Cluttered Environments by Segment-Based Stereo Vision.",
            "Estimation of 2D Displacement Field Based on Affine Geometric Invariance and Scene Constraints.",
            "On the Consistency of Instantaneous Rigid Motion Estimation.",
            "Statistical Color Models with Application to Skin Detection.",
            "Cluster Analysis of Biomedical Image Time-Series.",
            "Hierarchical Estimation and Segmentation of Dense Motion Fields.",
            "New Measurements and Corner-Guidance for Curve Matching with Probabilistic Relaxation.",
            "Determination of Head Pose and Facial Expression from a Single Perspective View by Successive Scaled Orthographic Approximations.",
            "Subjective Surfaces: A Geometric Model for Boundary Completion.",
            "Geodesic Active Regions and Level Set Methods for Supervised Texture Segmentation.",
            "Guest Editorial: Stereo and Multi-Baseline Vision.",
            "A Taxonomy and Evaluation of Dense Two-Frame Stereo Correspondence Algorithms.",
            "Trinocular Stereo Using Shortest Paths and the Ordering Constraint.",
            "Trinocular Stereo: A Real-Time Algorithm and its Evaluation.",
            "Genetic-Based Stereo Algorithm and Disparity Map Evaluation.",
            "Calculating Dense Disparity Maps from Color Stereo Images, an Efficient Implementation.",
            "Range Segmentation Using Visibility Constraints.",
            "Fast Stereo Matching Using Rectangular Subregioning and 3D Maximum-Surface Techniques.",
            "Dense 3-D Reconstruction of an Outdoor Scene by Hundreds-Baseline Stereo Using a Hand-Held Video Camera.",
            "Generalized Multiple Baseline Stereo and Direct Virtual View Synthesis Using Range-Space Search, Match, and Render.",
            "Panoramic Depth Imaging: Single Standard Camera Approach.",
            "Stereo with Oblique Cameras.",
            "Generation of Temporally Consistent Multiple Virtual Camera Views from Stereoscopic Image Sequences.",
            "Spatio-Temporal Stereo Using Multi-Resolution Subdivision Surfaces.",
            "MAP-Based Stochastic Diffusion for Stereo Matching and Line Fields Estimation.",
            "Using Multiple-Hypothesis Disparity Maps and Image Velocity for 3-D Motion Estimation.",
            "Real-Time Correlation-Based Stereo Vision with Reduced Border Errors.",
            "Dense Features for Semi-Dense Stereo Correspondence.",
            "A Simple Stereo Algorithm to Recover Precise Object Boundaries and Smooth Surfaces.",
            "A Hierarchical Symmetric Stereo Algorithm Using Dynamic Programming.",
            "Self-Calibration of Rotating and Zooming Cameras.",
            "Three-Dimensional Reconstruction of Points and Lines with Unknown Correspondence.",
            "Editorial.",
            "Selection of Marr Prize and Honourable Mentions at ICCV'01.",
            "Probabilistic Tracking with Exemplars in a Metric Space.",
            "The Space of All Stereo Images.",
            "Aligning Non-Overlapping Sequences.",
            "On Projection Matrices Pk-> P2k=3, ..., 6, and their Applications in Computer Vision.",
            "Geotensity: Combining Motion and Lighting for 3D Surface Reconstruction.",
            "Self-Calibration from Image Derivatives.",
            "Plenoptic Image Editing.",
            "Estimation of Error in Curvature Computation on Multi-Scale Free-Form Surfaces.",
            "Correction to Construction of Panoramic Image Mosaics with Global and Local Alignment.",
            "Omnivergent Stereo.",
            "Multi-Frame Correspondence Estimation Using Subspace Constraints.",
            "A Pupil-Centric Model of Image Formation.",
            "Hamilton-Jacobi Skeletons.",
            "Vision and the Atmosphere.",
            "Appearance-Based Structure from Motion Using Linear Classes of 3-D Models.",
            "Epipolar Geometry for Central Catadioptric Cameras.",
            "A VLSI-Compatible Computer Vision Algorithm for Stereoscopic Depth Analysis in Real-Time.",
            "Partially Occluded Object Recognition Using Statistical Models.",
            "Algorithmic Fusion for More Robust Feature Tracking.",
            "Guest Editorial.",
            "Factorization with Uncertainty.",
            "Linear Multi View Reconstruction and Camera Recovery Using a Reference Plane.",
            "Scalable Extrinsic Calibration of Omni-Directional Image Networks.",
            "Multi-View Scene Capture by Surfel Sampling: From Video Streams to Non-Rigid 3D Motion, Shape and Reflectance.",
            "Helmholtz Stereopsis: Exploiting Reciprocity for Surface Reconstruction.",
            "Relighting with the Reflected Irradiance Field: Representation, Sampling and Reconstruction.",
            "Towards Active Machine-Vision-Based Driver Assistance for Urban Areas.",
            "Bayesian Model Estimation and Selection for Epipolar Geometry and Generic Manifold Fitting.",
            "Isophotes Selection and Reaction-Diffusion Model for Object Boundaries Estimation.",
            "Guest Introduction: The Changing Shape of Computer Vision in the Twenty-First Century.",
            "Visual Estimation and Compression of Facial Motion Parameters-Elements of a 3D Model-Based Video Coding System.",
            "Motion-Based Video Representation for Scene Change Detection.",
            "Modeling and Animating Realistic Faces from Images.",
            "Natural Language Description of Human Activities from Video Images Based on Concept Hierarchy of Actions.",
            "Rendering by Manifold Hopping.",
            "View-Invariant Representation and Recognition of Actions.",
            "Guest Editorial: Special Issue on Variational and Level Set Methods in Computer Vision.",
            "Orthonormal Vector Sets Regularization with PDE's and Applications.",
            "A Self-Referencing Level-Set Method for Image Reconstruction from Sparse Fourier Samples.",
            "A Multiphase Level Set Framework for Image Segmentation Using the Mumford and Shah Model.",
            "Diffusion Snakes: Introducing Statistical Shape Knowledge into the Mumford-Shah Functional.",
            "Using Prior Shapes in Geometric Active Contours in a Variational Framework.",
            "Variational Methods for Multimodal Image Matching.",
            "A Variational Approach for the Segmentation of the Left Ventricle in Cardiac Image Analysis."
        ]
    },
    {
        "name": "IJCV",
        "year": "2001",
        "info": "2001: Volumes\n41, 42, 43, 44, 45",
        "count": 56,
        "papers": [
            "Editorial.",
            "Introduction by Guest Editors.",
            "Order Parameters for Detecting Target Curves in Images: When Does High Level Knowledge Help?",
            "Occlusion Models for Natural Images: A Statistical Study of a Scale-Invariant Dead Leaves Model.",
            "Group Actions, Homeomorphisms, and Matching: A General Framework.",
            "Coarse-to-Fine Face Detection.",
            "The Joy of Sampling.",
            "Image-Based Rendering Using Parameterized Image Varieties.",
            "Reconstruction of General Curves, Using Factorization and Bundle Adjustment.",
            "COMVIS: A Communication Framework for Computer Vision.",
            "On the Performance of Connected Components Grouping.",
            "Guest Editors' Introduction.",
            "On Averaging Rotations.",
            "Spectral Mixture Analysis: Linear and Semi-parametric Full and Iterated Partial Unmixing in Multi- and Hyperspectral Image Data.",
            "Non-Linear Scale-Spaces Isomorphic to the Linear Case with Applications to Scalar, Vector and Multispectral Images.",
            "Complexity, Confusion, and Perceptual Grouping. Part I: The Curve-like Representation.",
            "Complexity, Confusion, and Perceptual Grouping. Part II: Mapping Complexity.",
            "Solving for Colour Constancy using a Constrained Dichromatic Reflection Model.",
            "Modeling the Shape of the Scene: A Holistic Representation of the Spatial Envelope.",
            "Scale Dependency of Image Derivatives for Feature Measurement in Curvilinear Structures.",
            "Projective Evolution of Plane Curves.",
            "Editorial.",
            "Contour and Texture Analysis for Image Segmentation.",
            "Representing and Recognizing the Visual Appearance of Materials using Three-dimensional Textons.",
            "Probabilistic Methods for Finding People.",
            "The Interpretation of Line Drawings with Contrast Failure and Shadows.",
            "A Minimum Cost Approach for Segmenting Networks of Lines.",
            "On Computing Structural Changes in Evolving Surfaces and their Appearance.",
            "Guest Editor's Introduction.",
            "Active Shape-from-Shadows with Controlled Illuminant Trajectories.",
            "Face Recognition Using the Discrete Cosine Transform.",
            "Active Object Recognition: Looking for Differences.",
            "On the Sequential Accumulation of Evidence.",
            "Recognition, Resolution, and Complexity of Objects Subject to Affine Transformations.",
            "Implementing a Multi-Model Estimation Method.",
            "Catadioptric Stereo Using Planar Mirrors.",
            "Statistical Modeling of Colour Data.",
            "Bayesian Object Localisation in Images.",
            "Deformable Pedal Curves and Surfaces: Hybrid Geometric Active Models for Shape Recovery.",
            "Numerical Shape-From-Shading for Discontinuous Photographic Images.",
            "Biologically Inspired Visual Motion Detection in VLSI.",
            "Characterizing Depth Distortion under Different Generic Motions.",
            "Optimization Criteria and Geometric Algorithms for Motion and Structure Estimation.",
            "Histogram Preserving Image Transformations.",
            "Statistical Richness of Visual Phase Information: Update on Recognizing Persons by Iris Patterns.",
            "A General Method for Geometric Feature Matching and Model Extraction.",
            "Symmetric Shape-from-Shading Using Self-ratio Image.",
            "Saliency, Scale and Image Description.",
            "Self-Calibration of Rotating and Zooming Cameras.",
            "Three-Dimensional Reconstruction of Points and Lines with Unknown Correspondence across Images.",
            "Constructing a Multivalued Representation for View Synthesis.",
            "Editorial.",
            "Video-Based Driver Assistance-From Basic Functions to Applications.",
            "Catadioptric Projective Geometry.",
            "A Theoretical Framework for Convex Regularizers in PDE-Based Computation of Image Motion.",
            "Motion Understanding: Task-Directed Attention and Representations that Link Perception with Action."
        ]
    },
    {
        "name": "IJCV",
        "year": "2000",
        "info": "2000: Volumes\n36, 37, 38, 39, 40",
        "count": 71,
        "papers": [
            "Learned Models for Estimation of Rigid and Articulated Human Motion from Stationary or Moving Camera.",
            "Recognition without Correspondence using Multidimensional Receptive Field Histograms.",
            "Probabilistic 3D Object Recognition.",
            "Linear Differential Algorithm for Motion Recovery: A Geometric Approach.",
            "Editorial.",
            "Systems and Experiment Paper: Construction of Panoramic Image Mosaics with Global and Local Alignment.",
            "Object Detection and Localization by Dynamic Template Warping.",
            "Diffusion of General Data on Non-Flat Manifolds via Harmonic Maps Theory: The Direction Diffusion Case.",
            "Design and Use of Linear Models for Image Motion Analysis.",
            "Point Light Source Estimation from Two Images and Its Limits.",
            "Texture Analysis through a Markovian Modelling and Fuzzy Classification: Application to Urban Area Extraction from Satellite Images.",
            "Guest Editorial.",
            "A Direct Interpretation of Dynamic Images with Camera and Object Motions for Vision Guided Robot Control.",
            "Application of Lie Algebras to Visual Servoing.",
            "Observability of 3D Motion.",
            "Robotic Control with Partial Visual Information.",
            "2 1/2 D Visual Servoing with Respect to Unknown Objects Through a New Estimation Scheme of Camera Displacement.",
            "Model-Based Stereo-Tracking of Non-Polyhedral Objects for Automatic Disassembly Experiments.",
            "Heteroscedastic Regression in Computer Vision: Problems with Bilinear Constraint.",
            "Evaluation of Interest Point Detectors.",
            "Introduction.",
            "Integrated Person Tracking Using Stereo, Color, and Pattern Detection.",
            "Visual Surveillance for Moving Vehicles.",
            "Fast Lighting Independent Background Subtraction.",
            "Statistical Models of Object Interaction.",
            "Extracting Structure from Optical Flow Using the Fast Error Search Technique.",
            "Structure from Motion: Beyond the Epipolar Constraint.",
            "Spherical Mosaics with Quaternions and Dense Correlation.",
            "A Cumulant Expansion Technique for Simultaneous Markov Random Field Image Restoration and Hyperparameter Estimation.",
            "Introduction: Learning and Vision at CBCL.",
            "Statistical Learning Theory: A Primer.",
            "A Trainable System for Object Detection.",
            "Learning to Recognize Visual Dynamic Events from Examples.",
            "Visual Speech Synthesis by Morphing Visemes.",
            "Morphable Models for the Analysis and Synthesis of Complex Motion Patterns.",
            "Morphable Surface Models.",
            "Optical Flow Constraints on Deformable Models with Applications to Face Tracking.",
            "Image Registration Using Wavelet-Based Motion Model.",
            "Regularized Bundle-Adjustment to Model Heads from Image Sequences without Calibration Data.",
            "Contour Tracking in Clutter: A Subset Approach.",
            "Editorial.",
            "A Theory of Shape by Space Carving.",
            "Euclidean Reconstruction and Reprojection Up to Subgroups.",
            "Probabilistic Detection and Tracking of Motion Boundaries.",
            "Equivalence of Julesz Ensembles and FRAME Models.",
            "Practical Structure and Motion from Stereo When Motion is Unconstrained.",
            "Separation of Transparent Layers using Focus.",
            "Reliable Estimation of Dense Optical Flow Fields with Large Displacements.",
            "A Probabilistic Exclusion Principle for Tracking Multiple Objects.",
            "Introduction: Computer Vision Research at the Technion.",
            "Control of a Camera for Active Vision: Foveal Vision, Smooth Tracking and Saccade.",
            "Shape Reconstruction of 3D Bilaterally Symmetric Surfaces.",
            "Images as Embedded Maps and Minimal Surfaces: Movies, Color, Texture, and Volumetric Medical Images.",
            "New Devices for 3D Pose Estimation: Mantis Eyes, Agam Paintings, Sundials, and Other Space Fiducials.",
            "Depth from Defocus vs. Stereo: How Different Really Are They?",
            "Color Constancy Using the Inter-Reflection from a Reference Nose.",
            "Optimal Structure from Motion: Local Ambiguities and Global Estimates.",
            "Probabilistic Modeling and Recognition of 3-D Objects.",
            "Guest Editorial: Statistical and Computational Theories of Vision: Modeling, Learning, Sampling and Computing, Part I.",
            "Meaningful Alignments.",
            "Learning Low-Level Vision.",
            "A Parametric Texture Model Based on Joint Statistics of Complex Wavelet Coefficients.",
            "How Optimal Depth Cue Integration Depends on the Task.",
            "The Earth Mover's Distance as a Metric for Image Retrieval.",
            "Single View Metrology.",
            "Probabilistic Models of Appearance for 3-D Object Recognition.",
            "Closed Form Solution of Local Shape from Shading at Critical Points.",
            "Editorial.",
            "A Level Set Model for Image Classification.",
            "The Geometry and Matching of Lines and Curves Over Multiple Views.",
            "Numerically Invariant Signature Curves."
        ]
    },
    {
        "name": "IJCV",
        "year": "1999",
        "info": "1999: Volumes\n31, 32, 33, 34, 35",
        "count": 60,
        "papers": [
            "Using Specific Displacements to Analyze Motion without Calibration.",
            "Structure and Motion Estimation from Dynamic Silhouettes under Perspective Projection.",
            "Robust Optical Flow Computation Based on Least-Median-of-Squares Regression.",
            "The Applicability of Green's Theorem to Computation of Rate of Approach.",
            "Computer Vision Research in Utrecht.",
            "Coherence-Enhancing Diffusion Filtering.",
            "Bidirectional Reflection Distribution Function of Thoroughly Pitted Surfaces.",
            "Invertible Apertured Orientation Filters in Image Analysis.",
            "The Structure of Locally Orderless Images.",
            "Texture histograms as a function of irradiation and viewing direction.",
            "Multiscale Segmentation of Three-Dimensional MR Brain Images.",
            "Reliable and Efficient Pattern Matching Using an Affine Invariant Metric.",
            "Image Registration for Digital Subtraction Angiography.",
            "Pseudo-Linear Scale-Space Theory.",
            "Editorial.",
            "Self-Calibration and Metric Reconstruction Inspite of Varying and Unknown Intrinsic Camera Parameters.",
            "The Problem of Degeneracy in Structure and Motion Recovery from Uncalibrated Image Sequences.",
            "Stereo Matching with Transparency and Matting.",
            "Automatic Detection of Human Nudes.",
            "Improving Depth Image Acquisition Using Polarized Light.",
            "General Object Reconstruction Based on Simplex Meshes.",
            "Temporal Multi-Scale Models for Flow and Acceleration.",
            "An Autonomous Active Vision System for Complete and Accurate 3D Scene Reconstruction.",
            "Geometry of Distorted Visual Space and Cremona Transformation.",
            "Reflectance and Shape from Images Using a Collinear Light Source.",
            "Topographic Maps and Local Contrast Changes in Natural Images.",
            "Non Uniform Multiresolution Method for Optical Flow and Phase Portrait Models: Environmental Applications.",
            "Generalised Epipolar Constraints.",
            "Calibrating a Structured Light Stripe System: A Novel Approach.",
            "When is it Possible to Identify 3D Objects From Single Images Using Class Constraints?",
            "Visual Homing: Surfing on the Epipoles.",
            "Sparse Representations for Image Decompositions.",
            "Affine Structure and Motion from Points, Lines and Conics.",
            "Large Occlusion Stereo.",
            "Visual Recognition and Categorization on the Basis of Similarities to Multiple Class Prototypes.",
            "Robust Descriptors of Binary Shapes with Applications.",
            "Some Remarks on the Equivalence between 2D and 3D Classical Snakes and Geodesic Active Contours.",
            "Linearised Euclidean Shortening Flow of Curve Geometry.",
            "Introduction: Computer Vision Research at NECI.",
            "A Comparison of Measures for Detecting Natural Shapes in Cluttered Backgrounds.",
            "Are Edges Incomplete?",
            "3-D to 2-D Pose Determination with Regions.",
            "Stereo Without Epipolar Lines: A Maximum-Flow Formulation.",
            "A Multi-Frame Structure-from-Motion Algorithm under Perspective Projection.",
            "When Shadows Become Interreflections.",
            "Computational Vision at Yale.",
            "Shock Graphs and Shape Matching.",
            "The Bas-Relief Ambiguity.",
            "Incremental Focus of Attention for Robust Vision-Based Tracking.",
            "What Tasks can be Performed with an Uncalibrated Stereo Vision System?",
            "Volumetric Deformation Analysis Using Mechanics-Based Data Fusion: Applications in Cardiac Motion Recovery.",
            "Theory and Practice of Projective Rectification.",
            "3D Photography Using Shadows in Dual-Space Geometry.",
            "Photorealistic Scene Reconstruction by Voxel Coloring.",
            "A Theory of Single-Viewpoint Catadioptric Image Formation.",
            "Determining Generative Models of Objects Under Varying Illumination: Shape and Albedo from Multiple Images Using SVD and Integrability.",
            "Optimum Fiducials Under Weak Perspective Projection.",
            "Spatial Color Indexing and Applications.",
            "Depth Discontinuities by Pixel-to-Pixel Stereo.",
            "Combination of Edge Element and Optical Flow Estimates for 3D-Model-Based Vehicle Tracking in Traffic Image Sequences."
        ]
    },
    {
        "name": "IJCV",
        "year": "1998",
        "info": "1998: Volumes\n26, 27, 28, 29, 30",
        "count": 58,
        "papers": [
            "Directions of Motion Fields are Hardly Ever Ambiguous.",
            "Dense Non-Rigid Motion Estimation in Sequences of Medical Images Using Differential Constraints.",
            "Chirality.",
            "EigenTracking: Robust Matching and Tracking of Articulated Objects Using a View-Based Representation.",
            "Stereo and Specular Reflection.",
            "Differential and Numerically Invariant Signature Curves Applied to Object Recognition.",
            "Efficient Invariant Representations.",
            "Edge and Depth from Focus.",
            "Geometric Information Criterion for Model Selection.",
            "New Geometric Methods for Computer Vision: An Application to Structure and Motion Estimation.",
            "Fast, Accurate and Consistent Modeling of Drainage and Surrounding Terrain.",
            "Model-Based Localisation and Recognition of Road Vehicles.",
            "Parametric Feature Detection.",
            "Extracting Salient Curves from Images: An Analysis of the Saliency Network.",
            "Hierarchical Image Segmentation - Part I: Detection of Regular Curves in a Vector Graph.",
            "Filters, Random Fields and Maximum Entropy (FRAME): Towards a Unified Theory for Texture Modeling.",
            "Uncertainty Propagation in Model-Based Recognition.",
            "Determining the Epipolar Geometry and its Uncertainty: A Review.",
            "Rational Filters for Passive Depth from Defocus.",
            "Dual Computation of Projective Shape and Camera Positions from Multiple Images.",
            "Robust Algorithms for Object Localization.",
            "The Intrinsic Structure of Optic Flow Incorporating Measurement Duality.",
            "Adaptive Road Recognition and Ego-state Tracking in the Presence of Obstacles.",
            "Robust Shape Recovery from Occluding Contours Using a Linear Smoother.",
            "New Visual Invariants for Terrain Navigation Without 3D Reconstruction.",
            "Polarization Phase-Based Method For Material Classification In Computer Vision.",
            "Continuous Time Matching Constraints for Image Streams.",
            "Synthesis of Novel Views from a Single Face Image.",
            "Quasi-Invariant Parameterisations and Matching of Curves in Images.",
            "Ambiguity in Structure from Motion: Sphere versus Plane.",
            "Stereo Matching with Nonlinear Diffusion.",
            "Temporal Analysis of Motion in Video Sequences through Predictive Operators.",
            "Rapid Anisotropic Diffusion Using Space-Variant Vision.",
            "Diffeomorphisms Groups and Pattern Matching in Image Analysis.",
            "Epipolar Geometry and Linear Subspace Methods: A New Approach to Weak Calibration.",
            "What Is the Set of Images of an Object Under All Possible Illumination Conditions?",
            "Estimating the Focus of Expansion in Analog VLSI.",
            "CONDENSATION - Conditional Density Propagation for Visual Tracking.",
            "Detecting Symmetry in Grey Level Images: The Global Optimization Approach.",
            "Transfer of Fixation Using Affine Structure: Extending the Analysis to Stereo.",
            "Robust Optic Flow Computation.",
            "Reliable and Efficient Computation of Optical Flow.",
            "Multidimensional Morphable Models: A Framework for Representing and Matching Object Classes.",
            "Multibody Grouping from Motion Images.",
            "A Multibody Factorization Method for Independently Moving Objects.",
            "On the Importance of Being Asymmetric in Stereopsis - Or Why We Should Use Skewed Parallel Cameras.",
            "A Level-Set Approach to 3D Reconstruction from Range Data.",
            "Generalization to Novel Views: Universal, Class-based, and Model-based Processing.",
            "Reduced Multilinear Constraints: Theory and Experiments.",
            "The Tractability of Segmentation and Scene Analysis.",
            "Global and Local Active Contours for Head Boundary Extraction.",
            "Improved Diffuse Reflection Models for Computer Vision.",
            "Feature Detection with Automatic Scale Selection.",
            "Edge Detection and Ridge Detection with Automatic Scale Selection.",
            "Exploiting Discontinuities in Optical Flow.",
            "Performance Analysis of Maximum Likelihood Estimator for Recovery of Depth from Defocused Images and Optimal Selection of Camera Parameters.",
            "Three-Dimensional Human Body Model Acquisition from Multiple Views.",
            "Relaxing the Triangle Inequality in Pattern Matching."
        ]
    },
    {
        "name": "IJCV",
        "year": "1997",
        "info": "1997: Volumes\n21, 22, 23, 24, 25",
        "count": 62,
        "papers": [
            "Introduction: Object Recognition Research at MIT.",
            "Data and Model-Driven Selection Using Color Regions.",
            "Polynomial-Time Geometric Matching for Object Recognition.",
            "Statistical Approaches to Feature-Based Object Recognition.",
            "On Photometric Issues in 3D Visual Recognition from a Single 2D Image.",
            "Matching 3-D Models to 2-D Images.",
            "Separation of Reflection Components Using Color and Polarization.",
            "A General Framework for Geometry-Driven Evolution Equations.",
            "Parameter Estimation for Optimal Object Recognition: Theory and Application.",
            "On the Geometry of Visual Correspondence.",
            "Self-Calibration of Stationary Cameras.",
            "Moment and Hypergeometric Filters for High Precision Computation of Focus, Stereo and Optical Flow.",
            "Geodesic Active Contours.",
            "Gradient Based Image Motion Estimation Without Computing Gradients.",
            "A Note on Some Phase Differencing Algorithms for Disparity Estimation.",
            "Lines and Points in Three Views and the Trifocal Tensor.",
            "A General Motion Model and Spatio-Temporal Filters for Computing Optical Flow.",
            "Object Pose: The Link between Weak Perspective, Paraperspective, and Full Perspective.",
            "Spline-Based Image Registration.",
            "3D Surface Reconstruction Using Occluding Contours.",
            "Self-Calibration of a Moving Camera from Point Correspondences and Fundamental Matrices.",
            "Number of Solutions for Motion and Structure from Multiple Frame Correspondence.",
            "The Critical Sets of Lines for Camera Displacement Estimation: A Mixed Euclidean-Projective and Constructive Approach.",
            "SUSAN - A New Approach to Low Level Image Processing.",
            "Topographical Properties of Generic Images.",
            "Topological Reconstruction of a Smooth Manifold-Solid from Its Occluding Contour.",
            "Following Cusps.",
            "Efficient Pose Clustering Using a Randomized Algorithm.",
            "Computing Local Surface Orientation and Shape from Texture for Curved Surfaces.",
            "Computing Size Functions from Edge Maps.",
            "The Quadric Reference Surface: Theory and Applications.",
            "Singularities of Illuminated Surfaces.",
            "The Generic Bilinear Calibration-Estimation Problem.",
            "Sequential Updating of Projective and Affine Structure from Motion.",
            "Detection and Recognition of Periodic, Nonrigid Motion.",
            "3D Pose Estimation by Directly Matching Polyhedral Models to Gray Value Gradients.",
            "A New Metric for Grey-Scale Image Comparison.",
            "From Multiple Stereo Views to Multiple 3-D Surfaces.",
            "Analyzing and Synthesizing Images by Evolving Curves with the Osher-Sethian Method.",
            "Global Minimum for Active Contour Models: A Minimal Path Approach.",
            "Dynamic Vergence Using Log-Polar Images.",
            "Editorial.",
            "A Theory of Specular Surface Geometry.",
            "Shape from Shading with Interreflections Under a Proximal Light Source: Distortion-Free Copying of an Unfolded Book.",
            "Alignment by Maximization of Mutual Information.",
            "Reconstruction from Image Sequences by Means of Relative Depths.",
            "Hypergeometric Filters for Optical Flow and Affine Matching.",
            "Model-Based Detection and Localization of Circular Landmarks in Aerial Images.",
            "Multi-Scale Blur Estimation and Edge Type Classification for Scene Analysis.",
            "Efficiently Locating Objects Using the Hausdorff Distance.",
            "The Development and Comparison of Robust Methods for Estimating the Fundamental Matrix.",
            "Improved Accuracy in Gradient-Based Optical Flow Estimation.",
            "Recognizing Facial Expressions in Image Sequences Using Local Parameterized Models of Image Motion.",
            "Multi-Level Shape Representation Using Global Deformations and Locally Adaptive Finite Elements.",
            "Point Signatures: A New Representation for 3D Object Recognition.",
            "Affine Morphological Multiscale Analysis of Corners and Multiple Junctions.",
            "Learning Recognition and Segmentation Using the Cresceptron.",
            "Recognition Using Region Correspondences.",
            "3-D Scene Data Recovery Using Omnidirectional Multibaseline Stereo.",
            "Ziplock Snakes.",
            "A Framework for Uncertainty and Validation of 3-D Registration Methods Based on Points and Frames.",
            "View-Invariant Analysis of Cyclic Motion."
        ]
    },
    {
        "name": "IJCV",
        "year": "1996",
        "info": "1996: Volumes\n17, 18, 19, 20",
        "count": 49,
        "papers": [
            "Motion of points and lines in the uncalibrated case.",
            "The fundamental matrix: Theory, algorithms, and stability analysis.",
            "3D free-form surface registration and object recognition.",
            "Machine vision research at CVAP: An introduction.",
            "Dynamic fixation and active perception.",
            "Active fixation for scene exploration.",
            "Direct computation of shape cues using scale-adapted spatial derivative operators.",
            "Projectively invariant decomposition and recognition of planar shapes.",
            "Reflectance based object recognition.",
            "Detection of diffuse and specular interface reflections and inter-reflections by color image segmentation.",
            "On convergence in the methods of Strat and of Smith for Shape from Shading.",
            "Parabolic curves of evolving surfaces.",
            "What can two images tell us about a third one?",
            "Recognizing algebraic surfaces from their outlines.",
            "Active tracking of foveated feature clusters using affine structure.",
            "The Gaussian scale-space paradigm and the multiscale local jet.",
            "Quantitative planar region detection.",
            "Rigid, affine and locally affine registration of free-form surfaces.",
            "New feature points based on geometric invariants for 3D image registration.",
            "The complexity of understanding line drawings of origami scenes.",
            "Matching 3-D anatomical surfaces with non-rigid deformations using octree-splines.",
            "Ridges, crests and sub-parabolic lines of evolving surfaces.",
            "FEG structures for representation and recognition of 3-D polyhedral objects.",
            "Photobook: Content-based manipulation of image databases.",
            "The use of optical flow for the analysis of non-rigid motions.",
            "Constraint fusion for recognition and localization of articulated objects.",
            "Computation and analysis of image motion: A synopsis of current problems and methods.",
            "On the unification of line processes, outlier rejection, and robust statistics with applications in early vision.",
            "Self-calibration of an affine camera from multiple views.",
            "The extremal mesh and the understanding of 3D surfaces.",
            "Locating human faces in photographs.",
            "Recognition by prototypes.",
            "Paraperspective = affine.",
            "Object recognition by combining paraperspective images.",
            "Semi-local projective invariants for the recognition of smooth plane curves.",
            "A Bayesian approach to binocular steropsis.",
            "The enumerative geometry of projective algebraic surfaces and the complexity of aspect graphs.",
            "Sub-pixel Bayesian estimation of albedo and height.",
            "Computer vision research at the University of Southern California.",
            "Volumetric descriptions from a single intensity image.",
            "Recovering LSHGCs and SHGCs from stereo.",
            "Perceptual grouping for generic recognition.",
            "B-rep object description from multiple range views.",
            "Inferring global pereeptual contours from local features.",
            "Geometric constraints and stereo disparity computation.",
            "Range estimation from focus using a non-frontal imaging camera.",
            "FORMS: A flexible object recognition and modelling system.",
            "Using collineations to compute motion and structure in an uncalibrated image sequence.",
            "Exploiting the generic viewpoint assumption."
        ]
    },
    {
        "name": "IJCV",
        "year": "1995",
        "info": "1995: Volumes\n14, 15, 16",
        "count": 36,
        "papers": [
            "Visual learning and recognition of 3-d objects from appearance.",
            "Foundations of semi-differential invariants.",
            "Recognition of planar shapes under affine distortion.",
            "Robust computation of optical flow in a multi-scale differential framework.",
            "Contour extraction of moving objects in complex outdoor scenes.",
            "Guest editorial: Qualitative vision.",
            "Context-free attentional operators: The generalized symmetry transform.",
            "Optical flow from 1-D correlation: Application to a simple time-to-crash detector.",
            "Passive navigation as a pattern recognition problem.",
            "Divergent stereo in autonomous navigation: From bees to robots.",
            "Discrete event modeling of visually guided behaviors.",
            "Probabilistic analysis of the application of the cross ratio to model based vision: Misclassification.",
            "Occlusions and binocular stereo.",
            "Generalization of the Lambertian model and implications for machine vision.",
            "Segmentation of range images as the search for geometric parametric models.",
            "Guest editor's introduction.",
            "Qualitative egomotion.",
            "Automatic feature point extraction and tracking in image sequences for arbitrary camera motion.",
            "Experiments on estimating egomotion and structure parameters using long monocular image sequences.",
            "Egomotion analysis based on the Frenet-Serret motion model.",
            "Model-based object pose in 25 lines of code.",
            "Recovery of temporal information from static images of handwriting.",
            "An intensity-based cooperative bidirectional stereo matching with simultaneous detection of discontinuities and occlusions.",
            "Shapes, shocks, and deformations I: The components of two-dimensional shape and the reaction-diffusion space.",
            "Object pose from 2-D to 3-D point and line correspondences.",
            "Hierarchical stereo and motion correspondence using feature groupings.",
            "Optical flow estimation and the interaction between measurement errors at adjacent pixel positions.",
            "Probabilistic analysis of the application of the cross ratio to model based vision.",
            "Object-centered surface reconstruction: Combining multi-image stereo and shading.",
            "Planar object recognition using projective shape representation.",
            "Shape from shading: Level set propagation and viscosity solutions.",
            "Markov fusion of a pair of noisy images to detect intensity valleys.",
            "3D Motion recovery via affine Epipolar geometry.",
            "The dynamic retina: Contrast and motion detection for active vision.",
            "Driving saccade to pursuit using image motion.",
            "A neural architecture for visual information processing."
        ]
    },
    {
        "name": "IJCV",
        "year": "1994",
        "info": "1994: Volumes\n12, 13",
        "count": 25,
        "papers": [
            "Computing occluding and transparent motions.",
            "Toward color image segmentation in analog VLSI: Algorithm and hardware.",
            "Performance of optical flow techniques.",
            "Smoothing and matching of 3-d space curves.",
            "Guest editorial.",
            "Recovering shape by purposive viewpoint adjustment.",
            "Planning multiple observations for object recognition.",
            "Control of selective perception using bayes nets and decision theory.",
            "Using intermediate objects to improve the efficiency of visual search.",
            "TRICLOPS: A tool for studying active vision.",
            "A study of affine matching with bounded sensor error.",
            "Estimating the heading direction using normal flow.",
            "Robust estimation of egomotion from normal flow.",
            "Space variant image processing.",
            "Analyzing skewed symmetries.",
            "Iterative point matching for registration of free-form curves and surfaces.",
            "Robust and fast computation of edge characteristics in image sequences.",
            "Constrained pose refinement of parametric objects.",
            "Three-dimensional shape from color photometric stereo.",
            "Region-based strategies for active contour models.",
            "Fast computation of unbiased intensity derivatives in images using separable filters.",
            "Depth from defocus: A spatial domain approach.",
            "Mirror uncertainty and uniqueness conditions for determining shape and motion from orthographic projection.",
            "Integrating qualitative and quantitative shape recovery.",
            "Review and analysis of solutions of the three point perspective pose estimation problem."
        ]
    },
    {
        "name": "IJCV",
        "year": "1993",
        "info": "1993: Volumes\n10, 11",
        "count": 29,
        "papers": [
            "Editorial.",
            "Conics-based stereo, motion estimation, and pose determination.",
            "Model-based invariants for 3-D vision.",
            "An analog network for continuous-time segmentation.",
            "A review of statistical data association techniques for motion correspondence.",
            "Interpretation of conic motion and its applications.",
            "Computer vision research at INRIA.",
            "A computational approach for corner and vertex detection.",
            "A theory of the motion fields of curves.",
            "Motion segmentation and qualitative dynamic scene analysis from an image sequence.",
            "Topological segmentation of discrete surfaces.",
            "Geometric invariants and object recognition.",
            "Design and recovery of 2-D and 3-D shapes using rational Gaussian curves and surfaces.",
            "Model-based object tracking in monocular image sequences of road traffic scenes.",
            "A Bayesian multiple-hypothesis approach to edge grouping and contour segmentation.",
            "Affine invariant scale-space.",
            "The multiscale veto model: A two-stage analog network for edge detection and image reconstruction.",
            "Silt: A distributed bit-parallel architecture for early vision.",
            "A 3-D vision system model for automatic object surface sensing.",
            "Guest editorial.",
            "Promising directions in active vision.",
            "A framework for spatiotemporal control in the tracking of visual contours.",
            "Real-time binocular smooth pursuit.",
            "The role of fixation in visual motion analysis.",
            "Active vision for reliable ranging: Cooperating focus, stereo, and vergence.",
            "Image matching using the windowed Fourier phase.",
            "Trackability as a cue for potential obstacle identification and 3-D description.",
            "3-D interpretation of optical flow by renormalization.",
            "Detecting salient blob-like image structures and their scales with a scale-space primal sketch: A method for focus-of-attention."
        ]
    },
    {
        "name": "IJCV",
        "year": "1992",
        "info": "1992: Volumes\n8, 9",
        "count": 23,
        "papers": [
            "Finding convex edge groupings in an image.",
            "Measurement and integration of 3-D structures by tracking edge lines.",
            "Stereo vision for planetary rovers: Stochastic modeling to near real-time implementation.",
            "Feature extraction from faces using deformable templates.",
            "Robust model-based motion tracking through the integration of search and estimation.",
            "A theory of self-calibration of a moving camera.",
            "Computation of discontinuous optical flow by domain decomposition and shape optimization.",
            "A VLSI pyramid chip for multiresolution image analysis.",
            "Analog VLSI circuits for stimulus localization and centroid computation.",
            "Computing motion using analog VLSI vision chips: An experimental comparison among different approaches.",
            "Analog VLSI systems for image acquisition and fast early vision processing.",
            "Dynamic wires: An alanog VLSI model for object-based processing.",
            "Introduction: Machine vision research at Osaka University.",
            "Computer vision based on a hypothesization and verification scheme by parallel relaxation.",
            "Dynamic integration of height maps into a 3D world representation from range image sequences.",
            "Panoramic representation for route recognition by a mobile robot.",
            "Surface shape from the deformation of apparent contours.",
            "An optimization-based approach to the interpretation of single line drawings as 3D wire frames.",
            "Shape and motion from image streams under orthography: a factorization method.",
            "Motion recovery from image sequences using only first order optical flow information.",
            "Constructing object models from multiple images.",
            "Recognizing corners by fitting parametric models.",
            "Computing exact aspect graphs of curved objects: Algebraic surfaces."
        ]
    },
    {
        "name": "IJCV",
        "year": "1991",
        "info": "1991/1992: Volume 7",
        "count": 14,
        "papers": [
            "Introduction: Vision as intelligent behavior - An introduction to machine vision at the University of Rochester.",
            "Color indexing.",
            "Qualitative detection of motion by a moving observer.",
            "Controlling eye movements with hidden Markov models.",
            "Real-time vergence control for binocular robots.",
            "Subspace methods for recovering rigid motion I: Algorithm and implementation.",
            "Impossible and ambiguous shading patterns.",
            "On the relative complexity of active vs. passive visual search.",
            "A locally adaptive window for signal matching.",
            "Global bifurcation sets and stable projections of nonsingular algebraic surfaces.",
            "The cost of choosing the wrong model in object recognition by constrained search.",
            "Three-dimensional motion computation and object segmentation in a long sequence of stereo frames.",
            "Visual tracking of known three-dimensional objects.",
            "Similarity-invariant signatures for partially occluded planar shapes."
        ]
    },
    {
        "name": "IJCV",
        "year": "1991",
        "info": "1991: Volume 6",
        "count": 12,
        "papers": [
            "Color constancy from mutual reflection.",
            "Determining optical flow for irregular domains by minimizing quadratic functionals of a certain class.",
            "A cost-benefit analysis of a third camera for stereo correspondence.",
            "Robust regression methods for computer vision: A review.",
            "Uniqueness in shape from shading.",
            "Asymptotic bayesian surface estimation using an image sequence.",
            "Computing optical flow across multiple scales: An adaptive coarse-to-fine strategy.",
            "Emulating the human interpretation of line-drawings as three-dimensional objects.",
            "Shape from interreflections.",
            "A topological stereo matcher.",
            "A common framework for image segmentation.",
            "A multi-frame approach to visual motion perception."
        ]
    },
    {
        "name": "IJCV",
        "year": "1990",
        "info": "1990: Volumes\n4, 5",
        "count": 25,
        "papers": [
            "Editorial.",
            "A physical approach to color image understanding.",
            "Detecting moving objects.",
            "Relative orientation.",
            "Straight homogeneous generalized cylinders: Differential geometry and uniqueness results.",
            "Automatic extraction of deformable part models.",
            "Using vanishing points for camera calibration.",
            "Stereo and controlled movement.",
            "Linear shape from shading.",
            "Structure from motion using line correspondences.",
            "The theory and practice of Bayesian image labeling.",
            "Analog hardware for detecting discontinuities in early vision.",
            "Motion from point matches: Multiplicity of solutions.",
            "A novel algorithm for color constancy.",
            "Height and gradient from shading.",
            "Computation of component image velocity from local phase information.",
            "Integrability disambiguates surface recovery in two-image photometric stereo.",
            "Computing exact aspect graphs of curved objects: Solids of revolution.",
            "Visibility, occlusion, and the aspect graph.",
            "Invariant surface segmentation through energy minimization with discontinuities.",
            "Recognizing solid objects by alignment with an image.",
            "Potentials, valleys, and dynamic global coverings.",
            "The feasibility of motion and structure from noisy time-varying image velocity information.",
            "Bayesian modeling of uncertainty in low-level vision.",
            "Reading cursive handwriting by alignment of letter prototypes."
        ]
    },
    {
        "name": "IJCV",
        "year": "1989",
        "info": "1989: Volume 3",
        "count": 15,
        "papers": [
            "An overview of computer vision research at SRI International - Themes and progress.",
            "Stochastic stereo matching over scale.",
            "Generalizing Epipolar-Plane Image Analysis on the spatiotemporal surface.",
            "Building surfaces of evolution: The Weaving Wall.",
            "Constructing simple stable descriptions for image partitioning.",
            "Color from black and white.",
            "Organization of smooth image curves at multiple scales.",
            "Representing oriented piecewise C2 surfaces.",
            "A mathematical analysis of the motion coherence theory.",
            "From image sequences to recognized moving polyhedral objects.",
            "Kalman filter-based algorithms for estimating depth from image sequences.",
            "Perspective angle transform: Principle of shape from angles.",
            "Reconstruction of consistent shape from inconsistent data: Optimization of 2 1/2 D sketches.",
            "Critical surface pairs and triplets.",
            "Texture models and image measures for texture discrimination."
        ]
    },
    {
        "name": "IJCV",
        "year": "1988",
        "info": "1988/1989: Volume 2",
        "count": 17,
        "papers": [
            "Editorial.",
            "The measurement of highlights in color images.",
            "Computing volume descriptions from sparse 3-D data.",
            "Direct methods for recovering motion.",
            "Interpretation of image flow: Rigid curved surfaces in motion.",
            "Line-drawing interpretation: A mathematical framework.",
            "A framework for object recognition in a visually complex environment and its application to locating address blocks on mail pieces.",
            "Shape from patterns: Regularization.",
            "Editorial.",
            "Computer vision research at the University of Massachusetts - Themes and progress.",
            "The schema system.",
            "The image understanding architecture.",
            "A computational framework and an algorithm for the measurement of visual motion.",
            "Segmenting images using localized histograms and region merging.",
            "On the recognition of parameterized 2D objects.",
            "Recovery of the 3-D location and motion of a rigid object through camera image (An Extended Kalman Filter Approach).",
            "Motion from flow along contours: A note on robustness and ambiguous cases."
        ]
    },
    {
        "name": "IJCV",
        "year": "1987",
        "info": "1987/1988: Volume 1",
        "count": 16,
        "papers": [
            "Epipolar-plane image analysis: An approach to determining structure from motion.",
            "The viewpoint consistency constraint.",
            "Interpreting line drawings of curved objects.",
            "Efficient registration of stereo images by matching graph descriptions of edge segments.",
            "Signal matching through scale space.",
            "Generating an interpretation tree from a CAD model for 3D-object recognition in bin-picking tasks.",
            "Using Canny's criteria to derive a recursively implemented optimal edge detector.",
            "Finding the limbs and cusps of generalized cylinders.",
            "Symmetry-seeking models and 3D object reconstruction.",
            "Focusing.",
            "Closed-form solutions to image flow equations for 3D structure and motion.",
            "Motion fields are hardly ever ambiguous.",
            "Optical flow using spatiotemporal filters.",
            "Snakes: Active contour models.",
            "Active vision.",
            "Linear image features in stereopsis."
        ]
    }
]