[
    {
        "name": "IJDAR",
        "year": "2021",
        "info": "Volume 24: 2021",
        "count": 25,
        "papers": [
            "Deep learning for graphics recognition: document understanding and beyond.",
            "Arrow R-CNN for handwritten diagram recognition.",
            "Knowledge-driven description synthesis for floor plan interpretation.",
            "Cross-modal photo-caricature face recognition based on dynamic multi-task learning.",
            "CNN-based segmentation of speech balloons and narrative text boxes from comic book page images.",
            "Translating math formula images to LaTeX sequences using deep neural networks with sequence-level training.",
            "Combination of deep neural networks and logical rules for record segmentation in historical handwritten registers using few examples.",
            "Offline script recognition from handwritten and printed multilingual documents: a survey.",
            "Text recognition for Vietnamese identity card based on deep features network.",
            "Persian handwritten digit, character and word recognition using deep learning.",
            "Editorial for special issue on \"Advanced Topics in Document Analysis and Recognition\".",
            "Learning from similarity and information extraction from structured documents.",
            "Learning-free pattern detection for manuscript research.",
            "Revealing a history: palimpsest text separation with generative networks.",
            "A two-step framework for text line segmentation in historical Arabic and Latin document images.",
            "Self-supervised deep metric learning for ancient papyrus fragments retrieval.",
            "Asking questions on handwritten document collections.",
            "EAML: ensemble self-attention-based mutual learning network for document image classification.",
            "Beyond document object detection: instance-level segmentation of complex layouts.",
            "Data Augmentation using Geometric, Frequency, and Beta Modeling approaches for Improving Multi-lingual Online Handwriting Recognition.",
            "Segmentation of text lines using multi-scale CNN from warped printed and handwritten document images.",
            "TextPolar: irregular scene text detection using polar representation.",
            "SKFont: skeleton-driven Korean font generator with conditional deep adversarial networks.",
            "A hybrid approach to recognize generic sections in scholarly documents.",
            "Extracting text from scanned Arabic books: a large-scale benchmark dataset and a fine-tuned Faster-R-CNN model."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2020",
        "info": "Volume 23: 2020",
        "count": 18,
        "papers": [
            "Even big data is not enough: need for a novel reference modelling for forensic document authentication.",
            "Document analysis systems that improve with use.",
            "Total-Text: toward orientation robustness in scene text detection.",
            "A unified method for augmented incremental recognition of online handwritten Japanese and English text.",
            "Efficient and effective OCR engine training.",
            "Fast multi-language LSTM-based online handwriting recognition.",
            "MA-CRNN: a multi-scale attention CRNN for Chinese text line recognition in natural scenes.",
            "An adaptive document recognition system for lettrines.",
            "Exploiting complexity in pen- and touch-based signature biometrics.",
            "A general framework for the recognition of online handwritten graphics.",
            "Hyperkernel-based intuitionistic fuzzy c-means for denoising color archival document images.",
            "Model-based Persian calligraphy synthesis via learning to transfer templates to personal styles.",
            "A benchmark for unconstrained online handwritten Uyghur word recognition.",
            "A robust watermarking approach for security issue of binary documents using fully convolutional networks.",
            "Single shot multi-oriented text detection based on local and non-local features.",
            "Automatic room information retrieval and classification from floor plan using linear regression model.",
            "DetectGAN: GAN-based text detector for camera-captured document images.",
            "Optical character recognition with neural networks and post-correction with finite state methods."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2019",
        "info": "Volume 22: 2019",
        "count": 29,
        "papers": [
            "An improved discriminative region selection methodology for online handwriting recognition.",
            "A comparative study of delayed stroke handling approaches in online handwriting.",
            "Stroke order normalization for improving recognition of online handwritten mathematical expressions.",
            "Online signature verification based on string edit distance.",
            "A framework for information extraction from tables in biomedical literature.",
            "Plug-and-play approach to class-adapted blind image deblurring.",
            "Metro maps for efficient knowledge learning by summarizing massive electronic textbooks.",
            "Real-time Kinect-based air-writing system with a novel analytical classifier.",
            "The achievement of higher flexibility in multiple-choice-based tests using image classification techniques.",
            "Scene text detection and recognition with advances in deep learning: a survey.",
            "Bleed-through cancellation in non-rigidly misaligned recto-verso archival manuscripts based on local registration.",
            "A novel CNN structure for fine-grained classification of Chinese calligraphy styles.",
            "Editorial for special issue on \"Advanced Topics in Document Analysis and Recognition\".",
            "Are 2D-LSTM really dead for offline text recognition?",
            "Boosting scene character recognition by learning canonical forms of glyphs.",
            "Generalized framework for summarization of fixed-camera lecture videos by detecting and binarizing handwritten content.",
            "Dynamic temporal residual network for sequence modeling.",
            "A comparison of local features for camera-based document image retrieval and spotting.",
            "Comic MTL: optimized multi-task learning for comic book image analysis.",
            "A two-stage method for text line detection in historical documents.",
            "On optimal stopping strategies for text recognition in a video stream as an application of a monotone sequential decision model.",
            "An anchor-free region proposal network for Faster R-CNN-based text detection approaches.",
            "Handwritten Arabic text recognition using multi-stage sub-core-shape HMMs.",
            "Coarse-to-fine document localization in natural scene image with regional attention and recursive corner refinement.",
            "Evaluation of word spotting under improper segmentation scenario.",
            "Patch-based offline signature verification using one-class hierarchical deep learning.",
            "HWNet v2: an efficient word image representation for handwritten documents.",
            "HanFont: large-scale adaptive Hangul font recognizer using CNN and font clustering.",
            "A novel feature transform framework using deep neural network for multimodal floor plan retrieval."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2018",
        "info": "Volume 21: 2018",
        "count": 20,
        "papers": [
            "Text and non-text separation in offline document images: a survey.",
            "Recognition-based character segmentation for multi-level writing style.",
            "Efficient document image binarization using heterogeneous computing and parameter tuning.",
            "Making scanned Arabic documents machine accessible using an ensemble of SVM classifiers.",
            "A novel Arabic OCR post-processing using rule-based and word context techniques.",
            "Text box proposals for handwritten word spotting from documents.",
            "Fusion of LLE and stochastic LEM for Persian handwritten digits recognition.",
            "Binarization of degraded document images based on contrast enhancement.",
            "Handling noise in textual image resolution enhancement using online and offline learned dictionaries.",
            "Special issue on deep learning for document analysis and recognition.",
            "Learning to detect, localize and recognize many text objects in document images from few examples.",
            "Fully convolutional network with dilated convolutions for handwritten text line segmentation.",
            "Integrating scattering feature maps with convolutional neural networks for Malayalam handwritten character recognition.",
            "Attribute CNNs for word spotting in handwritten documents.",
            "Fixed-sized representation learning from offline handwritten signatures of different sizes.",
            "Building efficient CNN architecture for offline handwritten Chinese character recognition.",
            "A comprehensive study of hybrid neural network hidden Markov model for offline handwritten Chinese text recognition.",
            "Augmented incremental recognition of online handwritten mathematical expressions.",
            "A combined strategy of analysis for the localization of heterogeneous form fields in ancient pre-printed records.",
            "KERTAS: dataset for automatic dating of ancient Arabic manuscripts."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2017",
        "info": "Volume 20: 2017",
        "count": 16,
        "papers": [
            "Texture feature benchmarking and evaluation for historical document image analysis.",
            "A dominant points-based feature extraction approach to recognize online handwritten strokes.",
            "Chinese calligraphic style representation for recognition.",
            "Writer adaptation via deeply learned features for online Chinese handwriting recognition.",
            "Online recognition of handwritten music symbols.",
            "Eyes Wide Open: an interactive learning method for the design of rule-based systems.",
            "Unsupervised refinement of color and stroke features for text binarization.",
            "Online flowchart understanding by combining max-margin Markov random field with grammatical analysis.",
            "A multi-one-class dynamic classifier for adaptive digitization of document streams.",
            "A sigma-lognormal model-based approach to generating large synthetic online handwriting sample databases.",
            "On writer identification for Arabic historical manuscripts.",
            "Post-processing coding artefacts for JPEG documents.",
            "Mean-Shift segmentation and PDE-based nonlinear diffusion: toward a common variational framework for foreground/background document image segmentation.",
            "A restoration method for distorted comics to improve comic contents identification.",
            "Character segmentation and transcription system for historical Japanese books with a self-proliferating character image database.",
            "Recognition of handwritten Lanna Dhamma characters using a set of optimally designed moment features."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2016",
        "info": "Volume 19: 2016",
        "count": 23,
        "papers": [
            "Improving discrimination ability of convolutional neural networks by hybrid learning.",
            "ASKME: adaptive sampling with knowledge-driven vectorization of mechanical engineering drawings.",
            "Structural feature-based evaluation method of binarization techniques for word retrieval in the degraded Arabic document images.",
            "A Nom historical document recognition system for digital archiving.",
            "Textual image compression at low bit rates based on region-of-interest coding.",
            "Bidirectional extraction and recognition of scene text with layout consistency.",
            "TextCatcher: a method to detect curved and challenging text in natural scenes.",
            "Converting heterogeneous statistical tables on the web to searchable databases.",
            "Lexicon reduction of handwritten Arabic subwords based on the prominent shape regions.",
            "Detecting figures and part labels in patents: competition-based development of graphics recognition algorithms.",
            "Advancing the state of the art for handwritten math recognition: the CROHME competitions, 2011-2014.",
            "Page segmentation using minimum homogeneity algorithm and adaptive mathematical morphology.",
            "Music staff removal with supervised pixel classification.",
            "A knowledge-based recognition system for historical Mongolian documents.",
            "Discovering similar Chinese characters in online handwriting with deep convolutional neural networks.",
            "Online recognition of sketched arrow-connected diagrams.",
            "An evidence-based model of saliency feature extraction for scene text analysis.",
            "Document segmentation and classification into musical scores and text.",
            "A system for recognizing online handwritten mathematical expressions by using improved structural analysis.",
            "Conservative preprocessing of document images.",
            "A fast hierarchical method for multi-script and arbitrary oriented scene text extraction.",
            "Consensus-based clustering for document image segmentation.",
            "Text/shape classifier for mobile applications with handwriting input."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2015",
        "info": "Volume 18: 2015",
        "count": 25,
        "papers": [
            "Handwritten Hangul recognition using deep convolutional neural networks.",
            "CVC-FP and SGT: a new database for structural floor plan analysis and its groundtruthing tool.",
            "Towards the interactive transcription of handwritings: anytime anywhere document analysis.",
            "Junction-based table detection in camera-captured document images.",
            "Skew detection and correction based on an axes-parallel bounding box.",
            "A character image restoration method for unconstrained handwritten Chinese character recognition.",
            "Resolution enhancement of textual images via multiple coupled dictionaries and adaptive sparse representation selection.",
            "Preface.",
            "Restoring camera-captured distorted document images.",
            "Scene text extraction based on edges and support vector regression.",
            "A new ring radius transform-based thinning method for multi-oriented video characters.",
            "Exploiting colour information for better scene text detection and recognition.",
            "Fast and accurate scene text understanding with image binarization and off-the-shelf OCR.",
            "Automatic diacritization of Arabic text using recurrent neural networks.",
            "Knowledge-driven understanding of images in comic books.",
            "A study of Bag-of-Visual-Words representations for handwritten keyword spotting.",
            "Integrating natural language processing with image document analysis: what we learned from two real-world applications.",
            "Toward automatic development of handwritten personal Farsi/Arabic OpenType® fonts.",
            "An efficient algorithm for Arabic optical font recognition using scale-invariant detector.",
            "Machine-assisted authentication of paper currency: an experiment on Indian banknotes.",
            "Handwritten word recognition using Web resources and recurrent neural networks.",
            "Offline scripting-free author identification based on speeded-up robust features.",
            "CERMINE: automatic extraction of structured metadata from scientific literature.",
            "g-DICE: graph mining-based document information content exploitation.",
            "Nastalique segmentation-based approach for Urdu OCR."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2014",
        "info": "Volume 17: 2014",
        "count": 27,
        "papers": [
            "Large scale document image retrieval by automatic word annotation.",
            "Text recognition in multimedia documents: a study of two neural-based OCRs using and avoiding character segmentation.",
            "A keyword retrieval system for historical Mongolian document images.",
            "Interactive handwriting recognition with limited user effort.",
            "Integrating vocabulary clustering with spatial relations for symbol recognition.",
            "Discrimination of similar characters using nonlinear normalization based on regional importance measure.",
            "An over-segmentation method for single-touching Chinese handwriting with learning-based filtering.",
            "Efficient multiscale Sauvola's binarization.",
            "Quality evaluation of degraded document images for binarization result prediction.",
            "A model for the gray-intensity distribution of historical handwritten documents and its application for binarization.",
            "Sparsity-based edge noise removal from bilevel graphical document images.",
            "A fast and accurate contour-based method for writer-dependent offline handwritten Farsi/Arabic subwords recognition.",
            "Learning confidence transformation for handwritten Chinese text recognition.",
            "Statistical segmentation and structural recognition for floor plan interpretation - Notation invariant structural element recognition.",
            "Mathematical formula identification and performance evaluation in PDF documents.",
            "Texture sparseness for pixel classification of business document images.",
            "Recognizing handwritten Arabic words using grapheme segmentation and recurrent neural networks.",
            "A graph-based approach for segmenting touching lines in historical handwritten documents.",
            "Multi-class segmentation of free-form online documents with tree conditional random fields.",
            "Multimodal page classification in administrative document image streams.",
            "Word searching in unconstrained layout using character pair coding.",
            "Lexicon reduction for printed Farsi subwords using pictorial and textual dictionaries.",
            "Feature combination for binary pattern classification.",
            "Adaptive binarization of severely degraded and non-uniformly illuminated documents.",
            "A benchmark image database of isolated Bangla handwritten compound characters.",
            "Efficient skew detection of printed document images based on novel combination of enhanced profiles.",
            "Handwriting synthesis: classifications and techniques."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2013",
        "info": "Volume 16: 2013",
        "count": 26,
        "papers": [
            "Handwritten text separation from annotated machine printed documents using Markov Random Fields.",
            "A Bayesian-based method of unconstrained handwritten offline Chinese text line recognition.",
            "Coupled snakelets for curled text-line segmentation from warped document images.",
            "A general approach for extracting road vector data from raster maps.",
            "Multi-feature extraction and selection in writer-independent off-line signature verification.",
            "A survey on Arabic character segmentation.",
            "Handwritten digit segmentation: a comparative study.",
            "A new approach for recognizing handwritten mathematics using relational grammars and fuzzy sets.",
            "An adaptive water flow model for binarization of degraded document images.",
            "Nonlinear model identification and see-through cancelation from recto-verso data.",
            "Text-line examination for document forgery detection.",
            "Online Arabic handwriting recognition: a survey.",
            "Word shape descriptor-based document image indexing: a new DBH-based approach.",
            "Document binarization with automatic parameter tuning.",
            "Erratum to: Document binarization with automatic parameter tuning.",
            "Online signature verification based on signatures turning angle representation using longest common subsequence matching.",
            "An evaluation of statistical methods in handwritten hangul recognition.",
            "Comprehensive synthetic Arabic database for on/off-line script recognition research.",
            "IESK-ArDB: a database for handwritten Arabic and an optimized topological segmentation approach.",
            "Image search in patents: a review.",
            "Detection of exact and similar partial copies for copyright protection of manga.",
            "Clutter noise removal in binary document images.",
            "Farsi/Arabic handwritten digit recognition based on ensemble of SVD classifiers and reliable multi-phase PSO combination rule.",
            "Visual word density-based nonlinear shape normalization method for handwritten Chinese character recognition.",
            "Effective technique for the recognition of offline Arabic handwritten words using hidden Markov models.",
            "Fast self-generation voting for handwritten Chinese character recognition."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2012",
        "info": "Volume 15: 2012",
        "count": 20,
        "papers": [
            "A statistical handwriting model for style-preserving and variable character synthesis.",
            "A local evaluation of vectorized documents by means of polygon assignments and matching.",
            "Labelling logical structures of document images using a dynamic perceptive neural network.",
            "Binarization of degraded document image based on feature space partitioning and classification.",
            "CMATERdb1: a database of unconstrained handwritten Bangla and Bangla-English mixed script document image.",
            "Automatic writer identification from text line images.",
            "A local linear level set method for the binarization of degraded historical document images.",
            "Error handling approach using characterization and correction steps for handwritten document analysis.",
            "Multiobjective optimization for classifier ensemble and feature selection: an application to named entity recognition.",
            "Genre identification for office document search and browsing.",
            "A new PDE-based approach for singularity-preserving regularization: application to degraded characters restoration.",
            "Writer verification using texture-based features.",
            "Text line extraction in graphical documents using background and foreground information.",
            "CVC-MUSCIMA: a ground truth of handwritten music score images for writer identification and staff removal.",
            "A robust probabilistic Braille recognition system.",
            "Automatic processing of handwritten bank cheque images: a survey.",
            "A general approach for multi-oriented text line extraction of handwritten documents.",
            "A categorization system for handwritten documents.",
            "Recognition and retrieval of mathematical expressions.",
            "Off-line handwritten signature detection by analysis of evidence accumulation."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2011",
        "info": "Volume 14: 2011",
        "count": 32,
        "papers": [
            "Editorial.",
            "ICDAR 2009-Arabic handwriting recognition competition.",
            "On-line Arabic handwriting recognition competition - ADAB database and participating systems.",
            "ICDAR2009 handwriting segmentation contest.",
            "DIBCO 2009: document image binarization contest.",
            "Setting up a competition framework for the evaluation of structure extraction from OCR-ed books.",
            "SCUT-COUCH2009 - a comprehensive online unconstrained Chinese handwriting database and benchmark evaluation.",
            "Grammar-based techniques for creating ground-truthed sketch corpora.",
            "EMERS: a tree matching-based performance evaluation of mathematical expression recognition systems.",
            "A protocol to characterize the descriptive power and the complementarity of shape descriptors.",
            "Metrics for evaluating performance in document analysis: application to tables.",
            "Special issue on noisy text analytics.",
            "Report from the AND 2009 working group on noisy text datasets.",
            "Text retrieval from early printed books.",
            "A word spotting framework for historical machine-printed documents.",
            "Unconstrained handwritten document retrieval.",
            "Towards information retrieval on historical document collections: the role of matching procedures and special lexica.",
            "Character confusion versus focus word-based correction of spelling and OCR variants in corpora.",
            "Robust named entity detection from optical character recognition output.",
            "Domain-specific entity extraction from noisy, unstructured data using ontology-guided search.",
            "Supervised semantic relation mining from linguistically noisy text documents.",
            "Digital weight watching: reconstruction of scanned documents.",
            "Editorial preface - Special issue on ICDAR2009 selected and extended papers.",
            "Towards historical document indexing: extraction of drop cap letters.",
            "Building compact recognizers of handwritten Chinese characters using precision constrained Gaussian model, minimum classification error training and parameter compression.",
            "Rejection measurement based on linear discriminant analysis for document recognition.",
            "Confidence- and margin-based MMI/MPE discriminative training for off-line handwriting recognition.",
            "Learning on the fly: a font-free approach toward multilingual OCR.",
            "Classifying the typefaces of the Gutenberg 42-line bible.",
            "Linear-quadratic blind source separating structure for removing show-through in scanned documents.",
            "A probabilistic approach to printed document understanding.",
            "Harvesting maps on the web."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2010",
        "info": "Volume 13: 2010",
        "count": 22,
        "papers": [
            "Historical document enhancement using LUT classification.",
            "Optical recognition of music symbols - A comparative study.",
            "Improving performance of HMM-based off-line signature verification systems through a multi-hypothesis approach.",
            "Generation and use of handwritten CAPTCHAs.",
            "A Bayesian network for combining descriptors: application to symbol recognition.",
            "Special issue on document recognition and retrieval 2009.",
            "Combined orientation and skew detection using geometric text-line modeling.",
            "Multi-font printed Mongolian document recognition system.",
            "Locating and parsing bibliographic references in HTML medical articles.",
            "A robust model for on-line handwritten japanese text recognition.",
            "Distance-based classification of handwritten symbols.",
            "Individuality of alphabet knowledge in online writer identification.",
            "Impact of online handwriting recognition performance on text categorization.",
            "A video text location method based on background classification.",
            "Generation of synthetic documents for performance evaluation of symbol recognition & spotting systems.",
            "Complex documents images segmentation based on steerable pyramid features.",
            "Rotation invariant hand-drawn symbol recognition based on a dynamic time warping model.",
            "A combination of features for symbol-independent writer identification in old music scores.",
            "Skew detection in document images based on rectangular active contour.",
            "MC-JBIG2: an improved algorithm for Chinese textual image compression.",
            "Building a multi-modal Arabic corpus (MMAC).",
            "Document image binarization using background estimation and stroke edges."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2009",
        "info": "Volume 12: 2009",
        "count": 20,
        "papers": [
            "On tables of contents and how to recognize them.",
            "A blackboard approach towards integrated Farsi OCR system.",
            "Watermark location via back-lighting and recto removal.",
            "A pseudo-skeletonization algorithm for static handwritten scripts.",
            "A blackboard approach towards integrated Farsi OCR system.",
            "Automated analysis of images in documents for intelligent document search.",
            "A performance evaluation protocol for symbol spotting systems in terms of recognition and location indices.",
            "SVM-based hierarchical architectures for handwritten Bangla character recognition.",
            "Stroke extraction based on ambiguous zone detection: a preprocessing step to recover dynamic information from handwritten Chinese characters.",
            "Devanagari OCR using a recognition driven segmentation framework and stochastic language models.",
            "Special issue on noisy text analytics.",
            "Optical character recognition errors and their effects on natural language processing.",
            "Using topic models for OCR correction.",
            "Successfully detecting and correcting false friends using channel profiles.",
            "Language independent unsupervised learning of short message service dialect.",
            "An effective coherence measure to determine topical consistency in user-generated content.",
            "Opinion mining from noisy text data.",
            "Farsi and Arabic document images lossy compression based on the mixed raster content model.",
            "Non-uniform slant estimation and correction for Farsi/Arabic handwritten words.",
            "Markov models for offline handwriting recognition: a survey."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2008",
        "info": "Volume 11: 2008/2009",
        "count": 15,
        "papers": [
            "Redefining the DCT-based feature for scene text detection.",
            "Document image characterization using a multiresolution analysis of the texture: application to old documents.",
            "Mobile Retriever: access to digital documents from their physical source.",
            "Matching word images for content-based retrieval from printed document images.",
            "Robust reconstruction of low-resolution document images by exploiting repetitive character behaviour.",
            "Partial discriminative training for classification of overlapping classes in document analysis.",
            "Improvement of postal mail sorting system.",
            "Document cleanup using page frame detection.",
            "Multiresolution cooperation makes easier document structure recognition.",
            "Recognition and quality assessment of data charts in mixed-mode documents.",
            "Arabic handwritten digit recognition.",
            "Optical recognition of psaltic Byzantine chant notation.",
            "A lossy/lossless compression method for printed typeset bi-level text images based on improved pattern matching.",
            "Low quality document image modeling and enhancement.",
            "Automatic recognition of handwritten medical forms for search engines."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2007",
        "info": "Volume 10: 2007",
        "count": 19,
        "papers": [
            "A survey of document image classification: problem statement, classifier architecture and performance evaluation.",
            "Fast correction of bleed-through distortion in grayscale documents by a blind source separation technique.",
            "Corpus-based HIT-MW database for offline recognition of general-purpose Chinese handwritten text.",
            "Further explorations in text alignment with handwritten documents.",
            "In memory of Professor Yasuaki Nakano (1938-2007).",
            "A generalised framework for script identification.",
            "An oscillatory neuromotor model of handwriting generation.",
            "Multifont size-resilient recognition system for Ethiopic script.",
            "Prototype learning for structured pattern representation applied to on-line recognition of handwritten Japanese characters.",
            "Biblio: automatic meta-data extraction.",
            "Special issue on noisy text analytics.",
            "Treebanks gone bad.",
            "Sentence boundary detection in conversational speech transcripts using noisily labeled examples.",
            "Investigation and modeling of the structure of texting language.",
            "Robustness through prior knowledge: using explanation-based learning to distinguish handwritten Chinese characters.",
            "Finding structure in noisy text: topic classification and unsupervised clustering.",
            "Genre as noise: noise in genre.",
            "Unsupervised information extraction from unstructured, ungrammatical data sources on the World Wide Web.",
            "Mining conversational text for procedures with applications in contact centers."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2007",
        "info": "Volume 9: 2007",
        "count": 21,
        "papers": [
            "Special issue on graphics recognition.",
            "Improving the recognition by integrating the combination of descriptors.",
            "An interactive example-driven approach to graphics recognition in engineering drawings.",
            "Automatic analysis and integration of architectural drawings.",
            "An online handwritten music symbol recognition system.",
            "A general framework for the evaluation of symbol recognition methods.",
            "Special issue on the analysis of historical documents.",
            "Digital image analysis to enhance underwritten text in the Archimedes palimpsest.",
            "Binarization, character extraction, and writer identification of historical Hebrew calligraphy documents.",
            "Hermite and Gabor transforms for noise reduction and handwriting classification in ancient manuscripts.",
            "Text line segmentation of historical documents: a survey.",
            "Word spotting for historical documents.",
            "Word matching using single closed contours for indexing handwritten historical documents.",
            "Keyword-guided word spotting in historical printed documents using synthetic data and user feedback.",
            "An old greek handwritten OCR system based on an efficient segmentation-free approach.",
            "DEBORA: Digital AccEss to BOoks of the RenAissance.",
            "Access by content to handwritten archive documents: generic document recognition method and platform for annotations.",
            "User-driven page layout analysis of historical printed books.",
            "User-configurable OCR enhancement for online natural history archives.",
            "Using colour information to understand censorship cards of film archives.",
            "Word spotting for historical documents."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2006",
        "info": "Volume 8: 2006",
        "count": 21,
        "papers": [
            "Stable methods for recognizing acronym-expansion pairs: from rule sets to hidden Markov models.",
            "Retrieving poorly degraded OCR documents.",
            "An MLP-orthogonal Gaussian mixture model hybrid model for Chinese bank check printed numeral recognition.",
            "Confidence modeling for handwriting recognition: algorithms and applications.",
            "On foreground - background separation in low quality document images.",
            "Special issue on detection and understanding of tables and forms for document processing applications.",
            "Table-processing paradigms: a research survey.",
            "Fourier-Mellin registration of line-delineated tabular document images.",
            "DMOS, a generic document recognition method: application to table structure analysis in a general and in a specific way.",
            "Towards a theory of tables.",
            "Detection and analysis of table of contents based on content association.",
            "Design of an end-to-end method to extract information from tables.",
            "A simple and effective table detection system from document images.",
            "Consensus-based table form recognition of low-quality historical documents.",
            "Table form document analysis based on the document structure grammar.",
            "Generalization of Frei and Chen's approach to extract the lines and edges of a digital image.",
            "Genetic engineering of hierarchical fuzzy regional representations for handwritten character recognition.",
            "Extraction and recognition of geographical features from paper maps.",
            "Automatic accurate broken character restoration for patrimonial documents.",
            "Feature selection for ensembles applied to handwriting recognition.",
            "Object count/area graphs for the evaluation of object detection and segmentation algorithms."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2004",
        "info": "Volume 7: 2004/2005",
        "count": 22,
        "papers": [
            "A survey of table recognition.",
            "Independent component analysis for document restoration.",
            "Analysis and interpretation of visual saliency for document functional labeling.",
            "An online composite graphics recognition approach based on matching of spatial relation graphs.",
            "A hybrid opto-electronic method for fast off-line handwritten signature verification.",
            "Collection of on-line handwritten Japanese character pattern databases and their analyses.",
            "Special issue on camera-based text and document recognition.",
            "Camera-based analysis of text and documents: a survey.",
            "ICDAR 2003 robust reading competitions: entries, results, and future directions.",
            "Building cameras for capturing documents.",
            "Color reconstruction in digital cameras: optimization for document images.",
            "Rectification and recognition of text in 3-D scenes.",
            "Bayesian super-resolution of text in videowith a text-specific bimodal prior.",
            "Digit recognition in a natural scene with skew and slant normalization.",
            "A video-based framework for the analysis of presentations/posters.",
            "Toward automatic video-based whiteboard reading.",
            "A new representation of shape and its use for high performance in online Arabic character recognition by an associative memory.",
            "Quantitative analysis of mathematical documents.",
            "Combining shape and physical modelsfor online cursive handwriting synthesis.",
            "The UvA color document dataset.",
            "A corpus for OCR research on mathematical expressions.",
            "Document analysis by processing JBIG-encoded images."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2003",
        "info": "Volume 6: 2003/2004",
        "count": 23,
        "papers": [
            "From data topology to a modular classifier.",
            "A new graph-like classification method applied to ancient handwritten musical symbols.",
            "Methods for adaptive combination of classifiers with application to recognition of handwritten characters.",
            "On the combination of ${\\it abstract-level}$ classifiers.",
            "Handwriting style classification.",
            "The state of the art in Japanese online handwriting recognition compared to techniques in western handwriting recognition.",
            "Efficient polygon decomposition into singular and regular regions via Voronoi diagrams.",
            "Analysis and understanding of multi-class invoices.",
            "Matching of graphical symbols in line-drawing images using angular signature information.",
            "Lexicon-driven HMM decoding for large vocabulary handwriting recognition with multiple character models.",
            "Preface.",
            "Statistical image differences, degradation features, and character distance metrics.",
            "Adaptive classifiers for multisource OCR.",
            "Problem-adaptable document analysis and understanding for high-volume applications.",
            "Correcting for variable skew in document images.",
            "Extraction of newspaper headlines from microfilm for automatic indexing.",
            "Reports of the DAS02 working groups.",
            "A fast technique for comparing graph representations with applications to performance evaluation.",
            "A comparison of automatic and manual zoning.",
            "Analysis and recognition of highly degraded printed characters.",
            "Segmentation and recognition of handwritten dates: an HMM-MLP hybrid approach.",
            "A confidence value estimation method for handwritten Kanji character recognition and its application to candidate reduction.",
            "Color segmentation for text extraction."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2002",
        "info": "Volume 5: 2002/2003",
        "count": 20,
        "papers": [
            "Document understanding for a broad class of documents.",
            "A hierarchical representation of form documents for identification and retrieval.",
            "Iterative model-based binarization algorithm for cheque images.",
            "The IAM-database: an English sentence database for offline handwriting recognition.",
            "Attributed point matching for automatic groundtruth generation.",
            "Fast string correction with Levenshtein automata.",
            "Special issue-selected papers from the ICDAR'01 conference.",
            "Adaptive image-smoothing using a coplanar matrix and its application to document image binarization.",
            "The recognition of handwritten numeral strings using a two-stage HMM-based method.",
            "Online image classification using IHDR.",
            "Creating word-level language models for large-vocabulary handwriting recognition.",
            "Extraction of special effects caption text events from digital video.",
            "PessimalPrint: a reverse Turing test.",
            "Special issue on multiple classifiers for document analysis applications.",
            "Multiple classifier decision combination strategies for character recognition: A review.",
            "Classification of Arabic script using multiple sources of information: State of the art and perspectives.",
            "Architectures for detecting and solving conflicts: two-stage classification and support vector classifiers.",
            "Ensembles of classifiers for handwritten word recognition.",
            "A Hidden Markov Models combination framework for handwriting recognition.",
            "An MLP-SVM combination architecture for offline handwritten digit recognition: Reduction of recognition errors by Support Vector Machines rejection mechanisms."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2001",
        "info": "Volume 4: 2001/2002",
        "count": 27,
        "papers": [
            "Editorial.",
            "Transforming paper documents into XML format with WISDOM++.",
            "Rule-based document structure understanding with a fuzzy combination of layout and textual features.",
            "Using citing information to understand the logical structure of document images.",
            "Recognition of table of contents for electronic library consulting.",
            "Retrieving information from document images: problems and solutions.",
            "Maximum mutual information training for an online neural predictive handwritten word recognition system.",
            "Automatic document classification and indexing in high-volume applications.",
            "A generic method of cleaning and enhancing handwritten data from business forms.",
            "Automatic extraction of printed mathematical formulas using fuzzy logic and propagation of context.",
            "A fast algorithm for skew detection of document images using morphology.",
            "A word extraction algorithm for machine-printed documents using a 3D neighborhood graph model.",
            "A noise attribute thresholding method for document image binarization.",
            "Special Issue on \"Performance Evaluation: Theory, Practice, and Impact\".",
            "Evaluating the performance of table processing algorithms.",
            "Large scale address recognition systems Truthing, testing, tools, and other evaluation issues.",
            "A statistical approach to the generation of a database for evaluating OCR software.",
            "Automatic performance evaluation of printed Chinese character recognition systems.",
            "An empirical measure of the performance of a document image segmentation algorithm.",
            "Performance evaluation of pattern classifiers for handwritten character recognition.",
            "Software architecture of PSET: a page segmentation evaluation toolkit.",
            "Identifying facsimile duplicates using radial pixel densities.",
            "An unconstrained handwriting recognition system.",
            "Recognising text in real scenes.",
            "Character pattern extraction from documents with complex backgrounds.",
            "Partitioning and searching dictionary for correction of optically read Devanagari character strings.",
            "Cross-learning in analytic word recognition without segmentation."
        ]
    },
    {
        "name": "IJDAR",
        "year": "2000",
        "info": "Volume 3: 2000/2001",
        "count": 26,
        "papers": [
            "New Editorial Board Members.",
            "Mathematical expression recognition: a survey.",
            "Stop word location and identification for adaptive text recognition.",
            "A criterion based on Fourier transform for segmentation of connected digits.",
            "Pitch-based segmentation and recognition of dot-matrix text.",
            "Multiple expert classification: a new methodology for parallel decision fusion.",
            "Preface.",
            "A structural representation for understanding line-drawing images.",
            "Using local deviations of vectorization to enhance the performance of raster-to-vector conversion systems.",
            "Symbol recognition in documents: a collection of techniques?",
            "Symbol and character recognition: application to engineering drawings.",
            "A complete system for the analysis of architectural drawings.",
            "Content-based matching of line-drawing images using the Hough transform.",
            "OCRSpell: an interactive spelling correction system for OCR errors in text.",
            "Extraction of type style-based meta-information from imaged documents.",
            "Experiments with adaptation strategies for a prototype-based recognition system for isolated handwritten characters.",
            "A serial combination of connectionist-based classifiers for OCR.",
            "Online handwriting recognition: the NPen++ recognizer.",
            "RAV (reparameterized angle variations) algorithm for online handwriting recognition.",
            "In Memoriam: Jürgen Schürmann.",
            "Guest Editorial.",
            "Industrial bank check processing: the A2iA CheckReaderTM.",
            "Segmentation and recognition of Chinese bank check amounts.",
            "A computer-based system to support forensic studies on handwritten documents.",
            "Classification of document pages using structure-based features.",
            "Leveraging corporate context within knowledge-based document analysis and understanding."
        ]
    },
    {
        "name": "IJDAR",
        "year": "1999",
        "info": "Volume 2: 1999/2000",
        "count": 22,
        "papers": [
            "Frontiers in Handwriting Recognition.",
            "Handwriting recognition or reading? What is the situation at the dawn of the 3rd millenium?",
            "Finding features used in the human reading of cursive handwriting.",
            "Global methods for stroke segmentation.",
            "Diacritical processing for unconstrained online handwriting recognition using a forward search.",
            "Recognition of handwritten numerals by Quantum Neural Network with fuzzy features.",
            "An architecture for handwritten text recognition systems.",
            "Script and language identification for handwritten document images.",
            "Extraction of bankcheck items by mathematical morphology.",
            "Efficient and flexible text extraction from document pages.",
            "Quality assessment and restoration of typewritten document images.",
            "Offline cursive script word recognition - a survey.",
            "Extracting curved text lines using local linearity of the text line.",
            "A complete system for the intelligent interpretation of engineering drawings.",
            "Document skew estimation without angle range restriction.",
            "In Memoriam.",
            "Multimedia document retrieval using speech and speaker recognition.",
            "Text extraction from colored book and journal covers.",
            "Integrated text and line-art extraction from a topographic map.",
            "String techniques for detecting duplicates in document databases.",
            "A method for restoration of low-resolution document images.",
            "Detection and correction of recognition errors in check reading."
        ]
    },
    {
        "name": "IJDAR",
        "year": "1998",
        "info": "Volume 1: 1998/1999",
        "count": 20,
        "papers": [
            "Editorial.",
            "Automatic reading of cursive scripts using a reading model and perceptual concepts The PERPECTO system.",
            "The advantage of using an HMM-based approach for faxed word recognition.",
            "Document image similarity and equivalence detection.",
            "Projection profile based skew estimation algorithm for JBIG compressed images.",
            "Matching document images with ground truth.",
            "Stepwise recovery of arc segmentation in complex line environments.",
            "Distance features for neural network-based recognition of handwritten characters.",
            "MAGELLAN: Map Acquisition of GEographic Labels by Legend ANalysis.",
            "A Hidden Markov Model approach to online handwritten signature verification.",
            "Incorporating local consistency information into the online signature verification process.",
            "An experimental evaluation of OCR text representations for learning document classifiers.",
            "Retrospective document conversion: application to the library domain.",
            "A segmentation-free approach to text recognition with application to Arabic text.",
            "Filtering and segmentation of digitized land use map images.",
            "In Memoriam: Gary Edward Kopec (1952-1998).",
            "Shape-based word recognition.",
            "Recognizing acronyms and their definitions.",
            "Cursive word recognition using a random field based hidden Markov model.",
            "Content based internet access to paper documents."
        ]
    }
]