[
    {
        "name": "IJNS",
        "year": "2021",
        "info": "Volume 31: 2021",
        "count": 52,
        "papers": [
            "Spiking Neural P Systems with Delay on Synapses.",
            "Spiking Neural P Systems with Extended Channel Rules.",
            "Medical Image Fusion Method Based on Coupled Neural P Systems in Nonsubsampled Shearlet Transform Domain.",
            "An Adaptive Optimization Spiking Neural P System for Binary Problems.",
            "A Complete Arithmetic Calculator Constructed from Spiking Neural P Systems and its Application to Information Fusion.",
            "Dendrite P Systems Toolbox: Representation, Algorithms and Simulators.",
            "Introduction.",
            "Multiplex and Multilayer Network EEG Analyses: A Novel Strategy in the Differential Diagnosis of Patients with Chronic Disorders of Consciousness.",
            "Quaternion Spiking and Quaternion Quantum Neural Networks: Theory and Applications.",
            "On the Modeling of the Three Types of Non-spiking Neurons of the Caenorhabditis elegans.",
            "Evolution-Communication Spiking Neural P Systems.",
            "LieToMe: An Ensemble Approach for Deception Detection from Facial Cues.",
            "Acrophobia Quantified by EEG Based on CNN Incorporating Granger Causality.",
            "Design and Implementation of a Spiking Neural Network with Integrate-and-Fire Neuron Model for Pattern Recognition.",
            "Editorial: A Multidisciplinary and Interdisciplinary Journal for a Wider Community Under a Pioneering Cross-disciplinary Research Leader.",
            "An Experimental Review on Deep Learning Architectures for Time Series Forecasting.",
            "Altered EEG Oscillatory Brain Networks During Music-Listening in Major Depression.",
            "Channel Selection for Optimal EEG Measurement in Motor Imagery-Based Brain-Computer Interfaces.",
            "The Effect of Low Magnesium Concentration on Ictal Discharges In A Non-Synaptic Model.",
            "Thirty years of IJNS - A Clinician's View.",
            "Roles of Very Fast Ripple (500-1000Hz) in the Hippocampal Network During Status Epilepticus.",
            "The Influence of Visual Attention on The Performance of A Novel Tactile P300 Brain-Computer Interface with Cheeks-Stim Paradigm.",
            "Improving Botulinum Toxin Efficiency in Treating Post-Stroke Spasticity Using 3D Innervation Zone Imaging.",
            "Impact of Machine Learning Pipeline Choices in Autism Prediction From Functional Connectivity Data.",
            "Discussion on Y. Zhu, X. Wang, K. Mathiak, P. Toiviainen, T. Ristaniemi, J. Xu, Y. Chang and F. Cong, Altered EEG Oscillatory Brain Networks During Music-Listening in Major Depression, International Journal of Neural Systems, Vol. 31 No. 3 (2021).",
            "Response to Discussion on Y. Zhu, X. Wang, K. Mathiak, P. Toiviainen, T. Ristaniemi, J. Xu, Y. Chang and F. Cong, Altered EEG Oscillatory Brain Networks During Music-Listening in Major Depression, International Journal of Neural Systems, Vol. 31 No. 3 (2021).",
            "Automated Adult Epilepsy Diagnostic Tool Based on Interictal Scalp Electroencephalogram Characteristics: A Six-Center Study.",
            "Editorial: From Pioneering Artificial Neural Networks to Deep Learning and Beyond.",
            "Machine Learning Algorithms and Statistical Approaches for Alzheimer's Disease Analysis Based on Resting-State EEG Recordings: A Systematic Review.",
            "Classification of Epileptic EEG Signals Using Synchrosqueezing Transform and Machine Learning.",
            "The Automatic Detection of Seizure Based on Tensor Distance And Bayesian Linear Discriminant Analysis.",
            "Discrimination Improvement Through Undesirable Feedback in Coupling Object Manipulation Tasks.",
            "Editorial: A Wonderful Venue for Networking Neuroscience and Computational Intelligence.",
            "Editorial: River Thames and IJNS.",
            "Concurrent Prediction of Finger Forces Based on Source Separation and Classification of Neuron Discharge Information.",
            "Role of the Ipsilateral Primary Motor Cortex in the Visuo-Motor Network During Fine Contractions and Accurate Performance.",
            "Multi-Center Validation Study of Automated Classification of Pathological Slowing in Adult Scalp Electroencephalograms Via Frequency Features.",
            "Detecting Connected Consciousness During Propofol-Induced Anesthesia Using EEG Based Brain Decoding.",
            "Decoding Saccade Intention From Primate Prefrontal Cortical Local Field Potentials Using Spectral, Spatial, and Temporal Dimensionality Reduction.",
            "Vagus Nerve Electroneurogram-Based Detection of Acute Pentylenetetrazol Induced Seizures in Rats.",
            "Prediction of Speech Onset by Micro-Electrocorticography of the Human Brain.",
            "Graph Attention Network with Focal Loss for Seizure Detection on Electroencephalography Signals.",
            "One-Shot Neural Architecture Search by Dynamically Pruning Supernet in Hierarchical Order.",
            "Optimization of Model Training Based on Iterative Minimum Covariance Determinant In Motor-Imagery BCI.",
            "Decision-Feedback Stages Revealed by Hidden Markov Modeling of EEG.",
            "Introduction.",
            "Deep Learning for EEG Seizure Detection in Preterm Infants.",
            "Personalized EEG Feature Selection for Low-Complexity Seizure Monitoring.",
            "Incorporating Uncertainty in Data Labeling into Automatic Detection of Interictal Epileptiform Discharges from Concurrent Scalp-EEG via Multi-way Analysis.",
            "A Deep Fourier Neural Network for Seizure Prediction Using Convolutional Neural Network and Ratios of Spectral Power.",
            "Epileptic EEG Classification by Using Time-Frequency Images for Deep Learning.",
            "Time-Frequency Decomposition of Scalp Electroencephalograms Improves Deep Learning-Based Epilepsy Diagnosis."
        ]
    },
    {
        "name": "IJNS",
        "year": "2020",
        "info": "Volume 30: 2020",
        "count": 81,
        "papers": [
            "Fluctuation Scaling of Neuronal Firing and Bursting in Spontaneously Active Brain Circuits.",
            "Exploring the Brain Responses to Driving Fatigue Through Simultaneous EEG and fNIRS Measurements.",
            "Spatiotemporal Oscillatory Patterns During Working Memory Maintenance in Mild Cognitive Impairment and Subjective Cognitive Decline.",
            "Reachability Analysis of Neural Masses and Seizure Control Based on Combination Convolutional Neural Network.",
            "Human Gait Recognition Based on Frame-by-Frame Gait Energy Images and Convolutional Long Short-Term Memory.",
            "A Cerebellum-Inspired Learning Approach for Adaptive and Anticipatory Control.",
            "Controllability of Networks of Multiple Coupled Neural Populations: An Analytical Method for Neuromodulation's Feasibility.",
            "Scaling Analysis of Phase Fluctuations of Brain Networks in Dynamic Constrained Object Manipulation.",
            "Small World Index in Default Mode Network Predicts Progression from Mild Cognitive Impairment to Dementia.",
            "Non-Canonical Microstate Becomes Salient in High Density EEG During Propofol-Induced Altered States of Consciousness.",
            "Parkinsonism Differently Affects the Single Neuronal Activity in the Primary and Supplementary Motor Areas in Monkeys: An Investigation in Linear and Nonlinear Domains.",
            "Reorganization of Large-Scale Functional Networks During Low-Frequency Electrical Stimulation of the Cortical Surface.",
            "Characteristic of Mayer Waves in Electrophysiological, Hemodynamic and Vascular Signals.",
            "A Three-Dimensional Microelectrode Array to Generate Virtual Electrodes for Epiretinal Prosthesis Based on a Modeling Study.",
            "Distinct Patterns of Functional Connectivity During the Comprehension of Natural, Narrative Speech.",
            "A TrAdaBoost Method for Detecting Multiple Subjects' N200 and P300 Potentials Based on Cross-Validation and an Adaptive Threshold.",
            "Olfactory EEG Signal Classification Using a Trapezoid Difference-Based Electrode Sequence Hashing Approach.",
            "Automatic Seizure Detection Based on S-Transform and Deep Convolutional Neural Network.",
            "Real-Time Multi-Modal Estimation of Dynamically Evoked Emotions Using EEG, Heart Rate and Galvanic Skin Response.",
            "The Impact of Repetitive Transcranial Magnetic Stimulation on Functional Connectivity in Major Depressive Disorder and Bipolar Disorder Evaluated by Directed Transfer Function and Indices Based on Graph Theory.",
            "Fusing Self-Organized Neural Network and Keypoint Clustering for Localized Real-Time Background Subtraction.",
            "Automatic Seizure Detection using Fully Convolutional Nested LSTM.",
            "Alternative Diagnosis of Epilepsy in Children Without Epileptiform Discharges Using Deep Convolutional Neural Networks.",
            "Aberrant Connectivity During Pilocarpine-Induced Status Epilepticus.",
            "A Training Data-Driven Canonical Correlation Analysis Algorithm for Designing Spatial Filters to Enhance Performance of SSVEP-Based BCIs.",
            "Cortical Asymmetries and Connectivity Patterns in the Valence Dimension of the Emotional Brain.",
            "Modeling Hippocampal CA1 Gabaergic Synapses of Audiogenic Rats.",
            "Parsimonious Minimal Learning Machine via Multiresponse Sparse Regression.",
            "Nonspecific Visuospatial Imagery as a Novel Mental Task for Online EEG-Based BCI Control.",
            "Temporal Backpropagation for Spiking Neural Networks with One Spike per Neuron.",
            "The Effect of Breath Pacing on Task Switching and Working Memory.",
            "Automated MRI-Based Deep Learning Model for Detection of Alzheimer's Disease Process.",
            "Single-Trial EEG Responses Classified Using Latency Features.",
            "3D-Convolutional Neural Network with Generative Adversarial Network and Autoencoder for Robust Anomaly Detection in Video Surveillance.",
            "Introduction.",
            "Ensemble Deep Learning on Large, Mixed-Site fMRI Datasets in Autism and Other Tasks.",
            "A Prototype of EEG System for IoT.",
            "Multivariate Pattern Analysis Techniques for Electroencephalography Data to Study Flanker Interference Effects.",
            "Behavioral Activity Recognition Based on Gaze Ethograms.",
            "Dyslexia Diagnosis by EEG Temporal and Spectral Descriptors: An Anomaly Detection Approach.",
            "Deep Support Vector Machines for the Identification of Stress Condition from Electrodermal Activity.",
            "EEG Connectivity Analysis Using Denoising Autoencoders for the Detection of Dyslexia.",
            "IJNS: 30 Years of Breakthrough Multidisciplinarity, Rigor, and Excellence in the Knowledge Limits.",
            "Study of the Functional Brain Connectivity and Lower-Limb Motor Imagery Performance After Transcranial Direct Current Stimulation.",
            "Multiscaled Neural Autoregressive Distributed Lag: A New Empirical Mode Decomposition Model for Nonlinear Time Series Forecasting.",
            "Middle-Level Features for the Explanation of Classification Systems by Sparse Dictionary Methods.",
            "How the Cerebellum and Prefrontal Cortex Cooperate During Trace Eyeblinking Conditioning.",
            "Improved Overlap-based Undersampling for Imbalanced Dataset Classification with Application to Epilepsy and Parkinson's Disease.",
            "Editorial: A Magnificent Journal at the Crossroads.",
            "Editorial: Thirty Years of a Journal Fostering Interdisciplinary Research Excellence.",
            "Morphological Characterization of Functional Brain Imaging by Isosurface Analysis in Parkinson's Disease.",
            "Neurolight: A Deep Learning Neural Interface for Cortical Visual Prostheses.",
            "Intrinsic Synchronization Analysis of Brain Activity in Obsessive-compulsive Disorders.",
            "Discriminative Analysis of Symptom Severity and Ultra-High Risk of Schizophrenia Using Intrinsic Functional Connectivity.",
            "Enhancement of Hippocampal Spatial Decoding Using a Dynamic Q-Learning Method With a Relative Reward Using Theta Phase Precession.",
            "Discussion on Vuttipittayamongkol, P. and Elyan, E., Improved Overlap-Based Undersampling for Imbalanced Dataset Classification with Application to Epilepsy and Parkinson's Disease.",
            "Response to Discussion on \"Improved Overlap-Based Undersampling for Imbalanced Dataset Classification with Application to Epilepsy and Parkinson's Disease, \".",
            "Nonlinear Spiking Neural P Systems.",
            "Dynamic Reorganization of the Cortical Functional Brain Network in Affective Processing and Cognitive Reappraisal.",
            "Improved Activity Recognition Combining Inertial Motion Sensors and Electroencephalogram Signals.",
            "A Basal Ganglia Computational Model to Explain the Paradoxical Sensorial Improvement in the Presence of Huntington's Disease.",
            "A Methodology to Differentiate Parkinson's Disease and Aging Speech Based on Glottal Flow Acoustic Analysis.",
            "A Neural Network for Image Anomaly Detection with Deep Pyramidal Representations and Dynamic Routing.",
            "Introduction.",
            "Rhythmic Network Modulation to Thalamocortical Couplings in Epilepsy.",
            "Revealing False Positive Features in Epileptic EEG Identification.",
            "Automated Detection of Interictal Epileptiform Discharges from Scalp Electroencephalograms by Convolutional Neural Networks.",
            "Computationally-Efficient Algorithm for Real-Time Absence Seizure Detection in Wearable Electroencephalography.",
            "Determination of Antiepileptic Drugs Withdrawal Through EEG Hjorth Parameter Analysis.",
            "An Efficient Approach to Define the Input Stimuli to Suppress Epileptic Seizures Described by the Epileptor Model.",
            "An Impactful Journal on Epilepsy Research at the Intersection of Clinical, Engineering and Data Sciences.",
            "A Transformational Journal Navigating through the Age of Knowledge Under an Extraordinary Captain.",
            "An Iconic Transdisciplinary Journal Moving the Frontiers of Innovation with a Visionary Leader.",
            "Beyond Thirty Years of IJNS.",
            "An Outstanding Platform to Advance a Multifaceted Discipline.",
            "The Evolution and Success of an Excellent Transdisciplinary Journal.",
            "Characterisation of Haemodynamic Activity in Resting State Networks by Fractal Analysis.",
            "Dynamic Temporospatial Patterns of Functional Connectivity and Alterations in Idiopathic Generalized Epilepsy.",
            "Spiking Neural P Systems with Astrocytes Producing Calcium.",
            "Electroencephalography-Derived Prognosis of Functional Recovery in Acute Stroke Through Machine Learning Approaches.",
            "Roughness-Length-Based Characteristic Analysis of Intracranial EEG and Epileptic Seizure Prediction."
        ]
    },
    {
        "name": "IJNS",
        "year": "2019",
        "info": "Volume 29: 2019",
        "count": 60,
        "papers": [
            "Integrating EEG and MEG Signals to Improve Motor Imagery Classification in Brain-Computer Interface.",
            "A Novel Method of Building Functional Brain Network Using Deep Learning Algorithm with Application in Proficiency Detection.",
            "The Dynamic Brain Networks of Motor Imagery: Time-Varying Causality Analysis of Scalp EEG.",
            "Model and Analysis for the Onset of Parkinsonian Firing Patterns in a Simplified Basal Ganglia.",
            "Extracting and Classifying Spatial Muscle Activation Patterns in Forearm Flexor Muscles Using High-Density Electromyogram Recordings.",
            "Corticomotoneuronal Model for Intraoperative Neurophysiological Monitoring During Direct Brain Stimulation.",
            "Introduction.",
            "A Neuronal Network Model of the Primate Visual System: Color Mechanisms in the Retina, LGN and V1.",
            "Vowel Articulation Dynamic Stability Related to Parkinson's Disease Rating Features: Male Dataset.",
            "Multiscale Entropy Analysis for Recognition of Visually Elicited Negative Stress From EEG Recordings.",
            "Neuromechanical Modelling of Articulatory Movements from Surface Electromyography and Speech Formants.",
            "Empirical Functional PCA for 3D Image Feature Extraction Through Fractal Sampling.",
            "Instance-Based Representation Using Multiple Kernel Learning for Predicting Conversion to Alzheimer Disease.",
            "Identifying Suitable Brain Regions and Trial Size Segmentation for Positive/Negative Emotion Recognition.",
            "Introduction.",
            "Coupled Oscillators Model of Hyperexcitable Neuroglial Networks.",
            "Coupling Between Brain Structures During Visual and Auditory Working Memory Tasks.",
            "Lateral Inhibition Organizes Beta Attentional Modulation in the Primary Visual Cortex.",
            "Assessment of Statistically Significant Command-Following in Pediatric Patients with Disorders of Consciousness, Based on Visual, Auditory and Tactile Event-Related Potentials.",
            "Parametric Description of EEG Profiles for Assessment of Sleep Architecture in Disorders of Consciousness.",
            "Temporal Modulation of Steady-State Visual Evoked Potentials.",
            "Using Dictionary Pair Learning for Seizure Detection.",
            "Neonatal Seizure Detection Using Deep Convolutional Neural Networks.",
            "Single-Cell Recordings to Target the Anterior Nucleus of the Thalamus in Deep Brain Stimulation for Patients with Refractory Epilepsy.",
            "Differential Effects of Simulated Cortical Network Lesions on Synchrony and EEG Complexity.",
            "Time-Varying EEG Correlations Improve Automated Neonatal Seizure Detection.",
            "Identification of Hidden Sources by Estimating Instantaneous Causality in High-Dimensional Biomedical Time Series.",
            "Introduction.",
            "A Computational Model for the Neural Representation and Estimation of the Binocular Vector Disparity from Convergent Stereo Image Pairs.",
            "Aberrant Prefrontal-Thalamic-Cerebellar Circuit in Schizophrenia and Depression: Evidence From a Possible Causal Connectivity.",
            "Causal Coupling Between Electrophysiological Signals, Cerebral Hemodynamics and Systemic Blood Supply Oscillations in Mayer Wave Frequency Range.",
            "Synchronization of Slow Cortical Rhythms During Motor Imagery-Based Brain-Machine Interface Control.",
            "A Kernel Bayesian Adaptive Resonance Theory with A Topological Structure.",
            "Multiplex Limited Penetrable Horizontal Visibility Graph from EEG Signals for Driver Fatigue Detection.",
            "Perceptual Generalization and Context in a Network Memory Inspired Long-Term Memory for Artificial Cognition.",
            "A Method for Suppressing Electrical Stimulation Artifacts from Electromyography.",
            "Cortical Thickness and Surface Area Networks in Healthy Aging, Alzheimer's Disease and Behavioral Variant Fronto-Temporal Dementia.",
            "Enhanced Data Covariance Estimation Using Weighted Combination of Multiple Gaussian Kernels for Improved M/EEG Source Localization.",
            "Regularized Group Sparse Discriminant Analysis for P300-Based Brain-Computer Interface.",
            "Proprioceptive Recognition with Artificial Neural Networks Based on Organizations of Spinocerebellar Tract and Cerebellum.",
            "A Machine Learning Approach to Reveal the NeuroPhenotypes of Autisms.",
            "Electroconvulsive Therapy Induces Cortical Morphological Alterations in Major Depressive Disorder Revealed with Surface-Based Morphometry Analysis.",
            "Strong-Weak Pruning for Brain Network Identification in Connectome-Wide Neuroimaging: Application to Amyotrophic Lateral Sclerosis Disease Stage Characterization.",
            "Prediction of Forelimb EMGs and Movement Phases from Corticospinal Signals in the Rat During the Reach-to-Pull Task.",
            "An Attention-Based Spiking Neural Network for Unsupervised Spike-Sorting.",
            "How Far can Neural Correlations Reduce Uncertainty? Comparison of Information Transmission Rates for Markov and Bernoulli Processes.",
            "Compact Hardware Synthesis of Stochastic Spiking Neural Networks.",
            "Monitor-Based Spiking Recurrent Network for the Representation of Complex Dynamic Patterns.",
            "Neurons with Multiplicative Interactions of Nonlinear Synapses.",
            "Hypothermia Masks Most of the Effects of Rapid Cycling VNS on Rat Hippocampal Electrophysiology.",
            "Scaled Subprofile Modeling and Convolutional Neural Networks for the Identification of Parkinson's Disease in 3D Nuclear Imaging Data.",
            "Assisted Diagnosis of Parkinsonism Based on the Striatal Morphology.",
            "Performing Multi-Target Regression via a Parameter Sharing-Based Deep Network.",
            "Lyapunov Theory-Based Fusion Neural Networks for the Identification of Dynamic Nonlinear Systems.",
            "Descriptor Selection Improvements for Quantitative Structure-Activity Relationships.",
            "Latent Phase Detection of Hypoxic-Ischemic Spike Transients in the EEG of Preterm Fetal Sheep Using Reverse Biorthogonal Wavelets & Fuzzy Classifier.",
            "A Machine Learning Approach to Characterize the Modulation of the Hippocampal Rhythms Via Optogenetic Stimulation of the Medial Septum.",
            "Epileptic Seizure Detection with EEG Textural Features and Imbalanced Classification Based on EasyEnsemble Learning.",
            "Tangent Space Features-Based Transfer Learning Classification Model for Two-Class Motor Imagery Brain-Computer Interface.",
            "Spatial Distribution of Eye-Movements After Central Vision Loss is Consistent with an Optimal Visual Search Strategy."
        ]
    },
    {
        "name": "IJNS",
        "year": "2018",
        "info": "Volume 28: 2018",
        "count": 57,
        "papers": [
            "Quantification of Graph Complexity Based on the Edge Weight Distribution Balance: Application to Brain Networks.",
            "Automated Detector of High Frequency Oscillations in Epilepsy Based on Maximum Distributed Peak Points.",
            "Aberrant Thalamocortical Connectivity in Juvenile Myoclonic Epilepsy.",
            "Neurophysiological Analysis of the Genesis Mechanism of EEG During the Interictal and Ictal Periods Using a Multiple Neural Masses Model.",
            "Epileptic Seizure Prediction Using Diffusion Distance and Bayesian Linear Discriminate Analysis on Intracranial EEG.",
            "Evidence of a Task-Independent Neural Signature in the Spectral Shape of the Electroencephalogram.",
            "A Scalable Weight-Free Learning Algorithm for Regulatory Control of Cell Activity in Spiking Neuronal Networks.",
            "Convergent Time-Varying Regression Models for Data Streams: Tracking Concept Drift by the Recursive Parzen-Based Generalized Regression Neural Networks.",
            "From Structure to Activity: Using Centrality Measures to Predict Neuronal Activity.",
            "Classification of Diffusion Tensor Metrics for the Diagnosis of a Myelopathic Cord Using Machine Learning.",
            "Nonlinear Semi-Supervised Metric Learning Via Multiple Kernels and Local Topology.",
            "Functional Semi-Blind Source Separation Identifies Primary Motor Area Without Active Motor Execution.",
            "Static Characteristics of a New Three-Dimensional Linear Homeomorphic Saccade Model.",
            "Dynamic Characteristics of a New Three-Dimensional Linear Homeomorphic Saccade Model.",
            "Right Fronto-Temporal EEG can Differentiate the Affective Responses to Award-Winning Advertisements.",
            "Neural Oscillation Correlates Chemistry Decision-Making.",
            "Development of a Ternary Near-Infrared Spectroscopy Brain-Computer Interface: Online Classification of Verbal Fluency Task, Stroop Task and Rest.",
            "Tracking the Reorganization of Module Structure in Time-Varying Weighted Brain Functional Connectivity Networks.",
            "Multi-Step Time Series Forecasting with an Ensemble of Varied Length Mixture Models.",
            "A Novel Multilayer Correlation Maximization Model for Improving CCA-Based Frequency Recognition in SSVEP Brain-Computer Interface.",
            "Developmental Approach for Behavior Learning Using Primitive Motion Skills.",
            "Introduction.",
            "A Multiple-Plasticity Spiking Neural Network Embedded in a Closed-Loop Control System to Model Cerebellar Pathologies.",
            "Structured Pyramidal Neural Networks.",
            "Neural Correlates of Phrase Quadrature Perception in Harmonic Rhythm: An EEG Study Using a Brain-Computer Interface.",
            "Short-Term Effects of Binaural Beats on EEG Power, Functional Connectivity, Cognition, Gait and Anxiety in Parkinson's Disease.",
            "Foreground Detection by Competitive Learning for Varying Input Distributions.",
            "Mirror Neurons Modeled Through Spike-Timing-Dependent Plasticity are Affected by Channelopathies Associated with Autism Spectrum Disorder.",
            "Characterizing EEG Cortical Dynamics and Connectivity with Responses to Single Pulse Electrical Stimulation (SPES).",
            "Metaplasticity: A Promising Tool to Disentangle Chronic Disorders of Consciousness Differential Diagnosis.",
            "A New Delay Connection for Long Short-Term Memory Networks.",
            "Feature Extraction with GMDH-Type Neural Networks for EEG-Based Person Identification.",
            "Announcement - The 2018 Hojjat Adeli Award for Outstanding Contributions in Neural Systems.",
            "Comparing Recalibration Strategies for Electroencephalography-Based Decoders of Movement Intention in Neurological Patients with Motor Disability.",
            "Kurtosis-Based Detection of Intracranial High-Frequency Oscillations for the Identification of the Seizure Onset Zone.",
            "Principal States of Dynamic Functional Connectivity Reveal the Link Between Resting-State and Task-State Brain: An fMRI Study.",
            "Epileptic Seizure Detection Based on Time-Frequency Images of EEG Signals Using Gaussian Mixture Model and Gray Level Co-Occurrence Matrix Features.",
            "Formulation and Implementation of Nonlinear Integral Equations to Model Neural Dynamics Within the Vertebrate Retina.",
            "Identification of Retinal Ganglion Cell Firing Patterns Using Clustering Analysis Supplied with Failure Diagnosis.",
            "Deep Neural Architectures for Mapping Scalp to Intracranial EEG.",
            "Epileptic EEG Identification via LBP Operators on Wavelet Coefficients.",
            "Simplified and Yet Turing Universal Spiking Neural P Systems with Communication on Request.",
            "Gaussian Discriminant Analysis for Optimal Delineation of Mild Cognitive Impairment in Alzheimer's Disease.",
            "Control of a 7-DOF Robotic Arm System With an SSVEP-Based BCI.",
            "A Correction Method of a Binary Classifier Applied to Multi-Label Pairwise Models.",
            "Influence of Cholecystokinin-8 on Compound Nerve Action Potentials from Ventral Gastric Vagus in Rats.",
            "Efficient Embedded Decoding of Neural Network Language Models in a Machine Translation System.",
            "Two-Source Validation of Progressive FastICA Peel-Off for Automatic Surface EMG Decomposition in Human First Dorsal Interosseous Muscle.",
            "Dynamic Redistribution of Plasticity in a Cerebellar Spiking Neural Network Reproducing an Associative Learning Task Perturbed by TMS.",
            "Multi-Objective Genetic Algorithms to Find Most Relevant Volumes of the Brain Related to Alzheimer's Disease and Mild Cognitive Impairment.",
            "Performance Prediction for a Near-Infrared Spectroscopy-Brain-Computer Interface Using Resting-State Functional Connectivity of the Prefrontal Cortex.",
            "The Relationship Between Ictal Multi-Unit Activity and the Electrocorticogram.",
            "A Dynamic Window Recognition Algorithm for SSVEP-Based Brain-Computer Interfaces Using a Spatio-Temporal Equalizer.",
            "Neuronal Activation Detection Using Vector Phase Analysis with Dual Threshold Circles: A Functional Near-Infrared Spectroscopy Study.",
            "A Dual Stimuli Approach Combined with Convolutional Neural Network to Improve Information Transfer Rate of Event-Related Potential-Based Brain-Computer Interface.",
            "Convolutional Neural Networks for Neuroimaging in Parkinson's Disease: Is Preprocessing Needed?",
            "A 3D Convolutional Neural Network to Model Retinal Ganglion Cell's Responses to Light Patterns in Mice."
        ]
    },
    {
        "name": "IJNS",
        "year": "2017",
        "info": "Volume 27: 2017",
        "count": 48,
        "papers": [
            "Introduction.",
            "Seizure Forecasting and the Preictal State in Canine Epilepsy.",
            "Multi-Biosignal Analysis for Epileptic Seizure Monitoring.",
            "Which Brain Regions are Important for Seizure Dynamics in Epileptic Networks? Influence of Link Identification and EEG Recording Montage on Node Centralities.",
            "Neural Activity Elicited by a Cognitive Task can be Detected in Single-Trials with Simultaneous Intracerebral EEG-fMRI Recordings.",
            "Probing to Observe Neural Dynamics Investigated with Networked Kuramoto Oscillators.",
            "Emergence of Narrowband High Frequency Oscillations from Asynchronous, Uncoupled Neural Firing.",
            "Statistical Performance Analysis of Data-Driven Neural Models.",
            "Deep Learning Representation from Electroencephalography of Early-Stage Creutzfeldt-Jakob Disease and Features for Differentiation from Rapidly Progressive Dementia.",
            "Superlinear Summation of Information in Premotor Neuron Pairs.",
            "Sparse Bayesian Learning for Obtaining Sparsity of EEG Frequency Bands Based Feature Vectors in Motor Imagery Classification.",
            "Stress Detection Using Wearable Physiological and Sociometric Sensors.",
            "Towards Tunable Consensus Clustering for Studying Functional Brain Connectivity During Affective Processing.",
            "A Cross-Correlated Delay Shift Supervised Learning Method for Spiking Neurons with Application to Interictal Spike Detection in Epilepsy.",
            "Robust Wavelet Stabilized 'Footprints of Uncertainty' for Fuzzy System Classifiers to Automatically Detect Sharp Waves in the EEG after Hypoxia Ischemia.",
            "A Realistic Seizure Prediction Study Based on Multiclass SVM.",
            "Independent Component Analysis-Support Vector Machine-Based Computer-Aided Diagnosis System for Alzheimer's with Visual Support.",
            "An Ensemble Approach for Cognitive Fault Detection and Isolation in Sensor Networks.",
            "EEG Derived Brain Activity Reflects Treatment Response from Vagus Nerve Stimulation in Patients with Epilepsy.",
            "Independent Component Decomposition of Human Somatosensory Evoked Potentials Recorded by Micro-Electrocorticography.",
            "Defense Against Chip Cloning Attacks Based on Fractional Hopfield Neural Networks.",
            "Changes of Ionic Concentrations During Seizure Transitions - A Modeling Study.",
            "Visibility Graph from Adaptive Optimal Kernel Time-Frequency Representation for Classification of Epileptiform EEG.",
            "Permutation Disalignment Index as an Indirect, EEG-Based, Measure of Brain Connectivity in MCI and AD Patients.",
            "On the Methodological Implications of Extracting Muscle Synergies from Human Locomotion.",
            "Clinical Vagus Nerve Stimulation Paradigms Induce Pronounced Brain and Body Hypothermia in Rats.",
            "Real-Time Control of an Exoskeleton Hand Robot with Myoelectric Pattern Recognition.",
            "Correlated EEG Signals Simulation Based on Artificial Neural Networks.",
            "Resting State Effective Connectivity Allows Auditory Hallucination Discrimination.",
            "An Automated Quiet Sleep Detection Approach in Preterm Infants as a Gateway to Assess Brain Maturation.",
            "Surface EEG-Transcranial Direct Current Stimulation (tDCS) Closed-Loop System.",
            "Beta Hebbian Learning as a New Method for Exploratory Projection Pursuit.",
            "Efficient Variational Approach to Multimodal Registration of Anatomical and Functional Intra-Patient Tumorous Brain Data.",
            "A Real-Time Method for Decoding the Neural Drive to Muscles Using Single-Channel Intra-Muscular EMG Recordings.",
            "A Pareto-based Ensemble with Feature and Instance Selection for Learning from Multi-Class Imbalanced Datasets.",
            "Introduction.",
            "Seizure Control in a Computational Model Using a Reinforcement Learning Stimulation Paradigm.",
            "The Role of Thalamus Versus Cortex in Epilepsy: Evidence from Human Ictal Centromedian Recordings in Patients Assessed for Deep Brain Stimulation.",
            "Dynamics of Epileptiform Discharges Induced by Transcranial Magnetic Stimulation in Genetic Generalized Epilepsy.",
            "Online Automated Seizure Detection in Temporal Lobe Epilepsy Patients Using Single-lead ECG.",
            "Physiological Ripples Associated with Sleep Spindles Differ in Waveform Morphology from Epileptic Ripples.",
            "Epileptic Discharge Related Functional Connectivity Within and Between Networks in Benign Epilepsy with Centrotemporal Spikes.",
            "Long Synfire Chains Emerge by Spike-Timing Dependent Plasticity Modulated by Population Activity.",
            "Online EEG Classification of Covert Speech for Brain-Computer Interfacing.",
            "Spiking Neural P Systems with Communication on Request.",
            "Network Disruption in the Preclinical Stages of Alzheimer's Disease: From Subjective Cognitive Decline to Mild Cognitive Impairment.",
            "Image Sharpness and Contrast Tuning in the Early Visual Pathway.",
            "EEG Classification with a Sequential Decision-Making Method in Motor Imagery BCI."
        ]
    },
    {
        "name": "IJNS",
        "year": "2016",
        "info": "Volume 26: 2016",
        "count": 46,
        "papers": [
            "An Auditory-Tactile Visual Saccade-Independent P300 Brain-Computer Interface.",
            "A General Approach for Quantifying Nonlinear Connectivity in the Nervous System Based on Phase Coupling.",
            "An Improved Sparse Representation over Learned Dictionary Method for Seizure Detection.",
            "Increasing N200 Potentials Via Visual Stimulus Depicting Humanoid Robot Behavior.",
            "A Two-Stage Combining Classifier Model for the Development of Adaptive Dialog Systems.",
            "Neuronal Entropy-Rate Feature of Entopeduncular Nucleus in Rat Model of Parkinson's Disease.",
            "Different Scales of Cortical Organization are Selectively Targeted in the Progression to Alzheimer's Disease.",
            "Discriminating Multiple Emotional States from EEG Using a Data-Adaptive, Multiscale Information-Theoretic Approach.",
            "Quantifying Different Tactile Sensations Evoked by Cutaneous Electrical Stimulation Using Electroencephalography Features.",
            "EEG Alpha and Gamma Modulators Mediate Motion Sickness-Related Spectral Responses.",
            "Analysis of the Complexity Measures in the EEG of Schizophrenia Patients.",
            "An Extended Membrane System with Active Membranes to Solve Automatic Fuzzy Clustering Problems.",
            "Incorporation of Inter-Subject Information to Improve the Accuracy of Subject-Specific P300 Classifiers.",
            "Epileptic Seizure Detection with Log-Euclidean Gaussian Kernel-Based Sparse Representation.",
            "Reduction of Delay in Detecting Initial Dips from Functional Near-Infrared Spectroscopy Signals Using Vector-Based Phase Analysis.",
            "Emotion Recognition with Eigen Features of Frequency Band Activities Embedded in Induced Brain Oscillations Mediated by Affective Pictures.",
            "Faster P300 Classifier Training Using Spatiotemporal Beamforming.",
            "Microsleeps are Associated with Stage-2 Sleep Spindles from Hippocampal-Temporal Network.",
            "Detection of Intracranial Signatures of Interictal Epileptiform Discharges from Concurrent Scalp EEG.",
            "Unsupervised Estimation of Mouse Sleep Scores and Dynamics Using a Graphical Model of Electrophysiological Measurements.",
            "An EEG-Based Fatigue Detection and Mitigation System.",
            "Learning Topologies with the Growing Neural Forest.",
            "Oscillation-Driven Spike-Timing Dependent Plasticity Allows Multiple Overlapping Pattern Recognition in Inhibitory Interneuron Networks.",
            "An Unsupervised Online Spike-Sorting Framework.",
            "High-Density Liquid-State Machine Circuitry for Time-Series Forecasting.",
            "Enhancement of Spike-Timing-Dependent Plasticity in Spiking Neural Systems with Noise.",
            "Intrinsic Plasticity for Natural Competition in Koniocortex-Like Neural Networks.",
            "Classification of EEG Single Trial Microstates Using Local Global Graphs and Discrete Hidden Markov Models.",
            "A Fly-Inspired Mushroom Bodies Model for Sensory-Motor Control Through Sequence and Subsequence Learning.",
            "Towards Artificial Speech Therapy: A Neural System for Impaired Speech Segmentation.",
            "Using Fractal and Local Binary Pattern Features for Classification of ECOG Motor Imagery Tasks Obtained from the Right Brain Hemisphere.",
            "Generalized Models for the Classification of Abnormal Movements in Daily Life and its Applicability to Epilepsy Convulsion Recognition.",
            "Introduction.",
            "Automatic Tuning of a Retina Model for a Cortical Visual Neuroprosthesis Using a Multi-Objective Optimization Genetic Algorithm.",
            "Ensembles of Deep Learning Architectures for the Early Diagnosis of the Alzheimer's Disease.",
            "A Structural Parametrization of the Brain Using Hidden Markov Models-Based Paths in Alzheimer's Disease.",
            "Reconstruction of Neural Activity from EEG Data Using Dynamic Spatiotemporal Constraints.",
            "EEG-Based Detection of Starting and Stopping During Gait Cycle.",
            "A Computational Framework for Realistic Retina Modeling.",
            "Asynchronous Detection of Trials Onset from Raw EEG Signals.",
            "Introduction.",
            "Automated Video Detection of Epileptic Convulsion Slowing as a Precursor for Post-Seizure Neuronal Collapse.",
            "Preventive and Abortive Strategies for Stimulation Based Control of Epilepsy: A Computational Model Study.",
            "Nonlinear Connectivity in the Human Stretch Reflex Assessed by Cross-Frequency Phase Coupling.",
            "Extracellular Potassium and Seizures: Excitation, Inhibition and the Role of Ih.",
            "Seizures Start without Common Signatures of Critical Transition."
        ]
    },
    {
        "name": "IJNS",
        "year": "2015",
        "info": "Volume 25: 2015",
        "count": 45,
        "papers": [
            "Acoustic Space Learning for Sound-Source Separation and Localization on Binaural Manifolds.",
            "A Predictive Modeling Approach to Analyze Data in EEG-fMRI Experiments.",
            "Exploring a Type of Central Pattern Generator Based on Hindmarsh-Rose Model: From Theory to Application.",
            "Adaptive Control of Parkinson's State Based on a Nonlinear Computational Model with Unknown Parameters.",
            "Learning Feature Representations with a Cost-Relevant Sparse Autoencoder.",
            "Spreading Codes Enables the Blind Estimation of the Hemodynamic Response with Short-Events Sequences.",
            "Principal Dynamic Mode Analysis of the Hodgkin-Huxley Equations.",
            "Real-Time EEG-Based Detection of Fatigue Driving Danger for Accident Prediction.",
            "Kernel Collaborative Representation-Based Automatic Seizure Detection in Intracranial EEG.",
            "Neural Correlates of Mathematical Problem Solving.",
            "A Longitudinal EEG Study of Alzheimer's Disease Progression Based on A Complex Network Approach.",
            "A New Work Mechanism on Neuronal Activity.",
            "Discrimination of Schizophrenia Auditory Hallucinators by Machine Learning of Resting-State Functional MRI.",
            "Exploratory Analysis of Power Spectrum and Functional Connectivity During Resting State in Young Binge Drinkers: A MEG Study.",
            "Arm Orthosis/Prosthesis Movement Control Based on Surface EMG Signal Extraction.",
            "Classification of Obsessive Compulsive Disorder by EEG Complexity and Hemispheric Dependency Measurements.",
            "A P300 Brain-Computer Interface Based on a Modification of the Mismatch Negativity Paradigm.",
            "Improving Human Activity Recognition and its Application in Early Stroke Diagnosis.",
            "Artificial Neuron-Glia Networks Learning Approach Based on Cooperative Coevolution.",
            "Uncorrelated Multiway Discriminant Analysis for Motor Imagery EEG Classification.",
            "Electrode Fusion for the Prediction of Self-Initiated Fine Movements from Single-Trial Readiness Potentials.",
            "STRAPS: A Fully Data-Driven Spatio-Temporally Regularized Algorithm for M/EEG Patch Source Imaging.",
            "Introduction.",
            "Direct Causal Networks for the Study of Transcranial Magnetic Stimulation Effects on Focal Epileptiform Discharges.",
            "Automated Seizure Onset Zone Approximation Based on Nonharmonic High-Frequency Oscillations in Human Interictal Intracranial EEGs.",
            "Transcranial Magnetic Stimulation Combined with EEG Reveals Covert States of Elevated Excitability in the Human Epileptic Brain.",
            "Early Seizure Detection Using Neuronal Potential Similarity: A Generalized Low-Complexity and Robust Measure.",
            "Fast Activity Evoked by Intracranial 50 Hz Electrical Stimulation as a Marker of the Epileptogenic Zone.",
            "Early Seizure Detection Algorithm Based on Intracranial EEG and Random Forest Classification.",
            "A Programmer-Interpreter Neural Network Architecture for Prefrontal Cognitive Control.",
            "Multifractal Analysis and Relevance Vector Machine-Based Automatic Seizure Detection in Intracranial EEG.",
            "Gap Junctions as Common Cause of High-Frequency Oscillations and Epileptic Seizures in a Computational Cascade of Neuronal Mass and Compartmental Modeling.",
            "Three-Dimensional Innervation Zone Imaging from Multi-Channel Surface EMG Recordings.",
            "Altered Structural and Functional Feature of Striato-Cortical Circuit in Benign Epilepsy with Centrotemporal Spikes.",
            "Online Epileptic Seizure Prediction Using Wavelet-Based Bi-Phase Correlation of Electrical Signals Tomography.",
            "Understanding Networks of Computing Chemical Droplet Neurons Based on Information Flow.",
            "Simple Algorithms for Distributed Leader Election in Anonymous Synchronous Rings and Complete Networks Inspired by Neural Development in Fruit Flies.",
            "Cell Assembly Signatures Defined by Short-Term Synaptic Plasticity in Cortical Networks.",
            "Distributed One-Class Support Vector Machine.",
            "An Idle-State Detection Algorithm for SSVEP-Based Brain-Computer Interfaces Using a Maximum Evoked Response Spatial Filter.",
            "Epoch-based Entropy for Early Screening of Alzheimer's Disease.",
            "Quantitative Analysis of Rat Dorsal Root Ganglion Neurons Cultured on Microelectrode Arrays Based on Fluorescence Microscopy Image Processing.",
            "A Preclinical Study of Laryngeal Motor-Evoked Potentials as a Marker Vagus Nerve Activation.",
            "Assembling A Multi-Feature EEG Classifier for Left-Right Motor Imagery Data Using Wavelet-Based Fuzzy Approximate Entropy for Improved Accuracy.",
            "Combining EEG Microstates with fMRI Structural Features for Modeling Brain Activity."
        ]
    },
    {
        "name": "IJNS",
        "year": "2014",
        "info": "Volume 24: 2014",
        "count": 48,
        "papers": [
            "Aggregation of Sparse Linear Discriminant analyses for Event-Related potential Classification in Brain-Computer Interface.",
            "Self-Supervised MRI Tissue Segmentation by Discriminative Clustering.",
            "Drug Polyconsumption is associated with increased Synchronization of Brain Electrical-Activity at REST and in a Counting Task.",
            "Effects of Extremely Low-frequency magnetic Fields on the Response of a conductance-Based Neuron Model.",
            "Multi-Strategy coevolving aging Particle Optimization.",
            "A Neural observer with Time-varying Learning rate: Analysis and Applications.",
            "Introduction.",
            "On the Midway to epilepsy: is cortical excitability Normal in patients with isolated seizures?",
            "Dynamics of Collective Multi-stability in Models of Multi-Unit neuronal Systems.",
            "The effect of High and Low frequency cortical Stimulation with a Fixed or a Poisson Distributed Interpulse Interval on cortical excitability in rats.",
            "Computational Modeling of Transcranial Direct Current Stimulation in the child Brain: Implications for the Treatment of Refractory childhood focal epilepsy.",
            "Automated seizure Detection using EKG.",
            "Cortical excitability as a potential Clinical Marker of epilepsy: a Review of the Clinical Application of Transcranial magnetic Stimulation.",
            "Improved Adaptive Splitting and Selection: the Hybrid Training Method of a Classifier Based on a Feature Space Partitioning.",
            "A Genetic Graph-Based Approach for Partitional Clustering.",
            "Unorganized Machines for seasonal streamflow Series Forecasting.",
            "Multi-Instance Dictionary Learning for Detecting Abnormal Events in Surveillance Videos.",
            "Detection of Driving fatigue by using Noncontact EMG and ECG signals Measurement System.",
            "Singular Spectrum Analysis and Adaptive Filtering Enhance the Functional connectivity Analysis of resting State fMRI Data.",
            "Nev2lkit: a New Open Source Tool for Handling neuronal Event Files from Multi-electrode recordings.",
            "Separating burst from Background Spikes in multichannel neuronal recordings using Return Map Analysis.",
            "Frequency Recognition in SSVEP-Based BCI using Multiset Canonical Correlation Analysis.",
            "Evaluation and Application of a Hybrid Brain Computer Interface for Real Wheelchair Parallel Control with Multi-Degree of Freedom.",
            "Epileptic EEG Classification Based on Kernel Sparse Representation.",
            "Bregman Divergences for Growing Hierarchical Self-Organizing Networks.",
            "Introduction.",
            "Studying the Role of Synchronized and Chaotic Spiking Neural Ensembles in Neural Information Processing.",
            "Optimal Sparse Approximation with Integrate and Fire Neurons.",
            "Simulating Vertical and Horizontal Inhibition with Short-Term Dynamics in a Multi-column Multi-Layer Model of neocortex.",
            "A generalized leaky Integrate-and-Fire Neuron Model with Fast Implementation Method.",
            "An Optimization Spiking Neural P System for Approximately Solving Combinatorial Optimization Problems.",
            "Code-Specific Learning Rules Improve Action Selection by Populations of Spiking Neurons.",
            "A Neuron-Based Time-Optimal controller of Horizontal Saccadic eye movements.",
            "A Cluster Merging Method for Time Series microarray with production Values.",
            "A High-Speed Brain Speller using steady-State Visual evoked potentials.",
            "Multiple oscillatory States in Models of Collective neuronal Dynamics.",
            "Sensor (Group Feature) Selection with Controlled Redundancy in a Connectionist Framework.",
            "Principal Polynomial Analysis.",
            "Extraction of Neural Control Commands using Myoelectric Pattern Recognition: a Novel Application in adults with cerebral Palsy.",
            "Early Prediction of Medication Refractoriness in children with Idiopathic epilepsy Based on scalp EEG Analysis.",
            "Structurally Enhanced Incremental Neural Learning for Image Classification with Subgraph Extraction.",
            "Retrieval of noisy Fingerprint Patterns using Metric Attractor Networks.",
            "Event-Related Complexity Analysis and its Application in the Detection of Facial attractiveness.",
            "Low-rank Approximation Based non-Negative Multi-Way Array Decomposition on Event-Related potentials.",
            "An ERP-Based BCI using an oddball Paradigm with Different Faces and Reduced errors in Critical Functions.",
            "The Super-Turing Computational Power of plastic Recurrent Neural Networks.",
            "Intelligent Multiagent Coordination Based on Reinforcement Hierarchical Neuro-fuzzy Models.",
            "Adaptation-dependent Synchronization Transitions and burst Generations in electrically coupled Neural Networks."
        ]
    },
    {
        "name": "IJNS",
        "year": "2013",
        "info": "Volume 23: 2013",
        "count": 38,
        "papers": [
            "Introduction.",
            "Cortical excitability and Refractory epilepsy: a Three-Year longitudinal Transcranial Magnetic Stimulation Study.",
            "Efficacy of a New charge-Balanced Biphasic Electrical Stimulus in the isolated Sciatic nerve and the hippocampal Slice.",
            "Reactive Control of epileptiform discharges in Realistic Computational neuronal Models with Bistability.",
            "Phase Synchronization of neuronal noise in mouse hippocampal epileptiform Dynamics.",
            "A Decade of Experience with Deep Brain Stimulation for patients with Refractory Medial Temporal Lobe epilepsy.",
            "Transcranial Magnetic Stimulation (TMS) modulates epileptiform discharges in patients with Frontal Lobe epilepsy: a Preliminary EEG-TMS Study.",
            "Localization of epileptic foci using Multimodality neuroimaging.",
            "A Single-Switch BCI Based on Passive and imagined movements: toward Restoring Communication in Minimally Conscious patients.",
            "A New Linear muscle Fiber Model for Neural Control of saccades.",
            "Phase Synchronization in Brain Networks derived from Correlation between Probabilities of Recurrences in Functional MRI Data.",
            "Perceptual suppression revealed by Adaptive Multi-Scale Entropy Analysis of Local Field potential in monkey Visual cortex.",
            "Multi-Domain Feature Extraction for Small Event-Related potentials through Nonnegative Multi-Way Array Decomposition from Low Dense Array EEG.",
            "Single-Trial Motor Imagery Classification using Asymmetry Ratio, phase Relation, Wavelet-Based Fractal, and their Selected Combination.",
            "Double-Layered Models Can Explain Macro and Micro Structure of Human Sleep.",
            "A Multi-Layer Neural-Mass Model for Learning Sequences using Theta/Gamma oscillations.",
            "Automated Diagnosis of epilepsy using CWT, HOS and Texture parameters.",
            "Adaptive and Predictive Control of a Simulated Robot arm.",
            "Adaptive Filtering and Random Variables coefficient for Analyzing Functional Magnetic Resonance Imaging Data.",
            "Combination of Heterogeneous EEG Feature Extraction Methods and stacked Sequential Learning for Sleep Stage Classification.",
            "Design of assistive Wheelchair System directly Steered by Human Thoughts.",
            "Application of Higher Order cumulant Features for Cardiac Health Diagnosis using ECG signals.",
            "Efficient Automatic Selection and Combination of EEG Features in Least Squares Classifiers for Motor Imagery Brain-Computer Interfaces.",
            "A Binary phase-Shift Keying Receiver for the Detection of Attention to Human speech.",
            "Closed-Loop Control of the thalamocortical Relay Neuron's Parkinsonian State Based on Slow Variable.",
            "Robust neonatal EEG seizure Detection through Adaptive Background Modeling.",
            "Behind the magical numbers: Hierarchical Chunking and the Human Working Memory Capacity.",
            "Assessment of Feature Selection and Classification Approaches to Enhance Information from overnight oximetry in the Context of Apnea Diagnosis.",
            "Multimodal Integration of Micro-Doppler Sonar and auditory signals for Behavior Classification with convolutional Networks.",
            "Indirect Adaptive Control of nonlinear Systems Based on Bilinear Neuro-Fuzzy Approximation.",
            "Application of Intrinsic Time-Scale Decomposition (ITD) to EEG signals for Automated seizure Prediction.",
            "A Clustering-Based Fuzzy Wavelet Neural Network Model for Short-Term Load Forecasting.",
            "A Gray-Box Neural Network-Based Model Identification and Fault estimation Scheme for nonlinear Dynamic Systems.",
            "Application of Quantum-behaved Particle Swarm Optimization to Motor imagery EEG Classification.",
            "Electrophysiological responses from vagus nerve Stimulation in rats.",
            "Comparison of ictal and interictal EEG signals using Fractal Features.",
            "Evolving RBF Neural Networks for Adaptive Soft-Sensor Design.",
            "Erratum: \"Analysis of Absence seizure Generation using EEG Spatial-Temporal Regularity Measures\"."
        ]
    },
    {
        "name": "IJNS",
        "year": "2012",
        "info": "Volume 22: 2012",
        "count": 37,
        "papers": [
            "Enhancing the Yield of High-Density electrode Arrays through Automated electrode Selection.",
            "A Novel Efficient Learning Algorithm for Self-Generating Fuzzy Neural Network with Applications.",
            "Adaptive Control for MIMO uncertain nonlinear Systems Using Recurrent Wavelet Neural Network.",
            "Application of Competitive Hopfield Neural Network to Brain-Computer Interface Systems.",
            "Weak resonant Double Hopf bifurcations in an Inertial Four-Neuron Model with Time Delay.",
            "Ensembles of Neural Networks Based on the Alteration of Input Feature Values.",
            "A New Parametric Feature Descriptor for the Classification of Epileptic and Control EEG Records in Pediatric Population.",
            "Application of Non-Linear and Wavelet Based Features for the Automated Identification of Epileptic EEG signals.",
            "Binding and Segmentation via a Neural Mass Model Trained with Hebbian and Anti-Hebbian Mechanisms.",
            "Dynamical Recurrent Neuro-Fuzzy Identification Schemes Employing Switching parameter Hopping.",
            "A Neural-Visualization IDS for Honeynet Data.",
            "A Novel Electrical Stimulation Paradigm for the Suppression of epileptiform Activity in an in vivo Model of mesial Temporal Lobe Status Epilepticus.",
            "Head-Centric Disparity and Epipolar Geometry Estimation from a Population of Binocular Energy Neurons.",
            "Artificial Neural Network Based Approach to EEG Signal Simulation.",
            "An auditory Brain-Computer Interface with Accuracy Prediction.",
            "On the Learning Potential of the Approximated Quantron.",
            "Automated Diagnosis of Normal and Alcoholic EEG signals.",
            "Introduction.",
            "Span: Spike Pattern Association Neuron for Learning Spatio-Temporal Spike Patterns.",
            "From Sensors to Spikes: Evolving Receptive Fields to Enhance Sensorimotor Information in a Robot-Arm.",
            "Hardware Implementation of Stochastic Spiking Neural Networks.",
            "Presynaptic Learning and Memory with a Persistent Firing Neuron and a Habituating Synapse: a Model of Short Term Persistent Habituation.",
            "Modeling fluctuations in Default-Mode Brain Network Using a Spiking Neural Network.",
            "Relationship between Applicability of Current-Based Synapses and Uniformity of Firing Patterns.",
            "Introduction.",
            "Adaptive k-Means Algorithm for Overlapped Graph Clustering.",
            "Unsupervised Markerless 3-DOF Motion Tracking in Real Time using a Single Low-Budget Camera.",
            "On the Segmentation and Classification of Hand Radiographs.",
            "Linear Time Relational Prototype Based Learning.",
            "Multichannel Decoding for Phase-Coded SSVEP Brain-Computer Interface.",
            "Online Semi-Supervised Growing Neural Gas.",
            "Analysis of Absence Seizure Generation using EEG Spatial-Temporal Regularity Measures.",
            "Benefits of Multi-Domain Feature of mismatch Negativity Extracted by Non-Negative Tensor Factorization from EEG Collected by Low-Density Array.",
            "Novel Consensus Approaches to the Reliable Ranking of Features for Seabed Imagery Classification.",
            "Application of Empirical Mode Decomposition (EMD) for Automated Detection of epilepsy using EEG signals.",
            "Human Action Recognition using Meta-Cognitive Neuro-Fuzzy Inference System.",
            "Biologically Inspired Face Recognition: toward Pose-Invariance."
        ]
    },
    {
        "name": "IJNS",
        "year": "2011",
        "info": "Volume 21: 2011",
        "count": 38,
        "papers": [
            "Space Partitioning Strategies for Indoor WLAN Positioning with Cascade-Connected ANN Structures.",
            "Semi-Supervised Analysis of Human Brain Tumours from Partially Labeled MRS Information, Using Manifold Learning Models.",
            "An Evaluation of Multiple Feed-Forward Networks on GPUs.",
            "Information Quantification of Empirical Mode Decomposition and Applications to Field Potentials.",
            "Recurrence-Based Estimation of Time-Distortion Functions for ERP Waveform Reconstruction.",
            "Xcsc: a Novel Approach to Clustering with Extended Classifier System.",
            "Recursive Discriminant Regression Analysis to Find Homogeneous Groups.",
            "Abnormal interictal Gamma Activity May Manifest a Seizure Onset Zone in Temporal Lobe Epilepsy.",
            "Detection of Nonlinear Interactions of EEG alpha Waves in the Brain by a New Coherence Measure and its Application to Epilepsy and Anti-Epileptic Drug Therapy.",
            "Phase resetting Analysis of High potassium epileptiform Activity in CA3 Region of the rat Hippocampus.",
            "Transcutaneous Focal Electrical Stimulation via Concentric Ring Electrodes Reduces Synchrony Induced by Pentylenetetrazole in beta and Gamma Bands in Rats.",
            "Effect of Stimulus Parameters in the Treatment of Seizures by Electrical Stimulation in the Kainate Animal Model.",
            "Closed-Loop Seizure Control with Very High Frequency Electrical Stimulation at Seizure Onset in the Gaers Model of Absence Epilepsy.",
            "Finite Dimensional Structure of the GPI discharge in Patients with Parkinson's Disease.",
            "Testing of Information Condensation in a Model Reverberating Spiking Neural Network.",
            "Application of Recurrence Quantification Analysis for the Automated Identification of Epileptic EEG Signals.",
            "Nonlinear Torque and Air-to-Fuel Ratio Control of SPARK Ignition Engines Using Neuro-Sliding Mode Techniques.",
            "Foreground Detection in Video Sequences with Probabilistic Self-Organizing Maps.",
            "Generating Balanced Learning and Test Sets for Function Approximation Problems.",
            "Introduction.",
            "Rule Extraction from Minimal Neural Networks for Credit Card Screening.",
            "Hybrid Neural Intelligent System to Predict Business Failure in Small-to-Medium-Size Enterprises.",
            "Improving Classification Accuracy and Causal Knowledge for Better Credit Decisions.",
            "Artificial Metaplasticity Neural Network Applied to Credit Scoring.",
            "Nonlinear System Identification and Control Based on Modular Neural Networks.",
            "Continuous EEG Signal Analysis for Asynchronous BCI Application.",
            "Intrinsic Curvature: a Marker of Millimeter-Scale Tangential cortico-Cortical Connectivity?",
            "Responsive Neuromodulators Based on Artificial Neural Networks Used to Control Seizure-like Events in a Computational Model of Epilepsy.",
            "Adaptive cerebellar Spiking Model Embedded in the Control Loop: Context Switching and Robustness against noise.",
            "Automatic Detection of Epileptic EEG Signals Using Higher Order cumulant Features.",
            "Excitement and Synchronization of Small-World Neuronal Networks with Short-Term Synaptic Plasticity.",
            "A Lempel-Ziv Complexity-Based Neural Network Pruning Algorithm.",
            "Introduction.",
            "Efficient Kernelized Prototype Based Classification.",
            "Ranking-Based Kernels in Applied Biomedical Diagnostics Using a Support Vector Machine.",
            "Discovering Significant Evolution Patterns from Satellite Image Time Series.",
            "Blood glucose Level Neural Model for Type 1 Diabetes Mellitus Patients.",
            "The S2-Ensemble Fusion Algorithm."
        ]
    },
    {
        "name": "IJNS",
        "year": "2010",
        "info": "Volume 20: 2010",
        "count": 38,
        "papers": [
            "Cascade Process Modeling with Mechanism-Based Hierarchical Neural Networks.",
            "Protein Subcellular Multi-Localization Prediction Using a Min-Max Modular Support Vector Machine.",
            "Discrete-Time Reduced Order Neural Observers for Uncertain Nonlinear Systems.",
            "A Hybrid Artificial Bee Colony Optimization and Quantum Evolutionary Algorithm for Continuous Optimization Problems.",
            "A Dual-Model Jumping Fuzzy System Approach to Networked Control Systems Design.",
            "A Repair Algorithm for Radial Basis Function Neural Network and its Application to Chemical oxygen Demand Modeling.",
            "A New Neural Observer for an Anaerobic Bioreactor.",
            "Caller Behaviour Classification Using Computational Intelligence Methods.",
            "Decoding Grating Orientation from microelectrode Array Recordings in Monkey Cortical Area V4.",
            "Prediction of Parkinson's Disease tremor Onset Using a Radial Basis Function Neural Network Based on Particle Swarm Optimization.",
            "Identification of nonlinear Oscillatory Activity Embedded in Broadband Neural Signals.",
            "Indirect Adaptive Control of Unknown Multi Variable nonlinear Systems with Parametric and Dynamic Uncertainties Using a New Neuro-Fuzzy System Description.",
            "A Discrete-Time Recurrent Neurofuzzy Network for Black-Box Modeling of insulin Dynamics in Diabetic Type-1 Patients.",
            "Automatic Identification of Epileptic and Background EEG Signals Using Frequency Domain Parameters.",
            "Data Compression and Regression through Local Principal Curves and Surfaces.",
            "State and Parameter Estimation for Canonic Models of Neural oscillators.",
            "A Riemannian Distance Approach for Constructing Principal Curves.",
            "Principal Manifolds and Graphs in Practice: from Molecular Biology to Dynamical Systems.",
            "Network Complexity and Synchronous Behavior - an Experimental Approach.",
            "The Role of dopamine in the Maintenance of Working Memory in prefrontal Cortex Neurons: Input-Driven versus Internally-Driven Networks.",
            "Learning Eye Vergence Control from a Distributed Disparity Representation.",
            "Single-Trial Based Independent Component Analysis on mismatch Negativity in Children.",
            "Coupled Singular Value Decomposition of a Cross-Covariance Matrix.",
            "A New Direct Adaptive regulator with Robustness Analysis of Systems in Brunovsky Form.",
            "Muscle Emulation with DC Motor and Neural Networks for Biped Robots.",
            "Human Activity Recognition Based on Evolving Fuzzy Systems.",
            "Variable Selection in Nonlinear Modeling Based on RBF Networks and Evolutionary Computation.",
            "Designing Boosting Ensemble of Relational Fuzzy Systems.",
            "An Online Self-Organizing Scheme for Parsimonious and Accurate Fuzzy Neural Networks.",
            "Fuzzy Regression Modeling for Tool Performance Prediction and Degradation Detection.",
            "Backpropagation through Time Training of a Neuro-Fuzzy Controller.",
            "Automated Nonlinear System Modeling with Multiple Fuzzy Neural Networks and Kernel Smoothing.",
            "Knowledge Extraction from Evolving Spiking Neural Networks with Rank Order Population Coding.",
            "An FPGA Hardware/Software Co-Design towards Evolvable Spiking Neural Networks for Robotics Application.",
            "An STDP Training Algorithm for a Spiking Neural Network with Dynamic Threshold Neurons.",
            "On the Probabilistic Optimization of Spiking Neural Networks.",
            "Case Study on a Self-Organizing Spiking Neural Network for Robot Navigation.",
            "Analysis and Automatic Identification of Sleep Stages Using Higher Order Spectra."
        ]
    },
    {
        "name": "IJNS",
        "year": "2009",
        "info": "Volume 19: 2009",
        "count": 37,
        "papers": [
            "Improving Supervised Learning by Adapting the Problem to the Learner.",
            "Adaptive Machine Learning Technique for Periodicity Detection in Biological Sequences.",
            "Symmetry Axis Based Object Recognition under Translation, Rotation and Scaling.",
            "Synchronization of Stochastic Delayed Neural Networks with Markovian Switching and its Application.",
            "Global Synchronization in an Array of Discrete-Time Neural Networks with Nonlinear Coupling and Time-Varying Delays.",
            "A Comparative Study of Data Sampling Techniques for Constructing Neural Network Ensembles.",
            "Dynamic Competitive Probabilistic Principal Components Analysis.",
            "An Action Generation Model by Using Time Series Prediction and its Application to Robot Navigation.",
            "Nonlinear System Identification Based on Internal Recurrent Neural Networks.",
            "Modeling and Optimization of a Pharmaceutical Formulation System Using Radial Basis Function Network.",
            "Erratum: \"the uniqueness Theorem for Complex-Valued Neural Networks with Threshold Parameters and the Redundancy of the Parameters\".",
            "Neuromodulation of Epileptic Foci in Patients with Non-lesional Refractory Motor Epilepsy.",
            "Seizure abatement with Single DC Pulses: is Phase resetting at Play?",
            "Non-Invasive Computerized System for Automatically Initiating Vagus Nerve Stimulation Following Patient-Specific Detection of Seizures or epileptiform discharges.",
            "Control of Synchronization of Brain Dynamics leads to Control of Epileptic Seizures in Rodents.",
            "Calibration of Neurotransmitter Release from Neural Cells for Therapeutic implants.",
            "Deep Brain Stimulation for the Treatment of Epilepsy.",
            "Treating Epilepsy via Adaptive Neurostimulation: a Reinforcement Learning Approach.",
            "Adaptiveness in Monotone Pseudo-Boolean Optimization and Stochastic Neural Computation.",
            "A Fully Complex-Valued Radial Basis Function Network and its Learning Algorithm.",
            "Novel Stability Criteria on Discrete-Time Neural Networks with Both Time-Varying and Distributed Delays.",
            "A Neural Network Model for Credit Risk Evaluation.",
            "Spiking Neural Networks.",
            "An updated Time-Optimal 3rd-Order Linear Saccadic Eye Plant Model.",
            "Reinforcement Learning in Supply Chains.",
            "Robust Location and Spread Measures for Nonparametric Probability Density Function Estimation.",
            "Bursting Near Bautin bifurcation in a Neural Network with Delay Coupling.",
            "Stability Analysis of a Class of General Periodic Neural Networks with Delays and impulses.",
            "Improving Neural Networks Prediction Accuracy Using Particle Swarm Optimization Combiner.",
            "Modeling of glutamate-Induced Dynamical Patterns.",
            "Mathematical Study on ionic Mechanism of lamprey Central Pattern Generator Model.",
            "Impossibility of asymptotic Synchronization for Pulse-Coupled oscillators with Delayed excitatory Coupling.",
            "Faster Training Using Fusion of Activation Functions for Feed Forward Neural Networks.",
            "Global Exponential Stability of Fuzzy Interval Delayed Neural Networks with impulses on Time Scales.",
            "No-Reference Video Quality Measurement with Support Vector Regression.",
            "Chaos-Based Mixed Signal Implementation of Spiking Neurons.",
            "An Intelligent Load Shedding Scheme Using Neural Networks and Neuro-Fuzzy."
        ]
    },
    {
        "name": "IJNS",
        "year": "2008",
        "info": "Volume 18: 2008",
        "count": 41,
        "papers": [
            "An Experimental Study of Hybridizing Cultural Algorithms and Local Search.",
            "Tabu Search Model Selection for SVM.",
            "Patterns Out of Cases Using Kohonen Maps in Breast Cancer Diagnosis.",
            "Towards Expanding Relevance Vector Machines to Large Scale Datasets.",
            "Two-Stage Biometric Authentication Method Using Thought Activity Brain Waves.",
            "Online Detection of the Modality of Complex-Valued Real World Signals.",
            "Polarized Signal Classification by Complex and quaternionic Multi-Layer Perceptrons.",
            "Learning by Criterion Optimization on a Unitary Unimodular Matrix Group.",
            "Flexible Nonlinear Blind Signal Separation in the Complex Domain.",
            "The uniqueness Theorem for Complex-Valued Neural Networks with Threshold Parameters and the Redundancy of the Parameters.",
            "Associative Memory in quaternionic Hopfield Neural Network.",
            "Pseudo-Relaxation Learning Algorithm for Complex-Valued Associative Memory.",
            "Chaotic Synchronization Using a Network of Neural oscillators.",
            "Global Dynamics of a Class of Complex Valued Neural Networks.",
            "Frequency-Multiplexing Ability of Complex-Valued Hebbian Learning in Logic Gates.",
            "Online Clustering Algorithms.",
            "Improvement of Image Classification Using Wavelet Coefficients with Structured-Based Neural Network.",
            "Robust Exponential Stability of Markovian Jumping Neural Networks with Time-Varying Delay.",
            "Neural Adaptive Control for Vibration Suppression in Composite Fin-Tip of Aircraft.",
            "Flexible Structure Multiple Modeling Using Irregular Self-Organizing Maps Neural Network.",
            "Lmi-Based asymptotic Stability Analysis of Neural Networks with Time-Varying Delays.",
            "Emergence of Preferred Firing Sequences in Large Spiking Neural Networks during Simulated Neuronal Development.",
            "Experience-Consistent Modeling for Radial Basis Function Neural Networks.",
            "A New Method for the Re-Implementation of Threshold Logic Functions with Cellular Neural Networks.",
            "Adaptive Fuzzy Control with Output Feedback for H∞ Tracking of SISO Nonlinear Systems.",
            "The Labeled Systems of Multiple Neural Networks.",
            "A Modified Lamstar Neural Network and its Applications.",
            "Color Image Segmentation with Support Vector Machines: Applications to Road Signs Detection.",
            "Erratum: \"flexible Structure Multiple Modeling Using Irregular Self-Organizing Maps Neural Network\".",
            "Collision Avoidance in Commercial Aircraft Free Flight via Neural Networks and Non-Linear Programming.",
            "Pruning Artificial Neural Networks Using Neural Complexity Measures.",
            "Document Image binarisation Using a Supervised Neural Network.",
            "Cursive Word Recognition Based on Interactive Activation and Early Visual Processing Models.",
            "An Improvement of Extreme Learning Machine for Compact Single-Hidden-Layer Feedforward Neural Networks.",
            "An LMI Approach to Design Hinfinity Controllers for Discrete-Time Nonlinear Systems Based on Unified Models.",
            "Blood Cell Identification Using a Simple Neural Network.",
            "Evolving edited k-Nearest Neighbor Classifiers.",
            "Self-Organising Mixture autoregressive Model for Non-Stationary Time Series Modelling.",
            "Topological Mappings of Video and Audio Data.",
            "Reverse Engineering a Social Agent-Based Hidden Markov Model - VISAGE.",
            "Biologically Plausible BSDT Recognition of Complex Images: the Case of Human Faces."
        ]
    },
    {
        "name": "IJNS",
        "year": "2007",
        "info": "Volume 17: 2007",
        "count": 42,
        "papers": [
            "Neural Network Approach for Image chromatic Adaptation for Skin Color Detection.",
            "Neural Network Models for Earthquake Magnitude Prediction Using Multiple seismicity Indicators.",
            "Existence and Global Exponential Stability of Periodic Solution of a Class of impulsive Networks with Infinite Delays.",
            "New Criteria on Global Exponential Stability of BAM Neural Networks with Distributed Delays and Reaction-Diffusion Terms.",
            "Stability of Neural Field.",
            "Synchronization Measures of the Scalp Electroencephalogram Can Discriminate Healthy from Alzheimer's Subjects.",
            "Granger Causality between Multiple Interdependent Neurobiological Time Series: Blockwise versus Pairwise Methods.",
            "Role of Refractory Period in homoclinic Models of Neural Synchronization.",
            "Network Dynamics and Synchronous Activity in cultured Cortical Neurons.",
            "Noise Controlled Synchronization in potassium Coupled Neural Models.",
            "Maintaining Synchronization by Decentralized Feedback Control in Time Delay Neural Networks with Parameter Uncertainties.",
            "Controlling Synchronization in a Neuron-Level Population Model.",
            "Measuring the Directionality of Coupling: Phase versus State Space Dynamics and Application to EEG Time Series.",
            "A Radial Basis Function Network Approach for the Computation of Inverse Continuous Time Variant Functions.",
            "Dynamic Memorization Characteristics in Neural Networks with Different Neuronal Dynamics.",
            "An SOM-Based Algorithm for Optimization with Dynamic Weight Updating.",
            "A Flexible Annealing Chaotic Neural Network to Maximum Clique Problem.",
            "Biomechanical Stability Analysis of the lambda-Model Controlling One Joint.",
            "Delay-Dependent Robust Exponential Stability for Uncertain Recurrent Neural Networks with Time-Varying Delays.",
            "Online Learning of Objects in a Biologically Motivated Visual Architecture.",
            "A Model of Grid Cells Based on a Twisted Torus Topology.",
            "Adaptive Thresholds for Neural Networks with Synaptic Noise.",
            "Recurrent Neural Networks are Universal approximators.",
            "A Neural Network Model of Metaphor Understanding with Dynamic Interaction Based on a Statistical Language Analysis: Targeting a Human-Like Model.",
            "Attention and Visual Search.",
            "An Embedded Saliency Map Estimator Scheme: Application to Video Encoding.",
            "Nonnegative Tensor Factorization for Continuous EEG Classification.",
            "Does Abnormal spinal Reciprocal Inhibition lead to Co-Contraction of Antagonist Motor Units? A Modeling Study.",
            "Towards Reasoning and Coordinating Action in the Mental Space.",
            "Integrating Image Quality in 2nu-SVM Biometric Match Score Fusion.",
            "Non-Linear Global Optimization via Parameterization and Inverse Function Approximation: an Artificial Neural Networks Approach.",
            "Evolutionary Optimization of Sequence Kernels for Detection of bacterial gene Starts.",
            "Gps Receivers Timing Data Processing Using Neural Networks: Optimal Estimation and Errors Modeling.",
            "New Criteria of Almost Periodic Solution for BAM Neural Networks with Delays and impulsive Effects.",
            "Stability Analysis of impulsive Cohen-Grossberg Neural Network with Unbounded Discrete Time-Varying Delays.",
            "LP Approximation Capabilities of Sum-of-Product and Sigma-pi-Sigma Neural Networks.",
            "Asymptotic Stability of Delay-Difference System of Hopfield Neural Networks via Matrix Inequalities and Application.",
            "Multilayer Nonnegative Matrix Factorization Using Projected Gradient Approaches.",
            "A Comparative Study of Clustering Methods for Molecular Data.",
            "A Fast Method for Implicit Surface Reconstruction Based on Radial Basis Functions Network from 3D Scattered Points.",
            "Svm-Based Learning Control of Space Robots in Capturing Operation.",
            "Multi-View Gender Classification Using Multi-Resolution Local Binary Patterns and Support Vector Machines."
        ]
    },
    {
        "name": "IJNS",
        "year": "2006",
        "info": "Volume 16: 2006",
        "count": 41,
        "papers": [
            "Analysis and Implementation of a Neural Extended Kalman Filter for Target Tracking.",
            "A Novel Connectionist Framework for Computation of an Approximate Convex-hull of a Set of Planar Points, Circles and Ellipses.",
            "Classification of Mental Tasks from Eeg Signals Using Extreme Learning Machine.",
            "The Forecast of the Postoperative Survival Time of Patients Suffered from Non-small Cell Lung Cancer Based on Pca and Extreme Learning Machine.",
            "A Neural Network Controller for the Path Tracking Control of a Hopping Robot Involving Time Delays.",
            "Neuro-fuzzy Decision Trees.",
            "Biophysical and Phenomenological Models of Multiple Spike Interactions in Spike-timing Dependent Plasticity.",
            "Neural Synchronization via Potassium Signaling.",
            "The Role of the Basal Ganglia in Exploration in a Neural Model Based on Reinforcement Learning.",
            "Wavelet-based Estimation of Hemodynamic Response Function from Fmri Data.",
            "Spatio-temporal Modeling and Analysis of Fmri Data Using Narx Neural Network.",
            "An Adaptive Visual Neuronal Model Implementing Competitive, Temporally Asymmetric Hebbian Learning.",
            "Evolving Digital Circuits Using Hybrid Particle Swarm Optimization and Differential Evolution.",
            "Second Order Neurons and Learning in Cohen-grossberg Networks.",
            "Some New Stability Properties of Dynamic Neural Networks with Different Time-scales.",
            "A Hybrid Neural Learning Algorithm Using Evolutionary Learning and Derivative Free Local Search Method.",
            "Computational Neurogenetic Modelling: a Pathway to New Discoveries in Genetic Neuroscience.",
            "Erratum: \"the Role of the Basal Ganglia in Exploration in a Neural Model Based on Reinforcement Learning\".",
            "Self-organization of Spiking Neural Network that Generates Autonomous Behavior in a Real Mobile Robot.",
            "A Neural Network Model for the Simulation of Word Production Errors of Finnish Nouns.",
            "Pose Estimation in Automated Visual Inspection Using Genetic Algorithm.",
            "On the Influence of Parameter theta- on Performance of Rbf Neural Networks Trained with the Dynamic Decay Adjustment Algorithm.",
            "Pruning and Model-selecting Algorithms in the Rbf Frameworks Constructed by Support Vector Learning.",
            "A Delayed Neural Network Method for Solving Convex Optimization Problems.",
            "Dynamic Output Feedback Stabilization for Nonlinear Systems Based on Standard Neural Network Models.",
            "Erratum: \"neuro-fuzzy Decision Trees\".",
            "Introduction.",
            "On the Universal Clustering under a Broad Class of Loss Functions.",
            "Regularization Network-based Gene Selection for Microarray Data Analysis.",
            "Mixture Models for Detecting Differentially Expressed Genes in Microarrays.",
            "The Prediction of Bacterial Transcription Start Sites Using Svms.",
            "Value at Risk Estimation Using Independent Component Analysis-generalized Autoregressive Conditional Heteroscedasticity (ica-garch) Models.",
            "Manifold Learning for Robot Navigation.",
            "Clustering of Stored Memories in an Attractor Network with Local Competition.",
            "Computer Simulation Study on Central Pattern Generator: from Biology to Engineering.",
            "Sentence Alignment Using Feed Forward Neural Network.",
            "Robust Exponential Stabilization of a Class of Delayed Neural Networks with Reaction-diffusion Terms.",
            "Analog Vlsi Implementation of Resonate-and-fire Neuron.",
            "Kohonen's Feature Maps for Fly Ash Categorization.",
            "A Novel Global Exponential Stability Result for Discrete-time Cellular Neural Networks with Variable Delays.",
            "Relaxed Stability Conditions for Delayed Recurrent Neural Networks with Polytopic Uncertainties."
        ]
    },
    {
        "name": "IJNS",
        "year": "2005",
        "info": "Volume 15: 2005",
        "count": 42,
        "papers": [
            "Introduction.",
            "Automated diagnosis of brain tumours astrocytomas using probabilistic neural network clustering and support vector machines.",
            "Hippocampal memory modification induced by pattern completion and spike-timing dependent synaptic plasticity.",
            "A neural network model for trace conditioning.",
            "Receptive field properties of near neighbor orientation selective neurons in the visual cortex: a modeling study.",
            "Development of neural mechanisms for machine learning.",
            "Development of feedforward receptive field structure of a simple cell and its contribution to the orientation selectivity: a modeling study.",
            "Protein metal binding residue prediction based on neural networks.",
            "Beamforming of ultra-wideband pulses by a complex-valued spatio-temporal multilayer neural network.",
            "Dynamics of betting behavior under flat reward condition.",
            "Visual approach to supervised variable selection by self-organizing map.",
            "Phase dynamics of complex-valued neural networks and its application to traffic signal control.",
            "The role of global and feature based information in gender classification of faces: a comparison of human performance and computational models.",
            "Models of hopfield-type quaternion neural networks and their energy functions.",
            "Hybrid neural systems for pattern recognition in artificial noses.",
            "Learning to cooperate in solving the traveling salesman problem.",
            "Self-organizing map-based discovery and visualization of human endogenous retroviral sequence groups.",
            "Autoassociative memory design using interconnected generalized brain-state-in-a-box neural networks.",
            "The combined use of self-organizing maps and andrews' curves.",
            "A bayesian recurrent neural network for unsupervised pattern recognition in large incomplete data sets.",
            "Multi/infinite dimensional neural networks, multi/infinite dimensional logic theory.",
            "Exploratory modeling of yeast stress response and its regulation with gcca and associative clustering.",
            "Qualified predictions for microarray and proteomics pattern diagnostics with confidence machines.",
            "Franksum: new feature selection method for protein function prediction.",
            "Equivalence between \"feeling the pulse\" on the human wrist and the pulse pressure wave at fingertip.",
            "Fast similarity search for protein 3d structures using topological pattern matching based on spatial relations.",
            "On construction of stochastic genetic networks based on gene expression sequences.",
            "Modeling and analysis of gene expression time-series based on co-expression.",
            "Feedforward neural network models for handling class overlap and class imbalance.",
            "Theoretical analysis of a time-frequency-pcnn auditory cortex model.",
            "A high-order graph generating self-organizing structure.",
            "Antenna impedance matching with neural networks.",
            "The use of gas-sensor arrays to diagnose urinary tract infections.",
            "Neural networks for the optimization of crude oil blending.",
            "A multi-clustering fusion scheme for data partitioning.",
            "Full-state tracking control of a mobile robot using neural networks.",
            "Image storage for automated crystallization imaging systems.",
            "Hardware implementation of a new artificial neuron.",
            "A modified error backpropagation algorithm for complex-value neural networks.",
            "Fast time delay neural networks.",
            "An improved genetic algorithm based fuzzy-tuned neural network.",
            "Applications of support vector machines to cancer classification with microarray data."
        ]
    },
    {
        "name": "IJNS",
        "year": "2004",
        "info": "Volume 14: 2004",
        "count": 33,
        "papers": [
            "A Self-Stabilizing Learning Rule for Minor Component Analysis.",
            "Multi-Layered Greedy Network-Growing Algorithm: Extension of Greedy Network-Growing Algorithm to Multi-Layered Networks.",
            "Automatic Kernel Regression Modelling Using Combined Leave-One-Out Test Score and Regularised Orthogonal Least Squares.",
            "Generalization of Features in the Assembly Neural Networks.",
            "Rough Sets and Genetic Algorithms in Learning Cellular Neural Networks Cloning Template for Decision Making System.",
            "Gaussian Processes For Machine Learning.",
            "An Annealed Chaotic Maximum Neural Network For Bipartite Subgraph Problem.",
            "Predicting Spatial Data With Rbf Networks.",
            "Nonlinear System Modelling Via Optimal Design Of Neural Trees.",
            "Fractal Characterization Of BPN Weights Evolution.",
            "Clustering-Neural Network Models For Freeway Work Zone Capacity Estimation.",
            "Software Reliability Prediction Using Recurrent Neural Network With Bayesian Regularization.",
            "A Neural-Network Approach For Visual Cryptography And Authorization.",
            "Complexity Of Error Hypersurfaces In Multilayer Perceptrons.",
            "Efficient Training Of Rbf Networks For Classification.",
            "On The Limit Cycle Structure Of Threshold Boolean Networks Over Complete Graphs.",
            "Model-free functional mri analysis using topographic independent component analysis.",
            "Global robust stability for shunting inhibitory CNNs with delays.",
            "Artificial neural network based soft estimator for estimation of transducer static nonlinearity.",
            "Template learning of cellular neural network using genetic programming.",
            "Optimal competitive hopfield network with stochastic dynamics for maximum cut problem.",
            "Advances in blind source separation (BSS) and independent component analysis (ICA) for nonlinear mixtures.",
            "Relative uncertainty learning theory: an essay.",
            "Time-oriented hierarchical method for computation of principal components using subspace learning algorithm.",
            "Design of general bidirectional associative memories with improved recall capability.",
            "A novel approach for short-term load forecasting using support vector machines.",
            "Attractability and location of equilibrium point of cellular neural networks with time-varying delays.",
            "Text-independent speaker verification using minimal resource allocation networks.",
            "Unsupervised fuzzy clustering using weighted incremental neural networks.",
            "On the structure and initial parameter identification of gaussian rbf networks.",
            "An improved transiently chaotic neural network for the maximum independent set problem.",
            "Step to improve neural cryptography against flipping attacks.",
            "A neural network model with feature selection for korean speech act classification."
        ]
    },
    {
        "name": "IJNS",
        "year": "2003",
        "info": "Volume 13: 2003",
        "count": 46,
        "papers": [
            "Applying the SOM Model to Text Classification According to Register and Stylistic Content.",
            "A Hierarchical Method for Finding Optimal Architecture and Weights Using Evolutionary Least Square Based Learning.",
            "A Local Training-Pruning Approach for Recurrent Neural Networks.",
            "Text Compression Using Hybrids of BWT and GBAM.",
            "Global Asymptotic Stability of a Class of Dynamical Neural Networks.",
            "Introduction by Guest Editors.",
            "An Efficient Approach to the Travelling Salesman Problem Using Self-Organizing Maps.",
            "Fuzzy Connectives as a Combination Tool in a Hybrid Multi-Neural System.",
            "Neural Network Training with Global Optimization Techniques.",
            "Wavelet-Like Receptive Fields Emerges by Non-Linear Minimization of Neuron Error.",
            "NSL: A Neuro-Symbolic Language for a Neuro-Symbolic Processor (NSP).",
            "Artificial Neural Network Learning of Nonstationary Behavior in Time Series.",
            "Modeling a Particular Decision Process by Using a Modulatory Activation Function.",
            "Modeling and Production of Robot Trajectories Using the Temporal Parametrized Self Organizing Maps.",
            "A Network of Coupled Chaotic Maps for Adaptive Multi-Scale Image Segmentation.",
            "Associative Memory Design Using Overlapping Decomposition and Generalized Brain-State-in-a-Box Neural Networks.",
            "Singular Value Decomposition Learning on Double Stiefel Manifold.",
            "Global and Robust Stability of Interval Hopfield Neural Networks with Time-Varying Delays.",
            "Cost Component Analysis.",
            "Global Convergence of Delayed Neural Network Systems.",
            "A Hybrid Neural Network of Addressable and Content-Addressable Memory.",
            "A New Modulated Hebbian Learning Rule - Biologically Plausible Method for Local Computation of a Principal Subspace.",
            "FPGA Implementation of a Pyramidal Weightless Neural Networks Learning System.",
            "Correcting Distortions in Panoramic Images Using Constructive Neural Networks.",
            "Novel Neutral Network Approach to Call Admission Control in High-speed Networks.",
            "Fingerprint Matching Using Recurrent Autoassociative Memory.",
            "Stiefel-Manifold Learning by Improved Rigid-Body Theory Applied to ICA.",
            "Entropy Learning and Relevance Criteria for Neural Network Pruning.",
            "A Robust Subspace Algorithm for Principal Component Analysis.",
            "The Nonlinear Predictability of the Electrotelluric Field Variations Data Analyzed with Support Vector Machines as an Earthquake Precursor.",
            "Binary Neural Network Training Algorithms Based on Linear Sequential Learning.",
            "A Som Projection Technique with the Growing Structure for Visualizing High-Dimensional Data.",
            "Novel Stability Criteria for Delayed Cellular Neural Networks.",
            "On Stability of Cellular Neural Networks with Polynomial Interactions.",
            "The Role of Field Coupling in Nano-Scale Cellular Nonlinear Networks.",
            "Influence of System Non-Uniformity on Dynamic Phenomena in Arrays of Coupled Nonlinear Networks.",
            "Distributed Sensor Networks: A Cellular Nonlinear Network Perspective.",
            "CNN Universal Machine as Classificaton Platform: An Art-Like Clustering Algorithm.",
            "ACE16k: A 128x128 Focal Plane Analog Processor with Digital I/O.",
            "CMOS Realization of a 2-Layer CNN Universal Machine Chip.",
            "Realization of Couplings in a Polynomial Type Mixed-Mode Cellular Neural Network.",
            "Fingerprint Image Enhancement Using CNN Filtering Techniques.",
            "SC-CNNs for Chaotic Signal Applications in Secure Communication Systems.",
            "Sensory Feedback in CNN-Based Central Pattern Generators.",
            "Analysis of Multidimensional Neural Activity Via CNN-UM.",
            "Cellular Neural Networks (CNN) with Linear Weight Functions for a Prediction of Epileptic Seizures."
        ]
    },
    {
        "name": "IJNS",
        "year": "2002",
        "info": "Volume 12: 2002",
        "count": 35,
        "papers": [
            "Estimation of Hourly Average Solar Radiation on Tilted Surface Via ANNs.",
            "Stability of Dead Zone Bidirectional Associative Memory Neural Networks Involving Time Delays.",
            "Hierarchical Genetic Algorithm for Near-Optimal Feedforward Neural Network Design.",
            "New Learning Automata Based Algorithms for Adaptation of Backpropagation Algorithm Parameters.",
            "Feature Decomposition Architectures for Neural Networks: Algorithms, Error Bounds, and Applications.",
            "Effects of Dilation and Translation on a Perceptron-Type Learning Rule for Higher Order Hopfield Neural Networks.",
            "A Semi-Localized Elastic Net for Surface Reconstruction of Objects from Multislice Images.",
            "Distinguishing Spurious and Nominal Attractors Applying Unlearning to an Asymmetric Neural Network.",
            "Kernel-Kohonen Networks.",
            "Neuronal Dynamics Under Periodic Stimuli.",
            "On Computing the Fuzzifier in -FLVQ: A Data Driven Approach.",
            "Constructing a Query-Able Radial Basis Function Artificial Neural Network.",
            "Stability Analysis of Higher-Order Neural Networks for Combinatorial Optimization.",
            "Relating Priming and Repetition Suppression.",
            "Training Simultaneous Recurrent Neural Network with Resilient Propagation for Static Optimization.",
            "Unsupervised Neural Learning on Lie Group.",
            "A Discrete Fully Recurrent Network of Max Product Units for Associative Memory and Classification.",
            "Neural Network Based Temporal Video Segmentation.",
            "A Neural Network Approach to Approximating Map in Belief Networks.",
            "Extracting the Principal Behavior of a Probabilistic Supervisor Through Neural Networks Ensemble.",
            "Improved Backpropagation Learning in Neural Networks with Windowed Momentum.",
            "The Accurate Estimation of Meteorological Profiles Employing ANNs.",
            "A Minor Subspace Algorithm Based on Neural Stiefel Dynamics.",
            "Selecting Neural Networks for a Committee Decision.",
            "An Approach to Improve Wang-Smith Chaotic Simulated Annealing.",
            "An MLP Training Algorithm Taking into Account Known Errors on Inputs and Outputs.",
            "A Comparative Study on Kernel-Based Probabilistic Neural Networks for Speaker Verification.",
            "Genetic Programming of Polynomial Harmonic Networks Using the Discrete Fourier Transform.",
            "Neural Adaptive Control of Nonlinear Multivariable Systems with Application to a Class of Inverted Pendulums.",
            "Using Weighted Fixed Neural Networks for Unsupervised Fuzzy Clustering.",
            "Decision Making Using Hybrid Rough Sets and Neural Networks.",
            "Incremental Learning in Biological and Machine Learning Systems.",
            "A Tabular Learning Structure with an Adaptable k-d Tree for Relaxation of the Curse of Dimensionality.",
            "Pose Estimation in Automated Visual Inspection using ANN.",
            "Reconfigurable Control System Design for Fault Diagnosis and Accommodation."
        ]
    },
    {
        "name": "IJNS",
        "year": "2001",
        "info": "Volume 11: 2001",
        "count": 50,
        "papers": [
            "Improved Long-Term Temperature Prediction by Chaining of Neural Networks.",
            "Unsupervised Learning and Temporal Context to Recall Complex Robot Trajectories.",
            "Analogue VLSI for Probabilistic Networks and Spike-Time Computation.",
            "A Neural Network Architecture for Data Classification.",
            "Best Harmony, Unified RPCL and Automated Model Selection for Unsupervised and Supervised Learning on Gaussian Mixtures, Three-Layer Nets and ME-RBF-SVM Models.",
            "A Short-Term Temperature Forecaster Based on a Novel Radial Basis Functions Neural Network.",
            "Neural Network Control Systems that Learn to Perform Appropriately.",
            "Modelling and Prediction for Chaotic FIR Laser Attractor Using Rational Function Neural Network.",
            "Perception of Odors by a Nonlinear Model of the Olfactory Bulb.",
            "Ockham's Razor Modeling of the Matrisome Channels of the Basal Ganglia Thalamocortical Loops.",
            "DMP3: A Dynamic Multilayer Perceptron Construction Algorithm.",
            "A Selective Learning Method to Improve the Generalization of Multilayer Feedforward Neural Networks.",
            "Neural Networks and Logical Reasoning Systems: A Translation Table.",
            "Neural Cost Functions and Search Strategies for the Generation of Block Designs: An Experimental Evaluation.",
            "Stochastic Radial Basis Functions.",
            "Adaptive Control of Mobile Robots Using a Neural Network.",
            "Backpropagation Algorithm Adaptation Parameters Using Learning Automata.",
            "Design of a Neurofuzzy Controller with Simplified Architecture.",
            "CDMA & TDMA Based Neural Nets.",
            "A Study on Rule Extraction from Several Combined Neural Networks.",
            "Training SVMs with EDR Algorithm.",
            "Recent Advances in the MOBJ Algorithm for Training Artifical Neural Networks.",
            "A Proposed Max-Product Threshold Unit for Classification of Pattern Vectors.",
            "A Novel Approach for Solving Constrained Nonlinear Optimization Problems Using Neurofuzzy Systems.",
            "Evolutionary Optimization of RBF Networks.",
            "Three Case Studies of the Gasnet Model in Discrete Domains.",
            "A Late-Stopping Method for Optimal Aggregation of Neural Networks.",
            "A Goal-Driven Neural Propositional Interpreter.",
            "Application of the Recommendation Architecture to Telecommunications Network Management.",
            "Identification of a Landmark in a Roentgenographic Cephalogram by Employing the Wavelet Neurons.",
            "Direct Explanations for the Development and Use of a Multi-layer Perceptron Network that Classifies Low-back-pain Patients.",
            "Eeg Source Localization: A Compartive Study of Classical and Neural Network Methods.",
            "Neural Network Based Automatic Diagnosis of Children with Brain Dysfunction.",
            "High Order Statistics for Image Classification.",
            "Weight Groupings in Second Order Training Methods for Recurrent Networks.",
            "Probability Density Function Learning by Unsupervised Neurons.",
            "Global Mapping Analysis: Stochastic Approximation for Multidimensional Scaling.",
            "Constructing a Fuzzy Rule-Based System Using the ILFN Network and Genetic Algorithm.",
            "String Matching Artificial Neural Networks.",
            "Artificial Neural Networks for Blur Identification and Restoration of Nonlinearly Degraded Images.",
            "A Recurrent Neural Network for Partitioning of Hand Drawn Characters into Strokes of Different Orientations.",
            "The Simultaneous Recurrent Neural Network for Addressing the Scaling Problem in Static Optimization.",
            "Establishing an Index Arbitrage Model by Applying Neural Networks Method - A Case Study of Nikkei 225 Index.",
            "Introduction By Guest Editors: Non-Gradient Learning Techniques.",
            "Alopex-B: A New, Simpler, But Yet Faster Version Of The Alopex Training Algorithm.",
            "Improving Artmap Learning Through Variable Vigilance.",
            "Automatic Determination Of Radial Basis Functions: An Immunity-Based Approach.",
            "Recruitment Learning Of Boolean Functions In Sparse Random Networks.",
            "A Biologically Inspired Neural Network For Dynamic Programming.",
            "A Fast And Convergent Stochastic Mlp Learning Algorithm."
        ]
    },
    {
        "name": "IJNS",
        "year": "2000",
        "info": "Volume 10: 2000",
        "count": 39,
        "papers": [
            "A Fast Fixed-Point Algorithm for Independent Component Analysis of Complex Valued Signals.",
            "A Study of Early Stopping and Model Selection Applied to the Papermaking Industry.",
            "Neural Networks in Analog Hardware - Design and Implementation Issues.",
            "Inductive Learning Approaches to Rainfall-Runoff Modelling.",
            "Curved Trajectory Prediction Using a Self-Organizing Neural Network.",
            "A Semi-Parametric Hybrid Neural Model for Nonlinear Blind Signal Separation.",
            "Complex-Valued Minimal Resource Allocation Network for Nonlinear Signal Processing.",
            "Variable Sensitivity in Unsupervised Clustering Tasks with an N-Tuple-Based Self-Organising Neural Network.",
            "Higher Order Neural Network Group Models for Financial Simulation.",
            "Radical Pruning: A Method to Construct Skeleton Radial Basis Function Networks.",
            "Fast Oscillations in Cortical Circuits, by Roger D. Traub, John G. R. Jefferys and Miles A. Whittington.",
            "Digital VLSI Algorithms and Architectures for Support Vector Machines.",
            "Implementation Of A Pulse Coupled Neural Network in FPGA.",
            "A Programmable VLSI Filter Architecture for Application in Real-Time Vision Processing Systems.",
            "VLSI Implementation of Neural Networks.",
            "Convergence Analysis of Cascade Error Projection - An Efficient Learning Algorithm for Hardware Implementation.",
            "Simulink-Based HW/SW Codesign of Embedded Neuro-Fuzzy Systems.",
            "Automating Parallel Implementation of Neural Learning Algorithms.",
            "FPNA: Interaction Between FPGA and Neural Computation.",
            "A Discrete-Time Lagrangian Network for Solving Constrained Quadratic Programs.",
            "Tuning Diversity in Bagged Ensembles.",
            "On the Capacity of Multilayer Neural Networks Trained with Backpropagation.",
            "Neural Fuzzy Preference Integration Using Neural Preference Moore Machines.",
            "Cooperative Coevolution of Neural Representations.",
            "Instabilities and Oscillation in the Deterministic Boltzmann Machine.",
            "Methods in Neuronal Modeling (2nd Edition), by C. Koch & I. Segev (eds.).",
            "A Genetic Algorithm with Adaptive Mutations and Family Competition for Training Neural Networks.",
            "Short-Term Prediction of Chaotic Time Series by Using RBF Network with Regression Weights.",
            "Kernel and Nonlinear Canonical Correlation Analysis.",
            "Features Selection and Architecture Optimization in Connectionist Systems.",
            "Assessing RBF Networks Using DELVE.",
            "Content-Based Image Retrieval System Using Neural Networks.",
            "A Local Training and Pruning Approach for Neural Networks.",
            "Local Linear Independent Component Analysis Based on Clustering.",
            "Combining Regression Trees and Radial Basis Function Networks.",
            "Dynamical Properties of Min-Max Networks.",
            "Neurocomputers: A Dead End?",
            "Rival Penalized Competitive Learning Based Approach for Discrete-Valued Source Separation.",
            "Neuronal Ensembles: Strategies for Recording and Decoding by H. Eichenbaum and J. L. Davis."
        ]
    },
    {
        "name": "IJNS",
        "year": "1999",
        "info": "Volume 9: 1999",
        "count": 56,
        "papers": [
            "Feedforward Neural Network with Adaptive Reference Pattern Layer.",
            "Neural Networks and Linear Programming for the Satisfiability Problem.",
            "Solving Linear Integer Programming Problems by a Novel Neural Model.",
            "A Memory-Based Self-Generated Basis Function Neural Network.",
            "Synchronous and Asynchronous Brain-State-in-a-Box Information System Neural Models.",
            "Partial Retraining: A New Approach to Input Relevance Determination.",
            "A Neural Network Methodology of Quadratic Optimization.",
            "Asymptotic Hyperstability of a Class of Neural Networks.",
            "An Experimental Comparison of Neural Algorithms for Independent Component Analysis and Blind Separation.",
            "Color Image Correction for Scanner and Printer Using B-spline CMAC Neural Networks.",
            "Modular Neural Networks A Survey.",
            "Recognition of Seed Varieties using a Temporal Organisation Map Analysis of Electrophoretic Images.",
            "Editorial: \"Artificial Neural Networks in Brazil: An Introduction to the Special Issue of IJNS\".",
            "Improving the Discriminatory Capabilities of a Neural Classifier by Using a Biased-Wavelet Layer.",
            "Thermodynamics Energy for both Supervised and Unsupervised Learning Neural Nets at a Constant Temperature.",
            "Neural Networks Learning with Sliding Mode Control: The Sliding Mode Backpropagation Algorithm.",
            "Estimating the Number of Clusters in Multivariate Data by Self-Organizing Maps.",
            "Sequential RAM-based Neural Networks: Learnability, Generalisation, Knowledge Extraction, and Grammatical Inference.",
            "Nonlinear System Identification Using a Neo Fuzzy Neuron Algorithm: Electrical Drive Application.",
            "A Self-Organizing Algorithm for Vector Quantizer Design Applied to Signal Processing.",
            "Approximation Techniques for Neuromimetic Calculus.",
            "Unsupervised Learning and Recall of Temporal Sequences: An Application to Robotics.",
            "Autonomous Learning based on Cost Assumptions: Theoretical Studies and Experiments in Robot Control.",
            "Multilayer Neural Networks and Function Reconstruction by Using a priori Knowledge.",
            "Knowledge Extraction: A Comparison between Symbolic and Connectionist Methods.",
            "Biologically Plausible Models of Topographic Map Formation in the Somatosensory and Auditory Cortices.",
            "The Backpropagation Algorithm in J, a Fast Prototyping Tool for Researching Neural Networks.",
            "Successive Learning in Hetero-Associative Memory Using Chaotic Neural Networks.",
            "Human Learning Characteristics in the Tracking Tasks of Iterative Nature.",
            "A Space-Time Delay Neural Network for Motion Recognition and its Application to Lipreading.",
            "Growing of a Fuzzy Recurrent Artificial Neural Network (Frann) for Pattern Classification.",
            "A New Neural Network Architecture with Associative Memory, Pruning and Order-Sensitive Learning.",
            "A Framework for Models of Biological Behaviour.",
            "Visual Homing in Analog Hardware.",
            "An Analog VLSI Inplementation of a Visual Interneuron Enhanced Sensory Processing Through Biophysical Modeling.",
            "A Neuromorphic Hair Sensor Model of Wind-Mediated Escape in the Cricket.",
            "Using a Mobile Robot to Study Locust Collision Avoidance Responses.",
            "Integrating Neuromorphic Action-Oriented Perceptual Inputs to Generate a Navigation Behaviour for a Robot.",
            "An Asic-Chip for Stereoscopic Depth Analysis in Video-Real-Time Based on Visual Cortical Cell Behavior.",
            "Real Time Image Processing with an Analog Vision Chip System.",
            "A Multi-Differential Neuromorphic Approach to Motion Detection.",
            "Acoustic Transient Classification with a Template Correlation Processor.",
            "Human Localisation of Band-Pass Filtered Noise.",
            "A Spike-Based Model of Binaural Sound Localization.",
            "A Biologically Plausible Acoustic Motion Detection Neural Network.",
            "Speech-Intelligibility Improvements Using a Binaural Adaptive-Scheme Based Conceptually on Human Auditory Processing.",
            "Multi-Sensor Neural-Network Processing of Noisy Speech.",
            "Fast Digital Simulation of Spiking Neural Networks and Neuromorphic Integration with Spikelab.",
            "SPIKEII: An Integrate-and-Fire AVLSI Chip.",
            "Stimulus Correlation and Adaptive Motion Detection Using Spiking Neurons.",
            "Silicon Cellular Morphology.",
            "Neocognitron's Parameter Tuning by Genetic Algorithms.",
            "A New Measurement of Noise Immunity and Generalization Ability for MLPs.",
            "DNA Fragment Assembly Using Neural Prediction Techniques.",
            "Recognition of Handwritten Similar Chinese Characters by Self-Growing Probabilistic Decision-Based Neural Network.",
            "A Modular Neural Network Architecture for Pattern Classification Based on Different Feature Sets."
        ]
    },
    {
        "name": "IJNS",
        "year": "1997",
        "info": "Volume 8: 1997",
        "count": 57,
        "papers": [
            "An Automated Procedure for Cluster Analysis of Multivariate Satellite Data.",
            "Classification of Handwritten Digits using a RAM Neural Net Architecture.",
            "Dynamic Cell Structures for the Evaluation of Keypoints in Facial Images.",
            "Gaussian Neural Networks for Glass Bottles Inspection: A Learning Procedure.",
            "Radar Image Segmentation Using Self-Adapting Recurrent Networks.",
            "Application of a Multi-Structure Neural Network (MSNN) to Sorting Pistachio Nuts.",
            "A Hybrid Classifier for Remote Sensing Applications.",
            "Neural Network Visual Recognition for Automation of the Microelectromechanical Systems Assembly.",
            "Growing 3D-SOMs with 2D-Input Layer as a Classification Tool in a Motion Detection System.",
            "Using Neural Networks to Automatically Detect Brain Tumours in MR Images.",
            "Self-Supervised Learning in Cooperative Stereo Vision Correspondence.",
            "A Neural Network Based Artificial Vision System for Licence Plate Recognition.",
            "Video Sequence Compression via Supervised Training on Cellular Neural Networks.",
            "Automatic Segmentation and Classification of Outdoor Images Using Neural Networks.",
            "An Adaptive Training Method for Optimal Interpolative Neural Nets.",
            "Classification of User Expertise Level by Neural Networks.",
            "Translation-, Rotation-, Scale-, and Distortion-Invariant Object Recognition Through Self-Organization.",
            "Supervised Adaptive Hamming Net for Classification of Multiple-Valued Patterns.",
            "Recognition of Rotating Images Using an Automatic Feature Extraction Technique and Neural Networks.",
            "Data Mining of Inputs: Analysing Magnitude and Functional Measures.",
            "On Neural Blind Separation with Noise Suppression and Redundancy Reduction.",
            "A Supervised Learning Network Based on Adaptive Resonance Theory.",
            "Book Review: \"Impossible Minds\", by Igor Aleksander.",
            "Book Review: \"Neural Networks for Pattern Recognition\", by Christopher M. Bishop.",
            "Invariant Object Recognition Using Higher-Order Neural Networks, Line-Segment Spectra and Multi-Resolution Training.",
            "The Convergence of Backpropagation Trained Neural Networks for Various Weight Update Frequencies.",
            "Real-Time Neural Network Based Camera Localization and its Extension to Mobile Robot Control.",
            "Stability Analysis of a Class of Noise Perturbed Neural Networks.",
            "Symmetry Breaking and Training from Incomplete Data with Radial Basis Boltzmann Machines.",
            "High Resolution Measurement of Translucent Plastic Wall Thicknesses by Computerized Tomography and Neural Networks.",
            "SISO Nonlinear System Identification Using a Fuzzy-Neural Hybrid System.",
            "Static and Dynamic State Feedback Control Model of Basal Ganglia-Thalamocortical Loops.",
            "Book Review: \"Neural Networks in Financial Engineering: Proceedings of the Fourth International Conference on Neural Networks in the Capital Markets (NNCM-95)\", by A.-P. N. Refenes, Y. Abu-Mostafa, J. Moody, A. Weigend.",
            "Book Review: \"How we Learn; How we Remember; Toward an Understanding of Brain and Neural Systems\", by Leon N. Cooper.",
            "Understanding Time-Series Networks: A Case Study in Rule Extraction.",
            "Modeling Volatility Using State Space Models.",
            "A Constrained Neural Network Kalman Filter for Price Estimation in High Frequency Financial Data.",
            "Nonlinear Trading Models Through Sharpe Ratio Maximization.",
            "Using a Financial Training Criterion Rather than a Prediction Criterion.",
            "Switching Portfolios.",
            "Improved Option Pricing Using Artificial Neural Networks and Bootstrap Methods.",
            "A First Application of Independent Component Analysis to Extracting Structure from Stock Returns.",
            "Letter to the Editor: Neural Solution to the Correction of Miss Distance in Gun Fire Control System.",
            "Universal Distribution of Saliencies for Pruning in Layered Neural Networks.",
            "On a Recurrent Neural Network Producing Oscillations.",
            "A Cascading Structure and Training Method for Multilayer Neural Networks.",
            "Adaptive Rival Penalized Competitive Learning and Combined Linear Predictor Model for Financial Forecast and Investment.",
            "A Survey of Partially Connected Neural Networks.",
            "The Prospects for Analogue Neural VLSI.",
            "A Neural Network Method for Identification of Prokaryotic and Eukaryotic Signal Peptides and Prediction of their Cleavage Sites.",
            "Least-Squares Methods for Blind Source Separation Based on Nonlinear PCA.",
            "Motion Planning with Complete Knowledge Using a Colored Som.",
            "Two Constructive Methods for Designing Compact Feedforward Networks of Threshold Units.",
            "Entropic Analysis and Incremental Synthesis of Multilayered Feedforward Neural Networks.",
            "Stochastic ICA Contrast Maximisation Using Oja's Nonlinear PCA Algorithm.",
            "Book Review: \"Mind: Introduction to Cognitive Science\", by Paul Thagard.",
            "Book Review: \"High-Level Vision: Object Recognition and Visual Cognition\"."
        ]
    },
    {
        "name": "IJNS",
        "year": "1996",
        "info": "Volume 7: 1996",
        "count": 74,
        "papers": [
            "An Attractor Neural Network Model of Classical Conditioning.",
            "Analytical Interpretation of Feed-Forward Nets outputs after Training.",
            "Speaker identification using Time-delay Hmes.",
            "Hardware Prototypes of a Boolean Neural Network and the Simulated Annealing Optimization Method.",
            "A Unified Neural Bigradient Algorithm for robust PCA and MCA.",
            "On the Characteristics of the quadratic order Associative Memory that Uses Synchronous Update and Direct convergence.",
            "An Adaptive Boolean Automaton to Model Circadian cycles.",
            "Role of Chaos in Trial-and-error Problem Solving by an Artificial Neural Network.",
            "Book Review: Fluids Concepts and Creative Analogies: Computer Models of the Fundamental Mechanisms of Thought.",
            "A Higher order Bayesian Neural Network with Spiking Units.",
            "Learning activation Rules Rather than Connection weights.",
            "Constructive Training Methods for feedforward Neural Networks with Binary weights.",
            "Side effects of Normalising Radial Basis Function Networks.",
            "Improvement of Projection-Type Associative Memories by using a Two-phase Recalling Procedure.",
            "Neural Networks in Petroleum Engineering: a Case Study.",
            "Nonlinear Time Series Analysis by Neural Networks: a Case Study.",
            "CNN: a speaker Recognition System using a Cascaded Neural Network.",
            "Corrigendum: neuronal Mechanisms Underlying the Interaction between Visual Landmarks and Path Integration in the rat.",
            "Book Review: Empirical Methods for Artificial Intelligence.",
            "Learning Multiple Causes by Competition Enhanced least mean Square error Reconstruction.",
            "A low-Dimensional, Time-resolved and Adapting Model Neuron.",
            "Determination of dependent and Independent Communication Paths using Neural Networks.",
            "A Regularization Term to Avoid the saturation of the Sigmoids in Multilayer Neural Networks.",
            "Empirical error-confidence Curves for Neural Network and Gaussian Classifiers.",
            "Using a Feed-Forward Network to incorporate the Relation between Attractees and attractors in a generalized discrete Hopfield Network.",
            "Equilibrium and attractivity Analysis for a class of Hetero-Associative Neural Memories.",
            "Concept Hierarchy Memory Model: a Neural Architecture for Conceptual Knowledge Representation, Learning, and Commonsense Reasoning.",
            "What Causes Ion Channel Proteins to Fluctuate Open and Closed?",
            "A Dynamical Model of the Distributed Interaction of Intracellular Signals.",
            "Can Quantum Processes Control Synaptic Emission?",
            "Noise in Models of Neurological and Psychiatric Disorders.",
            "The Receptor Mosaic Hypothesis of the Engram: Possible Relevance of Boolean Network Modelling.",
            "Spontaneous Signalling in Small Central Neurons: Mechanisms and Roles of Spike-Amplitude and Spike-Interval Fluctuations.",
            "Simultaneous Detection of Action Potential Current Waveforms and Single Ion Channel Openings in Rat Cerebellar Granule Cells.",
            "Stochastic Resonance and Time Advance Coding in Chemical Reactions.",
            "Chaos Control by Electric Current in an Enzymatic Reaction.",
            "Neuronal Oscillations and Stochastic Limit Cycles.",
            "Synchronized Chaos in Local Cortical Circuits.",
            "Prediction of Arterial \"Burst\" Activity and Transitions Between Chaotic Attractors with a Multilayer Perceptron Optimized by a New Stopping Criterion.",
            "Detecting Low Dimensional Dynamics in Biological Experiments.",
            "Light Adaptation and Reliability in Blowfly Photoreceptors.",
            "Learning Synfire Chains: Turning Noise into Signal.",
            "A New Type of Self-Organization Associated with Chaotic Dynamics in Neural Networks.",
            "Brain Chaos and Computation.",
            "Random Activity at the Microscopic Neural Level in Cortex (\"Noise\") Sustains and is Regulated by Low-Dimensional Dynamics of Macroscopic Cortical Activity (\"Chaos\").",
            "Spontaneous and Evoked Cortical Dynamics During Deep Anaesthesia.",
            "Reafference and Attractors in the Olfactory System During Odor Recognition.",
            "Global Effects of Fluctuations in Neural Information Processing.",
            "Control of Spatiotemporal Chaos in Neuronal Networks.",
            "Multicompartmental Modeling of Neural Ciricuits in the Olfactory Bulb.",
            "The Importance of Noise for Segmentation and Binding in Dynamical Neural Systems.",
            "Robust Feedforward Processing in Synfire Chains.",
            "Impact of Information Compression on Intellectual Activities in the Brain.",
            "Noise in the Brain: A Physical Network Model.",
            "Identification of Coherent Structures in Turbulent Shear Flows with a Fuzzy Artmap Neural Network.",
            "A Fuzzy Adaptive Learning Control Network with On-Line Structure and Parameter Learning.",
            "Frequency-Spatial Transformation: A Proposal for Parsimonious Intra-Cortical Communication.",
            "Synchrony in Binary-Oscillator Networks with Local Couplings.",
            "A Competitive Activation Neural Network Model for the Weighted Minimum Vertex Covering.",
            "Using Neural Networks to Solve the Multicast Routing Problem in Packet Radio Networks.",
            "Probabilistic Interpretation of Feedforward Network Outputs, with Relationships to Statistical Prediction of Ordinal Quantities.",
            "LIA: A Location-Independent Transformation for ASOCS Adaptive Algorithm 2.",
            "Optimal Nonlinear Training in the Multi-Class Proximity Problem.",
            "Book Review: The Subtlety of Sameness, by Robert M. French.",
            "Simple Neuron Models for Independent Component Analysis.",
            "Dilation and Translation for Incomplete Sigma-Pi Neural Networks of Hopfield-Type - A Case Study.",
            "VLSI Neural System Architecture for Finite Ring Recursive Reduction.",
            "Definition of New 3D Invariants -- Applications to Pattern Recognition Problems with Neural Networks.",
            "Attraction Basin of Bidirectional Associative Memories.",
            "A Neural Network for Position Invariant Pattern Recognition Combining Spiking Neurons with the Fourier-Transform.",
            "Manipulator Adaptive Control by Neural Networks in an Orange Picking Robot.",
            "Self-Organizing Multi-Resolution Grid for Motion Planning and Control.",
            "Book Review: Being There: Putting Brain, Body, and World Together Again, by A. Clark.",
            "Book Review: Speech a Special Code, by A. M. Liberman."
        ]
    },
    {
        "name": "IJNS",
        "year": "1995",
        "info": "Volume 6: 1995",
        "count": 36,
        "papers": [
            "Interaction of neuronal populations with delay: effect of frequency mismatch and feedback gain.",
            "Noise-enhanced performance in a cortical associative memory model.",
            "Pruning of a large network by optimal brain damage and surgeon: an example from biological sequence analysis.",
            "Learning with piece-wise linear networks.",
            "Analysis of training set parallelism for backpropagation neural networks.",
            "Human-like dynamic programming neural networks for dynamic time warping speech recognition.",
            "Locally activated neural networks and stable neural controller design for nonlinear dynamic systems.",
            "Book Review: \"Artificial Neural Network for Speech and Vision\", by Richard J. Mammone.",
            "Predicting conditional probability distributions: a connectionist approach.",
            "Using the potts glass for solving the clustering problem.",
            "Ensemble competitive learning neural networks with reduced input dimension.",
            "Dynamical recurrent neural networks -- towards environmental time series prediction.",
            "On the functional equivalence of fuzzy inference systems and spline-based networks.",
            "Fuzzy neural networks: between functional equivalence and applicability.",
            "A perspective and critique of adaptive neurofuzzy systems used for modelling and control applications.",
            "Book Review: \"Neurocomputers: An Overview of Neural Networks in VLSI\", by Manfred Glesner and Werner Pochmuller.",
            "Book Review: \"Cellular Neural Networks\", by T. Roska and J. Vandewalle.",
            "On the equivalence of two-layered perceptrons with binary neurons.",
            "Methods of training and constructing multilayer perceptrons with arbitrary pattern sets.",
            "Learning in recurrent finite difference networks.",
            "Neural network based dynamic controllers for industrial robots.",
            "Use of multilayer feedforward neural nets as a display method for multidimensional distributions.",
            "Adaptive fuzzy control of unstable nonlinear systems.",
            "Training neural networks by means of genetic algorithms working on very long chromosomes.",
            "Recognition of telugu characters using neural networks.",
            "Human chromosome classification using multilayer perceptron neural network.",
            "Book Review: \"Memory in the cerebral Cortex: An Empirical Approach to Neural Network in the Human and Nonhuman Primate\", by Joaquin M. Fuster.",
            "Nonlinear gated experts for time series: discovering regimes and avoiding overfitting.",
            "Can deterministic penalty terms model the effects of synaptic weight noise on network fault-tolerance?",
            "Comparison of multilayer neural network and nearest neighbor classifiers for handwritten digit recognition.",
            "An application of hamiltonian neurodynamics using pontryagin's maximum (minimum) principle.",
            "Multilayer perceptrons to approximate complex valued functions.",
            "Remote sensing operations.",
            "A correlation significance learning scheme for auto-associative memories.",
            "Theoretical results for a class of neural networks.",
            "Book Review: \"Neural Network in Computer Intelligence\", by LiMin Fu."
        ]
    },
    {
        "name": "IJNS",
        "year": "1994",
        "info": "Volume 5: 1994",
        "count": 36,
        "papers": [
            "Rule Extraction with Fuzzy Neural Network.",
            "A Fuzzy Neural Network for Knowledge Learning.",
            "Classification of Impulse Radar Waveforms Using Neural Networks.",
            "A New Model of Neural Associative Memories.",
            "Learning Temporal Sequences from Examples in a Local Feedback Neural Network.",
            "A Constructive Algorithm that Converges for Real-Valued Input Patterns.",
            "Accelerated Learning by Active Example Selection.",
            "Model Reference Direct Adaptive Control of Nonlinear Plants Using Neural Networks.",
            "Gelfand-Tsetlin Principle of Minimal Afferentation and Bistability of Dendrites.",
            "Map Formation in Proprioceptive Cortex.",
            "On the Classification Capability of a Dynamic Threshold Neural Network.",
            "Average Case Analysis of an Hebb-Type Rule that Finds the Network Connectivity.",
            "Optimal Hebbian Learning Rules and the Role of Asymmetry.",
            "Incorporating Production Rules with Spatial Information Onto a Neocognitron Neural Network.",
            "Constrained Learning Vector Quantization.",
            "Letter to the Editor: A Storage Algorithm for Two-Layered Neural Networks.",
            "Book Review: \"Time Series Prediction: Forecasting the Future and Understanding the Past\", Eds. Andreas S. Weigend and Neil A. Gershenfeld.",
            "Classification Of Genetic Sequences With Backpropagation.",
            "Supervised Training of Dynamical Neural Networks for Associative Memory Design and Identification of Nonlinear Maps.",
            "Generation of Associative Processes in a Neural Network with Realistic Features of Architecture and Units.",
            "Neural Network for Control of Rearrangeable Clos Networks.",
            "Multi-Expert and Hybrid Connectionist Approach for Pattern Recognition: Speaker Identification Task.",
            "Storage Capacity Bounds in Multilayer Neural Networks.",
            "Constrained Potts Mean Field Systems and Their Electronic Implementation.",
            "Dynamical and Complexity Results for High Order Neural Networks.",
            "Letter to the Editor: Response Classification in Psychological Testing Using a Neural Network.",
            "Book Review: Handbook of Pattern Recognition & Computer Vision, Edited by C. H. Chen, L. F. Pau and P. S. P. Wang.",
            "Trio Learning: A New Strategy for Building Hybrid Neural Trees.",
            "Optimization Dynamics for Partitioned Neural Networks.",
            "Local Noise in Neural Networks Models with Self-Control.",
            "Relationship Between a Fuzzy Logic and a Steepest Descent Approach to Optimize a Feedforward Artificial Neural Network Configuration.",
            "Discriminative Nonlinear Dimensionality Reduction for Improved Classification.",
            "Predictive Control of Nonlinear Systems Based on Identification by Backpropagation Networks.",
            "A Hybrid Cognitive System Using Production Rules to Synthesize Neocognitrons.",
            "Handwritten Digit Recognition Using Two-Layer Self-Organizing Maps.",
            "Book Review: Neural Networks, a Comprehensive Foundation, by Simon Haykin."
        ]
    },
    {
        "name": "IJNS",
        "year": "1993",
        "info": "Volume 4: 1993",
        "count": 37,
        "papers": [
            "Response Properties Of A Population Of Neurons.",
            "Supervised Learning On Large Redundant Training Sets.",
            "A Gradient System Solution To Potts Mean Field Equations And Its Electronic Implementation.",
            "Thermodynamic Transitions In Networks For Letter Distinction.",
            "Magnocellular Pathway For Rotation Invariant Neocognitron.",
            "A Rule-Based Neural Controller For Inverted Pendulum System.",
            "Sharpening Of Input Excitation Curves In Lateral Inhibition.",
            "Digital Neural Networks For High-Speed Divisions And Root Extractions.",
            "A Neural Network Classifier In Experimental Particle Physics.",
            "A Biologically Motivated Associative Memory Architecture.",
            "Control Of The Complexity Of Associative Memory Dynamics By Neuronal Adaptation.",
            "Neural Net Pruning Based On Functional Behavior Of Neurons.",
            "A Quantitative Study Of Pruning By Optimal Brain Damage.",
            "Trans-Dimensional Learning.",
            "A Function Approximation Algorithm Using Sequential Composition.",
            "Errata: Supervised Learning On Large Redundant Training Sets.",
            "Evolutionary Artificial Neural Networks.",
            "Fast Learning Of Biased Patterns In Neural Networks.",
            "Weight Configurations Of Trained Perceptrons.",
            "The Clusnet Algorithm And Time Series Prediction.",
            "A Flexible And Fault Tolerant Query-Reply System Based On A Bayesian Neural Network.",
            "Neural Strategies To Handle Routing In Computer Networks.",
            "Dynamics Of Antagonistic Neural Processing Elements.",
            "BOOK REVIEW: \"Neural Networks for Optimization and Signal Processing\", A. Cichocki and R. Unbehauen.",
            "Recent Developments In Neurodynamics And Their Impact On The Design Of Neuro-Chips.",
            "Designing A Connectionist Network Supercomputer.",
            "An Architecture For Fully Integrated Large Scale Neural Networks.",
            "Multiprocessor And Memory Architecture Of The Neurocomputer Synapse-1.",
            "Neural Network Feature Detector For Real-Time Video Signal Processing.",
            "A Hardware Efficient Cascadable Chip Set For Ann'S With On-Chip Backpropagation.",
            "Analog Circuits For Relaxation Networks.",
            "Kakadu - A Low Power Analogue Neural Network Classifier.",
            "Pulse Stream Vlsi Circuits And Systems: The Epsilon Neural Network Chipset.",
            "Using Coherent Pulse Width And Edge Modulations In Artificial Neural Systems.",
            "On-Chip Learning With Analogue Vlsi Neural Networks.",
            "Analogue Synaptic Noise - Implications And Learning Improvements.",
            "Optoelectronic Implementation Of Neural Networks."
        ]
    },
    {
        "name": "IJNS",
        "year": "1992",
        "info": "Volume 3: 1992",
        "count": 68,
        "papers": [
            "Learning Constraints in Storage Capacity in Networks with Dynamic Synapses.",
            "Learning Attractor Neural Network: The Electronic Implementation.",
            "Practical Problems using Neural Networks.",
            "A Visual Model for Pattern Recognition.",
            "Information Processing by a Perceptron.",
            "Processing of Sensory Information by a Network of Oscillators with Memory.",
            "Collective Behavior of Feedback Networks with Distributed Dynamics.",
            "The Generalization of a Constructive Algorithm in Pattern Classification Problems.",
            "Memory Retrieval in Optimal Subspaces.",
            "Entropy Minimization: a Design Principle for Sensory Perception?",
            "Measuring Natural Neural Processing with Artificial Neural Networks.",
            "Dynamics of Coherence in Cortical Neural Activity: Experimental Observations and Functional Interpretations.",
            "Local Neocortical Processing: a Time for Recognition.",
            "The Use of Optical Flow for the Autonomous Navigation.",
            "Social Behavior of CNS Neurons.",
            "The Modelling of Chemical Modulation in Neural Networks.",
            "Can Neural Networks be Used As Models for Neuropsychological Dysfunctions?",
            "Cortical Cells Do NOT Perform Temporal Integration of Small EPSPs.",
            "Classification and Prediction of Protein Side-Chains by Neural Network Techniques.",
            "Machine Approaches to Protein Feature Prediction.",
            "On The Mean Field Theory of Random Heteropolymers.",
            "Proteins and Random Heteropolymers: an Overview.",
            "Exercising Multi-Layered Networks on Protein Secondary Structure.",
            "A Fast Method to Search for Protein Homologies Using Neural Networks.",
            "When is a Potential Function Accurate Enough for Protein Structure Prediction?",
            "Quark Flavor Sensitivity of The Mammalian Cortex.",
            "Neural Network Discrimination of Heavy Flavor Jets: a Survey.",
            "Neural Networks for Physics Analysis in Delphi.",
            "Tagging B and C Quark Events in e+e- Collisions with Neural Networks.",
            "Pattern Recognition: Invariants in 3d.",
            "A Second Level Neural Network Trigger in the H1 Experiment at Hera.",
            "Drift Chamber Tracking with a Vlsi Neural Network.",
            "Neural Nets for Kink Finding.",
            "A Study of Track Finding with a Neural Network Algorithm.",
            "Classification of The Decays of the Z0 into b and c Quark Pairs Using a Neural Network.",
            "Jet Classification at Cdf.",
            "Classifying Jet Cascades with a Muon Using a Neural Network.",
            "Electron and Pion Identification by Neural Networks and Standard Methods.",
            "Selective Attention to Perceptual Groups: the Phase Tracking Mechanism.",
            "Structural Connectionist Learning with Complementary Coding.",
            "Training Recurrent Nets of Hardware Realisable Sigma-PI Units.",
            "A Connectionist Approach to Vertex Covering Problems.",
            "Wis-Art: Unsupervised Clustering with RAM Discriminators.",
            "Principles of the Design of D-Neuronal Networks I: Net Representation for Computer Simulation of a Melody Compositional Process.",
            "Principles of The Design of D-Neuronal Networks II: Composing Simple Melodies.",
            "Training Recurrent Neural Networks - The Minimal Trajectory Algorithm.",
            "Analog Cmos Neural Circuits - In Situ Learning.",
            "Routing in Random Multistage Interconnections Networks: Comparing Exhaustive Search, Greedy and Neural Network Approaches.",
            "Exact Classification with Two-Layered Perceptrons.",
            "Examining the Chir Algorithm Performance for Multilayer Networks and Continuous Input Vectors.",
            "Learning the Rule of a Time Series.",
            "A Macroscopic Model of Neural Ensembles: Learning-Induced Oscillations in a Cell Assembly.",
            "Neural Network Analysis of Thermal Image Data.",
            "A Neural Network Implementation for the Traffic Control Problem on Crossbar Switch Networks.",
            "Spoken Letter Recognition with Neural Networks.",
            "Different Retinal Ganglion Cells have Different Functional Goals.",
            "A Neural Net With Self-Inhibiting Units For The N-Queens Problem.",
            "Recent Advances on Techniques of Static Feedforward Networks with Supervised Learning.",
            "A Measure of Relative Robustness for Feedforward Neural Networks Subject to Small Input Perturbations.",
            "A Node Pruning Algorithm for Backpropagation Networks.",
            "Pattern Storage and Hopfield Neural Associative Memory with Hidden Structure.",
            "Efficient Higher-Order Neural Networks for Classification and Function Approximation.",
            "The Thermodynamics of Dyslexic Learning.",
            "Building a Robust Nearest Neighbor Classifier Containing Only a Small Number of rototypes.",
            "Dynamic Properties of A Biologically Motivated Neural Network Model.",
            "Neural Network with Local Short Memory and Complex Updating.",
            "Retrieval in Interacting Neural Networks.",
            "A Single-Layer Neural Network for Parallel Thinning."
        ]
    },
    {
        "name": "IJNS",
        "year": "1991",
        "info": "Volume 2: 1991",
        "count": 33,
        "papers": [
            "Modeling the Dynamics of Olfactory Cortex Using Simplified Network Units and Realistic Architecture.",
            "Unsupervised Learning Procedures for Neural Networks.",
            "Constrained Hebbian Learning: Gradient Descent to Global Minima in an N-Dimensional Landscape.",
            "Neural Network Capacity for Temporal Sequence Storage.",
            "Speech Recognition by a Self-Organizing Feature Finder.",
            "Modeling Head end Escape Behavior in the Earthworm: the Efferent Arc and the End Organ.",
            "Application of Learning Theory to an Artificial Neural Network that Detects Incipient Faults in Single-Phase Induction Motors.",
            "Some IC Implementations of Artificial Neural Networks Using Synchronous Pulse-Density Modulation Technique.",
            "Generalization Error and Dynamical Effects in a Two-Dimensional Patches Detector.",
            "Learning to Generate Artificial Fovea Trajectories for Target Detection.",
            "A Backpropagation Algorithm for a Network of Neurons with Threshold Controlled Synapses.",
            "Stability of Multilayered Neural Networks.",
            "A Fast Neural Algorithm for Principal Component Analysis and Singular Value Decomposition.",
            "Book Review: \"Introduction to the Theory of Neural Computation\", John Hertz, Anders Krogh, and Richard G. Palmer.",
            "Sources of Neural Structure in Speech and Language Processing.",
            "Neural Nets for Dual Subspace Pattern Recognition Method.",
            "The Design and Complexity of Exact Multilayered Perceptrons.",
            "A Goal Programming Network for Mixed Integer Linear Programming: a CaseStudy for the Job-Shop Scheduling Problem.",
            "A Three-Layer Adaptive Network for Pattern Density Estimation and Classification.",
            "Use of Neural Nets to Measure The? Polarization and its Bayesian Interpretation.",
            "A Fast Procedure for Retraining the Multilayer Perceptron.",
            "Population Oscillations in Neuronal Groups.",
            "Combining Similarities and Dissimilarities in Supervised Learning.",
            "3-D Object Classification: Application of a Constructive Algorithm.",
            "On Deriving Deterministic Learning Rules from Stochastic Systems.",
            "Backpropagation Learning for Multilayer Feed-Forward Neural Networks Using the Conjugate Gradient Method.",
            "Some Notes on Competition Among Cell Assemblies.",
            "Asymptotic Properties of a Third Order Neural Network.",
            "Discrete Learning in Feed-Forward Neural Networks.",
            "Improved Neural Networks For Linear and Nonlinear Programming.",
            "Recognition of Rules and Exceptions by Neural Networks.",
            "Multiple Representations in Connectionist Systems.",
            "Book Review: \"Evolution of the First Nervous Systems\", Peter A. V. Anderson (ed.)."
        ]
    },
    {
        "name": "IJNS",
        "year": "1989",
        "info": "Volume 1: 1989-1991",
        "count": 36,
        "papers": [
            "Editorial.",
            "A New Method for Mapping Optimization Problems Onto Neural Networks.",
            "Dynamics of Compensatory Eye Movement Control: an Optimal Estimation Analysis of the Vestibulo-Ocular Reflex.",
            "Learning Learning Sets in Neural Networks.",
            "The Collective Brain.",
            "A Neural Network Model to Simulate a Conditioning Experiment.",
            "Study of a Growth Algorithm for a Feedforward Network.",
            "Neural Networks, Principal Components, and Subspaces.",
            "The Organization of Metastable States in A Neural Network with Hierarchichal Patterns.",
            "A One-Layer Feedback Artificial Neural Network with a Bayesian Learning Rule.",
            "Nerve Cells as Source of Time Scale and Processing Density in Brain Function.",
            "On Computational Vision: a Neural Processing Approach.",
            "Oscillations and Synchronizations in Neural Networks: an Exploration of the Labeling Hypothesis.",
            "Learning Sequential Structure with the Real-Time Recurrent Learning Algorithm.",
            "A Recurrent Neural Network Using Tri-State Hidden Neurons to Orthogonalize the Memory Space.",
            "Rats Kept in Social Isolation for Twelve Months from Weaning: Performance in Maze Learning and Visual Discrimination Tests, and Brain Composition.",
            "Vlsi Devices and Circuits for Neural Networks.",
            "\"Teachers and Classes\" with Neural Networks.",
            "Unsupervised Competitive Learning in Neural Networks.",
            "Motion Detection and Direction Detection in Local Neural Nets.",
            "Predicting the Future: a Connectionist Approach.",
            "An Artificial Neural Network Algorithm for Dynamic Programming.",
            "Design of Competition-Based Neural Networks for Combinatorial Optimization.",
            "Dyslexic Behaviour of Feedforward Neural Networks.",
            "Parity and the Shapes of Neuron Transfer Functions in Feedforward Neural Networks.",
            "Excitatory-Inhibitory Networks with Dynamical Thresholds.",
            "A Holographic Model of Memory, Learning and Expression.",
            "Adding Learned Expectation Into the Learning Procedure of Self-Organizing Maps.",
            "Book Review: \"Artificial Neural Systems: Foundations, Paradigms, Applications, and Implementations\", Patrick K. Simpson.",
            "Bistability of Dendrites.",
            "Predicting Ganglion and Simple Cell Receptive Field Organizations.",
            "Improving Generalization of Neural Networks Through Pruning.",
            "Chaotic Behavior of A Neural Network with Dynamical Thresholds.",
            "Learning with Delayed Reinforcement Through Attention-Driven Buffering.",
            "Mixture States and Storage with Correlated Patterns in Hopfield'S Model.",
            "An All-Optical Hopfield Network: Theory and Experiment."
        ]
    }
]