[
    {
        "name": "IJUFKS",
        "year": "2021",
        "info": "Volume 29, 2021",
        "count": 38,
        "papers": [
            "An Information Dissemination Influence Model for Mobile Social Network under Multi-Role View.",
            "Monthly River Discharge Prediction by Wavelet Fuzzy Time Series Method.",
            "Ridge Estimation for Uncertain Autoregressive Model with Imprecise Observations.",
            "On the Connectedness of Random Sets of ℝ.",
            "Fuzzy Type-II Resource Allocation and Target Setting in Data Envelopment Analysis: A Real Case of Gas Refineries.",
            "On Some Construction Method and Orness Measure of Bi-Capacities.",
            "The α, β-Cut Intervals and Weakest t-Norm Based Importance Measure for Criticality Analysis in Intuitionisitic Fuzzy Fault Tree Analysis of LNG-ESD System.",
            "Intuitionistic Fuzzy Calculus Based on Einstein Operations.",
            "Probabilistic Risk Analysis of Process Systems Considering Epistemic and Aleatory Uncertainties: A Comparison Study.",
            "Fuzzy-Based Multi-Objective Design Optimization of Buried Pipelines.",
            "Fuzzy Constrained Shortest Path Problem for Location-Based Online Services.",
            "An Adaptive Location-Aware Swarm Intelligence Optimization Algorithm.",
            "Distributed Decision Making with S-approximation Spaces.",
            "Robust Hybrid Interval-Probabilistic Approach for the Kidnapped Robot Problem.",
            "Foreword: Special Issue on Advances in Evolutionary Computation for Image Processing.",
            "Detection of Brain Tumor in MRI Images Using Optimized ANFIS Classifier.",
            "Multi-Modality Non-rigid Image Registration Using Local Similarity Estimations.",
            "Regression Model-based Feature Filtering for Improving Hemorrhage Detection Accuracy in Diabetic Retinopathy Treatment.",
            "A Color Image Encryption Algorithm with Cat Map and Chaos Map Embedded.",
            "The Research and Application of System for Paper Surface Morphology Stereoscopic Observation and Characterization.",
            "Improving the Efficiency of Image and Video Forgery Detection Using Hybrid Convolutional Neural Networks.",
            "Design of Lighting Intelligent Control System Based on OpenCV Image Processing Technology.",
            "Vision Based Segmentation and Classification of Cracks Using Deep Neural Networks.",
            "Design and Implementation of Attitude and Heading Reference System with Extended Kalman Filter Based on MEMS Multi-Sensor Fusion.",
            "Behaviour of Expanded Flyash Clay Aggregate Concrete Exposed to Elevated Temperature.",
            "Applications of Statistical Convergence in Complex Uncertain Sequences via Deferred Riesz Mean.",
            "Some Methods Considering Multiplicative Consistency and Consensus in Group Decision Making with Interval-Valued Intuitionistic Fuzzy Preference Relations.",
            "Fuzzy Data Envelopment Analysis with Ordinal and Interval Data.",
            "Solving Bi-Level Multi-Objective Transportation Problem under Fuzziness.",
            "Detecting Intra-Conflicts in Non-Functional Requirements.",
            "A Combined Clustering Algorithm Based on ESynC Algorithm and a Merging Judgement Process of Micro-Clusters.",
            "On Statistical Deferred A-Convergence of Uncertain Sequences.",
            "Resampling in Fuzzy Regression via Jackknife-after-Bootstrap (JB).",
            "Inference and Decision in Credal Occupancy Grids: Use Case on Trajectory Planning.",
            "A Two-Dimensional Simulation Approach for Ranking Fuzzy Numbers by the Monte Carlo Technique.",
            "Some Methods for Yager Preference Involved Aggregations in Multi-Criteria and Multi-Sources Evaluation.",
            "Prioritized Induced Heavy Operators Applied to Political Modelling.",
            "Clustering Techniques to Improve Scalability and Accuracy of Recommender Systems."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2020",
        "info": "Volume 28, 2020",
        "count": 64,
        "papers": [
            "Malicious User Nodes Detection by Web Mining Based Artificial Intelligence Technique.",
            "A New Efficient Algorithm Based on Multi-Classifiers Model for Classification.",
            "Semantic Provenance Based Trustworthy Users Classification on Book-Based Social Network using Fuzzy Decision Tree.",
            "Decentralized Incremental Fuzzy Reinforcement Learning for Multi-Agent Systems.",
            "Modeling Opinion Formation in Social Networks: A Probabilistic Fuzzy Approach.",
            "Double Frontier Two-Stage Fuzzy Data Envelopment Analysis.",
            "Deep Learning of Empirical Mean Curve Decomposition-Wavelet Decomposed EEG Signal for Emotion Recognition.",
            "Estimating and Controlling Overlap in Gaussian Mixtures for Clustering Methods Evaluation.",
            "Improving Classification Accuracy Using Hybrid of Extreme Learning Machine and Artificial Algae Algorithm with Multi-Light Source.",
            "Kappa Regression: An Alternative to Logistic Regression.",
            "Fuzzy Regression Model Based on Geometric Centroid and Incentre Points and Application to Performance Evaluation.",
            "Performance Efficiency of Public Health Sector Using Intuitionistic Fuzzy DEA.",
            "Fuzzy Binary Rough Set.",
            "Uncertainty Measurement for a Tolerance Knowledge Base.",
            "A Hybrid Multilingual Fuzzy-Based Approach to the Sentiment Analysis Problem Using SentiWordNet.",
            "Self-Adaptive Optimization for Improved Data Sanitization and Restoration.",
            "A Lexicographic Approach to Fuzzy Linear Assignment Problems with Different Types of Fuzzy Numbers.",
            "Hyperintensional Reasoning Based on Natural Language Knowledge Base.",
            "Numerical Linear Programming under Non-Probabilistic Uncertainty Models - Interval and Fuzzy Sets.",
            "A New Fine-Kinney Method Based on Clustering Approach.",
            "On the Structure of the Classes of Copulas and Quasi-Copulas with a Given Diagonal Section.",
            "Intuitionistic Fuzzy Partial Logistic Regression Model Using Ridge Methodology.",
            "Project Time-Cost-Quality Trade-off Problem: A Novel Approach Based on Fuzzy Decision Making.",
            "A Weighted-Logic Representation of C-Revising Ordinal Conditional Functions.",
            "A New Method for Ranking Interval Type-2 Fuzzy Numbers Based on Mellin Transform.",
            "Covering Problem for Solutions of Max-Archimedean Bipolar Fuzzy Relation Equations.",
            "Vectorized Kernel-Based Fuzzy C-Means: a Method to Apply KFCM on Crisp and Non-Crisp Numbers.",
            "On the Use of m-Probability-Estimation and Imprecise Probabilities in the Naïve Bayes Classifier.",
            "Multi-Level Fine-Scaled Sentiment Sensing with Ambivalence Handling.",
            "Uncertainty Analysis in Economics and Finance: Preface to the Special Issue.",
            "Why Black-Scholes Equations Are Effective Beyond Their Usual Assumptions: Symmetry-Based Explanation.",
            "Uncertainty in Information Market Games.",
            "Beyond Deep Learning: An Econometric Example.",
            "How to Take Both Non-Linearity and Asymmetry (Skewness) into Account in Binary Decision Making: Skew-Probit and Skew-Logit in Binary Kink Regression.",
            "Comparing Medical Care Costs using Bayesian Credible Intervals for the Ratio of Means of Delta-Lognormal Distributions.",
            "Ruin Probabilities of Continuous-Time Risk Model with Dependent Claim Sizes and Interarrival Times.",
            "Why the Use of Convex Combinations Works Well for Interval Data: A Theoretical Explanation.",
            "On Statistics of Random Sets for Partial Identification of Econometric Structures.",
            "The Black-Litterman Model for Portfolio Optimization on Vietnam Stock Market.",
            "A Mixed Copula-Based Vector Autoregressive Model for Econometric Analysis.",
            "Robust Fuzzy Clustering Algorithms for Change-Point Regression Models.",
            "A General Cipher for Individual Data Anonymization.",
            "Uncertainty-Aware Dissimilarity Measures for Interval-Valued Fuzzy Sets.",
            "Cross-Validation for the Uncertain Chapman-Richards Growth Model with Imprecise Observations.",
            "MPE Computation in Bayesian Networks Using Mini-Bucket and Probability Trees Approximation.",
            "On Generating of t-Norms and t-Conorms on Bounded Lattices.",
            "Modal Interval Probability: Application to Bonus-Malus Systems.",
            "Distance-Based Consistency Measure and Priority Weights of Best-Worst Multi-Criteria Decision Making Method.",
            "Novel Fuzzy Multi-Attribute Decision Making Method for the Selection of Open Unit Trusts Under Uncertainty.",
            "Multi-Criteria Decision Making Analysis Based on Target-Oriented OWA Operator.",
            "Uncertain Autoregressive Model via LASSO Procedure.",
            "Mining Fuzzy Common Sequential Rules with Fuzzy Time-Interval in Quantitative Sequence Databases.",
            "A Content-Based Approach to Profile Expansion.",
            "On the Core, Bargaining Set and the Set of Competitive Allocations of Fuzzy Exchange Economy with a Continuum of Agents.",
            "FML-Based Reinforcement Learning Agent with Fuzzy Ontology for Human-Robot Cooperative Edutainment.",
            "Foreword: Special Issue on Cognitive Machine Intelligence for Cyber Physical Systems.",
            "JGraphs: A Toolset to Work with Monte-Carlo Tree Search-Based Algorithms.",
            "A New Mail System for Secure Data Transmission in Cyber Physical Systems.",
            "Voltage Regulation using Probabilistic and Fuzzy Controlled Dynamic Voltage Restorer for Oil and Gas Industry.",
            "A Review on Intrusion Detection Systems and Techniques.",
            "Adaptive Decentralized Tracking Control for Nonlinear Large-Scale Systems.",
            "The Optimization of the Dynamic Mechanism of Jilin's Economic Revitalization from the Perspective of Viterbi Algorithm's Supply-Side Structural Reform.",
            "Pattern Mining Approaches Used in Social Media Data.",
            "Research on the Evaluation of the Dissemination Ability of Sci-Tech Periodicals Based on Hesitant Fuzzy Linguistic."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2019",
        "info": "Volume 27, 2019",
        "count": 59,
        "papers": [
            "Peer-to-Peer Lending Platform Selection Using Intuitionistic Fuzzy Soft Set and D-S Theory of Evidence.",
            "A Fuzzy-Based Approach for Identifying Candidate Business Processes for Socialization.",
            "Adaptive Fuzzy Logic Controllers Using Hybrid Genetic Algorithms.",
            "Finding Similar Documents Using Frequent Pattern Mining Methods.",
            "Consensus Function Based on Clusters Clustering and Iterative Fusion of Base Clusters.",
            "A Betting- and Lottery-Based Method for Fuzzy Probability Elicitation.",
            "Jensen-Tsalli's Intuitionistic Fuzzy Divergence Measure and Its Applications in Medical Analysis and Pattern Recognition.",
            "Acknowledgements to the Referees (2018).",
            "k-DDD Measure and MapReduce Based Anonymity Model for Secured Privacy-Preserving Big Data Publishing.",
            "Particle Grey Wolf Optimizer (PGWO) Algorithm and Semantic Word Processing for Automatic Text Clustering.",
            "Support Set Invariancy for Interval Bimatrix Games.",
            "Pareto Optimality on Compact Spaces in a Preference-Based Setting under Incompleteness.",
            "A New Type 2 Fuzzy Time Series Forecasting Model Based on Three-Factors Fuzzy Logical Relationships.",
            "An Approach for Interesting Subgraph Mining from Web Log Data Using W-Gaston Algorithm.",
            "On Migrative 2-Uninorms and Nullnorms.",
            "The Distributivity Equations of Semi-Uninorms.",
            "Interval Methods in Knowledge Representation.",
            "Intuitionistic Fuzzy Hybrid Weighted Arithmetic Mean and Its Application in Decision Making.",
            "Migrative Property for Semi-t-Operators.",
            "Optimal Control of a Multifactor Uncertain System.",
            "Certainty Equivalent under Cumulative Prospect Theory.",
            "Paraconsistent Reasoning in Cops and Robber Game with Uncertain Information: A Simulation-Based Analysis.",
            "A Spatial Filtering Model in Recommender Systems using Fuzzy Approach.",
            "Fuzzy-Logic-Based Asset Allocation.",
            "Interval Methods in Knowledge Representation.",
            "Synchronization Adaptive Fuzzy Gain Scheduling PID Controller for a Class of MIMO Nonlinear Systems.",
            "Variable Substitution Method for Solving Single-Variable Term Fuzzy Relation Geometric Programming Problem and Its Application.",
            "A Fuzzy Goal Programming Approach for Solving Multi-Objective Supply Chain Network Problems with Pareto-Distributed Random Variables.",
            "On the Compatibility of a Ternary Relation with a Binary Fuzzy Relation.",
            "Uncertain Stochastic Option Pricing in the Presence of Uncertain Jumps.",
            "Collaborative Recommendations using Hierarchical Clustering based on K-d Trees and Quadtrees.",
            "EKEGWO: Enhanced Kernel-Based Exponential Grey Wolf Optimizer for Bi-Objective Data Clustering.",
            "Short Note: A Correction in \"Partial Representations of Orderings\".",
            "Interval Methods in Knowledge Representation.",
            "A Hybrid PSO-GA Algorithm for Traveling Salesman Problems in Different Environments.",
            "A Multiobjective Multi-Product Solid Transportation Model with Rough Fuzzy Coefficients.",
            "A New Approach to Realizing the Soft-and Operation in Cloud Model-Based Control.",
            "On Scatters of Probability Distributions and OWA Weights Collections.",
            "Core for Game with Fuzzy Generalized Triangular Payoff Value.",
            "Fuzzy Spatio-Spectro-Temporal Ontology for Remote Sensing Image Annotation and Interpretation: Application to Natural Risks Assessment.",
            "Fuzzy Network Based Framework for Software Maintainability Prediction.",
            "Problem-Oriented Automatic Summarization Method with Semantic Coherence Definition and Usage of Inclusion Measures for the Search of Answers to Questions in the Internet.",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "Stabilization Control with Optimal L1-Gain and L∞-Gain for Positive T-S Fuzzy Systems.",
            "An Extended TODIM Method Based on Novel Score Function and Accuracy Function under Intuitionistic Fuzzy Environment.",
            "An Efficient Uncertainty Measure-based Attribute Reduction Approach for Interval-valued Data with Missing Values.",
            "A Novel Weakest t-Norm based Fuzzy Importance Measure for Fuzzy Fault Tree Analysis of Combustion Engineering Reactor Protection System.",
            "A Novel Algorithm for Group Decision Making Based on Continuous Optimal Aggregation Operator and Shapley Value.",
            "Method to Design Pattern Classification Model with Block Missing Training Data.",
            "Kernel Optimized-Support Vector Machine and MapReduce Framework for Sentiment Classification of Train Reviews.",
            "Foreword: Tools for Decision Making under Vagueness.",
            "Commuting Double Sugeno Integrals.",
            "Additive Aggregation Functions: Generalizations and Modifications of Additivity.",
            "A Hierarchically ⊥-Decomposable Fuzzy Measure-Based Approach for Fuzzy Rules Aggregation.",
            "Aggregation of Dependent Risks with Heavy-Tail Distributions.",
            "Truth-Preservation under Fuzzy pp-Formulas.",
            "Obtaining Discriminative Colour Names According to the Context: Using a Fuzzy Colour Model and Probabilistic Reference Grounding.",
            "Self-Tuning Possibilistic c-Means Clustering Models."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2018",
        "info": "Volume 26, 2018",
        "count": 67,
        "papers": [
            "On the Use of Linear Combination in PWCP-Nets.",
            "A Proof of Donsker's Invariance Principle Based on Support Functions of Fuzzy Random Vectors.",
            "Acquiring and Sharing Tacit Knowledge Based on Interval 2-Tuple Linguistic Assessments and Extended Fuzzy Petri Nets.",
            "A Linear Programming Method Based on an Improved Score Function for Interval-Valued Pythagorean Fuzzy Numbers and Its Application to Decision-Making.",
            "Proving Sklar's Theorem Via Zorn's Lemma.",
            "A Bayesian Network-Based Approach for Incremental Learning of Uncertain Knowledge.",
            "Adaptive Fuzzy Tracking Control for Stochastic Nonlinear Systems with Time-Varying Input Delays Using the Quadratic Functions.",
            "A Binomial Tree Approach to Pricing Vulnerable Option in a Vague World.",
            "Interval Methods in Knowledge Representation.",
            "A Bibliometric Analysis of the First Twenty-Five Years of the International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems.",
            "An Extension of Fuzzy Linguistic Summarization Considering Probabilistic Uncertainty.",
            "Extensionality with Respect to Indistinguishability Operators.",
            "Group Decision Model Based on Ordered Weighted Distance to Aid Decisions on Logistics.",
            "On Choquet-Pettis Expectation of Banach-Valued Functions: A Counter Example.",
            "An Alternative Approach to Obtaining an Analytical Solution to Dujmovic's Iterative OWA.",
            "A Model of Trust Based on Uncertainty Theory.",
            "Age Sequence Recursive Models for Long Time Evaluation Problems.",
            "Dynamic Network Interdiction Problem with Uncertain Data.",
            "Interval Methods in Knowledge Representation.",
            "A Review of Uncertainty Handling Techniques in Smart Grid.",
            "FSIM: A Fast and Scalable Influence Maximization Algorithm Based on Community Detection.",
            "A Two-Stage Fuzzy Approach on the Socio-Economic Drivers of Global Energy Efficiency.",
            "Definition of Strategies for Crime Prevention and Combat Using Fuzzy Clustering and Formal Concept Analysis.",
            "Partial Representations of Orderings.",
            "The Influence of Defuzzification Methods to Decision Support Systems Based on Fuzzy AHP with Scattered Comparison Matrix: Application to 3PLP Selection as a Case Study.",
            "A Novel Approach Based on Intuitionistic Fuzzy Combined Ordered Weighted Averaging Operator for Group Decision Making.",
            "Interval Methods in Knowledge Representation.",
            "Positive Region Reduct Based on Relative Discernibility and Acceleration Strategy.",
            "Text Mining: Techniques, Applications, and Challenges.",
            "DEDSC: A Domain Expert Discovery Method Based on Structure and Content.",
            "The Novel Computational Model of Unbalanced Linguistic Variables Based on Archimedean Copula.",
            "Some Interval-Valued Intuitionistic Fuzzy Zhenyuan Aggregation Operators and Their Application to Multi-Attribute Decision Making.",
            "About the Orders Induced by Implications Satisfying the Law of Importation.",
            "A Stock Model with Varying Stock Diffusion for Uncertain Market.",
            "Interval Methods in Knowledge Representation.",
            "An Efficient Feature Selection and Classification Using Optimal Radial Basis Function Neural Network.",
            "Improved Adaptive Particle Swarm Optimization for Optimization Functions and Clustering Fuzzy Modeling System.",
            "A Novel Model for Mining Frequent Patterns Based on Embedded Granular Computing.",
            "A Stock Market Prediction System Based on High-Level Fuzzy Petri Nets.",
            "On-Line Fault-Tolerant Fuzzy-Based Path Planning and Obstacles Avoidance Approach for Manipulator Robots.",
            "Ensemble Classification for Skewed Data Streams Based on Neural Network.",
            "Non-Probabilistic Inverse Fuzzy Model in Time Series Forecasting.",
            "Interval Methods in Knowledge Representation.",
            "Parameter Prediction Based on Type-2 Fuzzy Clustering.",
            "A Generalized Multivariate Approach for Possibilistic Fuzzy C-Means Clustering.",
            "Shapley and Banzhaf Values as Probability Transformations.",
            "A Hybridization Approach for Optimal Feature Subset Selection in High Dimensional Data.",
            "Multi-Objective Fixed-Charge Transportation Problem with Random Rough Variables.",
            "An Effective Solution Approach Based on Extension Principle for Fuzzy Minimal Cost Flow Problem.",
            "Extreme Points of the Core of Possibility Measures and Maxitive p-Boxes.",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "Fuzzy Systems in Business Valuation.",
            "Prediction of Business Failure with Fuzzy Models.",
            "Fuzzy Credit Risk Scoring Rules using FRvarPSO.",
            "Analysis of Fuzzy Beta Coefficients. Evidence from the Mexican Stock Market.",
            "Analysis of Long-Term Memory in the Mexican Exchange Market Using a Fuzzy Hurst Exponent: Does Intervention Matter?",
            "A Three Particles Algorithm for Solving Some Very High Dimensional Benchmark Unconstrained Optimization Problems Using a Fuzzy Fitness Criterium.",
            "A Generalization of the Theory of Expertons.",
            "Comfort Decision Modeling.",
            "Foreword.",
            "Uncertainty Handling in Bilevel Optimization for Robust and Reliable Solutions.",
            "Dealing with Inliers in Feature Vector Data.",
            "Analysis of Incremental Cluster Validity for Big Data Applications.",
            "On the Fusion of Multiple Measure Based Belief Structures.",
            "Distinguishing Vagueness from Ambiguity in Rough Set Approximations.",
            "Computing with Words: Revisiting the Qualitative Scale."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2017",
        "info": "Volume 25, 2017",
        "count": 69,
        "papers": [
            "Intelligent Controller Based Wide-Area Control in Power System.",
            "Enhancing Quality of Learning Experience Through Intelligent Agent in E-Learning.",
            "Clustering of Micro-Messages Using Similarity Upper Approximation.",
            "Exploiting NoSQL Graph Databases and in Memory Architectures for Extracting Graph Structural Data Summaries.",
            "Mining Frequent Weighted Itemsets without Storing Transaction IDs and Generating Candidates.",
            "PERSA: A Requirements Specification Process for Self-Adaptive Systems Based on Fuzzy Logic and NFR-Framework.",
            "Interval Methods in Knowledge Representation.",
            "Probabilistic Interval Reference Ordering Sets in Multi-Criteria Group Decision Making.",
            "Backstepping-Based Recurrent Type-2 Fuzzy Sliding Mode Control for MIMO Systems (MEMS Triaxial Gyroscope Case Study).",
            "The Hybrid Filter Feature Selection Methods for Improving High-Dimensional Text Categorization.",
            "BSFS: Design and Development of Exponential Brain Storm Fuzzy System for Data Classification.",
            "Supervised Ensemble Learning for Vietnamese Tokenization.",
            "An Extension of Semiuninorms: Weak-Neutral Semiuninorms.",
            "Distributivity for 2-Uninorms Over Semi-Uninorms.",
            "Interval Methods in Knowledge Representation.",
            "Thinning a Triangulation of a Bayesian Network or Undirected Graph to Create a Minimal Triangulation.",
            "Clustering Algorithm for Intuitionistic Fuzzy Graphs.",
            "Rough Set Theory and Fuzzy Logic Based Warehousing of Heterogeneous Clinical Databases.",
            "A Dynamic Fuzzy Temporal Clustering for Imprecise Location Streams.",
            "Finding the Shortest Path in Stochastic Graphs Using Learning Automata and Adaptive Stochastic Petri Nets.",
            "On Simplified Axiomatic Characterizations of (υ σ)-Fuzzy Rough Approximation Operators.",
            "Design of Analog Fuzzy Controller for Autonomous Mobile Robot.",
            "Interval Methods in Knowledge Representation.",
            "Entropy of Uncertain Random Variables wi h Application to Minimum Spanning Tree Problem.",
            "Monotonic Similarity Measures of Interval-Valued Fuzzy Sets and Their Applications.",
            "Uncertainty Distribution of Some Composite Uncertain Variables.",
            "Comonotonic Random Sets and Its Additivity of Choquet Integrals.",
            "Modeling Dual-Channel Supply Chain Based on Fuzzy System and Genetic Algorithm.",
            "Fuzzy Linguistic Summarization with Genetic Algorithm: An Application with Operational and Financial Healthcare Data.",
            "Probabilistic Model Based Hybrid Classifier for Character Recognition.",
            "Fuzzy Similarity Measure Based Spectral Clustering Framework for Noisy Image Segmentation.",
            "Interval Methods in Knowledge Representation.",
            "FML-based Dynamic Assessment Agent for Human-Machine Cooperative System on Game of Go.",
            "Long Time Prediction of Uncertain Systems Using Singular Perturbation.",
            "On the Generalization Performance of a Regression Model with Imprecise Elements.",
            "A Preference Index for Ranking Closed Intervals and Fuzzy Numbers.",
            "Several Generalized Interval-Valued 2-Tuple Linguistic Interval Distance Measures and Their Application.",
            "Correlation in Interval-Valued Atanassov's Intuitionistic Fuzzy Sets - Conjugate and Negation Operators.",
            "A Method for Multi-Attribute Group Decision Making Based on Generalized Interval-Valued Intuitionistic Fuzzy Choquet Integral Operators.",
            "Interval Methods in Knowledge Representation.",
            "Intermodal Transport Terminal Location Selection Using a Novel Hybrid MCDM Model.",
            "Certain Algorithms for Computing Strength of Competition in Bipolar Fuzzy Graphs.",
            "Data Envelopment Analysis with Common Weights in a Fuzzy Environment.",
            "On Certain Transit Functions in Fuzzy Graphs.",
            "Fuzzy Implications Generated by h-Generators.",
            "A Robust Credal Assignment Solution Based on the Generalized Bayes' Theorem.",
            "Point-Sensitive Aggregation Operators: Functional Equations and Applications to Social Choice.",
            "A Fuzzy Indiscernibility Based Measure of Distance between Semantic Spaces Towards Automatic Evaluation of Free Text Answers.",
            "A Novel Decision Support Framework for Computing Expected Utilities from Linguistic Evaluations.",
            "Interval Methods in Knowledge Representation.",
            "Fuzzy Mathematical Models for Computer Science and Decision Making.",
            "Some Characterizations of Lattice OWA Operators.",
            "Binary Relations Coming from Solutions of Functional Equations: Orderings and Fuzzy Subsets.",
            "N-Reciprocity Property for Interval-Valued Fuzzy Relations with an Application to Group Decision Making Problems in Social Networks.",
            "Linking Mathematical Morphology and L-Fuzzy Concepts.",
            "Fuzzy Concept Lattices and Fuzzy Relation Equations in the Retrieval Processing of Images and Signals.",
            "Identification of Agricultural Management Zones Through Clustering Algorithms with Thermal and Multispectral Satellite Imagery.",
            "Multicriteria Design of Cost-Conscious Fuzzy Rule-Based Classifiers.",
            "New Trends in Information Access.",
            "Competitive Author Profiling Using Compression-Based Strategies.",
            "Committee-Based Profiles for Politician Finding.",
            "Towards an Ontological Model for Technological Systems Structure Representation.",
            "Addressing the Cold Start with Positive-Only Feedback Through Semantic-Based Recommendations.",
            "Are you Curious? Predicting the Human Curiosity from Facebook.",
            "Advancing Network Flow Information Using Collaborative Filtering.",
            "Axiomatic Analysis of Language Modelling of Recommender Systems.",
            "Psychological Features for Automatic Text Summarization.",
            "Detecting Deceptive Opinions: Intra and Cross-Domain Classification Using an Efficient Representation.",
            "Short Messages Spam Filtering Combining Personality Recognition and Sentiment Analysis."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2016",
        "info": "Volume 24, 2016",
        "count": 67,
        "papers": [
            "Additive Intuitionistic Fuzzy Aggregation Operators Based on Fuzzy Measure.",
            "Scaled Prioritized Geometric Aggregation Operators and Their Applications to Decision Making.",
            "Berwald and Favard Type Inequalities for Fuzzy Integrals.",
            "Using Binary Trees for the Evaluation of Influence Diagrams.",
            "A Set Covering-Based Diagnostic Expert System to Economic and Financial Applications.",
            "Analysis of Response Surface Model Parameters with Bayesian Approach and Fuzzy Approach.",
            "Artificial Bee Colony-Fuzzy Q Learning for Reinforcement Fuzzy Control (Truck Backer-Upper Control Problem).",
            "Observer Based Adaptive Fuzzy Controller with Modulated Membership Functions for Nonlinear System.",
            "Interval Methods in Knowledge Representation.",
            "Cost-Sensitive Action Model Learning.",
            "A Mean-Variance Analysis Based Approach for Search Result Diversification in Federated Search.",
            "A Comparative Investigation of Type-2 Fuzzy Sets, Nonstationary Fuzzy Sets and Cloud Models.",
            "Bivariate p-boxes.",
            "Prioritized Information Fusion Method for Triangular Fuzzy Information and Its Application to Multiple Attribute Decision Making.",
            "Accurate Semantic Similarity Measurement of Biomedical Nomenclature by Means of Fuzzy Logic.",
            "Robust Control Design of Uncertain Mechanical Systems: A Fuzzy Approach.",
            "Interval Methods in Knowledge Representation.",
            "Improvements for P-ELM1 and P-ELM2 Pruning Algorithms in Extreme Learning Machines.",
            "The Incremental Knowledge Acquisition Based on Hash Algorithm.",
            "An Efficient Approach for Incremental Mining Fuzzy Frequent Itemsets with FP-Tree.",
            "Fubini-Like Theorem of Real-Valued Choquet Integrals for Set-Valued Mappings.",
            "Eliciting Subjective Probabilities in Anscombe and Aumann's Model.",
            "Approximate Matching of Neighborhood Subgraphs - An Ordered String Graph Levenshtein Method.",
            "Neuro-Fuzzy Controller Design to Navigate Unmanned Vehicle with Construction of Traffic Rules to Avoid Obstacles.",
            "A Parametric Programming Method on Gaussian Type-2 Fuzzy Set and Its Application to a Multilevel Supply Chain.",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "Solving Intuitionistic Fuzzy Solid Transportation Problem Via New Ranking Method Based on Signed Distance.",
            "Information-Based Evaluation of Approximation Methods in Dempster-Shafer Theory.",
            "Uncertain Distribution-Minimum Spanning Tree Problem.",
            "Fuzzy Models and Resolution Methods for Covering Location Problems: an Annotated Bibliography.",
            "A MAGDM Method Based on 2-Tuple Linguistic Heronian Mean and New Operational Laws.",
            "Interval Methods in Knowledge Representation.",
            "Diagram Illustrations of Aggregation Operations for the Intuitionistic Fuzzy Values.",
            "Generalized Choquet Integral Operator of Triangular Atanassov's Intuitionistic Fuzzy Numbers and Application to Multi-Attribute Group Decision Making.",
            "Distributivity for Semi-Nullnorms Over Semi-t-Operators.",
            "Uncertainty in Trust: A Risk-Aware Approach.",
            "Miner*: A Weighted Distance Sum based Outlier Mining System of Star Spectrum Data.",
            "Design and Implementation of Self-Adaptive PD Controller Based on Fuzzy Logic Algorithm for Omni-Directional Fast Robots in Presence of Model Uncertainties.",
            "Fuzzy-Based Multi-Agent System for Distributed Energy Management in Smart Grids.",
            "Interval Methods in Knowledge Representation.",
            "An Approach Based on Definite Integrals to Multi-Criteria Decision Making with Correlative Intuitionistic Fuzzy Information.",
            "A New Aggregating Operator for Linguistic Information Based on D Numbers.",
            "On a Relationship Between Fuzzy Measures and AIFS.",
            "Random Fuzzy Repairable Coherent Systems with Independent Components.",
            "Similarity-Based Approach for Group Decision Making with Multi-Granularity Linguistic Information.",
            "Fubini Theorems for Capacities.",
            "Representability of Fuzzy Biorders and Fuzzy Weak Orders.",
            "The Belief Noisy-OR Model Applied to Network Reliability Analysis.",
            "A Very Simple Formula for Aggregation and Multicriteria Optimization.",
            "Foreword.",
            "Penalty-Based and Other Representations of Economic Inequality.",
            "Fuzzy Measures of Quality of Life: a Multidimensional and Comparative Approach.",
            "Assessing the Equitable and Sustainable Well-Being of the Italian Provinces.",
            "Quality of Life and Poverty: Measurement and Comparability.",
            "Measuring the Dependence Among Dimensions of Welfare: A Study Based on Spearman's Footrule and Gini's Gamma.",
            "A Dual Decomposition of Some Rank Dependent Social Evaluation Functions.",
            "Inequality, Asymmetry and Social Welfare, and Their Relationship with the Median-Mean Ratio.",
            "Preface to Fuzzy Logic in AI.",
            "Some Relationships Between Fuzzy Sets, Mathematical Morphology, Rough Sets, F-Transforms, and Formal Concept Analysis.",
            "Pre-Clinical Study on the Detection of Simulated Epileptic Seizures.",
            "Fuzzy Model for Human Color Perception and Its Application in E-Commerce.",
            "A Proposal for Assessing Imprecise Concepts in Spanish Primary and Secondary Schools.",
            "Automated Fuzzy System Based on Feature Extraction and Selection for Opinion Classification Across Different Domains.",
            "Decision-Theoretic Planning with Fuzzy Notions in GOLOG.",
            "On δ-ϵ-Partitions for Finite Interval-Valued Hesitant Fuzzy Sets.",
            "An Analytical Solution to Dujmovic's Iterative OWA."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2015",
        "info": "Volume 23, 2015",
        "count": 63,
        "papers": [
            "Finding Maximum Clique in Stochastic Graphs Using Distributed Learning Automata.",
            "A Hybrid Model for Enhanced Prediction of Medical Diagnosis Based on Discriminative Rule Framing and Correlated Framework Approaches.",
            "Path Optimality Conditions for Minimum Spanning Tree Problem with Uncertain Edge Weights.",
            "A Multi-Scale Fuzzy Spatial Analysis Framework for Large Data Based on IT2 FS.",
            "On the α-Migrativity of Idempotent Uninorms.",
            "On a New Class of Fuzzy Coimplications Derived from Generalized h-Generators and Fuzzy Negations.",
            "Interval Methods in Knowledge Representation.",
            "Multiagent Decision Making in Collaborative Decision Networks by Utility Cluster Based Partial Evaluation.",
            "Partial Orders on Fuzzy Truth Value Algebras.",
            "A Normalized Numerical Scaling Method for the Unbalanced Multi-Granular Linguistic Sets.",
            "The Relations between Implications and Left (Right) Semi-Uninorms on a Complete Lattice.",
            "IFWA and IFWGM Methods for MADM under Atanassov's Intuitionistic Fuzzy Environment.",
            "Intuitionistic Fuzzy Power Geometric Bonferroni Means and Their Application to Multiple Attribute Group Decision Making.",
            "Interval Methods in Knowledge Representation.",
            "An Approach to Uncertain Linguistic Multi-Attribute Group Decision Making Based on Interactive Index.",
            "Continuous Representability of Interval Orders: The Topological Compatibility Setting.",
            "Generalization of (U, N)-Implications.",
            "A Novel Linguistic Group Decision-Making Model Based on Extended Hesitant Fuzzy Linguistic Term Sets.",
            "Demerit-Fuzzy Rating Mechanism and Monitoring Chart.",
            "Generalized Linguistic Ordered Weighted Hybrid Logarithm Averaging Operators and Applications to Group Decision Making.",
            "Uncertainty Measures for Multigranulation Approximation Space.",
            "A Consensus Model for Group Decision Making with Hesitant Fuzzy Information.",
            "Interval Methods in Knowledge Representation.",
            "Multiobjective Programming Problems Involving Fuzzy Coefficients, Random Variable Coefficients and Fuzzy Random Variable Coefficients.",
            "Fuzzy Descriptor Models for Earthquake Time Prediction Using Seismic Time Series.",
            "Enhancing Recommender Diversity Using Gaussian Cloud Transformation.",
            "Credibilistic Clustering: The Model and Algorithms.",
            "An Interval Type-2 Fuzzy Number Based Approach for Multi-Criteria Group Decision-Making Problems.",
            "Multivalued Dependencies in Fuzzy Multivalued Relational Databases Using Fuzzy Functions.",
            "Intuitionistic Fuzzy Linguistic Induced Ordered Weighted Averaging Operator for Group Decision Making.",
            "Interval Methods in Knowledge Representation.",
            "Dynamical Behavior of an Epidemic Model in a Fuzzy Transmission.",
            "Nonlinear System Identification Using Clustering Algorithm Based on Kernel Method and Particle Swarm Optimization.",
            "An Efficient Clustering for Anonymizing Data and Protecting Sensitive Labels.",
            "Clustering Methods Based on Weighted Quasi-Arithmetic Means of T-Transitive Fuzzy Relations.",
            "Multi-Output Interval Type-2 Fuzzy Logic System for Protein Secondary Structure Prediction.",
            "Archimedean Aggregation Operators Based on Dual Hesitant Fuzzy Set and Their Application to GDM.",
            "Linear Programming Method for Solving Semi-Latticized Fuzzy Relation Geometric Programming with Max-Min Composition.",
            "Interval Methods in Knowledge Representation.",
            "Criteria for the a Priori Shortest Path Generation in Uncertain Time-Varying Transportation Networks.",
            "A New System of Face Recognition: Using Fuzziness and Sparsity.",
            "An Interval Approximation Approach for a Multiobjective Programming Model with Fuzzy Objective Functions.",
            "An UBMFFP Tree for Mining Multiple Fuzzy Frequent Itemsets.",
            "A PSO-Based Fuzzy c-Regression Model Applied to Nonlinear Data Modeling.",
            "Parametric Matroid of Rough Set.",
            "A New Point of View for Fuzzy Numbers and Their Defuzzification.",
            "Generating Implications from One-Variable Functions.",
            "Adaptive, Noise-Exclusive and Assessment-Based Fuzzy Switching Median Filter For High Intensity Impulse Noise.",
            "A Note on the Paper \"Fuzzy Analytic Hierarchy Process: Fallacy of the Popular Methods\".",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "50 Years of Fuzzy Sets: Preface.",
            "Fuzzy-Based Techniques in Human-Like Processing of Social Network Data.",
            "Inconsistency Management from the Standpoint of Possibilistic Logic.",
            "Equations in Type-2 Fuzzy Sets.",
            "Fuzzy System Design for Security and Environment Control Applications.",
            "On the Expected Value of Fuzzy Events.",
            "Fuzzy (and Interval) Techniques in the Age of Big Data: An Overview with Applications to Environmental Science, Geosciences, Engineering, and Medicine.",
            "Characterization of a Class of Possibility Distributions.",
            "Fuzzy Intervals Application for Software Metrological Certification in Measurement and Information Systems.",
            "An Overview on the Statistical Central Tendency for Fuzzy Data Sets.",
            "Why are Vine Copulas so Successful in Econometrics?",
            "On the OWA Aggregation with Probabilistic Inputs."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2014",
        "info": "Volume 22, 2014",
        "count": 54,
        "papers": [
            "A discrete Time variable Index for Supporting Dynamic Multi-criteria Decision Making.",
            "Linear decaying weights for Time Series smoothing: an Analysis.",
            "Learning Decision Regions Based on Adaptive ellipsoids.",
            "Fuzzy Ontology Alignment using Background Knowledge.",
            "Uncertain Decision Making and its Application to portfolio Selection Problem.",
            "Numerical Approach to an Optimal Multi-Item Imperfect production Control Problem in uncertain Environment.",
            "Intuitionistic Fuzzy density-Based Aggregation operators and their Applications to Group Decision Making with Intuitionistic Preference Relations.",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "Comparing and Weakening Possibilistic Knowledge Bases.",
            "On the Boolean-like Law I(x, I(y, x)) = 1.",
            "Uncertainty Measurement for Covering Rough Sets.",
            "Steffensen's Integral Inequality for the Sugeno Integral.",
            "Fuzzy Relational Control of an Uncertain System.",
            "Possibilistic Clustering Methods for Interval-Valued Data.",
            "A Self-Tuning Fuzzy Rule-Based Classifier for Data Streams.",
            "A Note on Uncertain Sequence.",
            "On Ranking of Intuitionistic Fuzzy Values Based on Dominance Relations.",
            "A Class of Linear Multi-Objective Decision Making Model Based on Level-2 TFNwTFC Coefficients and Its Application to Supplier Selection.",
            "Some Generalized Dual Hesistant Fuzzy Geometric Aggregation Operators and Applications.",
            "Interval-Valued Intuitionistic Multiplicative Sets.",
            "On Compatibility of Interval Multiplicative Preference Relations Based on the COWGA Operator.",
            "A Fuzzy Associative Classification Approach to Visual Concept Detection.",
            "Fuzzy-Model-Based Adaptive Control for a Kind of Discrete-Time Systems with Time-Delay and Disturbances.",
            "Multi-Criteria Decision Making Methods Based on Interval-Valued Intuitionistic Fuzzy Sets.",
            "Interval Methods in Knowledge Representation.",
            "Risk Index in Uncertain Random Risk Analysis.",
            "Some Algorithms for Group Decision Making with Intuitionistic Fuzzy Preference Information.",
            "Integration of Extra-Information for Belief Function Theory Conflict Management Problem Through Generic Association Rules.",
            "Satisfaction Degree Based Interactive Decision Making under Hesitant Fuzzy Environment with Incomplete Weights.",
            "Multi-Criteria Decision Making Method with Belief Preference Relations.",
            "Single-Point Characterization of Uninorms with Nilpotent Underlying T-Norm and T-Conorm.",
            "Solutions, Potentializability and Axiomatizations under Interval Uncertainty.",
            "Bridging Probability and Possibility via Bayesian Theorem.",
            "Convergence Theorems for Uncertain Variable Sequences.",
            "Interval Methods in Knowledge Representation.",
            "Cost-Sensitive Learning of Fuzzy Rules for Imbalanced Classification Problems Using FURIA.",
            "Generating Advices with Emotional Content for Promoting Efficient Consumption of Energy.",
            "Some Intuitionist Fuzzy Weighted Geometric Distance Measures and Their Application to Group Decision Making.",
            "Dependent Interval 2-Tuple Linguistic Aggregation Operators and Their Application to Multiple Attribute Group Decision Making.",
            "Analysis on Aggregation Function Spaces.",
            "Migrative Property for Nullnorms.",
            "An Archimedean Copula Family with Hyperbolic Cotangent Generator.",
            "Epidemiological Models of Directly Transmitted Diseases: An Approach via Fuzzy Sets Theory.",
            "IF-Bags and Knowledge Representation in Soft Decision Analysis.",
            "Interval Methods in Knowledge Representation.",
            "Efficient Mining of Partial Periodic Patterns with Individual Event Support Thresholds Using Minimum Constraints.",
            "Inconsistency-Tolerant Multi-Agent Calculus.",
            "New Similarity Measures Between Generalized Trapezoidal Fuzzy Numbers Using the Jaccard Index.",
            "Advertisement Policy, Reliability Dependent Imperfect Production and Environmental Pollution Control Problem in Fuzzy-Rough Environment.",
            "A Revisit to Traces in Characterizing Properties of Fuzzy Relations.",
            "An Efficient Approach for Mining Weighted Approximate Closed Frequent Patterns Considering Noise Constraints.",
            "Relational Fuzzy Self-Organizing Maps for Cluster Visualization and Summarization.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2013",
        "info": "Volume 21, 2013",
        "count": 50,
        "papers": [
            "On a Conditional-Conjunctive Law with Fuzzy Sets - Short Note.",
            "On Compatibility of uncertain Multiplicative Linguistic Preference Relations and its Application to Group Decision Making.",
            "A Fuzzy Data envelopment Analysis for Clustering Operating Units with Imprecise Data.",
            "Induced quasi-Arithmetic uncertain Linguistic Aggregation Operator.",
            "A Descriptive Decision-Making Model under Uncertainty: Combination of Dempster-Shafer Theory and Prospect Theory.",
            "Formation of Fuzzy if-then Rules and Membership Function using Enhanced Particle Swarm Optimization.",
            "Connectedness Index of uncertain Graph.",
            "Entropy for Intuitionistic Fuzzy Sets Based on Distance and Intuitionistic Index.",
            "Interval Methods in Knowledge Representation.",
            "A Two-Dimensional Hardy Type inequality for Fuzzy integrals.",
            "Induced Choquet integrals of 2-Tuple Linguistic Information.",
            "A Possibilistic Approach to Investment Decision Making.",
            "Multi-Attribute Decision Making Method Based on Possibility variance coefficient of triangular Intuitionistic Fuzzy numbers.",
            "Intuitionistic Fuzzy Decision-Making with Similarity Measures and OWA Operator.",
            "Some Operations over Atanassov's Intuitionistic Fuzzy Sets Based on Einstein T-norm and T-Conorm.",
            "Some New Results on Weighted Geometric mean for copulas.",
            "Novel Approaches for the Transformation of Fuzzy Membership Function into Basic Probability Assignment Based on Uncertainty Optimization.",
            "Interval Methods in Knowledge Representation.",
            "Possibilistic Evaluation of Sets.",
            "A Super Radon-Nikodym derivative for Almost Subadditive Set Functions.",
            "Intuitionistic Fuzzy Ordered Information System.",
            "A numerical Approach to Uncertainty in Rough Logic.",
            "A Delay-dependent Approach to robust passivity Analysis for Takagi-Sugeno Fuzzy uncertain Recurrent Neural Networks with mixed Interval Time-varying delays.",
            "Observer-Based Fuzzy Control Design for discrete-Time T-S Fuzzy Bilinear Systems.",
            "An Analytical solution Method for the generalized Fuzzy Weighted Average Problem.",
            "Interval Methods in Knowledge Representation.",
            "Fuzzy Attribute Implications and their Expressive Power.",
            "Adaptive Fuzzy Tracking Control for a Class of perturbed nonlinear Time-varying delays Systems with unknown Control Direction.",
            "Generalized Moving averages, Distance Measures and OWA Operators.",
            "Determining the Composition of a portfolio Management from a Groupings Model.",
            "Some Icowa Operators and their Applications to Group Decision Making with Interval Fuzzy Preference Relations.",
            "Uncertain Linguistic Prioritized Aggregation Operators and their Application to Multiple Attribute Group Decision Making.",
            "Fuzzy Centre Based solution of Fuzzy Complex Linear System of equations.",
            "Interval Methods in Knowledge Representation.",
            "How to Randomly Generate Mass Functions.",
            "Further Results on the continuous Representability of Semiorders.",
            "Wd-PWS: the First Semantics for Querying over Probabilistic Data Streams with continuous Distributions.",
            "Some induced uncertain Geometric Aggregation operators with Pure Linguistic Information and their Application to Group Decision Making.",
            "Sine Entropy for uncertain Variables.",
            "A robust Fuzzy Classification Maximum likelihood Clustering Framework.",
            "Nearest Symmetric trapezoidal Fuzzy Number Approximation Preserving Expected Interval.",
            "Interval Methods in Knowledge Representation.",
            "Foreword.",
            "Parameterized 2-Tuple Linguistic Most Preferred OWA operators and their Application in Decision Making.",
            "Bounded-parameter Partially Observable Markov Decision Processes: Framework and Algorithm.",
            "Managing hesitant Information in GDM Problems under fuzzy and Multiplicative Preference Relations.",
            "Revisiting XOR-Implications: Classes of fuzzy (Co)Implications Based on F-XOR (F-XNOR) Connectives.",
            "A Linguistic Aggregation operator including weights for Linguistic Values and Experts in Group Decision Making.",
            "(S, S) Policy for uncertain Single period inventory Problem.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2012",
        "info": "Volume 20, 2012",
        "count": 50,
        "papers": [
            "On a New Class of Implications: (G, Min)-Implications and Several Classical Tautologies.",
            "Analysis of certain L-Fuzzy Relational equations and the Study of its solutions by Means of the L-Fuzzy Concept Theory.",
            "Obtaining Contradiction Measures on Intuitionistic Fuzzy Sets from Fuzzy Connectives.",
            "On Attribute Reduction with Intuitionistic Fuzzy Rough Sets.",
            "Cloud Delphi Method.",
            "Normalization in Type-2 Fuzzy Relational Data Model Based on Fuzzy Functional Dependency Using Fuzzy Functions.",
            "Power Geometric Operators for Group Decision Making under Multiplicative Linguistic Preference Relations.",
            "Interval Methods in Knowledge Representation.",
            "Indistinguishability Operators with Respect to Different T-Norms.",
            "Some Continuous Aggregation Operators with Interval-Valued Intuitionistic Fuzzy Information and their Application to Decision Making.",
            "A Metric on Space of Measurable Functions and the Related convergence.",
            "Fast Factorisation of Probabilistic Potentials and its Application to Approximate Inference in Bayesian Networks.",
            "Fuzzy Free Path Detection Based on Dense Disparity Maps obtained from Stereo Cameras.",
            "Measuring Inclusion, Similarity and Compatibility between Atanassov's Intuitionistic Fuzzy Sets.",
            "Towards a Unified Principle for Reasoning about Heterogeneous Data: a Fuzzy Logic Framework.",
            "On λ-Statistical convergence of Order β of Sequences of Fuzzy numbers.",
            "Interval Methods in Knowledge Representation.",
            "Bayesian Network Revision with Probabilistic Constraints.",
            "Adaptive Fuzzy-Based Tracking Control for a Class of Strict-Feedback SISO nonlinear Time-Delay Systems without backstepping.",
            "A Goal Programming Approach to Group Decision Making with Incomplete Fuzzy and Interval Preference Relations.",
            "Feature Selection and Granularity Learning in Genetic Fuzzy Rule-Based Classification Systems for Highly Imbalanced Data-Sets.",
            "Neighborhood System Based Rough Set: Models and Attribute Reductions.",
            "A Stock Model with jumps for uncertain Markets.",
            "On Similarity, Inclusion Measure and Entropy between Type-2 Fuzzy Sets.",
            "A New Rule-Based SIR Approach to supplier Selection under Intuitionistic Fuzzy Environments.",
            "Interval Methods in Knowledge Representation.",
            "Joining Gödel and Zadeh Fuzzy Logics in Fuzzy Description Logics.",
            "Empirical Comparison of Methods for the Hierarchical Propagation of Hybrid Uncertainty in Risk Assessment, in Presence of Dependences.",
            "Multi-Criteria Decision-Making Method Based on induced Intuitionistic Normal Fuzzy Related Aggregation Operators.",
            "A Fuzzy Associative Classification Approach for Recommender Systems.",
            "Alternative Axiomatizations of the Shapley Value under Interval Uncertainty.",
            "Interval Methods in Knowledge Representation.",
            "A Family of Finite de Morgan and Kleene Algebras.",
            "On Two Types of continuous Information Algebras.",
            "Similarity-Based Relations in Datalog Programs.",
            "Probabilistic Querying over uncertain Data Streams.",
            "A New Method for Ranking triangular Fuzzy numbers.",
            "Stochastic Behavior Analysis of an Industrial Systems using Psoblt Technique.",
            "Imprecise Classification with Credal Decision Trees.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction.",
            "Data Privacy: Definitions and Techniques.",
            "An Overview of P-Sensitive k-Anonymity Models for Microdata Anonymization.",
            "Multiple Releases of k-Anonymous Data Sets and k-Anonymous Relational Databases.",
            "Sensitivity-Independent differential Privacy via Prior Knowledge Refinement.",
            "A Metric to Evaluate Interaction Obfuscation in Online Social Networks.",
            "Statistical Dependence as the Basis for a Privacy Measure for Microdata Release.",
            "A Formalization of Record Linkage and its Application to Data Protection.",
            "On Assessing the Disclosure Risk of Controlled Adjustment Methods for Statistical Tabular Data.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2011",
        "info": "Volume 19, 2011",
        "count": 63,
        "papers": [
            "On the Classes of copulas and Quasi-copulas with a Given Diagonal Section.",
            "A PDL Approach for Qualitative Velocity.",
            "A Logical Formulation of Rough Set Definability.",
            "Solution Concept for a Two Person Bargaining Problem with Unknown Parameters.",
            "Generalized Atanassov's Intuitionistic Fuzzy Index: Construction of Atanassov's Fuzzy Entropy from Fuzzy Implication Operators.",
            "A New Approach for Solving the Minimum Cost Flow Problem with Interval and Fuzzy Data.",
            "Aggregation of Preferences in Crisp and Fuzzy Settings: Functional Equations Leading to Possibility Results.",
            "Ranking Decision Making Units by Means of Soft Computing DEA Models.",
            "Big Boss Interval Games.",
            "Interval Methods in Knowledge Representation.",
            "Incremental Compilation of Bayesian Networks Based on Maximal Prime Subgraphs.",
            "Axiomatizations of Signed Discrete Choquet integrals.",
            "Induced Aggregation under Confidence Levels.",
            "Delay-Dependent H∞ Resilient Output Fuzzy Control for Nonlinear Discrete-Time Systems with Time-Delay.",
            "Nonstandard Central Limit Theorems for Markov Chains.",
            "Uncertain and Fuzzy Object Bases: a Data Model and Algebraic Operations.",
            "Improving Latent Factor Model Based Collaborative Filtering via Integrated Folksonomy Factors.",
            "Robust Adaptive Fuzzy Controller Design for a Class of Uncertain Nonlinear Time-Delay Systems.",
            "New Approaches for Discovering Exception and Anomalous Rules.",
            "A Matrix Method for the Fuzzy Analytic Hierarchy Process.",
            "Interval Methods in Knowledge Representation.",
            "Recent Advances in Fuzzy Qualitative Reasoning.",
            "A Divide-and-Conquer Strategy for Qualitative Simulation and Fuzzy Identification of Complex Dynamical Systems.",
            "Embodied Concept Discovery through Qualitative Action Models.",
            "Fuzzy Qualitative Reasoning about Dynamic Systems Containing Trigonometric Relationships.",
            "Fuzzy Distance Sensor Data Integration and Interpretation.",
            "Decision Making of Robot Partners Based on Fuzzy Control and Boltzmann Selection.",
            "Covariance Tracking with Forgetting Factor and Random Sampling.",
            "Fuzzy Qualitative Link Analysis for Academic Performance Evaluation.",
            "Interval Methods in Knowledge Representation.",
            "On Designing Fuzzy Rule-Based Multiclassification Systems by Combining Furia with Bagging and Feature Selection.",
            "Axiomatizations and Factorizations of Sugeno Utility Functions.",
            "Tolerance Rough Set Based Attribute Extraction Approach for Multiple Semantic Knowledge Base Integration.",
            "Privacy Risk Assessment with Bounds Deduced from Bounds.",
            "Measures of Local Entropies for Compositive Fuzzy Partitions.",
            "Interval Methods in Knowledge Representation.",
            "On Monotonic sufficient conditions of Fuzzy Inference Systems and their Applications.",
            "Wkc-OWA, a New Neat-OWA Operator to Aggregate Information in Democratic Decision Problems.",
            "On an Extended Chebyshev Type inequality for Semi(Co)normed Fuzzy integrals.",
            "Multivariate Models and Variability Intervals: a Local Random Set Approach.",
            "A Generative Model of Offenders' Spatial Behaviour.",
            "Single-Layer Perceptron with Non-Additive Preference Indices and its Application to bankruptcy Prediction.",
            "Fuzzy Similarities to Compare deformed Images.",
            "Intermediate Fuzzy numbers for Color Knowledge Representation.",
            "Interval Methods in Knowledge Representation.",
            "On the Preservation of Semiorders from the Fuzzy to the Crisp Setting.",
            "Uniform and Partially Uniform Redistribution Rules.",
            "Multiagent Expedition with Graphical Models.",
            "Some harmonic Aggregation Operators with 2-Tuple Linguistic Assessment Information and their Application to Multiple Attribute Group Decision Making.",
            "Degeneracy in Fuzzy Linear Programming and its Application.",
            "I-O coefficients Importance: a Fuzzy Logic Approach.",
            "Fuzzy Control of Rigid Spacecraft Attitude maneuver with decay Rate and Input Constraints.",
            "Reconsidering the Application Scope of Fuzzy Neural Networks.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction.",
            "Weighted Quasi-Arithmetic Means and a Risk Index for Stochastic Environments.",
            "Clustering of Decision Tables toward Rough Set-Based Group Decision Aid.",
            "A Mobile Group Decision Making Model for Heterogeneous Information and Changeable Decision Contexts.",
            "Sequential Extraction of Fuzzy Regression Models: Least Squares and Least absolute Deviations.",
            "Mining Stars with FP-Growth: a Case Study on Bibliographic Data.",
            "Active Learning to Defend Poisoning Attack against Semi-Supervised Intrusion Detection Classifier.",
            "Data Privacy for Simply Anonymized Social Network Logs Represented as Graphs - Considerations for Graph alteration Operations.",
            "Co-citations and Relevance of Authors and Author Groups."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2010",
        "info": "Volume 18, 2010",
        "count": 48,
        "papers": [
            "On Liu's Inference Rule for Uncertain Systems.",
            "Fuzzy Strict Preference Relations Compatible with Fuzzy Orderings.",
            "Information Loss for Synthetic Data through Fuzzy Clustering.",
            "Lipschitz Continuity of Discrete Universal integrals Based on copulas.",
            "Hierarchical Bayesian Fuzzy Inference Nets for Internal Fault Diagnosis of Three-Phase squirrel cage Induction Motor.",
            "Learning Bayesian Networks for Regression from Incomplete Databases.",
            "Studying Interest Measures for Association Rules through a Logical Model.",
            "Interval Methods in Knowledge Representation.",
            "Characterizing the 'Principles' of Non Contradiction and Excluded Middle in [0, 1].",
            "How to Handle Interval solutions for Cooperative Interval Games.",
            "About Database Summarization.",
            "Concept Similarity in Fuzzy Formal Concept Analysis for Semantic Web.",
            "Conflicts and their Resolutions in Fuzzy Relational Multidatabases.",
            "Uncertainty Extension Theorem and Product Uncertain Measure.",
            "A New Type of Attribute Reduction for Inconsistent Decision Tables and its Computation.",
            "Interval Methods in Knowledge Representation.",
            "Independence and Conditional Decomposable Information Measures.",
            "Automating Actualisation of Geographic Information Using the Twofold Fuzzy Region Model.",
            "Bounded Linear Programs with Trapezoidal Fuzzy Numbers.",
            "Linguistic Aggregation Operators for Linguistic Decision Making Based on the Dempster-Shafer Theory of Evidence.",
            "Linguistic Summarization of Databases with Quantirius: a Reduction Algorithm for Generated Summaries.",
            "A New Kind of Fuzzy Relational equations.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction.",
            "A Hybrid Fuzzy-PROMETHEE Method for Logistics Service Selection: Design of a Decision Support Tool.",
            "Testing for Remaining Autocorrelation of the residuals in the Framework of Fuzzy Rule-Based Time Series Modelling.",
            "Learning Fuzzy User Profiles for Resource Recommendation.",
            "A Situation-Aware Resource Recommender Based on Fuzzy and Semantic Web Rules.",
            "Using Collaborative Filtering for Dealing with Missing Values in Nuclear Safeguards Evaluation.",
            "How to Support Consensus Reaching Using Action Rules: a Novel Approach.",
            "An Agent-Based Fuzzy Recommendation System Using Shoppers' Preferences for E-Commerce Applications.",
            "A Class of Poverty Measures Induced by the Dual Decomposition of Aggregation Functions.",
            "Interval Methods in Knowledge Representation.",
            "The Relationships between Two Variability and orness Optimization Problems for OWA Operator with Rim Quantifier Extensions.",
            "Bayesian Network Reasoning with Uncertain Evidences.",
            "Modeling and Querying Uncertain Relational Databases: a Survey of Approaches Based on the Possible Worlds Semantics.",
            "Fast Fuzzy Modeling Using a New Incremental SVR.",
            "Comparison of Optimal Path Planning Algorithms for Intelligent Control of Robotic Part Assembly Task.",
            "Quantifying Private Information with Human Factors in Data Publishing for Binary Sensitive Attributes.",
            "Interval Methods in Knowledge Representation.",
            "On the Polytopes of Belief and Plausibility Functions.",
            "New Measures for Comparing the Species Diversity Found in Two or More Habitats.",
            "Learning Automata-Based Algorithms for Finding Minimum Weakly Connected Dominating Set in Stochastic Graphs.",
            "Uncertainty Portfolio Model in Cross Currency Markets.",
            "Fuzzy Based GA for Entropy Bimatrix Goal Game.",
            "Group Decision Making Methodology Based on the Atanassov's Intuitionistic Fuzzy Set Generalized OWA Operator.",
            "Modeling (R, Q) Policy in a Two-Level Supply Chain System with Fuzzy Demand.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2009",
        "info": "Volume 17, 2009",
        "count": 62,
        "papers": [
            "Idempotent uninorms on Finite Ordinal Scales.",
            "A Method Based on the Dynamic Weighted Geometric Aggregation Operator for Dynamic Hybrid Multi-Attribute Group Decision Making.",
            "The Greatest Common Divisor and Other Triangular Norms on the Extended Set of Natural Numbers.",
            "Dynamic Similarity Metric Using Fuzzy Predicates for Case-Based Planning.",
            "Stability of Fuzzy Dynamic Systems.",
            "Definition and Adaptation of Weighted Fuzzy Logic Programs.",
            "E-Vague Positive Class.",
            "Interval Methods in Knowledge Representation.",
            "Generalizing Dutch Risk Measures through Imprecise Previsions.",
            "Some Geometric Aggregation Functions and their Application to Dynamic Multiple Attribute Decision Making in the Intuitionistic Fuzzy Setting.",
            "Universal codomains to Represent Interval Orders.",
            "Divisible, Reciprocal Automorphisms of the Unit Interval.",
            "Dynamic Portfolio Selection with Uncertainty.",
            "Uncertain Linguistic Hybrid Geometric Mean Operator and its Application to Group Decision Making under Uncertain Linguistic Environment.",
            "Spline Approximation for Zadeh's Extensions.",
            "Learning Bayesian Network Parameters from Soft Data.",
            "Interval Methods in Knowledge Representation.",
            "On a Certain Class of submeasures Based on Triangular Norms.",
            "An Approach for Multiple Attribute Group Decision Making Based on Intuitionistic Fuzzy Information.",
            "M-Attributes Algorithm for the Selection of a Company to be Affected by a Public Offering.",
            "Alternative Representation of Fuzzy Coalitions.",
            "Fuzzy Multiple Objective Programming in an Interval Piecewise Regression Model.",
            "The Generalized Biparabolic Distribution.",
            "A Fuzzy-Neural Fluctuation Smoothing Rule for Scheduling Jobs with Various Priorities in a semiconductor Manufacturing Factory.",
            "Some Properties of Continuous Uncertain Measure.",
            "Intuitionistic Fuzzy Linguistic Quantifiers Based on Intuitionistic Fuzzy-Valued Fuzzy Measures and integrals.",
            "Correlation Coefficient between Generalized Atanassov's Intuitionistic Fuzzy Sets.",
            "Interval Methods in Knowledge Representation.",
            "Sugeno Integral and the Comonotone Commuting Property.",
            "Opposite Diagonal Sections of Quasi-copulas and copulas.",
            "Aggregation and Consensus in Multiobjective and Multiperson Decision Making.",
            "Crisp Representations and Reasoning for Fuzzy Ontologies.",
            "Fuzzy Linguistic Modeling of Ease of Doing Business Indicators.",
            "Using Ant Colony Optimization to minimize the Fuzzy makespan and Total Weighted Fuzzy Completion Time in Flow Shop Scheduling Problems.",
            "A Nonlinear Programming Approach to Matrix Games with Payoffs of Atanassov's Intuitionistic Fuzzy Sets.",
            "Interval Methods in Knowledge Representation.",
            "Asymptotically Idempotent Aggregation Operators.",
            "Correlated Linguistic Information Aggregation.",
            "Difference Relation-Based Rough Set and Negative Rules in Incomplete Information System.",
            "Managing Target the Cash Balance in Construction Firms Using a Fuzzy Regression Approach.",
            "Laws of Large Numbers for Continuous Belief Measures on Compact Spaces.",
            "Adaptive Fuzzy Sliding Mode Control for Seismically excited Bridges with lead Rubber Bearing Isolation.",
            "Development of a Neuro Fuzzy Model for Noise Prediction in opencast Mines.",
            "Modeling of Cognitive Structure of Uncertain Scientific Concepts Using Fuzzy-Rough Sets and Intuitionistic Fuzzy Sets: Example of the Life Concept.",
            "Interval Methods in Knowledge Representation.",
            "A Consonant Approximation of the Product of Independent Consonant Random Sets.",
            "Multiattribute Group Decision Making Method Using Extended Linguistic Variables.",
            "A Class of Integrated Logistics Network Model under Random Fuzzy Environment and its Application to Chinese Beer Company.",
            "A Filter-Wrapper Method to Select Variables for the Naive Bayes Classifier Based on Credal Decision Trees.",
            "A New Method for Measuring the Uncertainty in Incomplete Information Systems.",
            "Adaptive Limited fractional Guard Channel Algorithms: a Learning Automata Approach.",
            "Interval Methods in Knowledge Representation.",
            "Preface.",
            "Indexing Fuzzy numerical Data with a B+ Tree for Fast Retrieval Using Necessity-Measured Flexible conditions.",
            "Soft Aggregation in Flexible Databases Querying Based on the Vector P-Norm.",
            "On an Interpretation of Keywords Weights in Information Retrieval: Some Fuzzy Logic Based Approaches.",
            "Emerging User Intentions: Matching User Queries with Topic Evolution in News Text Streams.",
            "A Fuzzy Logic Approach to Topic Extraction in Texts.",
            "Discovering Fuzzy Unexpected Sequences with Concept Hierarchies.",
            "A Fuzzy Conceptual Model for Multimedia Data with a Text-Based Automatic Annotation Scheme.",
            "Comparison of Sets and Multisets.",
            "Fuzzy Intervals to Represent Fuzzy Valid Time in a Temporal Relational Database."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2008",
        "info": "Volume 16, 2008",
        "count": 66,
        "papers": [
            "An Axiomatic Definition of Fuzzy Divergence Measures.",
            "New Resolution of Finite Fuzzy Relation Equations with Max-Min Composition.",
            "A Fuzzy-Neural System Incorporating Unequally Important Expert Opinions for semiconductor Yield Forecasting.",
            "A Fuzzy Logic and Default Reasoning Model of Social Norms and Equilibrium Selection in Games under Unforeseen Contingencies.",
            "An Approach to Group Decision Making Based on Incomplete Fuzzy Preference Relations.",
            "On para-Normed Space with Fuzzy Variables Based on Expected Valued Operator.",
            "Interpolation of Fuzzy Data by Using Fuzzy splines.",
            "A New Approach for Probabilistically Bounded Sets in Menger Probabilistic Normed Spaces.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction.",
            "Characterizing Trees in Concept Lattices.",
            "A multicriteria System Using Gradual Fuzzy Rules and Fuzzy Arithmetic.",
            "Integration of a Consistency Control Module within a Consensus Model.",
            "Active Learning with Misclassification Sampling Based on Committee.",
            "Perception-Based Estimations of Fuzzy Random Variables: Linearity and convexity.",
            "Error Detection and Correction Based on Chinese Phonemic Alphabet in Chinese Text.",
            "On the Comparison of Generic Information Loss Measures and Cluster-Specific Ones.",
            "How to Group Attributes in Multivariate Microaggregation.",
            "A Map Characterizing the Fuzzy Points and Columns of a T-Indistinguishability Operator.",
            "Strict Fuzzy Orderings with a Given Context of Similarity.",
            "Combination Entropy and Combination Granulation in Rough Set Theory.",
            "Fuzzy Clustering of Feature Vectors with Some Ordinal Valued Attributes Using Gradient Descent for Learning.",
            "Fuzzy Linear and Polynomial Regression Modelling of 'if-Then' Fuzzy Rulebase.",
            "Uncertainty Measure of Rough Sets Based on a Knowledge Granulation for Incomplete Information Systems.",
            "Simplified Fuzzy Inference Rule-Based Genetically Optimized Hybrid Fuzzy Neural Networks.",
            "Interval Methods in Knowledge Representation.",
            "Self-Contradiction and Contradiction between Two Atanassov's Intuitionistic Fuzzy Sets.",
            "Specification and Computing States in Fuzzy Algorithms.",
            "Combination Methods and Conflict Handling in Evidential Theories.",
            "Lexicographic Method for Matrix Games with Payoffs of Triangular Fuzzy Numbers.",
            "Cross-Layer Design for Mobile Ad Hoc Networks Using Interval Type-2 Fuzzy Logic Systems.",
            "Using Genetic Algorithms to Solve Fuzzy Flow Shop Scheduling Problems Based on Possibility and Necessity Measures.",
            "Interval Methods in Knowledge Representation.",
            "Portfolio Selection and Online Learning.",
            "Pattern Extraction from Bag Databases.",
            "Many-Valued R-S Memory Circuits.",
            "On Entropy of Fuzzy Sets.",
            "An Overview of Distance and Similarity Measures of Intuitionistic Fuzzy Sets.",
            "Mathematical Programming Approach to multiattribute Decision Making under Intuitionistic Fuzzy Environments.",
            "Robust Fuzzy Regression Analysis Using Neural Networks.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction.",
            "An Algorithmic Approach to Preference Representation.",
            "A Note on the Estimation of Missing Pairwise Preference Values: a Uninorm Consistency Based Method.",
            "Improving the Effectiveness of Knowledge Based Recommender Systems Using Incomplete Linguistic Preference Relations.",
            "Sequential Consensus for Selecting Qualified Individuals of a Group.",
            "Multi-Attribute Decision Making Based on Label Semantics.",
            "Hypotheses Management for Disorder Diagnosis in a Hierarchical Framework.",
            "Fuzzy bilevel Programming: Multi-Objective and Multi-Follower with Shared Variables.",
            "Rule Correlation and Choquet Integration in Fuzzy Inference Systems.",
            "Automorphisms of the Algebra of Fuzzy Truth Values II.",
            "Mining Frequent Temporal Patterns in Interval Sequences.",
            "Fuzzy Robust Regression Analysis Based on the Ranking of Fuzzy Sets.",
            "An Intelligent Technology Based Method for Interpreting Sensory Evaluation Data Provided by Multiple Panels.",
            "Independence in Complete and Incomplete Causal Networks under Maximum Entropy.",
            "Some Computations on Fuzzy Matrices: an Application in Fuzzy Analytical Hierarchy Process.",
            "Incorporating Fuzziness into Active Rules.",
            "Interval Methods in Knowledge Representation.",
            "Aggregates Computed over Fuzzy Sets and their Integration into SQLF.",
            "A Fuzzy Multi-Objective Model of QFD Product Planning Integrating Kano Model.",
            "S-Mountain Method for Obtaining Focus Points from Data.",
            "Lattice-Valued Possibilistic Entropy Measure.",
            "Calibrating Function Point Backfiring Conversion Ratios Using Neuro-Fuzzy Technique.",
            "A Matrix Method for the Fuzzy Analytic Network Process.",
            "Statistical Fuzzy Convergence.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2007",
        "info": "Volume 15, 2007",
        "count": 66,
        "papers": [
            "Sugeno Integral and Geometric Inequalities.",
            "A Bilattice-Based Framework for Handling Graded Truth and Imprecision.",
            "Some General Properties of a Fuzzy Single Machine Scheduling Problem.",
            "Generalizing T-Conorms to Face Saturation in Mamdani Fuzzy Inference Systems.",
            "On the Observability of Continuous-Time Dynamic Fuzzy Control Systems.",
            "Modelling Dependence in Dempster-Shafer Theory.",
            "Farsjum, a Fuzzy System for Ranking Sparse Judgment Matrices: a Case Study in Soccer tournaments.",
            "Interval Methods in Knowledge Representation.",
            "Introduction.",
            "Using TIN-Based Structures for the Modelling of Fuzzy GIS Objects in a Database.",
            "Subsumption Degrees between Entity Types and Names for Approximate Knowledge Retrieval.",
            "Fuzzy Data Representation and Querying in XML Database.",
            "F-Cube Factory: a Fuzzy OLAP System for Supporting Imprecision.",
            "Monitoring Event Flows and Modelling Scenarios for Crisis Prediction: Application to Ethnic Conflicts Forecasting.",
            "A General Framework for Computing with Words in Object-Oriented Programming.",
            "A Hybrid Feature Selection Method for Text Categorization.",
            "Fuzzy LINMAP Method for multiattribute Group Decision Making with Linguistic Variables and Incomplete Information.",
            "Some Relations among Values, Interactions, and Decomposability of Non-Additive Measures.",
            "Pointwise Construction of Lipschitz Aggregation Operators with Specific Properties.",
            "A Fuzzy Linguistic IRS Model Based on a 2-Tuple Fuzzy Linguistic Approach.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editorial.",
            "The Independence of Fuzzy Variables with Applications to Fuzzy Random Optimization.",
            "A Sufficient and Necessary Condition for Chance Distributions of Random Fuzzy Variables.",
            "Fuzzy Dominance: a New Approach for Ranking Fuzzy Variables via Credibility Measure.",
            "Maximum Entropy Principle for Fuzzy Variables.",
            "Credibility Measure-Based Fuzzy Membership Grade Kriging.",
            "On Sensitivity Ranking Using Analytic Hierarchy Process.",
            "A Fuzzy Programming Approach for Supply Chain Network Design.",
            "New Statistical Approaches for Fuzzy Data.",
            "Fuzzy Random Degree-Constrained Minimum Spanning Tree Problem.",
            "A Generalized Approach to Possibilistic Clustering Algorithms.",
            "A Monte Carlo Simulation Based Approach for Stochastic Semi-Infinite Mathematical Programming Problems.",
            "A High-Level Fuzzy Petri Nets Model for Integrating Quantitative and Qualitative Decision-Making.",
            "Models for Multiple Attribute Decision Making with Intuitionistic Fuzzy Information.",
            "Interval-Valued Representability of Qualitative Data: the Continuous Case.",
            "Evaluating Government Websites Based on a Fuzzy Multiple Criteria Decision-Making Approach.",
            "Representability in Interval-Valued Fuzzy Set Theory.",
            "A Fuzzy Compromise Solution for multicriteria Problems.",
            "Performance Evaluation of Fuzzy Single Layer Weightless Neural Network.",
            "Interval Methods in Knowledge Representation.",
            "Copulas with Given Diagonal Sections: Novel Constructions and Applications.",
            "A Modification of the Index of Liou and Wang for Ranking Fuzzy Number.",
            "A Generalization of Bihari's inequality and Fuzzy Random Differential Equations with Non-Lipschitz Coefficients.",
            "An LP-Based Approach to Outliers Detection in Fuzzy Regression Analysis.",
            "Interval-Valued Fuzzy Logic Control for a Class of Distributed Parameter Systems.",
            "Inclusiveness Measurement of Random Events Using Rough Set Theory.",
            "Renewal Process for Fuzzy Variables.",
            "Roughness of Type-2 Fuzzy Set Based on Similarity Relation.",
            "Interval Methods in Knowledge Representation.",
            "Editorial.",
            "On the Role of Interpretability in Fuzzy Data Mining.",
            "A Multi-Objective Genetic Algorithm for Tuning and Rule Selection to Obtain Accurate and Compact Linguistic Fuzzy Rule-Based Systems.",
            "An Alternative Approach to Discover Gradual Dependencies.",
            "A Neuro-Fuzzy Model for Dimensionality Reduction and its Application.",
            "Resampling for Fuzzy Clustering.",
            "Visualization of Fuzzy Classifiers.",
            "Bibliometric Mapping of the Computational Intelligence Field.",
            "Interval Methods in Knowledge Representation.",
            "Fundamentals of Media Theory.",
            "Robustness of the Regression Models for Uncertain Categories.",
            "Selective Naive Bayes for Regression Based on Mixtures of Truncated Exponentials.",
            "Fusing Fuzzy Association Rule-Based Classifiers Using Sugeno Integral with Ordered Weighted Averaging Operators.",
            "Robust Wavelet-Domain Watermark Scheme Based on Fuzzy Technology.",
            "Forecasting LCD TV Demand Using the Fuzzy Grey Model Gm(1, 1).",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2006",
        "info": "Volume 14, 2006",
        "count": 54,
        "papers": [
            "Philippe Smets' Obituary.",
            "Introduction to the section on Concept Oriented Knowledge Representation under Uncertainty.",
            "Description Logics over Lattices.",
            "Adding Probabilities and Rules to Owl Lite Subsets Based on Probabilistic Datalog.",
            "Probabilistic Role Models and the Guarded Fragment.",
            "Fuzzy Set Based Protocols for Process Quality Control.",
            "Automorphisms of Powers of Linearly Ordered Sets.",
            "Fuzzy Principal Component Regression (FCPR) for Fuzzy Input and Output Data.",
            "The Adomian Decomposition Method Applied to the Fuzzy System of Fredholm Integral Equations of the Second Kind.",
            "Uncertainty of Human Error and Fuzzy Approach to Human Reliability Analysis.",
            "Yet Another Fuzzy Model for Linear Logic.",
            "Interval Methods in Knowledge Representation.",
            "An Algorithm to Compute the Upper Entropy for Order-2 Capacities.",
            "On Measuring Imprecision in Human Response Due to Respondent and Attribute and its Utility in Questionnaire Design.",
            "Extensions of Partial Lattice-valued Possibilistic Measures from Nested Domains.",
            "Economic Load Dispatch Based on Hybrid Evolutionary Algorithm and Fuzzy Number Ranking Method.",
            "Three-parameter Fuzzy Arithmetic Approximation of L-r Fuzzy Numbers for Fuzzy Neural Networks.",
            "Completing Fuzzy if-then Rule Bases by Means of Smoothing Splines.",
            "Interval Methods in Knowledge Representation.",
            "Extremal k-Lipschitz T-Conorms.",
            "Representation Theorem of Interval-Valued Fuzzy Set.",
            "Maximal orness Weights with a Fixed Variability for OWA Operators.",
            "An Approach for Solving Fuzzy Games.",
            "Multiplicative Properties in Evaluation of Decision Trees.",
            "A Fuzzy Model for Design Evaluation Based on Multiple Criteria Analysis in Engineering Systems.",
            "Khmer Printed Character Recognition by Using Wavelet Descriptors.",
            "Inner Product Based Entropy in the Intuitionistic Fuzzy Setting.",
            "Interval Methods in Knowledge Representation.",
            "Editorial.",
            "Capacities and Games on Lattices: a Survey of Results.",
            "Answer Set Programming and Combinatorial multicriteria Decision Making.",
            "Mcdm Aggregation Model Using Situational Me-OWA and Me-Owga Operators.",
            "Consistency in the Analytic Hierarchy Process: a New Approach.",
            "Attribute Reduction in Variable Precision Rough Set Model.",
            "Kernel Methods for Clustering: Competitive Learning and C-Means.",
            "Watermarking Numerical Data in the Presence of Noise.",
            "Content-Based Image Retrieval of Kaou Images by Relaxation Matching of Region Features.",
            "Interval Methods in Knowledge Representation.",
            "A Sufficient and Necessary Condition for Credibility Measures.",
            "Weak Fuzzy S-Subsethood Measures: Overlap Index.",
            "Fuzzy Arithmetic Based on Dimension-Adaptive Sparse Grids: a Case Study of a Large-Scale Finite Element Model under Uncertain Parameters.",
            "Representation of Choquet Integral - Interpreter and MÖbius Transform.",
            "Utilizing Distributed Learning Automata to Solve Stochastic Shortest Path Problems.",
            "Threshold Accepting Based Fuzzy Clustering Algorithms.",
            "A Note on the Existence Theorem of Possibility Space.",
            "Interval Methods in Knowledge Representation.",
            "Gene Ontology Similarity Measures Based on Linear Order Statistics.",
            "Cautious Analysis of Project Risks by Interval-Valued Initial Data.",
            "Linear First-Order Fuzzy Differential Equations.",
            "Automorphisms of the Algebra of Fuzzy Truth Values.",
            "Optimal Selection of Collieries for Reconstruction: an Application of Fuzzy 0-1 Linear Programming.",
            "A Note on the Minimal Variability OWA Operator Weights.",
            "A Note on Fair Division under Interval Uncertainty.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2005",
        "info": "Volume 13, 2005",
        "count": 47,
        "papers": [
            "Generalized Relative Cardinalities Of Fuzzy Sets.",
            "Uncertainty Estimates In The Fuzzy-Product-Limit Estimator.",
            "Fuzzy Arithmetic Based On Boundary Weak T-Norms.",
            "Methodology To Determine The Evolution Of Asymptomatic Hiv Population Using Fuzzy Set Theory.",
            "Graphoid Properties Of Qualitative Possibilistic Independence Relations.",
            "Solving Fuzzy Linear Programming Problems With Modified S-Curve Membership Function.",
            "Interval Methods In Knowledge Representation.",
            "Balanced fuzzy computing unit.",
            "Utilities and distortions: an objective approach to possibilities coding.",
            "On Inequalities And Critical Values Of Fuzzy Random Variables.",
            "Imprecise second-order model for a system of independent random variables.",
            "Domination in products of fuzzy graphs.",
            "Walking pedestrian tracking among several pedestrians by dynamic camera.",
            "Data envelopment analysis with imprecise data: an application of taiwan machinery firms.",
            "Interval methods in knowledge representation.",
            "A General Method for Convergence Theorems of Fuzzy Set-valued Random Variables and its Applications to Martingales and Uniform Amarts.",
            "On Complementary Logical Connectives and Relative Complements.",
            "On Filling-in Missing Conditional Probabilities in Causal Networks.",
            "Application and Robustness Design of Fuzzy Controller for Resonant and Chaotic Systems with External Disturbance.",
            "An Artificial Network for Reasoning in the Cancellation Class with Application to the Diagnosis of Cells Division.",
            "A Solution for Systems of Linear Fuzzy Equations in Spite of the Non-existence of a Field of Fuzzy Numbers.",
            "On Connection between Uncertainty Algebraic Hypersystems and Probability Spaces.",
            "Interval Piecewise Regression Model with Automatic Change-point Detection by Quadratic Programming.",
            "Interval Methods in Knowledge Representation.",
            "Analyzing the Nonlinear Time Series of Turbulent Flows with Kernel Interval Regression Machine.",
            "Fuzzy Programming with Recourse.",
            "Graphical Interpretation of the Twofold Integral and its Generalization.",
            "A Mathematical Programming Approach to Fuzzy Tandem Queues.",
            "The Expert's Confidence versus Fuzzy Probability in the Mean Activity Times Computation.",
            "Smets-magrez Axioms for R-implicators in Interval-valued and Intuitionistic Fuzzy Set Theory.",
            "Interval Methods in Knowledge Representation.",
            "Corrigendum: \"a Non-specificity Measure for Convex Sets of Probability Distributions\".",
            "Foreword.",
            "Decision Analysis with Multiple Objectives in a Framework for Evaluating Imprecision.",
            "(dis)belief Change and Argued Feed-back Dialog.",
            "Global Propagation in Bayesian Networks Vs Semijoin Programs in Relational Databases.",
            "Interval Methods in Knowledge Representation.",
            "Book Review: \"intelligent Sensory Evaluation - Methodologies and Applications\".",
            "Generalized Composition of Binary Aggregation Operators.",
            "Recursive and Iterative Owa Operators.",
            "Inner Product Truth-valued Flow Inference.",
            "A Note on Fixed Point Theorem for Fuzzy Mappings.",
            "On Arithmetic Operations of Interval Numbers.",
            "A Fuzzy Data Mining Algorithm for Incremental Mining of Quantitative Sequential Patterns.",
            "The Knowledge-based Fuzzy Rules Emulated Network and its Applications on Direct Adaptive on Nonlinear Control Systems.",
            "Fuzzy Rule Extraction from a Feed Forward Neural Network by Training a Representative Fuzzy Neural Network Using Gradient Descent.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2004",
        "info": "Volume 12, 2004",
        "count": 69,
        "papers": [
            "A Note On A Fuzzy Time Series Model Of Fuzzy Number Observations.",
            "Fuzzy Mapping Between Physical Domain And Function Domain In Design Process.",
            "Fuzzy Transductive Support Vector Machines For Hypertext Classification.",
            "The Information Entropy, Rough Entropy And Knowledge Granulation In Rough Set Theory.",
            "Probabilistic Rough Sets Characterized By Fuzzy Sets.",
            "Egoroff'S Theorem On Monotone Non-Additive Measure Spaces.",
            "Choquet Aggregation Using Order Inducing Variables.",
            "Finite 𝕃-Fuzzy Acceptors, Regular 𝕃-Fuzzy Grammars And Syntactic Pattern Recognition.",
            "Fuzzy Ordering Of Fuzzy Numbers.",
            "Countably Compact L-Sets.",
            "Interval Methods In Knowledge Representation.",
            "Corrigendum: Interval Methods In Knowledge Representation (Abstracts Of Recent Papers).",
            "On The Definition Of Coherence Measure For Fuzzy Sets.",
            "Ridge Regression Procedures For Fuzzy Models Using Triangular Fuzzy Numbers.",
            "Decision Making Based On Statistical Data, Signed Distance And Compositional Rule Of Inference.",
            "How To Cope With Division Problems Under Interval Uncertainty Of Claims?",
            "Finitely And Absolutely Non Idempotent Aggregation Operatorsc.",
            "Fitting Generated Aggregation Operators To Empirical Data.",
            "Relative Semi-Dynamical Systems.",
            "Fuzzy Chu Spaces And Fuzzy Topologies.",
            "Interval Methods In Knowledge Representation.",
            "Similarity Logic And Translations.",
            "Linear Coordination Method For Fuzzy Multi-Objective Linear Programming Problems With Convex Polyhedral Membership Functions.",
            "Fuzzy C-Means Clustering Models For Multivariate Time-Varying Data: Different Approaches.",
            "Notion Of Fuzzy Ic-Bags.",
            "Empirical Fuzzy Estimate Of The Survival Curve.",
            "Analysis And Algorithms Of Bifuzzy Systems.",
            "Ranking-Intuitionistic Fuzzy Numbers.",
            "Intuitionistic Fuzzy Implication Operators - An Expression And Main Properties.",
            "Interval Methods In Knowledge Representation.",
            "Induction And Fusion Of Fuzzy Prototypes.",
            "Automatic Pattern Construction For Web Information Extraction.",
            "Fuzzy Optimization Of Real Functions.",
            "The Quest For Rings On Bipolar Scales.",
            "Fuzzy Clustering Based On Intuitionistic Fuzzy Relations.",
            "Fuzzy Matrices With Complete Transitivity.",
            "The Integral Over A Directed Line Segment Of Fuzzy Mapping And Its Applications.",
            "Interval Methods In Knowledge Representation.",
            "Fuzzy Possibilities As Upper Previsions.",
            "Entropies Of Fuzzy Indiscernibility Relation And Its Operations.",
            "A Fuzzy Multiple Objective Programming To Dea With Imprecise Data.",
            "Comparison Of Type-2 Fuzzy Values With Satisfaction Function.",
            "Matrix Representation Of Belief States: An Algebraic Semantics For Belief Logics.",
            "Fuzzy Linear Regression Analysis From The Point Of View Risk.",
            "On Knowledge Reduction In Inconsistent Decision Information Systems.",
            "Problem Solving With Insufficient Resources.",
            "Estimation Of Weibull Parameters Using A Fuzzy Least-Squares Method.",
            "Interval Methods In Knowledge Representation.",
            "An Extension Of Lazy Evaluation For Influence Diagrams Avoiding Redundant Variables In The Potentials.",
            "Probabilistic Decision Graphs - Combining Verification And Ai Techniques For Probabilistic Inference.",
            "Characterization Of Essential Graphs By Means Of The Operation Of Legal Merging Of Components.",
            "Unsupervised Learning Of Bayesian Networks Via Estimation Of Distribution Algorithms: An Application To Gene Expression Data Clustering.",
            "Bayesian Networks In Educational Testing.",
            "A Knowledge-Based System To Model Human Supervisory Control In Dynamic Planning.",
            "Fingerprint Matching Using Artmap.",
            "Fuzzy Cognitive Maps With Genetic Algorithm For Goal-Oriented Decision Support.",
            "A Hybrid Knowledge-Based And Evolutionary Process Model Of Airport Gate Scheduling.",
            "Oap: An Object-Oriented Approach For Planning Modeling.",
            "An Agent Based Power And Bandwidth Aware Routing For Mobile Ad-Hoc Networks.",
            "Sequential And Parallel Algorithms For Causal Explanation With Background Knowledge.",
            "Textual-Based Clustering Of Web Documents.",
            "Uncertainty Modeling Using Fuzzy Arithmetic Based On Sparse Grids: Applications To Dynamic Systems.",
            "Fuzzy Class Logistic Regression Analysis.",
            "Partial Algebraic Conditional Spaces.",
            "Eowa And Eowg Operators For Aggregating Linguistic Labels Based On Linguistic Preference Relations.",
            "Laws Of Large Numbers For Weighted Sums Of Fuzzy Set-Valued Random Variables.",
            "Similarity Measures Between Type-2 Fuzzy Sets.",
            "An Intuitionistic Owa Operator.",
            "Interval Methods In Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2003",
        "info": "Volume 11, 2003",
        "count": 59,
        "papers": [
            "Management of Uncertainty and Imprecision in Multimedia Information Systems: Introducing this Special Issue.",
            "Modelling Uncertainty in Multimedia Database Systems: An Extended Possibilistic Approach.",
            "A Fuzzy Object-Based Data Model for Imperfect Spatial Information Integrating Exact Objects and Fields.",
            "Flexibility and Fuzzy Case-Based Evaluation in Querying: An Illustration in an Experimental Setting.",
            "Four-Valued Knowledge Augmentation for Structured Document Retrieval.",
            "Learning Retrieval Expert Combinations with Genetic Algorithms.",
            "Uncertainty and Term Selection in Text Categorization.",
            "Weighted Fuzzy Averages in Fuzzy Environment: Part I. Insufficient Expert Data and Fuzzy Averages.",
            "Weighted Fuzzy Averages in Fuzzy Environment: Part II. Generalized Weighted Fuzzy Expected Values in Fuzzy Environment.",
            "A Fuzzy Data Mining Algorithm for Finding Sequential Patterns.",
            "Expected Value Operator of Random Fuzzy Variable, Random Fuzzy Expected Value Models.",
            "A Constructive Method for Building Fuzzy Rule-Based Systems.",
            "On Many-Valued Partitions and Many-Valued Equivalence Relations.",
            "Interval Methods in Knowledge Representation.",
            "Book Review: Triangular Norms.",
            "Using Fuzzy Set Theory to Analyse Investments and Select Portfolios of Tangible Investments in Uncertain Environments.",
            "Conditional and Weighted Measures of Ecological Diversity.",
            "Imprecise Second-Order Hierarchical Uncertainty Model .",
            "Representations of the Extensions of Many-Valued Equivalence Relations.",
            "Normalizing Possibility Distributions Using t-Norms.",
            "A Solution Method for Truncated Normalized Max Product Fuzzy Set of Equations.",
            "Qualitative Probability and Order of Magnitude Reasoning.",
            "Interval Methods in Knowledge Representation .",
            "Imprecise Previsions For Risk Measurement.",
            "Distributive Idempotent Uninorms.",
            "Development of Fuzzy Regression Models Using Genetic Algorithms.",
            "Accuracy, Comprehensibility and Completeness Evaluation of a Fuzzy Expert System.",
            "Genuine Sets, Various Kinds of Fuzzy Sets and Fuzzy Rough Sets.",
            "An Agent-Based Approach to Identification of Prediction Models.",
            "Interval Methods in Knowledge Representation.",
            "Learning Rules for Odour Recognition in an Electronic Nose.",
            "Conditional Independences Structures and Graphical Models.",
            "Renewal Process with Fuzzy Interarrival Times and Rewards.",
            "Maximum of Entropy for Credal Sets.",
            "Scalar Cardinalities of Finite Fuzzy Sets for t-Norms and t-Conorms.",
            "Some Formulae to Calculate the Entropies of the Image Fuzzy Sets.",
            "A Note on Entropy of Intuitionistic Fuzzy Sets.",
            "Defuzzification within a Multicriteria Decision Model.",
            "Interval Methods in Knowledge Representation.",
            "An Evolutionary Algorithm for Pure Fuzzy Flowshop Scheduling Problems.",
            "A New Approach Of Bivariate Fuzzy Time Series Analysis To The Forecasting Of A Stock Index.",
            "Classes Of Intuitionistic Fuzzy T-Norms Satisfying The Residuation Principle.",
            "The Extended Transformation Method For The Simulation And Analysis Of Fuzzy-Parameterized Models.",
            "Products And Marginals Of Poset-Valued Fuzzy And Possibilistic Measures.",
            "Approximation Of Belief Functions.",
            "Interval Methods In Knowledge Representation.",
            "A Big-Stepped Probability Approach for Discovering Default Rules.",
            "Closed Set Based Discovery of Maximal Covering Rules.",
            "Querying Fuzzy Multidimensional Databases: Unary Operators and Their Properties.",
            "A Tuple-Oriented Algorithm for Deduction in a Fuzzy Relational Database.",
            "Efficient Andness-Directed Importance Weighted Averaging Operators.",
            "Distributed Information Retrieval: A Multi-Objective Resource Selection Approach.",
            "Improving the Efficiency of the Bayesian Network Retrieval Model by Reducing Relationships Between Terms.",
            "Intelligent Knowledge Extraction From the Web.",
            "When Plans Distinguish Bayes Nets.",
            "Incremental Development of Diagnostic Set-Covering Models with Therapy Effects.",
            "Probabilistic Aspects of Score Systems.",
            "On the Checking of G-Coherence of Conditional Probability Bounds.",
            "Nonmonotonic Reasoning by Inhibition Nets II."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2002",
        "info": "Volume 10, 2002",
        "count": 53,
        "papers": [
            "Relationships Between Possibility Measures and Nested Random Sets.",
            "Piecewise Linear Aggregation Functions.",
            "Fundamentals of M-Vague Algebra and M-Vague Arithmetic Operations.",
            "Fuzzy Structures on HyperK-Algebras.",
            "The Algorithm on Knowledge Reduction in Incomplete Information Systems.",
            "Partial Correlation Coefficients of Intuitionistic Fuzzy Sets.",
            "Interval Methods in Knowledge Representation (abstracts of recent papers).",
            "A Theoretical Framework for Possibilistic Independence in a Weakly Ordered Setting.",
            "Hierarchical Spherical Clustering.",
            "Concepts Associated to Criteria: A Method for Knowledge Processing from Fuzzy Contexts.",
            "On Possibilistic and Probabilistic Approximations of Unrestricted Belief Functions Based on the Concept of Fuzzy T-Preorder.",
            "L-Fuzzy PS-Compactness.",
            "Interval Methods in Knowledge Representation (abstracts of recent papers).",
            "General Entropy of General Measures.",
            "Weak Consistency and Quasi-Linear Means Imply the Actual Ranking.",
            "Using a Notion of Acceptable in Uncertain Ordinal Decision Making.",
            "Hybrid Fuzzy Polynomial Neural Networks.",
            "A Formalism for Representing and Reasoning with Linguistic Information.",
            "A Novel Defuzzifying Approach to Car Evaluation and Selection Under Fuzzy Environment.",
            "Generalized Comonotonically Additive Operators: Representations by Choquet Integrals.",
            "A Fuzzy Risk Model and Its Matrix Algorithm.",
            "Sum Normal Optimization of Fuzzy Membership Functions.",
            "Fuzzy Multiobjective Programming Methods for Fuzzy Constrained Matrix Games with Fuzzy Numbers.",
            "A Hybrid Model for Sharing Information Between Fuzzy, Uncertain and Default Reasoning Models in Multi-agent Systems.",
            "Editorial: Trends in Aggregation and Security Assessment for Inference Control in Statistical Databases.",
            "Exact and Approximate Methods for Data Directed Microaggregation in One or More Dimensions.",
            "On the Security of Microaggregation with Individual Ranking: Analytical Attacks.",
            "A Computational Algorithm for Handling the Special Uniques Problem.",
            "Modelling User Uncertainty for Disclosure Risk and Data Utility.",
            "Software Systems for Tabular Data Releases.",
            "A Critique of the Sensitivity Rules Usually Employed for Statistical Table Protection.",
            "k-Anonymity: A Model for Protecting Privacy.",
            "Achieving k-Anonymity Privacy Protection Using Generalization and Suppression.",
            "Re-identifying Register Data by Survey Data Using Cluster Analysis: An Empirical Study.",
            "An Approach to a Dynamic System Simulation Based on Human Information Processing.",
            "Possibilistic Entropies and the Compression of Possibilistic Data.",
            "Monotone Approximation of Aggregation Operators Using Least Squares Splines.",
            "A Method for Improving the Consistency of Judgements.",
            "Facility Location Selection Using Fuzzy TOPSIS Under Group Decisions.",
            "Specification of a Fuzzy Object Inference: Towards an Advanced Knowledge-Based Programming.",
            "Correlation of Fuzzy Numbers by a-Cut Method.",
            "On a Class of Uninorms.",
            "Domination of Aggregation Operators and Preservation of Transitivity.",
            "Construction of Kernel Aggregation Operators from Marginal Values.",
            "A Remark on the Arithmetic Mean of an Infinite Sequence.",
            "Probabilistic Multi-Valued Contractions and Decomposable Measures.",
            "The g-Operational Calculus.",
            "Henstock-Kurzweil Type Integral Based on Generalized g-Semiring.",
            "p-Symmetric Fuzzy Measures.",
            "States, Uniformities and Metrics on Lattice Effect Algebras.",
            "Contrapositive Symmetry of Distributive Fuzzy Implications.",
            "Generalized Compositions of Fuzzy Relations.",
            "Properties of Regular Fuzzy Relations."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2001",
        "info": "Volume 9, 2001",
        "count": 67,
        "papers": [
            "Set Defuzzification and Choquet Integral.",
            "Second-Order Decision Analysis.",
            "Dissonance - A Measure of Variability for Ordinal Random Variables.",
            "Remarks on the Conjunctions, Disjunctions and Implications of the Intuitionistic Fuzzy Logic.",
            "Remarks on Ivlin's Paper from an Intuitionistic Fuzzy Logic Point of View.",
            "Remark on Two Operations over Intuitionistic Fuzzy Sets.",
            "Remark on the Pseudo-Fixed Points of the Intuitionistic Fuzzy Logic Operators.",
            "Perturbation of Intuitionistic Fuzzy Relations.",
            "Dempster Combination Rule with Boolean-Like Processed Belief Functions.",
            "A Decomposition of k-Additive Choquet and k-Maxitive Sugeno Integrals.",
            "How to Improve Acts: An Alternative Representation of the Importance of Criteria in MCDM.",
            "Pseudo-integral Based on Non-associative and Non-commutative Pseudo-addition and Pseudo-multiplication.",
            "RET Operators Generated by Triangular Norms and Copulas.",
            "Weighted Means Based on Triangular Conorms.",
            "Aggregation Operators and Associated Fuzzy Measures.",
            "Aggregation Operators and Additive Generators.",
            "Collapsed Input-Based Aggregation.",
            "On a Class of Distributive Fuzzy Implications.",
            "Limit t-Norms as a Basis for the Construction of New t-Norms.",
            "The Necessity of the Strong a-Cuts of a Fuzzy Set.",
            "Bell-Type Inequalities in Fuzzy Probability Calculus.",
            "A Logic for Uncertain Probabilities.",
            "Modification of Concordance Analysis Based on Statistical Data and Ranking of Level 1 - a Fuzzy Numbers.",
            "Linear Coalitional Games and Their Fuzzy Extensions.",
            "Contexts with Multiple Weighted Values.",
            "Sensor Fusion Integrating Contextual Information.",
            "Possibilistic Normalisation and Reasoning Under Partial Inconsistency.",
            "Inner and Outer Approximation of Belief Structures Using a Hierarchical Clustering Approach.",
            "Simplifying Explanations in Bayesian Belief Networks.",
            "On Left and Right Uninorms.",
            "Using Statistical Viewpoint in Developing Correlation of Intuitionistic Fuzzy Sets.",
            "A Note on the Correlation of Fuzzy Numbers by Expected Interval.",
            "Guest Editorial - Computing with Words: Foundations and Applications.",
            "An Alternative Approach to Computing with Words.",
            "Extending Choquet Integrals for Aggregation of Ordinal Values.",
            "The 2-Tuple Linguistic Computational Model. Advantages of Its Linguistic Description, Accuracy and Consistency.",
            "Linguistic Modifiers in a Symbolic Framework.",
            "An Ordinal Information Retrieval Model.",
            "An Information Retrieval Model with Ordinal Linguistic Weighted Queries Based on Two Weighting Elements.",
            "Computing with Words in Decision Making Through Individual and Collective Linguistic Choice Rules.",
            "Applying Linguistic Decision-Making Method to Deal with Service Quality Evaluation Problems.",
            "Linguistic and Choquet Integral Based Evaluation in Process Planning.",
            "Fuzzy Queueing Theory Revisited.",
            "The Use of the Discrete Sugeno Integral in Decision-Making: A Survey.",
            "Uncertainty and Imprecision in Analytical Context: Fuzzy Limits and Fuzzy Derivatives.",
            "Trade-off Between Computation Time and Number of Rules for Fuzzy Mining from Quantitative Data.",
            "Multi-objective Fully Fuzzified Linear Programming.",
            "Decomposition of Multiuniverse Fuzzy Truth Functions.",
            "Interval Methods in Knowledge Representation (abstracts of recent papers).",
            "Intelligent Technologies - Preface.",
            "YAG: A Template-Based Text Realization System for Dialog.",
            "Fuzzy C-Mean: A Statistical Feature Classification of Text and Image Segmentation Method.",
            "Comparative Study of Continuous Hidden Markov Models (CHMM) and Artificial Neural Network (ANN) on Speaker Identification System.",
            "An Object Location Specifying Methodology Using One Camera.",
            "Nondestructive Maturity Determination of Durian by Force Vibration and Ultrasonic.",
            "Aerospace Applications of Intervals: From Geospatial Data Processing to Fault Detection in Aerospace Structures.",
            "A Competitive Neural Network Approach to Web-Page Categorization.",
            "Measure of Similarity Between Fuzzy Concepts for Identification of Fuzzy User's Requests in Fuzzy Semantic Networks.",
            "Statistical and Dempster-Shafer Techniques in Testing Structural Integrity of Aerospace Structures.",
            "A New Adaptive Multistage Filter for the Removal of Impulse Noise.",
            "A Novel Approach for Robust, Fast and Accurate Face Detection.",
            "Fault Immunization Concept for Self-Organizing Mapping Neural Networks.",
            "An Off-line Handwritten Thai Alphabet Recognition System for Unconstrained Handwriting Styles.",
            "Support Vector Machines for Thai Phoneme Recognition.",
            "Tone Recognition of Continuous Thai Speech Under Tonal Assimilation and Declination Effects Using Half-Tone Model.",
            "From Planning to Searching for the Shortest Plan: An Optimal Transition.",
            "Membership Function Optimisation of a Fuzzy Logic Controller for a Non-linear System."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "2000",
        "info": "Volume 8, 2000",
        "count": 44,
        "papers": [
            "Some Group Theoretic Aspects of t-Norms.",
            "On Modus Ponens Generating Functions.",
            "A New Approach to Learning Linguistic Control Rules.",
            "Advances in Media Theory.",
            "On a Theorem Prover for Variational Logic Programs with Functors Setu and Sets.",
            "An Overview of Rough Set Semantics for Modal and Quantifier Logics.",
            "Introduction: Hybrid Probabilistic Systems.",
            "Non-Determinism and Uncertainty in the Situation Calculus.",
            "A Factorized Representation of Independence of Causal Influence and Lazy Propagation.",
            "Directing Genetic Algorithms for Probabilistic Reasoning Through Reinforcement Learning.",
            "Committees of Learning Agents.",
            "On Proofs in System P.",
            "Coherence of Dempster's Conditioning Rule in Discrete Possibilistic Markov Models.",
            "Conditional Independence Relations in Possibility Theory.",
            "Dempster Belief Functions are Based on the Principle of Complete Ignorance.",
            "Open-Frame Dempster Conditioning for Incomplete Interval Probabilities.",
            "Applications of Possibility and Evidence Theory in Civil Engineering.",
            "On the Structure of Probability Functions in the Natural World.",
            "Partial Probability: Theory and Applications.",
            "How Sets of Coherent Probabilities May Serve as Models for Degrees of Incoherence.",
            "A Non-Specificity Measure for Convex Sets of Probability Distributions.",
            "Operational Approach to General Fuzzy Measures.",
            "Choquet Integral Models and Independence Concepts in Multiattribute Utility Theory.",
            "Generation of Weighting Triangles Associated with Aggregation Functions.",
            "Fuzzy Belief Nets.",
            "Fuzzy Sets and Fuzzy Relational Structures as Chu Spaces.",
            "Point Matching with a \"Soft\" Relaxation Algorithm.",
            "A Hedge for Gödel Fuzzy Logic.",
            "Coping with Uncertainly in n-Person Games.",
            "A Fuzzy Recurrent Artificial Neural Network (FRANN) for Pattern Classification.",
            "An Approach for Combining Linguistic and Numerical Information Based on the 2-Tuple Fuzzy Linguistic Representation Model in Decision-Making.",
            "On Preselection of Rules in Fuzzy Logic Deduction.",
            "Ranking Fuzzy Numbers Using a-Weighted Valuations.",
            "A Similarity-Based Generalization of Fuzzy Orderings Preserving the Classical Axioms.",
            "Fair Division Under Interval Uncertainty.",
            "Entropy of Discrete Fuzzy Measures.",
            "Coherence Measures on Finite Fuzzy Sets.",
            "Balanced Discrete Fuzzy Measures.",
            "Divergence Measures and Aggregation Operations.",
            "Compositions of Fuzzy Relations Based on Aggregation Operator and its Pseudocomplement.",
            "Integration with Respect to Decomposable Measures, Based on a Conditionally Distributive Semiring on the Unit Interval.",
            "Representation of Preference Relations Induced by Lattice-Valued, Generalized Possibilistic Utility Functions.",
            "Fuzzy Clustering with Weighting of Data Variables.",
            "A Multiple Classifier System Using Ambiguity Rejection for Clustering-Classification Cooperation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1999",
        "info": "Volume 7, 1999",
        "count": 46,
        "papers": [
            "Speaker Adaptation of Fuzzy-Perceptron-Based Speech Recognition.",
            "t-Operators.",
            "Maximum Entropy Principle and the Logistic Model.",
            "Maximising Entropy to Deduce an Initial Probability Distribution for a Causal Network.",
            "Multivariate Non-Linear Fuzzy Regression: An Evolutionary Algorithm Approach.",
            "Fuzzy Relative Position Between Objects in Image Processing: New Definition and Properties Based on a Morphological Approach.",
            "Gödel Representable Fuzzy Weak Orders.",
            "An Axiomatic Approach to a Class of Ranking Functions for Triangular Fuzzy Numbers.",
            "Possibilistic Sonar Data Modeling for Mobile Robots.",
            "The Length and Betweenness Relations of Indistinguishability Operators.",
            "Menger and Ovchinnikov on Indistinguishabilities, Revisited.",
            "On the Relation Between Fuzzy Preorders and Fuzzy Consequence Operators.",
            "Locally Internal Aggregation Functions.",
            "Linguistic Representation of Fuzzy Temporal Profiles.",
            "A Study About the Inclusion of Linguistic Hedges in a Fuzzy Rule Learning Algorithm.",
            "A Total Order for the Graded Numbers Used in Decision Problems.",
            "Fuzzy Grammar for Handling Fuzzy Algorithms.",
            "Programming Approach for Fuzzy Model-Based Multiobjective Control Systems.",
            "On Group Decision Making Under Linguistic Assessments.",
            "Necessary and Sufficient Conditions for fuzzy Truth Values to Form a de Morgan Algebra.",
            "Fuzzy Quantum Posets.",
            "Navigation Control of an Intelligent Wheelchair Using Fuzzy Logic.",
            "Model Identification of a Servo-Tracking System Using Fuzzy Clustering.",
            "Hedge Algebras, Linguistic-Valued Logic and Their Application to Fuzzy Reasoning.",
            "Fuzzy/Probability ~ Fractal/Smooth.",
            "TUBERDIAG: An Expert System for Pulmonary Tuberculosis Diagnosis.",
            "A Fuzzy Distributed Expert System Design Tool Exgen and its Application to Sensory Foodstuff Evaluation.",
            "A Multimedia Information Acquistion Method Based on Fuzzy Inference.",
            "A Treatment of Usefulness of Keywords in Fuzzy Requests for an Information Retrieval System with Bayesian Networks.",
            "Fuzzy Interpretation of Human Intelligence.",
            "Fuzzy Identification of the User's Requirements in the Human Interface of Man-Machine Systems by the Global Learning Method.",
            "Decentralized Stabilization of Complex Systems by Combination of Conventional and Fuzzy Controls.",
            "Hierarchical Decision Making in Strategic Investment by A Boltzmann Machine.",
            "Numerical Methods for Fuzzy Initial Value Problems.",
            "Design of Adaptive Fuzzy Sliding Mode Control for Nonlinear System.",
            "Searching for Meaning on Defuzzification.",
            "Decision Making Uncertainty with Ordinal Information.",
            "Diagnosis Through Bilateral Membership Functions and Pattern Recognition.",
            "Optimization Issues for Fuzzy Measures.",
            "K-Order Additive Fuzzy Measures.",
            "Aggregation of k-Order Maxitive Fuzzy Measures.",
            "Logical Interpretation of Discrete Choquet Integral Defined by General Measures.",
            "Evidence Measures Induced by Kripke's Accessibility Relations.",
            "Pseudo-Convolution Based on Idempotent Operation as Limit of g-Convolution.",
            "On the Possibilistic Deceision Model: From Decesion under Uncertainty to Case-Based Decesion.",
            "On the Sum of Observables in Product MV Algebras."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1998",
        "info": "Volume 6, 1998",
        "count": 43,
        "papers": [
            "A General Framework for Upper and Lower Possibilities and Necessities.",
            "A Highly Adaptive Algorithm for Fuzzy Modelling of Systems.",
            "The Fuzzy Riemann-Stieltjes Integral.",
            "Fuzzy Number Approximation.",
            "Dempster Combination Rule for Signed Belief Functions.",
            "Interval Methods in Knowledge Representation.",
            "The Vanishing Gradient Problem During Learning Recurrent Neural Nets and Problem Solutions.",
            "Speeding Up Backpropagation Algorithms by Using Cross-Entropy Combined with Pattern Normalization.",
            "Development and Implementation of a Neural Knock Detector Using Constructive Learning Methods.",
            "Assessment of Clusteranalysis and Self-Organizing Maps.",
            "Quality Assurance at Continuous Hot-Dip Galvanizing Lines by Neuro-Model Assisted Fuzzy-Control.",
            "Structure Optimization of Takagi-Sugeno Fuzzy Models.",
            "Missing Values and Learning of Fuzzy Rules.",
            "Fuzzy Navigation for Robotic Manipulators.",
            "Fuzzy Traffic Management for Modern Telecommunications.",
            "ECG Diagnostics by Fuzzy Decision Making.",
            "A Development Tool for Analog Fuzzy Controllers: Features and Applications.",
            "Interval Methods in Knowledge Representation.",
            "Evaluation of Ambiguity in Fuzzy Algorithm Represented with Fuzzy Petri Net.",
            "A Probabilistic Approach to Ordering Formulas in a Possibilistic Knowledge Base.",
            "Canonical Separated Hierarchical Decomposition of the Choquet Integral Over a Finite Set.",
            "ICOT: An Integrated C-Object Tool for Knowledge-Based Programming.",
            "Comma 32 805/32 768.",
            "FUSINTER: A Method for Discretization of Continuous Attributes.",
            "Interval Methods in Knowledge Representation.",
            "Decomposable Financial Laws and Profitability.",
            "Canonical Hierarchical Decomposition of Choquet Integral Over Finite Set with Respect to Null Additive Fuzzy Measure.",
            "Possibilistic Residuated Implication Logics with Applications.",
            "Ordinal Explanation of the Periodic System of Chemical Elements.",
            "LSLNCF: A Hybrid Uncertain Reasoning Model Based on Probability.",
            "Interval Methods in Knowledge Representation.",
            "A Fuzzy Set Corresponding to an Intuitionistic Fuzzy Set.",
            "An Integrated Framework for Generalized Nearest Prototype Classifier Design.",
            "The Application of Generalised Fuzzy Rules to Machine Learning and Automated Knowledge Discovery.",
            "On Considering Constraints of Different Importance in Fuzzy Constraint Satisfaction Problems.",
            "An Effective Partition Method of the Fuzzy Inheritance Hierarchies on the basis of the Semantic Proximity.",
            "Interval Methods in Knowledge Representation.",
            "Measures of Information in Generalized Constraints.",
            "Aggregation Operators Defined by k-Order Additive/Maxitive Fuzzy Measures.",
            "An Open-Frame Theory of Incomplete Interval Probabilities.",
            "Type 2 Fuzzy Sets: An Appraisal of Theory and Applications.",
            "Separating Power of a Fuzzy Set and Decreasing Rearrangement.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1997",
        "info": "Volume 5, 1997",
        "count": 47,
        "papers": [
            "On the Comparisons of OWA Operators and Ordinal OWA Operators.",
            "On-Line Chinese Character Recognition by Incorporating Human Knowledge.",
            "A Simple Procedure for Pattern Pre-Recognition Based on Fuzzy Logic Analysis.",
            "A Knowledge-Based Controller Used in Process Control Systems.",
            "On the Integrable Solution of a Class of Fuzzy Functional Equations.",
            "Fuzzy Encoding and Decoding: A Study in Information Granularity.",
            "A Suggested Conditional Modus Ponens.",
            "Interval Methods in Knowledge Representation.",
            "An Approach to Modelling and Simulation of Uncertain Dynamical Systems.",
            "Adaptive Pole Placement Control Algorithm for Nonlinear Systems.",
            "Inducing a Membership Function of a Category in a Fuzzy-Set-Based Attribute Space.",
            "PFB-Integrals and PFA-Integrals with Respect to Monotone Set Functions.",
            "Normalized Conditional Possibility Distributions and Informational Connection Between Fuzzy Variables.",
            "Bodies of Evidence Versus Simple Interval Probabilities.",
            "Book Review \"Fuzzy Sets, Fuzzy Logic, and Fuzzy Systems\", Selected Papers by Lotfi A. Zadeh, edited by George J. Klir and Bo Yuan.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction: Interval Methods in Representing and Processing Uncertainty.",
            "A Mathematical Setting for Fuzzy Logics.",
            "Interval Methods and Fuzzy Optimization.",
            "From Intervals to Fuzzy Truth-Values: Adding Flexibility to Reasoning Under Uncertainty.",
            "Reasoning with Uncertainty in Deductive Databases and Logic Programs.",
            "Interval-Valued Degrees of Belief: Applications of Interval Computations to Expert Systems and Intelligent Control.",
            "On Capacity Functionals in Interval Probabilities.",
            "Local Radon-Nikodym Derivatives of Set Functions.",
            "Interval Methods in Knowledge Representation.",
            "On Some Classes of Idempotent Operators.",
            "Structure of Uninorms.",
            "A Modified OWA Operator and its Use in Lossless DPCM Image Compression.",
            "Management of Uncertainty and Vagueness in Databases: The Firms Point of View.",
            "An Approach for Solving Fuzzy MADM Problems.",
            "Fuzziness: From Epistemic Considerations to Terminological Clarification.",
            "Book Review: \"Fuzzy Sets and Fuzzy Logic Theory and Applications\", by George J. Klir, Bo Yuan.",
            "Interval Methods in Knowledge Representation.",
            "On a Subjective Evaluation Model by a Generalized Fuzzy Integral.",
            "Partition Type Fuzzy Integral Model for Evaluation Process.",
            "Some Characterizations of the Systems Represented by Choquet and Multi-Linear Functionals through the use of Möbius Inversion.",
            "Separated Hierarchical Decomposition of the Choquet Integral.",
            "Alternative Representations of Discrete Fuzzy Measures for Decision Making.",
            "Interval Methods in Knowledge Representation.",
            "Fuzzy Adjacency between Image Objects.",
            "Verification and Transformation of Complex and Uncertain Conceptual Schemas.",
            "On the Best Scalar Approximation of Cardinality of a Fuzzy Set.",
            "A Fuzzy Switched DPCM Predictor for Lossless Compression of Noisy Images.",
            "A Fuzzy Query Optimization Approach for Multidatabase Systems.",
            "Admissible Partitions of Fuzzy Finite State Machines.",
            "Interval Methods in Knowledge Representation.",
            "Errata: Partition Type Fuzzy Integral Model for Evaluation Process."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1996",
        "info": "Volume 4, 1996",
        "count": 39,
        "papers": [
            "Decision Making with Belief Structures: an Application in Risk Management.",
            "Fuzzy Mealy Machines: Homomorphisms, Admissible Relations and Minimal Machines.",
            "Qualitative Modalities.",
            "Modeling fuzzy Reasoning using High Level fuzzy Petri Nets.",
            "Urysohn-Closedness on fuzzy Lattices.",
            "Book Review: \"Non-Additive Measure and Integral\" by Dieter Denneberg.",
            "Characterization of coherent Conditional Probabilities as a Tool for their Assessment and Extension.",
            "On the Relationship of Associative Compensatory operators to triangular Norms and Conorms.",
            "Orderings for Classes of Aggregation operators.",
            "Computing the Well-Founded Model of Deductive Databases.",
            "Dealing with Disjunctive and missing Information in Logic fuzzy Databases.",
            "Erratum: \"Some Elements of the Theory of Qualitative Possibilistic Networks\".",
            "Vanishing TETRAD Differences and Model Structure.",
            "Fuzzy Implications and generalized Quantifiers.",
            "An Extension of Fung-Fu's Theorem.",
            "On the Equivalence between fuzzy and Statistical Classifiers.",
            "Application of fuzzy Control Theory in Active Control of Structures.",
            "Nonstandard Approach to Possibility Measures.",
            "Aggregation and Completion of Random Sets with Distributional fuzzy Measures.",
            "Normal Forms for fuzzy Logic - an Application of Kolmogorov's Theorem.",
            "On Distributivity and Modularity in de Morgan Triplets.",
            "Fuzzy Categorical ideals in BCK-Algebras.",
            "Ranking fuzzy numbers through the Comparison of its Expected Intervals.",
            "Book Review: \"Fuzzy Databases - Principles and Applications\" by Frederick E. Petry.",
            "Interval Methods in Knowledge Representation.",
            "On the Inclusion of variance in Decision Making under Uncertainty.",
            "Second order Logical System for Risk Classification in a Newly Developed Country.",
            "Currency Exchange rate Prediction Technique by fuzzy Inferencing on the Chaotic Nature of Time Series Data.",
            "Multi-period Risk Management using fuzzy Logic.",
            "Interval Methods in Knowledge Representation.",
            "Guest Editors' Introduction: Applications of fuzzy Theory to Complex Systems.",
            "Fuzzy Project Scheduling Models under inflation condition.",
            "Explicit Functions of fuzzy Control Systems.",
            "The Design of an Adaptive Multiple Agent fuzzy Constraint-Based controller (Mafcc) for a Complex hydraulic System.",
            "On Fuzziness and duality in fuzzy differential equations.",
            "Principal Components, B-splines, and fuzzy System Reduction.",
            "A Precedent-Based Legal Judgement System using fuzzy Database.",
            "A Neural Network that Learns from fuzzy Data for Language Acquisition.",
            "Interval Methods in Knowledge Representation."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1995",
        "info": "Volume 3, 1995",
        "count": 24,
        "papers": [
            "A Hierarchical Decomposition of Choquet integral Model.",
            "Hierarchical Aggregation of OWA operators: Basic Measures and Related Computational Problems.",
            "On the Maximum-Entropy Probability which is Consistent with a Convex Capacity.",
            "Consistency of Judgement Matrix and fuzzy weights in fuzzy analytic Hierarchy Process.",
            "Aggregating Transitive fuzzy Binary Relations.",
            "Adapting Query Representation to Improve Retrieval in a fuzzy Database.",
            "Reference Classes and Multiple Inheritances.",
            "Fuzzy Information Processing for Expert Systems.",
            "On the Application of a class of MICA operators.",
            "On the Theory of Typicality.",
            "Approximate Reasoning about Priorities of Imprecise Conflicting Requirements.",
            "Finding a posterior Domain Probability Distribution by Specifying Nonspecific Evidence.",
            "Further Results in Qualitative Uncertainty.",
            "Book Review: \"Fuzzy Measure Theory\", by Zhenyuan Wang and George J. Klir.",
            "Fuzzy Information Fusion in a Face Recognition System.",
            "Mathematical Foundations of Conditionals and their Probabilistic Assignments.",
            "Towards Theoretical Foundations of Soft Computing Applications.",
            "Hybrid Location-Content Addressable Memory with its Application to Character Recognition.",
            "Hybrid Heuristic Semantic Networks in Natural Language Understanding.",
            "Selection of α for α-Hull and formulation of fuzzy α-Hull in Ir2.",
            "Ecg signals Processing with Neural Networks.",
            "Texture Segmentation: an Unsupervised Approach.",
            "Corps_f: a New Tool for Feature Assessment in Imprecisely Supervised or fuzzy Environments.",
            "A generalized fuzzy covariance Matrix."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1994",
        "info": "Volume 2, 1994",
        "count": 35,
        "papers": [
            "Levels of significance for fuzzy Implication.",
            "Fuzzy Reasoning by Case for Decision Support Systems.",
            "Homogeneous Linear fuzzy Functions and Ranking Methods in fuzzy Linear Programming Problems.",
            "Enriched Interval Bilattices and Partial Many-Valued Logics: an Approach to Deal with Graded Truth and Imprecision.",
            "Fuzzy Sensors for fuzzy Control.",
            "Some Elements of the Theory of Qualitative Possibilistic Networks.",
            "Iterative Induction of a Category Membership Function.",
            "On Weighted median Aggregation.",
            "An Approach to Goal-Oriented Reasoning Based on fuzzy Sets.",
            "Constraints as Incompatibility Relations in KBS.",
            "On a multicriteria fuzzy Clustering Method for 3-Way Data.",
            "Representing Conditional Independence Relations by Valuation Networks.",
            "Probability Intervals: a Tool for uncertain Reasoning.",
            "On the fuzzy functional Equation x(t) = a(t)h(t, x(t)) + y(t).",
            "A Primer on Solving fuzzy Relational equations on the Unit Interval.",
            "A Qualitative Belief Logic.",
            "On Modal Logic Interpretation of Possibility Theory.",
            "A Rule-Based Method to calculate the Widest solution Sets of a Max-Min fuzzy Relational equation.",
            "Analysis of a class of fuzzy controllers.",
            "A fuzzy Neural Network Model for fuzzy Inference and Rule Tuning.",
            "Adaptive Truth Valued Flow Inference.",
            "A Remote Sensing Application of a fuzzy Classifier.",
            "Application of identification of fuzzy Model in Structural mechanics.",
            "Fuzzy Controls by Product-Sum-gravity Method Dealing with fuzzy Rules of emphatic and Suppressive Types.",
            "Objective-Centered formulation of an Adaptive fuzzy Control Scheme.",
            "Commutative Implications on Complete Lattices.",
            "Fuzzy C-Means Clustering Algorithm with Two Layers and its Application to Image Segmentation Based on Two-Dimensional Histogram.",
            "Hysteresis Characterization by a fuzzy Learning Algorithm.",
            "A Measure of Average sensitivity for fuzzy Logics.",
            "Calculating Maximum-Entropy Probability densities for Belief Functions.",
            "The inverse Problem of the Aggregation of fuzzy Sets.",
            "Estimations of Expectedness and potential Surprise in Possibility Theory.",
            "Saturatedness and a Hierarchy of Approximate Identities.",
            "A conjecture to the solution of the continuous Logistic equation.",
            "How to Handle the Flexibility of Linguistic Variables with Applications."
        ]
    },
    {
        "name": "IJUFKS",
        "year": "1993",
        "info": "Volume 1, 1993",
        "count": 9,
        "papers": [
            "On the Integration of Uncertainty Theories.",
            "An Approach to Linguistic Instruction Based Learning.",
            "Extremal Properties of Belief Measures in the Theory of Evidence.",
            "Maximum Entropy Algorithms for Uncertainty Measures.",
            "Projection Pursuit Based on Maximum Dependence.",
            "On Logic and fuzzy Logic.",
            "On the Completion of Priority Orderings in Nonmonotonic Reasoning Systems.",
            "Fuzzy if-then-Unless Rules and their Implementation.",
            "Management of Uncertainty in Top-Down, fuzzy Logic-Based Image Understanding of Natural Objects."
        ]
    }
]