[
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2022",
        "info": "Volume 37, 2022",
        "count": 108,
        "papers": [
            "A generalized χ 2 divergence for multisource information fusion and its application in fault diagnosis.",
            "Data augmentation for low-resource languages NMT guided by constrained sampling.",
            "HSWOA: An ensemble of hunger games search and whale optimization algorithm for global optimization.",
            "Similarity and Pythagorean reliability measures of multivalued neutrosophic cubic set and its application to multiple-criteria decision-making.",
            "A long short-term memory-based model for greenhouse climate prediction.",
            "A systematic survey of deep learning in breast cancer.",
            "Application of Choquet integral in interval type-2 Pythagorean fuzzy sustainable supply chain management under risk.",
            "On admissible total orders for typical hesitant fuzzy consensus measures.",
            "An empirical study of supervised email classification in Internet of Things: Practical performance and key influencing factors.",
            "A framework for designing cognitive trajectory controllers using genetically evolved interval type-2 fuzzy cognitive maps.",
            "Modification of the fuzzy analytic hierarchy process via different ranking methods.",
            "Domain adaptation via incremental confidence samples into classification.",
            "L-fuzzy congruence classes in universal algebras.",
            "Visual features and Deep Maxout Network-based moving target detection using radar signals under sea clutter.",
            "Landscape estimation of solidity version usage on Ethereum via version identification.",
            "Portfolio selection as a multicriteria group decision making in Pythagorean fuzzy environment with GRA and FAHP framework.",
            "On the game-theoretic analysis of distributed generative adversarial networks.",
            "A novel approach towards bipolar complex fuzzy sets and their applications in generalized similarity measures.",
            "Privacy-preserving convolutional neural network prediction with low latency and lightweight users.",
            "A novel hesitant fuzzy linguistic hybrid cloud model and extended best-worst method for multicriteria decision making.",
            "Dual hesitant Z-number (DHZN), correlated distance, and risk quantification.",
            "Constructing ontologies by mining deep semantics from XML Schemas and XML instance documents.",
            "A group key agreement protocol for intelligent internet of things system.",
            "Aviation maintenance technician scheduling with personnel satisfaction based on interactive multi-swarm bacterial foraging optimization.",
            "AIoU: Adaptive bounding box regression for accurate oriented object detection.",
            "Consciousness-driven reinforcement learning: An online learning control framework.",
            "Multi-agent reinforcement learning via knowledge transfer with differentially private noise.",
            "DADCNet: Dual attention densely connected network for more accurate real iris region segmentation.",
            "Neutrino-like particle for particle swarm optimization.",
            "Deep node ranking for neuro-symbolic structural node embedding and classification.",
            "Deep computation model to the estimation of sulphur dioxide for plant health monitoring in IoT.",
            "Dual-branch mutual assistance network for salient object detection.",
            "Adaptive partial graph learning and fusion for incomplete multi-view clustering.",
            "Neutrality aggregation operators based on complex q-rung orthopair fuzzy sets and their applications in multiattribute decision-making problems.",
            "Retraction: Optimizing the convolutional network layers using the Viola-Jones framework and ternary weight networks.",
            "Fault section diagnosis of power systems with logical operation binary gaining-sharing knowledge-based algorithm.",
            "Hidden service publishing flow homology comparison using profile-hidden markov model.",
            "Spare simple MKKM with semi-infinite linear program optimization.",
            "Multi-choice best-worst multi-criteria decision-making method and its applications.",
            "AHNA: Adaptive representation learning for attributed heterogeneous networks.",
            "Research on intelligent calculation method of intelligent traffic flow index based on big data mining.",
            "PSSPR: A source location privacy protection scheme based on sector phantom routing in WSNs.",
            "Semantic-aware automatic image colorization via unpaired cycle-consistent self-supervised network.",
            "A novel weighted spatial T-spherical fuzzy C-means algorithms with bias correction for image segmentation.",
            "A PCA-NPOGBDT strategy-based protection scheme to differentiate between inverter and distribution line faults plus detection and identification of faulty section in microgrid.",
            "Dynamic incentive mechanism design for regulation-aware systems.",
            "Verifiable data streaming with efficient update for intelligent automation systems.",
            "Modified neural network algorithm based robust design of AVR system using the Kharitonov theorem.",
            "Label entropy-based cooperative particle swarm optimization algorithm for dynamic overlapping community detection in complex networks.",
            "Rough approximation-based inventory optimization with random prices for B2C companies during the promotion period.",
            "A new structure of the focal element in object recognition.",
            "EviChain: A scalable blockchain for accountable intelligent surveillance systems.",
            "Granulized Z-OWA aggregation operator and its application in fuzzy risk assessment.",
            "Deep Dual Support Vector Data description for anomaly detection on attributed networks.",
            "Aczel-Alsina aggregation operators and their application to intuitionistic fuzzy multiple attribute decision making.",
            "Secure data stream transmission method for cell pathological image storage system.",
            "NAGNN: Classification of COVID-19 based on neighboring aware representation from deep graph neural network.",
            "Multistage semantic-aware image inpainting with stacked generator networks.",
            "Multicriteria recommendation based on bacterial foraging optimization.",
            "Sensor network oriented human motion capture via wearable intelligent system.",
            "Semi-supervised multiple empirical kernel learning with pseudo empirical loss and similarity regularization.",
            "Accelerating exact nearest neighbor search in high dimensional Euclidean space via block vectors.",
            "Design of efficient multiobjective binary PSO algorithms for solving multi-item capacitated lot-sizing problem.",
            "Assessing farmers' perception to Agriculture 4.0 technologies: A new interval-valued spherical fuzzy sets based approach.",
            "Erratum to: An improved random forest algorithm and its application to wind pressure prediction.",
            "Improved generalized dissimilarity measure-based VIKOR method for Pythagorean fuzzy sets.",
            "A multimodal architecture using Adapt-HKFCT segmentation and feature-based chaos integrated deep neural networks (Chaos-DNN-SPOA) for contactless biometricpalm vein recognition system.",
            "Motif-based embedding label propagation algorithm for community detection.",
            "New distance measure for Fermatean fuzzy sets and its application.",
            "Supermarket fresh food suppliers evaluation and selection with multigranularity unbalanced hesitant fuzzy linguistic information based on prospect theory and evidential theory.",
            "Multiple criteria choice modeling using the grounds of T-spherical fuzzy REGIME analysis.",
            "Knowledge structure enhanced graph representation learning model for attentive knowledge tracing.",
            "Inequality distance hyperplane multiclass support vector machines.",
            "Optimal allocation of distributed generation and electric vehicle charging stations-based SPOA2B approach.",
            "SVNMPR: A new single-valued neutrosophic multiplicative preference relation and their application to decision-making process.",
            "A novel TMGWO-SLBNC-based multidimensional feature subset selection and classification framework for frequent diagnosis of breast lesion abnormalities.",
            "Deep image compression with lifting scheme: Wavelet transform domain based on high-frequency subband prediction.",
            "Multipartition clustering of mixed data with Bayesian networks.",
            "Error model and simulation for multisource fusion indoor positioning.",
            "Recurrent spiking neural network with dynamic presynaptic currents based on backpropagation.",
            "Boundary-based Fuzzy-SVDD for one-class classification.",
            "Defective and nondefective classif ication of fabric images using shallow and deep networks.",
            "Bin similarity-based domain adaptation for fine-grained image classification.",
            "Ensemble mutation slime mould algorithm with restart mechanism for feature selection.",
            "A comprehensive review of federated learning for COVID-19 detection.",
            "ME-MADDPG: An efficient learning-based motion planning method for multiple agents in complex environments.",
            "A new approach to three-way decisions making based on fractional fuzzy decision-theoretical rough set.",
            "Distance measure on intuitionistic fuzzy sets and its application in decision-making, pattern recognition, and clustering problems.",
            "Adaptive query relaxation and top-k result sorting of fuzzy spatiotemporal data based on XML.",
            "Exponentially-spider monkey optimization based allocation of resource in cloud.",
            "A fine-grained and traceable multidomain secure data-sharing model for intelligent terminals in edge-cloud collaboration scenarios.",
            "A multitarget backdooring attack on deep neural networks with random location trigger.",
            "Multi-scale graph capsule with influence attention for information cascades prediction.",
            "Fermatean fuzzy Heronian mean operators and MEREC-based additive ratio assessment method: An application to food waste treatment technology selection.",
            "Nowcasting influenza-like illness (ILI) via a deep learning approach using google search data: An empirical study on Taiwan ILI.",
            "Applications of computational intelligence-based systems for societal enhancement.",
            "A time-driven FCA-based approach for identifying students' dropout in MOOCs.",
            "A novel fuzzy-based structured framework for sustainable operation and environmental friendly production in coal-fired power industry.",
            "Using self-organising maps to predict and contain natural disasters and pandemics.",
            "Similarity-trust network for clustering-based consensus group decision-making model.",
            "Social-trust-aware variational recommendation.",
            "Boosting training for PDF malware classifier via active learning.",
            "Improving the understanding of cancer in a descriptive way: An emerging pattern mining-based approach.",
            "Choquet integral-based measures of economic welfare and species diversity.",
            "Comparing global news sentiment using hesitant linguistic terms.",
            "A fuzzy aspect-based approach for recommending hospitals.",
            "Environment adaptive deployment of water quality sensor networks.",
            "\"The following articles for this Special Issue were published before this collection was released. They can be found in their respective issues or online.\"."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2021",
        "info": "Volume 36, 2021",
        "count": 288,
        "papers": [
            "A decision support framework for security resource allocation under ambiguity.",
            "Cross lingual speech emotion recognition via triple attentive asymmetric convolutional neural network.",
            "An intelligent nonintrusive load monitoring scheme based on 2D phase encoding of power signals.",
            "Data security sharing model based on privacy protection for blockchain-enabled industrial Internet of Things.",
            "SAT-based and CP-based declarative approaches for Top-Rank-K closed frequent itemset mining.",
            "A portable HCI system-oriented EEG feature extraction and channel selection for emotion recognition.",
            "DSVD-autoencoder: A scalable distributed privacy-preserving method for one-class classification.",
            "A novel weight-derived method and its application in graduate students' physical health assessment.",
            "Conflict resolution using game theory and rough sets.",
            "Blockchain-based secure information sharing for supply chain management: Optimization assisted data sanitization process.",
            "Ontology of anomalous processes diagnosis.",
            "Ranking of Z-numbers based on value and ambiguity at levels of decision making.",
            "One-dimensional convolutional neural networks for high-resolution range profile recognition via adaptively feature recalibrating and automatically channel pruning.",
            "Z-uncertain probabilistic linguistic variables and its application in emergency decision making for treatment of COVID-19 patients.",
            "A time controlling neural network for time-varying QP solving with application to kinematics of mobile manipulators.",
            "Solution of an imperfect-quality EOQ model with backorder under fuzzy lock leadership game approach.",
            "A normal wiggly hesitant fuzzy MABAC method based on CCSD and prospect theory for multiple attribute decision making.",
            "Land-use dynamic discovery based on heterogeneous mobility sources.",
            "A new possibility degree measure for interval-valued q-rung orthopair fuzzy sets in decision-making.",
            "A new ranking technique for q-rung orthopair fuzzy values.",
            "A computational approach for predicting drug-target interactions from protein sequence and drug substructure fingerprint information.",
            "Erratum.",
            "A novel distance measure for intuitionistic fuzzy sets with diverse applications.",
            "Knowledge measure for the q-rung orthopair fuzzy sets.",
            "The emergence of explainability of intelligent systems: Delivering explainable and personalized recommendations for energy efficiency.",
            "Querying little is enough: Model inversion attack via latent information.",
            "Design and optimization of TS firefly algorithm based on the nonhomogeneous linear polygonal T-S fuzzy system.",
            "Towards automated grape vine pruning: Learning by example using recurrent graph neural networks.",
            "A novel dynamic weight allocation method for multisource information fusion.",
            "Kernel-based low-rank tensorized multiview spectral clustering.",
            "Trust-aware generative adversarial network with recurrent neural network for recommender systems.",
            "Multidimensional benchmarking of the active queue management methods of network congestion control based on extension of fuzzy decision by opinion score method.",
            "Double hierarchy linguistic term set and its extensions: The state-of-the-art survey.",
            "Multiple attribute decision making problem using GRA method with incomplete weight information based on picture hesitant fuzzy setting.",
            "Learning decision trees for the partial label ranking problem.",
            "A novel hybrid algorithm for solving emerging electricity market pricing problem of microgrid.",
            "An approach of covert communication based on the Ethereum whisper protocol in blockchain.",
            "Development of new operators for expert opinions aggregation: Average-induced ordered weighted averaging operators.",
            "A variable weight-based hybrid approach for multi-attribute group decision making under interval-valued intuitionistic fuzzy sets.",
            "Analyzing host security using D-S evidence theory and multisource information fusion.",
            "A reinforcement learning-based approach for modeling and coverage of an unknown field using a team of autonomous ground vehicles.",
            "A novel hybrid augmented loss discriminator for text-to-image synthesis.",
            "Feature selection for high-dimensional regression via sparse LSSVR based on Lp-norm.",
            "Cover: International Journal of Intelligent Systems, Volume 36 Issue 3 March 2021.",
            "Tight bounds for the existence of path factors in network vulnerability parameter settings.",
            "A rules-firing strength-based neuro-fuzzy observer for information-poor systems.",
            "ImpSuic: A quality updating rule in mixing coins with maximum utilities.",
            "TODIM method for multiple attribute group decision making based on cumulative prospect theory with 2-tuple linguistic neutrosophic sets.",
            "Pythagorean fuzzy C-means algorithm for image segmentation.",
            "A measure of probabilistic hesitant I-fuzzy sets and decision makings for strategy choice.",
            "Discrete farmland fertility optimization algorithm with metropolis acceptance criterion for traveling salesman problems.",
            "Measurements and statistical analyses of electromagnetic noise for industrial wireless communications.",
            "A machine learning-based risk scoring system for infertility considering different age groups.",
            "A deep transfer-learning-based dynamic reinforcement learning for intelligent tightening system.",
            "Properties and comparison of andness-characterized aggregators.",
            "Intuitionistic fuzzy statistical correlation algorithm with applications to multicriteria-based decision-making processes.",
            "Risk assessment on multimodal transport network based on quality function deployment.",
            "Camdar-adv: Generating adversarial patches on 3D object.",
            "A novel approach to multi-attribute group decision making based on power neutrality aggregation operator for q-rung orthopair fuzzy sets.",
            "A decision-making methodology based on the weighted correlation coefficient in weighted extended hesitant fuzzy environments.",
            "A family of similarity measures for q-rung orthopair fuzzy sets and their applications to multiple criteria decision making.",
            "Multiobjective portfolio optimization using coherent fuzzy numbers in a credibilistic environment.",
            "A fuzzy control system for energy-efficient wireless devices in the Internet of vehicles.",
            "How fair can we go in machine learning? Assessing the boundaries of accuracy and fairness.",
            "Revisiting the approximated weight extraction methods in fuzzy analytic hierarchy process.",
            "Privacy preservation for image data: A GAN-based method.",
            "Knowledge modeling: A survey of processes and techniques.",
            "Measuring total uncertainty in evidence theory.",
            "Decision making viva genetic algorithm for the utilization of leftovers.",
            "Matrix games with dense fuzzy payoffs.",
            "Complex intuitionistic fuzzy preference relations and their applications in individual and group decision-making problems.",
            "Ordering single-valued neutrosophic numbers based on flexibility parameters and its reasonable properties.",
            "Multisource basic probability assignment fusion based on information quality.",
            "Interplay between symmetry, convexity and negation of a probability distribution.",
            "Cover: International Journal of Intelligent Systems, Volume 36 Issue 5 May 2021.",
            "CSRT rumor spreading model based on complex network.",
            "Conflicting management of evidence combination from the point of improvement of basic probability assignment.",
            "CPT-TODIM method for bipolar fuzzy multi-attribute group decision making and its application to network security service provider selection.",
            "Development and application of machine learning-based prediction model for distillation column.",
            "Reasoning and querying bounds on differences with layered preferences.",
            "A dual-stage attention-based Conv-LSTM network for spatio-temporal correlation and multivariate time series prediction.",
            "A two-stage privacy protection mechanism based on blockchain in mobile crowdsourcing.",
            "Fighting fire with fire: A spatial-frequency ensemble relation network with generative adversarial learning for adversarial image classification.",
            "A Pythagorean fuzzy Petri net based security assessment model for civil aviation airport security inspection information system.",
            "Strategies on admissible total orders over typical hesitant fuzzy implications applied to decision making problems.",
            "When blockchain meets AI: Optimal mining strategy achieved by machine learning.",
            "Axiomatization and construction of orness measures for aggregation functions.",
            "q-Rung orthopair fuzzy decision-making framework for integrating mobile edge caching scheme preferences.",
            "New concepts for cluster construction and similarity measurement.",
            "Evaluation of startup companies using multicriteria decision making based on hesitant fuzzy linguistic information envelopment analysis models.",
            "Adversarial retraining attack of asynchronous advantage actor-critic based pathfinding.",
            "Hydrological cycling optimization-based multiobjective feature-selection method for customer segmentation.",
            "GnIOWA operators and some weights allocation methods with their properties.",
            "A fully connected deep learning approach to upper limb gesture recognition in a secure FES rehabilitation environment.",
            "Intelligent deception techniques against adversarial attack on the industrial system.",
            "Organic solar cells defects classification by using a new feature extraction algorithm and an EBNN with an innovative pruning algorithm.",
            "Describing video scenarios using deep learning techniques.",
            "Descriptive prediction of drug side-effects using a hybrid deep learning model.",
            "Learning to disentangle emotion factors for facial expression recognition in the wild.",
            "Model-free attitude synchronization for multiple heterogeneous quadrotors via reinforcement learning.",
            "TODIM method based on cumulative prospect theory for multiple attribute group decision-making under 2-tuple linguistic Pythagorean fuzzy environment.",
            "Power-average-operator-based hybrid multiattribute online product recommendation model for consumer decision-making.",
            "Equipment deterioration modeling and cause diagnosis in semiconductor manufacturing.",
            "Simplified bacterial foraging optimization with quorum sensing for global optimization.",
            "Pythagorean fuzzy likelihood function based on beta distributions and its based dominance ordering model in an uncertain multiple criteria decision support framework.",
            "An intelligent decision support system for software plagiarism detection in academia.",
            "New proofs of ownership for efficient data deduplication in the adversarial conspiracy model.",
            "Interval-valued equivalence measures respecting uncertainty in image processing.",
            "Imbalance deep multi-instance learning for predicting isoform-isoform interactions.",
            "Linguistic Einstein aggregation operator-based TOPSIS for multicriteria group decision making in linguistic Pythagorean fuzzy environment.",
            "Smart power consumption abnormality detection in buildings using micromoments and improved K-nearest neighbors.",
            "On investigation of the Bayesian anomaly in multiple imprecise dependent information aggregation for system reliability evaluation.",
            "Nonparametric fuzzy hypothesis testing for quantiles applied to clinical characteristics of COVID-19.",
            "Pythagorean fuzzy weighted discrimination-based approximation approach to the assessment of sustainable bioenergy technologies for agricultural residues.",
            "Partial multiview clustering with locality graph regularization.",
            "Determining the location of isolation hospitals for COVID-19 via Delphi-based MCDM method.",
            "Entropy-based hybrid sampling ensemble learning for imbalanced data.",
            "Ensemble- and distance-based feature ranking for unsupervised learning.",
            "Enhancing intrusion detection with feature selection and neural network.",
            "CN- q -ROFS: Connection number-based q-rung orthopair fuzzy set and their application to decision-making process.",
            "Class mean-weighted discriminative collaborative representation for classification.",
            "An attention-based category-aware GRU model for the next POI recommendation.",
            "A novel corpus-based computing method for handling critical word-ranking issues: An example of COVID-19 research articles.",
            "Missing the missing values: The ugly duckling of fairness in machine learning.",
            "Model-based diagnosis with uncertain observations.",
            "Dual hesitant q-rung orthopair fuzzy Dombi t-conorm and t-norm based Bonferroni mean operators for solving multicriteria group decision making problems.",
            "A single-valued neutrosophic multicriteria group decision approach with DPL-TOPSIS method based on optimization.",
            "Group decision support methodology based upon the multigranular generalized orthopair 2-tuple linguistic information model.",
            "An early warning model for customer churn prediction in telecommunication sector based on improved bat algorithm to optimize ELM.",
            "Advertising through UAVs: Optimized path system for delivering smart real-estate advertisement materials.",
            "A novel approach to MADM problems using Fermatean fuzzy Hamacher aggregation operators.",
            "The decision-making of optimal equity and capital structure based on dynamical risk profiles: A Langevin system framework for SME growth.",
            "An overview of ARAS method: Theory development, application extension, and future challenge.",
            "Multiobjective fuzzy vehicle routing using Twitter data: Reimagining the delivery of essential goods.",
            "Semi-selfish mining based on hidden Markov decision process.",
            "Volumetric fuzzy set and its application in optimization problems.",
            "Cover: International Journal of Intelligent Systems, Volume 36 Issue 8 August 2021.",
            "A rough-Z-number-based DEMATEL to evaluate the co-creative sustainable value propositions for smart product-service systems.",
            "Required mathematical properties and behaviors of uncertainty measures on belief intervals.",
            "A comprehensive study of upward fuzzy preference relation based fuzzy rough set models: Properties and applications in treatment of coronavirus disease.",
            "Source data-free domain adaptation of object detector through domain-specific perturbation.",
            "Positive unlabeled learning-based anomaly detection in videos.",
            "Secured cross-layer cross-domain routing in dense wireless sensor network: A new hybrid based clustering approach.",
            "Assessment of cloud vendors using interval-valued probabilistic linguistic information and unknown weights.",
            "CyberPulse++: A machine learning-based security framework for detecting link flooding attacks in software defined networks.",
            "Semantic data mining in the information age: A systematic review.",
            "Linguistic single-valued neutrosophic soft sets with applications in game theory.",
            "Deep semi-supervised classification based in deep clustering and cross-entropy.",
            "Competitive behavior induced OWA operator and the weighting method.",
            "An improved random forest algorithm and its application to wind pressure prediction.",
            "Learning to learn by yourself: Unsupervised meta-learning with self-knowledge distillation for COVID-19 diagnosis from pneumonia cases.",
            "Exploring the effects of computational costs in extensive games via modeling and simulation.",
            "An intelligent system of pelvic lymph node detection.",
            "Prospect-theory and geometric distance measure-based Pythagorean cubic fuzzy multicriteria decision-making.",
            "Dynamic coarse-to-fine ISAR image blind denoising using active joint prior learning.",
            "Hospital admission and care of COVID-19 patients problem based on spherical hesitant fuzzy decision support system.",
            "Basic probability assignment to probability distribution function based on the Shapley value approach.",
            "Fuzzy decision trees embedded with evolutionary fuzzy clustering for locating users using wireless signal strength in an indoor environment.",
            "Finding therapeutic music for anxiety using scoring model.",
            "A spatial domain-based color image blind watermarking scheme integrating multilevel discrete Hartley transform.",
            "An efficient firefly algorithm based on modified search strategy and neighborhood attraction.",
            "Belief interval interpretation of probabilistic linguistic term sets and a visual method for solving the preference problem in multicriteria group decision making.",
            "Network vulnerability parameter and results on two surfaces.",
            "A new approach of bipolar valued fuzzy set theory applied on semigroups.",
            "Direct and indirect reinforcement learning.",
            "A novel intelligent system for securing cash levels using Markov random fields.",
            "Cover: International Journal of Intelligent Systems, Volume 36 Issue 9 September 2021.",
            "Driving control based on bilevel optimization and fuzzy logic.",
            "An MAGDM approach with q -rung orthopair trapezoidal fuzzy information for waste disposal site selection problem.",
            "A consensus reaching process for large-scale group decision making with heterogeneous preference information.",
            "IEGA: An improved elitism-based genetic algorithm for task scheduling problem in fog computing.",
            "A novel method based on probabilistic linguistic term sets and its application in ranking products through online ratings.",
            "Generalized MULTIMOORA method and Dombi prioritized weighted aggregation operators based on T-spherical fuzzy sets and their applications.",
            "Improved strength Pareto evolutionary algorithm based on reference direction and coordinated selection strategy.",
            "Interval type 2 trapezoidal-fuzzy weighted with zero inconsistency combined with VIKOR for evaluating smart e-tourism applications.",
            "A new correlation coefficient of BPA based on generalized information quality.",
            "Single-network ADP for solving optimal event-triggered tracking control problem of completely unknown nonlinear systems.",
            "An improved DEMATEL method for multigranular hesitant fuzzy linguistic environment.",
            "Quantum inspired meta-heuristic approaches for automatic clustering of colour images.",
            "Hybrid evolutionary intelligent system and hybrid time series econometric model for stock price forecasting.",
            "Task bundling in worker-centric mobile crowdsensing.",
            "An integrated multicriteria decision-making approach for distribution system expansion planning.",
            "A lightweight 3D convolutional neural network for deepfake detection.",
            "A novel nonlinear causal inference approach using vector-based belief rule base.",
            "Information integration and instruction authoring of augmented assembly systems.",
            "Exploring the redaction mechanisms of mutable blockchains: A comprehensive survey.",
            "Machine learning for medical imaging-based COVID-19 detection and diagnosis.",
            "Optimal feature selection based speech emotion recognition using two-stream deep convolutional neural network.",
            "Topology and channel affinity reinforced global attention for person re-identification.",
            "An effective framework for semistructured document classification via hierarchical attention model.",
            "SmartStore: A blockchain and clustering based intelligent edge storage system with fairness and resilience.",
            "Advanced evasion attacks and mitigations on practical ML-based phishing website classifiers.",
            "Recognition method of traffic violations based on complex interaction between multiple entities.",
            "Hesitant Mahalanobis distance with applications to estimating the optimal number of clusters.",
            "Rotational multipyramid network with bounding-box transformation for object detection.",
            "Model-based evaluation for online shopping platform with probabilistic double hierarchy linguistic CODAS method.",
            "Optimization of electric vehicles charging station deployment by means of evolutionary algorithms.",
            "Multiplicative consistency analysis of linguistic preference relation with self-confidence level and self-doubting level and its application in a group decision making.",
            "Intuitionistic fuzzy decision-making in the framework of Dempster-Shafer structures.",
            "Modeling microscopic and macroscopic information diffusion for rumor detection.",
            "Hysteresis compensation and adaptive control based evolutionary neural networks for piezoelectric actuator.",
            "Why do we need q-rung orthopair fuzzy sets? Some evidence established via mass assignment.",
            "New internal clustering validation measure for contiguous arbitrary-shape clusters.",
            "Solution of a pollution sensitive supply chain model under fuzzy approximate reasoning.",
            "Single-valued neutrosophic similarity measure-based additive ratio assessment framework for optimal site selection of electric vehicle charging station.",
            "Integration of logistic regression and multilayer perceptron for intelligent single and dual axis solar tracking systems.",
            "Evaluation of MOOCs based on multigranular unbalanced hesitant fuzzy linguistic MABAC method.",
            "An approach to probabilistic hesitant fuzzy risky multiattribute decision making with unknown probability information.",
            "Average utility driven data analytics on damped windows for intelligent systems with data streams.",
            "Hybrid sequence-based Android malware detection using natural language processing.",
            "Ordering intuitionistic fuzzy numbers by a convex combination of values and multiple of ambiguity inclusion functions with ambiguities of membership and nonmembership functions.",
            "Intelligent optimization for charging scheduling of electric vehicle using exponential Harris Hawks technique.",
            "SPLSN: An efficient tool for survival analysis and biomarker selection.",
            "Evidential Fermatean fuzzy multicriteria decision-making based on Fermatean fuzzy entropy.",
            "Artificial gorilla troops optimizer: A new nature-inspired metaheuristic algorithm for global optimization problems.",
            "Modeling communication of collaborative multiagent system under epistemic planning.",
            "Delay optimization for ternary fixed polarity Reed-Muller circuits based on multilevel adaptive quantum genetic algorithm.",
            "Fractional-Harris hawks optimization-based generative adversarial network for osteosarcoma detection using Renyi entropy-hybrid fusion.",
            "Evaluating biological inspiration for biologically inspired design: An integrated DEMATEL-MAIRCA based on fuzzy rough numbers.",
            "Solution of matrix games with rough interval pay-offs and its application in the telecom market share problem.",
            "A parallel learning particle swarm optimizer for inverse kinematics of robotic manipulator.",
            "An axiomatically supported divergence measures for q-rung orthopair fuzzy sets.",
            "Scalable feature selection using ReliefF aided by locality-sensitive hashing.",
            "Pythagorean fuzzy multiattribute group decision making based on risk attitude and evidential reasoning methodology.",
            "Trusted audit with untrusted auditors: A decentralized data integrity Crowdauditing approach based on blockchain.",
            "Meta-learning and the new challenges of machine learning.",
            "Exploiting abstractions for grammar-based learning of complex multi-agent behaviours.",
            "Three-dimensional feature maps and convolutional neural network-based emotion recognition.",
            "Intuitionistic fuzzy MABAC method based on cumulative prospect theory for multiple attribute group decision making.",
            "A consensus model for group decision making with self-confident linguistic preference relations.",
            "Assessment and selection of smart agriculture solutions using an information error-based Pythagorean fuzzy cloud algorithm.",
            "Security investment of interdependent and identical CPSs: Stochastic games with asymmetric information.",
            "Stock selection multicriteria decision-making method based on elimination and choice translating reality I with Z-numbers.",
            "An intelligent framework for end-to-end rockfall detection.",
            "Taylor-RNet: An approach for image forgery detection using Taylor-adaptive rag-bull rider-based deep convolutional neural network.",
            "Interval numbers BONr, q-OWA operator and its application to multiattribute decision-making.",
            "Cybernetics approaches in intelligent systems for crops disease detection with the aid of IoT.",
            "Nonlinear preferences in group decision-making. Extreme values amplifications and extreme values reductions.",
            "A new method for deriving priority from dual hesitant fuzzy preference relations.",
            "Hybridizations of generalized Dombi operators and Bonferroni mean operators under dual probabilistic linguistic environment for group decision-making.",
            "Fly visual evolutionary neural network solving large-scale global optimization.",
            "Enhancing the association in multi-object tracking via neighbor graph.",
            "RGAN: Rethinking generative adversarial networks for cloud removal.",
            "Intelligent optimization of dynamic traffic light control via diverse optimization priorities.",
            "Developing an ML pipeline for asthma and COPD: The case of a Dutch primary care service.",
            "Social event planning using hybrid pairwise Markov random fields.",
            "Occupational health and safety risk assessment using an integrated TODIM-PROMETHEE model under linguistic spherical fuzzy environment.",
            "Extended TODIM method based on VIKOR for q-rung orthopair fuzzy information measures and their application in MAGDM problem of medical consumption products.",
            "An integrated method for multiattribute group decision making with probabilistic linguistic term sets.",
            "Value-based potentials: Exploiting quantitative information regularity patterns in probabilistic graphical models.",
            "Improving the emotion-based classification by exploiting the fuzzy entropy in FCM clustering.",
            "Optimal design of low computational burden model predictive control based on SSDA towards autonomous vehicle under vision dynamics.",
            "Cover: International Journal of Intelligent Systems, Volume 36 Issue 12 December 2021.",
            "Geometric rectification-based neural network architecture for image manipulation detection.",
            "A novel trust architecture integrating differentiated trust and response strategies for a team of agents.",
            "JND-aware robust image watermarking with tri-directional inter-block correlation.",
            "A stacked autoencoder-based convolutional and recurrent deep neural network for detecting cyberattacks in interconnected power control systems.",
            "Improved autoencoder for unsupervised anomaly detection.",
            "Modeling behavior of FRP-confined concrete by Jacobi-fuzzy time series method.",
            "Taylor-HHO algorithm: A hybrid optimization algorithm with deep long short-term for malicious JavaScript detection.",
            "Cost-effective multi-instance multilabel active learning.",
            "MR-DCAE: Manifold regularization-based deep convolutional autoencoder for unauthorized broadcasting identification.",
            "Some generalized q-rung orthopair fuzzy Einstein interactive geometric aggregation operators with improved operational laws.",
            "Group decision making with incomplete interval-valued q-rung orthopair fuzzy preference relations.",
            "A novel multicriteria decision-making approach with unknown weight information under q-rung orthopair fuzzy environment.",
            "Analyzing fusion of regularization techniques in the deep learning-based intrusion detection system.",
            "Online human action recognition with spatial and temporal skeleton features using a distributed camera network.",
            "Generalized two-tailed hypothesis testing for quantiles applied to the psychosocial status during the COVID-19 pandemic.",
            "Combining conflicting evidence based on Pearson correlation coefficient and weighted graph.",
            "Opponent portrait for multiagent reinforcement learning in competitive environment.",
            "Practical wildcard searchable encryption with tree-based index.",
            "Multiple kernel clustering with late fusion consensus local graph preserving.",
            "Optimized score function and its application in group multiattribute decision making based on fuzzy neutrosophic sets.",
            "A fast evidential approach for stock forecasting.",
            "Carbon emission sensitive deteriorating inventory model with trade credit under volumetric fuzzy system.",
            "Deep learning and mobile control system for hazardous materials transportation.",
            "Improving trend reversal estimation in forex markets under a directional changes paradigm with classification algorithms.",
            "A novel ameliorated Harris hawk optimizer for solving complex engineering optimization problems.",
            "Comparison between deep learning and fully connected neural network in performance prediction of power cycles: Taking supercritical CO2 Brayton cycle as an example.",
            "Generalized hesitant fuzzy numbers: Introducing, arithmetic operations, aggregation operators, and an application.",
            "Three-way decisions based on some Hamacher aggregation operators under double hierarchy linguistic environment.",
            "Robot target recognition using deep federated learning.",
            "Probabilistic linguistic q-rung orthopair fuzzy Generalized Dombi and Bonferroni mean operators for group decision-making with unknown weights of experts.",
            "Construction and generation of distance and similarity measures for intuitionistic fuzzy sets and various applications.",
            "Multidimensional continuous time Bayesian network classifiers.",
            "A hybrid intelligent service recommendation by latent semantics and explicit ratings.",
            "Uncertainty-aware network alignment.",
            "Frank aggregation operators and analytic hierarchy process based on interval-valued picture fuzzy sets and their applications."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2020",
        "info": "Volume 35, 2020",
        "count": 79,
        "papers": [
            "Power partitioned Heronian mean operators for q-rung orthopair uncertain linguistic sets with their application to multiattribute group decision making.",
            "Multiplicative consistency analysis for q-rung orthopair fuzzy preference relation.",
            "Extension of Yager's negation of a probability distribution based on Tsallis entropy.",
            "An association coefficient of a belief function and its application in a target recognition system.",
            "Linguistic Z-number fuzzy soft sets and its application on multiple attribute group decision making problems.",
            "Confidence levels q-rung orthopair fuzzy aggregation operators and its applications to MCDM problems.",
            "Pythagorean fuzzy interaction power Bonferroni mean aggregation operators in multiple attribute decision making.",
            "Some q-rung orthopair fuzzy 2-tuple linguistic Muirhead mean aggregation operators and their applications to multiple-attribute group decision making.",
            "Linguistic q-rung orthopair fuzzy sets and their interactional partitioned Heronian mean aggregation operators.",
            "Quantile-induced vector-based heavy OWA operator and the application in dynamic decision making.",
            "Quantum model of mass function.",
            "Modeling agent-based consumers decision-making with 2-tuple fuzzy linguistic perceptions.",
            "Pythagorean fuzzy linguistic Muirhead mean operators and their applications to multiattribute decision-making.",
            "Associated probabilities' aggregations in interactive multiattribute decision making for q-rung orthopair fuzzy discrimination environment.",
            "Marginal contribution representation of capacity-based multicriteria decision making.",
            "SMAA-QUALIFLEX methodology to handle multicriteria decision-making problems based on q-rung fuzzy set with hierarchical structure of criteria using bipolar Choquet integral.",
            "A normal wiggly hesitant fuzzy linguistic projection-based multiattributive border approximation area comparison method.",
            "The minimum cost consensus model considering the implicit trust of opinions similarities in social network group decision-making.",
            "Consensus reaching process for fuzzy behavioral TOPSIS method with probabilistic linguistic q-rung orthopair fuzzy set based on correlation measure.",
            "Probabilistic linguistic information fusion: A survey on aggregation operators in terms of principles, definitions, classifications, applications, and challenges.",
            "Some realizations and instances of Yager prioritized preference frame with application in evaluation and decision making.",
            "q-Rung orthopair fuzzy soft average aggregation operators and their application in multicriteria decision-making.",
            "An epsilon-constraint method for fully fuzzy multiobjective linear programming.",
            "Some picture fuzzy Bonferroni mean operators with their application to multicriteria decision making.",
            "Interval 2-tuple Pythagorean fuzzy linguistic MULTIMOORA method with CIA and their application to MCGDM.",
            "On some correlation coefficients in Pythagorean fuzzy environment with applications.",
            "Multiple attribute group decision-making based on order-α divergence and entropy measures under q-rung orthopair fuzzy environment.",
            "Storing and querying fuzzy RDF(S) in HBase databases.",
            "A decision-making algorithm for online shopping using deep-learning-based opinion pairs mining and q-rung orthopair fuzzy interaction Heronian mean operators.",
            "Pythagorean linguistic preference relations and their applications to group decision making using group recommendations based on consistency matrices and feedback mechanism.",
            "Density estimates on the unit simplex and calculation of the mode of a sample.",
            "A modified soft-likelihood function based on POWA operator.",
            "Generalization and extension of partitioned Bonferroni mean operator to model optional prerequisites.",
            "A self-adaptive synthetic over-sampling technique for imbalanced classification.",
            "A vector and geometry interpretation of basic probability assignment in Dempster-Shafer theory.",
            "Entailment for intuitionistic fuzzy sets based on generalized belief structures.",
            "New multicriteria group decision support systems for small hydropower plant locations selection based on intuitionistic cubic fuzzy aggregation information.",
            "An extended COPRAS method for multiattribute group decision making based on dual hesitant fuzzy Maclaurin symmetric mean.",
            "Enhancing PROMETHEE method with intuitionistic fuzzy soft sets.",
            "Canonical decomposition of dichotomous basic belief assignment.",
            "Sensor fusion based on Dempster-Shafer theory of evidence using a large scale group decision making approach.",
            "Basic theory of line integrals under the q-rung orthopair fuzzy environment and their applications.",
            "Correlation coefficients of dual type-2 hesitant fuzzy sets and their applications in clustering analysis.",
            "Decision making with probabilistic hesitant fuzzy information based on multiplicative consistency.",
            "PrivateDL PrivateDL : Privacy-preserving collaborative deep learning against leakage from gradient sharing.",
            "An application of interval differential equation on a production inventory model with interval-valued demand via center-radius optimization technique and particle swarm optimization.",
            "Spherical fuzzy extension of DEMATEL (SF-DEMATEL).",
            "A novel entropy proposition for spherical fuzzy sets and its application in multiple attribute decision-making.",
            "Multilabel classification by exploiting data-driven pair-wise label dependence.",
            "Adversarial attacks on text classification models using layer-wise relevance propagation.",
            "Optimal control of distributed multiagent systems with finite-time group flocking.",
            "An efficient framework for generating robust adversarial examples.",
            "Defense against adversarial attacks by low-level image transformations.",
            "The dilemma between arc and bounds consistency.",
            "Private rank aggregation under local differential privacy.",
            "An intelligent EGWO-SCA-CS algorithm for PSS parameter tuning under system uncertainties.",
            "The multiobjective stochastic CRITIC-TOPSIS approach for solving the shipboard crane selection problem.",
            "Emergency decision support modeling for COVID-19 based on spherical fuzzy information.",
            "Uncertainty measures for probabilistic hesitant fuzzy sets in multiple criteria decision making.",
            "Discovering genomic patterns in SARS-CoV-2 variants.",
            "Efficiently mining erasable stream patterns for intelligent systems over uncertain data.",
            "IPBSM: An optimal bribery selfish mining in the presence of intelligent and pure attackers.",
            "Complex q-rung orthopair fuzzy 2-tuple linguistic Maclaurin symmetric mean operators and its application to emergency program selection.",
            "An efficient secure k nearest neighbor classification protocol with high-dimensional features.",
            "A method for combining conflicting evidences with improved distance function and Tsallis entropy.",
            "Garra Rufa-inspired optimization technique.",
            "Optimal design of nonlinear model predictive controller based on new modified multitracker optimization algorithm.",
            "A benchmark for clothes variation in person re-identification.",
            "A game-theoretic approach of mixing different qualities of coins.",
            "Undergraduate teaching audit and evaluation using an extended MABAC method under q-rung orthopair fuzzy environment.",
            "A novel fuzzy hybrid neutrosophic decision-making approach for the resilient supplier selection problem.",
            "DeepEC: An error correction framework for dose prediction and organ segmentation using deep neural networks.",
            "Pythagorean fuzzy combined compromise solution method integrating the cumulative prospect theory and combined weights for cold chain logistics distribution center selection.",
            "Optimal mixed block withholding attacks based on reinforcement learning.",
            "Interval-valued Pythagorean fuzzy linguistic TODIM based on PCA and its application for emergency decision.",
            "Video frame interpolation via optical flow estimation with image inpainting.",
            "Machine learning assisted OSP approach for improved QoS performance on 3D charge-trap based SSDs.",
            "Entropy-based shadowed set approximation of intuitionistic fuzzy sets.",
            "A novel TODIM-VIKOR approach based on entropy and Jensen-Tsalli divergence measure for picture fuzzy sets in a decision-making problem."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2019",
        "info": "Volume 34, 2019",
        "count": 142,
        "papers": [
            "Bonferroni means with induced ordered weighted average operators.",
            "A ranking method for multiple attribute decision-making problems based on the possibility degrees of trapezoidal intuitionistic fuzzy numbers.",
            "Application of uninorms to market basket analysis.",
            "Some q-rung orthopair fuzzy maclaurin symmetric mean operators and their applications to potential evaluation of emerging technology commercialization.",
            "New logarithmic operational laws and their aggregation operators for Pythagorean fuzzy set and their applications.",
            "International Journal of Intelligent Systems.",
            "Multiple criteria decision analysis under complex uncertainty: A Pearson-like correlation-based Pythagorean fuzzy compromise approach.",
            "Partitioned Bonferroni mean based on two-dimensional uncertain linguistic variables for multiattribute group decision making.",
            "An integrated MCDM method for robot selection under interval-valued Pythagorean uncertain linguistic environment.",
            "Generalized intuitionistic fuzzy soft power aggregation operator based on t-norm and their application in multicriteria decision-making.",
            "Probabilistic bipartition interaction index of multiple decision criteria associated with the nonadditivity of fuzzy measures.",
            "Linguistic-induced ordered weighted averaging operator for multiple attribute group decision-making.",
            "Pythagorean fuzzy multiple criteria decision analysis based on Shapley fuzzy measures and partitioned normalized weighted Bonferroni mean operator.",
            "Score-hesitation trade-off and portfolio selection under intuitionistic fuzzy environment.",
            "The ordered weighted average in the theory of expertons.",
            "An efficient evolutionary algorithm to optimize the Choquet integral.",
            "Behavioral ordered weighted averaging operator and the application in multiattribute decision making.",
            "Towards adaptive maps.",
            "Detection of outlier information by the use of linguistic summaries based on classic and interval-valued fuzzy sets.",
            "New q-rung orthopair fuzzy partitioned Bonferroni mean operators and their application in multiple attribute decision making.",
            "Learning the stress function pattern of ordered weighted average aggregation using DBSCAN clustering.",
            "Spherical aggregation operators and their application in multiattribute group decision-making.",
            "Induced cluster-based OWA operators with reliability measures and the application in group decision-making.",
            "Online cluster validity indices for performance monitoring of streaming data clustering.",
            "Correlation and correlation coefficient of generalized orthopair fuzzy sets.",
            "A new divergence measure for basic probability assignment and its applications in extremely uncertain environments.",
            "Hesitant Pythagorean fuzzy Maclaurin symmetric mean operators and its applications to multiattribute decision-making process.",
            "Interval-valued probabilistic hesitant fuzzy set and its application in the Arctic geopolitical risk evaluation.",
            "Multiple-attribute group decision-making based on power Bonferroni operators of linguistic q-rung orthopair fuzzy numbers.",
            "A novel matrix game with payoffs of Maxitive Belief Structure.",
            "Research on arithmetic operations over generalized orthopair fuzzy sets.",
            "Generalized attitudinal Choquet integral.",
            "Hesitant interval-valued Pythagorean fuzzy VIKOR method.",
            "SUOWA operators: A review of the state of the art.",
            "A new procedure for hesitant multiplicative preference relations.",
            "Elliptical distribution-based weight-determining method for ordered weighted averaging operators.",
            "Fermatean fuzzy linguistic set and its application in multicriteria decision making.",
            "Pythagorean fuzzy average aggregation operators based on generalized and group-generalized parameter with application in MCDM problems.",
            "Analysis of self-confidence indices-based additive consistency for fuzzy preference relations with self-confidence and its application in group decision making.",
            "Embedding OWA under preference ranking for DEA cross-efficiency aggregation: Issues and procedures.",
            "Maximum entropy ordered weighted averaging in the binomial decomposition framework.",
            "Multiattribute group decision-making based on Pythagorean fuzzy Einstein prioritized aggregation operators.",
            "Dual concepts in fuzzy theory: Entropy and knowledge measure.",
            "The interval-valued hesitant Pythagorean fuzzy set and its applications with extended TOPSIS and Choquet integral-based method.",
            "A method for fuzzy quantified querying over fuzzy Resource Description Framework graph.",
            "Pythagorean fuzzy TOPSIS for multicriteria group decision-making with unknown weight information through entropy measure.",
            "Multi-attribute group decision-making methods based on q-rung orthopair fuzzy linguistic sets.",
            "The generalized Dice similarity measures for Pythagorean fuzzy multiple attribute group decision making.",
            "Variance measures with ordered weighted aggregation operators.",
            "Eliciting and measuring hesitance in decision-making.",
            "The acclamation consensus state and an associated ranking rule.",
            "Uncertainty and negation - Information theoretic applications.",
            "Dealing with incomplete information in linguistic group decision making by means of Interval Type-2 Fuzzy Sets.",
            "Similarity measures, penalty functions, and fuzzy entropy from new fuzzy subsethood measures.",
            "Pythagorean fuzzy Bonferroni means based on T-norm and its dual T-conorm.",
            "A new probability transformation method based on a correlation coefficient of belief functions.",
            "Monte Carlo integration for Choquet integral.",
            "Multicriteria decision-making using Archimedean aggregation operators in Pythagorean hesitant fuzzy environment.",
            "Single variable differential calculus under q-rung orthopair fuzzy environment: Limit, derivative, chain rules, and its application.",
            "Pythagorean fuzzy preference ranking organization method of enrichment evaluations.",
            "A new distance measure based on the weighted induced method and its application to Pythagorean fuzzy multiple attribute group decision making.",
            "Group decision-making based on pythagorean fuzzy TOPSIS method.",
            "Operators and comparisons of probabilistic linguistic term sets.",
            "A lightweight clustering-based approach to discover different emotional shades from social message streams.",
            "Attitudinal choice models with applications in human decision making.",
            "Dependent evidence combination based on decision-making trial and evaluation laboratory method.",
            "Some cosine similarity measures and distance measures between q-rung orthopair fuzzy sets.",
            "Research on the assessment of classroom teaching quality with q-rung orthopair fuzzy information based on multiparametric similarity measure and combinative distance-based assessment.",
            "On interval-valued fuzzy decision-making using soft likelihood functions.",
            "Aggregation of uncertainty data based on ordered weighting aggregation and generalized information quality.",
            "A new approach for emergency decision-making based on zero-sum game with Pythagorean fuzzy uncertain linguistic variables.",
            "Rank-based analysis method to determine OWA weights and its application in group decision making.",
            "Pythagorean fuzzy preference relations and their applications in group decision-making systems.",
            "Group decision making based on Dombi operators and its application to personnel evaluation.",
            "Nonadditive robust ordinal regression with nonadditivity index and multiple goal linear programming.",
            "Multiple-attribute group decision-making method of linguistic q-rung orthopair fuzzy power Muirhead mean operators based on entropy weight.",
            "Information measures for q-rung orthopair fuzzy sets.",
            "Two-tuple linguistic utility aggregation operator and its applications to group decision-making.",
            "An interindividual iterative consensus model for fuzzy preference relations.",
            "On the orness of Bonferroni mean and its variants.",
            "Bidirectional project method for dual hesitant Pythagorean fuzzy multiple attribute decision-making and their application to performance assessment of new rural construction.",
            "Virtual learning environment to predict withdrawal by leveraging deep learning.",
            "Hesitant fuzzy best-worst multi-criteria decision-making method and its applications.",
            "TDBF: Two-dimensional belief function.",
            "Prioritized aggregation operators based on the priority degrees in multicriteria decision-making.",
            "Pythagorean fuzzy Dombi aggregation operators and its applications in multiple attribute decision-making.",
            "Set-based extended aggregation functions.",
            "Signed distance ranking based approach for solving bounded interval-valued fuzzy numbers linear programming problems.",
            "A novel multiple-attribute group decision-making method based on q-rung orthopair fuzzy generalized power weighted aggregation operators.",
            "The distance measures between q-rung orthopair hesitant fuzzy sets and their application in multiple criteria decision making.",
            "The sign test and the signed-rank test for interval-valued data.",
            "Additive consistency-based priority-generating method of q-rung orthopair fuzzy preference relation.",
            "Quantile-induced uncertain heavy ordered weighted averaging operator and the application in incentive evaluation problems.",
            "Trapezoidal Pythagorean fuzzy linguistic entropic combined ordered weighted Minkowski distance operator based on preference relations.",
            "On intuitionistic fuzzy decision-making using soft likelihood functions.",
            "Real-time force doors detection system using distributed sensors and neural networks.",
            "A new matrix game with payoffs of generalized Dempster-Shafer structures.",
            "Evidence combination using OWA-based soft likelihood functions.",
            "A novel ordered weighted averaging weight determination based on ordinal dispersion.",
            "Some results on information measures for complex intuitionistic fuzzy sets.",
            "Generalized orthopair fuzzy weighted distance-based approximation (WDBA) algorithm in emergency decision-making.",
            "An approach towards decision making and shortest path problems using the concepts of interval-valued Pythagorean fuzzy information.",
            "Some q-rung orthopair fuzzy Hamy mean operators in multiple attribute decision-making and their application to enterprise resource planning systems selection.",
            "Novel neutrality operation-based Pythagorean fuzzy geometric aggregation operators for multiple attribute group decision analysis.",
            "q-Rung orthopair uncertain linguistic partitioned Bonferroni mean operators and its application to multiple attribute decision-making method.",
            "Some q-rung orthopair uncertain linguistic aggregation operators and their application to multiple attribute group decision making.",
            "On generalized similarity measures for Pythagorean fuzzy sets and their applications to multiple attribute decision-making.",
            "Some interval-valued q-rung orthopair weighted averaging operators and their applications to multiple-attribute decision making.",
            "Mapping fuzzy RDF(S) into fuzzy object-oriented databases.",
            "Distance and similarity measures of Pythagorean fuzzy sets based on the Hausdorff metric with application to fuzzy TOPSIS.",
            "Constrained shadowed sets and fast optimization algorithm.",
            "An interval-valued exceedance method in MCDM with uncertain satisfactions.",
            "A graphical method for ranking Atanassov's intuitionistic fuzzy values using the uncertainty index and entropy.",
            "Measuring global prosperity using data envelopment analysis and OWA operator.",
            "Synthetic minority oversampling for function approximation problems.",
            "Some q-rung interval-valued orthopair fuzzy Maclaurin symmetric mean operators and their applications to multiple attribute group decision making.",
            "Distance measure for Fermatean fuzzy linguistic term sets based on linguistic scale function: An illustration of the TODIM and TOPSIS methods.",
            "Weighted power means of q -rung orthopair fuzzy information and their applications in multiattribute decision making.",
            "Fitting Sugeno integral for learning fuzzy measures using PAVA isotone regression.",
            "A novel outranking sorting approach based on interval-valued Pythagorean uncertain linguistic Euclidean distance for material supplier grading.",
            "Graded logic for decision support systems.",
            "Some preference relations based on q -rung orthopair fuzzy sets.",
            "Deriving priority weights from intuitionistic fuzzy multiplicative preference relations.",
            "Density-clusters ordered weighted averaging operator based on generalized trapezoidal fuzzy numbers.",
            "A new soft likelihood function based on power ordered weighted average operator.",
            "Pythagorean Dombi fuzzy aggregation operators with application in multicriteria decision-making.",
            "Variances with Bonferroni means and ordered weighted averages.",
            "Nested formulation paradigms for induced ordered weighted averaging aggregation for decision-making and evaluation.",
            "A formal approach for graphically building fuzzy XML model.",
            "A Dempster-Shafer theory and uninorm-based framework of reasoning and multiattribute decision-making for surveillance system.",
            "Uncertainty measure based on Tsallis entropy in evidence theory.",
            "Binary classification rule generation from decomposed data.",
            "q -Rung orthopair fuzzy sets-based decision-theoretic rough sets for three-way decisions under group decision making.",
            "On combination rule in Dempster-Shafer theory using OWA-based soft likelihood functions and its applications in environmental impact assessment.",
            "Differential calculus of interval-valued q-rung orthopair fuzzy functions and their applications.",
            "Some Dombi aggregation of Q-rung orthopair fuzzy numbers in multiple-attribute decision making.",
            "Soft information set for multicriteria decision making.",
            "From Big to Smart Data: Iterative ensemble filter for noise filtering in Big Data classification.",
            "q-Rung orthopair fuzzy Choquet integral aggregation and its application in heterogeneous multicriteria two-sided matching decision making.",
            "A total uncertainty measure for D numbers based on belief intervals.",
            "On Pythagorean fuzzy decision making using soft likelihood functions.",
            "Importance-based multicriteria decision making with interval valued criteria satisfactions."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2018",
        "info": "Volume 33, 2018",
        "count": 113,
        "papers": [
            "On Ranking of Continuous Z-Numbers with Generalized Centroids and Optimization Problems Based on Z-Numbers.",
            "An Evidential Axiomatic Design Approach for Decision Making Using the Evaluation of Belief Structure Satisfaction to Uncertain Target Values.",
            "Tolerance Dominance Relation in Incomplete Ordered Decision Systems.",
            "Intuitionistic Fuzzy Power Aggregation Operator Based on Entropy and Its Application in Decision Making.",
            "Equivalent Structures of Interval Sets and Fuzzy Interval Sets.",
            "Pythagorean Fuzzy LINMAP Method Based on the Entropy Theory for Railway Project Investment Decision Making.",
            "An Interval-Valued Pythagorean Fuzzy Outranking Method with a Closeness-Based Assignment Model for Multiple Criteria Decision Making.",
            "Pythagorean fuzzy power aggregation operators in multiple attribute decision making.",
            "The binomial decomposition of OWA functions, the 2-additive and 3-additive cases in n dimensions.",
            "On the use of convolutional neural networks for robust classification of multiple fingerprint captures.",
            "SESLDS: An Extension Scheme for Linked Data Sources Based on Semantically Enhanced Annotation and Reasoning.",
            "Some q-Rung Orthopair Fuzzy Aggregation Operators and their Applications to Multiple-Attribute Decision Making.",
            "Implicit Elicitation of Attitudinal Character in the OWA Operator.",
            "A Novel Approach for Linguistic Group Decision Making Based on Generalized Interval-Valued Intuitionistic Fuzzy Linguistic Induced Hybrid Operator and TOPSIS.",
            "Some q-Rung Orthopai Fuzzy Bonferroni Mean Operators and Their Application to Multi-Attribute Group Decision Making.",
            "Distance Measure of Pythagorean Fuzzy Sets.",
            "Empirical Fuzzy Sets.",
            "An OWA-Based Ranking Approach for University Books Recommendation.",
            "Extended Intuitionistic Fuzzy Sets Based on the Hesitant Fuzzy Membership and their Application in Decision Making with Risk Preference.",
            "Intuitionistic Fuzzy Interval-Valued Linguistic Entropic Combined Weighted Averaging Operator for Linguistic Group Decision Making.",
            "MetrIntPair - A Novel Accurate Metric for the Comparison of Two Cooperative Multiagent Systems Intelligence Based on Paired Intelligence Measurements.",
            "Aggregation of Heterogeneously Related Information with Extended Geometric Bonferroni Mean and Its Application in Group Decision Making.",
            "Quantile induced heavy ordered weighted averaging operators and its application in incentive decision making.",
            "Matrix games with missing, interval, and ambiguous lottery payoffs of pure strategy profiles and compound strategy profiles.",
            "Study on the ranking problems in multiple attribute decision making based on interval-valued intuitionistic fuzzy numbers.",
            "A novel aggregation method for Pythagorean fuzzy multiple attribute group decision making.",
            "Uncertain linguistic hesitant fuzzy sets and their application in multi-attribute decision making.",
            "Pythagorean fuzzy Bonferroni mean aggregation operator and its accelerative calculating algorithm with the multithreading.",
            "Similarity measures of Pythagorean fuzzy sets based on the cosine function and their applications.",
            "New exponential operational laws and their aggregation operators for interval-valued Pythagorean fuzzy multicriteria decision-making.",
            "Some methods for strategic decision-making problems with immediate probabilities in Pythagorean fuzzy environment.",
            "A general type-2 fuzzy model for computing with words.",
            "Certainty aggregation and the certainty fuzzy measures.",
            "Construction of Choquet integrals through unimodal weighting vectors.",
            "Generating OWA weights using truncated distributions.",
            "Minkowski-type distance measures for generalized orthopair fuzzy sets.",
            "Decision-theoretic rough sets under Pythagorean fuzzy information.",
            "Elliptic entropy of uncertain set and its applications.",
            "A fuzzy ID3 induction for linguistic data sets.",
            "Attitudinal Choquet integrals and applications in decision making.",
            "Fuzzy Generalization and Comparisons for the Rand Index.",
            "Multicriteria Decision-Making Method Based on Similarity Measures under Single-Valued Neutrosophic Refined and Interval Neutrosophic Refined Environments.",
            "Hesitant Fuzzy Linguistic Maclaurin Symmetric Mean Operators and their Applications to Multi-Criteria Decision-Making Problem.",
            "An Agent-Based Pythagorean Fuzzy Approach for Demand Analysis with Incomplete Information.",
            "An OWA Operator-Based Cumulative Belief Degrees Approach for Credit Rating.",
            "Hesitant -Fuzzy Sets.",
            "Pythagorean Fuzzy Maclaurin Symmetric Mean Operators in Multiple Attribute Decision Making.",
            "Type-1 OWA Unbalanced Fuzzy Linguistic Aggregation Methodology: Application to Eurobonds Credit Risk Evaluation.",
            "Comparing Apples and Oranges: The Weighted OWA Function.",
            "Relational Representation of Uncertain and Imprecise Time Assessments: An Application to Artworks Dating.",
            "Some New Properties of Negation of a Probability Distribution.",
            "Modeling evidential databases as possible worlds.",
            "Triangular norm-based cuts and possibility characteristics of triangular intuitionistic fuzzy numbers for decision making.",
            "Relative importance of explanatory variables: Traditional method versus soft regression.",
            "Pythagorean hesitant fuzzy Hamacher aggregation operators and their application to multiple attribute decision making.",
            "Linguistic Pythagorean fuzzy sets and its applications in multiattribute decision-making process.",
            "An improved soft likelihood function for Dempster-Shafer belief structures.",
            "On some characteristics and related properties for OWF and RIM quantifier.",
            "Interval-valued probabilistic linguistic term sets in multi-criteria group decision making.",
            "Fast learning of scale-free networks based on Cholesky factorization.",
            "Evaluation method based on fuzzy relations between Dempster-Shafer belief structure.",
            "FSCOAL - Parallel simultaneous fuzzy co-clustering and learning.",
            "Interval-valued Pythagorean fuzzy extended Bonferroni mean for dealing with heterogenous relationship among attributes.",
            "Multicriteria decision making based on intuitionistic fuzzy prioritized arithmetic mean.",
            "Some q-rung orthopair fuzzy Heronian mean operators in multiple attribute decision making.",
            "An ontology-based framework for automatic topic detection in multilingual environments.",
            "Two new methods for ranking of Z-numbers based on sigmoid function and sign method.",
            "Logarithmic aggregation operators and distance measures.",
            "Personalized quantifier by Bernstein polynomials combined with interpolation spline.",
            "Modeling fuzzy data with RDF and fuzzy relational database models.",
            "Fuzzy rankings for preferences modeling in group decision making.",
            "Additive Fuzzy Systems: From Generalized Mixtures to Rule Continua.",
            "A comparative study on consensus measures in group decision making.",
            "Monotonic argument-dependent OWA operators.",
            "A new type of fuzzy integrals for decision making based on bivariate symmetric means.",
            "New similarity measures of intuitionistic fuzzy sets based on the Jaccard index with its application to clustering.",
            "Interval-valued Pythagorean fuzzy GRA method for multiple-attribute decision making with incomplete weight information.",
            "A ranking function based on principal-value Pythagorean fuzzy set in multicriteria decision making.",
            "Pythagorean fuzzy multicriteria group decision making through similarity measure based on point operators.",
            "Generating Z-number based on OWA weights using maximum entropy.",
            "Shadowed sets of type-II: Representing and computing shadowiness in shadowed sets.",
            "Automatic Discovery of Clusters by Removing Noisy Data.",
            "Pythagorean Fuzzy Clustering Analysis: A Hierarchical Clustering Algorithm with the Ratio Index-Based Ranking Methods.",
            "Induced Heavy Moving Averages.",
            "Fuzzy Quantification and Opinion Mining on Qualitative Data using Feature Reduction.",
            "Outlier detection using linguistically quantified statements.",
            "Analyzing the monotonicity of belief interval based uncertainty measures in belief function theory.",
            "A new trapezoidal Pythagorean fuzzy linguistic entropic combined ordered weighted averaging operator and its application for enterprise location.",
            "Multiple attribute decision-making method for dealing with heterogeneous relationship among attributes and unknown attribute weight information under q-rung orthopair fuzzy environment.",
            "Weighted-selective aggregated majority-OWA operator and its application in linguistic group decision making.",
            "Some power Maclaurin symmetric mean aggregation operators based on Pythagorean fuzzy linguistic numbers and their application to group decision making.",
            "Human Centric Data Management.",
            "Parallel Processing Strategies for Skyline Queries Tolerant to Outliers.",
            "Multimodal query-level fusion for efficient multimedia information retrieval.",
            "Maximizing the Influence in Social Networks via Holistic Probability Maximization.",
            "Group Recommendations Based on Hesitant Fuzzy Sets.",
            "Group Decision Support under Intuitionistic Fuzzy Relations: The Role of Weak Transitivity and Consistency.",
            "The linear assignment method for multicriteria group decision making based on interval-valued Pythagorean fuzzy Bonferroni mean.",
            "Another view on q-rung orthopair fuzzy sets.",
            "Aspects of generalized orthopair fuzzy sets.",
            "A novel induced aggregation method for intuitionistic fuzzy set and its application in multiple attribute group decision making.",
            "Some new Pythagorean fuzzy Choquet-Frank aggregation operators for multi-attribute decision making.",
            "A dissimilarity Jensen-Shannon divergence measure for intuitionistic fuzzy sets.",
            "Distance and similarity measures of Pythagorean fuzzy sets and their applications to multiple criteria group decision making.",
            "Exponential operation and aggregation operator for q-rung orthopair fuzzy set and their decision-making method with a new score function.",
            "Modelling stock selection using ordered weighted averaging operator.",
            "An improvement to generalized regret based decision making method considering unreasonable alternatives.",
            "Total belief theorem and conditional belief functions.",
            "Multiple attribute group decision making based on q-rung orthopair fuzzy Heronian mean operators.",
            "Synthetic generation of spatial graphs.",
            "Oddness-based classification: A new way of exploiting neighbors.",
            "Clustering algorithms based on correlation coefficients for probabilistic linguistic term sets.",
            "Belief intervals aggregation."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2017",
        "info": "Volume 32, 2017",
        "count": 64,
        "papers": [
            "Generalized Likelihood Ratio Test and Cox's F-Test Based on Fuzzy Lifetime Data.",
            "MQDM: An Iterative Fuzzy Method for Group Decision Making in Structured Social Networks.",
            "Idempotent Weighted Aggregation Based on Binary Aggregation Trees.",
            "S-H OWA Operators with Moment Measure.",
            "Linguistic Vector Similarity Measures and Applications to Linguistic Information Classification.",
            "Look-a-Like: A Fast Content-Based Image Retrieval Approach Using a Hierarchically Nested Dynamically Evolving Image Clouds and Recursive Local Data Density.",
            "Guest Editorial: Recent Trends in Intelligent Systems.",
            "Learning from Proportions of Positive and Unlabeled Examples.",
            "Fast-mRMR: Fast Minimum Redundancy Maximum Relevance Algorithm for High-Dimensional Big Data.",
            "Frobenius Norm Regularization for the Multivariate Von Mises Distribution.",
            "Evaluation of a Data-To-Text System for Verbalizing a Learning Analytics Dashboard.",
            "An Application of Fuzzy Prototypes to the Diagnosis and Treatment of Fuzzy Diseases.",
            "A New Ordered Weighted Averaging Operator to Obtain the Associated Weights Based on the Principle of Least Mean Square Errors.",
            "Properties of a Granular Computing Framework for Mining Relational Data.",
            "A Novel User Profile Learning Approach with Fuzzy Constraint for News Retrieval.",
            "Entropy and Cross-entropy for Generalized Hesitant Fuzzy Information and Their Use in Multiple Attribute Decision Making.",
            "An Alternative Type Reduction Approach Based on Information Combination with Interval Operations for Interval-Valued Fuzzy Sliding Controllers.",
            "Editorial: Cloud-Based Manufacturing and Service Systems.",
            "Ubiquitous Hotel Recommendation Using a Fuzzy-Weighted-Average and Backpropagation-Network Approach.",
            "Location Management of Cloud Forklifts in Finished Product Warehouse.",
            "An Approach for Multipath Cloud Manufacturing Services Dynamic Composition.",
            "Feasibility Evaluation and Optimization of a Smart Manufacturing System Based on 3D Printing: A Review.",
            "Manufacturing Resource Modeling for Cloud Manufacturing.",
            "Game Theory Based Real-Time Shop Floor Scheduling Strategy and Method for Cloud Manufacturing.",
            "Deforming Time in a Nonadditive Discount Function.",
            "Quantifier Guided Aggregation for the Veracity Assessment of Online Reviews.",
            "Ensemble Methods for Cooperative Robotic Learning.",
            "Thirty Years of the International Journal of Intelligent Systems: A Bibliometric Review.",
            "On Two-Player Interval-Valued Fuzzy Bayesian Games.",
            "Generalized Pythagorean Fuzzy Geometric Aggregation Operators Using Einstein t-Norm and t-Conorm for Multicriteria Decision-Making Process.",
            "A New Interval Numbers Power Average Operator in Multiple Attribute Decision Making.",
            "Infinite Intuitionistic Fuzzy Series and Product.",
            "The Metric Space of Ordered Weighted Average Operators with Distance Based on Accumulated Entries.",
            "A Note on Fuzzy Probability of a Fuzzy Event.",
            "Multicriteria Decision Making with Cognitive Limitations: A DS/AHP-Based Approach.",
            "Fuzzy Multicriteria Decision-Making Methods: A Comparative Analysis.",
            "A Novel Intuitionistic Fuzzy Induced Ordered Weighted Euclidean Distance Operator and Its Application for Group Decision Making.",
            "Preface by the Editors of the Special Issue on Computational Intelligence and Mathematics.",
            "An Axiomatic System for Conditional Attribute Implications in Triadic Concept Analysis.",
            "Multi-adjoint Relation Equations: A Decision Support System for Fuzzy Logic.",
            "Infrastructure Deployment in Vehicular Communication Networks Using a Parallel Multiobjective Evolutionary Algorithm.",
            "A Road Departure Warning System Based on Video Motion Analysis and Fuzzy Logic.",
            "Multiple Sequence Alignment with Multiobjective Metaheuristics. A Comparative Study.",
            "An effective Discrete Bacterial Memetic Evolutionary Algorithm for the Traveling Salesman Problem.",
            "Exponentially Weighted Ellipsoidal Model for Anomaly Detection.",
            "A Group Incremental Reduction Algorithm with Varying Data Values.",
            "Positional Voting Rules Generated by Aggregation Functions and the Role of Duplication.",
            "A Consensus Approach to the Sentiment Analysis Problem Driven by Support-Based IOWA Majority.",
            "Projection Model for Fusing the Information of Pythagorean Fuzzy Multicriteria Group Decision Making Based on Geometric Bonferroni Mean.",
            "Pythagorean Fuzzy Information Measures and Their Applications.",
            "The Parametric Form of Z-Number and Its Application in Z-Number Initial Value Problem.",
            "A Fuzzy Recommender System for Public Library Catalogs.",
            "A Novel Method for Multiattribute Decision Making with Interval-Valued Pythagorean Fuzzy Linguistic Information.",
            "On Some Properties and Comparative Analysis for Different OWA Monoids.",
            "Pythagorean Fuzzy Multiattribute Group Decision Making with Probabilistic Information and OWA Approach.",
            "Exploring the Ordered Weighted Averaging Operator Knowledge Domain: A Bibliometric Analysis.",
            "Using Fuzzy Ontology to Improve Similarity Assessment: Method and Evaluation.",
            "Approaches to Pythagorean Fuzzy Stochastic Multi-criteria Decision Making Based on Prospect Theory and Regret Theory with New Distance Measure and Score Function.",
            "Inference in Hybrid Bayesian Networks with Nonlinear Deterministic Conditionals.",
            "A Novel Improved Accuracy Function for Interval Valued Pythagorean Fuzzy Sets and Its Applications in the Decision-Making Process.",
            "Empirical Data Analytics.",
            "Asymmetric Composition of Possibilistic Operators in Formal Concept Analysis: Application to the Extraction of Attribute Implications from Incomplete Contexts.",
            "Data Envelopment Analysis Based on Choquet Integral.",
            "A New Intuitionistic Fuzzy Linguistic Hybrid Aggregation Operator and Its Application for Linguistic Group Decision Making."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2016",
        "info": "Volume 31, 2016",
        "count": 58,
        "papers": [
            "Informational Modeling of the Behavior of a Teacher in the Learning Process Based on Fuzzy Logic.",
            "Correlation Coefficients of Interval-Valued Hesitant Fuzzy Sets and Their Application Based on the Shapley Function.",
            "A New Probability Transformation Based on the Ordered Visibility Graph.",
            "A Note on Extension of TOPSIS to Multiple Criteria Decision Making with Pythagorean Fuzzy Sets.",
            "On Typical Hesitant Fuzzy Prioritized \"or\" Operator in Multi-Attribute Decision Making.",
            "Advances in Complex Intelligent Systems.",
            "On Legitimacy Feedback Mechanisms in Agent-Based Modeling of Civil Violence.",
            "Accuracy Comparison of Analogy-Based Software Development Effort Estimation Techniques.",
            "Decision Support System to Determine Intention to Use Mobile Payment Systems on Social Networks: A Methodological Analysis.",
            "An Adaptive Regulation Approach of Mobile Agent Population Size in Distributed Systems.",
            "A Comparative Study between the Dynamic Behaviours of Standard Cellular Automata and Network Cellular Automata Applied to Cryptography.",
            "Fifty Years of Fuzzy Sets: Contributions to Fuzzy Theory (Preface to the Special Issue).",
            "Practical Methods for Constructing Possibility Distributions.",
            "Compatibility of Fuzzy Relations.",
            "Overview of Lattices of Convex Normal Functions.",
            "Need for Data Processing Naturally Leads to Fuzzy Logic (and Neural Networks): Fuzzy Beyond Experts and Beyond Probabilities.",
            "A Global Clustering Approach Using Hybrid Optimization for Incomplete Data Based on Interval Reconstruction of Missing Value.",
            "Folksonomy-Based Recommender Systems: A State-of-the-Art Review.",
            "Games Played under Fuzzy Constraints.",
            "Anytime Decision Making Based on Unconstrained Influence Diagrams.",
            "The Properties of Continuous Pythagorean Fuzzy Information.",
            "Demand Analysis with Aggregation Systems.",
            "Fundamental Properties of Interval-Valued Pythagorean Fuzzy Aggregation Operators.",
            "A Fuzzy Collaborative Assessment Methodology for Partner Trust Evaluation.",
            "Hybrid Measure of Agreement and Expertise for Ontology Matching in Lieu of a Reference Ontology.",
            "Linguistic Discriminative Aggregation in Multicriteria Decision Making.",
            "Belief and Plausibility Functions on Intuitionistic Fuzzy Sets.",
            "An Intuitionistic 2-Tuple Linguistic Information Model and Aggregation Operators.",
            "A Novel Approach Based on Similarity Measure for Pythagorean Fuzzy Multiple Criteria Group Decision Making.",
            "A Multigranularity Linguistic Group Decision-Making Method Based on Hesitant 2-Tuple Sets.",
            "Reward and Penalty Functions in Automated Negotiation.",
            "A Logical Multidemand Bargaining Model with Integrity Constraints.",
            "A Clustering-Based Evidence Reasoning Method.",
            "Some Hesitant Fuzzy Einstein Aggregation Operators and Their Application to Multiple Attribute Group Decision Making.",
            "Fuzzy Linguistic Induced Generalized OWA Operator and Its Application in Fuzzy Linguistic Decision Making.",
            "An OWA-Based Model for Talent Enhancement in Cricket.",
            "Group Decision Making in Information Systems Security Assessment Using Dual Hesitant Fuzzy Set.",
            "Sugeno Integral with Possibilistic Inputs with Application to Multi-Criteria Decision Making.",
            "A Behavioral Analysis of WOWA and SUOWA Operators.",
            "GHFHC: Generalized Hesitant Fuzzy Hierarchical Clustering Algorithm.",
            "Fuzzy Entropic Ordered Weighted Averaging Operator and Its Application in Group Decision Making.",
            "A New Generalized Pythagorean Fuzzy Information Aggregation Using Einstein Operations and Its Application to Decision Making.",
            "Pythagorean Fuzzy Multigranulation Rough Set over Two Universes and Its Applications in Merger and Acquisition.",
            "OWA Operator-Based Hybrid Framework for Outlier Reduction in Web Mining.",
            "A Fuzzy Quantity Mean-Variance View and Its Application to a Client Financial Risk Tolerance Model.",
            "Pythagorean Fuzzy Choquet Integral Based MABAC Method for Multiple Attribute Group Decision Making.",
            "New Distance Measure of Single-Valued Neutrosophic Sets and Its Application.",
            "On Algebraic Structure of L-Fuzzy Bags.",
            "Fuzzy Logic and Chaos Theory in Time Series Forecasting.",
            "Constructive Solving of Raven's IQ Tests with Analogical Proportions.",
            "Error Analysis Methods for Group Decision Making Based on Hesitant Fuzzy Preference Relation.",
            "A Note on \"A Unified Approach to Similarity Measures Between Intuitionistic Fuzzy Sets\".",
            "Evaluation of Indexing Strategies for Possibilistic Queries Based on Indexing Techniques Available in Traditional RDBMS.",
            "Majority Clusters-Density Ordered Weighting Averaging: A Family of New Aggregation Operators in Group Decision Making.",
            "Geometric Bonferroni Mean Operators.",
            "Symmetric Pythagorean Fuzzy Weighted Geometric/Averaging Operators and Their Application in Multicriteria Decision-Making Problems.",
            "Application of Optimistic and Pessimistic OWA and DEA Methods in Stock Selection.",
            "A Novel Correlation Coefficients between Pythagorean Fuzzy Sets and Its Applications to Decision-Making Processes."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2015",
        "info": "Volume 30, 2015",
        "count": 59,
        "papers": [
            "Applications of Decision Making with Uncertain Information.",
            "A Coordinated Routing Model with Optimized Velocity for Train Scheduling on a Single-Track Railway Line.",
            "Credibilistic Location-Routing Model for Hazardous Materials Transportation.",
            "Uncertain Currency Model and Currency Option Pricing.",
            "Some Concepts and Theorems of Uncertain Random Process.",
            "An Uncertain Random Programming Model for Project Scheduling Problem.",
            "A Human-Computer Cooperation Fuzzy c-Means Clustering with Interval-Valued Weights.",
            "Exploring Temporal Structure of Trajectory Components for Action Recognition.",
            "Group Decision Making by Using Incomplete Fuzzy Preference Relations Based on T-Consistency and the Order Consistency.",
            "Weakly Monotonic Averaging Functions.",
            "A New Family of Induced OWA Operators.",
            "Recent Advances in Probabilistic Graphical Models.",
            "Modeling the Interactions between Discrete and Continuous Causal Factors in Bayesian Networks.",
            "Conditional Density Approximations with Mixtures of Polynomials.",
            "Practical Aspects of Solving Hybrid Bayesian Networks Containing Deterministic Conditionals.",
            "Structural Learning of Bayesian Networks Via Constrained Hill Climbing Algorithms: Adjusting Trade-off between Efficiency and Accuracy.",
            "Multidimensional Learning from Crowds: Usefulness and Application of Expertise Detection.",
            "An Extended Approach to Learning Recursive Probability Trees from Data.",
            "Approximate Counting of Graphical Models via MCMC Revisited.",
            "On Weakly Smooth Uninorms on Finite Chain.",
            "Handling of Dependence in Dempster-Shafer Theory.",
            "Derivative and Differential Operations of Intuitionistic Fuzzy Numbers.",
            "Generalized Bonferroni Mean Operator for Fuzzy Number Intuitionistic Fuzzy Sets and its Application to Multiattribute Decision Making.",
            "On Obtaining Piled OWA Operators.",
            "Automatic Identification and Recognition of Sentiment Words Using an Optimization-Based Model with Propagation.",
            "On the Cross-Migrativity with Respect to Continuous t-Norms.",
            "Z-Number-Based Linear Programming.",
            "Group Decision Making Under Interval-Valued Multiplicative Intuitionistic Fuzzy Environment Based on Archimedean t-Conorm and t-Norm.",
            "Fuzzy Collaborative Intelligence and Systems.",
            "An Efficient and Effective Fuzzy Collaborative Intelligence Approach for Cycle Time Estimation in Wafer Fabrication.",
            "Optimizing Multiple Quality Responses in the Taguchi Method Using Fuzzy Goal Programming: Modeling and Applications.",
            "Semantically Segmented Clustering Based on Possibilistic and Rough Set Theories.",
            "An Improved Fuzzy Collaborative System for Predicting the Unit Cost of a DRAM Product.",
            "Adaptive Fuzzy Collaborative Task Assignment for Heterogeneous Multirobot Systems.",
            "Large-Scale Time Series Clustering Based on Fuzzy Granulation and Collaboration.",
            "The OWA Weights of Improved Minimax Disparity Model.",
            "A Model to Determine OWA Weights and Its Application in Energy Technology Evaluation.",
            "Modified Ordinal Sums of Triangular Norms and Triangular Conorms on Bounded Lattices.",
            "Uncertainty Measures for Hesitant Fuzzy Information.",
            "Subadditive Discount Functions with a Transition Period.",
            "Preface: Intelligent Techniques for Data Science.",
            "Collaborative Filtering with Entropy-Driven User Similarity in Recommender Systems.",
            "Automatic Leaf Recognition from a Big Hierarchical Image Database.",
            "A Consensus-Driven Group Recommender System.",
            "Gas Recognition under Sensor Drift by Using Deep Learning.",
            "An Incremental Learning Approach for Updating Approximations in Rough Set Model over Dual Universes.",
            "Travel Demand Forecasting Using Activity-Based Modeling Framework FEATHERS: An Extension.",
            "An Intelligent Trading System with Fuzzy Rules and Fuzzy Capital Management.",
            "The Ordered Weighted Average in the Variance and the Covariance.",
            "An Extension of Fuzzy L-R Data Classification with Fuzzy OWA Distance.",
            "A New Approach for Representing and Querying Textual Attributes in Databases.",
            "A Novel and Principled Multiclass Support Vector Machine.",
            "Cluster Analysis Based on T-transitive Interval-Valued Fuzzy Relations.",
            "A Modified TOPSIS Method for Obtaining the Associated Weights of the OWA-Type Operators.",
            "On a Role for Copula's in Jeffrey's Rule with An Application to Decision Making.",
            "Some Results for Pythagorean Fuzzy Sets.",
            "Semisupervised Local Fusion Approach for Mine Detection in SONAR Data.",
            "A Spectrum of Weighted Compromise Aggregation Operators: A Generalization of Weighted Uninorm Operator.",
            "Fuzzy Community Detection Model in Social Networks."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2014",
        "info": "Volume 29, 2014",
        "count": 58,
        "papers": [
            "On Solving Some Paradoxes Using the Ordered Weighted Averaging Operator Based Decision Model.",
            "Fuzzy Generalized Prioritized Weighted Average Operator and its Application to Multiple Attribute Decision Making.",
            "A Multicriteria Decision Support System using a Possibility Representation for Managing Inconsistent Assessments of Experts Involved in Emergency Situations.",
            "Using Venn Diagrams to Perform Logic Reasoning: An Algorithm for Automating the Syllogistic Reasoning of Categorical Statements.",
            "Fuzzy Set Theory as a Methodological Bridge between Hard Sciences and Humanities.",
            "Parametric Weighting Function for WOWA Operator and Its Application in Decision Making.",
            "Decision Making with Second-Order Imprecise Probabilities.",
            "Models of Influence in Online Social Networks.",
            "Correlation for Dual Hesitant Fuzzy Sets and Dual Interval-Valued Hesitant Fuzzy Sets.",
            "Detection of Deviation in Performance of Battery Cells by Data Compression and Similarity Analysis.",
            "On the Validity of Dempster's Fusion Rule and its Interpretation as a Generalization of Bayesian Fusion Rule.",
            "Geostatistical Entropy for Texture Analysis: An Indicator Kriging Approach.",
            "The Generalized Nets Transitions Representability Problem: Extension with Boundary Cases and Minimal Solution.",
            "A General Approach to Midpoint Theory and Aggregation of Quasimetrics.",
            "Modeling of Creation of the Complex on Intelligent Information Systems Learning and Knowledge Control.",
            "Some Hesitant Fuzzy Information Aggregation Operators Based on Einstein Operational Laws.",
            "Iterative Refinement Methods for Enhanced Information Retrieval.",
            "An Axiomatic Foundation for Yager's Decision Theory.",
            "The Significance Of Low Frequent Terms in Text Classification.",
            "Upgrading a Granular Computing Based Data Mining Framework to a Relational Case.",
            "Weakly Prioritized Measure Aggregation in Prioritized Multicriteria Decision Making.",
            "Using Hierarchical Graph Maps to Explain Collaborative Filtering Recommendations.",
            "Fuzzy Linguistic Induced Euclidean OWA Distance Operator and its Application in Group Linguistic Decision Making.",
            "Hesitant Fuzzy Sets: An Emerging Tool in Decision Making.",
            "Hesitant Fuzzy Sets: State of the Art and Future Directions.",
            "Typical Hesitant Fuzzy Negations.",
            "On Improving the Additive Consistency of the Fuzzy Preference Relations Based on Comparative Linguistic Expressions.",
            "Toward a Classification of Hesitant Operators in the 2-Tuple Linguistic Model.",
            "Time-Based Hesitant Fuzzy Information Aggregation Approach for Decision-Making Problems.",
            "Exploiting Near-Duplicate Relations in Organizing News Archives.",
            "An Approximate Algorithm for Min-Based Possibilistic Networks.",
            "Aggregation Operators of Interval-Valued 2-Tuple Linguistic Information.",
            "An Accurate Method for Determining Hesitant Fuzzy Aggregation Operator Weights and Its Application to Project Investment.",
            "A Fuzzy Dynamic Belief Logic System.",
            "A Fuzzy Bayesian Classifier with Learned Mahalanobis Distance.",
            "Reward-Penalty Assignments and Genetic Algorithms for Ordinal Interval Number Group Decision Making.",
            "Construction of Intelligent Virtual Worlds Using a Grammatical Framework.",
            "Navigating Multiple Mobile Robots without Direct Communication.",
            "Incomplete Fuzzy Preference Matrix and Its Application to Ranking of Alternatives.",
            "A Hellinger-Based Importance Measure of Association Rules for Classification Learning.",
            "Knowledge Engineering for Rough Sets Based Decision-Making Models.",
            "A Fuzzy Temporal Object-Relational Database: Model and Implementation.",
            "Improving Combinatorial Optimization Algorithms through Record Keeping in Constructive Multistart Search.",
            "Stochastic Dominance for Measure Based Uncertain Decision Making.",
            "Induced Ordered Weighted Evidential Reasoning Approach for Multiple Attribute Decision Analysis with Uncertainty.",
            "Qualified Syllogisms with Fuzzy Predicates.",
            "Linguistic Summarization of Europe Brent Spot Price Time Series Along with the Interpretations from the Perspective of Turkey.",
            "Intuitionistic Fuzzy Hybrid Weighted Aggregation Operators.",
            "Ordered Weighted Averaging Operators 1988-2014: A Citation-Based Literature Survey.",
            "Interaction-Feature Enhanced Multiuser Model Learning for a Home Environment Using Ambient Sensors.",
            "Classifying Lung Cancer Knowledge in PubMed According to GO Terms Using Extreme Learning Machine.",
            "Extension of TOPSIS to Multiple Criteria Decision Making with Pythagorean Fuzzy Sets.",
            "Soft Computing Methods for Personnel Selection Based on the Valuation of Competences.",
            "Using Induced Ordered Weighted Averaging (IOWA) Operators for Aggregation in Cross-Efficiency Evaluations.",
            "Social Network Decision Making with Linguistic Trustworthiness-Based Induced OWA Operators.",
            "Ambiguous Bayesian Games.",
            "On Yager and Hamacher t-Norms and Fuzzy Metric Spaces.",
            "An Improved Clustering Algorithm Using Fuzzy Relation for the Performance Evaluation of Humanistic Systems."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2013",
        "info": "Volume 28, 2013",
        "count": 65,
        "papers": [
            "Soft Computing for Intelligent Web.",
            "A Fuzzy Ontology for Database Querying with Bipolar Preferences.",
            "Recurrent Confabulation Model for Annotated Image Retrieval.",
            "Fuzzy Ontology Used for Knowledge Mobilization.",
            "Summarization by Domain Ontology Navigation.",
            "Finding Fuzzy Concepts for Creative Knowledge Discovery.",
            "Abstracting for Dimensionality Reduction in Text Classification.",
            "A Time-Perception Approach for the Treatment of Risk in Projects Appraisal.",
            "A Model for Decision Making with Missing, Imprecise, and Uncertain Evaluations of Multiple Criteria.",
            "Optimizing and Tuning MapReduce Jobs to Improve the Large-Scale Data Analysis Process.",
            "Editorial: Special Issue on \"Recent Advances in Intelligent Techniques\".",
            "A Planning Approach to the Recognition of Multiple Goals.",
            "A Novel Approach for Finding Frequent Itemsets in Data Stream.",
            "Image Classification Based on the Combination of Text Features and Visual Features.",
            "Assessing Gait Patterns of Healthy Adults Climbing Stairs Employing Machine Learning Techniques.",
            "Improved Particle Swarm Optimization Combined with Backpropagation for Feedforward Neural Networks.",
            "Fast Adaptive Extraction Algorithm for Multiple Principal Generalized Eigenvectors.",
            "On Continuity of Ordered Aggregation Operators.",
            "An Analysis of the Dependence Among Financial Markets by Spatial Contagion.",
            "Fuzzy Computational Models of Trust and Distrust for Enhanced Recommendations.",
            "Mining Top-Rank-k Erasable Itemsets by PID_lists.",
            "An Analysis of Some Functions That Generalizes Weighted Means and OWA Operators.",
            "A Spectral Clustering Approach Based on Newton's Equations of Motion.",
            "Prioritized Information Fusion Method for Triangular Intuitionistic Fuzzy Set and its Application to Teaching Quality Evaluation.",
            "Pythagorean Membership Grades, Complex Numbers, and Decision Making.",
            "A Method for Decision Making Based on Generalized Aggregation Operators.",
            "The Digital Music Stand as a Minimal Processing Custom-Made Optical Music Recognition System, Part 1: Key Music Symbol Recognition.",
            "Type-Reduction of General Type-2 Fuzzy Sets: The Type-1 OWA Approach.",
            "Technologies for Decision Making and AI Applications.",
            "Robust Spherical Shell Clustering Using Fuzzy-Possibilistic Product Partition.",
            "Parallelized Fusion on Multisensor Transportation Data: A Case Study in CyberITS.",
            "A Bloom Filter Based Model for Decentralized Authorization.",
            "OSN Crawling Schedulers and Their Implications on k-Plexes Detection.",
            "Toward a Privacy Agent for Information Retrieval.",
            "Inference in Bayesian Networks with Recursive Probability Trees: Data Structure Definition and Operations.",
            "Compiling an Epistemic Logic for Multiagent Systems.",
            "A Unified Approach to Similarity Measures Between Intuitionistic Fuzzy Sets.",
            "A Survey and Evaluation of State-of-the-Art Intelligent Question Routing Systems.",
            "Probability-Generated Aggregators.",
            "Dynamic Maintenance of Approximations in Dominance-Based Rough Set Approach under the Variation of the Object Set.",
            "A Novel Method of Ranking Hesitant Fuzzy Values for Multiple Attribute Decision-Making Problems.",
            "Fuzzy Models for Link Prediction in Social Networks.",
            "A Fuzzy Reasoning Model for Action and Change in Timed Domains.",
            "A Probabilistic and Decision Attitude Aggregation Operator for Intuitionistic Fuzzy Environment.",
            "Introduction to Special Issue on \"Foundations and Applications of Granular Computing\".",
            "Knowledge Approximations in Binary Relation: Granular Computing Approach.",
            "Division Charts as Granules and Their Merging Algorithm for Rule Generation in Nondeterministic Data.",
            "Epistemic Logic Founded on Nonignorance.",
            "Combinatorics of Information Granule in Contingency Table.",
            "Objective-Based Rough c-Means Clustering.",
            "The Total Variation of Bounded Variation Functions to Evaluate and Rank Fuzzy Quantities.",
            "A General Version of the Triple Π Operator.",
            "Avoiding the Look-Ahead Pathology of Decision Tree Learning.",
            "A Generalized Functional Network for a Classifier-Quantifiers Scheme in a Gas-Sensing System.",
            "Context-Centric Speech-Based Human-Computer Interaction.",
            "Decision Making with Ordinal Payoffs Under Dempster-Shafer Type Uncertainty.",
            "A Review of Ontology-Based Tag Recommendation Approaches.",
            "A Multistep Methodology for the Evaluation of Human Resources Using the Evidence Theory.",
            "Determination of the Attitudinal Character by Self-Evaluation for the Maximum Entropy OWA Approach.",
            "Integrating Collaborative and Reclusive Methods for Effective Recommendations: A Fuzzy Bayesian Approach.",
            "Sensitivity Analysis of Multiple Criteria Decision Making Method Based on the OWA Operator.",
            "Generalized Prioritized Multicriteria Aggregation.",
            "TOPSIS for Hesitant Fuzzy Linguistic Term Sets.",
            "Interval-Valued Intuitionistic Fuzzy Multiattribute Group Decision Making Based on Cross Entropy Measure and Choquet Integral.",
            "Selecting Genes for Cancer Classification Using SVM: An Adaptive Multiple Features Scheme."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2012",
        "info": "Volume 27, 2012",
        "count": 53,
        "papers": [
            "Integrating trust measures in multiagent systems.",
            "Uniqueness of reconstruction for Yager's t-norm combination of probabilistic and possibilistic knowledge.",
            "Generalized intuitionistic fuzzy Bonferroni means.",
            "Nonlinear integrals with polynomial kernel and its applications.",
            "Games and aggregations.",
            "Equilibrium strategies via GA to stackelberg games under multiple follower's best reply.",
            "Beliefs correspondences and equilibria in ambiguous games.",
            "Fuzzy cooperative behavior in response to market imperfections.",
            "The gini index, the dual decomposition of aggregation functions, and the consistent measurement of inequality.",
            "About a consistency index for pairwise comparison matrices over a divisible alo-group.",
            "The role of diversity in persistence aggregation.",
            "A hybrid evolutionary approach for solving the ontology alignment problem.",
            "An evolutionary tuned driving system for virtual car racing games: The AUTOPIA driver.",
            "Obtaining OWA operators starting from a linear order and preference quantifiers.",
            "On Z-valuations using Zadeh's Z-numbers.",
            "I-prune: Item selection for associative classification.",
            "A robust image retrieval system for mobile guide applications.",
            "Neighborhood rough sets for dynamic data mining.",
            "Development of the knowledge-based learning system for distance education.",
            "Effect of data discretization on the classification accuracy in a high-dimensional framework.",
            "To reach consensus using uninorm aggregation operator: A gossip-based protocol.",
            "A novel distance measure of intuitionistic fuzzy sets and its application to pattern recognition problems.",
            "Cross-migrative triangular norms.",
            "On accurate localization and uncertain sensors.",
            "The probabilistic weighted average and its application in multiperson decision making.",
            "Cooperative situation assessment in a maritime scenario.",
            "Analysis of the impact of attitudinal character on the multicriteria decision making with OWA operators.",
            "Multiregression based on upper and lower nonlinear integrals.",
            "Multicriteria decision making with 2-dimension linguistic aggregation techniques.",
            "Fuzzy implications derived from additive generators of continuous Archimedean t-norms.",
            "Generalized prioritized aggregation operators.",
            "A new formulation of the coVAT algorithm for visual assessment of clustering tendency in rectangular data.",
            "Reasoning of fuzzy relational databases with fuzzy ontologies.",
            "Group decision making based on generalized intuitionistic fuzzy prioritized geometric operator.",
            "Differences between t-norms in fuzzy control.",
            "Automatic system for identifying and categorizing temporal relations in natural language.",
            "A linguistic multicriteria decision-making model applied to hotel service quality evaluation from web data sources.",
            "Similarity measure for anomaly detection and comparing human behaviors.",
            "Making sense as a process emerging from perception-memory interaction: A model.",
            "Measures of assurance and opportunity in modeling uncertain information.",
            "Hesitant fuzzy entropy and cross-entropy and their use in multiattribute decision-making.",
            "Cluster-reliability-induced OWA operators.",
            "Conceptual modeling of cardinality constraints in social publishing.",
            "A model for \"crisp reasoning\" with fuzzy sets.",
            "Fuzzy resource-constrained project scheduling using taboo search algorithm.",
            "Liapunov-type inequality for universal integral.",
            "Similarity evaluation of sets of linguistic summaries.",
            "A balanced memory-based collaborative filtering similarity measure.",
            "A hybrid fuzzy intelligent agent-based system for stock price prediction.",
            "Concept-relational text clustering.",
            "Intuitionistic Fuzzy Geometric Bonferroni Means and Their Application in Multicriteria Decision Making.",
            "Determination of Ordered Weighted Averaging Operator Weights Based on the M-Entropy Measures.",
            "Effective Tag Recommendation System Based on Topic Ontology Using Wikipedia and WordNet."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2011",
        "info": "Volume 26, 2011",
        "count": 63,
        "papers": [
            "The uncertain induced quasi-arithmetic OWA operator.",
            "Modeling and reasoning with qualitative comparative clinical knowledge.",
            "A GroupTrust model based on service similarity evaluation in P2P networks.",
            "Intertemporal choice and nonadditive capitalization functions.",
            "QoRank: A query-dependent ranking model using LSE-based weighted multiple hyperplanes aggregation for information retrieval.",
            "An adaptive neuro-fuzzy system for stock portfolio analysis.",
            "On fuzzy renewal processes for fuzzy random variables and extended theorems.",
            "Effective agent collaboration through improved communication by means of contextual reasoning.",
            "Preference ontology-oriented metric model for trustworthy Web services.",
            "Fuzzy pricing of American options on stocks with known dividends and its algorithm.",
            "Intelligent data processing: Methodology, problems, realizations, and trends.",
            "An approach to automatic real-time novelty detection, object identification, and tracking in video streams based on recursive density estimation and evolving Takagi-Sugeno fuzzy systems.",
            "On database queries involving competitive conditional preferences.",
            "From spreading of behavior to dyadic interaction - A robot learns what to imitate.",
            "Human-guided fuzzy decision for image similarity analysis and classification based on information compression.",
            "The notion of H-IFS: An approach for enhancing the OLAP capabilities in oracle10g.",
            "A new interpretation of complex membership grade.",
            "Computationally intensive parameter selection for clustering algorithms: The case of fuzzy c-means with tolerance.",
            "A game model based on multi-attribute aggregation.",
            "Evolution computation based learning algorithms of polygonal fuzzy neural networks.",
            "Extending description logics with uncertainty reasoning in possibilistic logic.",
            "A multi-agent system for analyzing the effect of information on prediction markets.",
            "On distance and correlation measures of hesitant fuzzy information.",
            "Handling bipolar knowledge with imprecise probabilities.",
            "Alternative approach for learning and improving the MCDA method PROAFTN.",
            "The relationships between choquet integral, pan-integral, upper integral and lower integral.",
            "New dissimilarity measure for recognizing noisy subsequence trees.",
            "Preface: A rough set approach to data mining.",
            "Experiments with rough set approach to face recognition.",
            "Probabilistic rule induction with the LERS data mining system.",
            "A class of dynamic rough partitive algorithms.",
            "Granular computing in the frame of rough mereology. A case study: Classification of data into decision categories by means of granular reflections of data.",
            "From data to classification rules and actions.",
            "OWA weight updating in repeated decision making under the influence of additional information.",
            "Using data mining techniques for optimizing traffic signal plans at an urban intersection.",
            "A fuzzy topological framework for classifying image databases.",
            "Conceptual modeling in full computation-tree logic with sequence modal operator.",
            "A note on diversity criterion in decision making.",
            "Induced intuitionistic fuzzy Choquet integral operator for multicriteria decision making.",
            "User-centric trust and reputation model for personal and trusted service selection.",
            "Classification of imprecise data using interval Fisher discriminator.",
            "Evidential reasoning using extended fuzzy Dempster-Shafer theory for handling various facets of information deficiency.",
            "Sensitivity analysis on causal chains of Bayesian networks.",
            "A lazy learning approach for building classification models.",
            "Algorithms for estimating missing elements of incomplete intuitionistic preference relations.",
            "A hybrid trust-enhanced collaborative filtering recommendation approach for personalized government-to-business e-services.",
            "Efficient KNN search by linear projection of image clusters.",
            "Density-induced ordered weighted averaging operators.",
            "Advances in fuzzy querying: Theory and applications.",
            "Bipolar database querying using bipolar satisfaction degrees.",
            "On Diverse Approaches to Bipolar Division Operators.",
            "Intelligent fuzzy queries for multimedia databases.",
            "A flexible and scalable audio information retrieval system for mixed-type audio signals.",
            "Multicriteria methods and logic aggregation in suitability maps.",
            "Linguistic query answering on data cubes with time dimension.",
            "A hybrid algorithm for finding minimal unsatisfiable subsets in over-constrained CSPs.",
            "Intuitionistic fuzzy geometric aggregation operators based on einstein operations.",
            "CBDL: Context-based distance learning for categorical attributes.",
            "A dynamic optimization approach for adaptive incremental learning.",
            "Text summarization contribution to semantic question answering: New approaches for finding answers on the web.",
            "A noise-resilient collaborative learning approach to content-based image retrieval.",
            "Cataloguing/analogizing: A nonmonotonic view.",
            "Fuzzy measures and coherent join measures."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2010",
        "info": "Volume 25, 2010",
        "count": 63,
        "papers": [
            "Generalized aggregation operators for intuitionistic fuzzy sets.",
            "Evidential reasoning-based nonlinear programming model for MCDA under fuzzy weights and utilities.",
            "Induced choquet ordered averaging operator and its application to group decision making.",
            "Coalitions of arguments: A tool for handling bipolar argumentation frameworks.",
            "Granular computing: Models and applications.",
            "The design and application of structured types in Ptolemy II.",
            "Ranking and selecting terms for text categorization via SVM discriminate boundary.",
            "A novel clustering algorithm using hypergraph-based granular computing.",
            "Granular computing approach to finding association rules in relational database.",
            "A method of discovering important rules using rules as attributes.",
            "Mining hidden connections among biomedical concepts from disjoint biomedical literature sets through semantic-based association rule.",
            "Decision making in social networks.",
            "On the effects of heterogeneity on one-way flow network formation.",
            "An algorithm of propagation in weighted directed graphs with applications to economics and finance.",
            "Centrality in organizational networks.",
            "Reaching consensus in multiagent decision making.",
            "Assessing false consensus effect in a consensus enhancing procedure.",
            "The ramification problem in temporal databases: Concurrent execution.",
            "Credit risk modeling using bayesian networks.",
            "Maximum entropy inference for mixed continuous-discrete variables.",
            "An artificial neural network based approach for online string matching/filtering of large databases.",
            "Constrained itemset mining on a sequence of incoming data blocks.",
            "An approach to the linguistic summarization of time series using a fuzzy quantifier driven aggregation.",
            "Tracking of multiple target types with a single neural extended Kalman filter.",
            "Simulation and discrete event optimization for automated decisions for in-queue flights.",
            "Nonlinear optimization models for multiple attribute group decision making with intuitionistic fuzzy information.",
            "Intelligent command and control agent in electronic warfare settings.",
            "Hesitant fuzzy sets.",
            "On aggregating uncertain information by type-2 OWA operators for soft decision making.",
            "A framework for linguistic logic programming.",
            "Minimization of uncertainty for ordered weighted average.",
            "Interactive in-vehicle guidance through a multihierarchical representation of urban maps.",
            "Application of fuzzy measures and interval computation to financial portfolio selection.",
            "Agents with emotions.",
            "A novel approach for question answering and automatic diagnosis based on pervasive agent ontology in medicine.",
            "Generalized ordered weighted logarithm aggregation operators and their applications to group decision making.",
            "Preface to the special issue on \"Goal-driven requirements engineering\".",
            "Aspect-enhanced goal-driven sequence diagram.",
            "A goal-driven approach for service request modeling.",
            "An MDE modeling framework for measurable goal-oriented requirements.",
            "Policy-enabled goal-oriented requirements engineering for semantic Business Process Management.",
            "From goal-driven security requirements engineering to secure design.",
            "Evaluating goal models within the goal-oriented requirement language.",
            "Change impact analysis with a goal-driven traceability-based approach.",
            "T-norms in subtractive clustering and backpropagation.",
            "Fuzzy data modeling and algebraic operations in XML.",
            "Fuzzy multicriteria selection of alternatives: The worst-case method.",
            "Including a diversity criterion in decision making.",
            "An intelligent search path.",
            "Intelligent modeling with agent-based fuzzy cognitive map.",
            "A rough set based dynamic maintenance approach for approximations in coarsening and refining attribute values.",
            "Application of prioritized aggregation operators in preference voting.",
            "Characterizations of consistent pairwise comparison matrices over abelian linearly ordered groups.",
            "Generalized point operators for aggregating intuitionistic fuzzy information.",
            "On tree types of competitive learning algorithms with their comparisons and applications to MRI segmentation.",
            "Optimizing image matches via a verification model.",
            "Relationships between entropy and similarity measure of interval-valued intuitionistic fuzzy sets.",
            "Special issue on new trends for ontology-based knowledge discovery.",
            "Recommending biomedical resources: A fuzzy linguistic approach based on semantic web.",
            "Automatic keyphrase extraction and ontology mining for content-based tag recommendation.",
            "Diet assessment based on type-2 fuzzy ontology and fuzzy markup language.",
            "Discovery of time-varying relations using fuzzy formal concept analysis and associations.",
            "Knowledge structuring to support facet-based ontology visualization."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2009",
        "info": "Volume 24, 2009",
        "count": 65,
        "papers": [
            "Decision science: Foundations and applications introduction to the special issue.",
            "Towards a general and unified characterization of individual and collective choice functions under fuzzy and nonfuzzy preferences and majority via the ordered weighted average operators.",
            "Decision making beyond arrow's \"impossibility theorem, \" with the analysis of effects of collusion and mutual attraction.",
            "From fuzzy sets to shadowed sets: Interpretation and computing.",
            "Some general comments on fuzzy sets of type-2.",
            "Belief functions on lattices.",
            "Extensions of fuzzy measures and Sugeno integral for possibilistic truth values.",
            "Application of a niched Pareto genetic algorithm for selecting features for nuclear transients classification.",
            "Fuzzy harmonic mean operators.",
            "Sharing in teams of heterogeneous, collaborative learning agents.",
            "Group decision making with incomplete fuzzy linguistic preference relations.",
            "Dealing with uncertainty and fuzziness in intelligent systems.",
            "Learning weighted linguistic rules to control an autonomous robot.",
            "Fuzzy scheduling strategy for generalized switched server systems and its robustness over system heterogeneity.",
            "Kernel approach to possibilistic C-means clustering.",
            "Mapping with words: A new approach to automated digital soil survey.",
            "Fuzzy rule extraction by bacterial memetic algorithms.",
            "Information retrieval with FROM: The fuzzy relational ontological model.",
            "A new cognitive model: Cloud model.",
            "A general unified framework for pairwise comparison matrices in multicriterial methods.",
            "Intuitionistic fuzzy sets: Spherical representation and distances.",
            "A novel global optimization technique for high dimensional functions.",
            "A kernel-based core growing clustering method.",
            "Representation of interrelationships among binary variables under dempster-shafer theory of belief functions.",
            "Determining semantic relatedness through the measurement of discrimination information using Jensen difference.",
            "Clustering in ordered dissimilarity data.",
            "k-sample median test for vague data.",
            "Hybrid crossover operators with multiple descendents for real-coded genetic algorithms: Combining neighborhood-based crossover operators.",
            "International journal of intelligent systems: Special issue on \"fuzzy bags, cardinality, and quantification\".",
            "Fuzzy quantification in two real scenarios: Information retrieval and mobile robotics.",
            "Scalar and fuzzy cardinalities of crisp and fuzzy multisets.",
            "Generalized fuzzy quantifiers and the modeling of fuzzy branching quantification.",
            "Crisp bags, one-dimensional fuzzy bags, multidimensional fuzzy bags: Comparing successful and unsuccessful user's Web behavior.",
            "The set of fuzzy relative integers and fuzzy bags.",
            "On nonstrict Archimedean triangular norms, Hamming distances, and cardinalities of fuzzy sets.",
            "An extended characterization of fuzzy bags.",
            "Nature-inspired cooperative strategies for optimization.",
            "MOCell: A cellular genetic algorithm for multiobjective optimization.",
            "On the efficiency of cell-like and tissue-like recognizing membrane systems.",
            "Portfolio management using value at risk: A comparison between genetic algorithms and particle swarm optimization.",
            "Automated self-assembly programming paradigm: The impact of network topology.",
            "CHAC, A MOACO algorithm for computation of bi-criteria military unit path in the battlefield: Presentation and first results.",
            "A study on diversity and cooperation in a multiagent strategy for dynamic optimization problems.",
            "Measures of self-contradiction on Atanassov's intuitionistic fuzzy sets: An axiomatic model.",
            "A recursive group decision-making procedure for choosing qualified individuals.",
            "An intensional approach to qualitative and quantitative periodicity-dependent temporal constraints.",
            "From dynamic influence nets to dynamic Bayesian networks: A transformation algorithm.",
            "Induced aggregation operators in decision making with the Dempster-Shafer belief structure.",
            "Morphogenetic approach to system identification.",
            "A parallel solution to the HIP game based on genetic algorithms.",
            "Entropy-based metrics in swarm clustering.",
            "Evolution patterns and gradual trends.",
            "On the WOWA operator and its interpolation function.",
            "Performance optimization of object comparison.",
            "Preface to the special issue on analysis and design of hybrid intelligent systems.",
            "An artificial beehive algorithm for continuous optimization.",
            "A levenberg-marquardt learning applied for recurrent neural identification and control of a wastewater treatment bioprocess.",
            "Interval type-2 fuzzy logic for edges detection in digital images.",
            "A cognitive map and fuzzy inference engine model for online design and self fine-tuning of fuzzy logic controllers.",
            "Real-time takagi-sugeno fuzzy control of a robot manipulator.",
            "Binary naive possibilistic classifiers: Handling uncertain inputs.",
            "Technology acceptance model: A replicated test using TETRAD.",
            "Alternative fuzzy operations and applications to social sciences.",
            "Some remarks on the LSOWA approach for obtaining OWA operator weights.",
            "Fuzzy adjunctions and fuzzy morphological operations based on implications."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2008",
        "info": "Volume 23, 2008",
        "count": 66,
        "papers": [
            "A knowledge-based approach to adversarial decision making.",
            "A neural network approach to prediction of glass transition temperature of polymers.",
            "Least-squared ordered weighted averaging operator weights.",
            "An algorithm for modelling key terms.",
            "Buddy: Harnessing the power of the internet.",
            "Editorial: Modeling decisions for artificial intelligence.",
            "Choquet-stieltjes integral as a tool for decision modeling.",
            "Unsupervized aggregation of commensurate correlated attributes by means of the choquet integral and entropy functionals.",
            "A consistency-based procedure to estimate missing pairwise preference values.",
            "Algorithms of nonlinear document clustering based on fuzzy multiset model.",
            "Fuzzy integrals - what are they?",
            "Two steps reinforcement learning.",
            "Real-parameter crossover operators with multiple descendents: An experimental study.",
            "Wasp swarm optimization of the c-means clustering model.",
            "A new semantics for ACL based on commitments and penalties.",
            "Selective sampling for approximate clustering of very large data sets.",
            "On weighted P-quantile aggregation.",
            "On the difference of fuzzy sets.",
            "On similarity measures between intuitionistic fuzzy sets.",
            "A self-organizing recurrent fuzzy CMAC model for dynamic system identification.",
            "Context adaptation of mamdani fuzzy rule based systems.",
            "The use of ontologies for representing database schemas of fuzzy information.",
            "Measuring simultaneous belongingness for sets of objects.",
            "An evolutionary algorithm for constructing a decision forest: Combining the classification of disjoints decision trees.",
            "An efficient triplet-based algorithm for evidential reasoning.",
            "Advantages, problems, and trends in contemporary intelligent systems.",
            "Improved process monitoring using nonlinear principal component models.",
            "Adaptive modeling and discovery in bioinformatics: The evolving connectionist approach.",
            "Complexity versus integrity solution in adaptive fuzzy-neural inference models.",
            "Uncertain variables and their applications in knowledge-based decision systems: New results and perspectives.",
            "Applications in intelligent systems of knowledge discovery methods based on human-machine interaction.",
            "A fast and compact classifier based on sorting in an iteratively expanded input space.",
            "Computational intelligence approach to real-world cooperative vehicle dispatching problem.",
            "Data integration constraints for consistent data redundancy in fuzzy databases.",
            "The hybrid representation model for web document classification.",
            "Generation of interval-valued fuzzy and atanassov's intuitionistic fuzzy connectives from fuzzy connectives and from Kalpha operators: Laws for conjunctions and disjunctions, amplitude.",
            "Record linkage for database integration using fuzzy integrals.",
            "Meteorological data analysis using self-organizing maps.",
            "HILK: A new methodology for designing highly interpretable linguistic knowledge bases using the fuzzy logic formalism.",
            "An alternative, layout-driven approach to the clustering of documents.",
            "Formalizing context-based reasoning: A modeling paradigm for representing tactical human behavior.",
            "Mapping the forms of meaning in small worlds.",
            "Foreword.",
            "An introduction to bipolar representations of information and preference.",
            "An evolutionist approach to information bipolarity: Representations and affects in human cognition.",
            "Bipolarity in human reasoning and affective decision making.",
            "Two routes for bipolar information processing, and a blind spot in between.",
            "Bipolar and bivariate models in multicriteria decision analysis: Descriptive and constructive approaches.",
            "Bipolar preference modeling and aggregation in decision support.",
            "Logical formalisms for representing bipolar preferences.",
            "Accepting/rejecting propositions from accepted/rejected propositions: A unifying overview.",
            "Logical approaches to deontic reasoning: From basic questions to dynamic solutions.",
            "Bipolarity in bilattice logics.",
            "On bipolarity in argumentation frameworks.",
            "Modeling positive and negative information in possibility theory.",
            "Case-based learning in a bipolar possibilistic framework.",
            "Bipolar version space learning.",
            "Fuzzy multiattribute evaluation of R&D projects using a real options valuation model.",
            "Symbolic verification of multiagent graphical decision models.",
            "Intelligent social network analysis using granular computing.",
            "Guest editorial: Special issue on \"aggregation operators for information systems\".",
            "Web retrieval: Techniques for the aggregation and selection of queries and answers.",
            "Applying aggregation operators for information access systems: An application in digital libraries.",
            "Empirical assessment of a collaborative filtering algorithm based on OWA operators.",
            "A flexible model for the evaluation of soft conditional preferences in fuzzy databases.",
            "Ontological support for a measurement and evaluation framework."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2007",
        "info": "Volume 22, 2007",
        "count": 65,
        "papers": [
            "Recent advances in computational models of natural argument.",
            "Modeling naturalistic argumentation in research literatures: Representation and interaction design issues.",
            "Argumentation within deductive reasoning.",
            "A study of argumentation in a causal probabilistic humanistic domain: Genetic counseling.",
            "The eightfold way of deliberation dialogue.",
            "A human-computer debating system prototype and its dialogue strategies.",
            "A possibility theory-based approach to the handling of uncertain relations between temporal points.",
            "Quantization effects on the equilibrium behavior of combined fuzzy cognitive maps.",
            "On Elkan's theorems: Clarifying their meaning via simple proofs.",
            "An argument-dependent approach to determining OWA operator weights based on the rule of maximum entropy.",
            "nk-bags.",
            "Updating extended possibility-based fuzzy relational databases.",
            "Estimating the performance of multidimensional access methods based on nonoverlapping regions.",
            "Intelligent Fril/SQL interrogator.",
            "DynJAQ: An adaptive and flexible dynamic FAQ system.",
            "Investigating the potential of art neural network models for indexing and information retrieval.",
            "Hybrid flexible neural-tree-based intrusion detection systems.",
            "Assessment of four modifications of a novel indexing technique for case-based reasoning.",
            "Relevance in systems having a fuzzy-set-based semantics.",
            "Editorial: A special issue on e-service intelligence.",
            "Intelligent e-government services with personalized recommendation techniques.",
            "A multigranular linguistic content-based recommendation model.",
            "Handling linguistic web information based on a multi-agent system.",
            "Clustering web search results using fuzzy ants.",
            "Developing and assessing an intelligent forex rolling forecasting and trading decision support system for online e-service.",
            "Knowledge provision with intelligent e-services.",
            "Trust ontologies for e-service environments.",
            "Fuzzy multi-attribute cost-benefit analysis of e-services.",
            "Evaluating e-learning web site quality in a fuzzy environment.",
            "Flexible querying via if-sets.",
            "A method for fuzzy clustering with ordinal attributes.",
            "Using the moving average rule in a dynamic web recommendation system.",
            "Multicriteria group decision making under incomplete preference judgments: Using fuzzy logic with a linguistic quantifier.",
            "Preface to the special issue on advances in fuzzy database technology.",
            "A flexible approach to evaluating soft conditions with unequal preferences in fuzzy databases.",
            "About yes/no queries against possibilistic databases.",
            "Flexible querying of semistructured data: A fuzzy-set-based approach.",
            "Perspectives on ontology-based querying.",
            "Attribute-oriented fuzzy generalization in proximity- and similarity-based relational database systems.",
            "Managing fuzziness on conventional object-oriented platforms.",
            "Design and implementation of index structures for fuzzy spatial databases.",
            "A distributed adverse drug reaction detection system using intelligent agents with a fuzzy recognition-primed decision model.",
            "An evolutionary strategy for decremental multiobjective optimization problems.",
            "A fuzzy logic approach to experience-based reasoning.",
            "Solution of fuzzy matrix games: An application of the extension principle.",
            "Introduction: Genetic fuzzy systems.",
            "Local identification of prototypes for genetic learning of accurate TSK fuzzy rule-based systems.",
            "Improving interpretability in approximative fuzzy models via multiobjective evolutionary algorithms.",
            "Genetic fuzzy systems to evolve interaction strategies in multiagent systems.",
            "Fuzzy classifier system architectures for mobile robotics: An experimental comparison.",
            "Boosting fuzzy rules in classification problems under single-winner inference.",
            "Increasing fuzzy rules cooperation based on evolutionary adaptive inference systems.",
            "Pyramid collaborative filtering technique for an intelligent autonomous guide agent.",
            "A web-based high-performance multicriteria decision support system for medical diagnosis.",
            "Interactive knowledge management for agent-assisted web navigation.",
            "Active network architecture and management.",
            "Smart server: Concepts and applications.",
            "Information coverage in advisory brokers.",
            "A hybrid fuzzy cognitive model based on weighted OWA operators and single-antecedent rules.",
            "A model of an information retrieval system with unbalanced fuzzy linguistic information.",
            "Generalization of belief and plausibility functions to fuzzy sets based on the sugeno integral.",
            "Evaluation of design requirements using fuzzy outranking methods.",
            "Agent negotiation of target distribution enhancing system survivability.",
            "Effective database processing for classification and regression with continuous variables.",
            "Generalized consistency and intensity vectors for comparison matrices."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2006",
        "info": "Volume 21, 2006",
        "count": 68,
        "papers": [
            "Preface to the special issue on learning approaches for negotiation agents and automated negotiation.",
            "Agents that acquire negotiation strategies using a game theoretic learning theory.",
            "An evolutionary learning approach for adaptive negotiation agents.",
            "Dynamic pricing based on asymmetric multiagent reinforcement learning.",
            "Efficient methods for automated multi-issue negotiation: Negotiating over a two-part tariff.",
            "An arithmetic approach for the computing with words paradigm.",
            "Correlation coefficient for type-2 fuzzy sets.",
            "Relevancy transformation operators: Construction methods.",
            "An introduction of the condition class space with continuous value discretization and rough set theory.",
            "A majority model in group decision making using QMA-OWA operators.",
            "Comprehensive learning particle swarm optimizer for solving multiobjective optimization problems.",
            "Editorial note to the special issue on uncertainty processing.",
            "Toward a general theory of conditional beliefs.",
            "On transformations of belief functions to probabilities.",
            "Dempster-Shafer models for object recognition and classification.",
            "Independence and conditional possibility for strictly monotone triangular norms.",
            "Combining implicational quantifiers for equivalence ones by fuzzy connectives.",
            "A simulated annealing-based method for learning Bayesian networks from statistical data.",
            "Application of the Choquet integral to measures of information in possibility theory.",
            "Generalizing the conjunction rule for aggregating conflicting expert opinions.",
            "Noisy-or classifier.",
            "On the consistency of rule bases based on lattice-valued first-order logic LF(X).",
            "An alternative solution to the analytic hierarchy process.",
            "Fuzzy entropy on intuitionistic fuzzy sets.",
            "On identifying marker genes from gene expression data in a neural framework through online feature analysis.",
            "The uncertain OWA aggregation with weighting functions having a constant level of orness.",
            "Forecasting enrollments using high-order fuzzy time series and genetic algorithms.",
            "SOM-based estimation of climatic profiles.",
            "Fuzzy set methods for uncertainty management in intelligence analysis.",
            "Defeasible reasoning: A discussion of some intuitions.",
            "Project risk evaluation using a fuzzy analytic hierarchy process: An application to information technology projects.",
            "Exploiting decision theory concepts within clinical guideline systems: Toward a general approach.",
            "Reasoning about emotional agents.",
            "Mining predecessor-successor rules from DAG data.",
            "Inclusion measures, similarity measures, and the fuzziness of fuzzy sets and their relations.",
            "Experiences in evaluating multilingual and text-image information retrieval.",
            "Multimedia information retrieval based on spatiotemporal relationships using description logics for the semantic web.",
            "Using clustering methods to improve ontology-based query term disambiguation.",
            "Fast gradual matching measure for image retrieval based on visual similarity and spatial relations.",
            "EGO: A personalized multimedia management and retrieval tool.",
            "Mining for video production invariants to measure style similarity.",
            "Scene similarity measure for video content segmentation in the framework of a rough indexing paradigm.",
            "Video summaries generation and access via personalized delivery of multimedia presentations adapted to service and terminal.",
            "Visualization of N-dimensional performance maps.",
            "Approximate clustering in very large relational data.",
            "Optimal choice of granularity in commonsense estimation: Why half-orders of magnitude?",
            "Aggregation operators based on indistinguishability operators.",
            "Intentional dynamic systems: Fundamental concepts and applications.",
            "Dynamics of human neocortex that optimizes its stability and flexibility.",
            "Modeling hippocampal theta oscillation: Applications in neuropharmacology and robot navigation.",
            "Computation in a reduced KII network based on synchronization.",
            "Contrast enhancement and background suppression of chemosensor array patterns with the KIII model.",
            "Aperiodic dynamics and the self-organization of cognitive maps in autonomous agents.",
            "The task selection mechanism for interactive robots: Application to the intelligent life supporting system.",
            "Evolution of spiking neural circuits in autonomous mobile robots.",
            "Energy-based swing-back control for continuous brachiation of a multilocomotion robot.",
            "Parameterized additive neat OWA operators with different orness levels.",
            "Integration on finite sets.",
            "Comparing representative selection strategies for dissimilarity representations.",
            "Ontology-enabled validation of connectivity relationships in a home theater system.",
            "Matilda: A visual tool for modeling with Bayesian networks.",
            "An argument-based decision support system for assessing natural language usage on the basis of the web corpus.",
            "A fuzzy preference-ranking model for a quality evaluation of hospital web sites.",
            "Introducing fuzziness in object models and database interfaces through aspects.",
            "Intelligent evolutionary design: A new approach to optimizing complex engineering systems and its application to designing heat exchangers.",
            "Fuzzy logic-based networks: A study in logic data interpretation.",
            "Economics-inspired decentralized control approach for adaptive grid services and applications.",
            "A C-OWA operator-based approach to decision making with interval fuzzy preference relation."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2005",
        "info": "Volume 20, 2005",
        "count": 67,
        "papers": [
            "Fuzzy coherence measures.",
            "Dominance relation and rules in an incomplete ordered information system.",
            "A unified logical model for CBR-based e-commerce systems.",
            "Aspect graphs for three-dimensional object recognition machine vision systems.",
            "Mining interesting sequential patterns for intelligent systems.",
            "European option pricing under fuzzy environments.",
            "Structure and stability analysis of general Mamdani fuzzy dynamic models.",
            "Preface to the special issue on soft computing for modeling, simulation, and control of nonlinear dynamical systems.",
            "Hybrid learning architecture for fuzzy control of quadruped walking robots.",
            "Robust adaptive fuzzy control for permanent magnet synchronous servomotor drives.",
            "Adaptive recurrent neural network control of biological wastewater treatment.",
            "Hybrid fuzzy control of the inverted pendulum via vertical forces.",
            "A direct adaptive neural control scheme with integral terms.",
            "Toward a framework for the specification of hybrid fuzzy modeling.",
            "A scalable fuzzy interference canceler for DS-CDMA systems.",
            "Face recognition using modular neural networks and the fuzzy Sugeno integral for response integration.",
            "Black box evolutionary mathematical modeling applied to linear systems.",
            "On contra-symmetry and MPT conditionality in fuzzy logic.",
            "Extracting causation knowledge from natural language texts.",
            "Mining interval sequential patterns.",
            "Relational mountain (density) clustering method and web log analysis.",
            "An approach to measure the robustness of fuzzy reasoning.",
            "Autonomous granulation using the Mountain Method.",
            "Learning cooperative linguistic fuzzy rules using the best-worst ant system algorithm.",
            "Extending multicriteria decision making by mixing t-norms and OWA operators.",
            "Preface to special issue on robotics and computer vision.",
            "Development of the control architecture of an underwater cable tracker.",
            "A solution for integrating map building and self localization strategies in mobile robotics.",
            "Evolving a multiagent system for landmark-based robot navigation.",
            "Retrieval of IVUS images using contextual information and elastic matching.",
            "Feature extraction for nearest neighbor classification: Application to gender recognition.",
            "An iterative region-growing algorithm for motion segmentation and estimation.",
            "Short-term electric power load forecasting based on cosine radial basis function neural networks: An experimental evaluation.",
            "Design and implementation of a web mining system for organizing search engine results.",
            "Methods of case adaptation: A survey.",
            "Answers to queries concerning uncertain and imprecise information in fuzzy relational databases.",
            "Preface to special issue on knowledge discovery: Dedicated to Jan M. Zytkow.",
            "Unified algorithm for undirected discovery of exception rules.",
            "Decision trees with optimal joint partitioning.",
            "Action rules mining.",
            "Automated discovery of chronological patterns in long time-series medical datasets.",
            "The EDAM project: Mining atmospheric aerosol datasets.",
            "Alternative form of Dempster's rule for binary variables.",
            "Shape understanding system: Visual intelligence tests.",
            "The accounting system as an algebraic automaton.",
            "An overview of methods for determining OWA weights.",
            "Hierarchical spatial relation based on a contiguity graph.",
            "Beliefs, obligations, intentions, and desires as components in an agent architecture.",
            "Tuning the matching function for a threshold weighting semantics in a linguistic information retrieval system.",
            "Minimality of a solution update in conflict resolution: An application of revision programming to the von Neumann-Morgenstern approach.",
            "Abductive case-based reasoning.",
            "Filter- versus wrapper-based feature selection for credit scoring.",
            "On a similarity measure between LR-type fuzzy numbers and its application to database acquisition.",
            "On the meta-knowledge choquet integral and related models.",
            "Concurrent Q-learning: Reinforcement learning for dynamic goals and environments.",
            "Complexity and compilability of diagnosis and recovery of graph-based systems.",
            "Scalable algorithms for clustering large datasets with mixed type attributes.",
            "Preface to the special issue on introduction to software engineering with computational intelligence.",
            "A fuzzy-based multimodel system for reasoning about the number of software defects.",
            "Development of applications with fuzzy objects in modern programming platforms.",
            "University timetabling through conceptual modeling.",
            "A multigranular hierarchical linguistic model for design evaluation based on safety and cost analysis.",
            "Handling threats, rewards, and explanatory arguments in a unified setting.",
            "Study on battlespace ontology construction approach.",
            "Ant colony optimization of clustering models.",
            "Preference solutions of probability decision making with rim quantifiers.",
            "Graded tableaux for Rational Pavelka Logic."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2004",
        "info": "Volume 19, 2004",
        "count": 76,
        "papers": [
            "Intelligent technologies: An introduction.",
            "Animating plant growth in L-system by parametric functional symbols.",
            "High-level synthesis by dynamic ant.",
            "Checking identities is computationally intractable NP-hard and therefore human provers will always be needed.",
            "Virtual path signature: An approach for flexible searching in object-oriented databases.",
            "Extraction of building product image from the Web.",
            "On the semantics of unified modeling language diagrams using Z notation.",
            "Toward reasoning with unified modeling language diagrams based on extensible markup language declarative description theory.",
            "On probabilistic methods in fuzzy theory.",
            "Automation in cotton ginning.",
            "Iterative cross-training: An algorithm for learning from unlabeled Web pages.",
            "Applying passage in Web text mining.",
            "Formal specification synthesis for relational database model.",
            "Rational constraints for fusion methods in metasearch engine systems.",
            "Refining web search engine results using incremental clustering.",
            "An intelligent news recommender agent for filtering and categorizing large volumes of text corpus.",
            "Weighted triangular norms using generating functions.",
            "Induced ordered weighted geometric operators and their use in the aggregation of multiplicative preference relations.",
            "Handling indefinite and maybe information in logical fuzzy relational databases.",
            "A requirement specification language for configuration dynamics of multiagent systems.",
            "Recent developments in intelligent systems.",
            "Adaptive multiresolution and wavelet-based search methods.",
            "High-confidence control: Ensuring reliability in high-performance real-time systems.",
            "Flexible models with evolving structure.",
            "Memory effects description by neural networks with delayed feedback connections.",
            "The selection and infusion of autonomy technologies for Mars rovers.",
            "Hybrid intelligent systems for industrial data analysis.",
            "An agent-based approach for managing e-commerce activities.",
            "Temporal inference of workflow systems based on time petri nets: Quantitative and qualitative analysis.",
            "Determining the importance weights for the design requirements in the house of quality using the fuzzy analytic network approach.",
            "Defeasible logic with dynamic priorities.",
            "Ranking of alternatives with ordered weighted averaging operators.",
            "A correlation coefficient for intuitionistic fuzzy sets.",
            "Involutive monoidal t-norm based logic and R0 logic.",
            "Some notes on fusion of uncertain information.",
            "Flexible constraints for regularization in learning from data.",
            "Intelligence benevolent tools: A global system automating integration of structured and semistructured sources in one process.",
            "Special issue on granular computing and data mining.",
            "Rough set spatial data modeling for data mining.",
            "A data warehouse/online analytic processing framework for web usage mining and business intelligence reporting.",
            "Fuzzy information granules in time series data.",
            "Subsessions: A granular approach to click path analysis.",
            "Generalizations of multisets and rough approximations.",
            "Associations and rules in data mining: A link analysis.",
            "On conjoint analysis by rough approximations based on dominance relations.",
            "Belief, plausibility, and probability measures on interval-valued type 2 fuzzy sets.",
            "Editorial.",
            "Efficient probabilistic reasoning in BNs with mutual exclusion and context-specific independence.",
            "An extension of the differential approach for Bayesian network inference to dynamic Bayesian networks.",
            "Toward better scoring metrics for pseudo-independent models.",
            "The marginal factorization of Bayesian networks and its application.",
            "Editorial.",
            "Databases for interval probabilities.",
            "A stratified first order logic approach for access control.",
            "Belief revision and information fusion on optimum entropy.",
            "A novel ecological network-based computation platform as a grid middleware system.",
            "A knowledge server for reasoning about temporal constraints between classes and instances of events.",
            "A knowledge server for reasoning about temporal constraints between classes and instances of events.",
            "Shape-understanding system: A system of experts.",
            "A hybrid neural network for input that is both categorical and quantitative.",
            "Guest editorial: Intelligent and soft computing techniques for information processing.",
            "On the semantics of perception-based fuzzy logic deduction.",
            "Optimal fuzzy reasoning and its robustness analysis.",
            "Shortest paths in fuzzy weighted graphs.",
            "Fuzzy sets approaches to statistical parametric and nonparametric tests.",
            "Efficient discovery of functional dependencies with degrees of satisfaction.",
            "Multidimensional fuzzy partitioning of attribute ranges for mining quantitative data.",
            "Dynamic footprint-based person recognition method using a hidden markov model and a neural network.",
            "Reduction of the decision table: A rough approach.",
            "Probable equivalence, superpower sets, and superconditionals.",
            "a-Cut fuzzy control charts for linguistic data.",
            "Cost-sensitive learning and decision making for massachusetts pip claim fraud data.",
            "On the methods of decision making under uncertainty with probability information.",
            "Ordered incremental training with genetic algorithms.",
            "Performance comparison between the training method and the numerical method of the orthogonal neural network in function approximation.",
            "A new approach to mining fuzzy databases using nearest neighbor classification by exploiting attribute hierarchies."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2003",
        "info": "Volume 18, 2003",
        "count": 74,
        "papers": [
            "Special issue on the dempster-shafer theory of evidence: an introduction.",
            "Analyzing linear regression models with hints and the dempster-shafer theory.",
            "Implementing belief function computations.",
            "A conceptual framework and belief-function approach to assessing overall information quality.",
            "The conjunction fallacy: explanations of the linda problem by the theory of hints.",
            "Probabilistic argumentation systems: a new perspective on the dempster-shafer theory.",
            "General framework for multidimensional models.",
            "Supporting knowledge elicitation and consensus building for dempster-shafer decision models.",
            "Probabilistic graphical models.",
            "Triangulation of Bayesian networks by retriangulation.",
            "Efficient computation for the noisy MAX.",
            "Modularizing inference in large causal probabilistic networks.",
            "Novel strategies to approximate probability trees in penniless propagation.",
            "Learning Bayesian networks in the space of structures by estimation of distribution algorithms.",
            "An iterated local search algorithm for learning Bayesian networks with restarts based on conditional independence tests.",
            "Qualitative combination of Bayesian networks.",
            "An information retrieval model based on simple Bayesian networks.",
            "Complexity of decision-theoretic troubleshooting.",
            "Cooperative management of a net of intelligent surveillance agent sensor.",
            "A taxonomy for the crossover operator for real-coded genetic algorithms: An experimental study.",
            "Emergence of self-learning fuzzy systems by a new virus DNA-based evolutionary algorithm.",
            "Representation of the subjective evaluation of the fabric hand using fuzzy techniques.",
            "A logical foundation for the case-based reasoning cycle.",
            "From information to probability: An axiomatic approach - Inference isinformation processing.",
            "Clustering with artificial neural networks and traditional techniques.",
            "Toward a comprehensive treatment of temporal constraints about periodic events.",
            "Majority additive-ordered weighting averaging: A new neat ordered weighting averaging operator based on the majority process.",
            "Computational intelligence for decision-making systems.",
            "A rough set view on Bayes' theorem.",
            "Generalized rough approach to reduction of a decision table.",
            "Design of the fuzzy multiobjective controller based on the eligibility method.",
            "A fuzzy goal programming procedure for solving quadratic bilevel programming problems.",
            "A new perspective on reasoning with fuzzy rules.",
            "Learning fuzzy rules for controllers with genetic algorithms.",
            "A compositional reasoning system for executing nonmonotonic theories of reasoning.",
            "Probabilistic and fuzzy methods for information fusion in data mining.",
            "Median-based aggregation operators for prototype construction in ordinal scales.",
            "Segmentation and classification of biological cell images by a multifractal approach.",
            "Rough reduction in algebra view and information view.",
            "A study of the origin and uses of the ordered weighted geometric operator in multicriteria decision making.",
            "Editorial: Preference modeling and applications: EUROFUSE 2001.",
            "Constructing linguistic versions for the multicriteria decision support systems preference ranking organization method for enrichment evaluation I and II.",
            "Growing decision trees in an ordinal setting.",
            "A characterization of generalized concordance rules in multicriteria decision making.",
            "A relational analysis of decision makers' preferences.",
            "Modeling users' preferences in systems for information access.",
            "LAMA: A linguistic aggregation of majority additive operator.",
            "An interpretation of focal elements as fuzzy sets.",
            "A consensus-reaching process under intuitionistic fuzzy preference relations.",
            "Erratum.",
            "Algorithms to extend crisp functions and their inverse functions to fuzzy numbers.",
            "A case-based reasoning approach to support story summarization.",
            "Forecasting the leading index using fuzzy linguistic prediction.",
            "How to build aggregation operators from data.",
            "Generalized belief function, plausibility function, and Dempster's combinational rule to fuzzy sets.",
            "Semantic-based aggregation for statistical disclosure control.",
            "An overview of operators for aggregating information.",
            "Parameterized fuzzy operators in fuzzy decision making.",
            "Approaches to knowledge reductions in inconsistent systems.",
            "Model-based reliability and diagnostics: A common framework for reliability and diagnostics.",
            "The introduction and utilization of (l, u)-graphs in the extended variable precision rough sets model.",
            "Which truth values in fuzzy logics are definable?",
            "Reformulated radial basis function neural networks with adjustable weighted norms.",
            "Model-based fault detection and isolation method using ART2 neural network.",
            "A fuzzy median-of-intercept straight-line algorithm for use in noisy images.",
            "Inflating examples to obtain rules.",
            "Generalized state equation of Petri Nets with priority.",
            "Idea divergent editor using analogy: The IDEA system.",
            "Incremental learning of collaborative classifier agents with new class acquisition: An incremental genetic algorithm approach.",
            "Aggregation of T-transitive relations.",
            "Building classification trees using the total uncertainty criterion.",
            "Constructing deliberative agents with case-based reasoning technology.",
            "On open-set lattices and some of their applications in semantics.",
            "Formal semantics of meta-level architectures: Temporal epistemic reflection."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2002",
        "info": "Volume 17, 2002",
        "count": 66,
        "papers": [
            "A framework for defining and learning fuzzy behaviors for autonomous mobile robots.",
            "A fuzzy c-medians variant for the generation of fuzzy term sets.",
            "Using a neural network in the software testing process.",
            "Analyzing the 24-hour blood pressure and heart-rate variability with self-organizing feature maps.",
            "Hybrid identification of fuzzy rule-based models.",
            "Triangular norms by Erich Peter Klement, Radko Mesiar, and Endre Pap.",
            "A rough set approach to knowledge discovery.",
            "Reducts-driven query answering for distributed autonomous knowledge systems.",
            "A comparison of three closest fit approaches to missing attribute values in preterm birth data.",
            "Visualization of dynamic systems with performance maps: A rough computing approach.",
            "Rough approximation by dominance relations.",
            "Granular computing with shadowed sets.",
            "Nonhierarchical document clustering based on a tolerance rough set model.",
            "Attribute transformations for data mining I: Theoretical explorations.",
            "Attribute transformations for data mining II: Applications to economic and stock market data.",
            "Conflict analysis.",
            "Expert media approach to hearing aids fitting.",
            "Similarity and metrics in case-based reasoning.",
            "A new approach for stabilizing nonlinear systems with time delays.",
            "Two-dimensional occluded object matching using petri nets.",
            "Data dependencies in extended possibility-based fuzzy relational databases.",
            "Integrating fuzzy topological maps and fuzzy geometric maps for behavior-based robots.",
            "Fuzzy modeling of a thermal solar plant.",
            "A parallel algorithm for the eight-puzzle problem using analogical reasoning.",
            "Continuous classifying associative memory.",
            "Fuzzy data compression based on data dependencies.",
            "Extended possibilistic truth values.",
            "Special issue on hierarchical fuzzy systems.",
            "Fuzzy behavior hierarchies for multi-robot control.",
            "On the role of context in hierarchical fuzzy controllers.",
            "A structure identification method of submodels for hierarchical fuzzy modeling using the multiple objective genetic algorithm.",
            "Hierarchical fuzzy modeling and jointly expandable functions.",
            "A review of the construction of hierarchical fuzzy systems.",
            "Formal semantics of meta-level architectures: Dynamic control of reasoning.",
            "The uncertain OWA operator.",
            "Implied trees in illiquid markets: A Choquet pricing approach.",
            "Tracking a partially occluded target with a cluster of Kalman filters.",
            "Storage of linguistic information in a continuous classifying associative memory.",
            "Applying a fuzzy sets-based heuristic to the protein structure prediction problem.",
            "Semantic formalization of interactive reasoning functionality.",
            "On the valuation of alternatives for decision-making under uncertainty.",
            "The ordered weighted geometric averaging operators.",
            "Introduction: Intelligent systems for process monitoring and diagnosis.",
            "Heuristic, systematic, and informational regularization for process monitoring.",
            "A hybrid fuzzy-fractal approach for time series analysis and plant monitoring.",
            "Plant diagnostics by transient classification: The ALADDIN approach.",
            "Hidden Markov model-based real-time transient identifications in nuclear power plants.",
            "An application of genetic algorithms to surveillance test optimization of a PWR auxiliary feedwater system.",
            "Editorial introduction.",
            "Fuzzy unification and first order probabilistic logic.",
            "A similarity-based resolution rule.",
            "Uncertain fuzzy values still in the framework of first-order logi.",
            "Towards an automated deduction system for first-order possibilistic logic programming with fuzzy constants.",
            "Handling fuzzy information in extended possibility-based fuzzy relational databases.",
            "Direct fuzzy model-reference adaptive control.",
            "A strategy of matching blocks at multi-levels.",
            "Fuzzy reasoning based on generalized fuzzy If-Then rules.",
            "Dynamics and control in component-based agent models.",
            "The induced fuzzy integral aggregation operator.",
            "Comparing a genetic fuzzy and a neurofuzzy classifier for credit scoring.",
            "Implicit predicates for handling disjunctive fuzzy information in fuzzy databases.",
            "Orthogonal relations for reasoning about posets.",
            "A parallel approach to the Eulerian cycle problem.",
            "A new universal approximation result for fuzzy systems, which reflects CNF DNF duality.",
            "Generating indistinguishability operators from prototypes.",
            "On the dynamics of default reasoning."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2001",
        "info": "Volume 16, 2001",
        "count": 78,
        "papers": [
            "A rough set approach to reasoning about data.",
            "Drawing conclusions from data - The rough set way.",
            "Induction of decision rules in classification and discovery-oriented perspectives.",
            "Three discretization methods for rule induction.",
            "Refining classifiers with neural networks.",
            "Information granules: Towards foundations of granular computing.",
            "Information granulation and rough set approximation.",
            "Comparative study of alternative types of knowledge reduction in inconsistent systems.",
            "Roughian: Rough information analysis.",
            "Rough sets in hybrid methods for pattern recognition.",
            "A regression methodology to induce a fuzzy model.",
            "Measuring the quality of queries in the fuzzy relational databases.",
            "Allowing two moves in succession increases the game's bias: A theorem.",
            "Web traffic demand forecasting using wavelet-based multiscale decomposition.",
            "Sequencing via explanation-based learning.",
            "Special issue on verification and validation issues in databases, knowledge-based systems, and ontologies.",
            "An extendible language for database schema refinement transformations.",
            "Optimizing fragment constraints - A performance evaluation.",
            "An integrity constraint for database systems containing embedded static neural networks.",
            "Checking depth-limited consistency and inconsistency in knowledge-based systems.",
            "Toward logical analysis of tabular rule-based systems.",
            "Verification of multiple agent knowledge-based systems.",
            "The role of ontologies in the verification and validation of knowledge-based systems.",
            "Evaluation of ontologies.",
            "Functional ontology artifacts: Existent and emergent knowledge.",
            "Verification, validation, and integrity issues in expert and database systems: Two perspectives.",
            "A localized protein-folding problem.",
            "A soft K-nearest neighbor voting scheme.",
            "Fuzzy reasoning based on the extension principle.",
            "Dempster-Shafer belief structures with interval valued focal weights.",
            "Aggregation of linguistic labels when semantics is based on antonyms.",
            "Using contextual analysis for news event detection.",
            "On learning discontinuous human control strategies.",
            "Automating the construction of CBR systems using kernel methods.",
            "On dynamically generated ontology translators in agent communication.",
            "Using fuzzy logic to match strings in documents.",
            "Evolutionary learning of dynamic probabilistic models with large time lags.",
            "On representation and approximation of operations in Boolean algebras.",
            "Computational verb systems: Verb numbers.",
            "A survey of defuzzification strategies.",
            "Conceptual design of fuzzy object-oriented databases using extended entity-relationship model.",
            "Relaxing the universal quantifier of the division in fuzzy relational databases.",
            "Approximate knowledge modeling and classification in a frame-based language: The system CAIN.",
            "Uncertain inheritance and recognition as probabilistic default reasoning.",
            "Introduction: Extending fuzzy theory to object-oriented modeling.",
            "A note on current approaches to extending fuzzy logic to object-oriented modeling.",
            "Graph-based interaction in a fuzzy object oriented database.",
            "Fuzzy extensions for relationships in a generalized object model.",
            "A strategy for adding fuzzy types to an object-oriented database system.",
            "Semantic data modeling of spatiotemporal database applications.",
            "Processing of domain experts' knowledge for development of a KBS for risk analysis.",
            "Integrating WordNet knowledge to supplement training data in semi-supervised agglomerative hierarchical clustering for text categorization.",
            "Discover dependency pattern among attributes by using a new type of nonlinear multiregression.",
            "Comparison of the performances of decision aimed algorithms with Bayesian and beliefs basis.",
            "Systematic design method of stabilization fuzzy controllers for pendulum systems.",
            "Product category description for web-shopping in e-commerce.",
            "Knowledge discovery in a direct marketing case using least squares support vector machines.",
            "A neural network approach to tiling problems.",
            "Computational verb systems: The paradox of the liar.",
            "A comparison of active set method and genetic algorithm approaches for learning weighting vectors in some aggregation operators.",
            "Financial laws as algebraic automata.",
            "Fusion: General concepts and characteristics.",
            "Situation assessment based on spatially ambiguous multisensor measurements.",
            "Data association in multi-target detection using the transferable belief model.",
            "Conference paper assignment.",
            "Merging databases: Problems and examples.",
            "Merging regulations: Analysis of a practical example.",
            "Using the transferable belief model and a qualitative possibility theory approach on an illustrative example: The assessment of the value of a candidate.",
            "The correlation problem in sensor fusion in a possibilistic framework.",
            "Information fusion in the context of stock index prediction.",
            "Fusion of symbolic knowledge and uncertain information in robotics.",
            "A new approach for stabilizing a TS model fuzzy system.",
            "An intelligent fuzzy sliding mode control system with application on precision table positioning.",
            "An artificial neural network satisfiability tester.",
            "Properties and performance of orthogonal neural network in function approximation.",
            "Designs and analyses of various fuzzy controllers with region-wise linear PID subcontrollers.",
            "Fusing object information and peer information.",
            "Nearest prototype classifier designs: An experimental study."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "2000",
        "info": "Volume 15, 2000",
        "count": 62,
        "papers": [
            "Fuzzy cognitive mapping: Applications in education.",
            "MORSE: A general model to represent structured knowledge.",
            "Using domain knowledge to optimize the knowledge discovery process in databases.",
            "Entropy and MDL discretization of continuous variables for Bayesian belief networks.",
            "A multiple approach to data analysis and uncertainty management in knowledge-based systems.",
            "Nonstandard analysis and Dempster-Shafer theory.",
            "Epistemic logic and logical omniscience II: A unifying framework.",
            "Introduction: The first Catalan conference on artificial intelligence.",
            "On logical connectives for a fuzzy set theory with or without nonempty self-contradictions.",
            "Autonomous robot navigation using human spatial concepts.",
            "Inquirers: A general model of non-ideal rational agents.",
            "An infrastructure for agent-based systems: An interagent approach.",
            "Constructive reinforcement learning.",
            "Fuzzy heterogeneous neurons for imprecise classification problems.",
            "Belief-function representation of statistical audit evidence.",
            "A neural network approach to adaptive protective systems problem in the complex power generating units.",
            "A fuzzy noise-smoothing filter.",
            "Multiple priorities in an induced ordered weighted averaging operator.",
            "Mountain and subtractive clustering method: Improvements and generalizations.",
            "A fuzzy information space approach to speech signal non-linear analysis.",
            "Stabilizing and robustifying the learning mechanisms of artificial neural networks in control engineering applications.",
            "Fuzzy rough set techniques for uncertainty processing in a relational database.",
            "On Chu spaces in uncertainty analysis.",
            "A comparison of stochastic optimization techniques for image segmentation.",
            "The concept of evidence.",
            "An interval-based temporal algebra based on binary encoding of point relations.",
            "Symbolic picture retrieval by relative-metric spatial relations.",
            "Incorporating domain knowledge into attribute-oriented data mining.",
            "CLAM: A new model of associative memory.",
            "Fuzzy systems are universal approximators for a smooth function and its derivatives.",
            "Merging fuzzy logic, neural networks, and genetic computation in the design of a decision-support system.",
            "Extracting rules from a (fuzzy/crisp) recurrent neural network using a self-organizing map.",
            "A note on the refinement of ontologies.",
            "Data mining for text categorization with semi-supervised agglomerative hierarchical clustering.",
            "When QM-operators are implication functions and conditional fuzzy relations.",
            "Design of mode-to-mode fuzzy controllers.",
            "Mining fuzzy association rules and fuzzy frequency episodes for intrusion detection.",
            "Semantic measure of fuzzy data in extended possibility-based fuzzy relational databases.",
            "Future profiling of time series behavior.",
            "Knowledge discovery in distributed databases using evidence theory.",
            "Fuzzy stochastic dynamic programming for marketing decision support.",
            "Improving a neuro-fuzzy classifier using exploratory factor analysis.",
            "Computing with words in formal methods.",
            "Reasoning tractably about explicit belief: A model-theoretic approach.",
            "Multi-agent distributed intelligent system based on fuzzy decision making.",
            "Conservative extension concepts for nonmonotonic knowledge bases.",
            "Optimization issues in predictive control with fuzzy objective functions.",
            "Genetic algorithms for scene interpretation from prototypical semantic description.",
            "Rough sets in hybrid methods for pattern recognition.",
            "Designing interval type-2 fuzzy logic systems using an SVD-QR method: Rule reduction.",
            "Why clustering in function approximation? Theoretical explanation.",
            "Relating decision under uncertainty and multicriteria decision making models.",
            "On ordering fuzzy numbers.",
            "Modeling linguistic qualifiers of uncertainty in a fuzzy database.",
            "Granular worlds: Representation and communication problems.",
            "Penniless propagation in join trees.",
            "Fuzzy types: A new concept of type for managing vague structures.",
            "Computational verb systems: Verb predictions and their applications.",
            "Prototyping structural description using an inductive learning program.",
            "Generating domain knowledge for requirement analysis based on acquisition ontology.",
            "Adaptive fuzzy learning control for a class of nonlinear dynamic systems.",
            "Task-based conceptual graphs as a basis for automating software development."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1999",
        "info": "Volume 14, 1999",
        "count": 64,
        "papers": [
            "Introduction: Decision theory in a fuzzy environment.",
            "Recursive connective rules.",
            "Solving a decision problem with graded rewards.",
            "Qualitative possibility theory and its applications to constraint satisfaction and decision under uncertainty.",
            "Soft consensus and network dynamics in group decision making.",
            "Involving objective and subjective aspects in multistage decision making and control under fuzziness: Dynamic programming and neural networks.",
            "A decision making approach to relevance feedback in information retrieval: A model based on soft consensus dynamics.",
            "A generalized OWA operator.",
            "Pattern recognition with evidential knowledge.",
            "A state space analysis of propose-and-revise.",
            "On the semantics of qualitative attributes in knowledge elicitation.",
            "A Fuzzy Kth ordered statistic.",
            "How to divide a territory? A new simple differential formalism for optimization of set functions.",
            "The important properties and applications of the adaptive weighted fuzzy mean filter.",
            "Determining the incremental worth of members of an aggregate set through difference-based induction.",
            "On antonym and negate in fuzzy logic.",
            "A multiagent architecture for fuzzy modeling.",
            "Fuzzy logic as a basis for reusing task-based specifications.",
            "Geographical data analysis via mountain function.",
            "Querying fuzzy relational databases through fuzzy domain calculus.",
            "Invariance properties of ordinal OWA operators.",
            "Granular computing in the development of fuzzy controllers.",
            "A theoretical framework for the conception of agency.",
            "Measuring information in possibilistic logic.",
            "Modeling default behavior in the presence of information and its application to the route choice problem.",
            "Efficient computation of marginal probabilities in multivalued causal inverted multiway trees given incomplete information.",
            "Fuzzy Dempster-Shafer reasoning for rule-based classifiers.",
            "A neuro-propositional model of language processing.",
            "A formal framework for image indexing with triples: Toward a concept-based image retrieval.",
            "A fuzzy object-oriented data model for managing vague and uncertain information.",
            "Intelligent synchronized robot/conveyor system.",
            "Constructing belief networks from realistic data.",
            "Network-based decision making via generalized fuzzy integral operators.",
            "Introduction: Threads in fuzzy Petri nets research.",
            "Petri net model with fuzzy timing and fuzzy-metric temporal logic.",
            "Fuzzy time semirings and fuzzy-timing colored Petri nets.",
            "Enhanced fuzzy temporal rules and their projection onto fuzzy Petri nets.",
            "Approximate real-time decision making: Concepts and rough fuzzy Petri net models.",
            "On possibilistic timed safe Petri nets.",
            "Hierarchical fuzzy Petri nets and α-level sets inference.",
            "A method to make some fuzzy relations T-transitive.",
            "Averaging operators on the unit interval.",
            "On the unidimensional fuzzy equivalence relations.",
            "t-Operators and uninorms on a finite totally ordered set.",
            "On hierarchically S-decomposable fuzzy measures.",
            "Propositional fuzzy logics: Decidable for some (algebraic) operators; undecidable for more complicated ones.",
            "Using genetic algorithms to determine nonnegative monotone set functions for information fusion in environments with random perturbation.",
            "Intelligent content-based document delivery via automatic filtering profile generation.",
            "Linguistic hedges and the generalized modus ponens.",
            "Completing open logic programs by constructive induction.",
            "Formal specification of beliefs in multi-agent systems.",
            "A mass assignment method for prototype induction.",
            "Computational verb systems: Verb logic.",
            "On some relationships between hierarchies of quasiarithmetic means and neural networks.",
            "Hierarchical distributed genetic algorithms.",
            "MOGUL: A methodology to obtain genetic fuzzy rule-based systems under the iterative rule learning approach.",
            "A neuro-fuzzy system for inferencing.",
            "Fuzzy moves using normal fuzzy reasoning with fuzzy knowledge discovery.",
            "A novel logical neuron model.",
            "Methods for the Construction of Membership Functions.",
            "An application of Yager's bag theory in multicriteria based decision making problems.",
            "A class of fuzzy measures generated from a Dempster-Shafer belief structure.",
            "On ranking fuzzy numbers using valuations.",
            "A comparative study of uncertainty methods for legal reasoning."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1998",
        "info": "Volume 13, 1998",
        "count": 63,
        "papers": [
            "Logics with approximate premises.",
            "On the design of neural-fuzzy control system.",
            "Data fusion modeling human behavior.",
            "Extension from a linear associative memory to a linguistic linear associative memory.",
            "An analytic characterization of some aggregation operators.",
            "An OWA operator with fuzzy ranks.",
            "Informational independence: Models and normal forms.",
            "Introduction: FLINS'96.",
            "Intelligent systems in nuclear applications.",
            "Application of the transferable belief model to diagnostic problems.",
            "Identification of hidden failures in process control systems based eon the HMG method.",
            "Nondeterministic aggregation operators and systems.",
            "Learning-based similarity measurement for fuzzy sets.",
            "Speed-up of the Monte Carlo method by using a physical model of the Dempster-Shafer theory.",
            "Sugeno, Mamdani, and fuzzy Mamdani controllers put in a uniform interpolation framework.",
            "Constructing fuzzy controllers with B-spline models - Principles and applications.",
            "Discussion on soft computing at FLINS'96.",
            "Averaging linguistic truth values in fuzzy approximate reasoning.",
            "Some learning techniques in hierarchical censored production rules (HCPRs) system.",
            "Fuzzy set modelling in case-based reasoning.",
            "Primary-fuzzy-sets-based normal fuzzy reasoning methodology and its applications.",
            "Approximate reasoning with linguistic modifiers.",
            "Consistency for uncertainty measures.",
            "Computational limitations of model-based recognition.",
            "Fuzzy implication can be arbitrarily complicated: A theorem.",
            "Introduction: Hybrid intelligent adaptive systems.",
            "Hybrid intelligent adaptive systems: A framework and a case study on speech recognition.",
            "A proposal of abductive inference with degrees of manifestations.",
            "Evolutionary modular neural networks for intelligent systems.",
            "Error prediction for neural networks by fuzzification.",
            "Adaptive-intelligent control by neural-net systems.",
            "Integration of connectionist methods and chaotic time-series analysis for the prediction of process data.",
            "On the development of an intelligent control system for recombinant cell culture.",
            "Toward learning individual characteristics in a hybrid neuro-fuzzy wheelchair controller.",
            "A neuro-controller for synchronization of two motion axes.",
            "A rule-based approach to producing Z specifications from Jackson system development.",
            "Note on ranking fuzzy triangular numbers.",
            "An approach to everyday language computing - An application to forecast of atmospheric pressure distribution.",
            "The integrity constraints for similarity-based fuzzy relational databases.",
            "New modes of OWA information fusion.",
            "On the possibility of using complex values in fuzzy logic for representing inconsistencies.",
            "The role of assumptions in knowledge engineering.",
            "Engineering of highly autonomous biosystems: Review of the relevant literature.",
            "Stratification for default logic variants.",
            "From ordered beliefs to numbers: How to elicit numbers without asking for them (doable but computationally difficult).",
            "Logical inference of clauses based on Petri net models.",
            "Reasoning with incomplete information in a multivalued multiway causal tree using the maximum entropy formalism.",
            "Some neural net realizations of fuzzy reasoning.",
            "Introduction: Genetic fuzzy systems.",
            "Genetic-based on-line learning for fuzzy process control.",
            "Artificial evolution of fuzzy rule bases which represent time: A temporal fuzzy classifier system.",
            "Context adaptation in fuzzy processing and genetic algorithms.",
            "Learning fuzzy control by evolutionary and advantage reinforcements.",
            "Fuzzy clustering with evolutionary algorithms.",
            "Crossing unordered sets of rules in evolutionary fuzzy controllers.",
            "Multistage control of a stochastic system in a fuzzy environment using a genetic algorithm.",
            "Genetic learning of fuzzy rule-based classification systems cooperating with fuzzy reasoning methods.",
            "Introduction: Multimedia computing systems.",
            "Collaborative multimedia documents: Authoring and presentation.",
            "Optimization issues in multimedia systems.",
            "A parallel disk storage system for real-time multimedia applications.",
            "Operating system support for distributed multimedia.",
            "Analysis of multipoint videoconferencing under reroutable route-configuration assignment."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1997",
        "info": "Volume 12, 1997",
        "count": 49,
        "papers": [
            "A general approach to the fusion of imprecise information.",
            "A CyberOrganism model for awareness in collaborative communities on the Internet.",
            "Epistemic logic and logical omniscience: A survey.",
            "Multilayer fuzzy control of multivariable systems by active decomposition.",
            "A knowledge level analysis of taxonomic domains.",
            "Intelligent systems modeling with reusable fuzzy objects.",
            "The weighted OWA operator.",
            "Task structures as a basis for modeling knowledge-based systems.",
            "Visibility inference based on spatial knowledge representation from observer's perspective.",
            "Magic sets and stratified databases.",
            "A note on a fuzzy measure of typicality.",
            "System identification for chaotic integrate-and-fire dynamics.",
            "A digital application of chaotic oscillation modes in Josephson circuit.",
            "A nonlinear prediction technique for parametrized families of chaotic dynamics.",
            "Chaotic processes in taste recognition.",
            "Experimental study on arranging music by chaotic neural network.",
            "Effect of noise on chaotic behavior in Roessler-type nonlinear system.",
            "Neuro-expert approach to characteristics recognition for process monitoring and performance evaluation.",
            "Intelligent agents for World Wide Web advertising decisions.",
            "Approximate reasoning applied to unsupervised database mining.",
            "Fuzzy logic explains the golden proportion.",
            "Combining rules and constraints for employee timetabling.",
            "Mapcar: A framework to support the elaboration of the conceptual model of a knowledge-based system.",
            "Granularity via nondeterministic computations: What we gain and what we lose.",
            "Nonmonotonic fuzzy set operations: A generalization and some applications.",
            "On the use of independence relationships for learning simplified belief networks.",
            "A mass assignment based ID3 algorithm for decision tree induction.",
            "Mixing exact and importance sampling propagation algorithms in dependence graphs.",
            "Constructivist foundations of modeling - A Kantian perspective.",
            "FREDDI: A fuzzy RElational deductive database interface.",
            "Prosum-Prolog system for uncertainty management.",
            "Removing partial inconsistency in valuation-based systems.",
            "Intelligent algorithmic interpretation of pollutant discharges from multi-unit industrial complexes.",
            "A self-learning and tuning fuzzy logic controller based on genetic algorithms and reinforcements.",
            "Training and delayed reinforcements in Q-learning agents.",
            "Verification and correctness issues for nonmonotonic knowledge bases.",
            "A simulated annealing artificial neural network implementation of the n-queens problem.",
            "Modeling decisions in intelligent user interfaces.",
            "Using evidence theory for the integration of distributed databases.",
            "Spatial match retrieval based on direction signatures using multiple key hashing scheme.",
            "Introduction: Fuzzy information engineering.",
            "Fuzzy rules extraction and redundancy elimination: An application to remote sensing image analysis.",
            "A fuzzy logic based approach for semiological analysis of microcalcifications in mammographic images.",
            "A possibilistic ATMS contribution to diagnose analog electronic circuits.",
            "Tracks real-time classification based on fuzzy rules.",
            "Fuzzy multicriteria decision-making for long cane pruning: A system for standard and complex vine configurations.",
            "Subjective evaluation of car seat comfort with fuzzy set techniques.",
            "Nutri-expert, an educational software in nutrition.",
            "Planning with graded nondeterministic actions: A possibilistic approach."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1996",
        "info": "Volume 11, 1996",
        "count": 50,
        "papers": [
            "Calculus of fuzzy hierarchical censored production rules (FHCPRs).",
            "On qualitative measures of ignorance.",
            "Quantifier guided aggregation using OWA operators.",
            "Revisable knowledge discovery in databases.",
            "Multilayered reasoning by means of conceptual fuzzy sets.",
            "Knowledge acquisition by random sets.",
            "On random sets, knowledge acquisition, and pattern recognition.",
            "A multivalued logic ATMS.",
            "Bucket brigade algorithm for hierarchical censored production rule-based system.",
            "Virtual cognition in language.",
            "Reasoning with propositional knowledge based on fuzzy neural logic.",
            "Deleting inconsistencies in nontransitive preference relations.",
            "Computational reflection via mechanized logical deduction.",
            "Is the success of fuzzy logic really paradoxical?: Toward the actual logic behind expert systems.",
            "Interpreting a contingency table by rules.",
            "Design of large intelligent image database systems.",
            "Integrating world knowledge and linguistic constraints in the temporal interpretation of \"when\" sentences.",
            "A general-purpose natural language interface to an operating system.",
            "Expert system validation through knowledge base refinement.",
            "An algorithmic approach to combining belief functions.",
            "Hybrid genetic algorithms for timetabling.",
            "Specifying nonspecific evidence.",
            "An algorithm for learning from erroneous and incorrigible examples.",
            "Representing rules as random sets, II: Iterated rules.",
            "Editorial.",
            "Some approaches for processing SQLf nested queries.",
            "Unacceptable components in fuzzy relational databases.",
            "Fuzzy database systems - challenges and opportunities of a new era.",
            "A spreadsheet-based fuzzy retrieval system.",
            "A context-driven intelligent database processing system using object-oriented fuzzy cognitive maps.",
            "Database discovery using fuzzy sets.",
            "Cooperative database systems.",
            "DeMorgan systems on the unit interval.",
            "Some comments on interval valued fuzzy sets.",
            "On the design and modeling of microcontrolled fuzzy nuclear power plant controller.",
            "On the power of fuzzy logic.",
            "A conceptual approach for dealing with imprecision and uncertainty in object-based data models.",
            "On the bottom - up evaluation of recursive queries.",
            "Using geometrical information for accurate scene understanding in an artificial vision system.",
            "Optimal architecture configuration of manufacturing floor control systems.",
            "Incorporating fuzziness in the classical decision table formalism.",
            "A neural network learning method for belief networks.",
            "Elaborating analogies from conceptual models.",
            "Negation functions based semantics for ordered linguistic labels.",
            "Strategies for integrating knowledge-based systems techniques within conventional software environments.",
            "Dynamic and heuristic fuzzy connectives-based crossover operators for controlling the diversity and convergence of real-coded genetic algorithms.",
            "Improving qualitative simulation with interval arithmetic and additional constraints.",
            "Recursive learning algorithms for training fuzzy recurrent models.",
            "A Petri net model for probabilistic logic.",
            "Hybrid architecture for shape reconstruction and object recognition."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1995",
        "info": "Volume 10, 1995",
        "count": 47,
        "papers": [
            "Preface.",
            "An introduction to chaos.",
            "Nowhere-differentiable attractors.",
            "Lyapunov exponents from time series: Variations for an algorithm.",
            "Chaotic neural nets, computability, and undecidability: Toward a computational dynamics.",
            "Chaos in the brain: Possible roles in biological intelligence.",
            "Chaos and learning in the olfactory bulb.",
            "Autonomous learning with complex dynamics.",
            "A stochastic model of actions and plans for anytime planning under uncertainty.",
            "Evidence theory in multivalued logic systems.",
            "LUIS - A logic for task-oriented user interface specification.",
            "Linguistic aggregation operators of selection criteria in fuzzy information retrieval.",
            "Optimal fuzzy rules cover extrema.",
            "Intelligennt systems approach to conceptual design.",
            "Strategies for building propositional expert systems.",
            "The belief-function approach to aggregating audit evidence.",
            "A learning methodology in uncertain and imprecise environments.",
            "On the concept of immediate probabilities.",
            "Formal description and verification of production systems.",
            "Integrating artificial and psychophysical approaches for boundary finding in line drawings.",
            "Multiagent reasoning with probability, time, and beliefs.",
            "A multicontext architecture for formalizing complex reasoning.",
            "Knowledge acquisition for fuzzy expert systems.",
            "On proof- and model-based techniques for reasoning with uncertainty.",
            "Issues on representational capabilities of artificial neural networks and their implementation.",
            "A new approach toward modeling causality in commonsense reasoning.",
            "Local theories of inheritance.",
            "Propagating belief functions in AND-trees.",
            "A requirements sublanguage for automated analysis.",
            "A unified framework for consistency check.",
            "Classifying through an algebraic fuzzy structure: The relevance of the attributes.",
            "Purely neural, rule-based diagnostic systems. I. Production rules.",
            "Purely neural, rule-based diagnostic systems. II. Uncertain reasoning.",
            "A data management strategy for transportable natural language interfaces.",
            "A unified approach to aggregation based upon mom and mam operators.",
            "Probabilistic logic via capacities.",
            "Automated knowledge derivation: Domain-independent techniques for domain-restricted text sources.",
            "Non-monotonic characterization of induction and its application to inductive learning.",
            "Conceptual fuzzy sets as a meaning representation and their inductive construction.",
            "How to improve mamdani's approach to fuzzy control.",
            "Supporting complex inquiries.",
            "Multicriteria optimization of aircraft panels: Determining viable genetic algorithm configurations.",
            "On a measure of ambiguity.",
            "A new combination function in evidence theory.",
            "From physical to standard time.",
            "Implementation of piecewise linear fuzzy quantities.",
            "Strongly transitive fuzzy relations: An alternative way to describe similarity."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1994",
        "info": "Volume 9, 1994",
        "count": 54,
        "papers": [
            "Foreword.",
            "A glance at revision and updating in knowledge bases.",
            "A survey of belief revision and updating in classical logic.",
            "A survey of belief revision and updating rules in various uncertainty models.",
            "Notes on change and nonmonotony.",
            "Interference logic = conditional logic + frame axiom.",
            "A temporal revision model for reasoning about world change.",
            "Revision and action.",
            "A knowledge representation perspective: Logics for paraconsistent reasoning.",
            "Database updates and transition constraints: A formula-based approach.",
            "Distributed goal-directed dynamic plan revision.",
            "Knowledge-based systems and fuzzy boolean programming.",
            "Evaluation of orthodontic results with fuzzy inference.",
            "On the use of interval mathematics in fuzzy expert systems.",
            "A generalized approach to fuzzy optimization.",
            "On the errors that learning machines will make.",
            "Towards an integration of time and causation in a hybrid knowledge representation formalism.",
            "An experiment in the application of similarity-based learning to programming by example.",
            "A model for linguistic partial information in decision-making problems.",
            "An implementation of a model for functional recognition.",
            "The probability that tweety is able to fly.",
            "On modeling of if-then rules for probabilistic inference.",
            "Introduction: Databases and fuzziness.",
            "A computational algorithm for the FFD transitive closure and a complete axiomatization of fuzzy functional dependence (FFD).",
            "A new definition of fuzzy functional dependency in fuzzy relational databases.",
            "A logic approach to fuzzy relational databases.",
            "Fuzzy identification in fuzzy databases: The nuanced relational division.",
            "Integrating fuzzy queries into an existing database management system: An example.",
            "A self-evaluating expert system for X-ray rocking curve analysis.",
            "Integrating statistical and nonstatistical audit evidence using belief functions: A case of variable sampling.",
            "Interpreting linguistically quantified propositions.",
            "Logical form generation as abduction: Part I. Representation of linguistic concepts.",
            "Logical form generation as abduction: Part II. A dual-route parsimonious covering approach.",
            "Verification and validation of intelligent systems: Five years of aaai workshops.",
            "Automated test generation and evaluation for real-time expert systems.",
            "Foundation and application of knowledge base verification.",
            "A framework for verification, validation, and refinement of knowledge bases: The VVR system.",
            "Towards the formal specification of an OPS5 production system architecture.",
            "A formal model for knowledge-based systems verification.",
            "A design language and the use of cleanroom methodology for knowledge-based system development.",
            "A comprehensive framework for knowledge-base verification and validation.",
            "A tool for task-based knowledge and specification acquisition.",
            "Toward a theory of verification and validation: Artifacts.",
            "The VALID project: Goals, development, and results.",
            "The JIPDEC checklist-based guideline for expert system evaluation.",
            "A neural nets expert system.",
            "On modal logic interpretation of Dempster-Shafer theory of evidence.",
            "A justification-based approach to causal reasoning.",
            "RENOIR: An expert system using fuzzy logic for rheumatology diagnosis.",
            "Fuzzy additive hybrid operators for network-based decision making.",
            "Hierarchies of aggregation operators.",
            "On rule self-generating for fuzzy control.",
            "Constraint reasoning with learning automata.",
            "Improved fuzzy knowledge representation and rule evaluation using fuzzy petri nets and degree of subsethood."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1993",
        "info": "Volume 8, 1993",
        "count": 37,
        "papers": [
            "Introduction: Knowledge acquisition as modeling.",
            "Knowledge acquisition as a constructive modeling activity.",
            "The knowledge level reinterpreted: Modeling socio-technical systems.",
            "Modeling practical reasoning.",
            "Structuring interviews with experts during knowledge elicitation.",
            "Knowledge acquisition for model building.",
            "Model formulation as a problem-solving task: Computer-assisted engineering modeling.",
            "Modeling tasks with mechanisms.",
            "Dempster-shafer approach in propositional logic.",
            "On aggregation operations of linguistic labels.",
            "A hybrid scheme for action representation.",
            "Interval arithmetic approach to qualitative physics: Static systems.",
            "Modeling participatory learning as a control mechanism.",
            "Directions for artificial neural networks: Introductory remarks.",
            "Adaptive neural networks and their applications.",
            "A learning algorithm for the classification of dynamic events using a neuron-like dynamic tree.",
            "Fuzzy neural network with fuzzy signals and weights.",
            "A review of evolutionary artificial neural networks.",
            "Neural networks and adaptive expert systems in the CSA approach.",
            "Solving tangram puzzles: A connectionist approach.",
            "A tutorial on LISP object-oriented programming for blackboard computation (solving the radar tracking problem).",
            "Communicating with operating systems in natural language.",
            "Programming robots by example.",
            "On nonspecific evidence.",
            "Control of dynamic systems using fuzzy logic and neural networks.",
            "Fuzzy reasoning approach to similarity evaluation in image analysis.",
            "On a class of operators for expert systems.",
            "Knowledge acquisition of conjunctive rules using multilayered neural networks.",
            "On the extension of the compositional rule of inference.",
            "A similarity measure for conceptual graphs.",
            "A fuzzy approach to some classification problems.",
            "Parallel search using transformation-ordering Lterative-Deepening-A.",
            "Reinforcement learning: Architectures and algorithms.",
            "Implication operators versus regression analysis: Application to time series data.",
            "Automatically building a knowledge base through natural language text analysis.",
            "Evidential support logic, FRIL and case based reasoning.",
            "Reasoning agents in a dynamic world: The frame problem, edited by Kenneth M. Ford and Patrick J. Hayes. JAI Press, Greenwich, Connecticut 1991."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1992",
        "info": "Volume 7, 1992",
        "count": 46,
        "papers": [
            "Introduction.",
            "Concepts formation: Representation and processing issues.",
            "Propagating uncertain information forward.",
            "Linguistic modifiers and imprecise categories.",
            "The transferable belief model and random sets.",
            "Probabilistic reasoning and probabilistic neural networks.",
            "Semantic unification with fuzzy concepts in FRIL.",
            "Approximate reasoning with IF-THEN-UNLESS rules in a medical expert system.",
            "Detection of potential inconsistencies in knowledge bases.",
            "Application of implication operators versus regression analysis: A case study of factors influencing differentials in price levels among counties in Florida.",
            "Intelligent systems for traffic flow management: A qualitative modeling approach.",
            "Selected issues of frame of knowledge representation realized by means of linguistic labels.",
            "Fuzzy concepts in an object oriented expert system shell.",
            "A perspective on intelligent systems-A framework for analysis and design, by Ladislav Kohout. Chapman and Hall, London, 1990. US$56.00. 225 pp.",
            "A least exception logic shell for intelligent systems.",
            "TRUMP: A transportable language understanding program.",
            "Combat modeling with imprecise data.",
            "Fuzzy boom in Japan.",
            "Graphic representation of linear recursive rules.",
            "A symbolic interpretation for back-propagation networks.",
            "The netlike inference process and stability analysis.",
            "Using an integrated model learning system to construct the model base of a decision support system.",
            "Erratum modeling in the design of a KBS validation system.",
            "A cognitive model of the auditor's going-concern judgment.",
            "Sign analysis technique for predicting system behavior.",
            "Generated necessities and possibilities.",
            "A new neural associative memory model.",
            "On the axiomatic justification of Dempster's rule of combination.",
            "Linguistic decision-making models.",
            "On representation of source reliability through weights on rules.",
            "Experimental results from parallel backward-chained expert systems.",
            "Logic programming on a neural network.",
            "A pseudo-neural system for hypothesis selection.",
            "Prior knowledge strengthens learning to control search in weak theory domains.",
            "Introduction.",
            "Discovering functional and inclusion dependencies in relational databases.",
            "Finding latent variable models in large databases.",
            "Discovering regularities from knowledge bases.",
            "Visualization for knowledge discovery.",
            "Problems for knowledge discovery in databases and their treatment in the statistics interpreter explora.",
            "Knowledge discovery workbench for exploring business databases.",
            "EFD: A hybrid knowledge/statistical-based system for the detection of fraud.",
            "Synthesizing implications.",
            "Verification of causal models using petri nets.",
            "Application of a neural network to a design optimization process.",
            "On a semantics for neural networks based on fuzzy quantifiers."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1991",
        "info": "Volume 6, 1991",
        "count": 29,
        "papers": [
            "Implementing a model for understanding goal-oriented discourse.",
            "A theory of defeasible reasoning.",
            "Credit assignment and discovery in classifier systems.",
            "A self-learning rule-based controller employing approximate reasoning and neural net concepts.",
            "Review of research on neural networks in the USSR.",
            "Temporal reasoning: A relativistic model.",
            "An approach towards the verification of expert systems using numerical petri nets.",
            "On the use of reflection principles in modelling complex reasoning.",
            "A fuzzy logic rule-based automatic target recognizer.",
            "Object structure and action requirements: A compatibility model for functional recognition.",
            "Introduction.",
            "Time and time again: The many ways to represent time.",
            "Regression planning.",
            "Decision-theoretic control of inference for time-critical applications.",
            "Stop the world - I want to think.",
            "Introduction.",
            "Reasoning about recurrence.",
            "Preliminary thoughts on an agent description language.",
            "The interval representation problem.",
            "Representation and compilation of knowledge in point-based temporal system.",
            "Combining evidences for evidential reasoning.",
            "Modeling diagnosis at multiple levels of abstraction. I. Representing causal relations at multiple levels of abstraction.",
            "Modeling diagnosis at multiple levels of abstraction. II. Diagnostic reasoning at multiple levels of abstraction.",
            "Automated construction of legal arguments.",
            "A generalized defuzzification method via bad distributions.",
            "A belief maintenance scheme for hierarchical knowledge-based image analysis systems.",
            "A self-organizing pattern retrieval system and its applications.",
            "A decision support system for real-time monitoring and control of dynamical processes.",
            "Modeling in the design of a KBS validation system."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1990",
        "info": "Volume 5, 1990",
        "count": 22,
        "papers": [
            "A computational paradigm that integrates rule-based and model-based reasoning in expert systems.",
            "RALPH static planner: CAD-based manipulator assembly task planning for CSG-modeled objects.",
            "Interval probability theory for evidential support.",
            "Image segmentation in the presence of uncertainty.",
            "Probabilistic databases for decision analysis.",
            "The concept of conditional fuzzy measure.",
            "Cluster analysis, graphs, and branching processes as new methodologies for intelligent systems on example of bibliometric and social network data.",
            "Belief updating in a fuzzy expert system.",
            "A multi-threshold adaptive filtering - an al approach to image enhancement.",
            "An evidential approach to problem solving when a large number of knowledge systems is available.",
            "On the extension of classical propositional logic by means of a triangular norm.",
            "Reasoning under incomplete information in artificial intelligence: A comparison of formalisms using a single example.",
            "Reasoning under incomplete information in artificial intelligence: A comparison of formalisms using a single example.",
            "Reasoning under incomplete information in artificial intelligence: A comparison of formalisms using a single example.",
            "Introduction.",
            "An investigation of the general solution to entailment in probabilistic logic.",
            "Enhancing the inference mechanism of Nilsson's probabilistic logic.",
            "A general approach for determining the validity of commonsense assertions using conditional logics.",
            "A methodology for using a default and abductive reasoning system.",
            "On the relationship between CWA, minimal model, and minimal herbrand model semantics.",
            "A probabilistic commonsense reasoner.",
            "A note on the infeasibility of some inference processes."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1989",
        "info": "Volume 4, 1989",
        "count": 20,
        "papers": [
            "Inference with consistent probabilities in expert systems.",
            "Concept recognition: An approximate reasoning framework.",
            "Color and language as man-machine interface parameters.",
            "Extending the mathematics in qualitative process theory.",
            "The role of user models in cooperative interactive systems.",
            "Extension of O-theory to problems of logical inferencing.",
            "Knowledge-based analysis of satellite oceanographic images.",
            "A connectionist processing metaphor for diagnostic reasoning.",
            "Fuzzy modus ponens: A new model suitable for applications in knowledge-based systems.",
            "Spatial planning for musical output.",
            "Knowledge-Based Techniques for Information Retrieval.",
            "Using a frame-based language for information retrieval.",
            "A knowledge representation for conceptual information retrieval.",
            "Language-oriented information retrieval.",
            "NL ∩ IR: Natural language for information retrieval.",
            "Making understanders out of parsers: Semantically driven parsing as a key concept for realistic text understanding applications.",
            "Answering atomic queries in indefinite deductive databases.",
            "FUR: Understanding functional reasoning.",
            "Perceiving and planning before acting: An approach to enhance global network coherence.",
            "MILORD: The architecture and the management of linguistically expressed uncertainty."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1988",
        "info": "Volume 3, 1988",
        "count": 23,
        "papers": [
            "Can computers be intelligent? Artificial intelligence and conceptual change.",
            "History dependent stochastic automata: A formal view of evolutionary learning.",
            "Estimating semantic content: An A priori approach.",
            "Approaches to management of uncertainty in an expert system.",
            "A study on neural networks.",
            "Brainstorming by Computer.",
            "Uncertainty analysis of rule-based expert systems with Dempster-Shafer mass assignments.",
            "The treatment of uncertainty in knowledge-based systems using fuzzy sets and possibility theory.",
            "On the discovery of mathematical concepts.",
            "The utility of information and risk-taking fuzzy expert systems.",
            "Approximate reasoning in expert systems, M. M. Gupta, A. Kandel, W. Bandler, and J. B. Kiszka (Eds.), North-Holland, Amsterdam, 1985, 836 pages.",
            "Fuzzy sets and applications: Selected papers by L. A. Zadeh, R. Yager, S. Ovchinnokov, R. Tong, and H. Nguyen (Eds.), Wiley, New York, 1987, 684 p.",
            "Current issues in knowledge representation.",
            "Intelligent CAI in engineering: Knowledge representation strategies to facilitate model-based reasoning.",
            "Adaptive knowledge representation: A content sensitive recombination mechanism for genetic algorithms.",
            "Constraints on the acquisition of semantic knowledge.",
            "Graph model-based approach to the representation, interpretation, and execution of signal processing systems.",
            "Boeing blackboard system: The erasmus version.",
            "Using a metatheory as a functional representation.",
            "Construction and use of a causal model for diagnosis.",
            "IDSCA: An intelligent direction selector for the controller's action in multiloop control systems.",
            "Operation management in object-oriented knowledge bases.",
            "Object knowledge environment for manufacturing systems layout design."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1987",
        "info": "Volume 2, 1987",
        "count": 6,
        "papers": [
            "An algorithm for region filling using two-dimensional grammars.",
            "Diagnostic problem-solving with causal chaining.",
            "Fuzzy logic in knowledge engineering, H. Prade and C. V. Negotia (Eds.), Verlag TÜV Rheinland, 1986, 358 p.",
            "Transportable natural language database update.",
            "An unrealistic parser.",
            "Artificial intelligence activities in Spain."
        ]
    },
    {
        "name": "International Journal of Intelligent Systems",
        "year": "1986",
        "info": "Volume 1, 1986",
        "count": 19,
        "papers": [
            "Editorial.",
            "Constructs and phenomena common to the semantically-rich domains.",
            "An intelligent computer vision system.",
            "Hierarchical representation of problem-solving knowledge in a frame-based process planning system.",
            "Toward a general theory of reasoning with uncertainty. I: Nonspecificity and fuzziness.",
            "Heuristics - intelligent search strategies for computer problem solving, by Judea Pearl. (Reading, Ma: Addison-Wesley, 1984).",
            "Support logic programming.",
            "Object recognition by three-dimensional curve matching.",
            "On the unicity of dempster rule of combination.",
            "On the logical and physical combination of evidence in intelligent machines.",
            "The combination of evidence.",
            "Fast correlation registration method using singular value decomposition.",
            "A model of software design.",
            "Cognitive constraints on communication - representations and process, edited by L. Vaina and J. Hintikka. (Dordrecht, the Netherlands: D. Reidel, 1984).",
            "Uncertainty calculus with verbally defined belief-intervals.",
            "The entailment principle for dempster - shafer granules.",
            "Shape-from-shading using multiple light sources.",
            "Fuzzy knowledge combination.",
            "Special report - artificial intelligence in France: Current developments."
        ]
    }
]