[
    {
        "name": "IVC",
        "year": "2022",
        "info": "2022: Volumes\n117,\n118,",
        "count": 20,
        "papers": [
            "IRANet: Identity-relevance aware representation for cloth-changing person re-identification.",
            "Edge supervision and multi-scale cost volume for stereo matching.",
            "Attention guided contextual feature fusion network for salient object detection.",
            "Learning an augmentation strategy for sparse datasets.",
            "Geometric feature statistics histogram for both real-valued and binary feature representations of 3D local shape.",
            "Improving image captioning with Pyramid Attention and SC-GAN.",
            "FMD-Yolo: An efficient face mask detection method for COVID-19 prevention and control in public.",
            "Facial expression recognition using densely connected convolutional neural network and hierarchical spatial attention.",
            "Regularized Hardmining loss for face recognition.",
            "Double cross-modality progressively guided network for RGB-D salient object detection.",
            "Dual guidance enhanced network for light field salient object detection.",
            "Does explainable machine learning uncover the black box in vision applications?",
            "Unsupervised domain adaptation pedestrian re-identification based on an improved dissimilarity space.",
            "Editorial to special issue on cross-media learning for visual question answering.",
            "Spatial temporal and channel aware network for video-based person re-identification.",
            "View knowledge transfer network for multi-view action recognition.",
            "A deep-shallow and global-local multi-feature fusion network for photometric stereo.",
            "Deformable convolutions in multi-view stereo.",
            "PU-GACNet: Graph Attention Convolution Network for Point Cloud Upsampling.",
            "A dynamic keypoint selection network for 6DoF pose estimation."
        ]
    },
    {
        "name": "IVC",
        "year": "2021",
        "info": "2021: Volumes\n105,\n106,\n107,\n108,\n109,\n110,\n111,\n112,\n113,\n114,\n115,\n116",
        "count": 150,
        "papers": [
            "Expression recognition with deep features extracted from holistic and part-based models.",
            "Deep multimodal fusion for semantic image segmentation: A survey.",
            "A survey of micro-expression recognition.",
            "Multimodal image fusion based on point-wise mutual information.",
            "Cross-database and cross-attack Iris presentation attack detection using micro stripes analyses.",
            "I-SOCIAL-DB: A labeled database of images collected from websites and social media for Iris recognition.",
            "Efficient pedestrian detection in top-view fisheye images using compositions of perspective view patches.",
            "Industrial visual perception technology in Smart City.",
            "Bias alleviating generative adversarial network for generalized zero-shot classification.",
            "Crowd density detection method based on crowd gathering mode and multi-column convolutional neural network.",
            "Improved generative adversarial network and its application in image oil painting style transfer.",
            "Video-based person re-identification by intra-frame and inter-frame graph neural network.",
            "A comprehensive review on deep learning-based methods for video anomaly detection.",
            "Cuepervision: self-supervised learning for continuous domain adaptation without catastrophic forgetting.",
            "ScPnP: A non-iterative scale compensation solution for PnP problems.",
            "Pixel-wise ordinal classification for salient object grading.",
            "Attention-guided aggregation stereo matching network.",
            "Projection-dependent input processing for 3D object recognition in human robot interaction systems.",
            "A framework of human action recognition using length control features fusion and weighted entropy-variances based feature selection.",
            "ReMOT: A model-agnostic refinement for multiple object tracking.",
            "Point cloud classification with deep normalized Reeb graph convolution.",
            "Unsupervised face Frontalization for pose-invariant face recognition.",
            "A Survey on Object Detection for the Internet of Multimedia Things (IoMT) using Deep Learning and Event-based Middleware: Approaches, Challenges, and Future Directions.",
            "Tracking fiducial markers with discriminative correlation filters.",
            "Clothing generation by multi-modal embedding: A compatibility matrix-regularized GAN model.",
            "An unsupervised domain adaptation scheme for single-stage artwork recognition in cultural sites.",
            "A pooling-based feature pyramid network for salient object detection.",
            "Optokinetic response for mobile device biometric liveness assessment.",
            "Motion saliency based multi-stream multiplier ResNets for action recognition.",
            "Multi-information-based convolutional neural network with attention mechanism for pedestrian trajectory prediction.",
            "Collaborative knowledge distillation for incomplete multi-view action prediction.",
            "Whether normalized or not? Towards more robust iris recognition using dynamic programming.",
            "Special issue on role of computer vision in smart cities.",
            "Weighted boxes fusion: Ensembling boxes from different object detection models.",
            "Multi-source material image optimized selection based multi-option composition.",
            "Knowledge distillation methods for efficient unsupervised adaptation across multiple domains.",
            "A survey of iris datasets.",
            "Beyond modality alignment: Learning part-level representation for visible-infrared person re-identification.",
            "Generative adversarial networks and their application to 3D face generation: A survey.",
            "A study on attention-based LSTM for abnormal behavior recognition with variable pooling.",
            "Novel features for art movement classification of portrait paintings.",
            "Improving eye movement biometrics in low frame rate eye-tracking devices using periocular and eye blinking features.",
            "A Tibetan Thangka data set and relative tasks.",
            "Image captioning via proximal policy optimization.",
            "Triangulate geometric constraint combined with visual-flow fusion network for accurate 6DoF pose estimation.",
            "Interactive multi-scale feature representation enhancement for small object detection.",
            "Cluster adaptation networks for unsupervised domain adaptation.",
            "ThickSeg: Efficient semantic segmentation of large-scale 3D point clouds using multi-layer projection.",
            "2D progressive fusion module for action recognition.",
            "HCFS3D: Hierarchical coupled feature selection network for 3D semantic and instance segmentation.",
            "Multi-stream slowFast graph convolutional networks for skeleton-based action recognition.",
            "Certifiable relative pose estimation.",
            "WRGPruner: A new model pruning solution for tiny salient object detection.",
            "Boundary graph convolutional network for temporal action detection.",
            "FEANet: Foreground-edge-aware network with DenseASPOC for human parsing.",
            "Exploring region relationships implicitly: Image captioning with visual relationship attention.",
            "DeepSegment: Segmentation of motion capture data using deep convolutional neural network.",
            "NeuralPlan: Neural floorplan radiance fields for accelerated view synthesis.",
            "SalED: Saliency prediction with a pithy encoder-decoder architecture sensing local and global information.",
            "An efficient foreign objects detection network for power substation.",
            "Single-shot cuboids: Geodesics-based end-to-end Manhattan aligned layout estimation from spherical panoramas.",
            "Multimodal assessment of apparent personality using feature attention and error consistency constraint.",
            "PDA: Proxy-based domain adaptation for few-shot image recognition.",
            "Visual question answering model based on graph neural network and contextual attention.",
            "Edge-aware salient object detection network via context guidance.",
            "Deep domain adaptation with ordinal regression for pain assessment using weakly-labeled videos.",
            "Lightweight boundary refinement module based on point supervision for semantic segmentation.",
            "Short-term anchor linking and long-term self-guided attention for video object detection.",
            "Camera pose estimation in multi-view environments: From virtual scenarios to the real world.",
            "DCT-net: A deep co-interactive transformer network for video temporal grounding.",
            "Semantic video segmentation with dynamic keyframe selection and distortion-aware feature rectification.",
            "Editorial for the special issue of IMAVIS on automatic face analytics for human behavior understanding.",
            "Dual-path CNN with Max Gated block for text-based person re-identification.",
            "Informative discriminator for domain adaptation.",
            "Pose-guided part matching network via shrinking and reweighting for occluded person re-identification.",
            "Using synthetic data for person tracking under adverse weather conditions.",
            "ATCC: Accurate tracking by criss-cross location attention.",
            "Composite recurrent network with internal denoising for facial alignment in still and video images in the wild.",
            "Unsupervised cross-domain person re-identification with self-attention and joint-flexible optimization.",
            "ARank: Toward specific model pruning via advantage rank for multiple salient objects detection.",
            "Point cloud completion using multiscale feature fusion and cross-regional attention.",
            "Efficient pyramid context encoding and feature embedding for semantic segmentation.",
            "ASPset: An outdoor sports pose video dataset with 3D keypoint annotations.",
            "Feedback-driven loss function for small object detection.",
            "Double anchor embedding for accurate multi-person 2D pose estimation.",
            "Online-adaptive classification and regression network with sample-efficient meta learning for long-term tracking.",
            "RoI Tanh-polar transformer network for face parsing in the wild.",
            "Interpretable visual reasoning: A survey.",
            "Improved multi-source domain adaptation by preservation of factors.",
            "A robust image representation method against illumination and occlusion variations.",
            "Discrepant collaborative training by Sinkhorn divergences.",
            "LSTM with bio inspired algorithm for action recognition in sports videos.",
            "DA-SACOT: Domain adaptive-segmentation guided attention for correlation based object tracking.",
            "Spatiotemporal module for video saliency prediction based on self-attention.",
            "Editorial on \"Frontiers in computer vision for human computer interaction\".",
            "Editorial to special issue on novel insights on ocular biometrics.",
            "Intelligent video anomaly detection and classification using faster RCNN with deep reinforcement learning model.",
            "Editorial: IMAVIS special issue on deep cross-media neural model for generating image descriptions.",
            "Learning auto-scale representations for person re-identification.",
            "CFFNet: Coordinated feature fusion network for crowd counting.",
            "Multi-label image recognition with two-stream dynamic graph convolution networks.",
            "Semantic and edge-based visual odometry by joint minimizing semantic and edge distance error.",
            "MFC-Net : Multi-feature fusion cross neural network for salient object detection.",
            "A new perceptual hashing method for verification and identity classification of occluded faces.",
            "Flow guided mutual attention for person re-identification.",
            "Synergic learning for noise-insensitive webly-supervised temporal action localization.",
            "Task-based parameter isolation for foreground segmentation without catastrophic forgetting using multi-scale region and edges fusion network.",
            "Introducing the structural bases of typicality effects in deep learning.",
            "A lightweight network for monocular depth estimation with decoupled body and edge supervision.",
            "Human-object interaction detection with missing objects.",
            "Dynamic information enhancement for video classification.",
            "DeepFH segmentations for superpixel-based object proposal refinement.",
            "Omnidirectional stereo depth estimation based on spherical deep network.",
            "Dense graph convolutional neural networks on 3D meshes for 3D object segmentation and classification.",
            "A bioinspired retinal neural network for accurately extracting small-target motion information in cluttered backgrounds.",
            "Activity guided multi-scales collaboration based on scaled-CNN for saliency prediction.",
            "Advances in domain adaptation for computer vision.",
            "Real-time semantic segmentation with weighted factorized-depthwise convolution.",
            "A review of deep learning techniques for 2D and 3D human pose estimation.",
            "Boundary guidance network for camouflage object detection.",
            "MUMC: Minimizing uncertainty of mixture of cues.",
            "Multi-type decision fusion network for visual Q&A.",
            "Transformer models for enhancing AttnGAN based text to image generation.",
            "HPRNet: Hierarchical point regression for whole-body human pose estimation.",
            "Multi-granularity for knowledge distillation.",
            "Multi-level refinement enriched feature pyramid network for object detection.",
            "You look so different! Haven't I seen you a long time ago?",
            "Graph-based reasoning attention pooling with curriculum design for content-based image retrieval.",
            "Multiscale parallel deep CNN (mpdCNN) architecture for the real low-resolution face recognition for surveillance.",
            "Multi-Tier Attention Network using Term-weighted Question Features for Visual Question Answering.",
            "Attribute saliency network for person re-identification.",
            "Attention-guided chained context aggregation for semantic segmentation.",
            "Multi-view self-supervised learning for 3D facial texture reconstruction from single image.",
            "An analytical proof on suitability of Cauchy-Schwarz Divergence as the aggregation criterion in Region Growing Algorithm.",
            "Context-based image explanations for deep neural networks.",
            "Incremental human action recognition with dual memory.",
            "Spatial likelihood voting with self-knowledge distillation for weakly supervised object detection.",
            "Adaptive and fast image superpixel segmentation approach.",
            "Aligning vision-language for graph inference in visual dialog.",
            "ERF-YOLO: A YOLO algorithm compatible with fewer parameters and higher accuracy.",
            "Generating facial expression adversarial examples based on saliency map.",
            "Salient object detection network with multi-scale feature refinement and boundary feedback.",
            "A survey of methods, datasets and evaluation metrics for visual question answering.",
            "VQA as a factoid question answering problem: A novel approach for knowledge-aware and explainable visual question answering.",
            "EAR: Efficient action recognition with local-global temporal aggregation.",
            "Learning to disentangle scenes for person re-identification.",
            "Monozygotic twin face recognition: An in-depth analysis and plausible improvements.",
            "Cross-scale global attention feature pyramid network for person search.",
            "MLRMV: Multi-layer representation for multi-view action recognition.",
            "MetaPix: Domain transfer for semantic segmentation by meta pixel weighting."
        ]
    },
    {
        "name": "IVC",
        "year": "2020",
        "info": "2020: Volumes\n93,\n94,\n95,\n96,\n97,\n98,\n99,\n100,\n101,\n102,\n103,\n104",
        "count": 123,
        "papers": [
            "Region-based Fitting of Overlapping Ellipses and its application to cells segmentation.",
            "ResFeats: Residual network based features for underwater image classification.",
            "Multiple stream deep learning model for human action recognition.",
            "Fine-Grained Image Retrieval via Piecewise Cross Entropy loss.",
            "Multi-label learning for concept-oriented labels of product image data.",
            "Salient object detection via double random walks with dual restarts.",
            "Spec-Net and Spec-CGAN: Deep learning models for specularity removal from faces.",
            "An integrated ship segmentation method based on discriminator and extractor.",
            "Depth prediction from 2D images: A taxonomy and an evaluation study.",
            "Face presentation attack detection in mobile scenarios: A comprehensive evaluation.",
            "Improving head pose estimation using two-stage ensembles with top-k regression.",
            "View-based weight network for 3D object recognition.",
            "Transfer learning in computer vision tasks: Remember where you come from.",
            "Out-of-region keypoint localization for 6D pose estimation.",
            "FALF ConvNets: Fatuous auxiliary loss based filter-pruning for efficient deep CNNs.",
            "Enhancing deep discriminative feature maps via perturbation for face presentation attack detection.",
            "Skin detection and lightweight encryption for privacy protection in real-time surveillance applications.",
            "A fast and accurate iterative method for the camera pose estimation problem.",
            "Coupled generative adversarial network for heterogeneous face recognition.",
            "Multi-feature fusion for image retrieval using constrained dominant sets.",
            "A new cast shadow detection method for traffic surveillance video analysis using color and statistical modeling.",
            "Flow Adaptive Video Object Segmentation.",
            "Variational shape prior segmentation with an initial curve based on image registration technique.",
            "Post-mortem iris recognition with deep-learning-based image segmentation.",
            "Online maximum a posteriori tracking of multiple objects using sequential trajectory prior.",
            "Single image dehazing via a dual-fusion method.",
            "Learning reliable-spatial and spatial-variation regularization correlation filters for visual tracking.",
            "Collective Sports: A multi-task dataset for collective activity recognition.",
            "Bottom-up unsupervised image segmentation using FC-Dense u-net based deep representation clustering and multidimensional feature fusion based region merging.",
            "SAANet: Spatial adaptive alignment network for object detection in automatic driving.",
            "A Riemannian approach for free-space extraction and path planning using catadioptric omnidirectional vision.",
            "Depth-guided view synthesis for light field reconstruction from a single image.",
            "Person re-identification with expanded neighborhoods distance re-ranking.",
            "Salient object detection based on backbone enhanced network.",
            "A complementary regression network for accurate face alignment.",
            "GANILLA: Generative adversarial networks for image to illustration translation.",
            "EML-NET: An Expandable Multi-Layer NETwork for saliency prediction.",
            "Attention-guided RGBD saliency detection using appearance information.",
            "Unsupervised domain adaptation for mobile semantic segmentation based on cycle consistency and feature alignment.",
            "Local-adaptive and outlier-tolerant image alignment using RBF approximation.",
            "Recovering facial reflectance and geometry from multi-view images.",
            "A review on object pose recovery: From 3D bounding box detectors to full 6D pose estimators.",
            "A high-efficiency energy and storage approach for IoT applications of facial recognition.",
            "Category-specific upright orientation estimation for 3D model classification and retrieval.",
            "Automatic recognition of image of abnormal situation in scenic spots based on Internet of things.",
            "Saddle: Fast and repeatable features with good coverage.",
            "Co-occurrence of deep convolutional features for image search.",
            "Recent advances in small object detection based on deep learning: A review.",
            "IoU-aware single-stage object detector for accurate localization.",
            "Digital video intrusion intelligent detection method based on narrowband Internet of Things and its application.",
            "Learning visual variation for object recognition.",
            "Energy clustering for unsupervised person re-identification.",
            "Anomaly detection in surveillance video based on bidirectional prediction.",
            "A contextual conditional random field network for monocular depth estimation.",
            "EDS pooling layer.",
            "Convolutional prototype learning for zero-shot recognition.",
            "Zero-sum game theory model for segmenting skin regions.",
            "Class-aware domain adaptation for improving adversarial robustness.",
            "Cross-resolution learning for Face Recognition.",
            "Learning rebalanced human parsing model from imbalanced datasets.",
            "Multi-depth dilated network for fashion landmark detection with batch-level online hard keypoint mining.",
            "Dense convolutional feature histograms for robust visual object tracking.",
            "Fast and robust visual tracking with hard balanced focal loss and guided domain adaption.",
            "Cross-Correlated Attention Networks for Person Re-Identification.",
            "Joint detection and tracking in videos with identification features.",
            "Monocular depth estimation with SPN loss.",
            "Development of an embedded road boundary detection system based on deep learning.",
            "Viewpoint constrained and unconstrained Cricket stroke localization from untrimmed videos.",
            "Gender based face aging with cycle-consistent adversarial networks.",
            "CrossFusion net: Deep 3D object detection based on RGB images and point clouds in autonomous driving.",
            "Deep manifold clustering based optimal pseudo pose representation (DMC-OPPR) for unsupervised person re-identification.",
            "Feature based video stabilization based on boosted HAAR Cascade and representative point matching algorithm.",
            "Cross-modal feature extraction and integration based RGBD saliency detection.",
            "Explaining VQA predictions using visual grounding and a knowledge base.",
            "Person search: New paradigm of person re-identification: A survey and outlook of recent works.",
            "Constructing big panorama from video sequence based on deep local feature.",
            "A novel co-attention computation block for deep learning based image co-segmentation.",
            "Collaborative representation of blur invariant deep sparse features for periocular recognition from smartphones.",
            "Automated repair of fragmented tracks with 1D CNNs.",
            "Investigating bias in deep face analysis: The KANFace dataset and empirical study.",
            "Application of 3D laser scanning technology for image data processing in the protection of ancient building sites through deep learning.",
            "Adversarial sliced Wasserstein domain adaptation networks.",
            "Application of the best evacuation model of deep learning in the design of public structures.",
            "Implementing cascaded regression tree-based face landmarking: An in-depth overview.",
            "Multimodal facial biometrics recognition: Dual-stream convolutional neural networks with multi-feature fusion layers.",
            "A two-stage real-time YOLOv2-based road marking detector with lightweight spatial transformation-invariant classification.",
            "Demographic classification through pupil analysis.",
            "An attention-based deep learning model for multiple pedestrian attributes recognition.",
            "Non-local attention association scheme for online multi-object tracking.",
            "The effect of image recognition traffic prediction method under deep learning and naive Bayes algorithm on freeway traffic safety.",
            "Geometry consistency aware confidence evaluation for feature matching.",
            "From known to the unknown: Transferring knowledge to answer questions about novel visual and semantic concepts.",
            "Detection of panoramic vision pedestrian based on deep learning.",
            "Intelligent detection of building cracks based on deep learning.",
            "Generalizable deep features for ocular biometrics.",
            "PCANet: Pyramid convolutional attention network for semantic segmentation.",
            "Joint patch and instance discrimination learning for unsupervised person re-identification.",
            "Depth-guided saliency detection via boundary information.",
            "Multi-level prediction Siamese network for real-time UAV visual tracking.",
            "New insights on multi-solution distribution of the P3P problem.",
            "Intelligent querying for target tracking in camera networks using deep Q-learning with n-step bootstrapping.",
            "Fusion of iris and sclera using phase intensive rubbersheet mutual exclusion for periocular recognition.",
            "Building NAS: Automatic designation of efficient neural architectures for building extraction in high-resolution aerial images.",
            "R4 Det: Refined single-stage detector with feature recursion and refinement for rotating object detection in aerial images.",
            "A calibration method of computer vision system based on dual attention mechanism.",
            "Facial expression recognition using human machine interaction and multi-modal visualization analysis for healthcare applications.",
            "Multi-semantic long-range dependencies capturing for efficient video representation learning.",
            "CrossATNet - a novel cross-attention based framework for sketch-based image retrieval.",
            "Robust biometric authentication system with a secure user template.",
            "Spectral regularization for combating mode collapse in GANs.",
            "GIFSL - grafting based improved few-shot learning.",
            "Iris and periocular biometrics for head mounted displays: Segmentation, recognition, and synthetic data generation.",
            "Vehicle re-identification based on unsupervised local area detection and view discrimination.",
            "Variance-guided attention-based twin deep network for cross-spectral periocular recognition.",
            "Cancelable Iris template generation by aggregating patch level ordinal relations with its holistically extended performance and security analysis.",
            "Improving face verification using facial marks and deep CNN: IARPA Janus benchmark-A.",
            "Optimization of face recognition algorithm based on deep learning multi feature fusion driven by big data.",
            "Synthetic guided domain adaptive and edge aware network for crowd counting.",
            "CAM: A fine-grained vehicle model recognition method based on visual attention model.",
            "Synergetic reconstruction from 2D pose and 3D motion for wide-space multi-person video motion capture in the wild.",
            "Infrared and visible image fusion via global variable consensus.",
            "Dependable information processing method for reliable human-robot interactions in smart city applications.",
            "Deep learning-based object detection in low-altitude UAV datasets: A survey."
        ]
    },
    {
        "name": "IVC",
        "year": "2019",
        "info": "2019: Volumes\n81,\n82,\n83-84,\n85,\n86,\n87,\n88,\n89,\n90,\n91,\n92",
        "count": 91,
        "papers": [
            "Learning facial action units with spatiotemporal cues and multi-label sampling.",
            "Fast and robust multiple ColorChecker detection using deep convolutional neural networks.",
            "Large-scale multiview 3D hand pose dataset.",
            "Local fusion networks with chained residual pooling for video action recognition.",
            "A deep generic to specific recognition model for group membership analysis using non-verbal cues.",
            "Partial face detection in the mobile domain.",
            "Learning non-metric visual similarity for image retrieval.",
            "Feature Detection Performance Based Benchmarking of Motion Deblurring Methods: Applications to Vision for Legged Robots.",
            "Adaptive rational fractal interpolation function for image super-resolution via local fractal analysis.",
            "Two-stage quality adaptive fingerprint image enhancement using Fuzzy C-means clustering based fingerprint quality analysis.",
            "Visual object tracking based on adaptive Siamese and motion estimation network.",
            "From person to group re-identification via unsupervised transfer of sparse features.",
            "Multi-directional local gradient descriptor: A new feature descriptor for face recognition.",
            "Correspondence matching in unorganized 3D point clouds using Convolutional Neural Networks.",
            "A novel database of children's spontaneous facial expressions (LIRIS-CSE).",
            "Beyond saliency: Understanding convolutional neural networks from saliency prediction on layer-wise relevance propagation.",
            "Postnatal gestational age estimation of newborns using Small Sample Deep Learning.",
            "A survey on human detection surveillance systems for Raspberry Pi.",
            "Deep convolution neural network with scene-centric and object-centric information for object detection.",
            "Multi-scale convolutional neural network for multi-focus image fusion.",
            "Fast spatial-temporal stereo matching for 3D face reconstruction under speckle pattern projection.",
            "Face recognition in low-quality images using adaptive sparse representations.",
            "A generative image fusion approach based on supervised deep convolution network driven by weighted gradient flow.",
            "Smoke vehicle detection based on robust codebook model and robust volume local binary count patterns.",
            "Online reconstruction-free single-pixel image classification.",
            "Image caption model of double LSTM with scene factors.",
            "A comprehensive survey on computer vision based approaches for automatic identification of products in retail store.",
            "A novel edge-oriented framework for saliency detection enhancement.",
            "Semantic-aware neural style transfer.",
            "Accurate traffic light detection using deep neural network with focal regression loss.",
            "A coupled encoder-decoder network for joint face detection and landmark localization.",
            "Automatic License Plate Recognition via sliding-window darknet-YOLO deep learning.",
            "Convex class model on symmetric positive definite manifolds.",
            "Macro unit-based convolutional neural network for very light-weight deep learning.",
            "Scaled layout recovery with wide field of view RGB-D.",
            "Adaptive Lucas-Kanade tracking.",
            "Image super resolution by dilated dense progressive network.",
            "A novel instrument to compare dynamic object detection algorithms.",
            "EF-Index: Determining number of clusters (K) to estimate number of segments (S) in an image.",
            "Utilizing CNNs and transfer learning of pre-trained models for age range classification from unconstrained face images.",
            "Eye center localization in a facial image based on geometric shapes of iris and eyelid under natural variability.",
            "Human tracking from single RGB-D camera using online learning.",
            "Lip reading with Hahn Convolutional Neural Networks.",
            "A topology-based descriptor for 3D point cloud modeling: Theory and experiments.",
            "A study on wrist identification for forensic investigation.",
            "Total variation constraint GAN for dynamic scene deblurring.",
            "Spatio-temporal object detection by deep learning: Video-interlacing to improve multi-object tracking.",
            "Real-time 6D pose estimation from a single RGB image.",
            "Design of multi-scale receptive field convolutional neural network for surface inspection of hot rolled steels.",
            "Analysing roughness of surface through fractal dimension: A review.",
            "Hand pose estimation and tracking in real and virtual interaction: A review.",
            "Discriminative Supervised Hashing for Cross-Modal Similarity Search.",
            "Reinforcement learning for neural architecture search: A review.",
            "A survey on freehand sketch recognition and retrieval.",
            "Diffusion-based kernel matrix model for face liveness detection.",
            "Detecting and classifying online dark visual propaganda.",
            "An SE(3) invariant description for 3D face recognition.",
            "DeepDSAIR: Deep 6-DOF camera relocalization using deblurred semantic-aware image representation for large-scale outdoor environments.",
            "Is that my hand? An egocentric dataset for hand disambiguation.",
            "Learning discriminative subregions and pattern orders for facial gender classification.",
            "STag: A stable fiducial marker system.",
            "Fast motion estimation for field sequential imaging: Survey and benchmark.",
            "On visual BMI analysis from facial images.",
            "Online learning of contexts for detecting suspicious behaviors in surveillance videos.",
            "Visual tracking based on robust appearance model.",
            "Learning deep features for online person tracking using non-overlapping cameras: A survey.",
            "Image mosaicing: A deeper insight.",
            "Semi-dense and robust image registration by shift adapted weighted aggregation and variational completion.",
            "Interpretable Relative Squeezing bottleneck design for compact convolutional neural networks model.",
            "Unsupervised learning-based long-term superpixel tracking.",
            "A novel unsupervised Globality-Locality Preserving Projections in transfer learning.",
            "Dilated Light-Head R-CNN using tri-center loss for driving behavior recognition.",
            "Image fusion method based on spatially masked convolutional sparse representation.",
            "A component-based video content representation for action recognition.",
            "Foreground extraction via dual-side cameras on a mobile device using long short-term trajectory analysis.",
            "Multi-frame stereo matching with edges, planes, and superpixels.",
            "Regression with residual neural network for vanishing point detection.",
            "Simplified Active Calibration.",
            "Intelligent and vision-based fire detection systems: A survey.",
            "Multi-level thresholding based on differential evolution and Tsallis Fuzzy entropy.",
            "Deep reinforcement learning-based patch selection for illuminant estimation.",
            "Keypoint based weakly supervised human parsing.",
            "IIRNet: A lightweight deep neural network using intensely inverted residuals for image recognition.",
            "Consistent estimation of rotational optical flow in real environments using a biologically-inspired vision algorithm on embedded hardware.",
            "A physics based generative adversarial network for single image defogging.",
            "Combining Landsat images with historic records to estimate the live coral cover of Luhuitou fringing reef in Northern South China Sea.",
            "Improved person re-identification based on saliency and semantic parsing with deep neural network models.",
            "On the importance of local and global analysis in the judgment of similarity and dissimilarity of faces.",
            "A novel 2D and 3D multimodal approach for in-the-wild facial expression recognition.",
            "Visual appearance based person retrieval in unconstrained environment videos.",
            "Self-supervised blur detection from synthetically blurred scenes."
        ]
    },
    {
        "name": "IVC",
        "year": "2018",
        "info": "2018: Volumes\n69,\n70,\n71,\n72,\n73,\n74,\n75,\n76,\n77,\n78,\n79,\n80",
        "count": 74,
        "papers": [
            "Negative results in computer vision: A perspective.",
            "Joint gender classification and age estimation by nearly orthogonalizing their semantic spaces.",
            "Visual tracking based on edge field with object proposal association.",
            "Designing a symmetric classifier for image annotation using multi-layer sparse coding.",
            "Primal-dual optimization strategies in Huber-L1 optical flow with temporal subspace constraints for non-rigid sequence registration.",
            "Robust discriminative tracking via structured prior regularization.",
            "Long-term path prediction in urban scenarios using circular distributions.",
            "Hybrid Ageing Patterns for face age estimation.",
            "Fast and reliable minimal relative pose estimation under planar motion.",
            "Pairwise registration in indoor environments using adaptive combination of 2D and 3D cues.",
            "A further study of low resolution androgenic hair patterns as a soft biometric trait.",
            "Vehicle detection in intelligent transportation systems and its applications under varying environments: A review.",
            "Salient object detection employing robust sparse representation and local consistency.",
            "Minimum barrier superpixel segmentation.",
            "Learning deep similarity models with focus ranking for fabric image retrieval.",
            "Joint segmentation of color and depth data based on splitting and merging driven by surface fitting.",
            "Distances evolution analysis for online and off-line human object interaction recognition.",
            "Marker-based non-overlapping camera calibration methods with additional support camera views.",
            "A P3P problem solver representing all parameters as a linear combination.",
            "TRISK: A local features extraction framework for texture-plus-depth content matching.",
            "Hybrid eye center localization using cascaded regression and hand-crafted model fitting.",
            "Hair detection, segmentation, and hairstyle classification in the wild.",
            "Multidimensional directional steerable filters - Theory and application to 3D flow estimation.",
            "A novel local wavelet energy mesh pattern (LWEMeP) for heterogeneous face recognition.",
            "Reading car license plates using deep neural networks.",
            "Development and utilization of a disgusting image dataset to understand and predict visual disgust.",
            "GoDP: Globally Optimized Dual Pathway deep network architecture for facial landmark localization in-the-wild.",
            "Found a good match: Should I keep searching? - Accuracy and performance in iris matching using 1-to-First search.",
            "Patch-based face recognition using a hierarchical multi-label matcher.",
            "Detection of moving objects through turbulent media. Decomposition of Oscillatory vs Non-Oscillatory spatio-temporal vector fields.",
            "Detection of roadside vegetation using Fully Convolutional Networks.",
            "Calibration free, user-independent gaze estimation with tensor analysis.",
            "Unobtrusive and pervasive video-based eye-gaze tracking.",
            "Recognition of action dynamics in fencing using multimodal cues.",
            "Three-step-ahead prediction for object tracking.",
            "Beyond one-hot encoding: Lower dimensional target embedding.",
            "The L0-regularized discrete variational level set method for image segmentation.",
            "Gait recognition in the wild using shadow silhouettes.",
            "Efficient contour match kernel.",
            "Context awareness in biometric systems and methods: State of the art and future scenarios.",
            "Speeded up detection of squared fiducial markers.",
            "A brand new application of visual-audio fingerprints: Estimating the position of the pirate in a theater - A case study.",
            "ONPPn: Orthogonal Neighborhood Preserving Projection with Normalization and its applications.",
            "Online background subtraction with freely moving cameras using different motion boundaries.",
            "On the generalization of color texture-based face anti-spoofing.",
            "Learning CNNs from weakly annotated facial images.",
            "Can we teach computers to understand art? Domain adaptation for enhancing deep networks capacity to de-abstract art.",
            "Proximity-Aware Hierarchical Clustering of unconstrained faces.",
            "Structured deep Fisher pruning for efficient facial trait classification.",
            "Kinematic Spline Curves: A temporal invariant descriptor for fast action recognition.",
            "Attribute annotation on large-scale image database by active knowledge transfer.",
            "Convolutional Neural Networks for Subjective Face Attributes.",
            "Robust in-plane and out-of-plane face detection algorithm using frontal face detector and symmetry extension.",
            "Recurrent semi-supervised classification and constrained adversarial generation with motion capture data.",
            "Survey on automatic lip-reading in the era of deep learning.",
            "Benchmark database for fine-grained image classification of benthic macroinvertebrates.",
            "Learning contextual dissimilarity on tensor product graph for visual re-ranking.",
            "Lane estimation by particle-filtering combined with likelihood computation of line boundaries and motion compensation.",
            "Deep and low-level feature based attribute learning for person re-identification.",
            "Template adaptation for face verification and identification.",
            "KEPLER: Simultaneous estimation of keypoints and 3D pose of unconstrained faces in a unified framework by learning efficient H-CNN regressors.",
            "Top-down model fitting for hand pose recovery in sequences of depth images.",
            "Exploiting feature representations through similarity learning, post-ranking and ranking aggregation for person re-identification.",
            "Automatic local shape spectrum analysis for 3D facial expression recognition.",
            "Enhancing convolutional neural networks for face recognition with occlusion maps and batch triplet loss.",
            "The challenge of simultaneous object detection and pose estimation: A comparative study.",
            "Improving face representation learning with center invariant loss.",
            "Modeling and synthesis of kinship patterns of facial expressions.",
            "Image annotation: Then and now.",
            "A comprehensive review of fruit and vegetable classification techniques.",
            "ISEC: Iterative over-segmentation via edge clustering.",
            "Modeling of facial aging and kinship: A survey.",
            "Multi-view 3D face reconstruction with deep recurrent neural networks.",
            "LCO: Lightweight Convolution Operators for fast tracking."
        ]
    },
    {
        "name": "IVC",
        "year": "2017",
        "info": "2017: Volumes\n57,\n58,\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67,\n68",
        "count": 116,
        "papers": [
            "Open-set face recognition across look-alike faces in real-world scenarios.",
            "Descriptors and regions of interest fusion for in- and cross-database gender classification in the wild.",
            "Exploiting scene maps and spatial relationships in quasi-static scenes for video face clustering.",
            "Near-lighting Photometric Stereo for unknown scene distance and medium attenuation.",
            "Robust hashing for multi-view data: Jointly learning low-rank kernelized similarity consensus and hash functions.",
            "Salient object detection with low-rank approximation and ℓ2, 1-norm minimization.",
            "On robust optical flow estimation on image sequences with differently exposed frames using primal-dual optimization.",
            "On the effect of hyperedge weights on hypergraph learning.",
            "Shape-indifferent stereo disparity based on disparity gradient estimation.",
            "Physically inspired depth-from-defocus.",
            "An efficient and reliable coarse-to-fine approach for asphalt pavement crack detection.",
            "Eye detection in a facial image under pose variation based on multi-scale iris shape feature.",
            "Color-blob-based COSFIRE filters for object recognition.",
            "Photometric stereo with only two images: A theoretical study and numerical resolution.",
            "Statistical non-rigid ICP algorithm and its application to 3D face alignment.",
            "Dense 3D face alignment from 2D video for real-time use.",
            "Variable-state Latent Conditional Random Field models for facial expression analysis.",
            "Pose-specific non-linear mappings in feature space towards multiview facial expression recognition.",
            "Joint regularized nearest points for image set based face recognition.",
            "Leveraging multiple cues for recognizing family photos.",
            "Effective and efficient human action recognition using dynamic frame skipping and trajectory rejection.",
            "Comparing random forest approaches to segmenting and classifying gestures.",
            "Lessons from collecting a million biometric samples.",
            "Special issue on Best of Biometrics 2015.",
            "Review of the Fingerprint Liveness Detection (LivDet) competition series: 2009 to 2015.",
            "Current research in eye movement biometrics: An analysis based on BioEye 2015 competition.",
            "Recompression effects in iris recognition.",
            "Implications of ocular pathologies for iris recognition reliability.",
            "A novel iris weight map method for less constrained iris recognition based on bit stability and discriminability.",
            "Facial attributes for active authentication on mobile devices.",
            "Examplar coherent 3D face reconstruction from forensic mugshot database.",
            "Joint prototype and metric learning for image set classification: Application to video face identification.",
            "Semi self-training beard/moustache detection and segmentation simultaneously.",
            "Multi-label convolutional neural network based pedestrian attribute classification.",
            "Utilizing overt and latent linguistic structure to improve keystroke-based authentication.",
            "Security analysis and improvement of some biometric protected templates based on Bloom filters.",
            "Binary feature fusion for discriminative and secure multi-biometric cryptosystems.",
            "Local feature approach to dorsal hand vein recognition by Centroid-based Circular Key-point Grid and fine-grained matching.",
            "Ocular biometrics in the visible spectrum: A survey.",
            "Wavelet-based gender detection on off-line handwritten documents using probabilistic finite state automata.",
            "Human pose search using deep networks.",
            "Fully-automated person re-identification in multi-camera surveillance system with a robust kernel descriptor and effective shadow removal method.",
            "Sparse composition of body poses and atomic actions for human activity recognition in RGB-D videos.",
            "Regularization techniques for high-dimensional data analysis.",
            "Going deeper into action recognition: A survey.",
            "Non-convex regularized self-representation for unsupervised feature selection.",
            "Random Multi-Graphs: A semi-supervised learning framework for classification of high dimensional data.",
            "Semi-supervised learning through adaptive Laplacian graph trimming.",
            "Discriminative transfer learning with sparsity regularization for single-sample face recognition.",
            "A novel companion objective function for regularization of deep convolutional neural networks.",
            "Group sparse autoencoder.",
            "Person re-identification with block sparse recovery.",
            "Kinship verification using neighborhood repulsed correlation metric learning.",
            "Robust uncalibrated stereo rectification with constrained geometric distortions (USR-CGD).",
            "Robust scene matching method based on sparse representation and iterative correction.",
            "Visual tracking with structured patch-based model.",
            "Learning spatially regularized similarity for robust visual tracking.",
            "Cell tracking using deep neural networks with multi-task learning.",
            "Plant cell tracking using Kalman filter based local graph matching.",
            "Multimedia news QA: Extraction and visualization integration with multiple-source information.",
            "A novel correspondence-based face-hallucination method.",
            "Robust pedestrian detection under deformation using simple boosted features.",
            "Gesture sequence recognition with one shot learned CRF/HMM hybrid model.",
            "Martial Arts, Dancing and Sports dataset: A challenging stereo and multi-view dataset for 3D human pose estimation.",
            "A multi-model restoration algorithm for recovering blood vessels in skin images.",
            "Decision-level fusion for single-view gait recognition with various carrying and clothing conditions.",
            "Estimation of measurement uncertainty in stereo vision system.",
            "Saliency and KAZE features assisted object segmentation.",
            "Automatic recognition of flower species in the natural environment.",
            "Multiple consumer-grade depth camera registration using everyday objects.",
            "Extended three-dimensional rotation invariant local binary patterns.",
            "User-assisted image shadow removal.",
            "Marker-based human pose tracking using adaptive annealed particle swarm optimization with search space partitioning.",
            "Infrared dim target detection based on total variation regularization and principal component pursuit.",
            "Semi-supervised multi-label feature selection via label correlation analysis with l1-norm graph embedding.",
            "DSP: Discriminative Spatial Part modeling for Fine-Grained Visual Categorization.",
            "A learning-based variable size part extraction architecture for 6D object pose recovery in depth images.",
            "3D facial shape reconstruction using macro- and micro-level features from high resolution facial images.",
            "Moving object segmentation for jittery videos, by clustering of stabilized latent trajectories.",
            "A versatile homography computation method based on two real points.",
            "Robust local features for remote face recognition.",
            "Fine-grained categorization via CNN-based automatic extraction and integration of object-level and part-level features.",
            "Automatic evaluation of sports motion: A generic computation of spatial and temporal errors.",
            "Compression of Probabilistic Volumetric Models using multi-resolution scene flow.",
            "Joint gender, ethnicity and age estimation from 3D faces: An experimental illustration of their correlations.",
            "Context-aware obstacle detection for navigation by visually impaired.",
            "Guest editorial: Multimodal sentiment analysis and mining in the wild.",
            "A survey of multimodal sentiment analysis.",
            "From pixels to sentiment: Fine-tuning CNNs for visual sentiment prediction.",
            "AFEW-VA database for valence and arousal estimation in-the-wild.",
            "The Conflict Escalation Resolution (CONFER) Database.",
            "Behavioral cues help predict impact of advertising on future sales.",
            "GOAALLL!: Using sentiment in the world cup to explore theories of emotion.",
            "Video-based emotion recognition in the wild using deep transfer learning and score fusion.",
            "Strength modelling for real-worldautomatic continuous affect recognition from audiovisual signals.",
            "GeoPose3K: Mountain landscape dataset for camera pose estimation in outdoor environments.",
            "Visual tracking with multiple Hough detectors.",
            "Handwritten signature verification using the quad-tree histogram of templates and a Support Vector-based artificial immune classification.",
            "Optimizing explicit feature maps on intervals.",
            "Corrigendum to \"Sparse Composition of Body Poses and Atomic Actions for Human Activity Recognition in RGB-D Videos\" [Image Vis. Comput. 59 (2017) 63-75].",
            "Multiple structure recovery via robust preference analysis.",
            "Robust epipolar geometry estimation using noisy pose priors.",
            "Feature selection in multimedia: The state-of-the-art review.",
            "Texture features for object salience.",
            "Efficient rotation estimation for 3D registration and global localization in structured point clouds.",
            "Analyzing of facial paralysis by shape analysis of 3D face sequences.",
            "Editorial for the Special Issue of IMAVIS on Automotive Vision.",
            "Predictive monocular odometry (PMO): What is possible without RANSAC and multiframe bundle adjustment?",
            "3D visual perception for self-driving cars using a multi-camera system: Calibration, mapping, localization, and obstacle detection.",
            "Stereo vision during adverse weather - Using priors to increase robustness in real-time stereo vision.",
            "The Stixel World: A medium-level representation of traffic scenes.",
            "Regression of feature scale tracklets for decimeter visual localization.",
            "Ego-Lane Analysis System (ELAS): Dataset and algorithms.",
            "Moving object detection and segmentation in urban environments from a moving platform.",
            "Computer vision in automated parking systems: Design, implementation and challenges.",
            "Training my car to see using virtual worlds."
        ]
    },
    {
        "name": "IVC",
        "year": "2016",
        "info": "2016: Volumes\n45,\n46,\n47,\n48-49,\n50,\n51,\n52,\n53,\n54,\n55,\n56",
        "count": 92,
        "papers": [
            "Invariant texture classification using a spatial filter bank in multi-resolution analysis.",
            "A novel low false alarm rate pedestrian detection framework based on single depth images.",
            "Background modeling using Object-based Selective Updating and Correntropy adaptation.",
            "What is a good evaluation protocol for text localization systems? Concerns, arguments, comparisons and solutions.",
            "Local part model for action recognition.",
            "A framework for semantic people description in multi-camera surveillance systems.",
            "Piecewise-planar reconstruction using two views.",
            "Sketch retrieval via local dense stroke features.",
            "300 W: Special issue on facial landmark localisation \"in-the-wild\".",
            "300 Faces In-The-Wild Challenge: database and results.",
            "M3 CSR: Multi-view, multi-scale and multi-component cascade shape regression.",
            "Approaching human level facial landmark localization by deep learning.",
            "L2, 1-based regression and prediction accumulation across views for robust facial landmark detection.",
            "Multi-view facial landmark detector learned by the Structured Output SVM.",
            "Multi-view facial landmark detection by using a 3D shape model.",
            "Viewpoint-independent gait recognition through morphological descriptions of 3D human reconstructions.",
            "Infrared ship target segmentation through integration of multiple feature maps.",
            "A Time Flexible Kernel framework for video-based activity recognition.",
            "Violence detection using Oriented VIolent Flows.",
            "A variational based model for estimating true tracklets in wide area surveillance.",
            "3D reconstruction: Why should the accuracy always be presented in the pixel unit?",
            "Action recognition via spatio-temporal local features: A comprehensive study.",
            "Estimating the focus of expansion in a video sequence using the trajectories of interest points.",
            "Degenerate motions in multicamera cluster SLAM with non-overlapping fields of view.",
            "Enhancing feature tracking with gyro regularization.",
            "Visual units and confusion modelling for automatic lip-reading.",
            "Orthonormal dictionary learning and its application to face recognition.",
            "A discriminative and sparse topic model for image classification and annotation.",
            "Cascade of Tasks for facial expression analysis.",
            "BLAID: Boundaries from Locally Adaptive Isotropic Detection.",
            "Fully automatic person segmentation in unconstrained video using spatio-temporal conditional random fields.",
            "Robust face alignment and tracking by combining local search and global fitting.",
            "Online unsupervised feature learning for visual tracking.",
            "Real-time facial action unit intensity prediction with regularized metric learning.",
            "A neural implementation of the Hough transform and the advantages of explaining away.",
            "On designing practical long range near infrared-based face recognition systems.",
            "Large scale face identification by combined iconic features and 3D joint invariant signatures.",
            "Recent trends in gesture recognition: how depth data has improved classical approaches.",
            "Fixing the root node: Efficient tracking and detection of 3D human pose through local solutions.",
            "Towards a mean body for apparel design.",
            "A robust similarity measure for volumetric image registration with outliers.",
            "Efficient algorithms for robust estimation of relative translation.",
            "Improving facial analysis and performance driven animation through disentangling identity and expression.",
            "A Bayesian approach to simultaneously recover camera pose and non-rigid shape from monocular images.",
            "Cloudmaps from static ground-view video.",
            "Highly accurate optical flow estimation on superpixel tree.",
            "True scaled 6 DoF egocentric localisation with monocular wearable systems.",
            "Action recognition using saliency learned from recorded human gaze.",
            "Discovering object aspects from video.",
            "Aerial image sequence geolocalization with road traffic as invariant feature.",
            "Special Issue on Event-based Media Processing and Analysis.",
            "Event-based media processing and analysis: A survey of the literature.",
            "A framework for dynamic restructuring of semantic video analysis systems based on learning attention control.",
            "Learning to detect video events from zero or very few video examples.",
            "Multimodal classification of events in social media.",
            "Event-enabled intelligent asset selection and grouping for photobook creation.",
            "Compression of multiple user photo galleries.",
            "Randomized time warping for motion recognition.",
            "Iterated random walks with shape prior.",
            "Exploring canonical correlation analysis with subspace and structured sparsity for web image annotation.",
            "Detection of multiple salient objects through the integration of estimated foreground clues.",
            "Estimation of mirror shape and extrinsic parameters in axial non-central catadioptric systems.",
            "CEDContours: A high speed contour detector for color images.",
            "Deceiving faces: When plastic surgery challenges face recognition.",
            "Canonical image selection based on human affects in photographic images.",
            "Recognizing Future Hot Topics and Hard Problems In Biometrics Research.",
            "The changing fortunes of pattern recognition and computer vision.",
            "Is automatic facial expression recognition of emotions coming to a dead end? The rise of the new kids on the block.",
            "Sketch Recognition: What Lies Ahead?",
            "Face recognition outside the visible spectrum.",
            "Combining forces: Data fusion across man and machine for biometric analysis.",
            "Visible-wavelength iris/periocular imaging and recognition surveillance environments.",
            "Presentations and attacks, and spoofs, oh my.",
            "Face recognition for authentication on mobile devices.",
            "Signature analysis in the context of mobile devices.",
            "Handcrafted vs. learned representations for human action recognition.",
            "From handcrafted to learned representations for human action recognition: A survey.",
            "Towards optimal VLAD for human action recognition from still images.",
            "Robust geometric ℓp-norm feature pooling for image classification and action recognition.",
            "Action recognition by joint learning.",
            "Dynamic texture recognition with video set based collaborative representation.",
            "3D-based Deep Convolutional Neural Network for action recognition with depth sequences.",
            "Deep and fast: Deep learning hashing with semi-supervised graph construction.",
            "Cross-view action recognition by cross-domain learning.",
            "Cross-domain action recognition via collective matrix factorization with graph Laplacian regularization.",
            "Dual many-to-one-encoder-based transfer learning for cross-dataset human action recognition.",
            "Statistical adaptive metric learning in visual action feature set recognition.",
            "Using the conflict in Dempster-Shafer evidence theory as a rejection criterion in classifier output combination for 3D human action recognition.",
            "Weakly supervised object localization and segmentation in videos.",
            "Pain intensity estimation by a self-taught selection of histograms of topographical features.",
            "A survey on heterogeneous face recognition: Sketch, infra-red, 3D and low-resolution.",
            "An automatic 3D point cloud registration method based on regional curvature maps."
        ]
    },
    {
        "name": "IVC",
        "year": "2015",
        "info": "2015: Volumes\n33,\n34,\n35,\n36,\n37,\n38,\n39,\n40,\n41,\n42,\n43,\n44",
        "count": 62,
        "papers": [
            "Multiview stereo and silhouette fusion via minimizing generalized reprojection error.",
            "Fitting multiple projective models using clustering-based Markov chain Monte Carlo inference.",
            "Face recognition in the SWIR band when using single sensor multi-wavelength imaging systems.",
            "Robust tracking with interest points: A sparse representation approach.",
            "Feature correspondence based on directed structural model matching.",
            "Eye detection using discriminatory Haar features and a new efficient SVM.",
            "Optimized polygonal approximations through vertex relocations in contour neighborhoods.",
            "Visual re-identification across large, distributed camera networks.",
            "Simultaneous high-dimensional clustering and feature selection using asymmetric Gaussian mixture models.",
            "The Cognitive Dialogue: A new model for vision implementing common sense reasoning.",
            "Generalized essential matrix: Properties of the singular value decomposition.",
            "Discriminative and generative vocabulary tree: With application to vein image authentication and recognition.",
            "Multi-scale hybrid saliency analysis for region of interest detection in very high resolution remote sensing images.",
            "Robust regional bounding spherical descriptor for 3D face recognition and emotion analysis.",
            "Application of Shearlet transform to classification of surface defects for metals.",
            "Enhanced disparity estimation in stereo images.",
            "Incremental learning from chunk data for IDR/QR.",
            "Unrestricted pose-invariant face recognition by sparse dictionary matrix.",
            "Registration of images with affine geometric distortion based on Maximally Stable Extremal Regions and phase congruency.",
            "Facial landmarking for in-the-wild images with local inference based on global appearance.",
            "Precise localization of eye centers in low resolution color images.",
            "Near laser-scan quality 3-D face reconstruction from a low-quality depth stream.",
            "Incorporating higher order models for occlusion resilient motion segmentation in streaming videos.",
            "Robust stereo matching using adaptive random walk with restart algorithm.",
            "Non-uniform patch based face recognition via 2D-DWT.",
            "Stabilization of panoramic videos from mobile multi-camera platforms.",
            "Local color transformation analysis for sudden illumination change detection.",
            "Incremental probabilistic Latent Semantic Analysis for video retrieval.",
            "A stereo matching approach based on particle filters and scattered control landmarks.",
            "Visual tracking based on online sparse feature learning.",
            "Document image binarization using local features and Gaussian mixture modeling.",
            "A Self-adaptive CodeBook (SACB) model for real-time background subtraction.",
            "How to use Bag-of-Words model better for image classification.",
            "Feature selection for position estimation using an omnidirectional camera.",
            "Optimized projection patterns for stereo systems.",
            "Visual tracking of non-rigid objects with partial occlusion through elastic structure of local patches and hierarchical diffusion.",
            "Non-negative matrix completion for action detection.",
            "Effects of texture addition on optical flow performance in images with poor texture.",
            "Approaches for automatic low-dimensional human shape refinement with priors or generic cues using RGB-D data.",
            "Fusion of a panoramic camera and 2D laser scanner data for constrained bundle adjustment in GPS-denied environments.",
            "Computation of graph edit distance: Reasoning about optimality and speed-up.",
            "Hallucination of facial details from degraded images using 3D face models.",
            "Developing a contactless palmprint authentication system by introducing a novel ROI extraction method.",
            "Semi-supervised sparse feature selection based on multi-view Laplacian regularization.",
            "A novel algorithm for defect inspection of touch panels.",
            "Unified multi-lateral filter for real-time depth map enhancement.",
            "Chromatic shadow detection and tracking for moving foreground segmentation.",
            "RSILC: Rotation- and Scale-Invariant, Line-based Color-aware descriptor.",
            "Complex event recognition using constrained low-rank representation.",
            "Ordered trajectories for human action recognition with large number of classes.",
            "Predicting memorability of images using attention-driven spatial pooling and image semantics.",
            "Empirical analysis of cascade deformable models for multi-view face detection.",
            "Application of gradient-based edge detectors to determine vanishing points in monoscopic images: Comparative study.",
            "Globally rotation invariant multi-scale co-occurrence local binary pattern.",
            "Skewed stereo time-of-flight camera for translucent object imaging.",
            "Exploiting structural constraints for visual object tracking.",
            "Investigating new calibration methods without feature detection for TOF cameras.",
            "Accurate abandoned and removed object classification using hierarchical finite state machine.",
            "Word spotting in historical documents using primitive codebook and dynamic programming.",
            "Hankelet-based dynamical systems modeling for 3D action recognition.",
            "Boosting Fisher vector based scoring functions for person re-identification.",
            "Robust face hallucination using ensemble of feature-based regression functions and classifiers."
        ]
    },
    {
        "name": "IVC",
        "year": "2014",
        "info": "Volume 32: 2014",
        "count": 100,
        "papers": [
            "Modeling and correction of multipath interference in time of flight cameras.",
            "Tracking in dense crowds using prominence and neighborhood motion concurrence.",
            "Face gender classification: A statistical study when neutral and distorted faces are combined for training and testing purposes.",
            "Two-dimensional multi-pixel anisotropic Gaussian filter for edge-line segment (ELS) detection.",
            "Direct model based visual tracking and pose estimation using mutual information.",
            "Lattice estimation from images of patterns that exhibit translational symmetry.",
            "Comparison of human and computer performance across face recognition experiments.",
            "Corrigendum to \"Hierarchical On-line Appearance-Based Tracking for 3D Head Pose, Eyebrows, Lips, Eyelids and Irises\" [Image Vision Comput. (2013) 322-340].",
            "Unsupervised multiphase color-texture image segmentation based on variational formulation and multilayer graph.",
            "Facial expression recognition experiments with data from television broadcasts and the World Wide Web.",
            "Unsupervised manifold learning using Reciprocal kNN Graphs in image re-ranking and rank aggregation tasks.",
            "3D human motion analysis framework for shape similarity and retrieval.",
            "Euclidean upgrading from segment lengths: DLT-like algorithm and its variants.",
            "Learning gaze biases with head motion for head pose-free gaze estimation.",
            "Ensemble dictionary learning for saliency detection.",
            "Sparse feature selection based on graph Laplacian for web image annotation.",
            "Fast stereo matching using adaptive guided filtering.",
            "Self-calibration of stationary non-rotating zooming cameras.",
            "Adaptive on-line similarity measure for direct visual tracking.",
            "Recognizing activities in multiple views with fusion of frame judgments.",
            "A distinct and compact texture descriptor.",
            "3D shape descriptor for object recognition based on Kinect-like depth image.",
            "A survey of approaches and trends in person re-identification.",
            "Online parameter tuning for object tracking algorithms.",
            "Contour-based focus of attention mechanism to speed up object detection and labeling in 3D scenes.",
            "Efficient generic face model fitting to images and videos.",
            "Local histogram specification for face recognition under varying lighting conditions.",
            "Ensemble of multiple instance classifiers for image re-ranking.",
            "A unified approach to the recognition of complex actions from sequences of zone-crossings.",
            "Covariance descriptor based on bio-inspired features for person re-identification and face verification.",
            "Unsupervised flow-based motion analysis for an autonomous moving system.",
            "A novel monochromatic cue for detecting regions of visual interest.",
            "Morphological analysis for investigating artistic images.",
            "Improving texture categorization with biologically-inspired filtering.",
            "Global registration of large collections of range images with an improved Optimization-on-a-Manifold approach.",
            "Evaluating spatiotemporal interest point features for depth-based action recognition.",
            "Robust visual tracking via augmented kernel SVM.",
            "Automatic expression spotting in videos.",
            "Password hardened fuzzy vault for fingerprint authentication system.",
            "Generic polar harmonic transforms for invariant image representation.",
            "Simultaneous active camera array focus plane estimation and occluded moving object imaging.",
            "Real-time fingertip localization conditioned on hand gesture classification.",
            "Dynamic-static unsupervised sequentiality, statistical subunits and lexicon for sign language recognition.",
            "Exploiting Universum data in AdaBoost using gradient descent.",
            "Keypoint descriptor matching with context-based orientation estimation.",
            "Timely autonomous identification of UAV safe landing zones.",
            "Automatic sub-category partitioning and parts localization for learning a robust object model.",
            "A review of recent advances in visual speech decoding.",
            "Accelerometer-based correction of skewed horizon and keystone distortion in digital photography.",
            "Motion boundary based sampling and 3D co-occurrence descriptors for action recognition.",
            "Best of Automatic Face and Gesture Recognition 2013.",
            "Automatic measurement of ad preferences from facial responses gathered over the Internet.",
            "Nonverbal social withdrawal in depression: Evidence from manual and automatic analyses.",
            "Automatic audiovisual behavior descriptors for psychological disorder analysis.",
            "Classification and weakly supervised pain localization using multiple segment representation.",
            "Non-manual grammatical marker recognition based on multi-scale, spatio-temporal analysis of head pose and facial expressions.",
            "Exploiting multi-expression dependences for implicit multi-emotion video tagging.",
            "BP4D-Spontaneous: a high-resolution spontaneous 3D dynamic facial expression database.",
            "Online learning and fusion of orientation appearance models for robust rigid object tracking.",
            "Coupled person orientation estimation and appearance modeling using spherical harmonics.",
            "Data-driven hair segmentation with isomorphic manifold inference.",
            "Exploring album structure for face recognition in online social networks.",
            "A framework for joint estimation of age, gender and ethnicity on a large database.",
            "A talking profile to distinguish identical twins.",
            "Mask spoofing in face recognition and countermeasures.",
            "Face detection by structural models.",
            "Iterative Grassmannian optimization for robust image alignment.",
            "Learning low-rank and discriminative dictionary for image classification.",
            "Non-rigid registration using gradient of self-similarity response.",
            "Sparse representation with multi-manifold analysis for texture classification from few training images.",
            "A spectral independent approach for physiological and geometric based face recognition in the visible, middle-wave and long-wave infrared bands.",
            "Real-time 3D face tracking based on active appearance model constrained by depth data.",
            "Estimating layout of cluttered indoor scenes using trajectory-based priors.",
            "Gaussian Markov random field based improved texture descriptor for image segmentation.",
            "Automatic annotation of tennis games: An integration of audio, vision, and learning.",
            "Partial least squares-based human upper body orientation estimation with combined detection and tracking.",
            "A tensor-based deep learning framework.",
            "Robust object tracking using least absolute deviation.",
            "BIG-OH: BInarization of gradient orientation histograms.",
            "Half-sweep imaging for depth from defocus.",
            "Recognizing in the depth: Selective 3D Spatial Pyramid Matching Kernel for object and scene categorization.",
            "Discrete area filters in accurate detection of faces and facial features.",
            "Radial shifted Legendre moments for image analysis and invariant image recognition.",
            "Model-based graph-cut method for automatic flower segmentation with spatial constraints.",
            "The effects of temperature variation on videometric measurement and a compensation method.",
            "A local approach for 3D object recognition through a set of size functions.",
            "Eikonal-based region growing for efficient clustering.",
            "Scale-invariant contour segment context in object detection.",
            "Representation of facial expression categories in continuous arousal-valence space: Feature and correlation.",
            "Using a Discrete Hidden Markov Model Kernel for lip-based biometric identification.",
            "Adaptive visual tracking using the prioritized Q-learning algorithm: MDP-based parameter learning approach.",
            "Dynamic scene understanding using temporal association rules.",
            "Attribute-based learning for gait recognition using spatio-temporal interest points.",
            "Single frame correction of motion artifacts in PMD-based time of flight cameras.",
            "Special issue on \"Multi-biometrics and Mobile-biometrics: Recent Advances and Future Research\".",
            "Bi-modal biometric authentication on mobile phones in challenging conditions.",
            "FIRME: Face and Iris Recognition for Mobile Engagement.",
            "Automatic usability and stress analysis in mobile biometrics.",
            "Local circular patterns for multi-modal facial gender and ethnicity classification.",
            "A measure of information gained through biometric systems."
        ]
    },
    {
        "name": "IVC",
        "year": "2013",
        "info": "Volume 31: 2013",
        "count": 80,
        "papers": [
            "On growth and formlets: Sparse multi-scale coding of planar shape.",
            "Multilabel partition moves for MRF optimization.",
            "Salient object detection: From pixels to segments.",
            "Toward designing intelligent PDEs for computer vision: An optimal control approach.",
            "A forgery detection algorithm for exemplar-based inpainting images using multi-region relation.",
            "Accurate subpixel edge location based on partial area effect.",
            "Integration of 3D and multispectral data for cultural heritage applications: Survey and perspectives.",
            "Gauge-SURF descriptors.",
            "Most cited paper award.",
            "Introduction To The Special Issue On Affect Analysis In Continuous Input.",
            "Categorical and dimensional affect analysis in continuous input: Current trends and future directions.",
            "Tracking continuous emotional trends of participants during affective dyadic interactions using body language and speech information.",
            "LSTM-Modeling of continuous emotions in an audiovisual affect recognition framework.",
            "Fusion of facial expressions and EEG for implicit affective tagging.",
            "Recognizing expressions from face and body gesture by temporal normalized motion and appearance features.",
            "The MAHNOB Laughter database.",
            "Towards the automatic detection of spontaneous agreement and disagreement based on nonverbal behaviour: A survey of related cues, databases, and tools.",
            "Canonical locality preserving Latent Variable Model for discriminative pose inference.",
            "A unified probabilistic framework for automatic 3D facial expression analysis based on a Bayesian belief inference and statistical feature models.",
            "3D head tracking for fall detection using a single calibrated camera.",
            "A text reading algorithm for natural images.",
            "Optical flow estimation for motion-compensated compression.",
            "Homeomorphic Manifold Analysis (HMA): Generalized separation of style and content on manifolds.",
            "Contrast-Adaptive Removable Visible Watermarking (CARVW) mechanism.",
            "Hierarchical On-line Appearance-Based Tracking for 3D head pose, eyebrows, lips, eyelids and irises.",
            "Stable and fast techniques for unambiguous compound phase coding.",
            "Symmetry-driven shape description for image retrieval.",
            "Manifold based sparse representation for facial understanding in natural images.",
            "Offline text-independent writer identification using codebook and efficient code extraction methods.",
            "A computational approach to body mass index prediction from face images.",
            "The Weibull manifold in low-level image processing: An application to automatic image focusing.",
            "Machine learning in motion analysis: New advances.",
            "A review of motion analysis methods for human Nonverbal Communication Computing.",
            "Markov Chain Monte Carlo Modular Ensemble Tracking.",
            "Simultaneous particle tracking in multi-action motion models with synthesized paths.",
            "Vector field analysis for multi-object behavior modeling.",
            "Two-layer dual gait generative models for human motion estimation from a single camera.",
            "On-line Support Vector Regression of the transition model for the Kalman filter.",
            "Learning to rank biological motion trajectories.",
            "Appearance-based navigation and homing for autonomous mobile robot.",
            "Empirical mode decomposition on skeletonization pruning.",
            "Multi-Kernel Appearance Model.",
            "Non-parametric hand pose estimation with object context.",
            "Geometric particle swarm optimization for robust visual ego-motion estimation via particle filtering.",
            "Feature subset selection applied to model-free gait recognition.",
            "Motion-based segmentation of objects using overlapping temporal windows.",
            "Multi-agent event recognition by preservation of spatiotemporal relationships between probabilistic models.",
            "Improved background modeling for real-time spatio-temporal non-parametric moving object detection strategies.",
            "Adaptive large window correlation for optical flow estimation with discrete optimization.",
            "On ear-based human identification in the mid-wave infrared spectrum.",
            "Recognizing hand gestures using the weighted elastic graph matching (WEGM) method.",
            "Using texture to complement color in image matting.",
            "Vehicle matching in smart camera networks using image projection profiles at multiple instances.",
            "Stochastic bottom-up fixation prediction and saccade generation.",
            "Guided depth enhancement via a fast marching method.",
            "An improved distance-based relevance feedback strategy for image retrieval.",
            "Fast perspective recovery of text in natural scenes.",
            "Reliability measure for shape-from-focus.",
            "Efficient and robust model fitting with unknown noise scale.",
            "An efficient approach for scene categorization based on discriminative codebook learning in bag-of-words framework.",
            "Image-consistent patches from unstructured points with J-linkage.",
            "Integrating tracking with fine object segmentation.",
            "Spatiotemporal bag-of-features for early wildfire smoke detection.",
            "Selection of a best metric and evaluation of bottom-up visual saliency models.",
            "A new level set method for inhomogeneous image segmentation.",
            "Integrating multiple character proposals for robust scene text extraction.",
            "Building facade detection, segmentation, and parameter estimation for mobile robot stereo vision.",
            "Visual tracking based on Distribution Fields and online weighted multiple instance learning.",
            "Human activity recognition in videos using a single example.",
            "A new evaluation measure for color image segmentation based on genetic programming approach.",
            "Road traffic density estimation using microscopic and macroscopic parameters.",
            "Integration of multi-feature fusion and dictionary learning for face recognition.",
            "Extended Topological Active Nets.",
            "Evaluation of two-view geometry methods with automatic ground-truth generation.",
            "Spatially aware feature selection and weighting for object retrieval.",
            "Mixtures of Gaussian process models for human pose estimation.",
            "Keyword spotting in unconstrained handwritten Chinese documents using contextual word model.",
            "Corisco: Robust edgel-based orientation estimation for generic camera models.",
            "Hierarchical classification of images by sparse approximation.",
            "Learning structured visual dictionary for object tracking."
        ]
    },
    {
        "name": "IVC",
        "year": "2012",
        "info": "Volume 30: 2012",
        "count": 98,
        "papers": [
            "Structured learning of local features for human action classification and localization.",
            "Colored exaggerative caricature creation using inter- and intra-correlations of feature shapes and positions.",
            "Real-time viewpoint-invariant hand localization with cluttered backgrounds.",
            "An efficient ear localization technique.",
            "Saliency from hierarchical adaptation through decorrelation and variance normalization.",
            "Visual SLAM: Why filter?",
            "Efficient video denoising based on dynamic nonlocal means.",
            "Extended local binary patterns for texture classification.",
            "Morphable model space based face super-resolution reconstruction and recognition.",
            "A fast robot homing approach using sparse image waypoints.",
            "Shape from pairwise silhouettes for plan-view map generation.",
            "Best of Automatic Face and Gesture Recognition 2011.",
            "Context modeling for facial landmark detection based on Non-Adjacent Rectangle (NAR) Haar-like feature.",
            "Real-time face tracking and recognition by sparse eigentracker with associative mapping to 3D shape.",
            "High-throughput-derived biologically-inspired features for unconstrained face recognition.",
            "Demographic effects on estimates of automatic face recognition performance.",
            "The Good, the Bad, and the Ugly Face Challenge Problem.",
            "Output-associative RVM regression for dimensional and continuous emotion prediction.",
            "Painful monitoring: Automatic pain monitoring using the UNBC-McMaster shoulder pain expression archive database.",
            "Using a Product Manifold distance for unsupervised action recognition.",
            "Human skeleton tracking from depth data using geodesic distances and optical flow.",
            "Dynamic hand gesture recognition: An exemplar-based approach from motion divergence fields.",
            "3D hand tracking for human computer interaction.",
            "The human motion database: A cognitive and parametric sampling of human motion.",
            "I2VM: Incremental import vector machines.",
            "Max-margin Non-negative Matrix Factorization.",
            "Scene Aware Detection and Block Assignment Tracking in crowded scenes.",
            "An on-line learning method for face association in personal photo collection.",
            "Robust estimation of surface properties and interpolation of shadow/specularity components.",
            "Shape based appearance model for kernel tracking.",
            "On collaborative people detection and tracking in complex scenarios.",
            "On nonlinear dimensionality reduction for face recognition.",
            "Contextual modulation via low-level vision processing.",
            "Introduction.",
            "Advances in matrix manifolds for computer vision.",
            "Spaces and manifolds of shapes in computer vision: An overview.",
            "On advances in differential-geometric approaches for 2D and 3D shape analyses and activity recognition.",
            "Conjugate gradient on Grassmann manifolds for robust subspace estimation.",
            "Fitting smoothing splines to time-indexed, noisy points on nonlinear manifolds.",
            "Boosted human re-identification using Riemannian manifolds.",
            "Natural metrics and least-committed priors for articulated tracking.",
            "Can the World-Wide Web Bridge the Semantic Gap?",
            "Toward a unified framework of motion understanding.",
            "Mathematical statistics and computer vision.",
            "Computer vision needs a core and foundations.",
            "Are we making real progress in computer vision today?",
            "The road to intelligence.",
            "Optimal solutions for semantic image decomposition.",
            "The role of computer vision in prosthetic vision.",
            "Boosted translation-tolerable classifiers for fast object detection.",
            "Compact and adaptive spatial pyramids for scene recognition.",
            "Local phase quantization for blur-insensitive image analysis.",
            "On stop conditions about methods to obtain polygonal approximations relied on break point suppression.",
            "Robust sparse bounding sphere for 3D face recognition.",
            "Tensor rank one differential graph preserving analysis for facial expression recognition.",
            "MIFT: A framework for feature descriptors to be mirror reflection invariant.",
            "Multi-view structure-from-motion for hybrid camera scenarios.",
            "Real-time object detection and localization with SIFT-based clustering.",
            "Face pose estimation with automatic 3D model creation in challenging scenarios.",
            "Most cited paper award.",
            "Photo-consistent synthesis of motion blur and depth-of-field effects with a real camera model.",
            "A pointwise smooth surface stereo reconstruction algorithm without correspondences.",
            "Filling the gap in quality assessment of video object tracking.",
            "A loop-consistency measure for dense correspondences in multi-view video.",
            "Multi-operator image retargeting with automatic integration of direct and indirect seam carving.",
            "Efficient 3D face recognition handling facial expression and hair occlusion.",
            "3D facial behaviour analysis and understanding.",
            "Static and dynamic 3D facial expression recognition: A comprehensive survey.",
            "3D human face description: landmarks measures and geometrical features.",
            "Hi4D-ADSIP 3-D dynamic facial articulation database.",
            "Exploring the effect of illumination on automatic expression recognition using the ICT-3DRFE database.",
            "3D/4D facial expression analysis: An advanced annotated face model approach.",
            "Reshaping 3D facial scans for facial appearance modeling and 3D facial expression analysis.",
            "Recognition of 3D facial expression dynamics.",
            "Regression-based intensity estimation of facial action units.",
            "3D shape estimation in video sequences provides high precision evaluation of facial expressions.",
            "Fast variational multi-view segmentation through backprojection of spatial constraints.",
            "Model-based recognition of human actions by trajectory matching in phase spaces.",
            "Discrimination and description of repetitive patterns for enhancing the performance of feature-based recognition.",
            "Robust detection of moving objects in video sequences through rough set theory framework.",
            "A novel framework for making dominant point detection methods non-parametric.",
            "Exploiting eye-hand coordination to detect grasping movements.",
            "Learning common behaviors from large sets of unlabeled temporal series.",
            "Subband effect of the wavelet fuzzy C-means features in texture classification.",
            "Recognition of occluded objects by reducing feature interactions.",
            "Low-rank matrix decomposition in L1-norm by dynamic systems.",
            "Viewpoint-aware object detection and continuous pose estimation.",
            "Spatial and spectral morphological template matching.",
            "Learning-based encoding with soft assignment for age estimation under unconstrained imaging conditions.",
            "Lucas-Kanade based entropy congealing for joint face alignment.",
            "Multiple human tracking in high-density crowds.",
            "On the dynamic time warping of cyclic sequences for shape retrieval.",
            "Scale selection for supervised image segmentation.",
            "Real-time robust background subtraction under rapidly changing illumination conditions.",
            "Ultra-fast tracking based on zero-shift points.",
            "Image segmentation with one shape prior - A template-based formulation.",
            "Encoding local image patterns using Riesz transforms: With applications to palmprint and finger-knuckle-print recognition.",
            "Face verification of age separated images under the influence of internal and external factors."
        ]
    },
    {
        "name": "IVC",
        "year": "2011",
        "info": "Volume 29: 2011",
        "count": 72,
        "papers": [
            "Visual attention guided bit allocation in video compression.",
            "Image segmentation from scale and rotation invariant texture features from the double dyadic dual-tree complex wavelet transform.",
            "A modified support vector machine and its application to image segmentation.",
            "Visible and infrared image registration using trajectories and composite foreground images.",
            "Real-time 3D pointing gesture recognition for mobile robots with cascade HMM and particle filter.",
            "A spatial variant approach for vergence control in complex scenes.",
            "Edge and line oriented contour detection: State of the art.",
            "Fast image motion segmentation for surveillance applications.",
            "A projected gradient algorithm based on the augmented Lagrangian strategy for image restoration and texture extraction.",
            "Defuzzification of spatial fuzzy sets by feature distance minimization.",
            "Edge detection in the feature space.",
            "An adaptive steganographic method based on the measurement of just noticeable distortion profile.",
            "Radial basis function based level set interpolation and evolution for deformable modelling.",
            "Choice of similarity measure, likelihood function and parameters for histogram based particle filter tracking in CCTV grey scale video.",
            "Video-object segmentation and 3D-trajectory estimation for monocular video sequences.",
            "Face tracking with automatic model construction.",
            "A novel kernel-based framework for facial-image hallucination.",
            "Goal-based trajectory analysis for unusual behaviour detection in intelligent surveillance.",
            "Boosting histograms of descriptor distances for scalable multiclass specific scene recognition.",
            "Algorithms for fast computation of Zernike moments and their numerical stability.",
            "Improving the performance of k-means for color quantization.",
            "3D block-based medial axis transform and chessboard distance transform based on dominance.",
            "A novel contour descriptor for 2D shape matching and its application to image retrieval.",
            "Visual tracking using the Earth Mover's Distance between Gaussian mixtures and Kalman filtering.",
            "PCA-based image recombination for multimodal 2D + 3D face recognition.",
            "Adaptive smoothness based robust active contours.",
            "Reverse caricatures effects on three-dimensional facial reconstructions.",
            "A graphical model based solution to the facial feature point tracking problem.",
            "Enhancement of historical printed document images by combining Total Variation regularization and Non-local Means filtering.",
            "Combinatorial Optimization of the piecewise constant Mumford-Shah functional with application to scalar/vector valued and volumetric image segmentation.",
            "Towards human motion capture from a camera mounted on a mobile robot.",
            "Learning-based super resolution using kernel partial least squares.",
            "A fuzzy filter for the removal of random impulse noise in image sequences.",
            "Real-time stereo on GPGPU using progressive multi-resolution adaptive windows.",
            "Most cited paper award.",
            "Video-based, real-time multi-view stereo.",
            "Automated fabric defect detection - A review.",
            "Scale invariant and deformation tolerant partial shape matching.",
            "Robust classification of face and head gestures in video.",
            "Evolutionary-computer-assisted design of image operators that detect interest points using genetic programming.",
            "Multiple piecewise constant with geodesic active contours (MPC-GAC) framework for interactive image segmentation using graph cut optimization.",
            "A survey on image-based continuum-body motion estimation.",
            "Keyframe-based recognition and localization during video-rate parallel tracking and mapping.",
            "Shape ultimate attribute opening.",
            "SEDMI: Saliency based edge detection in multispectral images.",
            "Adaptive height-modified histogram equalization and chroma correction in YCbCr color space for fast backlight image compensation.",
            "Toward coherent object detection and scene layout understanding.",
            "A 1D approach to correlation-based stereo matching.",
            "A hierarchical feature fusion framework for adaptive visual tracking.",
            "Facial expression recognition from near-infrared videos.",
            "Frequency domain regularization of d-dimensional structure tensor-based directional fields.",
            "Median-based image thresholding.",
            "Video-based descriptors for object recognition.",
            "Maximum likelihood autocalibration.",
            "Cost-effective solution to synchronised audio-visual data capture using multiple sensors.",
            "Using diagonals of orthogonal projection matrices for affine invariant contour matching.",
            "A mutual information based face clustering algorithm for movie content analysis.",
            "Useful features for human verification in near-infrared periocular images.",
            "Inexact graph matching based on kernels for object retrieval in image databases.",
            "Non-local adaptive structure tensors: Application to anisotropic diffusion and shock filtering.",
            "Distortion estimates for adaptive lifting transforms with noise.",
            "Improvements in image categorization using codebook ensembles.",
            "Similarity-based image organization and browsing using multi-resolution self-organizing map.",
            "Object tracking via appearance modeling and sparse representation.",
            "Comments on \"Generalised finite Radon transform for N × N images\".",
            "Tracking highly correlated targets through statistical multiplexing.",
            "Dirichlet Gaussian mixture model: Application to image segmentation.",
            "Edge preserved image fusion based on multiscale toggle contrast operator.",
            "Central catadioptric image processing with geodesic metric.",
            "Spatial color histogram based center voting method for subsequent object tracking and segmentation.",
            "FoSA: F* Seed-growing Approach for crack-line detection from pavement images.",
            "Measuring linearity of open planar curve segments."
        ]
    },
    {
        "name": "IVC",
        "year": "2010",
        "info": "Volume 28: 2010",
        "count": 156,
        "papers": [
            "Editorial.",
            "Review of pulse-coupled neural networks.",
            "Automatic 3D object segmentation in multiple views using volumetric graph-cuts.",
            "Level-set segmentation of brain tumors using a threshold-based speed function.",
            "Construction of a complete set of orthogonal Fourier-Mellin moment invariants for pattern recognition applications.",
            "Contrast enhancement of images using Partitioned Iterated Function Systems.",
            "Maximum likelihood estimation of vessel parameters from scale space analysis.",
            "Estimation of surface area and surface area measure of three-dimensional sets from digitizations.",
            "A new pyramid-based color image representation for visual localization.",
            "Video synchronization and its application to object transfer.",
            "A novel statistical generative model dedicated to face recognition.",
            "A Bayesian approach to joint tracking and identification of geometric shapes in video sequences.",
            "A new method for the registration of three-dimensional point-sets: The Gaussian Fields framework.",
            "Analysis of natural images processing for the extraction of agricultural elements.",
            "Classifying materials in the real world.",
            "An iterative multiresolution scheme for SFM with missing data: Single and multiple object scenes.",
            "Gabor texture representation method for face recognition using the Gamma and generalized Gaussian models.",
            "Some improvements for image filtering using peer group techniques.",
            "Iris recognition: Analysis of the error rates regarding the accuracy of the segmentation stage.",
            "Introduction to the Special Issue on the Segmentation of Visible Wavelength Iris Images Captured At-a-distance and On-the-move.",
            "Iris image segmentation and sub-optimal images.",
            "Efficient and robust segmentation of noisy iris images for non-cooperative iris recognition.",
            "Reliable algorithm for iris segmentation in eye image.",
            "A knowledge-based approach to the iris segmentation problem.",
            "Robust and accurate iris segmentation in very noisy iris images.",
            "A new iris segmentation method for non-ideal iris images.",
            "A highly accurate and computationally efficient approach for unconstrained iris segmentation.",
            "Noisy iris segmentation with boundary regularization and reflections removal.",
            "Robust iris segmentation on uncalibrated noisy images using mathematical morphology.",
            "Object-based video coding with dynamic quality control.",
            "Adaptive total variation denoising based on difference curvature.",
            "Fast and accurate geodesic distance transform by ordered propagation.",
            "Automatic cleaning and segmentation of web images based on colors to build learning databases.",
            "Eye synthesis using the eye curve model.",
            "Palmprint authentication using a symbolic representation of images.",
            "Coarse-to-fine stereo vision with accurate 3D boundaries.",
            "Self-calibration of spherical rectification for a PTZ-stereo system.",
            "Colour, texture, and motion in level set based segmentation and tracking.",
            "Human detection using a mobile platform and novel features derived from a visual saliency mechanism.",
            "On the accuracy of image normalization by Zernike moments.",
            "Accurate and speedy computation of image Legendre moments for computer vision applications.",
            "Adaptive pyramid mean shift for global real-time visual tracking.",
            "Recognizing faces using Adaptively Weighted Sub-Gabor Array from a single sample image per enrolled subject.",
            "SVD lossy adaptive encoding of 3D digital images for ROI progressive transmission.",
            "An efficient approach for the removal of impulse noise from the corrupted image using neural network based impulse detector.",
            "Graph cuts with many-pixel interactions: Theory and applications to shape modelling.",
            "Camera motion estimation by tracking contour deformation: Precision analysis.",
            "Micro-crack inspection in heterogeneously textured solar wafers using anisotropic diffusion.",
            "An MRF-based kernel method for nonlinear feature extraction.",
            "Novel fractal image encoding algorithm using normalized one-norm and kick-out condition.",
            "Automatic textile image annotation by predicting emotional concepts from visual features.",
            "Equidistant (ftheta) fish-eye perspective with application in distortion centre estimation.",
            "Edge detection insensitive to changes of illumination in the image.",
            "A high-accuracy method for fine registration of overlapping point clouds.",
            "Neuro semantic thresholding using OCR software for high precision OCR applications.",
            "3D reconstruction using silhouettes from unordered viewpoints.",
            "Segmentation of historical machine-printed documents using Adaptive Run Length Smoothing and skeleton segmentation paths.",
            "A portable stereo vision system for whole body surface imaging.",
            "Segmentation of the carotid intima-media region in B-mode ultrasound images.",
            "Rapid, man-made object morphological segmentation for aerial images using a multi-scaled, geometric image analysis.",
            "3D shape recovery from image focus using kernel regression in eigenspace.",
            "Automatic production of quantisation matrices based on perceptual modelling of wavelet coefficients for grey scale images.",
            "Silhouette representation and matching for 3D pose discrimination - A comparative study.",
            "Active contours with selective local or global segmentation: A new formulation and level set method.",
            "Gradient histogram: Thresholding in a region of interest for edge detection.",
            "Adaptive wavelet-Galerkin methods for limited angle tomography.",
            "Photometric stereo using LCD displays.",
            "Learning to classify by ongoing feature selection.",
            "Photo Hull regularized stereo.",
            "Best of Automatic Face and Gesture Recognition 2008.",
            "FRVT 2006: Quo Vadis face quality.",
            "Probabilistic learning for fully automatic face recognition across pose.",
            "Monocular head pose estimation using generalized adaptive view-based appearance model.",
            "Adjusted pixel features for robust facial component classification.",
            "Facial feature localization using weighted vector concentration approach.",
            "Non-rigid face tracking with enforced convexity and local appearance consistency constraint.",
            "Modelling human perception of static facial expressions.",
            "Multi-PIE.",
            "Variable silhouette energy image representations for recognizing human actions.",
            "Human action recognition using boosted EigenActions.",
            "Discriminative human action recognition in the learned hierarchical manifold space.",
            "Camera handoff with adaptive resource management for multi-camera multi-object tracking.",
            "Rejection of non-meaningful activities for HMM-based activity recognition system.",
            "Distinguishing variance embedding.",
            "Removing outliers by minimizing the sum of infeasibilities.",
            "Electric contacts inspection using machine vision.",
            "A new ranking method for principal components analysis and its application to face image analysis.",
            "Reaction-diffusion network for geometric multiscale high speed image processing.",
            "Learning natural scene categories by selective multi-scale feature extraction.",
            "Stereo vision for robotic applications in the presence of non-ideal lighting conditions.",
            "Detection and correction of purple fringing using color desaturation in the xy chromaticity diagram and the gradient information.",
            "Symmetric deformable image registration via optimization of information theoretic measures.",
            "A survey on vision-based human action recognition.",
            "Context-based embedded image compression using binary wavelet transform.",
            "Geometric characterization and clustering of graphs using heat kernel embeddings.",
            "Multiview segmentation and tracking of dynamic occluding layers.",
            "Generalized sparse MRF appearance models.",
            "Facial gender classification using shape-from-shading.",
            "Delving deeper into the whorl of flower segmentation.",
            "Online pattern recognition and machine learning techniques for computer-vision: Theory and applications.",
            "On-line evolving image classifiers and their application to surface inspection.",
            "The more you learn, the less you store: Memory-controlled incremental SVM for visual place recognition.",
            "Biometric classifier update using online learning: A case study in near infrared face verification.",
            "Online kernel density estimation for interactive learning.",
            "Learning a generic 3D face model from 2D image databases using incremental Structure-from-Motion.",
            "Online learning of task-driven object-based visual attention control.",
            "Online shape learning using binary search trees.",
            "A lattice computing approach for on-line fMRI analysis.",
            "Video-based face model fitting using Adaptive Active Appearance Model.",
            "Invariant image reconstruction from irregular samples and hexagonal grid splines.",
            "A low-dimensional local descriptor incorporating TPS warping for image matching.",
            "Color filter array design using random patterns with blue noise chromatic spectra.",
            "A multi-resolution area-based technique for automatic multi-modal image registration.",
            "The problems in digital watermarking into intra-frames of H.264/AVC.",
            "Segmentation of 4D cardiac MRI: Automated method based on spatio-temporal watershed cuts.",
            "Finding stable salient contours.",
            "Efficient multiple phase shift patterns for dense 3D acquisition in structured light scanning.",
            "Autonomous sub-image matching for two-dimensional electrophoresis gels using MaxRST algorithm.",
            "Drift-correcting template update strategy for precision feature point tracking.",
            "An adaptive data hiding scheme with high embedding capacity and visual image quality based on SMVQ prediction through classification codebooks.",
            "An improved no-search fractal image coding method based on a fitting plane.",
            "Perceptual color descriptor based on spatial distribution: A top-down approach.",
            "Root Mean Square filter for noisy images based on hyper graph model.",
            "Non-rigid metric reconstruction from perspective cameras.",
            "Shape from incomplete silhouettes based on the reprojection error.",
            "A branch-and-bound algorithm for globally optimal camera pose and focal length.",
            "Depth reconstruction uncertainty analysis and improvement - The dithering approach.",
            "From rendering to tracking point-based 3D models.",
            "Derivative-based imaging.",
            "A two-stage scheme for text detection in video images.",
            "ISMM 2007 Special Issue.",
            "Inverses and quotients of mappings between ordered sets.",
            "A general framework for tree-based morphology and its applications to self-dual filtering.",
            "Digital Steiner sets and Matheron semi-groups.",
            "Some links between extremum spanning forests, watersheds and min-cuts.",
            "Relationships between some watershed definitions and their tie-zone transforms.",
            "Adjacency stable connected operators and set levelings.",
            "Watershed from propagated markers: An interactive method to morphological object segmentation in image sequences.",
            "Optimal non-iterative pose estimation via convex relaxation.",
            "Pulse-coupled neural networks and one-class support vector machines for geometry invariant texture retrieval.",
            "Markerless human articulated tracking using hierarchical particle swarm optimisation.",
            "Combining monoSLAM with object recognition for scene augmentation using a wearable camera.",
            "Real time fractal image coder based on characteristic vector matching.",
            "Comments on \"Staircase effect alleviation by coupling gradient fidelity term\".",
            "Smoothing of optical flow using robustified diffusion kernels.",
            "Text detection in images using sparse representation with discriminative dictionaries.",
            "Image secret sharing method with two-decoding-options: Lossless recovery and previewing capability.",
            "A new wavelet-based fuzzy single and multi-channel image denoising.",
            "Linear discriminant projection embedding based on patches alignment.",
            "A fast vector quantization encoding algorithm based on projection pyramid with Hadamard transformation.",
            "Sub-pixel edge detection based on an improved moment.",
            "An EDBoost algorithm towards robust face recognition in JPEG compressed domain.",
            "Iris segmentation in non-ideal images using graph cuts.",
            "An agglomerative segmentation framework for non-convex regions within uterine cervix images.",
            "Harmony filter: A robust visual tracking system using the improved harmony search algorithm.",
            "A solution to illumination direction estimation of a shaded image: Genetic algorithm."
        ]
    },
    {
        "name": "IVC",
        "year": "2009",
        "info": "Volume 27: 2009",
        "count": 167,
        "papers": [
            "Second and Third Canadian Conferences on Computer and Robot Vision.",
            "Object detection using image reconstruction with PCA.",
            "PDE-based robust robotic navigation.",
            "Novel depth cues from light scattering.",
            "New sequential exact Euclidean distance transform algorithms based on convex analysis.",
            "Video analysis of hockey play in selected game situations.",
            "Watershed segmentation using prior shape and appearance knowledge.",
            "3D SSD tracking with estimated 3D planes.",
            "Subspace manifold learning with sample weights.",
            "A hierarchical non-parametric method for capturing non-rigid deformations.",
            "View matching with blob features.",
            "Automatic detection of abnormal gait.",
            "Self-calibration of a vision-based sensor network.",
            "Minimum Bayes error features for visual recognition.",
            "Graph cut based panoramic 3D modeling and ground truth comparison with a mobile platform - The Wägele.",
            "Automated detection of unusual events on stairs.",
            "Autonomous vision-based robotic exploration and mapping using hybrid maps and particle filters.",
            "Stereo retinex.",
            "Tracking and recognizing actions of multiple hockey players using the boosted particle filter.",
            "Semiautomatic segmentation with compact shape prior.",
            "Image and vision computing journal special issue on multimodal biometrics.",
            "Dynamic face recognition: From human to machine vision.",
            "Non-intrusive liveness detection by face images.",
            "Face recognition with disguise and single gallery images.",
            "Advances in fingerprint modeling.",
            "Handwriting verification - Comparison of a multi-algorithmic and a multi-semantic approach.",
            "Empirical evaluation of combining unobtrusiveness and security requirements in multimodal biometric systems.",
            "Feature based RDWT watermarking for multimodal biometric system.",
            "Biometrics and their use in e-passports.",
            "Aircraft recognition in infrared image using wavelet moment invariants.",
            "Efficient 3D characterization of raised topological defects in smooth specular coatings.",
            "Modelling of axonal fields in the optic nerve for direct MR detection studies.",
            "An extension of min/max flow framework.",
            "Discrete 2D and 3D euclidean medial axis in higher resolution.",
            "A soft MAP framework for blind super-resolution image reconstruction.",
            "Comparing active vision models.",
            "Image compression using plane fitting with inter-block prediction.",
            "Multi perspective panoramic imaging.",
            "Automated encoding of footwear patterns for fast indexing.",
            "Combining vector ordering and spatial information for color image interpolation.",
            "Multiple object tracking using a neural cost function.",
            "Fuzzy rough sets hybrid scheme for motion and scene complexity adaptive deinterlacing.",
            "People detection in low-resolution video with non-stationary background.",
            "Feasibility assessment of vision-based surface roughness parameters acquisition for different types of machined specimens.",
            "Normal mesh based geometrical image compression.",
            "Automatic soccer players tracking in goal scenes by camera motion elimination.",
            "Morphological segmentation on learned boundaries.",
            "A customized Gabor filter for unsupervised color image segmentation.",
            "Parts-based segmentation with overlapping part models using Markov chain Monte Carlo.",
            "Local detection of occlusion boundaries in video.",
            "Latent mixture vocabularies for object categorization and segmentation.",
            "Improving object detection with boosted histograms.",
            "Taking the bite out of automated naming of characters in TV video.",
            "Efficient illumination independent appearance-based face tracking.",
            "Optic flow from unstable sequences through local velocity constancy maximization.",
            "Edge landmarks in monocular SLAM.",
            "Fast image blending using watersheds and graph cuts.",
            "Automatic analysis of 2D foam sequences: Application to the characterization of aqueous proteins foams stability.",
            "Support vector regression based image denoising.",
            "Continuous dimensionality characterization of image structures.",
            "A new computational framework for 2D shape-enclosing contours.",
            "Automatic objects behaviour recognition from compressed video domain.",
            "A smart content-based image retrieval system based on color and texture feature.",
            "A parallel algorithm to skeletonize the distance transform of 3D objects.",
            "Using self-organising maps in the detection and recognition of road signs.",
            "Sharpness preserving image enlargement by using self-decomposed codebook and Mahalanobis distance.",
            "Block Wiener-based image registration for moving target indication.",
            "Capturing outlines of 2D objects with Bézier cubic approximation.",
            "Query by low-quality image.",
            "A clustering approach to free form surface reconstruction from multi-view range images.",
            "Shape retrieval with eigen-CSS search.",
            "Automatic noise estimation in images using local statistics. Additive and multiplicative cases.",
            "Statistics and category systems for the shape index descriptor of local 2nd order natural image structure.",
            "Non-uniformity correction for SLM microscopic images.",
            "3-D multimodal cardiac data superimposition using 2-D image registration and 3-D reconstruction from multiple views.",
            "Facial expression recognition based on Local Binary Patterns: A comprehensive study.",
            "A model for dynamic object segmentation with kernel density estimation based on gradient features.",
            "Simultaneous place and object recognition using collaborative context information.",
            "Preface.",
            "A tool for integer homology computation: lambda-AT-model.",
            "Directly computing the generators of image homology using graph pyramids.",
            "Figure-ground segmentation using factor graphs.",
            "Separation of the retinal vascular graph in arteries and veins based upon structural knowledge.",
            "Qualitative spatial relationships for image interpretation by using a conceptual graph.",
            "Approximative graph pyramid solution of the E-TSP.",
            "A robust Graph Transformation Matching for non-rigid registration.",
            "A game-theoretic approach to partial clique enumeration.",
            "Matching of anatomical tree structures for registration of medical images.",
            "Graph matching using the interference of discrete-time quantum walks.",
            "Approximate graph edit distance computation by means of bipartite graph matching.",
            "Region and constellations based categorization of images with unsupervised graph learning.",
            "Benchmarking graph-based clustering algorithms.",
            "Semi-automatic identification of print layers from a sequence of sample images: A case study from banknote print inspection.",
            "A new integer image coding technique based on orthogonal polynomials.",
            "Dynamic visual tracking control of a mobile robot with image noise and occlusion robustness.",
            "Geometrical PDEs based on second-order derivatives of gauge coordinates in image processing.",
            "Cryptanalysis of an image encryption scheme based on a compound chaotic sequence.",
            "Auto-correlation wavelet support vector machine.",
            "Epipolar geometry of catadioptric stereo systems with planar mirrors.",
            "Covariance estimation in full- and reduced-dimensionality image classification.",
            "Robust sequential view planning for object recognition using multiple cameras.",
            "Moving surface extraction based on unordered hexagonal perfect submaps projection: Applications to 3D feature tracking.",
            "Decomposition of two-dimensional shapes for efficient retrieval.",
            "Face recognition in JPEG and JPEG2000 compressed domain.",
            "The 3DID face alignment system for verifying identity.",
            "An edge-based color-aided method for license plate detection.",
            "The quantitative characterization of the distinctiveness and robustness of local image descriptors.",
            "A level set framework using a new incremental, robust Active Shape Model for object segmentation and tracking.",
            "A gradient-based combined method for the computation of fingerprints' orientation field.",
            "Generic and real-time structure from motion using local bundle adjustment.",
            "View-independent human motion classification using image-based reconstruction.",
            "Automatic articulated registration of hand radiographs.",
            "An evaluation metric for image segmentation of multiple objects.",
            "Local adaptive receptive field self-organizing map for image color segmentation.",
            "Pose independent object classification from small number of training samples based on kernel principal component analysis of local parts.",
            "A view-based statistical system for multi-view face detection and pose estimation.",
            "Computing and evaluating view-normalized body part trajectories.",
            "The mixtures of Student's t-distributions as a robust framework for rigid registration.",
            "Accurate text localization in images based on SVM output scores.",
            "Joint trajectory tracking and recognition based on bi-directional nonlinear learning.",
            "Real-time facial expression recognition using STAAM and layered GDA classifier.",
            "A spatially distributed model for foreground segmentation.",
            "Texture analysis for ulcer detection in capsule endoscopy images.",
            "A thresholding method based on two-dimensional fractional differentiation.",
            "Semi-random subspace method for face recognition.",
            "On the security defects of an image encryption scheme.",
            "A featureless and stochastic approach to on-board stereo vision system pose.",
            "On the morphological processing of hue.",
            "Multiscale fusion of wavelet-domain hidden Markov tree through graph cut.",
            "A geometric active contour model without re-initialization for color images.",
            "Computer vision methods for ambient intelligence.",
            "A new automated quality assessment algorithm for image fusion.",
            "Understanding dynamic scenes based on human sequence evaluation.",
            "Robust pedestrian detection and tracking in crowded scenes.",
            "Exploiting temporal statistics for events analysis and understanding.",
            "Localized matching using Earth Mover's Distance towards discovery of common patterns from small image samples.",
            "Multiple planes based registration using 3D Projective Space for Augmented Reality.",
            "Using noise inconsistencies for blind image forensics.",
            "Region-based Deformable Net for automatic color image segmentation.",
            "Histogram of oriented rectangles: A new pose descriptor for human action recognition.",
            "Detection and compression of moving objects based on new panoramic image modeling.",
            "3D Mesh decomposition using Reeb graphs.",
            "Automated tracking in digitized videofluoroscopy sequences for spine kinematic analysis.",
            "Localisation of the optic disc by means of GA-optimised Topological Active Nets.",
            "Fabric defect detection using morphological filters.",
            "Image stitching with dynamic elements.",
            "Shape and texture clustering: Best estimate for the clusters number.",
            "1-D chaincode pattern matching for compression of Bi-level printed farsi and arabic textual images.",
            "An outdoor time scenes simulation scheme based on support vector regression with radial basis function on DCT domain.",
            "Special issue on Perception, Action and Learning.",
            "A hierarchical attention-based neural network architecture, based on human brain guidance, for perception, conceptualisation, action and reasoning.",
            "Embodied spatial cognition: Biological and artificial systems.",
            "Exploratory learning structures in artificial cognitive systems.",
            "Efficient computation of channel-coded feature maps through piecewise polynomials.",
            "Anytime learning for the NoSLLiP tracker.",
            "A linear-complexity reparameterisation strategy for the hierarchical bootstrapping of capabilities within perception-action architectures.",
            "Problem solving through imitation.",
            "Simultaneously learning to recognize and control a low-cost robotic arm.",
            "Visual and multimodal analysis of human spontaneous behaviour: Introduction to the Special Issue.",
            "Social signal processing: Survey of an emerging domain.",
            "Being bored? Recognising natural interest by extensive audiovisual integration for real-life application.",
            "Automatic nonverbal analysis of social interaction in small groups: A review.",
            "The painful face - Pain expression recognition using active appearance models.",
            "Automatic coding of facial expressions displayed during posed and genuine pain.",
            "Efficient constrained local model fitting for non-rigid face alignment.",
            "Sparse B-spline polynomial descriptors for human activity recognition.",
            "Modelling and recognition of the linguistic components in American Sign Language."
        ]
    },
    {
        "name": "IVC",
        "year": "2008",
        "info": "Volume 26: 2008",
        "count": 145,
        "papers": [
            "Image and vision computing special issue on cognitive vision.",
            "The visual active memory perspective on integrated recognition systems.",
            "Learning semantic object parts for object categorization.",
            "Incremental and robust learning of subspace representations.",
            "Learning temporal structure for task based control.",
            "Conceptual representations between video signals and natural language descriptions.",
            "Enhanced tracking and recognition of moving objects by reasoning about spatio-temporal continuity.",
            "On scene interpretation with description logics.",
            "Ontology based complex object recognition.",
            "Attention links sensing to recognition.",
            "Cognitive vision: The case for embodied perception.",
            "A comparative study of deformable contour methods on medical image segmentation.",
            "Monomodal image registration using mutual information based methods.",
            "Simplified patterns for extracting the isosurfaces of solid objects.",
            "An anisotropic diffusion-based defect detection for low-contrast glass substrates.",
            "Rapid surface registration of 3D volumes using a neural network approach.",
            "Region saliency as a measure for colour segmentation stability.",
            "Image interpolation using interpolative classified vector quantization.",
            "Multi-modal tracking of people using laser scanners and video camera.",
            "Making a smarter color camera.",
            "Relative scale method to locate an object in cluttered environment.",
            "A new scheme for automated 3D PDM construction using deformable models.",
            "Parallelized segmentation of a serially sectioned whole human brain.",
            "Total variation minimizing blind deconvolution with shock filter reference.",
            "Triangulation for points on lines.",
            "15th Annual British Machine Vision Conference (BMVC 2004).",
            "Diffeomorphic statistical shape models.",
            "A minimum description length objective function for groupwise non-rigid image registration.",
            "Drums, curve descriptors and affine invariant region matching.",
            "Segmentation of color images via reversible jump MCMC sampling.",
            "Direct type-specific conic fitting and eigenvalue bias correction.",
            "Three-dimensional face recognition using combinations of surface feature map subspace components.",
            "Reconstructing relief surfaces.",
            "On the probabilistic epipolar geometry.",
            "A unified framework for scene illuminant estimation.",
            "Occlusion analysis: Learning and utilising depth maps in object tracking.",
            "Multi-modal tracking using texture changes.",
            "Biometric verification/identification based on hands natural layout.",
            "3D-spline reconstruction using shape from shading: Spline from shading.",
            "An EM/E-MRF algorithm for adaptive model based tracking in extremely poor visibility.",
            "Automatic generation of consensus ground truth for the comparison of edge detection techniques.",
            "Euclidean path modeling for video surveillance.",
            "3D Motion from structures of points, lines and planes.",
            "Computer vision techniques for forest fire perception.",
            "Subpixel edge location based on orthogonal Fourier-Mellin moments.",
            "Relaying scene information to the blind via sound using cartoon depth maps.",
            "Multiclass cell detection in bright field images of cell mixtures with ECOC probability estimation.",
            "Random-bit sequence generation from image data.",
            "Tiny surface defect inspection of electronic passive components using discrete cosine transform decomposition and cumulative sum techniques.",
            "Dual fractals.",
            "Lossless nibbled data embedding scheme based on difference expansion.",
            "Motion bias and structure distortion induced by intrinsic calibration errors.",
            "Unsupervised texture classification: Automatically discover and classify texture patterns.",
            "Fast VQ codebook search algorithm for grayscale image coding.",
            "A distance-based separator representation for pattern classification.",
            "Real-time camera tracking for marker-less and unprepared augmented reality environments.",
            "Analytic image unwarping by a systematic calibration method for omni-directional cameras with hyperbolic-shaped mirrors.",
            "Dominant point detection by reverse polygonization of digital curves.",
            "The strongest schema learning GA and its application to multilevel thresholding.",
            "Estimating the minimum redundancy in stereo image pair.",
            "A stratified self-calibration method for circular motion in spite of varying intrinsic parameters.",
            "A general recursive linear method and unique solution pattern design for the perspective-n-point problem.",
            "Intra-dimensional feature diagnosticity in the Fuzzy Feature Contrast Model.",
            "Robust point correspondence matching and similarity measuring for 3D models by relative angle-context distributions.",
            "Attention can improve a simple model for object recognition.",
            "A blind source separation-based method for multiple images encryption.",
            "Fast and scalable computations of 2D image moments.",
            "Embedded zerotree wavelets coding based on adaptive fuzzy clustering for image compression.",
            "2D Gaborface representation method for face recognition with ensemble and multichannel model.",
            "Persian/arabic handwritten word recognition using M-band packet wavelet transform.",
            "Image encryption with compound chaotic sequence cipher shifting dynamically.",
            "Camera calibration from human motion.",
            "Automatic face authentication with self compensation.",
            "A minimal solution for relative pose with unknown focal length.",
            "Color PCA eigenimages and their application to compression and watermarking.",
            "Full-sky autonomous star identification based on radial and cyclic features of star pattern.",
            "Efficient embedded wavelet codec based on list structure.",
            "WaterBalloons: A hybrid watershed Balloon Snake segmentation.",
            "Plane-based camera self-calibration by metric rectification of images.",
            "Local feature extraction for iris recognition with automatic scale selection.",
            "Viewpoint determination of image by interpolation over sparse samples.",
            "Independent component analysis-based defect detection in patterned liquid crystal display surfaces.",
            "Multifocus image fusion using region segmentation and spatial frequency.",
            "A feature-based robust digital image watermarking against geometric attacks.",
            "Numerical calculation of digital curve length by using anchored discrete convolution.",
            "Optimised coupling of hierarchies in image registration.",
            "Impact of vertex clustering on registration-based 3D dynamic mesh coding.",
            "Real-time hand posture recognition using range data.",
            "Denoising of multicomponent images using wavelet least-squares estimators.",
            "An analysis of facial expression recognition under partial facial image occlusion.",
            "Corrigendum to \"EM enhancement of 3D head pose estimated by point at infinity\" [Image Vis. Comput. 25(2007) 1864-1874].",
            "A morphological image processing method for locating myosin filaments in muscle electron micrographs.",
            "Topological triangle characterization with application to object detection from images.",
            "A novel Kohonen SOM-based image compression architecture suitable for moderate density FPGAs.",
            "Integrating region and edge information for texture segmentation using a modified constraint satisfaction neural network.",
            "Convergence analysis of active contours.",
            "A fast classification based method for fractal image encoding.",
            "Non-negative sparse coding shrinkage for image denoising using normal inverse Gaussian density model.",
            "An extended difference expansion algorithm for reversible watermarking.",
            "Fractal image compression using visual-based particle swarm optimization.",
            "Staircase effect alleviation by coupling gradient fidelity term.",
            "Image vector quantization codec indices recovery using Lagrange interpolation.",
            "Estimation of multiple directional illuminants from a single image.",
            "Automatic object and image alignment using Fourier Descriptors.",
            "Bayesian optimization of the scale saliency filter.",
            "Filtering noise on mammographic phantom images using local contrast modification functions.",
            "Affine invariant matching of broken boundaries based on particle swarm optimization.",
            "Non-linear fourth-order image interpolation for subpixel edge detection and localization.",
            "Robust face-voice based speaker identity verification using multilevel fusion.",
            "Palmprint recognition with improved two-dimensional locality preserving projections.",
            "Distinctive and compact features.",
            "Image magnification based on a blockwise adaptive Markov random field model.",
            "Multi-focus color image fusion in the HSI space using the sum-modified-laplacian and a coarse edge map.",
            "A system for processing handwritten bank checks automatically.",
            "Restoration of blue scratches in digital image sequences.",
            "Vehicle speed detection from a single motion blurred image.",
            "Digitization of non-regular shapes in arbitrary dimensions.",
            "A windowed Gaussian notch filter for quasi-periodic noise removal.",
            "Log-polar mapping template design: From task-level requirements to geometry parameters.",
            "Iterated dynamic programming and quadtree subregioning for fast stereo matching.",
            "Automatic detection of salient objects and spatial relations in videos for a video database system.",
            "Robust motion from space curves and 3D reconstruction from multiviews using perpendicular double stereo rigs.",
            "Mathematical model of blob matching and modified Bhattacharyya coefficient.",
            "Improving detection of surface discontinuities in visual-force control systems.",
            "Using structured light for efficient depth edge detection.",
            "A knowledge based approach for a fast image retrieval system.",
            "Shock filter coupled to curvature diffusion for image denoising and sharpening.",
            "Robust face recognition under partial occlusion based on support vector machine with local Gaussian summation kernel.",
            "Contour simplification using a multi-scale local phase analysis.",
            "A novel pixon-representation for image segmentation based on Markov random field.",
            "Occlusion invariant face recognition using selective local non-negative matrix factorization basis images.",
            "Improved spatially adaptive MDL denoising of images using normalized maximum likelihood density.",
            "Bilateral learning for color-based tracking.",
            "A ROI image retrieval method based on CVAAO.",
            "Touch-less palm print biometrics: Novel design and implementation.",
            "Conversions between three methods for representing 3D surface textures under arbitrary illumination directions.",
            "The mixture of K-Optimal-Spanning-Trees based probability approximation: Application to skin detection.",
            "Edge-and-corner preserving regularization for image interpolation and reconstruction.",
            "Hand gesture recognition and tracking based on distributed locally linear embedding.",
            "Extraction and temporal segmentation of multiple motion trajectories in human motion.",
            "A comparative study of model selection criteria for computer vision applications.",
            "Definition and recovery of kinematic features for recognition of American sign language movements.",
            "A Mumford-Shah model on lattice.",
            "An improvement of EMD embedding method for large payloads by pixel segmentation strategy.",
            "Supervised grayscale thresholding based on transition regions."
        ]
    },
    {
        "name": "IVC",
        "year": "2007",
        "info": "Volume 25: 2007",
        "count": 169,
        "papers": [
            "Contour salience descriptors for effective image retrieval and analysis.",
            "Stochastic exploration and active learning for image retrieval.",
            "Combining wavelets and watersheds for robust multiscale image segmentation.",
            "Morphological segmentation of yeast by image analysis.",
            "Methodology for the design of NN-based month-word recognizers written on Brazilian bank checks.",
            "Fully automatic coloring of grayscale images.",
            "Image restoration using digital inpainting and noise removal.",
            "Evaluating the mid-secretory endometrium appearance using hysteroscopic digital video summarization.",
            "Low-dose, large-angled cone-beam helical CT data reconstruction using algebraic reconstruction techniques.",
            "A parallel application for 3D reconstruction of coronal loops using image morphing.",
            "Filling holes on locally smooth surfaces reconstructed from point clouds.",
            "Multiview range image registration using the surface interpenetration measure.",
            "A novel approach to photometric motion.",
            "A genetic algorithm for optical flow estimation.",
            "Genetic Fourier descriptor for the detection of rotational symmetry.",
            "Microarray image gridding with stochastic search based approaches.",
            "A framework of fuzzy information fusion for the segmentation of brain tumor tissues on MR images.",
            "Fuzzy rough sets hybrid scheme for breast cancer detection.",
            "Combining neighbourhood-based and histogram similarity measures for the design of image quality measures.",
            "Evolutionary approach to inverse planning in coplanar radiotherapy.",
            "Vector quantization and fuzzy ranks for image reconstruction.",
            "An integrated fuzzy cells-classifier.",
            "Pyramid symmetry transforms: From local to global symmetry.",
            "Fuzzy technique based recognition of handwritten characters.",
            "Distributed recursive learning for shape recognition through multiscale trees.",
            "Nonrigid motion recovery for 3D surfaces.",
            "A sensitivity analysis method and its application in physics-based nonrigid motion modeling.",
            "Outlier rejection in high-dimensional deformable models.",
            "Integration of deformable contours and a multiple hypotheses Fisher color model for robust tracking in varying illuminant environments.",
            "Non-rigid structure from motion using ranklet-based tracking and non-linear optimization.",
            "Integrating temporal information with a non-rigid method of motion correction for functional magnetic resonance images.",
            "Human gait recognition at sagittal plane.",
            "Silhouette lookup for monocular 3D pose tracking.",
            "Simultaneous pose recovery and camera registration from multiple views of a walking person.",
            "Fast stochastic optimization for articulated structure tracking.",
            "Image distance functions for manifold learning.",
            "Kinematic sets for real-time robust articulated object tracking.",
            "ISMM05 special issue.",
            "Image filtering using morphological amoebas.",
            "Numerical residues.",
            "Efficient complete and incomplete path openings and closings.",
            "Attribute-space connectivity and connected filters.",
            "Adjacency lattices and shape-tree semilattices.",
            "On the dynamics.",
            "Theoretical foundations for spatially discrete 1-D shock filtering.",
            "Algorithms for the computation of the Minkowski functionals of deterministic and random polyconvex sets.",
            "Modelling and segmentation of colour images in polar representations.",
            "Morphology for matrix data: Ordering versus PDE-based approach.",
            "Watershed and multimodal data for brain vessel segmentation: Application to the superior sagittal sinus.",
            "Cloud covering denoising through image fusion.",
            "Locality preserving CCA with applications to data visualization and pose estimation.",
            "Transductive local exploration particle filter for object tracking.",
            "Gabor wavelets and General Discriminant Analysis for face identification and verification.",
            "Colour text segmentation in web images based on human perception.",
            "A review of recent range image registration methods with accuracy evaluation.",
            "Dynamic visual attention model in image sequences.",
            "Improved SFS 3D measurement based on BP neural network.",
            "High-precision stereo disparity estimation using HMMF models.",
            "Color image coding using regional correlation of primary colors.",
            "Combined edge detection using wavelet transform and signal registration.",
            "Multi-modal image registration using local frequency representation and computer-aided design (CAD) models.",
            "Text segmentation in color images using tensor voting.",
            "Motion estimation and compensation from noisy image sequences: A new filtering scheme.",
            "Kernel-based distance metric learning for content-based image retrieval.",
            "Hierarchical building recognition.",
            "Fast Zernike wavelet moments for Farsi character recognition.",
            "Segmentation and description of natural outdoor scenes.",
            "Face detection and facial feature localization without considering the appearance of image context.",
            "Random projection and orthonormality for lossy image compression.",
            "A variation on SVD based image compression.",
            "Which is the best way to organize/classify images by content?",
            "A Finite Markov Random Field approach to fast edge-preserving image recovery.",
            "A novel generalization of the gray-scale histogram and its application to the automated visual measurement and inspection of wooden Pallets.",
            "Outdoor recognition at a distance by fusing gait and face.",
            "Scene based non-uniformity correction in thermal images using Kalman filter.",
            "Tracking human motion using auxiliary particle filters and iterated likelihood weighting.",
            "A new adaptive vertex-based binary shape coding technique.",
            "Improved grating and bar cell models in cortical area V1 and texture coding.",
            "Lossy dictionary-based image compression method.",
            "Multiscale contour corner detection based on local natural scale and wavelet transform.",
            "Memory-efficient spatial prediction image compression scheme.",
            "Lie algebra approach for tracking and 3D motion estimation using monocular vision.",
            "Efficient predictive model of zero quantized DCT coefficients for fast video encoding.",
            "3D registration of partially overlapping surfaces using a volumetric approach.",
            "R-snakes.",
            "Pattern recognition with SVM and dual-tree complex wavelets.",
            "On the computational aspects of Zernike moments.",
            "A multivariate statistical analysis of the developing human brain in preterm infants.",
            "People detection and tracking using stereo vision and color.",
            "Multi-view correspondence by enforcement of rigidity constraints.",
            "Using resolution pyramids for watershed image segmentation.",
            "Erratum to \"Real-time FPGA implementation of Hough Transform using gradient and CORDIC algorithm\" [Image and Vision Computing 23 (2005) 1009-1017].",
            "Computer vision applications - Special issue.",
            "Surface detail in computer models.",
            "Object surface recovery using a multi-light photometric stereo technique for non-Lambertian surfaces subject to shadows and specularities.",
            "Adaptive surface inspection via interactive evolution.",
            "Examining the uncertainty of the recovered surface normal in three light photometric stereo.",
            "Texture analysis methods for tool condition monitoring.",
            "Supervised texture classification by integration of multiple texture methods and evaluation windows.",
            "Computer vision methods for optical microscopes.",
            "Estimation of electron probe profile from SEM image through wavelet multiresolution analysis for inline SEM inspection.",
            "Real time multispectral high temperature measurement: Application to control in the industry.",
            "Defining and computing stable representations of volume shapes from discrete trace using volume primitives: Application to 3D image analysis in soil science.",
            "View synthesis by the parallel use of GPU and CPU.",
            "Stand-alone embedded vision system based on fuzzy associative database.",
            "Rapid prototyping 3D objects from scanned measurement data.",
            "The model for optimal design of robot vision systems based on kinematic error correction.",
            "Pipe eccentricity measurement using laser triangulation.",
            "Robust tracking with motion estimation and local Kernel-based color modeling.",
            "Sequential Monte Carlo tracking by fusing multiple cues in video sequences.",
            "Understanding image structure from a new multi-scale representation of higher order derivative filters.",
            "An adaptive level-selecting wavelet transform for texture defect detection.",
            "Obtaining virtual lighting condition based on images using NNs.",
            "Product quality on-line inspecting for the pressed protuberant character on a metal tag.",
            "Knowledge-based adaptive thresholding segmentation of digital subtraction angiography images.",
            "A particle filter for joint detection and tracking of color objects.",
            "Contour detection based on contextual influences.",
            "Finger identification and hand posture recognition for human-robot interaction.",
            "Evaluation of a convex relaxation to a quadratic assignment matching approach for relational object views.",
            "A validated edge model technique for the empirical performance evaluation of discrete zero-crossing methods.",
            "Correspondence as energy-based segmentation.",
            "A visual landmark framework for mobile robot navigation.",
            "Iterative area filtering of multichannel images.",
            "Centre of mass model - A novel approach to background modelling for segmentation of moving objects.",
            "Histogram-based fuzzy colour filter for image restoration.",
            "Two steps for fingerprint segmentation.",
            "Portrait beautification: A fast and robust approach.",
            "A variational formulation for segmenting desired objects in color images.",
            "Vehicle detection from high-resolution satellite imagery using morphological shared-weight neural networks.",
            "Resolving hand over face occlusion.",
            "A two-step neural-network based algorithm for fast image super-resolution.",
            "Rotation-invariant and scale-invariant Gabor features for texture image retrieval.",
            "3D optical flow computation using a parallel variational multigrid scheme with application to cardiac C-arm CT motion.",
            "A new edge-adaptive demosaicing algorithm for color filter arrays.",
            "3D surface point and wireframe reconstruction from multiview photographic images.",
            "Editorial.",
            "Priority pixel queue algorithm for geodesic distance transforms.",
            "A shape interpolation technique based on inclusion relationships and median sets.",
            "Discrete bisector function and Euclidean skeleton in 2D and 3D.",
            "Rectification of the chordal axis transform skeleton and criteria for shape decomposition.",
            "Fast, accurate and convergent tangent estimation on digital contours.",
            "Analysis of the rubberband algorithm.",
            "Stability results for the reconstruction of binary pictures from two projections.",
            "A decomposition technique for reconstructing discrete sets from four projections.",
            "Generalised finite radon transform for N×N images.",
            "Digital hyperplane recognition in arbitrary fixed dimension within an algebraic computation model.",
            "Reversible vectorisation of 3D digital planar curves and applications.",
            "Local configurations in discrete combinatorial surfaces.",
            "On some applications of generalized functionality for arithmetic discrete planes.",
            "Local characterization of a maximum set of digital (26, 6)-surfaces.",
            "Models from image triplets using epipolar gradient features.",
            "Segmentation and region of interest based image retrieval in low depth of field observations.",
            "A prism-based single-lens stereovision system: From trinocular to multi-ocular.",
            "A fusion architecture based on TBM for camera motion classification.",
            "On the Bayes fusion of visual features.",
            "Comparison of directly measured to derived polarization imagery using an adaptive signature detection algorithm.",
            "New fast normalized neural networks for pattern detection.",
            "Automated visual inspection of ripple defects using wavelet characteristic based multivariate statistical approach.",
            "Deformation tolerant generalized Hough transform for sketch-based image retrieval in complex scenes.",
            "Multi-stage 3D reconstruction under circular motion.",
            "Automatic selection of MRF control parameters by reactive tabu search.",
            "The age of human computer interaction.",
            "Interaction framework for home environment using speech and vision.",
            "A body-mounted camera system for head-pose estimation and user-view image synthesis.",
            "Authentic facial expression analysis.",
            "EM enhancement of 3D head pose estimated by point at infinity.",
            "Visual recognition of pointing gestures for human-robot interaction.",
            "Estimating 3D hand pose using hierarchical multi-label classification.",
            "An augmented reality human-computer interface for object localization in a cognitive vision system."
        ]
    },
    {
        "name": "IVC",
        "year": "2006",
        "info": "Volume 24: 2006",
        "count": 119,
        "papers": [
            "Synthesis of image deformation strategies.",
            "Fast construction of dynamic and multi-resolution 360 degrees panoramas from video sequences.",
            "An improved procedure for the extraction of temporal motion strength signals from video recordings of neonatal seizures.",
            "Nonlinear structure tensors.",
            "A new approach to estimating fundamental matrix.",
            "Multisensor triplet Markov fields and theory of evidence.",
            "Efficient cumulative matching for image registration.",
            "Adaptive object detection and recognition based on a feedback strategy.",
            "Sliding window based approach for document image mosaicing.",
            "Adaptive fingerprint image enhancement with fingerprint image quality analysis.",
            "Enhanced images watermarking based on amplitude modulation.",
            "Applications of moving windows technique to autonomous vehicle navigation.",
            "A motion-based scene tree for compressed video content management.",
            "Video dejittering by bake and shake.",
            "Inverse perspective mapping and optic flow: A calibration method and a quantitative analysis.",
            "Multi-agent activity recognition using observation decomposedhidden Markov models.",
            "Robust face recognition from 2D and 3D images using structural Hausdorff distance.",
            "Collecting highly reproducible images to support dermatological medical diagnosis.",
            "Object recognition using point uncertainty regions as pose uncertainty regions.",
            "Nonlinear optimisation method for image segmentation and noise reduction using geometrical intrinsic properties.",
            "BALAS: Empirical Bayesian learning in the relevance feedback for image retrieval.",
            "Data-driven synthesis of composite-feature detectors for 3D image analysis.",
            "Face recognition using discriminant locality preserving projections.",
            "Discriminant common vectors versus neighbourhood components analysis and Laplacianfaces: A comparative study in small sample size problem.",
            "Quadtree-based representations of grid-oriented data.",
            "Region matching with missing parts.",
            "Fast mixing hyperdynamic sampling.",
            "Face recognition using optimal linear components of range images.",
            "Contour tracking based on marginalized likelihood ratios.",
            "Coplanar circles, quasi-affine invariance and calibration.",
            "Object detection using spatial histogram features.",
            "Zernike velocity moments for sequence-based description of moving features.",
            "A system for rotational velocity computation from image sequences.",
            "Background recovering in outdoor image sequences: An example of soccer players segmentation.",
            "A comparison between BEM and FEM for elastic registration of medical images.",
            "A new perceptual organization approach to 3D measuring system based on the fuzzy integral.",
            "Piecewise planar scene reconstruction from sparse correspondences.",
            "An affine-model-based technique for fast DPIV computation.",
            "Moving object segmentation by background subtraction and temporal analysis.",
            "Speeding up the similarity search in high-dimensional image database by multiscale filtering and dynamic programming.",
            "Fuzzy shape based motion evaluation of left ventricle using genetic algorithm.",
            "3D Pose estimation of symmetrical objects of unknown shape.",
            "Minimal-latency human action recognition using reliable-inference.",
            "Flexible background mixture models for foreground segmentation.",
            "Hand biometrics.",
            "Camera self-calibration from bivariate polynomial equations and the coplanarity constraint.",
            "A subspace method for projective reconstruction from multiple images with missing data.",
            "Feature-based image registration by means of the CHC evolutionary algorithm.",
            "On the relation between Memon's and the modified Zeng's palette reordering methods.",
            "Line cluster detection using a variant of the Hough transform for culture row localisation.",
            "Seeing faces in video by computers. Editorial for Special Issue on Face Processing in Video Sequences.",
            "The use of attention and spatial information for rapid facial recognition in video.",
            "Face detection and tracking in video sequences using the modifiedcensus transformation.",
            "Tracking a detected face with dynamic programming.",
            "Efficient particle filtering using RANSAC with application to 3D face tracking.",
            "Active appearance models with occlusion.",
            "Manifold based analysis of facial expression.",
            "Dynamics of facial expression extracted automatically from video.",
            "A weighted probabilistic approach to face recognition from multiple images and video sequences.",
            "An information-theoretic approach to face recognition from face motion manifolds.",
            "A new technique for generalized learning vector quantization algorithm.",
            "A novel weighted Hausdorff distance for face localization.",
            "Eye tracking: Pupil orientation geometrical modeling.",
            "Integrating region and boundary information for spatiallycoherent object tracking.",
            "Automatic Euclidean reconstruction for turn-table sequences by indirect epipolar search between pairs of views.",
            "Using range data in automatic modeling of buildings.",
            "Lighting design for machine vision application.",
            "Face recognition by fusing thermal infrared and visible imagery.",
            "Spherical mapping for processing of 3D closed surfaces.",
            "Automatic registration of overlapping 3D point clouds using closest points.",
            "Image inpainting with structural bootstrap priors.",
            "Recognition of human periodic movements from unstructured information using a motion-based frequency domain approach.",
            "Euclidean reconstruction of a circular truncated cone only from its uncalibrated contours.",
            "Supervised locality pursuit embedding for pattern classification.",
            "Neural classifier for micro work piece recognition.",
            "A partition approach for the restoration of camera images of planar and curled document.",
            "Facial pose from 3D data.",
            "3D shape-based face representation and feature extraction for face recognition.",
            "Automatic parameter regulation of perceptual systems.",
            "Measuring the performance of face localization systems.",
            "Hill-manipulation: An effective algorithm for color image segmentation.",
            "Local approach for face verification in polar frequency domain.",
            "Compression of pre-scan-converted echocardiographic video using wavelet packet and integer wavelet transforms.",
            "Image encryption using chaotic logistic map.",
            "Reconfigurable omnidirectional camera array calibration with a linear moving object.",
            "Automatic illumination correction for scene enhancement and object tracking.",
            "Numerical error analysis in Zernike moments computation.",
            "Multi-sector algorithm for hardware acceleration of the general Hough transform.",
            "Face authentication using speed fractal technique.",
            "Context-based object detection in still images.",
            "Characterizing the performance of automatic road detection using error propagation.",
            "Fitting 3D face models for tracking and active appearance model training.",
            "An automated pattern recognition system for the quantification of inflammatory cells in hepatitis-C-infected liver biopsies.",
            "Image super-resolution survey.",
            "Image segmentation by cue selection and integration.",
            "Hidden Markov models-based 3D MRI brain segmentation.",
            "A global unimodal thresholding based on probabilistic reference maps for the segmentation of muscle images.",
            "A new edge detection approach based on image context analysis.",
            "A Markov random field image segmentation model for color textured images.",
            "A new image shape analysis approach and its application to flower shape analysis.",
            "Robust multiple objects tracking using image segmentation and trajectory estimation scheme in video frames.",
            "Radiometric calibration of vision cameras and intensity uncertainty estimation.",
            "Extracting 3D information from broadcast soccer video.",
            "People tracking in surveillance applications.",
            "Model-free tracking of cars and people based on color regions.",
            "Self-organizing shape description for tracking and classifying multiple interacting objects.",
            "Motion detection and tracking using belief indicators for an automatic visual-surveillance system.",
            "Augmented tracking with incomplete observation and probabilistic reasoning.",
            "A comparison between feature-based and EM-based contour tracking.",
            "Appearance models for occlusion handling.",
            "Object tracking in an outdoor environment using fusion of features and cameras.",
            "Multi camera image tracking.",
            "Dominant colour extraction in DCT domain.",
            "Enhancing effective depth-of-field by image fusion using mathematical morphology.",
            "Evaluation of correspondence errors for stereo.",
            "Monocular obstacle detection using reciprocal-polar rectification.",
            "A robust method to recognize critical configuration for camera calibration.",
            "Novel target segmentation and tracking based on fuzzy membership distribution for vision-based target tracking system.",
            "Human tracking using 3D surface colour distributions."
        ]
    },
    {
        "name": "IVC",
        "year": "2005",
        "info": "Volume 23: 2005",
        "count": 108,
        "papers": [
            "Localization of acupoints on a head based on a 3D virtual body.",
            "A fast subpixel edge detection method using Sobel-Zernike moments operator.",
            "Recovery of the trajectories of multiple moving objects in an image sequence with a PMHT approach.",
            "Study and evaluation of different Fourier methods for image retrieval.",
            "Image enhancement based on the statistics of visual representation.",
            "Complete calibration of a structured light stripe vision sensor through planar target of unknown orientations.",
            "Color image segmentation based on adaptive local thresholds.",
            "Editorial.",
            "Fuzzy spatial relationships for image processing and interpretation: a review.",
            "Surface area estimation of digitized 3D objects using weighted local configurations.",
            "Measurements of digitized objects with fuzzy borders in 2D and 3D.",
            "Shortest routes on varying height surfaces using gray-level distance transforms.",
            "3-D chamfer distances and norms in anisotropic grids.",
            "Skeletonization of labeled gray-tone images.",
            "Exact medial axis with euclidean distance.",
            "Reconstruction of Lambertian surfaces by discrete equal height contours and regions propagation.",
            "Discrete analytical curve reconstruction without patches.",
            "Computing and analysing convex deficiencies to characterise 3D complex objects.",
            "Discrete topology on N-dimensional square tessellated grids.",
            "Optimal partial shape similarity.",
            "Towards a general sampling theory for shape preservation.",
            "Beyond self-duality in morphological image analysis.",
            "Removal and contraction operations to define combinatorial pyramids: application to the design of a spatial modeler.",
            "Real-time positioning for augmented reality on a custom parallel machine.",
            "On moment-based local operators for detecting image patterns.",
            "Robust Euclidean alignment of 3D point sets: the trimmed iterative closest point algorithm.",
            "Camera calibration and 3D reconstruction from a single view based on scene constraints.",
            "An anisotropic diffusion-based defect detection for sputtered surfaces with inhomogeneous textures.",
            "Comparing and combining depth and texture cues for face recognition.",
            "Adaptive color space switching for tracking under varying illumination.",
            "Robust motion estimation under varying illumination.",
            "Using skew Gabor filter in source signal separation and local spectral orientation analysis.",
            "Analysis of multiframe super-resolution reconstruction for image anti-aliasing and deblurring.",
            "Line-based object recognition using Hausdorff distance: from range images to molecular secondary structures.",
            "Unsupervised colour image segmentation applied to printing quality assessment.",
            "A comparative evaluation approach for the classification of rotifers with modified non-parametric kNN.",
            "A wavelet-based multiresolution edge detection and tracking.",
            "High-accuracy edge detection with Blurred Edge Model.",
            "Multiresolution face recognition.",
            "An efficient computation method for the texture browsing descriptor of MPEG-7.",
            "An adaptive hybrid energy-based fingerprint matching technique.",
            "An automated palmprint recognition system.",
            "Geometric calibration of digital cameras through multi-view rectification.",
            "Perspective rectification of document images using fuzzy set and morphological operations.",
            "Multi-scale feature identification using evolution strategies.",
            "Fast and robust text detection in images and video frames.",
            "Numerical experiments on the accuracy of rotation moments invariants.",
            "Bayesian inference for multiband image segmentation via model-based cluster trees.",
            "A genetic-based adaptive threshold selection method for dynamic path tree structured vector quantization.",
            "Fusion of multi-exposure images.",
            "Conditional solutions for the affine reconstruction of N-views.",
            "Component-based LDA face description for image retrieval and MPEG-7 standardisation.",
            "Projective rectification from the fundamental matrix.",
            "Effective pose estimation from point pairs.",
            "Robust watershed segmentation using wavelets.",
            "Fast MAP-based multiframe super-resolution image reconstruction.",
            "Fundamentals of Stop and Go active models.",
            "The projective reconstruction of points, lines, quadrics, plane conics and degenerate quadrics using uncalibrated cameras.",
            "Optimised De Bruijn patterns for one-shot shape acquisition.",
            "Encoding of multispectral and hyperspectral image data using wavelet transform and gain shape vector quantization.",
            "A smoothness constraint set based on local statistics of BDCT coefficients for image postprocessing.",
            "A fast search algorithm for mean-removed vector quantization using edge and texture strengths of a vector.",
            "Scene point constraints in camera auto-calibration: an implementational perspective.",
            "Artificial and biological color band design as spectral compression.",
            "Colorization of black-and-white cartoons.",
            "Multiprimitive segmentation based on meaningful breakpoints for fitting digital planar curves with line segments and conic arcs.",
            "A fast edge-oriented algorithm for image interpolation.",
            "Empirical mode decomposition synthesis of fractional processes in 1D- and 2D-space.",
            "Print-and-scan model and the watermarking countermeasure.",
            "Optimizing parameters of a motion detection system by means of a distributed genetic algorithm.",
            "Single view metrology from scene constraints.",
            "Dynamic photometric stereo - a new technique for moving surface analysis.",
            "Using genetic algorithm optimizing stack filters based on MMSE criterion.",
            "Unsupervised image categorization.",
            "Automatic seeded region growing for color image segmentation.",
            "Automatic machine vision calibration using statistical and neural network methods.",
            "Scene modelling from sparse 3D data.",
            "A robust approach for automatic detection and segmentation of cracks in underground pipeline images.",
            "Accelerating colour space conversion on reconfigurable hardware.",
            "Object recognition and pose estimation using color cooccurrence histograms and geometric modeling.",
            "Development and validation of a multi-step approach to improved detection of 3D point landmarks in tomographic images.",
            "A robust iterative hypothesis testing design of the repeated genetic algorithm.",
            "An unbiased implementation of regularization mechanisms.",
            "Extraction of visual features with eye tracking for saliency driven 2D/3D registration.",
            "Real-time FPGA implementation of Hough Transform using gradient and CORDIC algorithm.",
            "Face recognition from 2D and 3D images using 3D Gabor filters.",
            "Dynamic B-snake model for complex objects segmentation.",
            "Photo-realistic facial expression synthesis.",
            "Efficient representation of in-plane rotation within a PCA framework.",
            "Colour image segmentation using the self-organizing map and adaptive resonance theory.",
            "Generic vs. person specific active appearance models.",
            "An eigenvalue-based similarity measure and its application in defect detection.",
            "User-adaptive hand gesture recognition system with interactive training.",
            "DCT based simple classification scheme for fractal image compression.",
            "Skin detection using pairwise models.",
            "Hand tracking in bimanual movements.",
            "Boundary refinements for wavelet-domain multiscale texture segmentation.",
            "Optimal threshold selection algorithm in edge detection based on wavelet transform.",
            "A histogram-based approach for object-based query-by-shape-and-color in image and video databases.",
            "Real-time face detection and recognition using hybrid-information extracted from face space and facial features.",
            "Lane following and lane departure using a linear-parabolic model.",
            "Effective automatic recognition of cultured cells in bright field images using fisher's linear discriminant preprocessing.",
            "An image zooming technique based on vector quantization approximation.",
            "Dominant point detection: A new proposal.",
            "3D object segmentation using B-Surface.",
            "Adaptive robust estimation of affine parameters from block motion vectors.",
            "Representing cyclic human motion using functional analysis.",
            "Connectivity-based local adaptive thresholding for carotid artery segmentation using MRA images."
        ]
    },
    {
        "name": "IVC",
        "year": "2004",
        "info": "Volume 22: 2004",
        "count": 109,
        "papers": [
            "Non-parametric and unsupervised Bayesian classification with Bootstrap sampling.",
            "Improvements to the JPEG-LS prediction scheme.",
            "Image retrieval using resegmentation driven by query rectangles.",
            "ABI: analogy-based indexing for content image retrieval.",
            "An unified approach for a simultaneous and cooperative estimation of defocus blur and spatial shifts.",
            "A fast image-gathering system from the World-Wide Web using a PC cluster.",
            "A common framework for nonlinear diffusion, adaptive smoothing, bilateral filtering and mean shift.",
            "Special issue on statistical methods in video processing.",
            "A new constrained parameter estimator for computer vision applications.",
            "Image mosaicing by stratified matching.",
            "Velocity adaptation of spatio-temporal receptive fields for direct recognition of activities: an experimental study.",
            "Sudden illumination change detection using order consistency.",
            "Stereo person tracking with adaptive plan-view templates of height and occupancy statistics.",
            "Tracking multiple vehicles using foreground, background and motion models.",
            "Unscented Kalman filter for visual curve tracking.",
            "A statistical framework for picture reconstruction using 2D AR models.",
            "Model-based extraction of femoral medulla ducts from radiographic images.",
            "Robust approach for disparity estimation in stereo vision.",
            "Colorization algorithm using probabilistic relaxation.",
            "A hybrid quantization scheme for image compression.",
            "Patient information extraction in digitized X-ray imagery.",
            "A computational approach to determination of main subject regions in photographic images.",
            "Motion-based filtering of magneto-optic imagers.",
            "Language-based querying of image collections on the basis of an extensible ontology.",
            "Lane detection and tracking using B-Snake.",
            "Stereo image compression using wavelet coefficients morphology.",
            "Fast stitching algorithm for moving object detection and mosaic construction.",
            "Newspaper layout analysis incorporating connected component separation.",
            "Location of title and author regions in document images based on the Delaunay triangulation.",
            "Invariant texture retrieval using modified Zernike moments.",
            "Deformable model-guided region split and merge of image regions.",
            "Prediction of the suitability for image-matching based on self-similarity of vision contents.",
            "MPEG-7 based description schemes for multi-level video content classification.",
            "Constrained planar motion analysis by decomposition.",
            "Block image retrieval based on a compressed linear quadtree.",
            "Improving accuracy, robustness and computational efficiency in 3D computer vision.",
            "Support vector machine based multi-view face detection and recognition.",
            "Kinematics-based tracking of human walking in monocular video sequences.",
            "Enhancement and feature extraction for images of incised and ink texts.",
            "A systematic approach to nD orientation representation.",
            "Deformable spatio-temporal shape models: extending active shape models to 2D+time.",
            "Retrieving digital images from a JPEG compressed image database.",
            "Real-time image tracking for automatic traffic monitoring and enforcement applications.",
            "An efficient fingerprint verification system using integrated wavelet and Fourier-Mellin invariant transform.",
            "Omni-directional visual surveillance.",
            "Multi-view calibration from planar motion trajectories.",
            "An integrated surveillance system--human tracking and view synthesis using multiple omni-directional vision sensors.",
            "A real-time system for monitoring of cyclists and pedestrians.",
            "Robust tracking of persons in real-world scenarios using a statistical computer vision approach.",
            "Object watermarks for digital images and video.",
            "Recognition of human actions using motion history information extracted from the compressed video.",
            "Contour and boundary detection improved by surround suppression of texture edges.",
            "Automatic 3D model reconstruction based on novel pose estimation and integration techniques.",
            "Motion estimation based on the direction of intensity gradient.",
            "Photometric subspace for multibody motion segmentation.",
            "Assessing the performance of corner detectors for point feature tracking applications.",
            "Depth from gradient fields and control points: bias correction in photometric stereo.",
            "Using similarity measures and homogeneity for the comparison of images.",
            "Free-form object segmentation and representation from registered range and color images.",
            "3D surface modeling from curves.",
            "Image segmentation using finite mixtures and spatial information.",
            "Proceedings of the 13th British Machine Vision Conference.",
            "Reconstruction of segmentally articulated structure in freeform movement with low density feature points.",
            "Robust wide-baseline stereo from maximally stable extremal regions.",
            "Tightly integrated sensor fusion for robust visual tracking.",
            "Minimal projective reconstruction for combinations of points and lines in three views.",
            "Towards a complete dense geometric and photometric reconstruction under varying pose and illumination.",
            "Dense stereo using pivoted dynamic programming.",
            "On the distortion of shape recovery from motion.",
            "Practical generation of video textures using the auto-regressive process.",
            "Reconstruction of surfaces of revolution from single uncalibrated views.",
            "Randomized RANSAC with Td, d test.",
            "A procedure for automatically estimating model parameters in optical motion capture.",
            "Separating shape and pose variations.",
            "Fiducial point localization in color images of face foregrounds.",
            "Film grain reduction on colour images using undecimated wavelet transform.",
            "Registration of digital retinal images using landmark correspondence by expectation maximization.",
            "Neural-edge-based vehicle detection and traffic parameter extraction.",
            "A hand-based personal authentication using a coarse-to-fine strategy.",
            "Auto-calibration by linear iteration using the DAC equation.",
            "Erratum to \"Guaranteeing the probability of success using rungs of genetic algorithm\" [Image and Vision Computing 19 (2001) 551-560] .",
            "Latest research in computer vision - a special issue on VI 2002.",
            "Nouse 'use your nose as a mouse' perceptual vision technology for hands-free games and interfaces.",
            "A stereo confidence metric using single view imagery with comparison to five alternative approaches.",
            "From spatiotemporal curves to reconstructed depth.",
            "Improved method of handwritten digit recognition tested on MNIST database.",
            "A fast area-based stereo matching algorithm.",
            "Object recognition with adaptive Gabor features.",
            "Computational method for document object locator combination.",
            "Detection and tracking of eyes for gaze-camera control.",
            "Three-dimensional structure calculation: achieving accuracy without calibration.",
            "Towards Bayesian real-time optical flow.",
            "N-feature neural network human face recognition.",
            "Real-time tracking for visual interface applications in cluttered and occluding situations.",
            "Statistical significance of features in digital images.",
            "Compression of map images for real-time applications.",
            "Arbitrary affine transformation and their composition effects for two-dimensional fractal sets.",
            "Neural-networks-based edges selector for boundary extraction problems.",
            "3D reconstruction of real objects with high resolution shape and texture.",
            "Guest editorial.",
            "On using priors in affine matching.",
            "Advancing fan-front: 3D triangle mesh compression using fan based traversal.",
            "Unifying statistical texture classification frameworks.",
            "Super-resolution imaging: use of zoom as a cue.",
            "An uncalibrated lightfield acquisition system.",
            "Irregular, unknown light sources in dynamic global illumination.",
            "Content based image retrieval using motif cooccurrence matrix.",
            "An intelligent character recognizer for Telugu scripts using multiresolution analysis and associative memory.",
            "Discrete contours in multiple views: approximation and recognition."
        ]
    },
    {
        "name": "IVC",
        "year": "2003",
        "info": "Volume 21: 2003",
        "count": 95,
        "papers": [
            "Generative model based vision.",
            "Object models in multiscale intrinsic coordinates via m-reps.",
            "Continuous medial representations for geometric object modeling in 2D and 3D.",
            "Algorithms from statistical physics for generative models of images.",
            "A statistical approach to multi-scale edge detection.",
            "Modeling of 2D+1 texture movies for video coding.",
            "Multi-band modelling of appearance.",
            "Face alignment using texture-constrained active shape models.",
            "Statistical shape knowledge in variational motion segmentation.",
            "An observation-constrained generative approach for probabilistic classification of image regions.",
            "An adaptive color-based particle filter.",
            "Visual contour tracking based on particle filters.",
            "Learning and understanding dynamic scene activity: a review.",
            "Mirror symmetry => 2-view stereo geometry.",
            "Dealing with 2D translation estimation in log-polar imagery.",
            "Model-based control of image acquisition.",
            "A survey on industrial vision systems, applications, tools.",
            "Cellular neural networks and active contours: a tool for image segmentation.",
            "Overall view regarding fundamental matrix estimation.",
            "Detecting ellipses of limited eccentricity in images with high noise levels.",
            "3D nonrigid motion analysis under small deformations.",
            "Traffic sign recognition and analysis for intelligent vehicles.",
            "Uncalibrated three-view image rectification.",
            "A range scanner with a virtual laser.",
            "On a relaxation-labeling algorithm for real-time contour-based image similarity retrieval.",
            "A fast and reliable system for 3D surface acquisition and reconstruction.",
            "Automated surface inspection for statistical textures.",
            "Generalized ellipsoids and anisotropic filtering for segmentation improvement in 3D medical imaging.",
            "Efficient half-quadratic regularization with granularity control.",
            "A survey of video processing techniques for traffic applications.",
            "A fast incremental approach for accurate measurement of the displacement field.",
            "On the automatic assemblage of arbitrary broken solid artefacts.",
            "Automatic band selection for wavelet reconstruction in the application of defect detection.",
            "Synthesis of texture from clinical images.",
            "Three dimensional orientation signatures with conic kernel filtering for multiple motion analysis.",
            "A novel line scan clustering algorithm for identifying connected components in digital images.",
            "Segmentation of multi-spectral images using the combined classifier approach.",
            "Color and grey level object retrieval using a 3D representation of force histogram.",
            "Algorithms for the recognition of 2D images of m points and n lines in 3D.",
            "Shadow elimination for effective moving object detection by Gaussian shadow modeling.",
            "Dominant point detection using adaptive bending value.",
            "Methods for gamma invariant colour image processing.",
            "High compression and low order linear predictor for lossless coding of grayscale images.",
            "NURBS snakes.",
            "Guest editorial: Special issue on computer vision beyond the visible spectrum.",
            "Face Detection in the Near-IR Spectrum.",
            "Tracking human faces in infrared video.",
            "Genetic algorithm based feature selection for target detection in SAR images.",
            "Automatic target segmentation using PMMW imagery.",
            "Target tracking in airborne forward looking infrared imagery.",
            "Fully automatic registration of multiple 3D data sets.",
            "Statistical hypothesis pruning for identifying faces from infrared images.",
            "Domain learning using Choquet integral-based morphological shared weight neural networks.",
            "Ball detection in static images with Support Vector Machines for classification.",
            "Car detection in low resolution aerial images.",
            "Clustering of compressed illumination-invariant chromaticity signatures for efficient video summarization.",
            "Mean quantization based image watermarking.",
            "A method for human action recognition.",
            "Hand gesture recognition using a real-time tracking method and hidden Markov models.",
            "Image classification using color, texture and regions.",
            "Recovery of shape and surface reflectance of specular object from relative rotation of light source.",
            "Extraction of digital elevation models from satellite stereo images through stereo matching based on epipolarity and scene geometry.",
            "Asymmetric binary tree coding for contour images.",
            "Content-based image retrieval using moment-preserving edge detection.",
            "Corner detection and matching for visual tracking during power line inspection.",
            "Bayesian analysis for fusion of data from disparate imaging systems for surveillance.",
            "Bayesian and non-Bayesian probabilistic models for medical image analysis.",
            "Dynamic trees for image modelling.",
            "A Hidden Markov Model object recognition technique for incomplete and distorted corner sequences.",
            "Tracking in cluttered images.",
            "A real time adaptive visual surveillance system for tracking low-resolution colour targets in dynamically changing scenes.",
            "Efficient particle filtering for multiple target tracking with application to tracking in structured images.",
            "An improved method of photometric stereo using local shape from shading.",
            "Multiresolution genetic clustering algorithm for texture segmentation.",
            "A GA based approach for boundary detection of left ventricle with echocardiographic image sequences.",
            "Image registration methods: a survey.",
            "An expressive three-mode principal components model of human action style.",
            "Erratum to \"Identification of different scripts lines from multi-script documents\" [Image and Vision Computing 20 (2002) 945-954].",
            "Image analysis by bidimensional empirical mode decomposition.",
            "A method of optimum transformation of 3D objects used as a measure of shape dissimilarity.",
            "Combined Fisherfaces framework.",
            "Geometric - photometric approach to monocular shape estimation.",
            "Correcting image distortion in the X-ray digital tomosynthesis system for PCB solder joint inspection.",
            "Recognising trajectories of facial identities using kernel discriminant analysis.",
            "Evaluation of salient point techniques.",
            "Temporal video segmentation and classification of edit effects.",
            "An adaptive potential for robust shape estimation.",
            "Towards a low bandwidth talking face using appearance models.",
            "Reactive memories: an interactive talking-head.",
            "Object signatures invariant to affine distortions derived from the Trace transform.",
            "Robust registration of 2D and 3D point sets.",
            "Application of the active shape model in a commercial medical device for bone densitometry.",
            "Face verification via error correcting output codes.",
            "Building optimal 2D statistical shape models.",
            "Learning pixel-wise signal energy for understanding semantics."
        ]
    },
    {
        "name": "IVC",
        "year": "2002",
        "info": "Volume 20: 2002",
        "count": 90,
        "papers": [
            "Performance analysis of a simple vehicle detection algorithm.",
            "Study of Dempster-Shafer theory for image segmentation applications.",
            "Efficient skew estimation and correction algorithm for document images.",
            "Image compression using transformed vector quantization.",
            "Estimating uncertainty in SSD-based feature tracking.",
            "Design and evaluation of spatial similarity approaches for image retrieval.",
            "AI-EigenSnake: an affine-invariant deformable contour model for object matching.",
            "A saliency-based hierarchy for local symmetries.",
            "Practical algorithms for stratified structure-from-motion.",
            "Tracing boundary contours in a binary image.",
            "Analysis of infected blood cell images using morphological operators.",
            "Robust topology-adaptive snakes for image segmentation.",
            "Design and prototype development of a computer vision-based lumber production planning system.",
            "Model-based 3D hand posture estimation from a single 2D image.",
            "Multi-modal gray-level histogram modeling and decomposition.",
            "Automated analysis of a sequence of ovarian ultrasound images. Part I: segmentation of single 2D images.",
            "Automated analysis of a sequence of ovarian ultrasound images. Part II: prediction-based object recognition from a sequence of images.",
            "Measuring similarity between pixel signatures.",
            "How to measure the pose robustness of object views.",
            "Orientation analysis for rotated human face detection.",
            "A cascaded genetic algorithm for efficient optimization and pattern matching.",
            "Segmentation of color images using a two-stage self-organizing network.",
            "Visual search: psychophysical models, practical applications.",
            "Corresponding dynamic appearances.",
            "Applications of computer-aided rasterstereography in spinal deformity detection.",
            "British Machine Vision Conference 1999.",
            "Force field energy functionals for image feature extraction.",
            "Automatic extraction of the face identity-subspace.",
            "Measuring similarity between pixel signatures.",
            "How to measure the pose robustness of object views.",
            "Recognition of human gestures and behaviour based on motion trajectories.",
            "Composite support vector machines for detection of faces across views and pose estimation.",
            "Support vector machines for face authentication.",
            "Iterative Procrustes alignment with the EM algorithm.",
            "The dynamics of linear combinations: tracking 3D skeletons of human subjects.",
            "Critical motion sequences for the self-calibration of cameras and stereo systems with variable focal length.",
            "Real-time tracking of complex structures with on-line camera calibration.",
            "Automatically building appearance models from image sequences using salient features.",
            "Structure and motion estimation from apparent contours under circular motion.",
            "Testing a measure of image quality for acquisition control.",
            "Cluster validation using legacy delineations.",
            "An indexing scheme for efficient data-driven verification of 3D pose hypotheses.",
            "Image segmentation by relaxation using constraint satisfaction neural network.",
            "3D Face pose estimation and tracking from a monocular camera.",
            "Quadtree representations for storage and manipulation of clusters of images.",
            "Using distance transforms to decompose 3D discrete objects.",
            "Automatic image segmentation system through iterative edge - region co-operation.",
            "Finding connected components in digital images by aggressive reuse of labels.",
            "Vision system for defect imaging, detection, and characterization on a specular surface of a 3D object.",
            "Detecting lameness using 'Re-sampling Condensation' and 'multi-stream cyclic hidden Markov models'.",
            "British Machine Vision Conference 2000.",
            "A non-linear model of shape and motion for tracking finger spelt American sign language.",
            "Non-parametric image subtraction using grey level scattergrams.",
            "A neural approach to zoom-lens camera calibration from data with outliers.",
            "Performing automatic target detection with evolvable finite state automata.",
            "Interactive visual dialog.",
            "A new approach to vanishing point detection in architectural environments.",
            "View-based active appearance models.",
            "Gabor wavelet networks for efficient head pose estimation.",
            "Compensating for ensemble-specific effects when building facial models.",
            "Robust point correspondence by concave minimization.",
            "Tracking people in three dimensions using a hierarchical model of dynamics.",
            "Transforming pixel signatures into an improved metric space.",
            "Integrated segmentation and depth ordering of motion layers in image sequences.",
            "An expectation-maximisation framework for segmentation and grouping.",
            "Detecting multiple texture planes using local spectral distortion.",
            "Image mosaicing using sequential bundle adjustment.",
            "A color coding method for radiographic images.",
            "Using relaxation technique for region-based object recognition.",
            "Classifying human endothelial cells based on individual granulometric size distributions.",
            "Optimal projection of 2-D displacements for 3-D translational motion estimation.",
            "A locally adaptive zooming algorithm for digital images.",
            "Skew angle estimation for printed and handwritten documents using the Wigner-Ville distribution.",
            "Understanding visual behaviour.",
            "Hand tracking for behaviour understanding.",
            "A relaxation algorithm for real-time multiple view 3D-tracking.",
            "Active vision techniques for visually mediated interaction.",
            "On the semantics of visual behaviour, structured events and trajectories of human action.",
            "Representation and synthesis of behaviour using Gaussian mixtures.",
            "Path detection in video surveillance.",
            "Towards the automatic analysis of complex human body motions.",
            "Theoretical and experimental study on large size image processing applications using divisible load paradigm on distributed bus networks.",
            "Classification of hand postures against complex backgrounds using elastic graph matching.",
            "Identification of different script lines from multi-script documents.",
            "Autonomous agents for edge detection and continuity perception on otolith images.",
            "Perceptual primitives from an extended 4D Hough transform.",
            "Fast optical flow using 3D shortest path techniques.",
            "Real-time gesture recognition system and application.",
            "Adding and subtracting eigenspaces with eigenvalue decomposition and singular value decomposition.",
            "Erratum to \"A cascaded genetic algorithm for efficient optimization and pattern matching\" [Image and Vision Computing 20(4) (2002) 265-277]."
        ]
    },
    {
        "name": "IVC",
        "year": "2001",
        "info": "Volume 19: 2001",
        "count": 91,
        "papers": [
            "Biomedical Image Registration.",
            "The role of image registration in brain mapping.",
            "Reconstructing a 3D structure from serial histological sections.",
            "A hierarchical approach to elastic registration based on mutual information.",
            "Mutual information matching in multiresolution contexts.",
            "3D multimodality medical image registration using morphological tools.",
            "Measuring biological shape using geometry-based shape transformations.",
            "Fully automatic 3D feature-based registration of multi-modality medical images.",
            "Radial basis functions with compact support for elastic registration of medical images.",
            "Encoding 3D structural information using multiple self-organizing feature maps.",
            "Road sign detection and recognition using matching pursuit method.",
            "Evaluating optical-flow algorithms on a parallel machine.",
            "An adaptative method to smooth discrete curves proposed as a final step for edge detection.",
            "A low cost design of rate controlled JPEG-LS near lossless image compression.",
            "Three-dimensional reconstruction of irregular shapes based on a fitted mesh of contours.",
            "Cellular neural networks and computational intelligence in medical image processing.",
            "Volume-quantization-based neural network approach to 3D MR angiography image segmentation.",
            "An approach to use linguistic and model-based fuzzy expert knowledge for the analysis of MRT images.",
            "Fuzzy expert system for foot CT image segmentation.",
            "Knowledge-based enhancement of megavoltage images in radiation therapy using a hybrid neuro-fuzzy system.",
            "A Bayesian similarity measure for deformable image matching.",
            "Moving object segmentation in video sequences by user interaction and automatic object tracking.",
            "Defect detection in X-ray images using fuzzy reasoning.",
            "Multi-scale free-form 3D object recognition using 3D models.",
            "An energy of asymmetry for accurate detection of global reflection axes.",
            "Optimal Gabor filter design for texture segmentation using stochastic optimization.",
            "Interactive 3D model extraction from a single image.",
            "Chinese text distinction and font identification by recognizing most frequently used characters.",
            "Probabilistic estimation of optical flow in multiple band-pass directional channels.",
            "Unsupervised image segmentation combining region and boundary estimation.",
            "A discontinuity adaptive Markov model for color image smoothing.",
            "A probabilistic model for appearance-based robot localization.",
            "The VPLF method for vanishing point computation.",
            "4D reconstruction of the left ventricle during a single heart beat from ultrasound imaging.",
            "A simple recursive method for converting a chain code into a quadtree with a lookup table.",
            "A self stabilizing robust region finder applied to color and optical flow pictures.",
            "Vector processing of wavelet coefficients for robust image denoising.",
            "An adaptive irregular sampling algorithm and its application to image coding.",
            "A snake for CT image segmentation integrating region and edge information.",
            "Entropy-threshold method for best basis selection.",
            "Images similarity estimation by processing compressed data.",
            "Reconstruction of degraded image sequences. Application to film restoration.",
            "Realistic image synthesis of plant structures for genetic analysis.",
            "Physics-based colour image segmentation for scenes containing vegetation and soil.",
            "Optimal and suboptimal shape tracking based on multiple switched dynamic models.",
            "Guaranteeing the probability of success using repeated runs of genetic algorithm.",
            "Fisher keys for content based retrieval.",
            "Skew detection and block classification of printed documents.",
            "Artificial Neural Networks for Image Analysis and Computer Vision.",
            "Neural networks for the recognition and pose estimation of 3D objects from a single 2D perspective view.",
            "Real-time object recognition on image sequences with the adaptable time delay neural network algorithm - applications for autonomous vehicles.",
            "View-based object representations using RBF networks.",
            "Support vector machines for face recognition.",
            "Texture segmentation by frequency-sensitive elliptical competitive learning.",
            "Image compression using principal component neural networks.",
            "Medical image segmentation using a contextual-constraint-based Hopfield neural cube.",
            "Bone tumor segmentation from MR perfusion images with neural networks using multi-scale pharmacokinetic features.",
            "Approximating the CIECAM97s color appearance model by means of neural networks.",
            "Design of effective neural network ensembles for image classification purposes.",
            "Mobile Agent Perception.",
            "Navigation in birds and other animals.",
            "Learning environmental features for pose estimation.",
            "Continuity properties of the appearance manifold for mobile robot position estimation.",
            "View-based route-learning with self-organizing neural networks.",
            "Real-time recognition of self-similar landmarks.",
            "Reflective surfaces as computational sensors.",
            "Entropy-based gaze planning.",
            "Crater detection for autonomous landing on asteroids.",
            "SAVI: an actively controlled teleconferencing system.",
            "Face distributions in similarity space under varying head pose.",
            "Volume image registration by template matching.",
            "Monitoring human behavior from video taken in an office environment.",
            "Document filters using morphological and geometrical features of characters.",
            "Detection ellipses by finding lines of symmetry in the images via an hough transform applied to straight lines.",
            "Automatic pose determination of 3D shapes based on modeling wave sets: a new data structure for object modeling.",
            "Gaze determination via images of irises.",
            "Color image segmentation using histogram multithresholding and fusion.",
            "Non-rigid cardiac motion quantification from 2D image sequences based on wavelet synthesis.",
            "A 2D-3D model-based approach to real-time visual tracking.",
            "Generalized interpolation and its application in super-resolution imaging.",
            "Local mapping for multispectral image visualization.",
            "Color-based image retrieval using spatial-chromatic histograms.",
            "On indexing the periodicity of image textures.",
            "Scene classification of SAR images acquired from antiparallel tracks using evidential and rule-based fusion.",
            "A new system for trademark segmentation and retrieval.",
            "A review of deformable surfaces: topology, geometry and deformation.",
            "A new approach to outdoor scene description based on learning and top-down segmentation.",
            "Detection of arbitrary planar shapes with 3D pose.",
            "Edge detection in a hexagonal-image processing framework.",
            "Fast two-layer image watermarking without referring to the original image and watermark.",
            "Simple and efficient method of calibrating a motorized zoom lens."
        ]
    },
    {
        "name": "IVC",
        "year": "1999",
        "info": "Volume 18: 1999/2000",
        "count": 94,
        "papers": [
            "Coherent computation of the multispectral maximal directional derivative.",
            "3D shape and 2D surface textures of human faces: the role of \"averages\" in attractiveness and age.",
            "A stereo visual pattern image coding system.",
            "Cephalogram analysis applying template matching and fuzzy logic.",
            "Automated surface inspection for directional textures.",
            "Detecting human faces in color images.",
            "Conceptualizing Images.",
            "Constructing qualitative event models automatically from video input.",
            "Conceptual descriptions from monitoring and watching image sequences.",
            "Incremental recognition of traffic situations from video image sequences.",
            "Bayesian reasoning on qualitative descriptions from images and speech.",
            "Conceptual description of visual scenes from linguistic models.",
            "Object recognition using random image-lines.",
            "Enhancing CSS-based shape retrieval for objects with shallow concavities.",
            "Multithresholding of color and gray-level images through a neural network technique.",
            "A compact improved quadtree representation with image manipulations.",
            "The role of perceptual contrast non-linearities in image transform quantization.",
            "Matching techniques to compute image motion.",
            "Smoothing images creates corners.",
            "Special issue on facial image analysis.",
            "Face recognition by statistical analysis of feature detectors.",
            "Recognition of JPEG compressed face images based on statistical methods.",
            "Wavelet packet analysis for face recognition.",
            "Active vision-based face authentication.",
            "Automatic 3D face authentication.",
            "Saccadic search with Gabor features applied to eye detection and real-time head tracking.",
            "Pupil detection and tracking using multiple light sources.",
            "3D stereo reconstruction of human faces driven by differential constraints.",
            "Smooth surface interpolation and texture adaptation for MPEG-4 compliant calibration of 3D head models.",
            "Fast head modeling for animation.",
            "Applications of computer vision to intelligent.",
            "An image processing system for driver assistance.",
            "Road recognition in urban environment.",
            "Multisensor obstacle detection and tracking.",
            "CLARK: a heterogeneous sensor fusion method for finding lanes and obstacles.",
            "Heading direction of a mobile robot from the optical flow.",
            "Lane following combining vision and DGPS.",
            "Quantitative comparison between trajectory estimates obtained from a binocular camera setup within a moving road vehicle and from the outside by a stationary monocular camera.",
            "Rejection of mismatched correspondences along the affine epipolar line.",
            "PGSD: an accurate 3D vision system using a projected grid for surface descriptions.",
            "N-Candidate methods for location invariant dithering of color images.",
            "Edge sharpening through ramp width reduction.",
            "A review on strategies for recognizing natural objects in colour images of outdoor scenes.",
            "Corner detection in color images through a multiscale combination of end-stopped cortical cells.",
            "An efficient method for texture defect detection: sub-band domain co-occurrence matrices.",
            "Uncalibrated Euclidean reconstruction: a review.",
            "Local iterative improvement of fractal image codes.",
            "An edge-preserving subband coding model based on non-adaptive and adaptive regularization.",
            "Detecting changes in aerial views of man-made structures.",
            "Primitive spatial relations based on SKIZ.",
            "On the gray-scale inverse Hough transform.",
            "Estimating the 3D orientation of texture planes using local spectral analysis.",
            "Duplicate document detection by template matching.",
            "British Machine Vision Conference 1998.",
            "Planar grouping for automatic detection of vanishing lines and points.",
            "Matching color uncalibrated images using differential invariants.",
            "Matching disparate views of planar surfaces using projective invariants.",
            "Uncertainty analysis of 3D reconstruction from uncalibrated views.",
            "Learning spatio-temporal patterns for predicting object behaviour.",
            "Recovering more classes than available bands for sets of mixed pixels in satellite images.",
            "Appearance-based active object recognition.",
            "Non-linear statistical models for the 3D reconstruction of human pose and motion from monocular image sequences.",
            "A method of automated landmark generation for automated 3D PDM construction.",
            "View synthesis by trinocular edge matching and transfer.",
            "Efficient super-resolution via image warping.",
            "A system to place observers on a polyhedral terrain in polynomial time.",
            "VISATRAM: a real-time vision system for automatic traffic monitoring.",
            "Real time tracking of borescope tip pose.",
            "Detection of obstacles on runways using ego-motion compensation and tracking of significant features.",
            "High-level feature based range image segmentation.",
            "Color and texture fusion: application to aerial image segmentation and GIS updating.",
            "Passive navigation using egomotion estimates.",
            "Analysis of moire patterns in non-uniformly sampled halftones.",
            "Bayesian recognition of targets by parts in second generation forward looking infrared images.",
            "Gesture recognition using the multi-PDM method and hidden Markov model.",
            "Expert system for automatic analysis of facial expressions.",
            "Pseudo-invariant image transformations on a hexagonal lattice.",
            "Efficient partitioning and scheduling of computer vision and image processing data on bus networks using divisible load analysis.",
            "Spatio-temporal optimization method for determining motion vector fields under non-stationary illumination.",
            "Industrial inspection using Gaussian functions in a colour space.",
            "A new focus measure method using moments.",
            "Texture classification based on Markov modeling in wavelet feature space.",
            "Pattern regularity as a visual key.",
            "Unsupervised and adaptive Gaussian skin-color model.",
            "A computational approach to color adaptation effects.",
            "Sub-pixel location of edges with non-uniform blurring: a finite closed-form approach.",
            "Morphological image analysis applied to crop field mapping.",
            "Designing scalable and efficient parallel clustering algorithms on arrays with reconfigurable optical buses.",
            "Analysis and evaluation of hard and fuzzy clustering segmentation techniques in burned patient images.",
            "Use of the angle information in the wavelet transform maxima for image de-noising.",
            "The model-based human body motion analysis system.",
            "A strategy for repetitive neighbor finding in octree representations.",
            "Iterative computation of 3D plane parameters.",
            "Spectral recognition using a modified Eckhorn neural network model."
        ]
    },
    {
        "name": "IVC",
        "year": "1999",
        "info": "Volume 17: 1999",
        "count": 89,
        "papers": [
            "Development of a graph-based approach for building detection.",
            "Circle recognition through a 2D Hough Transform and radius histogramming.",
            "Convexity analysis of active contour problems.",
            "Efficient hybrid search for visual reconstruction problems.",
            "Regular-texture image retrieval based on texture-primitive extraction.",
            "Segmentation of skin cancer images.",
            "A split and merge procedure for polygonal border detection of dot pattern.",
            "Toward optimal structured light patterns.",
            "3-D Modeling from Range Imagery: An Incremental Method with a Planning Component.",
            "Fast global registration of 3D sampled surfaces using a multi-z-buffer technique.",
            "Automatic reconstruction of 3D objects using a mobile camera.",
            "Registration and integration of textured 3D data.",
            "Three-dimensional modeling of the human hand with motion constraints.",
            "Nefertiti: a query by content system for three-dimensional model and image databases management.",
            "Identifying the neuroretinal rim boundary using dynamic contours.",
            "Selectionist relaxation: genetic algorithms applied to image segmentation.",
            "Computation of instantaneous optical flow using the phase of Fourier components.",
            "Coherence-enhancing diffusion of colour images.",
            "A statistical active contour model for SAR image segmentation.",
            "Tracking colour objects using adaptive mixture models.",
            "Segmentation of monochrome and color textures using moving average modeling approach.",
            "Shape indexing by multi-scale representation.",
            "Probabilistic structure from camera location using straight segments.",
            "A time delay neural network algorithm for estimating image-pattern shape and motion.",
            "Image coding from wavelet transform maxima and projection onto convex sets.",
            "Character recognition using statistical moments.",
            "Detection of motion fields under spatio-temporal non-uniform illumination.",
            "Gradient space analysis of surface defects using a photometric stereo derived bump map.",
            "Special issue on visual form.",
            "Scale space vector fields for symmetry detection.",
            "Eliciting visual primitives for detection of elongated shapes.",
            "Shape analysis with the 'Boundary Integral-Resonant Mode Expansion' method.",
            "Shapes, shocks and wiggles.",
            "Affine invariant deformation curves a tool for shape characterization.",
            "Optimal matching between shapes via elastic deformations.",
            "A relational learning method for pattern and object recognition.",
            "Intrinsic line features and contour metric for locating 3-D objects in sparse, segmented range images.",
            "Active shape focusing.",
            "Shape representation and recognition based on invariant unary and binary relations.",
            "View-based object recognition using saliency maps.",
            "Color image retrieval using hybrid graph representation.",
            "Content-based image retrieval by viewpoint-invariant color indexing.",
            "Affine-invariant image retrieval by correspondence matching of shapes.",
            "Organizing image databases as visual-content search trees.",
            "A critical evaluation of image and video indexing techniques in the compressed domain.",
            "Content-based retrieval from digital video.",
            "Needle map recovery using robust regularizers.",
            "Volume estimation from sparse planar images using deformable models.",
            "A mixture model for representing shape variation.",
            "Fast face localisation and verification.",
            "Adaptive segmentation of ultrasound images.",
            "Document mosaicing.",
            "Selection for gamut mapping colour constancy.",
            "Finding the epipole from uncalibrated optical flow.",
            "Using expectation-maximisation to learn dynamical models from visual data.",
            "Uncalibrated reconstruction of curved surfaces.",
            "A plane measuring device.",
            "A method of 3D surface correspondence and interpolation for merging shape examples.",
            "A new approach to conic section approximation of object boundaries.",
            "Probabilistic models for images and quadtrees: differences and equivalences.",
            "Knowledge-based control of vision systems.",
            "Qualitative representation of scenes along route.",
            "Combining statistical and structural approaches for handwritten character description.",
            "Representation of segmented images with discrete geometric maps.",
            "A comparative study of efficient generalised Hough transform techniques.",
            "Automatic acquisition of hierarchical mathematical morphology procedures by genetic algorithms.",
            "A corner orientation detector.",
            "Linear prediction image coding using iterated function systems.",
            "Unsupervised edge-preserving image restoration via a saddle point approximation.",
            "Size invariant circle detection.",
            "A new approach to high precision 3-D measuring system.",
            "Analysing and reducing the cost of exhaustive correspondence search.",
            "Documents through cameras.",
            "3D object recognition from static 2D views using multiple coarse data channels.",
            "Species-identification of wasps using principal component associative memories.",
            "Voting method for planarity and motion detection.",
            "Genetic algorithm-based interactive segmentation of 3D medical images.",
            "Some image operations on S-tree-related spatial data structures.",
            "A deformable block-matching algorithm for tracking epithelial cells.",
            "Edge enhancement of remote sensing image data in the DCT domain.",
            "Optimal parallel clustering algorithms on a reconfigurable array of processors with wider bus networks.",
            "Pose determination from angles and relative line lengths using spherical trigonometry.",
            "An active contour model for colour region extraction in natural scenes.",
            "IME: an image management environment with content-based access.",
            "An iterative factorization method for projective structure and motion from image sequences.",
            "Model-based force-driven nonrigid motion recovery from sequences of range images without point correspondences.",
            "The analysis of surface texture using photometric stereo acquisition and gradient space domain mapping.",
            "Global image feature correspondence under a multi-image network.",
            "Very low bit rate face video compression using linear combination of 2D face views and principal components analysis."
        ]
    },
    {
        "name": "IVC",
        "year": "1998",
        "info": "Volume 16: 1998",
        "count": 79,
        "papers": [
            "Computing three dimensional project invariants from a pair of images using the Grassmann-Cayley algebra.",
            "Relation between 3D invariants and 2D invariants.",
            "Planar homologies as a basis for grouping and recognition.",
            "Using geometric properties for automatic object positioning.",
            "On the correspondence problem for wide angular separation of non-coplanar points.",
            "Derivative computation by multiscale filters.",
            "On modelling, extraction, detection and classification of deformable contours from noisy images.",
            "Automatic target recognition for naval traffic control using neural networks.",
            "Fast corner detection.",
            "Proper scale for modeling visual data.",
            "Accurate 3D measurement using a structured light system.",
            "Estimating pose uncertainty for surface registration.",
            "Model-based articulated hand motion tracking for gesture recognition.",
            "An affine-invariant active contour model (AI-snake) for model-based segmentation.",
            "A content-based image retrieval system.",
            "Segmentation of MR images with intensity inhomogeneities.",
            "Contour matching: a curvature-based approach.",
            "Recognition of handprinted Chinese characters by constrained graph matching.",
            "Statistical models of face images - improving specificity.",
            "A method for encoding region boundaries based on transition points.",
            "A low-cost system using sparse vision for navigation in the urban environment.",
            "The deictically controlled wheelchair.",
            "A stereo vision-based aid for the visually impaired.",
            "Color and three-dimensional vision-based assistive telemanipulation.",
            "PLAYBOT A visually-guided robot for physically disabled children.",
            "The FERET database and evaluation procedure for face-recognition algorithms.",
            "Character extraction from documents using wavelet maxima.",
            "Euclidean skeletons.",
            "Hierarchical shape fitting using an iterated linear filter.",
            "Object recognition in compressed imagery.",
            "An efficient iterative pose estimation algorithm.",
            "Simulation of worn-out cloth textures by doubly stochastic L-systems.",
            "A multi-stage approach to the dense estimation of disparity from stereo SEM images.",
            "Computational and psychophysical studies of early vision.",
            "Edge-finding in human vision: a multi-stage model based on the perceived structure of plaids.",
            "Simulation of neural contour mechanisms: representing anomalous contours.",
            "A neural architecture of brightness perception: non-linear contrast detection and geometry-driven diffusion.",
            "Recent progress in modeling neural mechanisms of form and color vision.",
            "Towards a method for parametrizing models of early vision using psychophysical data.",
            "Psychophysical analyses of contour processing in humans: the case for qualitative tests.",
            "Tracking of complex driving manoeuvres in traffic image sequences.",
            "Multi-agent visual surveillance of dynamic scenes.",
            "A CAD-based computer vision system.",
            "A statistically-based Newton method for pose refinement.",
            "Iso-surface extraction in nD applied to tracking feature curves across scale.",
            "Query by dialog: an interactive approach to pictorial querying.",
            "Reading order of Chinese newspaper articles using a block-growing method.",
            "Stereo inverse perspective mapping: theory and applications.",
            "Complete description of multiple line segments using the Hough transform.",
            "Genetically fine-tuning the Hough transform feature space, for the detection of circular objects.",
            "Improving the generalized Hough transform through imperfect grouping.",
            "Surface matching for object recognition in complex three-dimensional scenes.",
            "Computation of a cross-section structure: a projection-based approach.",
            "Direct parametric object detection in tomographic images.",
            "Projection for pattern recognition.",
            "The Fourier slice theorem for range data reconstruction.",
            "The forward and inverse models in time-resolved optical tomography imaging and their finite-element method solutions.",
            "Projective and illumination invariant representation of disjoint shapes.",
            "Reasoning about functionality in object recognition.",
            "Recognition and localization of generic objects for indoor navigation using functionality.",
            "Function from visual analysis and physical interaction: a methodology for recognition of generic classes of objects.",
            "Functional features for chopping extracted from observations and interactions.",
            "Understanding object motion.",
            "The function of documents.",
            "Machine-printed character recognition revisited: re-application of recent advances in handwritten character recognition research.",
            "An object-oriented descriptive language to facilitate advanced handwritten form processing.",
            "Adaptive page segmentation for color technical journals' cover images.",
            "Text identification for document image analysis using a neural network.",
            "Copyright protection of digital images by embedded unperceivable marks.",
            "The detection of duplicates in document image databases.",
            "Content based navigation in an open hypermedia environment.",
            "Content-based trademark retrieval system using a visually salient feature.",
            "On-line legal aid: Markov chain model for efficient retrieval of legal documents.",
            "Automated real-time visual inspection system for high-resolution superimposed printings.",
            "A scale selection principle for estimating image deformations.",
            "Recognition of handwritten Chinese characters by elastic matching.",
            "Towards robust metric reconstruction via a dynamic uncalibrated stereo head.",
            "Edge image quality assessment: a new formulation for degraded edge imaging.",
            "FIRST: Fractal Indexing and Retrieval SysTem for Image Databases."
        ]
    },
    {
        "name": "IVC",
        "year": "1997",
        "info": "Volume 15: 1997",
        "count": 75,
        "papers": [
            "From discs to parts of visual form.",
            "Determining optical flow using a differential method.",
            "New automatic multi-level thresholding technique for segmentation of thermal images.",
            "An efficient algorithm for the largest empty figure problem based on a 2D cellular automaton architecture.",
            "2D image segmentation using minimum spanning trees.",
            "Parameter estimation techniques: a tutorial with application to conic fitting.",
            "Polarization vision: a new sensory approach to image understanding.",
            "Visual surface segmentation from stereo.",
            "Using light polarization in laser scanning.",
            "Indexing pictorial documents by their content: a survey of current techniques.",
            "3-D shape approximation using parametric geons.",
            "Color image segmentation using Hopfield networks.",
            "Segmentation and recognition of Arabic characters by structural classification.",
            "Recursive resolving algorithm for multiple stereo and motion matches.",
            "Texture synthesis by L-systems.",
            "Understanding the Hough transform: Hough cell support and its utilisation.",
            "On 3D differential operators for detecting point landmarks.",
            "Triplet geometric representation: a novel scale, translation and rotation invariant feature representation based on geometric constraints for recognition of 2D object features.",
            "A simple parametric equation for pseudocoloring grey scale images keeping their original brightness progression.",
            "Interpreting line drawings of curved objects with tangential edges and surfaces.",
            "Panel report: the potential of geons for generic 3-D object recognition.",
            "Self-calibration from four views with possibly varying intrinsic parameters.",
            "Robust statistical models for cell image interpretation.",
            "Measuring body points on automobile drivers using multiple cameras.",
            "Scale space semi-local invariants.",
            "Tracking and recognising hand gestures, using statistical shape models.",
            "2D feature detection via local energy.",
            "Scale-imprecision space.",
            "Blind restoration of images degraded by space-variant blurs using iterative algorithms for both blur identification and image restoration.",
            "Shape-adapted smoothing in estimation of 3-D shape cues from affine deformations of local 2-D brightness structure.",
            "2D into 3D Hough-space mapping for planar object pose estimation.",
            "Range data acquisition using color structured lighting and stereo vision.",
            "Non-linear point distribution modelling using a multi-layer perceptron.",
            "Building perspective models to guide a row crop navigation vehicle.",
            "Hot curves for modelling and recognition of smooth curved 3D objects.",
            "Scene interpretation by fusion of segment and region information.",
            "A new wavelet-based edge detector via constrained optimization.",
            "Comparison of smooth polynomial functional surfaces for use in alignment.",
            "Subjective image fidelity metric based on bit allocation of the human visual system in the DCT domain.",
            "Colour-based detection of defects on chicken meat.",
            "Part segmentation from 2D edge images by the MDL criterion.",
            "Automatic measurement of vertebral shape using active shape models.",
            "Self-calibration of a moving zoom-lens camera by pre-calibration.",
            "Robust parameterization and computation of the trifocal tensor.",
            "Neural networks in human motion tracking - An experimental study.",
            "Linear projective reconstruction from matching tensors.",
            "Affine integral invariants for extracting symmetry axes.",
            "Registering incomplete radar images using the EM algorithm.",
            "Model-based vehicle detection and classification using orthographic approximations.",
            "Class-based recognition of 3D objects represented by volumetric primitives.",
            "Determination of face position and pose with a learned representation based on labelled graphs.",
            "Optimal mapping of graph homomorphism onto self organising Hopfield network.",
            "An approximate string matching algorithm for on-line Chinese character recognition.",
            "A variational method for the recovery of smooth boundaries.",
            "Feature-based human face detection.",
            "Estimation of pose and illuminant direction for face processing.",
            "Simplifications of multilinear forms for sequences of images.",
            "Faster fractal image compression using quadtree recomposition.",
            "Fusion of color and edge information for improved segmentation and edge linking.",
            "Textured image segmentation: returning multiple solutions.",
            "Iterative shape recovery from multiple images.",
            "Noise robustness of texture features.",
            "A genetic algorithm for aligning object shapes.",
            "Compressed quadtree representations for storing similar images.",
            "Optimal 3 x 3 decomposable disks for morphological transformations.",
            "Object recognition by deterministic annealing.",
            "A new method for image separation of overlapped images from a two-layered printed circuit board (PCB).",
            "Fast encoding algorithms for tree-structured vector quantization.",
            "An improved generalized Hough transform for the recognition of overlapping objects.",
            "Accurate matching of two-dimensional shapes using the minimal tolerance zone error.",
            "Resolution consideration in spatially variant sensors.",
            "A new edge detector integrating scale-spectrum information.",
            "Efficient registration of NURBS geometry.",
            "An MLP-based texture segmentation method without selecting a feature set.",
            "Surface texture analysis based upon the visually acquired perturbation of surface normals."
        ]
    },
    {
        "name": "IVC",
        "year": "1996",
        "info": "Volume 14: 1996",
        "count": 63,
        "papers": [
            "Future directions in industrial machine vision: a case study of semiconductor manufacturing applications.",
            "Efficient evaluations of edge connectivity and width uniformity.",
            "Constant time algorithm for computing the Hough transform on a reconfigurable mesh.",
            "Recognition and reconstruction of primitives in music scores.",
            "Skeletonization algorithm running on path-based distance maps.",
            "Edge linking by a directional potential function (DPF).",
            "Segmentation of planar curves into circular arcs and line segments.",
            "Handwritten Chinese characters recognition by greedy matching with geometric constraint.",
            "Fast visual tracking by temporal consensus.",
            "Automated urban area building extraction from high resolution stereo imagery.",
            "Learning-based method to recognize and localize glassware using laser range images.",
            "Structure adaptive anisotropic image filtering.",
            "Spatial contours for vision and CAD model matching.",
            "On the creation of quadtrees by using a branching process.",
            "Human-robot interface by pointing with uncalibrated stereo vision.",
            "New algorithm for calculating an invariant of 3D point sets from a single view.",
            "Metric-topological approach to shape representation and recognition.",
            "Robust method for road sign detection and recognition.",
            "Automated system for coarse-to-fine pyramidal area correlation stereo matching.",
            "Curvature sensitive filter and its application in microfossil image characterisation.",
            "Parallel entropic auto-thresholding.",
            "Closing the loop: detection and pursuit of a moving object by a moving observer.",
            "Connectionist median filtering networks.",
            "Bayesian image classification using Markov random fields.",
            "Alternative strategies for irregular pyramid construction.",
            "Direct surface parameter estimation using structured light: a predictor-corrector based approach.",
            "Generic object recognition using multiple representations.",
            "Camera model for reciprocal-wedge transform.",
            "Structure from motion techniques applied to crop field mapping.",
            "Image compression using non-stationary and inhomogeneous multiresolution analyses.",
            "Statistical estimation for exterior orientation from line-to-line correspondences.",
            "Multichannel image restorations using an iterative algorithm in space domain.",
            "Fractal image coding system based on an adaptive side-coupling quadtree structure.",
            "Hierarchical contour matching in medical images.",
            "Object-oriented data model for scanning probe microscopy image processing.",
            "Qualitative primitive identification using fuzzy clustering and invariant approach.",
            "Realistic range rendering for object hypothesis verification.",
            "Invariant object recognition using a neural template classifier.",
            "Authentication of random patterns by finding a match in an image database.",
            "Estimation of depth and 3D motion parameter of moving object with multiple stereo images.",
            "Generating spatiotemporal models from examples.",
            "Statistical grey-level models for object location and identification.",
            "Tracking and measuring drivers' eyes.",
            "Statistical mosaics for tracking.",
            "Detection and tracking of independent motion.",
            "An efficient 3D deformable model with a self-optimising mesh.",
            "Flexible 3D models from uncalibrated cameras.",
            "Extending the Point Distribution Model using polar coordinates.",
            "Active Shape Models and the shape approximation problem.",
            "Learning the distribution of object trajectories for event recognition.",
            "Probabilistic feature-labelling schemes: modelling compatibility coefficient distributions.",
            "Convex hulls, occluding contours, aspect graphs and the Hough transform.",
            "Self-alignment of a binocular robot.",
            "Invariant handwritten Chinese character recognition using fuzzy ring data.",
            "Projective calibration of a laser-stripe range finder.",
            "Defect detection in random colour textures.",
            "Color texture segmentation for clothing in a computer-aided fashion design system.",
            "Flexible colour point distribution models.",
            "Vision-based robot positioning using neural networks.",
            "Modelling grey level surfaces using three-dimensional point distribution models.",
            "Median-type filters with model-based preselection masks.",
            "A robust algorithm for separation of Chinese characters from line drawings.",
            "Vision based navigation system for an endoscope."
        ]
    },
    {
        "name": "IVC",
        "year": "1995",
        "info": "Volume 13: 1995",
        "count": 62,
        "papers": [
            "Fitting grey level point distribution models to animals in scenes.",
            "Syntactic pattern recognizer for vehicle identification numbers.",
            "Motion estimation method using a 3D steerable filter.",
            "Epipolar curves on surfaces.",
            "Pattern recognition by homomorphic graph matching using Hopfield neural networks.",
            "Self-organizing Hopfield network for attributed relational graph matching.",
            "Intentional control of camera look direction and viewpoint in an active vision system.",
            "Cooperative strategy for matching multi-level edge primitives.",
            "Continuous principal distance change for binocular depth perception.",
            "Motion analysis via interframe point correspondence establishment.",
            "Radar image processing for ship-traffic control.",
            "Motion-based recognition a survey.",
            "Finding grey-skeletons by iterated pixel removal.",
            "Edge detection by curve fitting.",
            "Local feature detector using 3-point matching and dynamic programming.",
            "Relative 3D positioning and 3D convex hull computation from a weakly calibrated stereo pair.",
            "From inspection to process understanding and monitoring: a view on computer vision in manufacturing.",
            "Active/space-variant object recognition.",
            "Discontinuous MRF prior and robust statistics: a comparative study.",
            "Probabilistic and non-probabilistic Hough transforms: overview and comparisons.",
            "Fractals: a fast, accurate and illuminating algorithm.",
            "Vision and Lie's approach to invariance.",
            "Nonlinear scale-space.",
            "Medical computer vision, virtual reality and robotics.",
            "Relief: pictorial and otherwise.",
            "Optimization approaches to constraint satisfaction problems in computer vision.",
            "Image registration using multi-scale texture moments.",
            "Viewpoint-invariant representation of generalized cylinders using the symmetry set.",
            "Skeletonization using an extended Euclidean distance transform.",
            "3D shape recovery using a deformable model.",
            "Combination of HMMs for the representation of printed characters in noisy document images.",
            "Automatic face identification system using flexible appearance models.",
            "Combining point distribution models with shape models based on finite element analysis.",
            "Relational matching by discrete relaxation.",
            "Assessing the completeness properties of pairwise geometric histograms.",
            "Active region models for segmenting textures and colours.",
            "Symmetry detection through local skewed symmetries.",
            "Non-linear generalization of point distribution models using polynomial regression.",
            "Computer vision on a colour blindness plate.",
            "Neural network-based inspection of solder joints using a circular illumination.",
            "Improved mirroring and rotation functions for linear quadtree leaves.",
            "Polarization camera sensors.",
            "Eyes in the interface.",
            "Gabor function-based medical image compression.",
            "Superficial and deep structure in linear diffusion scale space: isophotes, critical points and separatrices.",
            "Fast image region growing.",
            "New segmentation techniques for document image analysis.",
            "Real-time tracking of surfaces with structured light.",
            "Shape description and recognition by a multiresolution approach.",
            "Characterization of optical, electronic and topographic images in fatigue research.",
            "User programmable visual inspection.",
            "Optimal parameter selection for derivative estimation from range images.",
            "Feature tracking by multi-frame relaxation.",
            "Method for matching general stereo planar curves.",
            "Colour-based object recognition under spectrally non-uniform illumination.",
            "Inferring the 3D shape formed by plane surfaces from isoluminance curves.",
            "Determination of optimal general edge detectors by global minimization of a cost function.",
            "Real-time corner detection algorithm for motion estimation.",
            "Image normalization for pattern recognition.",
            "Vision and action.",
            "Automated entry system for Chinese printed documents.",
            "Fuzzy state machines to recognize totally unconstructed handwritten strokes."
        ]
    },
    {
        "name": "IVC",
        "year": "1994",
        "info": "Volume 12: 1994",
        "count": 66,
        "papers": [
            "Automatic approach to mapping a lifelike 2.5D human face.",
            "Local stereoscopic depth estimation.",
            "Counting people getting in and out of a bus by real-time image-sequence processing.",
            "Probabilistic reasoning in high-level vision.",
            "A high level language for parallel image processing.",
            "Algorithm design for image processing in the context of cellular logic.",
            "Motion estimation from scaled orthographic projections without correspondences.",
            "Token tracking in a cluttered scene.",
            "Vision: Coding and efficiency.",
            "Special issue: British Machine Vision Conference 1993.",
            "Issues in robot vision.",
            "Contextual classification of cracks.",
            "Saccade and pursuit on an active head/eye platform.",
            "Recognizing objects on the ground-plane.",
            "Medical image registration using knowledge of adjacency of anatomical structures.",
            "Relative positioning from model indexing.",
            "Uncalibrated stereo hand-eye coordination.",
            "Simultaneous learning of decision rules and important attributes for classification problems in image analysis.",
            "Stretch-correlation as a real-time alternative to feature-based stereo matching algorithms.",
            "Line labelling and region segmentation in stereo image pairs.",
            "Auto-calibration of visual sensor parameters on a robotic head.",
            "Segmentation of the finger bones as a prerequisite for the determination of bone age.",
            "On edge focusing.",
            "On the accuracy of point curvature estimators in a discrete environment.",
            "Complete line segment description using the Hough transform.",
            "Hierarchical approach to feature indexing.",
            "Recovery of superquadric primitive from stereo images.",
            "Efficient linear octree generation from voxels.",
            "Alignment of planar curves.",
            "Information processing in medical imaging.",
            "Higher order differential structure of images.",
            "MuItiscale medial analysis of medical images.",
            "Kohonen networks for multiscale image segmentation.",
            "Segmentation of magnetic resonance brain images using analogue constraint satisfaction neural networks.",
            "Use of active shape models for locating structures in medical images.",
            "Fast, non-linear inversion for electrical impedance tomography.",
            "Foundations of factor analysis of medical image sequences: a unified approach and some practical implications.",
            "Semi-algebraic solids in 3-space: a survey of modelling schemes and implications for view graphs.",
            "Robust shape from shading.",
            "Anatomical object recognition using deformable geometric models.",
            "How normal flow constrains relative depth for an active observer.",
            "Hierarchical probabilistic image segmentation.",
            "A novel change detection algorithm using adaptive threshold.",
            "Modified Hough transforms for feature recognition on deformable patterned materials.",
            "Using moments to acquire the motion parameters of a deformable object without correspondences.",
            "Shape from shading using linear approximation.",
            "Model-based recognition of anatomical objects from medical images.",
            "Recognition of handwritten Chinese characters by modified relaxation methods.",
            "Pyramid simulation of image processing applications.",
            "Sonar image motion distortion estimation and correction using covariance function modelling.",
            "HMM-based architecture for face identification.",
            "Detection of dominant points on an object boundary: a discontinuity approach.",
            "Continuous voxel classification by stochastic relaxation: theory and application to MR imaging and MR angiography.",
            "Recognition of parameterized objects from 3D data: a parallel implementation.",
            "Preattentive computer vision towards a two-stage computer vision system for the extraction of qualitative descriptors and the cues for focus of attention.",
            "Generalized multiresolution analysis of magnetic resonance images.",
            "Testing face recognition systems.",
            "Extracting structure from an affine view of a 3D point set with one or two bilateral symmetries.",
            "Image compression by vector quantization: a review focused on codebook generation.",
            "Determining the gaze of faces in images.",
            "Straight line approximation and 1D representation of off-line handwritten text.",
            "Estimation of complex multimodal motion: an approach based on robust statistics and Hough transform.",
            "On-line handwritten Chinese character recognition via a fuzzy attribute representation.",
            "Three-dimensional motion and reconstruction of coronary arteries from biplane cineangiography.",
            "Morph transformation of the facial image.",
            "Artificial neural networks for image understanding."
        ]
    },
    {
        "name": "IVC",
        "year": "1993",
        "info": "Volume 11: 1993",
        "count": 66,
        "papers": [
            "Recognition of fish species by colour and shape.",
            "Linear generalized Hough transform and its parallelization.",
            "Spatial database manager for a multi-source image understanding system.",
            "Parallel approach to tracking edge segments in dynamic scenes.",
            "Pose determination of parameterized object models from a monocular image.",
            "Auto-calibration by direct observation of objects.",
            "Interpretation of line drawings of complex objects.",
            "Extraction of vanishing points from images of indoor and outdoor scenes.",
            "Automatic segmentation of hand-wrist radiographs.",
            "Mirroring and rotating images in linear quadtree form with few machine instructions.",
            "Knowledge-based approach to image interpretation.",
            "Parallel coordination of image operators: model, algorithm and performance.",
            "Automated analysis of retinal images.",
            "Computing three-dimensional motion parameters: a hypothesis testing approach.",
            "Segmentation of plant cell pictures.",
            "Euclidean skeleton via centre-of-maximal-disc extraction.",
            "Special issue: British Machine Vision Conference 1992.",
            "Statistical detection of independent movement from a moving camera.",
            "Recognition of volcanoes on Venus using correlation methods.",
            "Junction detection using probabilistic relaxation.",
            "3D structure and motion estimation from 2D image sequences.",
            "Recognizing polyhedral objects from a single perspective view.",
            "Image tracking in real-time: a transputer emulation of some early mammalian vision processes.",
            "Planar region detection and motion recovery.",
            "Chromosome location and feature extraction using neural networks.",
            "Vanishing point detection.",
            "3D scene modelling by sinusoid encoded illumination.",
            "Overlapping quadtrees for the representation of similar images.",
            "Online recognition by deviation-expansion model and A* algorithm-based matching.",
            "An efficient approach to the identification of characteristic intensity variations.",
            "Image reconstruction by a Hopfield neural network.",
            "Techniques for online gesture recognition on workstations.",
            "Connective hough transform.",
            "Understanding shape: perspectives from natural and machine vision.",
            "Shape in machine vision.",
            "Neurophysiology of shape processing.",
            "Beyond linear perspective: a cubist manifesto for visual science.",
            "From line drawings to impressions of 3D objects: developing a model to account for the shapes that people see.",
            "Describing the shapes of faces using surface primitives.",
            "Shape using volumetric primitives.",
            "Discrimination between visual stimuli by variation of shape and relative position of volumetric primitives.",
            "Issues in shape perception.",
            "Note on small angle approximations for stereo disparity.",
            "Generalized comparison of quadtree and bintree storage requirements.",
            "Complementary quadtree.",
            "Variational approach to optical flow estimation managing discontinuities.",
            "Using line correspondences in invariant signatures for curve recognition.",
            "Fast component labelling and convex hull computation on reconfigurable meshes.",
            "Medical image processing.",
            "Structure-sensitive adaptive contrast enhancement methods and their evaluation.",
            "Computer assisted stereotactic neurosurgery.",
            "Segmentation of medical images.",
            "Methodology for the representation, indexing and retrieval of images by content.",
            "Workstation environment for image processing in nuclear medicine.",
            "Pattern-Rrecognition transforms.",
            "Automatic thresholding based on human visual perception.",
            "Motion and structure estimation using long sequence motion models.",
            "Hierarchical segmentation-based approach to motion analysis.",
            "Motion constraint equations based on constant image irradiance.",
            "A novel fast and reliable thinning algorithm.",
            "Quantitative study of 3D gradient operators.",
            "Computing the Hough transform on reconfigurable meshes.",
            "Autofocusing for tissue microscopy.",
            "Detection and tracking of single-pixel targets based on trajectory continuity.",
            "On the sensitivity of camera calibration.",
            "Connected component labelling on the BLITZEN massively parallel processor."
        ]
    },
    {
        "name": "IVC",
        "year": "1992",
        "info": "Volume 10: 1992",
        "count": 74,
        "papers": [
            "Scale-space primal sketch: construction and experiments.",
            "Images as functions and sets.",
            "Visual reconstruction with discontinuities using variational methods.",
            "Transformational invariance - a primer.",
            "Shape description via shading images.",
            "Token-textured object detection by pyramids.",
            "Modelling and identification of characteristic intensity variations.",
            "Extracting contours by perceptual grouping.",
            "Practical approach to the stereo matching of urban imagery.",
            "Use of the Radon transform as a method of extracting information about shape in two dimensions.",
            "Image restoration preserving discontinuities: the Bayesian approach and neural networks.",
            "Differential algorithm for the determination of shape from shading using a point light source.",
            "Range image understanding.",
            "Shape representation and image segmentation using deformable surfaces.",
            "Object modelling by registration of multiple range images.",
            "Representation, extraction and recognition with second-order topographic surface features.",
            "3D measurements from imaging laser radars: how good are they?",
            "Recognizing geons from superquadrics fitted to range data.",
            "Recovering a boundary-level structural description from dynamic stereo.",
            "Model-based recognition and range imaging for a guided vehicle.",
            "Comparative evaluation of fast thinning algorithms on a multiprocessor architecture.",
            "Finding half boundaries and junctions in images.",
            "Robust segmentation of noisy images using a neural network model.",
            "Procedure for generating template masks for detecting variable signals.",
            "Relative motion and pose from arbitrary plane curves.",
            "A method of obtaining the relative positions of four points from three perspective projections.",
            "Ellipse detection and matching with uncertainty.",
            "Classification of breast tissue by texture analysis.",
            "Feature-based correspondence: an eigenvector approach.",
            "Trainable method of parametric shape description.",
            "Model-based image interpretation using genetic algorithms.",
            "3D grouping by viewpoint consistency ascent.",
            "Boundary detection using Bayesian nets.",
            "Relational model construction and 3D object recognition from single 2D monochromatic image.",
            "Invariants of a pair of conics revisited.",
            "Segmentation of MR images using neural nets.",
            "Information processing in medical imaging.",
            "Surgical probe design for a coincidence imaging system without a collimator.",
            "Voxel based Monte Carlo calculations of nuclear medicine images and applied variance reduction techniques.",
            "Unsupervised tissue type segmentation of 3D dual-echo MR head data.",
            "Segmentation of magnetic resonance images using mean field annealing.",
            "Stochastic model for automated detection of calcifications in digital mammograms.",
            "Scale and the differential structure of images.",
            "Scale and segmentation of grey-level images using maximum gradient paths.",
            "From voxel to intrinsic surface features.",
            "Bending and stretching models for LV wall motion analysis from curves and surfaces.",
            "Modular system for image analysis using a game-theoretic framework.",
            "Trainable models for the interpretation of biomedical images.",
            "Linear discriminants and image quality.",
            "Towards an active perception.",
            "Analogical representation of space and time.",
            "Image reconstruction on a special purpose array processor.",
            "Digital curvature estimation for left ventricular shape analysis.",
            "Four algorithms for enhancing images with large peaks in their histogram.",
            "High level 3D structures from a single view.",
            "Closing gaps in edges and surfaces.",
            "Constraints on quadratic-curved features under perspective projection.",
            "3D object recognition based on a viewpoint-analysis.",
            "Surface shape and curvature scales.",
            "Object recognition from range data prior to segmentation.",
            "Quadrics-based matching technique for 3D object recognition.",
            "MuSIP multi-sensor image processing system.",
            "Fast computer vision algorithms for reconfigurable meshes.",
            "Towards visually convincing image segmentation.",
            "Recursive neighbourhood operations on the linear processor array SYMPATI-2.",
            "Fuzzy relaxation approach for inexact scene matching.",
            "2nd European conference on computer vision.",
            "Detection of specularity using colour and multiple views.",
            "Integrating primary ocular processes.",
            "Steerable-scalable kernels for edge detection and junction analysis.",
            "Features extraction and analysis methods for sequences of ultrasound Images.",
            "Depth computations from polyhedral images.",
            "Image blurring effects due to depth discontinuities: blurring that creates emergent image details.",
            "Computational framework for determining stereo correspondence from a set of linear spatial filters."
        ]
    },
    {
        "name": "IVC",
        "year": "1991",
        "info": "Volume 9: 1991",
        "count": 44,
        "papers": [
            "Calculating the surface topography of integrated circuit wafers from SEM images.",
            "Determining motion from 3D line segment matches: a comparative study.",
            "Stereoscopic recovery and description of smooth textured surfaces.",
            "Optimal combination of stereo camera calibration from arbitrary stereo images.",
            "Multiprocessor 3D vision system for pick and place.",
            "Integrating stereo and photometric stereo to monitor the development of glaucoma.",
            "Curve matching and stereo calibration.",
            "Feature grouping in a hierarchical probabilistic network.",
            "Recovering partial 3D wire frames descriptions from stereo data.",
            "Probabilistic approach to the Hough transform.",
            "Semi-analytic method for estimating stereo camera geometry from matched points.",
            "Static scene analysis using structured light.",
            "Parallel hough transform algorithm performance.",
            "Ambiguity in reconstruction from image correspondences.",
            "PC-based system for transparent fluid film monitoring.",
            "Robust estimation of surface curvature from deformation of apparent contours.",
            "Recognition of generic components using logic-program relations of image contours.",
            "Synthesising continuous-tone caricatures.",
            "Projectively invariant representations using implicit algebraic curves.",
            "Image segmentation and matching using the binary object forest.",
            "Quantification and abstraction: low level tokens for object extraction.",
            "Obstacle detection by evaluation of optical flow fields from image sequences.",
            "Improved rendering of the Lorenz equations.",
            "Spatial/spatial-frequency representations for image segmentation and grouping.",
            "Zooming techniques on digital Chinese character patterns: a further study and improvement.",
            "Recursive filtering and edge tracking: two primary tools for 3D edge detection.",
            "Comparison of stochastic and deterministic solution methods in Bayesian estimation of 2D motion.",
            "On computing all solutions to the motion estimation problem with exact or noisy data.",
            "On the visual mathematics of tracking.",
            "Alternative to abstract graph matching for locating objects from their salient features.",
            "Efficient method for finding the position of object boundaries to sub-pixel precision.",
            "Decomposition and parallel architecture for the geometric transformation of digital images.",
            "Three-dimensional mathematical morphology.",
            "Vertical and horizontal disparities from phase.",
            "Colour image quantization for high resolution graphics display.",
            "Tesseral amalgamators and hierarchical tessellations.",
            "Structure-from-motion under orthographic projection.",
            "Estimating spectral reflectance using highlights.",
            "Phase singularities in scale-space.",
            "Data preprocessing for adaptive vector quantization.",
            "Frame-based system for image interpretation.",
            "Tracking multiple moving objects by binary object forest segmentation.",
            "Parallel algorithms for plane detection using an adaptive Hough transform.",
            "Automatic inspection of mechanical parts using geometric models and laser range finder data."
        ]
    },
    {
        "name": "IVC",
        "year": "1990",
        "info": "Volume 8: 1990",
        "count": 40,
        "papers": [
            "5th Alvey vision Conference.",
            "Tracking objects using image disparities.",
            "Gaze controls cooperating through prediction.",
            "Rigid velocities compatible with five image velocity vectors.",
            "Algebraic polyhedral constraints and 3D structure from motion.",
            "Novel approach to boundary finding.",
            "Fitting ellipses and predicting confidence envelopes using a bias corrected Kalman filter.",
            "Shape from shading in the light of mutual illumination.",
            "Stereo matching of curves.",
            "SWITCHER: a stereo algorithm for ground plane obstacle detection.",
            "Experiments in vehicle control using predictive feed-forward stereo.",
            "Comparative study of Hough Transform methods for circle finding.",
            "Roll angle consistency constraint.",
            "Stereoscopic tracking of bodies in motion.",
            "Real-time 3D object tracking.",
            "Generation process for the reconstruction of space curves.",
            "Neural network use in maximum entropy image restoration.",
            "Adjacency algorithms for linear octree nodes.",
            "Polyhedral object recognition with sparse data - validation of interpretations.",
            "3D representation of biostructures imaged with an optical microscope : Part A: Digital optical sectioning.",
            "Feature labelling in infrared oceanographic images.",
            "Geometric constraints from planar surface patch matching.",
            "Image segmentation for complex natural scenes.",
            "Perspective approximations.",
            "Predicting multiple feature locations for a class of dynamic image sequences.",
            "Modelling rain patterns: towards automatic interpretation of radar images.",
            "Image segmentation using maximum gradient profiles orthogonal to edges.",
            "Efficient linear quadtree construction algorithm.",
            "Industrial part recognition using a component-index.",
            "Road edge tracking for robot road following: a real-time implementation.",
            "Interactive processing and archiving of images.",
            "Tracking line segments.",
            "Estimation of depth from motion using an anthropomorphic visual sensor.",
            "Derivation of qualitative information in motion analysis.",
            "On scale and resolution in active analysis of local image structure.",
            "Analytical results on error sensitivity of motion estimation from two views.",
            "Comparison of stochastic and deterministic solution methods in Bayesian estimation of 2D motion.",
            "Biased anisotropic diffusion: a unified regularization and diffusion approach to edge detection.",
            "Direct evidence for occlusion in stereo and motion.",
            "Calibrating a mobile camera."
        ]
    },
    {
        "name": "IVC",
        "year": "1989",
        "info": "Volume 7: 1989",
        "count": 39,
        "papers": [
            "Behavioural constraints on animate vision.",
            "Surface reconstruction from outdoor image sequences.",
            "Model based perspective inversion.",
            "3D wire-frame integration from image sequences.",
            "Detecting partially occluded ellipses using the Hough transform.",
            "The information available to a moving observer from specularities.",
            "Consistent labelling of image features using an assumption-based truth maintenance system.",
            "An object location strategy using shape and grey-level models.",
            "Tracking cataract by the \"four-line\" method.",
            "Using a mixed wave/ diffusion process to elicit the symmetry set.",
            "Polyhedral object recognition with sparse data in SIMD processing mode.",
            "\"Region-growing\" algorithm for matching of terrain images.",
            "Digital elevation model production by stereo-matching spot image-pairs: a comparison of algorithms.",
            "A frame-based system for modelling and executing visual tasks.",
            "Segmentation of edges into lines and arcs.",
            "Compact - a surface representation scheme.",
            "Image processing by software parallel computation.",
            "Detecting and extracting compact textured regions using pyramids.",
            "Matching oversegmented 3D images to models using association graphs.",
            "A Markov random field approach to data fusion and colour segmentation.",
            "An associative processor array for image processing.",
            "The design of hexagonal sampling structures for image digitization and their use with local operators.",
            "Efficient parallel implementation of the Hough transform on a distributed memory system.",
            "Space efficient hierarchical structures: relatively addressed compact quadtrees for GISs.",
            "Parallel imperative and functional approaches to visual scene labelling.",
            "A digital geometry for hexagonal pixels.",
            "A robust algorithm for contrast enhancement by local histogram modification.",
            "Recognition of single 3D curved objects using 2D cross-sectional slice shapes.",
            "The hybrid constraint equation for motion extraction.",
            "Image processing for primitive image features recognition in the case of discontinuous line images of printed characters.",
            "Development of vision research in Europe.",
            "Stereo vision correspondence using a multichannel graph matching technique.",
            "An edge preserved image compression technique.",
            "Recognition of shiny dielectric objects by analysing the polarization of reflected light.",
            "Dynamic estimation of optical flow field using objective functions.",
            "A cue generator for crack detection.",
            "A rule-based system for dimensional analysis of glass containers.",
            "Review of shape coding techniques.",
            "Recent progress in object recognition from range data."
        ]
    },
    {
        "name": "IVC",
        "year": "1988",
        "info": "Volume 6: 1988",
        "count": 29,
        "papers": [
            "Accelerated analysis of occlusion.",
            "Improved algorithms for translation of pictures represented by leaf codes.",
            "Algorithms for realtime component labelling of images.",
            "Can multiple views make up for lack of camera registration?",
            "Decomposition of 3D objects into compact subobjects by analysis of cross-sections.",
            "From image sequences towards conceptual descriptions.",
            "Representing space for practical reasoning.",
            "3D positional integration from image sequences.",
            "TINA: a 3D vision system for pick and place.",
            "Solving geometric constraints in a parallel network.",
            "From an image sequence to a recognized polyhedral object.",
            "Finding corners.",
            "Matching Canny edgels to compute the principal components of optic flow.",
            "Consistency maintenance in the REVgraph environment.",
            "Adaptive iterative algorithm for image restoration.",
            "Algorithm to expand regions represented by linear quadtrees.",
            "Comparison of two dilation algorithms for a linear quadtree.",
            "VIPS - a digital image processing algorithm development environment.",
            "Level crossing curvature and the Laplacian.",
            "Texture isolation by adaptive digital filtering.",
            "Analysis of bilevel quantizers used in binary image correlators.",
            "Image labelling: a neural network approach.",
            "Boundary matching algorithm for connected component labelling using linear quadtrees.",
            "On the geometry of a surface and its singular profiles.",
            "Visualization of quaternion slices.",
            "Knowledge-based improvement of automatic image interpretation for restricted scenes: two case studies.",
            "Query based visual analysis: spatio-temporal reasoning in computer vision.",
            "Image registration by local approximation methods.",
            "Spline-based recognition of straight lines and curves in engineering line drawings."
        ]
    },
    {
        "name": "IVC",
        "year": "1987",
        "info": "Volume 5: 1987",
        "count": 37,
        "papers": [
            "Context-directed segmentation algorithm for handwritten numeral strings.",
            "Dilation algorithm for a linear quadtree.",
            "Two-dimensional object recognition using partial contours.",
            "Tomographic image reconstruction based on a backscattering coherent processing technique.",
            "Terrain modelling with B-spline type surfaces defined on curved knot lines.",
            "Stochastic model for boundary detection.",
            "\"Four-line\" method of locally estimating optic flow.",
            "Matching geometrical descriptions in three-space.",
            "Image understanding system for carotid angiograms.",
            "Model-based recognition using 3D structure from motion.",
            "On the classification of views of piecewise smooth objects.",
            "SMS: a suggestive modelling system for object recognition.",
            "Knowledge source for describing stereoscopically viewed textured surfaces.",
            "Apparent area of a rigid moving body.",
            "Matching segmented scenes to models using pairwise relationships between features.",
            "Hough transform analysis of data from a planar array of image sensors.",
            "Knowledge-based segmentation of sonar data.",
            "Segmentation and description of binocularly viewed contours.",
            "Use of models in studying macrophage cell images and the underlying biological processes.",
            "Contextual decision rule for region analysis.",
            "Edge-detection algorithm and its video-rate implementation.",
            "The Radon transform and its application to shape parametrization in machine vision.",
            "Dupin's cyclide and the cyclide patch.",
            "Optimal combination of multiple sensors including stereo vision.",
            "Estimation of stereo and motion parameters using a variational principle.",
            "Recent developments in linear quadtree-based geographic information systems.",
            "Design of optimal gaussian operators in small neighbourhoods.",
            "Algorithm design specification for interpreting segmented image data using schemas and support logic.",
            "Practical first-difference edge detection with subpixel accuracy.",
            "Triangular decomposition.",
            "Geometric reasoning for computer vision.",
            "Distributed associative memory for use in scene analysis.",
            "Transformation calibration of a camera mounted on a robot.",
            "Linear predictive transform of monochrome images.",
            "Improved localization in a generalized Hough scheme for the detection of straight edges.",
            "Measures of correspondence between binary patterns.",
            "Algorithm for converting a forest of quadtrees to a binary array."
        ]
    },
    {
        "name": "IVC",
        "year": "1986",
        "info": "Volume 4: 1986",
        "count": 22,
        "papers": [
            "Biomedical image processing using the CLIP system.",
            "Invariance in pattern recognition: application to line images.",
            "Method for improving image quality in digital linear tomography.",
            "Implementation for noise suppression in images.",
            "Algorithm for analysing optical flow based on the least-squares method.",
            "Edge detection and motion detection.",
            "Comments on 'fast thinning algorithm for binary images'.",
            "Knowledge-based interpretation of remotely sensed images.",
            "Multiconstraint shape analysis.",
            "Automated reasoning about image motion using a rule-based deduction system.",
            "Curvature-based representation of objects from range data.",
            "'Model': a POPLOG package to support model-based vision.",
            "A parallel approach to the picture restoration algorithm of Geman and Geman on an SIMD machine.",
            "Application of an optimized digital correlation method to planar deformation analysis.",
            "Hardware implementation of image registration algorithms.",
            "Three-dimensional surface measurement by microcomputer.",
            "Efficient algorithm for polygon overlay for dense map image data sets.",
            "Merging the AUTOVIEW image processing language with PROLOG.",
            "Medical image processing: the characterization of display changes using histogram entropy.",
            "Improved digital image processing technique to investigate plastic zone formation in steel.",
            "Recognition of handwritten characters - a review.",
            "Computer vision and image processing research at the University of Texas at Austin."
        ]
    },
    {
        "name": "IVC",
        "year": "1985",
        "info": "Volume 3: 1985",
        "count": 24,
        "papers": [
            "Properties, implementations and applications of rank filters.",
            "Implicit convolution.",
            "Three-dimensional hidden-surface removal for signal-return modelling: experimental results.",
            "Efficient planar convex hull algorithm.",
            "Three-dimensional surface mapping simulator: theory, capabilities and operation.",
            "Image segmentation by conventional and information-integrating techniques: a synopsis.",
            "Space and time efficiency of the forest-of-quadtrees representation.",
            "Fast thinning algorithm for binary images.",
            "Multiband image classification with a distributed architecture.",
            "Range filters: Localintensity subrange filters and their properties.",
            "Image database.",
            "Automatic recalibration of moving cameras in stereo vision systems.",
            "Machine vision for industry: Tasks, tools and techniques.",
            "Overview of the computer vision and robotics programme at the University of Utah.",
            "Alvey computer vision and image interpretation research programmes.",
            "On describing complex surface shapes.",
            "Optic flow segmentation as an ill-posed and maximum likelihood problem.",
            "Direct surface reconstruction from a moving sensor.",
            "Binocular stereo algorithm based on the disparity-gradient limit and using optimization theory.",
            "Surface descriptions from stereo and shading.",
            "Use of multiple difference-of-Gaussian filters to verify geometric models.",
            "An approach to knowledge-driven segmentation.",
            "Relaxation labelling algorithms - a review.",
            "Knowledge-based analysis of carotid angiograms."
        ]
    },
    {
        "name": "IVC",
        "year": "1984",
        "info": "Volume 2: 1984",
        "count": 17,
        "papers": [
            "Low-cost remote sensing experiments within an educational environment.",
            "Contextual classification of multispectral pixel data.",
            "Image processing system for industrial robots.",
            "Analysis of integer programming formulations of clustering problems.",
            "Computation of optic flow from the motion of edge features in image sequences.",
            "Computerized tomographic imaging is insensitive to density variation during scanning.",
            "Matching 'sticks, plates and blobs' objects using geometric and relational constraints.",
            "Difference and accumulative difference pictures in dynamic scene analysis.",
            "Object decomposition and subpart identification - classification algorithms.",
            "Model-based segmentation of grey-tone images.",
            "Circularity - a new principle underlying the design of accurate edge orientation operators.",
            "Handwritten numeral recognition by tree classification methods.",
            "A hidden line mechanism using overinking.",
            "Obtaining viewing distance and angle of gaze from vertical disparity using a Hough-type accumulator.",
            "Linear time algorithm for finding a picture's connected components.",
            "Environments for image processing algorithm development.",
            "Image processing and analysis of the grain constitution in minerals."
        ]
    },
    {
        "name": "IVC",
        "year": "1983",
        "info": "Volume 1: 1983",
        "count": 24,
        "papers": [
            "Model-based vision: a program to see a walking person.",
            "Detection of cracks using image processing algorithms implemented in hardware.",
            "Two-level pipelined systolic array for multidimensional convolution.",
            "On the accuracy of the Sobel edge detector.",
            "3D reconstruction of the blood vessels of the brain from a stereoscopic pair of subtraction angiograms.",
            "Digital image processing of confocal images.",
            "Digital processing of chest radiographs.",
            "Moment invariants in theory and practice.",
            "An optimization approach to relaxation labelling algorithms.",
            "Pattern recognition of collections.",
            "Region digitization and boundary estimation.",
            "Comparison of thinning algorithms on a parallel processor.",
            "Determination of displacements using an improved digital correlation method.",
            "Time- and storage-efficient implementation of an optimal planar convex hull algorithm.",
            "Image matching for pulse echo measurement of ultrasonic velocity.",
            "Optimal floating point multiplication processor for signal processing.",
            "Framestore system for map displays.",
            "Greyscale image processing for industrial applications.",
            "Image identification and segmentation according to random-field models.",
            "Advances in image segmentation.",
            "Spatially referenced methods of processing raster and vector data.",
            "Application of edge detection techniques to detection of the bright band in radar data.",
            "Distributed parameter systems approach to feature extraction and motion estimation in image sequences.",
            "Practical solution using a new approach to robot vision."
        ]
    }
]