[
    {
        "name": "JAIR",
        "year": "2022",
        "info": "2022: Volumes\n73,",
        "count": 20,
        "papers": [
            "Ranking Sets of Objects: The Complexity of Avoiding Impossibility Results.",
            "Online Relaxation Refinement for Satisficing Planning: On Partial Delete Relaxation, Complete Hill-Climbing, and Novelty Pruning.",
            "Jointly Learning Environments and Control Policies with Projected Stochastic Gradient Ascent.",
            "Reward Machines: Exploiting Reward Function Structure in Reinforcement Learning.",
            "Doubly Robust Crowdsourcing.",
            "Preferences Single-Peaked on a Tree: Multiwinner Elections and Structural Results.",
            "A Survey of Opponent Modeling in Adversarial Domains.",
            "Explainable Deep Learning: A Field Guide for the Uninitiated.",
            "Automatic Recognition of the General-Purpose Communicative Functions Defined by the ISO 24617-2 Standard for Dialog Act Annotation.",
            "Image Captioning as an Assistive Technology: Lessons Learned from VizWiz 2020 Challenge.",
            "Neural Character-Level Syntactic Parsing for Chinese.",
            "CASA: Conversational Aspect Sentiment Analysis for Dialogue Understanding.",
            "Sum-of-Products with Default Values: Algorithms and Complexity Results.",
            "Migrating Techniques from Search-based Multi-Agent Path Finding Solvers to SAT-based Approach.",
            "Viewpoint: Ethical By Designer - How to Grow Ethical Designers of Artificial Intelligence.",
            "Fine-grained Prediction of Political Leaning on Social Media with Unsupervised Deep Learning.",
            "Visually Grounded Models of Spoken Language: A Survey of Datasets, Architectures and Evaluation Techniques.",
            "Some Inapproximability Results of MAP Inference and Exponentiated Determinantal Point Processes.",
            "SAMBA: A Generic Framework for Secure Federated Multi-Armed Bandits.",
            "Survey and Evaluation of Causal Discovery Methods for Time Series."
        ]
    },
    {
        "name": "JAIR",
        "year": "2021",
        "info": "2021: Volumes\n70,\n71,\n72",
        "count": 104,
        "papers": [
            "On the Decomposition of Abstract Dialectical Frameworks and the Complexity of Naive-based Semantics.",
            "Superintelligence Cannot be Contained: Lessons from Computability Theory.",
            "Integrated Offline and Online Decision Making under Uncertainty.",
            "Zone pAth Construction (ZAC) based Approaches for Effective Real-Time Ridesharing.",
            "Cost-optimal Planning, Delete Relaxation, Approximability, and Heuristics.",
            "Learning Temporal Causal Sequence Relationships from Real-Time Time-Series.",
            "A Survey on the Explainability of Supervised Machine Learning.",
            "Efficient Multi-objective Reinforcement Learning via Multiple-gradient Descent with Iteratively Discovered Weight-Vector Sets.",
            "The Computational Complexity of Understanding Binary Classifier Decisions.",
            "Hybrid-order Network Consensus for Distributed Multi-agent Systems.",
            "Benchmark and Survey of Automated Machine Learning Frameworks.",
            "On Super Strong ETH.",
            "General Value Function Networks.",
            "An External Knowledge Enhanced Graph-based Neural Network for Sentence Ordering.",
            "On the Distortion Value of Elections with Abstention.",
            "Generic Constraint-based Block Modeling using Constraint Programming.",
            "Regarding Goal Bounding and Jump Point Search.",
            "Classifier Chains: A Review and Perspectives.",
            "Two-facility Location Games with Minimum Distance Requirement.",
            "Efficient Large-Scale Multi-Drone Delivery using Transit Networks.",
            "A Sufficient Statistic for Influence in Structured Multiagent Environments.",
            "Taking Principles Seriously: A Hybrid Approach to Value Alignment in Artificial Intelligence.",
            "On the Evolvability of Monotone Conjunctions with an Evolutionary Mutation Mechanism.",
            "Safe Multi-Agent Pathfinding with Time Uncertainty.",
            "Constrained Multiagent Markov Decision Processes: a Taxonomy of Problems and Algorithms.",
            "The Societal Implications of Deep Reinforcement Learning.",
            "Induction and Exploitation of Subgoal Automata for Reinforcement Learning.",
            "Lilotane: A Lifted SAT-based Approach to Hierarchical Planning.",
            "Computational Complexity of Computing Symmetries in Finite-Domain Planning.",
            "Liquid Democracy: An Algorithmic Perspective.",
            "Strategyproof Mechanisms for Additively Separable and Fractional Hedonic Games.",
            "Weighted First-Order Model Counting in the Two-Variable Fragment With Counting Quantifiers.",
            "The AI Liability Puzzle and A Fund-Based Work-Around.",
            "Instance-Level Update in DL-Lite Ontologies through First-Order Rewriting.",
            "Confident Learning: Estimating Uncertainty in Dataset Labels.",
            "Aggregation over Metric Spaces: Proposing and Voting in Elections, Budgeting, and Legislation.",
            "Efficient Retrieval of Matrix Factorization-Based Top-k Recommendations: A Survey of Recent Approaches.",
            "Loss Functions, Axioms, and Peer Review.",
            "MADRaS : Multi Agent Driving Simulator.",
            "Labeled Bipolar Argumentation Frameworks.",
            "On the Cluster Admission Problem for Cloud Computing.",
            "Game Plan: What AI can do for Football, and What Football can do for AI.",
            "Efficient Local Search based on Dynamic Connectivity Maintenance for Minimum Connected Dominating Set.",
            "Learning over No-Preferred and Preferred Sequence of Items for Robust Recommendation.",
            "Welfare Guarantees in Schelling Segregation.",
            "Viewpoint: AI as Author - Bridging the Gap Between Machine Learning and Literary Theory.",
            "Measuring the Occupational Impact of AI: Tasks, Cognitive Abilities and AI Benchmarks.",
            "RWNE: A Scalable Random-Walk based Network Embedding Framework with Personalized Higher-order Proximity Preserved.",
            "Declarative Algorithms and Complexity Results for Assumption-Based Argumentation.",
            "Playing Codenames with Language Graphs and Word Embeddings.",
            "A Tight Bound for Stochastic Submodular Cover.",
            "Multi-Document Summarization with Determinantal Point Process Attention.",
            "Representative Committees of Peers.",
            "Confronting Abusive Language Online: A Survey from the Ethical and Human Rights Perspective.",
            "EpidemiOptim: A Toolbox for the Optimization of Control Policies in Epidemiological Models.",
            "Intelligence in Strategic Games.",
            "Conceptual Modeling of Explainable Recommender Systems: An Ontological Formalization to Guide Their Design and Development.",
            "Ethics and Governance of Artificial Intelligence: Evidence from a Survey of Machine Learning Researchers.",
            "Improving the Effectiveness and Efficiency of Stochastic Neighbour Embedding with Isolation Kernel.",
            "Goal Recognition for Deceptive Human Agents through Planning and Gaze.",
            "Dimensional Inconsistency Measures and Postulates in Spatio-Temporal Databases.",
            "Merge-and-Shrink: A Compositional Theory of Transformations of Factored Transition Systems.",
            "Set-to-Sequence Methods in Machine Learning: A Review.",
            "Evaluating Strategic Structures in Multi-Agent Inverse Reinforcement Learning.",
            "Agent-Based Markov Modeling for Improved COVID-19 Mitigation Policies.",
            "Bribery and Control in Stable Marriage.",
            "Election Manipulation on Social Networks: Seeding, Edge Removal, Edge Addition.",
            "Probabilistic Temporal Networks with Ordinary Distributions: Theory, Robustness and Expected Utility.",
            "Socially Responsible AI Algorithms: Issues, Purposes, and Challenges.",
            "Trends in Integration of Vision and Language Research: A Survey of Tasks, Datasets, and Methods.",
            "Optimizing for Interpretability in Deep Neural Networks with Tree Regularization.",
            "A Semi-exact Algorithm for Quickly Computing A Maximum Weight Clique in Large Sparse Graphs.",
            "Finding the Hardest Formulas for Resolution.",
            "Worst-case Bounds on Power vs. Proportion in Weighted Voting Games with an Application to False-name Manipulation.",
            "On the Computational Complexity of Non-Dictatorial Aggregation.",
            "Pure Nash Equilibria in Resource Graph Games.",
            "A Theoretical Perspective on Hyperdimensional Computing.",
            "Relevance in Belief Update.",
            "On Quantifying Literals in Boolean Logic and its Applications to Explainable AI.",
            "sunny-as2: Enhancing SUNNY for Algorithm Selection.",
            "A Survey of Algorithms for Black-Box Safety Validation of Cyber-Physical Systems.",
            "NLP Methods for Extraction of Symptoms from Unstructured Data for Use in Prognostic COVID-19 Analytic Models.",
            "Optimal Any-Angle Pathfinding on a Sphere.",
            "Optimally Deceiving a Learning Leader in Stackelberg Games.",
            "Contrastive Explanations of Plans through Model Restrictions.",
            "Multilabel Classification with Partial Abstention: Bayes-Optimal Prediction under Label Independence.",
            "Output Space Entropy Search Framework for Multi-Objective Bayesian Optimization.",
            "Analysis of the Impact of Randomization of Search-Control Parameters in Monte-Carlo Tree Search.",
            "Multi-Label Classification Neural Networks with Hard Logical Constraints.",
            "Task-Aware Verifiable RNN-Based Policies for Partially Observable Markov Decision Processes.",
            "Experimental Comparison and Survey of Twelve Time Series Anomaly Detection Algorithms.",
            "Flexible Bayesian Nonlinear Model Configuration.",
            "Graph Kernels: A Survey.",
            "Steady-State Planning in Expected Reward Multichain MDPs.",
            "Teaching People by Justifying Tree Search Decisions: An Empirical Study in Curling.",
            "Reasoning with PCP-Nets.",
            "Learning Realistic Patterns from Visually Unrealistic Stimuli: Generalization and Data Anonymization.",
            "On the Online Coalition Structure Generation Problem.",
            "Learning Optimal Decision Sets and Lists with SAT.",
            "A Word Selection Method for Producing Interpretable Distributional Semantic Word Vectors.",
            "Quantum Mathematics in Artificial Intelligence.",
            "The Rediscovery Hypothesis: Language Models Need to Meet Linguistics.",
            "Learning from Disagreement: A Survey.",
            "Constraint-based Diversification of JOP Gadgets."
        ]
    },
    {
        "name": "JAIR",
        "year": "2020",
        "info": "2020: Volumes\n67,\n68,\n69",
        "count": 84,
        "papers": [
            "Best-First Enumeration Based on Bounding Conflicts, and its Application to Large-scale Hybrid Estimation.",
            "The Impact of Treewidth on Grounding and Solving of Answer Set Programs.",
            "The 2^k Neighborhoods for Grid Path Planning.",
            "Regret Bounds for Reinforcement Learning via Markov Chain Concentration.",
            "Saturated Cost Partitioning for Optimal Classical Planning.",
            "The Force Awakens: Artificial Intelligence for Consumer Law.",
            "Blind Spot Detection for Safe Sim-to-Real Transfer.",
            "Planning for Hybrid Systems via Satisfiability Modulo Theories.",
            "TensorLog: A Probabilistic Database Implemented Using Deep-Learning Infrastructure.",
            "Jointly Improving Parsing and Perception for Natural Language Commands through Human-Robot Dialog.",
            "Adversarial Attacks on Crowdsourcing Quality Control.",
            "Revisiting Graph Width Measures for CNF-Encodings.",
            "Catching Cheats: Detecting Strategic Manipulation in Distributed Optimisation of Electric Vehicle Aggregators.",
            "Fair Allocation with Diminishing Differences.",
            "A Global Constraint for the Exact Cover Problem: Application to Conceptual Clustering.",
            "Robust Multi-Agent Path Finding and Executing.",
            "Agreement on Target-Bidirectional Recurrent Neural Networks for Sequence-to-Sequence Learning.",
            "Solving Delete Free Planning with Relaxed Decision Diagram Based Heuristics.",
            "A Set of Recommendations for Assessing Human-Machine Parity in Language Translation.",
            "Using Task Descriptions in Lifelong Machine Learning for Improved Performance and Zero-Shot Transfer.",
            "Hedonic Games with Ordinal Preferences and Thresholds.",
            "Compositionality Decomposed: How do Neural Networks Generalise?",
            "Incomplete Preferences in Single-Peaked Electorates.",
            "HTN Planning as Heuristic Progression Search.",
            "Learning the Language of Software Errors.",
            "ASNets: Deep Learning for Generalised Planning.",
            "Vocabulary Alignment in Openly Specified Interactions.",
            "Variational Bayes In Private Settings (VIPS).",
            "Towards Knowledgeable Supervised Lifelong Learning Systems.",
            "Improving Nash Social Welfare Approximations.",
            "Bridging the Gap Between Probabilistic Model Checking and Probabilistic Planning: Survey, Compilations, and Empirical Comparison.",
            "Sliding-Window Thompson Sampling for Non-Stationary Settings.",
            "Conservative Extensions in Horn Description Logics with Inverse Roles.",
            "Predicting Strategic Behavior from Free Text.",
            "Automated Conjecturing II: Chomp and Reasoned Game Play.",
            "Preferences Single-Peaked on a Circle.",
            "Ontology Reasoning with Deep Neural Networks.",
            "Simulating Offender Mobility: Modeling Activity Nodes from Large-Scale Human Activity Data.",
            "Scalable Planning with Deep Neural Network Learned Transition Models.",
            "A General Approach to Multimodal Document Quality Assessment.",
            "The Effects of Experience on Deception in Human-Agent Negotiation.",
            "Image Captioning using Facial Expression and Attention.",
            "Subgoaling Techniques for Satisficing and Optimal Numeric Planning.",
            "How to Do Things with Words: A Bayesian Approach.",
            "Gradient-based Learning Methods Extended to Smooth Manifolds Applied to Automated Clustering.",
            "Towards Partial Order Reductions for Strategic Ability.",
            "Point at the Triple: Generation of Text Summaries from Knowledge Base Triples.",
            "Constraint and Satisfiability Reasoning for Graph Coloring.",
            "On Sparse Discretization for Graphical Games.",
            "Incompatibilities Between Iterated and Relevance-Sensitive Belief Revision.",
            "Contiguous Cake Cutting: Hardness Results and Approximation Algorithms.",
            "Annotator Rationales for Labeling Tasks in Crowdsourcing.",
            "The Parameterized Complexity of Motion Planning for Snake-Like Robots.",
            "Improved High Dimensional Discrete Bayesian Network Inference using Triplet Region Construction.",
            "Planning High-Level Paths in Hostile, Dynamic, and Uncertain Environments.",
            "Neural Machine Translation: A Review.",
            "AMP Chain Graphs: Minimal Separators and Structure Learning Algorithms.",
            "The PETLON Algorithm to Plan Efficiently for Task-Level-Optimal Navigation.",
            "Properties of Switch-List Representations of Boolean Functions.",
            "Computing Bayes-Nash Equilibria in Combinatorial Auctions with Verification.",
            "The Bottleneck Simulator: A Model-Based Deep Reinforcement Learning Approach.",
            "Maximin Share Allocations on Cycles.",
            "Belief change and 3-valued logics: Characterization of 19, 683 belief change operators.",
            "The Complexity Landscape of Outcome Determination in Judgment Aggregation.",
            "Structure from Randomness in Halfspace Learning with the Zero-One Loss.",
            "Using Machine Learning for Decreasing State Uncertainty in Planning.",
            "Mapping the landscape of Artificial Intelligence applications against COVID-19.",
            "Contrasting the Spread of Misinformation in Online Social Networks.",
            "To Regulate or Not: A Social Dynamics Analysis of an Idealised AI Race.",
            "Qualitative Numeric Planning: Reductions and Complexity.",
            "Modular Structures and Atomic Decomposition in Ontologies.",
            "Credibility-limited Base Revision: New Classes and Their Characterizations.",
            "Representing Fitness Landscapes by Valued Constraints to Understand the Complexity of Local Search.",
            "Epistemic Argumentation Framework: Theory and Computation.",
            "A Differential Privacy Mechanism that Accounts for Network Effects for Crowdsourcing Systems.",
            "Adaptive Stress Testing: Finding Likely Failure Events with Reinforcement Learning.",
            "Lifted Bayesian Filtering in Multiset Rewriting Systems.",
            "Reviewing Autoencoders for Missing Data Imputation: Technical Trends, Applications and Outcomes.",
            "Adapting Behavior via Intrinsic Reward: A Survey and Empirical Study.",
            "On the Complexity of Learning a Class Ratio from Unlabeled Data.",
            "An Evaluation of Communication Protocol Languages for Engineering Multiagent Systems.",
            "Bounds on the Size of PC and URC Formulas.",
            "Deep Reinforcement Learning: A State-of-the-Art Walkthrough.",
            "Diagnosis of Deep Discrete-Event Systems."
        ]
    },
    {
        "name": "JAIR",
        "year": "2019",
        "info": "2019: Volumes\n64,\n65,\n66",
        "count": 75,
        "papers": [
            "Fair Allocation of Indivisible Goods to Asymmetric Agents.",
            "On Inductive Abilities of Latent Factor Models for Relational Learning.",
            "Rank Pruning for Dominance Queries in CP-Nets.",
            "New Approximations for Coalitional Manipulation in Scoring Rules.",
            "A Generalisation of AGM Contraction and Revision to Fragments of First-Order Logic.",
            "Multi-scale Hierarchical Residual Network for Dense Captioning.",
            "Cost-Based Goal Recognition in Navigational Domains.",
            "Viewpoint: Human-in-the-loop Artificial Intelligence.",
            "Logical Foundations of Linked Data Anonymisation.",
            "Iterative Local Voting for Collective Decision-making in Continuous Spaces.",
            "Level-0 Models for Predicting Human Behavior in Games.",
            "A Sampling Approach for Proactive Project Scheduling under Generalized Time-dependent Workability Uncertainty.",
            "Revisiting CFR+ and Alternating Updates.",
            "Dynamic Controllability of Controllable Conditional Temporal Problems with Uncertainty.",
            "Implicitly Coordinated Multi-Agent Path Finding under Destination Uncertainty: Success Guarantees and Computational Complexity.",
            "AI Generality and Spearman's Law of Diminishing Returns.",
            "Computing and Explaining Query Answers over Inconsistent DL-Lite Knowledge Bases.",
            "A Survey on Transfer Learning for Multiagent Reinforcement Learning Systems.",
            "Distributed Gibbs: A Linear-Space Sampling-Based DCOP Algorithm.",
            "Polynomial and Exponential Bounded Logic Programs with Function Symbols: Some New Decidable Classes.",
            "Modeling and Planning with Macro-Actions in Decentralized POMDPs.",
            "Pitfalls and Best Practices in Algorithm Configuration.",
            "Negotiable Votes.",
            "Conditional Simple Temporal Networks with Uncertainty and Resources.",
            "Using Collective Behavior of Coupled Oscillators for Solving DCOP.",
            "On Overfitting and Asymptotic Bias in Batch Reinforcement Learning with Partial Observability.",
            "A Coupled Operational Semantics for Goals and Commitments.",
            "REBA: A Refinement-Based Architecture for Knowledge Representation and Reasoning in Robotics.",
            "Dependency Learning for QBF.",
            "Goal Recognition Design in Deterministic Environments.",
            "Probabilistic Planning with Reduced Models.",
            "Point-Based Value Iteration for Finite-Horizon POMDPs.",
            "Strong Stubborn Set Pruning for Star-Topology Decoupled State Space Search.",
            "Weighted Matching Markets with Budget Constraints.",
            "OptStream: Releasing Time Series Privately.",
            "IKBT: Solving Symbolic Inverse Kinematics with Behavior Tree.",
            "Unifying System Health Management and Automated Decision Making.",
            "Autonomous Target Search with Multiple Coordinated UAVs.",
            "A Survey of Cross-lingual Word Embedding Models.",
            "Computing Multi-Modal Journey Plans under Uncertainty.",
            "Automatic Language Identification in Texts: A Survey.",
            "The Mathematics of Changing One's Mind, via Jeffrey's or via Pearl's Update Rule.",
            "Solving the Torpedo Scheduling Problem.",
            "Xeggora: Exploiting Immune-to-Evidence Symmetries with Full Aggregation in Statistical Relational Models.",
            "Recognizing Top-Monotonic Preference Profiles in Polynomial Time.",
            "Pattern-Based Approach to the Workflow Satisfiability Problem with User-Independent Constraints.",
            "From Support Propagation to Belief Propagation in Constraint Programming.",
            "Multi-fidelity Gaussian Process Bandit Optimisation.",
            "Timed ATL: Forget Memory, Just Count.",
            "Context Vectors are Reflections of Word Vectors in Half the Dimensions.",
            "What is this Article about? Extreme Summarization with Topic-aware Convolutional Neural Networks.",
            "Formulas Free From Inconsistency: An Atom-Centric Characterization in Priest's Minimally Inconsistent LP.",
            "Type-aware Convolutional Neural Networks for Slot Filling.",
            "A Survey on Temporal Reasoning for Temporal Information Extraction from Text.",
            "DSTL: Solution to Limitation of Small Corpus in Speech Emotion Recognition.",
            "Revisiting Counting Solutions for the Global Cardinality Constraint.",
            "Community Structure in Industrial SAT Instances.",
            "Multi-agent Inverse Reinforcement Learning for Certain General-sum Stochastic Games.",
            "Synthesizing Argumentation Frameworks from Examples.",
            "Acceptable Planning: Influencing Individual Behavior to Reduce Transportation Energy Expenditure of a City.",
            "Variable Elimination in Binary CSPs.",
            "On Non-Cooperativeness in Social Distance Games.",
            "On the Time and Space Complexity of Genetic Programming for Evolving Boolean Conjunctions.",
            "Embedding Projection for Targeted Cross-lingual Sentiment: Model Comparisons and a Real-World Study.",
            "Interpretable Charge Prediction for Criminal Cases with Dynamic Rationale Attention.",
            "Full Characterization of Parikh's Relevance-Sensitive Axiom for Belief Revision.",
            "Enhancing Statement Evaluation in Argumentation via Multi-labelling Systems.",
            "Deep Dialog Act Recognition using Multiple Token, Segment, and Context Information Representations.",
            "General Game Playing with Imperfect Information.",
            "Classifying Inconsistency Measures Using Graphs.",
            "A Semantic Characterization ASP Base Revision.",
            "Strategic Abstention based on Preference Extensions: Positive Results and Computer-Generated Impossibilities.",
            "Approximating Weighted and Priced Bribery in Scoring Rules.",
            "If Nothing Is Accepted - Repairing Argumentation Frameworks.",
            "Preference Orders on Families of Sets - When Can Impossibility Results Be Avoided?"
        ]
    },
    {
        "name": "JAIR",
        "year": "2018",
        "info": "2018: Volumes\n61,\n62,\n63",
        "count": 69,
        "papers": [
            "Learning Explanatory Rules from Noisy Data.",
            "Survey of the State of the Art in Natural Language Generation: Core tasks, applications and evaluation.",
            "Bisimulations on Data Graphs.",
            "From Skills to Symbols: Learning Symbolic Representations for Abstract High-Level Planning.",
            "Linear Satisfiability Preserving Assignments.",
            "KABouM: Knowledge-Level Action and Bounding Geometry Motion Planner.",
            "Actively Estimating Crowd Annotation Consensus.",
            "Cycles and Intractability in a Large Class of Aggregation Rules.",
            "Coordinating Measurements in Uncertain Participatory Sensing Settings.",
            "Fact-Alternating Mutex Groups for Classical Planning.",
            "Revisiting the Arcade Learning Environment: Evaluation Protocols and Open Problems for General Agents.",
            "On the Behavior of Convolutional Nets for Feature Extraction.",
            "Fully Observable Non-deterministic Planning as Assumption-Based Reactive Synthesis.",
            "Distributed Constraint Optimization Problems and Applications: A Survey.",
            "Trust as a Precursor to Belief Revision.",
            "When Subgraph Isomorphism is Really Hard, and Why This Matters for Graph Databases.",
            "Rademacher Complexity Bounds for a Penalized Multi-class Semi-supervised Algorithm.",
            "Symbol Grounding Association in Multimodal Sequences with Missing Elements.",
            "Belief Update within Propositional Fragments.",
            "Corpus-Level Fine-Grained Entity Typing.",
            "SMOTE for Learning from Imbalanced Data: Progress and Challenges, Marking the 15-year Anniversary.",
            "Visualisation and 'Diagnostic Classifiers' Reveal How Recurrent and Recursive Neural Networks Process Hierarchical Structure.",
            "Pre-Wiring and Pre-Training: What Does a Neural Network Need to Learn Truly General Identity Rules?",
            "From Feature To Paradigm: Deep Learning In Machine Translation.",
            "An Exhaustive DPLL Algorithm for Model Counting.",
            "Axiomatic Characterization of Game-Theoretic Centrality.",
            "Lifted Relational Neural Networks: Efficient Learning of Latent Relational Structures.",
            "Verification of Distributed Epistemic Gossip Protocols.",
            "A COP Model For Graph-Constrained Coalition Formation.",
            "Resource-bounded Norm Monitoring In Multi-agent Systems.",
            "MCTS-Minimax Hybrids with State Evaluations.",
            "Solving Large Problems with Heuristic Search: General-Purpose Parallel External-Memory Search.",
            "Viewpoint: Artificial Intelligence Government (Gov. 3.0): The UAE Leading Model.",
            "Solving Multi-agent Path Finding on Strongly Biconnected Digraphs.",
            "Nash Stable Outcomes in Fractional Hedonic Games: Existence, Efficiency and Computation.",
            "Extending Classical Planning with State Constraints: Heuristics and Search for Optimal Planning.",
            "Incentive-Compatible Mechanisms for Norm Monitoring in Open Multi-Agent Systems.",
            "The Power of Verification for Greedy Mechanism Design.",
            "Column Generation Algorithms for Constrained POMDPs.",
            "Counterexample-Guided Cartesian Abstraction Refinement for Classical Planning.",
            "ScottyActivity: Mixed Discrete-Continuous Planning with Convex Optimization.",
            "Exploiting Partial Assignments for Efficient Evaluation of Answer Set Programs with External Source Access.",
            "Viewpoint: When Will AI Exceed Human Performance? Evidence from AI Experts.",
            "Computing Hierarchical Finite State Controllers With Classical Planning.",
            "A Review of Inference Algorithms for Hybrid Bayesian Networks.",
            "Querying Log Data with Metric Temporal Logic.",
            "Human-Machine Collaborative Optimization via Apprenticeship Scheduling.",
            "A Core Method for the Weak Completion Semantics with Skeptical Abduction.",
            "Belief Integration and Source Reliability Assessment.",
            "Efficient Computation of Semivalues for Game-Theoretic Network Centrality.",
            "Query Answering with Transitive and Linear-Ordered Data.",
            "Revisiting the Approximation Bound for Stochastic Submodular Cover.",
            "Watching and Acting Together: Concurrent Plan Recognition and Adaptation for Human-Robot Teams.",
            "Cooperative, Dynamics-based, and Abstraction-Guided Multi-robot Motion Planning.",
            "Robust Text Classification under Confounding Shift.",
            "Graphical Model Market Maker for Combinatorial Prediction Markets.",
            "Proximal Gradient Temporal Difference Learning: Stable Reinforcement Learning with Polynomial Sample Complexity.",
            "Approximation and Parameterized Complexity of Minimax Approval Voting.",
            "A Complexity Approach for Core-Selecting Exchange under Conditionally Lexicographic Preferences.",
            "LTL on Finite and Process Traces: Complexity Results and a Practical Reasoner.",
            "Consequence-Based Reasoning for Description Logics with Disjunctions and Number Restrictions.",
            "Data-driven Conceptual Spaces: Creating Semantic Representations For Linguistic Descriptions Of Numerical Data.",
            "From Word To Sense Embeddings: A Survey on Vector Representations of Meaning.",
            "State-Space Abstractions for Probabilistic Inference: A Systematic Review.",
            "Grounding Language for Transfer in Deep Reinforcement Learning.",
            "AND/OR Search for Marginal MAP.",
            "Transition-Based Neural Word Segmentation Using Word-Level Features.",
            "Optimal Torpedo Scheduling.",
            "Bounds on the Cost of Stabilizing a Cooperative Game."
        ]
    },
    {
        "name": "JAIR",
        "year": "2017",
        "info": "2017: Volumes\n58,\n59,\n60",
        "count": 68,
        "papers": [
            "Probabilistic Description Logics for Subjective Uncertainty.",
            "Tie-Breaking Strategies for Cost-Optimal Best First Search.",
            "Subset Selection Via Implicit Utilitarian Voting.",
            "Controlled School Choice with Soft Bounds and Overlapping Types.",
            "Bayesian Network Structure Learning with Integer Programming: Polytopes, Facets and Complexity.",
            "DESPOT: Online POMDP Planning with Regularization.",
            "Local Search for Minimum Weight Dominating Set with Two-Level Configuration Checking and Frequency Based Scoring Function.",
            "Computational Aspects of Nearly Single-Peaked Electorates.",
            "A Model-Theoretic View on Qualitative Constraint Reasoning.",
            "Dynamic Repositioning to Reduce Lost Demand in Bike Sharing Systems.",
            "The Computational Complexity of Structure-Based Causality.",
            "New Canonical Representations by Augmenting OBDDs with Conjunctive Decomposition.",
            "Robots in Retirement Homes: Applying Off-the-Shelf Planning and Scheduling to a Team of Assistive Robots.",
            "Explicit Document Modeling through Weighted Multiple-Instance Learning.",
            "A Probabilistic Formalization of the Appraisal for the OCC Event-Based Emotions.",
            "Combinatorial Multi-armed Bandits for Real-Time Strategy Games.",
            "A Neural Probabilistic Structured-Prediction Method for Transition-Based Natural Language Processing.",
            "Managing Different Sources of Uncertainty in a BDI Framework in a Principled Way with Tractable Fragments.",
            "Some Properties of Batch Value of Information in the Selection Problem.",
            "Randomized Social Choice Functions Under Metric Preferences.",
            "Improving the Efficiency of Dynamic Programming on Tree Decompositions via Machine Learning.",
            "Logics of Common Ground.",
            "Encoding Domain Transitions for Constraint-Based Planning.",
            "Indirect Causes in Dynamic Bayesian Networks Revisited.",
            "The Price of Anarchy in Auctions.",
            "Learning Discrete Bayesian Networks from Continuous Data.",
            "Parliamentary Voting Procedures: Agenda Control, Manipulation, and Uncertainty.",
            "Market Interfaces for Electric Vehicle Charging.",
            "Sampling Based Approaches for Minimizing Regret in Uncertain Markov Decision Processes (MDPs).",
            "Adopting the Cascade Model in Ad Auctions: Efficiency Bounds and Truthful Algorithmic Mechanisms.",
            "Privacy Preserving Implementation of the Max-Sum Algorithm and its Variants.",
            "AND/OR Branch-and-Bound on a Computational Grid.",
            "Game-Theoretic Question Selection for Tests.",
            "Finding A Small Vertex Cover in Massive Sparse Graphs: Construct, Local Search, and Preprocess.",
            "Perturbation Training for Human-Robot Teams.",
            "The Length of Shortest Vertex Paths in Binary Occupancy Grids Compared to Shortest r-Constrained Ones.",
            "Probabilistic Reasoning with Abstract Argumentation Frameworks.",
            "Welfare Effects of Market Making in Continuous Double Auctions.",
            "Logical Formalizations of Commonsense Reasoning: A Survey.",
            "Decision-Theoretic Planning Under Anonymity in Agent Populations.",
            "Uniform Random Generation and Dominance Testing for CP-Nets.",
            "Complexity of n-Queens Completion.",
            "Complexity Results and Algorithms for Extension Enforcement in Abstract Argumentation.",
            "The Sixth Answer Set Programming Competition.",
            "Kernel Contraction and Base Dependence.",
            "Rationalisation of Profiles of Abstract Argumentation Frameworks: Characterisation and Complexity.",
            "Combining Lexical and Syntactic Features for Detecting Content-Dense Texts in News.",
            "On the Semantics and Complexity of Probabilistic Logic Programs.",
            "The Linear Programming Approach to Reach-Avoid Problems for Markov Decision Processes.",
            "Residual-Guided Look-Ahead in AND/OR Search for Graphical Models.",
            "Preference-Based Inconsistency Management in Multi-Context Systems.",
            "Resolving Over-Constrained Temporal Problems with Uncertainty through Conflict-Directed Relaxation.",
            "On Hash-Based Work Distribution Methods for Parallel Best-First Search.",
            "A Survey on Lexical Simpli cation.",
            "Time and Space Bounds for Planning.",
            "Multi-Organ Exchange.",
            "Viewpoint: A Critical View on Smart Cities and AI.",
            "Chamberlin-Courant Rule with Approval Ballots: Approximating the MaxCover Problem with Bounded Frequencies in FPT Time.",
            "Sample-Based Tree Search with Fixed and Adaptive State Abstractions.",
            "On the Equivalence between Assumption-Based Argumentation and Logic Programming.",
            "Prime Implicate Generation in Equational Logic.",
            "On Monte Carlo Tree Search and Reinforcement Learning.",
            "Elections with Few Voters: Candidate Control Can Be Easy.",
            "Learning Neural Audio Embeddings for Grounding Semantics in Auditory Perception.",
            "Confidence Decision Trees via Online and Active Learning for Streaming Data.",
            "Axiomatising Incomplete Preferences through Sets of Desirable Gambles.",
            "A Game Theoretic Analysis of the Adversarial Retrieval Setting.",
            "A Knowledge Level Account of Forgetting."
        ]
    },
    {
        "name": "JAIR",
        "year": "2016",
        "info": "2016: Volumes\n55,\n56,\n57",
        "count": 65,
        "papers": [
            "Introduction to the Special Issue on Cross-Language Algorithms and Applications.",
            "Integrating Rules and Dictionaries from Shallow-Transfer Machine Translation into Phrase-Based Statistical Machine Translation.",
            "Cross-Lingual Bridges with Models of Lexical Borrowing.",
            "How Translation Alters Sentiment.",
            "Distributional Correspondence Indexing for Cross-Lingual and Cross-Domain Sentiment Classification.",
            "Effectiveness of Automatic Translations for Cross-Lingual Ontology Mapping.",
            "Synthetic Treebanking for Cross-Lingual Dependency Parsing.",
            "Utilisation of Metadata Fields and Query Expansion in Cross-Lingual Search of User-Generated Internet Video.",
            "News Across Languages - Cross-Lingual Document Similarity and Event Tracking.",
            "Adaptive Contract Design for Crowdsourcing Markets: Bandit Algorithms for Repeated Principal-Agent Problems.",
            "Bayesian Optimization in a Billion Dimensions via Random Embeddings.",
            "Predicting Twitter User Demographics using Distant Supervision from Website Traffic Data.",
            "Automatic Description Generation from Images: A Survey of Models, Datasets, and Evaluation Measures.",
            "Optimally Solving Dec-POMDPs as Continuous-State MDPs.",
            "Module Extraction in Expressive Ontology Languages via Datalog Reasoning.",
            "Finding Strategyproof Social Choice Functions via SAT Solving.",
            "Large-Scale Election Campaigns: Combinatorial Shift Bribery.",
            "Exact Algorithms for MRE Inference.",
            "Quadratization and Roof Duality of Markov Logic Networks.",
            "Combining Two and Three-Way Embedding Models for Link Prediction in Knowledge Bases.",
            "Knowledge Representation in Probabilistic Spatio-Temporal Knowledge Bases.",
            "An Exact Algorithm Based on MaxSAT Reasoning for the Maximum Weight Clique Problem.",
            "Parallel Model-Based Diagnosis on Multi-Core Computers.",
            "Searching for the M Best Solutions in Graphical Models.",
            "Bilingual Distributed Word Representations from Document-Aligned Comparable Data.",
            "A Distributed Representation-Based Framework for Cross-Lingual Transfer Parsing.",
            "Semi-supervised Learning with Induced Word Senses for State of the Art Word Sense Disambiguation.",
            "Learning Concept Graphs from Online Educational Data.",
            "Semantic Visualization with Neighborhood Graph Regularization.",
            "Exploiting Causality for Selective Belief Filtering in Dynamic Bayesian Networks.",
            "Query and Predicate Emptiness in Ontology-Based Data Access.",
            "Automatic Wordnet Development for Low-Resource Languages using Cross-Lingual WSD.",
            "Optimal Any-Angle Pathfinding In Practice.",
            "Budgeted Optimization with Constrained Experiments.",
            "Global Continuous Optimization with Error Bound and Fast Convergence.",
            "Two Aspects of Relevance in Structured Argumentation: Minimality and Paraconsistency.",
            "Association Discovery and Diagnosis of Alzheimer's Disease with Bayesian Multiview Learning.",
            "Combining the Delete Relaxation with Critical-Path Heuristics: A Direct Characterization.",
            "DL-Lite Contraction and Revision.",
            "Generating Models of a Matched Formula With a Polynomial Delay.",
            "On the Satisfiability Problem for SPARQL Patterns.",
            "Efficient Mechanism Design for Online Scheduling.",
            "Computing Repairs of Inconsistent DL-Programs over EL Ontologies.",
            "Time-Sensitive Bayesian Information Aggregation for Crowdsourcing Systems.",
            "Time-Bounded Best-First Search for Reversible and Non-reversible Search Graphs.",
            "A Study of Proxies for Shapley Allocations of Transport Costs.",
            "Datalog+- Ontology Consolidation.",
            "The IBaCoP Planning System: Instance-Based Configured Portfolios.",
            "Qualitative Spatial Logics for Buffered Geometries.",
            "Learning Continuous Time Bayesian Networks in Non-stationary Domains.",
            "PDT Logic: A Probabilistic Doxastic Temporal Logic for Reasoning about Beliefs in Multi-agent Systems.",
            "Optimal Partial-Order Plan Relaxation via MaxSAT.",
            "Lightweight Random Indexing for Polylingual Text Classification.",
            "Multi-objective Reinforcement Learning through Continuous Pareto Manifold Approximation.",
            "Goal Probability Analysis in Probabilistic Planning: Exploring and Enhancing the State of the Art.",
            "Effective Heuristics for Suboptimal Best-First Search.",
            "Scrubbing During Learning In Real-time Heuristic Search.",
            "A Primer on Neural Network Models for Natural Language Processing.",
            "Embarrassingly Parallel Search in Constraint Programming.",
            "ProMoca: Probabilistic Modeling and Analysis of Agents in Commitment Protocols.",
            "A Survey of Computational Treatments of Biomolecules by Robotics-Inspired Methods Modeling Equilibrium Structure and Dynamic.",
            "Convergence of Iterative Scoring Rules.",
            "ZERO++: Harnessing the Power of Zero Appearances to Detect Anomalies in Large-Scale Data Sets.",
            "P-SyncBB: A Privacy Preserving Branch and Bound DCOP Algorithm.",
            "A Disaster Response System based on Human-Agent Collectives."
        ]
    },
    {
        "name": "JAIR",
        "year": "2015",
        "info": "2015: Volumes 52,\n53,\n54",
        "count": 48,
        "papers": [
            "Coherent Predictive Inference under Exchangeability with Imprecise Probabilities.",
            "Deterministic Oversubscription Planning as Heuristic Search: Abstractions and Reformulations.",
            "Agnostic Pointwise-Competitive Selective Classification.",
            "On the Subexponential-Time Complexity of CSP.",
            "Lazy Model Expansion: Interleaving Grounding with Search.",
            "Revision by History.",
            "Scheduling Conservation Designs for Maximum Flexibility via Network Cascade Optimization.",
            "Inferring Team Task Plans from Human Meetings: A Generative Modeling Approach with Logic-Based Prior.",
            "Computing Convex Coverage Sets for Faster Multi-objective Coordination.",
            "Modeling the Lifespan of Discourse Entities with Application to Coreference Resolution.",
            "A Case-Based Reasoning Framework to Choose Trust Models for Different E-Marketplace Environments.",
            "Weighted Electoral Control.",
            "Distributed Evaluation of Nonmonotonic Multi-context Systems.",
            "A Compositional Framework for Grounding Language Inference, Generation, and Acquisition in Video.",
            "Coactive Learning.",
            "Learning Relational Event Models from Video.",
            "The Ceteris Paribus Structure of Logics of Game Forms.",
            "Clause Elimination for SAT and QSAT.",
            "Using Machine Translation to Provide Target-Language Edit Hints in Computer Aided Translation Based on Translation Memories.",
            "Probabilistic Inference Techniques for Scalable Multiagent Decision Making.",
            "Model Theory of XPath on Data Trees. Part I: Bisimulation and Characterization.",
            "Regular Path Queries in Lightweight Description Logics: Complexity and Algorithms.",
            "Approximate Value Iteration with Temporally Extended Actions.",
            "Bypassing Combinatorial Protections: Polynomial-Time Algorithms for Single-Peaked Electorates.",
            "Satsisfiability and Systematicity.",
            "ITSAT: An Efficient SAT-Based Temporal Planner.",
            "Placement of Loading Stations for Electric Vehicles: No Detours Necessary!",
            "Evolutionary Dynamics of Multi-Agent Learning: A Survey.",
            "Tree-Width and the Computational Complexity of MAP Approximations in Bayesian Networks.",
            "Mechanisms for Multi-unit Combinatorial Auctions with a Few Distinct Goods.",
            "AutoFolio: An Automatically Configured Algorithm Selector.",
            "Belief Change with Uncertain Action Histories.",
            "Knowledge-Based Textual Inference via Parse-Tree Transformations.",
            "Solving #SAT and MAXSAT by Dynamic Programming.",
            "Word vs. Class-Based Word Sense Disambiguation.",
            "Achieving Goals Quickly Using Real-time Search: Experimental Results in Video Games.",
            "Leveraging Online User Feedback to Improve Statistical Machine Translation.",
            "Expressiveness of Two-Valued Semantics for Abstract Dialectical Frameworks.",
            "Decision Making with Dynamic Uncertain Events.",
            "Relations Between Spatial Calculi About Directions and Orientations.",
            "PAGOdA: Pay-As-You-Go Ontology Query Answering Using a Datalog Reasoner.",
            "Continuing Plan Quality Optimisation.",
            "Constraining Information Sharing to Improve Cooperative Information Gathering.",
            "Weighted Regret-Based Likelihood: A New Approach to Describing Uncertainty.",
            "Possible and Necessary Winners of Partial Tournaments.",
            "Pay-As-You-Go Description Logic Reasoning by Coupling Tableau and Saturation Procedures.",
            "Compressing Optimal Paths with Run Length Encoding.",
            "On a Practical, Integer-Linear Programming Model for Delete-Free Tasks and its Use as a Heuristic for Cost-Optimal Planning."
        ]
    },
    {
        "name": "JAIR",
        "year": "2014",
        "info": "2014: Volumes 49,\n50,\n51",
        "count": 68,
        "papers": [
            "Multimodal Distributional Semantics.",
            "Robustness and Stability in Constraint Programming under Dynamism and Uncertainty.",
            "Closure and Consistency In Logic-Associated Argumentation.",
            "Towards Minimizing Disappointment in Repeated Games.",
            "A Procedural Characterization of Solution Concepts in Games.",
            "Representing and Reasoning About the Rules of General Games With Imperfect Information.",
            "Selfishness Level of Strategic Games.",
            "An Empirical Evaluation of Ranking Measures With Respect to Robustness to Noise.",
            "Efficient HEX-Program Evaluation Based on Unfounded Sets.",
            "Symmetric Subgame-Perfect Equilibria in Resource Allocation.",
            "Multiagent Only Knowing in Dynamic Systems.",
            "Mechanisms for Fair Allocation Problems: No-Punishment Payment Rules in Verifiable Settings.",
            "Text-Based Twitter User Geolocation Prediction.",
            "Information-Theoretic Multi-view Domain Adaptation: A Theoretical and Empirical Study.",
            "Large-Scale Optimization for Evaluation Functions with Minimax Search.",
            "Inapproximability of Treewidth and Related Problems.",
            "Algorithms and Applications for the Same-Decision Probability.",
            "Algorithms for Argumentation Semantics: Labeling Attacks as a Generalization of Labeling Arguments.",
            "Improved Separations of Regular Resolution from Clause Learning Proof Systems.",
            "Convergence of a Q-learning Variant for Continuous States and Actions.",
            "Comparative Evaluation of Link-Based Approaches for Candidate Ranking in Link-to-Wikipedia Systems.",
            "Topic-Based Dissimilarity and Sensitivity Models for Translation Rule Selection.",
            "Knowledge Forgetting in Answer Set Programming.",
            "A Decision-Theoretic Model of Assistance.",
            "Finding Optimal Solutions for Voting Game Design Problems.",
            "Enhanced Partial Expansion A.",
            "An Efficient Algorithm for Estimating State Sequences in Imprecise Hidden Markov Models.",
            "Reconnection with the Ideal Tree: A New Approach to Real-Time Search.",
            "Property Directed Reachability for Automated Planning.",
            "Game-Theoretic Patrolling with Dynamic Execution Uncertainty and a Case Study on a Real Transit System.",
            "HC-Search: A Learning Framework for Search-based Structured Prediction.",
            "A Multivariate Complexity Analysis of Lobbying in Multiple Referenda.",
            "Monotone Temporal Planning: Tractability, Extensions and Applications.",
            "Improving Delete Relaxation Heuristics Through Explicitly Represented Conjunctions.",
            "Integrating Queueing Theory and Scheduling for Dynamic Scheduling Problems.",
            "False-Name Manipulation in Weighted Voting Games is Hard for Probabilistic Polynomial Time.",
            "Probabilistic Inference in Credal Networks: New Complexity Results.",
            "Planning through Automatic Portfolio Configuration: The PbP Approach.",
            "MDD Propagation for Sequence Constraints.",
            "Sentiment Analysis of Short Informal Texts.",
            "Policy Iteration Based on Stochastic Factorization.",
            "Speeding Up Iterative Ontology Alignment using Block-Coordinate Descent.",
            "Arbitration and Stability in Cooperative Games with Overlapping Coalitions.",
            "Demand Side Energy Management via Multiagent Coordination in Consumer Cooperatives.",
            "Belief Tracking for Planning with Sensing: Width, Complexity and Approximations.",
            "Cooperative Monitoring to Diagnose Multiagent Plans.",
            "On the Testability of BDI Agent Systems.",
            "Text Rewriting Improves Semantic Role Labeling.",
            "Simple Regret Optimization in Online Planning for Markov Decision Processes.",
            "Sensitivity of Diffusion Dynamics to Network Uncertainty.",
            "Entrenchment-Based Horn Contraction.",
            "Automaton Plans.",
            "Distributed Heuristic Forward Search for Multi-agent Planning.",
            "Verification of Agent-Based Artifact Systems.",
            "A Novel SAT-Based Approach to Model Based Diagnosis.",
            "Scoring Functions Based on Second Level Score for k-SAT with Long Clauses.",
            "Push and Rotate: a Complete Multi-agent Pathfinding Algorithm.",
            "Reasoning about Topological and Cardinal Direction Relations Between 2-Dimensional Spatial Objects.",
            "Optimal Scheduling of Contract Algorithms for Anytime Problem-Solving.",
            "Iterative Plan Construction for the Workflow Satisfiability Problem.",
            "No Agent Left Behind: Dynamic Fair Division of Multiple Resources.",
            "Using Meta-mining to Support Data Mining Workflow Planning and Optimization.",
            "The Complexity of Answering Conjunctive and Navigational Queries over OWL 2 EL Knowledge Bases.",
            "On Minimum Representations of Matched Formulas.",
            "Tutorial on Structured Continuous-Time Markov Processes.",
            "BDD Ordering Heuristics for Classical Planning.",
            "A Hidden Markov Model-Based Acoustic Cicada Detector for Crowdsourced Smartphone Biodiversity Monitoring.",
            "An Exact Double-Oracle Algorithm for Zero-Sum Extensive-Form Games with Imperfect Information."
        ]
    },
    {
        "name": "JAIR",
        "year": "2013",
        "info": "2013: Volumes 46,\n47,\n48",
        "count": 61,
        "papers": [
            "Short and Long Supports for Constraint Propagation.",
            "Optimal Rectangle Packing: An Absolute Placement Approach.",
            "Automatic Aggregation by Joint Modeling of Aspects and Values.",
            "Undominated Groves Mechanisms.",
            "Generating Extractive Summaries of Scientific Paradigms.",
            "Integrative Semantic Dependency Parsing via Efficient Large-scale Feature Selection.",
            "Toward Supervised Anomaly Detection.",
            "Parameterized Complexity Results for Exact Bayesian Network Structure Learning.",
            "Boolean Equi-propagation for Concise and Efficient SAT Encodings of Combinatorial Problems.",
            "A Hybrid LP-RPG Heuristic for Modelling Numeric Resource Flows in Planning.",
            "Qualitative Order of Magnitude Energy-Flow-Based Failure Modes and Effects Analysis.",
            "Incremental Clustering and Expansion for Faster Optimal Planning in Dec-POMDPs.",
            "Probabilistic Planning for Continuous Dynamic Systems under Bounded Risk.",
            "Predicting Behavior in Unstructured Bargaining with a Probability Distribution.",
            "Efficient Computation of the Shapley Value for Game-Theoretic Network Centrality.",
            "Description Logic Knowledge and Action Bases.",
            "NuMVC: An Efficient Local Search Algorithm for Minimum Vertex Cover.",
            "A Feature Subset Selection Algorithm Automatic Recommendation Method.",
            "Scheduling a Dynamic Aircraft Repair Shop with Limited Repair Resources.",
            "Identifying the Class of Maxi-Consistent Operators in Argumentation.",
            "Distributed Reasoning for Multiagent Simple Temporal Problems.",
            "A Survey on Latent Tree Models and Applications.",
            "Analysis of Watson's Strategies for Playing Jeopardy!",
            "The Arcade Learning Environment: An Evaluation Platform for General Agents.",
            "Sharing Rewards in Cooperative Connectivity Games.",
            "Learning by Observation of Agent Software Images.",
            "Strong Equivalence of Qualitative Optimization Problems.",
            "Lifted Variable Elimination: Decoupling the Operators from the Constraint Language.",
            "Decentralized Anti-coordination Through Multi-agent Learning.",
            "On the Computation of Fully Proportional Representation.",
            "Topic Segmentation and Labeling in Asynchronous Conversations.",
            "A Refined View of Causal Graphs and Component Sizes: SP-Closed Graph Classes and Beyond.",
            "Asymmetric Distributed Constraint Optimization Problems.",
            "Protecting Privacy through Distributed Computation in Multi-agent Decision Making.",
            "Heuristic Search When Time Matters.",
            "Acyclicity Notions for Existential Rules and Their Application to Query Answering in Ontologies.",
            "A Decidable Extension of SROIQ with Complex Role Chains and Unions.",
            "Framing Image Description as a Ranking Task: Data, Models and Evaluation Metrics.",
            "Natural Language Inference for Arabic Using Extended Tree Edit Distance with Subtrees.",
            "Learning Optimal Bayesian Networks: A Shortest Path Perspective.",
            "A Survey of Multi-Objective Sequential Decision-Making.",
            "Taming the Infinite Chase: Query Answering under Expressive Relational Constraints.",
            "An Online Mechanism for Multi-Unit Demand and its Application to Plug-in Hybrid Electric Vehicle Charging.",
            "Optimal Implementation of Watched Literals and More General Techniques.",
            "Optimizing SPARQL Query Answering over OWL Ontologies.",
            "A Global Model for Concept-to-Text Generation.",
            "Beth Definability in Expressive Description Logics.",
            "Defeasible Inheritance-Based Description Logics.",
            "Horn Clause Contraction Functions.",
            "AI Methods in Algorithmic Composition: A Comprehensive Survey.",
            "Protecting Moving Targets with Multiple Mobile Resources.",
            "Reasoning about Explanations for Negative Query Answers in DL-Lite.",
            "Generating Natural Language Descriptions from OWL Ontologies: the NaturalOWL System.",
            "A Case of Pathology in Multiobjective Heuristic Search.",
            "Unsupervised Sub-tree Alignment for Tree-to-Tree Translation.",
            "The Complexity of Optimal Monotonic Planning: The Bad, The Good, and The Causal Graph.",
            "Single Network Relational Transductive Learning.",
            "Scalable and Efficient Bayes-Adaptive Reinforcement Learning Based on Monte-Carlo Tree Search.",
            "Exact Query Reformulation over Databases with First-order and Description Logics Ontologies.",
            "A Smooth Transition from Powerlessness to Absolute Power.",
            "A Constraint Solver for Flexible Protein Model."
        ]
    },
    {
        "name": "JAIR",
        "year": "2012",
        "info": "2012: Volumes 43, 44, 45",
        "count": 52,
        "papers": [
            "Learning and Reasoning with Action-Related Places for Robust Mobile Manipulation.",
            "Robust Local Search for Solving RCPSP/max with Durational Uncertainty.",
            "Location-Based Reasoning about Complex Multi-Agent Behavior.",
            "The CQC Algorithm: Cycling in Graphs to Semantically Enrich and Enhance a Bilingual Dictionary.",
            "Counting-Based Search: Branching Heuristics for Constraint Satisfaction Problems.",
            "Exploiting Model Equivalences for Solving Interactive Dynamic Influence Diagrams.",
            "Consistency Techniques for Flow-Based Projection-Safe Global Cost Functions in Weighted Constraint Satisfaction.",
            "SAS+ Planning as Satisfiability.",
            "Local Consistency and SAT-Solvers.",
            "Computing All-Pairs Shortest Paths by Leveraging Low Treewidth.",
            "Generalized Biwords for Bitext Compression and Translation Spotting.",
            "Completeness Guarantees for Incomplete Ontology Reasoners: Theory and Practice.",
            "Proximity-Based Non-uniform Abstractions for Approximate Planning.",
            "Avoiding and Escaping Depressions in Real-Time Heuristic Search.",
            "Reformulating the Situation Calculus and the Event Calculus in the General Theory of Stable Models and in Answer Set Programming.",
            "A Market-Inspired Approach for Intersection Management in Urban Road Traffic Networks.",
            "Learning to Win by Reading Manuals in a Monte-Carlo Framework.",
            "COLIN: Planning with Continuous Linear Numeric Change.",
            "Solving Limited Memory Influence Diagrams.",
            "Algorithms and Limits for Compact Plan Representations.",
            "Improving Statistical Machine Translation for a Resource-Poor Language Using Related Resource-Rich Languages.",
            "Modeling Social Causality and Responsibility Judgment in Multi-Agent Interactions.",
            "Algorithms for Generating Ordered Solutions for Explicit AND/OR Structures.",
            "Plan-based Policies for Efficient Multiple Battery Load Management.",
            "Narrative Planning: Compilations to Classical Planning.",
            "Semantic Similarity Measures Applied to an Ontology for Human-Like Interaction.",
            "Modelling Observation Correlations for Active Exploration and Robust Object Detection.",
            "Tractable Triangles and Cross-Free Convexity in Discrete Optimisation.",
            "Riffled Independence for Efficient Inference with Partial Rankings.",
            "Domain and Function: A Dual-Space Model of Semantic Relations and Compositions.",
            "SAP Speaks PDDL: Exploiting a Software-Engineering Model for Planning in Business Process Management.",
            "The Logical Difference for the Lightweight Description Logic EL.",
            "Online Speedup Learning for Optimal Planning.",
            "Interactions between Knowledge and Time in a First-Order Logic for Multi-Agent Systems: Completeness Results.",
            "The Tractability of CSP Classes Defined by Forbidden Patterns.",
            "An approximative inference method for solving ∃∀SO satisfiability problems.",
            "Towards Unsupervised Learning of Temporal Relations between Events.",
            "Coalition Structure Generation over Graphs.",
            "Reasoning over Ontologies with Hidden Content: The Import-by-Query Approach.",
            "Generating Approximate Solutions to the TTP using a Linear Distance Relaxation.",
            "Removing Redundant Messages in N-ary BnB-ADOPT.",
            "A Tutorial on Dual Decomposition and Lagrangian Relaxation for Inference in Natural Language Processing.",
            "Transforming Graph Data for Statistical Relational Learning.",
            "A New Look at BDDs for Pseudo-Boolean Constraints.",
            "Complexity of Judgment Aggregation.",
            "Safe Exploration of State and Action Spaces in Reinforcement Learning.",
            "Replanning in Domains with Partial Information and Sensing Actions.",
            "Irrelevant and independent natural extension for sets of desirable gambles.",
            "Learning to Predict from Textual Data.",
            "The Time Complexity of A* with Approximate Heuristics on Multiple-Solution Search Spaces.",
            "Tractable Set Constraints.",
            "Evaluating Indirect Strategies for Chinese-Spanish Statistical Machine Translation."
        ]
    },
    {
        "name": "JAIR",
        "year": "2011",
        "info": "2011: Volumes 40, 41, 42",
        "count": 62,
        "papers": [
            "Non-Deterministic Policies in Markovian Decision Processes.",
            "A Logical Study of Partial Entailment.",
            "False-Name Manipulations in Weighted Voting Games.",
            "A Monte-Carlo AIXI Approximation.",
            "Automated Search for Impossibility Theorems in Social Choice Theory: Ranking Sets of Objects.",
            "Second-Order Consistencies.",
            "A Probabilistic Approach for Maintaining Trust Based on Evidence.",
            "Iterated Belief Change Due to Actions and Observations.",
            "Multimode Control Attacks on Elections.",
            "Clause-Learning Algorithms with Many Restarts and Bounded-Width Resolution.",
            "Evaluating Temporal Graphs Built from Texts via Transitive Reduction.",
            "On-line Planning and Scheduling: An Application to Controlling Modular Printers.",
            "Narrowing the Modeling Gap: A Cluster-Ranking Approach to Coreference Resolution.",
            "Efficient Planning under Uncertainty with Macro-actions.",
            "Multiagent Learning in Large Anonymous Games.",
            "Decidability and Undecidability Results for Propositional Schemata.",
            "The Complexity of Integer Bound Propagation.",
            "Identifying Aspects for Web-Search Queries.",
            "Computing Small Unsatisfiable Cores in Satisfiability Modulo Theories.",
            "Exploiting Structure in Weighted Model Counting Approaches to Probabilistic Inference.",
            "Scaling up Heuristic Planning with Relational Decision Trees.",
            "Regression Conformal Prediction with Nearest Neighbours.",
            "Properties of Bethe Free Energies and Message Passing in Gaussian Models.",
            "Determining Possible and Necessary Winners Given Partial Orders.",
            "Value of Information Lattice: Exploiting Probabilistic Independence for Effective Feature Subset Acquisition.",
            "Soft Constraints of Difference and Equality.",
            "Redistribution Mechanisms for Assignment of Heterogeneous Objects.",
            "Analyzing Search Topology Without Running Any Search: On the Connection Between Causal Graphs and h+.",
            "Probabilistic Relational Planning with First Order Decision Diagrams.",
            "From \"Identical\" to \"Similar\": Fusing Retrieved Lists Based on Inter-Document Similarities.",
            "Stackelberg vs. Nash in Security Games: An Extended Investigation of Interchangeability, Equivalence, and Uniqueness.",
            "Sequential Diagnosis by Abstraction.",
            "The Opposite of Smoothing: A Language Model Approach to Ranking Query-Specific Document Clusters.",
            "Policy Invariance under Reward Transformations for General-Sum Stochastic Games.",
            "Efficient Multi-Start Strategies for Local Search Algorithms.",
            "On the Intertranslatability of Argumentation Semantics.",
            "A Probabilistic Framework for Learning Kinematic Models of Articulated Objects.",
            "Controlling Complexity in Part-of-Speech Induction.",
            "Where Are the Hard Manipulation Problems?",
            "On the Link between Partial Meet, Kernel, and Infra Contraction and its Application to Horn Logic.",
            "MAPP: a Scalable Multi-Agent Path Planning Algorithm with Tractability and Completeness Guarantees.",
            "Scheduling Bipartite Tournaments to Minimize Total Travel Distance.",
            "First-Order Stable Model Semantics and First-Order Loop Formulas.",
            "Topological Value Iteration Algorithms.",
            "Representing and Reasoning with Qualitative Preferences for Compositional Systems.",
            "Centrality-as-Relevance: Support Sets and Similarity as Geometric Proximity.",
            "Most Relevant Explanation in Bayesian Networks.",
            "Learning to Make Predictions In Partially Observable Environments Without a Generative Model.",
            "Making Decisions Using Sets of Probabilities: Updating, Time Consistency, and Calibration.",
            "Adaptive Submodularity: Theory and Applications in Active Learning and Stochastic Optimization.",
            "Unfounded Sets and Well-Founded Semantics of Answer Set Programs with Aggregates.",
            "Cloning in Elections: Finding the Possible Winners.",
            "Computing Approximate Nash Equilibria and Robust Best-Responses Using Sampling.",
            "Drake: An Efficient Executive for Temporal Plans with Choice.",
            "Finding Consensus Bayesian Network Structures.",
            "Combining Evaluation Metrics via the Unanimous Improvement Ratio and its Application to Clustering Tasks.",
            "Defeasible Inclusions in Low-Complexity DLs.",
            "Theoretical and Practical Foundations of Large-Scale Agent-Based Micro-Storage in the Smart Grid.",
            "Stochastic Enforced Hill-Climbing.",
            "Dr.Fill: Crosswords and an Implemented Solver for Singly Weighted CSPs.",
            "Multi-Robot Adversarial Patrolling: Facing a Full-Knowledge Opponent.",
            "Interpolable Formulas in Equilibrium Logic and Answer Set Programming."
        ]
    },
    {
        "name": "JAIR",
        "year": "2010",
        "info": "2010: Volumes 37, 38, 39",
        "count": 46,
        "papers": [
            "Text Relatedness Based on a Word Thesaurus.",
            "Predicting the Performance of IDA* using Conditional Distributions.",
            "Mechanisms for Multi-Unit Auctions.",
            "Interactive Cost Configuration Over Decision Diagrams.",
            "From Frequency to Meaning: Vector Space Models of Semantics.",
            "On Action Theory Change.",
            "Context-based Word Acquisition for Situated Dialogue in a Virtual World.",
            "Join-Graph Propagation Algorithms.",
            "An Investigation into Mathematical Programming for Finite Horizon Decentralized POMDPs.",
            "Training a Multilingual Sportscaster: Using Perceptual Context to Learn Language.",
            "Reasoning About the Transfer of Control.",
            "Multiattribute Auctions Based on Generalized Additive Independence.",
            "Using Local Alignments for Relation Recognition.",
            "Change in Abstract Argumentation Frameworks: Adding an Argument.",
            "BnB-ADOPT: An Asynchronous Branch-and-Bound DCOP Algorithm.",
            "A Survey of Paraphrasing and Textual Entailment Methods.",
            "Constructing Reference Sets from Unstructured, Ungrammatical Text.",
            "Grounding FO and FO(ID) with Bounds.",
            "Developing Approaches for Solving a Telecommunications Feature Subscription Problem.",
            "Fast Set Bounds Propagation Using a BDD-SAT Hybrid.",
            "Mixed Strategies in Combinatorial Agency.",
            "Approximate Model-Based Diagnosis Using Greedy Stochastic Search.",
            "Resource-Driven Mission-Phasing Techniques for Constrained Agents in Stochastic Environments.",
            "A Minimum Relative Entropy Principle for Learning and Acting.",
            "Algorithms for Closed Under Rational Behavior (CURB) Sets.",
            "Logical Foundations of RDF(S) with Datatypes.",
            "Cause Identification from Aviation Safety Incident Reports via Weakly Supervised Semantic Lexicon Construction.",
            "Non-Transferable Utility Coalitional Games via Mixed-Integer Linear Constraints.",
            "Automatic Induction of Bellman-Error Features for Probabilistic Planning.",
            "Planning with Noisy Probabilistic Relational Rules.",
            "Implicit Abstraction Heuristics.",
            "The LAMA Planner: Guiding Cost-Based Anytime Planning with Landmarks.",
            "Cooperative Games with Overlapping Coalitions.",
            "Narrative Planning: Balancing Plot and Character.",
            "Case-Based Subgoaling in Real-Time Heuristic Search for Video Game Pathfinding.",
            "A Model-Based Active Testing Approach to Sequential Diagnosis.",
            "Active Tuples-based Scheme for Bounding Posterior Beliefs.",
            "A Constraint Satisfaction Framework for Executing Perceptions and Actions in Diagrammatic Reasoning.",
            "Nominals, Inverses, Counting, and Conjunctive Queries or: Why Infinity is your Friend!",
            "Kalman Temporal Differences.",
            "Theta*: Any-Angle Path Planning on Grids.",
            "Which Clustering Do You Want? Inducing Your Ideal Clustering with Minimal Feedback.",
            "A Utility-Theoretic Approach to Privacy in Online Services.",
            "An Effective Algorithm for and Phase Transitions of the Directed Hamiltonian Cycle Problem.",
            "Best-First Heuristic Search for Multicore Machines.",
            "Intrusion Detection using Continuous Time Bayesian Networks."
        ]
    },
    {
        "name": "JAIR",
        "year": "2009",
        "info": "2009: Volumes 34, 35, 36",
        "count": 52,
        "papers": [
            "Interactive Policy Learning through Confidence-Based Autonomy.",
            "A Heuristic Search Approach to Planning with Continuous Resources in Stochastic Domains.",
            "Asynchronous Forward Bounding for Distributed COPs.",
            "Policy Iteration for Decentralized Control of Markov Decision Processes.",
            "Generic Preferences over Subsets of Structured Objects.",
            "Behavior Bounding: An Efficient Method for High-Level Behavior Comparison.",
            "Mechanisms for Making Crowds Truthful.",
            "Unsupervised Methods for Determining Object and Relation Synonyms on the Web.",
            "Monte Carlo Sampling Methods for Approximating Interactive POMDPs.",
            "Identification of Pleonastic It Using the Web.",
            "Solving #SAT and Bayesian Inference with Backtracking Search.",
            "Wikipedia-based Semantic Interpretation for Natural Language Processing.",
            "Exploiting Single-Cycle Symmetries in Continuous Constraint Problems.",
            "An Anytime Algorithm for Optimal Coalition Structure Generation.",
            "Learning Document-Level Semantic Properties from Free-Text Annotations.",
            "Inferring Shallow-Transfer Machine Translation Rules from Small Parallel Corpora.",
            "Sentence Compression as Tree Transduction.",
            "Planning over Chain Causal Graphs for Variables with Domains of Size 5 Is NP-Hard.",
            "Efficient Informative Sensing using Multiple Robots.",
            "Conservative Inference Rule for Uncertain Reasoning under Incompleteness.",
            "Complex Question Answering: Unsupervised Learning Approaches and Experiments.",
            "Message-Based Web Service Composition, Integrity Constraints, and Planning under Uncertainty: A New Connection.",
            "Trust-Based Mechanisms for Robust and Efficient Task Allocation in the Presence of Execution Uncertainty.",
            "Eliciting Single-Peaked Preferences Using Comparison Queries.",
            "Transductive Rademacher Complexity and its Applications.",
            "A Bilinear Programming Approach for Multiagent Planning.",
            "Llull and Copeland Voting Computationally Resist Bribery and Constructive Control.",
            "Automated Reasoning in Modal and Description Logics via SAT Encoding: the Case Study of K(m)/ALC-Satisfiability.",
            "Learning Bayesian Network Equivalence Classes with Ant Colony Optimization.",
            "Efficient Markov Network Structure Discovery Using Independence Tests.",
            "How Hard Is Bribery in Elections?",
            "Solving Weighted Constraint Satisfaction Problems with Memetic/Exact Hybrid Algorithms.",
            "Optimal Value of Information in Graphical Models.",
            "Bounds Arc Consistency for Weighted CSPs.",
            "Compiling Uncertainty Away in Conformant Planning Problems with Bounded Width.",
            "Variable Forgetting in Reasoning about Knowledge.",
            "The Complexity of Circumscription in DLs.",
            "Enhancing QA Systems with Complex Temporal Question Processing Capabilities.",
            "Modularity Aspects of Disjunctive Stable Models.",
            "The DL-Lite Family and Relations.",
            "Prime Implicates and Prime Implicants: From Propositional to Modal Logic.",
            "Content Modeling Using Latent Permutations.",
            "Hypertableau Reasoning for Description Logics.",
            "Relaxed Survey Propagation for The Weighted Maximum Satisfiability Problem.",
            "ParamILS: An Automatic Algorithm Configuration Framework.",
            "Cross-lingual Annotation Projection for Semantic Roles.",
            "Multilingual Part-of-Speech Tagging: Two Unsupervised Approaches.",
            "Approximate Strong Equilibrium in Job Scheduling Games.",
            "Friends or Foes? On Planning as Satisfiability and Abstract CNF Encodings.",
            "The Role of Macros in Tractable Planning.",
            "RoxyBot-06: Stochastic Prediction and Optimization in TAC Travel.",
            "Soft Goals Can Be Compiled Away."
        ]
    },
    {
        "name": "JAIR",
        "year": "2008",
        "info": "2008: Volumes 31, 32, 33",
        "count": 58,
        "papers": [
            "MiniMaxSAT: An Efficient Weighted Max-SAT solver.",
            "Planning with Durative Actions in Stochastic Domains.",
            "CUI Networks: A Graphical Representation for Conditional Utility Independence.",
            "CTL Model Update for System Modifications.",
            "Conjunctive Query Answering for the Description Logic SHIQ.",
            "Sound and Complete Inference Rules for SE-Consequence.",
            "Loosely Coupled Formulations for Automated Planning: An Integer Programming Perspective.",
            "On the Expressiveness of Levesque's Normal Form.",
            "Modular Reuse of Ontologies: Theory and Practice.",
            "The Complexity of Planning Problems With Simple Causal Graphs.",
            "Gesture Salience as a Hidden Variable for Coreference Resolution and Keyframe Extraction.",
            "Global Inference for Sentence Compression: An Integer Linear Programming Approach.",
            "First Order Decision Diagrams for Relational MDPs.",
            "Axiomatic Foundations for Ranking Systems.",
            "Exploiting Subgraph Structure in Multi-Robot Path Planning.",
            "Creating Relational Data from Unstructured and Ungrammatical Data Sources.",
            "A Multiagent Approach to Autonomous Intersection Management.",
            "Cooperative Search with Concurrent Interactions.",
            "Extended RDF as a Semantic Foundation of Rule Markup Languages.",
            "Graphical Model Inference in Optimal Control of Stochastic Multi-Agent Systems.",
            "A Constraint Programming Approach for Solving a Queueing Control Problem.",
            "Communication-Based Decomposition Mechanisms for Decentralized MDPs.",
            "New Islands of Tractability of Cost-Optimal Planning.",
            "Optimal and Approximate Q-value Functions for Decentralized POMDPs.",
            "Spectrum of Variable-Random Trees.",
            "On the Qualitative Comparison of Decisions Having Positive and Negative Features.",
            "Dynamic Control in Real-Time Heuristic Search.",
            "Adaptive Stochastic Resource Control: A Machine Learning Approach.",
            "Refining the Execution of Abstract Actions with Learned Action Models.",
            "Efficiency and Envy-freeness in Fair Division of Indivisible Goods: Logical Representation and Complexity.",
            "SATzilla: Portfolio-based Algorithm Selection for SAT.",
            "A Unifying Framework for Structural Properties of CSPs: Definitions, Complexity, Tractability.",
            "A General Theory of Additive State Space Abstractions.",
            "Online Planning Algorithms for POMDPs.",
            "M-DPOP: Faithful Distributed Implementation of Efficient Social Choice Problems.",
            "Compositional Belief Update.",
            "Analogical Dissimilarity: Definition, Algorithms and Two Experiments in Machine Learning.",
            "Qualitative System Identification from Imperfect Data.",
            "Latent Tree Models and Approximate Inference in Bayesian Networks.",
            "The Ultrametric Constraint and its Application to Phylogenetics.",
            "Optimal Strategies for Simultaneous Vickrey Auctions with Perfect Substitutes.",
            "Anytime Induction of Low-cost, Low-error Classifiers: a Sampling-based Approach.",
            "ICE: An Expressive Iterative Combinatorial Exchange.",
            "On the Use of Automatically Acquired Examples for All-Nouns Word Sense Disambiguation .",
            "Networks of Influence Diagrams: A Formalism for Representing Agents' Beliefs and Decision-Making Processes.",
            "Complexity of Strategic Behavior in Multi-Winner Elections.",
            "A Rigorously Bayesian Beam Model and an Adaptive Full Scan Model for Range Finders in Dynamic Environments.",
            "Completeness and Performance Of The APO Algorithm.",
            "On Similarities between Inference in Game Theory and Machine Learning.",
            "Computational Logic Foundations of KGP Agents.",
            "Learning Partially Observable Deterministic Action Models.",
            "The Computational Complexity of Dominance and Consistency in CP-Nets.",
            "An Ordinal Bargaining Solution with Fixed-Point Property.",
            "AND/OR Multi-Valued Decision Diagrams (AOMDDs) for Graphical Models.",
            "A Multiagent Reinforcement Learning Algorithm with Non-linear Dynamics.",
            "Learning to Reach Agreement in a Continuous Ultimatum Game.",
            "On the Value of Correlation.",
            "The Latent Relation Mapping Engine: Algorithm and Experiments."
        ]
    },
    {
        "name": "JAIR",
        "year": "2007",
        "info": "2007: Volumes 28, 29, 30",
        "count": 44,
        "papers": [
            "Cutset Sampling for Bayesian Networks.",
            "The Strategy-Proofness Landscape of Merging.",
            "Generating Hard Satisfiable Formulas by Hiding Solutions Deceptively.",
            "Marvin: A Heuristic Search Planner with Online Macro-Action Learning.",
            "Junta Distributions and the Average-Case Complexity of Manipulating Elections.",
            "Proactive Algorithms for Job Shop Scheduling with Probabilistic Durations.",
            "Auctions with Severely Bounded Communication.",
            "Anytime Heuristic Search.",
            "Supporting Temporal Reasoning by Mapping Calendar Expressions to Minimal Periodic Sets.",
            "Closed-Loop Learning of Visual Control Policies.",
            "Bin Completion Algorithms for Multicontainer Packing, Knapsack, and Covering Problems.",
            "Discovering Classes of Strongly Equivalent Logic Programs.",
            "Abstract Reasoning for Planning and Coordination.",
            "Consistency and Random Constraint Satisfaction Models.",
            "Phase Transition for Random Quantified XOR-Formulas.",
            "Computationally Feasible VCG Mechanisms.",
            "Solution-Guided Multi-Point Constructive Search for Job Shop Scheduling.",
            "NP Animacy Identification for Anaphora Resolution.",
            "Combination Strategies for Semantic Role Labeling.",
            "The Generalized A* Architecture.",
            "The Language of Search.",
            "On the Formal Semantics of Speech-Act Based Communication in an Agent-Oriented Programming Language.",
            "Semantic Matchmaking as Non-Monotonic Reasoning: A Description Logic Approach.",
            "Learning Symbolic Models of Stochastic Domains.",
            "Answer Sets for Logic Programs with Arbitrary Abstract Constraint Atoms.",
            "Obtaining Reliable Feedback for Sanctioning Reputation Mechanisms.",
            "An Algebraic Graphical Model for Decision with Uncertainties, Feasibilities, and Utilities.",
            "Learning Semantic Definitions of Online Information Sources.",
            "Graph Abstraction in Real-time Heuristic Search.",
            "The Planning Spectrum - One, Two, Three, Infinity.",
            "Chain: A Dynamic Double Auction Framework for Matching Patient Agents.",
            "Knowledge Derived From Wikipedia For Computing Semantic Relatedness.",
            "Compressed Pattern Databases.",
            "Topic and Role Discovery in Social Networks with Experiments on Enron and Academic Email.",
            "Reasoning with Very Expressive Fuzzy Description Logics.",
            "New Inference Rules for Max-SAT.",
            "Natural Events.",
            "Individual and Domain Adaptation in Sentence Planning for Dialogue.",
            "Using Linguistic Cues for the Automatic Recognition of Personality in Conversation and Text.",
            "On the Semantics of Logic Programs with Preferences.",
            "A Framework for Kernel-Based Multi-Category Classification.",
            "Probabilistic Planning via Heuristic Forward Search and Weighted Model Counting.",
            "Query-time Entity Resolution.",
            "Learning to Play Using Low-Complexity Rule-Based Policies: Illustrations through Ms. Pac-Man."
        ]
    },
    {
        "name": "JAIR",
        "year": "2006",
        "info": "2006: Volumes 25, 26, 27",
        "count": 45,
        "papers": [
            "Engineering a Conformant Probabilistic Planner.",
            "Decision-Theoretic Planning with non-Markovian Rewards.",
            "Approximate Policy Iteration with a Policy Language Bias: Solving Relational Markov Decision Processes.",
            "Learning in Real-Time Search: A Unifying Framework.",
            "Dynamic Local Search for the Maximum Clique Problem.",
            "An Approach to Temporal Planning and Scheduling in Domains with Predictable Exogenous Events.",
            "Improving Heuristics Through Relaxed Search - An Analysis of TP4 and HSP*a in the 2004 Planning Competition.",
            "Distributed Reasoning in a Peer-to-Peer Setting: Application to the Semantic Web.",
            "Negotiating Socially Optimal Allocations of Resources.",
            "Representing Conversations for Scalable Overhearing.",
            "On Graphical Modeling of Preference and Importance.",
            "Logical Hidden Markov Models.",
            "A Continuation Method for Nash Equilibria in Structured Games.",
            "Fault Tolerant Boolean Satisfiability.",
            "Asynchronous Partial Overlay: A New Algorithm for Solving Distributed Constraint Satisfaction Problems.",
            "A Logic for Reasoning about Evidence.",
            "Planning Graph Heuristics for Belief Space Search.",
            "Domain Adaptation for Statistical Classifiers.",
            "Admissible and Restrained Revision.",
            "Convexity Arguments for Efficient Minimization of the Bethe and Kikuchi Free Energies.",
            "The Fast Downward Planning System.",
            "How the Landscape of Random Job Shop Scheduling Instances Depends on the Ratio of Jobs to Machines.",
            "Breaking Instance-Independent Symmetries In Exact Graph Coloring.",
            "Temporal Planning using Subgoal Partitioning and Resolution in SGPlan.",
            "Clause/Term Resolution and Learning in the Evaluation of Quantified Boolean Formulas.",
            "Multiple-Goal Heuristic Search.",
            "Engineering Benchmarks for Planning: the Domains Used in the Deterministic Part of IPC-4.",
            "A Variational Inference Procedure Allowing Internal Structure for Overlapping Clusters and Deterministic Constraints.",
            "Generative Prior Knowledge for Discriminative Classification.",
            "Cognitive Principles in Robust Multimodal Interpretation.",
            "Learning Sentence-internal Temporal Relations.",
            "A Comparison of Different Machine Transliteration Models.",
            "Solving Factored MDPs with Hybrid State and Action Variables.",
            "Active Learning with Multiple Views.",
            "Modelling Mixed Discrete-Continuous Domains for Planning.",
            "Properties and Applications of Programs with Monotone and Convex Constraints.",
            "Anytime Point-Based Approximations for Large POMDPs.",
            "Multi-Issue Negotiation with Deadlines.",
            "FluCaP: A Heuristic Search Planner for First-Order MDPs.",
            "Set Intersection and Consistency in Constraint Networks.",
            "Preference-based Search using Example-Critiquing with Suggestions.",
            "Resource Allocation Among Agents with MDP-Induced Preferences.",
            "Causes of Ineradicable Spurious Predictions in Qualitative Simulation.",
            "Understanding Algorithm Performance on an Oversubscribed Scheduling Application.",
            "Uncertainty in Soft Temporal Constraint Problems: A General Framework and Controllability Algorithms forThe Fuzzy Case."
        ]
    },
    {
        "name": "JAIR",
        "year": "2005",
        "info": "2005: Volumes 23, 24",
        "count": 38,
        "papers": [
            "Finding Approximate POMDP solutions Through Belief Compression.",
            "Extremal Behaviour in Multiagent Contract Negotiation.",
            "Reinforcement Learning for Agents with Many Sensors and Actuators Acting in Categorizable Environments.",
            "Restricted Value Iteration: Theory and Algorithms.",
            "Combining Spatial and Temporal Logics: Expressiveness vs. Complexity.",
            "Graduality in Argumentation.",
            "Combining Knowledge- and Corpus-based Word-Sense-Disambiguation Methods.",
            "Learning From Labeled And Unlabeled Data: An Empirical Study Across Techniques And Domains.",
            "Hybrid BDI-POMDP Framework for Multiagent Teaming.",
            "On the Practical use of Variable Elimination in Constraint Optimization Problems: 'Still-life' as a Case Study.",
            "Generalizing Boolean Satisfiability III: Implementation.",
            "Using Memory to Transform Search on the Planning Graph.",
            "An Improved Search Algorithm for Optimal Multiple-Sequence Alignment.",
            "An Expressive Language and Efficient Execution System for Software Agents.",
            "Keys, Nominals, and Concrete Domains.",
            "CIXL2: A Crossover Operator for Evolutionary Algorithms Based on Population Features.",
            "A Framework for Sequential Planning in Multi-Agent Settings.",
            "Risk-Sensitive Reinforcement Learning Applied to Control under Constraints.",
            "Solving Set Constraint Satisfaction Problems using ROBDDs.",
            "Learning Content Selection Rules for Generating Object Descriptions in Dialogue.",
            "Perseus: Randomized Point-based Value Iteration for POMDPs.",
            "Linking Search Space Structure, Run-Time Dynamics, and Problem Difficulty: A Step Toward Demystifying Tabu Search.",
            "Integrating Learning from Examples into the Search for Diagnostic Policies.",
            "Learning Concept Hierarchies from Text Corpora using Formal Concept Analysis.",
            "Efficiency versus Convergence of Boolean Kernels for On-Line Learning Algorithms.",
            "Pure Nash Equilibria: Hard and Easy Games.",
            "Cooperative Information Sharing to Improve Distributed Learning in Multi-Agent Systems.",
            "Reasoning about Action: An Argumentation - Theoretic Approach.",
            "The Deterministic Part of IPC-4: An Overview.",
            "Macro-FF: Improving AI Planning with Automatically Learned Macro-Operators.",
            "Hiding Satisfying Assignments: Two are Better than One.",
            "Binary Encodings of Non-binary Constraint Satisfaction Problems: Algorithms and Experimental Results.",
            "Where 'Ignoring Delete Lists' Works: Local Search Topology in Planning Benchmarks.",
            "Probabilistic Hybrid Action Models for Predicting Concurrent Percept-driven Robot Behavior.",
            "The First Probabilistic Track of the International Planning Competition.",
            "Ignorability in Statistical and Probabilistic Inference.",
            "Optiplan: Unifying IP-based and Graph-based Planning.",
            "mGPT: A Probabilistic Planner Based on Heuristic Search."
        ]
    },
    {
        "name": "JAIR",
        "year": "2004",
        "info": "2004: Volumes 21, 22",
        "count": 34,
        "papers": [
            "Effective Dimensions of Hierarchical Latent Class Models.",
            "Price Prediction in a Trading Agent Competition.",
            "K-Implementation.",
            "Competitive Coevolution through Evolutionary Complexification.",
            "Complexity Results and Approximation Strategies for MAP Explanations.",
            "CP-nets: A Tool for Representing and Reasoning with Conditional Ceteris Paribus Preference Statements.",
            "Generalizing Boolean Satisfiability I: Background and Survey of Existing Work.",
            "Coherent Integration of Databases by Abductive Logic Programming.",
            "IDL-Expressions: A Formalism for Representing and Parsing Finite Languages in Natural Language Processing.",
            "Representation Dependence in Probabilistic Inference.",
            "Dual Modelling of Permutation and Injection Problems.",
            "A Personalized System for Conversational Recommendations.",
            "Grounded Semantic Composition for Visual Scenes.",
            "Phase Transitions and Backbones of the Asymmetric Traveling Salesman Problem.",
            "Compositional Model Repositories via Dynamic Constraint Satisfaction with Order-of-Magnitude Preferences.",
            "On Polynomial Sized MDP Succinct Policies.",
            "Can We Learn to Beat the Best Stock.",
            "Concurrent Auctions Across The Supply Chain.",
            "PHA*: Finding the Shortest Path with A* in An Unknown Physical Environment.",
            "A Maximal Tractable Class of Soft Constraints.",
            "Ordinal and Probabilistic Representations of Acceptance.",
            "A Comprehensive Trainable Error Model for Sung Music Queries.",
            "Responsibility and Blame: A Structural-Model Approach.",
            "Explicit Learning Curves for Transduction and Application to Clustering and Compression Algorithms.",
            "Decentralized Control of Cooperative Systems: Categorization and Complexity Analysis.",
            "Use of Markov Chains to Design an Agent Bidding Strategy for Continuous Double Auctions.",
            "Ordered Landmarks in Planning.",
            "Additive Pattern Database Heuristics.",
            "Towards Understanding and Harnessing the Potential of Clause Learning.",
            "Existence of Multiagent Equilibria with Limited Agents.",
            "On Prediction Using Variable Order Markov Models.",
            "Solving Transition Independent Decentralized Markov Decision Processes.",
            "LexRank: Graph-based Lexical Centrality as Salience in Text Summarization.",
            "Generalizing Boolean Satisfiability II: Theory."
        ]
    },
    {
        "name": "JAIR",
        "year": "2003",
        "info": "2003: Volumes 18, 19, 20",
        "count": 44,
        "papers": [
            "Acquiring Word-Meaning Mappings for Natural Language Interfaces.",
            "Monte Carlo Methods for Tempo Tracking and Rhythm Quantization.",
            "Learning to Order BDD Variables in Verification.",
            "Translation of Pronominal Anaphora between English and Spanish: Discrepancies and Evaluation.",
            "Wrapper Maintenance: A Machine Learning Approach.",
            "An Evolutionary Algorithm with Advanced Goal and Priority Specification for Multi-objective Optimization.",
            "Interactive Execution Monitoring of Agent Teams.",
            "Exploiting Contextual Independence In Probabilistic Inference.",
            "Structure and Complexity in Planning with Unary Operators.",
            "A New General Method to Generate Random Modal Formulae for Testing Decision Procedures.",
            "Propositional Independence: Formula-Variable Independence and Forgetting.",
            "Searching for Bayesian Network Structures in the Space of Restricted Acyclic Partially Directed Graphs.",
            "Acquiring Correct Knowledge for Natural Language Generation.",
            "New Polynomial Classes for Logic-Based Abduction.",
            "Learning to Coordinate Efficiently: A Model-based Approach.",
            "Answer Set Planning Under Action Costs.",
            "Optimal Schedules for Parallelizing Anytime Algorithms: The Case of Shared Resources.",
            "Bound Propagation.",
            "Representing and Aggregating Conflicting Beliefs.",
            "Potential-Based Shaping and Q-Value Initialization are Equivalent.",
            "Decision-Theoretic Bidding Based on Learned Density Models in Simultaneous, Interacting Auctions.",
            "Updating Probabilities.",
            "Compiling Causal Theories to Successor State Axioms and STRIPS-Like Systems.",
            "Learning When Training Data are Costly: The Effect of Class Distribution on Tree Induction.",
            "An Architectural Approach to Ensuring Consistency in Hierarchical Execution.",
            "Efficient Solution Algorithms for Factored MDPs.",
            "Temporal Decision Trees: Model-based Diagnosis of Dynamic Systems On-Board.",
            "Decentralized Supply Chain Formation: A Market Protocol and Competitive Equilibrium Analysis.",
            "Accelerating Reinforcement Learning through Implicit Imitation.",
            "AltAltp: Online Parallelization of Plans with Heuristic State Search.",
            "The 3rd International Planning Competition: Results and Analysis.",
            "PDDL2.1: An Extension to PDDL for Expressing Temporal Planning Domains.",
            "The Power of Modeling - a Response to PDDL2.1.",
            "Imperfect Match: PDDL 2.1 and Real Applications.",
            "PDDL 2.1: Representation vs. Computation.",
            "PDDL2.1 - The Art of the Possible? Commentary on Fox and Long.",
            "The Case for Durative Actions: A Commentary on PDDL2.1.",
            "Sapa: A Multi-objective Metric Temporal Planner.",
            "Taming Numbers and Durations in the Model Checking Integrated Planning System.",
            "Planning Through Stochastic Local Search and Temporal Action Graphs in LPG.",
            "The Metric-FF Planning System: Translating ''Ignoring Delete Lists'' to Numeric State Variables.",
            "TALplanner in the Third International Planning Competition: Extensions and Control Rules.",
            "SHOP2: An HTN Planning System.",
            "VHPOP: Versatile Heuristic Partial Order Planner."
        ]
    },
    {
        "name": "JAIR",
        "year": "2002",
        "info": "2002: Volumes 16, 17",
        "count": 27,
        "papers": [
            "Fusions of Description Logics and Abstract Description Systems.",
            "Accelerating Reinforcement Learning by Composing Solutions of Automatically Identified Subtasks.",
            "Optimizing Dialogue Management with Reinforcement Learning: Experiments with the NJFun System.",
            "Improving the Efficiency of Inductive Logic Programming Through the Use of Query Packs.",
            "Learning Geometrically-Constrained Hidden Markov Models for Robot Navigation: Bridging the Topological-Geometrical Gap.",
            "Structured Knowledge Representation for Image Retrieval.",
            "Efficient Reinforcement Learning Using Recursive Least-Squares Methods.",
            "Automatically Training a Problematic Dialogue Predictor for a Spoken Dialogue System.",
            "SMOTE: Synthetic Minority Over-sampling Technique.",
            "Collective Intelligence, Data Routing and Braess' Paradox.",
            "The Communicative Multiagent Team Decision Problem: Analyzing Teamwork Theories and Models.",
            "Extensions of Simple Conceptual Graphs: the Complexity of Rules and Constraints.",
            "A Critical Assessment of Benchmark Comparison in Planning.",
            "Inferring Strategies for Sentence Ordering in Multidocument News Summarization.",
            "A Logic for Reasoning about Upper Probabilities.",
            "Monitoring Teams by Overhearing: A Multi-Agent Plan-Recognition Approach.",
            "Inducing Interpretable Voting Classifiers without Trading Accuracy for Simplicity: Theoretical Results, Approximation Algorithms, and Experiments.",
            "Towards Adjustable Autonomy for the Real World.",
            "A Knowledge Compilation Map.",
            "When do Numbers Really Matter?",
            "A Unified Model of Structural Organization in Language and Music.",
            "An Analysis of Phase Transition in NK Landscapes.",
            "A New Technique for Combining Multiple Classifiers using The Dempster-Shafer Theory of Evidence.",
            "Competitive Safety Analysis: Robust Decision-Making in Multi-Agent Systems.",
            "Specific-to-General Learning for Temporal Events with Application to Learning Event Definitions from Video.",
            "Policy Recognition in the Abstract Hidden Markov Model.",
            "Expert-Guided Subgroup Discovery: Methodology and Application."
        ]
    },
    {
        "name": "JAIR",
        "year": "2001",
        "info": "2001: Volumes 14, 15",
        "count": 25,
        "papers": [
            "On Reachability, Relevance, and Resolution in the Planning as Satisfiability Approach.",
            "Speeding Up the Convergence of Value Iteration in Partially Observable Markov Decision Processes.",
            "Conflict-Directed Backjumping Revisited.",
            "Nonapproximability Results for Partially Observable Markov Decision Processes.",
            "Partial-Order Planning with Concurrent Interacting Actions.",
            "Reasoning within Fuzzy Description Logics.",
            "What's in an Attribute? Consequences for the Least Common Subsumer.",
            "Domain Filtering Consistencies.",
            "Technical Paper Recommendation: A Study in Combining Multiple Information Sources.",
            "The FF Planning System: Fast Plan Generation Through Heuristic Search.",
            "GIB: Imperfect Information in a Computationally Challenging Game.",
            "Conditional Plausibility Measures and Bayesian Networks.",
            "Goal Recognition through Goal Graph Analysis.",
            "Grounding the Lexical Semantics of Verbs in Visual Perception using Force Dynamics and Event Logic.",
            "Mean Field Methods for a Special Class of Belief Networks.",
            "The GRT Planning System: Backward Heuristic Construction in Forward State-Space Planning.",
            "An Analysis of Reduced Error Pruning.",
            "ATTac-2000: An Adaptive Autonomous Bidding Agent.",
            "Planning by Rewriting.",
            "Computational Approach to Anaphora Resolution in Spanish Dialogues.",
            "Efficient Methods for Qualitative Spatial Reasoning.",
            "Infinite-Horizon Policy-Gradient Estimation.",
            "Experiments with Infinite-Horizon, Policy-Gradient Estimation.",
            "Finding a Path is Harder than Finding a Tree.",
            "Parameter Learning of Logic Programs for Symbolic-Statistical Modeling."
        ]
    },
    {
        "name": "JAIR",
        "year": "2000",
        "info": "2000: Volumes 12, 13",
        "count": 20,
        "papers": [
            "Planning Graph as a (Dynamic) CSP: Exploiting EBL, DDB and other CSP Search Techniques in Graphplan.",
            "Reasoning on Interval and Point-based Disjunctive Metric Constraints in Temporal Contexts.",
            "On Deducing Conditional Independence from d-Separation in Causal Graphs with Feedback (Research Note).",
            "Exact Phase Transitions in Random Constraint Satisfaction Problems.",
            "Robust Agent Teams via Socially-Attentive Monitoring.",
            "A Model of Inductive Bias Learning.",
            "The Complexity of Reasoning with Cardinality Restrictions and Nominals in Expressive Description Logics.",
            "Randomized Algorithms for the Loop Cutset Problem.",
            "Backbone Fragility and the Local Search Cost Peak.",
            "On the Compilability and Expressive Power of Propositional Planning Formalisms.",
            "Axiomatizing Causal Reasoning.",
            "On Reasonable and Forced Goal Orderings and their Use in an Agenda-Driven Planning Algorithm.",
            "An Application of Reinforcement Learning to Dialogue Strategy Selection in a Spoken Dialogue System for Email.",
            "Space Efficiency of Propositional Knowledge Representation Formalisms.",
            "Value-Function Approximations for Partially Observable Markov Decision Processes.",
            "Asimovian Adaptive Agents.",
            "AIS-BN: An Adaptive Importance Sampling Algorithm for Evidential Reasoning in Large Bayesian Networks.",
            "OBDD-based Universal Planning for Synchronized Agents in Non-Deterministic Domains.",
            "Hierarchical Reinforcement Learning with the MAXQ Value Function Decomposition.",
            "Conformant Planning via Symbolic Model Checking."
        ]
    },
    {
        "name": "JAIR",
        "year": "1999",
        "info": "1999: Volumes 10, 11",
        "count": 28,
        "papers": [
            "Order of Magnitude Comparisons of Distance.",
            "Solving Highly Constrained Search Problems with Quantum Computers.",
            "A Counterexample to Theorems of Cox and Fine.",
            "Efficient Implementation of the Plan Graph in STAN.",
            "Modeling Belief in Dynamic Systems, Part II: Revision and Update.",
            "Cooperation between Top-Down and Bottom-Up Theorem Provers.",
            "Probabilistic Deduction with Conditional Constraints over Basic Events.",
            "Learning to Order Things.",
            "Issues in Stacked Generalization.",
            "Variational Probabilistic Inference and the QMR-DT Network.",
            "Constructing Conditional Plans by a Theorem-Prover.",
            "Squeaky Wheel Optimization.",
            "Efficient Heuristic Hypothesis Ranking.",
            "Extensible Knowledge Representation: the Case of Description Reasoners.",
            "Variational Cumulant Expansions for Intractable Distributions.",
            "The Good Old Davis-Putnam Procedure Helps Counting Models.",
            "Decision-Theoretic Planning: Structural Assumptions and Computational Leverage.",
            "Semantic Similarity in a Taxonomy: An Information-Based Measure and its Application to Problems of Ambiguity in Natural Language.",
            "Identifying Mislabeled Training Data.",
            "Popular Ensemble Methods: An Empirical Study.",
            "Unifying Class-Based Representation Formalisms.",
            "Evolutionary Algorithms for Reinforcement Learning.",
            "Reasoning about Minimal Belief and Negation as Failure.",
            "Decentralized Markets versus Central Control: A Comparative Study.",
            "Committee-Based Sample Selection for Probabilistic Classifiers.",
            "The Complexity of Reasoning about Spatial Congruence.",
            "Markov Localization for Mobile Robots in Dynamic Environments.",
            "Cox's Theorem Revisited (technical addendum)."
        ]
    },
    {
        "name": "JAIR",
        "year": "1998",
        "info": "1998: Volumes 8, 9",
        "count": 20,
        "papers": [
            "Monotonicity and Persistence in Preferential Logics.",
            "Incremental Recompilation of Knowledge.",
            "Tractability of Theory Patching.",
            "Cached Sufficient Statistics for Efficient Machine Learning with Large Datasets.",
            "Synthesizing Customized Planners from Specifications.",
            "Integrative Windowing.",
            "Model-Based Diagnosis using Structured System Descriptions.",
            "A Selective Macro-learning Algorithm and its Application to the NxN Sliding-Tile Puzzle.",
            "The Computational Complexity of Probabilistic Planning.",
            "The Divide-and-Conquer Subgoal-Ordering Algorithm for Speeding up Logic Inference.",
            "Computational Aspects of Reordering Plans.",
            "Adaptive Parallel Iterative Deepening Search.",
            "Probabilistic Inference from Arbitrary Uncertainty using Mixtures of Factorized Generalized Gaussians.",
            "The Gn, m Phase Transition is Not Hard for the Hamiltonian Cycle Problem.",
            "An Empirical Approach to Temporal Reference Resolution.",
            "The Ariadne's Clew Algorithm.",
            "AntNet: Distributed Stigmergetic Control for Communications Networks.",
            "The Automatic Inference of State Invariants in TIM.",
            "Complexity of Prioritized Default Logics.",
            "A Temporal Description Logic for Reasoning about Actions and Plans."
        ]
    },
    {
        "name": "JAIR",
        "year": "1997",
        "info": "1997: Volumes 6, 7",
        "count": 19,
        "papers": [
            "Improved Heterogeneous Distance Functions.",
            "SCREEN: Learning a Flat Syntactic and Semantic Spoken Language Analysis Using Artificial Neural Networks.",
            "A Uniform Framework for Concept Definitions in Description Logics.",
            "Lifeworld Analysis.",
            "Query DAGs: A Practical Paradigm for Implementing Belief-Network Inference.",
            "Connectionist Theory Refinement: Genetically Searching the Space of Network Topologies.",
            "A Complete Classification of Tractability in RCC-5.",
            "Flaw Selection Strategies For Partial-Order Planning.",
            "Defining Relative Likelihood in Partially-Ordered Structures.",
            "Eight Maximal Tractable Subclasses of Allen's Algebra with Metric Time.",
            "A New Look at the Easy-Hard-Easy Pattern of Combinatorial Search Difficulty.",
            "Identifying Hierarchical Structure in Sequences: A linear-time algorithm.",
            "Towards Flexible Teamwork.",
            "Analysis of Three-Dimensional Protein Images.",
            "Storing and Indexing Plan Derivations through Explanation-based Analysis of Retrieval Failures.",
            "A Model Approximation Scheme for Planning in Partially Observable Stochastic Domains.",
            "Dynamic Non-Bayesian Decision Making.",
            "When Gravity Fails: Local Search Topology.",
            "Bidirectional Heuristic Search Reconsidered."
        ]
    },
    {
        "name": "JAIR",
        "year": "1996",
        "info": "1996: Volumes 4, 5",
        "count": 28,
        "papers": [
            "The Design and Experimental Analysis of Algorithms for Temporal Reasoning.",
            "Well-Founded Semantics for Extended Logic Programs with Dynamic Preferences.",
            "Logarithmic-Time Updates and Queries in Probabilistic Networks.",
            "Mean Field Theory for Sigmoid Belief Networks.",
            "Improved Use of Continuous Attributes in C4.5.",
            "Quantum Computing and Phase Transitions in Combinatorial Search.",
            "Active Learning with Statistical Models.",
            "Iterative Optimization and Simplification of Hierarchical Clusterings.",
            "Practical Methods for Proving Termination of General Logic Programs.",
            "A Divergence Critic for Inductive Proof.",
            "Reinforcement Learning: A Survey.",
            "Planning for Contingencies: A Decision-based Approach.",
            "Least Generalizations and Greatest Specializations of Sets of Clauses.",
            "Adaptive Problem-solving for Large-scale Scheduling Problems: A Case Study.",
            "Further Experimental Evidence against the Utility of Occam's Razor.",
            "A Principled Approach Towards Symbolic Geometric Constraint Satisfaction.",
            "A Formal Framework for Speedup Learning from Problems and Solutions.",
            "On Partially Controlled Multi-Agent Systems.",
            "Spatial Aggregation: Theory and Applications.",
            "A Hierarchy of Tractable Subsets for Computing Stable Models.",
            "Cue Phrase Classification Using Machine Learning.",
            "Accelerating Partial-Order Planners: Some Techniques for Effective Search Control and Pruning.",
            "Learning First-Order Definitions of Functions.",
            "Mechanisms for Automated Negotiation in State Oriented Domains.",
            "MUSE CSP: An Extension to the Constraint Satisfaction Problem.",
            "Characterizations of Decomposable Dependency Models (Research Note).",
            "Exploiting Causal Independence in Bayesian Network Inference.",
            "Quantitative Results Comparing Three Intelligent Interfaces for Information Capture: A Case Study Adding Name Information into an Electronic Personal Organizer."
        ]
    },
    {
        "name": "JAIR",
        "year": "1995",
        "info": "Volume 3: 1995",
        "count": 16,
        "papers": [
            "Induction of First-Order Decision Lists: Results on Learning the Past Tense of English Verbs.",
            "FLECS: Planning with a Flexible Commitment Strategy.",
            "Building and Refining Abstract Planning Cases by Change of Representation Language.",
            "Using Qualitative Hypotheses to Identify Inaccurate Data.",
            "An Integrated Framework for Learning and Reasoning.",
            "Learning Membership Functions in a Function-Based Object Recognition System.",
            "Improving Connectionist Energy Minimization.",
            "Diffusion of Context and Credit Information in Markovian Models.",
            "Flexibly Instructable Agents.",
            "Vision-Based Road Detection in Automotive Systems: A Real-Time Expectation-Driven Approach.",
            "Translating between Horn Representations and their Characteristic Models.",
            "Statistical Feature Combination for the Evaluation of Game Positions.",
            "Rule-based Machine Learning Methods for Functional Prediction.",
            "Decision-Theoretic Foundations for Causal Reasoning.",
            "OPUS: An Efficient Admissible Algorithm for Unordered Search.",
            "Generalization of Clauses under Implication."
        ]
    },
    {
        "name": "JAIR",
        "year": "1994",
        "info": "Volume 2: 1994/1995",
        "count": 18,
        "papers": [
            "A System for Induction of Oblique Decision Trees.",
            "Random Worlds and Maximum Entropy.",
            "Pattern Matching and Discourse Processing in Information Extraction from Japanese Text.",
            "On Planning while Learning.",
            "Wrap-Up: a Trainable Discourse Module for Information Extraction.",
            "Operations for Learning with Graphical Models.",
            "Total-Order and Partial-Order Planning: A Comparative Analysis.",
            "Solving Multiclass Learning Problems via Error-Correcting Output Codes.",
            "Truncating Temporal Differences: On the Efficient Implementation of TD(lambda) for Reinforcement Learning.",
            "A Domain-Independent Algorithm for Plan Adaptation.",
            "On the Informativeness of the DNA Promoter Sequences Domain Theory (Research Note).",
            "Cost-Sensitive Classification: Empirical Evaluation of a Hybrid Genetic Decision Tree Induction Algorithm.",
            "Rerepresenting and Restructuring Domain Theories: A Constructive Induction Approach.",
            "Using Pivot Consistency to Decompose and Solve Functional CSPs.",
            "Adaptive Load Balancing: A Study in Multi-Agent Learning.",
            "Pac-Learning Recursive Logic Programs: Efficient Algorithms.",
            "Pac-learning Recursive Logic Programs: Negative Results.",
            "Provably Bounded-Optimal Agents."
        ]
    },
    {
        "name": "JAIR",
        "year": "1993",
        "info": "Volume 1: 1993/1994",
        "count": 13,
        "papers": [
            "A Market-Oriented Programming Environment and its Application to Distributed Multicommodity Flow Problems.",
            "Dynamic Backtracking.",
            "An Empirical Analysis of Search in GSAT.",
            "Software Agents: Completing Patterns and Constructing User Interfaces.",
            "The Difficulties of Learning Logic Programs with Cut.",
            "Decidable Reasoning in Terminological Knowledge Representation Systems.",
            "Teleo-Reactive Programs for Agent Control.",
            "Bias-Driven Revision of Logical Domain Theories.",
            "Learning the Past Tense of English Verbs: The Symbolic Pattern Associator vs. Connectionist Models.",
            "Substructure Discovery Using Minimum Description Length and Background Knowledge.",
            "Exploring the Decision Forest: An Empirical Investigation of Occam's Razor in Decision Tree Induction.",
            "A Semantics and Complete Algorithm for Subsumption in the CLASSIC Description Logic.",
            "Applying GSAT to Non-Clausal Formulas (Research Note)."
        ]
    }
]