[
    {
        "name": "JETAI",
        "year": "2021",
        "info": "Volume 33, 2021",
        "count": 51,
        "papers": [
            "A Two-Level Function Evaluation Management Model for Multi-Population Methods in Dynamic Environments: Hierarchical Learning Automata Approach.",
            "A mobile robot mapping model inspired from the place cells functionality of hippocampus based on dimension reduction technique.",
            "Global exponential stability on anti-periodic solutions in proportional delayed HIHNNs.",
            "Individual strategic profiles in tacit coordination games.",
            "Robust H∞ performance for discrete time T-S fuzzy switched memristive stochasticneural networks with mixed time-varying delays.",
            "GSA-LA: gravitational search algorithm based on learning automata.",
            "Improved butterfly optimisation algorithm based on guiding weight and population restart.",
            "Neural network for automatic farm control.",
            "A new feature extraction approach based on one dimensional gray level co-occurrence matrices for bearing fault classification.",
            "Bi-objective web service composition problem in multi-cloud environment: a bi-objective time-varying particle swarm optimisation algorithm.",
            "Detection and classification of landmines using machine learning applied to metal detector data.",
            "A non-reduced order approach to stability analysis of delayed inertial genetic regulatory networks.",
            "A hybrid multiverse optimisation algorithm based on differential evolution and adaptive mutation.",
            "Global exponential stability of anti-periodic solutions for discontinuous Cohen-Grossberg neural networks with time-varying delays.",
            "Linear quadratic optimal control problem with fuzzy variables via neural network.",
            "Medical diagnosis and treatment is NP-complete.",
            "Performance evaluation of fuzzy clustered case-based reasoning.",
            "Double-quantitative decision rough set over two universes and application to African swine fever decision-making.",
            "Joint extraction of entities and relations based on character graph convolutional network and Multi-Head Self-Attention Mechanism.",
            "Grasshopper inspired artificial bee colony algorithm for numerical optimisation.",
            "Probabilistic forecasting, linearity and nonlinearity hypothesis tests with bootstrapped linear and nonlinear artificial neural network.",
            "Detection of distributed denial of service attack in cloud computing using the optimization-based deep networks.",
            "Personalised healthcare model for monitoring and prediction of airpollution: machine learning approach.",
            "Hierarchical classifier design for speech emotion recognition in the mixed-cultural environment.",
            "Online path planning of mobile robot using grasshopper algorithm in a dynamic and unknown environment.",
            "ATE-SPD: simultaneous extraction of aspect-term and aspect sentiment polarity using Bi-LSTM-CRF neural network.",
            "Hierarchical age estimation mechanism with adaBoost-based deep instance weighted fusion.",
            "Detection of COVID-19 Disease in Chest X-Ray Images with capsul networks: application with cloud computing.",
            "Discrete wavelet transform-based freezing of gait detection in Parkinson's disease.",
            "Elephant detection using boundary sense deep learning (BSDL) architecture.",
            "Deep CNN and geometric features-based gastrointestinal tract diseases detection and classification from wireless capsule endoscopy images.",
            "Fuzzy electromagnetic optimisation clustering algorithm for collaborative filtering.",
            "A data-driven predictive system using Case-Based Reasoning for the configuration of device-assisted back pain therapy.",
            "A linear space adjustment by mapping data into an intermediate space and keeping low level data structures.",
            "A framework for the analysis and synthesis of Swarm Intelligence algorithms.",
            "Intelligence in cyberspace: the road to cyber singularity.",
            "Adaptive chaotic satin bowerbird optimisation algorithm for numerical function optimisation.",
            "A review of approaches for topic detection in Twitter.",
            "Diversity driven multi-parent evolutionary algorithm with adaptive non-uniform mutation.",
            "A multi-objective decomposition-based ant colony optimisation algorithm with negative pheromone.",
            "High-definition map update framework for intelligent autonomous transfer vehicles.",
            "Expectations for agents with goal-driven autonomy.",
            "ConArgLib: an argumentation library with support to search strategies and parallel search.",
            "Frequency component vectorisation for image dehazing.",
            "A preference degree for ranking k-dimensional vectors of qualitative labels and its application in multi-attribute group decision-making.",
            "A new colour image copyright protection approach using evolution-based dual watermarking.",
            "Global asymptotic stability for discrete-time Cohen-Grossberg neural networks with delays by combining graph theoretic approach with Homeomorphism concept.",
            "Resampling-based noise correction for crowdsourcing.",
            "Prediction of fluid interface between dispersed and matrix phases by Lattice Boltzmann-adaptive network-based fuzzy inference system.",
            "Improving Alzheimer's disease classification by performing data fusion with vascular dementia and stroke data.",
            "A learning-based resource provisioning approach in the fog computing environment."
        ]
    },
    {
        "name": "JETAI",
        "year": "2020",
        "info": "Volume 32, 2020",
        "count": 49,
        "papers": [
            "Method of intelligent support of decision-making at dispatching the geospatial processes.",
            "A novel ensembling method to boost performance of neural networks.",
            "Towards effective resolution approaches for solving the sum coloring problem.",
            "Prediction of stock movement using phase space reconstruction and extreme learning machines.",
            "New generalised Bonferroni mean aggregation operators of complex intuitionistic fuzzy information based on Archimedean t-norm and t-conorm.",
            "Indian language identification using time-frequency image textural descriptors and GWO-based feature selection.",
            "Exponential stability of inertial neural networks involving proportional delays and non-reduced order method.",
            "A shortlist-based bidirectional local search for the stable marriage problem.",
            "A hybrid BGWO with KPCA for intrusion detection.",
            "A new neural network framework for solving convex second-order cone constrained variational inequality problems with an application in multi-finger robot hands.",
            "Deep learning-based framework for expansion, recognition and classification of underwater acoustic signal.",
            "Adaptive weighted aggregation in Group Improvised Harmony Search for lung nodule classification.",
            "Population subset selection for the use of a validation dataset for overfitting control in genetic programming.",
            "Cloud-Fog based framework for drought prediction and forecasting using artificial neural network and genetic algorithm.",
            "Existence and global exponential stability of anti-periodic solutions for generalised inertial competitive neural networks with time-varying delays.",
            "An improved multi-objective antlion optimization algorithm for the optimal design of the robotic gripper.",
            "Deep CNN feature fusion with manifold learning and regression for pixel classification in HSI images.",
            "Periodicity on Nicholson's blowflies systems involving patch structure and mortality terms.",
            "Discriminating deception from truth and misinformation: an intent-level approach.",
            "Spectral feature and optimization- based actor-critic neural network for arrhythmia classification using ECG signal.",
            "Empirical-type simulated annealing for solving the capacitated vehicle routing problem.",
            "Existence and global exponential stability of almost periodic solutions of genetic regulatory networks with time-varying delays.",
            "Analyzing trajectories of learning processes through behaviour-based entropy.",
            "Convergence on non-autonomous inertial neural networks with unbounded distributed delays.",
            "Learning word hierarchical representations with neural networks for document modeling.",
            "A stigmergetic method based on vector pheromone for target search with swarm robots.",
            "Real-valued syntactic word vectors.",
            "On building a person: benchmarks for robotic personhood.",
            "Machine learning algorithms for failure prediction and yield improvement during electric resistance welded tube manufacturing.",
            "Measuring the complexity of migration transition: an attempt using metrics.",
            "Averaged one-dependence inverted specific-class distance measure for nominal attributes.",
            "An emergent deep developmental model for auditory learning.",
            "MEvo: a framework for effective macro sets evolution.",
            "A comprehensive review of moth-flame optimisation: variants, hybrids, and applications.",
            "The Doubly-Bounded Rationality of an Artificial Agent and its Ability to Represent the Bounded Rationality of a Human Decision-Maker in Policy-Relevant Situations.",
            "An extensible circuit-based SAT solver.",
            "A description logic framework for commonsense conceptual combination integrating typicality, probabilities and cognitive heuristics.",
            "An improved invasive weed optimization algorithm for solving dynamic economic dispatch problems with valve-point effects.",
            "Piece-wise max-margin-based discriminative feature learning.",
            "Interval-valued pythagorean fuzzy power average-based MULTIMOORA method for multi-criteria decision-making.",
            "Estimating the weight and the failure load of a spaghetti bridge: a deep learning approach.",
            "Enhanced Optimizer Algorithm and its Application to Software Testing.",
            "Some power Heronian mean operators in multiple attribute decision-making based on q-rung orthopair hesitant fuzzy environment.",
            "Cat Swarm Fractional Calculus optimization-based deep learning for artifact removal from EEG signal.",
            "Solving the next release problem by means of the fuzzy logic inference system with respect to the competitive market.",
            "High-performance attribute reduction on graphics processing unit.",
            "Communicative bottlenecks lead to maximal information transfer.",
            "A knowledge-driven layered inverse reinforcement learning approach for recognizing human intents.",
            "Performance analysis of localisation strategy for island model genetic algorithm in population diversity preservation."
        ]
    },
    {
        "name": "JETAI",
        "year": "2019",
        "info": "Volume 31, 2019",
        "count": 45,
        "papers": [
            "Designing a system to extract and interpret timed causal sentences in medical reports.",
            "The campfire storytelling system - automatic creation and modification of a narrative.",
            "A retrieval system to analyse dermatological lesions using feature ortho-normalisation.",
            "Glioma grade classification using wavelet transform-local binary pattern based statistical texture features and geometric measures extracted from MRI.",
            "Modification of the Wu-Mendel approach for linguistic summarization.",
            "Analysing the power of deep learning techniques over the traditional methods using medicare utilisation and provider data.",
            "The fuzzification issue in the Wu-Mendel approach for linguistic summarisation using IF-THEN rules.",
            "Knowledge-oriented task and motion planning for multiple mobile robots.",
            "Parameter optimisation of support vector machine using mutant particle swarm optimisation for diagnosis of metal-oxide surge arrester conditions.",
            "A mosaic of Chu spaces and Channel Theory I: Category-theoretic concepts and tools.",
            "A novel Bayesian deep learning methodology for enhanced foetal cardiac signal mining.",
            "An attribute value frequency-based instance weighting filter for naive Bayes.",
            "A mosaic of Chu spaces and Channel Theory II: applications to object identification and mereological complexity.",
            "Experiments with automatic software piracy detection utilising machine-learning classifiers for micro-signatures.",
            "A mathematical analysis of improved EigenAnt algorithm.",
            "Pseudo almost periodic solutions for neutral-type FCNNs with D operator and time-varying delays.",
            "Multi-objective mobile robot path planning problem through learnable evolution model.",
            "A multi-layer approach to opinion polarity classification using augmented semantic tree kernels.",
            "A fuzzy rule-based generation algorithm in interval type-2 fuzzy logic system for fault prediction in the early phase of software development.",
            "Modelling linear fractional transportation problem in belief degree - based uncertain environment.",
            "Some 2-tuple linguistic neutrosophic number Muirhead mean operators and their applications to multiple attribute decision making.",
            "RMRL: improved regret minimisation techniques using learning automata.",
            "A word-building method based on neural network for text classification.",
            "Normalization of attribute values with interval information in group decision-making setting: with an application to software quality evaluation.",
            "Improved salp swarm algorithm based on weight factor and adaptive mutation.",
            "Monitoring air pollution by deep features and extreme learning machine.",
            "Implementation issues in optimization algorithms: do they matter?",
            "Some 2-tuple linguistic Pythagorean Heronian mean operators and their application to multiple attribute decision-making.",
            "Optimal allocation of public parking spots in a smart city: problem characterisation and first algorithms.",
            "Adaptive Neuro Fuzzy Inference System (ANFIS) based wildfire risk assessment.",
            "Anti-periodic oscillations in fuzzy cellular neural networks with time-varying delays.",
            "A computational model of scientific discovery in a very simple world, aiming at psychological realism.",
            "Rheological wall slip velocity prediction model based on artificial neural network.",
            "Some modified results of the subtraction and division operations on interval neutrosophic sets.",
            "Recent advances in soft computing and its applications.",
            "Stability and iterative convergence of water cycle algorithm for computationally expensive and combinatorial Internet shopping optimisation problems.",
            "Harmony search algorithm for energy system applications: an updated review and analysis.",
            "An opposition-based chaotic Grey Wolf Optimizer for global optimisation tasks.",
            "Butterfly-Fat-Tree topology based fault-tolerant Network-on-Chip design using particle swarm optimisation.",
            "Special issue: artificial intelligence and machine learning applications in Health Sciences.",
            "A deep learning approach for diagnosing schizophrenic patients.",
            "A multivariate regression approach for identification of SNPs importance in prostate cancer.",
            "Ground-level ozone predictions using outlier identification leveraged sample weighted regressors.",
            "Multi-modal classifier fusion with feature cooperation for glaucoma diagnosis.",
            "Comparison of the periimplant bone stress distribution on three fixed partial supported prosthesis designs under different loading. A 3D finite element analysis."
        ]
    },
    {
        "name": "JETAI",
        "year": "2018",
        "info": "Volume 30, 2018",
        "count": 57,
        "papers": [
            "Reproducible research: a minority opinion.",
            "Why is a computational framework for motivational and metacognitive control needed?",
            "A new dandelion algorithm and optimization for extreme learning machine.",
            "On transitions in the behaviour of tabu search algorithm TabuCol for graph colouring.",
            "Volatility forecasting for low-volatility portfolio selection in the US and the Korean equity markets.",
            "Pseudo almost periodic solutions for CNNs with oscillating leakage coefficients and complex deviating arguments.",
            "Machine learning techniques to predict sensitive patterns to fault attack in the Java Card application.",
            "Empirical study on variational inference methods for topic models.",
            "PDDL4J: a planning domain description library for java.",
            "Are human beings humean robots?",
            "Challenges in discriminating profanity from hate speech.",
            "Classification of ground glass opacity lesion characteristic based on texture feature using lung CT image.",
            "Cascade heterogeneous face sketch-photo synthesis via dual-scale Markov Network.",
            "P-HS-SFM: a parallel harmony search algorithm for the reproduction of experimental data in the continuous microscopic crowd dynamic models.",
            "Modeling agent's preferences by its designer's social value orientation.",
            "Induced simplified neutrosophic correlated aggregation operators for multi-criteria group decision-making.",
            "A new chaotic multi-verse optimization algorithm for solving engineering optimization problems.",
            "Almost periodic cellular neural networks with neutral-type proportional delays.",
            "Normative and descriptive rationality: from nature to artifice and back.",
            "Discrete bacteria foraging optimization algorithm for graph based problems - a transition from continuous to discrete.",
            "Editorial.",
            "A GRASP algorithm based new heuristic for the capacitated location routing problem.",
            "An adaptive SVSF-SLAM algorithm to improve the success and solving the UGVs cooperation problem.",
            "Hidden Markov random field model and Broyden-Fletcher-Goldfarb-Shanno algorithm for brain image segmentation.",
            "An improved fractal image compression using wolf pack algorithm.",
            "Flexible Web services integration: a novel personalised social approach.",
            "Instances selection algorithm by ensemble margin.",
            "23rd RCRA International workshop on \"Experimental evaluation of algorithms for solving problems with combinatorial explosion\".",
            "A privacy-preserving model for multi-agent propositional planning.",
            "Computing the Shapley value in allocation problems: approximations and bounds, with an application to the Italian VQR research assessment program.",
            "Adjudication of coreference annotations via answer set optimisation.",
            "AI personalities: clues from animal research.",
            "Chaotic shuffled frog leaping algorithms for parameter identification of fractional-order chaotic systems.",
            "A novel approach to interval comparison and application to software quality evaluation.",
            "Communication using robots: a Perception-action scenario in moderate ASD.",
            "Novel algorithms of particle swarm optimisation with decision criteria.",
            "Detecting logical argumentation in text via communicative discourse tree.",
            "Preorder-based triangle: a modified version of bilattice-based triangle for belief revision in nonmonotonic reasoning.",
            "A fuzzy overlay model for mapping adverse event risk in an active war theatre.",
            "An improved Urdu stemming algorithm for text mining based on multi-step hybrid approach.",
            "A short note on rough set over dual-universes.",
            "Ensemble one-vs-all learning technique with emphatic & rehearsal training for phishing email classification using psychology.",
            "Generalised Pythagorean fuzzy geometric interactive aggregation operators using Einstein operations and their application to decision making.",
            "A novel clustering algorithm for attributed graphs based on K-medoid algorithm.",
            "Domain transfer convolutional attribute embedding.",
            "Outer entanglements: a general heuristic technique for improving the efficiency of planning algorithms.",
            "Centroid particle swarm optimisation for high-dimensional data classification.",
            "I-AHSDT: intrusion detection using adaptive dynamic directive operative fractional lion clustering and hyperbolic secant-based decision tree classifier.",
            "Identifying stage of Alzheimer disease using multiclass particle swarm optimisation technique.",
            "Solving constrained optimisation problems using the improved imperialist competitive algorithm and Deb's technique.",
            "SWAQ: a Semantic Web Application Quality Evaluation Framework.",
            "A hierarchical stochastic modelling approach for reconstructing lung tumour geometry from 2D CT images.",
            "Effect of leakage delay on the almost periodic solutions of fuzzy cellular neural networks.",
            "ANN design and implementation for real-time object tracking using quadrotor AR.Drone 2.0.",
            "A ladder to human-comparable intelligence: an empirical metric.",
            "Cauchy Grey Wolf Optimiser for continuous optimisation problems.",
            "Corrigendum."
        ]
    },
    {
        "name": "JETAI",
        "year": "2017",
        "info": "Volume 29, 2017",
        "count": 74,
        "papers": [
            "Modelling and experimental performance analysis of solar-assisted ground source heat pump system.",
            "A bootstrapping method for development of Treebank.",
            "Classical workflow nets and workflow nets with reset arcs: using Lyapunov stability for soundness verification.",
            "A novel symbiotic organisms search algorithm for congestion management in deregulated environment.",
            "On supervised graph Laplacian embedding CA model & kernel construction and its application.",
            "Enhancing the performance of MOEAs: an experimental presentation of a new fitness guided mutation operator.",
            "Data aggregation in wireless sensor network using SVM-based failure detection and loss recovery.",
            "A dynamic fuzzy genetic algorithm for natural image segmentation using adaptive mean shift.",
            "Fault localization algorithm in computer networks by employing a genetic algorithm.",
            "Visual perception-based criminal identification: a query-based approach.",
            "A novel symbiotic organisms search algorithm for congestion management in deregulated environment.",
            "Truth and probability in evolutionary games.",
            "Ranking product aspects through sentiment analysis of online reviews.",
            "ArgoTriCS - automated triangle construction solver.",
            "A probabilistic neural network based approach for predicting the output power of wind turbines.",
            "Taking the fifth amendment in Turing's imitation game.",
            "Pathological brain detection in MRI scanning via Hu moment invariants and machine learning.",
            "Long-term knowledge acquisition using contextual information in a memory-inspired robot architecture.",
            "Group search optimiser-based optimal bidding strategies with no Karush-Kuhn-Tucker optimality conditions.",
            "Locality preserving hashing for fast image search: theory and applications.",
            "Why build a virtual brain? Large-scale neural simulations as jump start for cognitive computing.",
            "Open ended intelligence: the individuation of intelligent agents.",
            "A model of pathways to artificial superintelligence catastrophe for risk and decision analysis.",
            "Using learning automata to determine proper subset size in high-dimensional spaces.",
            "Dual PECCS: a cognitive system for conceptual representation and categorization.",
            "A bi-population based scheme for an explicit exploration/exploitation trade-off in dynamic environments.",
            "A new maximum power tracking in PV system during partially shaded conditions based on shuffled frog leap algorithm.",
            "Symbiotic organisms search algorithm for dynamic economic dispatch with valve-point effects.",
            "Investigating the effect of training-testing data stratification on the performance of soft computing techniques: an experimental study.",
            "Trust estimation of the semantic web using semantic web clustering.",
            "A novel robust Arabic light stemmer.",
            "An imperialist competitive algorithm for virtual machine placement in cloud computing.",
            "Automatic negotiation: playing the domain instead of the opponent.",
            "Privacy preservation and authentication on secure geographical routing in VANET.",
            "Redundancy checking algorithms based on parallel novel extension rule.",
            "Shadow detection of moving objects based on multisource information in Internet of things.",
            "Segmentation and classification of brain images using firefly and hybrid kernel-based support vector machine.",
            "Measuring an artificial intelligence system's performance on a Verbal IQ test for young children.",
            "Improving experimental methods on success rates in evolutionary computation.",
            "A robust optimisation framework in composite generation and transmission expansion planning considering inherent uncertainties.",
            "Projection and bidirectional projection measures of single-valued neutrosophic sets and their decision-making method for mechanical design schemes.",
            "A reversible data hiding scheme based on graph neighbourhood degree.",
            "Time series regression-based pairs trading in the Korean equities market.",
            "Possibility-induced simplified neutrosophic aggregation operators and their application to multi-criteria group decision-making.",
            "Thermal buckling optimisation of composite plates using firefly algorithm.",
            "Pseudo almost periodic solutions for neutral type SICNNs with D operator.",
            "DSolving: a novel and efficient intelligent algorithm for large-scale sliding puzzles.",
            "Metaheuristic optimisation methods for approximate solving of singular boundary value problems.",
            "Online/offline evolutionary algorithms for dynamic urban green space allocation problems.",
            "Comparisons of several variants of continuous quantum-inspired evolutionary algorithms.",
            "A rough set-based association rule approach implemented on a brand trust evaluation model.",
            "An approach to the language discrimination in different scripts using adjacent local binary pattern.",
            "Image steganalysis using Artificial Bee Colony algorithm.",
            "Efficient determination of the number of weak learners in AdaBoost.",
            "A novel metric based on changes in pareto domination ratio for objective reduction of many-objective optimization problems.",
            "Consideration effect of wind farms on the network reconfiguration in the distribution systems in an uncertain environment.",
            "Breast cancer risk assessment and diagnosis model using fuzzy support vector machine based expert system.",
            "Summarisation of weighted networks.",
            "Automated discovery systems and the inductivist controversy.",
            "Multi-objective optimization of radiotherapy: distributed Q-learning and agent-based simulation.",
            "Designing (artificial) people to serve - the other side of the coin.",
            "Optimisation of welding processes using quasi-oppositional-based Jaya algorithm.",
            "Hybrid learning in signalling games.",
            "DiMPP: a complete distributed algorithm for multi-agent path planning.",
            "An efficient approach for improving virtual machine placement in cloud computing environment.",
            "Maclaurin symmetric mean operators of linguistic intuitionistic fuzzy numbers and their application to multiple-attribute decision-making.",
            "A comparison of fitness-case sampling methods for genetic programming.",
            "Efficient hiding of confidential high-utility itemsets with minimal side effects.",
            "A computer model of context-dependent perception in a very simple world.",
            "Prediction of properties of wheat dough using intelligent deep belief networks.",
            "Can genetic algorithms help virus writers reshape their creations and avoid detection?",
            "BrainStorm: a psychosocial game suite design for non-invasive cross-generational cognitive capabilities data collection.",
            "Rough set classification based on quantum logic.",
            "Anthropomorphic reasoning about neuromorphic AGI safety."
        ]
    },
    {
        "name": "JETAI",
        "year": "2016",
        "info": "Volume 28, 2016",
        "count": 55,
        "papers": [
            "A shrinking hypersphere PSO for engineering optimisation problems.",
            "Optimal path planning for a mobile robot using cuckoo search algorithm.",
            "Success rate group search optimiser.",
            "Performance study of evolutionary algorithm for different wavelet filters for satellite image denoising using sub-band adaptive threshold.",
            "Dynamic VMs placement for energy efficiency by PSO in cloud computing.",
            "A multi-objective placement of phasor measurement units using fuzzified artificial bee colony algorithm, considering system observability and voltage stability.",
            "An efficient oscillating inertia weight of particle swarm optimisation for tracking optima in dynamic environments.",
            "Improvement in various radiation characteristics of time modulated linear antenna arrays using evolutionary algorithms.",
            "Escalated convergent artificial bee colony.",
            "Honey bee-inspired algorithms for SNP haplotype reconstruction problem.",
            "A novel global Harmony Search method based on Ant Colony Optimisation algorithm.",
            "A novel approach for the elimination of artefacts from EEG signals employing an improved Artificial Immune System algorithm.",
            "Absolute order-of-magnitude reasoning applied to a social multi-criteria evaluation framework.",
            "Formalisation and logical properties of the maximal ideal recursive semantics for weighted defeasible logic programming.",
            "Computer-aided diagnosis of breast cancer via Gabor wavelet bank and binary-class SVM in mammographic images.",
            "Discovery of spatio-temporal patterns from location-based social networks.",
            "A decision support system to find the best water allocation strategies in a Mediterranean river basin in future scenarios of global change.",
            "Approximate policy iteration using regularised Bellman residuals minimisation.",
            "Fitting primitive shapes in point clouds: a practical approach to improve autonomous underwater grasp specification of unknown objects.",
            "Towards cost reduction of breast cancer diagnosis using mammography texture analysis.",
            "Fully informed artificial bee colony algorithm.",
            "Control of an automated mobile manipulator using artificial immune system.",
            "An improved particle swarm optimiser based on swarm success rate for global optimisation problems.",
            "Prominent feature extraction for review analysis: an empirical study.",
            "A learning approach to the bandwidth multicolouring problem.",
            "An analysis of value function learning with piecewise linear control.",
            "What were we all looking at? Identifying objects of collective visual attention.",
            "A new efficient SIF-based FCIL (SIF-FCIL) mining algorithm in predicting the crime locations.",
            "Mixed continuous/binary quantum-inspired learning system with non-negative least square optimisation for automated design of regularised ensemble extreme learning machines.",
            "Dynamic multi-robot team reconfiguration using weighted voting games.",
            "Endoscopy video summarisation using novel relational motion histogram descriptor and semi-supervised clustering.",
            "Mathematical modelling and analysis of generalised interline power flow controller: an effect of converter location.",
            "A new bio-inspired optimisation algorithm: Bird Swarm Algorithm.",
            "Prediction of dissolved oxygen in River Calder by noise elimination time series using wavelet transform.",
            "Transductive learning with nonlinear flexibility using trace norm minimization and fixed point continuation.",
            "CMOS analogue amplifier circuits optimisation using hybrid backtracking search algorithm with differential evolution.",
            "The minority report: some common assumptions to reconsider in the modelling of the brain and behaviour.",
            "Cognitive robotics.",
            "Probabilistic self-localisation on a qualitative map based on occlusions.",
            "A robot sets a table: a case for hybrid reasoning with different types of knowledge.",
            "An integrated system for interactive continuous learning of categorical knowledge.",
            "Interactive search for action and motion planning with dynamics.",
            "Sensor fusion in the epistemic situation calculus.",
            "Probabilistic reference and grounding with PRAGR for dialogues with robots.",
            "Model-free learning on robot kinematic chains using a nested multi-agent topology.",
            "A kernel-based centroid classifier using hypothesis margin.",
            "Secure clustering and routing for heterogeneous mobile wireless sensor networks with dynamic key management.",
            "Can machines think? A report on Turing test experiments at the Royal Society.",
            "Artificially intelligent recognition of Arabic speaker using voice print-based local features.",
            "Intelligent breast cancer recognition using particle swarm optimization and support vector machines.",
            "Supporting ontology adaptation and versioning based on a graph of relevance.",
            "Multi-objective feature subset selection using mRMR based enhanced ant colony optimization algorithm (mRMR-EACO).",
            "Multi-agent cooperation pursuit based on an extension of AALAADIN organisational model.",
            "In defense of philosophy: a review of Nick Bostrom, Superintelligence: Paths, Dangers, Strategies.",
            "Erratum."
        ]
    },
    {
        "name": "JETAI",
        "year": "2015",
        "info": "Volume 27, 2015",
        "count": 45,
        "papers": [
            "Editors' introduction.",
            "'Real' information is not flat - and why it matters.",
            "Floridi's informational structural realist basis for info-computational modelling of cognizing agents.",
            "Abstraction of levels of abstraction.",
            "Why zombies cannot write significant source code: The Knowledge Game and the art of computer programming.",
            "Levels of abstraction, emergentism and artificial life.",
            "The symbol grounding problem ... remains unsolved.",
            "Which symbol grounding problem should we try to solve?",
            "Why Taddeo and Floridi did not solve the symbol grounding problem.",
            "Is there a logic of information?",
            "Behind the mask: machine morality.",
            "Algorithmicity and programmability in natural computing with the Game of Life as in silico case study.",
            "Human misidentification in Turing tests.",
            "ICE matching, robust and fast feature-based scan matching for an online operation.",
            "On the performance of new local search heuristics for annual crop planning: case study of the Vaalharts irrigation scheme.",
            "Low-rank matrix completion and cellular automaton modelling for interpolation.",
            "ABC-based distance-weighted kNN algorithm.",
            "Argumentation-enabled interest-based personalised recommender system.",
            "An experimentally derived hybrid intelligent tool for analysing and optimising the clad height and melt-pool depth in laser solid freeform fabrication process.",
            "Coupling Gaussian generalised regression neural network and mutable smart bee algorithm to analyse the characteristics of automotive engine coldstart hydrocarbon emission.",
            "Harmonics elimination in multilevel inverter with unequal DC sources by fuzzy-ABC algorithm.",
            "CUD@SAT: SAT solving on GPUs.",
            "A conceptual model for text summarisation based on reader requirements.",
            "Differential evolution combined with clonal selection for dynamic economic dispatch.",
            "Modified self-organising maps with a new topology and initialisation algorithm.",
            "Agent-based modelling of excitation propagation in social media groups.",
            "On the efficacy of chaos-enhanced heuristic walks with nature-based controllers for robust and accurate intelligent search, part A: an experimental analysis.",
            "EOSentiMiner: an opinion-aware system based on emotion ontology for sentiment analysis of Chinese online reviews.",
            "A syntactically informed reordering model for statistical machine translation.",
            "A robotic intelligent wheelchair system based on obstacle avoidance and navigation functions.",
            "Minds versus machines: on Saka's basic blindspot theorem.",
            "A multi-scale non-parametric and parametric hybrid multi-category recognition algorithm with probabilistic outputs.",
            "20th RCRA International workshop on \"Experimental evaluation of algorithms for solving problems with combinatorial explosion\".",
            "A declarative concurrent system for protein structure prediction on GPU.",
            "Yet more planning efficiency: Finite-domain state-variable reformulation.",
            "Effectively solving NP-SPEC encodings by translation to ASP.",
            "Effective plan retrieval in case-based planning for metric-temporal problems.",
            "A Forward-Checking algorithm based on a Generalised Hypertree Decomposition for solving non-binary constraint satisfaction problems.",
            "Improving linear search algorithms with model-based approaches for MaxSAT solving.",
            "Cuckoo search (CS)-NFC-based UPQC for compensating voltage sag of nonlinear load.",
            "A hybrid heuristic workflow scheduling algorithm for cloud computing environments.",
            "Intensity-based statistical features for classification of lungs CT scan nodules using artificial intelligence techniques.",
            "Seeker optimisation (human group optimisation) algorithm with chaos.",
            "A Blackboard-style decision-making system for multi-tier craft control and its evaluation.",
            "Genetic annealing with efficient strategies to improve the performance for the NP-hard and routing problems."
        ]
    },
    {
        "name": "JETAI",
        "year": "2014",
        "info": "Volume 26, 2014",
        "count": 31,
        "papers": [
            "Application of imperialist competitive algorithm and neural networks to optimise the volume fraction of three-parameter functionally graded beams.",
            "Sentiment classification of online reviews: using sentence-based language model.",
            "Reliability of computational experiments on virtualised hardware.",
            "Techniques to enhance efficiency and effectiveness of inductive logic programming systems: the TWEETY approaches.",
            "Trust-based access control for collaborative systems.",
            "To improve the quality of cluster ensembles by selecting a subset of base clusters.",
            "Rough set-based approach for automated discovery of censored production rules.",
            "A hybrid method based on wavelet, ANN and ARIMA model for short-term load forecasting.",
            "An adaptive control scheme for doubly fed induction generators - wind turbine implementation.",
            "Application of firefly algorithm and ANFIS for optimisation of functionally graded beams.",
            "An augmented NSGA-II technique with virtual database to solve the composite generation and transmission expansion planning problem.",
            "Degree of user attention to a webpage based on Baidu Index: an alternative to page view.",
            "A new algorithm for detection of epileptic seizures based on HRV signal.",
            "Evaluation of texture features for automatic detecting butterfly species using extreme learning machine.",
            "Hybrid probabilistic-harmony search algorithm methodology in generation scheduling problem.",
            "Risks of general artificial intelligence.",
            "Autonomous technology and the greater human good.",
            "The errors, insights and lessons of famous AI predictions - and what they mean for the future.",
            "The path to more general artificial intelligence.",
            "Limitations and risks of machine ethics.",
            "Utility function security in artificially intelligent agents.",
            "GOLEM: towards an AGI meta-architecture enabling both goal preservation and radical self-improvement.",
            "Universal empathy and ethical bias for artificial general intelligence.",
            "Bounding the impact of AGI.",
            "Ethics of brain emulations.",
            "Design of water distribution networks using accelerated momentum particle swarm optimisation technique.",
            "An SVM-AdaBoost-based face detection system.",
            "Data classification using the Dempster-Shafer method.",
            "A possibilistic defeasible logic programming approach to argumentation-based decision-making.",
            "Recent advances in the application of computational intelligence techniques in oil and gas reservoir characterisation: a comparative study.",
            "Relative observation for multi-robot collaborative localisation based on multi-source signals."
        ]
    },
    {
        "name": "JETAI",
        "year": "2013",
        "info": "Volume 25, 2013",
        "count": 35,
        "papers": [
            "A reactive and hybrid constraint solver.",
            "Computing higher order exclusion relations in propositional planning.",
            "General vague rough approximation: an extended method of fuzzy knowledge representation.",
            "Psychologically realistic cognitive agents: taking human cognition seriously.",
            "A new suggestion for an irrigation schedule with an artificial neural network.",
            "Energy analysis for an executable program on a single computer based on BP neural network.",
            "3D object recognition technique using multiple 2D views for Arabic sign language.",
            "Boundary query solution using convex hull algorithm.",
            "A knowledge component extraction technology using figures and tables.",
            "DF-LDA tree: a nonlinear multilevel classifier for pattern recognition.",
            "Significance tests or confidence intervals: which are preferable for the comparison of classifiers?",
            "No-wait two stage hybrid flow shop scheduling with genetic and adaptive imperialist competitive algorithms.",
            "A new classifier ensemble methodology based on subspace learning.",
            "Learning linear non-Gaussian networks: A new view from matrix identification.",
            "Naive Bayes text classifiers: a locally weighted learning approach.",
            "People are more comfortable with paradox than commonly believed: paradox in film and fiction.",
            "A whole box of Pandoras: systems, boundaries and free will in quantum theory.",
            "The observer's observer's paradox.",
            "Consciousness is dialetheic.",
            "Epistemic paradox and the logic of acceptance.",
            "A cognitive neuroscience, dual-systems approach to the sorites paradox.",
            "Existence and (E)xistence.",
            "Mind and paradox: paradoxes depend on minds.",
            "The paradoxicality of consciousness: a sketch of a theory.",
            "Unifying and extending hybrid tractable classes of CSPs.",
            "Text feature selection for sentiment classification of Chinese online reviews.",
            "How humans solve the frame problem.",
            "A framework of Voronoi diagram for planning multiple paths in free space.",
            "Bayesian network classifiers for probability-based metrics.",
            "Chaotic electromagnetism-like mechanism algorithm for economic load dispatch of power system.",
            "Metaheuristics: review and application.",
            "Parameter selection in particle swarm optimisation: a survey.",
            "A new fuzzy-based feature selection and hybrid TLA-ANN modelling for short-term load forecasting.",
            "A new hybrid correction method for short-term load forecasting based on ARIMA, SVR and CSA.",
            "Live multilingual thinking machine."
        ]
    },
    {
        "name": "JETAI",
        "year": "2012",
        "info": "Volume 24, 2012",
        "count": 32,
        "papers": [
            "Testing variation of attention capacities in a complex auto-adaptive system: a Stroop task simulation.",
            "Performing complex associations using a generalised bidirectional associative memory.",
            "Using genetic algorithms to create meaningful poetic text.",
            "The pathology of heuristic search in the 8-puzzle.",
            "Considering direct interaction of artificial ant colony foraging simulation and animation.",
            "Theoretic foundations of situating cognitive vision in robots and cognitive systems.",
            "Strategic best-response learning in multiagent systems.",
            "Evaluation of complex security scenarios using defense trees and economic indexes.",
            "Training SVM email classifiers using very large imbalanced dataset.",
            "A forward only counter propagation network-based approach for contraceptive method choice classification task.",
            "Weighted average of one-dependence estimators†.",
            "The reasonability of panpsychism.",
            "Quantifying the exploration performed by metaheuristics.",
            "What humans can't do: a review of Derek Partridge, The Seductive Computer by Derek Partridge.",
            "Special issues on Epistemology of Modelling and Simulation.",
            "From theory to simulation: the dynamic political hierarchy in country virtualisation models.",
            "Game theoretic equilibria and the evolution of learning.",
            "Materia mathematica: models in stem cell biology.",
            "Punctuation and extrapolation: representing a subsurface oil reservoir.",
            "Validation of simulation models.",
            "Philosophical reflections on diagram models and diagrammatic representation.",
            "Inspirational anchors: minimal computational models in cognitive science.",
            "Computational models and information theory.",
            "Special issues on Epistemology of Modelling and Simulation II.",
            "A theory-driven testing methodology for developing scientific software.",
            "Reproducibility in M&S research: issues, strategies and implications for model development environments.",
            "What do animat models model?",
            "Mechanistic explanations and animal model simulations in neuroscience.",
            "Relative uncertainty in term loan projection models: what lenders could tell risk managers.",
            "Modelling and simulating early stopping of RCTs: a case study of early stop due to harm.",
            "Signals, cochlear mechanics and pragmatism: a new vista on human hearing?",
            "Minds, models and mechanisms: a new perspective on intentional psychology."
        ]
    },
    {
        "name": "JETAI",
        "year": "2011",
        "info": "Volume 23, 2011",
        "count": 28,
        "papers": [
            "Advances in Knowledge Discovery and Data Analysis for Artificial Intelligence.",
            "A novel hybrid method for mobile robot path planning in unknown dynamic environment based on hybrid DSm model grid map.",
            "Tracking feature extraction based on manifold learning framework.",
            "Research on the evolutionary game of environmental pollution in system dynamics model.",
            "A comparative analysis of PSO, HPSO, and HPSO-TVAC for data clustering.",
            "Combining least-squares support vector machines for classification of biomedical signals: a case study with knee-joint vibroarthrographic signals.",
            "Incorporating cellular sorting structure for better prediction of protein subcellular locations.",
            "EEG data analysis based on EMD for coma and quasi-brain-death patients.",
            "A Time Delay Neural Network model for simulating eye gaze data.",
            "PCA and neural networks-based soft sensing strategy with application in sodium aluminate solution.",
            "Group level learning and decision making: a simulation of a group of managers.",
            "Cross-partition clustering: revealing corresponding themes across related datasets.",
            "Transformation of optimal planning problems.",
            "Binocular vergence control using disparity energy neurons.",
            "An intrusion detection approach based on multiple rough classifiers integration.",
            "On the importance of breaking ties in the relaxed plan heuristic.",
            "Compression of time series by extracting major extrema.",
            "Psychometric artificial intelligence.",
            "Microcosms for testing common sense reasoning abilities.",
            "Using analogical model formulation with sketches to solve Bennett Mechanical Comprehension Test problems.",
            "A bottom-up complement to the logic-based top-down approach to the story arrangement test.",
            "Analogy perception applied to seven tests of word comprehension.",
            "Emergent command and control architecture for dynamic agent communities.",
            "A semantic framework for automatic generation of computational workflows using distributed data and component catalogues.",
            "Robotic path planning using evolutionary momentum-based exploration.",
            "Human-like learning in a conscious agent.",
            "An evolutionary algorithm for abductive reasoning.",
            "Uncertainty in bipolar preference problems."
        ]
    },
    {
        "name": "JETAI",
        "year": "2010",
        "info": "Volume 22, 2010",
        "count": 15,
        "papers": [
            "Concept learning by example decomposition.",
            "A case-based approach to dialogue systems.",
            "Transforming examples for multiclass boosting.",
            "Warning: statistical benchmarking is addictive. Kicking the habit in machine learning.",
            "Trust-based protocols for regulating online, friend-of-a-friend communities.",
            "Principles for interactive acquisition and validation of workflows.",
            "From soft constraints to bipolar preferences: modelling framework and solving issues.",
            "When to apply the fifth commandment: the effects of parenting on genetic and learning agents.",
            "Reinforcement learning using swarm intelligence-trained neural networks.",
            "Reinforcement learning via approximation of the Q-function.",
            "Modelling and learning user preferences over sets.",
            "Soft constraint problems with uncontrollable variables.",
            "Learning linear operators by coordinated aggregation-based PSO.",
            "Typical models: minimising false beliefs.",
            "A framework to support qualitative reasoning about COAs in a dynamic spatial environment."
        ]
    },
    {
        "name": "JETAI",
        "year": "2009",
        "info": "Volume 21, 2009",
        "count": 16,
        "papers": [
            "Symbolism and enactivism: an experimental test of conflicting approaches to artificial intelligence.",
            "The effect of borderline examples on language learning.",
            "On the influence of imputation in classification: practical issues.",
            "Natural human role in supervising complex control systems.",
            "An empirical study of constraint logic programming and answer set programming solutions of combinatorial problems.",
            "A model for the dynamic coordination of multiple competing goals.",
            "Computational theories of mind, and Fodor's analysis of neural network behaviour.",
            "Finding abstract commonalties of category members.",
            "Modal similarity.",
            "The optimal level of fuzz: case studies in a methodology for psychological research.",
            "On memoryless provers and insincere verifiers.",
            "Solving finite domain constraint hierarchies by local consistency and tree search.",
            "Meta itemset: a new concise representation of frequent itemset.",
            "Self-organisation and emergence in artificial life: concepts and illustrations.",
            "The role of forgetting in the evolution and learning of language.",
            "Modal similarity."
        ]
    },
    {
        "name": "JETAI",
        "year": "2008",
        "info": "Volume 20, 2008",
        "count": 21,
        "papers": [
            "Meta-case-based reasoning: self-improvement through self-understanding.",
            "Linking perception and action through motivation and affect.",
            "Weighting strategy for non-clausal resolution.",
            "Naive Bayes for optimal ranking.",
            "The message management asynchronous backtracking algorithm.",
            "Cumulative learning techniques in production rules with fuzzy hierarchy (PRFH) system.",
            "Effort analysis in signer-independent sign gestures.",
            "The possibility of a pluralist cognitive science.",
            "On the nature of minds, or: truth and consequences.",
            "SAL: an explicitly pluralistic cognitive architecture.",
            "Peirce's abduction and cognition as we know it.",
            "Pluralism, radical pluralism and the politics of the Big Bang.",
            "On a compatibility between emergentism and reductionism.",
            "Pluralism, relativism and the proper use of theories.",
            "Sloughing ontology.",
            "A swan, a pike, and a crawfish walk into a bar.",
            "Beyond red states and blue states in cognitive science.",
            "Agent's actions as a classification criteria for the state space in a learning from rewards system.",
            "Learning communicative actions of conflicting human agents.",
            "Emergent songs by social robots.",
            "An online multi-agent co-operative learning algorithm in POMDPs."
        ]
    },
    {
        "name": "JETAI",
        "year": "2007",
        "info": "Volume 19, 2007",
        "count": 16,
        "papers": [
            "Contextual vocabulary acquisition as computational philosophy and as philosophical computation.",
            "What kind of science is simulation?",
            "Models, simulations, instantiations, and evidence: the case of digital evolution.",
            "The ethics of robot servitude.",
            "After the humans are gone Douglas Engelbart Keynote Address, North American Computers and Philosophy Conference Rensselaer Polytechnic Institute, August, 2006.",
            "Interactivist-constructivist foundations for embodying attention.",
            "Exchange market for complex commodities: search for optimal matches.",
            "Study of classical conditioning in Aplysia through the implementation of computational models of its learning circuit.",
            "The importance of cognitive architectures: an analysis based on CLARION.",
            "A computational architecture for heterogeneous reasoning.",
            "Using traceless genetic programming for solving multi-objective optimization problems.",
            "Three fundamental misconceptions of Artificial Intelligence.",
            "Adaptive dynamic probabilistic networks for distributed uncertainty processing.",
            "An engineering approach to sociable robots.",
            "Arabic writer identification based on hybrid spectral-statistical measures.",
            "A-Brain: a general system for solving data analysis problems."
        ]
    },
    {
        "name": "JETAI",
        "year": "2006",
        "info": "Volume 18, 2006",
        "count": 27,
        "papers": [
            "Opportunistic behaviour in animals and robots.",
            "Performance of software agents in non-transferable payoff group buying.",
            "Modelling social norms in multiagent systems.",
            "Learning and data clustering with an RBF-based spiking neuron network.",
            "Temporal reasoning about composite and/or periodic events.",
            "Human reasoning is heterogeneous - as Jon Barwise informed us.",
            "Models and heterogeneous reasoning.",
            "Using existential graphs to integrate mental logic theory and mental model theory.",
            "The mental possible worlds mechanism and the lobster problem: an analysis of a complex GRE logical reasoning task.",
            "Accounting for a variety of reasoning data within a cognitive architecture.",
            "A logic of categorization.",
            "The order effect in human abductive reasoning: an empirical and computational study.",
            "Heterogeneous reasoning in learning to model.",
            "A self-watching model of analogy-making and perception.",
            "Principled exploitation of behavioural coupling.",
            "A centralized planning technique with temporal constraints and uncertainty for multi-agent systems.",
            "Exploring the fitness landscape and the run-time behaviour of an iterated local search algorithm for cost-based abduction.",
            "The metacognitive loop I: Enhancing reinforcement learning with metacognitive monitoring and control for improved perturbation tolerance||.",
            "Satisfying constraint sets through convex envelopes.",
            "Recent advances in artificial intelligence.",
            "Hand motion tracking and trajectory matching for dynamic hand gesture recognition.",
            "Conversational Strategies in cobber: an Affective Ccbr Framework.",
            "Fuzzy attribute logic over complete residuated lattices.",
            "An algorithm for discovering the frequent closed itemsets in a large database.",
            "Performance of modified differential evolution for optimal design of complex and non-linear chemical processes.",
            "Frequent mining of subgraph structures.",
            "Efficient information theoretic extraction of higher order features for improving neural network-based spam e-mail categorization."
        ]
    },
    {
        "name": "JETAI",
        "year": "2005",
        "info": "Volume 17, 2005",
        "count": 25,
        "papers": [
            "Knowledge discovery: dedicated to Jan M. Zytkow.",
            "Towards structure discovering in video data.",
            "On look-ahead and pathology in decision tree learning.",
            "Network classification.",
            "A machine-discovery approach to the evaluation of hashing techniques.",
            "Generalized disjunction-free representation of frequent patterns with negation.",
            "Hierarchical modelling in searching for complex patterns: constrained sums of information systems.",
            "Measuring expected effects of interventions based on decision rules.",
            "Action rules discovery: system DEAR2, method and experiments.",
            "Enhancing the plausibility of law equation discovery through cross check among multiple scale-type-based models.",
            "Topological representation model for image database query.",
            "Prodigy bidirectional planning.",
            "Co-operation framework of case-based reasoning agents for automated product recommendation.",
            "Changing personalities: towards realistic virtual characters.",
            "Another look at the phenomenon of phase transition.",
            "MFILM: a multi-dimensional fuzzy inductive learning method.",
            "On the complexity of case-based planning.",
            "An efficient LP-based admissible heuristic for cost-based abduction.",
            "Book review of Where mathematics comes from: how the embodied mind brings mathematics into Being edited by G. Lakoff and R. Nuñez, Basic Books, 2000, pp. 493.",
            "From apples and oranges to symbolic dynamics: a framework for conciliating notions of cognitive representation.",
            "How we learn about things we don't already understand.",
            "The implications of advances in research on motivation for cognitive models.",
            "Implementation is semantic interpretation: further thoughts.",
            "Solving the symbol grounding problem: a critical review of fifteen years of research.",
            "Re-representation in comparison: building an empirical case."
        ]
    },
    {
        "name": "JETAI",
        "year": "2004",
        "info": "Volume 16, 2004",
        "count": 14,
        "papers": [
            "Where are all the cockroaches?",
            "The effects of co-operation on multiagent search in task-oriented domains.",
            "Dynamics of an artificial immune network.",
            "The role of aesthetics in problem solving: some observations and a manifesto.",
            "Co-operative scheduling for a resource-bounded multiagent planning system.",
            "Automatic evaluation and selection of problem-solving methods: theory and experiments.",
            "Distributed singleton consistency.",
            "Some approaches to analogical mapping with structure-sensitive distributed representations.",
            "IBR retrieval method based on topology preserving mappings.",
            "Applying machine learning to programming by demonstration.",
            "Hybrid AI/control system interactions and analysis.",
            "Making meaning happen.",
            "On-policy concurrent reinforcement learning.",
            "The theory and practice of intention reconsideration."
        ]
    },
    {
        "name": "JETAI",
        "year": "2003",
        "info": "Volume 15, 2003",
        "count": 28,
        "papers": [
            "Towards a unified account of supervised and unsupervised category learning.",
            "Consistent subsets of inconsistent systems: structure and behaviour.",
            "A case study in the meta-reasoning procedure ND.",
            "Visual perception modelling for intelligent virtual driver agents in synthetic driving simulation.",
            "Ant-Tree: an ant colony optimization approach to the generalized minimum spanning tree problem.",
            "Effective Memory' and Turing's model of mind.",
            "Are receptors representations?",
            "Cognitive evolutionary psychology without representational nativism.",
            "Bridging the cognitive-cellular neuroscience gap empirically: a study combining physiology, modelling and fMRI.",
            "Computation and cognition.",
            "The role of computation in scientific cognition.",
            "Epistemology's search for significance.",
            "Know how, knowledge that and the requirement of conscious intent.",
            "On explaining phenomenal consciousness.",
            "Life at the borders: habits, addictions and self-control.",
            "Questions about functionalism in Kant's philosophy of mind: lessons for cognitive science.",
            "The computational limits to the cognitive power of the neuroidal tabula rasa.",
            "Target recognition by components for mobile robot navigation.",
            "Recognition of handwritten Hindu numerals using structural descriptors.",
            "Time-series analysis with neural networks and ARIMA-neural network hybrids.",
            "Design and comparison of lattices of topological relations for spatial representation and reasoning.",
            "Editorial.",
            "Planning under uncertainty as Golog programs.",
            "Formal verification of multi-agent systems behaviour emerging from cognitive task analysis.",
            "Understanding as an interpretation in a shape understanding system.",
            "Multiple-agents to identify and separate touching digits in unconstrained handwritten Hindi numerals.",
            "Structuring global responses of local filters using lateral connections.",
            "Analogical projection in pattern perception."
        ]
    },
    {
        "name": "JETAI",
        "year": "2002",
        "info": "Volume 14, 2002",
        "count": 19,
        "papers": [
            "The myth of the Turing machine: the failings of functionalism and related theses.",
            "Why Turing machine equivalence is (still) important in cognitive science: a reply to Eliasmith.",
            "Making symbols matter: a new challenge to their causal efficacy.",
            "Philosophy, engineering, biology, and history: a vindication of Turing's views about the distinction between the cognitive and physical sciences.",
            "Too many instincts: contrasting philosophical views on intelligence in humans and non-humans.",
            "Forms of meaning, meaning of forms.",
            "Concept lattice-based knowledge discovery in databases.",
            "Why can concept lattices support knowledge discovery in databases?",
            "Functional and approximate dependency mining: database and FCA points of view.",
            "Generating frequent itemsets incrementally: two novel approaches based on Galois lattice theory.",
            "Concept lattice based composite classifiers for high predictability.",
            "ZooM: a nested Galois lattices-based system for conceptual clustering.",
            "Comparing performance of algorithms for generating concept lattices.",
            "A fast incremental algorithm for building lattices.",
            "Compressed pseudo-lattices.",
            "Why do we talk to ourselves?",
            "Argumentation through a distributed self-stabilizing approach.",
            "The interaction of representations and planning objectives for decision-theoretic planning tasks.",
            "Contextualizing concepts using a mathematical generalization of the quantum formalism."
        ]
    },
    {
        "name": "JETAI",
        "year": "2001",
        "info": "Volume 13, 2001",
        "count": 20,
        "papers": [
            "AI, concepts, and the paradox of mental representation, with a brief discussion of psychological essentialism.",
            "What's in a symbol: ontology, representation and language.",
            "On the role of search for learning from examples.",
            "Causal reversibility in Bayesian networks.",
            "Introspective reasoning for index refinement in case-based reasoning.",
            "Concepts: Fodor's little semantic BBs of thought A critical look at Fodor's theory of concepts.",
            "Evaluating success in autonomous multi-robot teams: experiences from ALLIANCE architecture implementations.",
            "Default logic and specification of nonmonotonic reasoning.",
            "On an open problem in classification of languages.",
            "MEXICA: A computer model of a cognitive account of creative writing.",
            "Mixing expressiveness and efficiency in a manufacturing planner.",
            "Banbury bound or Can a machine be conscious?",
            "GD-SAT model and crossover line.",
            "Error dynamics: the dynamic emergence of error avoidance and error vicariants.",
            "Parallel planning via the distribution of operators.",
            "Cognitive task analysis: a proposal to model reactive behaviours.",
            "Q-Learning: computation of optimal Q-values for evaluating the learning level in robotic tasks.",
            "Term rewriting and its application to recognizing handwritten Hindu numerals.",
            "Inference of causal structure using the unobservable.",
            "Some experimental evidence on the performance of GA-designed neural networks."
        ]
    },
    {
        "name": "JETAI",
        "year": "2000",
        "info": "Volume 12, 2000",
        "count": 33,
        "papers": [
            "Distribution-balanced stratified cross-validation for accuracy estimation.",
            "Transcending the meat: immersive technologies and computer mediated bodies.",
            "Anytime coalition structure generation: an average case study.",
            "Some methodological aspects of tacit knowledge elicitation.",
            "Perceptrons with polynomial post-processing.",
            "Explaining by evidence.",
            "Robustness of decentralized knowledge systems: a grammar-theoretic view.",
            "A study of a dynamic progressive reasoning system.",
            "Introduction to autonomy control software.",
            "Dynamic adaptive autonomy in multi-agent systems.",
            "Grounding autonomy adjustment on delegation and trust theory.",
            "The effects of uncertainty on plan success in a simulated maintenance robot domain.",
            "Cross-paradigm analysis of autonomous agent architecture.",
            "Engineering characteristics of autonomous agent architectures.",
            "Evaluating robustness in a two layer simulated robot architecture.",
            "Pre-emptive versus non-pre-emptive real time scheduling in intelligent mobile robotics.",
            "Introduction to the special issue on philosophical foundations of artificial intelligence.",
            "Prolegomena to any future artificial moral agent.",
            "Consciousness, intentionality and intelligence: some foundational issues for artificial intelligence.",
            "Contextual reasoning distilled.",
            "A refutation of Penrose's Gödelian case against artificial intelligence.",
            "Peeking behind the screen: the unsuspected power of the standard Turing Test.",
            "Free will - even for robots.",
            "Producing mind.",
            "A counter-example to all future dynamic systems theories of cognition.",
            "Formal software development in the Verification Support Environment (VSE).",
            "Validation and verification of intelligent systems - what are they and how are they different?",
            "Towards validation and refinement of rule-based systems.",
            "Applying formal concepts to learning systems validation.",
            "Abstraction and composition: a verification method for co-operating systems.",
            "Validation method for intelligent systems.",
            "A case study in the mechanical verification of fault tolerance.",
            "Towards dependable development tools for embedded systems: a case study in software verification."
        ]
    },
    {
        "name": "JETAI",
        "year": "1999",
        "info": "Volume 11, 1999",
        "count": 30,
        "papers": [
            "Introduction to the special issue on time and temporal reasoning.",
            "Changing times: a causal theory of probabilistic temporal reasoning.",
            "Handling contingency in temporal constraint networks: from consistency to controllabilities.",
            "Knowledge representation with multiple logical theories and time.",
            "A clausal resolution method for CTL branching-time temporal logic.",
            "Removing irrelevant information in temporal resolution proofs.",
            "Knowledge-based temporal interpolation.",
            "Fodor's gloom or What does it mean that dualism seems true?",
            "Setting up a real 'Chinese Room': an empirical replication of a famous thought experiment.",
            "Complexity studies of a temporal constraint propagation algorithm: a statistical analysis.",
            "Precise induction from statistical data.",
            "A practical measure of the information in a logical theory.",
            "A planning language for embedded systems.",
            "TD(lambda) learning without eligibility traces: a theoretical analysis.",
            "A framework for building knowledge-bases under uncertainty.",
            "Introduction to the special issue on memory-based language processing.",
            "Integrating case-based learning and cognitive biases for machine learning of natural language.",
            "Careful abstraction from instance families in memory-based language learning.",
            "A memory-based approach to learning shallow natural language patterns.",
            "The hidden dimension: a paradigmatic view of data-driven NLP.",
            "A memory-based model of syntactic analysis: data-oriented parsing.",
            "A hybrid architecture for robust MT using LFG-DOP.",
            "Dynamic systems and paradise regained or how to avoid being a calculator.",
            "A new approach to applicable memory-based reasoning.",
            "Are AI and mechanics empirical disciplines?",
            "Extruding intentionality from the metaphysical flux.",
            "An individualistic approach to social action in multi-agent systems.",
            "Is MT translation? Reflections on a recent assault.",
            "The functions of finite support: a canonical learning problem.",
            "Embedding prioritized circumscription in disjunctive logic programs."
        ]
    },
    {
        "name": "JETAI",
        "year": "1998",
        "info": "Volume 10, 1998",
        "count": 32,
        "papers": [
            "Introduction to non-standard constraint processing.",
            "Extending HCLP with partially ordered hierarchies and composite constraints.",
            "Constraint updating.",
            "Fine-grained conflict resolution in constraint satisfaction problems.",
            "Approximate algorithms for generalized maximum utility problems.",
            "Constraint propagation for ordering, abstraction, and aggregation relations.",
            "Constraint satisfaction for robust parsing of spoken language.",
            "Handling structured and ambiguous constraints in constraint satisfaction problems.",
            "Learning solution preferences in constraint problems.",
            "CSPs with counters: a likelihood-based heuristic.",
            "Solving hierarchies of finite-domain constraints.",
            "Using Bayesian belief networks for the automated assessment of students' knowledge of geometry problem solving procedures.",
            "Levels of representationality.",
            "Using neural network learning in an Othello evaluation function.",
            "Analogy just looks like high level perception: why a domain-general approach to analogical mapping is right.",
            "AI models of verbal/conceptual analogy.",
            "Distributed artificial intelligence and machine learning-from coexistence to cooperation.",
            "Learning nested agent models in an information economy.",
            "Model-based learning of interaction strategies in multi-agent systems.",
            "Individual learning of coordination knowledge.",
            "Using communication to reduce locality in distributed multiagent learning.",
            "People are not computers: (most) thought processes are not computational procedures.",
            "Computationalism is dead; now what?",
            "How minds can be computational systems.",
            "A sound and complete proof theory for the generalized logic of only knowing.",
            "A situation-theoretic account of nonmonotonic reasoning.",
            "Two-agent IDA*.",
            "Artificial intelligence and other approaches to speech understanding: reflections on methodology.",
            "Studying properties of classes of default logics.",
            "A note on the cumulativity of justified default logic.",
            "Independency relationships and learning algorithms for singly connected networks.",
            "Semantical considerations on intention dynamics for BDI agents."
        ]
    },
    {
        "name": "JETAI",
        "year": "1997",
        "info": "Volume 9, 1997",
        "count": 31,
        "papers": [
            "Metaphor as change of representation: an artificial intelligence perspective.",
            "On planning while Executing in stationary environments.",
            "The Transition Calculus: a high-level formalism for reasoning about action and change.",
            "Adding upper-bound pruning to IDA*.",
            "A quantitative analysis of pattern production and its relationship to expert performance.",
            "Description-based communication for autonomous agents under ideal conditions.",
            "Strong monotonic and set-driven inductive inference.",
            "Pragmatics & Cognition announces a special issue on The Concept of Reference in the Cognitive Sciences.",
            "Software architectures for hardware agents.",
            "Software architectures for hardware agents.",
            "The NIST Real-time Control System (RCS): an approach to intelligent systems research.",
            "AuRA: principles and practice in review.",
            "Lessons learned in integrating sensing into autonomous mobile robot architectures.",
            "An emergent approach to systems of physical agents.",
            "The Saphira architecture: a design for autonomy.",
            "Experiences with an architecture for intelligent, reactive agents.",
            "Software and hardware architecture of advanced mobile robots for manufacturing.",
            "Visual architecture and cognitive architecture.",
            "Minimalism Distribution Supermodularity.",
            "Behaviour-based control: examples from navigation, learning, and group behaviour.",
            "Robotics and artificial intelligence.",
            "DAMN: a distributed architecture for mobile navigation.",
            "Logical sensor/actuator: knowledge-based robotic plan execution.",
            "Supervenient hierarchies of behaviours-from robot vacuuming to space telerobotics.",
            "Tropism-based cognition: a novel software architecture for agents in colonies.",
            "A flexible architecture for autonomous agents.",
            "Are we wrong about representation?",
            "Will zombies talk about consciousness ?-The paradox of phenomenal judgment: its implications for naturalistic dualism and other theories of mind.",
            "Identification of faces obscured by noise: comparison of an artificial neural network with human observers.",
            "Exploiting domain geometry in analogical route planning.",
            "Approximate reasoning with credible subsets."
        ]
    },
    {
        "name": "JETAI",
        "year": "1996",
        "info": "Volume 8, 1996",
        "count": 24,
        "papers": [
            "Editorial AI, Situatedness, Creativity, and Intelligence; or the Evolution of the Little Hearing Bones.",
            "Hierarchical model and communication by signs, signals and symbols in multiagent environments.",
            "An assumption-based truth maintenance system dealing with non-ground justifications.",
            "An action-oriented perspective of learning in classifier systems.",
            "Backtracking along with constraint processing and their time complexities.",
            "Unifying time and uncertainty for diagnosis.",
            "Fodor, functions, physics, and fantasyland: is AI a Mickey Mouse discipline?",
            "AI rules: okay?",
            "A note on achieving low-level rationality from pure reactivity.",
            "Learning nested concept classes with limited storage.",
            "A domain-specific software architecture for a class of intelligent patient monitoring agents.",
            "Dealing with expected and unexpected obstacles.",
            "A new class of theories for which circumscription can be obtained via the predicate completion.",
            "Editorial The Right Stuff.",
            "Functions of expertise in a medical intensive care unit.",
            "Providing multiple 'ways in' to expertise for learners with different backgrounds : When it works and what it suggests about adult cognitive development.",
            "Using conscious reflection, group processes, and AI to facilitate development of expertise.",
            "Studying human expertise: Beyond the binary paradigm.",
            "Using programming expertise for controlling software synthesis.",
            "Experience, introspection and expertise: Learning to refine the case-based reasoning process.",
            "Software-effort estimation with a case-based reasoner.",
            "Confusion, social knowledge and the design of intelligent machines.",
            "The case against AI from imagistic expertise.",
            "Developmental aspects of expertise: Rationality and generalization."
        ]
    },
    {
        "name": "JETAI",
        "year": "1995",
        "info": "Volume 7, 1995",
        "count": 24,
        "papers": [
            "Experimental AI systems.",
            "The TRAINS project: a case study in building a conversational planning agent.",
            "Inductive text classification for medical applications.",
            "Integrating planning and learning: the PRODIGY architecture.",
            "Planning and reacting in uncertain and dynamic environments.",
            "AI and the mechanistic forces of darkness.",
            "Generalization versus classification.",
            "A rough set approach to reasoning under uncertainty.",
            "Underconstrained knowledge-intensive constraint satisfaction search.",
            "The development and application of a knowledge modelling technique.",
            "Heuristic improvement through triangulation.",
            "The observers' paradox: apparent computational complexity in physical systems.",
            "Taking the paradox out of the observer's paradox.",
            "Observables, measurements, and virtual machines.",
            "The paradox of observation and the observation of paradox.",
            "The role of the frame problem in Fodor's modularity thesis: a case study of rationalist cognitive science.",
            "Inductive learning and defeasible inference.",
            "On generalization/specialization for conceptual graphs.",
            "Teams in cooperating grammar systems.",
            "Is there an alternative to parsimonious semantics?",
            "On computational social laws for dynamic non-homogeneous social structures.",
            "On the relationship between annotated logic programs and nonmonotonic formalisms.",
            "Abduction, experience, and goals: a model of everyday abductive explanation.",
            "Practical abduction: characterization, decomposition and concurrency."
        ]
    },
    {
        "name": "JETAI",
        "year": "1994",
        "info": "Volume 6, 1994",
        "count": 20,
        "papers": [
            "Infinitary self-reference in learning theory.",
            "Spatial/kinematic domain and lattice computers.",
            "The power of probabilism in Popperian FINite learning.",
            "An inductive inference approach to classification.",
            "Characterization of language learning front informant under various monotonicity constraints.",
            "Weakening the language bias in LINUS.",
            "Predicate invention and utilization.",
            "Ignoring data may be the only way to learn efficiently.",
            "Is there a prototypical rule of abduction? (Yes, e.g. in proximity based explanations).",
            "Information and evidence in logic systems.",
            "A deductive clustering approach.",
            "A metalogic programming approach: language, semantics and applications.",
            "Overfitting revisited: an information-theoretic approach to simplifying discrimination trees.",
            "Local multi-valued logics in modular expert systems.",
            "Editorial AI and the tyranny of Galen, or Why evolutionary psychology and cognitive ethology are important to artificial intelligence.",
            "Theoretical analyses of cross-validation error and voting in instance-based learning.",
            "A theory of cross-validation error.",
            "Imagination and situated cognition.",
            "Relating only knowing to minimal belief and negation as failure.",
            "Constructivism versus realism, or constructivism and realism."
        ]
    },
    {
        "name": "JETAI",
        "year": "1993",
        "info": "Volume 5, 1993",
        "count": 23,
        "papers": [
            "Single-phase agreements among rational agents.",
            "Case-based reasoning assisted explanation of genetic algorithm results.",
            "Verifying plans for multiple agents.",
            "Causal inference as a cognitive strategy.",
            "Dretske, representation, and the mental/non-mental distinction.",
            "Special Issue on Propositional Knowledge Representation.",
            "Propositional attitude framework requirements.",
            "Connectionist meta-representation for propositional attitudes.",
            "Using hypothetical reasoning as a method for belief ascription.",
            "SNePSwD: A newcomer to the SNePS family.",
            "Propositional and terminological knowledge representations.",
            "Deductive efficiency, belief revision and acting.",
            "Representing reified relations in Loom.",
            "Propositionally representing incomplete knowledge about existence.",
            "SnePSR - A SNePS with resources.",
            "The STRICT assumption: a propositional approach to change.",
            "Belief spaces as sets of propositions.",
            "Logical foundations for representing object-oriented systems.",
            "Reference and intensions.",
            "On why constructivism does not yield relativism.",
            "Representational content in humans and machines.",
            "Graph decompositions and tree automata in reasoning with uncertainty.",
            "Modelling cyclicity and generalized cost-based abduction using linear constraint satisfaction."
        ]
    },
    {
        "name": "JETAI",
        "year": "1992",
        "info": "Volume 4, 1992",
        "count": 21,
        "papers": [
            "Connectionism and functionalism: the importance of being a subsymbolist.",
            "On the semantics of inheritance networks.",
            "Analysis system for Sinhalese unit structure.",
            "Abstract symbol systems - an exercise of the bottom-up approach in artificial intelligence.",
            "Handling noise in EBL: an abductive approach.",
            "Conceptual graph overview.",
            "Incremental planning using conceptual graphs.",
            "A comprehensive conceptual analysis using ER and conceptual graphs.",
            "Conceptual graph matching: a flexible algorithm and experiments.",
            "Towards compatible primitive structures.",
            "A hybrid model for indexical use in natural language.",
            "Speech acts in a connected discourse: a computational representation based on conceptual graph theory.",
            "Temporal, spatial, and constraint handling in the Conceptual Programming environment, CP.",
            "High-level perception, representation, and analogy: a critique of artificial intelligence methodology.",
            "Acquiring object-knowledge.",
            "Revision in ACMS.",
            "Human reasoning about artificial intelligence.",
            "A probabilistic perceptron learning algorithm.",
            "Strong separation of learning classes.",
            "Connectionism and artificial intelligence: history and philosophical interpretation.",
            "Adaptive-predictive game-playing programs."
        ]
    },
    {
        "name": "JETAI",
        "year": "1991",
        "info": "Volume 3, 1991",
        "count": 22,
        "papers": [
            "Syntactical models of distributed cooperative systems.",
            "Cooperating/distributed grammar systems with hypothesis languages.",
            "Extending resolution to resolution logics.",
            "Adaptive search through constraint violations.",
            "Data modeling: a process for pattern induction.",
            "Parallel optimization of tree structures for natural language parsing.",
            "An interval-based temporal relational calculus for events with gaps.",
            "Parallel implementation of a class reasoner.",
            "An experimental study of criteria for hypothesis plausibility.",
            "Semantics in analogical reasoning.",
            "Solipsism, individualism and cognitive science.",
            "Tractability and artificial intelligence.",
            "The gap between abstract and concrete results in machine learning.",
            "On the physical limitations of pattern matching.",
            "Qualitative physics: towards the automation of systems problem solving.",
            "Do computer simulations really cognize?",
            "Negotiation in a non-cooperative environment.",
            "Searle's AI program.",
            "Inductive rule generation and interpretation.",
            "Searching graphs using mixed strategies.",
            "Is the connectionist-logicist clash one of AI's wonderful red herrings?",
            "Ordered seminormal default theories and their extensions."
        ]
    },
    {
        "name": "JETAI",
        "year": "1990",
        "info": "Volume 2, 1990",
        "count": 20,
        "papers": [
            "Co-operation of syntax and semantics in flexive languages.",
            "Knowledge representation issues in default reasoning.",
            "An analysis of expected-outcome.",
            "Reasoning situated in time I: basic concepts.",
            "Representational issues in genetic optimization.",
            "Information synthesis based on hierarchical maximum entropy discretization.",
            "Accelerating search in function induction.",
            "A modular translation from defeasible nets to defeasible logics.",
            "Holland's schema theorem disproved?",
            "Searle's extension of the Chinese room to connectionist machines.",
            "GENITOR II: a distributed genetic algorithm.",
            "Distributed symbol formation and processing in connectionist networks.",
            "On learning and testing evaluation functions.",
            "Requiem for a theory: the ' story grammar' story.",
            "Coordination and control structures and processes: possibilities for connectionist networks (CN).",
            "Intentionality and computationalism: minds, machines, Searle and Harnad.",
            "Lost in the hermeneutic hall of mirrors.",
            "Finding lost minds.",
            "Modal queries about partially-ordered plans.",
            "Improving the efficiency of rule-based expert systems by rule activation."
        ]
    },
    {
        "name": "JETAI",
        "year": "1989",
        "info": "Volume 1, 1989",
        "count": 21,
        "papers": [
            "Experimental and theoretical artificial intelligence.",
            "Minds, machines and Searle.",
            "Explanation-based learning: its role in problem solving.",
            "The recognition and classification of concepts in understanding scientific texts.",
            "Exploring the No-Function-In-Structure principle.",
            "Generating plausible diagnostic hypotheses with self-processing causal networks.",
            "Organizing and integrating edge segments for texture discrimination.",
            "Towards a paradigm shift in belief representation methodology.",
            "The graph of a boolean function.",
            "Consequences of nonclassical measurement for the algorithmic description of continuous dynamical systems.",
            "Principles of continuous analogical reasoning.",
            "Philosophical issues in Edelman's Neural Darwinism.",
            "OSCAR: a general theory of rationality.",
            "The a priori meaningfulness measure and resolution theorem proving.",
            "Problem-solving architecture at the knowledge level.",
            "Commentary on Jon Sticklen's 'Problem-solving architecture at the knowledge level'.",
            "Below the knowledge level architecture.",
            "Decomposing meat: a commentary on Sticklen's 'problem-solving architecture at the knowledge level'.",
            "Reply to commentaries on 'problem-solving architecture at the knowledge level'.",
            "Natural language analysis by stochastic optimization: a progress report on Project APRIL.",
            "On designing a visual system (Towards a Gibsonian computational model of vision)."
        ]
    }
]