[
    {
        "name": "JMLR",
        "year": "2022",
        "info": "Volume 23: 2022",
        "count": 57,
        "papers": [
            "Joint Estimation and Inference for Data Integration Problems based on Multiple Multi-layered Gaussian Graphical Models.",
            "Debiased Distributed Learning for Sparse Partial Linear Models in High Dimensions.",
            "Recovering shared structure from multiple networks with unknown edge distributions.",
            "Exploiting locality in high-dimensional Factorial hidden Markov models.",
            "Empirical Risk Minimization under Random Censorship.",
            "XAI Beyond Classification: Interpretable Neural Clustering.",
            "Bayesian Multinomial Logistic Normal Models through Marginally Latent Matrix-T Processes.",
            "Deep Learning in Target Space.",
            "Scaling Laws from the Data Manifold Dimension.",
            "Interpolating Predictors in High-Dimensional Factor Regression.",
            "Near Optimality of Finite Memory Feedback Policies in Partially Observed Markov Decision Processes.",
            "Approximate Information State for Approximate Planning and Reinforcement Learning in Partially Observed Systems.",
            "Solving Large-Scale Sparse PCA to Certifiable (Near) Optimality.",
            "On Generalizations of Some Distance Based Classifiers for HDLSS Data.",
            "A Stochastic Bundle Method for Interpolation.",
            "TFPnP: Tuning-free Plug-and-Play Proximal Algorithms with Applications to Inverse Imaging Problems.",
            "Spatial Multivariate Trees for Big Data Bayesian Regression.",
            "Decimated Framelet System on Graphs and Fast G-Framelet Transforms.",
            "Universal Approximation in Dropout Neural Networks.",
            "Supervised Dimensionality Reduction and Visualization using Centroid-Encoder.",
            "Evolutionary Variational Optimization of Generative Models.",
            "LSAR: Efficient Leverage Score Sampling Algorithm for the Analysis of Big Time Series Data.",
            "Fast and Robust Rank Aggregation against Model Misspecification.",
            "On Biased Stochastic Gradient Estimation.",
            "Efficient MCMC Sampling with Dimension-Free Convergence Rate using ADMM-type Splitting.",
            "MurTree: Optimal Decision Trees via Dynamic Programming and Search.",
            "Data-Derived Weak Universal Consistency.",
            "Novel Min-Max Reformulations of Linear Inverse Problems.",
            "Theoretical Convergence of Multi-Step Model-Agnostic Meta-Learning.",
            "A Class of Conjugate Priors for Multinomial Probit Models which Includes the Multivariate Normal One.",
            "An improper estimator with optimal excess risk in misspecified density estimation and logistic regression.",
            "Active Learning for Nonlinear System Identification with Guarantees.",
            "Model Averaging Is Asymptotically Better Than Model Selection For Prediction.",
            "SODEN: A Scalable Continuous-Time Survival Model through Ordinary Differential Equation Networks.",
            "Optimality and Stability in Non-Convex Smooth Games.",
            "Accelerated Zeroth-Order and First-Order Momentum Methods from Mini to Minimax Optimization.",
            "Projected Statistical Methods for Distributional Data on the Real Line with the Wasserstein Metric.",
            "Score Matched Neural Exponential Families for Likelihood-Free Inference.",
            "(f, Gamma)-Divergences: Interpolating between f-Divergences and Integral Probability Metrics.",
            "Structure-adaptive Manifold Estimation.",
            "The correlation-assisted missing data estimator.",
            "Approximation and Optimization Theory for Linear Continuous-Time Recurrent Neural Networks.",
            "Sampling Permutations for Shapley Value Estimation.",
            "PAC Guarantees and Effective Algorithms for Detecting Novel Categories.",
            "Optimal Transport for Stationary Markov Chains via Policy Iteration.",
            "Beyond Sub-Gaussian Noises: Sharp Concentration Analysis for Stochastic Gradient Descent.",
            "Cascaded Diffusion Models for High Fidelity Image Generation.",
            "Overparameterization of Deep ResNet: Zero Loss and Mean-field Analysis.",
            "Innovations Autoencoder and its Application in One-class Anomalous Sequence Detection.",
            "Analytically Tractable Hidden-States Inference in Bayesian Neural Networks.",
            "Toolbox for Multimodal Learn (scikit-multimodallearn).",
            "LinCDE: Conditional Density Estimation via Lindsey's Method.",
            "DoubleML - An Object-Oriented Implementation of Double Machine Learning in Python.",
            "SMAC3: A Versatile Bayesian Optimization Package for Hyperparameter Optimization.",
            "Bayesian Pseudo Posterior Mechanism under Asymptotic Differential Privacy.",
            "solo-learn: A Library of Self-supervised Methods for Visual Representation Learning.",
            "Inherent Tradeoffs in Learning Fair Representations."
        ]
    },
    {
        "name": "JMLR",
        "year": "2021",
        "info": "Volume 22: 2021",
        "count": 290,
        "papers": [
            "On the Optimality of Kernel-Embedding Based Goodness-of-Fit Tests.",
            "Domain Generalization by Marginal Transfer Learning.",
            "Regulating Greed Over Time in Multi-Armed Bandits.",
            "An Empirical Study of Bayesian Optimization: Acquisition Versus Partition.",
            "The Decoupled Extended Kalman Filter for Dynamic Exponential-Family Factorization Models.",
            "Consistent estimation of small masses in feature sampling.",
            "Preference-based Online Learning with Dueling Bandits: A Survey.",
            "A Unified Framework for Random Forest Prediction Error Estimation.",
            "Convex Clustering: Model, Theoretical Guarantee and Efficient Algorithm.",
            "Mixing Time of Metropolis-Hastings for Bayesian Community Detection.",
            "Unfolding-Model-Based Visualization: Theory, Method and Applications.",
            "Global and Quadratic Convergence of Newton Hard-Thresholding Pursuit.",
            "Homogeneity Structure Learning in Large-scale Panel Data with Heavy-tailed Errors.",
            "On Multi-Armed Bandit Designs for Dose-Finding Trials.",
            "Simple and Fast Algorithms for Interactive Machine Learning with Random Counter-examples.",
            "Pykg2vec: A Python Library for Knowledge Graph Embedding.",
            "Continuous Time Analysis of Momentum Methods.",
            "A Unified Sample Selection Framework for Output Noise Filtering: An Error-Bound Perspective.",
            "Ranking and synchronization from pairwise measurements via SVD.",
            "Aggregated Hold-Out.",
            "A Fast Globally Linearly Convergent Algorithm for the Computation of Wasserstein Barycenters.",
            "When random initializations help: a study of variational inference for community detection.",
            "A Two-Level Decomposition Framework Exploiting First and Second Order Information for SVM Training Problems.",
            "Entangled Kernels - Beyond Separability.",
            "Generalization Performance of Multi-pass Stochastic Gradient Descent with Convex Loss Functions.",
            "Finite Time LTI System Identification.",
            "Inference In High-dimensional Single-Index Models Under Symmetric Designs.",
            "Tsallis-INF: An Optimal Algorithm for Stochastic and Adversarial Bandits.",
            "Single and Multiple Change-Point Detection with Differential Privacy.",
            "A Review of Robot Learning for Manipulation: Challenges, Representations, and Algorithms.",
            "FLAME: A Fast Large-scale Almost Matching Exactly Approach to Causal Inference.",
            "Learning interaction kernels in heterogeneous systems of agents from multiple trajectories.",
            "Asynchronous Online Testing of Multiple Hypotheses.",
            "Neighborhood Structure Assisted Non-negative Matrix Factorization and Its Application in Unsupervised Point-wise Anomaly Detection.",
            "Learning and Planning for Time-Varying MDPs Using Maximum Likelihood Estimation.",
            "Multi-class Gaussian Process Classification with Noisy Inputs.",
            "A Bayesian Contiguous Partitioning Method for Learning Clustered Latent Variables.",
            "Risk-Averse Learning by Temporal Difference Methods with Markov Risk Measures.",
            "giotto-tda: : A Topological Data Analysis Toolkit for Machine Learning and Data Exploration.",
            "Residual Energy-Based Models for Text.",
            "From Fourier to Koopman: Spectral Methods for Long-term Time Series Prediction.",
            "High-Order Langevin Diffusion Yields an Accelerated MCMC Algorithm.",
            "Banach Space Representer Theorems for Neural Networks and Ridge Splines.",
            "Wasserstein barycenters can be computed in polynomial time in fixed dimension.",
            "RaSE: Random Subspace Ensemble Classification.",
            "Optimal Structured Principal Subspace Estimation: Metric Entropy and Minimax Rates.",
            "Understanding Recurrent Neural Networks Using Nonequilibrium Response Theory.",
            "Optimal Feedback Law Recovery by Gradient-Augmented Sparse Polynomial Regression.",
            "From Low Probability to High Confidence in Stochastic Convex Optimization.",
            "Structure Learning of Undirected Graphical Models for Count Data.",
            "Projection-free Decentralized Online Learning for Submodular Maximization over Time-Varying Networks.",
            "Sparse and Smooth Signal Estimation: Convexification of L0-Formulations.",
            "Subspace Clustering through Sub-Clusters.",
            "GemBag: Group Estimation of Multiple Bayesian Graphical Models.",
            "Integrative Generalized Convex Clustering Optimization and Feature Selection for Mixed Multi-View Data.",
            "Incorporating Unlabeled Data into Distributionally Robust Learning.",
            "Normalizing Flows for Probabilistic Modeling and Inference.",
            "Estimation and Inference for High Dimensional Generalized Linear Models: A Splitting and Smoothing Approach.",
            "Predictive Learning on Hidden Tree-Structured Ising Models.",
            "A Distributed Method for Fitting Laplacian Regularized Stratified Models.",
            "Stochastic Proximal AUC Maximization.",
            "How to Gain on Power: Novel Conditional Independence Tests Based on Short Expansion of Conditional Mutual Information.",
            "Geometric structure of graph Laplacian embeddings.",
            "Sparse Tensor Additive Regression.",
            "Dynamic Tensor Recommender Systems.",
            "Approximate Newton Methods.",
            "A General Framework for Empirical Bayes Estimation in Discrete Linear Exponential Family.",
            "Path Length Bounds for Gradient Descent and Flow.",
            "Determining the Number of Communities in Degree-corrected Stochastic Block Models.",
            "Testing Conditional Independence via Quantile Regression Based Partial Copulas.",
            "Phase Diagram for Two-layer ReLU Neural Networks at Infinite-width Limit.",
            "Prediction against a limited adversary.",
            "Optimization with Momentum: Dynamical, Control-Theoretic, and Symplectic Perspectives.",
            "Kernel Operations on the GPU, with Autodiff, without Memory Overflows.",
            "Attention is Turing-Complete.",
            "Analyzing the discrepancy principle for kernelized spectral filter learning algorithms.",
            "ChainerRL: A Deep Reinforcement Learning Library.",
            "POT: Python Optimal Transport.",
            "Is SGD a Bayesian sampler? Well, almost.",
            "Communication-Efficient Distributed Covariance Sketch, with Application to Distributed PCA.",
            "Knowing what You Know: valid and validated confidence sets in multiclass and multilabel prediction.",
            "PyKEEN 1.0: A Python Library for Training and Evaluating Knowledge Graph Embeddings.",
            "Statistical Query Lower Bounds for Tensor PCA.",
            "Variance Reduced Median-of-Means Estimator for Byzantine-Robust Distributed Inference.",
            "Gradient Methods Never Overfit On Separable Data.",
            "Multi-view Learning as a Nonparametric Nonlinear Inter-Battery Factor Analysis.",
            "On Solving Probabilistic Linear Diophantine Equations.",
            "Edge Sampling Using Local Network Information.",
            "Bayesian Text Classification and Summarization via A Class-Specified Topic Model.",
            "Risk Bounds for Unsupervised Cross-Domain Mapping with IPMs.",
            "Analysis of high-dimensional Continuous Time Markov Chains using the Local Bouncy Particle Sampler.",
            "NEU: A Meta-Algorithm for Universal UAP-Invariant Feature Representation.",
            "Flexible Signal Denoising via Flexible Empirical Bayes Shrinkage.",
            "Consistent Semi-Supervised Graph Regularization for High Dimensional Data.",
            "Histogram Transform Ensembles for Large-scale Regression.",
            "Guided Visual Exploration of Relations in Data Sets.",
            "Safe Policy Iteration: A Monotonically Improving Approximate Policy Iteration Approach.",
            "On the Theory of Policy Gradient Methods: Optimality, Approximation, and Distribution Shift.",
            "Adaptive estimation of nonparametric functionals.",
            "OpenML-Python: an extensible Python API for OpenML.",
            "LocalGAN: Modeling Local Distributions for Adversarial Response Generation.",
            "Learning a High-dimensional Linear Structural Equation Model via l1-Regularized Regression.",
            "A Unified Analysis of First-Order Methods for Smooth Games via Integral Quadratic Constraints.",
            "Explaining Explanations: Axiomatic Feature Interactions for Deep Networks.",
            "Pathwise Conditioning of Gaussian Processes.",
            "Online stochastic gradient descent on non-convex losses from high-dimensional inference.",
            "Beyond English-Centric Multilingual Machine Translation.",
            "Towards a Unified Analysis of Random Fourier Features.",
            "mvlearn: Multiview Machine Learning in Python.",
            "River: machine learning for streaming data in Python.",
            "Non-parametric Quantile Regression via the K-NN Fused Lasso.",
            "L-SVRG and L-Katyusha with Arbitrary Sampling.",
            "A Lyapunov Analysis of Accelerated Methods in Optimization.",
            "NUQSGD: Provably Communication-efficient Data-parallel SGD via Nonuniform Quantization.",
            "Stochastic Proximal Methods for Non-Smooth Non-Convex Constrained Sparse Optimization.",
            "An Importance Weighted Feature Selection Stability Measure.",
            "Strong Consistency, Graph Laplacians, and the Stochastic Block Model.",
            "A General Framework for Adversarial Label Learning.",
            "Some Theoretical Insights into Wasserstein GANs.",
            "Empirical Bayes Matrix Factorization.",
            "Langevin Dynamics for Adaptive Inverse Reinforcement Learning of Stochastic Gradient Algorithms.",
            "Sparse Convex Optimization via Adaptively Regularized Hard Thresholding.",
            "Convergence Guarantees for Gaussian Process Means With Misspecified Likelihoods and Smoothness.",
            "A flexible model-free prediction-based framework for feature ranking.",
            "Bandit Convex Optimization in Non-stationary Environments.",
            "Integrative High Dimensional Multiple Testing with Heterogeneity under Data Sharing Constraints.",
            "LassoNet: A Neural Network with Feature Sparsity.",
            "Optimal Bounds between f-Divergences and Integral Probability Metrics.",
            "Finite-sample Analysis of Interpolating Linear Classifiers in the Overparameterized Regime.",
            "Learning Whenever Learning is Possible: Universal Learning under General Stochastic Processes.",
            "MushroomRL: Simplifying Reinforcement Learning Research.",
            "Locally Differentially-Private Randomized Response for Discrete Distribution Learning.",
            "A Contextual Bandit Bake-off.",
            "An Inertial Newton Algorithm for Deep Learning.",
            "Learning Sparse Classifiers: Continuous and Mixed Integer Optimization Perspectives.",
            "Implicit Langevin Algorithms for Sampling From Log-concave Densities.",
            "Hybrid Predictive Models: When an Interpretable Model Collaborates with a Black-box Model.",
            "An algorithmic view of L2 regularization and some path-following algorithms.",
            "Hoeffding's Inequality for General Markov Chains and Its Applications to Statistical Learning.",
            "Generalization Properties of hyper-RKHS and its Applications.",
            "Pseudo-Marginal Hamiltonian Monte Carlo.",
            "Inference for Multiple Heterogeneous Networks with a Common Invariant Subspace.",
            "Non-attracting Regions of Local Minima in Deep and Wide Neural Networks.",
            "Individual Fairness in Hindsight.",
            "On efficient multilevel Clustering via Wasserstein distances.",
            "Nonparametric Modeling of Higher-Order Interactions via Hypergraphons.",
            "Optimal Minimax Variable Selection for Large-Scale Matrix Linear Regression Model.",
            "Statistical guarantees for local graph clustering.",
            "Hyperparameter Optimization via Sequential Uniform Designs.",
            "Accelerating Ill-Conditioned Low-Rank Matrix Estimation via Scaled Gradient Descent.",
            "Universal consistency and rates of convergence of multiclass prototype algorithms in metric spaces.",
            "Hardness of Identity Testing for Restricted Boltzmann Machines and Potts models.",
            "Factorization Machines with Regularization for Sparse Feature Interactions.",
            "Kernel Smoothing, Mean Shift, and Their Learning Theory with Directional Data.",
            "What Causes the Test Error? Going Beyond Bias-Variance via ANOVA.",
            "A Greedy Algorithm for Quantizing Neural Networks.",
            "The Ridgelet Prior: A Covariance Function Approach to Prior Specification for Bayesian Neural Networks.",
            "Information criteria for non-normalized models.",
            "When Does Gradient Descent with Logistic Loss Find Interpolating Two-Layer Networks?",
            "Are We Forgetting about Compositional Optimisers in Bayesian Optimisation?",
            "MetaGrad: Adaptation using Multiple Learning Rates in Online Learning.",
            "Counterfactual Mean Embeddings.",
            "PeerReview4All: Fair and Accurate Reviewer Assignment in Peer Review.",
            "Improving Reproducibility in Machine Learning Research(A Report from the NeurIPS 2019 Reproducibility Program).",
            "Implicit Self-Regularization in Deep Neural Networks: Evidence from Random Matrix Theory and Implications for Learning.",
            "The ensmallen library for flexible numerical optimization.",
            "Estimation and Optimization of Composite Outcomes.",
            "Asymptotic Normality, Concentration, and Coverage of Generalized Posteriors.",
            "First-order Convergence Theory for Weakly-Convex-Weakly-Concave Min-max Problems.",
            "Black-Box Reductions for Zeroth-Order Gradient Algorithms to Achieve Lower Query Complexity.",
            "Optimal Rates of Distributed Regression with Imperfect Kernels.",
            "Unlinked Monotone Regression.",
            "Replica Exchange for Non-Convex Optimization.",
            "Achieving Fairness in the Stochastic Multi-Armed Bandit Problem.",
            "Doubly infinite residual neural networks: a diffusion process approach.",
            "Locally Private k-Means Clustering.",
            "Prediction Under Latent Factor Regression: Adaptive PCR, Interpolating Predictors and Beyond.",
            "Conditional independences and causal relations implied by sets of equations.",
            "A Sharp Blockwise Tensor Perturbation Bound for Orthogonal Iteration.",
            "Improved Shrinkage Prediction under a Spiked Covariance Structure.",
            "Alibi Explain: Algorithms for Explaining Machine Learning Models.",
            "A Probabilistic Interpretation of Self-Paced Learning with Applications to Reinforcement Learning.",
            "Benchmarking Unsupervised Object Representations for Video Sequences.",
            "mlr3pipelines - Flexible Machine Learning Pipelines in R.",
            "Mode-wise Tensor Decompositions: Multi-dimensional Generalizations of CUR Decompositions.",
            "As You Like It: Localization via Paired Comparisons.",
            "Matrix Product States for Inference in Discrete Probabilistic Models.",
            "Differentially Private Regression and Classification with Sparse Gaussian Processes.",
            "One-Shot Federated Learning: Theoretical Limits and Algorithms to Achieve Them.",
            "Collusion Detection and Ground Truth Inference in Crowdsourcing for Labeling Tasks.",
            "On the Estimation of Network Complexity: Dimension of Graphons.",
            "Method of Contraction-Expansion (MOCE) for Simultaneous Inference in Linear Models.",
            "Sparse Popularity Adjusted Stochastic Block Model.",
            "Limit theorems for out-of-sample extensions of the adjacency and Laplacian spectral embeddings.",
            "Learning Laplacian Matrix from Graph Signals with Sparse Spectral Representation.",
            "COKE: Communication-Censored Decentralized Kernel Learning.",
            "Particle-Gibbs Sampling for Bayesian Feature Allocation Models.",
            "Integrated Principal Components Analysis.",
            "On ADMM in Deep Learning: Convergence and Saturation-Avoidance.",
            "Refined approachability algorithms and application to regret minimization with global costs.",
            "Understanding How Dimension Reduction Tools Work: An Empirical Approach to Deciphering t-SNE, UMAP, TriMap, and PaCMAP for Data Visualization.",
            "Interpretable Deep Generative Recommendation Models.",
            "Learning partial correlation graphs and graphical models by covariance queries.",
            "Failures of Model-dependent Generalization Bounds for Least-norm Interpolation.",
            "Langevin Monte Carlo: random coordinate descent and variance reduction.",
            "Hamilton-Jacobi Deep Q-Learning for Deterministic Continuous-Time Systems with Lipschitz Continuous Controls.",
            "A Unified Convergence Analysis for Shuffling-Type Gradient Methods.",
            "Oblivious Data for Fairness with Kernels.",
            "Explaining by Removing: A Unified Framework for Model Explanation.",
            "Policy Teaching in Reinforcement Learning via Environment Poisoning Attacks.",
            "Bandit Learning in Decentralized Matching Markets.",
            "Convex Geometry and Duality of Over-parameterized Neural Networks.",
            "Cooperative SGD: A Unified Framework for the Design and Analysis of Local-Update SGD Algorithms.",
            "dalex: Responsible Machine Learning with Interactive Explainability and Fairness in Python.",
            "TensorHive: Management of Exclusive GPU Access for Distributed Machine Learning Workloads.",
            "Context-dependent Networks in Multivariate Time Series: Models, Methods, and Risk Bounds in High Dimensions.",
            "A Unified Framework for Spectral Clustering in Sparse Graphs.",
            "Thompson Sampling Algorithms for Cascading Bandits.",
            "Soft Tensor Regression.",
            "Shape-Enforcing Operators for Generic Point and Interval Estimators of Functions.",
            "A Bayes-Optimal View on Adversarial Examples.",
            "Classification vs regression in overparameterized regimes: Does the loss function matter?",
            "Stochastic Online Optimization using Kalman Recursion.",
            "Bayesian Distance Clustering.",
            "Representer Theorems in Banach Spaces: Minimum Norm Interpolation, Regularized Learning and Semi-Discrete Inverse Problems.",
            "FATE: An Industrial Grade Platform for Collaborative Learning With Data Protection.",
            "Tighter Risk Certificates for Neural Networks.",
            "How Well Generative Adversarial Networks Learn Distributions.",
            "Convolutional Neural Networks Are Not Invariant to Translation, but They Can Learn to Be.",
            "Learning with semi-definite programming: statistical bounds based on fixed point analysis and excess risk curvature.",
            "sklvq: Scikit Learning Vector Quantization.",
            "Probabilistic Iterative Methods for Linear Systems.",
            "A Generalised Linear Model Framework for β-Variational Autoencoders based on Exponential Dispersion Families.",
            "A general linear-time inference method for Gaussian Processes on one dimension.",
            "GIBBON: General-purpose Information-Based Bayesian Optimisation.",
            "Expanding Boundaries of Gap Safe Screening.",
            "Consensus-Based Optimization on the Sphere: Convergence to Global Minimizers and Machine Learning.",
            "DeEPCA: Decentralized Exact PCA with Linear Convergence Rate.",
            "Decentralized Stochastic Gradient Langevin Dynamics and Hamiltonian Monte Carlo.",
            "DIG: A Turnkey Library for Diving into Graph Deep Learning Research.",
            "Sparsity in Deep Learning: Pruning and growth for efficient inference and training in neural networks.",
            "Wasserstein distance estimates for the distributions of numerical approximations to ergodic stochastic differential equations.",
            "Quasi-Monte Carlo Quasi-Newton in Variational Bayes.",
            "Consistency of Gaussian Process Regression in Metric Spaces.",
            "On lp-hyperparameter Learning via Bilevel Nonsmooth Optimization.",
            "Mixture Martingales Revisited with Applications to Sequential Tests and Confidence Intervals.",
            "Statistical Guarantees for Local Spectral Clustering on Random Neighborhood Graphs.",
            "Statistically and Computationally Efficient Change Point Localization in Regression Settings.",
            "On the Riemannian Search for Eigenvector Computation.",
            "Bayesian time-aligned factor analysis of paired multivariate time series.",
            "Tractable Approximate Gaussian Inference for Bayesian Neural Networks.",
            "Batch greedy maximization of non-submodular functions: Guarantees and applications to experimental design.",
            "Bifurcation Spiking Neural Network.",
            "Inference for the Case Probability in High-dimensional Logistic Regression.",
            "Adversarial Monte Carlo Meta-Learning of Optimal Prediction Procedures.",
            "Model Linkage Selection for Cooperative Learning.",
            "Estimating Uncertainty Intervals from Collaborating Networks.",
            "Optimized Score Transformation for Consistent Fair Classification.",
            "ROOTS: Object-Centric Representation and Rendering of 3D Scenes.",
            "Learning Strategies in Decentralized Matching Markets under Uncertain Preferences.",
            "Domain adaptation under structural causal models.",
            "Revisiting Model-Agnostic Private Learning: Faster Rates and Active Learning.",
            "On the Stability Properties and the Optimization Landscape of Training Problems with Squared Loss for Neural Networks and General Nonlinear Conic Approximation Schemes.",
            "Regularized spectral methods for clustering signed networks.",
            "Exact Asymptotics for Linear Quadratic Adaptive Control.",
            "Learning Bayesian Networks from Ordinal Data.",
            "Reproducing kernel Hilbert C*-module and kernel mean embeddings.",
            "Stable-Baselines3: Reliable Reinforcement Learning Implementations.",
            "CAT: Compression-Aware Training for bandwidth reduction.",
            "Further results on latent discourse models and word embeddings.",
            "Nonparametric Continuous Sensor Registration.",
            "Transferability of Spectral Graph Convolutional Neural Networks.",
            "On the Hardness of Robust Classification.",
            "Simultaneous Change Point Inference and Structure Recovery for High Dimensional Gaussian Graphical Models.",
            "Partial Policy Iteration for L1-Robust Markov Decision Processes.",
            "Estimating the Lasso's Effective Noise.",
            "Gaussian Approximation for Bias Reduction in Q-Learning.",
            "Multilevel Monte Carlo Variational Inference.",
            "Fast Learning for Renewal Optimization in Online Task Scheduling.",
            "Graph Matching with Partially-Correct Seeds.",
            "Contrastive Estimation Reveals Topic Posterior Information to Linear Models.",
            "LDLE: Low Distortion Local Eigenmaps.",
            "Non-linear, Sparse Dimensionality Reduction via Path Lasso Penalized Autoencoders.",
            "Linear Bandits on Uniformly Convex Sets.",
            "Double Generative Adversarial Networks for Conditional Independence Testing.",
            "An Online Sequential Test for Qualitative Treatment Effects.",
            "V-statistics and Variance Estimation.",
            "A Theory of the Risk for Optimization with Relaxation and its Application to Support Vector Machines.",
            "VariBAD: Variational Bayes-Adaptive Deep RL via Meta-Learning.",
            "On Universal Approximation and Error Bounds for Fourier Neural Operators."
        ]
    },
    {
        "name": "JMLR",
        "year": "2020",
        "info": "Volume 21: 2020",
        "count": 216,
        "papers": [
            "A Low Complexity Algorithm with O(√T) Regret and O(1) Constraint Violations for Online Convex Optimization with Long Term Constraints.",
            "A Statistical Learning Approach to Modal Regression.",
            "A Model of Fake Data in Data-driven Analysis.",
            "Universal Latent Space Model Fitting for Large Networks with Edge Covariates.",
            "Lower Bounds for Parallel and Randomized Convex Optimization.",
            "Path-Based Spectral Clustering: Guarantees, Robustness to Outliers, and Fast Algorithms.",
            "Target Propagation in Recurrent Neural Networks.",
            "DESlib: A Dynamic ensemble selection library in Python.",
            "On Mahalanobis Distance in Functional Settings.",
            "Online Sufficient Dimension Reduction Through Sliced Inverse Regression.",
            "Weighted Message Passing and Minimum Energy Flow for Heterogeneous Stochastic Block Models with Side Information.",
            "Neyman-Pearson classification: parametrics and sample size requirement.",
            "Generalized probabilistic principal component analysis of correlated data.",
            "On lp-Support Vector Machines and Multidimensional Kernels.",
            "Perturbation Bounds for Procrustes, Classical Scaling, and Trilateration, with Applications to Manifold Learning.",
            "Practical Locally Private Heavy Hitters.",
            "Expectation Propagation as a Way of Life: A Framework for Bayesian Inference on Partitioned Data.",
            "Connecting Spectral Clustering to Maximum Margins and Level Sets.",
            "High-Dimensional Interactions Detection with Sparse Principal Hessian Matrix.",
            "Convergences of Regularized Algorithms and Stochastic Gradient Methods with Random Projections.",
            "Derivative-Free Methods for Policy Optimization: Guarantees for Linear Quadratic Systems.",
            "A Unified Framework for Structured Graph Learning via Spectral Constraints.",
            "GluonCV and GluonNLP: Deep Learning in Computer Vision and Natural Language Processing.",
            "Distributed Feature Screening via Componentwise Debiasing.",
            "Lower Bounds for Testing Graphical Models: Colorings and Antiferromagnetic Ising Models.",
            "Targeted Fused Ridge Estimation of Inverse Covariance Matrices from Multiple High-Dimensional Data Classes.",
            "A New Class of Time Dependent Latent Factor Models with Applications.",
            "On the consistency of graph-based Bayesian semi-supervised learning and the scalability of sampling algorithms.",
            "The Maximum Separation Subspace in Sufficient Dimension Reduction with Categorical Response.",
            "Tensor Train Decomposition on TensorFlow (T3F).",
            "Generalized Nonbacktracking Bounds on the Influence.",
            "Provably robust estimation of modulo 1 samples of a smooth function with applications to phase unwrapping.",
            "On the Complexity Analysis of the Primal Solutions for the Accelerated Randomized Dual Coordinate Ascent.",
            "Graph-Dependent Implicit Regularisation for Distributed Stochastic Subgradient Descent.",
            "Learning with Fenchel-Young losses.",
            "Noise Accumulation in High Dimensional Classification and Total Signal Index.",
            "Causal Discovery Toolbox: Uncovering causal relationships in Python.",
            "Latent Simplex Position Model: High Dimensional Multi-view Clustering with Uncertainty Quantification.",
            "Learning Linear Non-Gaussian Causal Models in the Presence of Latent Variables.",
            "Optimal Bipartite Network Clustering.",
            "Switching Regression Models and Causal Inference in the Presence of Discrete Latent Variables.",
            "Branch and Bound for Piecewise Linear Neural Network Verification.",
            "Greedy Attack and Gumbel Attack: Generating Adversarial Examples for Discrete Data.",
            "Dynamical Systems as Temporal Feature Spaces.",
            "A Convex Parametrization of a New Class of Universal Kernel Functions.",
            "pyts: A Python Package for Time Series Classification.",
            "Ancestral Gumbel-Top-k Sampling for Sampling Without Replacement.",
            "Skill Rating for Multiplayer Games. Introducing Hypernode Graphs and their Spectral Theory.",
            "Ensemble Learning for Relational Data.",
            "Sparse and low-rank multivariate Hawkes processes.",
            "Learning Causal Networks via Additive Faithfulness.",
            "Expected Policy Gradients for Reinforcement Learning.",
            "High-Dimensional Inference for Cluster-Based Graphical Models.",
            "GraKeL: A Graph Kernel Library in Python.",
            "Conjugate Gradients for Kernel Machines.",
            "Fast Rates for General Unbounded Loss Functions: From ERM to Generalized Bayes.",
            "Self-paced Multi-view Co-training.",
            "Robust Asynchronous Stochastic Gradient-Push: Asymptotically Optimal and Network-Independent Performance for Strongly Convex Functions.",
            "Exact Guarantees on the Absence of Spurious Local Minima for Non-negative Rank-1 Robust Principal Component Analysis.",
            "Kymatio: Scattering Transforms in Python.",
            "Multiparameter Persistence Landscapes.",
            "Generalized Optimal Matching Methods for Causal Inference.",
            "Unique Sharp Local Minimum in L1-minimization Complete Dictionary Learning.",
            "Community-Based Group Graphical Lasso.",
            "Smoothed Nonparametric Derivative Estimation using Weighted Difference Quotients.",
            "WONDER: Weighted One-shot Distributed Ridge Regression in High Dimensions.",
            "The weight function in the subtree kernel is decisive.",
            "On Stationary-Point Hitting Time and Ergodicity of Stochastic Gradient Langevin Dynamics.",
            "Union of Low-Rank Tensor Spaces: Clustering and Completion.",
            "Representation Learning for Dynamic Graphs: A Survey.",
            "Estimation of a Low-rank Topic-Based Model for Information Cascades.",
            "(1 + epsilon)-class Classification: an Anomaly Detection Method for Highly Imbalanced or Incomplete Data Sets.",
            "Scalable Approximate MCMC Algorithms for the Horseshoe Prior.",
            "High-dimensional Gaussian graphical models on network-linked data.",
            "Identifiability of Additive Noise Models Using Conditional Variances.",
            "GADMM: Fast and Communication Efficient Framework for Distributed Machine Learning.",
            "Multi-Player Bandits: The Adversarial Case.",
            "Harmless Overfitting: Using Denoising Autoencoders in Estimation of Distribution Algorithms.",
            "Quantile Graphical Models: a Bayesian Approach.",
            "Memoryless Sequences for General Losses.",
            "Tuning Hyperparameters without Grad Students: Scalable and Robust Bayesian Optimisation with Dragonfly.",
            "Sequential change-point detection in high-dimensional Gaussian graphical models.",
            "Discerning the Linear Convergence of ADMM for Structured Convex Optimization through the Lens of Variational Analysis.",
            "Model-Preserving Sensitivity Analysis for Families of Gaussian Distributions.",
            "Effective Ways to Build and Evaluate Individual Survival Distributions.",
            "Convergence Rate of Optimal Quantization and Application to the Clustering Performance of the Empirical Measure.",
            "Constrained Dynamic Programming and Supervised Penalty Learning Algorithms for Peak Detection in Genomic Data.",
            "Target-Aware Bayesian Inference: How to Beat Optimal Conventional Estimators.",
            "Causal Discovery from Heterogeneous/Nonstationary Data.",
            "Probabilistic Symmetries and Invariant Neural Networks.",
            "Simultaneous Inference for Pairwise Graphical Models with Generalized Score Matching.",
            "Fast mixing of Metropolized Hamiltonian Monte Carlo: Benefits of multi-step gradients.",
            "Distributed Kernel Ridge Regression with Communications.",
            "Minimax Nonparametric Parallelism Test.",
            "Cornac: A Comparative Framework for Multimodal Recommender Systems.",
            "pyDML: A Python Library for Distance Metric Learning.",
            "Loss Control with Rank-one Covariance Estimate for Short-term Portfolio Optimization.",
            "A General Framework for Consistent Structured Prediction with Implicit Loss Embeddings.",
            "Joint Causal Inference from Multiple Contexts.",
            "General Latent Feature Models for Heterogeneous Datasets.",
            "Regularized Gaussian Belief Propagation with Nodes of Arbitrary Size.",
            "AI-Toolbox: A C++ library for Reinforcement Learning and Planning (with Python Bindings).",
            "Stochastic Nested Variance Reduction for Nonconvex Optimization.",
            "Sparse Projection Oblique Randomer Forests.",
            "Stochastic Conditional Gradient Methods: From Convex Minimization to Submodular Maximization.",
            "Quadratic Decomposable Submodular Function Minimization: Theory and Practice.",
            "Change Point Estimation in a Dynamic Stochastic Block Model.",
            "ThunderGBM: Fast GBDTs and Random Forests on GPUs.",
            "Bayesian Model Selection with Graph Structured Sparsity.",
            "ProxSARAH: An Efficient Algorithmic Framework for Stochastic Composite Nonconvex Optimization.",
            "MFE: Towards reproducible meta-feature extraction.",
            "High-dimensional Linear Discriminant Analysis Classifier for Spiked Covariance Model.",
            "Prediction regions through Inverse Regression.",
            "NEVAE: A Deep Generative Model for Molecular Graphs.",
            "Identifiability and Consistent Estimation of Nonparametric Translation Hidden Markov Models with General State Space.",
            "GluonTS: Probabilistic and Neural Time Series Modeling in Python.",
            "Regularized Estimation of High-dimensional Factor-Augmented Vector Autoregressive (FAVAR) Models.",
            "Tslearn, A Machine Learning Toolkit for Time Series Data.",
            "Bayesian Closed Surface Fitting Through Tensor Products.",
            "A Class of Parallel Doubly Stochastic Algorithms for Large-Scale Learning.",
            "Agnostic Estimation for Phase Retrieval.",
            "Kernel-estimated Nonparametric Overlap-Based Syncytial Clustering.",
            "Tensor Regression Networks.",
            "Fast Bayesian Inference of Sparse Networks with Automatic Sparsity Determination.",
            "Optimal Algorithms for Continuous Non-monotone Submodular and DR-Submodular Maximization.",
            "Distributed Minimum Error Entropy Algorithms.",
            "Apache Mahout: Machine Learning on Distributed Dataflow Systems.",
            "A Regularization-Based Adaptive Test for High-Dimensional GLMs.",
            "A General System of Differential Equations to Model First-Order Adaptive Algorithms.",
            "AI Explainability 360: An Extensible Toolkit for Understanding Data and Machine Learning Models.",
            "Convergence of Sparse Variational Inference in Gaussian Processes Regression.",
            "Monte Carlo Gradient Estimation in Machine Learning.",
            "Gradient Descent for Sparse Rank-One Matrix Completion for Crowd-Sourced Aggregation of Sparsely Interacting Workers.",
            "Probabilistic Learning on Graphs via Contextual Architectures.",
            "A Unified Framework of Online Learning Algorithms for Training Recurrent Neural Networks.",
            "Convergence Rates for the Stochastic Gradient Descent Method for Non-Convex Objective Functions.",
            "Contextual Bandits with Continuous Actions: Smoothing, Zooming, and Adapting.",
            "metric-learn: Metric Learning Algorithms in Python.",
            "Chaining Meets Chain Rule: Multilevel Entropic Regularization and Training of Neural Networks.",
            "Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer.",
            "Importance Sampling Techniques for Policy Optimization.",
            "Nesterov's Acceleration for Approximate Newton.",
            "A Data Efficient and Feasible Level Set Method for Stochastic Convex Optimization with Expectation Constraints.",
            "Empirical Priors for Prediction in Sparse High-dimensional Linear Regression.",
            "Orlicz Random Fourier Features.",
            "New Insights and Perspectives on the Natural Gradient Method.",
            "Optimal Convergence for Distributed Learning with Stochastic Gradient Methods and Spectral Algorithms.",
            "Local Causal Network Learning for Finding Pairs of Total and Direct Effects.",
            "Distributionally Ambiguous Optimization for Batch Bayesian Optimization.",
            "The Kalai-Smorodinsky solution for many-objective Bayesian optimization.",
            "Robust Reinforcement Learning with Bayesian Optimisation and Quadrature.",
            "Dual Iterative Hard Thresholding.",
            "Spectral Algorithms for Community Detection in Directed Networks.",
            "Learning from Binary Multiway Data: Probabilistic Tensor Decomposition and its Statistical Optimality.",
            "Estimate Sequences for Stochastic Composite Optimization: Variance Reduction, Acceleration, and Robustness to Noise.",
            "Asymptotic Consistency of α-Rényi-Approximate Posteriors.",
            "Streamlined Variational Inference with Higher Level Random Effects.",
            "Learning Big Gaussian Bayesian Networks: Partition, Estimation and Fusion.",
            "Generating Weighted MAX-2-SAT Instances with Frustrated Loops: an RBM Case Study.",
            "Generative Adversarial Nets for Robust Scatter Estimation: A Proper Scoring Rule Perspective.",
            "apricot: Submodular selection for data summarization in Python.",
            "Regression with Comparisons: Escaping the Curse of Dimensionality with Ordinal Information.",
            "Trust-Region Variational Inference with Gaussian Mixture Models.",
            "Cramer-Wold Auto-Encoder.",
            "Complete Dictionary Learning via L4-Norm Maximization over the Orthogonal Group.",
            "High Dimensional Forecasting via Interpretable Vector Autoregression.",
            "Double Reinforcement Learning for Efficient Off-Policy Evaluation in Markov Decision Processes.",
            "Convex and Non-Convex Approaches for Statistical Inference with Class-Conditional Noisy Labels.",
            "The Optimal Ridge Penalty for Real-world High-dimensional Data Can Be Zero or Negative due to the Implicit Ridge Regularization.",
            "Rationally Inattentive Inverse Reinforcement Learning Explains YouTube Commenting Behavior.",
            "Randomization as Regularization: A Degrees of Freedom Explanation for Random Forest Success.",
            "Krylov Subspace Method for Nonlinear Dynamical Systems with Random Noise.",
            "Doubly Distributed Supervised Learning and Inference with High-Dimensional Correlated Outcomes.",
            "Adaptive Approximation and Generalization of Deep Neural Network with Intrinsic Dimensionality.",
            "Wide Neural Networks with Bottlenecks are Deep Gaussian Processes.",
            "Breaking the Curse of Nonregularity with Subagging - Inference of the Mean Outcome under Optimal Treatment Regimes.",
            "Optimal Estimation of Sparse Topic Models.",
            "Monotonic Value Function Factorisation for Deep Multi-Agent Reinforcement Learning.",
            "Variational Inference for Computational Imaging Inverse Problems.",
            "Communication-Efficient Distributed Optimization in Networks with Gradient Tracking and Variance Reduction.",
            "Curriculum Learning for Reinforcement Learning Domains: A Framework and Survey.",
            "Distributed High-dimensional Regression Under a Quantile Loss Function.",
            "Near-optimal Individualized Treatment Recommendations.",
            "Topology of Deep Neural Networks.",
            "Scikit-network: Graph Analysis in Python.",
            "Consistency of Semi-Supervised Learning Algorithms on Graphs: Probit and One-Hot Methods.",
            "Kriging Prediction with Isotropic Matern Correlations: Robustness and Experimental Designs.",
            "Efficient Adjustment Sets for Population Average Causal Treatment Effect Estimation in Graphical Models.",
            "Beyond Trees: Classification with Sparse Pairwise Dependencies.",
            "A Unified q-Memorization Framework for Asynchronous Stochastic Optimization.",
            "Adaptive Smoothing for Path Integral Control.",
            "Semi-parametric Learning of Structured Temporal Point Processes.",
            "Learning and Interpreting Multi-Multi-Instance Learning Networks.",
            "Contextual Explanation Networks.",
            "Conic Optimization for Quadratic Regression Under Sparse Noise.",
            "Successor Features Combine Elements of Model-Free and Model-based Reinforcement Learning.",
            "A determinantal point process for column subset selection.",
            "Reinforcement Learning in Continuous Time and Space: A Stochastic Control Approach.",
            "Asymptotic Analysis via Stochastic Differential Equations of Gradient Descent Algorithms in Statistical and Computational Paradigms.",
            "Empirical Risk Minimization in the Non-interactive Local Model of Differential Privacy.",
            "Continuous-Time Birth-Death MCMC for Bayesian Regression Tree Models.",
            "A Numerical Measure of the Instability of Mapper-Type Algorithms.",
            "Dynamic Control of Stochastic Evolution: A Deep Reinforcement Learning Approach to Adaptively Targeting Emergent Drug Resistance.",
            "Two-Stage Approach to Multivariate Linear Regression with Sparsely Mismatched Data.",
            "Sobolev Norm Learning Rates for Regularized Least-Squares Algorithms.",
            "On Convergence of Distributed Approximate Newton Methods: Globalization, Sharper Bounds and Beyond.",
            "Functional Martingale Residual Process for High-Dimensional Cox Regression with Model Averaging.",
            "Learning Data-adaptive Non-parametric Kernels.",
            "A Sober Look at the Unsupervised Learning of Disentangled Representations and their Evaluation.",
            "ProtoAttend: Attention-Based Prototypical Learning.",
            "Random Smoothing Might be Unable to Certify L∞ Robustness for High-Dimensional Images.",
            "scikit-survival: A Library for Time-to-Event Analysis Built on Top of scikit-learn.",
            "Multiclass Anomaly Detector: the CS++ Support Vector Machine.",
            "Provable Convex Co-clustering of Tensors.",
            "Mining Topological Structure in Graphs through Forest Representations.",
            "Dynamic Assortment Optimization with Changing Contextual Information."
        ]
    },
    {
        "name": "JMLR",
        "year": "2019",
        "info": "Volume 20: 2019",
        "count": 184,
        "papers": [
            "Adaptation Based on Generalized Discrepancy.",
            "Transport Analysis of Infinitely Deep Neural Network.",
            "Parsimonious Online Learning with Kernels via Sparse Projections in Function Space.",
            "Convergence Rate of a Simulated Annealing Algorithm with Noisy Observations.",
            "Non-Convex Projected Gradient Descent for Generalized Low-Rank Tensor Regression.",
            "scikit-multilearn: A Python library for Multi-Label Classification.",
            "Scalable Approximations for Generalized Linear Problems.",
            "Forward-Backward Selection with Early Dropping.",
            "Dynamic Pricing in High-dimensions.",
            "Graphical Lasso and Thresholding: Equivalence and Closed-form Solutions.",
            "An Approach to One-Bit Compressed Sensing Based on Probably Approximately Correct Learning Theory.",
            "Scalable Kernel K-Means Clustering with Nystr\\\"om Approximation: Relative-Error Bounds.",
            "Train and Test Tightness of LP Relaxations in Structured Prediction.",
            "Approximations of the Restless Bandit Problem.",
            "Automated Scalable Bayesian Inference via Hilbert Coresets.",
            "Smooth neighborhood recommender systems.",
            "Delay and Cooperation in Nonstochastic Bandits.",
            "Multiplicative local linear hazard estimation and best one-sided cross-validation.",
            "spark-crowd: A Spark Package for Learning from Crowdsourced Big Data.",
            "Accelerated Alternating Projections for Robust Principal Component Analysis.",
            "Spectrum Estimation from a Few Entries.",
            "Random Feature-based Online Multi-kernel Learning in Environments with Unknown Dynamics.",
            "Determining the Number of Latent Factors in Statistical Multi-Relational Learning.",
            "Joint PLDA for Simultaneous Modeling of Two Factors.",
            "Group Invariance, Stability to Deformations, and Complexity of Deep Convolutional Representations.",
            "TensorLy: Tensor Learning in Python.",
            "Monotone Learning with Rectified Wire Networks.",
            "Pyro: Deep Universal Probabilistic Programming.",
            "Iterated Learning in Dynamic Social Networks.",
            "Exact Clustering of Weighted Graphs via Semidefinite Programming.",
            "Kernels for Sequentially Ordered Data.",
            "NetSDM: Semantic Data Mining with Network Analysis.",
            "The Relationship Between Agnostic Selective Classification, Active Learning and the Disagreement Coefficient.",
            "Matched Bipartite Block Model with Covariates.",
            "Optimal Policies for Observing Time Series and Related Restless Bandit Problems.",
            "A New Approach to Laplacian Solvers and Flow Problems.",
            "A Well-Tempered Landscape for Non-convex Robust Subspace Recovery.",
            "Approximation Hardness for A Class of Sparse Optimization Problems.",
            "A Bootstrap Method for Error Estimation in Randomized Matrix Multiplication.",
            "Stochastic Modified Equations and Dynamics of Stochastic Gradient Algorithms I: Mathematical Foundations.",
            "Decontamination of Mutual Contamination Models.",
            "Utilizing Second Order Information in Minibatch Stochastic Variance Reduced Proximal Iterations.",
            "DSCOVR: Randomized Primal-Dual Block Coordinate Algorithms for Asynchronous Distributed Optimization.",
            "Picasso: A Sparse Learning Library for High Dimensional Data Analysis in R and Python.",
            "Robust Frequent Directions with Application in Online Learning.",
            "Boosted Kernel Ridge Regression: Optimal Learning Rates and Early Stopping.",
            "Analysis of spectral clustering algorithms for community detection: the general bipartite setting.",
            "Efficient augmentation and relaxation learning for individualized treatment rules using observational data.",
            "Using Simulation to Improve Sample-Efficiency of Bayesian Optimization for Bipedal Robots.",
            "No-Regret Bayesian Optimization with Unknown Hyperparameters.",
            "Bayesian Combination of Probabilistic Classifiers using Multivariate Normal Mixtures.",
            "Thompson Sampling Guided Stochastic Searching on the Line for Deceptive Environments with Applications to Root-Finding Problems.",
            "Tunability: Importance of Hyperparameters of Machine Learning Algorithms.",
            "Deep Reinforcement Learning for Swarm Systems.",
            "Neural Architecture Search: A Survey.",
            "Near Optimal Frequent Directions for Sketching Dense and Sparse Matrices.",
            "Multi-class Heterogeneous Domain Adaptation.",
            "The Common-directions Method for Regularized Empirical Risk Minimization.",
            "Kernel Approximation Methods for Speech Recognition.",
            "Robust Estimation of Derivatives Using Locally Weighted Least Absolute Deviation Regression.",
            "The Sup-norm Perturbation of HOSVD and Low Rank Tensor Denoising.",
            "Multi-scale Online Learning: Theory and Applications to Online Auctions and Pricing.",
            "Nearly-tight VC-dimension and Pseudodimension Bounds for Piecewise Linear Neural Networks.",
            "A Representer Theorem for Deep Kernel Learning.",
            "Active Learning for Cost-Sensitive Classification.",
            "Proximal Distance Algorithms: Theory and Practice.",
            "Learnability of Solutions to Conjunctive Queries.",
            "Variance-based Regularization with Convex Objectives.",
            "On Consistent Vertex Nomination Schemes.",
            "Semi-Analytic Resampling in Lasso.",
            "Lazifying Conditional Gradient Algorithms.",
            "Redundancy Techniques for Straggler Mitigation in Distributed Optimization and Learning.",
            "Analysis of Langevin Monte Carlo via Convex Optimization.",
            "Deep Optimal Stopping.",
            "Fairness Constraints: A Flexible Approach for Fair Classification.",
            "Generalized Score Matching for Non-Negative Data.",
            "Nonuniformity of P-values Can Occur Early in Diverging Dimensions.",
            "Prediction Risk for the Horseshoe Regression.",
            "Quantification Under Prior Probability Shift: the Ratio Estimator and its Extensions.",
            "Learning to Match via Inverse Optimal Transport.",
            "Tight Lower Bounds on the VC-dimension of Geometric Set Systems.",
            "SMART: An Open Source Data Labeling Platform for Supervised Learning.",
            "On the optimality of the Hedge algorithm in the stochastic regime.",
            "Differentiable Game Mechanics.",
            "Bayesian Space-Time Partitioning by Sampling and Pruning Spanning Trees.",
            "Streaming Principal Component Analysis From Incomplete Data.",
            "An asymptotic analysis of distributed nonparametric methods.",
            "Model Selection via the VC Dimension.",
            "Dependent relevance determination for smooth and structured sparse regression.",
            "A Particle-Based Variational Approach to Bayesian Non-negative Matrix Factorization.",
            "Best Arm Identification for Contaminated Bandits.",
            "AffectiveTweets: a Weka Package for Analyzing Affect in Tweets.",
            "iNNvestigate Neural Networks!",
            "Simultaneous Private Learning of Multiple Concepts.",
            "High-Dimensional Poisson Structural Equation Model Learning via $\\ell_1$-Regularized Regression.",
            "PyOD: A Python Toolbox for Scalable Outlier Detection.",
            "Relative Error Bound Analysis for Nuclear Norm Regularized Matrix Completion.",
            "Adaptive Geometric Multiscale Approximations for Intrinsically Low-dimensional Data.",
            "Change Surfaces for Expressive Multidimensional Changepoints and Counterfactual Prediction.",
            "Hamiltonian Monte Carlo with Energy Conserving Subsampling.",
            "Low Permutation-rank Matrices: Structural Properties and Noisy Completion.",
            "Non-Convex Matrix Completion and Related Problems via Strong Duality.",
            "Regularization via Mass Transportation.",
            "Complete Search for Feature Selection in Decision Trees.",
            "Optimal Transport: Fast Probabilistic Approximation with Exact Solvers.",
            "Solving the OSCAR and SLOPE Models Using a Semismooth Newton-Based Augmented Lagrangian Method.",
            "Scalable Interpretable Multi-Response Regression via SEED.",
            "Maximum Likelihood for Gaussian Process Classification and Generalized Linear Mixed Models under Case-Control Sampling.",
            "Learning Unfaithful $K$-separable Gaussian Graphical Models.",
            "A Representer Theorem for Deep Neural Networks.",
            "An Efficient Two Step Algorithm for High Dimensional Change Point Regression Models Without Grid Search.",
            "Measuring the Effects of Data Parallelism on Neural Network Training.",
            "Distributed Inference for Linear Support Vector Machine.",
            "Sharp Restricted Isometry Bounds for the Inexistence of Spurious Local Minima in Nonconvex Matrix Recovery.",
            "Learning Attribute Patterns in High-Dimensional Structured Latent Attribute Models.",
            "Graph Reduction with Spectral and Cut Guarantees.",
            "Generic Inference in Latent Gaussian Process Models.",
            "Binarsity: a penalization for one-hot encoded features in linear supervised learning.",
            "Layer-Wise Learning Strategy for Nonparametric Tensor Product Smoothing Spline Regression and Graphical Models.",
            "Ivanov-Regularised Least-Squares Estimators over Large RKHSs and Their Interpolation Spaces.",
            "Scaling Up Sparse Support Vector Machines by Simultaneous Feature and Sample Reduction.",
            "Approximate Profile Maximum Likelihood.",
            "ADMMBO: Bayesian Optimization with Unknown Constraints using ADMM.",
            "Deep Exploration via Randomized Value Functions.",
            "ORCA: A Matlab/Octave Toolbox for Ordinal Regression.",
            "Learning Representations of Persistence Barcodes.",
            "Causal Learning via Manifold Regularization.",
            "Unsupervised Basis Function Adaptation for Reinforcement Learning.",
            "Time-to-Event Prediction with Neural Networks and Cox Regression.",
            "Logical Explanations for Deep Relational Machines Using Relevance Information.",
            "Decoupling Sparsity and Smoothness in the Dirichlet Variational Autoencoder Topic Model.",
            "More Efficient Estimation for Logistic Regression with Optimal Subsamples.",
            "Spurious Valleys in One-hidden-layer Neural Network Optimization Landscapes.",
            "Stochastic Variance-Reduced Cubic Regularization Methods.",
            "Gaussian Processes with Linear Operator Inequality Constraints.",
            "Local Regularization of Noisy Point Clouds: Improved Global Geometric Estimates and Data Analysis.",
            "Multiclass Boosting: Margins, Codewords, Losses, and Algorithms.",
            "Generalized Maximum Entropy Estimation.",
            "Decentralized Dictionary Learning Over Time-Varying Digraphs.",
            "Nonparametric Bayesian Aggregation for Massive Data.",
            "Provably Accurate Double-Sparse Coding.",
            "Model-free Nonconvex Matrix Completion: Local Minima Analysis and Applications in Memory-efficient Kernel PCA.",
            "Minimal Sample Subspace Learning: Theory and Algorithms.",
            "Convergence of Gaussian Belief Propagation Under General Pairwise Factorization: Connecting Gaussian MRF with Pairwise Linear Gaussian Model.",
            "Bayesian Optimization for Policy Search via Online-Offline Experimentation.",
            "Characterizing the Sample Complexity of Pure Private Learners.",
            "Robustifying Independent Component Analysis by Adjusting for Group-Wise Stationary Noise.",
            "Collective Matrix Completion.",
            "On Asymptotic and Finite-Time Optimality of Bayesian Predictors.",
            "Learning Optimized Risk Scores.",
            "Nonparametric Estimation of Probability Density Functions of Random Persistence Diagrams.",
            "High-dimensional Varying Index Coefficient Models via Stein's Identity.",
            "Approximation Algorithms for Stochastic Clustering.",
            "Convergence Guarantees for a Class of Non-convex and Non-smooth Optimization Problems.",
            "Quantifying Uncertainty in Online Regression Forests.",
            "SimpleDet: A Simple and Versatile Distributed Framework for Object Detection and Instance Recognition.",
            "Simultaneous Phase Retrieval and Blind Deconvolution via Convex Programming.",
            "GraSPy: Graph Statistics in Python.",
            "Optimal Convergence Rates for Convex Distributed Optimization in Networks.",
            "Learning by Unsupervised Nonlinear Diffusion.",
            "Sparse Kernel Regression with Coefficient-based $\\ell_q-$regularization.",
            "A Kernel Multiple Change-point Algorithm via Model Selection.",
            "Two-Layer Feature Reduction for Sparse-Group Lasso via Decomposition of Convex Sets.",
            "The Reduced PC-Algorithm: Improved Causal Structure Learning in Large Random Networks.",
            "On the Convergence of Gaussian Belief Propagation with Nodes of Arbitrary Size.",
            "Unsupervised Evaluation and Weighted Aggregation of Ranked Classification Predictions.",
            "Stochastic Canonical Correlation Analysis.",
            "Determinantal Point Processes for Coresets.",
            "Embarrassingly Parallel Inference for Gaussian Processes.",
            "DBSCAN: Optimal Rates For Density-Based Cluster Estimation.",
            "Shared Subspace Models for Multi-Group Covariance Estimation.",
            "Optimization with Non-Differentiable Constraints with Applications to Fairness, Recall, Churn, and Other Goals.",
            "Fast Automatic Smoothing for Generalized Additive Models.",
            "Learning Overcomplete, Low Coherence Dictionaries with Linear Inference.",
            "DataWig: Missing Value Imputation for Tables.",
            "New Convergence Aspects of Stochastic Gradient Algorithms.",
            "All Models are Wrong, but Many are Useful: Learning a Variable's Importance by Studying an Entire Class of Prediction Models Simultaneously.",
            "Morpho-MNIST: Quantitative Assessment and Diagnostics for Representation Learning.",
            "Differentiable reservoir computing.",
            "DPPy: DPP Sampling with Python.",
            "Neural Empirical Bayes.",
            "Model Selection in Bayesian Neural Networks via Horseshoe Priors.",
            "Log-concave sampling: Metropolis-Hastings algorithms are fast.",
            "Why do deep convolutional networks generalize so poorly to small image transformations?"
        ]
    },
    {
        "name": "JMLR",
        "year": "2018",
        "info": "Volume 19: 2018",
        "count": 84,
        "papers": [
            "Numerical Analysis near Singularities in RBF Networks.",
            "A Two-Stage Penalized Least Squares Method for Constructing Large Systems of Structural Equations.",
            "Approximate Submodularity and its Applications: Subset Selection, Sparse Approximation and Dictionary Selection.",
            "A Hidden Absorbing Semi-Markov Model for Informatively Censored Temporal Data: Learning and Inference.",
            "Can We Trust the Bootstrap in High-dimensions? The Case of Linear Models.",
            "RSG: Beating Subgradient Method without Smoothness and Strong Convexity.",
            "Patchwork Kriging for Large-scale Gaussian Process Regression.",
            "Scalable Bayes via Barycenter in Wasserstein Space.",
            "Experience Selection in Deep Reinforcement Learning for Control.",
            "A Constructive Approach to $L_0$ Penalized Regression.",
            "Change-Point Computation for Large Graphical Models: A Scalable Algorithm for Gaussian Graphical Models with Change-Points.",
            "Statistical Analysis and Parameter Selection for Mapper.",
            "A Robust Learning Approach for Regression Models Based on Distributionally Robust Optimization.",
            "Model-Free Trajectory-based Policy Optimization with Monotonic Improvement.",
            "Regularized Optimal Transport and the Rot Mover's Distance.",
            "ELFI: Engine for Likelihood-Free Inference.",
            "Streaming kernel regression with provably adaptive mean, variance, and regularization.",
            "Dual Principal Component Pursuit.",
            "Distributed Proximal Gradient Algorithm for Partially Asynchronous Computer Clusters.",
            "Refining the Confidence Level for Optimistic Bandit Strategies.",
            "ThunderSVM: A Fast SVM Library on GPUs and CPUs.",
            "Robust Synthetic Control.",
            "Reverse Iterative Volume Sampling for Linear Regression.",
            "Universal discrete-time reservoir computers with stochastic inputs and linear readouts using non-homogeneous state-affine systems.",
            "Deep Hidden Physics Models: Deep Learning of Nonlinear Partial Differential Equations.",
            "OpenEnsembles: A Python Resource for Ensemble Clustering.",
            "Importance Sampling for Minibatches.",
            "Generalized Rank-Breaking: Computational and Statistical Tradeoffs.",
            "Gradient Descent Learns Linear Dynamical Systems.",
            "Parallelizing Spectrally Regularized Kernel Algorithms.",
            "A Direct Approach for Sparse Quadratic Discriminant Analysis.",
            "Distribution-Specific Hardness of Learning Neural Networks.",
            "Goodness-of-Fit Tests for Random Partitions via Symmetric Polynomials.",
            "A Spectral Approach for the Design of Experiments: Design, Analysis and Algorithms.",
            "Kernel Density Estimation for Dynamical Systems.",
            "Invariant Models for Causal Transfer Learning.",
            "The xyz algorithm for fast interaction search in high-dimensional data.",
            "Local Rademacher Complexity-based Learning Guarantees for Multi-Task Learning.",
            "State-by-state Minimax Adaptive Estimation for Nonparametric Hidden Markov Models.",
            "Learning from Comparisons and Choices.",
            "Connections with Robust PCA and the Role of Emergent Sparsity in Variational Autoencoder Models.",
            "An Efficient and Effective Generic Agglomerative Hierarchical Clustering Approach.",
            "Markov Blanket and Markov Boundary of Multiple Variables.",
            "Kernel Distribution Embeddings: Universal Kernels, Characteristic Kernels and Kernel Metrics on Distributions.",
            "Random Forests, Decision Trees, and Categorical Predictors: The \"Absent Levels\" Problem.",
            "On Tight Bounds for the Lasso.",
            "Harmonic Mean Iteratively Reweighted Least Squares for Low-Rank Matrix Recovery.",
            "On Generalized Bellman Equations and Temporal-Difference Learning.",
            "Design and Analysis of the NIPS 2016 Review Process.",
            "Emergence of Invariance and Disentanglement in Deep Representations.",
            "Covariances, Robustness, and Variational Bayes.",
            "Accelerating Cross-Validation in Multinomial Logistic Regression with $\\ell_1$-Regularization.",
            "Profile-Based Bandit with Unknown Profiles.",
            "How Deep Are Deep Gaussian Processes?",
            "Fast MCMC Sampling Algorithms on Polytopes.",
            "Modular Proximal Optimization for Multidimensional Total-Variation Regularization.",
            "On Semiparametric Exponential Family Graphical Models.",
            "Theoretical Analysis of Cross-Validation for Estimating the Risk of the $k$-Nearest Neighbor Classifier.",
            "Maximum Selection and Sorting with Adversarial Comparators.",
            "A New and Flexible Approach to the Analysis of Paired Comparison Data.",
            "Simple Classification Using Binary Data.",
            "Hinge-Minimax Learner for the Ensemble of Hyperplanes.",
            "Short-term Sparse Portfolio Optimization Based on Alternating Direction Method of Multipliers.",
            "Scaling up Data Augmentation MCMC via Calibration.",
            "Extrapolating Expected Accuracies for Large Multi-Class Problems.",
            "Inference via Low-Dimensional Couplings.",
            "Efficient Bayesian Inference of Sigmoidal Gaussian Cox Processes.",
            "Multivariate Bayesian Structural Time Series Model.",
            "Inverse Reinforcement Learning via Nonparametric Spatio-Temporal Subgoal Modeling.",
            "The Implicit Bias of Gradient Descent on Separable Data.",
            "Optimal Quantum Sample Complexity of Learning Algorithms.",
            "Scikit-Multiflow: A Multi-output Streaming Framework.",
            "Optimal Bounds for Johnson-Lindenstrauss Transformations.",
            "An efficient distributed learning algorithm based on effective local functional approximations.",
            "Sparse Estimation in Ising Model via Penalized Monte Carlo Methods.",
            "Using Side Information to Reliably Learn Low-Rank Matrices from Missing and Corrupted Observations.",
            "A Note on Quickly Sampling a Sparse Matrix with Low Rank Expectation.",
            "Online Bootstrap Confidence Intervals for the Stochastic Gradient Descent Estimator.",
            "A Random Matrix Analysis and Improvement of Semi-Supervised Learning for Large Dimensional Data.",
            "Robust PCA by Manifold Optimization.",
            "Improved Asynchronous Parallel Optimization Analysis for Stochastic Incremental Methods.",
            "Clustering is semidefinitely not that hard: Nonnegative SDP for manifold disentangling.",
            "Seglearn: A Python Package for Learning Sequences and Time Series.",
            "DALEX: Explainers for Complex Predictive Models in R."
        ]
    },
    {
        "name": "JMLR",
        "year": "2017",
        "info": "Volume 18: 2017",
        "count": 234,
        "papers": [
            "Averaged Collapsed Variational Bayes Inference.",
            "Scalable Influence Maximization for Multiple Products in Continuous-Time Diffusion Networks.",
            "Local algorithms for interactive clustering.",
            "SnapVX: A Network-Based Convex Optimization Solver.",
            "Communication-efficient Sparse Regression.",
            "Improving Variational Methods via Pairwise Linear Response Identities.",
            "Distributed Sequence Memory of Multidimensional Inputs in Recurrent Networks.",
            "Persistence Images: A Stable Vector Representation of Persistent Homology.",
            "Spectral Clustering Based on Local PCA.",
            "On Perturbed Proximal Gradient Algorithms.",
            "Differential Privacy for Bayesian Inference through Posterior Sampling.",
            "Refinery: An Open Source Topic Modeling Web Platform.",
            "Using Conceptors to Manage Neural Long-Term Memories for Temporal Patterns.",
            "Automatic Differentiation Variational Inference.",
            "Empirical Evaluation of Resampling Procedures for Optimising SVM Hyperparameters.",
            "A Unified Formulation and Fast Accelerated Proximal Gradient Method for Classification.",
            "Imbalanced-learn: A Python Toolbox to Tackle the Curse of Imbalanced Datasets in Machine Learning.",
            "Information-Geometric Optimization Algorithms: A Unifying Picture via Invariance Principles.",
            "Breaking the Curse of Dimensionality with Convex Neural Networks.",
            "Memory Efficient Kernel Approximation.",
            "On the Equivalence between Kernel Quadrature Rules and Random Feature Expansions.",
            "Analyzing Tensor Power Method Dynamics in Overcomplete Regime.",
            "JSAT: Java Statistical Analysis Tool, a Library for Machine Learning.",
            "Identifying a Minimal Class of Models for High-dimensional Data.",
            "Auto-WEKA 2.0: Automatic model selection and hyperparameter optimization in WEKA.",
            "POMDPs.jl: A Framework for Sequential Decision Making under Uncertainty.",
            "Generalized Pólya Urn for Time-Varying Pitman-Yor Processes.",
            "Particle Gibbs Split-Merge Sampling for Bayesian Inference in Mixture Models.",
            "Certifiably Optimal Low Rank Factor Analysis.",
            "Group Sparse Optimization via lp, q Regularization.",
            "Preference-based Teaching.",
            "Nonparametric Risk Bounds for Time-Series Forecasting.",
            "Online Bayesian Passive-Aggressive Learning.",
            "Asymptotic Analysis of Objectives Based on Fisher Information in Active Learning.",
            "A Spectral Algorithm for Inference in Hidden semi-Markov Models.",
            "Simplifying Probabilistic Expressions in Causal Inference.",
            "Nearly optimal classification for semimetrics.",
            "Bridging Supervised Learning and Test-Based Co-optimization.",
            "GFA: Exploratory Analysis of Multiple Data Sources with Group Factor Analysis.",
            "GPflow: A Gaussian Process Library using TensorFlow.",
            "COEVOLVE: A Joint Point Process Model for Information Diffusion and Network Evolution.",
            "Learning Local Dependence In Ordered Data.",
            "Bayesian Learning of Dynamic Multilayer Networks.",
            "Time-Accuracy Tradeoffs in Kernel Prediction: Controlling Prediction Quality.",
            "Asymptotic behavior of Support Vector Machine for spiked population model.",
            "Distributed Semi-supervised Learning with Kernel Ridge Regression.",
            "On Markov chain Monte Carlo methods for tall data.",
            "Explaining the Success of AdaBoost and Random Forests as Interpolating Classifiers.",
            "Clustering from General Pairwise Observations with Applications to Time-varying Graphs.",
            "Uniform Hypergraph Partitioning: Provable Tensor Methods and Sampling Techniques.",
            "Reconstructing Undirected Graphs from Eigenspaces.",
            "An Optimal Algorithm for Bandit and Zero-Order Convex Optimization with Two-Point Feedback.",
            "Perishability of Data: Dynamic Pricing under Varying-Coefficient Models.",
            "Two New Approaches to Compressed Sensing Exhibiting Both Robust Sparse Recovery and the Grouping Effect.",
            "On the Consistency of Ordinal Regression Methods.",
            "Statistical Inference with Unnormalized Discrete Models and Localized Homogeneous Divergences.",
            "Density Estimation in Infinite Dimensional Exponential Families.",
            "Lens Depth Function and k-Relative Neighborhood Graph: Versatile Tools for Ordinal Data Analysis.",
            "Joint Label Inference in Networks.",
            "Achieving Optimal Misclassification Proportion in Stochastic Block Models.",
            "On the Propagation of Low-Rate Measurement Error to Subgraph Counts in Large Networks.",
            "Dense Distributions from Sparse Samples: Improved Gibbs Sampling Parameter Estimators for LDA.",
            "Fundamental Conditions for Low-CP-Rank Tensor Completion.",
            "Parallel Symmetric Class Expression Learning.",
            "Learning Partial Policies to Speedup MDP Tree Search via Reduction to I.I.D. Learning.",
            "Hierarchically Compositional Kernels for Scalable Nonparametric Learning.",
            "Sharp Oracle Inequalities for Square Root Regularization.",
            "Soft Margin Support Vector Classification as Buffered Probability Minimization.",
            "Variational Particle Approximations.",
            "A Bayesian Framework for Learning Rule Sets for Interpretable Classification.",
            "A Robust-Equitable Measure for Feature Ranking and Selection.",
            "Multiscale Strategies for Computing Optimal Transport.",
            "Non-parametric Policy Search with Limited Information Loss.",
            "Tests of Mutual or Serial Independence of Random Vectors with Applications.",
            "Recovering PCA and Sparse PCA via Hybrid-(l1, l2) Sparse Sampling of Data Elements.",
            "Quantifying the Informativeness of Similarity Measurements.",
            "Time for a Change: a Tutorial for Comparing Multiple Classifiers Through Bayesian Analysis.",
            "Relational Reinforcement Learning for Planning with Exogenous Effects.",
            "Bayesian Tensor Regression.",
            "Robust Discriminative Clustering with Sparse Regularizers.",
            "Making Decision Trees Feasible in Ultrahigh Feature and Label Dimensions.",
            "Learning Scalable Deep Kernels with Recurrent Structure.",
            "Convolutional Neural Networks Analyzed via Convolutional Sparse Coding.",
            "Stochastic Primal-Dual Coordinate Method for Regularized Empirical Risk Minimization.",
            "Angle-based Multicategory Distance-weighted SVM.",
            "Minimax Estimation of Kernel Mean Embeddings.",
            "The Impact of Random Models on Clustering Similarity.",
            "Hierarchical Clustering via Spreading Metrics.",
            "The MADP Toolbox: An Open Source Library for Planning and Learning in (Multi-)Agent Systems.",
            "A survey of Algorithms and Analysis for Adaptive Online Learning.",
            "A distributed block coordinate descent method for training l1 regularized linear classifiers.",
            "Distributed Learning with Regularized Least Squares.",
            "Identifying Unreliable and Adversarial Workers in Crowdsourced Labeling Tasks.",
            "An Easy-to-hard Learning Paradigm for Multiple Classes and Multiple Labels.",
            "Fisher Consistency for Prior Probability Shift.",
            "openXBOW - Introducing the Passau Open-Source Crossmodal Bag-of-Words Toolkit.",
            "Optimal Rates for Multi-pass Stochastic Gradient Methods.",
            "Rank Determination for Low-Rank Data Completion.",
            "Bayesian Network Learning via Topological Order.",
            "Stability of Controllers for Gaussian Process Dynamics.",
            "Harder, Better, Faster, Stronger Convergence Rates for Least-Squares Regression.",
            "Confidence Sets with Expected Sizes for Multiclass Classification.",
            "Online Learning to Rank with Top-k Feedback.",
            "A Unifying Framework for Gaussian Process Pseudo-Point Approximations using Power Expectation Propagation.",
            "Accelerating Stochastic Composition Optimization.",
            "Distributed Bayesian Learning with Stochastic Natural Gradient Expectation Propagation and the Posterior Server.",
            "Optimal Dictionary for Least Squares Representation.",
            "Computational Limits of A Distributed Algorithm for Smoothing Spline.",
            "Hinge-Loss Markov Random Fields and Probabilistic Soft Logic.",
            "Clustering with Hidden Markov Model on Variable Blocks.",
            "Approximation Vector Machines for Large-scale Online Learning.",
            "Efficient Sampling from Time-Varying Log-Concave Distributions.",
            "Document Neural Autoregressive Distribution Estimation.",
            "Target Curricula via Selection of Minimum Feature Sets: a Case Study in Boolean Networks.",
            "A General Distributed Dual Coordinate Optimization Framework for Regularized Loss Minimization.",
            "Second-Order Stochastic Optimization for Machine Learning in Linear Time.",
            "Regularized Estimation and Testing for High-Dimensional Multi-Block Vector-Autoregressive Models.",
            "Learning Theory of Distributed Regression with Bias Corrected Regularization Kernel Network.",
            "Probabilistic Line Searches for Stochastic Optimization.",
            "Learning Instrumental Variables with Structural and Non-Gaussianity Assumptions.",
            "Classification of Time Sequences using Graphs of Temporal Constraints.",
            "Distributed Stochastic Variance Reduced Gradient Methods by Sampling Extra Data with Replacement.",
            "Kernel Partial Least Squares for Stationary Data.",
            "Robust and Scalable Bayes via a Median of Subset Posterior Measures.",
            "Statistical and Computational Guarantees for the Baum-Welch Algorithm.",
            "Online but Accurate Inference for Latent Variable Models with Local Gibbs Sampling.",
            "Poisson Random Fields for Dynamic Feature Models.",
            "Gap Safe Screening Rules for Sparsity Enforcing Penalties.",
            "Minimax Filter: Learning to Preserve Privacy from Inference Attacks.",
            "Knowledge Graph Completion via Complex Tensor Factorization.",
            "Stabilized Sparse Online Learning for Sparse Data.",
            "Active-set Methods for Submodular Minimization Problems.",
            "A Bayesian Mixed-Effects Model to Learn Trajectories of Changes from Repeated Manifold-Valued Observations.",
            "Stochastic Gradient Descent as Approximate Bayesian Inference.",
            "STORE: Sparse Tensor Response Regression and Neuroimaging Analysis.",
            "A Survey of Preference-Based Reinforcement Learning Methods.",
            "Generalized SURE for optimal shrinkage of singular values in low-rank matrix denoising.",
            "Dimension Estimation Using Random Connection Models.",
            "Bayesian Inference for Spatio-temporal Spike-and-Slab Priors.",
            "Adaptive Randomized Dimension Reduction on Massive Data.",
            "A Nonconvex Approach for Phase Retrieval: Reshaped Wirtinger Flow and Incremental Algorithms.",
            "Consistency, Breakdown Robustness, and Algorithms for Robust Improper Maximum Likelihood Clustering.",
            "On Computationally Tractable Selection of Experiments in Measurement-Constrained Regression Models.",
            "Generalized Conditional Gradient for Sparse Estimation.",
            "Following the Leader and Fast Rates in Online Linear Prediction: Curved Constraint Sets and Other Regularities.",
            "Regularization and the small-ball method II: complexity dependent error rates.",
            "Matrix Completion with Noisy Entries and Outliers.",
            "Faithfulness of Probability Distributions and Graphs.",
            "Community Extraction in Multilayer Networks with Heterogeneous Community Structure.",
            "On Binary Embedding using Circulant Matrices.",
            "Variational Fourier Features for Gaussian Processes.",
            "HyperTools: a Python Toolbox for Gaining Geometric Insights into High-Dimensional Data.",
            "Automatic Differentiation in Machine Learning: a Survey.",
            "Normal Bandits of Unknown Means and Variances.",
            "Cost-Sensitive Learning with Noisy Labels.",
            "Provably Correct Algorithms for Matrix Column Subset Selection with Selectively Sampled Data.",
            "A Study of the Classification of Low-Dimensional Data with Supervised Manifold Learning.",
            "Probabilistic preference learning with the Mallows rank model.",
            "Robust Topological Inference: Distance To a Measure and Kernel Distance.",
            "Training Gaussian Mixture Models at Scale via Coresets.",
            "Gradient Estimation with Simultaneous Perturbation and Compressive Sensing.",
            "Principled Selection of Hyperparameters in the Latent Dirichlet Allocation Model.",
            "Deep Learning the Ising Model Near Criticality.",
            "pomegranate: Fast and Flexible Probabilistic Modeling in Python.",
            "Maximum Principle Based Algorithms for Deep Learning.",
            "Gradient Hard Thresholding Pursuit.",
            "Risk-Constrained Reinforcement Learning with Percentile Risk Criteria.",
            "Local Identifiability of $\\ell_1$-minimization Dictionary Learning: a Sufficient and Almost Necessary Condition.",
            "In Search of Coherence and Consensus: Measuring the Interpretability of Statistical Topics.",
            "On the Behavior of Intrinsically High-Dimensional Spaces: Distances, Direct and Reverse Nearest Neighbors, and Hubness.",
            "Convergence of Unregularized Online Learning Algorithms.",
            "Convergence Analysis of Distributed Inference with Vector-Valued Gaussian Belief Propagation.",
            "auDeep: Unsupervised Learning of Representations from Audio with Deep Recurrent Neural Networks.",
            "On the Stability of Feature Selection Algorithms.",
            "Maximum Likelihood Estimation for Mixtures of Spherical Gaussians is NP-hard.",
            "The DFS Fused Lasso: Linear-Time Denoising over General Graphs.",
            "Community Detection and Stochastic Block Models: Recent Developments.",
            "On $b$-bit Min-wise Hashing for Large-scale Regression and Classification with Sparse Data.",
            "Efficient Learning with a Family of Nonconvex Regularizers by Redistributing Nonconvexity.",
            "Mode-Seeking Clustering and Density Ridge Estimation via Direct Estimation of Density-Derivative-Ratios.",
            "To Tune or Not to Tune the Number of Trees in Random Forest.",
            "Divide-and-Conquer for Debiased $l_1$-norm Support Vector Machine in Ultra-high Dimensions.",
            "Beyond the Hazard Rate: More Perturbation Algorithms for Adversarial Multi-armed Bandits.",
            "On Faster Convergence of Cyclic Block Coordinate Descent-type Methods for Strongly Convex Minimization.",
            "Hyperband: A Novel Bandit-Based Approach to Hyperparameter Optimization.",
            "Submatrix localization via message passing.",
            "Quantized Neural Networks: Training Neural Networks with Low Precision Weights and Activations.",
            "Significance-based community detection in weighted networks.",
            "Kernel Method for Persistence Diagrams via Kernel Embedding and Weight Factor.",
            "Pycobra: A Python Toolbox for Ensemble Learning and Visualisation.",
            "KELP: a Kernel-based Learning Platform.",
            "Uncovering Causality from Multivariate Hawkes Integrated Cumulants.",
            "Making Better Use of the Crowd: How Crowdsourcing Can Advance Machine Learning Research.",
            "Enhancing Identification of Causal Effects by Pruning.",
            "Active Nearest-Neighbor Learning in Metric Spaces.",
            "From Predictive Methods to Missing Data Imputation: An Optimization Approach.",
            "Saturating Splines and Feature Selection.",
            "Nonasymptotic convergence of stochastic proximal point methods for constrained convex optimization.",
            "Simple, Robust and Optimal Ranking from Pairwise Comparisons.",
            "Surprising properties of dropout in deep networks.",
            "Exact Learning of Lightweight Description Logic Ontologies.",
            "Sparse Concordance-assisted Learning for Optimal Treatment Decision.",
            "Post-Regularization Inference for Time-Varying Nonparanormal Graphical Models.",
            "Permuted and Augmented Stick-Breaking Bayesian Multinomial Regression.",
            "Steering Social Activity: A Stochastic Optimal Control Point Of View.",
            "The Search Problem in Mixture Models.",
            "An $\\ell_{\\infty}$ Eigenvector Perturbation Bound and Its Application.",
            "A Tight Bound of Hard Thresholding.",
            "Estimation of Graphical Models through Structured Norm Minimization.",
            "Sparse Exchangeable Graphs and Their Limits via Graphon Processes.",
            "Weighted SGD for $\\ell_p$ Regression with Randomized Preconditioning.",
            "Catalyst Acceleration for First-order Convex Optimization: from Theory to Practice.",
            "Gaussian Lower Bound for the Information Bottleneck Limit.",
            "tick: a Python Library for Statistical Learning, with an emphasis on Hawkes Processes and Time-Dependent Models.",
            "SGDLibrary: A MATLAB library for stochastic optimization algorithms.",
            "Reward Maximization Under Uncertainty: Leveraging Side-Observations on Networks.",
            "Simultaneous Clustering and Estimation of Heterogeneous Graphical Models.",
            "Sketched Ridge Regression: Optimization Perspective, Statistical Perspective, and Model Averaging.",
            "Compact Convex Projections.",
            "Complete Graphical Characterization and Construction of Adjustment Sets in Markov Equivalence Classes of Ancestral Graphs.",
            "Katyusha: The First Direct Acceleration of Stochastic Gradient Methods.",
            "Average Stability is Invariant to Data Preconditioning. Implications to Exp-concave Empirical Risk Minimization.",
            "Parallelizing Stochastic Gradient Descent for Least Squares Regression: Mini-batching, Averaging, and Model Misspecification.",
            "Learning Quadratic Variance Function (QVF) DAG Models via OverDispersion Scoring (ODS).",
            "Improved spectral community detection in large heterogeneous networks.",
            "Statistical Inference on Random Dot Product Graphs: a Survey.",
            "Rate of Convergence of $k$-Nearest-Neighbor Classification Rule.",
            "A Theory of Learning with Corrupted Labels.",
            "Interactive Algorithms: Pool, Stream and Precognitive Stream.",
            "CoCoA: A General Framework for Communication-Efficient Distributed Optimization.",
            "Concentration inequalities for empirical processes of linear time series.",
            "A Cluster Elastic Net for Multivariate Regression.",
            "Characteristic and Universal Tensor Product Kernels.",
            "Learning Certifiably Optimal Rule Lists for Categorical Data."
        ]
    },
    {
        "name": "JMLR",
        "year": "2016",
        "info": "Volume 17: 2016",
        "count": 236,
        "papers": [
            "On the Complexity of Best-Arm Identification in Multi-Armed Bandit Models.",
            "Multiscale Dictionary Learning: Non-Asymptotic Bounds and Robustness.",
            "Consistent Algorithms for Clustering Time Series.",
            "Random Rotation Ensembles.",
            "Should We Really Use Post-Hoc Tests Based on Mean-Ranks?",
            "Minimax Rates in Permutation Estimation for Feature Matching.",
            "Consistency and Fluctuations For Stochastic Gradient Langevin Dynamics.",
            "Knowledge Matters: Importance of Prior Information for Optimization.",
            "Harry: A Tool for Measuring String Similarity.",
            "Herded Gibbs Sampling.",
            "Complexity of Representation and Inference in Compositional Models with Part Sharing.",
            "Noisy Sparse Subspace Clustering.",
            "Learning the Variance of the Reward-To-Go.",
            "Convex Calibration Dimension for Multiclass Loss Matrices.",
            "LLORMA: Local Low-Rank Matrix Approximation.",
            "A Consistent Information Criterion for Support Vector Machines in Diverging Model Spaces.",
            "Extremal Mechanisms for Local Differential Privacy.",
            "Loss Minimization and Parameter Estimation with Heavy Tails.",
            "Analysis of Classification-based Policy Iteration Algorithms.",
            "Operator-valued Kernels for Learning from Functional Response Data.",
            "MEKA: A Multi-label/Multi-target Extension to WEKA.",
            "Gradients Weights improve Regression and Classification.",
            "A Closer Look at Adaptive Regret.",
            "Learning Using Anti-Training with Sacrificial Data.",
            "A Unifying Framework in Vector-valued Reproducing Kernel Hilbert Spaces for Manifold Regularization and Co-Regularized Multi-view Learning.",
            "Quantifying Uncertainty in Random Forests via Confidence Intervals and Hypothesis Tests.",
            "Statistical-Computational Tradeoffs in Planted Problems and Submatrix Localization with a Growing Number of Clusters and Submatrices.",
            "Non-linear Causal Inference using Gaussianity Measures.",
            "Consistent Distribution-Free $K$-Sample and Independence Tests for Univariate Random Variables.",
            "A Gibbs Sampler for Learning DAGs.",
            "Dimension-free Concentration Bounds on Hankel Matrices for Spectral Learning.",
            "Distinguishing Cause from Effect Using Observational Data: Methods and Benchmarks.",
            "Multi-task Sparse Structure Learning with Gaussian Copula Models.",
            "MLlib: Machine Learning in Apache Spark.",
            "OLPS: A Toolbox for On-Line Portfolio Selection.",
            "A Bounded p-norm Approximation of Max-Convolution for Sub-Quadratic Bayesian Inference on Additive Factors.",
            "Hybrid Orthogonal Projection and Estimation (HOPE): A New Framework to Learn Neural Networks.",
            "The Optimal Sample Complexity of PAC Learning.",
            "End-to-End Training of Deep Visuomotor Policies.",
            "On Quantile Regression in Reproducing Kernel Hilbert Spaces with the Data Sparsity Constraint.",
            "BayesPy: Variational Bayesian Inference in Python.",
            "Variational Inference for Latent Variables and Uncertain Inputs in Gaussian Processes.",
            "On the Estimation of the Gradient Lines of a Density and the Consistency of the Mean-Shift Algorithm.",
            "Scalable Learning of Bayesian Network Classifiers.",
            "A Unified View on Multi-class Support Vector Classification.",
            "Addressing Environment Non-Stationarity by Repeating Q-learning Updates.",
            "Large Scale Online Kernel Learning.",
            "Kernel Mean Shrinkage Estimators.",
            "SPSD Matrix Approximation vis Column Selection: Theories, Algorithms, and Extensions.",
            "Combinatorial Multi-Armed Bandit and Its Extension to Probabilistically Triggered Arms.",
            "Differentially Private Data Releasing for Smooth Queries.",
            "Subspace Learning with Partial Information.",
            "Iterative Hessian Sketch: Fast and Accurate Solution Approximation for Constrained Least-Squares.",
            "Estimating Causal Structure Using Conditional DAG Models.",
            "Adaptive Lasso and group-Lasso for functional Poisson regression.",
            "Causal Inference through a Witness Protection Program.",
            "Structure Discovery in Bayesian Networks by Sampling Partial Orders.",
            "Estimation from Pairwise Comparisons: Sharp Minimax Bounds with Topology Dependence.",
            "Domain-Adversarial Training of Neural Networks.",
            "Probabilistic Low-Rank Matrix Completion from Quantized Measurements.",
            "DSA: Decentralized Double Stochastic Averaging Gradient Algorithm.",
            "The Statistical Performance of Collaborative Inference.",
            "Convergence of an Alternating Maximization Procedure.",
            "StructED: Risk Minimization in Structured Prediction.",
            "Stereo Matching by Training a Convolutional Neural Network to Compare Image Patches.",
            "Bayesian Policy Gradient and Actor-Critic Algorithms.",
            "Practical Kernel-Based Reinforcement Learning.",
            "An Information-Theoretic Analysis of Thompson Sampling.",
            "Compressed Gaussian Process for Manifold Regression.",
            "On the Characterization of a Class of Fisher-Consistent Loss Functions and its Application to Boosting.",
            "Exact Inference on Gaussian Graphical Models of Arbitrary Topology using Path-Sums.",
            "Challenges in multimodal gesture recognition.",
            "An Emphatic Approach to the Problem of Off-policy Temporal-Difference Learning.",
            "Learning Algorithms for Second-Price Auctions with Reserve.",
            "Distributed Coordinate Descent Method for Learning with Big Data.",
            "Scaling-up Empirical Risk Minimization: Optimization of Incomplete $U$-statistics.",
            "Iterative Regularization for Learning with Convex Loss Functions.",
            "Latent Space Inference of Internet-Scale Networks.",
            "Patient Risk Stratification with Time-Varying Parameters: A Multitask Learning Approach.",
            "Multiplicative Multitask Feature Learning.",
            "The Benefit of Multitask Representation Learning.",
            "Model-free Variable Selection in Reproducing Kernel Hilbert Space.",
            "CVXPY: A Python-Embedded Modeling Language for Convex Optimization.",
            "Lenient Learning in Independent-Learner Stochastic Cooperative Games.",
            "Structure-Leveraged Methods in Breast Cancer Risk Prediction.",
            "LIBMF: A Library for Parallel Matrix Factorization in Shared-memory Systems.",
            "L1-Regularized Least Squares for Support Recovery of High Dimensional Single Index Models with Gaussian Designs.",
            "Spectral Ranking using Seriation.",
            "Sparsity and Error Analysis of Empirical Feature-Based Regularization Schemes.",
            "Estimating Diffusion Networks: Recovery Conditions, Sample Complexity and Soft-thresholding Algorithm.",
            "Rounding-based Moves for Semi-Metric Labeling.",
            "Rate Optimal Denoising of Simultaneously Sparse and Low Rank Matrices.",
            "Hierarchical Relative Entropy Policy Search.",
            "Convex Regression with Interpretable Sharp Partitions.",
            "JCLAL: A Java Framework for Active Learning.",
            "Integrated Common Sense Learning and Planning in POMDPs.",
            "Cells in Multidimensional Recurrent Neural Networks.",
            "Learning Taxonomy Adaptation in Large-scale Classification.",
            "How to Center Deep Boltzmann Machines.",
            "Control Function Instrumental Variable Estimation of Nonlinear Causal Effect Models.",
            "Structure Learning in Bayesian Networks of a Moderate Size by Efficient Sampling.",
            "Spectral Methods Meet EM: A Provably Optimal Algorithm for Crowdsourcing.",
            "Bayesian Leave-One-Out Cross-Validation Approximations for Gaussian Latent Variable Models.",
            "e-PAL: An Active Learning Approach to the Multi-Objective Optimization Problem.",
            "Trend Filtering on Graphs.",
            "Multi-Task Learning for Straggler Avoiding Predictive Job Scheduling.",
            "Interleaved Text/Image Deep Mining on a Large-Scale Radiology Database for Automated Image Interpretation.",
            "Distribution-Matching Embedding for Visual Domain Adaptation.",
            "Monotonic Calibrated Interpolated Look-Up Tables.",
            "Are Random Forests Truly the Best Classifiers?",
            "Minimax Adaptive Estimation of Nonparametric Hidden Markov Models.",
            "Decrypting \"Cryptogenic\" Epilepsy: Semi-supervised Hierarchical Conditional Random Fields For Detecting Cortical Lesions In MRI-Negative Patients.",
            "Fused Lasso Approach in Regression Coefficients Clustering - Learning Parameter Heterogeneity in Data Integration.",
            "The LRP Toolbox for Artificial Neural Networks.",
            "Equivalence of Graphical Lasso and Thresholding for Sparse Graphs.",
            "A Network That Learns Strassen Multiplication.",
            "Revisiting the Nystrom Method for Improved Large-scale Machine Learning.",
            "Improving Structure MCMC for Bayesian Networks through Markov Blanket Resampling.",
            "Volumetric Spanners: An Efficient Exploration Basis for Learning.",
            "Quasi-Monte Carlo Feature Maps for Shift-Invariant Kernels.",
            "Variational Dependent Multi-output Gaussian Process Dynamical Systems.",
            "Multiple Output Regression with Latent Noise.",
            "The Constrained Dantzig Selector with Enhanced Consistency.",
            "Bootstrap-Based Regularization for Low-Rank Matrix Estimation.",
            "Bayesian Optimization for Likelihood-Free Inference of Simulator-Based Statistical Models.",
            "On Lower and Upper Bounds in Smooth and Strongly Convex Optimization.",
            "Dual Control for Approximate Bayesian Reinforcement Learning.",
            "Multiple-Instance Learning from Distributions.",
            "An Online Convex Optimization Approach to Blackwell's Approachability.",
            "A Well-Conditioned and Sparse Estimation of Covariance and Inverse Covariance Matrices Using a Joint Penalty.",
            "String and Membrane Gaussian Processes.",
            "Extracting PICO Sentences from Clinical Trial Reports using Supervised Distant Supervision.",
            "Cross-Corpora Unsupervised Learning of Trajectories in Autism Spectrum Disorders.",
            "Adjusting for Chance Clustering Comparison Measures.",
            "Refined Error Bounds for Several Learning Algorithms.",
            "Synergy of Monotonic Rules.",
            "Pymanopt: A Python Toolbox for Optimization on Manifolds using Automatic Differentiation.",
            "CrossCat: A Fully Bayesian Nonparametric Method for Analyzing Heterogeneous, High Dimensional Data.",
            "Regularized Policy Iteration with Nonparametric Function Spaces.",
            "Multiscale Adaptive Representation of Signals: I. The Basic Framework.",
            "Sparse PCA via Covariance Thresholding.",
            "Large Scale Visual Recognition through Adaptation using Joint Representation and Multiple Instance Learning.",
            "Covariance-based Clustering in Multivariate and Functional Data Analysis.",
            "MOCCA: Mirrored Convex/Concave Optimization for Nonconvex Composite Functions.",
            "True Online Temporal-Difference Learning.",
            "Penalized Maximum Likelihood Estimation of Multi-layered Gaussian Graphical Models.",
            "Local Network Community Detection with Continuous Optimization of Conductance and Weighted Kernel K-Means.",
            "Megaman: Scalable Manifold Learning in Python.",
            "Kernel Estimation and Model Combination in A Bandit Problem with Covariates.",
            "A General Framework for Consistency of Principal Component Analysis.",
            "Conditional Independencies under the Algorithmic Independence of Conditionals.",
            "Learning Theory for Distribution Regression.",
            "A Differential Equation for Modeling Nesterov's Accelerated Gradient Method: Theory and Insights.",
            "Importance Weighting Without Importance Weights: An Efficient Algorithm for Combinatorial Semi-Bandits.",
            "New Perspectives on k-Support and Cluster Norms.",
            "Minimum Density Hyperplanes.",
            "Theoretical Analysis of the Optimal Free Responses of Graph-Based SFA for the Design of Training Graphs.",
            "Universal Approximation Results for the Temporal Restricted Boltzmann Machine and the Recurrent Temporal Restricted Boltzmann Machine.",
            "Exploration of the (Non-)Asymptotic Bias and Variance of Stochastic Gradient Langevin Dynamics.",
            "A General Framework for Constrained Bayesian Optimization using Information-based Search.",
            "Optimal Estimation and Completion of Matrices with Biclustering Structures.",
            "The Teaching Dimension of Linear Learners.",
            "Augmentable Gamma Belief Networks.",
            "Optimal Estimation of Derivatives in Nonparametric Regression.",
            "Double or Nothing: Multiplicative Incentive Mechanisms for Crowdsourcing.",
            "Joint Structural Estimation of Multiple Graphical Models.",
            "Support Vector Hazards Machine: A Counting Process Framework for Learning Risk Scores for Censored Outcomes.",
            "Stable Graphical Models.",
            "Bounding the Search Space for Global Optimization of Neural Networks Learning Error: An Interval Analysis Approach.",
            "mlr: Machine Learning in R.",
            "Feature-Level Domain Adaptation.",
            "Semiparametric Mean Field Variational Bayes: General Principles and Numerical Issues.",
            "Online PCA with Optimal Regret.",
            "Efficient Computation of Gaussian Process Regression for Large Spatial Data Sets by Patching Local Gaussian Processes.",
            "bandicoot: a Python Toolbox for Mobile Phone Metadata.",
            "Input Output Kernel Regression: Supervised and Semi-Supervised Structured Output Prediction with Operator-Valued Kernels.",
            "A Note on the Sample Complexity of the Er-SpUD Algorithm by Spielman, Wang and Wright for Exact Recovery of Sparsely Used Dictionaries.",
            "The Asymptotic Performance of Linear Echo State Neural Networks.",
            "On the Consistency of the Likelihood Maximization Vertex Nomination Scheme: Bridging the Gap Between Maximum Likelihood Estimation and Graph Matching.",
            "Characteristic Kernels and Infinitely Divisible Distributions.",
            "Consistency of Cheeger and Ratio Graph Cuts.",
            "Jointly Informative Feature Selection Made Tractable by Gaussian Modeling.",
            "Learning with Differential Privacy: Stability, Learnability and the Sufficiency and Necessity of ERM Principle.",
            "fastFM: A Library for Factorization Machines.",
            "The Factorized Self-Controlled Case Series Method: An Approach for Estimating the Effects of Many Drugs on Many Outcomes.",
            "Electronic Health Record Analysis via Deep Poisson Factor Models.",
            "Low-Rank Doubly Stochastic Matrix Decomposition for Cluster Analysis.",
            "A New Algorithm and Theory for Penalized Regression-based Clustering.",
            "Classification of Imbalanced Data with a Geometric Digraph Family.",
            "A Variational Approach to Path Estimation and Parameter Inference of Hidden Diffusion Processes.",
            "One-class classification of point patterns of extremes.",
            "On the Influence of Momentum Acceleration on Online Learning.",
            "Data-driven Rank Breaking for Efficient Rank Aggregation.",
            "Optimal Learning Rates for Localized SVMs.",
            "Bipartite Ranking: a Risk-Theoretic Perspective.",
            "Bayesian group factor analysis with structured sparsity.",
            "Machine Learning in an Auction Environment.",
            "Wavelet decompositions of Random Forests - smoothness analysis, sparse approximation and applications.",
            "Mutual Information Based Matching for Causal Inference with Observational Data.",
            "Online Trans-dimensional von Mises-Fisher Mixture Models for User Profiles.",
            "Multivariate Spearman's rho for Aggregating Ranks Using Copulas.",
            "Nonparametric Network Models for Link Prediction.",
            "Guarding against Spurious Discoveries in High Dimensions.",
            "Bayesian Graphical Models for Multivariate Functional Data.",
            "Neural Autoregressive Distribution Estimation.",
            "ERRATA: On the Estimation of the Gradient Lines of a Density and the Consistency of the Mean-Shift Algorithm.",
            "Modelling Interactions in High-dimensional Data with Backtracking.",
            "Choice of V for V-Fold Cross-Validation in Least-Squares Density Estimation.",
            "Towards More Efficient SPSD Matrix Approximation and CUR Matrix Decomposition.",
            "Multi-Objective Markov Decision Processes for Data-Driven Decision Support.",
            "Measuring Dependence Powerfully and Equitably.",
            "Neyman-Pearson Classification under High-Dimensional Settings.",
            "A Statistical Perspective on Randomized Sketching for Ordinary Least-Squares.",
            "Learning Planar Ising Models.",
            "Newton-Stein Method: An Optimization Method for GLMs via Stein's Lemma.",
            "Bayesian Decision Process for Cost-Efficient Dynamic Ranking via Crowdsourcing.",
            "Multi-scale Classification using Localized Spatial Depth.",
            "On Bayes Risk Lower Bounds.",
            "Weak Convergence Properties of Constrained Emphatic Temporal-difference Learning with Constant and Slowly Diminishing Stepsize.",
            "RLScore: Regularized Least-Squares Learners.",
            "Stability and Generalization in Structured Prediction.",
            "Composite Multiclass Losses.",
            "Learning Latent Variable Models by Pairwise Cluster Comparison: Part I - Theory and Overview.",
            "GenSVM: A Generalized Multiclass Support Vector Machine.",
            "Scalable Approximate Bayesian Inference for Outlier Detection under Informative Sampling.",
            "Approximate Newton Methods for Policy Search in Markov Decision Processes.",
            "Gains and Losses are Fundamentally Different in Regret Minimization: The Sparse Case.",
            "Linear Convergence of Randomized Feasible Descent Methods Under the Weak Strong Convexity Assumption.",
            "A Practical Scheme and Fast Algorithm to Tune the Lasso With Optimality Guarantees.",
            "A Characterization of Linkage-Based Hierarchical Clustering.",
            "Learning Latent Variable Models by Pairwise Cluster Comparison: Part II - Algorithm and Evaluation.",
            "Integrative Analysis using Coupled Latent Variable Models for Individualizing Prognoses.",
            "An Error Bound for L1-norm Support Vector Machine Coefficients in Ultra-high Dimension.",
            "Blending Learning and Inference in Conditional Random Fields.",
            "Distributed Submodular Maximization.",
            "On the properties of variational approximations of Gibbs posteriors."
        ]
    },
    {
        "name": "JMLR",
        "year": "2015",
        "info": "Volume 16: 2015",
        "count": 118,
        "papers": [
            "Statistical decision making for optimal budget allocation in crowd labeling.",
            "Simultaneous pursuit of sparseness and rank structures for matrix decomposition.",
            "Statistical topological data analysis using persistence landscapes.",
            "Links between multiplicity automata, observable operator models and predictive state representations: a unified learning framework.",
            "SAMOA: scalable advanced massive online analysis.",
            "Online learning via sequential complexities.",
            "Learning transformations for clustering and classification.",
            "Multi-layered gesture recognition with Kinect.",
            "Multimodal gesture recognition via multiple hypotheses rescoring.",
            "An asynchronous parallel stochastic coordinate descent algorithm.",
            "Geometric intuition and algorithms for Ev-SVM.",
            "Composite self-concordant minimization.",
            "Network granger causality with inherent grouping structure.",
            "Iterative and active graph clustering using trace norm minimization without cluster size constraints.",
            "A classification module for genetic programming algorithms in JCLEC.",
            "AD3: alternating directions dual decomposition for MAP inference in graphical models.",
            "Introducing CURRENNT: the munich open-source CUDA recurrent neural network toolkit.",
            "The flare package for high dimensional linear regression and precision matrix estimation in R.",
            "Regularized M-estimators with nonconvexity: statistical and algorithmic theory for local optima.",
            "Generalized hierarchical kernel learning.",
            "Discrete restricted Boltzmann machines.",
            "Evolving GPU machine code.",
            "A compression technique for analyzing disagreement-based active learning.",
            "Response-based approachability with applications to generalized no-regret problems.",
            "Strong consistency of the prototype based clustering in probabilistic space.",
            "Risk bounds for the majority vote: from a PAC-Bayesian analysis to a learning algorithm.",
            "A statistical perspective on algorithmic leveraging.",
            "Distributed matrix completion and robust factorization.",
            "Combined l1 and greedy l0 penalized least squares for linear model selection.",
            "Learning with the maximum correntropy criterion induced losses for regression.",
            "Joint estimation of multiple precision matrices with common structures.",
            "Lasso screening rules via dual polytope projection.",
            "Fast cross-validation via sequential testing.",
            "Learning the structure and parameters of large-population graphical games from behavioral data.",
            "Local identification of overcomplete dictionaries.",
            "Encog: library of interchangeable machine learning models for Java and C#.",
            "Perturbed message passing for constraint satisfaction problems.",
            "Learning sparse low-threshold linear classifiers.",
            "Learning equilibria of games via payoff queries.",
            "Rationality, optimism and guarantees in general reinforcement learning.",
            "The algebraic combinatorial approach for low-rank matrix completion.",
            "A comprehensive survey on safe reinforcement learning.",
            "Second-order non-stationary online learning for regression.",
            "A finite sample analysis of the Naive Bayes classifier.",
            "Flexible high-dimensional classification machines and their asymptotic properties.",
            "RLPy: a value-function-based reinforcement learning framework for education and research.",
            "Calibrated multivariate regression with application to neural semantic basis discovery.",
            "Bayesian nonparametric crowdsourcing.",
            "Approximate modified policy iteration and its application to the game of Tetris.",
            "Preface to this special issue.",
            "V-matrix method of solving statistical inference problems.",
            "Batch learning from logged bandit feedback through counterfactual risk minimization.",
            "Optimal estimation of low rank density matrices.",
            "Fast rates in statistical and online learning.",
            "On the asymptotic normality of an estimate of a regression functional.",
            "Sharp oracle bounds for monotone and convex regression through aggregation.",
            "Exceptional rotations of random graphs: a VC theory.",
            "Semi-supervised interpolation in an anticausal learning scenario.",
            "Towards an axiomatic approach to hierarchical clustering of measures.",
            "Predicting a switching sequence of graph labelings.",
            "Learning using privileged information: similarity control and knowledge transfer.",
            "Alexey Chervonenkis's bibliography: introductory comments.",
            "Alexey Chervonenkis's bibliography.",
            "Photonic delay systems as machine learning implementations.",
            "On linearly constrained minimum variance beamforming.",
            "Constraint-based causal discovery from multiple interventions over overlapping variable sets.",
            "Existence and uniqueness of proper scoring rules.",
            "Adaptive strategy for stratified Monte Carlo sampling.",
            "Concave penalized estimation of sparse Gaussian Bayesian networks.",
            "Agnostic insurability of model classes.",
            "Achievability of asymptotic minimax regret by horizon-dependent and horizon-independent strategies.",
            "Multiclass learnability and the ERM principle.",
            "Geometry and expressive power of conditional restricted Boltzmann machines.",
            "From dependency to causality: a machine learning approach.",
            "The Libra toolkit for probabilistic models.",
            "Complexity of equivalence and learning for multiplicity tree automata.",
            "Bayesian nonparametric covariance regression.",
            "A general framework for fast stagewise algorithms.",
            "Counting and exploring sizes of Markov equivalence classes of directed acyclic graphs.",
            "pyGPs: a Python library for Gaussian process regression and classification.",
            "Derivative estimation based on difference sequence via locally weighted least squares regression.",
            "When are overcomplete topic models identifiable? uniqueness of tensor tucker decompositions with structured sparsity.",
            "Absent data generating classifier for imbalanced class sizes.",
            "Decision boundary for discrete Bayesian network classifiers.",
            "A view of margin losses as regularizers of probability estimates.",
            "Online tensor methods for learning latent variable models.",
            "Optimal Bayesian estimation in random covariate design with a rescaled Gaussian process prior.",
            "CEKA: a tool for mining the wisdom of crowds.",
            "Linear dimensionality reduction: survey, insights, and generalizations.",
            "The Randomized Causation Coefficient.",
            "Optimality of Poisson processes intensity learning with Gaussian processes.",
            "Combination of feature engineering and ranking models for paper-author identification in KDD cup 2013.",
            "Comparing hard and overlapping clusterings.",
            "Completing any low-rank matrix, provably.",
            "Eigenwords: spectral word embeddings.",
            "Discrete reproducing kernel Hilbert spaces: sampling and distribution of Dirac-masses.",
            "A direct estimation of high dimensional stationary vector autoregressions.",
            "Global convergence of online limited memory BFGS.",
            "On semi-supervised linear regression in covariate shift problems.",
            "Ultra-scalable and efficient methods for hybrid observational and experimental local causal pathway discovery.",
            "Plug-and-play dual-tree algorithm runtime analysis.",
            "Divide and conquer kernel ridge regression: a distributed algorithm with minimax optimal rates.",
            "Learning theory of randomized Kaczmarz algorithm.",
            "Matrix completion and low-rank SVD via fast alternating least squares.",
            "On the inductive bias of dropout.",
            "Agnostic learning of disjunctions on symmetric distributions.",
            "SnFFT: a Julia toolkit for Fourier analysis of functions over permutations.",
            "The sample complexity of learning linear predictors with the squared loss.",
            "Minimax analysis of active learning.",
            "Convergence rates for persistence diagram estimation in topological data analysis.",
            "Supervised learning via Euler's Elastica models.",
            "Learning to identify concise regular expressions that describe email campaigns.",
            "Non-asymptotic analysis of a new bandit algorithm for semi-bounded rewards.",
            "Condition for perfect dimensionality recovery by variational Bayesian PCA.",
            "Graphical models via univariate exponential family distributions.",
            "Marginalizing stacked linear denoising autoencoders.",
            "PAC optimal MDP planning with application to invasive species management.",
            "Partykit: a modular toolkit for recursive partytioning in R."
        ]
    },
    {
        "name": "JMLR",
        "year": "2014",
        "info": "Volume 15: 2014",
        "count": 120,
        "papers": [
            "Bridging Viterbi and posterior decoding: a generalized risk approach to hidden path inference based on hidden Markov models.",
            "Fast SVM training using approximate extreme points.",
            "Detecting click fraud in online advertising: a data mining approach.",
            "EnsembleSVM: a library for ensemble learning using support vector machines.",
            "A junction tree framework for undirected graphical model selection.",
            "Axioms for graph clustering quality functions.",
            "Convex vs non-convex estimators for regression and sparse estimation: the mean squared error properties of ARD and GLasso.",
            "Using trajectory data to improve bayesian optimization for reinforcement learning.",
            "Information theoretical estimators toolbox.",
            "Off-policy learning with eligibility traces: a survey.",
            "Early stopping and non-parametric regression: an optimal data-dependent stopping rule.",
            "Unbiased generative semi-supervised learning.",
            "Node-based learning of multiple Gaussian graphical models.",
            "The fastclime package for linear programming and large-scale precision matrix estimation in R.",
            "LIBOL: a library for online learning algorithms.",
            "Improving Markov network structure learning using decision trees.",
            "Ground metric learning.",
            "Link prediction in graphs with autoregressive features.",
            "Adaptivity of averaged stochastic gradient descent to local strong convexity for logistic regression.",
            "Random intersection trees.",
            "Reinforcement learning for closed-loop propofol anesthesia: a study in human volunteers.",
            "Clustering hidden Markov models with variational HEM.",
            "A novel M-estimator for robust PCA.",
            "Policy evaluation with temporal differences: a survey and comparison.",
            "Active learning using smooth relative regret approximations with applications.",
            "An extension of slow feature analysis for nonlinear blind source separation.",
            "Natural evolution strategies.",
            "Conditional random field with high-order dependencies for sequence labeling and segmentation.",
            "Ellipsoidal rounding for nonnegative matrix factorization under noisy separability.",
            "Improving prediction from dirichlet process mixtures via enrichment.",
            "Gibbs max-margin topic models with data augmentation.",
            "A reliable effective terascale linear learning system.",
            "New learning methods for supervised and unsupervised preference aggregation.",
            "Prediction and clustering in signed networks: a local to global perspective.",
            "Bayesian nonparametric comorbidity analysis of psychiatric disorders.",
            "Robust near-separable nonnegative matrix factorization using linear optimization.",
            "Follow the leader if you can, hedge if you must.",
            "Structured prediction via output space search.",
            "Fully simplified multivariate normal updates in non-conjugate variational message passing.",
            "Towards ultrahigh dimensional feature selection for big data.",
            "Adaptive sampling for large scale boosting.",
            "Manopt, a matlab toolbox for optimization on manifolds.",
            "Training highly multiclass classifiers.",
            "Locally adaptive factor processes for multivariate time series.",
            "Iteration complexity of feasible descent methods for convex optimization.",
            "High-dimensional covariance decomposition into sparse Markov and independence models.",
            "The No-U-turn sampler: adaptively setting path lengths in Hamiltonian Monte Carlo.",
            "Confidence intervals for random forests: the jackknife and the infinitesimal jackknife.",
            "Surrogate regret bounds for bipartite ranking via strongly proper losses.",
            "Adaptive minimax regression estimation over sparse lq-hulls.",
            "Graph estimation from multi-attribute data.",
            "Hitting and commute times in large random neighborhood graphs.",
            "Bayesian inference with posterior regularization and applications to infinite latent SVMs.",
            "Expectation propagation for neural networks with sparsity-promoting priors.",
            "Pattern alternating maximization algorithm for missing data in high-dimensional problems.",
            "Dropout: a simple way to prevent neural networks from overfitting.",
            "Sparse factor analysis for learning and content analytics.",
            "Causal discovery with continuous additive noise models.",
            "PyStruct: learning structured prediction in python.",
            "The student-t mixture as a natural image patch prior with application to image compression.",
            "Parallel MCMC with generalized elliptical slice sampling.",
            "Classifier cascades and trees for minimizing feature evaluation cost.",
            "Particle gibbs with ancestor sampling.",
            "Ramp loss linear programming support vector machine.",
            "Clustering partially observed graphs via convex optimization.",
            "A tensor approach to learning mixed membership community models.",
            "Cover tree Bayesian reinforcement learning.",
            "Efficient state-space inference of periodic latent force models.",
            "Spectral learning of latent-variable PCFGs: algorithms and sample complexity.",
            "On multilabel classification and ranking with bandit feedback.",
            "Beyond the regret minimization barrier: optimal algorithms for stochastic strongly-convex optimization.",
            "One-shot-learning gesture recognition using HOG-HOF features.",
            "Contextual bandits with similarity information.",
            "Boosting algorithms for detector cascade learning.",
            "Efficient and accurate methods for updating generalized linear models with multiple feature additions.",
            "Bayesian estimation of causal direction in acyclic structural equation models with individual-specific confounder variables and non-Gaussian distributions.",
            "A truncated EM approach for spike-and-slab sparse coding.",
            "Efficient occlusive components analysis.",
            "Optimality of graphlet screening in high dimensional variable selection.",
            "Tensor decompositions for learning latent variable models.",
            "Bayesian entropy estimation for countable discrete distributions.",
            "Confidence intervals and hypothesis testing for high-dimensional regression.",
            "QUIC: quadratic approximation for sparse inverse covariance estimation.",
            "Multimodal learning with deep Boltzmann machines.",
            "Optimal data collection for informative rankings expose well-connected graphs.",
            "Bayesian co-boosting for multi-modal gesture recognition.",
            "Effective string processing and matching for author disambiguation.",
            "High-dimensional learning of linear causal networks via inverse covariance estimation.",
            "Recursive teaching dimension, VC-dimension and sample compression.",
            "Do we need hundreds of classifiers to solve real world classification problems?",
            "ooDACE toolbox: a flexible object-oriented Kriging implementation.",
            "Robust online gesture recognition with crowdsourced annotations.",
            "Accelerating t-SNE using tree-based algorithms.",
            "Set-valued approachability and online learning with partial monitoring.",
            "Learning graphical models with hubs.",
            "Inconsistency of Pitman-Yor process mixtures for the number of components.",
            "Active contextual policy search.",
            "Matrix completion with the trace norm: learning, bounding, and transducing.",
            "Statistical analysis of metric graph reconstruction.",
            "Alternating linearization for structured regularization problems.",
            "The gesture recognition toolkit.",
            "Convolutional nets and watershed cuts for real-time semantic Labeling of RGBD videos.",
            "On the bayes-optimality of F-measure maximizers.",
            "SPMF: a Java open-source pattern mining library.",
            "Efficient learning and planning with compressed predictive states.",
            "Revisiting Stein's paradox: multi-task averaging.",
            "Multi-objective reinforcement learning using sets of pareto dominating policies.",
            "Seeded graph matching for correlated Erdös-Rényi graphs.",
            "Asymptotic accuracy of distribution-based estimation of latent variables.",
            "What regularized auto-encoders learn from the data-generating distribution.",
            "Revisiting Bayesian blind deconvolution.",
            "New results for random walk learning.",
            "Transfer learning decision forests for gesture recognition.",
            "Semi-supervised eigenvectors for large-scale locally-biased learning.",
            "BayesOpt: a Bayesian optimization library for nonlinear optimization, experimental design and bandits.",
            "Order-independent constraint-based causal structure learning.",
            "Effective sampling and learning for mallows models with pairwise-preference data.",
            "Robust hierarchical clustering.",
            "Parallelizing exploration-exploitation tradeoffs in Gaussian process bandit optimization.",
            "Active lmitation learning: formal and practical reductions to I.I.D. learning."
        ]
    },
    {
        "name": "JMLR",
        "year": "2013",
        "info": "Volume 14: 2013",
        "count": 121,
        "papers": [
            "Global analytic solution of fully-observed variational Bayesian matrix factorization.",
            "Ranking forests.",
            "Nested expectation propagation for Gaussian process classification.",
            "Pairwise likelihood ratios for estimation of non-Gaussian structural equation models.",
            "Universal consistency of localized versions of regularized kernel methods.",
            "Lower bounds and selectivity of weak-consistent policies in stochastic multi-armed bandit problem.",
            "MAGIC summoning: towards automatic suggesting and testing of gestures with low probability of false positives during use.",
            "Sparse single-index model.",
            "Derivative estimation with local polynomial fitting.",
            "Using symmetry and evolutionary search to minimize sorting networks.",
            "A framework for evaluating approximation methods for Gaussian process regression.",
            "Risk bounds of learning processes for Lévy processes.",
            "Learning theory approach to minimum error entropy criterion.",
            "Ranked bandits in metric spaces: learning diverse rankings over large document collections.",
            "A theory of multiclass boosting.",
            "Algorithms for discovery of multiple Markov boundaries.",
            "Stochastic dual coordinate ascent methods for regularized loss.",
            "Optimal discovery with probabilistic expert advice: finite time analysis and macroscopic optimality.",
            "A C++ template-based reinforcement learning library: fitting the code to the mathematics.",
            "CODA: high dimensional copula discriminant analysis.",
            "Bayesian nonparametric hidden semi-Markov models.",
            "Differential privacy for functions and functional data.",
            "Sparsity regret bounds for individual sequences in online linear regression.",
            "Semi-supervised learning using greedy max-cut.",
            "MLPACK: a scalable C++ machine learning library.",
            "Greedy sparsity-constrained optimization.",
            "Quasi-Newton methods: a new direction.",
            "A widely applicable Bayesian information criterion.",
            "Truncated power method for sparse eigenvalue problems.",
            "Query induction with schema-guided pruning strategies.",
            "Bayesian Canonical correlation analysis.",
            "Variational inference in nonconjugate models.",
            "Beyond Fano's inequality: bounds on the optimal F-score, BER, and cost-sensitive risk and their implications.",
            "Sparse activity and sparse connectivity in supervised learning.",
            "Stress functions for nonlinear dimension reduction, proximity analysis, and graph drawing.",
            "GPstuff: Bayesian modeling with Gaussian processes.",
            "Performance bounds for λ policy iteration and application to the game of Tetris.",
            "Manifold regularization and semi-supervised learning: some theoretical analyses.",
            "Random spanning trees and the prediction ofweighted graphs.",
            "Regularization-free principal curve estimation.",
            "Stochastic variational inference.",
            "Multicategory large-margin unified machines.",
            "Finding optimal Bayesian networks using precedence constraints.",
            "JKernelMachines: a simple framework for kernel machine.",
            "Asymptotic results on adaptive false discovery rate controlling procedures based on kernel estimators.",
            "Conjugate relation between loss functions and uncertainty sets in classification problems.",
            "A risk comparison of ordinary least squares vs ridge regression.",
            "On the learnability of shuffle ideals.",
            "Fast generalized subset scan for anomalous pattern detection.",
            "Sub-local constraint-based learning of Bayesian networks using a joint dependence criterion.",
            "Dimension independent similarity computation.",
            "Dynamic affine-invariant shape-appearance handshape features and classification in sign language videos.",
            "Nonparametric sparsity and regularization.",
            "Similarity-based clustering by left-stochastic matrix factorization.",
            "On the convergence of maximum variance unfolding.",
            "Variable selection in high-dimension with random designs and orthogonal matching pursuit.",
            "Random walk kernels and learning curves for Gaussian process regression on random graphs.",
            "Distributions of angles in random packing on spheres.",
            "Cluster analysis: unsupervised learning via supervised learning with a non-convex penalty.",
            "Generalized spike-and-slab priors for Bayesian group feature selection using expectation propagation.",
            "Alleviating naive Bayes attribute independence assumption by attribute weighting.",
            "Machine learning with operational costs.",
            "Approximating the permanent with fractional belief propagation.",
            "Construction of approximation spaces for reinforcement learning.",
            "Distribution-dependent sample complexity of large margin learning.",
            "Convex and scalable weakly labeled SVMs.",
            "Language-motivated approaches to action recognition.",
            "Segregating event streams and noise with a Markov renewal process model.",
            "Gaussian Kullback-Leibler approximate inference.",
            "Message-passing algorithms for quadratic minimization.",
            "The rate of convergence of AdaBoost.",
            "Orange: data mining toolbox in python.",
            "Tapkee: an efficient dimension reduction library.",
            "On the mutual nearest neighbors estimate in regression.",
            "Distance preserving embeddings for general n-dimensional manifolds.",
            "Supervised feature selection in graphs with path coding penalties and network flows.",
            "Greedy feature selection for subspace clustering.",
            "Learning bilinear model for matching queries and documents.",
            "One-shot learning gesture recognition from RGB-D data using bag of features.",
            "Efficient active learning of halfspaces: an aggressive approach.",
            "Keep it simple and sparse: real-time action recognition.",
            "Maximum volume clustering: a new discriminative clustering approach.",
            "Sparse/robust estimation and Kalman smoothing with nonsmooth log-concave densities: modeling, computation, and theory.",
            "Improving CUR matrix decomposition and the Nyström approximation via adaptive sampling.",
            "Training energy-based models for time-series imputation.",
            "Belief propagation for continuous state spaces: stochastic message-passing with quantitative guarantees.",
            "A binary-classification-based metric between time-series distributions and its use in statistical and learning problems.",
            "Perturbative corrections for approximate inference in Gaussian latent variable models.",
            "The CAM software for nonnegative blind source separation in R-Java.",
            "A near-optimal algorithm for differentially-private principal components.",
            "Parallel vector field embedding.",
            "Multi-stage multi-task feature learning.",
            "A plug-in approach to neyman-pearson classification.",
            "Experiment selection for causal discovery.",
            "Stationary-sparse causality network learning.",
            "Algorithms and hardness results for parallel large margin learning.",
            "Large-scale SVD and manifold learning.",
            "QuantMiner for mining quantitative association rules.",
            "Divvy: fast and intuitive exploratory data analysis.",
            "Variational algorithms for marginal MAP.",
            "GURLS: a least squares library for supervised learning.",
            "Counterfactual reasoning and learning systems: the example of computational advertising.",
            "Multivariate convex regression with adaptive partitioning.",
            "Fast MCMC sampling for Markov jump processes and extensions.",
            "Communication-efficient algorithms for statistical optimization.",
            "PC algorithm for nonparanormal graphical models.",
            "Sparse matrix inversion with scaled Lasso.",
            "Consistent selection of tuning parameters via variable selection stability.",
            "Learning theory analysis for association rules and sequential event prediction.",
            "Comment on \"Robustness and regularization of support vector machines\" by H. Xu et al. (Journal of machine learning research, volume 10, pp 1485-1510, 2009).",
            "Lovász ϑ function, SVMs and finding dense subgraphs.",
            "Learning trees from strings: a strong learning algorithm for some context-free grammars.",
            "Classifying with confidence from incomplete information.",
            "Classifier selection using the predicate depth.",
            "A max-norm constrained minimization approach to 1-bit matrix completion.",
            "Efficient program synthesis using constraint satisfaction in inductive logic programming.",
            "How to solve classification and regression problems on high-dimensional data with a supervised extension of slow feature analysis.",
            "Joint harmonic functions and their supervised connections.",
            "Kernel Bayes' rule: Bayesian inference with positive definite kernels.",
            "Optimally fuzzy temporal memory.",
            "BudgetedSVM: a toolbox for scalable SVM approximations."
        ]
    },
    {
        "name": "JMLR",
        "year": "2012",
        "info": "Volume 13: 2012",
        "count": 119,
        "papers": [
            "Distance Metric Learning with Eigenvalue Optimization.",
            "Conditional Likelihood Maximisation: A Unifying Framework for Information Theoretic Feature Selection.",
            "Plug-in Approach to Active Learning.",
            "Refinement of Operator-valued Reproducing Kernels.",
            "An Active Learning Algorithm for Ranking from Pairwise Preferences with an Almost Optimal Query Complexity.",
            "Optimal Distributed Online Prediction Using Mini-Batches.",
            "Active Clustering of Biological Sequences.",
            "Multi Kernel Learning with Online-Batch Optimization.",
            "Active Learning via Perfect Selective Classification.",
            "Random Search for Hyper-Parameter Optimization.",
            "Noise-Contrastive Estimation of Unnormalized Statistical Models, with Applications to Natural Image Statistics.",
            "Bounding the Probability of Error for High Precision Optical Character Recognition.",
            "Minimax-Optimal Rates For Sparse Additive Models Over Kernel Classes Via Convex Programming.",
            "Online Learning in the Embedded Manifold of Low-rank Matrices.",
            "Multi-Assignment Clustering for Boolean Data.",
            "Eliminating Spammers and Ranking Annotators for Crowdsourced Labeling Tasks.",
            "Metric and Kernel Learning Using a Linear Transformation.",
            "MULTIBOOST: A Multi-purpose Boosting Package.",
            "ML-Flex: A Flexible Toolbox for Performing Classification Analyses In Parallel.",
            "A Primal-Dual Convergence Analysis of Boosting.",
            "Non-Sparse Multiple Kernel Fisher Discriminant Analysis.",
            "Learning Algorithms for the Classification Restricted Boltzmann Machine.",
            "Structured Sparsity and Generalization.",
            "A Case Study on Meta-Generalising: A Gaussian Processes Approach.",
            "A Kernel Two-Sample Test.",
            "GPLP: A Local and Parallel Computation Toolbox for Gaussian Process Regression.",
            "Exact Covariance Thresholding into Connected Components for Large-Scale Graphical Lasso.",
            "Algorithms for Learning Kernels Based on Centered Alignment.",
            "Causal Bounds and Observable Constraints for Non-deterministic Models.",
            "NIMFA: A Python Library for Nonnegative Matrix Factorization.",
            "Algebraic Geometric Comparison of Probability Distributions.",
            "Stability of density-based clustering.",
            "Mal-ID: Automatic Malware Detection Using Common Segment Analysis and Meta-Features.",
            "Sampling Methods for the Nyström Method.",
            "Positive Semidefinite Metric Learning Using Boosting-like Algorithms.",
            "Consistent Model Selection Criteria on High Dimensions.",
            "The huge Package for High-dimensional Undirected Graph Estimation in R.",
            "Analysis of a Random Forests Model.",
            "Towards Integrative Causal Analysis of Heterogeneous Data Sets and Studies.",
            "Hope and Fear for Discriminative Training of Statistical Translation Models.",
            "A Multi-Stage Framework for Dantzig Selector and LASSO.",
            "A Geometric Approach to Sample Compression.",
            "Minimax Manifold Estimation.",
            "Query Strategies for Evading Convex-Inducing Classifiers.",
            "Transfer in Reinforcement Learning via Shared Features.",
            "On Ranking and Generalization Bounds.",
            "Feature Selection via Dependence Maximization.",
            "Structured Sparsity via Alternating Direction Methods.",
            "Activized Learning: Transforming Passive to Active with Improved Label Complexity.",
            "A Model of the Perception of Facial Expressions of Emotion by Humans: Research Overview and Perspectives.",
            "A Unifying Probabilistic Perspective for Spectral Dimensionality Reduction: Insights and New Models.",
            "Mixability is Bayes Risk Curvature Relative to Log Loss.",
            "Restricted Strong Convexity and Weighted Matrix Completion: Optimal Bounds with Noise.",
            "glm-ie: Generalised Linear Models Inference & Estimation Toolbox.",
            "Manifold Identification in Dual Averaging for Regularized Stochastic Online Learning.",
            "Variational Multinomial Logit Gaussian Process.",
            "Entropy Search for Information-Efficient Global Optimization.",
            "Estimation and Selection via Absolute Penalized Convex Minimization And Its Multistage Adaptive Applications.",
            "Regularization Techniques for Learning with Matrices.",
            "Confidence-Weighted Linear Classification for Text Categorization.",
            "Integrating a Partial Model into Model Free Reinforcement Learning.",
            "Jstacs: A Java Framework for Statistical Analysis and Classification of Biological Sequences.",
            "Variable Selection in High-dimensional Varying-coefficient Models with Global Optimality.",
            "An Improved GLMNET for L1-regularized Logistic Regression.",
            "EP-GIG Priors and Applications in Bayesian Sparse Learning.",
            "Pattern for Python.",
            "Optimistic Bayesian Sampling in Contextual-Bandit Problems.",
            "A Comparison of the Lasso and Marginal Regression.",
            "On the necessity of irrelevant variables.",
            "DEAP: evolutionary algorithms made easy.",
            "An introduction to artificial prediction markets for classification.",
            "Sign language recognition using sub-units.",
            "A topic modeling toolbox using belief propagation.",
            "MedLDA: maximum margin supervised topic models.",
            "Pairwise support vector machines and their application to large scale problems.",
            "High-dimensional Gaussian graphical model selection: walk summability and local separation criterion.",
            "A local spectral method for graphs: with applications to improving graph partitions and exploring data graphs locally.",
            "Multi-target regression with rule ensembles.",
            "Characterization and greedy learning of interventional Markov equivalence classes of directed acyclic graphs.",
            "On the convergence rate of lp-norm multiple kernel learning.",
            "Trading regret for efficiency: online convex optimization with long term constraints.",
            "Robust kernel density estimation.",
            "Nonparametric guidance of autoencoder representations using label information.",
            "Finding recurrent patterns from continuous sign language sentences for automated extraction of signs.",
            "Static prediction games for adversarial learning problems.",
            "Selective sampling and active learning from single and multiple teachers.",
            "PREA: personalized recommendation algorithms toolkit.",
            "Coherence functions with applications in large-margin classification methods.",
            "Linear regression with random projections.",
            "Multi-task regression using minimal penalties.",
            "A unified view of performance metrics: translating threshold choice into expected classification loss.",
            "Local and global scaling reduce hubs in space.",
            "Online submodular minimization.",
            "Efficient methods for robust classification under uncertainty in kernel matrices.",
            "Facilitating score and causal inference trees for large observational studies.",
            "Oger: modular learning architectures for large-scale sequential processing.",
            "Multi-instance learning with any hypothesis class.",
            "Finite-sample analysis of least-squares policy iteration.",
            "Discriminative hierarchical part-based models for human parsing and action recognition.",
            "Breaking the curse of kernelization: budgeted stochastic gradient descent for large-scale SVM training.",
            "Bayesian mixed-effects inference on classification performance in hierarchical data sets.",
            "Quantum set intersection and its application to associative memory.",
            "Dynamic policy programming.",
            "Sally: a tool for embedding strings in vector spaces.",
            "Linear fitted-Q iteration with multiple reward functions.",
            "Human gesture recognition on product manifolds.",
            "Large-scale linear support vector regression.",
            "Sparse and unique nonnegative matrix factorization through data preprocessing.",
            "Learning linear cyclic causal models with latent variables.",
            "Iterative reweighted algorithms for matrix rank minimization.",
            "Fast approximation of matrix coherence and statistical leverage.",
            "PAC-bayes bounds with data dependent priors.",
            "DARWIN: a framework for machine learning and computer vision research and development.",
            "Regularized bundle methods for convex and non-convex risks.",
            "Learning symbolic representations of hybrid dynamical systems.",
            "SVDFeature: a toolkit for feature-based collaborative filtering.",
            "Smoothing multivariate performance measures.",
            "Security analysis of online centroid anomaly detection.",
            "Exploration in relational domains for model-based reinforcement learning."
        ]
    },
    {
        "name": "JMLR",
        "year": "2011",
        "info": "Volume 12: 2011",
        "count": 105,
        "papers": [
            "Exploitation of Machine Learning Techniques in Modelling Phrase Movements for Machine Translation.",
            "Improved Moves for Truncated Convex Models.",
            "CARP: Software for Fishing Out Good Clustering Algorithms.",
            "Multitask Sparsity via Maximum Entropy Discrimination.",
            "Bayesian Generalized Kernel Mixed Models.",
            "Training SVMs Without Offset.",
            "Logistic Stick-Breaking Process.",
            "Online Learning in Case of Unbounded Losses Using Follow the Perturbed Leader Algorithm.",
            "A Bayesian Approximation Method for Online Ranking.",
            "Cumulative Distribution Networks and the Derivative-sum-product Algorithm: Models and Inference for Cumulative Distribution Functions on Graphs.",
            "Models of Cooperative Teaching and Learning.",
            "Operator Norm Convergence of Spectral Clustering on Level Sets.",
            "Approximate Marginals in Latent Gaussian Models.",
            "Posterior Sparsity in Unsupervised Dependency Parsing.",
            "Learning Multi-modal Similarity.",
            "Minimum Description Length Penalization for Group and Multi-Task Sparse Learning.",
            "Variable Sparsity Kernel Learning.",
            "Regression on Fixed-Rank Positive Semidefinite Matrices: A Riemannian Approach.",
            "Parameter Screening and Optimisation for ILP using Designed Experiments.",
            "Efficient Structure Learning of Bayesian Networks using Constraints.",
            "Inverse Reinforcement Learning in Partially Observable Environments.",
            "Information, Divergence and Risk for Binary Experiments.",
            "Learning Transformation Models for Ranking and Survival Analysis.",
            "Sparse Linear Identifiable Multivariate Modeling.",
            "Forest Density Estimation.",
            "lp-Norm Multiple Kernel Learning.",
            "Unsupervised Similarity-Based Risk Stratification for Cardiovascular Events Using Long-Term Time-Series Data.",
            "Two Distributed-State Models For Generating High-Dimensional Time Series.",
            "Differentially Private Empirical Risk Minimization.",
            "Anechoic Blind Source Separation Using Wigner Marginals.",
            "Laplacian Support Vector Machines Trained in the Primal.",
            "The Indian Buffet Process: An Introduction and Review.",
            "DirectLiNGAM: A Direct Method for Learning a Linear Non-Gaussian Structural Equation Model.",
            "Locally Defined Principal Curves and Surfaces.",
            "Better Algorithms for Benign Bandits.",
            "A Family of Simple Non-Parametric Kernel Learning Algorithms.",
            "Faster Algorithms for Max-Product Message-Passing.",
            "Clustering Algorithms for Chains.",
            "Introduction to the Special Topic on Grammar Induction, Representation of Language and Language Learning.",
            "Learning a Robust Relevance Model for Search Using Kernel Methods.",
            "Computationally Efficient Convolved Multiple Output Gaussian Processes.",
            "Learning from Partial Labels.",
            "Super-Linear Convergence of Dual Augmented Lagrangian Algorithm for Sparsity Regularized Estimation.",
            "Double Updating Online Learning.",
            "Learning High-Dimensional Markov Forest Distributions: Analysis of Error Rates.",
            "X-Armed Bandits.",
            "Domain Decomposition Approach for Fast Gaussian Process Regression of Large Spatial Data Sets.",
            "A Bayesian Approach for Learning and Planning in Partially Observable Markov Decision Processes.",
            "Learning Latent Tree Graphical Models.",
            "Hyper-Sparse Optimal Aggregation.",
            "A Refined Margin Analysis for Boosting Algorithms via Equilibrium Margin.",
            "Stochastic Methods for l1-regularized Loss Minimization.",
            "Internal Regret with Partial Monitoring: Calibration-Based Optimal Algorithms.",
            "Dirichlet Process Mixtures of Generalized Linear Models.",
            "Kernel Regression in the Presence of Correlated Errors.",
            "Generalized TD Learning.",
            "The arules R-Package Ecosystem: Analyzing Interesting Patterns from Large Transaction Data Sets.",
            "A Cure for Variance Inflation in High Dimensional Kernel Principal Component Analysis.",
            "Exploiting Best-Match Equations for Efficient Reinforcement Learning.",
            "Information Rates of Nonparametric Gaussian Process Methods.",
            "Adaptive Subgradient Methods for Online Learning and Stochastic Optimization.",
            "On the Relation between Realizable and Nonrealizable Cases of the Sequence Prediction Problem.",
            "Discriminative Learning of Bayesian Networks via Factorized Conditional Log-Likelihood.",
            "Multiple Kernel Learning Algorithms.",
            "Smoothness, Disagreement Coefficient, and the Label Complexity of Agnostic Active Learning.",
            "MSVMpack: A Multi-Class Support Vector Machine Package.",
            "Proximal Methods for Hierarchical Sparse Coding.",
            "Producing Power-Law Distributions and Damping Word Frequencies with Two-Stage Language Models.",
            "Waffles: A Machine Learning Toolkit.",
            "Universality, Characteristic Kernels and RKHS Embedding of Measures.",
            "MULAN: A Java Library for Multi-Label Learning.",
            "Union Support Recovery in Multi-task Learning.",
            "Parallel Algorithm for Learning Optimal Bayesian Network Structure.",
            "Distance Dependent Chinese Restaurant Processes.",
            "LPmade: Link Prediction Made Easy.",
            "Natural Language Processing (Almost) from Scratch.",
            "Weisfeiler-Lehman Graph Kernels.",
            "Kernel Analysis of Deep Networks.",
            "Theoretical Analysis of Bayesian Matrix Factorization.",
            "Bayesian Co-Training.",
            "Convex and Network Flow Optimization for Structured Sparsity.",
            "Large Margin Hierarchical Classification with Mutually Exclusive Class Membership.",
            "Non-Parametric Estimation of Topic Hierarchies from Texts with Hierarchical Dirichlet Processes.",
            "Structured Variable Selection with Sparsity-Inducing Norms.",
            "Scikit-learn: Machine Learning in Python.",
            "Neyman-Pearson Classification, Convexity and Stochastic Constraints.",
            "Efficient Learning with Partially Observed Attributes.",
            "Convergence Rates of Efficient Global Optimization Algorithms.",
            "On Equivalence Relationships Between Classification and Ranking Algorithms.",
            "Hierarchical Knowledge Gradient for Sequential Sampling.",
            "High-dimensional Covariance Estimation Based On Gaussian Graphical Models.",
            "Robust Approximate Bilinear Programming for Value Function Approximation.",
            "The Stationary Subspace Analysis Toolbox.",
            "In All Likelihood, Deep Belief Is Not Enough.",
            "Efficient and Effective Visual Codebook Generation Using Additive Kernels.",
            "Unsupervised Supervised Learning II: Margin-Based Classification Without Labels.",
            "Adaptive Exact Inference in Graphical Models.",
            "Group Lasso Estimation of High-dimensional Covariance Matrices.",
            "Robust Gaussian Process Regression with a Student-t Likelihood.",
            "The Sample Complexity of Dictionary Learning.",
            "An Asymptotic Behaviour of the Marginal Likelihood for General Markov Models.",
            "Semi-Supervised Learning with Measure Propagation.",
            "Learning with Structured Sparsity.",
            "A Simpler Approach to Matrix Completion.",
            "Convergence of Distributed Asynchronous Learning Vector Quantization Algorithms."
        ]
    },
    {
        "name": "JMLR",
        "year": "2010",
        "info": "Volume 11: 2010",
        "count": 118,
        "papers": [
            "An Efficient Explanation of Individual Classifications using Game Theory.",
            "Online Learning for Matrix Factorization and Sparse Coding.",
            "Model Selection: Beyond the Bayesian/Frequentist Divide.",
            "On-Line Sequential Bin Packing.",
            "Classification Methods with Reject Option Based on Convex Risk Minimization.",
            "An Investigation of Missing Data Methods for Classification Trees Applied to Binary Response Data.",
            "Local Causal and Markov Blanket Induction for Causal Discovery and Feature Selection for Classification Part I: Algorithms and Empirical Evaluation.",
            "Local Causal and Markov Blanket Induction for Causal Discovery and Feature Selection for Classification Part II: Analysis and Extensions.",
            "Optimal Search on Clustered Structural Constraint for Learning Bayesian Network Structure.",
            "Bundle Methods for Regularized Risk Minimization.",
            "A Convergent Online Single Time Scale Actor Critic Algorithm.",
            "Dimensionality Estimation, Manifold Learning and Function Approximation using Tensor Voting.",
            "Information Retrieval Perspective to Nonlinear Dimensionality Reduction for Data Visualization.",
            "Classification Using Geometric Level Sets.",
            "Generalized Power Method for Sparse Principal Component Analysis.",
            "Approximate Tree Kernels.",
            "On Finding Predictors for Arbitrary Families of Processes.",
            "A Rotation Test to Verify Latent Structure.",
            "Why Does Unsupervised Pre-training Help Deep Learning?",
            "Error-Correcting Ouput Codes Library.",
            "Second-Order Bilinear Discriminant Analysis.",
            "On the Rate of Convergence of the Bagged Nearest Neighbor Estimate.",
            "A Fast Hybrid Algorithm for Large-Scale l1-Regularized Logistic Regression.",
            "PyBrain.",
            "Maximum Relative Margin and Data-Dependent Regularization.",
            "Stability Bounds for Stationary phi-mixing and beta-mixing Processes.",
            "Iterative Scaling and Coordinate Descent Methods for Maximum Entropy Models.",
            "A Streaming Parallel Decision Tree Algorithm.",
            "Image Denoising with Kernels Based on Natural Image Relations.",
            "On Learning with Integral Operators.",
            "On Spectral Learning.",
            "Generalized Expectation Criteria for Semi-Supervised Learning with Weakly Labeled Data.",
            "Kronecker Graphs: An Approach to Modeling Networks.",
            "Message-passing for Graph-structured Linear Programs: Proximal Methods and Rounding Schemes.",
            "Analysis of Multi-stage Convex Relaxation for Sparse Regularization.",
            "Large Scale Online Learning of Image Similarity Through Ranking.",
            "Continuous Time Bayesian Network Reasoning and Learning Engine.",
            "SFO: A Toolbox for Submodular Function Optimization.",
            "A Quasi-Newton Approach to Nonsmooth Convex Optimization Problems in Machine Learning.",
            "Graph Kernels.",
            "Stochastic Complexity and Generalization Error of a Restricted Boltzmann Machine in Bayesian Estimation.",
            "Approximate Inference on Planar Graphs using Loop Calculus and Belief Propagation.",
            "Learning From Crowds.",
            "Unsupervised Supervised Learning I: Estimating Classification and Regression Errors without Labels.",
            "Learning Translation Invariant Kernels for Classification.",
            "Consistent Nonparametric Tests of Independence.",
            "Characterization, Stability and Convergence of Hierarchical Clustering Methods.",
            "Training and Testing Low-degree Polynomial Data Mappings via Linear SVM.",
            "Quadratic Programming Feature Selection.",
            "Hilbert Space Embeddings and Metrics on Probability Measures.",
            "Near-optimal Regret Bounds for Reinforcement Learning.",
            "MOA: Massive Online Analysis.",
            "On the Foundations of Noise-free Selective Classification.",
            "Introduction to Causal Inference.",
            "Consensus-Based Distributed Support Vector Machines.",
            "Estimation of a Structural Vector Autoregression Model Using Non-Gaussianity.",
            "FastInf: An Efficient Approximate Inference Library.",
            "Evolving Static Representations for Task Transfer.",
            "Bayesian Learning in Sparse Graphical Factor Models via Variational Mean-Field Annealing.",
            "The SHOGUN Machine Learning Toolbox.",
            "How to Explain Individual Classification Decisions.",
            "Permutation Tests for Studying Classifier Performance.",
            "Sparse Spectrum Gaussian Process Regression.",
            "Fast and Scalable Local Kernel Machines.",
            "Chromatic PAC-Bayes Bounds for Non-IID Data: Applications to Ranking and Stationary β-Mixing Processes.",
            "Practical Approaches to Principal Component Analysis in the Presence of Missing Values.",
            "Posterior Regularization for Structured Latent Variable Models.",
            "A Surrogate Modeling and Adaptive Sampling Toolbox for Computer Based Design.",
            "Matrix Completion from Noisy Entries.",
            "On Over-fitting in Model Selection and Subsequent Selection Bias in Performance Evaluation.",
            "Model-based Boosting 2.0.",
            "Importance Sampling for Continuous Time Bayesian Networks.",
            "Matched Gene Selection and Committee Classifier for Molecular Classification of Heterogeneous Diseases.",
            "libDAI: A Free and Open Source C++ Library for Discrete Approximate Inference in Graphical Models.",
            "Learning Gradients: Predictive Models that Infer Geometry and Statistical Dependence.",
            "Regularized Discriminant Analysis, Ridge Regression and Beyond.",
            "Erratum: SGDQN is Less Careful than Expected.",
            "Restricted Eigenvalue Properties for Correlated Gaussian Designs.",
            "High Dimensional Inverse Covariance Matrix Estimation via Linear Programming.",
            "Spectral Regularization Algorithms for Learning Large Incomplete Matrices.",
            "Efficient Heuristics for Discriminative Structure Learning of Bayesian Network Classifiers.",
            "High-dimensional Variable Selection with Sparse Random Projections: Measurement Sparsity and Statistical Efficiency.",
            "Composite Binary Losses.",
            "Sparse Semi-supervised Learning Using Conjugate Functions.",
            "Rademacher Complexities and Bounding the Excess Risk in Active Learning.",
            "Hubs in Space: Popular Nearest Neighbors in High-Dimensional Data.",
            "WEKA - Experiences with a Java Open-Source Project.",
            "Dual Averaging Methods for Regularized Stochastic Learning and Online Optimization.",
            "Stochastic Composite Likelihood.",
            "Learnability, Stability and Uniform Convergence.",
            "Topology Selection in Graphical Models of Autoregressive Processes.",
            "Using Contextual Representations to Efficiently Learn Context-Free Languages.",
            "Mean Field Variational Approximation for Continuous-Time Bayesian Networks.",
            "Regret Bounds and Minimax Policies under Partial Monitoring.",
            "Information Theoretic Measures for Clusterings Comparison: Variants, Properties, Normalization and Correction for Chance.",
            "Expectation Truncation and the Benefits of Preselection In Training Generative Models.",
            "Linear Algorithms for Online Multitask Classification.",
            "Tree Decomposition for Large-Scale SVM Problems.",
            "Semi-Supervised Novelty Detection.",
            "Gaussian Processes for Machine Learning (GPML) Toolbox.",
            "Covariance in Unsupervised Learning of Probabilistic Grammars.",
            "Inducing Tree-Substitution Grammars.",
            "Collective Inference for Extraction MRFs Coupled with Symmetric Clique Potentials.",
            "A Generalized Path Integral Control Approach to Reinforcement Learning.",
            "A Comparison of Optimization Methods and Software for Large-scale L1-regularized Linear Classification.",
            "Approximate Riemannian Conjugate Gradient Learning for Fixed-Form Variational Bayes.",
            "Classification with Incomplete Data Using Dirichlet Process Priors.",
            "Maximum Likelihood in Cost-Sensitive Learning: Model Specification, Approximations, and Upper Bounds.",
            "Learning Instance-Specific Predictive Models.",
            "Stacked Denoising Autoencoders: Learning Useful Representations in a Deep Network with a Local Denoising Criterion.",
            "Lp-Nested Symmetric Distributions.",
            "Efficient Algorithms for Conditional Independence Inference.",
            "An Exponential Model for Infinite Rankings.",
            "Rate Minimaxity of the Lasso and Dantzig Selector for the lq Loss in lr Balls.",
            "Incremental Sigmoid Belief Networks for Grammar Learning.",
            "Asymptotic Equivalence of Bayes Cross Validation and Widely Applicable Information Criterion in Singular Learning Theory.",
            "PAC-Bayesian Analysis of Co-clustering and Beyond.",
            "Learning Non-Stationary Dynamic Bayesian Networks."
        ]
    },
    {
        "name": "JMLR",
        "year": "2009",
        "info": "Volume 10: 2009",
        "count": 100,
        "papers": [
            "Exploring Strategies for Training Deep Neural Networks.",
            "Markov Properties for Linear Causal Models with Correlated Errors.",
            "An Analysis of Convex Relaxations for MAP Estimation of Discrete MRFs.",
            "Refinement of Reproducing Kernels.",
            "Subgroup Analysis via Recursive Partitioning.",
            "Python Environment for Bayesian Learning: Inferring the Structure of Bayesian Networks from Knowledge and Data.",
            "On The Power of Membership Queries in Agnostic Learning.",
            "Using Local Dependencies within Batches to Improve Large Margin Classifiers.",
            "Distance Metric Learning for Large Margin Nearest Neighbor Classification.",
            "Data-driven Calibration of Penalties for Least-Squares Regression.",
            "Analysis of Perceptron-Based Active Learning.",
            "Improving the Reliability of Causal Discovery from Small Data Sets Using Argumentation.",
            "Low-Rank Kernel Learning with Bregman Matrix Divergences.",
            "Supervised Descriptive Rule Discovery: A Unifying Survey of Contrast Set, Emerging Pattern and Subgroup Mining.",
            "Particle Swarm Model Selection.",
            "Generalization Bounds for Ranking Algorithms via Algorithmic Stability.",
            "Controlling the False Discovery Rate of the Association/Causality Structure Learned with the PC Algorithm.",
            "Identification of Recurrent Neural Networks by Bayesian Interrogation Techniques.",
            "On the Consistency of Feature Selection using Greedy Least Squares Regression.",
            "Online Learning with Sample Path Constraints.",
            "NEUROSVM: An Architecture to Reduce the Effect of the Choice of Kernel on the Performance of SVM.",
            "Scalable Collaborative Filtering Approaches for Large Recommender Systems.",
            "Nearest Neighbor Clustering: A Baseline Method for Consistent Clustering with Arbitrary Objective Functions.",
            "Properties of Monotonic Effects on Directed Acyclic Graphs.",
            "On Efficient Large Margin Semisupervised Learning: Method and Theory.",
            "Nieme: Large-Scale Energy-Based Models.",
            "Similarity-based Classification: Concepts and Algorithms.",
            "Sparse Online Learning via Truncated Gradient.",
            "A New Approach to Collaborative Filtering: Operator Estimation with Spectral Regularization.",
            "Consistency and Localizability.",
            "Stable and Efficient Gaussian Process Calculations.",
            "Estimation of Sparse Binary Pairwise Markov Networks using Pseudo-likelihoods.",
            "Polynomial-Delay Enumeration of Monotonic Graph Classes.",
            "Java-ML: A Machine Learning Library.",
            "Nonextensive Information Theoretic Kernels on Measures.",
            "On Uniform Deviations of General Empirical Risks with Unboundedness, Dependence, and High Dimensionality.",
            "Fourier Theoretic Probabilistic Inference over Permutations.",
            "An Algorithm for Reading Dependencies from the Minimal Undirected Independence Map of a Graphoid that Satisfies Weak Transitivity.",
            "Universal Kernel-Based Learning with Applications to Regular Languages.",
            "Multi-task Reinforcement Learning in Partially Observable Stochastic Environments.",
            "The Hidden Life of Latent Variables: Bayesian Learning with Mixed Graph Models.",
            "Incorporating Functional Knowledge in Neural Networks.",
            "Perturbation Corrections in Approximate Inference: Mixture Modelling Applications.",
            "Robust Process Discovery with Artificial Negative Events.",
            "Feature Selection with Ensembles, Artificial Variables, and Redundancy Elimination.",
            "A Parameter-Free Classification Method for Large Scale Learning.",
            "Model Monitor (M2): Evaluating, Comparing, and Monitoring Models.",
            "A Least-squares Approach to Direct Importance Estimation.",
            "Classification with Gaussians and Convex Loss.",
            "Entropy Inference and the James-Stein Estimator, with Application to Nonlinear Gene Association Networks.",
            "Robustness and Regularization of Support Vector Machines.",
            "Strong Limit Theorems for the Bayesian Scoring Criterion in Bayesian Networks.",
            "Bayesian Network Structure Learning by Recursive Autonomy Identification.",
            "Learning Linear Ranking Functions for Beam Search with Application to Planning.",
            "Marginal Likelihood Integrals for Mixtures of Independence Models.",
            "Transfer Learning for Reinforcement Learning Domains: A Survey.",
            "Application of Non Parametric Empirical Bayes Estimation to High Dimensional Classification.",
            "Learning Permutations with Exponential Weights.",
            "SGD-QN: Careful Quasi-Newton Stochastic Gradient Descent.",
            "Dlib-ml: A Machine Learning Toolkit.",
            "Settable Systems: An Extension of Pearl's Causal Model with Optimization, Equilibrium, and Learning.",
            "Distributed Algorithms for Topic Models.",
            "Nonlinear Models Using Dirichlet Process Mixtures.",
            "CarpeDiem: Optimizing the Viterbi Algorithm and Applications to Supervised Sequential Learning.",
            "Learning Acyclic Probabilistic Circuits Using Test Paths.",
            "Learning Approximate Sequential Patterns for Classification.",
            "Hybrid MPI/OpenMP Parallel Linear Support Vector Machine Training.",
            "Provably Efficient Learning with Typed Parametric Models.",
            "Fast Approximate kNN Graph Construction for High Dimensional Data via Recursive Lanczos Bisection.",
            "Ultrahigh Dimensional Feature Selection: Beyond The Linear Model.",
            "Evolutionary Model Type Selection for Global Surrogate Modeling.",
            "An Anticorrelation Kernel for Subsystem Training in Multiple Classifier Systems.",
            "Deterministic Error Analysis of Support Vector Regression and Related Regularized Kernel Methods.",
            "RL-Glue: Language-Independent Software for Reinforcement-Learning Experiments.",
            "Discriminative Learning Under Covariate Shift.",
            "Optimized Cutting Plane Algorithm for Large-Scale Risk Minimization.",
            "Margin-based Ranking and an Equivalence between AdaBoost and RankBoost.",
            "The P-Norm Push: A Simple Convex Ranking Algorithm that Concentrates at the Top of the List.",
            "Learning Nondeterministic Classifiers.",
            "The Nonparanormal: Semiparametric Estimation of High Dimensional Undirected Graphs.",
            "Computing Maximum Likelihood Estimates in Recursive Linear Models with Correlated Errors.",
            "Estimating Labels from Label Proportions.",
            "Exploiting Product Distributions to Identify Relevant Variables of Correlation Immune Functions.",
            "Reinforcement Learning in Finite MDPs: PAC Analysis.",
            "Prediction With Expert Advice For The Brier Game.",
            "Bi-Level Path Following for Cross Validated Solution of Kernel Quantile Regression.",
            "When Is There a Representer Theorem? Vector Versus Matrix Regularizers.",
            "Maximum Entropy Discrimination Markov Networks.",
            "Learning When Concepts Abound.",
            "Hash Kernels for Structured Data.",
            "DL-Learner: Learning Concepts in Description Logics.",
            "Bounded Kernel-Based Online Learning.",
            "Structure Spaces.",
            "Learning Halfspaces with Malicious Noise.",
            "Reproducing Kernel Banach Spaces for Machine Learning.",
            "Cautious Collective Classification.",
            "Adaptive False Discovery Rate Control under Independence and Dependence.",
            "Online Learning with Samples Drawn from Non-identical Distributions.",
            "Efficient Online and Batch Learning Using Forward Backward Splitting.",
            "A Survey of Accuracy Evaluation Metrics of Recommendation Tasks."
        ]
    },
    {
        "name": "JMLR",
        "year": "2008",
        "info": "Volume 9: 2008",
        "count": 66,
        "papers": [
            "Max-margin Classification of Data with Absent Features.",
            "Linear-Time Computation of Similarity Measures for Sequential Data.",
            "On the Suitable Domain for SVM Training in Image Coding.",
            "Discriminative Learning of Max-Sum Classifiers.",
            "Active Learning by Spherical Subdivision.",
            "Evidence Contrary to the Statistical View of Boosting.",
            "Optimization Techniques for Semi-Supervised Support Vector Machines.",
            "Near-Optimal Sensor Placements in Gaussian Processes: Theory, Efficient Algorithms and Empirical Studies.",
            "Support Vector Machinery for Infinite Ensemble Learning.",
            "Algorithms for Sparse Linear Classifiers in the Massive Data Setting.",
            "Generalization from Observed to Unobserved Features by Clustering.",
            "A Tutorial on Conformal Prediction.",
            "Theoretical Advantages of Lenient Learners: An Evolutionary Game Theoretic Perspective.",
            "A Recursive Method for Structural Learning of Directed Acyclic Graphs.",
            "Model Selection Through Sparse Maximum Likelihood Estimation for Multivariate Gaussian or Binary Data.",
            "Comments on the Complete Characterization of a Family of Solutions to a Generalized Fisher Criterion.",
            "Estimating the Confidence Interval for Prediction Errors of Support Vector Machine Classifiers.",
            "An Information Criterion for Variable Selection in Support Vector Machines.",
            "Closed Sets for Labeled Data.",
            "Learning Reliable Classifiers From Small or Incomplete Data Sets: The Naive Credal Classifier 2.",
            "A Library for Locally Weighted Projection Regression.",
            "Trust Region Newton Method for Logistic Regression.",
            "Graphical Models for Structured Classification, with an Application to Interpreting Images of Protein Subcellular Location Patterns.",
            "Learning Control Knowledge for Forward Search Planning.",
            "Multi-class Discriminant Kernel Learning via Convex Programming.",
            "Bayesian Inference and Optimal Design for the Sparse Linear Model.",
            "Finite-Time Bounds for Fitted Value Iteration.",
            "An Error Bound Based on a Worst Likely Assignment.",
            "Graphical Methods for Efficient Likelihood Inference in Gaussian Covariance Models.",
            "Bouligand Derivatives and Robustness of Support Vector Machines for Regression.",
            "Accelerated Neural Evolution through Cooperatively Coevolved Synapses.",
            "Search for Additive Nonlinear Time Series Causal Models.",
            "Shark.",
            "Hit Miss Networks with Applications to Instance Selection.",
            "Consistency of Trace Norm Minimization.",
            "Learning Similarity with Operator-valued Large-margin Classifiers.",
            "Ranking Categorical Features Using Generalization Properties.",
            "A Multiple Instance Learning Strategy for Combating Good Word Attacks on Spam Filters.",
            "Cross-Validation Optimization for Large Scale Structured Classification Kernel Methods.",
            "Consistency of the Group Lasso and Multiple Kernel Learning.",
            "Maximal Causes for Non-linear Component Extraction.",
            "Optimal Solutions for Sparse Principal Component Analysis.",
            "Using Markov Blankets for Causal Structure Learning.",
            "A Bahadur Representation of the Linear Support Vector Machine.",
            "Coordinate Descent Method for Large-scale L2-loss Linear Support Vector Machines.",
            "Online Learning of Complex Prediction Problems Using Simultaneous Projections.",
            "Causal Reasoning with Ancestral Graphs.",
            "Incremental Identification of Qualitative Models of Biological Systems using Inductive Logic Programming.",
            "Learning to Combine Motor Primitives Via Greedy Additive Regression.",
            "Aggregation of SVM Classifiers Using Sobolev Spaces.",
            "Dynamic Hierarchical Markov Random Fields for Integrated Web Data Extraction.",
            "Universal Multi-Task Kernels.",
            "A New Algorithm for Estimating the Effective Dimension-Reduction Subspace.",
            "Value Function Based Reinforcement Learning in Changing Markovian Environments.",
            "Regularization on Graphs with Function-adapted Diffusion Processes.",
            "Nearly Uniform Validation Improves Compression-Based Error Bounds.",
            "Learning from Multiple Sources.",
            "Exponentiated Gradient Algorithms for Conditional Random Fields and Max-Margin Markov Networks.",
            "Classification with a Reject Option using a Hinge Loss.",
            "Learning Balls of Strings from Edit Corrections.",
            "LIBLINEAR: A Library for Large Linear Classification.",
            "On Relevant Dimensions in Kernel Feature Spaces.",
            "Manifold Learning: The Price of Normalization.",
            "Complete Identification Methods for the Causal Hierarchy.",
            "Mixed Membership Stochastic Blockmodels.",
            "Consistency of Random Forests and Other Averaging Classifiers."
        ]
    },
    {
        "name": "JMLR",
        "year": "2007",
        "info": "Volume 8: 2007",
        "count": 91,
        "papers": [
            "Nonlinear Boosting Projections for Ensemble Construction.",
            "Multi-Task Learning for Classification with Dirichlet Process Priors.",
            "A Unified Continuous Optimization Framework for Center-Based Clustering Methods.",
            "Minimax Regret Classifier for Imprecise Class Distributions.",
            "Distances between Data Sets Based on Summary Statistics.",
            "Building Blocks for Variational Bayesian Learning of Latent Variable Models.",
            "A Probabilistic Analysis of EM for Mixtures of Separated, Spherical Gaussians.",
            "Noise Tolerant Variants of the Perceptron Algorithm.",
            "Learnability of Gaussians with Flexible Variances.",
            "Separating Models of Learning from Correlated and Uncorrelated Data.",
            "Comments on the \"Core Vector Machines: Fast SVM Training on Very Large Data Sets\".",
            "General Polynomial Time Decomposition Algorithms.",
            "Dynamics and Generalization Ability of LVQ Algorithms.",
            "Statistical Consistency of Kernel Canonical Correlation Analysis.",
            "Learning Equivariant Functions with Matrix Valued Kernels.",
            "Boosted Classification Trees and Class Probability/Quantile Estimation.",
            "Value Regularization and Fenchel Duality.",
            "Integrating Naïve Bayes and FOIL.",
            "A Stochastic Algorithm for Feature Selection in Pattern Recognition.",
            "Learning Horn Expressions with LOGAN-H.",
            "Consistent Feature Selection for Pattern Recognition in Polynomial Time.",
            "Estimating High-Dimensional Directed Acyclic Graphs with the PC-Algorithm.",
            "Margin Trees for High-dimensional Classification.",
            "Relational Dependency Networks.",
            "Dynamic Conditional Random Fields: Factorized Probabilistic Models for Labeling and Segmenting Sequence Data.",
            "The Pyramid Match Kernel: Efficient Learning with Sets of Features.",
            "Infinitely Imbalanced Logistic Regression.",
            "Sparseness vs Estimating Conditional Probabilities: Some Asymptotic Results.",
            "Concave Learners for Rankboost.",
            "Gini Support Vector Machine: Quadratic Entropy Based Robust Multi-Class Probability Regression.",
            "Preventing Over-Fitting during Model Selection via Bayesian Regularisation of the Hyper-Parameters.",
            "Combining PAC-Bayesian and Generic Chaining Bounds.",
            "Anytime Learning of Decision Trees.",
            "Classification in Networked Data: A Toolkit and a Univariate Case Study.",
            "Covariate Shift Adaptation by Importance Weighted Cross Validation.",
            "On the Consistency of Multiclass Classification Methods.",
            "Dimensionality Reduction of Multimodal Labeled Data by Local Fisher Discriminant Analysis.",
            "Undercomplete Blind Subspace Deconvolution.",
            "Bilinear Discriminant Component Analysis.",
            "Loop Corrections for Approximate Inference on Factor Graphs.",
            "Penalized Model-Based Clustering with Application to Variable Selection.",
            "Local Discriminant Wavelet Packet Coordinates for Face Recognition.",
            "Synergistic Face Detection and Pose Estimation with Energy-Based Models.",
            "Maximum Entropy Density Estimation with Generalized Regularization and an Application to Species Distribution Modeling.",
            "Measuring Differentiability: Unmasking Pseudonymous Authors.",
            "Bayesian Quadratic Discriminant Analysis.",
            "From External to Internal Regret.",
            "Graph Laplacians and their Convergence on Random Neighborhood Graphs.",
            "Generalization Error Bounds in Semi-supervised Classification Under the Cluster Assumption.",
            "Learning to Classify Ordinal Data: The Data Replication Method.",
            "Attribute-Efficient and Non-adaptive Learning of Parities and DNF Expressions.",
            "PAC-Bayes Risk Bounds for Stochastic Averages and Majority Votes of Sample-Compressed Classifiers.",
            "On the Effectiveness of Laplacian Normalization for Graph Semi-supervised Learning.",
            "An Interior-Point Method for Large-Scale l1-Regularized Logistic Regression.",
            "Multi-class Protein Classification Using Adaptive Codes.",
            "Spherical-Homoscedastic Distributions: The Equivalency of Spherical and Normal Distributions in Classification.",
            "Handling Missing Values when Applying Classification Models.",
            "Compression-Based Averaging of Selective Naive Bayes Classifiers.",
            "A Nonparametric Statistical Approach to Clustering via Mode Identification.",
            "Polynomial Identification in the Limit of Substitutable Context-free Languages.",
            "Structure and Majority Classes in Decision Tree Learning.",
            "Characterizing the Function Space for Bayesian Kernel Models.",
            "\"Ideal Parent\" Structure Learning for Continuous Variable Bayesian Networks.",
            "Behavioral Shaping for Geometric Concepts.",
            "Large Margin Semi-supervised Learning.",
            "Fast Iterative Kernel Principal Component Analysis.",
            "A Generalized Maximum Entropy Approach to Bregman Co-clustering and Matrix Approximation.",
            "Truncating the Loop Series Expansion for Belief Propagation.",
            "Very Fast Online Learning of Highly Non Linear Problems.",
            "Unlabeled Compression Schemes for Maximum Classes.",
            "Refinable Kernels.",
            "A Complete Characterization of a Family of Solutions to a Generalized Fisher Criterion.",
            "Transfer Learning via Inter-Task Mappings for Temporal Difference Learning.",
            "Proto-value Functions: A Laplacian Framework for Learning Representation and Control in Markov Decision Processes.",
            "Online Learning of Multiple Tasks with a Shared Loss.",
            "Euclidean Embedding of Co-occurrence Data.",
            "Harnessing the Expertise of 70, 000 Human Editors: Knowledge-Based Feature Generation for Text Categorization.",
            "AdaBoost is Consistent.",
            "The On-Line Shortest Path Problem Under Partial Monitoring.",
            "The Locally Weighted Bag of Words Framework for Document Representation.",
            "The Need for Open Source Software in Machine Learning.",
            "On the Representer Theorem and Equivalent Degrees of Freedom of SVR.",
            "Nonlinear Estimators and Tail Bounds for Dimension Reduction in l1 Using Cauchy Random Projections.",
            "Revised Loss Bounds for the Set Covering Machine and Sample-Compression Loss Bounds for Imbalanced Data.",
            "VC Theory of Large Margin Multi-Category Classifiers.",
            "Learning in Environments with Unknown Dynamics: Towards more Robust Concept Learners.",
            "Hierarchical Average Reward Reinforcement Learning.",
            "Ranking the Best Instances.",
            "Stagewise Lasso.",
            "A New Probabilistic Approach in Rank Regression with Optimal Bayesian Partitioning.",
            "Dynamic Weighted Majority: An Ensemble Method for Drifting Concepts."
        ]
    },
    {
        "name": "JMLR",
        "year": "2006",
        "info": "Volume 7: 2006",
        "count": 100,
        "papers": [
            "Statistical Comparisons of Classifiers over Multiple Data Sets.",
            "Incremental Algorithms for Hierarchical Classification.",
            "On the Complexity of Learning Lexicographic Strategies.",
            "Generalized Bradley-Terry Models and Multi-Class Probability Estimates.",
            "Bounds for Linear Multi-Task Learning.",
            "Active Learning in Approximately Linear Regression Based on Conditional Expectation of Generalization Error.",
            "MinReg: A Scalable Algorithm for Learning Parsimonious Regulatory Networks in Yeast and Mammals.",
            "Learning the Structure of Linear Latent Variable Models.",
            "In Search of Non-Gaussian Components of a High-Dimensional Distribution.",
            "Some Discriminant-Based PAC Algorithms.",
            "Kernels on Prolog Proof Trees: Statistical Learning in the ILP Setting.",
            "Using Machine Learning to Guide Architecture Simulation.",
            "Superior Guarantees for Sequential Prediction and Lossless Compression via Alphabet Decomposition.",
            "Geometric Variance Reduction in Markov Chains: Application to Value Function and Gradient Estimation.",
            "Inductive Synthesis of Functional Programs: An Explanation Based Generalization Approach.",
            "Optimising Kernel Parameters and Regularisation Coefficients for Non-linear Discriminant Analysis.",
            "Learning Recursive Control Programs from Problem Solving.",
            "Learning Coordinate Covariances via Gradients.",
            "Online Passive-Aggressive Algorithms.",
            "Toward Attribute Efficient Learning of Decision Lists and Parities.",
            "A Direct Method for Building Sparse Kernel Learning Algorithms.",
            "Stochastic Complexities of Gaussian Mixtures in Variational Bayesian Approximation.",
            "Pattern Recognition for Conditionally Independent Data.",
            "Learning Minimum Volume Sets.",
            "Some Theory for Generalized Boosting Algorithms.",
            "QP Algorithms with Guaranteed Accuracy and Run Time for Support Vector Machines.",
            "Policy Gradient in Continuous Time.",
            "Learning Image Components for Object Recognition.",
            "Consistency and Convergence Rates of One-Class SVMs and Related Algorithms.",
            "Infinite-sigma Limits For Tikhonov Regularization.",
            "Evolutionary Function Approximation for Reinforcement Learning.",
            "Rearrangement Clustering: Pitfalls, Remedies, and Applications.",
            "Segmental Hidden Markov Models with Random Effects for Waveform Modeling.",
            "Lower Bounds and Aggregation in Density Estimation.",
            "Quantile Regression Forests.",
            "Sparse Boosting.",
            "One-Class Novelty Detection for Seizure Analysis from Intracranial EEG.",
            "A Graphical Representation of Equivalence Classes of AMP Chain Graphs.",
            "Action Elimination and Stopping Conditions for the Multi-Armed Bandit and Reinforcement Learning Problems.",
            "Step Size Adaptation in Reproducing Kernel Hilbert Space.",
            "New Algorithms for Efficient High-Dimensional Nonparametric Classification.",
            "A Very Fast Learning Method for Neural Networks Based on Sensitivity Analysis.",
            "Computational and Theoretical Analysis of Null Space and Orthogonal Linear Discriminant Analysis.",
            "Worst-Case Analysis of Selective Sampling for Linear Classification.",
            "Nonparametric Quantile Estimation.",
            "The Interplay of Optimization and Machine Learning Research.",
            "Second Order Cone Programming Approaches for Handling Missing and Uncertain Data.",
            "Ensemble Pruning Via Semi-definite Programming.",
            "Linear Programs for Hypotheses Selection in Probabilistic Inference Models.",
            "Bayesian Network Learning with Parameter Constraints.",
            "Learning Sparse Representations by Non-Negative Matrix Factorization and Sequential Cone Programming.",
            "Fast SDP Relaxations of Graph Cut Clustering, Transduction, and Other Combinatorial Problem.",
            "Maximum-Gain Working Set Selection for SVMs.",
            "Parallel Software for Training Large Scale Support Vector Machines on Multiprocessor Systems.",
            "Building Support Vector Machines with Reduced Classifier Complexity.",
            "Exact 1-Norm Support Vector Machines Via Unconstrained Convex Differentiable Minimization.",
            "Large Scale Multiple Kernel Learning.",
            "Efficient Learning of Label Ranking by Soft Projections onto Polyhedra.",
            "Kernel-Based Learning of Hierarchical Multilabel Classification Models.",
            "Structured Prediction, Dual Extragradient and Bregman Projections.",
            "Active Learning with Feedback on Features and Instances.",
            "Large Scale Transductive SVMs.",
            "Considering Cost Asymmetry in Learning Classifiers.",
            "Learning Factor Graphs in Polynomial Time and Sample Complexity.",
            "Collaborative Multiagent Reinforcement Learning by Payoff Propagation.",
            "Estimating the \"Wrong\" Graphical Model: Benefits in the Computation-Limited Setting.",
            "Streamwise Feature Selection.",
            "Linear Programming Relaxations and Belief Propagation - An Empirical Study.",
            "Incremental Support Vector Learning: Analysis, Implementation and Applications.",
            "A Simulation-Based Algorithm for Ergodic Control of Markov Chains Conditioned on Rare Events.",
            "Learning Spectral Clustering, With Application To Speech Separation.",
            "A Linear Non-Gaussian Acyclic Model for Causal Discovery.",
            "Walk-Sums and Belief Propagation in Gaussian Graphical Models.",
            "Distance Patterns in Structural Similarity.",
            "A Hierarchy of Support Vector Machines for Pattern Detection.",
            "Adaptive Prototype Learning Algorithms: Theoretical and Experimental Studies.",
            "A Scoring Function for Learning Bayesian Networks based on Mutual Information and Conditional Independence Tests.",
            "Noisy-OR Component Analysis and its Application to Link Analysis.",
            "Learning a Hidden Hypergraph.",
            "An Efficient Implementation of an Active Set Method for SVMs.",
            "Causal Graph Based Decomposition of Factored MDPs.",
            "Accurate Error Bounds for the Eigenvalues of the Kernel Matrix.",
            "Point-Based Value Iteration for Continuous POMDPs.",
            "Learning Parts-Based Representations of Data.",
            "Manifold Regularization: A Geometric Framework for Learning from Labeled and Unlabeled Examples.",
            "Consistency of Multiclass Empirical Risk Minimization Methods Based on Convex Loss.",
            "Bounds for the Loss in Probability of Correct Classification Under Model Based Approximation.",
            "Estimation of Gradients and Coordinate Covariation in Classification.",
            "Expectation Correction for Smoothed Inference in Switching Linear Dynamical Systems.",
            "On Model Selection Consistency of Lasso.",
            "Stability Properties of Empirical Risk Minimization over Donsker Classes.",
            "Linear State-Space Models for Blind Source Separation.",
            "On Representing and Generating Kernels by Fuzzy Equivalence Relations.",
            "A Robust Procedure For Gaussian Graphical Model Search From Microarray Data With p Larger Than n.",
            "Universal Kernels.",
            "Machine Learning for Computer Security.",
            "Spam Filtering Using Statistical Data Compression Models.",
            "Spam Filtering Based On The Analysis Of Text Information Embedded Into Images.",
            "Learning to Detect and Classify Malicious Executables in the Wild.",
            "On Inferring Application Protocol Behaviors in Encrypted Network Traffic."
        ]
    },
    {
        "name": "JMLR",
        "year": "2005",
        "info": "Volume 6: 2005",
        "count": 73,
        "papers": [
            "Asymptotic Model Selection for Naive Bayesian Networks.",
            "Dimension Reduction in Text Classification with Support Vector Machines.",
            "Stability of Randomized Learning Algorithms.",
            "Learning Hidden Variable Networks: The Information Bottleneck Approach.",
            "Diffusion Kernels on Statistical Manifolds.",
            "Information Bottleneck for Gaussian Variables.",
            "Multiclass Boosting for Weak Classifiers.",
            "A Classification Framework for Anomaly Detection.",
            "Denoising Source Separation.",
            "Tutorial on Practical Prediction Theory for Classification.",
            "Generalization Bounds and Complexities Based on Sparsity and Clustering for Convex Combinations of Functions from Random Classes.",
            "A Modified Finite Newton Method for Fast Solution of Large Scale Linear SVMs.",
            "Core Vector Machines: Fast SVM Training on Very Large Data Sets.",
            "Generalization Bounds for the Area Under the ROC Curve.",
            "Learning with Decision Lists of Data-Dependent Features.",
            "Estimating Functions for Blind Separation When Sources Have Variance Dependencies.",
            "Characterization of a Family of Algorithms for Generalized Discriminant Analysis on Undersampled Problems.",
            "Tree-Based Batch Mode Reinforcement Learning.",
            "Learning Module Networks.",
            "Active Learning to Recognize Multiple Types of Plankton.",
            "Learning Multiple Tasks with Kernel Methods.",
            "Adaptive Online Prediction by Following the Perturbed Leader.",
            "Variational Message Passing.",
            "Estimation of Non-Normalized Statistical Models by Score Matching.",
            "Smooth epsiloon-Insensitive Regression by Loss Symmetrization.",
            "Quasi-Geodesic Neural Learning Algorithms Over the Orthogonal Group: A Tutorial.",
            "Machine Learning Methods for Predicting Failures in Hard Drives: A Multiple-Instance Application.",
            "Multiclass Classification with Multi-Prototype Support Vector Machines.",
            "Prioritization Methods for Accelerating MDP Solvers.",
            "Learning from Examples as an Inverse Problem.",
            "Loopy Belief Propagation: Convergence and Effects of Message Errors.",
            "Learning a Mahalanobis Metric from Equivalence Constraints.",
            "Algorithmic Stability and Meta-Learning.",
            "Matrix Exponentiated Gradient Updates for On-line Learning and Bregman Projection.",
            "Gaussian Processes for Ordinal Regression.",
            "Learning the Kernel with Hyperkernels.",
            "A Generalization Error for Q-Learning.",
            "Learning the Kernel Function via Regularization.",
            "Analysis of Variance of Cross-Validation Estimators of the Generalization Error.",
            "Semigroup Kernels on Measures.",
            "Separating a Real-Life Nonlinear Image Mixture.",
            "Concentration Bounds for Unigram Language Models.",
            "An MDP-Based Recommender System.",
            "Universal Algorithms for Learning Theory Part I : Piecewise Constant Functions.",
            "Efficient Computation of Gapped Substring Kernels on Large Alphabets.",
            "Clustering on the Unit Hypersphere using von Mises-Fisher Distributions.",
            "Inner Product Spaces for Bayesian Networks.",
            "Maximum Margin Algorithms with Boolean Kernels.",
            "A Bayes Optimal Approach for Partitioning the Values of Categorical Attributes.",
            "Large Margin Methods for Structured and Interdependent Output Variables.",
            "Frames, Reproducing Kernels, Regularization and Learning.",
            "Local Propagation in Conditional Gaussian Bayesian Networks.",
            "A Bayesian Model for Supervised Clustering with the Dirichlet Process Prior.",
            "Fast Kernel Classifiers with Online and Active Learning.",
            "Managing Diversity in Regression Ensembles.",
            "Active Coevolutionary Learning of Deterministic Finite Automata.",
            "Assessing Approximate Inference for Binary Gaussian Process Classification.",
            "Clustering with Bregman Divergences.",
            "Combining Information Extraction Systems Using Voting and Stacked Generalization.",
            "Probabilistic Non-linear Principal Component Analysis with Gaussian Process Latent Variable Models.",
            "A Framework for Learning Predictive Structures from Multiple Tasks and Unlabeled Data.",
            "Feature Selection for Unsupervised and Supervised Inference: The Emergence of Sparsity in a Weight-Based Approach.",
            "Working Set Selection Using Second Order Information for Training Support Vector Machines.",
            "New Horn Revision Algorithms.",
            "A Unifying View of Sparse Approximate Gaussian Process Regression.",
            "What's Strange About Recent Events (WSARE): An Algorithm for the Early Detection of Disease Outbreaks.",
            "Change Point Problems in Linear Dynamical Systems.",
            "Asymptotics in Empirical Risk Minimization.",
            "Convergence Theorems for Generalized Alternating Minimization Procedures.",
            "Kernel Methods for Measuring Independence.",
            "Efficient Margin Maximizing with Boosting.",
            "On the Nyström Method for Approximating a Gram Matrix for Improved Kernel-Based Learning.",
            "Expectation Consistent Approximate Inference."
        ]
    },
    {
        "name": "JMLR",
        "year": "2004",
        "info": "Volume 5: 2004",
        "count": 56,
        "papers": [
            "Learning Rates for Q-learning.",
            "Learning the Kernel Matrix with Semidefinite Programming.",
            "Dimensionality Reduction for Supervised Learning with Reproducing Kernel Hilbert Spaces.",
            "In Defense of One-Vs-All Classification.",
            "Lossless Online Bayesian Bagging.",
            "Subgroup Discovery with CN2-SD.",
            "Generalization Error Bounds for Threshold Decision Lists.",
            "On the Importance of Small Coordinate Projections.",
            "Weather Data Mining Using Independent Component Analysis.",
            "Online Choice of Active Learning Algorithms.",
            "A Compression Approach to Support Vector Model Selection.",
            "A Geometric Approach to Multi-Criterion Reinforcement Learning.",
            "RCV1: A New Benchmark Collection for Text Categorization Research.",
            "Distributional Scaling: An Algorithm for Structure-Preserving Embedding of Metric and Nonmetric Spaces.",
            "Learning Ensembles from Bites: A Scalable and Accurate Approach.",
            "Robust Principal Component Analysis with Adaptive Selection for Tuning Parameters.",
            "PAC-learnability of Probabilistic Deterministic Finite State Automata.",
            "Sources of Success for Boosted Wrapper Induction.",
            "Computable Shell Decomposition Bounds.",
            "Exact Bayesian Structure Discovery in Bayesian Networks.",
            "A Universal Well-Calibrated Algorithm for On-line Classification.",
            "New Techniques for Disambiguation in Natural Language and Their Application to Biological Text.",
            "The Sample Complexity of Exploration in the Multi-Armed Bandit Problem.",
            "Preference Elicitation and Query Learning.",
            "Distance-Based Classification with Lipschitz Functions.",
            "Hierarchical Latent Class Models for Cluster Analysis.",
            "Bias-Variance Analysis of Support Vector Machines for the Development of SVM-Based Ensemble Methods.",
            "A Fast Algorithm for Joint Diagonalization with Non-orthogonal Transformations and its Application to Blind Source Separation.",
            "Feature Discovery in Non-Metric Pairwise Data.",
            "Probability Product Kernels.",
            "Feature Selection for Unsupervised Learning.",
            "Some Dichotomy Theorems for Neural Learning Problems.",
            "Image Categorization by Learning and Reasoning with Regions.",
            "Boosting as a Regularized Path to a Maximum Margin Classifier.",
            "Probability Estimates for Multi-class Classification by Pairwise Coupling.",
            "On Robustness Properties of Convex Risk Minimization Methods for Pattern Recognition.",
            "Rational Kernels: Theory and Algorithms.",
            "Reinforcement Learning with Factored States and Actions.",
            "No Unbiased Estimator of the Variance of K-Fold Cross-Validation.",
            "Selective Rademacher Penalization and Reduced Error Pruning of Decision Trees.",
            "Knowledge-Based Kernel Approximation.",
            "Support Vector Machine Soft Margin Classifiers: Error Analysis.",
            "Model Averaging for Prediction with Discrete Bayesian Networks.",
            "Efficient Feature Selection via Analysis of Relevance and Redundancy.",
            "Statistical Analysis of Some Multi-Category Large Margin Classification Methods.",
            "The Minimum Error Minimax Probability Machine.",
            "Large-Sample Learning of Bayesian Networks is NP-Hard.",
            "Randomized Variable Elimination.",
            "Some Properties of Regularized Kernel Methods.",
            "The Entire Regularization Path for the Support Vector Machine.",
            "Second Order Cone Programming Formulations for Feature Selection.",
            "Fast String Kernels using Inexact Matching for Protein Sequences.",
            "Non-negative Matrix Factorization with Sparseness Constraints.",
            "Variance Reduction Techniques for Gradient Estimates in Reinforcement Learning.",
            "Fast Binary Feature Selection with Conditional Mutual Information.",
            "The Dynamics of AdaBoost: Cyclic Behavior and Convergence of Margins."
        ]
    },
    {
        "name": "JMLR",
        "year": "2003",
        "info": "Volume 4: 2003",
        "count": 58,
        "papers": [
            "On Nearest-Neighbor Error-Correcting Output Codes with Application to All-Pairs Multiclass Support Vector Machines.",
            "FINkNN: A Fuzzy Interval Number k-Nearest Neighbor Classifier for Prediction of Sugar Production from Populations of Samples.",
            "Designing Committees of Models through Deliberate Weighting of Data Points.",
            "The em Algorithm for Kernel Matrix Completion with Auxiliary Data.",
            "Task Clustering and Gating for Bayesian Multitask Learning.",
            "Optimally-Smooth Adaptive Boosting and Application to Agnostic Learning.",
            "Think Globally, Fit Locally: Unsupervised Learning of Low Dimensional Manifold.",
            "On the Proper Learning of Axis-Parallel Concepts.",
            "Bottom-Up Relational Learning of Pattern Matching Rules for Information Extraction.",
            "Tree Induction vs. Logistic Regression: A Learning-Curve Analysis.",
            "Learning Probabilistic Models: An Expected Utility Maximization Approach.",
            "Combining Knowledge from Different Sources in Causal Probabilistic Models.",
            "Preference Elicitation via Theory Refinement.",
            "Fusion of Domain Knowledge with Data for Structural Learning in Object Oriented Domains.",
            "An Empirical Study of the Use of Relevance Information in Inductive Logic Programming.",
            "Learning Behavior-Selection by Emotions and Cognition in a Multi-Goal Robot Task.",
            "ILP: A Short Look Back and a Longer Look Forward.",
            "Relational Learning as Search in a Critical Region.",
            "Query Transformations for Improving the Efficiency of ILP Systems.",
            "Learning Semantic Lexicons from a Part-of-Speech and Semantically Tagged Corpus Using Inductive Logic Programming.",
            "On Inclusion-Driven Learning of Bayesian Networks.",
            "The Principled Design of Large-Scale Recursive Neural Network Architectures--DAG-RNNs and the Protein Structure Prediction Problem.",
            "Inducing Grammars from Sparse Data Sets: A Survey of Algorithms and Results.",
            "Smooth Boosting and Learning with Malicious Noise.",
            "Speedup Learning for Repair-based Search by Identifying Redundant Steps.",
            "Comparing Bayes Model Averaging and Stacking When Model Approximation Error Cannot be Ignored.",
            "Greedy Algorithms for Classification -- Consistency, Convergence Rates, and Adaptivity.",
            "Tree-Structured Neural Decoding.",
            "Introduction to the Special Issue on Learning Theory.",
            "On the Performance of Kernel Classes.",
            "Path Kernels and Multiplicative Updates.",
            "Tracking Linear-threshold Concepts with Winnow.",
            "Generalization Error Bounds for Bayesian Mixture Algorithms.",
            "On the Rate of Convergence of Regularized Boosting Classifiers.",
            "Concentration Inequalities for the Missing Mass and for Histogram Rule Error.",
            "Learning over Sets using Kernel Principal Angles.",
            "An Efficient Boosting Algorithm for Combining Preferences.",
            "Optimality of Universal Bayesian Sequence Prediction for General Loss and Alphabet.",
            "A Unified Framework for Model-based Clustering.",
            "Nash Q-Learning for General-Sum Stochastic Games.",
            "Sparseness of Support Vector Machines.",
            "Least-Squares Policy Iteration.",
            "An Approximate Analytical Approach to Resampling Averages.",
            "Introduction to Special Issue on Independent Components Analysis.",
            "Dependence, Correlation and Gaussianity in Independent Component Analysis.",
            "Beyond Independent Components: Trees and Clusters.",
            "Energy-Based Models for Sparse Overcomplete Representations.",
            "Blind Source Separation via Generalized Eigenvalue Decomposition.",
            "ICA Using Spacings Estimates of Entropy.",
            "MISEP -- Linear and Nonlinear ICA Based on Mutual Information.",
            "Blind Separation of Post-nonlinear Mixtures using Linearizing Transformations and Temporal Decorrelation.",
            "A Multiscale Framework For Blind Separation of Linearly Mixed Signals.",
            "A Maximum Likelihood Approach to Single-channel Source Separation.",
            "Statistical Dynamics of On-line Independent Component Analysis.",
            "Blind Source Recovery: A Framework in the State Space.",
            "Overlearning in Marginal Distribution-Based ICA: Analysis and Solutions.",
            "ICA for Watermarking Digital Images.",
            "A Generative Model for Separating Illumination and Reflectance from Images."
        ]
    },
    {
        "name": "JMLR",
        "year": "2002",
        "info": "Volume 3: 2002/2003",
        "count": 56,
        "papers": [
            "Kernel Independent Component Analysis.",
            "Learning Monotone DNF from a Teacher that Almost Does Not Answer Membership Queries.",
            "On the Convergence of Optimistic Policy Iteration.",
            "Data-dependent margin-based generalization bounds for classification.",
            "Variational Learning of Clusters of Undercomplete Nonsymmetric Independent Components.",
            "Learning Precise Timing with LSTM Recurrent Networks.",
            "MDPs: Learning in Varying Environments.",
            "Algorithmic Luckiness.",
            "R-MAX - A General Polynomial Time Algorithm for Near-Optimal Reinforcement Learning.",
            "PAC-Bayesian Generalisation Error Bounds for Gaussian Process Classification.",
            "On Online Learning of Decision Lists.",
            "Minimal Kernel Classifiers.",
            "The Subspace Information Criterion for Infinite Dimensional Hypothesis Spaces.",
            "Tracking a Small Set of Experts by Mixing Past Posteriors.",
            "Using Confidence Bounds for Exploitation-Exploration Trade-offs.",
            "Efficient Algorithms for Universal Portfolios.",
            "Limitations of Learning Via Embeddings in Euclidean Half Spaces.",
            "Rademacher and Gaussian Complexities: Risk Bounds and Structural Results.",
            "On Boosting with Polynomially Bounded Distributions.",
            "Optimal Structure Identification With Greedy Search.",
            "A Robust Minimax Approach to Classification.",
            "Cluster Ensembles --- A Knowledge Reuse Framework for Combining Multiple Partitions.",
            "Efficient Algorithms for Decision Tree Cross-validation.",
            "Multiple-Instance Learning of Real-Valued Data.",
            "Learning Probabilistic Models of Link Structure.",
            "The Representational Power of Discrete Bayesian Networks.",
            "The Set Covering Machine.",
            "Coupled Clustering: A Method for Detecting Structural Correspondence.",
            "Some Greedy Learning Algorithms for Sparse Regression and Classification with Mercer Kernels.",
            "Lyapunov Design for Safe Reinforcement Learning.",
            "Finding the Most Interesting Patterns in a Database Quickly by Using Sequential Sampling.",
            "Stopping Criterion for Boosting-Based Data Reduction Techniques: from Binary to Multiclass Problem.",
            "Learning to Construct Fast Signal Processing Implementations.",
            "Policy Search using Paired Comparisons.",
            "Ultraconservative Online Algorithms for Multiclass Problems.",
            "Latent Dirichlet Allocation.",
            "A Family of Additive Online Algorithms for Category Ranking.",
            "Word-Sequence Kernels.",
            "Kernel Methods for Relation Extraction.",
            "Matching Words and Pictures.",
            "A Neural Probabilistic Language Model.",
            "An Introduction to Variable and Feature Selection.",
            "Distributional Word Clusters vs. Words for Text Categorization.",
            "Extensions to Metric-Based Model Selection.",
            "Dimensionality Reduction via Sparse Support Vector Machines.",
            "Benefitting from the Variables that Variable Selection Discards.",
            "A Divisive Information-Theoretic Feature Clustering Algorithm for Text Classification.",
            "An Extensive Empirical Study of Feature Selection Metrics for Text Classification.",
            "Sufficient Dimensionality Reduction.",
            "Grafting: Fast, Incremental Feature Selection by Gradient Descent in Function Space.",
            "Variable Selection Using SVM-based Criteria.",
            "Overfitting in Making Comparisons Between Variable Selection Methods.",
            "MLPs (Mono-Layer Polynomials and Multi-Layer Perceptrons) for Nonlinear Modeling.",
            "Ranking a Random Feature for Variable and Feature Selection.",
            "Feature Extraction by Non-Parametric Mutual Information Maximization.",
            "Use of the Zero-Norm with Linear Models and Kernel Methods."
        ]
    },
    {
        "name": "JMLR",
        "year": "2001",
        "info": "Volume 2: 2001/2002",
        "count": 30,
        "papers": [
            "On the Size of Convex Hulls of Small Sets.",
            "Graph-Based Hierarchical Conceptual Clustering.",
            "Support Vector Machine Active Learning with Applications to Text Classification.",
            "On the Influence of the Kernel on the Consistency of Support Vector Machines.",
            "Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space.",
            "Support Vector Clustering.",
            "One-Class SVMs for Document Classification.",
            "Uniform Object Generation for Optimizing One-class Classifiers.",
            "A Generalized Kernel Approach to Dissimilarity-based Classification.",
            "A New Approximate Maximal Margin Classification Algorithm.",
            "Efficient SVM Training Using Low-Rank Kernel Representations.",
            "On the Algorithmic Implementation of Multiclass Kernel-based Vector Machines.",
            "Exact Simplification of Support Vector Solutions.",
            "Classes of Kernels for Machine Learning: A Statistics Perspective.",
            "Recommender Systems Using Linear Classifier.",
            "Machine Learning with Data Dependent Hypothesis Classes.",
            "On Using Extended Statistical Queries to Avoid Membership Queries.",
            "The Learning-Curve Sampling Method Applied to Model-Based Clustering.",
            "Text Classification using String Kernels.",
            "Learning Equivalence Classes of Bayesian-Network Structures.",
            "Stability and Generalization.",
            "Covering Number Bounds of Certain Regularized Linear Function Classes.",
            "Introduction to Special Issue on Machine Learning Approaches to Shallow Parsing.",
            "Memory-Based Shallow Parsing.",
            "Shallow Parsing using Specialized HMMs.",
            "Text Chunking based on a Generalization of Winnow.",
            "Shallow Parsing with PoS Taggers and Linguistic Features.",
            "Learning Rules and Their Exceptions.",
            "Shallow Parsing using Noisy and Non-Stationary Training Material.",
            "Round Robin Classification."
        ]
    },
    {
        "name": "JMLR",
        "year": "2000",
        "info": "Volume 1: 2000/2001",
        "count": 11,
        "papers": [
            "Learning with Mixtures of Trees.",
            "Dependency Networks for Inference, Collaborative Filtering, and Data Visualization.",
            "Learning Evaluation Functions to Improve Optimization by Local Search.",
            "Reducing Multiclass to Binary: A Unifying Approach for Margin Classifiers.",
            "SVMTorch: Support Vector Machines for Large-Scale Regression Problems.",
            "Lagrangian Support Vector Machines.",
            "Regularized Principal Manifolds.",
            "Sparse Bayesian Learning and the Relevance Vector Machine.",
            "Bayes Point Machines.",
            "Tracking the Best Linear Predictor.",
            "Prior Knowledge and Preferential Structures in Gradient Descent Learning Algorithms."
        ]
    }
]