[
    {
        "name": "Journal of Automated Reasoning",
        "year": "2022",
        "info": "2022: Volumes\n66",
        "count": 5,
        "papers": [
            "Proof Complexity of Modal Resolution.",
            "Conflict-Driven Satisfiability for Theory Combination: Lemmas, Modules, and Proofs.",
            "Predicate Transformer Semantics for Hybrid Systems.",
            "Integrating Owicki-Gries for C11-Style Memory Models into Isabelle/HOL.",
            "Correction to: Differential Dynamic Logic for Hybrid Systems."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2021",
        "info": "2021: Volumes\n65",
        "count": 37,
        "papers": [
            "Formalization of Euler-Lagrange Equation Set Based on Variational Calculus in HOL Light.",
            "Formalization of the Poincaré Disc Model of Hyperbolic Geometry.",
            "HOπ in Coq.",
            "Building Strategies into QBF Proofs.",
            "Message from the New Editor-in-Chief.",
            "Unbounded-Time Safety Verification of Guarded LTI Models with Inputs by Abstract Acceleration.",
            "Mechanisation of the AKS Algorithm.",
            "TacticToe: Learning to Prove with Tactics.",
            "Machine Learning Guidance for Connection Tableaux.",
            "CoCon: A Conference Management System with Formally Verified Document Confidentiality.",
            "Decidable ∃ *∀ * First-Order Fragments of Linear Rational Arithmetic with Uninterpreted Predicates.",
            "Higher-Order Quantifier Elimination, Counter Simulations and Fault-Tolerant Systems.",
            "Correction to: A Unifying View on SMT-Based Software Verification.",
            "Automated Proof of Bell-LaPadula Security Properties.",
            "A Decidable Class of Security Protocols for Both Reachability and Equivalence Properties.",
            "Formalising $\\varSigma$-Protocols and Commitment Schemes Using CryptHOL.",
            "An Isabelle/HOL Formalisation of the SPARC Instruction Set Architecture and the TSO Memory Model.",
            "Schematic Refutations of Formula Schemata.",
            "Craig Interpolation with Clausal First-Order Tableaux.",
            "Certified Quantum Computation in Isabelle/HOL.",
            "Automated Discovery of Geometric Theorems Based on Vector Equations.",
            "On the Importance of Domain Model Configuration for Automated Planning Engines.",
            "Extensional Higher-Order Paramodulation in Leo-III.",
            "Automated Reasoning with Restricted Intensional Sets.",
            "Preface: Special Issue of Selected Extended Papers of CADE 2019.",
            "Superposition with Lambdas.",
            "Model Completeness, Uniform Interpolants and Superposition Calculus.",
            "Automata Terms in a Lazy WSkS Decision Procedure.",
            "Towards Satisfiability Modulo Parametric Bit-vectors.",
            "Distilling the Requirements of Gödel's Incompleteness Theorems with a Proof Assistant.",
            "Optimization Modulo the Theories of Signed Bit-Vectors and Floating-Point Numbers.",
            "Handling Transitive Relations in First-Order Automated Reasoning.",
            "An Automatically Verified Prototype of the Tokeneer ID Station Specification.",
            "Human-Centered Automated Proof Search.",
            "Derivational Complexity and Context-Sensitive Rewriting.",
            "Formalization of Ring Theory in PVS.",
            "Experiences from Exporting Major Proof Assistant Libraries."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2020",
        "info": "2020: Volumes\n64",
        "count": 60,
        "papers": [
            "A Conflict-Driven Solving Procedure for Poly-Power Constraints.",
            "ExpTime Tableaux with Global Caching for Hybrid PDL.",
            "Automating Free Logic in HOL, with an Experimental Application in Category Theory.",
            "Priority Inheritance Protocol Proved Correct.",
            "Politeness and Combination Methods for Theories with Bridging Functions.",
            "A Prover Dealing with Nominals, Binders, Transitivity and Relation Hierarchies.",
            "Using Well-Founded Relations for Proving Operational Termination.",
            "Blocking and Other Enhancements for Bottom-Up Model Generation Methods.",
            "Combining Induction and Saturation-Based Theorem Proving.",
            "Solving Quantifier-Free First-Order Constraints Over Finite Sets and Binary Relations.",
            "Evaluating Winding Numbers and Counting Complex Roots Through Cauchy Indices in Isabelle/HOL.",
            "Preface to the Special Issue on Automated Reasoning Systems.",
            "A Verified Implementation of Algebraic Numbers in Isabelle/HOL.",
            "Limited Second-Order Functionality in a First-Order Setting.",
            "OptiMathSAT: A Tool for Optimization Modulo Theories.",
            "sf Kn : Architecture, Refinements, Strategies and Experiments.",
            "Scalable Fine-Grained Proofs for Formula Processing.",
            "Preface: Selected Extended Papers of CADE 2017.",
            "Efficient Verified (UN)SAT Certificate Checking.",
            "Strong Extension-Free Proof Systems.",
            "Automatically Verifying Temporal Properties of Pointer Programs with Cyclic Proof.",
            "Conflict-Driven Satisfiability for Theory Combination: Transition System and Completeness.",
            "SPASS-AR: A First-Order Theorem Prover Based on Approximation-Refinement into the Monadic Shallow Linear Fragment.",
            "A Formalized General Theory of Syntax with Bindings: Extended Version.",
            "Homogeneous Length Functions on Groups: Intertwined Computer and Human Proofs.",
            "Automated Reasoning with Power Maps.",
            "A Verified Implementation of the Berlekamp-Zassenhaus Factorization Algorithm.",
            "Formalizing the Cox-Ross-Rubinstein Pricing of European Derivatives in Isabelle/HOL.",
            "An Assertional Proof of Red-Black Trees Using Dafny.",
            "Preface: Selected Extended Papers from Interactive Theorem Proving 2018.",
            "Graph Theory in Coq: Minors, Treewidth, and Isomorphisms.",
            "Formalizing the LLL Basis Reduction Algorithm and the LLL Factorization Algorithm in Isabelle/HOL.",
            "A Relaxation of Üresin and Dubois' Asynchronous Fixed-Point Theory in Agda.",
            "Verified Analysis of Random Binary Tree Structures.",
            "Formal Reasoning Under Cached Address Translation.",
            "The MetaCoq Project.",
            "First-Order Automated Reasoning with Theories: When Deduction Modulo Theory Meets Practice.",
            "Efficient Strategies for CEGAR-Based Model Checking.",
            "Exploring the Structure of an Algebra Text with Locales.",
            "A Library for Formalization of Linear Error-Correcting Codes.",
            "Preface: Special Issue of Selected Extended Papers from IJCAR 2018.",
            "Formalizing Bachmair and Ganzinger's Ordered Resolution Prover.",
            "Constructive Decision via Redundancy-Free Proof-Search.",
            "From QBFs to MALL and Back via Focussing.",
            "Simulating Strong Practical Proof Systems with Extended Resolution.",
            "Probably Partially True: Satisfiability for Łukasiewicz Infinitely-Valued Probabilistic Logic and Related Topics.",
            "Proof-Producing Synthesis of CakeML from Monadic HOL Functions.",
            "Parameterized Model Checking on the TSO Weak Memory Model.",
            "Selected and Extended Papers from TACAS 2018: Preface.",
            "Synthesizing Precise and Useful Commutativity Conditions.",
            "Chain Reduction for Binary and Zero-Suppressed Decision Diagrams.",
            "ICE-Based Refinement Type Discovery for Higher-Order Functional Programs.",
            "Fine-Grained Complexity of Safety Verification.",
            "Natural Projection as Partial Model Checking.",
            "Multi-cost Bounded Tradeoff Analysis in MDP.",
            "A Learning-Based Approach to Synthesizing Invariants for Incomplete Verification Engines.",
            "Theorem Proving for Pointwise Metric Temporal Logic Over the Naturals via Translations.",
            "The 2D Dependency Pair Framework for Conditional Rewrite Systems - Part II: Advanced Processors and Implementation Techniques.",
            "Loop-Type Sequent Calculi for Temporal Logic.",
            "System-Level Non-interference of Constant-Time Cryptography. Part II: Verified Static Analysis and Stealth Memory."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2019",
        "info": "2019: Volumes\n62,\n63",
        "count": 62,
        "papers": [
            "Parallel Postulates and Continuity Axioms: A Mechanized Study in Intuitionistic Logic Using Coq.",
            "Deciding Univariate Polynomial Problems Using Untrusted Certificates in Isabelle/HOL.",
            "Verifying OpenJDK's Sort Method for Generic Collections.",
            "Goal-Oriented Proof-Search in Natural Deduction for Intuitionistic Propositional Logic.",
            "Selected Extended Papers of ITP 2016: Preface.",
            "Proof Pearl: Bounding Least Common Multiples with Triangles.",
            "Mostly Automated Formal Verification of Loop Dependencies with Applications to Distributed Stencil Algorithms.",
            "The Flow of ODEs: Formalization of Variational Equation and Poincaré Map.",
            "From Types to Sets by Local Type Definition in Higher-Order Logic.",
            "Formalizing Network Flow Algorithms: A Refinement Approach in Isabelle/HOL.",
            "Formally Verified Approximations of Definite Integrals.",
            "Fast Formal Proof of the Erdős-Szekeres Conjecture for Convex Polygons with at Most 6 Points.",
            "Verifying the Correctness and Amortized Complexity of a Union-Find Implementation in Separation Logic with Time Credits.",
            "Amortized Complexity Verified.",
            "Extraction of Expansion Trees.",
            "Selected Extended Papers of ITP 2015: Preface.",
            "A Verified CompCert Front-End for a Memory Model Supporting Pointer Arithmetic and Uninitialised Data.",
            "Refinement to Imperative HOL.",
            "Refinement to Certify Abstract Interpretations: Illustrated on Linearization for Polyhedra.",
            "A Consistent Foundation for Isabelle/HOL.",
            "System-Level Non-interference of Constant-Time Cryptography. Part I: Model.",
            "Automatic Refinement to Efficient Data Structures: A Comparison of Two Approaches.",
            "On the Generation of Quantified Lemmas.",
            "Long-Distance Q-Resolution with Dependency Schemes.",
            "Preface: Special Issue on Homotopy Type Theory and Univalent Foundations.",
            "The Univalence Axiom in Cubical Sets.",
            "Canonicity for Cubical Type Theory.",
            "Guarded Cubical Type Theory.",
            "The James Construction and π4(S3) in Homotopy Type Theory.",
            "From Signatures to Monads in UniMath.",
            "Selected Extended Papers of ITP 2017 - Preface.",
            "A Formalization of Convex Polyhedra Based on the Simplex Method.",
            "A Formal Proof of the Expressiveness of Deep Learning.",
            "CompCertS: A Memory-Aware Verified C Compiler Using a Pointer as Integer Semantics.",
            "Call-by-Value Lambda Calculus as a Model of Computation in Coq.",
            "Categoricity Results and Large Model Constructions for Second-Order ZF in Dependent Type Theory.",
            "Effect Polymorphism in Higher-Order Logic (Proof Pearl).",
            "A Verified Generational Garbage Collector for CakeML.",
            "Verifying a Concurrent Garbage Collector with a Rely-Guarantee Methodology.",
            "Formalization of the Fundamental Group in Untyped Set Theory Using Auto2.",
            "A PSpace Algorithm for Acyclic Epistemic DL ALCS5m.",
            "Semantics of Mizar as an Isabelle Object Logic.",
            "Reinterpreting Dependency Schemes: Soundness Meets Incompleteness in DQBF.",
            "Mechanized Metatheory Revisited.",
            "Classification of Finite Fields with Applications.",
            "Formally Verifying the Solution to the Boolean Pythagorean Triples Problem.",
            "Wombit: A Portfolio Bit-Vector Solver Using Word-Level Propagation.",
            "An Isabelle/HOL Formalisation of Green's Theorem.",
            "Formalization of Geometric Algebra in HOL Light.",
            "Preface to the Special Issue on Linearity.",
            "Implicit Computational Complexity of Subrecursive Definitions and Applications to Cryptographic Proofs.",
            "A Proof Theory for Model Checking.",
            "Linear Numeral Systems.",
            "Proof Diagrams for Multiplicative Linear Logic: Syntax and Semantics.",
            "QPCF: Higher-Order Languages and Quantum Circuits.",
            "Formalization of Metatheory of the Quipper Quantum Programming Language in a Linear Logic.",
            "Selected Extended Papers of NFM 2017: Preface.",
            "Verifying Safety and Persistence in Hybrid Systems Using Flowpipes and Continuous Invariants.",
            "Compositional Falsification of Cyber-Physical Systems with Machine Learning Components.",
            "Explaining AI Decisions Using Efficient Methods for Learning Sparse Boolean Formulae.",
            "An Automata-Theoretic Approach to Model-Checking Systems and Specifications Over Infinite Data Domains.",
            "Efficient Active Automata Learning via Mutation Testing."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2018",
        "info": "2018: Volumes\n60,\n61",
        "count": 37,
        "papers": [
            "Selected Extended Papers of NFM 2016: Preface.",
            "Formal Verification of an Executable LTL Model Checker with Partial Order Reduction.",
            "Verifying Relative Safety, Accuracy, and Termination for Program Approximations.",
            "Safe Autonomy Under Perception Uncertainty Using Chance-Constrained Temporal Logic.",
            "Translation of IEC 61131-3 Function Block Diagrams to PVS for Formal Verification with Real-Time Nuclear Application.",
            "Towards Probabilistic Formal Analysis of SATS-Simultaneously Moving Aircraft (SATS-SMA).",
            "Synthesis of Obfuscation Policies to Ensure Privacy and Utility.",
            "Conflict Resolution: A First-Order Resolution Calculus with Decision Literals and Conflict-Driven Clause Learning.",
            "Genetic Programming + Proof Search = Automatic Improvement.",
            "Visibly Linear Temporal Logic.",
            "Many-Sorted Equivalence of Shiny and Strongly Polite Theories.",
            "A Formalization of Metric Spaces in HOL Light.",
            "Selected Extended Papers of VSTTE 2016.",
            "Bidirectional Grammars for Machine-Code Decoding and Encoding.",
            "Automated Verification of Functional Correctness of Race-Free GPU Programs.",
            "A Unifying View on SMT-Based Software Verification.",
            "Relational Program Reasoning Using Compiler IR - Combining Static Verification and Dynamic Analysis.",
            "The Matrix Reproved (Verification Pearl).",
            "OWL Reasoning: Subsumption Test Hardness and Modularity.",
            "Sentence-Normalized Conditional Narrowing Modulo in Rewriting Logic and Maude.",
            "Automatic Synthesis of Logical Models for Order-Sorted First-Order Theories.",
            "Generalizing Morley's and Other Theorems with Automated Realization.",
            "Erratum to: Conflict Resolution: A First-Order Resolution Calculus with Decision Literals and Conflict-Driven Clause Learning.",
            "Introduction to Milestones in Interactive Theorem Proving.",
            "The Role of the Mizar Mathematical Library for Interactive Proof Development in Mizar.",
            "Distant Decimals of π : Formal Proofs of Some Algorithms Computing Them and Guarantees of Exact Computation.",
            "A Verified ODE Solver and the Lorenz Attractor.",
            "CoSMed: A Confidentiality-Verified Social Media Platform.",
            "Toward Compositional Verification of Interruptible OS Kernels and Device Drivers.",
            "Verified iptables Firewall Analysis and Verification.",
            "Mechanising a Type-Safe Model of Multithreaded Java with a Verified Compiler.",
            "A Verified SAT Solver Framework with Learn, Forget, Restart, and Incrementality.",
            "VST-Floyd: A Separation Logic Tool to Verify Correctness of C Programs.",
            "Hammer for Coq: Automation for Dependent Type Theory.",
            "Formalization of the Resolution Calculus for First-Order Logic.",
            "Formally Verified Algorithms for Upper-Bounding State Space Diameters.",
            "Regular Language Representations in the Constructive Type Theory of Coq."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2017",
        "info": "2017: Volumes\n58,\n59",
        "count": 35,
        "papers": [
            "Preface - Special Issue of Selected Extended Papers of IJCAR 2014.",
            "Analyzing Program Termination and Complexity Automatically with AProVE.",
            "Automatically Proving Termination and Memory Safety for Programs with Pointer Arithmetic.",
            "The Bayesian Ontology Language $$\\mathcal {BEL}$$ BEL.",
            "Solution Validation and Extraction for QBF Preprocessing.",
            "An Approximation Framework for Solvers and Decision Procedures.",
            "Soundness and Completeness Proofs by Coinductive Methods.",
            "Finding Proofs in Tarskian Geometry.",
            "A Synthetic Proof of Pappus' Theorem in Tarski's Geometry.",
            "Confluence of Orthogonal Term Rewriting Systems in the Prototype Verification System.",
            "A Fully Automatic Theorem Prover with Human-Style Output.",
            "Higher-Order Pattern Anti-Unification in Linear Time.",
            "Preface: Selected Extended Papers of CADE 2015.",
            "Combining SAT Solvers with Computer Algebra Systems to Verify Combinatorial Conjectures.",
            "A Decision Procedure for (Co)datatypes in SMT Solvers.",
            "Abstract Interpretation as Automated Deduction.",
            "Relative Termination via Dependency Pairs.",
            "On Preprocessing Techniques and Their Impact on Propositional Model Counting.",
            "Proving Divide and Conquer Complexities in Isabelle/HOL.",
            "A Formalisation in HOL of the Fundamental Theorem of Linear Algebra and Its Application to the Solution of the Least Squares Problem.",
            "Preface: Special Issue on Automatic Resource Bound Analysis.",
            "Complexity and Resource Bound Analysis of Imperative Programs Using Difference Constraints.",
            "Rely-Guarantee Termination and Cost Analyses of Loops with Concurrent Interleavings.",
            "Type-Based Cost Analysis for Lazy Functional Languages.",
            "Lower Bounds for Runtime Complexity of Term Rewriting.",
            "Semantically-Guided Goal-Sensitive Reasoning: Inference System and Completeness.",
            "A Complete Uniform Substitution Calculus for Differential Dynamic Logic.",
            "Fermat, Euler, Wilson - Three Case Studies in Number Theory.",
            "A Semantic Framework for Proof Evidence.",
            "Automated Reducible Geometric Theorem Proving and Discovery by Gröbner Basis Method.",
            "Markov Chains and Markov Decision Processes in Isabelle/HOL.",
            "A Formally Verified Proof of the Central Limit Theorem.",
            "Formally Proving Size Optimality of Sorting Networks.",
            "The OWL Reasoner Evaluation (ORE) 2015 Competition Report.",
            "The TPTP Problem Library and Associated Infrastructure - From CNF to TH0, TPTP v6.4.0."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2016",
        "info": "2016: Volumes \n56,\n57",
        "count": 29,
        "papers": [
            "Psi-Calculi in Isabelle.",
            "Automated Proofs of Block Cipher Modes of Operation.",
            "In Memory of Mark Stickel.",
            "Mark Stickel: His Earliest Work.",
            "Semantically-Guided Goal-Sensitive Reasoning: Model Representation.",
            "An Experiment with Satisfiability Modulo SAT.",
            "Semi-intelligible Isar Proofs from Machine-Generated Proofs.",
            "Interactive Theorem Proving - Preface of the Special Issue.",
            "On Definitions of Constants and Types in HOL.",
            "Self-Formalisation of Higher-Order Logic - Semantics, Soundness, and a Verified Implementation.",
            "Eisbach: A Proof Method Language for Isabelle.",
            "Verified Abstract Interpretation Techniques for Disassembling Low-level Self-modifying Code.",
            "Mechanizing a Process Algebra for Network Protocols.",
            "Completeness and Decidability Results for CTL in Constructive Type Theory.",
            "A Heuristic Prover for Real Inequalities.",
            "Adding Decision Procedures to SMT Solvers Using Axioms with Triggers.",
            "Quantifier Reordering for QBF.",
            "Preface: Special Issue on Interpolation.",
            "Labelled Interpolation Systems for Hyper-Resolution, Clausal, and Local Proofs.",
            "Complete Instantiation-Based Interpolation.",
            "Proof Tree Preserving Tree Interpolation.",
            "A Superposition Calculus for Abductive Reasoning.",
            "Formal Proofs of Rounding Error Bounds - With Application to an Automatic Positive Definiteness Check.",
            "Quasi-decidability of a Fragment of the First-Order Theory of Real Numbers.",
            "Proving Tight Bounds on Univariate Expressions with Elementary Functions in Coq.",
            "A Learning-Based Fact Selector for Isabelle/HOL.",
            "Proof Generalization in $$\\mathrm {LK}$$ LK by Second Order Unifier Minimization.",
            "Reasoning About Algebraic Data Types with Abstractions.",
            "A Formal C Memory Model for Separation Logic."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2015",
        "info": "2015: Volumes 54, 55",
        "count": 30,
        "papers": [
            "Formally Verified Certificate Checkers for Hardest-to-Round Computation.",
            "Automated Planning as an Early Verification Tool for Distributed Control.",
            "On Interpolation in Automated Theorem Proving.",
            "Erratum to : Learning-Assisted Automated Reasoning with Flyspeck.",
            "Labelings for Decreasing Diagrams.",
            "Verified Compilation of Floating-Point Computations.",
            "On the Fine-Structure of Regular Algebra.",
            "Symbolic Execution Proofs for Higher Order Store Programs.",
            "Formally-Verified Decision Procedures for Univariate Polynomial Computation Based on Sturm's and Tarski's Theorems.",
            "Decision Procedures for Flat Array Properties.",
            "Interpolation Systems for Ground Proofs in Automated Deduction: a Survey.",
            "A Mechanised Proof of Gödel's Incompleteness Theorems Using Nominal Isabelle.",
            "Automated Theorem Proving in GeoGebra: Current Achievements.",
            "The 2013 Evaluation of SMT-COMP and SMT-LIB.",
            "MaLeS: A Framework for Automatic Tuning of Automated Theorem Provers.",
            "The Reflective Milawa Theorem Prover is Sound (Down to the Machine Code that Runs it).",
            "Erratum to: Extension of a Decision Procedure for a Fragment of Hybrid Logic with Binders.",
            "Andrzej Trybulec - in Memoriam.",
            "Four Decades of Mizar - Foreword.",
            "Reconsidering Pairs and Functions as Sets.",
            "Mechanizing Complemented Lattices Within Mizar Type System.",
            "Formal Proofs of Hypergeometric Sums - Dedicated to the memory of Andrzej Trybulec.",
            "MizAR 40 for Mizar 40.",
            "Definitional Expansions in Mizar - In memoriam of Andrzej Trybulec, a pioneer of computerized formalization.",
            "Evidence Algorithm and Inference Search in First-Order Logics.",
            "Automating Boolean Set Operations in Mizar Proof Checking with the Aid of an External SAT Solver.",
            "Improving Legibility of Formal Proofs Based on the Close Reference Principle is NP-Hard.",
            "The Next 700 Challenge Problems for Reasoning with Higher-Order Abstract Syntax Representations - Part 2 - A Survey.",
            "Reverse Complexity.",
            "The Higher-Order Prover Leo-II."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2014",
        "info": "2014: Volumes 52, 53",
        "count": 28,
        "papers": [
            "Set Graphs. III. Proof Pearl: Claw-Free Graphs Mirrored into Transitive Hereditarily Finite Sets.",
            "Generalising Unit-Refutation Completeness and SLUR via Nested Input Resolution.",
            "Terminating Calculi for Propositional Dummett Logic with Subformula Property.",
            "The Reachability Problem in Constructive Geometric Constraint Solving Based Dynamic Geometry.",
            "Locales: A Module System for Mathematical Theories.",
            "Anti-unification for Unranked Terms and Hedges.",
            "Premise Selection for Mathematics by Corpus Analysis and Kernel Methods.",
            "Mechanizing Metatheory Without Typing Contexts.",
            "A Framework for the Verification of Certifying Computations.",
            "On Automation in the Verification of Software Barriers: Experience Report.",
            "Formally Verified Tableau-Based Reasoners for a Description Logic.",
            "Using Isabelle/HOL to Verify First-Order Relativity Theory.",
            "Array Theory of Bounded Elements and its Applications.",
            "A Goal-Directed Decision Procedure for Hybrid PDL.",
            "A Formalisation of the Myhill-Nerode Theorem Based on Regular Expressions.",
            "The Incredible ELK - From Polynomial Procedures to Efficient Reasoning with ℰℒ Ontologies.",
            "Formalization of Shannon's Theorems.",
            "Theorem of Three Circles in Coq.",
            "Proof Pearl: The KeY to Correct and Stable Sorting.",
            "Machine Learning for First-Order Theorem Proving - Learning to Select a Good Heuristic.",
            "Learning-Assisted Automated Reasoning with Flyspeck.",
            "Absorption for ABoxes.",
            "HermiT: An OWL 2 Reasoner.",
            "Implementing and Reasoning About Hash-consed Data Structures in Coq.",
            "Extended Decision Procedure for a Fragment of HL with Binders.",
            "A Complete Superposition Calculus for Primal Grammars.",
            "Reasoning with Nominal Schemas through Absorption.",
            "On the Formalization of Gamma Function in HOL."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2013",
        "info": "2013: Volumes 50, 51",
        "count": 37,
        "papers": [
            "Invariant-Free Clausal Temporal Resolution.",
            "Paramodulation with Non-Monotonic Orderings and Simplification.",
            "Case Splitting in an Automatic Theorem Prover for Real-Valued Special Functions.",
            "Formal Mathematics for Mathematicians - Foreward to the Special Issue.",
            "Eliciting Implicit Assumptions of Mizar Proofs by Property Omission.",
            "The GOEDEL Program.",
            "Custom Automations in Mizar.",
            "Formalization of Definitions and Theorems Related to an Elliptic Curve Over a Finite Prime Field by Using Mizar.",
            "The HOL Light Theory of Euclidean Space.",
            "The Mizar Mathematical Library in OMDoc: Translation and Applications.",
            "On Rewriting Rules in Mizar.",
            "On the Formalization of Theories.",
            "Methods of Lemma Extraction in Natural Deduction Proofs.",
            "ATP and Presentation Service for Mizar Formalizations.",
            "6 Years of SMT-COMP.",
            "Uncurrying for Termination and Complexity.",
            "Multi-Completion with Termination Tools.",
            "ExpTime Tableaux for ALC Using Sound Global Caching.",
            "A Two-Valued Logic for Properties of Strict Functional Programs Allowing Partial Functions.",
            "Wave Equation Numerical Resolution: A Comprehensive Mechanized Proof of a C Program.",
            "Preface: Special Issue of Selected Extended Papers of CADE-23.",
            "A Connection-based Characterization of Bi-intuitionistic Validity.",
            "Analyzing Innermost Runtime Complexity of Term Rewriting by Dependency Pairs.",
            "Reducing Higher-Order Theorem Proving to a Sequence of SAT Problems.",
            "Cutting to the Chase - Solving Linear Integer Arithmetic.",
            "Extending Sledgehammer with SMT Solvers.",
            "Contraction-Free Linear Depth Sequent Calculi for Intuitionistic Propositional Logic with the Subformula Property and Minimal Depth Counter-Models.",
            "Formalization of Bernstein Polynomials and Applications to Global Optimization.",
            "A Tableau Based Decision Procedure for an Expressive Fragment of Hybrid Logic with Binders, Converse and Global Modalities.",
            "Specification and Verification of Concurrent Programs Through Refinements.",
            "Non-Linear Rewrite Closure and Weak Normalization.",
            "SMELS: Satisfiability Modulo Equality with Lazy Superposition.",
            "Proof Pearl - A Mechanized Proof of GHC's Mergesort.",
            "Emptiness and Finiteness for Tree Automata with Global Reflexive Disequality Constraints.",
            "Finite-valued Semantics for Canonical Labelled Calculi.",
            "Finite Reasons for Safety - Parameterized Verification by Finite Model Finding.",
            "\"Decision Procedures: An Algorithmic Point of View, \" by Daniel Kroening and Ofer Strichman, Springer-Verlag, 2008."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2012",
        "info": "2012: Volumes 48, 49",
        "count": 37,
        "papers": [
            "A Decidability Result for the Model Checking of Infinite-State Systems.",
            "Hybrid - A Definitional Two-Level Approach to Reasoning with Higher-Order Abstract Syntax.",
            "SAT Modulo Linear Arithmetic for Solving Polynomial Constraints.",
            "Special Issue on Security and Rewriting Foreword.",
            "Unification Modulo Homomorphic Encryption.",
            "State and Progress in Strand Spaces: Proving Fair Exchange.",
            "Reducing Equational Theories for the Decision of Static Equivalence.",
            "Computing Knowledge in Security Protocols Under Convergent Equational Theories.",
            "Decidability of Equivalence of Symbolic Derivations.",
            "An Instantiation Scheme for Satisfiability Modulo Theories.",
            "E-unification with Constants vs. General E-unification.",
            "Dealing with Satisfiability and n-ary CSPs in a Logical Framework.",
            "Proof Pearl: A Formal Proof of Dally and Seitz' Necessary and Sufficient Condition for Deadlock-Free Routing in Interconnection Networks.",
            "Decidability and Combination Results for Two Notions of Knowledge in Security Protocols.",
            "The Area Method - A Recapitulation.",
            "A Family of Dynamic Description Logics for Representing and Reasoning About Actions.",
            "SAT Solving for Termination Proofs with Recursive Path Orders and Dependency Pairs.",
            "Proof Pearl: Regular Expression Equivalence and Relation Algebra.",
            "\"Handbook of Practical Logic and Automated Reasoning, \" by John R. Harrison, Cambridge University Press, 2009.",
            "Preface: Theory and Applications of Abstraction, Substitution and Naming.",
            "Encoding Abstract Syntax Without Fresh Names.",
            "Strongly Typed Term Representations in Coq.",
            "A Presheaf Environment for the Explicit Fusion Calculus.",
            "A Canonical Locally Named Representation of Binding.",
            "Formalizing Adequacy: A Case Study for Higher-order Abstract Syntax.",
            "A Two-Level Logic Approach to Reasoning About Computations.",
            "On Explicit Substitution with Names.",
            "Preface.",
            "A Solution to the PoplMark Challenge Using de Bruijn Indices in Isabelle/HOL.",
            "A Solution to the PoplMark Challenge Based on de Bruijn Indices.",
            "The Locally Nameless Representation.",
            "Nested Abstract Syntax in Coq.",
            "Formal Metatheory of Programming Languages in the Matita Interactive Theorem Prover.",
            "A List-Machine Benchmark for Mechanized Metatheory.",
            "Satisfiability Checking in Łukasiewicz Logic as Finite Constraint Satisfaction.",
            "PSPACE Tableau Algorithms for Acyclic Modalized $\\boldsymbol{\\mathcal{ALC}}$.",
            "Simulating Circuit-Level Simplifications on CNF."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2011",
        "info": "2011: Volumes 46, 47",
        "count": 32,
        "papers": [
            "Resolution with Order and Selection for Hybrid Logics.",
            "ABox Abduction in the Description Logic ALC.",
            "A Framework for Certified Boolean Branch-and-Bound Optimization.",
            "Portfolios in Stochastic Local Search: Efficiently Computing Most Probable Explanations in Bayesian Networks.",
            "Closed-Form Upper Bounds in Static Cost Analysis.",
            "A Polynomial Model for Logics with a Prime Power Number of Truth Values.",
            "Preface of Special Issue on \"Computer Security: Foundations and Automated Reasoning\".",
            "A Survey of Symbolic Methods in Computational Analysis of Cryptographic Systems.",
            "Automated Proofs for Asymmetric Encryption.",
            "Encoding Cryptographic Primitives in a Calculus with Polyadic Synchronisation.",
            "Reducing Protocol Analysis with XOR to the XOR-Free Case in the Horn Theory Based Approach.",
            "Multi-Attacker Protocol Validation.",
            "Collaborative Planning with Confidentiality.",
            "The Right Tools for the Job: Correctness of Cone of Influence Reduction Proved Using ACL2 and HOL4.",
            "Computationally Effective Reasoning About Goal Interactions.",
            "The Use of Embeddings to Provide a Clean Separation of Term and Annotation for Higher Order Rippling.",
            "Preface: Special Issue of Selected Extended Papers of CADE-22.",
            "Automated Inference of Finite Unsatisfiability.",
            "Proving Termination by Dependency Pairs and Inductive Theorem Proving.",
            "On Deciding Satisfiability by Theorem Proving with Speculative Inferences.",
            "A Combined Superposition and Model Evolution Calculus.",
            "Proof Pearl: a Formal Proof of Higman's Lemma in ACL2.",
            "Conjecture Synthesis for Inductive Theories.",
            "Formal Power Series.",
            "A Certified Proof of the Cartan Fixed Point Theorems.",
            "Preface: Special Issue of Selected Extended Papers of IJCAR 2010.",
            "An Interpolating Sequent Calculus for Quantifier-Free Presburger Arithmetic.",
            "Monotonicity Inference for Higher-Order Formulas.",
            "Classical Logic with Partial Functions.",
            "Tractable Extensions of the Description Logic ${\\mathcal{EL}}$ with Numerical Datatypes.",
            "Analytic Tableaux for Higher-Order Logic with Choice.",
            "Decreasing Diagrams and Relative Termination."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2010",
        "info": "2010: Volumes 44, 45",
        "count": 35,
        "papers": [
            "Preface.",
            "Geometry Constructions Language.",
            "Declarative Representation of Proof Terms.",
            "Procedural Representation of CIC Proof Terms.",
            "Crystal: Integrating Structured Queries into a Tactic Language.",
            "HOL-Boogie - An Interactive Prover-Backend for the Verifying C Compiler.",
            "Faster and More Complete Extended Static Checking for the Java Modeling Language.",
            "MetiTarski: An Automatic Theorem Prover for Real-Valued Special Functions.",
            "Towards Constructive DL for Abstraction and Refinement.",
            "Resolution is Cut-Free.",
            "On Modern Clause-Learning Satisfiability Solvers.",
            "Partial and Nested Recursive Function Definitions in Higher-order Logic.",
            "Incremental Classification of Description Logics Ontologies.",
            "BCDL\\boldsymbol {\\cal BC\\!D\\!L}: Basic Constructive Description Logic.",
            "Deciding Effectively Propositional Logic Using DPLL and Substitution Sets.",
            "Preface: Special Issue on Uncertain Reasoning.",
            "Preference Fusion for Default Reasoning Beyond System Z.",
            "Evolutionary Learning of Dynamic Naive Bayesian Classifiers.",
            "A New Default Theories Compilation for MSP-Entailment.",
            "The Unnormalized Dempster's Rule of Combination: A New Justification from the Least Commitment Principle and Some Extensions.",
            "Preface.",
            "Automata-Based Axiom Pinpointing.",
            "Quantitative Separation Logic and Programs with Lists.",
            "A Framework for Proof Systems.",
            "Linear Quantifier Elimination.",
            "Visually Dynamic Presentation of Proofs in Plane Geometry - Part 1. Basic Features and the Manual Input Method.",
            "Visually Dynamic Presentation of Proofs in Plane Geometry - Part 2. Automated Generation of Visually Dynamic Presentations with the Full-Angle Method and the Deductive Database Method.",
            "Equivariant Unification.",
            "A Formalization of the Knuth-Bendix(-Huet) Critical Pair Theorem.",
            "Tests and Proofs - Preface of the Special Issue.",
            "A Formal Logic Approach to Constrained Combinatorial Testing.",
            "Automated Flaw Detection in Algebraic Specifications.",
            "Using Bounded Model Checking for Coverage Analysis of Safety-Critical Software in an Industrial Setting.",
            "Reusing a JML Specification Dedicated to Verification for Testing, and Vice-Versa: Case Studies.",
            "Proof-Guided Test Selection from First-Order Specifications with Equality."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2009",
        "info": "2009: Volumes 42, 43",
        "count": 27,
        "papers": [
            "Performance Analysis and Functional Verification of the Stop-and-Wait Protocol in HOL.",
            "Computing Only Minimal Answers in Disjunctive Deductive Databases.",
            "Backdoor Sets of Quantified Boolean Formulas.",
            "First Order Stålmarck.",
            "Operating System Verification.",
            "Formal Verification of C Systems Code.",
            "Formal Memory Models for the Verification of Low-Level Operating-System Code.",
            "Model Checking Dynamic Memory Allocation in Operating Systems.",
            "Interprocedural and Flow-Sensitive Type Analysis for Memory and Type Safety of C Code.",
            "Certifying Low-Level Programs with Hardware Interrupts and Preemptive Threads.",
            "Proving Fairness and Implementation Correctness of a Microkernel Scheduler.",
            "Balancing the Load.",
            "Proof Pearl: Mechanizing the Textbook Proof of Huffman's Algorithm.",
            "An Intuitionistic Proof of a Discrete Form of the Jordan Curve Theorem Formalized in Coq with Combinatorial Hypermaps.",
            "On Process Equivalence = Equation Solving in CCS.",
            "Formalization and Implementation of Modern SAT Solvers.",
            "Optimal Length Resolution Refutations of Difference Constraint Systems.",
            "A Formalization of Powerlist Algebra in ACL2.",
            "KBO Orientability.",
            "On Protocols for the Automated Discovery of Theorems in Elementary Geometry.",
            "Computer Assisted Reasoning.",
            "Formalizing an Analytic Proof of the Prime Number Theorem.",
            "Mechanized Semantics for the Clight Subset of the C Language.",
            "Social Choice Theory in HOL.",
            "Rewriting Conversions Implemented with Continuations.",
            "The TPTP Problem Library and Associated Infrastructure.",
            "A Formally Verified Compiler Back-end."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2008",
        "info": "2008: Volumes 40, 41",
        "count": 28,
        "papers": [
            "Algorithms for Computing Minimal Unsatisfiable Subsets of Constraints.",
            "Translating Higher-Order Clauses to First-Order Clauses.",
            "On the Mechanization of the Proof of Hessenberg's Theorem in Coherent Logic.",
            "IJCAR Preface.",
            "A Resolution-Based Decision Procedure for SHOIQ.",
            "On Keys and Functional Dependencies as First-Class Citizens in Description Logics.",
            "A Logical Characterization of Forward and Backward Chaining in the Inverse Method.",
            "Connection Tableaux with Lazy Paramodulation.",
            "Matrix Interpretations for Proving Termination of Term Rewriting.",
            "Automatic Construction and Verification of Isotopy Invariants.",
            "A Mechanical Analysis of Program Verification Strategies.",
            "A Mechanized Proof of the Basic Perturbation Lemma.",
            "Rewriting with Equivalence Relations in ACL2.",
            "Tilting at Windmills with Coq: Formal Verification of a Compilation Algorithm for Parallel Moves.",
            "Nominal Techniques in Isabelle/HOL.",
            "A Resolution-Based Decision Procedure for SHOIQ.",
            "Formal Verification of a C-like Memory Model and Its Uses for Verifying Program Transformations.",
            "Proof Synthesis and Reflection for Linear Arithmetic.",
            "Data Complexity of Query Answering in Expressive Description Logics via Tableaux.",
            "On the Scalability of Description Logic Instance Retrieval.",
            "Differential Dynamic Logic for Hybrid Systems.",
            "Preface.",
            "Data Compression for Proof Replay.",
            "An Extensible Encoding of Object-oriented Data Models in hol.",
            "Automatic Symmetry Detection for Promela.",
            "Using Theorem Proving to Verify Expectation and Variance for Discrete Random Variables.",
            "Formal Models and Analysis of Secure Multicast in Wired and Wireless Networks.",
            "Assumption-Commitment Support for CSP Model Checking."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2007",
        "info": "2007: Volumes 38, 39",
        "count": 32,
        "papers": [
            "Preface.",
            "Liberalized Variable Splitting.",
            "A Sound Framework for delta-Rule Variants in Free-Variable Semantic Tableaux.",
            "Comparing Instance Generation Methods for Automated Reasoning.",
            "The Disconnection Tableau Calculus.",
            "Superposition-based Equality Handling for Analytic Tableaux.",
            "Efficient Query Processing with Reduced Implicate Tries.",
            "An Optimal Decision Procedure for Right Propositional Neighborhood Logic.",
            "Graph-based Decision for Gödel-Dummett Logics.",
            "A Tableau Algorithm for Description Logics with Concrete Domains and General TBoxes.",
            "The ILTP Problem Library for Intuitionistic Logic.",
            "Theory Extension in ACL2(r).",
            "Structures for Abstract Rewriting.",
            "A Decision Procedure for Linear \"Big O\" Equations.",
            "Reasoning about Object-based Calculi in (Co)Inductive Type Theory and the Theory of Contexts.",
            "Boolean Functions as Models for Quantified Boolean Formulas.",
            "General E -unification with Eager Variable Elimination and a Nice Cycle Rule.",
            "Special Issue on User Interfaces in Theorem Proving: Preface.",
            "User Interaction with the Matita Proof Assistant.",
            "Integrating Searching and Authoring in Mizar.",
            "A Graphical User Interface for Formal Proofs in Geometry.",
            "Student Proof Exercises Using MathsTiles and Isabelle/HOL in an Intelligent Book.",
            "Visualizing SAT Instances and Runs of the DPLL Algorithm.",
            "Preface to Special Issue on Reasoning in Description Logics.",
            "A Tableau Decision Procedure for SHOIQ.",
            "Optimizing Terminological Reasoning for Expressive Description Logics.",
            "Debugging Incoherent Terminologies.",
            "Reasoning in Description Logics by a Reduction to Disjunctive Datalog.",
            "Tractable Reasoning and Efficient Query Answering in Description Logics: The DL-Lite Family.",
            "Automated Theorem Proving in Euler Diagram Systems.",
            "Inferring Phylogenetic Trees Using Answer Set Programming.",
            "Expression Reduction Systems with Patterns."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2006",
        "info": "2006: Volumes 36, 37",
        "count": 29,
        "papers": [
            "Automated Reasoning for Security Protocol Analysis.",
            "Verifying the SET Purchase Protocols.",
            "Formal Analysis of Multiparty Contract Signing.",
            "Decision Procedures for the Security of Protocols with Probabilistic Encryption against Offline Dictionary Attacks.",
            "Decidability Issues for Extended Ping-Pong Protocols.",
            "Attacking Group Protocols by Refuting Incorrect Inductive Conjectures.",
            "Predicting and Detecting Symmetries in FOL Finite Model Search.",
            "Deciding Boolean Algebra with Presburger Arithmetic.",
            "Searching for Shortest Single Axioms for Groups of Exponent 6.",
            "Explaining Gabriel-Zisman Localization to the Computer.",
            "Empirically Successful Automated Reasoning: Systems Issue.",
            "Things to Know when Implementing KBO.",
            "Mathematical Induction in Otter-Lambda.",
            "Answer Set Programming Based on Propositional Satisfiability.",
            "An Integrated Approach to High Integrity Software Verification.",
            "Empirically Successful Automated Reasoning: Applications Issue.",
            "Axiomatizing the Skew Boolean Propositional Calculus.",
            "MPTP 0.2: Design, Implementation, and Initial Experiments.",
            "Checking Consistency and Completeness of On-Line Product Manuals.",
            "Formal Correctness of a Quadratic Unification Algorithm.",
            "A Framework for Verifying Bit-Level Pipelined Machines Based on Automated Deduction and Decision Procedures.",
            "Verification of FPGA Layout Generators in Higher-Order Logic.",
            "Third Special Issue on Techniques for Automated Termination Proofs.",
            "Mechanizing and Improving Dependency Pairs.",
            "Elimination Transformations for Associative-Commutative Rewriting Systems.",
            "Some Computational Aspects of distance-sat.",
            "An Efficient Approach to Solving Random k-satProblems.",
            "The Calculus of Relations as a Foundation for Mathematics.",
            "Tree Tuple Languages from the Logic Programming Point of View."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2005",
        "info": "2005: Volumes 34, 35",
        "count": 32,
        "papers": [
            "Combining Sets with Cardinals.",
            "An Effective Algorithm for the Futile Questioning Problem.",
            "A Tableau-Based Decision Procedure for a Fragment of Set Theory with Iterated Membership.",
            "A Parallelization Scheme Based on Work Stealing for a Class of SAT Solvers.",
            "Preface.",
            "Termination of String Rewriting Proved Automatically.",
            "Termination of Floating-Point Computations.",
            "Verifying Termination and Reduction Properties about Higher-Order Logic Programs.",
            "Combining Nonstably Infinite Theories.",
            "Simplifying Proofs in Fitch-Style Natural Deduction Systems.",
            "First-Order Temporal Verification in Practice.",
            "Preface.",
            "Mechanically Proving Termination Using Polynomial Interpretations.",
            "Termination Proofs for String Rewriting Systems via Inverse Match-Bounds.",
            "Ordinal Arithmetic: Algorithms and Mechanization.",
            "Satisfiability in the Year 2005.",
            "Heuristic-Based Backtracking Relaxation for Propositional Satisfiability.",
            "Symbolic Techniques in Satisfiability Solving.",
            "Exponential Lower Bounds for the Running Time of DPLL Algorithms on Satisfiable Formulas.",
            "Backdoor Sets for DLL Subsolvers.",
            "The Complexity of Pure Literal Elimination.",
            "Clause Weighting Local Search for SAT.",
            "Solving Non-Boolean Satisfiability Problems with Stochastic Local Search: A Comparison of Encodings.",
            "Regular Random k-SAT: Properties of Balanced Formulas.",
            "Applying SAT Solving in Classification of Finite Algebras.",
            "The SAT-based Approach to Separation Logic.",
            "MathSAT: Tight Integration of SAT and Mathematical Decision Procedures.",
            "Tool-Assisted Specification and Verification of Typed Low-Level Languages.",
            "Toward Automating the Discovery of Decreasing Measures.",
            "Design and Results of the First Satisfiability Modulo Theories Competition (SMT-COMP 2005).",
            "Some Techniques for Proving Termination of the Hyperresolution Calculus.",
            "\"Rippling: Meta-Level Guidance for Mathematical Reasoning, \" by Alan Bundy, David Basin, Dieter Hutter, and Andrew Ireland, Cambridge University Press, 2005."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2004",
        "info": "2004: Volumes 32, 33",
        "count": 27,
        "papers": [
            "Preface.",
            "GRAMY: A Geometry Theorem Prover Capable of Construction.",
            "Verification in the Classroom.",
            "ETPS: A System to Help Students Write Formal Proofs.",
            "Knowledge Compilation Using the Extension Rule.",
            "Fast Term Indexing with Coded Context Trees.",
            "A Matrix Characterization for Multiplicative Exponential Linear Logic.",
            "Top-Down Query Processing in First-Order Deductive Databases under the DWFS.",
            "Preface.",
            "Abductive Theorem Proving for Analyzing Student Explanations to Guide Feedback in Intelligent Tutoring Systems.",
            "A Proof Environment for Teaching Mathematics.",
            "Living Book - Deduction, Slicing, and Interaction.",
            "Obituary of Harald Ganzinger.",
            "Formal Verification of a Generic Framework to Synthetize SAT-Provers.",
            "Modular & Incremental Automated Termination Proofs.",
            "Unification Modulo ACUI Plus Distributivity Axioms.",
            "Organizing Numerical Theories Using Axiomatic Type Classes.",
            "Constraint Solving for Proof Planning.",
            "Choices in Representation and Reduction Strategies for Lambda Terms in Intensional Contexts.",
            "Representing and Building Models for Decidable Subclasses of Equational Clausal Logic.",
            "Octopus: Combining Learning and Parallel Search.",
            "Preface.",
            "Model-Theoretic Methods in Combined Constraint Satisfiability.",
            "A Decision Procedure for a Sublanguage of Set Theory Involving Monotone, Additive, and Multiplicative Functions, I: The Two-Level Case.",
            "On the Complexity of Deduction Modulo Leaf Permutative Equations.",
            "MPTP - Motivation, Implementation, First Experiments.",
            "Reachability Analysis over Term Rewriting Systems."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2003",
        "info": "2003: Volumes 30, 31",
        "count": 29,
        "papers": [
            "Cooperation of Background Reasoners in Theory Reasoning by Residue Sharing.",
            "Modifying LOTOS Specifications by Means of Automatable Formula-Based Integrations.",
            "Formalizing Strong Normalization Proofs of Explicit Substitution Calculi in ALF.",
            "Paramodulation and Knuth-Bendix Completion with Nontotal and Nonmonotonic Orderings.",
            "Proof-Search in Intuitionistic Logic with Equality, or Back to Simultaneous Rigid E-Unification.",
            "Mechanical Verification of an Ideal Incremental ABR Conformance Algorithm.",
            "The Strategy of Cramming.",
            "A Branching Time Temporal Framework for Quantitative Reasoning.",
            "Java Bytecode Verification.",
            "Java Bytecode Verification: Algorithms and Formalizations.",
            "A Type System for the Java Bytecode Language and Verifier.",
            "Completeness of a Bytecode Verifier and a Certifying Java-to-JVM Compiler.",
            "Verified Bytecode Subroutines.",
            "Bytecode Verification by Model Checking.",
            "A Shortest 2-Basis for Boolean Algebra in Terms of the Sheffer Stroke.",
            "Theorem Proving Based on the Extension Rule.",
            "The CADE-18 ATP System Competition.",
            "Theorem Proving Modulo.",
            "From Bisimulation to Simulation: Coarsest Partition Problems.",
            "Announcement.",
            "Partial Functions in ACL2.",
            "Abstract Congruence Closure.",
            "Herbrand Award Acceptance Speech.",
            "Preface.",
            "A Syntactic Approach to Foundational Proof-Carrying Code.",
            "A Trustworthy Proof Checker.",
            "Heap-Bounded Assembly Language.",
            "Lightweight Bytecode Verification.",
            "Trust and Partial Typing in Open Systems of Mobile Agents."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2002",
        "info": "2002: Volumes 28, 29",
        "count": 33,
        "papers": [
            "Duality for Goal-Driven Query Processing in Disjunctive Deductive Databases.",
            "Single Elementary Associative-Commutative Matching.",
            "SLT-Resolution for the Well-Founded Semantics.",
            "Satisfiability in the Year 2000.",
            "An Algorithm to Evaluate Quantified Boolean Formulae and Its Experimental Evaluation.",
            "SAT-Based Decision Procedures for Classical Modal Logics.",
            "Evaluating Optimized Decision Procedures for Propositional Modal K(m) Satisfiability.",
            "Using Resolution for Testing Modal Satisfiability and Building Models.",
            "A Completion Procedure for Finitely Presented Groups That Is Based on Word Cycles.",
            "A General Setting for Flexibly Combining and Augmenting Decision Procedures.",
            "The IJCAR ATP System Competition.",
            "Autarkic Computations in Formal Proofs.",
            "Checking Simple Properties of Transition Systems Defined by Thue Specifications.",
            "Partial Instantiation Methods for Inference in First-Order Logic.",
            "Alternative Translation Techniques for Propositional and First-Order Modal Logics.",
            "Proving Unsatisfiability of CNFs Locally.",
            "Short Single Axioms for Boolean Algebra.",
            "Ordered Semantic Hyper Tableaux.",
            "More Proofs of an Axiom of Lukasiewicz.",
            "Hilbert's Twenty-Fourth Problem.",
            "Mathematical Programming Embeddings of Logic.",
            "Vanquishing the XCB Question: The Methodological Discovery of the Last Shortest Single Axiom for the Equivalential Calculus.",
            "Inferring from Inconsistency in Preference-Based Argumentation Frameworks.",
            "Unification Types of Completely Regular Semigroups.",
            "Special Issue Mechanizing and Automating Mathematics: In honour of N.G. de Bruijn - Preface.",
            "A Compendium of Continuous Lattices in MIZAR.",
            "A Proof of GMP Square Root.",
            "Automated Proof Construction in Type Theory Using Resolution.",
            "Proof Reflection in Coq.",
            "External Rewriting for Skeptical Proof Assistants.",
            "Algorithms and Proofs Inheritancey in the FOC Language.",
            "A New Implementation of Automath.",
            "A Comparison of Mizar and Isar."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2001",
        "info": "2001: Volumes 26, 27",
        "count": 31,
        "papers": [
            "Induction Proofs with Partial Functions.",
            "More Church-Rosser Proofs.",
            "Parallelization of a Hyper-Linking-Based Theorem Prover.",
            "A Machine-Checked Implementation of Buchberger's Algorithm.",
            "Computer-Aided Construction of Finite Geometric Spaces: Automated Verification of Geometric Constraints.",
            "Structured Theory Development for a Mechanized Logic.",
            "The Warshall Algorithm and Dickson's Lemma: Two Examples of Realistic Program Extraction.",
            "General Algorithms for Permutations in Equational Inference.",
            "STMM: A Set Theory for Mechanized Mathematics.",
            "Reasoning Theories.",
            "On the Computation of the Disjunctive Well-Founded Semantics.",
            "The Watson Theorem Prover.",
            "Semi-Thue Systems with an Inhibitor.",
            "Current Trends in Logical Frameworks and Metalanguages.",
            "An Implementation of LF with Coercive Subtyping & Universes.",
            "A Calculus of Lambda Calculus Contexts.",
            "Studies of a Theory of Specifications with Built-in Program Extraction.",
            "A Milestone Reached and a Secret Revealed.",
            "A Legacy Recalled and a Tradition Continued.",
            "Finding Shortest Proofs: An Application of Linked Inference Rules.",
            "Distributivity in [Lstrok][aleph]0 and Other Sentential Logics.",
            "Solving Open Questions and Other Challenge Problems Using Proof Sketches.",
            "Conquering the Meredith Single Axiom.",
            "Missing Proofs Found.",
            "The CADE-17 ATP System Competition.",
            "Stochastic Boolean Satisfiability.",
            "An O(nlog n)-SPACE Decision Procedure for the Propositional Dummett Logic.",
            "I-SATCHMO: An Improvement of SATCHMO.",
            "Nonstandard Analysis in ACL2.",
            "An Algorithm for Dual Transformation in First-Order Logic.",
            "Resolution for Skeptical Stable Model Semantics."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "2000",
        "info": "2000: Volumes 24, 25",
        "count": 26,
        "papers": [
            "Satisfiability in the Year 2000.",
            "A SAT Solver Using Reconfigurable Hardware and Virtual Logic.",
            "Relaxations of the Satisfiability Problem Using Semidefinite Programming.",
            "Heavy-Tailed Phenomena in Satisfiability and Constraint Satisfaction Problems.",
            "The Propositional Formula Checker HeerHugo.",
            "SAT Local Search Algorithms: Worst-Case Study.",
            "Proving Consistency Assertions for Automotive Product Data Management.",
            "Logical Cryptanalysis as a SAT Problem.",
            "Guided Local Search for Solving SAT and Weighted MAX-SAT Problems.",
            "Resolution versus Search: Two Strategies for SAT.",
            "Implementing the Davis-Putnam Method.",
            "A Benchmark Method for the Propositional Modal Logics K, KT, S4.",
            "Single Step Tableaux for Modal Logics.",
            "A Hyperbase for Binary Lattice Hyperidentities.",
            "The CADE-16 ATP System Competition.",
            "New Worst-Case Upper Bounds for SAT.",
            "Local Search Algorithms for SAT: An Empirical Evaluation.",
            "Nonsystematic Search and No-Good Learning.",
            "Efficient Algorithms to Detect and Restore Minimality, an Extension of the Regular Restriction of Resolution.",
            "Positive Unit Hyperresolution Tableaux and Their Application to Minimal Model Generation.",
            "Vectorial Equations Solving for Mechanical Geometry Theorem Proving.",
            "Managing Structural Information by Higher-Order Colored Unification.",
            "Ordered Semantic Hyper-Linking.",
            "A Deductive Database Approach to Automated Geometry Theorem Proving and Discovering.",
            "Evaluation of Queries under Closed-World Assumption. Part II: The Hierarchical Case.",
            "Reasoning about Qualitative Spatial Relationships."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1999",
        "info": "1999: Volumes 22, 23",
        "count": 30,
        "papers": [
            "The Hot List Strategy.",
            "An Algorithm for General Set Unification and Its Complexity.",
            "Recursive Program Optimization Through Inductive Synthesis Proof Transformation.",
            "Analogy in Inductive Theorem Proving.",
            "An Efficient Algorithm to Generate Prime Implicants.",
            "Metalogical Frameworks II: Developing a Reflected Decision Procedure.",
            "Triple Dots in a Formal Language.",
            "Reasoning about Solids Using Constraint Logic Programming.",
            "A Model-Theoretic Approach for Recovering Consistent Data from Inconsistent Knowledge Bases.",
            "Computer Proofs in Gödel's Class Theory with Equational Definitions for Composite and Cross.",
            "On Computer-Assisted Proofs in Ordinal Number Theory.",
            "Decidability by Resolution for Propositional Modal Logics.",
            "SPS-Parallelism + SETHEO = SPTHEO.",
            "T-Resolution: Refinements and Model Elimination.",
            "The CADE-15 ATP System Competition.",
            "Completion for Multiple Reduction Orderings.",
            "The Tail-Recursive SECD Machine.",
            "Automatic Discovery of Theorems in Elementary Geometry.",
            "Separability of Polyhedra for Optimal Filtering of Spatial and Constraint Data.",
            "Computational Complexity of Simultaneous Elementary Matching Problems.",
            "Autarky Pruning in Propositional Model Elimination Reduces Failure Redundancy.",
            "On Equivalents of Well-Foundedness.",
            "A Formal Proof of Sylow's Theorem.",
            "Formal Verification of a Partial-Order Reduction Technique for Model Checking.",
            "Type Inference Verified: Algorithm W in Isabelle/HOL.",
            "Certification of a Type Inference Tool for ML: Damas-Milner within Coq.",
            "A Full Formalization of SLD-Resolution in the Calculus of Inductive Constructions.",
            "Some Lambda Calculus and Type Theory Formalized.",
            "Formalizing Synthetic Domain Theory.",
            "A Mechanization of Unity in PC-NQTHM-92."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1998",
        "info": "1998: Volumes 20, 21",
        "count": 29,
        "papers": [
            "Preface: Logics for Artificial Intelligence.",
            "An Algorithm for the Retrieval of Unifiers from Discrimination Trees.",
            "Semantic Generalizations for Proving and Disproving Conjectures by Analogy.",
            "What You Always Wanted to Know about Rigid E-Unification.",
            "Strategies in Model-Based Diagnosis.",
            "'Classical' Negation in Nonmonotonic Reasoning and Logic Programming.",
            "Characterizations of the Disjunctive Well-Founded Semantics: Confluent Calculi and Iterated GCWA.",
            "Informational Logic as a Tool for Automated Reasoning.",
            "Signed Systems for Paraconsistent Reasoning.",
            "Subgoal Strategies for Solving Board Puzzles.",
            "The Heine-Borel Challenge Problem. In Honor of Woody Bledsoe.",
            "Shortest Single Axioms for the Equivalential Calculus with CD and RCD.",
            "Elimination of Self-Resolving Clauses.",
            "Automated Deduction Techniques for Classification in Description Logic Systems.",
            "Triviality and Dimension of a System of Algebraic Differential Equations.",
            "Clifford Algebraic Reduction Method for Automated Theorem Proving in Differential Geometry.",
            "Testing Positiveness of Polynomials.",
            "A Framework for Automated Reasoning in Multiple-Valued Logics.",
            "Nonconstructive Computational Mathematics.",
            "The CADE-14 ATP System Competition.",
            "Automating the Search for Elegant Proofs.",
            "The TPTP Problem Library - CNF Release v1.2.1.",
            "Proof Search in Intuitionistic Logic with Equality, or Back to Simultaneous Rigid E-Unification.",
            "Automated Synthesis of Recursive Programs from a forall-exists Logical Specification.",
            "A Skeptic's Approach to Combining HOL and Maple.",
            "Analytica - An Experiment in Combining Theorem Proving and Symbolic Computation.",
            "Integrating Computer Algebra into Proof Planning.",
            "A New Approach for Automatic Theorem Proving in Real Geometry.",
            "Well-Behaved Inference Rules for First-Order Theorem Proving."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1997",
        "info": "1997: Volumes 18, 19",
        "count": 41,
        "papers": [
            "A Tribute to Woody Bledsoe.",
            "A New Probabilistic Induction Method.",
            "A Correct Logic Programming Computation of Default Logic Extensions.",
            "Fast Subsumption Checks Using Anti-Links.",
            "Partial Functions in a Total Setting.",
            "Unification Algorithms for Eliminating and Introducing Quantifiers in Natural Deduction Automated Theorem Proving.",
            "An Erratum for Some Errata to ATP Problems.",
            "The CADE-13 ATP System Competition.",
            "The Design of the CADE-13 ATP System Competition.",
            "The Procedures of the CADE-13 ATP System Competition.",
            "Barcelona.",
            "CLIN-E - Smallest Instance First Hyper-Linking.",
            "CLIN-S - A Semantically Guided First-Order Theorem Prover.",
            "DISCOUNT - A Distributed and Learning Equational Prover.",
            "Gandalf.",
            "LINUS - A Link Instantion Prover with Unit Support.",
            "Otter - The CADE-13 Competition Incarnations.",
            "RRTP - A Replacement Rule Theorem Prover.",
            "Satchmo - The Compiling and Functional Variants.",
            "SETHEO and E-SETHEO - The CADE-13 Systems.",
            "SPASS - Version 0.49.",
            "SPTHEO - A Parallel Theorem Prover.",
            "Violet.",
            "WALDMEISTER - High-Performance Equational Deduction.",
            "The Results - of the CADE-13 ATP System Competition.",
            "Conclusions about the CADE-13 ATP System Competition.",
            "Computing Circumscription Revisited: A Reduction Algorithm.",
            "CNF and DNF Considered Harmful for Computing Prime Implicants/Implicates.",
            "Evaluation of Queries under Closed-World Assumption.",
            "Coloring Terms to Control Equational Reasoning.",
            "Termination of Nested and Mutually Recursive Algorithms.",
            "Deduction Trees and the View Update Problem in Indefinite Deductive Databases.",
            "Single Versus Simultaneous Equational Unification and Equational Unification for Variable-Permuting Theories.",
            "The Use of Lemmas in the Model Elimination Procedure.",
            "Toupie: The µ-calculus over Finite Domains as a Constraint Language.",
            "Structuring Resolution Proofs by Introducing New Lemmata.",
            "A Disjunctive Positive Refinement of Model Elimination and its Application to Subsumption Deletion.",
            "Solution of the Robbins Problem.",
            "A New Technique for Verifying and Correcting Logic Programs.",
            "Abstract Proof Checking: An Example Motivated by an Incompleteness Theorem.",
            "Nagging: A Distributed, Adversarial Search-Pruning Technique Applied to First-Order Inference."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1996",
        "info": "1996: Volumes 16, 17",
        "count": 25,
        "papers": [
            "Induction Using Term Orders.",
            "New Uses of Linear Arithmetic in Automated Theorem Proving by Induction.",
            "Productive Use of Failure in Inductive Proof.",
            "Middle-Out Reasoning for Synthesis and Induction.",
            "A Calculus for and Termination of Rippling.",
            "Interaction with the Boyer-Moore Theorem Prover: A Tutorial Study Using the Arithmetic-Geometric Mean Theorem.",
            "Using Hints to Increase the Effectiveness of an Automated Reasoning Program: Case Studies.",
            "Linear and Unit-Resulting Refutations for Horn Theories.",
            "TPS: A Theorem-Proving System for Classical Type Theory.",
            "On the Completeness of Incidence Calculus.",
            "A Type-Theoretic Interpretation of Constructive Domain Theory.",
            "Constructing Finite Algebras with FALCON.",
            "The Power of Combining Resonance with Heat.",
            "The Semantics of Answer Literals.",
            "A Simple and Efficient Boolean Solver for Constraint Logic Programming.",
            "Any Ground Associative-Commutative Theory Has a Finite Canonical System.",
            "Some Group Theoretic Examples with Completion Theorem Provers.",
            "Model Theoretic Approach to View Updates in Deductive Databases.",
            "On the Completeness of SLDENF-Resolution.",
            "OTTER and the Moufang Identity Problem.",
            "On Computing Logic Programs.",
            "Mechanizing Set Theory.",
            "Automated Generation of Readable Proofs with Geometric Invariants I. Multiple and Shortest Proof Generation.",
            "Automated Generation of Readable Proofs with Geometric Invariants.",
            "Nicolog: A Simple Yet Powerful cc(FD) Language."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1995",
        "info": "1995: Volumes 14, 15",
        "count": 27,
        "papers": [
            "Preface to the Special Issue on Commonsense and Nonmonotonic Reasoning.",
            "A Decision Method for Nonmonotonic Reasoning Based on Autoepistemic Reasoning.",
            "Modality and Interrupts.",
            "A Logic Programming System for Nonmonotonic Reasoning.",
            "Embedding Defaults into Terminological Knowledge Representation Formalisms.",
            "Implicit Induction in Conditional Theories.",
            "Theorem Proving for Intensional Logic.",
            "Automated Production of Traditional Proofs in Solid Geometry.",
            "A Path Ordering for Proving Termination of AC Rewrite Systems.",
            "On the Complexity of Nested-Object Matching.",
            "SATCHMORE: SATCHMO with REIevancy.",
            "Logic, Topology, and Integration.",
            "Single Axioms for Odd Exponent Groups.",
            "OTTER Experiments in a System of Combinatory Logic.",
            "Identification of Inductive Properties during Verification of Synchronous Sequential Circuits.",
            "Default Reasoning by Deductive Planning.",
            "Priorities on Defaults with Prerequisites, and Their Application in Treating Specificity in Terminological Default Logic.",
            "Mechanical Verification of Strategies.",
            "A New Methodology for Query Answering in Default Logics via Structure-Oriented Theorem Proving.",
            "Set Theory for Verification. II: Induction and Recursion.",
            "A Ramsey Theorem in Boyer-Moore Logic.",
            "The Anatomy of Vampire Implementing Bottom-up Procedures with Code Trees.",
            "A Note on Assumptions about Skolem Functions.",
            "Searching for Circles of Pure Proofs.",
            "A Set-Theoretic Translation Method for Polymodal Logics.",
            "leanTAP: Lean Tableau-based Deduction.",
            "Branching Rules for Satisfiability."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1994",
        "info": "1994: Volumes 12, 13",
        "count": 34,
        "papers": [
            "Resolving Contradictions: A Plausible Semantics for Inconsistent Systems.",
            "Introduction to the OBDD Algorithm for the ATP Community.",
            "TMPR: A Tree-Structured Modified Problem Reduction Proof Procedure and Its Extension to Three - Valued Logic.",
            "Tractability Through Symmetries in Propositional Calculus.",
            "Resolution Theorem Proving in Reified Modal Logics.",
            "Formula Databases for High-Performance Resolution/Paramodulation Systems.",
            "A Model-Based Belief Revision System.",
            "Unification in partially commutative semigroups.",
            "On subsumption in distributed derivations.",
            "The Rue Theorem-Proving System: The Complete Set if LIM+ Challenge Problems.",
            "The problem of hyperparamodulation.",
            "Proof Sytrategies in Linear Logic.",
            "A Semantics for a Class of Non-Deterministic and Causal Production System Programs.",
            "An Extension of a Procedure to Prove Statements in Differential Geometry.",
            "Improving the Efficiency of a Hyperlinking-Based Theorem Prover by Incremental Evaluation with Network Structures.",
            "Reduction and Unification in Lambda Calculi with a General Notion of Subtype.",
            "Parallelization of Deduction Strategies: An Analytical Study.",
            "Autoepistemic Logic Programming.",
            "Autoepistemic Logic of First Order and Its Expressive Power.",
            "On the Termination of Clause Graph Resolution.",
            "Ordered Model Trees: A Normal Form for Disjunctive Deductive Databases.",
            "An Alternative Approach to the Semantics of Disjunctive Logic Programs and Deductive Databases.",
            "Tableaux for Logic Programming.",
            "Upside-Down Meta-Interpretation of the Model Elimination Theorem-Proving Procedure for Deduction and Abduction.",
            "The Liberalized delta-Rule in Free Variable Semantic Tableaux.",
            "Tableaux-Based Characterization and Theorem Proving for default Logic.",
            "A Generalization of Analytic Deduction via Labelled Deductive Systems. Part I: Basic Substructural Logics.",
            "Meteor: Exploring Model Elimination Theorem Proving.",
            "Cotrolled Integration of the Cut Rule into Connection Tableaux Calculi.",
            "Model Elimination Without Contrapositives and Its Application to PTTP.",
            "An Improved Refutation System for Intuitionistic Predicate Logic.",
            "A Tableaux Prover for Domain Minimization.",
            "The Saturated Tableaux for Linear Miniscoped Horn-like Temporal Logic.",
            "Tableaux-based Theorem Provers: Systems and Implementations."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1993",
        "info": "1993: Volumes 10, 11",
        "count": 39,
        "papers": [
            "Single Axioms for Groups and Abelian Groups with Various Operations.",
            "Experimenting with Isabelle in ZF Set Theory.",
            "Fuzzy Operator Logic and Fuzzy Resolution.",
            "What Holds in a Context?",
            "Flatterms, Discrimination Nets, and Fast Term Rewriting.",
            "Simplification in a Satisfiability Checker for VLSI Applications.",
            "The Problem of Automated Theorem Finding.",
            "Autoepistemic Circumscription and Logic Programming.",
            "Automated Reasoning in Differential Geometry and Mechanics Using the Characteristic Set Method. Part I. An Improved Version of Ritt-Wu's Decomposition Algorithm.",
            "Automated Reasoning in Differential Geometry and Mechanics Using the Characteristic Set Method. Part II. Mechanical Theorem Proving.",
            "A Semantical Framework for Supporting Subjective and Conditional Probabilities in Deductive Databases.",
            "First -Order Syntactic Characterizations of Minimal Entailment, Domain-Minimal Entailment, and Herbrand Entailment.",
            "Gentzen-Type Systems, Resolution and Tableaux.",
            "The Problem of Selecting an Approach Based on Prior Success.",
            "The Kernel Strategy and Its Use for the Study of Combinatory Logic.",
            "Interpreting Disjunctive Logic Programs Based on a Strong Sense of Disjunction.",
            "Completeness Issues in RUE-NRF Deduction: The Undecidability of Viability.",
            "Simplification Orderings: Putting Them to the Test.",
            "Dualities Between Alternative Semantics for Logic Programming and Nonmonotonic Reasoning.",
            "The Problem of Reasoning by Analogy.",
            "Backchain Iteration: Towards a Practical Inference Method That Is Simple Enough to Be Proved Terminating, Sound, and Complete.",
            "The Inevitability of Inconsistent Abstract Spaces.",
            "Implementing Tactics and Tacticals in a Higher-Order Logic Programming Language.",
            "Bounded-Overhead Caching for Definite-Clause Theorem Proving.",
            "A Proof Procedure for the Logic of Hereditary Harrop Formulas.",
            "The Problem of Naming and Function Replacement.",
            "Wort Unification and Transformation of Generalized Equations.",
            "Competing for the AC-Unification Race.",
            "IMPS: An Interactive Mathematical Proof System.",
            "View Updates in Stratified Disjunctive Databases.",
            "Inference Flexibility in Horn Clause Knowledge Bases and the Simplex Method.",
            "The Problem of Reasoning by Case Analysis.",
            "Set-Var.",
            "The CADE-11 Competitions: A Personal View.",
            "Uniform Strategies: The CADE-11 Theorem Proving Contest.",
            "Automated Proofs of Equality Problems in Overbeek's Competition.",
            "Set Theory for Verification: I. From Foundations to Functions.",
            "Z-Match: An Inference Rule for Incrementally Elaborating Set Instantiations.",
            "The Problem of Induction."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1992",
        "info": "1992: Volumes 8, 9",
        "count": 38,
        "papers": [
            "A Mechanical Proof of Quadratic Reciprocity.",
            "Exploitation of Parallel Processing for Implementing High-Performance Deduction Systems.",
            "A Technical Note on AC-Unification. The Number of Minimal Unifiers of the Equation alpha x1 + . . . + alpha xp =AC beta y1 + . . . + beta yq.",
            "Completeness of a Prover for Dense Linear Orders.",
            "An Inexact Reasoning Algorithm Based on Fuzzy Rule Matrix Transformations.",
            "Automated Deduction in von Neumann-Bernays-Gödel Set Theory.",
            "PARTHENON: A Parallel Theorem Prover for Non-Horn Clauses.",
            "SETHEO: A High-Performance Theorem Prover.",
            "The Linked Inference Principle, I: The Formal Treatment.",
            "An Integral Theorem Prover And The Role Of Proof Planning.",
            "SLDNF-Resolution with Equality.",
            "The Problem of Choosing between Using and Avoiding Eqyality Predicates.",
            "Gazing: An Approach to the Problem of Definition and Lemma Use.",
            "Stable and Extension Class Theory for Logic Programs and Default Logics.",
            "Comparing Parameter Schemes for Propositional Reasoning: An Empirical Study.",
            "Automatically Identifying the Asymptotic Behavior of Nonlinear Singularly Perturbed Boundary Value Problems.",
            "The Problem of Reasoning from Inequalities.",
            "Automated Discovery of New Axiomatizations of the Left Group and Right Group Calculi.",
            "Eliminating Duplication with the Hyper-Linking Strategy.",
            "Recognizing Unnecessary Clauses in Resolution Based Systems.",
            "How to Avoid the Derivation of Redundant Clauses in Reasoning Systems.",
            "Tableaux and Sequent Calculus for Minimal Entailment.",
            "The Problem of Demodulation During Inference Rule Application.",
            "Note on McCune's Article on Discrimination Trees.",
            "Experiments with Discrimination-Tree Indexing and Path Indexing for Term Retrieval.",
            "Hilbert's Tenth Problem is of Unification Type Zero.",
            "A Logic for Reasoning with Inconsistency.",
            "Uncertainty Management with Imprecise Knowledge with Application to Design.",
            "CLP(R) and Some Electrical Engineering Problems.",
            "Complexity of Unification Problems with Associative-Commutative Operators.",
            "The Problem of Demodulator Adjunction.",
            "Single Axioms for Groups.",
            "Using Typed Lambda Calculus to Implement Formal Systems on a Machine.",
            "An Extension of the Boyer-Moore Theorem Prover to Support First-Order Quantification.",
            "On Fourier's Algorithm for Linear Arithmetic Constraints.",
            "A Note on the Parallel Complexity of Anti-Unification.",
            "Efficient Parallel Term Matching and Anti-Unification.",
            "The Problem of Demodulating Across Argument and Literal Boundaries."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1991",
        "info": "1991: Volume 7",
        "count": 31,
        "papers": [
            "Near-Horn Prolog and Beyond.",
            "Inductive Expansion: A Calculus for Verifying and Synthesizing Functional and Logic Programs.",
            "The Problem of Finding a Restriction Strategy More Effective Than the Set of Support Strategy.",
            "Generalization in the Presence of Free Variables: A Mechanically-Checked Correctness Proof for one Algorithm.",
            "Mechanical Theorem Proving of Differential Geometries and Some of its Applications in Mechanics.",
            "Decision Procedures for Elementary Sublanguages of Set Theory: X. Multilevel Syllogistic Extended by the Singleton and Powerset Operators.",
            "Decision Procedures for Elementary Sublanguages of Set Theory: XI. Multilevel Syllogistic Extended by Some Elementary Map Constructs.",
            "Decision Procedures for Elementary Sublanguages of Set Theory: XII. Multilevel Syllogistic Extended with Singleton and Choice Operators.",
            "Decision Procedures for Elementary Sublanguages of Set Theory: XIII. Model Graphs, Reflection and Decidability.",
            "More on the Problem of Finding a Mapping between Clause Representation and Natural Deduction Representation.",
            "Unsolved Problems in Elementary Number Theory.",
            "Experiments with Proof Plans for Induction.",
            "Optimizing the Clausal Normal Form Transformation.",
            "Compiling Bottom-up and Mixed Derivations into Top-down Executable Logic Programs.",
            "Generating Relevant Models.",
            "The Unification Hierarchy is Undecidable.",
            "Programming in Temporal-Nonmonotonic Reasoning.",
            "Pattern-Directed Invocation with Changing Equations.",
            "The Problem of Choosing the Type of Subsumption to Use.",
            "Proving Matijasevich's Lemma with a Default Arithmetic Strategy.",
            "Automated Reasoning and Nonclassical Logics: Introduction.",
            "The Ackermann Constant Theorem: A Computer-Assisted Investigation.",
            "Algorithms for Finding Matrix Models of Propositional Calculi.",
            "TABLEAUX: A General Theorem Prover for Modal Logics.",
            "A Family of Goal Directed Theorem Provers Based on Conjunction and Implication: Part I.",
            "Computations in Fragments of Intuitionistic Propositional Logic.",
            "Relevant Logic Programming.",
            "Condensed Detachment is Complete for Relevance Logic: A Computer-Aided Proof.",
            "Implementing the 'Fool's Model' of Combinatory Logic.",
            "The Problem of Choosing the Representation, Inference Rule, and Strategy.",
            "Approaching Hard Non-Classical Problems."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1990",
        "info": "1990: Volume 6",
        "count": 25,
        "papers": [
            "Strategies for Modal Resolution: Results and Problems.",
            "On the Recursive Decomposition Ordering with Lexicographical Status and Other Related Orderings.",
            "Replacing Unification by Constraint Satisfaction to Improve Logic Program Expressiveness.",
            "The Problem of Choosing between Logic Programming and General-Purpose Automated Reasoning.",
            "Automated Proofs of the Moufang Identities in Alternative Rings.",
            "Structure Sharing for Quantified Terms: Fundamentals.",
            "Protected Completions of First-Order General Logic Programs.",
            "The Automation of Syllogistic.",
            "Decision Procedures for Elementary Sublanguages of Set Theory.",
            "A Procedure to Prove Statements in Differential Geometry.",
            "The Problem of Finding a Mapping between Clause Representation and Natural-Deduction Representation.",
            "Meeting the Challenge of Fifty Years of Logic.",
            "Gröbner Bases in Exterior Algebra.",
            "Computer Proofs in Group Theory.",
            "Short Proofs of the Pigeonhole Formulas Based on the Connection Method.",
            "Interweaving Knowledge Extracting, Organizing and Evaluating: A Concrete Design for Preventing Logic and Structure Bugs while Interviewing Experts.",
            "Equivalence of Propositional Prolog Programs.",
            "The Problem of Finding a Semantic Strategy for Focusing Inference Rules.",
            "Challenge Problems in Elementary Calculus.",
            "A Decidable First-Order Logic for Knowldge Representation.",
            "A Sequent-Style Model Elimination Strategy and a Positive Refinement.",
            "Transcendental Functions and Mechanical Theorem Proving in Elemantary Geometries.",
            "Interest Driven Suppositional Reasoning.",
            "The Problem of Choosing between Predicate and Function Notation for Problem Representation.",
            "Robbins Algebra: Conditions That Make a Near-Boolean Algebra Boolean."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1989",
        "info": "1989: Volume 5",
        "count": 27,
        "papers": [
            "What Is the Inverse Method?",
            "Non-Negative Integer Basis Algorithms for Linear Equations with Integer Coefficients.",
            "Intractable Unifiability Problems and Backtracking.",
            "Temporal Logic CTL + PROLOG.",
            "Mechanical Certification of Systolic Algorithms.",
            "The Problem of Finding an Inference Rule for Set Theory.",
            "Automated Development of Tarski's Geometry.",
            "The Notion of Proof in Hardware Verification.",
            "Solving Open Problems in Right Alternative Rings with Z-Module Reasoning.",
            "On the Declarative and Procedural Semantics of Logic Programs.",
            "A Fuzzy Expert System Shell Using Both Exact and Inexact Reasoning.",
            "The Problem of Determining the Size of a Complete Set of Reductions.",
            "Automated Reasoning about Elementary Point-Set Topology.",
            "On Connections and Higher-Order Logic.",
            "Weak Generalized Closed World Assumption.",
            "Horn Equational Theories and Paramodulation.",
            "Discovering Inequality Conditions in the Analytic Solution of Optimization Problems.",
            "The Foundation of a Generic Theorem Prover.",
            "The Problem of Guaranteeing the Existence of a Complete Set of Reductions.",
            "Using an Extended PROLOG to Solve the Lion and Unicorn Puzzle.",
            "An Approach to Systems Verification.",
            "Microprocessor Design Verification.",
            "A Mechanically Verified Language Implementation.",
            "A Mechanically Verified Code Generator.",
            "Kit and the Short Stack.",
            "The Problem of Guaranteeing the Absence of a Complete Set of Reductions.",
            "An Automated Reasoning Problem Associated with Proving Claims about Programs Using Floyd-Hoare Inductive Assertin Methods."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1988",
        "info": "1988: Volume 4",
        "count": 22,
        "papers": [
            "Model Minimization - An Alternative to Circumscription.",
            "Meta-Level Inference: Two Applications.",
            "Designing Deductive Databases.",
            "HARP: A Tableau-Based Theorem Prover.",
            "The Problem of Finding a Strategy to Control Binary Paramodulation.",
            "The Addition of Bounded Quantification and Partial Functions to A Computational Logic and Its Theorem Prover.",
            "Mechanical Procedure for Proof Construction via Closed Terms in Typed \\lambda Calculus.",
            "First-Order Modal Tableaux.",
            "The Problem of Explaining the Disparate Performance of Hyperresolution and Paramodulation.",
            "Automated Proofs of Löb's Theorem and Gödel's Two Incompleteness Theorems.",
            "An Introduction to Wu's Method for Mechanical Theorem Proving in Geometry.",
            "A lambda-Unifiability Test for Set Theory.",
            "Non-Horn Clause Logic Programming Without Contrapositives.",
            "The Problem of Self-Analytically Choosing the Set of Support.",
            "Proving Equivalence of Different Axiomatizations of Free Groups.",
            "A Prolog Technology Theorem Prover: Implementation by an Extended Prolog Compiler.",
            "Unification in Boolean Rings.",
            "Inferring Negative Information from Disjunctive Databases.",
            "A New Reduction Rule for the Connection Graph Proof Procedure.",
            "Inference Rules Using Local Contexts.",
            "The Problem of Self-Analytically Choosing the Weights.",
            "Opening the AC-Unification Race."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1987",
        "info": "1987: Volume 3",
        "count": 20,
        "papers": [
            "Link Inheritance in Abstract Clause Graphs.",
            "Hierarchical Deduction.",
            "Some Obstacles to the Automation of Reasoning and the Problem of Redundant Information.",
            "A Case Study in Automated Theorem Proving: Finding Sages in Combinatory Logic.",
            "A More Expressive Formulation of Many Sorted Logic.",
            "The Problem of Choosing the Inference Rule to Employ.",
            "Some Experiments in Nonassociative Ring Theory with an Automated Theorem Prover.",
            "Adding Equality to Semantic Tableaux.",
            "Unification in Abelian Semigroups.",
            "A Comparison of the Variable-Abstraction and Constant-Abstraction Methods for Associative-Commutative Unification.",
            "A Method for the Mechanical Derivation of Formulas in Elementary Geometry.",
            "Explicit Representation of Terms Defined by Counter Examples.",
            "The Problem of Extending the Set of Support Strategy.",
            "Proving Self-Utterances.",
            "How to Clear a Block: A Theory of Plans.",
            "A Note on a Canonical Theory with Undecidable Unification and Matching Problem.",
            "Obvious Inferences.",
            "Choosing Directions for Rules.",
            "The Problem of Definition Expansion and Contraction.",
            "Case Studies of Z-Module Reasoning: Proving Benchmark Theorems from Ring Theory."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1986",
        "info": "1986: Volume 2",
        "count": 18,
        "papers": [
            "Job-Shop Scheduling Using Automated Reasoning: A Case Study of the Car-Sequencing Problem.",
            "Intelligent Backtracking in Deduction Systems by Means of Extended Unification Graphs.",
            "Proving Termination of Normalization Functions for Conditional Experessions.",
            "Unification in Datastructure Multisets.",
            "Schubert's Steamroller Problem: Formulation and Solutions.",
            "Correctness Criteria of Some Algorithms for Uncertain Reasoning Using Incidence Calculus.",
            "Automated Analysis of Operators on State Tables: A Technique for Intelligent Search.",
            "Negation as Failure. Completeness of the Query Evaluation Process for Horn Clause Programs with Recursive Definitions.",
            "A Decision Procedure for Combinations of Propositional Temporal Logic and Other Specialized Theories.",
            "Seventy-Five Problems for Testing Automatic Theorem Provers.",
            "Basic Principles of Mechanical Theorem Proving in Elementary Geometries.",
            "Proving Geometry Theorems with Rewrite Rules.",
            "Unification under Associativity and Idempotence is of Type Nullary.",
            "The Theory of Idempotent Semigroups is of Unification Type Zero.",
            "Set Theory in First-Order Logic: Clauses for Gödel's Axioms.",
            "Automated Reasoning in Geometry Theorem Proving with Prolog.",
            "A Class of Confluent Term Rewriting Systems and Unification.",
            "A Foray Into Combinatory Logic."
        ]
    },
    {
        "name": "Journal of Automated Reasoning",
        "year": "1985",
        "info": "1985: Volume 1",
        "count": 25,
        "papers": [
            "Editorial: A Journal Is Born.",
            "What Is Automated Reasoning?",
            "Logic Programming.",
            "Research in Intelligent Robots.",
            "Program Verification.",
            "What Is Automated Theorem Proving?",
            "Expert Systems.",
            "Nonclassical Logic Theorem Proving.",
            "What Is Program Synthesis?",
            "ROGET: A Knowledge-Based System for Acquiring the Conceptual Structure of a Diagnostic Expert System.",
            "On the Role of Automated Theorem Proving in the Compile-Time Derivation of Concurrency.",
            "Non-Horn Problems.",
            "An Experiment with the Boyer-Moore Theorem Prover: A Proof of Wilson's Theorem.",
            "Deduction in Non-Horn Databases.",
            "The Concept and Implementation of Skeletal Plans.",
            "Reasoning about Equality.",
            "Experiments with Semantic Paramodulation.",
            "Incidence Calculus: A Mechanism for Probabilistic Reasoning.",
            "Writing Programs that Construct Proofs.",
            "The Lion and the Unicorn.",
            "Automated Deduction by Theory Resolution.",
            "Robot Selection Expert 'Rose'.",
            "Circumscription and Implicit Definability.",
            "Towards Mechanical Metamathematics.",
            "Predicate Logic Hacker Tricks."
        ]
    }
]