[
    {
        "year": "2021",
        "name": "18th KR 2021",
        "info": "Online event",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2021",
                "sub_name": "Proceedings of the 18th International Conference on Principles of Knowledge Representation and Reasoning, KR 2021, Online event, November 3-12, 2021.",
                "count": 75,
                "papers": [
                    "Somebody Knows.",
                    "Reasoning about Explanations for Non-validation in SHACL.",
                    "Generalized Temporal Inference via Planning.",
                    "Equivalence of Semantics in Argumentation.",
                    "Synthesizing Best-effort Strategies under Multiple Environment Specifications.",
                    "Characterizations and Classifications of Argumentative Entailments.",
                    "On Free Description Logics with Definite Descriptions.",
                    "On the Computational Intelligibility of Boolean Classifiers.",
                    "Admissibility in Probabilistic Argumentation.",
                    "Correcting Hierarchical Plans by Action Deletion.",
                    "Choices and their Consequences - Explaining Acceptable Sets in Abstract Argumentation Frameworks.",
                    "DEL-based Epistemic Planning for Human-Robot Collaboration: Theory and Implementation.",
                    "Enforcing Sets of Formulas in Structured Argumentation.",
                    "Capturing Homomorphism-Closed Decidable Queries with Existential Rules.",
                    "On the Identifiability of Hierarchical Decision Models.",
                    "Parallelisable Existential Rules: a Story of Pieces.",
                    "Closed- and Open-world Reasoning in DL-Lite for Cloud Infrastructure Security.",
                    "On Eventual Applicability of Plans in Dynamic Environments with Cyclic Phenomena.",
                    "An Account of Intensional and Extensional Actions, and its Application to Belief, Nondeterministic Actions and Fallible Sensors.",
                    "A Compilation of Succinctness Results for Arithmetic Circuits.",
                    "The Nondeterministic Situation Calculus.",
                    "Timed Trace Alignment with Metric Temporal Logic over Finite Traces.",
                    "Synthesis with Mandatory Stop Actions.",
                    "Beyond Simple Images: Human Knowledge-Guided GANs for Clinical Data Generation.",
                    "Expressing and Exploiting the Common Subgoal Structure of Classical Planning Domains Using Sketches.",
                    "Treewidth-Aware Cycle Breaking for Algebraic Answer Set Counting.",
                    "Answer-Set Programming for Lexicographical Makespan Optimisation in Parallel Machine Scheduling.",
                    "Borda, Cancellation and Belief Merging.",
                    "Reasoning over Attack-incomplete AAFs in the Presence of Correlations.",
                    "Rational Verification for Probabilistic Systems.",
                    "How to Approximate Ontology-Mediated Queries.",
                    "Approximation Fixpoint Theory for Non-Deterministic Operators and Its Application in Disjunctive Logic Programming.",
                    "Revision and Conditional Inference for Abstract Dialectical Frameworks.",
                    "On Efficiently Explaining Graph-Based Classifiers.",
                    "Strategic Abilities of Asynchronous Agents: Semantic Side Effects and How to Tame Them.",
                    "Safe Learning of Lifted Action Models.",
                    "Separating Data Examples by Description Logic Concepts with Restricted Signatures.",
                    "Satisfiability Checking of Strategy Logic with Simple Goals.",
                    "Formalizing Statistical Beliefs in Hypothesis Testing Using Program Logic.",
                    "Semi-Stable Semantics for Abstract Dialectical Frameworks.",
                    "Unfounded Sets for Disjunctive Hybrid MKNF Knowledge Bases.",
                    "Diagnosis of Active Systems with Abstract Observations and Compiled Knowledge.",
                    "Unsupervised Novelty Characterization in Physical Environments Using Qualitative Spatial Relations.",
                    "On the Progression of Belief.",
                    "Approximate Inference for Neural Probabilistic Logic Programming.",
                    "Strategic Reasoning in Automated Mechanism Design.",
                    "Properties of Module Notions and Atomic Decomposition.",
                    "Monotonicity and Noise-Tolerance in Case-Based Reasoning with Abstract Argumentation.",
                    "Representing and Reasoning with Event Models for Epistemic Planning.",
                    "Consolidation via Tacit Culpability Measures: Between Explicit and Implicit Degrees of Culpability.",
                    "Learning First-Order Representations for Planning from Black Box States: New Results.",
                    "Existential Abstraction on Argumentation Frameworks via Clustering.",
                    "Boolean Network Learning in Vector Spaces for Genome-wide Network Analysis.",
                    "Decidability and Complexity of Some Finitely-valued Dynamic Logics.",
                    "Gaussian Elimination Meets Maximum Satisfiability.",
                    "Belief Contraction in Non-classical logics as Hyperintensional Belief Change.",
                    "Lifted Inference with Tree Axioms.",
                    "DatalogMTL with Negation Under Stable Models Semantics.",
                    "Finitely Materialisable Datalog Programs with Metric Temporal Operators.",
                    "A Principle-based Analysis of Abstract Agent Argumentation Semantics.",
                    "Making DL-Lite Planning Practical.",
                    "A Many-valued Logic for Lexicographic Preference Representation.",
                    "Universal and Uniform Action Reversibility.",
                    "Measuring Inconsistency over Sequences of Business Rule Cases.",
                    "Introducing k-lingo: a k-depth Bounded Version of ASP System Clingo.",
                    "Combining Logic and Natural Language Processing to Support Investment Management.",
                    "On the Complexity of Preferred Semantics in Argumentation Frameworks with Bounded Cycle Length.",
                    "A Dynamic Epistemic Logic with Finite Iteration and Parallel Composition.",
                    "On the Epistemic Logic of Incomplete Argumentation Frameworks.",
                    "Distinguishability in Abstract Argumentation.",
                    "Sticky Existential Rules and Disjunction are Incompatible.",
                    "Randomized Problem-Relaxation Solving for Over-Constrained Schedules.",
                    "Flexible Robotic Assembly Based on Ontological Representation of Tasks, Skills, and Resources.",
                    "On the Maximal Number of Complete Extensions in Abstract Argumentation Frameworks.",
                    "PATCHCOMM: Using Commonsense Knowledge to Guide Syntactic Parsers."
                ]
            },
            {
                "sub_name_abbr": "conf/kr/2021soqe",
                "sub_name": "Proceedings of the Second Workshop on Second-Order Quantifier Elimination and Related Topics (SOQE 2021) associated with the 18th International Conference on Principles of Knowledge Representation and Reasoning (KR 2021), Online Event, November 4, 2021.",
                "count": 14,
                "papers": [
                    "Projective Beth Definability and Craig Interpolation for Relational Query Optimization (Material to Accompany Invited Talk).",
                    "Living Without Beth and Craig: Explicit Definitions and Interpolants without Beth Definability and Craig Interpolation (Abstract of Invited Talk).",
                    "Resolution-Based Uniform Interpolation for Multi-Agent Modal Logic Kn.",
                    "Second-Order Specifications and Quantifier Elimination for Consistent Query Answering in Databases (Abstract).",
                    "On Testing Containedness Between Geometric Graph Classes using Second-order Quantifier Elimination and Hierarchical Reasoning (Short Paper).",
                    "Abduction in EL via Translation to FOL.",
                    "An Abstract Fixed-Point Theorem for Horn Formula Equations (Abstract).",
                    "Signature-Based ABox Abduction in ALC is Hard.",
                    "SEH-PILoT: A System for Property-Directed Symbol Elimination - Work in Progress (Short Paper).",
                    "Symbol Elimination and Applications to Parametric Entailment Problems (Abstract).",
                    "The Yoneda Reduction of Polymorphic Types (Abstract).",
                    "Applying Second-Order Quantifier Elimination in Inspecting Gödel's Ontological Proof.",
                    "Sahlqvist-type Correspondence Theory for Second-Order Propositional Modal Logic (Short Paper).",
                    "Metadata-based Term Selection for Modularization and Uniform Interpolation of OWL Ontologies."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th KR 2020",
        "info": "Rhodes, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2020",
                "sub_name": "Proceedings of the 17th International Conference on Principles of Knowledge Representation and Reasoning, KR 2020, Rhodes, Greece, September 12-18, 2020.",
                "count": 94,
                "papers": [
                    "Inputs, Outputs, and Composition in the Logic of Information Flows.",
                    "Reasoning with Contextual Knowledge and Influence Diagrams.",
                    "Verifying Strategic Abilities of Neural-symbolic Multi-agent Systems.",
                    "Explainable Acceptance in Probabilistic Abstract Argumentation: Complexity and Approximation.",
                    "Answer Set Programming with Composed Predicate Names.",
                    "Symbolic Solutions for Symbolic Constraint Satisfaction Problems.",
                    "Stable and Supported Semantics in Continuous Vector Spaces.",
                    "An Answer Set Programming Framework for Reasoning about Agents' Beliefs and Truthfulness of Statements.",
                    "Comparing Weak Admissibility Semantics to their Dung-style Counterparts - Reduct, Modularization, and Strong Equivalence in Abstract Argumentation.",
                    "A Three-valued Approach to Strategic Abilities under Imperfect Information.",
                    "Ordinal Polymatrix Games with Incomplete Information.",
                    "Balancing Expressiveness and Inexpressiveness in View Design.",
                    "An Optimization Approach to Robust Goal Obfuscation.",
                    "Explanatory Diagnosis of Discrete-Event Systems with Temporal Information and Smart Knowledge-Compilation.",
                    "Querying and Repairing Inconsistent Prioritized Knowledge Bases: Complexity Analysis and Links with Abstract Argumentation.",
                    "High-level Programming via Generalized Planning and LTL Synthesis.",
                    "Module Checking of Pushdown Multi-agent Systems.",
                    "Simultaneous Representation of Knowledge and Belief for Epistemic Planning with Belief Revision.",
                    "Spatial Reasoning about String Loops and Holes in Temporal ASP.",
                    "A Uniform Treatment of Aggregates and Constraints in Hybrid ASP.",
                    "Preference-based Inconsistency-Tolerant Query Answering under Existential Rules.",
                    "Rational Defeasible Belief Change.",
                    "Explanations for Negative Query Answers under Existential Rules.",
                    "Revision by Conditionals: From Hook to Arrow.",
                    "Non-Monotonic Ontology-based Abstractions of Data Services.",
                    "Dyadic Obligations over Complex Actions as Deontic Constraints in the Situation Calculus.",
                    "Reasoning about Measures of Unmeasurable Sets.",
                    "Lightweight Parallel Multi-Agent Epistemic Planning.",
                    "Fine-Grained Complexity of Temporal Problems.",
                    "Nondeterministic Strategies and their Refinement in Strategy Logic.",
                    "Two-Stage Technique for LTLf Synthesis Under LTL Assumptions.",
                    "Strategy Synthesis for Data-Aware Dynamic Systems with Multiple Actors.",
                    "A Preference-Based Approach to Defeasible Deontic Inference.",
                    "Jokes and Belief Revision.",
                    "Argumentation Semantics under a Claim-centric View: Properties, Expressiveness and Relation to SETAFs.",
                    "Token-based Execution Semantics for Multi-Agent Epistemic Planning.",
                    "On Sufficient and Necessary Conditions in Bounded CTL: A Forgetting Approach.",
                    "Containment of Simple Conjunctive Regular Path Queries.",
                    "Finite Controllability for Ontology-Mediated Query Answering of CRPQ.",
                    "Fixed-Parameter Tractability of Dependency QBF with Structural Parameters.",
                    "A Data Complexity and Rewritability Tetrachotomy of Ontology-Mediated Queries with a Covering Axiom.",
                    "Entity Type Recognition - Dealing with the Diversity of Knowledge.",
                    "On Finite Entailment of Non-Local Queries in Description Logics.",
                    "Datalog Rewritability and Data Complexity of ALCHOIF with Closed Predicates.",
                    "Multi-head Guarded Existential Rules Over Fixed Signatures.",
                    "Logics of Preference when There Is No Best.",
                    "Syntax Splitting for Iterated Contractions.",
                    "Dynamic Awareness.",
                    "Treewidth-aware Reductions of Normal ASP to SAT - Is Normal ASP Harder than SAT after All?",
                    "Reasoning with Inconsistent Knowledge using the Epistemic Approach to Probabilistic Argumentation.",
                    "Plausible Reasoning about EL-Ontologies using Concept Interpolation.",
                    "Logical Separability of Incomplete Data under Ontologies.",
                    "On the Decidability of Expressive Description Logics with Transitive Closure and Regular Role Expressions.",
                    "SAT-Based ATL Satisfiability Checking.",
                    "Reasoning About Plan Robustness Versus Plan Cost for Partially Informed Agents.",
                    "Syntax Splitting = Relevance + Independence: New Postulates for Nonmonotonic Reasoning From Conditional Belief Bases.",
                    "Changing Beliefs about Domain Dynamics in the Situation Calculus.",
                    "Boolean Role Inclusions in DL-Lite With and Without Time.",
                    "Signature-Based Abduction for Expressive Description Logics.",
                    "Computing Cores for Existential Rules with the Standard Chase and ASP.",
                    "An ExpTime Upper Bound for ALC with Integers.",
                    "A First-Order Logic of Limited Belief Based on Possible Worlds.",
                    "An Answer Set Programming Approach to Argumentative Reasoning in the ASPIC+ Framework.",
                    "Argument, I Choose You! Preferences and Ranking Semantics in Abstract Argumentation.",
                    "On the Reversibility of Actions in Planning.",
                    "Explainable Planning Using Answer Set Programming.",
                    "Smallest Explanations and Diagnoses of Rejection in Abstract Argumentation.",
                    "Towards a Logic of Meta-Analysis.",
                    "Bipolar Abstract Argumentation with Dual Attacks and Supports.",
                    "Choosing What to Believe - New Results in Selective Revision.",
                    "Designing Participatory Budgeting Mechanisms Grounded in Judgment Aggregation.",
                    "Modelling the Polysemy of Spatial Prepositions in Referring Expressions.",
                    "Independence and D-separation in Abstract Argumentation.",
                    "Concept Contraction in the Description Logic EL.",
                    "A Semantic Perspective on Omission Abstraction in ASP.",
                    "Non-Prioritized Iterated Revision: Improvement via Incremental Belief Merging.",
                    "Seq2KG: An End-to-End Neural Model for Domain Agnostic Knowledge Graph (not Text Graph) Construction from Text.",
                    "Knowledge-Preserving Certain Answers for SQL-like Queries.",
                    "DatalogMTL over the Integer Timeline.",
                    "A (Simplified) Supreme Being Necessarily Exists, says the Computer: Computationally Explored Variants of Gödel's Ontological Argument.",
                    "WOLED: A tool for Online Learning Weighted Answer Set Rules for Temporal Reasoning Under Uncertainty.",
                    "µ-toksia: An Efficient Abstract Argumentation Reasoner.",
                    "Argumentation as a Framework for Interactive Explanations for Recommendations.",
                    "Explainable and Argumentation-based Decision Making with Qualitative Preferences for Diagnostics and Prognostics of Alzheimer's Disease.",
                    "On the Approximability of Weighted Model Integration on DNF Structures.",
                    "On Tractable XAI Queries based on Compiled Representations.",
                    "Ontology-guided Semantic Composition for Zero-shot Learning.",
                    "Towards an Inductive Logic Programming Approach for Explaining Black-Box Preference Learning Systems.",
                    "Temporal Logic Monitoring Rewards via Transducers.",
                    "Neuro-Symbolic Probabilistic Argumentation Machines.",
                    "On Tractable Representations of Binary Neural Networks.",
                    "Analyzing Differentiable Fuzzy Implications.",
                    "Towards a Framework for Visual Intelligence in Service Robotics: Epistemic Requirements and Gap Analysis.",
                    "Modeling Affordances and Functioning for Personalized Robotic Assistance."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th KR 2018",
        "info": "Tempe, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2018",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Sixteenth International Conference, KR 2018, Tempe, Arizona, 30 October - 2 November 2018.",
                "count": 93,
                "papers": [
                    "Preference Relations by Approximation.",
                    "Introducing Temporal Stable Models for Linear Dynamic Logic.",
                    "Weight Learning in a Probabilistic Extension of Answer Set Programs.",
                    "A Hybrid Approach to Optimization in Answer Set Programming.",
                    "Omission-Based Abstraction for Answer Set Programs.",
                    "A Generator of Hard 2QBF Formulas and ASP Programs.",
                    "Computing Logic Programs with Ordered Disjunction Using asprin.",
                    "A Model-Based Approach to Visual Reasoning on CNLVR Dataset.",
                    "SMT-Based Constraint Answer Set Solver EZSMT+ for Non-Tight Programs.",
                    "SOGrounder: Modelling and Solving Second-Order Logic.",
                    "An Incremental Approach to Structured Argumentation over Dynamic Knowledge Bases.",
                    "Gradual Semantics Accounting for Similarity between Arguments.",
                    "Measuring Similarity between Logical Arguments.",
                    "If Nothing Is Accepted - Repairing Argumentation Frameworks.",
                    "Combining Extension-Based Semantics and Ranking-Based Semantics for Abstract Argumentation.",
                    "Constructive Logic Covers Argumentation and Logic Programming.",
                    "Updating Belief in Arguments in Epistemic Graphs.",
                    "Continuous Dynamical Systems for Weighted Bipolar Argumentation.",
                    "Probabilistic Strength of Arguments with Structure.",
                    "Probabilistic Abstract Argumentation Based on SCC Decomposability.",
                    "Extension Enforcement under Grounded Semantics in Abstract Argumentation.",
                    "Reachability Analysis for Neural Agent-Environment Systems.",
                    "Hunting for Tractable Languages for Judgment Aggregation.",
                    "iCon: A Diagrammatic Theorem Prover for Ontologies.",
                    "On Strengthening the Logic of Iterated Belief Revision: Proper Ordinal Interval Operators.",
                    "A Semantic Perspective on Belief Change in a Preferential Non-Monotonic Framework.",
                    "Incorporating Relevance in Epistemic States in Belief Revision.",
                    "Studies in Credibility-Limited Base Revision.",
                    "Axiomatizing a Qualitative Principle of Conditional Preservation for Iterated Belief Change.",
                    "Specifying Plausibility Levels for Iterated Belief Change in the Situation Calculus.",
                    "Default Reasoning via Topology and Mathematical Analysis: A Preliminary Report.",
                    "Parametrised Difference Revision.",
                    "Towards Belief Contraction without Compactness.",
                    "On Belief Promotion.",
                    "Preference Aggregation with Incomplete CP-Nets.",
                    "Making Repairs in Description Logics More Gentle.",
                    "Reasoning with Justifiable Exceptions in Contextual Hierarchies.",
                    "The Combined Approach to Query Answering in Horn-ALCHOIQ.",
                    "Knowledge-Based Transfer Learning Explanation.",
                    "A Parameterized Complexity View on Description Logic Reasoning.",
                    "Finite Query Answering in Expressive Description Logics with Transitive Roles.",
                    "From Knowledge Graph Embedding to Ontology Embedding? An Analysis of the Compatibility between Vector Space Representations and Rules.",
                    "Query Expressibility and Verification in Ontology-Based Data Access.",
                    "Query Answering for Rough EL Ontologies.",
                    "ExactLearner: A Tool for Exact Learning of EL Ontologies.",
                    "Heuristic Search Planning With Multi-Objective Probabilistic LTL Constraints.",
                    "Bisimulations for Logics of Strategies: A Study in Expressiveness and Verification.",
                    "Approximating Perfect Recall When Model Checking Strategic Abilities.",
                    "Better Eager Than Lazy? How Agent Types Impact the Successfulness of Implicit Coordination.",
                    "Finite LTL Synthesis with Environment Assumptions and Quality Measures.",
                    "Abductive Diagnosis of Complex Active Systems with Compiled Knowledge.",
                    "Compiling Away Soft Trajectory Constraints in Planning.",
                    "On the Progression of Situation Calculus Universal Theories with Constants.",
                    "On Laws and Counterfactuals in Causal Reasoning.",
                    "Combining the Causal Judgments of Experts with Possibly Different Focus Areas.",
                    "Complexity of Projection with Stochastic Actions in a Probabilistic Description Logic.",
                    "Symbolic Verification of Golog Programs with First-Order BDDs.",
                    "Reasoning about Knowledge and Strategies under Hierarchical Information.",
                    "A Novel Automata-Theoretic Approach to Timeline-Based Planning.",
                    "Qualitative Representation and Reasoning over Direction Relations across Different Frames of Reference.",
                    "Cutting Diamonds: A Temporal Logic with Probabilistic Distributions.",
                    "The Window Validity Problem in Rule-Based Stream Reasoning.",
                    "Approximating Certainty in Querying Data and Metadata.",
                    "Propositional and Predicate Logics of Incomplete Information.",
                    "Quantified Markov Logic Networks.",
                    "Gradual Semantics for Weighted Graphs: An Unifying Approach.",
                    "Synthesis under Assumptions.",
                    "Relaxing and Restraining Queries for OBDA - Extended Abstract.",
                    "Loop Restricted Existential Rules and First-Order Rewritability for Query Answering.",
                    "Changing Observations in Epistemic Temporal Logic.",
                    "Some Thoughts On Well-Foundedness in Weighted Abstract Argumentation.",
                    "Towards Lazy Grounding with Lazy Normalization in Answer-Set Programming - Extended Abstract.",
                    "Decidability and Complexity of Timeline-Based Planning over Dense Temporal Domains.",
                    "A General Approach to Reasoning with Probabilities - Extended Abstract.",
                    "Argumentation for Reasoning with Conflicting Clinical Guidelines and Preferences.",
                    "Partial-State Progression for Stream Reasoning with Metric Temporal Logic.",
                    "Navigability with Bounded Recall.",
                    "Knowledge Compilation in the Multi-Agent Epistemic Logic Kn.",
                    "Exploiting Treewidth for Counting Projected Answer Sets.",
                    "Towards Explainable Inference about Object Motion using Qualitative Reasoning.",
                    "Variable Elimination for DLP-Functions.",
                    "Two AGM-Style Characterizations of Model Repair.",
                    "Bayesian Model Selection in Statistical Construction of Justification.",
                    "New Inference Relations from Maximal Consistent Subsets.",
                    "A SAT-Based Approach For PSPACE Modal Logics.",
                    "A Comprehensive Framework for Controlled Query Evaluation, Consistent Query Answering and KB Updates in Description Logics.",
                    "On Limited Conjunctions in Polynomial Feature Logics, with Applications in OBDA.",
                    "Knowledge Representation and Reasoning in Answering Science Questions: A Case Study for Food Web Questions.",
                    "Strategic Coalitions in Systems with Catastrophic Failures.",
                    "Structure Learning for Relational Logistic Regression: An Ensemble Approach.",
                    "Probabilistic Coalition Structure Generation.",
                    "Metric Temporal Extensions of DL-Lite and Interval-Rigid Names.",
                    "Propositional Belief Merging with OWA Operators."
                ]
            },
            {
                "sub_name_abbr": "conf/kr/2018medracer",
                "sub_name": "Proceedings of the Joint Proceedings of Reasoning with Ambiguous and Conflicting Evidence and Recommendations in Medicine (MedRACER 2018) and the 3rd International Workshop on Ontology Modularity, Contextuality, and Evolution (WOMoCoE 2018) co-located with the 16th International Conference on Principles of Knowledge Representation and Reasoning (KR 2018), Tempe, Arizona, USA, October 29th, 2018.",
                "count": 7,
                "papers": [
                    "Towards an Argumentation System for Supporting Patients in Self-Managing Their Chronic Conditions.",
                    "Argumentation for Explainable Reasoning with Conflicting Medical Recommendations.",
                    "Automatically Identifying Drug Conflicts in Clinical Practice Guidelines.",
                    "Filtering Clinical Guideline Interactions with Pre-Conditions: A Case Study on Diabetes Guideline.",
                    "Dealing with Conceptual Indeterminacy: A Framework Based on Supervaluation Semantics.",
                    "Ontology Stratification Methods: A Comparative Study.",
                    "Ontology Partitioning Using E-Connections Revisited (Extended Abstract)."
                ]
            },
            {
                "sub_name_abbr": "conf/kr/2018cogrob",
                "sub_name": "Proceedings of the 11th Cognitive Robotics Workshop 2018, co-located with 16th International Conference on Principles of Knowledge Representation and Reasoning, CogRob@KR 2018, Tempe, AZ, USA, October 27th, 2018.",
                "count": 5,
                "papers": [
                    "Which tool to use? Grounded reasoning in everyday environments with assistant robots.",
                    "Knowledge Representation for Cognition- and Learning-enabled Robot Manipulation.",
                    "What Stands-in for a Missing Tool?: A Prototypical Grounded Knowledge-based Approach to Tool Substitution.",
                    "golog++ : An Integrative System Design.",
                    "A Logic for Specifying Metric Temporal Constraints for Golog Programs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "15th KR 2016",
        "info": "Cape Town, South Africa",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2016",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Fifteenth International Conference, KR 2016, Cape Town, South Africa, April 25-29, 2016.",
                "count": 75,
                "papers": [
                    "Axiomatic Foundations of Acceptability Semantics.",
                    "Ranking Arguments With Compensation-Based Semantics.",
                    "Characterizing Equivalence Notions for Labelling-Based Semantics.",
                    "Merging of Abstract Argumentation Frameworks.",
                    "On the Functional Completeness of Argumentation Semantics.",
                    "On Partial Information and Contradictions in Probabilistic Abstract Argumentation.",
                    "Discontinuity-Free Decision Support with Quantitative Argumentation Debates.",
                    "Declarative Solver Development: Case Studies.",
                    "A MIS Partition Based Framework for Measuring Inconsistency.",
                    "Solving PPPP-Complete Problems Using Knowledge Compilation.",
                    "Implicit Hitting Set Algorithms for Reasoning Beyond NP.",
                    "Some Complexity Results on Inconsistency Measurement.",
                    "Consolidating Probabilistic Knowledge Bases via Belief Contraction.",
                    "The Ultimate Guide to Forgetting in Answer Set Programming.",
                    "Weighted Rules under the Stable Model Semantics.",
                    "Preference and Priorities: A Study Based on Contrction.",
                    "Boolean Hedonic Games.",
                    "Succinctness of Languages for Judgment Aggregation.",
                    "Extending Consequence-Based Reasoning to SRIQ.",
                    "Query-Based Comparison of Mappings in Ontology-Based Data Access.",
                    "Containment in Monadic Disjunctive Datalog, MMSNP, and Expressive Description Logics.",
                    "Limiting Logical Violations in Ontology Alignnment Through Negotiation.",
                    "Anti-Unification of Concepts in Description Logic EL.",
                    "Closed Predicates in Description Logics: Results on Combined Complexity.",
                    "Undecidability Results for Database-Inspired Reasoning Problems in Very Expressive Description Logics.",
                    "Prompt Alternating-Time Epistemic Logics.",
                    "Building Epistemic Logic from Observations and Public Announcements.",
                    "Sequential Equilibrium in Games of Imperfect Recall.",
                    "Decidable Reasoning in a Logic of Limited Belief with Function Symbols.",
                    "Model Checking Multi-Agent Systems against Epistemic HS Specifications with Regular Expressions.",
                    "Bisimulations on Data Graphs.",
                    "On Referring Expressions in Query Answering over First Order Knowledge Bases.",
                    "Regular Open APIs.",
                    "Open-World Probabilistic Databases.",
                    "Approximations and Refinements of Certain Answers via Many-Valued Logics.",
                    "Generalized Consistent Query Answering under Existential Rules.",
                    "On Expressibility of Non-Monotone Operators in SPARQL.",
                    "Foundations for Generalized Planning in Unbounded Stochastic Domains.",
                    "Imperfect Information in Reactive Modules Games.",
                    "On Logics and Semantics of Indeterminate Causation.",
                    "On First-Order μ-Calculus over Situation Calculus Action Theories.",
                    "Commonsense Causal Reasoning between Short Texts.",
                    "A SAT Approach for Maximizing Satisfiability in Qualitative Spatial and Temporal Constraint Networks.",
                    "Quantifying Conflicts for Spatial and Temporal Information.",
                    "Parameterized Complexity Results for Symbolic Model Checking of Temporal Logics.",
                    "Encoding Large RCC8 Scenarios Using Rectangular Pseudo-Solutions.",
                    "Model Checking Well-Behaved Fragments of HS: The (Almost) Final Picture.",
                    "Bayesian Deduction with Subjective Opinions.",
                    "Probabilistic Models over Weighted Orderings: Fixed-Parameter Tractable Variable Elimination.",
                    "Unsupervised Grounding of Textual Descriptions of Object Features and Actions in Video.",
                    "Argumentative Approaches to Reasoning with Maximal Consistency.",
                    "A General Modifier-Based Framework for Inconsistency-Tolerant Query Answering.",
                    "Online Situation-Determined Agents and their Supervision.",
                    "On the Justification of Statements in Argumentation-based Reasoning.",
                    "An Abstract Logical Approach to Characterizing Strong Equivalence in Logic-based Knowledge Representation Formalisms.",
                    "Negation Without Negation in Probabilistic Logic Programming.",
                    "An Analysis of the Equational Properties of the Well-Founded Fixed Point.",
                    "Using Defeasible Information to Obtain Coherence.",
                    "jArgSemSAT: An Efficient Off-the-Shelf Solver for Abstract Argumentation Frameworks.",
                    "Guiding Planning Engines by Transition-Based Domain Control Knowledge.",
                    "Abstract Argumentation for Case-Based Reasoning.",
                    "ABA+: Assumption-Based Argumentation with Preferences.",
                    "Knowledge Graph Embedding by Flexible Translation.",
                    "Knowledge Compilation for Lifted Probabilistic Inference: Compiling to a Low-Level Language.",
                    "Infinite Paths in the Situation Calculus: Axiomatization and Properties.",
                    "Expressive Description Logic with Instantiation Metamodelling.",
                    "Easy OWL Drawing with the Graphol Visual Ontology Language.",
                    "A Higher-Order Semantics for Metaquerying in OWL 2 QL.",
                    "Using Metric Temporal Logic to Specify Scheduling Problems.",
                    "Complexity of the Description Logic ALCM.",
                    "Minimality Postulates for Ontology Revision.",
                    "A Multi-Aspect Evaluation Framework for Comments on the Social Web.",
                    "Cognitive Affordance Representations in Uncertain Logic.",
                    "Representative Solutions for Multi-Objective Constraint Optimization Problems.",
                    "Reasoning about Truthfulness of Agents Using Answer Set Programming."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14th KR 2014",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2014",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Fourteenth International Conference, KR 2014, Vienna, Austria, July 20-24, 2014.",
                "count": 92,
                "papers": [
                    "Conference Committee.",
                    "Area Chairs and Program Committee.",
                    "Preface.",
                    "Vienna Summer of Logic.",
                    "Invited Talks.",
                    "Tutorials.",
                    "Sponsors.",
                    "Logic Programs with Ordered Disjunction: First-Order Semantics and Expressiveness.",
                    "Constructive Negation in Extensional Higher-Order Logic Programming.",
                    "The Well-Founded Semantics Is the Principle of Inductive Definition, Revisited.",
                    "The Semantics of Gringo and Infinitary Propositional Formulas.",
                    "An SCC Recursive Meta-Algorithm for Computing Preferred Labellings in Abstract Argumentation.",
                    "On the Revision of Argumentation Systems: Minimal Change of Arguments Statuses.",
                    "A Dynamic Logic Framework for Abstract Argumentation.",
                    "Characteristics of Multiple Viewpoints in Abstract Argumentation.",
                    "The Parameterized Complexity of Reasoning Problems Beyond NP.",
                    "On OBDDs for CNFs of Bounded Treewidth.",
                    "Analyzing the Computational Complexity of Abstract Dialectical Frameworks via Approximation Fixpoint Theory.",
                    "Skolemization for Weighted First-Order Model Counting.",
                    "On Egalitarian Belief Merging.",
                    "Justified Beliefs by Justified Arguments.",
                    "Belief Change Operations: A Short History of Nearly Everything, Told in Dynamic Logic of Propositional Assignments.",
                    "Belief Change and Base Dependence.",
                    "Belief Change and Semiorders.",
                    "David Poole's Specificity Revised.",
                    "Axiomatizing Rationality.",
                    "Dynamic Causal Calculus.",
                    "Appropriate Causal Models and Stability of Causation.",
                    "EGuaranteeNash for Boolean Games Is NEXP-Hard.",
                    "Nested Regular Path Queries in Description Logics.",
                    "Decidable Gödel Description Logics without the Finitely-Valued Model Property.",
                    "Query Inseparability for Description Logic Knowledge Bases.",
                    "Answering Instance Queries Relaxed by Concept Similarity.",
                    "Stable Model Semantics for Guarded Existential Rules and Description Logics.",
                    "Polynomial Combined Rewritings for Existential Rules.",
                    "Lightweight Description Logics and Branching Time: A Troublesome Marriage.",
                    "Finite Model Reasoning in Horn Description Logics.",
                    "Exact Learning of Lightweight Description Logic Ontologies.",
                    "Nominal Schemas in Description Logics: Complexities Clarified.",
                    "Practical Uniform Interpolation and Forgetting for ALC TBoxes with Applications to Logical Difference.",
                    "Certain Answers as Objects and Knowledge.",
                    "A Formalization of Programs in First-Order Logic with a Discrete Linear Order.",
                    "Simultaneous Learning and Prediction.",
                    "Tackling Winograd Schemas by Formalizing Relevance Theory in Knowledge Graphs.",
                    "Generalized Multi-Context Systems.",
                    "Qualitative Spatial Representation and Reasoning in Angry Birds: The Extended Rectangle Algebra.",
                    "Diagnostic Problem Solving via Planning with Ontic and Epistemic Goals.",
                    "Satisfiability of Alternating-Time Temporal Epistemic Logic Through Tableaux.",
                    "Reasoning about Equilibria in Game-Like Concurrent Systems.",
                    "A Temporal Logic of Strategic Knowledge.",
                    "An Abstraction Technique for the Verification of Multi-Agent Systems Against ATL Specifications.",
                    "How to Progress Beliefs in Continuous Domains.",
                    "Transforming Situation Calculus Action Theories for Optimised Reasoning.",
                    "State-Boundedness in Data-Aware Dynamic Systems.",
                    "Decidable Reasoning in a Fragment of the Epistemic Situation Calculus.",
                    "A First-Order Semantics for Golog and ConGolog under a Second-Order Induction Axiom for Situations.",
                    "Model Checking Unbounded Artifact-Centric Systems.",
                    "Forgetting in Action.",
                    "Computing Narratives of Cognitive User Experience for Building Design Analysis: KR for Industry Scale Computer-Aided Architecture Design.",
                    "SmartPM: An Adaptive Process Management System through Situation Calculus, IndiGolog, and Classical Planning.",
                    "Tweety: A Comprehensive Collection of Java Libraries for Logical Aspects of Artificial Intelligence and Knowledge Representation.",
                    "Reasoning with Uncertain Inputs in Possibilistic Networks.",
                    "Relational Logistic Regression.",
                    "Probabilistic Sentential Decision Diagrams.",
                    "Linear Programs for Measuring Inconsistency in Probabilistic Logics.",
                    "Axioms .2 and .4 as Interaction Axioms.",
                    "Stable Models of Multi-Valued Formulas: Partial versus Total Functions.",
                    "Rough Set Semantics for Identity on the Web.",
                    "On the Progression of Knowledge in Multiagent Systems.",
                    "Interval Methods for Judgment Aggregation in Argumentation.",
                    "Strong Equivalence of Non-Monotonic Temporal Theories.",
                    "Using Answer Set Programming for Solving Boolean Games.",
                    "Towards a Knowledge Level Analysis of Forgetting.",
                    "A Psychology-Inspired Approach to Automated Narrative Text Comprehension.",
                    "Concept Dissimilarity with Triangle Inequality.",
                    "On Redundant Topological Constraints.",
                    "Belief Revision in the Propositional Closure of a Qualitative Algebra.",
                    "How to Argue for Anything: Enforcing Arbitrary Sets of Labellings using AFs.",
                    "Knowledge Maps of Web Graphs.",
                    "ASP Encodings of Acyclicity Properties.",
                    "Tracking Beliefs and Intentions in the Werewolf Game.",
                    "Representing and Reasoning about Time Travel Narratives: Foundational Concepts.",
                    "Aggregative Deontic Detachment for Normative Reasoning.",
                    "Action Theories over Generalized Databases with Equality Constraints (Extended Abstract).",
                    "An Abductive Reasoning Approach to the Belief Bias Effect.",
                    "Minimal Change in AGM Revision for Non-Classical Logics.",
                    "Predicting Performance of OWL Reasoners: Locally or Globally?",
                    "Canonical Logic Programs are Succinctly Incomparable with Propositional Formulas.",
                    "Heuristic Guided Optimization for Propositional Planning.",
                    "First-Order Default Logic Revisited.",
                    "Ontology-Based Monitoring of Dynamic Systems.",
                    "Datalog+/-: Questions and Answers."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th KR 2012",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2012",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Thirteenth International Conference, KR 2012, Rome, Italy, June 10-14, 2012.",
                "count": 76,
                "papers": [
                    "Conference Committee.",
                    "Area Chairs and Program Committee.",
                    "Preface.",
                    "Lecture in Remembrance of John McCarthy.",
                    "Invited Talks.",
                    "Stable Models of Formulas with Intensional Functions.",
                    "Efficiently Computable Datalog∃ Programs.",
                    "Logic Programs with Intensional Functions.",
                    "Answer Set Programming via Mixed Integer Programming.",
                    "On the Small-Scope Hypothesis for Testing Answer-Set Programs.",
                    "Complexity-Sensitive Decision Procedures for Abstract Argumentation.",
                    "Fixpoints and Iterated Updates in Abstract Argumentation.",
                    "On Unit-Refutation Complete Formulae with Existentially Quantified Variables.",
                    "Fixed-Parameter Algorithms for Finding Minimal Models.",
                    "A Generic Querying Algorithm for Greedy Sets of Existential Rules.",
                    "Horn Belief Contraction: Remainders, Envelopes and Complexity.",
                    "Credibility-Limited Revision Operators in Propositional Logic.",
                    "Belief Revision within Fragments of Propositional Logic.",
                    "Ontology Evolution Under Semantic Constraints.",
                    "Belief Revision with Sensing and Fallible Actions.",
                    "Robust Equivalence Models for Semantic Updates of Answer-Set Programs.",
                    "Model Based Horn Contraction.",
                    "Paradoxes of Multiple Elections: An Approximation Approach.",
                    "Strong Equivalence of Qualitative Optimization Problems.",
                    "Ranking Sets of Possibly Interacting Objects Using Shapley Extensions.",
                    "An Axiomatic Framework for Influence Diagram Computation with Partially Ordered Utilities.",
                    "Query Containment in Description Logics Reconsidered.",
                    "Undecidability of Fuzzy Description Logics.",
                    "Acyclicity Conditions and their Application to Query Answering in Description Logics.",
                    "Rewriting Ontological Queries into Small Nonrecursive Datalog Programs.",
                    "Practical Reasoning with Nominals in the EL Family of Description Logics.",
                    "Conjunctive Query Answering with OWL 2 QL.",
                    "An Automata-Theoretic Approach to Uniform Interpolation and Approximation in the Description Logic EL.",
                    "Non-Uniform Data Complexity of Query Answering in Description Logics.",
                    "High Performance Query Answering over DL-Lite Ontologies.",
                    "An Abstraction Technique for the Verification of Artifact-Centric Systems.",
                    "Ambiguous Language and Differences in Beliefs.",
                    "Automated Verification of Epistemic Properties for General Game Playing.",
                    "Only-Knowing Meets Nonmonotonic Modal Logic.",
                    "Abstract Normative Systems: Semantics and Proof Theory.",
                    "Ordered Epistemic Logic: Semantics, Complexity and Applications.",
                    "Declarative Entity Resolution via Matching Dependencies and Answer Set Programs.",
                    "Paraconsistent Hybrid Theories.",
                    "Homogeneous Logical Proportions: Their Uniqueness and Their Role in Similarity-Based Prediction.",
                    "From Knowledge Represented in Frame-Based Languages to Declarative Representation and Reasoning via ASP.",
                    "Specifying and Reasoning with Underspecified Knowledge Bases Using Answer Set Programming.",
                    "Generalized Ontology-Based Production Systems.",
                    "Abstracting Abstraction in Search with Applications to Planning.",
                    "Synthesizing Agent Protocols From LTL Specifications Against Multiple Partially-Observable Environments.",
                    "Bounded Situation Calculus Action Theories and Decidable Verification.",
                    "Temporal Composite Actions with Constraints.",
                    "Conflict-Based Diagnosis of Discrete Event Systems: Theory and Practice.",
                    "Compactness and Its Implications for Qualitative Spatial and Temporal Reasoning.",
                    "Implicit Constraints for Qualitative Spatial and Temporal Reasoning.",
                    "Stable Models in Generalized Possibilistic Logic.",
                    "A Bipolar Framework for Combining Beliefs about Vague Propositions.",
                    "JASP: A Framework for Integrating Answer Set Programming with Java.",
                    "The Winograd Schema Challenge.",
                    "Exchanging Description Logic Knowledge Bases.",
                    "Extending Unification in EL Towards General TBoxes.",
                    "Solving Puzzles Described in English by Automated Translation to Answer Set Programming and Learning How to Do that Translation.",
                    "Modelling Time and Reliability in Structured Argumentation Frameworks.",
                    "The Complexity of Explaining Negative Query Answers in DL-Lite.",
                    "Thinking Inside the Box: A Comprehensive Spatial Representation for Video Analysis.",
                    "Weighted Attacks in Argumentation Frameworks.",
                    "Efficient Argumentation for Medical Decision-Making.",
                    "Compositional Belief Merging.",
                    "Worst-Case Optimal Reasoning with Forest Logic Programs.",
                    "Stream Reasoning with Answer Set Programming: Preliminary Report.",
                    "Achieving Completeness in Bounded Model Checking of Action Theories in ASP.",
                    "Justification Masking in Ontologies.",
                    "Search Strategy Simulation in Constraint Booleanization.",
                    "Revising Partial Pre-Orders with Partial Pre-Orders: A Unit-Based Revision Framework.",
                    "Towards Parallel Nonmonotonic Reasoning with Billions of Facts.",
                    "Forgetting in Logic Programs under Strong Equivalence.",
                    "Assertion Absorption in Object Queries over Knowledge Bases."
                ]
            },
            {
                "sub_name_abbr": "conf/kr/2012kibp",
                "sub_name": "Proceedings of the 1st International Workshop on Knowledge-intensive Business Processes, KiBP@KR 2012, Rome, Italy, June 15, 2012.",
                "count": 8,
                "papers": [
                    "Integrated Data and Process Management: Finally?",
                    "A Logic-Based Approach to Business Process Customization.",
                    "Automatic Detection of Business Process Interference.",
                    "Semantically-Governed Data-Aware Processes.",
                    "Knowledge-intensive Processes: An Overview of Contemporary Approaches.",
                    "Business Processes Verification with Temporal Answer Set Programming.",
                    "A Knowledge-based Approach to the Configuration of Business Process Model Abstractions.",
                    "Modular Representation of a Business Process Planner."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th KR 2010",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2010",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Twelfth International Conference, KR 2010, Toronto, Ontario, Canada, May 9-13, 2010.",
                "count": 72,
                "papers": [
                    "Invited Presentations at the Twelfth International Conference on Principles of Knowledge Representation and Reasoning.",
                    "Reasoning about Actions and Change: From Single Agent Actions to Multi-Agent Actions (Extended Abstract).",
                    "Tutorial Presentations at the Twelfth International Conference on Principles of Knowledge Representation and Reasoning.",
                    "Complexity of Propositional Abduction for Restricted Sets of Boolean Functions.",
                    "New Advances in Sequential Diagnosis.",
                    "Diagnosis as Planning Revisited.",
                    "Interactions between Time and Knowledge in a First-order Logic for Multi-Agent Systems.",
                    "Multi-Agent Only-Knowing Revisited.",
                    "Distributed Nonmonotonic Multi-Context Systems.",
                    "Modelling Combinatorial Auctions in Linear Logic.",
                    "Integrating Action Calculi and AgentSpeak: Closing the Gap.",
                    "One Hundred Prisoners and a Lightbulb - Logic and Computation.",
                    "Abstract Dialectical Frameworks.",
                    "Towards Fixed-Parameter Tractable Algorithms for Argumentation.",
                    "Characterizing Strong Equivalence for Argumentation Frameworks.",
                    "Characterizing Updates in Dynamic Epistemic Logic.",
                    "Horn Clause Contraction Functions: Belief Set and Belief Base Approaches.",
                    "From Causal Models To Counterfactual Structures.",
                    "Taxonomy of Improvement Operators and the Problem of Minimal Change.",
                    "A Characterization of Optimality Criteria for Decision Making under Complete Ignorance.",
                    "I Don't Want to Think About it Now: Decision Theory with Costly Computation.",
                    "Query and Predicate Emptiness in Description Logics.",
                    "Decidability of a Description Logic over Infinite-Valued Product Logic.",
                    "Pushing the Limits of Reasoning over Ontologies with Hidden Content.",
                    "Status QIO: Conjunctive Query Entailment Is Decidable.",
                    "Decomposing Description Logic Ontologies.",
                    "The Combined Approach to Query Answering in DL-Lite.",
                    "Understanding Ontological Levels.",
                    "Worst-Case Optimal Reasoning for the Horn-DL Fragments of OWL 1 and 2.",
                    "On the Complexity of Axiom Pinpointing in the EL Family of Description Logics.",
                    "Improving Query Answering over DL-Lite Ontologies.",
                    "On the Application of the Disjunctive Syllogism in Paraconsistent Logics Based on Four States of Information.",
                    "Maximally Paraconsistent Three-Valued Logics.",
                    "A Class of df-Consistencies for Qualitative Constraint Networks.",
                    "Finding Explanations of Inconsistency in Multi-Context Systems.",
                    "Computing Inconsistency Measurements under Multi-Valued Semantics by Partial Max-SAT Solvers.",
                    "Generalized Planning with Loops under Strong Fairness Constraints.",
                    "A Correctness Result for Reasoning about One-Dimensional Planning Problems.",
                    "On the Classical Content of Monadic G with Involutive Negation and its Application to a Fuzzy Medical Expert System.",
                    "Novel Semantical Approaches to Relational Probabilistic Conditionals.",
                    "Probabilistic Description Logics for Subjective Uncertainty.",
                    "Preferential Semantics for Plausible Subsumption in Possibility Theory.",
                    "From Preference Logics to Preference Languages, and Back.",
                    "Finding the Next Solution in Constraint- and Preference-Based Knowledge Representation Formalisms.",
                    "State Defaults and Ramifications in the Unifying Action Calculus.",
                    "Situation Calculus Based Programs for Representing and Reasoning about Game Structures.",
                    "Reasoning about Deterministic Actions with Probabilistic Prior and Application to Stochastic Filtering.",
                    "Walking the Decidability Line for Rules with Existential Variables.",
                    "A Decidable Class of Groundable Formulas in the General Theory of Stable Models.",
                    "Paracoherent Answer Set Programming.",
                    "Repair and Prediction (under Inconsistency) in Large Biological Networks with Answer Set Programming.",
                    "Tractable Answer-Set Programming with Weight Constraints: Bounded Treewidth Is not Enough.",
                    "On the Progression Semantics and Boundedness of Answer Set Programs.",
                    "Independence and Functional Dependence Relations on Secrets.",
                    "Interpreting Topological Logics over Euclidean Spaces.",
                    "Reasoning with Logical Proportions.",
                    "Reasoning about Context in Ambient Intelligence Environments: A Report from the Field.",
                    "Formalizing Psychological Knowledge in Answer Set Programming.",
                    "A Logical Understanding of Legal Interpretation.",
                    "Ontologies for Dates and Duration.",
                    "From Justifications Towards Proofs for Ontology Engineering.",
                    "Joint Revision of Beliefs and Intention.",
                    "The Temporal Logic of Token Causes.",
                    "An Efficient Majority-Rule-Based Approach for Collective Decision Making with CP-Nets.",
                    "A Layered Graph Representation for Complex Regions.",
                    "The Modular Structure of an Ontology: An Empirical Study.",
                    "Towards a Logic of Feature-Based Semantic Science Theories.",
                    "Efficient Dominance Testing for Unconditional Preferences.",
                    "Set-Oriented Logical Connectives: Syntax and Semantics.",
                    "Towards Runtime Support for Norm-Governed Multi-Agent Systems.",
                    "Revising General Knowledge Bases in Description Logics.",
                    "Forgetting Revisited."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th KR 2008",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2008",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Eleventh International Conference, KR 2008, Sydney, Australia, September 16-19, 2008.",
                "count": 71,
                "papers": [
                    "Preferences, Planning and Control.",
                    "Beyond Nash Equilibrium: Solution Concepts for the 21st Century.",
                    "Reasoning about Agent Deliberation.",
                    "A Logical Framework to Represent and Reason about Graded Preferences and Intentions.",
                    "A Logical Account of Institutions: From Acceptances to Norms via Legislators.",
                    "Dynamic Logic on Games with Structured Strategies.",
                    "Promises Kept, Promises Broken: An Axiomatic and Quantitative Treatment of Fulfillment.",
                    "Taming the Infinite Chase: Query Answering under Expressive Relational Constraints.",
                    "Accuracy and Efficiency of Fixpoint Methods for Approximate Query Answering in Locally Complete Databases.",
                    "Injecting the How into the What: Investigating a Finite Classical Logic.",
                    "Approximate Reasoning in First-Order Logic Theories.",
                    "Making Decisions through Preference-Based Argumentation.",
                    "Revision of an Argumentation System.",
                    "An Abstract Argumentation Framework with Varied-Strength Attacks.",
                    "Equilibria in Social Belief Removal.",
                    "Horn Clause Belief Change: Contraction Functions.",
                    "Linking Iterated Belief Change Operations to Nonmonotonic Reasoning.",
                    "Improvement Operators.",
                    "Scenario Update Applied to Causal Reasoning.",
                    "Defaults and Normality in Causal Structures.",
                    "On Notions of Causality and Distributed Knowledge.",
                    "Complexity of Abduction in the EL Family of Lightweight Description Logics.",
                    "Path-Based Identification Constraints in Description Logics.",
                    "View-Based Query Answering over Description Logic Ontologies.",
                    "Unions of Conjunctive Queries in SHOQ.",
                    "Model-Theoretic Characterization of Asher and Vieu's Ontology of Mereotopology.",
                    "RIQ and SROIQ Are Harder than SHOIQ.",
                    "Can You Tell the Difference Between DL-Lite Ontologies?.",
                    "Representing Structured Objects using Description Graphs.",
                    "How Many Toes Do I Have? Parthood and Number Restrictions in Description Logics.",
                    "Ontology Generation through the Fusion of Partial Reuse and Relation Extraction.",
                    "Peer-to-Peer Query Answering with Inconsistent Knowledge.",
                    "How to Choose Weightings to Avoid Collisions in a Restricted Penalty Logic.",
                    "Conflict-Based Merging Operators.",
                    "Measuring Inconsistency through Minimal Inconsistent Sets.",
                    "Inconsistency Management Policies.",
                    "A First Experimental Demonstration of Massive Knowledge Infusion.",
                    "A Principled Framework for Modular Web Rule Bases and Its Semantics.",
                    "Computing Loops with at Most One External Support Rule.",
                    "Belief Revision of Logic Programs under Answer Set Semantics.",
                    "Conflict-Driven Disjunctive Answer Set Solving.",
                    "Notions of Strong Equivalence for Logic Programs with Ordered Disjunction.",
                    "On Loop Formulas with Variables.",
                    "Answer Set Programming with Functions.",
                    "Default Theory of Defeasible Entailment.",
                    "Semantic Preferential Subsumption.",
                    "Embedding Approaches to Combining Rules and Ontologies into Autoepistemic Logic.",
                    "Computing Default Extensions by Reductions on OR.",
                    "A Lexicographic Inference for Partially Preordered Belief Bases.",
                    "On the Complexity of Planning Operator Subsumption.",
                    "Deductive Planning with Inductive Loops.",
                    "Planning Graphs and Propositional Clause-Learning.",
                    "On the Relative Expressiveness of ADL and Golog: The Last Piece in the Puzzle.",
                    "Relational Preference Rules for Control.",
                    "Reasoning with Qualitative Preferences and Cardinalities using Generalized Circumscription.",
                    "Dealing with Incomplete Agents' Preferences and an Uncertain Agenda in Group Decision Making via Sequential Majority Voting.",
                    "Preference Modeling by Weighted Goals with Max Aggregation.",
                    "A Logic for Non-Terminating Golog Programs.",
                    "ConGolog, Sin Trans: Compiling ConGolog into Basic Action Theories for Planning and Beyond.",
                    "Complex Epistemic Modalities in the Situation Calculus.",
                    "Proving Goal Achievability.",
                    "Cartesian Situations and Knowledge Decomposition in the Situation Calculus.",
                    "Behavior Composition in the Presence of Failure.",
                    "Action Theory Erasure and Minimal Change.",
                    "First-Order Strong Progression for Local-Effect Basic Action Theories.",
                    "Formalising Temporal Constraints on Part-Whole Relations.",
                    "LTL over Description Logic Axioms.",
                    "Time Representation and Temporal Reasoning from the Perspective of Non-Standard Analysis.",
                    "A Complete First-Order Logic of Knowledge and Time.",
                    "Automated Complexity Proofs for Qualitative Spatial and Temporal Calculi.",
                    "Identifying Objects Over Time with Description Logics."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "10th KR 2006",
        "info": "Lake District of the United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2006",
                "sub_name": "Proceedings, Tenth International Conference on Principles of Knowledge Representation and Reasoning, Lake District of the United Kingdom, June 2-5, 2006.",
                "count": 52,
                "papers": [
                    "On Mechanization of Thought Processes (Extended Abstract).",
                    "Dataspaces: Co-existence with Heterogeneity.",
                    "Users Are Always Right ... Even When They Are Wrong: Making Knowledge Representation Useful and Usable.",
                    "Reasoning about Knowledge of Unawareness.",
                    "Redoing the Foundations of Decision Theory.",
                    "Logical Foundations of Well-Founded Semantics.",
                    "A Theory of Vague Adjectives Grounded in Relevant Observables.",
                    "Updating Description Logic ABoxes.",
                    "The Even More Irresistible SROIQ.",
                    "DL+log: Tight Integration of Description Logics and Disjunctive Datalog.",
                    "Definitorially Complete Description Logics.",
                    "From Wine to Water: Optimizing Description Logic Reasoning for Nominals.",
                    "An Ordered Theory Resolution Calculus for Hybrid Reasoning in First-Order Extensions of Description Logic.",
                    "Constrained Argumentation Frameworks.",
                    "Knowledgebase Compilation for Efficient Logical Argumentation.",
                    "Planning with Qualitative Temporal Preferences.",
                    "Expressive Power of Weighted Propositional Formulas for Cardinal Preference Modeling.",
                    "Decision-Theoretic GOLOG with Qualitative Preferences.",
                    "Variable-Strength Conditional Preferences for Matchmaking in Description Logics.",
                    "Qualitative Decision Making with Bipolar Information.",
                    "Did I Damage My Ontology? A Case for Conservative Extensions in Description Logics.",
                    "Modularity and Web Ontologies.",
                    "Iterated Revision as Prioritized Merging.",
                    "Grounding and the Expression of Belief.",
                    "A Bad Day Surfing Is Better than a Good Day Working: How to Revise a Total Preorder.",
                    "Lack of Finite Characterizations for the Distance-Based Revision.",
                    "Shapley Inconsistency Values.",
                    "Data Complexity of Query Answering in Description Logics.",
                    "A Tree Decomposition Algorithm for Conceptual Graph Projection.",
                    "Propositional DAGs: A New Graph-Based Language for Representing Boolean Functions.",
                    "Representing Policies for Quantified Boolean Formulae.",
                    "First-Order Loop Formulas for Normal Logic Programs.",
                    "Computational Properties of Epistemic Logic Programs.",
                    "Foundations for Knowledge-Based Programs using ES.",
                    "Query Answering under the Any-World Assumption for Normal Logic Programs.",
                    "Replacements in Non-Ground Answer-Set Programming.",
                    "Abductive Visual Perception with Feature Clouds.",
                    "The Features-and-Fluents Semantics for the Fluent Calculus.",
                    "Semantical Considerations for a Logic of Actions: An Imperative Manifesto.",
                    "Actions as Special Cases.",
                    "Strong and Uniform Equivalence of Nonmonotonic Theories - An Algebraic Approach.",
                    "Description Logics with Circumscription.",
                    "Semantics for Dynamic Syntactic Epistemic Logics.",
                    "Probabilistic Abduction without Priors.",
                    "Non-Deterministic Semantics for First-Order Paraconsistent Logics.",
                    "Possibilistic Handling of Uncertain Default Rules with Applications to Persistence Modeling and Fuzzy Default Reasoning.",
                    "Heuristics for Planning with Penalties and Rewards using Compiled Knowledge.",
                    "On the Limits of Planning over Belief States under Strict Uncertainty.",
                    "Temporalizing Cardinal Directions: From Constraint Satisfaction to Planning.",
                    "On the Completeness of Approximation Based Reasoning and Planning in Action Theories with Incomplete Information.",
                    "On Planning with Programs that Sense.",
                    "Planning with Prioritized Goals."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th KR 2004",
        "info": "Whistler, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2004",
                "sub_name": "Principles of Knowledge Representation and Reasoning: Proceedings of the Ninth International Conference (KR2004), Whistler, Canada, June 2-5, 2004.",
                "count": 78,
                "papers": [
                    "Causation and Causal Conditionals.",
                    "Sleeping Beauty Reconsidered: Conditioning and Reflection in Asynchronous Systems.",
                    "Weak Nonmonotonic Probabilistic Logics.",
                    "Knowledge Discovery by Reversing Inductive Knowledge Representation.",
                    "Multidimensional Mereotopology.",
                    "Parthood as Spatial Inclusion - Evidence from biomedical Conceptualizations.",
                    "A Logic-Based Formulation of Active Visual Perception.",
                    "Indoor Environment Classification and Perceptual Matching.",
                    "A Logic of Motion.",
                    "Axiomatizing the Cyclic Interval Calculus.",
                    "What's in a Model? Epistemological Analysis of Logic Programming.",
                    "Ontological Theory for Ontological Engineering: Biomedical Systems Information Integration.",
                    "Intransitivity and Vagueness.",
                    "An Experimental Analysis of Possibilistic Default Reasoning.",
                    "Combining Answer Set Programming with Description Logics for the Semantic Web.",
                    "Reducing SHIQ-Description Logic to Disjunctive Datalog Programs.",
                    "Optimization Techniques for Retrieving Resources Described in OWL/RDF Documents: First Results.",
                    "Reaching Agreement Through Argumentation: A Possibilistic Approach.",
                    "Characterization of Semantics for Argument Systems.",
                    "On the Use of an ATMS for Handling Conflicting Desires.",
                    "Expressive Power and Succinctness of Propositional Languages for Preference Representation.",
                    "Complex Preferences for Answer Set Optimization.",
                    "GAI Networks for Utility Elicitation.",
                    "A First-Order Theory of Communicating First-Order Formulas.",
                    "Observation Expectation Reasoning in Agent Systems.",
                    "Regulative and Constitutive Norms in Normative Multiagent Systems.",
                    "Social Roles and their Descriptions.",
                    "Ontological Knowledge Base Reasoning with Sort-Hierarchy and Rigidity.",
                    "The Four Dimensions of Artifacts.",
                    "How to Interweave Knowledge about Object Structure and Concepts.",
                    "Logical Foundations of Negotiation: Strategies and Preferences.",
                    "Distance Semantics for Relevance-Sensitive Belief Revision.",
                    "A Unified Treatment for Knowledge Dynamics.",
                    "Updating of a Possibilistic Knowledge Base by Crisp or Fuzzy Transition Rules.",
                    "A Split-Combination Method for Merging Inconsistent Possibilistic Knowledge Bases.",
                    "On Merging Strategy-Proofness.",
                    "Satisfiability for Propositional Contexts.",
                    "Complexity of Model Checking and Bounded Predicate Arities for Non-ground Answer Set Programming.",
                    "Automated Reformulation of Specifications by Safe Delay of Constraints.",
                    "Towards a Structured Analysis of Approximate Problem Solving: A Case Study in Classification.",
                    "Improving the Forward Chaining Algorithm for Conceptual Graphs Rules.",
                    "Inferential Complexity Control for Model-Based Abduction.",
                    "A Causal Logic of Logic Programming.",
                    "Condensed Representations for Inductive Logic Programming.",
                    "On Eliminating Disjunctions in Stable Logic Programming.",
                    "Approximative Query Techniques for Agents with Heterogeneous Ontologies and Perceptive Capabilities.",
                    "What to Ask to a Peer: Ontolgoy-based Query Reformulation.",
                    "Qualitative Probabilistic Matching with Hierarchical Descriptions.",
                    "A Question-Answering System for AP Chemistry: Assessing KR&R Technologies.",
                    "GlossOnt: A Concept-focused Ontology Building Tool.",
                    "Towards a Quantitative, Platform-Independent Analysis of Knowledge Systems.",
                    "Situations, Si! Situation Terms, No!",
                    "C&L Intention Revisited.",
                    "Discovering State Invariants.",
                    "Inductive Situation Calculus.",
                    "Reasoning about Triggered Actions in AnsProlog and Its Application to Molecular Interactions in Cells.",
                    "A Logic of Arbitrary and Indefinite Objects.",
                    "Reasoning about Knowledge by Variable Forgetting.",
                    "A Logic of Limited Belief for Reasoning with Disjunctive Information.",
                    "Majority Logic.",
                    "Partial Implication Semantics for Desirable Propositions.",
                    "Extending the Knowledge-Based Approach to Planning with Incomplete Information and Sensing.",
                    "Knowledge of Other Agents and Communicative Actions in the Fluent Calculus.",
                    "Precondition Control and the Progression Algorithm.",
                    "A Preference-Based Interpretation of Other Agents' Actions.",
                    "From Hybrid Systems to Universal Plans Via Domain Compilation.",
                    "Planning Graphs and Knowledge Compilation.",
                    "Domain-Specific Preferences for Causal Reasoning and Planning.",
                    "Learning Probabilistic Relational Planning Rules.",
                    "An Improved Integer Local Search for Complex Scheduling Problems.",
                    "Breadth-First Heuristic Search.",
                    "Phase Transitions in Classical Planning: An Experimental Study.",
                    "A Polynomial-Time Algorithm for Constructing k-Maintainable Policies.",
                    "Advanced Research with Autonomous Unmanned Aerial Vehicles.",
                    "Evidence and Belief.",
                    "What Is OWL (and Why Should I Care)?",
                    "Historical Remarks on Nonmonotonic Reasoning, Especially Circumscription.",
                    "Meaning and Links: A Semantic Odyssey."
                ]
            },
            {
                "sub_name_abbr": "conf/krmed/2004",
                "sub_name": "KR-MED 2004, First International Workshop on Formal Biomedical Knowledge Representation, Proceedings of the KR 2004 Workshop on Formal Biomedical Knowledge Representation, Whistler, BC, Canada, 1 June 2004.",
                "count": 11,
                "papers": [
                    "Axioms for parthood and containment relations in bio-ontologies.",
                    "Investigating subsumption in DL-based terminologies: A Case Study in SNOMED CT .",
                    "STEEL: A spatio-temporal extended event language for tracking epidemic spread from outbreak reports.",
                    "Using semantic dependencies for consistency management of an ontology of brain-cortex anatomy.",
                    "Weaving the biomedical Semantic Web with the Prote'ge' OWL Plugin.",
                    "Symbolic modeling of structural relationships in the Foundational Model of Anatomy .",
                    "Towards a computational paradigm for biomedical structure.",
                    "Examining SNOMED from the perspective of formal ontological principles: Some preliminary analysis and observations .",
                    "Representing the MeSH in OWL: Towards a semi-automatic migration.",
                    "Using C-OWL for the alignment and merging of medical ontologies.",
                    "Lessons learned from aligning two representations of anatomy."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "8th KR 2002",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2002",
                "sub_name": "Proceedings of the Eights International Conference on Principles and Knowledge Representation and Reasoning (KR-02), Toulouse, France, April 22-25, 2002.",
                "count": 55,
                "papers": [
                    "A Logical Account of Perception Incorporating Feedback and Expectation.",
                    "Abducing Qualitative Spatio-Temporal Histories from Partial Observations.",
                    "Building Large Composition Tables via Axiomatic Theories.",
                    "Design and Comparison of Lattices of Topological Relations Based on Galois Lattice Theory.",
                    "Complexity Results for Explanations in the Structural-Model Approach.",
                    "Complexity Results for Paraconsistent Inference Relations.",
                    "Evaluation-Based Reasoning with Disjunctive Information in First-Order Knowledge Bases.",
                    "The Complexity of Model Checking for Knowledge Update.",
                    "Distance Based Merging: A General Framework and some Complexity Results.",
                    "On the Frontier between Arbitration and Majority.",
                    "CP-nets: Reasoning and Consistency Testing.",
                    "On the Limitations of Ordinal Approaches to Decision-making.",
                    "A Structural Approach to Default Reasoning.",
                    "Qualitative Choice Logic.",
                    "Reducing Strong Equivalence of Logic Programs to Entailment in Classical Propositional Logic.",
                    "Ultimate Approximations in Nonmonotonic Knowledge Representation Systems.",
                    "Adding Numbers to the SHIQ Description Logic: First Results.",
                    "Approximation and Difference in Description Logics.",
                    "Connecting Abstract Description Systems.",
                    "Evaluating a Modular Abox Algorithm.",
                    "Resolving Inconsistencies by Variable Forgetting.",
                    "Updating Contexts.",
                    "Many-Sorted Preference Relations.",
                    "From Preference Representation to Combinatorial Vote.",
                    "A Transition Function Based Characterization of Actions with Delayed and Continuous Effects.",
                    "Knowledge Equivalence in Combined Action Theories.",
                    "Projection in Decomposed Situation Calculus.",
                    "Observations and the Probabilistic Situation Calculus.",
                    "A Model-Based Diagnosis Framework for Distributed Embedded Systems.",
                    "Eliminating Incoherence from Subjective Estimates of Chance.",
                    "Evolving Ontologies in Distributed and Dynamic Settings.",
                    "Social Contraction and Belief Negotiation.",
                    "Necessary Parts and Wholes in Bio-Ontologies.",
                    "Physical Objects, Identity and Vagueness.",
                    "A Logical Approach to Factoring Belief Networks.",
                    "Bipolar Representation and Fusion of Preferences on the Possibilistic Logic framework.",
                    "A Fuzzy Approach to Flexible Case-based Querying: Methodology and Experimentation.",
                    "A Generic Approach for Knowledge-Based Information-Site Selection.",
                    "Declarative & Procedural Goals in Intelligent Agent Systems.",
                    "Adapting Golog for Composition of Semantic Web Services.",
                    "Belief Extrapolation (or how to Reason About Observations and Unpredicted Change).",
                    "Constraint Satisfaction on Infinite Domains: Composing Domains and Decomposing Constraints.",
                    "Judgements about spatio-temporal relations.",
                    "Scientific Benchmarking with Temporal Logic Decision Procedures.",
                    "As Time Goes by: Automatic Complexity Analysis of Simplified Rules.",
                    "Inference Complexity as a Model-Selection Criterion for Learning Bayesian Networks.",
                    "On the Logic of d-separation.",
                    "Solving QBF by SMV.",
                    "Reasoning about Actions and Planning in LTL Action Theories.",
                    "On the Semantics of Deliberation in IndiGolog: From Theory to Implementation.",
                    "Actions and Other Events in Situation Calculus.",
                    "The Role of Higher Order Similarity in Induction and Concept Formation.",
                    "The Semantic Web: KR's Worst Nightmare?.",
                    "The Philosophical Soccer Player.",
                    "Panel: Are Upper-Level Ontologies Worth the Effort?."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th KR 2000",
        "info": "Breckenridge, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/2000",
                "sub_name": "KR 2000, Principles of Knowledge Representation and Reasoning Proceedings of the Seventh International Conference, Breckenridge, Colorado, USA, April 11-15, 2000.",
                "count": 64,
                "papers": [
                    "Spatio-temporal representation and reasoning based on RCC-8.",
                    "Spatial Locations via Morpho-Mereology.",
                    "Continuous Motion in Discrete Space.",
                    "The Representation of Discrete Multi-resolution Spatial Knowledge.",
                    "Finding Admissible and Preferred Arguments Can be Very Hard.",
                    "Complexity Results for Default Reasoning from Conditional Knowledge Bases.",
                    "Uniform semantic treatment of default and autoepistemic logic.",
                    "Missionaries and Cannibals in the Causal Calculator.",
                    "Narratives as Programs.",
                    "Representing the Knowledge of a Robot.",
                    "A Logic Programming Approach to Conflict Resolution in Policy Management.",
                    "On the Difference between Merging Knowledge Bases and Combining them.",
                    "BReLS: A System for the Integration of Knowledge Bases.",
                    "Representing and Aggregating Conflicting Beliefs.",
                    "On Strongest Necessary and Weakest Sufficient Conditions.",
                    "Containment of Conjunctive Regular Path Queries with Inverse.",
                    "Reduction rules and universal variables for first order tableaux and DPLL.",
                    "Deciding K using inverse-K.",
                    "A Compositional Structured Query Approach to Automated Inference.",
                    "An Alternative Combination of Bayesian Networks and Description Logics.",
                    "Independence in qualitative uncertainty frameworks.",
                    "Spatial representation of spatial relationship knowledge.",
                    "Matching Concept Descriptions with Existential Restrictions.",
                    "Expressive ABox Reasoning with Number Restrictions, Role Hierarchies, and Transitively Closed Roles.",
                    "Reasoning with Axioms: Theory and Practice.",
                    "Rewriting Concepts Using Terminologies.",
                    "Formulating diagnostic problem solving using an action language with narratives and sensing.",
                    "Anytime Diagnostic Reasoning using Approximate Boolean Constraint Propagation.",
                    "Generation of Diagnostic Knowledge by Discrete-Event Model Compilation.",
                    "An Algorithm for Belief Revision.",
                    "Two Problems with Reasoning and Acting in Time.",
                    "Cyclical and Granular Time Theories as Subsets of the Herbrand Universe.",
                    "A Model for Reasoning about Topologic Relations between cyclic intervals.",
                    "Partition-Based Logical Reasoning.",
                    "Significant Inferences : Preliminary Report.",
                    "Unfolding Partiality and Disjunctions in Stable Model Semantics.",
                    "Relational Representations that Facilitate Learning.",
                    "Experimental Results on Learning Soft Constraints.",
                    "Propositional Logic and One-Stage Decision Making.",
                    "Logical representation of preferences for group decision making.",
                    "OntoMorph: A Translation System for Symbolic Knowledge.",
                    "An Environment for Merging and Testing Large Ontologies.",
                    "Long-Term Maintanability of Deployed Knowledge Representation Systems.",
                    "Revision: an application in the framework of GIS.",
                    "Approximate Objects and Approximate Theories.",
                    "Iterated Belief Change in the Situation Calculus.",
                    "Ontology-Based Semantics.",
                    "Supporting automated deduction in first-order modal logics.",
                    "Controllability characterization and checking in Contingent Temporal Constraint Networks.",
                    "The Augmented Interval and Rectangle Networks.",
                    "On the complexity of reasoning about repeating events.",
                    "Knowledge Patterns.",
                    "Knowledge Engineering by Large-Scale Knowledge Reuse - Experience from the Medical Domain.",
                    "A Logic Based Language for Parametric Inheritance.",
                    "In search of the right extension.",
                    "Ordering explanations and the structural rules for abduction.",
                    "Valuation-ranked preferential model.",
                    "Planning as Satisfiability with Expressive Action Languages: Concurrency, Constraints and Nondeterminism.",
                    "Learning Generalized Policies in Planning Using Concept Languages.",
                    "Planning with sensing, concurrency, and exogenous events: logical framework and implementation.",
                    "Satisfiability Algorithms and Finite Quantification.",
                    "Desires and Defaults: A Framework for Planning with Inferred Goals.",
                    "Practical Knowledge Representation and the DARPA High Performance Knowledge Bases Project.",
                    "Teaching Knowledge Representation: Challenges and Proposals."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th KR 1998",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1998",
                "sub_name": "Proceedings of the Sixth International Conference on Principles of Knowledge Representation and Reasoning (KR'98), Trento, Italy, June 2-5, 1998.",
                "count": 58,
                "papers": [
                    "Description Logic Framework for Information Integration.",
                    "A Completeness Result for Reasoning with Incomplete First-Order Knowledge Bases.",
                    "A Strategy for Revising Default Theory Extensions.",
                    "Anything Can Happen: On Narratives and Hypothetical Reasoning.",
                    "Combining Narratives.",
                    "How (Not) To Minimize Events.",
                    "A Comparison of the Static and the Disjunctive Well-Founded Semantics and its Implementation.",
                    "Preferred Answer Sets for Extended Logic Programs.",
                    "Dynamic Logic Programming.",
                    "Foundations of Spatioterminological Reasoning with Description Logics.",
                    "A Model for Reasoning about Bidemsional Temporal Relations.",
                    "A Qualitative Theory of Motion Based on Spatio-Temporal Primitives.",
                    "On the Compilability of Diagnosis, Planning, Reasoning about Actions, Belief Revision, etc.",
                    "Compiling Devices: A Structure-Based Approach.",
                    "Explanatory Diagnosis: Conjecturing Actions to Explain Observations.",
                    "Comparing Consequence Relations.",
                    "SYSTEM JZ - How to Build a Canonical Ranking Model of a Default Knowledge Base.",
                    "Pointwise Circumscription Revisited.",
                    "Satisfiability planning with Causal Theories.",
                    "On Measuring Plan Quality (A Preliminary Report).",
                    "Modal Semantics for Knowledge Bases Dealing with Vague Concepts.",
                    "A Theory of Granularity and its Application to Problems of Polysemy and Underspecification of Meaning.",
                    "The PMA and Relativizing Minimal Change for Action Update.",
                    "Quantifiers and Operations on Modalities and Contexts.",
                    "Local Models Semantics, or Contextual Reasoning = Locality + Compatibility.",
                    "Concurrent Actions and Interacting Effects.",
                    "Logic Based Modelling of Goal-Directed Behavior.",
                    "AOL: A logic of Acting, Sensing, Knowing, and Only Knowing.",
                    "A Canonical Model of the Region Connection Calculus.",
                    "Undecidability of Plane Polygonal Mereotopology.",
                    "Complexity Results for Independence and Definability in Propositional Logic.",
                    "The Complexity of Model Checking in Modal Event Calculi with Quantifiers.",
                    "Probabilistic Deduction with Conditional Constraints over Basic Events.",
                    "Specifying Transactions for Extended Abduction.",
                    "The KR System dlv: Progress Report, Comparisons and Benchmarks.",
                    "Disjunctive Ordered Logic: Semantics and Expressiveness.",
                    "Modeling an Agent's Incomplete Knowledge During Planning and During Execution.",
                    "Reformulating Temporal Plans for Efficient Execution.",
                    "Execution Monitoring of High-Level Robot Programs.",
                    "A General Approach for Inconsistency Handling and Merging Information in Prioritized Knowledge Bases.",
                    "Formal Theory Building Using Automated Reasoning Tools.",
                    "On the Logic of Merging.",
                    "Characterizing the Semantics of Terminological Cycles in ALN Using Finite Automata.",
                    "On the Decidability of Description Logics with Modal Operators.",
                    "Nested Graphs: A Graph-based Knowledge Representation Model with FOL Semantics.",
                    "Situation Calculus and Causal Logic.",
                    "Sequential, Temporal GOLOG.",
                    "Building Models of Prediction Theories.",
                    "Reasoning About Infinite Random Structures with Relational Bayesian Networks.",
                    "Geometric Foundations for Interval-Based Probabilities.",
                    "Making Decision in a Qualitative Setting: from Decision under Uncertaintly to Case-based Decision.",
                    "Encoding Planning Constraints into Partial Order Planners.",
                    "A Planning Algorithm not based on Directional Search.",
                    "More Evaluation of Decision Procedures for Modal Logics.",
                    "Using an Expressive Description Logic: FaCT or Fiction?",
                    "How to Tailor Representations to Different Requirements.",
                    "What Robots Can Do.",
                    "Description Logics and their Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/eurovav/1998",
                "sub_name": "1998 European Workshop on Validation and Verification of Knowledge-Based Systems, EUROVAV@KR 1998, IRST, Povo, Trento, Italy June 6-8, 1998.",
                "count": 12,
                "papers": [
                    "Multi-Level Verification of Clinical Protocols.",
                    "Knowledge-Based Systems for power system control centers: validation and verification?",
                    "Inductive verification and validation of multi agent systems.",
                    "Multiagent Systems Verification via Model Checking.",
                    "Compositional Verification of Agents in Dynamic Environments: a Case Study.",
                    "Declarative Formalization of Heuristics.",
                    "Verifying and Validating a Task/Method Knowledge-Base.",
                    "MECORI: a method for knowledge base semantic verification based on integrity constraints.",
                    "Formal methods in the development of safety critical Knowledge-Based components.",
                    "Extracting complete and consistent knowledge patterns from data.",
                    "Characterising approximate problem solving: by partially fulfilled pre- and postconditions.",
                    "Lower Bounds on the Size of Test Data Sets."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5th KR 1996",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1996",
                "sub_name": "Proceedings of the Fifth International Conference on Principles of Knowledge Representation and Reasoning (KR'96), Cambridge, Massachusetts, USA, November 5-8, 1996.",
                "count": 63,
                "papers": [
                    "Natural Actions, Concurrency and Continuous Time in the Situation Calculus.",
                    "Only Knowing in the Situation Calculus.",
                    "Modeling Complex Systems in the Situation Calculus: A Case Study Using the Dagstuhl Steam Boiler Problem.",
                    "The PMA Revisited.",
                    "Causality and the Qualification Problem.",
                    "Reasoning about Discontinuities in the Event Calculus.",
                    "Determining Ramifications in the Situation Calculus.",
                    "Embracing Occlusion in Specifying the Indirect Effects of Actions.",
                    "Assessments of Ramification Methods that Use Static Domain Constraints.",
                    "Strategic Advice for Hierarchical Planners.",
                    "Efficiency Competition through Representation Changes: Pigeonhole Principle vs. Integer Programming Methods.",
                    "On the Role of Disjunctive Representations and Constraint Propagation in Refinement Planning.",
                    "Symmetry-Breaking Predicates for Search Problems.",
                    "Procedural Reasoning in Constraint Satisfaction.",
                    "Representing Sensing Actions: The Middle Ground Revisited.",
                    "A New Algorithm for Generative Planning.",
                    "Moving a Robot: The KR&R Approach at Work.",
                    "Semantical Foundations of Spatial Logics.",
                    "A Pointless Theory of Space Based on Strong Connection and Congruence.",
                    "Representing Spatial Vagueness: A Mereological Approach.",
                    "Scaling Up Goal Recognition.",
                    "Computing Approximate Diagnoses By Using Approximate Entailment.",
                    "Inheriting Well-formed Formulae in a Formula-Agumented Semantic Network.",
                    "Partial Orders of Sorts and Inheritances (or Placing Inheritance in Context).",
                    "Finite Model Reasoning in Description Logics.",
                    "A SAT-based Decision Procedure for ALC.",
                    "TBox and ABox Reasoning in Expressive Description Logics.",
                    "Number Restrictions on Complex Roles in Description Logics: A Preliminary Report.",
                    "Asking Queries about Frames.",
                    "Tractable Subclasses of the Point-Interval Algebra: A Complete Classification.",
                    "Comparing Space Efficiency of Propositional Knowledge Representation Formalisms.",
                    "Encoding Plans in Propositional Logic.",
                    "Implementing Modal and Relevance Logics in a Logical Framework.",
                    "\"Statistical\" First Order Conditionals.",
                    "Towards a Practical Approach to Belief Revision: Reason-Based Change.",
                    "Belief Revision: A Critique.",
                    "Modeling Belief Change using Counterfactuals.",
                    "Preferential Multi-Agent Nonmonotonic Logics: Preliminary Report.",
                    "A Representation Theorem for Preferential Logics.",
                    "Representation Independence of Nonmonotonic Inference Relations.",
                    "Value Minimization in Circumscription.",
                    "Biconsequence Relations for Nonmonotonic Reasoning.",
                    "Is There a Logic of Provability for Nonmonotonic Reasoning?",
                    "An Argumentation-theoretic Approach to Reasoning with Specificity.",
                    "Default Reasoning System DeReS.",
                    "Super Logic Programs.",
                    "Utility Independence in a Qualitative Decision Theory.",
                    "On Stable Social Laws and Qualitative Equilibrium for Risk-Averse Agents.",
                    "Multiple Perspective Reasoning.",
                    "Parallel Transitive Reasoning in Mixed Relational Hierarchies.",
                    "DLMS: An Evaluation of KL-ONE in the Automobile Industry.",
                    "On Chronicles: Representation, On-line Recognition and Learning.",
                    "Psychological Constraints on Plausible Default Inheritance Reasoning.",
                    "Do Computers Need Common Sense?",
                    "Actual Possibilities.",
                    "From Here to Human-Level AI.",
                    "Complexity and Expressive Power of KR Formalisms (Invited Talk Abstract).",
                    "Ontologies: What Are They, and Where's The Research?",
                    "Ontologies: What Are They, and Where's The Research?",
                    "Implementations and Research: Discussions at the Boundary.",
                    "Implementations and Research: Discussions at the Boundary.",
                    "Implementations and Research: Discussions at the Boundary.",
                    "Implementations and Research: Discussions at the Boundary."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "4th KR 1994",
        "info": "Bonn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1994",
                "sub_name": "Proceedings of the 4th International Conference on Principles of Knowledge Representation and Reasoning (KR'94). Bonn, Germany, May 24-27, 1994.",
                "count": 60,
                "papers": [
                    "A Computational Account for a Description Logic of Time and Action.",
                    "Proofs in Context.",
                    "An Integrated Implementation of Simulative, Uncertain and Metaphorical Reasoning about Mental States.",
                    "Reasoning with Minimal Models: Efficient Algorithms and Applications.",
                    "Spatial Reasoning with Propositional Logics.",
                    "On the Relation Between Default and Modal Consequence Relations.",
                    "Toward a Logic for Qualitative Decision Theory.",
                    "Belief Ascription and Mental-Level Modelling.",
                    "Default Logic as a Query Language.",
                    "A Unified Framework for Class-Based Representation Formalisms.",
                    "Learning the Classic Description Logic: Theoretical and Experimental Results.",
                    "Directional Resolution: The Davis-Putnam Procedure, Revisited.",
                    "A General Approach to Specificity in Default Reasoning.",
                    "Action Representation for Interpreting Purpose Clauses in Natural Language Instructions.",
                    "Conditional Objects as Nonmonotonic Consequence Relations: Main Results.",
                    "Tractable Closed World Reasoning with Updates.",
                    "A Knowledge-Based Framework for Belief Change, Part II: Revision and Update.",
                    "On the Complexity of Conditional Logics.",
                    "An Efficient Method for Managing Disjunctions in Qualitative Temporal Reasoning.",
                    "GSAT and Dynamic Backtracking.",
                    "Representing Uncertainty in Simple Planners.",
                    "How Far Can We 'C'? Defining a 'Doughnut' Using Connection Alone.",
                    "An Ontology for Engineering Mathematics.",
                    "An Ontology of Meta-Level Categories.",
                    "Defeasible Reasoning with Structured Information.",
                    "On Positive Occurrences of Negation as Failure.",
                    "Probabilistic Reasoning in Terminological Logics.",
                    "On Multiagent Autoepistemic Logic : An Extrospective View.",
                    "Refinement Search as a Unifying Framework for Analyzing Planning Algorithms.",
                    "Actions with Indirect Effects (Preliminary Report).",
                    "An Application of Terminological Logics to Case-based Reasoning.",
                    "Risk-Sensitive Planning with Probabilistic Decision Graphs.",
                    "Easy to be Hard: Difficult Problems for Greedy Algorithms.",
                    "Complexity Results for First-Order Theories of Temporal Constraints.",
                    "Reasoning in Logic about Continuous Systems.",
                    "Enhancing the Power of a Decidable First-Order Reasoner.",
                    "Knowledge, Certainty, Belief, and Conditionalisation (Abbreviated Version).",
                    "How to Progress a Database (and Why) I. Logical Foundations.",
                    "Modalities Over Actions, I. Model Theory.",
                    "Generating Tests Using Abduction.",
                    "Preferential Entailments for Circumscriptions.",
                    "A Decision Method for Nonmomotonic Reasoning Based on Autoepistemic Reasoning.",
                    "A Framework for Part-of Hierarchies in Terminological Logics.",
                    "Means-End Plan Recognition - Towards a Theory of Reactive Recognition.",
                    "Terminological Cycles and the Propositional µ-Calculus.",
                    "Near-Optimal Plans, Tractability, and Reactivity.",
                    "Specification and Evaluation of Preferences Under Uncertainty.",
                    "Making the Difference: A Subtraction Operation for Description Logics.",
                    "Tractable Databases: How to Make Propositional Unit Resolution Complete Through Compilation.",
                    "The Role of Reversible Grammars in Translating Between Representation Languages.",
                    "Constraint Tightness versus Global Consistency.",
                    "Honesty in Partial Logic.",
                    "Mutual Belief Revision (Preliminary Report).",
                    "REVISE: An Extended Logic Programming System for Revising Knowledge Bases.",
                    "Transmutations of Knowledge Systems.",
                    "Knowledge Representation Issues in Integrated Planning and Learning Systems (Abstract).",
                    "Non-Standard Theories of Uncertainty in Knowledge Representation and Reasoning.",
                    "Beyond Ignorance-Based Systems (Abstract).",
                    "Systems vs. Theory vs. ... : KR&R Research Methodologies (Abstract).",
                    "Exploiting Natural Language for Knowledge Representation and Reasoning (Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3rd KR 1992",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1992",
                "sub_name": "Proceedings of the 3rd International Conference on Principles of Knowledge Representation and Reasoning (KR'92). Cambridge, MA, USA, October 25-29, 1992.",
                "count": 69,
                "papers": [
                    "Declarative Knowledge Representation in Planning and Scheduling.",
                    "Intelligent Backtracking Techniques for Job Shop Scheduling.",
                    "Dense Time and Temporal Constraints with !=.",
                    "Managing Disjunction for Practical Temporal Reasoning.",
                    "Infinite Loops in Finite Time: Some Observations.",
                    "Reasoning About Indefinite Actions.",
                    "Representations for Decision-Theoretic Planning: Utility Functions for Deadline Goals.",
                    "Total Order vs. Partial Order Planning: Factors Influencing Performance.",
                    "A Reactive Planner that Uses Explanation Closure.",
                    "UCPOP: A Sound, Complete, Partial Order Planner for ADL.",
                    "An Approach to Planning with Incomplete Information.",
                    "Equivalence and Tractability Results for SAS+ Planning.",
                    "Stepwise-Decomposable Influence Diagrams.",
                    "A Logic for Approximate Reasoning.",
                    "A Spatial Logic based on Regions and Connection.",
                    "Axiomatizing Qualitative Process Theory.",
                    "Reasoning with Analogical Representations.",
                    "Order of Magnitude Reasoning using Logarithms.",
                    "Semantics for Knowledge and Communication.",
                    "Emergent Conventions in Multi-Agent Systems: Initial Experimental Results and Observations (Preliminary Report).",
                    "Knowledge Representation Requirements for Description-Based Communication.",
                    "\"Reducing\" CLASSIC to Practice: Knowledge Representation Theory Meets Reality.",
                    "Towards the Systematic Development of Description Logic Reasoners: CLASP Reconstructed.",
                    "An Empirical Analysis of Optimization Techniques for Terminological Representation Systems, or Making KRIS Get a Move On.",
                    "Terminological Reasoning with Constraint Networks and an Application to Plan Recognition.",
                    "A Preference Semantics for Defaults in Terminological Logics.",
                    "Embedding Defaults into Terminological Knowledge Representation Formalisms.",
                    "Specifying Role Interaction in Concept Languages.",
                    "Approximation in Concept Description Languages.",
                    "Adding Epistemic Operators to Concept Languages.",
                    "A General Semantic Model of Negation in Natural Language: Representation and Inference.",
                    "Conversational Events and Discourse State Change: A Preliminary Report.",
                    "Learning Useful Horn Approximations.",
                    "Tractable Deduction in Knowledge Representation Systems.",
                    "New Results on Local Inference Relations.",
                    "An Order-Sorted Logic with Sort Literals and Disjointness Constraints.",
                    "Quantifier Elimination in Second-Order Predicate Logic.",
                    "An Abstract Architecture for Rational Agents.",
                    "Accessibility in Logics of Explicit Belief.",
                    "A Study in the Logic of Intention.",
                    "Knowledge Representation and Incorporation in a Hybrid System with Feedback.",
                    "Choosing Observations and Actions in Model-Based Diagnosis/Repair Systems.",
                    "Abductive Plan Recognition and Diagnosis: A Comprehensive Empirical Evaluation.",
                    "Using Default and Causal Reasoning in Diagnosis.",
                    "Focusing on Independent Diagnosis Problems.",
                    "A Minimality Maintenance System.",
                    "Search through Systematic Set Enumeration.",
                    "Maps Between Nonmonotonic and Conditional Logic.",
                    "On the Connection between Non-monotonic Inference Systems and Conditional Logics.",
                    "A Promenade from Monotonicity to Non-Monotonicity Following a Theorem Prover.",
                    "Bounding Introspection in Nonmonotonic Logic.",
                    "A Framework for Representing and Characterizing Semantics of Logic Programs.",
                    "Answer Sets in General Nonmonotonic Reasoning (Preliminary Report).",
                    "RS Theory: A Really Skeptical Theory of Inheritance with Exceptions.",
                    "On the Impact of Stratification on the Complexity of Nonmonotonic Reasoning.",
                    "All You Ever Wanted to Know about Tweety (But Were Afraid to Ask).",
                    "Representing Defaults as Sentences with Reduced Priority.",
                    "Rank-based Systems: A Simple Approach to Belief Revision, Belief Update, and Reasoning about Evidence and Actions.",
                    "Representing Default Rules in Possibilistic Logic.",
                    "Normative, Subjunctive, and Autoepistemic Defaults: Adopting the Ramsey Test.",
                    "Asking About Possibilities - Revision and Update Semantics for Subjunctive Queries.",
                    "Reasoning from Inconsistency: A Taxonomy of Principles for Resolving Conflict.",
                    "A Contraction Operator For Classical Propositional Logic.",
                    "A Temporal Revision Model for Reasoning about World Change.",
                    "Computing Knowledge Base Updates.",
                    "An Architecture for Integrating Reasoning Paradigms.",
                    "Concurrency Control for Knowledge Bases.",
                    "The DARPA Knowledge Sharing Effort: A Progress Report.",
                    "Twelve Years of Nonmonotonic Reasoning Research: Where (and What) Is the Beef."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd KR 1991",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1991",
                "sub_name": "Proceedings of the 2nd International Conference on Principles of Knowledge Representation and Reasoning (KR'91). Cambridge, MA, USA, April 22-25, 1991.",
                "count": 61,
                "papers": [
                    "Planning as Temporal Reasoning.",
                    "Temporal Reasoning and Narrative Conventions.",
                    "Reflections about Reflection.",
                    "Nonmonotonic Inferences in Neural Networks.",
                    "Meta-Reasoning in Executable Temporal Logic.",
                    "Pragmatic Logics.",
                    "Metalogic for Knowledge Representation.",
                    "The Monotonic Abduction Problem: A Functional Characterization on the Edge of Tractability.",
                    "A New Formalisation of Subsumption in Frame-Based Representation Systems.",
                    "Integrating Efficient Model-Learning and Problem-Solving Algorithms in Permutation Environments.",
                    "Immortal: A Model-Based Belief Revision System.",
                    "Clustering Temporal Intervals To Generate Reference Hierarchies.",
                    "Default Logic Revisited.",
                    "Plan-Based Terminological Reasoning.",
                    "A Formal Basis for Analogical Reasoning.",
                    "The Complexity of Concept Languages.",
                    "Rational Belief Revision.",
                    "Conditional Objects and Non-Monontonic Reasoning.",
                    "Completable Representations of Constraint Satisfaction Problems.",
                    "A General Framework for Modal Deduction.",
                    "Credulous vs. Sceptical Semantics for Ordered Logic Programs.",
                    "Beyond Negation as Failure.",
                    "Disjective Defaults.",
                    "Partial Programs.",
                    "Computational Considerations in Reasoning about Action.",
                    "The Computational Value of Nonmonotonic Reasoning.",
                    "Updates and Counterfactuals.",
                    "Probably Approximately Optimal Derivation Strategies.",
                    "Generalizing Prioritization.",
                    "Naming and Identity in a Multi-Agent Epistemic Logic.",
                    "A Temporal Probability Logic for Representing Actions.",
                    "Model Checking vs. Theorem Proving: A Manifesto.",
                    "Qualifying Number Restrictions in Concept Languages.",
                    "A Formal Theory of Spatial Reasoning.",
                    "S4 as the Conditional Logic of Nonmonotonicity.",
                    "On the Relation between Explicit and Implicit Belief.",
                    "Toward a Metatheory of Action.",
                    "On the Difference between Updating a Knowledge Base and Revising It.",
                    "Modal Nonmonotonic Logics: Ranges, Characterization, Computation.",
                    "Universal Attachment: An Integration Method for Logic Hybrids.",
                    "Belief Revision and Default Reasoning: Syntax-Based Approaches.",
                    "Generalizing Atoms in Constraint Logic.",
                    "A Theory of Inferred Causation.",
                    "The Logic of Epistemic Inconsistency.",
                    "The Utility of Consistency-Based Diagnostic Techniques.",
                    "Modeling Rational Agents within a BDI-Architecture.",
                    "A Nonmonotonic Assumption-Based TMS Using Stable Bases.",
                    "Assertional Default Theories: A Semantical View.",
                    "A Metalinguistic Treatment of Epistemic Contexts.",
                    "The Completeness of DRAT, A Technique for Automatic Design of Satisfiability Procedures.",
                    "The Feasibility of Defeat in Defeasible Reasoning.",
                    "Qualitative Intercausal Relations, or Explaining \"Explaining Away\".",
                    "Qualitative Simulation with Multivariate Constraints.",
                    "The Ontology and Representation of Situations.",
                    "Skeptical Reason Maintenance is Tractable.",
                    "Nonmonotonic Inferences Based on Expectations: A Preliminary Report.",
                    "Implemented Knowledge Representation and Reasoning Systems: An Endangered Species?",
                    "Panel: Achieving Large Scale Knowledge Sharing.",
                    "Knowledge Sharing: A Feasible Dream.",
                    "Knowledge Interchange Format.",
                    "The Role of Common Ontology in Achieving Sharable, Reusable Knowledge Bases."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "1st KR 1989",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/kr/1989",
                "sub_name": "Proceedings of the 1st International Conference on Principles of Knowledge Representation and Reasoning (KR'89). Toronto, Canada, May 15-18 1989.",
                "count": 51,
                "papers": [
                    "A Non-Reified Temporal Logic.",
                    "A Simple Solution to the Yale Shooting Problem.",
                    "Belief, Metaphorically Speaking.",
                    "Hierarchical Knowledge Bases and Efficient Disjunctive Reasoning.",
                    "Some Results Concerning the Computational Complexity of Abduction.",
                    "On the Appearance of Sortal Literals: a Non Substitutional Framework for Hybrid Reasoning.",
                    "Towards a Theory of Access-Limited Logic for Knowledge Representation.",
                    "Solutions to a Paradox of Perception with Limited Acuity.",
                    "Temporal Constraint Networks.",
                    "Impediments to Universal Preference-Based Default Theories.",
                    "Situated Control Rules.",
                    "Tractable Decision-Analytic Control.",
                    "A General Framework for Sorted Deduction: Fundamental Results on Hybrid Reasoning.",
                    "Default Reasoning, Minimality and Coherence.",
                    "Induction as Nonmonotonic Inference.",
                    "Ontological Assumptions in Knowledge Representation.",
                    "A Framework for Dynamic Representation of Knowledge: A Minimum Principle in Organizing Knowledge Representation.",
                    "Parallel Solutions to Constraint Satisfaction Problems.",
                    "Hard Problems for Simple Default Logics.",
                    "Localizing Temporal Constraint Propagation.",
                    "Knowledge Representation in a Case-Based Reasoning System: Defaults and Exceptions.",
                    "What Does a Conditional Knowledge Base Entail?",
                    "Analogy as a Constrained Partial Correspondence Over Conceptual Graphs.",
                    "Between Circumscription and Autoepistemic Logic.",
                    "Argument Systems: A Uniform Basis for Nonmonotonic Reasoning.",
                    "Analogical Reasoning, Defeasible Reasoning, and the Reference Class.",
                    "Plausible World Assumption.",
                    "Relating Autoepistemic and Default Logics.",
                    "Taxonomic Syntax for First Order Inference.",
                    "A Knowledge Level Analysis of Belief Revision.",
                    "Defaults and Probabilities; Extensions and Coherence.",
                    "ADL: Exploring the Middle Ground Between STRIPS and the Situation Calculus.",
                    "What the Lottery Paradox Tells Us About Default Reasoning.",
                    "Three-Valued Formalizations of Non-Monotonic Reasoning and Logic Programming.",
                    "Skeptical Reasoning and Disjunctive Programs.",
                    "Modelling Topological and Metrical Properties in Physical Processes.",
                    "Formal Theories of Belief Revision.",
                    "Did Newton Solve the \"Extended Prediction Problem\"?",
                    "Synthesizing Information-Tracking Automata from Environment Descriptions.",
                    "Exact Solution in Linear Time of Networks of Constraints Using Perfect Relaxation.",
                    "Principles of Metareasoning.",
                    "Combining Logic and Differential Equations for Describing Real-World Systems.",
                    "Subsumption in KL-ONE is Undecidable.",
                    "Terminological Knowledge Representation Systems Supporting N-ary Terms.",
                    "An Episodic Knowledge Representation for Narrative Texts.",
                    "Syntactic Equality in Knowledge Representation and Reasoning.",
                    "Making Situation Calculus Indexical.",
                    "Inheritance in Automated Planning.",
                    "Cardinalities and Well Orderings in a Common-Sense Set Theory.",
                    "Critical Issues in Nonmonotonic Reasoning.",
                    "Probabilistic Semantics for Nonmonotonic Reasoning: A Survey."
                ]
            }
        ]
    }
]