[
    {
        "year": "2021",
        "name": "KSEM 2021",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2021-1",
                "sub_name": "Knowledge Science, Engineering and Management - 14th International Conference, KSEM 2021, Tokyo, Japan, August 14-16, 2021, Proceedings, Part I.",
                "count": 56,
                "papers": [
                    "Research on Innovation Trends of AI Applied to Medical Instruments Using Informetrics Based on Multi-sourse Information.",
                    "Extracting Prerequisite Relations Among Wikipedia Concepts Using the Clickstream Data.",
                    "Clustering Massive-Categories and Complex Documents via Graph Convolutional Network.",
                    "Structure-Enhanced Graph Representation Learning for Link Prediction in Signed Networks.",
                    "A Property-Based Method for Acquiring Commonsense Knowledge.",
                    "Multi-hop Learning Promote Cooperation in Multi-agent Systems.",
                    "FedPS: Model Aggregation with Pseudo Samples.",
                    "Dense Incremental Extreme Learning Machine with Accelerating Amount and Proportional Integral Differential.",
                    "Knowledge-Based Diverse Feature Transformation for Few-Shot Relation Classification.",
                    "Community Detection in Dynamic Networks: A Novel Deep Learning Method.",
                    "Additive Noise Model Structure Learning Based on Rank Statistics.",
                    "A MOOCs Recommender System Based on User's Knowledge Background.",
                    "TEBC-Net: An Effective Relation Extraction Approach for Simple Question Answering over Knowledge Graphs.",
                    "Representing Knowledge Graphs with Gaussian Mixture Embedding.",
                    "A Semi-supervised Multi-objective Evolutionary Algorithm for Multi-layer Network Community Detection.",
                    "Named Entity Recognition Based on Reinforcement Learning and Adversarial Training.",
                    "Improved Partitioning Graph Embedding Framework for Small Cluster.",
                    "A Framework of Data Fusion Through Spatio-Temporal Knowledge Graph.",
                    "SEGAR: Knowledge Graph Augmented Session-Based Recommendation.",
                    "Symbiosis: A Novel Framework for Integrating Hierarchies from Knowledge Graph into Recommendation System.",
                    "An Ensemble Fuzziness-Based Online Sequential Learning Approach and Its Application.",
                    "GASKT: A Graph-Based Attentive Knowledge-Search Model for Knowledge Tracing.",
                    "Fragile Neural Network Watermarking with Trigger Image Set.",
                    "Introducing Graph Neural Networks for Few-Shot Relation Prediction in Knowledge Graph Completion Task.",
                    "A Research Study on Running Machine Learning Algorithms on Big Data with Spark.",
                    "Attentional Neural Factorization Machines for Knowledge Tracing.",
                    "Node-Image CAE: A Novel Embedding Method via Convolutional Auto-encoder and High-Order Proximities.",
                    "EN-DIVINE: An Enhanced Generative Adversarial Imitation Learning Framework for Knowledge Graph Reasoning.",
                    "Knowledge Distillation via Channel Correlation Structure.",
                    "Feature Interaction Convolutional Network for Knowledge Graph Embedding.",
                    "Towards a Modular Ontology for Cloud Consumer Review Mining.",
                    "Identification of Critical Nodes in Urban Transportation Network Through Network Topology and Server Routes.",
                    "Graph Ensemble Networks for Semi-supervised Embedding Learning.",
                    "Rethinking the Information Inside Documents for Sentiment Classification.",
                    "Dependency Parsing Representation Learning for Open Information Extraction.",
                    "Hierarchical Policy Network with Multi-agent for Knowledge Graph Reasoning Based on Reinforcement Learning.",
                    "Inducing Bilingual Word Representations for Non-isomorphic Spaces by an Unsupervised Way.",
                    "A Deep Learning Model Based on Neural Bag-of-Words Attention for Sentiment Analysis.",
                    "Graph Attention Mechanism with Cardinality Preservation for Knowledge Graph Completion.",
                    "Event Relation Reasoning Based on Event Knowledge Graph.",
                    "PEN4Rec: Preference Evolution Networks for Session-Based Recommendation.",
                    "HyperspherE: An Embedding Method for Knowledge Graph Completion Based on Hypersphere.",
                    "TroBo: A Novel Deep Transfer Model for Enhancing Cross-Project Bug Localization.",
                    "A Neural Language Understanding for Dialogue State Tracking.",
                    "Spirit Distillation: A Model Compression Method with Multi-domain Knowledge Transfer.",
                    "Knowledge Tracing with Exercise-Enhanced Key-Value Memory Networks.",
                    "Entity Alignment Between Knowledge Graphs Using Entity Type Matching.",
                    "Text-Aware Recommendation Model Based on Multi-attention Neural Networks.",
                    "Chinese Named Entity Recognition Based on Gated Graph Neural Network.",
                    "Learning a Similarity Metric Discriminatively with Application to Ancient Character Recognition.",
                    "Incorporating Global Context into Multi-task Learning for Session-Based Recommendation.",
                    "Exploring Sequential and Collaborative Contexts for Next Point-of-Interest Recommendation.",
                    "Predicting User Preferences via Heterogeneous Information Network and Metric Learning.",
                    "An IoT Ontology Class Recommendation Method Based on Knowledge Graph.",
                    "Ride-Sharing Matching of Commuting Private Car Using Reinforcement Learning.",
                    "Optimization of Remote Desktop with CNN-based Image Compression Model."
                ]
            },
            {
                "sub_name_abbr": "conf/ksem/2021-2",
                "sub_name": "Knowledge Science, Engineering and Management - 14th International Conference, KSEM 2021, Tokyo, Japan, August 14-16, 2021, Proceedings, Part II.",
                "count": 53,
                "papers": [
                    "A Semantic Textual Similarity Calculation Model Based on Pre-training Model.",
                    "Representation Learning of Knowledge Graph with Semantic Vectors.",
                    "Chinese Relation Extraction with Flat-Lattice Encoding and Pretrain-Transfer Strategy.",
                    "English Cloze Test Based on BERT.",
                    "An Automatic Method for Understanding Political Polarization Through Social Media.",
                    "An Improved Convolutional Neural Network Based on Noise Layer.",
                    "Syntactic Enhanced Projection Network for Few-Shot Chinese Event Extraction.",
                    "A Framework of Data Augmentation While Active Learning for Chinese Named Entity Recognition.",
                    "Traffic Route Planning in Partially Observable Environment Using Actions Group Representation.",
                    "Bayesian Belief Network Model Using Sematic Concept for Expert Finding.",
                    "Towards Solving the Winograd Schema Challenge: Model-Free, Model-Based and a Spectrum in Between.",
                    "The Novel Efficient Transformer for NLP.",
                    "Joint Entity and Relation Extraction for Long Text.",
                    "Evaluating Dataset Creation Heuristics for Concept Detection in Web Pages Using BERT.",
                    "Panoptic-DLA: Document Layout Analysis of Historical Newspapers Based on Proposal-Free Panoptic Segmentation Model.",
                    "Improving Answer Type Classification Quality Through Combined Question Answering Datasets.",
                    "FOBA: Flight Operation Behavior Analysis Based on Hierarchical Encoding.",
                    "An Event Detection Method Combining Temporal Dimension and Position Dimension.",
                    "Local Feature Normalization.",
                    "Combining Knowledge with Attention Neural Networks for Short Text Classification.",
                    "A Dialogue Contextual Flow Model for Utterance Intent Recognition in Multi-turn Online Conversation.",
                    "An Empirical Study on Effect of Semantic Measures in Cross-Domain Recommender System in User Cold-Start Scenario.",
                    "Community Enhanced Course Concept Recommendation in MOOCs with Multiple Entities.",
                    "AABC: ALBERT-BiLSTM-CRF Combining with Adapters.",
                    "Q-Learning with Fisher Score for Feature Selection of Large-Scale Data Sets.",
                    "The Modularity of Inconsistent Knowledge Bases with Application to Measuring Inconsistency.",
                    "Collaborative Embedding for Knowledge Tracing.",
                    "Construction and Analysis of Cross-Regional Emergency Collaboration Network Model.",
                    "Residual Gated Recurrent Unit-Based Stacked Network for Stock Trend Prediction from Limit Order Book.",
                    "A Social Attribute Inferred Model Based on Spatio-Temporal Data.",
                    "Chinese Judicial Summarising Based on Short Sentence Extraction and GPT-2.",
                    "Extracting Anomalous Pre-earthquake Signatures from Swarm Satellite Data Using EOF and PC Analysis.",
                    "Hierarchical Multi-label Text Classification: Self-adaption Semantic Awareness Network Integrating Text Topic and Label Level Information.",
                    "Sememes-Based Framework for Knowledge Graph Embedding with Comprehensive-Information.",
                    "Domain-Specific Sentence Encoder for Intention Recognition in Large-Scale Shopping Platforms.",
                    "Chinese Event Detection Based on Event Ontology and Siamese Network.",
                    "Alzheimer's Disease Prediction Using EfficientNet and Fastai.",
                    "Interval Occlusion Calculus with Size Information.",
                    "Adaptive Entity Alignment for Cross-Lingual Knowledge Graph.",
                    "Similarity-Based Heterogeneous Graph Attention Network for Knowledge-Enhanced Recommendation.",
                    "Accurate and Robust RGB-D Visual Odometry Based on Point and Line Features.",
                    "Sentence Extraction-Based Machine Reading Comprehension for Vietnamese.",
                    "Analyzing and Recommending Development Order Based on Design Class Diagram.",
                    "HCapsNet: A Text Classification Model Based on Hierarchical Capsule Network.",
                    "Sentence Matching with Deep Self-attention and Co-attention Features.",
                    "Not Only the Contextual Semantic Information: A Deep Fusion Sentimental Analysis Model Towards Extremely Short Comments.",
                    "A Label Noise Robust Cross-Modal Hashing Approach.",
                    "Acoustic Modeling for Indoor Spaces Using Ray-Tracing Method.",
                    "Learning Path Recommendation for MOOC Platforms Based on a Knowledge Graph.",
                    "Spy the Lie: Fraudulent Jobs Detection in Recruitment Domain using Knowledge Graphs.",
                    "Performance Evaluation of Multi-class Sentiment Classification Using Deep Neural Network Models Optimised for Binary Classification.",
                    "Discovering Stable Ride-Sharing Groups for Commuting Private Car Using Spatio-Temporal Semantic Similarity.",
                    "SA2SL: From Aspect-Based Sentiment Analysis to Social Listening System for Business Intelligence."
                ]
            },
            {
                "sub_name_abbr": "conf/ksem/2021-3",
                "sub_name": "Knowledge Science, Engineering and Management - 14th International Conference, KSEM 2021, Tokyo, Japan, August 14-16, 2021, Proceedings, Part III.",
                "count": 55,
                "papers": [
                    "An Adversarial Training Method for Improving Model Robustness in Unsupervised Domain Adaptation.",
                    "Context-Aware Anomaly Detection in Attributed Networks.",
                    "An Efficient Hybrid Approach to Detecting and Correcting Auxiliary Word Errors in Chinese Text.",
                    "Traffic Accident Prediction Methods Based on Multi-factor Models.",
                    "Combining BERT and Multiple Embedding Methods with the Deep Neural Network for Humor Detection.",
                    "An Efficient Link Prediction Model in Dynamic Heterogeneous Information Networks Based on Multiple Self-attention.",
                    "A Clustering-Prediction Pipeline for Customer Churn Analysis.",
                    "Fine-Grained Unbalanced Interaction Network for Visual Question Answering.",
                    "Swarm Intelligence-Based Feature Selection: An Improved Binary Grey Wolf Optimization Method.",
                    "Integrating Real-Time Entity Resolution with Top-N Join Query Processing.",
                    "Incorporating Question Information to Enhance the Performance of Automatic Short Answer Grading.",
                    "Integrating Task Information into Few-Shot Classifier by Channel Attention.",
                    "Rumor Verification on Social Media with Stance-Aware Recursive Tree.",
                    "Aspect and Opinion Terms Co-extraction Using Position-Aware Attention and Auxiliary Labels.",
                    "Beyond Laplacian Smoothing for Semi-supervised Community Detection.",
                    "Landscape-Enhanced Graph Attention Network for Rumor Detection.",
                    "An Overview of Methods for Acquiring and Generating Decision Models.",
                    "Fine-Grained Image Classification Based on Target Acquisition and Feature Fusion.",
                    "LogAttn: Unsupervised Log Anomaly Detection with an AutoEncoder Based Attention Mechanism.",
                    "DNEA: Dynamic Network Embedding Method for Anomaly Detection.",
                    "Adversarial Constraint Evaluation on Biomedical Text Mining.",
                    "Enhanced Self-node Weights Based Graph Convolutional Networks for Passenger Flow Prediction.",
                    "Interpretation of Learning-Based Automatic Source Code Vulnerability Detection Model Using LIME.",
                    "Efficient Depth Completion Network Based on Dynamic Gated Fusion.",
                    "A Blockchain Based Framework for Smart Greenhouse Data Management.",
                    "Medication Combination Prediction via Attention Neural Networks with Prior Medical Knowledge.",
                    "CelebHair: A New Large-Scale Dataset for Hairstyle Recommendation Based on CelebA.",
                    "Image Super-Resolution Based on Residual Block Dense Connection.",
                    "EGIM: Evolution Graph Based Interest Modeling for Click-Through Rate Prediction.",
                    "Visualizing the Finer Cluster Structure of Large-Scale and High-Dimensional Data.",
                    "Learning Resource Recommendation in E-Learning Systems Based on Online Learning Style.",
                    "Alignment-Based Graph Network for Judicial Examination Task.",
                    "Embedding-Based Network Alignment Using Neural Tensor Networks.",
                    "Detecting Parkinson's Disease According to Gender Using Speech Signals.",
                    "Theoretical Study of Exponential Best-Fit: Modeling hCG for Gestational Trophoblastic Disease.",
                    "Lane Keeping Algorithm for Autonomous Driving via Safe Reinforcement Learning.",
                    "BS-KGS: Blockchain Sharding Empowered Knowledge Graph Storage.",
                    "Faster Nonlocal UNet for Cell Segmentation in Microscopy Images.",
                    "An Improved YOLO Algorithm for Object Detection in All Day Scenarios.",
                    "EMRM: Enhanced Multi-source Review-Based Model for Rating Prediction.",
                    "Blockchain-as-a-Service Powered Knowledge Graph Construction.",
                    "Finetuned YOLOv3 for Getting Four Times the Detection Speed.",
                    "A Systematic Approach for Maintainable Business Process Models.",
                    "Improved Evolution Algorithm that Guides the Direction of Individual Mutation for Influence Maximization in Social Networks.",
                    "Incorporating Common Knowledge and Specific Entity Linking Knowledge for Machine Reading Comprehension.",
                    "Readmission Prediction with Knowledge Graph Attention and RNN-Based Ordinary Differential Equations.",
                    "Detecting SDCs in GPGPUs Through an Efficient Instruction Duplication Mechanism.",
                    "GAN-Enabled Code Embedding for Reentrant Vulnerabilities Detection.",
                    "Attention Based Short-Term Metro Passenger Flow Prediction.",
                    "Thematic Analysis of Twitter as a Platform for Knowledge Management.",
                    "Cross-Chain-Based Decentralized Identity for Mortgage Loans.",
                    "Blockchain-Based Privacy-Preserving Medical Data Sharing Scheme Using Federated Learning.",
                    "An Edge Trajectory Protection Approach Using Blockchain.",
                    "Approach Based on Ontology and Machine Learning for Identifying Causes Affecting Personality Disorder Disease on Twitter.",
                    "QBT: Efficient and Flexible Resource Allocation Method for Data Center of State Grid Scenario."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "KSEM 2020",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2020-1",
                "sub_name": "Knowledge Science, Engineering and Management - 13th International Conference, KSEM 2020, Hangzhou, China, August 28-30, 2020, Proceedings, Part I.",
                "count": 43,
                "papers": [
                    "Event-centric Tourism Knowledge Graph - A Case Study of Hainan.",
                    "Extracting Short Entity Descriptions for Open-World Extension to Knowledge Graph Completion Models.",
                    "Graph Embedding Based on Characteristic of Rooted Subgraph Structure.",
                    "Knowledge Graphs Meet Geometry for Semi-supervised Monocular Depth Estimation.",
                    "Topological Graph Representation Learning on Property Graph.",
                    "Measuring Triplet Trustworthiness in Knowledge Graphs via Expanded Relation Detection.",
                    "A Contextualized Entity Representation for Knowledge Graph Completion.",
                    "A Dual Fusion Model for Attributed Network Embedding.",
                    "Attention-Based Knowledge Tracing with Heterogeneous Information Network Embedding.",
                    "Detecting Statistically Significant Events in Large Heterogeneous Attribute Graphs via Densest Subgraphs.",
                    "Edge Features Enhanced Graph Attention Network for Relation Extraction.",
                    "MMEA: Entity Alignment for Multi-modal Knowledge Graph.",
                    "A Hybrid Model with Pre-trained Entity-Aware Transformer for Relation Extraction.",
                    "NovEA: A Novel Model of Entity Alignment Using Attribute Triples and Relation Triples.",
                    "A Robust Representation with Pre-trained Start and End Characters Vectors for Noisy Word Recognition.",
                    "Intention Multiple-Representation Model for Logistics Intelligent Customer Service.",
                    "Identifying Loners from Their Project Collaboration Records - A Graph-Based Approach.",
                    "Node Embedding over Attributed Bipartite Graphs.",
                    "FastLogSim: A Quick Log Pattern Parser Scheme Based on Text Similarity.",
                    "Robotic Pushing and Grasping Knowledge Learning via Attention Deep Q-learning Network.",
                    "A Dynamic Answering Path Based Fusion Model for KGQA.",
                    "Improving Deep Item-Based Collaborative Filtering with Bayesian Personalized Ranking for MOOC Course Recommendation.",
                    "Online Programming Education Modeling and Knowledge Tracing.",
                    "Enhancing Pre-trained Language Models by Self-supervised Learning for Story Cloze Test.",
                    "MOOCRec: An Attention Meta-path Based Model for Top-K Recommendation in MOOC.",
                    "PVFNet: Point-View Fusion Network for 3D Shape Recognition.",
                    "HEAM: Heterogeneous Network Embedding with Automatic Meta-path Construction.",
                    "A Graph Attentive Network Model for P2P Lending Fraud Detection.",
                    "An Empirical Study on Recent Graph Database Systems.",
                    "Bibliometric Analysis of Twitter Knowledge Management Publications Related to Health Promotion.",
                    "Automatic Cerebral Artery System Labeling Using Registration and Key Points Tracking.",
                    "Page-Level Handwritten Word Spotting via Discriminative Feature Learning.",
                    "NADSR: A Network Anomaly Detection Scheme Based on Representation.",
                    "A Knowledge-Based Scheduling Method for Multi-satellite Range System.",
                    "IM-Net: Semantic Segmentation Algorithm for Medical Images Based on Mutual Information Maximization.",
                    "Fast Backward Iterative Laplacian Score for Unsupervised Feature Selection.",
                    "Improving Low-Resource Chinese Event Detection with Multi-task Learning.",
                    "Feature Selection Using Sparse Twin Support Vector Machine with Correntropy-Induced Loss.",
                    "Customized Decision Tree for Fast Multi-resolution Chart Patterns Classification.",
                    "Predicting User Influence in the Propagation of Toxic Information.",
                    "Extracting Distinctive Shapelets with Random Selection for Early Classification.",
                    "Butterfly-Based Higher-Order Clustering on Bipartite Networks.",
                    "Learning Dynamic Pricing Rules for Flight Tickets."
                ]
            },
            {
                "sub_name_abbr": "conf/ksem/2020-2",
                "sub_name": "Knowledge Science, Engineering and Management - 13th International Conference, KSEM 2020, Hangzhou, China, August 28-30, 2020, Proceedings, Part II.",
                "count": 42,
                "papers": [
                    "MA-TREX: Mutli-agent Trajectory-Ranked Reward Extrapolation via Inverse Reinforcement Learning.",
                    "An Incremental Learning Network Model Based on Random Sample Distribution Fitting.",
                    "Parameter Optimization and Weights Assessment for Evidential Artificial Immune Recognition System.",
                    "Improving Policy Generalization for Teacher-Student Reinforcement Learning.",
                    "Towards Effective Top-k Location Recommendation for Business Facility Placement.",
                    "Pairwise-Based Hierarchical Gating Networks for Sequential Recommendation.",
                    "Time-Aware Attentive Neural Network for News Recommendation with Long- and Short-Term User Representation.",
                    "A Time Interval Aware Approach for Session-Based Social Recommendation.",
                    "AutoIDL: Automated Imbalanced Data Learning via Collaborative Filtering.",
                    "Fusion of Domain Knowledge and Text Features for Query Expansion in Citation Recommendation.",
                    "Robust Sequence Embedding for Recommendation.",
                    "Deep Generative Recommendation with Maximizing Reciprocal Rank.",
                    "Spatio-Temporal Attentive Network for Session-Based Recommendation.",
                    "Category-Level Adversarial Network for Cross-Domain Sentiment Classification.",
                    "Seeds Selection for Influence Maximization Based on Device-to-Device Social Knowledge by Reinforcement Learning.",
                    "CIFEF: Combining Implicit and Explicit Features for Friendship Inference in Location-Based Social Networks.",
                    "A Knowledge Enhanced Ensemble Learning Model for Mental Disorder Detection on Social Media.",
                    "Constrained Viral Marketing in Social Networks.",
                    "A Multi-source Self-adaptive Transfer Learning Model for Mining Social Links.",
                    "Multi-hop Syntactic Graph Convolutional Networks for Aspect-Based Sentiment Classification.",
                    "A Matching-Integration-Verification Model for Multiple-Choice Reading Comprehension.",
                    "How to Interact and Change? Abstractive Dialogue Summarization with Dialogue Act Weight and Topic Change Info.",
                    "Chinese Text Classification via Bidirectional Lattice LSTM.",
                    "MG-BERT: A Multi-glosses BERT Model for Word Sense Disambiguation.",
                    "Top Personalized Reviews Set Selection Based on Subject Aspect Modeling.",
                    "SCX-SD: Semi-supervised Method for Contextual Sarcasm Detection.",
                    "End-to-End Multi-task Learning for Allusion Detection in Ancient Chinese Poems.",
                    "Defense of Word-Level Adversarial Attacks via Random Substitution Encoding.",
                    "Document-Improved Hierarchical Modular Attention for Event Detection.",
                    "Fine-Tuned Transformer Model for Sentiment Analysis.",
                    "An Algorithm for Emotion Evaluation and Analysis Based on CBOW.",
                    "Predicting Crowdsourcing Worker Performance with Knowledge Tracing.",
                    "Watermarking Neural Network with Compensation Mechanism.",
                    "Information Diffusion Prediction with Personalized Graph Neural Networks.",
                    "Relationship-Aware Hard Negative Generation in Deep Metric Learning.",
                    "Striking a Balance in Unsupervised Fine-Grained Domain Adaptation Using Adversarial Learning.",
                    "Improved Performance of GANs via Integrating Gradient Penalty with Spectral Normalization.",
                    "Evidential Deep Neural Networks for Uncertain Data Classification.",
                    "GDCRN: Global Diffusion Convolutional Residual Network for Traffic Flow Prediction.",
                    "Depthwise Separable Convolutional Neural Network for Confidential Information Analysis.",
                    "The Short-Term Exit Traffic Prediction of a Toll Station Based on LSTM.",
                    "Long and Short Term Risk Control for Online Portfolio Selection."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "KSEM 2019",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2019-1",
                "sub_name": "Knowledge Science, Engineering and Management - 12th International Conference, KSEM 2019, Athens, Greece, August 28-30, 2019, Proceedings, Part I.",
                "count": 74,
                "papers": [
                    "Centralized Reasoning Translation and Its Computing Complexity for Heterogeneous Semantic Mappings.",
                    "Inconsistency Handling for Partially Preordered Ontologies: Going Beyond Elect.",
                    "Semantic Modeling of Textual Relationships in Cross-modal Retrieval.",
                    "A Smart Search-Based Ontology Visualization Tool Using SPARQL Patterns.",
                    "PRTIRG: A Knowledge Graph for People-Readable Threat Intelligence Recommendation.",
                    "Social-Aware and Sequential Embedding for Cold-Start Recommendation.",
                    "Sequential Recommendation Based on Long-Term and Short-Term User Behavior with Self-attention.",
                    "Multi-attention Item Recommendation Model Based on Social Relations.",
                    "A Network Embedding and Clustering Algorithm for Expert Recommendation Service.",
                    "Mixing-RNN: A Recommendation Algorithm Based on Recurrent Neural Network.",
                    "SCCF Parameter and Similarity Measure Optimization and Evaluation.",
                    "NRSA: Neural Recommendation with Summary-Aware Attention.",
                    "Paper Recommendation with Item-Level Collaborative Memory Network.",
                    "UAFA: Unsupervised Attribute-Friendship Attention Framework for User Representation.",
                    "A Simple and Effective Community Detection Method Combining Network Topology with Node Attributes.",
                    "Location-Interest-Aware Community Detection for Mobile Social Networks Based on Auto Encoder.",
                    "Retweet Prediction Using Context-Aware Coupled Matrix-Tensor Factorization.",
                    "A New Multi-objective Evolution Model for Community Detection in Multi-layer Networks.",
                    "Jointly Modeling Community and Topic in Social Network.",
                    "A Social Relationships Enhanced Credit Risk Assessment Approach.",
                    "Context Aware Community Formation for MAS-Oriented Collective Adaptive System.",
                    "ProteinA: An Approach for Analyzing and Visualizing Protein Conformational Transitions Using Fuzzy and Hard Clustering Techniques.",
                    "Software Defect Prediction Using a Hybrid Model Based on Semantic Features Learned from the Source Code.",
                    "A Novel Method for Highly Imbalanced Classification with Weighted Support Vector Machine.",
                    "A Study on Applying Relational Association Rule Mining Based Classification for Predicting the Academic Performance of Students.",
                    "Strict Subspace and Label-Space Structure for Domain Adaptation.",
                    "Multi-view Locality Preserving Embedding with View Consistent Constraint for Dimension Reduction.",
                    "Research on Ship Classification Based on Trajectory Association.",
                    "Learning a Subclass of Deterministic Regular Expression with Counting.",
                    "Aggregately Regularized Multi-task Matrix Factorization for Household Energy Breakdown.",
                    "Learning Continuous User and Item Representations for Neural Collaborative Filtering.",
                    "Partial Alignment of Data Sets Based on Fast Intrinsic Feature Match.",
                    "Implicit Rating Methods Based on Interest Preferences of Categories for Micro-Video Recommendation.",
                    "An Enhanced Deep Hashing Method for Large-Scale Image Retrieval.",
                    "Spatio-Temporal Correlation Graph for Association Enhancement in Multi-object Tracking.",
                    "Finger Gesture Recognition Based on 3D-Accelerometer and 3D-Gyroscope.",
                    "DST: A Deep Urban Traffic Flow Prediction Framework Based on Spatial-Temporal Features.",
                    "Small-Scale Data Classification Based on Deep Forest.",
                    "A Text Annotation Tool with Pre-annotation Based on Deep Learning.",
                    "Object Detection by Combining Deep Dilated Convolutions Network and Light-Weight Network.",
                    "D3N: DGA Detection with Deep-Learning Through NXDomain.",
                    "Deep Neighbor Embedding for Evaluation of Large Portfolios of Variable Annuities.",
                    "State Representation Learning for Minimax Deep Deterministic Policy Gradient.",
                    "Low-Sampling Imagery Data Recovery by Deep Learning Inference and Iterative Approach.",
                    "Enhancing Graph-Based Keywords Extraction with Node Association.",
                    "TransI: Translating Infinite Dimensional Embeddings Based on Trend Smooth Distance.",
                    "A Knowledge-Based Conceptual Modelling Approach to Bridge Design Thinking and Intelligent Environments.",
                    "Named Entity Recognition in Traditional Chinese Medicine Clinical Cases Combining BiLSTM-CRF with Knowledge Graph.",
                    "Adaptive-Skip-TransE Model: Breaking Relation Ambiguities for Knowledge Graph Embedding.",
                    "Entity Linking Based on Graph Model and Semantic Representation.",
                    "The Model-Driven Enterprise Data Fabric: A Proposal Based on Conceptual Modelling and Knowledge Graphs.",
                    "Leveraging User Preferences for Community Search via Attribute Subspace.",
                    "Visualization of Customer Satisfaction Linked to Behavior Using a Process-Based Web Questionnaire.",
                    "A Multilingual Semantic Similarity-Based Approach for Question-Answering Systems.",
                    "From Attribute Relationship Diagrams to Process (BPMN) and Decision (DMN) Models.",
                    "Building Chinese Legal Hybrid Knowledge Network.",
                    "Evidential Artificial Immune Recognition System.",
                    "Gated Self-attentive Encoder for Neural Machine Translation.",
                    "RGCN: Recurrent Graph Convolutional Networks for Target-Dependent Sentiment Analysis.",
                    "An Evidential Semi-supervised Label Aggregation Approach.",
                    "Improved Feature Selection Algorithm for Biological Sequences Classification.",
                    "DRAM: A Deep Reinforced Intra-attentive Model for Event Prediction.",
                    "Permission-Based Feature Scaling Method for Lightweight Android Malware Detection.",
                    "Agile Query Processing in Statistical Databases: A Process-In-Memory Approach.",
                    "Enhancing the Conciseness of Linked Data by Discovering Synonym Predicates.",
                    "A Comparative Analysis Methodology for Process Mining Software Tools.",
                    "Multimodal Learning with Triplet Ranking Loss for Visual Semantic Embedding Learning.",
                    "IDML: IDentifier-Based Markup Language for Resource-Constrained Smart Objects in WoT.",
                    "Understanding Decision Model and Notation: DMN Research Directions and Trends.",
                    "Data and Knowledge: An Interdisciplinary Approach for Air Quality Forecast.",
                    "A Multi-label Active Learning Approach for Mobile App User Review Classification.",
                    "A Causality-Based Approach to Assessing Inconsistency for Multi-context Systems.",
                    "Extracting Hidden Preferences over Partitions in Hedonic Cooperative Games.",
                    "Agent-Based Approach for Inventory Pre- and Post-disruption Decision Support."
                ]
            },
            {
                "sub_name_abbr": "conf/ksem/2019-2",
                "sub_name": "Knowledge Science, Engineering and Management - 12th International Conference, KSEM 2019, Athens, Greece, August 28-30, 2019, Proceedings, Part II.",
                "count": 37,
                "papers": [
                    "Improved Text-Independent Speaker Identification and Verification with Gaussian Mixture Models.",
                    "TagDeepRec: Tag Recommendation for Software Information Sites Using Attention-Based Bi-LSTM.",
                    "Application of Probabilistic Process Model for Smart Factory Systems.",
                    "A Distributed Topic Model for Large-Scale Streaming Text.",
                    "Correction to: A Distributed Topic Model for Large-Scale Streaming Text.",
                    "AutoSimP: An Approach for Predicting Proteins' Structural Similarities Using an Ensemble of Deep Autoencoders.",
                    "Overview of Generation Methods for Business Process Models.",
                    "Dynamic Task-Specific Factors for Meta-Embedding.",
                    "Automated Mining and Checking of Formal Properties in Natural Language Requirements.",
                    "A Shallow Semantic Parsing Framework for Event Argument Extraction.",
                    "Training-Less Multi-label Text Classification Using Knowledge Bases and Word Embeddings.",
                    "Text-Based Fusion Neural Network for Rumor Detection.",
                    "Text to Image Synthesis Using Two-Stage Generation and Two-Stage Discrimination.",
                    "Word Embeddings for Unsupervised Named Entity Linking.",
                    "Effectively Classify Short Texts with Sparse Representation Using Entropy Weighted Constraint.",
                    "A New Method for Complex Triplet Extraction of Biomedical Texts.",
                    "Assessing Semantic Similarity Between Concepts Using Wikipedia Based on Nonlinear Fitting.",
                    "A Two-Stage Model Based on BERT for Short Fake News Detection.",
                    "Research on Resultative/Directional Structures Based on the Corpus of International Chinese Textbooks.",
                    "An Automatic Spelling Correction Method for Classical Mongolian.",
                    "Unsupervised Cross-Lingual Sentence Representation Learning via Linguistic Isomorphism.",
                    "Practical Scheme for Secure Outsourcing of Coppersmith's Algorithm.",
                    "A Novel Genetic Algorithm Approach to Improving Error Correction Output Coding.",
                    "A New Monarch Butterfly Optimization Algorithm with SA Strategy.",
                    "Reasoning of Causal Direction in Linear Model Based on Spearman's Rank Correlation Coefficient.",
                    "Urban Traffic Flow Prediction Using a Gradient-Boosted Method Considering Dynamic Spatio-Temporal Correlations.",
                    "A Trust Network Model Based on Hesitant Fuzzy Linguistic Term Sets.",
                    "An Improved Discretization-Based Feature Selection via Particle Swarm Optimization.",
                    "Feature-Aware Attentive Convolutional Neural Network for Sequence Processing.",
                    "Exploiting Tri-types of Information for Attributed Network Embedding.",
                    "Answer-Focused and Position-Aware Neural Network for Transfer Learning in Question Generation.",
                    "Syntax-Aware Sentence Matching with Graph Convolutional Networks.",
                    "Music Genre Classification via Sequential Wavelet Scattering Feature Learning.",
                    "Efficient Network Representations Learning: An Edge-Centric Perspective.",
                    "Representation Learning in Academic Network Based on Research Interest and Meta-path.",
                    "Knowledge-Aware Self-Attention Networks for Document Grounded Dialogue Generation.",
                    "A Multi-View Spatial-Temporal Network for Vehicle Refueling Demand Inference."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "KSEM 2018",
        "info": "Changchun, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2018-1",
                "sub_name": "Knowledge Science, Engineering and Management - 11th International Conference, KSEM 2018, Changchun, China, August 17-19, 2018, Proceedings, Part I.",
                "count": 46,
                "papers": [
                    "Sentence Compression with Reinforcement Learning.",
                    "A Biomedical Question Answering System Based on SNOMED-CT.",
                    "Authorship Attribution for Short Texts with Author-Document Topic Model.",
                    "WalkToTopics: Inferring Topic Relations from a Feature Learning Perspective.",
                    "Distant Domain Adaptation for Text Classification.",
                    "Attention Aware Bidirectional Gated Recurrent Unit Based Framework for Sentiment Analysis.",
                    "Neural Sentiment Classification with Social Feedback Signals.",
                    "A Concept for Generating Business Process Models from Natural Language Description.",
                    "A Study on Performance Sensitivity to Data Sparsity for Automated Essay Scoring.",
                    "Extract Knowledge from Web Pages in a Specific Domain.",
                    "TCMEF: A TCM Entity Filter Using Less Text.",
                    "Two-Stage Object Detection Based on Deep Pruning for Remote Sensing Image.",
                    "W-Shaped Selection for Light Field Super-Resolution.",
                    "Users Personalized Sketch-Based Image Retrieval Using Deep Transfer Learning.",
                    "Enhancing Network Flow for Multi-target Tracking with Detection Group Analysis.",
                    "Combine Coarse and Fine Cues: Multi-grained Fusion Network for Video-Based Person Re-identification.",
                    "Understand and Assess People's Procrastination by Mining Computer Usage Log.",
                    "Group Outlying Aspects Mining.",
                    "Fine-Grained Correlation Learning with Stacked Co-attention Networks for Cross-Modal Information Retrieval.",
                    "Supervised Manifold-Preserving Graph Reduction for Noisy Data Classification.",
                    "Personalize Review Selection Using PeRView.",
                    "An Online GPS Trajectory Data Compression Method Based on Motion State Change.",
                    "Mining Temporal Discriminant Frames via Joint Matrix Factorization: A Case Study of Illegal Immigration in the U.S. News Media.",
                    "Enhancing Cluster Center Identification in Density Peak Clustering.",
                    "An Improved Weighted ELM with Hierarchical Feature Representation for Imbalanced Biomedical Datasets.",
                    "SERL: Semantic-Path Biased Representation Learning of Heterogeneous Information Network.",
                    "Social Bayesian Personal Ranking for Missing Data in Implicit Feedback Recommendation.",
                    "A Semantic Path-Based Similarity Measure for Weighted Heterogeneous Information Networks.",
                    "Cross-Domain Recommendation for Mapping Sentiment Review Pattern.",
                    "Fuzzy Gravitational Search Approach to a Hybrid Data Model Based Recommender System.",
                    "Causal Discovery with Bayesian Networks Inductive Transfer.",
                    "Robust Detection of Communities with Multi-semantics in Large Attributed Networks.",
                    "Dual Sum-Product Networks Autoencoding.",
                    "Recognizing Diseases from Physiological Time Series Data Using Probabilistic Model.",
                    "An Incremental Approach Based on the Coalition Formation Game Theory for Identifying Communities in Dynamic Social Networks.",
                    "LogRank: An Approach to Sample Business Process Event Log for Efficient Discovery.",
                    "Case-Based Decision Support System with Contextual Bandits Learning for Similarity Retrieval Model Selection.",
                    "Cross-Layer Attack Path Exploration for Smart Grid Based on Knowledge of Target Network.",
                    "Exploring Cyber-Security Issues in Vessel Traffic Services.",
                    "Prognosis of Thyroid Disease Using MS-Apriori Improved Decision Tree.",
                    "Stock Price Prediction Using Time Convolution Long Short-Term Memory Network.",
                    "Web Data Extraction from Scientific Publishers' Website Using Hidden Markov Model.",
                    "MedSim: A Novel Semantic Similarity Measure in Bio-medical Knowledge Graphs.",
                    "A Sequence Transformation Model for Chinese Named Entity Recognition.",
                    "An Incremental Reasoning Algorithm for Large Scale Knowledge Graph.",
                    "Relation Classification Using Coarse and Fine-Grained Networks with SDP Supervised Key Words Selection."
                ]
            },
            {
                "sub_name_abbr": "conf/ksem/2018-2",
                "sub_name": "Knowledge Science, Engineering and Management - 11th International Conference, KSEM 2018, Changchun, China, August 17-19, 2018, Proceedings, Part II.",
                "count": 42,
                "papers": [
                    "A Multi-objective Optimization Algorithm Based on Preference Three-Way Decomposition.",
                    "A Community-Division Based Algorithm for Finding Relations Among Linear Constraints.",
                    "The New Adaptive ETLBO Algorithms with K-Armed Bandit Model.",
                    "Enhancing Bug Report Assignment with an Optimized Reduction of Training Set.",
                    "An Efficient Approach for Computing Conflict Sets Combining Failure Probability with SAT.",
                    "A New Variable-Oriented Propagation Scheme for Constraint Satisfaction Problem.",
                    "A Timeline Representation for the Jade Rabbit Rover.",
                    "A Parthenogenetic Algorithm for Deploying the Roadside Units in Vehicle Networks.",
                    "Another Useful Four-Valued Logic.",
                    "An Improved Multi-agent Epistemic Planner via Higher-Order Belief Change Based on Heuristic Search.",
                    "ROSIE: Runtime Optimization of SPARQL Queries over RDF Using Incremental Evaluation.",
                    "Automated Reasoning over Provenance-Aware Communication Network Knowledge in Support of Cyber-Situational Awareness.",
                    "Constructive Justification Extraction for OWL Ontologies.",
                    "A Hybrid RNN-CNN Encoder for Neural Conversation Model.",
                    "Cross-Dataset Person Re-identification Using Similarity Preserved Generative Adversarial Networks.",
                    "Autoencoder Based Community Detection with Adaptive Integration of Network Topology and Node Contents.",
                    "Deep Convolutional Nets for Pulmonary Nodule Detection and Classification.",
                    "Recognizing Character-Matching CAPTCHA Using Convolutional Neural Networks with Triple Loss.",
                    "Sentiment Embedded Semantic Space for More Accurate Sentiment Analysis.",
                    "Citation Classification Using Multitask Convolutional Neural Network Model.",
                    "P-DBL: A Deep Traffic Flow Prediction Architecture Based on Trajectory Data.",
                    "Video Restoration Using Convolutional Neural Networks for Low-Level FPGAs.",
                    "Research on Distribution Alignment and Semantic Consistency in the Adversarial Domain Adaptation.",
                    "Identification of Seismic Wave First Arrivals from Earthquake Records via Deep Learning.",
                    "A Deep Network Based on Multiscale Spectral-Spatial Fusion for Hyperspectral Classification.",
                    "Symmetric Rectified Linear Units for Fully Connected Deep Models.",
                    "Online Kernel Selection with Multiple Bandit Feedbacks in Random Feature Space.",
                    "An Overlapping Microblog Community Detection Method Using New Partition Criterion.",
                    "Quantifying the Emergence of New Domains: Using Cybersecurity as a Case.",
                    "Improved Sublinear Primal-Dual Algorithm for Support Vector Machines.",
                    "Research on Hot Micro-blog Forecast Based on XGBOOST and Random Forest.",
                    "Trust-Distrust Aware Recommendation by Integrating Metric Learning with Matrix Factorization.",
                    "Joint Detection of Topic Entity and Relation for Simple Question Answering.",
                    "A Network Embedding-Enhanced Approach for Generalized Community Detection.",
                    "Block Modelling and Learning for Structure Analysis of Networks with Positive and Negative Links.",
                    "An Algorithm of Influence Maximization in Social Network Based on Local Structure Characteristics.",
                    "Graphical Models with Content Relevance for Crucial Date Detection in Social Media Event.",
                    "Partially Observable Reinforcement Learning for Sustainable Active Surveillance.",
                    "Measuring the Diversity and Dynamics of Mobility Patterns Using Smart Card Data.",
                    "Traffic Flow Fluctuation Analysis Based on Beijing Taxi GPS Data.",
                    "Topic Extraction of Events on Social Media Using Reinforced Knowledge.",
                    "APS-PBW: The Analysis and Prediction System of Customer Flow Data Based on WIFI Probes."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "KSEM 2017",
        "info": "Melbourne, VIC, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2017",
                "sub_name": "Knowledge Science, Engineering and Management - 10th International Conference, KSEM 2017, Melbourne, VIC, Australia, August 19-20, 2017, Proceedings.",
                "count": 47,
                "papers": [
                    "Learning Sparse Overcomplete Word Vectors Without Intermediate Dense Representations.",
                    "A Study of Distributed Semantic Representations for Automated Essay Scoring.",
                    "Weakly Supervised Feature Compression Based Topic Model for Sentiment Classification.",
                    "An Effective Gated and Attention-Based Neural Network Model for Fine-Grained Financial Target-Dependent Sentiment Analysis.",
                    "A Hidden Astroturfing Detection Approach Base on Emotion Analysis.",
                    "Leveraging Term Co-occurrence Distance and Strong Classification Features for Short Text Feature Selection.",
                    "A Fuzzy Logic Based Policy Negotiation Model.",
                    "f- ALC (D)-LTL: A Fuzzy Spatio-Temporal Description Logic.",
                    "R-Calculus for the Primitive Statements in Description Logic ALC.",
                    "A Multi-objective Attribute Reduction Method in Decision-Theoretic Rough Set Model.",
                    "A Behavior-Based Method for Distinction of Flooding DDoS and Flash Crowds.",
                    "Analyzing Customer's Product Preference Using Wireless Signals.",
                    "Improved Knowledge Base Completion by the Path-Augmented TransR Model.",
                    "Balancing Between Cognitive and Semantic Acceptability of Arguments.",
                    "Discovery of Jump Breaks in Joint Volatility for Volume and Price of High-Frequency Trading Data in China.",
                    "Device-Free Intruder Sensing Leveraging Fine-Grained Physical Layer Signatures.",
                    "Understanding Knowledge Management in Agile Software Development Practice.",
                    "Multi-view Unit Intact Space Learning.",
                    "A Novel Blemish Detection Algorithm for Camera Quality Testing.",
                    "Learning to Infer API Mappings from API Documents.",
                    "Super-Resolution for Images with Barrel Lens Distortions.",
                    "Mining Schema Knowledge from Linked Data on the Web.",
                    "Inferring User Profiles in Online Social Networks Based on Convolutional Neural Network.",
                    "Co-saliency Detection Based on Superpixel Clustering.",
                    "ARMICA-Improved: A New Approach for Association Rule Mining.",
                    "Collaborative Filtering via Different Preference Structures.",
                    "A Multifaceted Model for Cross Domain Recommendation Systems.",
                    "Cross Domain Collaborative Filtering by Integrating User Latent Vectors of Auxiliary Domains.",
                    "Collaborative Filtering Based on Pairwise User-Item Blocking Structure (PBCF): A General Framework and Its Implementation.",
                    "Beyond the Aggregation of Its Members - A Novel Group Recommender System from the Perspective of Preference Distribution.",
                    "Exploring Latent Bundles from Social Behaviors for Personalized Ranking.",
                    "Trust-Aware Recommendation in Social Networks.",
                    "Connecting Factorization and Distance Metric Learning for Social Recommendations.",
                    "Relevant Fact Selection for QA via Sequence Labeling.",
                    "Community Outlier Based Fraudster Detection.",
                    "An Efficient Three-Dimensional Reconstruction Approach for Pose-Invariant Face Recognition Based on a Single View.",
                    "MIAC: A Mobility Intention Auto-Completion Model for Location Prediction.",
                    "Automatically Difficulty Grading Method Based on Knowledge Tree.",
                    "A Weighted Non-monotonic Averaging Image Reduction Algorithm.",
                    "Learning Deep and Shallow Features for Human Activity Recognition.",
                    "Transfer Learning with Manifold Regularized Convolutional Neural Network.",
                    "Learning Path Generation Method Based on Migration Between Concepts.",
                    "Representation Learning of Multiword Expressions with Compositionality Constraint.",
                    "Linear Algebraic Characterization of Logic Programs.",
                    "Representation Learning with Entity Topics for Knowledge Graphs.",
                    "Robust Mapping Learning for Multi-view Multi-label Classification with Missing Labels.",
                    "Fast Subsumption Between Rooted Labeled Trees."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "KSEM 2016",
        "info": "Passau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2016",
                "sub_name": "Knowledge Science, Engineering and Management - 9th International Conference, KSEM 2016, Passau, Germany, October 5-7, 2016, Proceedings.",
                "count": 49,
                "papers": [
                    "BOWL: Bag of Word Clusters Text Representation Using Word Embeddings.",
                    "Clustering Categorical Sequences with Variable-Length Tuples Representation.",
                    "Cellular Automata Based on Occlusion Relationship for Saliency Detection.",
                    "A Practical Method of Identifying Chinese Metaphor Phrases from Corpus.",
                    "Knowledge Extraction from Chinese Records of Cyber Attacks Based on a Semantic Grammar.",
                    "Increasing Topic Coherence by Aggregating Topic Models.",
                    "Learning Chinese-Japanese Bilingual Word Embedding by Using Common Characters.",
                    "Analyzing Topic-Sentiment and Topic Evolution over Time from Social Media.",
                    "An Unsupervised Framework Towards Sci-Tech Compound Entity Recognition.",
                    "Identifying Helpful Online Reviews with Word Embedding Features.",
                    "Facial Texture Analysis for Recognition of Human Gender.",
                    "Quantitative Analysis Academic Evaluation Based on Attenuation-Mechanism.",
                    "When IT Leveraging Competence Meets Uncertainty and Complexity with Social Capital in New Product Development.",
                    "Adoption Factors for Crowdsourcing Based Medical Information Platforms.",
                    "Crowd Label Aggregation Under a Belief Function Framework.",
                    "Weighted Node Importance Contribution Correlation Matrix for Identifying China's Core Metro Technologies with Patent Network Analysis.",
                    "Situation-Aware Rating Prediction Using Fuzzy Rules.",
                    "Adaptive Conceding Strategies for Negotiating Agents Based on Interval Type-2 Fuzzy Logic.",
                    "Semiotic Rules Generation and Inferences Reasoning for Movie Documents.",
                    "Generic Model for Adaptable Caching in the Knowledge-Oriented Web Engineering.",
                    "Automatic Construction of Generalization Hierarchies for Publishing Anonymized Data.",
                    "Schema-Based Query Rewriting in SPARQL.",
                    "Finding the Optimal Users to Mention in the Appropriate Time on Twitter.",
                    "Extracting Knowledge from Web Tables Based on DOM Tree Similarity.",
                    "Single Image Dehazing Using Hölder Coefficient.",
                    "Transfer Learning Based on A+ for Image Super-Resolution.",
                    "Intuitive Knowledge Connectivity: Design and Prototyping of Cross-Platform Knowledge Networks.",
                    "Intellectual Capital and Boundary-Crossing Management Knowledge.",
                    "KPD: An Investigation into the Usability of Knowledge Portal in DMAIC Knowledge Management.",
                    "Knowledge Management and Intellectual Capital in the Logistics Service Industry.",
                    "Digitalizing Seismograms Using a Neighborhood Backtracking Method.",
                    "A Document Modeling Method Based on Deep Generative Model and Spectral Hashing.",
                    "Best Guided Backtracking Search Algorithm for Numerical Optimization Problems.",
                    "Domain Specific Cross-Lingual Knowledge Linking Based on Similarity Flooding.",
                    "LSSL-SSD: Social Spammer Detection with Laplacian Score and Semi-supervised Learning.",
                    "i-Shield: A System to Protect the Security of Your Smartphone.",
                    "Rule Management in Clinical Decision Support Expert System for the Alzheimer Disease.",
                    "Stability Analysis of Switched Systems.",
                    "Implicit and Explicit Trust in Collaborative Filtering.",
                    "A Subset Space Perspective on Agents Cooperating for Knowledge.",
                    "Context-Aware Tree-Based Convolutional Neural Networks for Natural Language Inference.",
                    "Learning Embeddings of API Tokens to Facilitate Deep Learning Based Program Processing.",
                    "Closed-Loop Product Lifecycle Management Based on a Multi-agent System for Decision Making in Collaborative Design.",
                    "A Benchmark for Ontologies Merging Assessment.",
                    "TRSO: A Tourism Recommender System Based on Ontology.",
                    "Generic Ontology Design Patterns: Qualitatively Graded Configuration.",
                    "CUT: A Combined Approach for Tag Recommendation in Software Information Sites.",
                    "CoSoLoRec: Joint Factor Model with Content, Social, Location for Heterogeneous Point-of-Interest Recommendation.",
                    "Evidential Item-Based Collaborative Filtering."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "KSEM 2015",
        "info": "Chongqing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2015",
                "sub_name": "Knowledge Science, Engineering and Management - 8th International Conference, KSEM 2015, Chongqing, China, October 28-30, 2015, Proceedings.",
                "count": 78,
                "papers": [
                    "Subset Spaces Modeling Knowledge-Competitive Agents.",
                    "A Distance-Based Paraconsistent Semantics for DL-Lite.",
                    "Tractable Computation of Representative ABox Repairs in Description Logic Ontologies.",
                    "Restricted Four-Valued Logic for Default Reasoning.",
                    "A Divergence Measure between Mass Functions.",
                    "Fusion of Static and Temporal Information for Threat Evaluation in Sensor Networks.",
                    "Towards Extracting Ontology Excerpts.",
                    "Toward a Type-Theoretical Approach for an Ontologically-Based Detection of Underground Networks.",
                    "Fm-QCA: A Novel Approach to Multi-value Qualitative Comparative Analysis.",
                    "Rational Partial Choice Functions and Their Application to Belief Revision.",
                    "The Double-Level Default Description Logic D 3 L.",
                    "Discovering Classes of Strongly Equivalent Logic Programs with Negation as Failure in the Head.",
                    "Mining Conceptual Knowledge from Network Traffic Data for Traffic Measurement Optimization.",
                    "Research on Fair Use of Digital Content in Social Network.",
                    "Preserving Multi-view Consistency in Diagrammatic Knowledge Representation.",
                    "The Impact of Big Data and Knowledge Management on R&D Projects from Automotive Industry.",
                    "Attractors in Web Based Educational Systems a Conceptual Knowledge Processing Grounded Approach.",
                    "Recognizing the Operating Hand from Touchscreen Traces on Smartphones.",
                    "iCHUM: An Efficient Algorithm for High Utility Mining in Incremental Databases.",
                    "Interval-Index: A Scalable and Fast Approach for Reachability Queries in Large Graphs.",
                    "Accuracy-Preserving and Scalable Column-Based Low-Rank Matrix Approximation.",
                    "Segment-Based Depth Estimation in Light Field Using Graph Cut.",
                    "String Similarity Join with Different Thresholds.",
                    "A Chinese Framework of Semantic Taxonomy and Description: Preliminary Experimental Evaluation Using Web Information Extraction.",
                    "Tree Based Shape Similarity Measurement for Chinese Characters.",
                    "A Hierarchical Pachinko Allocation Model for Social Sentiment Mining.",
                    "Subtopic-Level Sentiment Analysis of Emergencies.",
                    "Summarizing Product Aspects from Massive Online Review with Word Representation.",
                    "Building a High Performance End-to-End Explicit Discourse Parser for Practical Application.",
                    "Graph-Based Query-Focused Multi-document Summarization Using Improved Affinity Graph.",
                    "Hashtag Biased Ranking for Keyword Extraction from Microblog Posts.",
                    "Semi-supervised Microblog Clustering Method via Dual Constraints.",
                    "Exploiting Capacity-Constrained K-Means Clustering for Aspect-Phrase Grouping.",
                    "A Model for Discovering Unpopular Research Interests.",
                    "Improving Transfer Learning in Cross Lingual Opinion Analysis Through Negative Transfer Detection.",
                    "Mining User's Location Intention from Mobile Search Log.",
                    "Course Similarity Calculation Using Efficient Manifold Ranking.",
                    "Multi-faceted Distrust Aware Recommendation.",
                    "Distributed Recommendation Algorithm Based on Matrix Decomposition on MapReduce Framework.",
                    "Crafting a Time-Aware Point-of-Interest Recommendation via Pairwise Interaction Tensor Factorization.",
                    "Novel Approaches for Shop Recommendation in Large Shopping Mall Scenario: From Matrix Factorization to Tensor Decomposition.",
                    "A Microblog Recommendation Algorithm Based on Multi-tag Correlation.",
                    "Personalized Recommendation System Based on Support Vector Machine and Particle Swarm Optimization.",
                    "Transfer Learning in Large-Scale Short Text Analysis.",
                    "Learning the Influence Probabilities Based on Multipolar Factors in Social Network.",
                    "Topic Network: Topic Model with Deep Learning for Image Classification.",
                    "Fast Multi-label Learning via Hashing.",
                    "Building Program Vector Representations for Deep Learning.",
                    "The Use of k-Means Algorithm to Improve Kernel Method via Instance Selection.",
                    "An Effective Hybrid Fraud Detection Method.",
                    "A Fuzzy Inspired Approach to Seismic Anomaly Detection.",
                    "Two-Phased Event Causality Acquisition: Coupling the Boundary Identification and Argument Identification Approaches.",
                    "Change Detection Using L 0 Smoothing and Superpixel Techniques.",
                    "Rare Category Detection Forest.",
                    "Incremental Distributed Weighted Class Discriminant Analysis on Interval-Valued Emitter Parameters.",
                    "Privacy-Preserving Naive Bayes Classification.",
                    "PSFK: A Student Performance Prediction Scheme for First-Encounter Knowledge in ITS.",
                    "CSRA: An Efficient Resource Allocation Algorithm in MapReduce Considering Data Skewness.",
                    "Imbalanced Web Spam Classification Using Self-labeled Techniques and Multi-classifier Models.",
                    "Ensemble of SVM Classifiers with Different Representations for Societal Risk Classification.",
                    "Discovering User's Background Information from Mobile Phone Data.",
                    "Unsupervised Race Walking Recognition Using Smartphone Accelerometers.",
                    "Subspace Clustering on Mobile Data for Discovering Circle of Friends.",
                    "Land Cover Classification Based on Adaptive Interval-Valued Type-2 Fuzzy Clustering Analysis.",
                    "GPS-Based Location Recommendation Using a Belief Network Model.",
                    "A Partitioning Algorithm for Solving Capacitated Arc Routing Problem in Ways of Ranking First Cutting Second.",
                    "UBS: A Novel News Recommendation System Based on User Behavior Sequence.",
                    "A Shilling Attack Detection Method Based on SVM and Target Item Analysis in Collaborative Filtering Recommender Systems.",
                    "Robust Dynamic Background Model with Adaptive Region Based on T2FS and GMM.",
                    "Deriving an Effective Hypergraph Model for Point of Interest Recommendation.",
                    "ProbLog Program Based Ontology Matching.",
                    "Person Re-identification via Learning Visual Similarity on Corresponding Patch Pairs.",
                    "Person Re-identification by Unsupervised Color Spatial Pyramid Matching.",
                    "Prediction of Single Nucleotide Mutation Patterns in Microsatellites.",
                    "Developing a Novel Method Based on Orthogonal Polynomial Equation to Approximate the Solution of Agent Based Model for the Immune System Simulation.",
                    "fMRI Visual Image Reconstruction Using Sparse Logistic Regression with a Tunable Regularization Parameter.",
                    "A Temporal-Compress and Shorter SIFT Research on Web Videos.",
                    "Belief Revision over Infinite Propositional Language."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "KSEM 2014",
        "info": "Sibiu, Romania",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2014",
                "sub_name": "Knowledge Science, Engineering and Management - 7th International Conference, KSEM 2014, Sibiu, Romania, October 16-18, 2014. Proceedings.",
                "count": 34,
                "papers": [
                    "Coming Upon the Classic Notion of Implicit Knowledge Again.",
                    "Knowledge Preemption and Defeasible Rules.",
                    "A Method for Merging Cultural Logic Systems.",
                    "Automatic Building of Socio-semantic Networks for Requirements Analysis - Model and Business Application.",
                    "A Document Clustering Algorithm Based on Semi-constrained Hierarchical Latent Dirichlet Allocation.",
                    "An Ordinal Multi-class Classification Method for Readability Assessment of Chinese Documents.",
                    "Applying Triadic FCA in Studying Web Usage Behaviors.",
                    "Verification Based on Hyponymy Hierarchical Characteristics for Web-Based Hyponymy Discovery.",
                    "Using Standardized Lexical Semantic Knowledge to Measure Similarity.",
                    "Impact of the Sakoe-Chiba Band on the DTW Time Series Distance Measure for kNN Classification.",
                    "Weighting Exponent Selection of Fuzzy C-Means via Jacobian Matrix.",
                    "Dividing Traffic Sub-areas Based on a Parallel K-Means Algorithm.",
                    "On the Social Network Based Semantic Annotation of Conceptual Models.",
                    "Development of an Evaluation Approach for Customer Service Interaction Models.",
                    "Developing Conceptual Modeling Tools Using a DSL.",
                    "The Core Elements of Corporate Knowledge Management and Their Reflection in Research and Practice - The Case of Knowledge Management Systems.",
                    "Combining Bottom-Up and Top-Down Generation of Interactive Knowledge Maps for Enterprise Search.",
                    "A Modeling Procedure for Information and Material Flow Analysis Comprising Graphical Models, Rules and Animated Simulation.",
                    "A Practical Approach to Extracting Names of Geographical Entities and Their Relations from the Web.",
                    "An Improved Backtracking Search Algorithm for Constrained Optimization Problems.",
                    "Sentiment Classification by Combining Triplet Belief Functions.",
                    "Relating the Opinion Holder and the Review Accuracy in Sentiment Analysis of Tourist Reviews.",
                    "Formal Modeling of Airborne Software High-Level Requirements Based on Knowledge Graph.",
                    "Scalable Horn-Like Rule Inference of Semantic Data Using MapReduce.",
                    "Model Checking (k, d)-Markov Chain with ipLTL.",
                    "Argument Ranking with Categoriser Function.",
                    "Investigating Collaboration Dynamics in Different Ontology Development Environments.",
                    "An Ontological Approach for Specifying Provenance into SPARQL Service Descriptions.",
                    "Complex Networks' Analysis Using an Ontology-Based Approach: Initial Steps.",
                    "Review of Knowledge Management Models for Implementation within Advanced Product Quality Planning.",
                    "Assessing the Impact of DMAIC-Knowledge Management Methodology on Six Sigma Projects: An Evaluation through Participant's Perception.",
                    "A Knowledge-Transfer System Integrating Workflow, A Rule Base, Domain Ontologies and a Goal Tree.",
                    "A Conceptual Reference Model of Modeling and Verification Concepts for Hybrid Systems.",
                    "A Semantic-Based EMRs Integration Framework for Diagnosis Decision-Making."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "KSEM 2013",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2013",
                "sub_name": "Knowledge Science, Engineering and Management - 6th International Conference, KSEM 2013, Dalian, China, August 10-12, 2013. Proceedings.",
                "count": 50,
                "papers": [
                    "Co-anomaly Event Detection in Multiple Temperature Series.",
                    "Frequent Patterns Based Word Network: What Can We Obtain from the Tourism Blogs?",
                    "Vague Sets and Closure Systems.",
                    "Building Enhanced Link Context by Logical Sitemap.",
                    "A Nonlinear Dimension Reduction Method with Both Distance and Neighborhood Preservation.",
                    "Consistent Ontologies Evolution Using Graph Grammars.",
                    "Social Welfare Semantics for Value-Based Argumentation Framework.",
                    "Intelligent Graphical User Interface for Managing Resource Knowledge in Cyber Physical Systems.",
                    "A Semantic Technology Supported Precision Agriculture System: A Case Study for Citrus Fertilizing.",
                    "Cost-Sensitive Classification with k-Nearest Neighbors.",
                    "A Thesaurus and Online Encyclopedia Merging Method for Large Scale Domain-Ontology Automatic Construction.",
                    "Towards a Generic Hybrid Simulation Algorithm Based on a Semantic Mapping and Rule Evaluation Approach.",
                    "Micro-blog Hot Event Detection Based on Dynamic Event Model.",
                    "Research on Fuzzy Intelligent Recommendation System Based on Consumer Online Reviews.",
                    "Motivation to Innovation - The Driving Force of Reward-Based Organizational Knowledge Management for New Product Development Performance.",
                    "Size-Constrained Clustering Using an Initial Points Selection Method.",
                    "Handling Incoming Beliefs.",
                    "Modified Collaborative Filtering Algorithm Based on Multivariate Meta-similarity.",
                    "Representation and Reasoning on RBAC: A Nonmonotonic Approach.",
                    "System Dynamics Modeling of Diffusion of Alternative Fuel Vehicles.",
                    "Discovering the Overlapping and Hierarchical Community Structure in a Social Network.",
                    "A Knowledge Based System of Principled Negotiation for Complex Business Contract.",
                    "Evolving Model of Emergency Planning System in China.",
                    "Navigability of Hierarchical-Tag-Based Folksonomies.",
                    "TYG: A Tag-as-You-Go Online Annotation Tool for Web Browsing and Navigation.",
                    "On the Use of a Mixed Binary Join Tree for Exact Inference in Dynamic Directed Evidential Networks with Conditional Belief Functions.",
                    "Multiobjective-integer-programming-based Sensitive Frequent Itemsets Hiding.",
                    "Measuring Formula-Variable Relevance in Four-Valued Logic by Forgetting.",
                    "Evolution Analysis of Modularity-Based Java System Structure.",
                    "Online Knowledge Community: Conceptual Clarification and a CAS View for Its Collective Intelligence.",
                    "A New Epistemic Logic Model of Regret Games.",
                    "A Fuzzy Logic Based Model of a Bargaining Game.",
                    "Domain Ontology Enrichment Based on the Semantic Component of LMF-Standardized Dictionaries.",
                    "Research on Relationships between Response Implementation Activities in Multiple Emergencies Based on Instantiated Knowledge Element.",
                    "The Method of Emergency Rescue Program Generation in Civil Aviation Airport of China.",
                    "Detection of Article Qualities in the Chinese Wikipedia Based on C4.5 Decision Tree.",
                    "The Category Structure in Wikipedia: To Analyze and Know Its Quality Using K-Core Decomposition.",
                    "Learning to Map Chinese Sentences to Logical Forms.",
                    "Representation and Verification of Attribute Knowledge.",
                    "Knowledge and Ontology Engineering for Smart Services.",
                    "Learning to Classify Short Text with Topic Model and External Knowledge.",
                    "An Efficient Hierarchical Graph Clustering Algorithm Based on Shared Neighbors and Links.",
                    "A Correlation-Based Approach to Consumer Oriented Evaluation of Product Recommendation.",
                    "The Failure Prediction of Cluster Systems Based on System Logs.",
                    "Analysis on Current Research of Supernetwork through Knowledge Mapping Method.",
                    "Dealing with Trust, Distrust and Ignorance.",
                    "Function Design of Ancient Books Repairing Archives Management System Based on Tacit Knowledge.",
                    "A Web Tool for Extracting and Viewing the Semantic Markups.",
                    "Using Support Vector Machine for Classification of Baidu Hot Word.",
                    "Context-Free and Context-Dependent Service Models Based on \"Role Model\" Concept for Utilizing Cultural Aspects."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "KSEM 2011",
        "info": "Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2011",
                "sub_name": "Knowledge Science, Engineering and Management - 5th International Conference, KSEM 2011, Irvine, CA, USA, December 12-14, 2011. Proceedings.",
                "count": 41,
                "papers": [
                    "Wavelet-Based Method for Detecting Seismic Anomalies in DEMETER Satellite Data.",
                    "Interest Logic and Its Application on the Web.",
                    "Ensemble Learning for Customers Targeting.",
                    "An Approach to Generating Proposals for Handling Inconsistent Software Requirements.",
                    "Enforcing Logically Weaker Knowledge in Classical Logic.",
                    "Gaussian Process for Recommender Systems.",
                    "A Hybrid Approach for Measuring Semantic Similarity between Ontologies Based on WordNet.",
                    "A Recipe Recommendation System Based on Automatic Nutrition Information Extraction.",
                    "Analyzing Tag Distributions in Folksonomies for Resource Classification.",
                    "Time Series Similarity Measure Based on the Function of Degree of Disagreement.",
                    "A Resource Recommendation Method Based on User Taste Diffusion Model in Folksonomies.",
                    "Automatically Constructing Concept Hierarchies of Health-Related Human Goals.",
                    "Towards Implicit Knowledge Discovery from Ontology Change Log Data.",
                    "On Constructing Software Environment Ontology for Time-Continuous Environment.",
                    "Online Internet Intrusion Detection Based on Flow Statistical Characteristics.",
                    "A Perspective of Knowledge Science.",
                    "Finding Experts in Tag Based Knowledge Sharing Communities.",
                    "Data Clustering by Scaled Adjacency Matrix.",
                    "An Engineerable Ontology Based Approach for Requirements Elicitation in Process Centered Problem Domain.",
                    "Design of a Scalable Reasoning Engine for Distributed, Real-Time and Embedded Systems.",
                    "Representing Belief Function Knowledge with Graphical Models.",
                    "Model of Intangible Production Network for Competence Development.",
                    "Using a Dependently-Typed Language for Expressing Ontologies.",
                    "Dynamic Rank Correlation Computing for Financial Risk Analysis.",
                    "Competence-Based Management of Knowledge Workers in Project-Oriented Organizations.",
                    "Empirical Discriminative Tensor Analysis for Crime Forecasting.",
                    "Multi-Agent System for Semantic Web Service Composition.",
                    "A Probability Model for Related Entity Retrieval Using Relation Pattern.",
                    "Fuzzy Target-Based Multi-feature Evaluation of Traditional Craft Products.",
                    "A New Over-Sampling Approach: Random-SMOTE for Learning from Imbalanced Data Sets.",
                    "Formalising Knowledge-Intensive Nuclear Fuel Process Models Using Pattern Theory.",
                    "Weight Factor Algorithms for Activity Recognition in Lattice-Based Sensor Fusion.",
                    "On the Translation from Quantified Modal Logic into the Counterpart Theory Revisited.",
                    "Image Stabilization Based on Harris Corners and Optical Flow.",
                    "Modes-Based-Analysis of Knowledge Transfer in the Organizations.",
                    "A Meta-Model for Studying the Coevolution of Knowledge and Collaboration Networks.",
                    "Imputing Missing Values for Mixed Numeric and Categorical Attributes Based on Incomplete Data Hierarchical Clustering.",
                    "A New Domain Adaptation Method Based on Rules Discovered from Cross-Domain Features.",
                    "Automatic Translation in Context-Aware Applications.",
                    "Proposal of Ontology for Resource Matchmaking Schema in Emergency Response Systems.",
                    "Constructing the Shortest ECOC for Fast Multi-classification."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "KSEM 2010",
        "info": "Belfast, Northern Ireland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2010",
                "sub_name": "Knowledge Science, Engineering and Management, 4th International Conference, KSEM 2010, Belfast, Northern Ireland, UK, September 1-3, 2010. Proceedings.",
                "count": 61,
                "papers": [
                    "Mining Video Data: Learning about Activities.",
                    "Ontology Languages and Engineering.",
                    "Theory of Belief Functions for Data Analysis and Machine Learning Applications: Review and Prospects.",
                    "Modeling Ontological Concepts of Locations with a Heterogeneous Cardinal Direction Model.",
                    "Finding Minimal Rare Itemsets and Rare Association Rules.",
                    "Background Knowledge Integration in Clustering Using Purity Indexes.",
                    "A Comparison of Merging Operators in Possibilistic Logic.",
                    "Modelling and Reasoning in Metamodelling Enabled Ontologies.",
                    "Towards Encoding Background Knowledge with Temporal Extent into Neural Networks.",
                    "A Fuzzy Description Logic with Automatic Object Membership Measurement.",
                    "Decomposition-Based Optimization for Debugging of Inconsistent OWL DL Ontologies.",
                    "A Concept Hierarchy Based Ontology Mapping Approach.",
                    "Composing Cardinal Direction Relations Basing on Interval Algebra.",
                    "Retrieval Result Presentation and Evaluation.",
                    "Autonomy: Life and Being.",
                    "A Method of Social Collaboration and Knowledge Sharing Acceleration for e-Learning System: The Distance Learning Network Scenario.",
                    "A Comparative Study of Target-Based Evaluation of Traditional Craft Patterns Using Kansei Data.",
                    "Optimization of Multiple Related Negotiation through Multi-Negotiation Network.",
                    "Reasoning Activity for Smart Homes Using a Lattice-Based Evidential Structure.",
                    "Knowledge Modelling to Support Inquiry Learning Tasks.",
                    "Building the Knowledge Base to Support the Automatic Animation Generation of Chinese Traditional Architecture.",
                    "Discovery of Relation Axioms from the Web.",
                    "An Improved Piecewise Aggregate Approximation Based on Statistical Features for Time Series Mining.",
                    "Incorporating Duration Information in Activity Recognition.",
                    "A Graphical Model for Risk Analysis and Management.",
                    "Towards Awareness Services Usage Characterization: Clustering Sessions in a Knowledge Building Environment.",
                    "Adjusting Class Association Rules from Global and Local Perspectives Based on Evolutionary Computation.",
                    "Probabilistic Declarative Process Mining.",
                    "Making Ontology-Based Knowledge and Decision Trees Interact: An Approach to Enrich Knowledge and Increase Expert Confidence in Data-Driven Models.",
                    "A Novel Initialization Method for Semi-supervised Clustering.",
                    "Constructing and Mapping Fuzzy Thematic Clusters to Higher Ranks in a Taxonomy.",
                    "Anticipation as a Strategy: A Design Paradigm for Robotics.",
                    "Modular Logic Programming for Web Data, Inheritance and Agents.",
                    "Automatic Collecting Technique of Low Frequency Electromagnetic Signals and Its Application in Earthquake Study.",
                    "Improving Search in Tag-Based Systems with Automatically Extracted Keywords.",
                    "Towards a Framework for Trusting the Automated Learning of Social Ontologies.",
                    "PlayPhysics: An Emotional Games Learning Environment for Teaching Physics.",
                    "A SOM-Based Technique for a User-Centric Content Extraction and Classification of Web 2.0 with a Special Consideration of Security Aspects.",
                    "Modularizing Spatial Ontologies for Assisted Living Systems.",
                    "Towards Scalable Instance Retrieval over Ontologies.",
                    "MindDigger: Feature Identification and Opinion Association for Chinese Movie Reviews.",
                    "The Impact of Latency on Online Classification Learning with Concept Drift.",
                    "Efficient Reasoning with RCC-3D.",
                    "Automated Ontology Generation Using Spatial Reasoning.",
                    "Facilitating Experience Reuse: Towards a Task-Based Approach.",
                    "Behavioural Rule Discovery from Swarm Systems.",
                    "Knowledge Discovery Using Bayesian Network Framework for Intelligent Telecommunication Network Management.",
                    "Combining Logic and Probabilities for Discovering Mappings between Taxonomies.",
                    "An Ontology-Based Semantic Web Service Space Organization and Management Model.",
                    "Genetic Algorithm-Based Multi-objective Optimisation for QoS-Aware Web Services Composition.",
                    "Knowledge Merging under Multiple Attributes.",
                    "Feature Selection Based on Mutual Information and Its Application in Hyperspectral Image Classification.",
                    "Static, Dynamic and Semantic Dimensions: Towards a Multidisciplinary Approach of Social Networks Analysis.",
                    "Knowledge Based Systems and Metacognition in Radar.",
                    "Maximus-AI: Using Elman Neural Networks for Implementing a SLMR Trading Strategy.",
                    "A Formalism for Causal Explanations with an Answer Set Programming Translation.",
                    "Earthquake Prediction Based on Levenberg-Marquardt Algorithm Constrained Back-Propagation Neural Network Using DEMETER Data.",
                    "Affinity Propagation on Identifying Communities in Social and Biological Networks.",
                    "Semantic Decomposition of Indicators and Corresponding Measurement Units.",
                    "Engineering Knowledge for Assistive Living.",
                    "Large-Scale, Exhaustive Lattice-Based Structural Auditing of SNOMED CT."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "KSEM 2009",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2009",
                "sub_name": "Knowledge Science, Engineering and Management, Third International Conference, KSEM 2009, Vienna, Austria, November 25-27, 2009. Proceedings.",
                "count": 44,
                "papers": [
                    "Models in Knowledge Management.",
                    "Two Applications of Computer-Aided Theorem Discovery and Verification.",
                    "Knowware: The Third Star after Hardware and Software.",
                    "Required Knowledge for Delivering Services.",
                    "Mapping Relational Databases to the Semantic Web with Original Meaning.",
                    "Computing Knowledge-Based Semantic Similarity from the Web: An Application to the Biomedical Domain.",
                    "An Anytime Algorithm for Computing Inconsistency Measurement.",
                    "Forwarding Credible Information in Multi-agent Systems.",
                    "Convergence Analysis of Affinity Propagation.",
                    "Propagation of Random Perturbations under Fuzzy Algebraic Operators.",
                    "Two Approaches to Iterated Belief Contraction.",
                    "The Dual Spatial Connectives of Separation Logic.",
                    "Knowledge Engineering in Future Internet.",
                    "Developing Diagnostic DSSs Based on a Novel Data Collection Methodology.",
                    "Data Integration for Business Analytics: A Conceptual Approach.",
                    "New Labeling Strategy for Semi-supervised Document Categorization.",
                    "A Competitive Learning Approach to Instance Selection for Support Vector Machines.",
                    "Knowledge Discovery from Academic Search Engine.",
                    "Interactive Visualization in Knowledge Discovery for Academic Evaluation and Accreditation.",
                    "Aggregation Models for People Finding in Enterprise Corpora.",
                    "Debt Detection in Social Security by Adaptive Sequence Classification.",
                    "Ontology Based Opinion Mining for Movie Reviews.",
                    "Concept-Based, Personalized Web Information Gathering: A Survey.",
                    "The Online Market Observatory: A Domain Model Approach.",
                    "Data Driven Rank Ordering and Its Application to Financial Portfolio Construction.",
                    "Prioritizing Non-functional Concerns in MAMIE Methodology.",
                    "Verifying Software Requirements Based on Answer Set Programming.",
                    "Blending the Sketched Use Case Scenario with License Agreements Using Semantics.",
                    "A Comparative Analysis for Detecting Seismic Anomalies in Data Sequences of Outgoing Longwave Radiation.",
                    "On Optimization of Predictions in Ontology-Driven Situation Awareness.",
                    "On Undecidability of Cyclic Scheduling Problems.",
                    "Combination of Two KM Strategies by Web 2.0.",
                    "Measuring KM Success and KM Service Quality with KnowMetrix - First Experiences from a Case Study in a Software Company.",
                    "Knowledge Creation Spaces: The Power of Project Teams.",
                    "Competence Management in Knowledge-Based Organisation: Case Study Based on Higher Education Organisation.",
                    "Knowledge Maturing Services: Supporting Knowledge Maturing in Organisational Environments.",
                    "How Much Well Does Organizational Knowledge Transfer Work with Domain and Rule Ontologies?",
                    "Ontology Evaluation through Assessment of Inferred Statements: Study of a Prototypical Implementation of an Ontology Questionnaire for OWL DL Ontologies.",
                    "Knowledge-Based Process Modelling for Nuclear Inspection.",
                    "Two Dependency Modeling Approaches for Business Process Adaptation.",
                    "The IT-Socket: Model-Based Business and IT Alignment.",
                    "Identifying and Supporting Collaborative Architectures.",
                    "An Examination of Talent Management Concepts in Knowledge Intensive Settings.",
                    "A 'Soft' Approach to TLM Requirements Capture to Support Through-Life Management."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "KSEM 2007",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2007",
                "sub_name": "Knowledge Science, Engineering and Management, Second International Conference, KSEM 2007, Melbourne, Australia, November 28-30, 2007, Proceedings.",
                "count": 75,
                "papers": [
                    "Building Relationships and Negotiating Agreements in a Network of Agents.",
                    "Knowledge Technologies for the Social Semantic Desktop.",
                    "Knowledge-Based Intelligent Engineering Systems in Defence and Security.",
                    "Auditing and Mapping the Knowledge Assets of Business Processes - An Empirical Study.",
                    "Quotient Space Based Multi-granular Analysis.",
                    "An Ontology-Based Reasoning Framework for Reaction Mechanisms Simulation.",
                    "Identifying Dependency Between Secure Messages for Protocol Analysis.",
                    "A Diagrammatic Reasoning System for ALC.",
                    "Fuzzy Constraint Logic Programming with Answer Set Semantics.",
                    "Prime Implicates for Approximate Reasoning.",
                    "Distributed Constraint Satisfaction for Urban Traffic Signal Control.",
                    "Convergence Analysis on Approximate Reinforcement Learning.",
                    "Combinative Reasoning with RCC5 and Cardinal Direction Relations.",
                    "A Merging-Based Approach to Handling Inconsistency in Locally Prioritized Software Requirements.",
                    "A Dynamic Description Logic for Representation and Reasoning About Actions.",
                    "An Argumentative Reasoning Service for Deliberative Agents.",
                    "On Defense Strength of Blocking Defeaters in Admissible Sets.",
                    "Ontology-Based Inference for Causal Explanation.",
                    "Predicting Partners' Behaviors in Negotiation by Using Regression Analysis.",
                    "Enhancing Web-Based Adaptive Learning with Colored Timed Petri Net.",
                    "Proof Explanation for the Semantic Web Using Defeasible Logic.",
                    "Automatic Construction of a Lexical Attribute Knowledge Base.",
                    "Populating CRAB Ontology Using Context-Profile Based Approaches.",
                    "Learning Dependency Model for AMP-Activated Protein Kinase Regulation.",
                    "Towards a Wrapper-Driven Ontology-Based Framework for Knowledge Extraction.",
                    "A Google-Based Statistical Acquisition Model of Chinese Lexical Concepts.",
                    "Learning Concepts from Text Based on the Inner-Constructive Model.",
                    "Contextual Proximity Based Term-Weighting for Improved Web Information Retrieval.",
                    "Collection Profiling for Collection Fusion in Distributed Information Retrieval Systems.",
                    "Integration of Descriptors for Software Component Retrieval.",
                    "Framework for Text-Based Conversational User-Interface for Business Applications.",
                    "Ontology Mining for Semantic Interpretation of Information Needs.",
                    "Knowledge Flow-Based Document Recommendation for Knowledge Sharing.",
                    "Finding Similar RSS News Articles Using Correlation-Based Phrase Matching.",
                    "Automatic Data Record Detection in Web Pages.",
                    "Visualizing Trends in Knowledge Management.",
                    "Constructing an Ontology for a Research Program from a Knowledge Science Perspective.",
                    "An Ontology of Problem Frames for Guiding Problem Frame Specification.",
                    "A Speaker Based Unsupervised Speech Segmentation Algorithm Used in Conversational Speech.",
                    "Distributed Knowledge Management Based on Ontological Engineering and Multi-Agent System Towards Semantic Interoperation.",
                    "WTPMiner: Efficient Mining of Weighted Frequent Patterns Based on Graph Traversals.",
                    "Development of Enhanced Data Mining System to Approximate Empirical Formula for Ship Design.",
                    "Research on a Novel Word Co-occurrence Model and Its Application.",
                    "Cost-Time Sensitive Decision Tree with Missing Values.",
                    "Knowledge in Product and Performance Support.",
                    "What Drives Members to Continue Sharing Knowledge in a Virtual Professional Community? The Role of Knowledge Self-efficacy and Satisfaction.",
                    "MMFI_DSSW - A New Method to Incrementally Mine Maximal Frequent Itemsets in Transaction Sensitive Sliding Window.",
                    "Term Consistency Checking of Ontology Model Based on Description Logics.",
                    "Design and Realization of Advertisement Promotion Based on the Content of Webpage.",
                    "Irregular Behavior Recognition Based on Two Types of Treading Tracks Under Particular Scenes.",
                    "Ontology-Based Focused Crawling of Deep Web Sources.",
                    "Pattern Recognition in Stock Data Based on a New Segmentation Algorithm.",
                    "HMM-Based Korean Named Entity Recognition for Information Extraction.",
                    "Activity Recognition Based on Hidden Markov Models.",
                    "Novel Data Management Algorithms in Peer-to-Peer Content Distribution Networks.",
                    "On-Line Monitoring and Diagnosis of Failures Using Control Charts and Fault Tree Analysis (FTA) Based on Digital Production Model.",
                    "An Improved NN-SVM Based on K Congener Nearest Neighbors Classification Algorithm.",
                    "Handling Contradictions in Default Theories.",
                    "Algorithm for Public Transit Trip with Minimal Transfer Times and Shortest Travel Time.",
                    "Typed Category Theory-Based Micro-view Emergency Knowledge Representation.",
                    "A Chinese Time Ontology.",
                    "Toward Patterns for Collaborative Knowledge Creation.",
                    "Service-Mining Based on Knowledge and Customer Databases.",
                    "A Multi-criteria Decision Support System of Water Resource Allocation Scenarios.",
                    "Gödel, Escher, Bach and Super-expertise.",
                    "Extracting Features for Verifying WordNet.",
                    "A Hybrid Approach for Learning Markov Equivalence Classes of Bayesian Network.",
                    "A WSMO-Based Semantic Web Services Discovery Framework in Heterogeneous Ontologies Environment.",
                    "Cardinal Direction Relations in 3D Space.",
                    "Knowledge Integration on Fresh Food Management.",
                    "An Approach to Knowledge Transferring in Science-Policy Process.",
                    "Trust Analysis of Web Services Based on a Trust Ontology.",
                    "Building Bilingual Ontology from WordNet and Chinese Classified Thesaurus.",
                    "An Ontology-Based Framework for Building Adaptable Knowledge Management Systems.",
                    "Knowledge Engineering Technique for Cluster Development."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "KSEM 2006",
        "info": "Guilin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ksem/2006",
                "sub_name": "Knowledge Science, Engineering and Management, First International Conference, KSEM 2006, Guilin, China, August 5-8, 2006, Proceedings.",
                "count": 55,
                "papers": [
                    "On Representational Issues About Combinations of Classical Theories with Nonmonotonic Rules.",
                    "Towards a Software/Knowware Co-engineering.",
                    "Modeling and Evaluation of Technology Creation Process in Academia.",
                    "Knowledge Management Systems (KMS) Continuance in Organizations: A Social Relational Perspective.",
                    "Modelling the Interaction Between Objects: Roles as Affordances.",
                    "Knowledge Acquisition for Diagnosis in Cellular Networks Based on Bayesian Networks.",
                    "Building Conceptual Knowledge for Managing Learning Paths in e-Learning.",
                    "Measuring Similarity in the Semantic Representation of Moving Objects in Video.",
                    "A Case Study for CTL Model Update.",
                    "Modeling Strategic Beliefs with Outsmarting Belief Systems.",
                    "Marker-Passing Inference in the Scone Knowledge-Base System.",
                    "Hyper Tableaux - The Third Version.",
                    "A Service-Oriented Group Awareness Model and Its Implementation.",
                    "An Outline of a Formal Ontology of Genres.",
                    "An OWL-Based Approach for RBAC with Negative Authorization.",
                    "LCS: A Linguistic Combination System for Ontology Matching.",
                    "Framework for Collaborative Knowledge Sharing and Recommendation Based on Taxonomic Partial Reputations.",
                    "On Text Mining Algorithms for Automated Maintenance of Hierarchical Knowledge Directory.",
                    "Using Word Clusters to Detect Similar Web Documents.",
                    "Construction of Concept Lattices Based on Indiscernibility Matrices.",
                    "Selection of Materialized Relations in Ontology Repository Management System.",
                    "Combining Topological and Directional Information: First Results.",
                    "Measuring Conflict Between Possibilistic Uncertain Information Through Belief Function Theory.",
                    "WWW Information Integration Oriented Classification Ontology Integrating Approach.",
                    "Configurations for Inference Between Causal Statements.",
                    "Taking Levi Identity Seriously: A Plea for Iterated Belief Contraction.",
                    "Description and Generation of Computational Agents.",
                    "Knowledge Capability: A Definition and Research Model.",
                    "Quota-Based Merging Operators for Stratified Knowledge Bases.",
                    "Enumerating Minimal Explanations by Minimal Hitting Set Computation.",
                    "Observation-Based Logic of Knowledge, Belief, Desire and Intention.",
                    "Repairing Inconsistent XML Documents.",
                    "A Framework for Automated Test Generation in Intelligent Tutoring Systems.",
                    "A Study on Knowledge Creation Support in a Japanese Research Institute.",
                    "Identity Conditions for Ontological Analysis.",
                    "Knowledge Update in a Knowledge-Based Dynamic Scheduling Decision System.",
                    "Knowledge Contribution in the Online Virtual Community: Capability and Motivation.",
                    "Effective Large Scale Ontology Mapping.",
                    "A Comparative Study on Representing Units in Chinese Text Clustering.",
                    "A Description Method of Ontology Change Management Using Pi-Calculus.",
                    "On Constructing Environment Ontology for Semantic Web Services.",
                    "Knowledge Reduction in Incomplete Systems Based on gamma-Tolerance Relation.",
                    "An Extension Rule Based First-Order Theorem Prover.",
                    "An Extended Meta-model for Workflow Resource Model.",
                    "Knowledge Reduction Based on Evidence Reasoning Theory in Ordered Information Systems.",
                    "A Novel Maximum Distribution Reduction Algorithm for Inconsistent Decision Tables.",
                    "An ICA-Based Multivariate Discretization Algorithm.",
                    "An Empirical Study of What Drives Users to Share Knowledge in Virtual Communities.",
                    "A Method for Evaluating the Knowledge Transfer Ability in Organization.",
                    "Information Extraction from Semi-structured Web Documents.",
                    "Si-SEEKER: Ontology-Based Semantic Search over Databases.",
                    "Efficient Computation of Multi-feature Data Cubes.",
                    "NKIMathE - A Multi-purpose Knowledge Management Environment for Mathematical Concepts.",
                    "Linguistic Knowledge Representation and Automatic Acquisition Based on a Combination of Ontology with Statistical Method.",
                    "Toward Formalizing Usefulness in Propositional Language."
                ]
            }
        ]
    }
]