[
    {
        "name": "Machine Learning",
        "year": "2022",
        "info": "2022: Volume 111",
        "count": 12,
        "papers": [
            "Stronger data poisoning attacks break data sanitization defenses.",
            "Embed2Detect: temporally clustered embedded words for event detection in social media.",
            "How to measure uncertainty in uncertainty sampling for active learning.",
            "Learning from interpretation transition using differentiable logic programming semantics.",
            "Inductive logic programming at 30.",
            "SAMBA: safe model-based & active reinforcement learning.",
            "InfoGram and admissible machine learning.",
            "Boosting Poisson regression models with telematics car driving data.",
            "ReliefE: feature ranking in high-dimensional spaces via manifold embeddings.",
            "Smoothing graphons for modelling exchangeable relational data.",
            "Understanding generalization error of SGD in nonconvex optimization.",
            "Quick and robust feature selection: the strength of energy-efficient sparse training for autoencoders."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2021",
        "info": "2021: Volume 110",
        "count": 102,
        "papers": [
            "How artificial intelligence and machine learning can help healthcare systems respond to COVID-19.",
            "CPAS: the UK's national machine learning-based hospital capacity planning system for COVID-19.",
            "Node classification over bipartite graphs through projection.",
            "Interpretable clustering: an optimization approach.",
            "Statistical hierarchical clustering algorithm for outlier detection in evolving data streams.",
            "Imputation of clinical covariates in time series.",
            "The voice of optimization.",
            "LoRAS: an oversampling approach for imbalanced datasets.",
            "Conditional variance penalties and domain shift robustness.",
            "Kernel machines for current status data.",
            "Regularisation of neural networks by enforcing Lipschitz continuity.",
            "Global optimization based on active preference learning with radial basis functions.",
            "Correction to: Fast and accurate pseudoinverse with sparse matrix reordering and incremental approach.",
            "F*: an interpretable transformation of the F-measure.",
            "Aleatoric and epistemic uncertainty in machine learning: an introduction to concepts and methods.",
            "Reshaped tensor nuclear norms for higher order tensor completion.",
            "Coupling matrix manifolds assisted optimization for optimal transport problems.",
            "Concentration bounds for temporal difference learning with linear function approximation: the case of batch data and uniform sampling.",
            "Correction to: Fast and accurate pseudoinverse with sparse matrix reordering and incremental approach.",
            "An extended DEIM algorithm for subset selection and class identification.",
            "Protect privacy of deep classification networks by exploiting their generative power.",
            "SPEED: secure, PrivatE, and efficient deep learning.",
            "Beneficial and harmful explanatory machine learning.",
            "Probabilistic inductive constraint logic.",
            "Top program construction and reduction for polynomial time Meta-Interpretive learning.",
            "AUTOMAT[R]IX: learning simple matrix pipelines.",
            "Learning programs by learning from failures.",
            "Bayesian optimization with approximate set kernels.",
            "QuicK-means: accelerating inference for K-means by learning fast transforms.",
            "Robust supervised topic models under label noise.",
            "Convex programming based spectral clustering.",
            "Large scale multi-label learning using Gaussian processes.",
            "autoBOT: evolving neuro-symbolic representations for explainable low resource text classification.",
            "Topic extraction from extremely short texts with variational manifold regularization.",
            "Adaptive covariate acquisition for minimizing total cost of classification.",
            "Pseudo-marginal Bayesian inference for Gaussian process latent variable models.",
            "Analysis of regularized least-squares in reproducing kernel Kreĭn spaces.",
            "Reachable sets of classifiers and regression models: (non-)robustness analysis and robust training.",
            "Toward optimal probabilistic active learning using a Bayesian approach.",
            "Multi-objective multi-armed bandit with lexicographically ordered and satisficing objectives.",
            "Importance sampling in reinforcement learning with an estimated behavior policy.",
            "Efficient Weingarten map and curvature estimation on manifolds.",
            "Graph-based semi-supervised learning via improving the quality of the graph dynamically.",
            "A framework for the fine-grained evaluation of the instantaneous expected value of soccer possessions.",
            "Automated adaptation strategies for stream learning.",
            "Estimation of multidimensional item response theory models with correlated latent variables using variational autoencoders.",
            "Early classification of time series.",
            "Multiple clusterings of heterogeneous information networks.",
            "MODES: model-based optimization on distributed embedded systems.",
            "Optimal data collection design in machine learning: the case of the fixed effects generalized least squares panel data model.",
            "Learning subtree pattern importance for Weisfeiler-Lehman based graph kernels.",
            "Incorporating symbolic domain knowledge into graph neural networks.",
            "Learning hierarchical probabilistic logic programs.",
            "Beyond graph neural networks with lifted relational neural networks.",
            "Inductive learning of answer set programs for autonomous surgical task planning.",
            "Distance metric learning for graph structured data.",
            "OWL2Vec*: embedding of OWL ontologies.",
            "A comparison of statistical relational learning and graph neural networks for aggregate graph queries.",
            "Tensor Q-rank: new data dependent definition of tensor rank.",
            "Joint optimization of an autoencoder for clustering and embedding.",
            "Linear support vector regression with linear constraints.",
            "An empirical comparison between stochastic and deterministic centroid initialisation for K-means variations.",
            "Triply stochastic gradient method for large-scale nonlinear similar unlabeled classification.",
            "TRU-NET: a deep learning approach to high resolution prediction of rainfall.",
            "On testing transitivity in online preference learning.",
            "Variational learning from implicit bandit feedback.",
            "Testing conditional independence in supervised learning algorithms.",
            "AgFlow: fast model selection of penalized PCA via implicit regularization effects of gradient flow.",
            "Sampled Gromov Wasserstein.",
            "Density-based weighting for imbalanced regression.",
            "Gaussian processes with skewed Laplace spectral mixture kernels for long-term forecasting.",
            "Information-theoretic regularization for learning global features by sequential VAE.",
            "Convex optimization with an interpolation-based projection and its application to deep learning.",
            "Guest editorial: special issue on reinforcement learning for real life.",
            "Inverse reinforcement learning in contextual MDPs.",
            "A deep reinforcement learning framework for continuous intraday market bidding.",
            "Bandit algorithms to personalize educational chatbots.",
            "Challenges of real-world reinforcement learning: definitions, benchmarks and analysis.",
            "Grounded action transformation for sim-to-real reinforcement learning.",
            "Air Learning: a deep reinforcement learning gym for autonomous aerial robot visual navigation.",
            "Dealing with multiple experts and non-stationarity in inverse reinforcement learning: an application to real-life problems.",
            "Lessons on off-policy methods from a notification component of a chatbot.",
            "Partially observable environment estimation with uplift inference for reinforcement learning based recommendation.",
            "Automatic discovery of interpretable planning strategies.",
            "IntelligentPooling: practical Thompson sampling for mHealth.",
            "Ordinal regression with explainable distance metric learning based on ordered sequences.",
            "Provable training set debugging for linear regression.",
            "RADE: resource-efficient supervised anomaly detection using decision tree-based ensemble methods.",
            "ZipLine: an optimized algorithm for the elastic bulk synchronous parallel model.",
            "Conditional t-SNE: more informative t-SNE embeddings.",
            "Robust non-parametric regression via incoherent subspace projections.",
            "Introduction to the special issue of the ECML PKDD 2021 journal track.",
            "MLife: a lite framework for machine learning lifecycle initialization.",
            "Tensor decision trees for continual learning from drifting data streams.",
            "Deep learning and multivariate time series for cheat detection in video games.",
            "RB-CCR: Radial-Based Combined Cleaning and Resampling algorithm for imbalanced data classification.",
            "A unified framework for closed-form nonparametric regression, classification, preference and mixed problems with Skew Gaussian Processes.",
            "Data driven conditional optimal transport.",
            "Misalignment problem in matrix decomposition with missing values.",
            "Sparse classification: a scalable discrete optimization perspective.",
            "HIVE-COTE 2.0: a new meta ensemble for time series classification.",
            "Loss aware post-training quantization."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2020",
        "info": "2020: Volume 109",
        "count": 87,
        "papers": [
            "Analysis of Hannan consistent selection for Monte Carlo tree search in simultaneous move games.",
            "Rankboost+: an improvement to Rankboost.",
            "Combining Bayesian optimization and Lipschitz optimization.",
            "Provable accelerated gradient method for nonconvex low rank optimization.",
            "Sum-product graphical models.",
            "Kappa Updated Ensemble for drifting data stream mining.",
            "Online Bayesian max-margin subspace learning for multi-view classification and regression.",
            "An evaluation of machine-learning for predicting phenotype: studies in yeast, rice, and wheat.",
            "On some graph-based two-sample tests for high dimension, low sample size data.",
            "Predictive spreadsheet autocompletion with constraints.",
            "A bad arm existence checking problem: How to utilize asymmetric problem structure?",
            "A survey on semi-supervised learning.",
            "Foreword: special issue for the journal track of the 11th Asian Conference on Machine Learning (ACML 2019).",
            "Joint consensus and diversity for multi-view semi-supervised classification.",
            "Gradient descent optimizes over-parameterized deep ReLU networks.",
            "Skill-based curiosity for intrinsically motivated reinforcement learning.",
            "Principled analytic classifier for positive-unlabeled learning via weighted integral probability metric.",
            "Handling concept drift via model reuse.",
            "Communication-efficient distributed multi-task learning with matrix sparsity regularization.",
            "Rank minimization on tensor ring: an efficient approach for tensor decomposition and completion.",
            "Multi-label optimal margin distribution machine.",
            "Few-shot learning with adaptively initialized task optimizer: a practical meta-learning approach.",
            "Conditional density estimation and simulation through optimal transport.",
            "Scalable Bayesian preference learning for crowds.",
            "Learning from positive and unlabeled data: a survey.",
            "Classification using proximity catch digraphs.",
            "Distributed block-diagonal approximation methods for regularized empirical risk minimization.",
            "On cognitive preferences and the plausibility of rule-based models.",
            "High-dimensional model recovery from random sketched data by exploring intrinsic sparsity.",
            "Model-based kernel sum rule: kernel Bayesian inference with probabilistic models.",
            "Sparse hierarchical regression with polynomials.",
            "Improved graph-based SFA: information preservation complements the slowness principle.",
            "Joint maximization of accuracy and information for learning the structure of a Bayesian network classifier.",
            "Editorial: Machine learning for safety-critical applications in engineering.",
            "Engineering problems in machine learning systems.",
            "Detecting anomalous packets in network transfers: investigations using PCA, autoencoder and isolation forest in TCP.",
            "Guest Editorial: Special issue on Discovery Science.",
            "Effective approximation of parametrized closure systems over transactional data streams.",
            "Feature ranking for multi-target regression.",
            "Ranking by inspiration: a network science approach.",
            "Exploiting causality in gene network reconstruction based on graph embedding.",
            "Reflections on reciprocity in research.",
            "Guest editors' introduction: special issue on Inductive Logic Programming (ILP 2019).",
            "Learning higher-order logic programs.",
            "Logical reduction of metarules.",
            "Constructing generative logical models for optimisation problems using domain knowledge.",
            "Inductive general game playing.",
            "Transfer learning by mapping and revising boosted relational dependency networks.",
            "Propositionalization and embeddings: two sides of the same coin.",
            "An empirical analysis of binary transformation strategies and base algorithms for multi-label learning.",
            "Correction to: Efficient feature selection using shrinkage estimators.",
            "Double random forest.",
            "Classification with costly features as a sequential decision-making problem.",
            "Anomaly detection with inexact labels.",
            "Robust classification via MOM minimization.",
            "Correction to: Robust classification via MOM minimization.",
            "Discovering subjectively interesting multigraph patterns.",
            "Introduction to the special issue of the ECML PKDD 2020 journal track.",
            "Active deep Q-learning with demonstration.",
            "Improving coordination in small-scale multi-agent deep reinforcement learning through memory-driven communication.",
            "Using error decay prediction to overcome practical issues of deep active learning for named entity recognition.",
            "Learning representations from dendrograms.",
            "Imbalanced regression and extreme value prediction.",
            "Ada-boundary: accelerating DNN training via adaptive boundary batch selection.",
            "A decision-theoretic approach for model interpretability in Bayesian framework.",
            "Skew Gaussian processes for classification.",
            "Weak approximation of transformed stochastic gradient MCMC.",
            "High-dimensional Bayesian optimization using low-dimensional feature spaces.",
            "Fast greedy C-bound minimization with guarantees.",
            "In memory of Tom Fawcett.",
            "Guest editors' introduction to the special issue on Discovery Science.",
            "Evaluating time series forecasting models: an empirical study on performance estimation methods.",
            "Co-eye: a multi-resolution ensemble classifier for symbolically approximated time series.",
            "Unsupervised representation learning with Minimax distance measures.",
            "Bonsai: diverse and shallow trees for extreme multi-label classification.",
            "Incremental predictive clustering trees for online semi-supervised multi-target regression.",
            "Multi-label feature ranking with ensemble methods.",
            "Embedding-based Silhouette community detection.",
            "Predicting rice phenotypes with meta and multi-target learning.",
            "Ensembles of extremely randomized predictive clustering trees for predicting structured outputs.",
            "Foreword: special issue for the journal track of the 12th Asian conference on machine learning (ACML 2020).",
            "Learning with mitigating random consistency from the accuracy measure.",
            "Robust high dimensional expectation maximization algorithm via trimmed hard thresholding.",
            "Boost image captioning with knowledge reasoning.",
            "Fast and accurate pseudoinverse with sparse matrix reordering and incremental approach.",
            "Spanning attack: reinforce black-box attacks with unlabeled data.",
            "Binary classification with ambiguous training data."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2019",
        "info": "2019: Volume 108",
        "count": 88,
        "papers": [
            "Guest editorial: special issue on machine learning for soccer.",
            "The Open International Soccer Database for machine learning.",
            "Learning to predict soccer results from relational data with gradient boosted trees.",
            "Dolores: a model that predicts football match outcomes from all over the world.",
            "Modeling outcomes of soccer matches.",
            "Incorporating domain knowledge in machine learning for soccer outcome prediction.",
            "Probabilistic movement models and zones of control.",
            "A greedy feature selection algorithm for Big Data of high dimensionality.",
            "Learning rates for kernel-based expectile regression.",
            "A scalable robust and automatic propositionalization approach for Bayesian classification of large mixed numerical and categorical data.",
            "Fast generalization rates for distance metric learning.",
            "Extreme value correction: a method for correcting optimistic estimations in rule learning.",
            "Lowest probability mass neighbour algorithms: relaxing the metric constraint in distance-based neighbourhood algorithms.",
            "Correction to: Modeling outcomes of soccer matches.",
            "Conformal and probabilistic prediction with applications: editorial.",
            "Rethinking statistical learning theory: learning using statistical invariants.",
            "Online aggregation of unbounded losses using shifting experts with confidence.",
            "Nonparametric predictive distributions based on conformal prediction.",
            "Majority vote ensembles of conformal predictors.",
            "Combination of inductive mondrian conformal predictors.",
            "Automatic face recognition with well-calibrated confidence measures.",
            "Efficient Venn predictors using random forests.",
            "Visualizing and understanding Sum-Product Networks.",
            "Improved linear embeddings via Lagrange duality.",
            "Continuation methods for approximate large scale object sequencing.",
            "The risk of trivial solutions in bipartite top ranking.",
            "Unsupervised feature selection based on kernel fisher discriminant analysis and regression learning.",
            "Corruption-tolerant bandit learning.",
            "Foreword: special issue for the journal track of the 10th Asian Conference on Machine Learning (ACML 2018).",
            "Good arm identification via bandit feedback.",
            "Supervised representation learning for multi-label classification.",
            "Bayesian optimistic Kullback-Leibler exploration.",
            "Annotation cost-sensitive active learning by tree sampling.",
            "N-ary decomposition for multi-class classification.",
            "Millionaire: a hint-guided approach for crowdsourcing.",
            "An accelerated variance reducing stochastic method with Douglas-Rachford splitting.",
            "Algorithms for learning parsimonious context trees.",
            "Arbitrage of forecasting experts.",
            "Constructing effective personalized policies using counterfactual inference from biased data sets with many features.",
            "Accelerated gradient boosting.",
            "Efficient and robust TWSVM classification via a minimum L1-norm distance metric criterion.",
            "A simple homotopy proximal mapping algorithm for compressive sensing.",
            "Preface to special issue on Inductive Logic Programming, ILP 2017 and 2018.",
            "Guest editors' note.",
            "Learning efficient logic programs.",
            "Semi-supervised online structure learning for composite event recognition.",
            "Lifted discriminative learning of probabilistic logic programs.",
            "Probabilistic and exact frequent subtree mining in graphs beyond forests.",
            "Online probabilistic theory revision from examples with ProPPR.",
            "Introduction to the special issue for the ECML PKDD 2019 journal track.",
            "Dynamic principal projection for cost-sensitive online multi-label classification.",
            "Aggregating Algorithm for prediction of packs.",
            "Efficient feature selection using shrinkage estimators.",
            "Grouped Gaussian processes for solar power prediction.",
            "LSALSA: accelerated source separation via learned sparse coding.",
            "Data scarcity, robustness and extreme multi-label classification.",
            "Joint detection of malicious domains and infected clients.",
            "A flexible probabilistic framework for large-margin mixture of experts.",
            "Deep collective matrix factorization for augmented multi-view learning.",
            "Temporal pattern attention for multivariate time series forecasting.",
            "Compatible natural gradient policy search.",
            "TD-regularized actor-critic methods.",
            "On PAC-Bayesian bounds for random forests.",
            "Efficient learning with robust gradient descent.",
            "Nuclear discrepancy for single-shot batch active learning.",
            "Improving latent variable descriptiveness by modelling rather than ad-hoc factors.",
            "CaDET: interpretable parametric conditional density estimation with decision trees and forests.",
            "On the analysis of adaptability in multi-source domain adaptation.",
            "The teaching size: computable teachers and learners for universal languages.",
            "Distribution-free uncertainty quantification for kernel methods by gradient perturbations.",
            "Stochastic gradient Hamiltonian Monte Carlo with variance reduction for Bayesian inference.",
            "RankMerging: a supervised learning-to-rank framework to predict links in large social networks.",
            "Attentional multilabel learning over graphs: a message passing approach.",
            "A Riemannian gossip approach to subspace learning on Grassmann manifold.",
            "Distributed Bayesian matrix factorization with limited communication.",
            "Collaborative topic regression for predicting topic-based social influence.",
            "Dynamic attention-integrated neural network for session-based news recommendation.",
            "Correction to: Adaptive random forests for evolving data stream classification.",
            "Engineering fast multilevel support vector machines.",
            "Asymptotically optimal algorithms for budgeted multiple play bandits.",
            "Boosting as a kernel-based method.",
            "Risk bound of transfer learning using parametric feature mapping and its application to sparse coding.",
            "A distributed feature selection scheme with partial information sharing.",
            "2D compressed learning: support matrix machine with bilinear random projections.",
            "A scalable sparse Cholesky based approach for learning high-dimensional covariance matrices in ordered data.",
            "Speculate-correct error bounds for k-nearest neighbor classifiers.",
            "The kernel Kalman rule - Efficient nonparametric inference by recursive least-squares and subspace projections.",
            "Covariance-based dissimilarity measures applied to clustering wide-sense stationary ergodic processes."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2018",
        "info": "2018: Volume 107",
        "count": 75,
        "papers": [
            "Metalearning and Algorithm Selection: progress, state of the art and introduction to the 2018 Special Issue.",
            "Efficient benchmarking of algorithm configurators via model-based surrogates.",
            "Scalable Gaussian process-based transfer surrogates for hyperparameter optimization.",
            "Speeding up algorithm selection using average ranking and active testing by introducing runtime.",
            "Instance spaces for machine learning classification.",
            "The online performance estimation framework: heterogeneous ensemble learning for data streams.",
            "Discovering predictive ensembles for transfer learning and meta-learning.",
            "Data complexity meta-features for regression problems.",
            "Empirical hardness of finding optimal Bayesian network structures: algorithm selection and runtime prediction.",
            "Meta-QSAR: a large-scale application of meta-learning to drug design and discovery.",
            "LPiTrack: Eye movement pattern recognition algorithm and application to biometric identification.",
            "Learning data discretization via convex optimization.",
            "Simple strategies for semi-supervised feature selection.",
            "When is the Naive Bayes approximation not so naive?",
            "Emotion in reinforcement learning agents and robots: a survey.",
            "Analysis of classifiers' robustness to adversarial perturbations.",
            "The randomized information coefficient: assessing dependencies in noisy data.",
            "Identifying and tracking topic-level influencers in the microblog streams.",
            "1-Bit matrix completion: PAC-Bayesian analysis of a variational approximation.",
            "Manifold-based synthetic oversampling with manifold conformance estimation.",
            "Foreword: special issue for the journal track of the 9th Asian Conference on Machine Learning (ACML 2017).",
            "Efficient preconditioning for noisy separable nonnegative matrix factorization problems by successive projection based low-rank approximations.",
            "Robust Plackett-Luce model for k-ary crowdsourced preferences.",
            "Learning safe multi-label prediction for weakly labeled data.",
            "Distributed multi-task classification: a decentralized online learning approach.",
            "Crowdsourcing with unsure option.",
            "Semi-supervised AUC optimization based on positive-unlabeled learning.",
            "Correction to: Semi-supervised AUC optimization based on positive-unlabeled learning.",
            "Learning with rationales for document classification.",
            "Consensus-based modeling using distributed feature construction with ILP.",
            "Online multi-label dependency topic models for text classification.",
            "Simpler PAC-Bayesian bounds for hostile data.",
            "Dyad ranking using Plackett-Luce models based on joint feature representations.",
            "On better training the infinite restricted Boltzmann machines.",
            "An incremental off-policy search in a model-free Markov decision process using a single sample path.",
            "Wallenius Bayes.",
            "A scalable preference model for autonomous decision-making.",
            "Improved maximum inner product search with better theoretical guarantee using randomized partition trees.",
            "Preface to the special issue on inductive logic programming.",
            "Meta-Interpretive Learning from noisy images.",
            "Ultra-Strong Machine Learning: comprehensibility of programs learned with ILP.",
            "Best-effort inductive logic programming via fine-grained cost-based hypothesis generation - The inspire system at the inductive logic programming competition.",
            "Identification of biological transition systems using meta-interpreted logic programs.",
            "Guest editors introduction to the special issue for the ECML PKDD 2018 journal track.",
            "Approximate structure learning for large Bayesian networks.",
            "Output Fisher embedding regression.",
            "Global multi-output decision trees for interaction prediction.",
            "High-dimensional penalty selection via minimum description length principle.",
            "Accurate parameter estimation for Bayesian network classifiers using hierarchical Dirichlet processes.",
            "Stagewise learning for noisy k-ary preferences.",
            "Deep Gaussian Process autoencoders for novelty detection.",
            "An online prediction algorithm for reinforcement learning with linear function approximation using cross entropy method.",
            "A new method of moments for latent variable models.",
            "A distributed Frank-Wolfe framework for learning low-rank matrices with the trace norm.",
            "Similarity encoding for learning with dirty categorical variables.",
            "ML-Plan: Automated machine learning via hierarchical planning.",
            "Inverse reinforcement learning from summary data.",
            "On the effectiveness of heuristics for learning nested dichotomies: an empirical analysis.",
            "Learning from binary labels with instance-dependent noise.",
            "Optimizing non-decomposable measures with deep networks.",
            "Local contrast as an effective means to robust clustering against varying densities.",
            "Introduction to the special issue on discovery science.",
            "A comparison of hierarchical multi-output recognition approaches for anuran classification.",
            "Ensembles for multi-target regression with random output selections.",
            "Reservoir of diverse adaptive learners and stacking fast hoeffding drift detection methods for evolving data streams.",
            "On analyzing user preference dynamics with temporal social networks.",
            "Discovering a taste for the unusual: exceptional models for preference mining.",
            "Targeted and contextual redescription set exploration.",
            "Probabilistic frequent subtrees for efficient graph classification and retrieval.",
            "Analyzing business process anomalies using autoencoders.",
            "Bootstrapping the out-of-sample predictions for efficient and accurate cross-validation.",
            "Wasserstein discriminant analysis.",
            "Stochastic variational hierarchical mixture of sparse Gaussian processes for regression.",
            "Clustering with missing features: a penalized dissimilarity measure based approach.",
            "An adaptive heuristic for feature selection based on complementarity."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2017",
        "info": "2017: Volume 106",
        "count": 75,
        "papers": [
            "Improving probabilistic inference in graphical models with determinism and cycles.",
            "Defying the gravity of learning curve: a characteristic of nearest neighbour anomaly detectors.",
            "Generalization bounds for non-stationary mixing processes.",
            "Optimal learning with Bernstein online aggregation.",
            "A family of admissible heuristics for A* to perform inference in probabilistic classifier chains.",
            "Fast rates by transferring from auxiliary hypotheses.",
            "On the use of stochastic local search techniques to revise first-order logic theories from examples.",
            "An empirical study of on-line models for relational data streams.",
            "Boosted multivariate trees for longitudinal data.",
            "Adaptive edge weighting for graph-based learning algorithms.",
            "QCC: a novel clustering algorithm based on Quasi-Cluster Centers.",
            "Nearest neighbors distance ratio open-set classifier.",
            "Hierarchical Dirichlet scaling process.",
            "Online optimization for max-norm regularization.",
            "Introduction: special issue of selected papers from ACML 2015.",
            "Class-prior estimation for learning from positive and unlabeled data.",
            "Geometry-aware principal component analysis for symmetric positive definite matrices.",
            "Preference Relation-based Markov Random Fields for Recommender Systems.",
            "Erratum to: Preference Relation-based Markov Random Fields for Recommender Systems.",
            "Surrogate regret bounds for generalized classification performance metrics.",
            "Maximum margin partial label learning.",
            "Proximal average approximated incremental gradient descent for composite penalty regularized empirical risk minimization.",
            "Foreword: special issue for the journal track of the 8th Asian conference on machine learning (ACML 2016).",
            "A unified probabilistic framework for robust manifold learning and embedding.",
            "Collaborative topic regression for online recommender systems: an online and Bayesian approach.",
            "Progressive random k-labelsets for cost-sensitive multi-label classification.",
            "Non-redundant multiple clustering by nonnegative matrix factorization.",
            "Multi-view kernel completion.",
            "Special issue on discovery science.",
            "Multi-label classification via multi-target regression on data streams.",
            "Stream-based semi-supervised learning for recommender systems.",
            "Memory-adaptive high utility sequential pattern mining over data streams.",
            "Big Data: from collection to visualization.",
            "High-probability minimax probability machines.",
            "An evaluation of linear and non-linear models of expressive dynamics in classical piano and symphonic music.",
            "Confidence curves: an alternative to null hypothesis significance testing for the comparison of classifiers.",
            "Feature-weighted clustering with inner product induced norm based dissimilarity measures: an optimization perspective.",
            "Projected estimators for robust semi-supervised classification.",
            "Homotopy continuation approaches for robust SV classification and regression.",
            "Optimal classification trees.",
            "The mechanism of additive composition.",
            "Introduction to the special issue on dynamic networks and knowledge discovery.",
            "Scalable computational techniques for centrality metrics on temporally detailed social network.",
            "Exceptional contextual subgraph mining.",
            "Tiles: an online algorithm for community discovery in dynamic social networks.",
            "Introduction to the special issue dedicated to the Journal Track of ECML PKDD 2017.",
            "Learning deep kernels in the space of dot product polynomials.",
            "Gaussian conditional random fields extended for directed graphs.",
            "Efficient parameter learning of Bayesian network classifiers.",
            "Vine copulas for mixed data : multi-view clustering for mixed data beyond meta-Gaussian dependencies.",
            "Graph-based predictable feature analysis.",
            "A constrained $$\\ell $$ ℓ 1 minimization approach for estimating multiple sparse Gaussian or nonparanormal graphical models.",
            "Varying-coefficient models for geospatial transfer learning.",
            "Learning constraints in spreadsheets and tabular data.",
            "Adaptive random forests for evolving data stream classification.",
            "Constraint-based clustering selection.",
            "An expressive dissimilarity measure for relational clustering using neighbourhood trees.",
            "Weightless neural networks for open set recognition.",
            "Offline reinforcement learning with task hierarchies.",
            "Knowledge elicitation via sequential probabilistic inference for high-dimensional prediction.",
            "Sparse probit linear mixed model.",
            "Robust regression using biased objectives.",
            "Preserving differential privacy in convolutional deep belief networks.",
            "Generalized exploration in policy search.",
            "Cost-sensitive label embedding for multi-label classification.",
            "Group online adaptive learning.",
            "Asymptotic properties of Turing's formula in relative error.",
            "A Bayesian nonparametric model for multi-label learning.",
            "Statistical comparison of classifiers through Bayesian hierarchical modelling.",
            "A note on model selection for small sample regression.",
            "Special issue on inductive logic programming.",
            "Relational data factorization.",
            "Planning in hybrid relational MDPs.",
            "kProbLog: an algebraic Prolog for machine learning.",
            "Soft quantification in statistical relational learning."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2016",
        "info": "2016: Volumes\n102,\n103,\n104,\n105",
        "count": 68,
        "papers": [
            "Asymptotic accuracy of Bayes estimation for latent variables with redundancy.",
            "Population recovery and partial identification.",
            "On some transformations of high dimension, low sample size data for nearest neighbor classification.",
            "Probabilistic archetypal analysis.",
            "Generalization bounds for metric and similarity learning.",
            "A non-negative representation learning algorithm for selecting neighbors.",
            "A non-homogeneous dynamic Bayesian network with a hidden Markov model dependency structure among the temporal data points.",
            "Propagation kernels: efficient graph kernels from propagated information.",
            "Spatio-temporal convolution kernels.",
            "Loda: Lightweight on-line detector of anomalies.",
            "Editorial: special issue on machine learning for health and medicine.",
            "Multi-task seizure detection: addressing intra-patient variation in seizure morphologies.",
            "Learning (predictive) risk scores in the presence of censoring due to interventions.",
            "Supersparse linear integer models for optimized medical scoring systems.",
            "Learning classification models of cognitive conditions from subtle behaviors in the digital Clock Drawing Test.",
            "A dynamic ensemble approach to robust classification in the presence of missing data.",
            "Learning to identify relevant studies for systematic reviews using random forest and external information.",
            "Accelerating a Gibbs sampler for variable selection on genomics data with summarization and variable pre-selection combining an array DBMS and R.",
            "Lower bounds on individual sequence regret.",
            "Lifted generative learning of Markov logic networks.",
            "On Data Preconditioning for Regularized Loss Minimization.",
            "Learning from patches by efficient spectral decomposition of a structured kernel.",
            "Tikhonov, Ivanov and Morozov regularization for support vector machine learning.",
            "Introduction: special issue of selected papers from ACML 2014.",
            "Online Passive-Aggressive Active learning.",
            "Bibliographic analysis on research publications using authors, categorical labels and the citation network.",
            "Large margin classification with indefinite similarities.",
            "Learning undirected graphical models using persistent sequential Monte Carlo.",
            "V-shaped interval insensitive loss for ordinal classification.",
            "A column-wise update algorithm for nonnegative matrix factorization in Bregman divergence with an orthogonal constraint.",
            "Guest editors introduction: special issue on inductive logic programming.",
            "ILP-assisted de novo drug design.",
            "Transductive hyperspectral image classification: toward integrating spectral and relational features via an iterative ensemble system.",
            "Fast learning of relational dependency networks.",
            "Probabilistic logic programming for hybrid relational domains.",
            "A novel probabilistic clustering model for heterogeneous networks.",
            "Swamping and masking in Markov boundary discovery.",
            "Multi-target regression via input space expansion: treating targets as inputs.",
            "Bayesian policy reuse.",
            "Learning rotations with little regret.",
            "Guest editors' introduction to the EcmlPkdd 2016 journal track special issue of Machine Learning.",
            "ALRn: accelerated higher-order logistic regression.",
            "Fast and scalable Lasso via stochastic Frank-Wolfe methods with a convergence guarantee.",
            "Factorizing LambdaMART for cold start recommendations.",
            "A topological insight into restricted Boltzmann machines.",
            "Adaptive trajectory analysis of replicator dynamics for data clustering.",
            "On the need for structure modelling in sequence prediction.",
            "Interpretable domain adaptation via optimization over the Stiefel manifold.",
            "Probabilistic inference for determining options in reinforcement learning.",
            "Cost-sensitive boosting algorithms: Do we really need them?",
            "Learning to control a structured-prediction decoder for detection of HTTP-layer DDoS attackers.",
            "Rényi divergence minimization based co-regularized multiview clustering.",
            "Sparse topical analysis of dyadic data using matrix tri-factorization.",
            "Special issue on discovery science.",
            "Explaining mixture models through semantic pattern mining and banded matrix visualization.",
            "Subjective interestingness of subgraph patterns.",
            "Learning rules for multi-label classification: a stacking and a separate-and-conquer approach.",
            "Sequential anomalies: a study in the Railway Industry.",
            "An empirical study on image bag generators for multi-instance learning.",
            "An aggregate and iterative disaggregate algorithm with proven optimality in machine learning.",
            "Bayesian multi-tensor factorization.",
            "Learning deterministic probabilistic automata from a model checking perspective.",
            "Commentary: a decomposition of the outlier detection problem into a set of supervised learning problems.",
            "Expected similarity estimation for large-scale batch and streaming anomaly detection.",
            "Sparse and low-rank matrix regularization for learning time-varying Markov networks.",
            "Variance-constrained actor-critic algorithms for discounted and average reward MDPs.",
            "A semiparametric method for clustering mixed data.",
            "Context-based unsupervised ensemble learning and feature ranking."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2015",
        "info": "2015: Volumes\n98, 99,\n100, 101",
        "count": 80,
        "papers": [
            "MultiClust special issue on discovering, summarizing and using multiple clusterings.",
            "A framework to uncover multiple alternative clusterings.",
            "Subjectively interesting alternative clusterings.",
            "A flexible cluster-oriented alternative clustering algorithm for choosing from the Pareto front of solutions.",
            "Enriched spatial comparison of clusterings through discovery of deviating subspaces.",
            "The blind men and the elephant: on meeting the problem of multiple truths in data from clustering and pattern mining perspectives.",
            "Unsupervised feature selection with ensemble learning.",
            "Metacluster-based Projective Clustering Ensembles.",
            "Unsupervised ensemble minority clustering.",
            "Comparative study of matrix refinement approaches for ensemble clustering.",
            "Greedy learning of latent tree models for multidimensional clustering.",
            "Probabilistic consensus clustering using evidence accumulation.",
            "Asymptotic stability of equilibrium points of mean shift algorithm.",
            "An efficient primal dual prox method for non-smooth optimization.",
            "Asymptotic analysis of the learning curve for Gaussian process regression.",
            "Efficient F measure maximization via weighted maximum likelihood.",
            "Evaluation methods and decision theory for classification of streaming data with temporal dependence.",
            "Lifted graphical models: a survey.",
            "Optimizing regression models for data streams with missing values.",
            "The effect of splitting on random forests.",
            "Entropic risk minimization for nonparametric estimation of mixing distributions.",
            "A unified statistical approach to non-negative matrix factorization and probabilistic latent semantic indexing.",
            "Introduction: special issue of selected papers of ACML 2013.",
            "Adaptive Euclidean maps for histograms: generalized Aitchison embeddings.",
            "Information retrieval approach to meta-visualization.",
            "Multilabel classification through random graph ensembles.",
            "Random projections as regularizers: learning a linear discriminant from fewer observations than dimensions.",
            "Linearized alternating direction method with parallel splitting and adaptive penalty for separable convex programs in machine learning.",
            "Unconfused ultraconservative multiclass algorithms.",
            "Efficient distance metric learning by adaptive sampling and mini-batch stochastic gradient descent (SGD).",
            "Asymptotic analysis of estimators on multi-label data.",
            "A generalized online mirror descent with applications to classification and regression.",
            "Expectation propagation in linear regression models with spike-and-slab priors.",
            "Operator-valued kernel-based vector autoregressive models for network inference.",
            "Guest editors' introduction: special issue on Inductive Logic Programming and on Multi-Relational Learning.",
            "Probabilistic (logic) programming concepts.",
            "Meta-interpretive learning of higher-order dyadic datalog: predicate invention revisited.",
            "Gradient-based boosting for statistical relational learning: the Markov logic network and missing data cases.",
            "Efficient inference and learning in a large knowledge base - Reasoning with extracted information using a locally groundable first-order probabilistic logic.",
            "Bandit-based Monte-Carlo structure learning of probabilistic logic programs.",
            "Guest Editors introduction: special issue of the ECMLPKDD 2015 journal track.",
            "Direct conditional probability density estimation with sparse feature selection.",
            "Generalization bounds for learning with linear, polygonal, quadratic and conic side knowledge.",
            "Learning relational dependency networks in hybrid domains.",
            "Policy gradient in Lipschitz Markov Decision Processes.",
            "A Bayesian approach for comparing cross-validated algorithms on multiple data sets.",
            "Soft-max boosting.",
            "Minimum message length estimation of mixtures of multivariate Gaussian and von Mises-Fisher distributions.",
            "Consensus hashing.",
            "Generalized Twin Gaussian processes using Sharma-Mittal divergence.",
            "Improving classification performance through selective instance completion.",
            "Optimised probabilistic active learning (OPAL) - For fast, non-myopic, cost-sensitive active classification.",
            "Poisson Dependency Networks: Gradient Boosted Models for Multivariate Count Data.",
            "A decomposition of the outlier detection problem into a set of supervised learning problems.",
            "Convex relaxations of penalties for sparse correlated variables with bounded total variation.",
            "Incremental learning of event definitions with Inductive Logic Programming.",
            "Generalized gradient learning on time series.",
            "Learning from evolving video streams in a multi-camera scenario.",
            "Probabilistic clustering of time-evolving distance data.",
            "Regularized feature selection in reinforcement learning.",
            "Half-space mass: a maximally robust and efficient data depth method.",
            "Editorial of the special issue data analysis and intelligent optimization with applications.",
            "Stochastic feature mapping for PAC-Bayes classification.",
            "Model selection in multivariate adaptive regression splines (MARS) using information complexity as the fitness function.",
            "Analysis of network traffic features for anomaly detection.",
            "Measuring the accuracy of currency crisis prediction with combined classifiers in designing early warning system.",
            "Probabilistic combination of classification rules and its application to medical diagnosis.",
            "Selective switching mechanism in virtual machines via support vector machines and transfer learning.",
            "Feature selection in machine learning: an exact penalty approach using a Difference of Convex function Algorithm.",
            "Day trading profit maximization with multi-task learning and technical analysis.",
            "A computational approach to nonparametric regression: bootstrapping CMARS method.",
            "Committee polyhedral separability: complexity and polynomial approximation.",
            "Pruning of Error Correcting Output Codes by optimization of accuracy-diversity trade off.",
            "Triadic Formal Concept Analysis and triclustering: searching for optimal patterns.",
            "Additive regularization of topic models.",
            "Two-level quantile regression forests for bias correction in range prediction.",
            "Random drift particle swarm optimization algorithm: convergence analysis and parameter selection.",
            "Using causal discovery for feature selection in multivariate numerical time series.",
            "An incremental piecewise linear classifier based on polyhedral conic separation.",
            "DEARank: a data-envelopment-analysis-based ranking method."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2014",
        "info": "2014: Volumes\n94, 95, 96, 97",
        "count": 63,
        "papers": [
            "Guest editors introduction: special issue on Inductive Logic Programming (ILP 2012).",
            "Plane-based object categorisation using relational learning.",
            "Meta-interpretive learning: application to grammatical inference.",
            "Learning from interpretation transition.",
            "Fast relational learning using bottom clause propositionalization with artificial neural networks.",
            "Modelling relational statistics with Bayes Nets.",
            "Introduction to the special issue on learning semantics.",
            "From machine learning to machine reasoning - An essay.",
            "Learning perceptually grounded word meanings from unaligned parallel data.",
            "Interactive relational reinforcement learning of concept semantics.",
            "Learning from natural instructions.",
            "A semantic matching energy function for learning with multi-relational data - Application to word-sense disambiguation.",
            "Learning what is where from unlabeled images: joint localization and clustering of foreground objects.",
            "Learning semantic representations of objects and their parts.",
            "Learning with tensors: a framework based on convex optimization and spectral regularization.",
            "Discriminative extended canonical correlation analysis for pattern set matching.",
            "Hierarchical constraints - Providing structural bias for hierarchical clustering.",
            "Bounds on the sample complexity for private learning and private data release.",
            "Machine learning for science and society.",
            "Water pipe condition assessment: a hierarchical beta process approach for sparse incident data.",
            "Enhancing understanding and improving prediction of severe weather through spatiotemporal relational learning.",
            "Using random forests to diagnose aviation turbulence.",
            "Collaborative information acquisition for data-driven decisions.",
            "Detecting inappropriate access to electronic health records using collaborative filtering.",
            "Machine learning for targeted display advertising: transfer learning in action.",
            "Tracking people over time in 19th century Canada for longitudinal analysis.",
            "Almost optimal estimates for approximation and learning by radial basis function networks.",
            "Sequence labeling with multiple annotators.",
            "Regret bounded by gradual variation for online convex optimization.",
            "An instance level analysis of data complexity.",
            "Computational social science and social computing.",
            "Forecast aggregation via recalibration.",
            "Learning from multiple annotators with varying expertise.",
            "Imputation of missing links and attributes in longitudinal social surveys.",
            "Manifestations of user personality in website choice and behaviour on online social networks.",
            "Modeling topic control to detect influence in conversations using nonparametric topic models.",
            "Interactive topic modeling.",
            "Introduction to the Special Issue on Grammatical Inference.",
            "Distributional learning of parallel multiple context-free grammars.",
            "Spectral learning of weighted automata - A forward-backward perspective.",
            "Learning register automata: from languages to program structures.",
            "Adaptively learning probabilistic deterministic automata from data streams.",
            "PAutomaC: a probabilistic automata and hidden Markov models learning competition.",
            "A comparison of collapsed Bayesian methods for probabilistic finite automata.",
            "Improving active Mealy machine learning for protocol conformance testing.",
            "Finding relational redescriptions.",
            "Least-squares independence regression for non-linear causal inference under non-Gaussian noise.",
            "The Variational Garrote.",
            "Efficient implementation of class-based decomposition schemes for Naïve Bayes.",
            "Guest Editors' introduction: special issue of the ECML/PKDD 2014 journal track.",
            "The bane of skew - Uncertain ranks and unrepresentative precision.",
            "On combining machine learning with decision making.",
            "Leave-one-out cross-validation is risk consistent for lasso.",
            "A theoretical and empirical analysis of support vector machine methods for multiple-instance classification.",
            "A constrained matrix-variate Gaussian process for transposable data.",
            "Learning a priori constrained weighted majority votes.",
            "Regression conformal prediction with random forests.",
            "Collaborative filtering with information-rich and information-sparse entities.",
            "SAGA: sparse and geometry-aware non-negative matrix factorization through non-linear local embedding.",
            "The matrix ridge approximation: algorithms and applications.",
            "Detecting concept change in dynamic data streams - A sequential approach based on reservoir sampling.",
            "An improved multiclass LogitBoost using adaptive-one-vs-one.",
            "Preference-based reinforcement learning: evolutionary direct policy search using a preference-based racing algorithm."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2013",
        "info": "2013: Volumes\n90, 91, 92, 93",
        "count": 61,
        "papers": [
            "Efficiently learning the preferences of people.",
            "Density estimation with minimization of U-divergence.",
            "New algorithms for budgeted learning.",
            "Learning figures with the Hausdorff metric by fractals - towards computable binary classification.",
            "Mass estimation.",
            "A theory of transfer learning with applications to active learning.",
            "Non-homogeneous dynamic Bayesian networks with Bayesian regularization for inferring gene regulatory networks with gradually time-varying structure.",
            "Forecasting electricity consumption by aggregating specialized experts - A review of the sequential aggregation of specialized experts, with an application to Slovakian and French country-wide one-day-ahead (half-)hourly predictions.",
            "Quantum speed-up for unsupervised learning.",
            "Online Multiple Kernel Classification.",
            "On evaluating stream learning algorithms.",
            "Multiclass classification with bandit feedback using adaptive regularization.",
            "TEXPLORE: real-time sample-efficient reinforcement learning for robots.",
            "Computational complexity of kernel-based density-ratio estimation: a condition number analysis.",
            "Exploiting label dependencies for improved sample complexity.",
            "Learning with infinitely many features.",
            "Ranking data with ordinal labels: optimality and pairwise aggregation.",
            "Regularization of non-homogeneous dynamic Bayesian networks with global information-coupling based on hierarchical Bayesian models.",
            "Adaptive regularization of weight vectors.",
            "Semi-supervised learning with density-ratio estimation.",
            "Sparse non Gaussian component analysis by semidefinite programming.",
            "Completing causal networks by meta-level abduction.",
            "Learning a factor model via regularized PCA.",
            "Alignment based kernel learning with a continuous set of base kernels.",
            "Minimax PAC bounds on the sample complexity of reinforcement learning with a generative model.",
            "Guest editors' introduction: special issue of selected papers from ECML-PKDD 2012.",
            "A reinforcement learning approach to autonomous decision-making in smart electricity markets.",
            "Active evaluation of ranking functions based on graded relevance.",
            "Beam search algorithms for multilabel learning.",
            "Exploiting symmetries for scaling loopy belief propagation and relational training.",
            "Geometry preserving multi-task metric learning.",
            "Learning policies for battery usage optimization in electric vehicles.",
            "Massively parallel feature selection: an approach based on variance preservation.",
            "Introduction: special issue of selected papers of ACML 2012.",
            "Bayesian object matching.",
            "Recovering networks from distance data.",
            "Correlated topographic analysis: estimating an ordering of correlated components.",
            "Variational Bayesian sparse additive matrix factorization.",
            "Conditional validity of inductive conformal predictors.",
            "Exploration and exploitation of scratch games.",
            "Hypervolume indicator and dominance reward based multi-objective Monte-Carlo Tree Search.",
            "Modeling individual email patterns over time with latent variable models.",
            "On using nearly-independent feature families for high precision and confidence.",
            "Multi-stage classifier design.",
            "Guest editor's introduction: special issue of the ECML PKDD 2013 journal track.",
            "Probabilistic topic models for sequence data.",
            "Block coordinate descent algorithms for large-scale sparse multiclass classification.",
            "The flip-the-state transition operator for restricted Boltzmann machines.",
            "ROC curves in cost space.",
            "A comparative evaluation of stochastic-based inference methods for Gaussian process models.",
            "Spatio-temporal random fields: compressible representation and distributed estimation.",
            "Pairwise meta-rules for better meta-learning-based algorithm ranking.",
            "Differential privacy based on importance weighting.",
            "Editorial: Preference learning and ranking.",
            "Supervised clustering of label ranking data using label preference information.",
            "Calibration and regret bounds for order-preserving surrogate losses in learning to rank.",
            "Tune and mix: learning to rank using ensembles of calibrated multi-class classifiers.",
            "BoostingTree: parallel selection of weak learners in boosting, with application to ranking.",
            "Efficient regularized least-squares algorithms for conditional ranking on relational data.",
            "Sequential event prediction.",
            "Robust ordinal regression in preference learning and ranking."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2012",
        "info": "2012: Volumes\n86, 87, 88, 89",
        "count": 55,
        "papers": [
            "Guest Editors' introduction - Special issue on inductive logic programming (ILP 2010).",
            "ILP turns 20 - Biography and future challenges.",
            "Gradient-based boosting for statistical relational learning: The relational dependency network case.",
            "Bridging logic and kernel machines.",
            "Applying the information bottleneck to statistical relational learning.",
            "Inverse subsumption for complete explanatory induction.",
            "Data and task parallelism in ILP using MapReduce.",
            "RE-EM trees: a data mining approach for longitudinal and clustered data.",
            "Linear classifiers are nearly optimal when hidden variables have diverse effects.",
            "Learning by extrapolation from marginal to full-multivariate probability distributions: decreasingly naive Bayesian classification.",
            "An alternative view of variational Bayes and asymptotic approximations of free energy.",
            "Efficiently identifying deterministic real-time automata from labeled data.",
            "Statistical analysis of kernel-based least-squares density-ratio estimation.",
            "Local equivalences of distances between clusterings - a geometric perspective.",
            "Robustness and generalization.",
            "Online variance minimization.",
            "Visualizing non-metric similarities in multiple maps.",
            "Similarity measures over refinement graphs.",
            "Subsumption resolution: an efficient and effective technique for semi-naive Bayesian learning.",
            "Experiment databases - A new way to share, organize and learn from experiments.",
            "Optimal control as a graphical model inference problem.",
            "Temporal-difference search in computer Go.",
            "PAMR: Passive aggressive mean reversion strategy for portfolio selection.",
            "Multi-output learning via spectral filtering.",
            "Learning sparse gradients for variable selection and dimension reduction.",
            "Meta-learning for evolutionary parameter optimization of classifiers.",
            "Efficient cross-validation for kernelized least-squares regression with sparse basis expansions.",
            "Introduction to the special issue on learning from multi-label data.",
            "On label dependence and loss minimization in multi-label classification.",
            "Multilabel classification with meta-level features in a learning-to-rank framework.",
            "Compressed labeling on distilled labelsets for multi-label learning.",
            "Efficient max-margin multi-label classification with applications to zero-shot learning.",
            "Statistical topic models for multi-label document classification.",
            "Synergy of multi-label hierarchical ensembles, data fusion, and cost-sensitive methods for gene functional inference.",
            "Scalable and efficient multi-label classification for evolving data streams.",
            "Bayesian multi-instance multi-label learning using Gaussian process prior.",
            "Multi-parametric solution-path algorithm for instance-weighted support vector machines.",
            "Learning graphical models for relational data via lattice search.",
            "How to reverse-engineer quality rankings.",
            "Structured learning with constrained conditional models.",
            "ROC convex hull and nonparametric maximum likelihood estimation.",
            "Guest editors' introduction: special issue of selected papers from ECML PKDD 2011.",
            "Good edit similarity learning by loss minimization.",
            "Novel high intrinsic dimensionality estimators.",
            "Generating feature spaces for linear algorithms with regularized sparse kernel slow feature analysis.",
            "Sequential approaches for learning datum-wise sparse representations.",
            "Preference-based reinforcement learning: a formal framework and a policy iteration algorithm.",
            "Focused multi-task learning in a Gaussian process framework.",
            "Learning monotone nonlinear models using the Choquet integral.",
            "Guest editorial: special issue on Inductive Logic Programming (ILP 2011).",
            "k-Optimal: a novel approximate inference algorithm for ProbLog.",
            "Relational networks of conditional preferences.",
            "Learning compact Markov logic networks with decision trees.",
            "Online Bayesian inference for the parameters of PRISM programs.",
            "Learning directed relational models with recursive dependencies."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2011",
        "info": "2011: Volumes\n82, 83, 84, 85",
        "count": 58,
        "papers": [
            "Editorial survey: swarm intelligence for data mining.",
            "Particle swarm optimizer for variable weighting in clustering high-dimensional data.",
            "Foraging theory for dimensionality reduction of clustered data.",
            "Introduction to the special issue on mining and learning with graphs.",
            "Efficiently mining δ-tolerance closed frequent subgraphs.",
            "Multi-way set enumeration in weight tensors.",
            "Detecting communities and their evolutions in dynamic social networks - a Bayesian approach.",
            "Statistical relational learning of trust.",
            "Topic level expertise search over heterogeneous networks.",
            "Stochastic relational processes: Efficient inference and applications.",
            "The Machine Learning journal: 25 years young.",
            "The changing science of machine learning.",
            "Learning to compete, coordinate, and cooperate in repeated games using reinforcement learning.",
            "Neural networks for relational learning: an experimental comparison.",
            "Languages as hyperplanes: grammatical inference with string kernels.",
            "Feature-subspace aggregating: ensembles for stable and unstable learners.",
            "Knows what it knows: a framework for self-aware learning.",
            "Anytime learning of anycost classifiers.",
            "An experimental test of Occam's razor in classification.",
            "Inductive equivalence in clausal logic and nonmonotonic logic programming.",
            "Adaptive partitioning schemes for bipartite ranking - How to grow and prune a ranking tree.",
            "Learning noisy linear classifiers via adaptive and selective sampling.",
            "Checkpoint evolution for volatile correlation computing.",
            "Guest editorial to the special issue on inductive logic programming, mining and learning in graphs and statistical relational learning.",
            "Effective feature construction by maximum common subgraph sampling.",
            "Block-wise construction of tree-like relational features with monotone reducibility and redundancy.",
            "Efficient mining for structurally diverse subgraph patterns in large molecular databases.",
            "Relational information gain.",
            "Constraint-based probabilistic modeling for statistical abduction.",
            "Estimating variable structure and dependence in multitask learning via gradients.",
            "The optimal unbiased value estimator and its relation to LSTD, TD and MC.",
            "Sparse canonical correlation analysis.",
            "Non-homogeneous dynamic Bayesian networks for continuous data.",
            "Introduction to the special issue on empirical evaluations in reinforcement learning.",
            "On the analysis and design of software for reinforcement learning, with a survey of existing systems.",
            "Empirical evaluation methods for multiobjective reinforcement learning algorithms.",
            "The first learning track of the international planning competition.",
            "Informing sequential clinical decision-making through reinforcement learning: an empirical study.",
            "Reinforcement learning in feedback control - Challenges and benchmarks from technical process control.",
            "Policy search for motor primitives in robotics.",
            "Characterizing reinforcement learning methods through parameterized learning problems.",
            "Creating non-minimal triangulations for use in inference in mixed stochastic/deterministic graphical models.",
            "Iterative learning from texts and counterexamples using additional information.",
            "Machine learning in space: extending our reach.",
            "Onboard object recognition for planetary exploration.",
            "Guest editorial: model selection and optimization in machine learning.",
            "A majorization-minimization approach to the sparse generalized eigenvalue problem.",
            "Dual coordinate descent methods for logistic regression and maximum entropy models.",
            "SpicyMKL: a fast algorithm for Multiple Kernel Learning with thousands of kernels.",
            "Sparse conjugate directions pursuit with application to fixed-size kernel models.",
            "Boosted multi-task learning.",
            "Model selection for primal SVM.",
            "Resampling approach for cluster model selection.",
            "Ternary Bradley-Terry model-based decoding for multi-class classification and its extensions.",
            "Construction and learnability of canonical Horn formulas.",
            "Model selection in reinforcement learning.",
            "Classifier chains for multi-label classification.",
            "An asymptotically optimal policy for finite support models in the multiarmed bandit problem."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2010",
        "info": "2010: Volumes\n78, 79, 80, 81",
        "count": 61,
        "papers": [
            "Mining frequent closed rooted trees.",
            "Semi-supervised local Fisher discriminant analysis for dimensionality reduction.",
            "Bayesian generalized probability calculus for density matrices.",
            "Pointwise exact bootstrap distributions of ROC curves.",
            "Methods for the combination of kernel matrices within a support vector framework.",
            "Learning the set covering machine by bound minimization and margin-sparsity trade-off.",
            "Concept learning in description logics using refinement operators.",
            "A comparison of pruning criteria for probability trees.",
            "Random classification noise defeats all convex potential boosters.",
            "Fast learning of relational kernels.",
            "On the quest for optimal rule learning heuristics.",
            "A cooperative coevolutionary algorithm for instance selection for instance-based learning.",
            "Algorithms for subsetting attribute values with Relief.",
            "Guest Editorial: Learning from multiple sources.",
            "Temporal kernel CCA and its application in multimodal neuronal data analysis.",
            "Decomposing the tensor kernel support vector machine for neuroscience data with structured labels.",
            "Multi-view kernel construction.",
            "Composite kernel learning.",
            "A co-classification approach to learning from multilingual corpora.",
            "Multi-domain learning by confidence-weighted parameter combination.",
            "A theory of learning from different domains.",
            "Ensemble clustering using semidefinite programming with applications.",
            "Infinite factorization of multiple non-parametric views.",
            "Inductive transfer for learning Bayesian networks.",
            "Machine learning algorithms for event detection.",
            "A multivariate Bayesian scan statistic for early event detection and characterization.",
            "Fast adaptive algorithms for abrupt change detection.",
            "Increasing coverage to improve detection of network and host anomalies.",
            "Learning to detect incidents from noisily labeled data.",
            "A process for predicting manhole events in Manhattan.",
            "Finding a short and accurate decision rule in disjunctive normal form by exhaustive search.",
            "Classification with guaranteed probability of error.",
            "Algorithms for optimal dyadic decision trees.",
            "Guest editorial: special issue on learning theory.",
            "The true sample complexity of active learning.",
            "On the equivalence of weak learnability and linear separability: new relaxations and efficient boosting algorithms.",
            "Extracting certainty from uncertainty: regret bounded by variation in costs.",
            "Preference-based learning to rank.",
            "Stability and model selection in k-means clustering.",
            "Regret bounds for sleeping experts and bandits.",
            "Polynomial regression under arbitrary product distributions.",
            "Time varying undirected graphs.",
            "Special issue for ECML PKDD 2010: Guest editors' introduction.",
            "A segmented topic model based on the two-parameter Poisson-Dirichlet process.",
            "Large scale image annotation: learning to rank with joint word-image embeddings.",
            "On the eigenvectors of p-Laplacian.",
            "Relational retrieval using a combination of path-constrained random walks.",
            "Mining adversarial patterns via regularized loss minimization.",
            "Dimension reduction and its application to model-based exploration in continuous spaces.",
            "A geometric view of conjugate priors.",
            "Machine learning in adversarial environments.",
            "The security of machine learning.",
            "Learning to classify with missing and corrupted features.",
            "On the infeasibility of modeling polymorphic shellcode - Re-thinking the role of learning in intrusion detection systems.",
            "Graph regularization methods for Web spam detection.",
            "The Machine Learning journal: 250 issues and counting.",
            "Bayesian instance selection for the nearest neighbor rule.",
            "An ensemble uncertainty aware measure for directed hill climbing ensemble pruning.",
            "Improving reinforcement learning by using sequence trees.",
            "Learning to rank on graphs.",
            "Adaptive-resolution reinforcement learning with polynomial exploration in deterministic domains."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2009",
        "info": "2009: Volumes\n74, 75, 76, 77",
        "count": 52,
        "papers": [
            "Semi-supervised graph clustering: a kernel approach.",
            "Convergence analysis of kernel Canonical Correlation Analysis: theory and practice.",
            "Discretization for naive-Bayes learning: managing discretization bias and variance.",
            "Latent grouping models for user preference prediction.",
            "Tree-structured model diagnostics for linear regression.",
            "Matrix representations, linear transformations, and kernels for disambiguation in natural language.",
            "Effective short-term opponent exploitation in simplified poker.",
            "Incremental data-driven learning of a novelty detection model for one-class classification with application to high-dimensional noisy data.",
            "Exact bootstrap k-nearest neighbor learners.",
            "Parallel ILP for distributed-memory architectures.",
            "Finding anomalous periodic time series.",
            "An algebraic characterization of the optimum of regularized kernel methods.",
            "Guest editors' introduction: special issue on mining and learning with graphs.",
            "Graph kernels based on tree patterns for molecules.",
            "On the properties of von Neumann kernels for link analysis.",
            "gBoost: a mathematical programming approach to graph classification and regression.",
            "Mining probabilistic automata: a statistical view of sequential pattern mining.",
            "An efficient algorithm for learning to rank from preference graphs.",
            "Efficient covariance matrix update for variable metric evolution strategies.",
            "Upper bound for variational free energy of Bayesian networks.",
            "Bayesian learning of graphical vector autoregressions with unequal lag-lengths.",
            "NP-hardness of Euclidean sum-of-squares clustering.",
            "Pool-based active learning in approximate linear regression.",
            "The generalization performance of ERM algorithm with strongly mixing observations.",
            "Search-based structured prediction.",
            "Transfer bounds for linear feature learning.",
            "Guest editors' introduction: Special issue on Inductive Logic Programming (ILP-2008).",
            "Brave induction: a logical framework for learning from incomplete information.",
            "The lattice structure and refinement operators for the hypothesis space bounded by a bottom clause.",
            "Using the bottom clause and mode declarations in FOL theory revision from examples.",
            "An investigation into feature construction to assist word sense disambiguation.",
            "Learning block-preserving graph patterns and its application to data mining.",
            "Guest editors' introduction: Special Issue from ECML PKDD 2009.",
            "Sparse kernel SVMs via cutting-plane training.",
            "Learning multi-linear representations of distributions for efficient inference.",
            "Combining instance-based learning and logistic regression for multilabel classification.",
            "On structured output training: hard cases and an efficient alternative.",
            "Hybrid least-squares algorithms for approximate policy evaluation.",
            "A self-training approach to cost sensitive uncertainty sampling.",
            "Cost-sensitive learning based on Bregman divergences.",
            "Local procrustes for manifold embedding: a measure of embedding quality and embedding algorithms.",
            "Cutting-plane training of structural SVMs.",
            "Anytime classification for a pool of instances.",
            "Measuring classifier performance: a coherent alternative to the area under the ROC curve.",
            "Cluster-grouping: from subgroup discovery to clustering.",
            "Guest editorial: special issue on structured prediction.",
            "Piecewise training for structured prediction.",
            "Periodic step-size adaptation in second-order gradient descent for single-pass on-line structured learning.",
            "Generalized isotonic conditional random fields.",
            "Structured prediction by joint kernel support estimation.",
            "Structured prediction with reinforcement learning.",
            "Training parsers by inverse reinforcement learning."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2008",
        "info": "2008: Volumes\n70, 71, 72, 73",
        "count": 53,
        "papers": [
            "Feature selection via sensitivity analysis of SVM probabilistic outputs.",
            "A linear fit gets the correct monotonicity directions.",
            "A formal framework and extensions for function approximation in learning classifier systems.",
            "Incorporating prior knowledge in support vector regression.",
            "Guest editorial: special issue on Inductive Logic Programming.",
            "QG/GA: a stochastic search for Progol.",
            "On the connection between the phase transition of the covering test and the learning success rate in ILP.",
            "Compressing probabilistic Prolog programs.",
            "Generalized ordering-search for learning directed probabilistic logical models.",
            "Margin-based first-order rule learning.",
            "ALLPAD: approximate learning of logic programs with annotated disjunctions.",
            "Inductive logic programming for gene regulation prediction.",
            "Inductive process modeling.",
            "Joint feature re-extraction and classification using an iterative semi-supervised support vector machine algorithm.",
            "A k -norm pruning algorithm for decision tree classifiers based on error rate estimation.",
            "Learning near-optimal policies with Bellman-residual minimization based fitted policy iteration and a single sample path.",
            "Discovering significant patterns.",
            "Learning ( k , l )-contextual tree languages for information extraction from web pages.",
            "Learning the structure of dynamic Bayesian networks from time series and steady state measurements.",
            "On reoptimizing multi-class classifiers.",
            "Improving the structure MCMC sampler for Bayesian networks by introducing a new edge reversal move.",
            "Layered critical values: a powerful direct-adjustment approach to discovering significant patterns.",
            "Guest Editors' Introduction: Special issue on Learning Theory (COLT-2007).",
            "Sketching information divergences.",
            "Regret to the best vs. regret to the average.",
            "Aggregation by exponential weighting, sharp PAC-Bayesian bounds and sparsity.",
            "U-shaped, iterative, and iterative-with-counter learning.",
            "A theory of learning with similarity functions.",
            "Learning large-alphabet and analog circuits with value injection queries.",
            "Robust reductions from ranking to classification.",
            "Guest Editors' introduction: special issue of selected papers from ECML PKDD 2008.",
            "Rollout sampling approximate policy iteration.",
            "Large margin vs. large volume in transductive learning.",
            "Incremental exemplar learning schemes for classification on embedded devices.",
            "New closed-form bounds on the partition function.",
            "A collaborative filtering framework based on both local user similarity and global user similarity.",
            "A critical analysis of variants of the AUC.",
            "Improving maximum margin matrix factorization.",
            "Guest editors' introduction: special issue on inductive logic programming (ILP-2007).",
            "Structured machine learning: the next ten years.",
            "Learning to assign degrees of belief in relational domains.",
            "Learning probabilistic logic models from probabilistic examples.",
            "A bias/variance decomposition for models using collective inference.",
            "Improved MCMC sampling methods for estimating weighted sums in Winnow with application to DNF learning.",
            "Multilabel classification via calibrated label ranking.",
            "Boosted Bayesian network classifiers.",
            "Decision trees for hierarchical multi-label classification.",
            "Guest editor's introduction: special issue on inductive transfer learning.",
            "Flexible latent variable models for multi-task learning.",
            "Convex multi-task feature learning.",
            "A notion of task relatedness yielding provable multiple-task learning guarantees.",
            "Transfer in variable-reward hierarchical reinforcement learning.",
            "Inductive transfer with context-sensitive neural networks."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2007",
        "info": "2007: Volumes\n66, 67, 68, 69",
        "count": 46,
        "papers": [
            "Guest editorial to the special issue on grammatical inference.",
            "LARS: A learning algorithm for rewriting systems.",
            "Interactive learning of node selecting tree transducer.",
            "Learning finite-state models for machine translation.",
            "Learning deterministic context free grammars: The Omphalos competition.",
            "Guest editorial: Learning theory.",
            "Suboptimal behavior of Bayes and MDL in classification under misspecification.",
            "A new PAC bound for intersection-closed concept classes.",
            "Model selection by bootstrap penalization for classification.",
            "Optimal dyadic decision trees.",
            "A framework for statistical clustering with constant time approximation algorithms for K-median and K-means clustering.",
            "Statistical properties of kernel principal component analysis.",
            "Statistical properties of kernel principal component analysis.",
            "Feature space perspectives for learning the kernel.",
            "Improved second-order bounds for prediction with expert advice.",
            "Introduction to the special issue on learning and computational game theory.",
            "Slow emergence of cooperation for win-stay lose-shift on trees.",
            "AWESOME: A general multiagent learning algorithm that converges in self-play and learns a best response against stationary opponents.",
            "A general criterion and an algorithmic framework for learning in multi-agent systems.",
            "Online calibrated forecasts: Memory efficiency versus universality for learning in games.",
            "Bidding agents for online auctions with hidden bids.",
            "Learning payoff functions in infinite games.",
            "Density estimation with stagewise optimization of the empirical risk.",
            "Stability of Unstable Learning Algorithms.",
            "Multi-Class Learning by Smoothed Boosting.",
            "Discovering Significant Patterns.",
            "Invariant kernel functions for pattern analysis and machine learning.",
            "Predictive Modelling of Heterogeneous Sequence Collections by Topographic Ordering of Histories.",
            "PAV and the ROC convex hull.",
            "Smooth relevance vector machine: a smoothness prior extension of the RVM.",
            "On the use of ROC analysis for the optimization of abstaining classifiers.",
            "Structured large margin machines: sensitive to data distributions.",
            "Annealing stochastic approximation Monte Carlo algorithm for neural network training.",
            "Active learning for logistic regression: an evaluation.",
            "A note on Platt's probabilistic outputs for support vector machines.",
            "Surrogate maximization/minimization algorithms and extensions.",
            "Classifying under computational resource constraints: anytime classification using probabilistic estimators.",
            "Extending boosting for large scale spoken language understanding.",
            "Introduction to the special issue on COLT 2006.",
            "DNF are teachable in the average case.",
            "Unconditional lower bounds for learning intersections of halfspaces.",
            "A primal-dual perspective of online learning algorithms.",
            "Tracking the best hyperplane with a simple budget Perceptron.",
            "Logarithmic regret algorithms for online convex optimization.",
            "Competing with wild prediction rules.",
            "Active sampling for multiple output identification."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2006",
        "info": "2006: Volumes\n62, 63, 64, 65",
        "count": 54,
        "papers": [
            "Introduction to the special issue on multi-relational data mining and statistical relational learning.",
            "PRL: A probabilistic relational language.",
            "Propositionalization-based relational subgroup discovery with RSD.",
            "Distribution-based aggregation for relational learning with identifier attributes.",
            "Markov logic networks.",
            "XRules: An effective algorithm for structural classification of XML data.",
            "On Mining Summaries by Objective Measures of Interestingness.",
            "A Unified View on Clustering Binary Data.",
            "Additive Regularization Trade-Off: Fusion of Training and Validation Levels in Kernel Methods.",
            "Extremely randomized trees.",
            "Data-guided model combination by decomposition and aggregation.",
            "Model-based transductive learning of the kernel matrix.",
            "Asymptotic analysis of temporal-difference learning algorithms with constant step-sizes.",
            "Classification using Hierarchical Naïve Bayes models.",
            "An algorithmic theory of learning: Robust concepts and random projection.",
            "Classification-based objective functions.",
            "Machine learning and games.",
            "Adaptive game AI with dynamic scripting.",
            "Universal parameter optimisation in games based on SPSA.",
            "Learning to bid in bridge.",
            "Learning long-term chess strategies from databases.",
            "Foreword.",
            "Relational IBL in classical music.",
            "Mathematical applications of inductive logic programming.",
            "Quantitative pharmacophore models with inductive logic programming.",
            "Graph kernels and Gaussian processes for relational reinforcement learning.",
            "Complexity parameters for first order classes.",
            "Guest editorial.",
            "First order random forests: Learning relational classifiers with complex aggregates.",
            "Randomised restarted search in ILP.",
            "Application of abductive ILP to learning metabolic network inhibition from temporal data.",
            "Gleaner: Creating ensembles of first-order clauses to improve recall-precision curves.",
            "Learning goal hierarchies from structured observations and expert annotations.",
            "Semi-supervised model-based document clustering: A comparative study.",
            "The max-min hill-climbing Bayesian network structure learning algorithm.",
            "Kernels as features: On kernels, margins, and low-dimensional mappings.",
            "Cost curves: An improved method for visualizing classifier performance.",
            "MODL: A Bayes optimal discretization method for continuous attributes.",
            "Adaptive stepsizes for recursive estimation with applications in approximate dynamic programming.",
            "Learning decomposable markov networks in pseudo-independent domains with local evaluation.",
            "An efficient top-down search algorithm for learning Boolean networks of gene expression.",
            "An analysis of diversity measures.",
            "Training a reciprocal-sigmoid classifier by feature scaling-space.",
            "A suffix tree approach to anti-spam email filtering.",
            "Guest editorial: Machine learning in and for music.",
            "Guest Editorial: Machine learning in and for music.",
            "Melodic analysis with segment classes.",
            "Modeling, analyzing, and synthesizing expressive piano performance with graphical models.",
            "Aligning music audio with symbolic scores using a hybrid graphical model.",
            "A case based approach to expressivity-aware tempo transformation.",
            "Classification-based melody transcription.",
            "Bootstrap learning for accurate onset detection.",
            "Aggregate features and ADABOOSTfor music classification.",
            "Using duration models to reduce fragmentation in audio segmentation."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2005",
        "info": "2005: Volumes\n58, 59, 60, 61",
        "count": 45,
        "papers": [
            "Not So Naive Bayes: Aggregating One-Dependence Estimators.",
            "On the Application of ROC Analysis to Predict Classification Performance Under Varying Class Distributions.",
            "A Response to Webb and Ting's On the Application of ROC Analysis to Predict Classification Performance Under Varying Class Distributions.",
            "ROC 'n' Rule Learning - Towards a Better Understanding of Covering Algorithms.",
            "Case Based Imprecision Estimates for Bayes Classifiers with the Bayesian Bootstrap.",
            "Guest Editorial.",
            "Evolutionary Rule Mining in Time Series Databases.",
            "Automatic Feature Extraction for Classifying Audio Data.",
            "Clustering Time Series with Clipped Data.",
            "Classification of Multivariate Time Series and Structured Data Using Constructive Induction.",
            "Principle Components and Importance Ranking of Distributed Anomalies.",
            "Fast and Exact Warping of Time Series Using Adaptive Segmental Approximations.",
            "Discovery of Time-Series Motif from Multi-Dimensional Data Based on MDL Principle.",
            "Elastic Translation Invariant Matching of Trajectories.",
            "Evolving Soccer Keepaway Players Through Task Decomposition.",
            "A Reinforcement Learning Scheme for a Partially-Observable Multi-Agent Game.",
            "PAC-Bayesian Compression Bounds on the Prediction Error of Learning Algorithms for Classification.",
            "Multicategory Proximal Support Vector Machine Classifiers.",
            "Maximizing Agreements with One-Sided Error with Applications to Heuristic Learning.",
            "Internal Regret in On-Line Portfolio Selection.",
            "Logistic Model Trees.",
            "Editorial.",
            "Learning Bayesian Network Classifiers: Searching in a Space of Partially Directed Acyclic Graphs.",
            "Latent Classification Models.",
            "On Discriminative Bayesian Network Classifiers and Logistic Regression.",
            "Structural Extension to Logistic Regression: Discriminative Parameter Learning of Belief Net Classifiers.",
            "TAN Classifiers Based on Decomposable Distributions.",
            "Guest Editors Introduction: Machine Learning in Speech and Language Technologies.",
            "Support Vector Learning for Semantic Argument Classification.",
            "Filtering-Ranking Perceptron Learning for Partial Parsing.",
            "Ranking and Reranking with Perceptron.",
            "Online Multiclass Learning with k-Way Limited Feedback and an Application to Utterance Classification.",
            "Moment Kernels for Regular Distributions.",
            "Maximum Entropy Modeling: A Suitable Framework to Learn Context-Dependent Lexicon Models for Statistical Machine Translation.",
            "Maximum Entropy Models with Inequality Constraints: A Case Study on Text Categorization.",
            "A Neural Syntactic Language Model.",
            "Combining Statistical Language Models via the Latent Maximum Entropy Principle.",
            "Corpus-based Learning of Analogies and Semantic Relations.",
            "Incremental Learning of Linear Model Trees.",
            "Single-Class Classification with Mapping Convergence.",
            "The Synergy Between PAV and AdaBoost.",
            "A High Order Cumulants Based Multivariate Nonlinear Blind Source Separation Method.",
            "Combined SVM-Based Feature Selection and Classification.",
            "A Fast Dual Algorithm for Kernel Logistic Regression.",
            "Generalized Low Rank Approximations of Matrices."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2004",
        "info": "2004: Volumes\n54, 55, 56, 57",
        "count": 46,
        "papers": [
            "Benchmarking Least Squares Support Vector Machine Classifiers.",
            "Projection Support Vector Machine Generators.",
            "Support Vector Data Description.",
            "ART: A Hybrid Classification Model.",
            "DeEPs: A New Instance-Based Lazy Discovery and Classification System.",
            "Selective Sampling for Nearest Neighbor Classifiers.",
            "Active Sampling for Class Probability Estimation and Ranking.",
            "Introduction to the Special Issue on Meta-Learning.",
            "A Meta-Learning Method to Select the Kernel Width in Support Vector Regression.",
            "Optimal Ordered Problem Solver.",
            "Is Combining Classifiers with Stacking Better than Selecting the Best One?",
            "On Data and Algorithms: Understanding Inductive Performance.",
            "A Reinforcement Learning Algorithm Based on Policy Iteration for Average Reward: Empirical Results with Yield Management and Convergence Analysis.",
            "Classification Using Phi-Machines and Constructive Function Approximation.",
            "Khiops: A Statistical Discretization Method of Continuous Attributes.",
            "Leave One Out Error, Stability, and Generalization of Voting Combinations of Classifiers.",
            "Guest Editors' Introduction.",
            "Induction as Consequence Finding.",
            "Fast Theta-Subsumption with Constraint Satisfaction Algorithms.",
            "Inducing Multi-Level Association Rules from Multiple Relations.",
            "Functional Trees.",
            "Bagging Equalizes Influence.",
            "How to Better Use Expert Advice.",
            "Empirical and Theoretical Comparisons of Selected Criterion Functions for Document Clustering.",
            "Introduction: Special Issue on Theoretical Advances in Data Clustering.",
            "Clustering Large Graphs via the Singular Value Decomposition.",
            "Optimal Time Bounds for Approximate Clustering.",
            "A k-Median Algorithm with Running Time Independent of Data Size.",
            "Correlation Clustering.",
            "A New Conceptual Clustering Framework.",
            "Subquadratic Approximation Algorithms for Clustering Problems in High Dimensional Spaces.",
            "Central Clustering of Attributed Graphs.",
            "Semi-Supervised Learning on Riemannian Manifolds.",
            "Decision Support Through Subgroup Discovery: Three Case Studies and the Lessons Learned.",
            "Editorial: Data Mining Lessons Learned.",
            "Introduction: Lessons Learned from Data Mining Applications and Collaborative Problem Solving.",
            "Mining Skewed and Sparse Transaction Data for Personalized Shopping Recommendation.",
            "Multi-Relational Learning, Text Mining, and Semi-Supervised Learning for Functional Genomics.",
            "Lessons and Challenges from Mining Retail E-Commerce Data.",
            "Learning to Decode Cognitive States from Brain Images.",
            "A Bias-Variance Analysis of a Real World Learning Problem: The CoIL Challenge 2000.",
            "Guest Editorial.",
            "Kernels and Distances for Structured Data.",
            "Naive Bayesian Classification of Structured Data.",
            "Integrating Guidance into Relational Reinforcement Learning.",
            "Compact Representation of Knowledge Bases in Inductive Logic Programming."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2003",
        "info": "2003: Volumes\n50, 51, 52, 53",
        "count": 47,
        "papers": [
            "An Introduction to MCMC for Machine Learning.",
            "EM, MCMC, and Chain Flipping for Structure from Motion with Unknown Correspondence.",
            "Mixtures of Factor Analysers. Bayesian Estimation and Inference by Stochastic Simulation.",
            "Being Bayesian About Network Structure. A Bayesian Approach to Structure Discovery in Bayesian Networks.",
            "Improving Markov Chain Monte Carlo Model Search for Data Mining.",
            "Classification with Bayesian MARS.",
            "Population Markov Chain Monte Carlo.",
            "A Noninformative Prior for Neural Networks.",
            "Introduction.",
            "Combining Classifiers with Meta Decision Trees.",
            "Ranking Learning Algorithms: Using IBL and Meta-Learning on Accuracy and Time Results.",
            "Learning to Match the Schemas of Data Sources: A Multistrategy Approach.",
            "Clustered Partial Linear Regression.",
            "Complete Mining of Frequent Patterns from Graphs: Mining Graph Data.",
            "PAC-Bayesian Stochastic Model Selection.",
            "Relative Loss Bounds for Temporal-Difference Learning.",
            "Polynomial-Time Decomposition Algorithms for Support Vector Machines.",
            "An Empirical Study of Two Approaches to Sequence Learning for Anomaly Detection.",
            "Variance and Bias for General Loss Functions.",
            "Learning from Different Teachers.",
            "Microchoice Bounds and Self Bounding Learning Algorithms.",
            "Measures of Diversity in Classifier Ensembles and Their Relationship with the Ensemble Accuracy.",
            "Guest Editor's Introduction.",
            "Boosting and Hard-Core Set Construction.",
            "Potential-Based Algorithms in On-Line Prediction and Game Theory.",
            "Estimating the Optimal Margins of Embeddings in Euclidean Half Spaces.",
            "A Theoretical Analysis of Query Selection for Collaborative Filtering.",
            "Editorial: Methods in Functional Genomics.",
            "Relation Between Permutation-Test P Values and Classifier Error Estimates.",
            "Boosting and Microarray Data.",
            "Analysis and Visualization of Gene Expression Microarray Data in Human Cancer Using Self-Organizing Maps.",
            "Self-Organizing Latent Lattice Models for Temporal Gene Expression Profiling.",
            "Consensus Clustering: A Resampling-Based Method for Class Discovery and Visualization of Gene Expression Microarray Data.",
            "Inclusion of Textual Documentation in the Analysis of Multidimensional Data Sets: Application to Gene Expression Data.",
            "On Learning Gene Regulatory Networks Under the Boolean Network Model.",
            "External Control in Markovian Genetic Regulatory Networks.",
            "Tree Induction for Probability-Based Ranking.",
            "Feature Weighting in k-Means Clustering.",
            "Inference for the Generalization Error.",
            "A Microchoice Bound for Continuous-Space Classification Algorithms.",
            "Theoretical and Empirical Analysis of ReliefF and RReliefF.",
            "Online Ensemble Learning: An Empirical Study.",
            "Programming by Demonstration Using Version Space Algebra.",
            "Improved Rooftop Detection in Aerial Images with Machine Learning.",
            "Learning from Cluster Examples.",
            "Implications of the Dirichlet Assumption for Discretization of Continuous Variables in Naive Bayesian Classifiers.",
            "The Robustness of the p-Norm Algorithms."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2002",
        "info": "2002: Volumes\n46, 47, 48, 49",
        "count": 59,
        "papers": [
            "Editorial: Kernel Methods: Current Research and Future Directions.",
            "On a Connection between Kernel PCA and Metric Multidimensional Scaling.",
            "Bayesian Methods for Support Vector Machines: Evidence and Predictive Class Probabilities.",
            "Hierarchical Learning in Polynomial Support Vector Machines.",
            "A Probabilistic Framework for SVM Regression and Error Bar Estimation.",
            "On the Dual Formulation of Regularized Linear Systems with Convex Risks.",
            "Choosing Multiple Parameters for Support Vector Machines.",
            "Training Invariant Support Vector Machines.",
            "Support Vector Machines for Classification in Nonstandard Situations.",
            "An Analytic Center Machine.",
            "Linear Programming Boosting via Column Generation.",
            "Large Scale Kernel Regression via Linear Programming.",
            "Efficient SVM Regression Training with SMO.",
            "A Simple Decomposition Method for Support Vector Machines.",
            "Feasible Direction Decomposition Algorithms for Training Support Vector Machines.",
            "Convergence of a Generalized SMO Algorithm for SVM Classifier Design.",
            "The Relaxed Online Maximum Margin Algorithm.",
            "Gene Selection for Cancer Classification using Support Vector Machines.",
            "Text Categorization with Support Vector Machines. How to Represent Texts in Input Space?",
            "Editorial.",
            "Maximum Likelihood Estimation of Mixture Densities for Binned and Truncated Multivariate Data.",
            "A New Nonparametric Pairwise Clustering Algorithm Based on Iterative Estimation of Distance Profiles.",
            "Learning Recursive Bayesian Multinets for Data Clustering by Means of Constructive Induction.",
            "Bayesian Clustering by Dynamics.",
            "Guest Editor's Introduction.",
            "PAC Analogues of Perceptron and Winnow Via Boosting the Margin.",
            "Boosting Methods for Regression.",
            "On the Learnability and Design of Output Codes for Multiclass Problems.",
            "Finite-time Analysis of the Multiarmed Bandit Problem.",
            "Theory Revision with Queries: DNF Formulas.",
            "Guest Introduction: Special Issue on New Methods for Model Selection and Model Combination.",
            "Model Selection for Small Sample Regression.",
            "Theoretical and Experimental Evaluation of the Subspace Information Criterion.",
            "Metric-Based Methods for Adaptive Model Selection and Regularization.",
            "Model Selection and Error Estimation.",
            "Statistical Properties and Adaptive Tuning of Support Vector Machines.",
            "Structural Modelling with Sparse Kernels.",
            "Kernel Matching Pursuit.",
            "Sparse Regression Ensembles in Infinite and Finite Hypothesis Spaces.",
            "On the Existence of Linear Weak Learners and Applications to Boosting.",
            "Logistic Regression, AdaBoost and Bregman Distances.",
            "Estimating Generalization Error on Two-Class Datasets Using Out-of-Bag Estimates.",
            "Bayesian Treed Models.",
            "Decision Region Connectivity Analysis: A Method for Analyzing High-Dimensional Classifiers.",
            "The Lagging Anchor Algorithm: Reinforcement Learning in Two-Player Zero-Sum Games with Imperfect Information.",
            "A Simple Method for Generating Additive Clustering Models with Limited Complexity.",
            "Feature Generation Using General Constructor Functions.",
            "Introduction.",
            "Reinforcement Learning for Call Admission Control and Routing under Quality of Service Constraints in Multimedia Networks.",
            "Building a Basic Block Instruction Scheduler with Reinforcement Learning and Rollouts.",
            "Kernel-Based Reinforcement Learning.",
            "On Average Versus Discounted Reward Temporal-Difference Learning.",
            "A Sparse Sampling Algorithm for Near-Optimal Planning in Large Markov Decision Processes.",
            "Near-Optimal Reinforcement Learning in Polynomial Time.",
            "Technical Update: Least-Squares Temporal Difference Learning.",
            "Continuous-Action Q-Learning.",
            "Risk-Sensitive Reinforcement Learning.",
            "Variable Resolution Discretization in Optimal Control.",
            "Structure in the Space of Value Functions."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2001",
        "info": "2001: Volumes\n42, 43, 44, 45",
        "count": 52,
        "papers": [
            "Introduction.",
            "An Experimental Comparison of Model-Based Clustering Methods.",
            "SPADE: An Efficient Algorithm for Mining Frequent Sequences.",
            "Confirmation-Guided Discovery of First-Order Rules with Tertius.",
            "Supervised Versus Unsupervised Binary-Learning by Feedforward Neural Networks.",
            "Linear Concepts and Hidden Variables.",
            "Concept Decompositions for Large Sparse Text Data Using Clustering.",
            "Unsupervised Learning by Probabilistic Latent Semantic Analysis.",
            "Robust Classification for Imprecise Environments.",
            "A Learning Generalization Bound with an Application to Sparse-Representation Classifiers.",
            "On the Convergence of Temporal-Difference Learning with Linear Function Approximation.",
            "The Effect of Instance-Space Partition on Significance.",
            "Soft Margins for AdaBoost.",
            "Guest Editorial.",
            "Relational Reinforcement Learning.",
            "Relational Instance-Based Learning with Lists and Terms.",
            "The Effect of Relational Background Knowledge on Learning of Protein Three-Dimensional Fold Signatures.",
            "Relational Learning with Statistical Predicate Invention: Better Models for Hypertext.",
            "Unsupervised Learning of Word Segmentation Rules with Genetic Algorithms and Inductive Logic Programming.",
            "Guest Editor's Introduction.",
            "General Convergence Results for Linear Discriminant Updates.",
            "Relative Loss Bounds for On-Line Density Estimation with the Exponential Family of Distributions.",
            "Worst-Case Bounds for the Logarithmic Loss of Predictors.",
            "Drifting Games.",
            "An Adaptive Version of the Boost by Majority Algorithm.",
            "Introduction.",
            "Learning DFA from Simple Examples.",
            "Learning Regular Languages from Simple Positive Examples.",
            "Stochastic Finite Learning of the Pattern Languages.",
            "Efficient Algorithms for the Inference of Minimum Size DFAs.",
            "Some Statistical-Estimation Methods for Stochastic Finite-State Transducers.",
            "Language Simplification through Error-Correcting and Grammatical Inference Techniques.",
            "Noisy Time Series Prediction using Recurrent Neural Networks and Grammatical Inference.",
            "Stochastic Inference of Regular Tree Languages.",
            "Editorial: Inductive Logic Programming is Coming of Age.",
            "On Exact Learning of Unordered Tree Patterns.",
            "Parameter Estimation in Stochastic Logic Programs.",
            "Approximate Match of Rules Using Backpropagation Neural Networks.",
            "Extracting Context-Sensitive Models in Inductive Logic Programming.",
            "Random Forests.",
            "On the VC Dimension of Bounded Margin Classifiers.",
            "Iterated Phantom Induction: A Knowledge-Based Approach to Learning Control.",
            "Optimizing Epochal Evolutionary Search: Population-Size Dependent Theory.",
            "Learning with Maximum-Entropy Distributions.",
            "Robust Learning with Missing Data.",
            "A Simple Generalisation of the Area Under the ROC Curve for Multiple Class Classification Problems.",
            "Predicting the Future of Discrete Sequences from Fractal Representations of the Past.",
            "Reinterpreting the Category Utility Function.",
            "Efficient Construction of Regression Trees with Range and Region Splitting.",
            "Using Iterated Bagging to Debias Regressions.",
            "Accelerating EM for Large Databases.",
            "Relative Loss Bounds for Multidimensional Regression Problems."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "2000",
        "info": "2000: Volumes\n38, 39, 40, 41",
        "count": 45,
        "papers": [
            "Guest Editors' Introduction.",
            "Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning.",
            "Any-time Relational Reasoning: Resource-bounded Induction and Deduction Through Stochastic Matching.",
            "Strategies in Combined Learning via Logic Programs.",
            "Feature Selection vs Theory Reformulation: A Study of Genetic Refinement of Knowledge-based Neural Networks.",
            "Refining Numerical Constants in First Order Logic Theories.",
            "Multistrategy Theory Revision: Induction and Abduction in INTHELEX.",
            "Multistrategy Discovery and Detection of Novice Programmer Errors.",
            "Multi Level Knowledge in Modeling Qualitative Physics Learning.",
            "A Multistrategy Approach to Classifier Learning from Time Series.",
            "Improved Generalization Through Explicit Optimization of Margins.",
            "Reduction Techniques for Instance-Based Learning Algorithms.",
            "Convergence Results for Single-Step On-Policy Reinforcement-Learning Algorithms.",
            "Multiple Comparisons in Induction Algorithms.",
            "Nonparametric Time Series Prediction Through Adaptive Model Selection.",
            "On-line Learning and the Metrical Task System Problem.",
            "A Machine Learning Approach to POS Tagging.",
            "Special Issue of Machine Learning on Information Retrieval - Introduction.",
            "Text Classification from Labeled and Unlabeled Documents using EM.",
            "BoosTexter: A Boosting-based System for Text Categorization.",
            "Machine Learning for Information Extraction in Informal Domains.",
            "Adaptive Retrieval Agents: Internalizing Local Context and Scaling up to the Web.",
            "Implementation Issues in the Fourier Transform Algorithm.",
            "Constructing X-of-N Attributes for Decision Tree Learning.",
            "Upper and Lower Bounds on the Learning Curve for Gaussian Processes.",
            "Stochastic Grammatical Inference of Text Database Structure.",
            "An Experimental Comparison of Three Methods for Constructing Ensembles of Decision Trees: Bagging, Boosting, and Randomization.",
            "MultiBoosting: A Technique for Combining Boosting and Wagging.",
            "A Comparison of Prediction Accuracy, Complexity, and Training Time of Thirty-Three Old and New Classification Algorithms.",
            "Randomizing Outputs to Increase Prediction Accuracy.",
            "Learning to Play Chess Using Temporal Differences.",
            "A Study of Reinforcement Learning in the Continuous Case by the Means of Viscosity Solutions.",
            "Naive Bayes for Regression (Technical Note).",
            "Selecting Examples for Partial Memory Learning.",
            "Lazy Learning of Bayesian Rules.",
            "A Cognitive Bias Approach to Feature Selection and Weighting for Case-Based Learners.",
            "Maximizing Theory Accuracy Through Selective Reinterpretation.",
            "Learning Changing Concepts by Exploiting the Structure of Change.",
            "A Formalism for Relevance and Its Application in Feature Subset Selection.",
            "Adaptive Versus Nonadaptive Attribute-Efficient Learning.",
            "Phase Transitions in Relational Learning.",
            "Bottom-Up Induction of Feature Terms.",
            "Enlarging the Margins in Perceptron Decision Trees.",
            "Cascade Generalization.",
            "Markov Processes on Curves."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1999",
        "info": "1999: Volumes\n34, 35, 36, 37",
        "count": 45,
        "papers": [
            "Guest Editors' Introduction: Machine Learning and Natural Language.",
            "Forgetting Exceptions is Harmful in Language Learning.",
            "Similarity-Based Models of Word Cooccurrence Probabilities.",
            "An Efficient, Probabilistically Sound Algorithm for Segmentation and Word Discovery.",
            "A Winnow-Based Approach to Context-Sensitive Spelling Correction.",
            "Using Decision Trees to Construct a Practical Parser.",
            "Learning to Parse Natural Language with Maximum Entropy Models.",
            "Statistical Models for Text Segmentation.",
            "An Algorithm that Learns What's in a Name.",
            "Learning Information Extraction Rules for Semi-Structured and Free Text.",
            "An Experimental Evaluation of Integrating Machine Learning with Knowledge Acquisition.",
            "Concept Learning and Feature Selection Based on Square-Error Clustering.",
            "An Efficient Method To Estimate Bagging's Generalization Error.",
            "Learning to Take Actions.",
            "Learning to Reason with a Restricted View.",
            "Exploration of Multi-State Environments: Local Measures and Back-Propagation of Uncertainty.",
            "Toward a Model of Intelligence as an Economy of Agents.",
            "Introducing the Special Issue of Machine Learning Selected from Papers Presented at the 1997 Conference on Computational Learning Theory, COLT'97.",
            "Universal Portfolios With and Without Transaction Costs.",
            "A Dichotomy Theorem for Learning Quantified Boolean Formulas.",
            "Estimation of Time-Varying Parameters in Statistical Models: An Optimization Approach.",
            "Derandomizing Stochastic Prediction Strategies.",
            "Guest Editors' Introduction.",
            "A Principal Components Approach to Combining Regression Estimates.",
            "Using Correspondence Analysis to Combine Classifiers.",
            "Linearly Combining Density Estimators via Stacking.",
            "Pasting Small Votes for Classification in Large Databases and On-Line.",
            "An Empirical Comparison of Voting Classification Algorithms: Bagging, Boosting, and Variants.",
            "Structural Results About On-line Learning Models With and Without Queries.",
            "An Efficient Extension to Mixture Techniques for Prediction and Decision Trees.",
            "General and Efficient Multisplitting of Numerical Attributes.",
            "A Theoretical and Empirical Study of a Noise-Tolerant Algorithm to Learn Geometric Patterns.",
            "Minimum Generalization Via Reflection: A Fast Linear Threshold Learner.",
            "Mixed Memory Markov Models: Decomposing Complex Stochastic Processes as Mixtures of Simpler Ones.",
            "Efficient Read-Restricted Monotone CNF/DNF Dualization by Learning with Membership Queries.",
            "Projection Learning.",
            "On the Sample Complexity for Nonoverlapping Neural Networks.",
            "Effective and Efficient Knowledge Base Refinement.",
            "An Introduction to Variational Methods for Graphical Models.",
            "Guest Editors' Introduction.",
            "Learning Function-Free Horn Expressions.",
            "Large Margin Classification Using the Perceptron Algorithm.",
            "Improved Boosting Algorithms Using Confidence-rated Predictions.",
            "The Complexity of Learning According to Two Models of a Drifting Environment.",
            "Some PAC-Bayesian Theorems."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1998",
        "info": "1998: Volumes\n30, 31, 32, 33",
        "count": 49,
        "papers": [
            "Guest Editor's Introduction.",
            "PAC Learning Axis-aligned Rectangles with Respect to Product Distributions from Multiple-Instance Examples.",
            "A Note on Learning from Multiple-Instance Examples.",
            "Strong Minimax Lower Bounds for Learning.",
            "Hardness Results for Learning First-Order Representations and Programming by Demonstration.",
            "On Restricted-Focus-of-Attention Learnability of Boolean Functions.",
            "Guest Editors' Introduction: On Applied Research in Machine Learning.",
            "Learning in the \" Real World\".",
            "Learning to Recognize Volcanoes on Venus.",
            "Machine Learning for the Detection of Oil Spills in Satellite Radar Images.",
            "Knowledge-Based Learning in Exploratory Science: Learning Rules to Predict Rodent Carcinogenicity.",
            "Pharmacophore Discovery Using the Inductive Logic Programming System PROGOL.",
            "Learning in Autonomous Robots - Foreword.",
            "Rapid Concept Learning for Mobile Robots.",
            "A Probabilistic Approach to Concurrent Mapping and Localization for Mobile Robots.",
            "Module-Based Reinforcement Learning: Experiments with a Real Robot.",
            "Hierarchical Learning of Navigational Behaviors in an Autonomous Robot using a Predictive Sparse Distributed Memory.",
            "Learning from Innate Behaviors: A Quantitative Evaluation of Neural Network Controllers.",
            "Learning from History for Behavior-Based Mobile Robots in Non-Stationary Conditions.",
            "Self Calibration of the Fixation Movement of a Stereo Camera Head.",
            "Emergence and Categorization of Coordinated Visual Behavior Through Embodied Interaction.",
            "Training a Vision Guided Mobile Robot.",
            "Learning Dextrous Manipulation Skills for Multifingered Robot Hands Using the Evolution Strategy.",
            "Learning to Recognize and Grasp Objects.",
            "Analytical Mean Squared Error Curves for Temporal Difference Learning.",
            "The Hierarchical Hidden Markov Model: Analysis and Applications.",
            "Using Model Trees for Classification.",
            "Guest Editors' Introduction.",
            "Robust Sensor Fusion: Analysis and Application to Audio Visual Speech Recognition.",
            "Extracting Hidden Context.",
            "Tracking the Best Disjunction.",
            "Tracking the Best Expert.",
            "Statistical Mechanics of Online Learning of Drifting Concepts: A Variational Approach.",
            "Localization vs. Identification of Semi-Algebraic Sets.",
            "Co-Evolution in the Successful Learning of Backgammon Strategy.",
            "Comments on \"Co-Evolution in the Successful Learning of Backgammon Strategy\".",
            "Learning from Examples and Membership Queries with Structured Determinations.",
            "Prequential and Cross-Validated Regression Estimation.",
            "Bayesian Landmark Learning for Mobile Robot Localization.",
            "Choice of Basis for Laplace Approximation.",
            "Self-Directed Learning and Its Relation to the VC-Dimension and to Teacher-Directed Learning.",
            "Fast Online Q(lambda).",
            "Guest Editorial.",
            "Learning to Improve Coordinated Actions in Cooperative Distributed Problem-Solving Environments.",
            "Learning Coordination Strategies for Cooperative Multiagent Systems.",
            "Conjectural Equilibrium in Multiagent Learning.",
            "Colearning in Differential Games.",
            "Elevator Group Control Using Multiple Reinforcement Learning Agents.",
            "Learning Team Strategies: Soccer Case Studies."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1997",
        "info": "1997: Volumes\n26, 27, 28, 29",
        "count": 44,
        "papers": [
            "Empirical Support for Winnow and Weighted-Majority Algorithms: Results on a Calendar Scheduling Domain.",
            "Exact Learning of Formulas in Parallel.",
            "Learning and Updating of Uncertainty in Dirichlet Models.",
            "A \"Microscopic\" Study of Minimum Entropy Search in Learning Decomposable Markov Networks.",
            "Guest Editors' Introduction.",
            "Clausal Discovery.",
            "First Order Regression.",
            "Learning Qualitative Models of Dynamic Systems.",
            "Generalization of Clauses Relative to a Theory.",
            "PAL: A Pattern-Based First-Order Inductive System.",
            "Guest Editor's Introduction.",
            "An Experimental and Theoretical Comparison of Model Selection Methods.",
            "Predicting Nearly As Well As the Best Pruning of a Decision Tree.",
            "Exactly Learning Automata of Small Cover Time.",
            "A Comparison of New and Old Algorithms for a Mixture Estimation Problem.",
            "Characteristic Sets for Polynomial Grammatical Inference.",
            "Pruning Algorithms for Rule Learning.",
            "Representing Probabilistic Rules with Networks of Gaussian Basis Functions.",
            "Guest Editors' Introduction.",
            "Integrating Multiple Learning Strategies in First Order Logics.",
            "Using Background Knowledge to Build Multistrategy Learners.",
            "Tracking Context Changes through Meta-Learning.",
            "A Multistrategy Approach to Relational Knowledge Discovery in Databases.",
            "Learning and Revising User Profiles: The Identification of Interesting Web Sites.",
            "Guest Editors' Introduction.",
            "A Bayesian/Information Theoretic Model of Learning to Learn via Multiple Task Sampling.",
            "Multitask Learning.",
            "CHILD: A First Step Towards Continual Learning.",
            "Shifting Inductive Bias with Success-Story Algorithm, Adaptive Levin Search, and Incremental Self-Improvement.",
            "Selective Sampling Using the Query by Committee Algorithm.",
            "Explanation-Based Learning and Reinforcement Learning: A Unified View.",
            "Malicious Omissions and Errors in Answers to Membership Queries.",
            "An Exact Probability Metric for Decision Tree Splitting and Stopping.",
            "Decision Tree Induction Based on Efficient Tree Restructuring.",
            "Online Learning versus Offline Learning.",
            "Coping with Uncertainty in Map Learning.",
            "Learning with Probabilistic Representations.",
            "On the Optimality of the Simple Bayesian Classifier under Zero-One Loss.",
            "Bayesian Network Classifiers.",
            "The Sample Complexity of Learning Fixed-Structure Bayesian Networks.",
            "Efficient Approximations for the Marginal Likelihood of Bayesian Networks with Hidden Variables.",
            "Adaptive Probabilistic Networks with Hidden Variables.",
            "Factorial Hidden Markov Models.",
            "Predicting Protein Secondary Structure Using Stochastic Tree Grammars."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1996",
        "info": "1996: Volumes\n22, 23, 24, 25",
        "count": 44,
        "papers": [
            "Editorial.",
            "Introduction.",
            "Efficient Reinforcement Learning through Symbiotic Evolution.",
            "Linear Least-Squares Algorithms for Temporal Difference Learning.",
            "Feature-Based Methods for Large Scale Dynamic Programming.",
            "On the Worst-Case Analysis of Temporal-Difference Learning Algorithms.",
            "Reinforcement Learning with Replacing Eligibility Traces.",
            "Average Reward Reinforcement Learning: Foundations, Algorithms, and Empirical Results.",
            "The Loss from Imperfect Value Functions in Expectation-Based and Minimax-Based Tasks.",
            "The Effect of Representation and Knowledge on Goal-Directed Exploration with Reinforcement-Learning Algorithms.",
            "Creating Advice-Taking Reinforcement Learners.",
            "Incremental Multi-Step Q-Learning.",
            "Representation of Finite State Automata in Recurrent Radial Basis Function Networks.",
            "Scaling Up Inductive Learning with Massive Parallelism.",
            "Classification by Feature Partitioning.",
            "Learning in the Presence of Concept Drift and Hidden Contexts.",
            "Review of \"Inductive Logic Programming: Techniques and Applications\" by Nada Lavrac, Saso Dzeroski.",
            "A Reply to Pazzani's Book Review of \"Inductive Logic Programming: Techniques and Applications\".",
            "Real-World Robotics: Learning to Plan for Robust Execution.",
            "Robot Programming by Demonstration (RPD): Supporting the Induction by Human Interaction.",
            "Performance Improvement of Robot Continuous-Path Operation through Iterative Learning Using Neural Networks.",
            "Learning Controllers for Industrial Robots.",
            "Active Learning for Vision-Based Robot Grasping.",
            "Purposive Behavior Acquisition for a Real Robot by Vision-Based Reinforcement Learning.",
            "Learning Concepts from Sensor Data of a Mobile Robot.",
            "BEXA: A Covering Algorithm for Learning Propositional Concept Descriptions.",
            "Technical Note: Some Properties of Splitting Criteria.",
            "Stacked Regressions.",
            "On Learning Visual Concepts and DNF Formulae.",
            "A Lattice Conceptual Clustering System and Its Application to Browsing Retrieval.",
            "Bagging Predictors.",
            "Unifying Instance-Based and Rule-Based Induction.",
            "Error Reduction through Learning Multiple Descriptions.",
            "A Decision-Tree Model of Balance Scale Development.",
            "Efficient Incremental Induction of Decision Trees.",
            "Exploration Bonuses and Dual Control.",
            "Using the Minimum Description Length Principle to Infer Reduced Ordered Decision Graphs.",
            "PAC Learning of One-Dimensional Patterns.",
            "On-line Prediction and Conversion Strategies.",
            "Guest Editor's Introduction.",
            "The Power of Amnesia: Learning Probabilistic Automata with Variable Memory Length.",
            "Classic Learning.",
            "Rigorous Learning Curve Bounds from Statistical Mechanics.",
            "On the Limits of Proper Learnability of Subclasses of DNF Formulas."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1995",
        "info": "1995: Volumes\n18, 19, 20, 21",
        "count": 45,
        "papers": [
            "A Branch and Bound Incremental Conceptual Clusterer.",
            "Probably Almost Discriminative Learning.",
            "A Comparison of ID3 and Backpropagation for English Text-to-Speech Mapping.",
            "Inferring Finite Automata with Stochastic Output Functions and an Application to Map Learning.",
            "Classification Accuracy: Machine Learning vs. Explicit Knowledge Acquisition.",
            "Book Review: Neural Network Perception for Mobile Robot Guidance by Dean A. Pomerleau. Kluwer Academic Publishers, 1993.",
            "A Reply to Towell's Book Review of Neural Network Perception for Mobile Robot Guidance.",
            "Guest Editor's Introduction.",
            "Bounding the Vapnik-Chervonenkis Dimension of Concept Classes Parameterized by Real Numbers.",
            "Learning Fallible Deterministic Finite Automata.",
            "On the Complexity of Function Learning.",
            "Piecemeal Learning of an Unknown Environment.",
            "Learning from a Population of Hypotheses.",
            "An Experimental Comparison of the Nearest-Neighbor and Nearest-Hyperrectangle Algorithms.",
            "Monotonicity Maintenance in Information-Theoretic Machine Learning Algorithms.",
            "Multivariate Decision Trees.",
            "Encouraging Experimental Results on Learning CNF.",
            "Automated Refinement of First-Order Horn-Clause Domain Theories.",
            "Comprehension Grammars Generated from Machine Learning of Natural Languages.",
            "On Polynomial-Time Learnability in the Limit of Strictly Deterministic Automata.",
            "On The Learnability Of Disjunctive Normal Form Formulas.",
            "Alecsys and the AutonoMouse: Learning to Control a Real Robot by Distributed Classifier Systems.",
            "On the Stochastic Complexity of Learning Realizable and Unrealizable Rules.",
            "Evaluation and Selection of Biases in Machine Learning.",
            "Technical Note: Bias and the Quantification of Stability.",
            "Inductive Policy: The Pragmatics of Bias Selection.",
            "Recursive Automatic Bias Selection for Classifier Construction.",
            "The Appropriateness of Predicate Invention as Bias Shift Operation in ILP.",
            "Declarative Bias for Specific-to-General ILP Systems.",
            "Shifting Vocabulary Bias in Speedup Learning.",
            "Learning Bayesian Networks: The Combination of Knowledge and Statistical Data.",
            "Learning Binary Relations Using Weighted Majority Voting.",
            "Support-Vector Networks.",
            "Introduction.",
            "Genetic Algorithms, Operators, and DNA Fragment Assembly.",
            "Discovering Dependencies via Algorithmic Mutual Information: A Case Study in DNA Sequence Comparisons.",
            "Unsupervised Learning of Multiple Motifs in Biopolymers Using Expectation Maximization.",
            "Dexter: A System that Experiments with Choices of Training Data Using Expert Knowledge in the Domain of DNA Hydration.",
            "Use of Adaptive Networks to Define Highly Predictable Protein Secondary-Structure Classes.",
            "Machine Discovery of Protein Motifs.",
            "Searching for Representations to Improve Protein Sequence Fold-Class Prediction.",
            "Neural Networks for Full-Scale Protein Sequence Classification: Sequence Encoding with Singular Value Decomposition.",
            "The Parti-game Algorithm for Variable Resolution Reinforcement Learning in Multidimensional State-spaces.",
            "An Integration of Rule Induction and Exemplar-Based Learning for Graded Concepts.",
            "Sample Compression, Learnability, and the Vapnik-Chervonenkis Dimension."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1994",
        "info": "1994: Volumes\n14, 15, 16, 17",
        "count": 53,
        "papers": [
            "Randomly Fallible Teachers: Learning Monotone DNF with an Incomplete Membership Oracle.",
            "Tracking Drifting Concepts By Minimizing Disagreements.",
            "Learning Probabilistic Read-once Formulas on Product Distributions.",
            "Bounds on the Sample Complexity of Bayesian Learning Using Information Theory and the VC Dimension.",
            "Approximation and Estimation Bounds for Artificial Neural Networks.",
            "Guest Editorial.",
            "Hypothesis-Driven Constructive Induction in AQ17-HCI: A Method and Experiments.",
            "Concept Formation During Interactive Theory Revision.",
            "A Polynomial Approach to the Constructive Induction of Structural Knowledge.",
            "Flattening and Saturation: Two Representation Changes for Generalization.",
            "Explicit Representation of Concept Negation.",
            "Algorithms and Lower Bounds for On-Line Learning of Geometrical Concepts.",
            "The Power of Self-Directed Learning.",
            "TD(lambda) Converges with Probability 1.",
            "Introduction to the Abstracts of the Invited Talks Presented at ML92 Conference in Aberdeen, 1-3 July 1992.",
            "Machine Learning and Qualitative Reasoning.",
            "Children, Adults, and Machines as Discovery Systems.",
            "Combining Symbolic and Neural Learning.",
            "Statistical Methods for Analyzing Speedup Learning Experiments.",
            "Incremental Abductive EBL.",
            "The Importance of Attribute Selection Measures in Decision Tree Induction.",
            "Discrete Sequence Prediction and Its Applications.",
            "On-Line Learning from Search Failures.",
            "Introduction Structured Connectionist Systems.",
            "Neural Network-Based Vision for Precise Control of a Walking Robot.",
            "Using Neural Networks to Modularize Software.",
            "Higher-Order Neural Networks Applied to 2D and 3D Object Recognition.",
            "Improving Generalization with Active Learning.",
            "Trading Accuracy for Simplicity in Decision Trees.",
            "Toward an Ideal Trainer.",
            "Associative Reinforcement Learning: Functions in k-DNF.",
            "Associative Reinforcement Learning: A Generate and Test Algorithm.",
            "Bias in Information-Based Measures in Decision Tree Induction.",
            "Editorial: New Editorial Board Members.",
            "Guest Editor's Introduction.",
            "Acquisition of Children's Addition Strategies: A Model of Impasse-Free, Knowledge-Level Learning.",
            "Case-Based Learning: Predictive Features in Indexing.",
            "Modeling Cognitive Development on Balance Scale Phenomena.",
            "Simulating the Child's Acquisition of the Lexicon and Syntax-Experiences with Babel.",
            "Acquiring and Combining Overlapping Concepts.",
            "Learning Nonoverlapping Perceptron Networks from Examples and Membership Queries.",
            "Asynchronous Stochastic Approximation and Q-Learning.",
            "Complexity-Based Induction.",
            "An Upper Bound on the Loss from Approximate Optimal-Value Functions.",
            "Book Review: C4.5: Programs for Machine Learning by J. Ross Quinlan. Morgan Kaufmann Publishers, Inc., 1993.",
            "Generalizing Version Spaces.",
            "Algebraic Reasoning about Reactions: Discovery of Conserved Properties in Particle Physics.",
            "Quantifying Prior Determination Knowledge Using the PAC Learning Model.",
            "Guest Editor's Introduction.",
            "Toward Efficient Agnostic Learning.",
            "A Theory for Memory-Based Learning.",
            "The Learnability of Description Logics with Equality Constraints.",
            "On-Line Learning of Rectangles and Unions of Rectangles."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1993",
        "info": "1993: Volumes\n10, 11, 12, 13",
        "count": 46,
        "papers": [
            "Editorial.",
            "Synthesis of UNIX Programs Using Derivational Analogy.",
            "A Weighted Nearest Neighbor Algorithm for Learning with Symbolic Features.",
            "Induction Over the Unexplained: Using Overly-General Domain Theories to Aid Concept Learning.",
            "Information Filtering: Selection Mechanisms in Learning Systems.",
            "Overfitting Avoidance as Bias.",
            "Creating a Memory of Casual Relationships (Book Review).",
            "A Reply to Cohen's Book Review of Creating a Memory of Causal Relationships.",
            "Indexing and Elaboration and Refinement: Incremental Learning of Explanatory Cases.",
            "Derivational Analogy in Prodigy: Automating Case Acquisition, Storage, and Utilization.",
            "Opportunism and Learning.",
            "Integrating Feature Extraction and Memory Search.",
            "Wastewater Treatment Systems from Case-Based Reasoning.",
            "Coding Decision Trees.",
            "Active Learning Using Arbitrary Binary Valued Queries.",
            "Noise-Tolerant Occam Algorithms and Their Applications to Learning Decision Trees.",
            "Very Simple Classification Rules Perform Well on Most Commonly Used Datasets.",
            "An Analysis of the WITT Algorithm.",
            "Inferential Theory of Learning as a Conceptual Basis for Multistrategy Learning.",
            "Multistrategy Learning and Theory Revision.",
            "Learning Causal Patterns: Making a Transition from Data-Driven to Theory-Driven Learning.",
            "Using Knowledge-Based Neural Networks to Improve Algorithms: Refining the Chou-Fasman Algorithm for Protein Folding.",
            "Balanced Cooperative Modeling.",
            "Plausible Justification Trees: A Framework for Deep and Dynamic Integration of Learning Strategies.",
            "Introduction: Cognitive Autonomy in Machine Discovery.",
            "An Integrated Framework for Empirical Discovery.",
            "Experience Selection and Problem Choice in an Exploratory Learning System.",
            "Discovery by Minimal Length Encoding: A Case Study in Molecular Evolution.",
            "Design Methods for Scientific Hypothesis Formation and Their Application to Molecular Biology.",
            "Machine Discovery of Effective Admissible Heuristics.",
            "Discovery as Autonomous Learning from the Environment.",
            "Bivariate Scientific Function Finding in a Sampled, Real-Data Testbed.",
            "The Design of Discrimination Experiments.",
            "Cost-Sensitive Learning of Classification Knowledge and Its Applications in Robotics.",
            "Explanation-Based Learning for Diagnosis.",
            "Extracting Refined Rules from Knowledge-Based Neural Networks.",
            "Prioritized Sweeping: Reinforcement Learning With Less Data and Less Time.",
            "Research Note on Decision Lists.",
            "Selecting a Classification Method by Cross-Validation.",
            "Book Review: \"Machine Learning: A Theoretical Approach\".",
            "A Reply to Hellerstein's Book Review of Machine Learning: A Theoretical Approach.",
            "Using Genetic Algorithms for Concept Learning.",
            "A Knowledge-Intensive Genetic Algorithm for Supervised Learning.",
            "Competition-Based Induction of Decision Models from Examples.",
            "Genetic Reinforcement Learning for Neurocontrol Problems.",
            "What Makes a Problem Hard for a Genetic Algorithm? Some Anomalous Results and Their Explanation."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1992",
        "info": "1992: Volumes\n8, 9",
        "count": 31,
        "papers": [
            "Learning Two-Tiered Descriptions of Flexible Concepts: The POSEIDON System.",
            "Implementing Valiant's Learnability Theory Using Random Sets.",
            "A Further Comparison of Splitting Rules for Decision-Tree Induction.",
            "On the Handling of Continuous-Valued Attributes in Decision Tree Generation.",
            "Editorial.",
            "Interactive Concept-Learning and Constructive Induction by Analogy.",
            "Learning Probabilistic Automata and Markov Chains via Queries.",
            "Abductive Explanation-Based Learning: A Solution to the Multiple Inconsistent Explanation Problem.",
            "Simple Statistical Gradient-Following Algorithms for Connectionist Reinforcement Learning.",
            "Practical Issues in Temporal Difference Learning.",
            "Technical Note Q-Learning.",
            "Self-Improving Reactive Agents Based On Reinforcement Learning, Planning and Teaching.",
            "Transfer of Learning by Composing Solutions of Elemental Sequential Tasks.",
            "The Convergence of TD(lambda) for General lambda.",
            "A Reinforcement Connectionist Approach to Robot Path Finding in Non-Maze-Like Environments.",
            "Machine Learning: A Maturing Field.",
            "Dynamic Parameter Encoding for Genetic Algorithms.",
            "Higher-Order and Modal Logic as a Framework for Explanation-Based Generalization.",
            "The Utility of Knowledge in Inductive Learning.",
            "Neural Network Design and the Complexity of Learning (Book Review).",
            "A Reply to Honavar's Book Review of Neural Network Design and the Complexity of Learning.",
            "Lower Bound Methods and Separation Results for On-Line Learning Models.",
            "Learning Conjunctions of Horn Clauses.",
            "A Learning Criterion for Stochastic Rules.",
            "On the Computational Complexity of Approximating Distributions by Probabilistic Automata.",
            "A Universal Method of Scientific Inquiry.",
            "Explorations of an Incremental, Bayesian Algorithm for Categorization.",
            "A Bayesian Method for the Induction of Probabilistic Networks from Data.",
            "A Framework for Average Case Analysis of Conjunctive Learning Algorithms.",
            "Learning Boolean Functions in an Infinite Attribute Space.",
            "First Nearest Neighbor Classification on Frey and Slate's Letter Recognition Problem."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1991",
        "info": "1991: Volumes\n6, 7",
        "count": 28,
        "papers": [
            "Editorial.",
            "Rigel: An Inductive Learning System.",
            "Instance-Based Learning Algorithms.",
            "Information-Based Evaluation Criterion for Classifier's Performance.",
            "A Distance-Based Attribute Selection Measure for Decision Tree Induction.",
            "Improved Estimates for the Accuracy of Small Disjuncts.",
            "Exemplar-Based Knowledge Acquisition.",
            "A Reply to Reich's Book Review of Exemplar-Based Knowledge Acquisition.",
            "Symbolic and Neural Learning Algorithms: An Experimental Comparison.",
            "A 'PAC' Algorithm for Making Feature Maps.",
            "Letter Recognition Using Holland-Style Adaptive Classifiers.",
            "A Critical Look at Experimental Evaluations of EBL.",
            "Book Review.",
            "A Reply to Zito-Wolf's Book Review of Learning Search Control Knowledge: An Explanation-Based Approach.",
            "Complexity Results on Learning by Neural Nets.",
            "The Use of Background Knowledge in Decision Tree Induction.",
            "A Nearest Hyperrectangle Learning Method.",
            "Conflict Resolution as Discovery in Particle Physics.",
            "Editorial.",
            "An Incremental Deductive Strategy for Controlling Constructive Induction in Learning from Examples.",
            "Learning to Perceive and Act by Trial and Error.",
            "Learning to Predict Non-Deterministically Generated Strings.",
            "Introduction.",
            "Learning Automata from Ordered Examples.",
            "SLUG: A Connectionist Architecture for Inferring the Structure of Finite-State Environments.",
            "Graded State Machines: The Representation of Temporal Contingencies in Simple Recurrent Networks.",
            "Distributed Representations, Simple Recurrent Networks, and Grammatical Structure.",
            "The Induction of Dynamical Recognizers."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1990",
        "info": "1990: Volume 5",
        "count": 18,
        "papers": [
            "Exploratory Research in Machine Learning.",
            "Extending Domain Theories: Two Case Studies in Student Modeling.",
            "Acquiring Recursive and Iterative Concepts with Explanation-Based Learning.",
            "Boolean Feature Discovery in Empirical Learning.",
            "A Necessary Condition for Learning from Positive Examples.",
            "Introduction: Special Issue on Computational Learning Theory.",
            "Negative Results for Equivalence Queries.",
            "Polynomial time Learnability of Simple Deterministic Languages.",
            "Learning Nested Differences of Intersection-Closed Concept Classes.",
            "The Strength of Weak Learnability.",
            "Advice to Machine Learning Authors.",
            "Learning Logical Definitions from Relations.",
            "Empirical Learning as a Function of Concept Character.",
            "The Problem of Expensive Chunks and its Solution by Restricting Expressiveness.",
            "Learning Sequential Decision Rules Using Simulation Models and Competition.",
            "CSM: A Computational Model of Cumulative Learning.",
            "Probability Matching, the Magnitude of Reinforcement, and Classifier System Bidding.",
            "Empirical Learning Using Rule Threshold Optimization for Detection of Events in Synthetic Images."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1989",
        "info": "1989: Volume 4",
        "count": 20,
        "papers": [
            "Editorial.",
            "Learning Conjunctive Concepts in Structural Domains.",
            "Semi-Supervised Learning.",
            "On Learning Sets and Functions.",
            "Efficient Specialization of Relational Concepts.",
            "News and Notes.",
            "Editorial.",
            "LT Revisited: Explanation-Based Learning and the Logic of Principia Mathematica.",
            "Incremental Induction of Decision Trees.",
            "A Study of Explanation-Based Methods for Inductive Learning.",
            "An Empirical Comparison of Pruning Methods for Decision Tree Induction.",
            "Can Machine Learning Offer Anything to Expert Systems?",
            "When Will Machines Learn?",
            "Supporting Start-to-Finish Development of Knowledge Bases.",
            "The Knowledge Level Reinterpreted: Modeling How Systems Interact.",
            "Automated Knowledge Acquisition for Strategic Knowledge.",
            "The World Would Be a Better Place if Non-Programmers Could Program.",
            "Task-Structures, Knowledge Acquisition and Learning.",
            "Automated Support for Building and Extending Expert Models.",
            "Knowledge Acquisition for Knowledge-Based Systems: Notes on the State-of-the-Art."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1988",
        "info": "1988/1989: Volume 3",
        "count": 18,
        "papers": [
            "Machine Learning as an Experimental Science.",
            "Learning to Predict by the Methods of Temporal Differences.",
            "Learning by Failing to Explain: Using Partial Explanations to Learn in Incomplete or Intractable Domains.",
            "A Review of Machine Learning at AAAI-87.",
            "Genetic Algorithms and Machine Learning.",
            "Genetic Algorithms in Noisy Environments.",
            "Learning with Genetic Algorithms: An Overview.",
            "A Tale of Two Classifier Systems.",
            "Classifier Systems that Learn Internal World Models.",
            "Learning and Programming in Classifier Systems.",
            "Credit Assignment in Rule Discovery Systems Based on Genetic Algorithms.",
            "News and Notes.",
            "Toward a Unified Science of Machine Learning.",
            "The CN2 Induction Algorithm.",
            "A Heuristic Approach to the Discovery of Macro-Operators.",
            "An Empirical Comparison of Selection Measures for Decision-Tree Induction.",
            "Conceptual Clustering, Categorization, and Polymorphy.",
            "News and Notes."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1987",
        "info": "1987: Volume 2",
        "count": 20,
        "papers": [
            "Machine Learning and Grammar Induction.",
            "Learning Syntax by Automata Induction.",
            "A Version Space Approach to Learning Context-free Grammars.",
            "News and Notes.",
            "Machine Learning and Concept Formation.",
            "Experiments with Incremental Concept Formation: UNIMEM.",
            "Knowledge Acquisition via Incremental Conceptual Clustering.",
            "A Review of the Fourth International Workshop on Machine Learning.",
            "News and Notes.",
            "Research Papers in Machine Learning.",
            "Classifier Systems and the Animat Problem.",
            "Learning Decision Lists.",
            "Theory Change via View Application in Instructionless Learning.",
            "News and Notes.",
            "New Theoretical Directions in Machine Learning.",
            "Learning Quickly When Irrelevant Attributes Abound: A New Linear-threshold Algorithm.",
            "Queries and Concept Learning.",
            "Learning From Noisy Examples.",
            "Criteria for Polynomial-Time (Conceptual) Clustering.",
            "News and Notes."
        ]
    },
    {
        "name": "Machine Learning",
        "year": "1986",
        "info": "1986: Volume 1",
        "count": 19,
        "papers": [
            "On Machine Learning.",
            "Chunking in Soar: The Anatomy of a General Learning Mechanism.",
            "Explanation-Based Generalization: A Unifying View.",
            "Induction of Decision Trees.",
            "A Theory of Historical Discovery: The Construction of Componential Models.",
            "Editorial: The Terminology of Machine Learning.",
            "Explanation-Based Learning: An Alternative View.",
            "A General Framework for Induction and a Study of Selective Induction.",
            "News and Notes.",
            "Editorial: Human and Machine Learning.",
            "Experimental Goal Regression: A Method for Learning Problem-Solving Heuristics.",
            "Learning at the Knowledge Level.",
            "Incremental Learning from Noisy Data.",
            "News and Notes.",
            "Machine Learning and Discovery.",
            "Integrating Quantitative and Qualitative Discovery: The ABACUS System.",
            "Determining Arguments of Invariant Functional Descriptions.",
            "Chemical Discovery as Belief Revision.",
            "News and Notes."
        ]
    }
]