[
    {
        "name": "Machine Translation",
        "year": "2021",
        "info": "Volume 35: 2021",
        "count": 35,
        "papers": [
            "Introduction to the second issue on machine translation for low-resource languages.",
            "Semantic and syntactic information for neural machine translation.",
            "Context based machine translation with recurrent neural network for English-Amharic translation.",
            "ThamizhiMorph: A morphological parser for the Tamil language.",
            "Experience of neural machine translation between Indian languages.",
            "A review of the state-of-the-art in automatic post-editing.",
            "Read, spot and translate.",
            "An in-depth analysis of the individual impact of controlled language rules on machine translation output: a mixed-methods approach.",
            "The impact of translation modality on user experience: an eye-tracking study of the Microsoft Word user interface.",
            "Parallel feature weight decay algorithms for fast development of machine translation models.",
            "MSVD-Turkish: a comprehensive multimodal video dataset for integrated vision and language research in Turkish.",
            "Philipp Koehn: Neural Machine Translation.",
            "Special issue: Sign language translation and avatar technology.",
            "Computer-assisted sign language translation: a study of translators' practice to specify CAT software.",
            "Sign boundary and hand articulation feature recognition in Sign Language videos.",
            "Generalizing a model for animating adverbs of manner in American Sign Language.",
            "Natural synthesis of productive forms from structured descriptions of sign language.",
            "Improving realism in automated fingerspelling of American sign language.",
            "Motion synthesis and editing for the generation of new sign language content.",
            "Towards enhanced visual clarity of sign language avatars through recreation of fine facial detail.",
            "From MT to LREV: managing the transition.",
            "From MT to LREV: managing the transition.",
            "Recent advances of low-resource neural machine translation.",
            "Recent advances in Apertium, a free/open-source rule-based machine translation platform for low-resource languages.",
            "Improving bilingual word embeddings mapping with monolingual context information.",
            "Tag-less back-translation.",
            "Jointly learning bilingual word embeddings and alignments.",
            "Dual contextual module for neural machine translation.",
            "Enhanced encoder for non-autoregressive machine translation.",
            "Word reordering on multiple pivots for the Japanese and Indonesian language pair.",
            "Joint source-target encoding with pervasive attention.",
            "Augmenting training data with syntactic phrasal-segments in low-resource neural machine translation.",
            "Investigating the roles of sentiment in machine translation.",
            "Simple measures of bridging lexical divergence help unsupervised neural machine translation for low-resource languages.",
            "Minako O'Hagan (ed): The Routledge Handbook of Translation and Technology."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2020",
        "info": "Volume 34: 2020",
        "count": 15,
        "papers": [
            "Addressing data sparsity for neural machine translation between morphologically rich languages.",
            "Improving neural machine translation through phrase-based soft forced decoding.",
            "Optimizing segmentation granularity for neural machine translation.",
            "Roy Youdale: Using computers in the translation of literary style: challenges and opportunities.",
            "A roadmap to neural automatic post-editing: an empirical approach.",
            "Multimodal machine translation through visuals and speech.",
            "Analysing terminology translation errors in statistical and neural machine translation.",
            "A review of Thai-English machine translation.",
            "Lore Vandevoorde, Joke Daems, and Bart Defrancq (eds.): New Empirical Perspectives on Translation and Interpreting.",
            "Introduction to the Special Issue on Machine Translation for Low-Resource Languages.",
            "Transfer learning and subword sampling for asymmetric-resource one-to-many neural translation.",
            "Cross-lingual embedding for cross-lingual question retrieval in low-resource community question answering.",
            "Investigating alignment interpretability for low-resource NMT.",
            "Neural machine translation with a polysynthetic low resource language.",
            "Extremely low-resource neural machine translation for Asian languages."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2019",
        "info": "Volume 33: 2019",
        "count": 16,
        "papers": [
            "Editors' foreword to the special issue on human factors in neural machine translation.",
            "Post-editing neural machine translation versus phrase-based machine translation for English-Chinese.",
            "Post-editing neural machine translation versus translation memory segments.",
            "A product and process analysis of post-editor corrections on neural, statistical and rule-based machine translation output.",
            "Multi-modal indicators for estimating perceived cognitive load in post-editing of machine translation.",
            "Interactive adaptive SMT versus interactive adaptive NMT: a user experience evaluation.",
            "A user study of neural interactive translation prediction.",
            "An error analysis for image-based multi-modal neural machine translation.",
            "Evaluation of the impact of controlled language on neural machine translation compared to other MT architectures.",
            "Efficient document alignment across scenarios.",
            "Neighbors helping the poor: improving low-resource machine translation using related languages.",
            "Chan Sin-Wai (ed): The human factor in machine translation - Routledge Studies in Translation Technology, Routledge, 1st edition (2018), xii+256pp, ISBN 781-13-855-1213 (Hardback), 978-13-151-4753-6 (e-book).",
            "Joss Moorkens, Sheila Castilho, Federico Gaspari, Stephen Doherty (eds): Translation quality assessment: from principles to practice - Machine Translation: Technologies and Applications, Volume 1, Springer International Publishing, Heidelberg & Berlin, xii + 287 pp, ISBN 978-3-319-91240-0 (hardcover), 978-3-030-08206-2 (paperback), 978-3-319-91241-7 (eBook).",
            "Improving Arabic neural machine translation via n-best list re-ranking.",
            "Towards an open platform for machine translation of spoken languages into sign languages.",
            "Ruslan Mitkov, Johanna Monti, Gloria Corpas Pastor, and Violeta Seretan (eds): Multiword units in machine translation and translation technology - Current Issues in Linguistic Theory, Volume 341, John Benjamin Publishing Company, Amsterdam & Philadelphia, 2018, ix+259 pp, ISBN 978-90-272-0060-0 (HB), ISBN 978-90-272-6420-6 (e-book)."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2018",
        "info": "Volume 32: 2018",
        "count": 20,
        "papers": [
            "Preface.",
            "Overview of the DARPA LORELEI Program.",
            "Overview of the NIST 2016 LoReHLT evaluation.",
            "Combining rule-based and statistical mechanisms for low-resource named entity recognition.",
            "BBN's low-resource machine translation for the LoReHLT 2016 evaluation.",
            "Incident-Driven Machine Translation and Name Tagging for Low-resource Languages.",
            "Illinois CCG LoReHLT 2016 named entity recognition and situation frame systems.",
            "The ARIEL-CMU situation frame detection pipeline for LoReHLT16: a model translation approach.",
            "The ELISA Situation Frame extraction for low resource languages pipeline for LoReHLT'2016.",
            "Cross-lingual sentiment transfer with limited resources.",
            "Neural machine translation for low-resource languages without parallel corpora.",
            "Editors' foreword to the invited issue on SMT and NMT.",
            "Quantitative fine-grained human evaluation of machine translation systems: a case study on English to Croatian.",
            "Human versus automatic quality evaluation of NMT and PBSMT.",
            "Language-related issues for NMT and PBMT for English-German and English-Serbian.",
            "Evaluating MT for massive open online courses - A multifaceted comparison between PBSMT and NMT systems.",
            "Reassessing the proper place of man and machine in translation: a pre-translation scenario.",
            "A user-study on online adaptation of neural machine translation to human post-edits.",
            "Automatic quality estimation for speech translation using joint ASR and MT features.",
            "An end-to-end model for cross-lingual transformation of paralinguistic information."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2017",
        "info": "Volume 31: 2017",
        "count": 15,
        "papers": [
            "Editorial.",
            "The representational geometry of word meanings acquired by neural machine translation models.",
            "A comparison of discriminative training criteria for continuous space translation models.",
            "Chinese-Spanish neural machine translation enhanced with character and word bitmap fonts.",
            "Zero-resource machine translation by multimodal encoder-decoder network with multimedia pivot.",
            "A novel and robust approach for pro-drop language translation.",
            "Word from the editors.",
            "Automatic translation memory cleaning.",
            "Improving retrieval performance of translation memories using morphosyntactic analyses and generalized suffix arrays.",
            "A system for terminology extraction and translation equivalent detection in real time - Efficient use of statistical machine translation phrase tables.",
            "Segment-based interactive-predictive machine translation.",
            "A survey of domain adaptation for statistical machine translation.",
            "Induction of latent domains in heterogeneous corpora: a case study of word alignment.",
            "Shay Cohen: Bayesian analysis in natural language processing. Morgan and Claypool, San Rafael, California, 2016, xxvii + 246 pp, ISBN 9781627058735.",
            "Chan Sin-wai: the future of translation technology: towards a world without Babel - Routledge, New York, 2017, xiii + 301 pp [Routledge Studies in Translation Technology Series], ISBN 978-1-138-84204-5."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2016",
        "info": "Volume 30: 2016",
        "count": 12,
        "papers": [
            "Learning local word reorderings for hierarchical phrase-based statistical machine translation.",
            "Improving translation memory matching and retrieval using paraphrases.",
            "How do measures of cognitive effort relate to each other? A multivariate analysis of post-editing process data.",
            "Opera goer or Scrabble player: what makes a good translator?",
            "New directions in empirical translation process research exploring the CRITT TPR-DB - Springer International Publishing, Switzerland, 2016, ISBN: 978-3-319-20357-7, v + 315 pp.",
            "Kaibao Hu: Introducing corpus-based translation studies - Springer, Heidelberg-Berlin, 2016, xviii + 245 pp, ISBN: 978-3-662-48218-6.",
            "María Luisa Carrió-Pastor (ed.): Technology implementation in second language teaching and translation studies. New tools, new approaches - Springer, Singapore, 2016, vi + 258 pp, ISBN: 978-981-10-0571-8.",
            "Word from the editors.",
            "Self-selection bias of similarity metrics in translation memory evaluation.",
            "The first Automatic Translation Memory Cleaning Shared Task.",
            "Combining off-the-shelf components to clean a translation memory.",
            "Combining translation memories and statistical machine translation using sparse features."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2015",
        "info": "Volume 29: 2015",
        "count": 15,
        "papers": [
            "Automatic machine translation error identification.",
            "Lightly supervised word-sense translation-error detection and resolution in an interactive conversational spoken language translation system.",
            "Can college students be post-editors? An investigation into employing language learners in machine translation plus post-editing settings.",
            "Sharon O'Brien, Laura Winther Balling, Michael Carl, Michel Simard and Lucia Specia: Post-editing of machine translation: processes and applications - Cambridge Scholars Publishing, Newcastle upon Tyne, UK, 2014, ISBN: 978-1-4438-5476-4, xv + 322 pp.",
            "Quality estimation-guided supplementary data selection for domain adaptation of statistical machine translation.",
            "A Bayesian non-linear method for feature selection in machine translation quality estimation.",
            "A linguistically motivated taxonomy for Machine Translation error analysis.",
            "Complexity of alignment and decoding problems: restrictions and approximations.",
            "Survey of data-selection methods in statistical machine translation.",
            "Labeling hierarchical phrase-based models without linguistic resources.",
            "Correlations of perceived post-editing effort with measurements of actual effort.",
            "Pushpak Bhattacharyya: Machine translation - CRC Press, Taylor & Francis Group, Boca Raton, USA, 2015, ISBN: 978-1-4398-9718-8 (hardback), xxv 234 pp.",
            "Deyi Xiong and Min Zhang: Linguistically motivated statistical machine translation: models and algorithms - Springer Science+Business Media, Singapore, 2015, ISBN: 978-981-287-355-2, xii + 152 pp.",
            "Johann Roturier: Localizing apps: a practical guide for translators and translation students - Routledge, New York, NY, USA, 2015, xiv + 193 pp.",
            "Miguel Á. Bernal-Merino: Translation and localisation in video games: making entertainment software global - Routledge, New York and London, xx + 302 pp."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2014",
        "info": "Volume 28: 2014",
        "count": 18,
        "papers": [
            "A conjoint analysis framework for evaluating user preferences in machine translation.",
            "Maximum-entropy word alignment and posterior-based phrase extraction for machine translation.",
            "Peter Spyns and Jan Odijk (eds): Essential speech and language technology for Dutch: results by the STEVIN programme - Springer, 2013, ISBN: 978-3-642-30909-0, xvii + 413 pp.",
            "Anders Søgaard: Semi-Supervised Learning and Domain Adaptation in Natural Language Processing - Morgan & Claypool, 2013, ISBN 9781608459858, x + 93 pp.",
            "Emily M. Bender: Linguistic fundamentals for natural language processing: 100 essentials from morphology and syntax - Morgan-Claypool, San Rafael, CA, USA, 2013, xviii + 166 pp.",
            "Online discriminative learning for machine translation with binary-valued feedback.",
            "A hybrid machine translation architecture guided by syntax.",
            "Translation project adaptation for MT-enhanced computer assisted translation.",
            "Miguel A. Jiménez-Crespo: Translation and Web Localization, Routledge, 2013, xii + 233 pp, ISBN: 978-0 41564316-0.",
            "Chengqing Zong: Statistical natural language processing (second edition) - Tsinghua University Press, 2013, xxxv+570pp.",
            "Introduction to special issue on post-editing.",
            "Correlations between productivity and quality when post-editing in a professional context.",
            "Indices of cognitive effort in machine translation post-editing.",
            "Interactive translation prediction versus conventional post-editing in practice: a study with the CasMaCat workbench.",
            "Quality evaluation in community post-editing.",
            "Improving MT post-editing productivity with adaptive confidence estimation for document-specific translation model.",
            "Data-driven annotation of binary MT quality estimation corpora based on human post-editions.",
            "Online adaptation to post-edits for phrase-based statistical machine translation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2013",
        "info": "Volume 27: 2013",
        "count": 18,
        "papers": [
            "Generalizing sampling-based multilingual alignment.",
            "Manual labour: tackling machine translation for sign languages.",
            "Keiran J. Dunne and Elena S. Dunne (eds.): Translation and localization project management: the art of the possible.",
            "Joseph Olive, Caitlin Christianson, John McCary (eds.): Handbook of Natural Language Processing and Machine Translation.",
            "Jörg Tiedemann: Bitext alignment.",
            "Alejandro Moreno-Ramos et al.: Mox - illustrated guide to freelance translation.",
            "N-gram posterior probability confidence measures for statistical machine translation: an empirical study.",
            "Oracle decoding as a new way to analyze phrase-based machine translation.",
            "Substring-based machine translation.",
            "Quality estimation for machine translation: preface.",
            "Predicting sentence translation quality using extrinsic and language independent features.",
            "Investigating the contribution of linguistic information to quality estimation.",
            "Quality estimation for machine translation: some lessons learned.",
            "Sentence-level ranking with quality estimation.",
            "Weakly supervised approaches for quality estimation.",
            "Dimensionality reduction methods for machine translation quality estimation.",
            "Kirsten Malmkjær and Kevin Windle (eds.): The Oxford handbook of translation studies - Oxford University Press, 2011, xvii + 607 pp, ISBN: 978-0-19-923930-6.",
            "Markus Dickinson, Chris Brew and Detmar Meurers: Language and Computers - Wiley-Blackwell, 2013, ISBN: 978-1 4051 8305 5, xviii $$+$$ + 232 pp."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2012",
        "info": "Volume 26: 2012",
        "count": 19,
        "papers": [
            "Special issue on Machine Translation for Arabic: Preface.",
            "The impact of Arabic morphological segmentation on broad-coverage English-to-Arabic statistical machine translation.",
            "Orthographic and morphological processing for English-Arabic statistical machine translation.",
            "A comparison of segmentation methods and extended lexicon models for Arabic statistical machine translation.",
            "Methods for integrating rule-based and statistical systems for Arabic to English machine translation.",
            "Chunk-lattices for verb reordering in Arabic-English statistical machine translation - Special issues on machine translation for Arabic.",
            "Improved Arabic-to-English statistical machine translation by reordering post-verbal subjects for word alignment.",
            "Efficient accurate syntactic direct translation models: one tree at a time.",
            "Soft syntactic constraints for Arabic-English hierarchical phrase-based translation.",
            "Evaluation of 2-way Iraqi Arabic-English speech translation systems using automated metrics.",
            "Machine translation between Hebrew and Arabic.",
            "Jane: an advanced freely available hierarchical machine translation toolkit.",
            "Cardinality pruning and language model heuristics for hierarchical phrase-based translation.",
            "David Bellos (ed): Is that a fish in your ear: translation and the meaning of everything - Particular Books, Penguin Group, London, 2011, ix + 390 pp, ISBN 978-1-846-14464-6.",
            "Mona Baker and Gabriela Saldanha (eds.): Routledge Encyclopedia of Translation Studies - Taylor & Francis Group, 2011, 2nd ed., xxii + 674 pp, ISBN13: 978-0-415-36930-5 (hardback).",
            "Rada Mihalcea and Dragomir Radev: Graph-based natural language processing and information retrieval - Cambridge University Press, 2011, viii + 192 pp.",
            "Alexander Clark, Chris Fox and Shalom Lappin (eds): Handbook of computational linguistics and natural language processing - Wiley-Blackwell, 2010, xxii + 775 pp, hardbound, ISBN 978-1-4051-5581-6.",
            "What types of word alignment improve statistical machine translation?",
            "Analysis, preparation, and optimization of statistical sign language machine translation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2011",
        "info": "Volume 25: 2011",
        "count": 18,
        "papers": [
            "\"This sentence is wrong.\" Detecting errors in machine-translated sentences.",
            "Translation practice in the workplace: contextual analysis and implications for machine translation.",
            "Matxin, an open-source rule-based machine translation system for Basque.",
            "Free/open-source machine translation: preface.",
            "Deep open-source machine translation.",
            "OpenLogos machine translation: philosophy, model, resources and customization.",
            "Apertium: a free/open-source platform for rule-based machine translation.",
            "GREAT: open source software for statistical machine translation.",
            "Cunei: open-source machine translation with relevance-based models of each translation instance.",
            "The CMU-EBMT machine translation system.",
            "Towards predicting post-editing productivity.",
            "Translating by post-editing: is it the way forward?",
            "Integrating source-language context into phrase-based statistical machine translation.",
            "Yves Gambier and Luc Van Doorslaer (eds): Handbook of Translation Studies - John Benjamins, 2010, Vol 1, IX + 458 pp, ISBN: 978 90 272 03311.",
            "A O(|G|n6) time extension of inversion transduction grammars.",
            "Syntactic discriminative language model rerankers for statistical machine translation.",
            "Parallel sentence generation from comparable corpora for improved SMT.",
            "Nitin Indurkhya and Fred J. Damerau (eds): Handbook of Natural Language Processing (second edition) - CRC Press, Boca Raton, 2010, xxxiii + 678 pp, Hardbound, ISBN 978-1-4200-8592-1."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2010",
        "info": "Volume 24: 2010",
        "count": 19,
        "papers": [
            "Eye tracking as an MT evaluation technique.",
            "Metrics for MT evaluation: evaluating reordering.",
            "Metric and reference factors in minimum error rate training.",
            "Machine translation evaluation versus quality estimation.",
            "Significance tests of automatic machine translation evaluation metrics.",
            "Pushing the frontier of Statistical Machine Translation: Preface.",
            "The application of structured learning in natural language processing.",
            "A kernel regression framework for SMT.",
            "Monte Carlo techniques for phrase-based translation.",
            "Exploiting syntactic relationships in a phrase-based decoder: an exploration.",
            "Improve syntax-based translation using deep syntactic structures.",
            "Factored bilingual n-gram language models for statistical machine translation.",
            "Panning for EBMT gold, or \"Remembering not to forget\".",
            "Linguistic measures for automatic machine translation evaluation.",
            "TransSearch: from a bilingual concordancer to a translation finder.",
            "Philipp Koehn, Statistical machine translation - Cambridge University Press, 2010, Hardcover, xii + 433 pages, ISBN 978-0-521-87415-1, Price: EUR 40, USD 60.",
            "Kam-Fai Wong, Wenjie Li, Ruifeng Xu and Zheng-sheng Zhang: Introduction to Chinese natural language processing - Morgan and Claypool publishers, 2010, x+148pp.",
            "Nizar Y. Habash, Introduction to Arabic natural language processing (Synthesis lectures on human language technologies) - Morgan & Claypool, 2010, xiv + 166 pp.",
            "Colin de la Higuera: Grammatical inference: learning automata and grammars - Cambridge University Press, 2010, iv + 417 pages."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2009",
        "info": "Volume 23: 2009",
        "count": 16,
        "papers": [
            "Automatically generated parallel treebanks and their exploitability in machine translation.",
            "Symbolic-to-statistical hybridization: extending generation-heavy machine translation.",
            "Andrew Radford, Martin Atkinson, David Britain, Harald Clahsen, Andrew Spencer: Linguistics: an introduction.",
            "Introduction to the special issue on \"Automated Metrics for Machine Translation Evaluation\".",
            "The NIST 2008 Metrics for machine translation challenge - overview, methodology, metrics, and results.",
            "The Meteor metric for automatic evaluation of machine translation.",
            "TER-Plus: paraphrase, semantic, and alignment enhancements to Translation Edit Rate.",
            "Edit distances with block movements and error rate confidence estimates.",
            "ATEC: automatic evaluation of machine translation via word choice and word order.",
            "MaxSim: performance and effects of translation fluency.",
            "Expected dependency pair match: predicting translation quality with expected syntactic structure.",
            "Measuring machine translation quality as semantic equivalence: A metric based on entailment features.",
            "The hare and the tortoise: speed and accuracy in translation retrieval.",
            "A process study of computer-aided translation.",
            "Yorick Wilks, Machine Translation: Its Scope and Limits - Springer, 2009, x + 254 pp, ISBN: 978-0-387-72773-8.",
            "Review of Cyril Goutte, Nicola Cancedda, Marc Dymetman, and George Foster (eds): Learning machine translation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2008",
        "info": "Volume 22: 2008",
        "count": 9,
        "papers": [
            "Regression for machine translation evaluation at the sentence level.",
            "Using target-language information to train part-of-speech taggers for machine translation.",
            "METIS-II: low resource machine translation.",
            "Morphological mismatches in machine translation.",
            "Toward communicating simple sentences using pictorial representations.",
            "Khurshid Ahmad, Christopher Brewster, Mark Stevenson (Eds), Words and Intelligence I: Selected Papers by Yorick Wilks.",
            "Translating emphatic/contrastive focus from English to Mandarin Chinese.",
            "Generating Arabic text in multilingual speech-to-speech machine translation framework.",
            "Sylviane Cardey, Peter Greenfield, Séverine Vienney (eds): Machine Translation, Controlled Languages and Specialised Languages."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2007",
        "info": "Volume 21: 2007",
        "count": 15,
        "papers": [
            "A method of creating new valency entries.",
            "Methods for extracting and classifying pairs of cognates and false friends.",
            "Power shifts in web-based translation memory.",
            "Albert Branchadell and Lovell Margaret West (eds): Less Translated Languages.",
            "Review of Dubkjaer, Laila; Hemsen, Holmer; Minker, Wolfgang (eds) Evaluation of Text and Speech Systems.",
            "Semi-supervised model adaptation for statistical machine translation.",
            "Evaluating machine translation with LFG dependencies.",
            "Capturing practical natural language transformations.",
            "Ruslan Mitkov, Anaphora Resolution.",
            "Automatic extraction of translations from web-based bilingual materials.",
            "Pivot language approach for phrase-based statistical machine translation.",
            "Chan Sin-wai (ed) A Topical Bibliography of Computer (-Aided) Translation.",
            "Bilingual LSA-based adaptation for statistical machine translation.",
            "Simultaneous translation of lectures and speeches.",
            "Kornai, András: Mathematical Linguistics."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2006",
        "info": "Volume 20: 2006",
        "count": 20,
        "papers": [
            "EBMT by tree-phrasing.",
            "Example-based machine translation based on tree-string correspondence and statistical generation.",
            "Dependency treelet translation: the convergence of statistical and example-based machine-translation?",
            "Translators and TM: An investigation of translators' perceptions of translation memory adoption.",
            "Syntactic mismatches in machine translation.",
            "Harry Bunt, John Carroll, Giorgio Satta (eds.) New Developments in Parsing Technology.",
            "Walter Daelemans and Antal van den Bosch, Memory-Based Language Processing.",
            "Improving phrase-based statistical machine translation with morphosyntactic transformation.",
            "EXTRA: a system for example-based translation assistance.",
            "Improving statistical MT by coupling reordering and decoding.",
            "Hristo Georgiev: English Algorithmic Grammar . London/New York: Continuum, 2006. viii + 256 pp.",
            "Marjorie J. McShane, A Theory of Ellipsis.",
            "Mark Johnson, Sanjeev P. Khudanpur, Mari Ostendorf and Roni Rosenfeld (eds) Mathematical Foundations of Speech and Language Processing.",
            "Automatic induction of bilingual resources from aligned parallel corpora: application to shallow-transfer machine translation.",
            "Finding translations for low-frequency words in comparable corpora.",
            "Implementing NLP projects for noncentral languages: instructions for funding bodies, strategies for developers.",
            "Chiew Kin Quah, Translation and Technology.",
            "Emanuela Cresti and Massimo Moneglia (Eds.), C-ORAL-ROM. Integrated Reference Corpora for Spoken Romance Languages.",
            "Nadja Nesselhauf, Collocations in a Learner Corpus.",
            "Uwe Reinke, Translation Memories. Systeme - Konzepte - Linguistische Optimierung."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2005",
        "info": "Volume 19: 2005",
        "count": 14,
        "papers": [
            "Controlled Translation in an Example-based Environment: What do Automatic Evaluation Metrics Tell Us?",
            "Methodologies for Measuring the Correlations between Post-Editing Effort and Machine Translatability.",
            "Practical Word-Sense Disambiguation Using Co-occurring Concept Codes.",
            "The Long-Term Forecast for Weather Bulletin Translation.",
            "Toward Practical Spoken Language Translation.",
            "An NLP Lexicon as a Largely Language-Independent Resource.",
            "The Language Translation Interface: A Perspective from the Users.",
            "Introduction to special issue on example-based machine translation.",
            "Example-based machine translation: a review and commentary.",
            "MT model space: statistical versus compositional versus example-based machine translation.",
            "A system-theoretical view of EBMT.",
            "Purest ever example-based machine translation: Detailed presentation and assessment.",
            "Inducing translation templates with type constraints.",
            "Hybrid data-driven models of machine translation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2003",
        "info": "Volume 18: 2003-2004",
        "count": 20,
        "papers": [
            "The Logos Model: An Historical Perspective.",
            "Ken Hale and Samuel Jay Keyser, Prolegomenon to a Theory of Argument Structure.",
            "W. John Hutchins (ed.), Early Years in Machine Translation: Memoirs and Biographies of Pioneers, Volume 97 Amsterdam Studies in the Theory and History of Linguistic Science.",
            "Hybrid Natural Language Generation from Lexical Conceptual Structures.",
            "Parameterizing and Eliciting Text Elements across Languages for Use in Natural Language Processing Systems.",
            "Didier Bourigault, Christian Jacquemin and Marie-Claude L'Homme (eds), Recent Advances in Computational Terminology.",
            "Design, Implementation and Evaluation of an Inflectional Morphology Finite State Transducer for Irish.",
            "Finite-State Computational Morphology: An Analyzer Prototype For Zulu.",
            "Morphology in Machine Translation Systems: Efficient Integration of Finite State Transducers and Feature Structure Descriptions.",
            "A Generic Finite State Compiler for Tagging Rules.",
            "Translation Disambiguation in Mixed Language Queries.",
            "A Morphological Tagger for Korean: Statistical Tagging Combined with Corpus-Based Morphological Rule Application.",
            "A Methodology for Evaluating Arabic Machine Translation Systems.",
            "Book Review: Douglas Robinson. Performative Linguistics: Speaking and Translating as Doing Things with Words. New York/London: Routledge, 2003. ix+260pp.",
            "Book Review, Inderjeet Mani: Automatic Summarization, John Benjamins Publishing, Amsterdam, The Netherlands, 2001, xi + 286 pp.",
            "Book Review: Lynne Bowker, Computer Aided Translation Technology: A Practical Introduction, University of Ottawa Press, Ottawa, Canada, 2002. xx + 185 pp.",
            "Book Review : Harold Somers (ed.), Computers and Translation-A translator's guide, John Benjamins Publishing Company, Amsterdam/Philadephia; 2003, xi + 349 pp.",
            "Book Review, Falk, Yehuda N., Lexical-Functional Grammar - An Introduction to Parallel Constraint-Based Syntax, Lecture Notes 126 (CSLI-LN), Center for the Study of Language and Information, Stanford, 2001, xv + 237 pp.",
            "Book Review: Brian James Baer, Geoffrey S. Koby (eds), Beyond the Ivory Tower: Rethinking Translation Pedagogy. John Benjamins Publishing Co., Amsterdam/Philadelphia, 2003, xvi + 258 pp.",
            "Book Review: Abeillé, Anne (ed.), Treebanks: Building and Using Parsed Corpora, Kluwer Academic Publishers, Dordrecht/Boston/London, 2003, xxvi + 406 pp."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2002",
        "info": "Volume 17: 2002",
        "count": 12,
        "papers": [
            "Translation with Scarce Bilingual Resources.",
            "Semantic Classification of Adjectives on the Basis of their Syntactic Features in Polish and English.",
            "Principles of Context-Based Machine Translation Evaluation.",
            "Trans Type: Development-Evaluation Cycles to Boost Translator's Productivity.",
            "Construction of a Chinese-English Verb Lexicon for Machine Translation and Embedded Multilingual Applications.",
            "LinguaNet: Embedded MT in a Cross-Border Messaging System for European Law Enforcement.",
            "Stochastic Finite-State Models for Spoken Language Machine Translation.",
            "MARS: A Statistical Semantic Parsing and Generation-Based Multilingual Automatic tRanslation System.",
            "Interlingua-based English-Korean Two-way Speech Translation of Doctor-Patient Dialogues with CCLINC.",
            "MT for Minority Languages Using Elicitation-Based Learning of Syntactic Transfer Rules.",
            "Embedding Knowledge Elicitation and MT Systems within a Single Architecture.",
            "Special Issue on Embedded MT Systems; Overview."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2001",
        "info": "Volume 16: 2001",
        "count": 10,
        "papers": [
            "Has There Been a Revolution in Machine Translation?",
            "Towards a Lexicographic Approach to Lexical Transfer in Machine Translation (Illustrated by the German-Russian Language Pair).",
            "Collocation Dictionary Optimization Using WordNet and k-Nearest Neighbor Learning.",
            "Robustness and Portability Issues in Multilingual Speech Processing.",
            "A Methodology for a Semi-Automatic Evaluation of the Lexicons of Machine Translation Systems.",
            "Learning-based Intrasentence Segmentation for Efficient Translation of Long Sentences.",
            "MTranslatability.",
            "Translation Tools: An Exploratory Study of their Adoption by UK Freelance Translators.",
            "Improvement of Translation Quality of English Newspaper Headlines by Automatic Pre-editing.",
            "Interlingua-based English-Hindi Machine Translation and Language Divergence."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "2000",
        "info": "Volume 15: 2000",
        "count": 15,
        "papers": [
            "Introduction: Special Issue on Spoken Language Translation.",
            "The Janus-III Translation System: Speech-to-Speech Translation in Multiple Domains.",
            "Interactive Speech Translation in the Diplomat Project.",
            "Statistical Translation of Text and Speech: First Results with the RWTH System.",
            "The EuTrans Spoken Language Translation System.",
            "Head-Transducer Models for Speech Translation and Their Automatic Acquisition from Bilingual Data.",
            "Discourse Particles and Discourse Functions.",
            "Nine Issues in Speech Translation.",
            "Petr Petrovich Troyanskii (1894-1950): A Forgotten Pioneer of Mechanical Translation.",
            "Towards a Dynamic Linkage of Example-based and Rule-based Machine Translation.",
            "Graeme Kennedy, An Introduction to Corpus Linguistics.",
            "Christa Hauenschild and Susanne Heizmann (eds), Machine Translation and Translation Theory.",
            "Unit Completion for a Computer-aided Translation Typing System.",
            "A Methodology for Building Translator-oriented Dictionary Systems.",
            "Machine Translation of Closed Captions."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1999",
        "info": "Volume 14: 1999",
        "count": 11,
        "papers": [
            "Alignment and Matching of Bilingual English-Chinese News Texts.",
            "Systematic Verb Polysemy in MT: A Study of Danish Motion Verbs with Comparisons with Spanish.",
            "Toward Language-dependent Applications.",
            "Review Article: Example-based Machine Translation.",
            "Introduction: Special Issue on Anaphora Resolution in Machine Translation and Multilingual NLP.",
            "Semantic Inference for Anaphora Resolution: Toward a Framework in Machine Translation.",
            "An Empirical Approach to Spanish Anaphora Resolution.",
            "Anaphora and Translation Discrepancies in Russian-German MT.",
            "Zero-subject Resolution Using Linguistic Constraints and Defaults: The Case of Japanese Instruction Manuals.",
            "Automatic Extraction of Rules for Anaphora Resolution of Japanese Zero Pronouns in Japanese-English Machine Translation from Aligned Sentence Pairs.",
            "Multilingual Anaphora Resolution."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1998",
        "info": "Volume 13: 1998",
        "count": 13,
        "papers": [
            "A Controlled Skip Parser.",
            "Foreword.",
            "Translation Differences and Pragmatics-Based MT.",
            "Line 'Em Up: Advances in Alignment Technology and their Impact on Translation Support Tools.",
            "Bilingual Sentence Alignment: Balancing Robustness and Accuracy.",
            "The Challenges of Cross-Modal Translation: English-to-Sign-Language Translation in the Zardoz System.",
            "Reference in Japanese-English Machine Translation.",
            "An Applied Ontological Semantic Microtheory of Adjective Meaning for Natural Language Processing.",
            "Modern Phrase Structure Grammar, Blackwell Textbooks in Linguistics 11.",
            "Parsing Schemata Berlin and Heidelberg: .",
            "Rapid Deployment Morphology.",
            "A Statistical Dialogue Analysis Model Based on Speech Acts for Dialogue Machine Translation.",
            "The Origins of the Translator's Workstation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1997",
        "info": "Volume 12: 1997",
        "count": 18,
        "papers": [
            "Preface.",
            "The Proper Place of Men and Machines in Language Translation.",
            "MT Today: Emerging Roles, New Successes.",
            "Some Notes on The Proper Place of Men and Machines in Language Translation.",
            "It's Still the Proper Place.",
            "Bricks and Skeletons: Some Ideas for the Near Future of MAHT.",
            "A Technical Word- and Term-Translation Aid Using Noisy Parallel Corpora across Language Groups.",
            "Termight: Coordinating Humans and Machines in Bilingual Terminology Acquisition.",
            "Multilingual Document Production From Support for Translating to Support for Authoring.",
            "Glossary-Based MT Engines in a Multilingual Analyst's Workstation Architecture.",
            "Accessing Foreign Languages with Compass.",
            "Target-Text Mediated Interactive Machine Translation.",
            "From First Conception to First Demonstration: the Nascent Years of Machine Translation, 1947-1954. A Chronology.",
            "Daniel Jones, Analogical Natural Language Processing.",
            "Peter Whitelock and Kieran Kilby, Linguistic and Computational Techniques in Machine Translation System Design.",
            "Large-Scale Dictionary Construction for Foreign Language Tutoring and Interlingual Machine Translation.",
            "A Typology of Translation Problems for Eurotra Translation Machines.",
            "Karen Sparck Jones & Julia R. Galliers, Evaluating Natural Language Processing Systems: An Analysis and Review. Lecture Notes in Artificial Intelligence 1083."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1996",
        "info": "Volume 11: 1996",
        "count": 7,
        "papers": [
            "Editor's note.",
            "Lexical choice in text generation and machine translation.",
            "Multilingual generation: The role of telicity in lexical choice and syntactic realization.",
            "Lexical paraphrases in multilingual sentence generation.",
            "On expressing metonymic relations in multiple languages.",
            "Lexical choice for complex noun phrases: Structure, modifiers, and determiners.",
            "Systematic alternatives in lexicalization: The case of gerund translation."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1995",
        "info": "Volume 10: 1995",
        "count": 12,
        "papers": [
            "Introduction: Special issue on building lexicons for machine translation.",
            "A lexicon for knowledge-based MT.",
            "Verb semantics for English-Chinese translation.",
            "Towards a cross-linguistically valid classification of spatial prepositions.",
            "Toward a lexicalized grammar for interlinguas.",
            "Combining corpus and machine-readable dictionary data for building bilingual lexicons.",
            "Automatic acquisition of semantic collocation from corpora.",
            "Book review.",
            "A model of a bi-directional transfer mechanism using rule combinations.",
            "Parsing Turkish using the lexical functional grammar formalism.",
            "Book review.",
            "Book review."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1994",
        "info": "Volume 9: 1994",
        "count": 12,
        "papers": [
            "The lexical unit in the metal® MT system.",
            "A model of comparative stylistics for machine translation.",
            "Machine assisted translation from English to a Slavic language.",
            "Augmenting formal semantic representation for NLP: The story of SMEARR.",
            "Multilingual Dialogue-Based MT for monolingual authors: the LIDIA project and a first mockup.",
            "A simple and practical method for evaluating machine translation quality.",
            "Introduction: Special issue on building lexicons for machine translation.",
            "Generative lexicon principles for machine translation: A case for meta-lexical structure.",
            "Acquisition of lexical translation relations from MRDS.",
            "From syntactic encodings to thematic roles: Building lexical entries for interlingual MT.",
            "Acquisition of large lexicons for practical knowledge-based MT.",
            "Large-scale automatic extraction of an English-Chinese translation lexicon."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1993",
        "info": "Volume 8: 1993",
        "count": 19,
        "papers": [
            "Evaluation: An assessment.",
            "Evaluation of MT Systems at Union Bank of Switzerland.",
            "Automatic Test Suite generation.",
            "Module-level testing for natural language understanding.",
            "A first-pass approach for evaluating machine translation systems.",
            "Evaluation of MT systems: A programmatic view.",
            "Constructive machine translation evaluation.",
            "Benchmark investigation/identification project.",
            "A diagnostic tool for German syntax.",
            "A procedure for the evaluation and improvement of an MT system by the end-user.",
            "Automatic evaluation of output quality for Machine Translation systems.",
            "Automatically creating lexical entries for ULTRA, a multilingual MT system.",
            "What can be learned from raw texts?",
            "Acquisition of selectional patterns in sublanguages.",
            "Symposium report.",
            "Generation of text from logical formulae.",
            "Editor's note.",
            "Good applications for crummy machine translation.",
            "Book reviews."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1992",
        "info": "Volume 7: 1992",
        "count": 28,
        "papers": [
            "Guest editor's note.",
            "Towards meaning-based machine translation: using abstractions from text generation for preserving meaning.",
            "Utterance generation using conceptual representations.",
            "Interactions between linguistic constraints: Procedural vs. declarative approaches.",
            "Text planning with opportunistic control.",
            "Book review.",
            "ATTN: Machine translation makers and shakers, doers and watchers.",
            "The use of lexical semantics in interlingual machine translation.",
            "Meaning-text theory: Linguistics, lexicography, and implications.",
            "The linguistics of punctuation.",
            "An essay on grammar-parser relations.",
            "The foundations of artificial intelligence: A sourcebook.",
            "Generalized LR parsing.",
            "Current issues in parsing technology.",
            "Functional grammar and the computer.",
            "Editor's note.",
            "Current research in Machine Translation.",
            "Reaction to Somers: Current research in Machine Translation.",
            "Current MT research orientation/disorientation.",
            "And after the second generation ...",
            "Current research in Machine Translation: A reply to Somers.",
            "State of the art and perspectives.",
            "Producers-users-customers: Towards a differentiated evaluation of research in Machine Translation.",
            "Why MT systems are still not widely used.",
            "What do we want from MT?",
            "Responses to Current Research in Machine Translation by Harold Somers.",
            "Commentary on Somers' article.",
            "A response to the comments."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1991",
        "info": "Volume 6: 1991",
        "count": 21,
        "papers": [
            "Relational-grammar-based generation in the JETS Japanese-English machine translation system.",
            "Machine translation of non-literary texts: Some Canadian experiences.",
            "Book reviews.",
            "Introduction.",
            "Eurotra: General system design.",
            "The Eurotra MT formalism.",
            "The Eurotra linguistic specifications: An overview.",
            "Implementing monolingual grammars and transfer components in the Eurotra formalism.",
            "A treatment of unbounded dependencies in eurotra with an experimental coindexation tool.",
            "Token reference vs. type reference: Implications for machine translation.",
            "Transfer formalisms.",
            "An overview of MiMo2.",
            "CAT2: An experimental eurotra alternative.",
            "Book reviews.",
            "Errata.",
            "Editor's note.",
            "BITS, A Hebrew-English bibliographic translation system.",
            "Translator knowledge base for machine translation systems.",
            "Resolution of ambiguity in Chinese and its application to machine translation.",
            "Book reviews.",
            "Announcement."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1990",
        "info": "Volume 5: 1990",
        "count": 14,
        "papers": [
            "On the nature of lexical knowledge.",
            "Customizing verb definitions for specific semantic domains.",
            "Secondary predication and the lexical representation of verbs.",
            "How to realize a concept: Lexical selection and the conceptual network in text generation.",
            "Valency and case in computational linguistics.",
            "Providing machine tractable dictionary tools.",
            "Lexical acquisition: Where is the semantics?",
            "Third International Conference on Theoretical and Methodological Issues in Machine Translation of Natural Languages.",
            "Book reviews.",
            "The theoretical basis of MiMo.",
            "Automated procedures for the improvement of a machine translation system by feedback from postediting.",
            "Book reviews.",
            "Some key issues in designing MT systems.",
            "PhiDmDialog: A speech-to-speech dialogue translation system."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1989",
        "info": "Volume 4: 1989",
        "count": 26,
        "papers": [
            "Guest editor's note.",
            "Knowledge-based machine translation.",
            "Knowledge representation support.",
            "Analysis and generation grammars.",
            "Lexicons.",
            "Analysis.",
            "Augmentation.",
            "Generation.",
            "Book review.",
            "APAC - An experiment in machine translation.",
            "Lexical description for NLP: The case of the French adverb presque.",
            "From syntax to semantics: Insights from machine translation.",
            "Masinnyj perevod i prikladnaja lingvistika: Problemy sozdanija sistemy avtomaticeskogo perevoda.",
            "Integrated natural language dialogues: A computational model.",
            "Toward a computational model of aspect and verb semantics.",
            "A data-driven control strategy for grammar writing systems.",
            "Words in the mind: An introduction to the mental lexicon.",
            "Descriptive tools for electronic processing of dictionary data: Studies in computational lexicography.",
            "Symposium on Lexicography III: Proceedings of the Third International Symposium on Lexicography.",
            "On the definition of word.",
            "Lexicography today: An annotated bibliography of the theory of lexicography.",
            "New directions in semantics.",
            "Natural language parsing and linguistic theories.",
            "Knowledge systems and prolog: A logical approach to expert systems and natural language processing.",
            "The music machine: Selected readings from \"computer music journal\".",
            "Errata."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1988",
        "info": "Volume 3: 1988",
        "count": 18,
        "papers": [
            "Editor's note.",
            "The treatment of complex English nominalizations in machine translation.",
            "Left-Associative Grammar: An informal outline.",
            "GRADE: A software environment for machine translation.",
            "Book Reviews.",
            "Computer processing of Chinese & Oriental languages.",
            "MT Summit, Hakone, Kanagawa-ken, Japan September 17-19, 1987.",
            "Semantic analysis in XTRA, an English - Chinese machine translation system.",
            "Left-associative grammar: The algebraic definitions.",
            "Book Reviews.",
            "Book Reviews.",
            "Semantic properties of the root-pattern array.",
            "The potential of Swetra - A multilanguage MT system.",
            "Book reviews.",
            "The pronominal approach in NLP: A pronominal feature analysis of coordination in French.",
            "Semantic properties of the root-pattern array.",
            "The potential of swetra - A multilanguage MT system.",
            "Book reviews."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1987",
        "info": "Volume 2: 1987",
        "count": 31,
        "papers": [
            "The British Term Bank project: A prototype software.",
            "A software tool for research in linguistics and lexicography: Application to Somali.",
            "Machine translation output and translation theory.",
            "Review article: Project for integrated development of English-Spanish machine translation.",
            "EgBridge Version 2.2.",
            "Book reviews.",
            "As the generations pass...",
            "Unification and the computational analysis of arabic.",
            "Terminology: Principles and methdos.",
            "On computers, translation, and Stanislaw Lem.",
            "Integrating discourse pragmatics and propositional knowledge for multilingual natural language processing.",
            "Software review.",
            "Book reviews.",
            "As the generations pass...",
            "A user perspective on computer-assisted translation for minority languages.",
            "The context of machine translation.",
            "Textbase and translation: The repertorium columbianum.",
            "Toward a methodology for the evaluation of machine-assisted translation systems.",
            "The analysis lexicon and the lexicon management system.",
            "Book reviews.",
            "As the generations pass...",
            "Margaret Masterman: In memoriam.",
            "The METAL English-to-German system: First progress report.",
            "Software design issues for natural language processing.",
            "Semantic space.",
            "Concept-lexeme-syntax triangles: A gateway to interlingual translation.",
            "The engineering of a Translator Workstation.",
            "Two-level data banks for translators.",
            "Multi-Lingual Scholar, Version 3.0.",
            "Book reviews.",
            "As the generations pass..."
        ]
    },
    {
        "name": "Machine Translation",
        "year": "1986",
        "info": "Volume 1: 1986",
        "count": 14,
        "papers": [
            "Language, sublanguage, and the promise of machine translation.",
            "Functional considerations in the postediting of machine-translated output.",
            "Sentence disambiguation by asking.",
            "Book reviews.",
            "Conference notes.",
            "As the generations pass...",
            "Essential requirements for a large-scale operational machine-translation system.",
            "The lexicon in the background.",
            "The intermediary language for multilanguage translation.",
            "Semantics, translation, and anaphora.",
            "The background to practical machine translation.",
            "Computer aided translation project, University Sains Malaysia, Penang, Malaysia.",
            "E/G Word, Japanese word processor for the MacIntosh. Sensei software group; Counterpoint systems.",
            "Sprachnormen: Theorie und Praxis."
        ]
    }
]