[
    {
        "name": "Natural Computing",
        "year": "2021",
        "info": "Volume 20, 2021",
        "count": 54,
        "papers": [
            "Preface.",
            "Cooperative search method for multiple AUVs based on target clustering and path optimization.",
            "Adaptive CCR-ELM with variable-length brain storm optimization algorithm for class-imbalance learning.",
            "Integrated probability multi-search and solution acceptance rule-based artificial bee colony optimization scheme for web service composition.",
            "A novel hybrid BPSO-SCA approach for feature selection.",
            "A multi-objective feature selection method based on bacterial foraging optimization.",
            "Ensemble learning based on fitness Euclidean-distance ratio differential evolution for classification.",
            "Multi-objective bacterial colony optimization algorithm for integrated container terminal scheduling problem.",
            "An enhanced monarch butterfly optimization with self-adaptive crossover operator for unconstrained and constrained optimization problems.",
            "Evolving graphs with semantic neutral drift.",
            "Solving two-dimensional cutting stock problem via a DNA computing algorithm.",
            "DNAQL: a query language for DNA sticker complexes.",
            "Preface.",
            "Hairpin completions and reductions: semilinearity properties.",
            "Reservoir computing quality: connectivity and topology.",
            "DNA origami words, graphical structures and their rewriting systems.",
            "The representational entity in physical computing.",
            "Geometric tiles and powers and limitations of geometric hindrance in self-assembly.",
            "Computational limitations of affine automata and generalized affine automata.",
            "Correction to: Computational limitations of affine automata and generalized affine automata.",
            "On computing the Lyapunov exponents of reversible cellular automata.",
            "Solving combinatorial optimisation problems using oscillator based Ising machines.",
            "Communication complexity meets cellular automata: Necessary conditions for intrinsic universality.",
            "Pumping lemmas for classes of languages generated by folding systems.",
            "Counting infinitely by oritatami co-transcriptional folding.",
            "Preface.",
            "On the use of (1, λ )-evolution strategy as efficient local search mechanism for discrete optimization: a behavioral analysis.",
            "Productive fitness in diversity-aware evolutionary algorithms.",
            "On the class of hybrid adaptive evolutionary algorithms (chavela).",
            "A framework for designing of genetic operators automatically based on gene expression programming and differential evolution.",
            "An Island Model based on Stigmergy to solve optimization problems.",
            "Absolute versus stochastic stability of the artificial bee colony in synchronous and sequential modes.",
            "GSA improvement via the von Neumann stability analysis.",
            "Improving convergence in swarm algorithms by controlling range of random movement.",
            "Evolutionary algorithms and submodular functions: benefits of heavy-tailed mutations.",
            "Improvement in learning enthusiasm-based TLBO algorithm with enhanced exploration and exploitation properties.",
            "An evaluation of k-means as a local search operator in hybrid memetic group search optimization for data clustering.",
            "Preface.",
            "Committed-format AND protocol using only random cuts.",
            "Conjugate word blending: formal model and experimental implementation by XPCR.",
            "Fast reconfiguration of robot swarms with uniform control signals.",
            "On the generative capacity of matrix insertion-deletion systems of small sum-norm.",
            "Impossibility of strict assembly of infinite fractals by oritatami.",
            "Single semi-contextual insertion-deletion systems.",
            "Classical and quantum algorithms for constructing text from dictionary problem.",
            "State-deterministic $5'\\rightarrow 3'$ Watson-Crick automata.",
            "Self-healing turing-universal computation in morphogenetic systems.",
            "Preface.",
            "Multi-region symbolic regression: combining functions under a multi-objective approach.",
            "Saving computational budget in Bayesian network-based evolutionary algorithms.",
            "Stock market trend detection and automatic decision-making through a network-based classification model.",
            "A study of model and hyper-parameter selection strategies for classifier ensembles: a robust analysis on different optimization algorithms and extended results.",
            "Powering DNA strand-displacement reactions with a continuous flow reactor.",
            "Correction to: A class of discrete dynamical systems with properties of both cellular automata and L-systems."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2020",
        "info": "Volume 19, 2020",
        "count": 54,
        "papers": [
            "Preface.",
            "Tribute to Prof. Jacques Demongeot: conversations at the National Bar.",
            "About block-parallel Boolean networks: a position paper.",
            "On the influence of the interaction graph on a finite dynamical system.",
            "Boolean dynamics revisited through feedback interconnections.",
            "Maximum sensitivity to update schedules of elementary cellular automata over periodic configurations.",
            "Concurrency in Boolean networks.",
            "Generation and robustness of Boolean networks to model Clostridium difficile infection.",
            "Spiking neural networks modelled as timed automata: with parameter learning.",
            "Reversible causal graph dynamics: invertibility, block representation, vertex-preservation.",
            "A tutorial on elementary cellular automata with fully asynchronous updating.",
            "Bionic vision system and its application in license plate recognition.",
            "A self-adaptive multi-population differential evolution algorithm.",
            "From electric circuits to chemical networks.",
            "Approximate majority analyses using tri-molecular chemical reaction networks.",
            "Preface.",
            "The impact of alphabet size on pattern complexity of maxmin-ømega cellular automata.",
            "Search space reduction of asynchrony immune cellular automata.",
            "Attractor landscapes in Boolean networks with firing memory: a theoretical study applied to genetic networks.",
            "Preface.",
            "Transcript design problem of oritatami systems.",
            "Self-assembly of 3-D structures using 2-D folding tiles.",
            "Hierarchical growth is necessary and (sometimes) sufficient to self-assemble discrete self-similar fractals.",
            "Forming tile shapes with simple robots.",
            "CRN++: Molecular programming language.",
            "Perception of cloth in assistive robotic manipulation tasks.",
            "A survey of cellular automata: types, dynamics, non-uniformity and applications.",
            "Hybrid ant colony optimization algorithm applied to the multi-depot vehicle routing problem.",
            "Preface.",
            "A pattern-driven solution for designing multi-objective evolutionary algorithms.",
            "A novel context-free grammar for the generation of PSO algorithms.",
            "Population-based bio-inspired algorithms for cluster ensembles optimization.",
            "A proposal for tuning the α parameter in Cα C-integrals for application in fuzzy rule-based classification systems.",
            "Swarm optimization clustering methods for opinion mining.",
            "A proposal of quantum data representation to improve the discrimination power.",
            "Molecular computing for Markov chains.",
            "A class of discrete dynamical systems with properties of both cellular automata and L-systems.",
            "Preface.",
            "A survey on traffic optimization problem using biologically inspired techniques.",
            "Scheduling for airport baggage transport vehicles based on diversity enhancement genetic algorithm.",
            "Quantum ant colony optimization algorithm for AGVs path planning based on Bloch coordinates of pheromones.",
            "A new multi-stage perturbed differential evolution with multi-parameter adaption and directional difference.",
            "Ensemble particle swarm optimization and differential evolution with alternative mutation method.",
            "Multi-source, multi-object and multi-domain (M-SOD) electromagnetic interference system optimised by intelligent optimisation approaches.",
            "Optimal shape design of an autonomous underwater vehicle based on multi-objective particle swarm optimization.",
            "Periodic motion generation for the impactless biped walking up slopes via genetic algorithm.",
            "Preface.",
            "Sequentializing cellular automata.",
            "Glider automorphisms and a finitary Ryan's theorem for transitive subshifts of finite type.",
            "Universal logic elements constructed on the Turing Tumble.",
            "Hierarchies and undecidability results for iterative arrays with sparse communication.",
            "Joint optimization of the high-end equipment development task process and resource allocation.",
            "A binary monkey search algorithm variation for solving the set covering problem.",
            "The role of tessellation intersection in staggered quantum walks."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2019",
        "info": "Volume 18, 2019",
        "count": 69,
        "papers": [
            "NACO special issue editorial.",
            "Erratum to: NACO special issue editorial.",
            "Cellular automata modelling of slime mould actin network signalling.",
            "Goal-directed navigation based on path integration and decoding of grid cells in an artificial neural network.",
            "Challenges in cooperative coevolution of physically heterogeneous robot teams.",
            "Evolving the process of a virtual composer.",
            "Preface.",
            "Real-time computability of real numbers by chemical reaction networks.",
            "Self-assembly of 4-sided fractals in the Two-Handed Tile Assembly Model.",
            "Self-assembly of shapes at constant scale using repulsive forces.",
            "Verification in staged tile self-assembly.",
            "Computing with chemical reaction networks: a tutorial.",
            "A multi-population evolution stratagy and its application in low area/power FSM synthesis.",
            "Migration policies in dynamic island models.",
            "Particle computation: complexity, algorithms, and logic.",
            "How to 'find' an error minimized genetic code: neutral emergence as an alternative to direct Darwinian selection for evolutionary optimization.",
            "Correction to: Interactive computations: toward risk management in interactive intelligent systems.",
            "Preface.",
            "Accelerating bioinspired lateral interaction in accumulative computation for real-time moving object detection with graphics processing units.",
            "Boost particle swarm optimization with fitness estimation.",
            "New perspectives on the optimal placement of detectors for suicide bombers using metaheuristics.",
            "KLN, a new biological koniocortex based unsupervised neural network: competitive results on credit scoring.",
            "Automatically obtaining a cellular automaton scheme for modeling protein folding using the FCC model.",
            "Preface.",
            "Tabu search algorithms for minimizing total completion time on a single machine with an actual time-dependent learning effect.",
            "Reconstructing gene regulatory networks with a memetic-neural hybrid based on fuzzy cognitive maps.",
            "Multiobjective sorting-based learning particle swarm optimization for continuous optimization.",
            "Discovery of conserved regions in DNA sequences by Artificial Bee Colony (ABC) algorithm based methods.",
            "Andean Condor Algorithm for cell formation problems.",
            "Simplifying the role of signals in tile self-assembly.",
            "Discretization of continuous-time quantum walks via the staggered model with Hamiltonians.",
            "Preface.",
            "A universal non-conservative reversible elementary triangular partitioned cellular automaton that shows complex behavior.",
            "Remarks on the cellular automaton global synchronisation problem: deterministic versus stochastic models.",
            "Cellular automata and finite groups.",
            "Cellular automata on group sets and the uniform Curtis-Hedlund-Lyndon theorem.",
            "Waiting for the rapture: What can we do with computers to (hopefully) witness the emergence of life?",
            "UCNC 2018 special issue editorial.",
            "The alchemy of computation: designing with the unknown.",
            "Optimal staged self-assembly of linear assemblies.",
            "Quantum information processing in the neighborhood of a black hole.",
            "Computational completeness of simple semi-conditional insertion-deletion systems of degree (2, 1).",
            "Perturbations and phase transitions in swarm optimization algorithms.",
            "Variants of P systems with activation and blocking of rules.",
            "Enhancing particle swarm optimization with binary quantum wave modulation and joint guiding forces.",
            "A membrane computing framework for self-reconfigurable robots.",
            "A quantum-inspired vortex search algorithm with application to function optimization.",
            "Correction to: Granular computing in mosaicing of images from capsule endoscopy.",
            "To the special Issue on \"Metaheuristics for optimization of complex process engineering\".",
            "A proactive scheduling approach to steel rolling process with stochastic machine breakdown.",
            "Solving dynamic economic emission dispatch problem considering wind power by multi-objective differential evolution with ensemble of selection method.",
            "New measures for comparing optimization algorithms on dynamic optimization problems.",
            "A regularization-reinforced DBN for digital recognition.",
            "A hybrid instance-intensive workflow scheduling method in private cloud environment.",
            "A dynamic SVR-ARMA model with improved fruit fly algorithm for the nonlinear fiber stretching process.",
            "A decomposition based multiobjective genetic algorithm with adaptive multipopulation strategy for flowshop scheduling problem.",
            "Hyperpath-based vehicle routing and scheduling method in time-varying networks for airport shuttle service.",
            "Self-adaptive fruit fly optimizer for global optimization.",
            "On an integrated approach to resilient transportation systems in emergency situations.",
            "Preface.",
            "State-efficient realization of fault-tolerant FSSP algorithms.",
            "Optimal and suboptimal regional control of probabilistic cellular automata.",
            "Lattice-based versus lattice-free individual-based models: impact on coexistence in competitive communities.",
            "A cellular automata based approach to track salient objects in videos.",
            "Turns of different angles and discrete-continuous pedestrian dynamics model.",
            "An overview of quantum cellular automata.",
            "A new fixed point theorem in domain theory.",
            "Data clustering based on quantum synchronization.",
            "An enhanced genetic algorithm for constrained knapsack problems in dynamic environments."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2018",
        "info": "Volume 17, 2018",
        "count": 63,
        "papers": [
            "Preface.",
            "The importance of thermodynamics for molecular systems, and the importance of molecular systems for thermodynamics.",
            "Resiliency to multiple nucleation in temperature-1 self-assembly.",
            "Hierarchical self-assembly of fractals with signal-passing tiles.",
            "Nondeterministic seedless oritatami systems and hardness of testing their equivalence.",
            "On the runtime of universal coating for programmable matter.",
            "Democratic, existential, and consensus-based output conventions in stable computation by chemical reaction networks.",
            "Chemical reaction network designs for asynchronous logic circuits.",
            "Programming discrete distributions with chemical reaction networks.",
            "Design methods for 3D wireframe DNA nanostructures.",
            "Petri-net-based 2D design of DNA walker circuits.",
            "A coarse-grained model captures the temporal evolution of DNA nanotube length distributions.",
            "Interference as a computational resource: a tutorial.",
            "Preface.",
            "Reachability problems for continuous chemical reaction networks.",
            "An all-optical soliton FFT computational arrangement in the 3NLSE-domain.",
            "Investigations on the power of matrix insertion-deletion systems with small sizes.",
            "Model-based computation.",
            "Language recognition power and succinctness of affine automata.",
            "Preface.",
            "Extended spiking neural P systems with white hole rules and their red-green variants.",
            "A uniform family of tissue P systems with protein on cells solving 3-coloring in linear time.",
            "Some new results of P colonies with bounded parameters.",
            "On simulating cooperative transition P systems in evolution-communication P systems with energy.",
            "Process calculi for biological processes.",
            "Memetic algorithm based on extension step and statistical filtering for large-scale capacitated arc routing problems.",
            "Synchronism versus asynchronism in monotonic Boolean automata networks.",
            "The influence of computational traits on the natural selection of the nervous system.",
            "Combinatorial game associated to the one dimensional Schelling's model of social segregation.",
            "Erratum to: Computing maximal and minimal trap spaces of Boolean networks.",
            "Preface.",
            "A design of generalized minimum-state-change FSSP algorithms and their implementations.",
            "Revisiting the cutting of the firing squad synchronization.",
            "Affine continuous cellular automata solving the fixed-length density classification problem.",
            "Toward a boundary regional control problem for Boolean cellular automata.",
            "A cryptographic and coding-theoretic perspective on the global rules of cellular automata.",
            "A universal Brownian cellular automaton with 3 states and 2 rules.",
            "Influence of cell mechanics and proliferation on the buckling of simulated tissues using a vertex model.",
            "GTVcut for neuro-radiosurgery treatment planning: an MRI brain cancer seeded image segmentation method based on a cellular automata model.",
            "Decentralized estimation of forest fire spread using reactive and cognitive mobile sensors.",
            "Simulations of flow-like landslides invading urban areas: a cellular automata approach with SCIDDICA.",
            "Shoreline evolution: GIS, remote sensing and cellular automata modelling.",
            "A tutorial on multiobjective optimization: fundamentals and evolutionary methods.",
            "Balanced-evolution genetic algorithm for combinatorial optimization problems: the general outline and implementation of balanced-evolution strategy based on linear diversity index.",
            "An improved particle swarm optimization algorithm based on comparative judgment.",
            "A portfolio of classification problems by one-dimensional cellular automata, over cyclic binary configurations and parallel update.",
            "Erratum to: A multi-objective optimization method based on discrete bacterial algorithm for environmental/economic power dispatch.",
            "Preface.",
            "Computational complexity of atomic chemical reaction networks.",
            "DNA-templated synthesis optimization.",
            "Automated analysis of tethered DNA nanostructures using constraint solving.",
            "A stochastic approach to shortcut bridging in programmable matter.",
            "A minimal requirement for self-assembly of lines in polylogarithmic time.",
            "Preface.",
            "Computing with biological switches and clocks.",
            "Bacterial colonies as complex adaptive systems.",
            "Small networks of polarized splicing processors are universal.",
            "Ecological effects of cellular computing in microbial populations.",
            "Bonding calculus.",
            "Scaling up genetic circuit design for cellular computing: advances and prospects.",
            "Rough sets: past, present, and future.",
            "A many-objective evolutionary algorithm based on hyperplane projection and penalty distance selection.",
            "Dynamic small world particle swarm optimizer for function optimization."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2017",
        "info": "Volume 16, 2017",
        "count": 50,
        "papers": [
            "Preface.",
            "An improved dynamic deployment method for wireless sensor network based on multi-swarm particle swarm optimization.",
            "A new multi-agent system to simulate the foraging behaviors of Physarum.",
            "Particle swarm optimization with dynamic random population topology strategies for a generalized portfolio selection problem.",
            "A population-based clustering technique using particle swarm optimization and k-means.",
            "University course timetabling using a new ecogeography-based optimization algorithm.",
            "Diversity increasing methods in PBIL-application to power system controller design: a comparison.",
            "A new genetic algorithm based on modified Physarum network model for bandwidth-delay constrained least-cost multicast routing.",
            "Evolving cooperation in spatial population with punishment by using PSO algorithm.",
            "Dynamic vehicle routing with time windows in theory and practice.",
            "An improved extremal optimization based on the distribution knowledge of candidate solutions.",
            "Membrane automata for modeling biomolecular processes.",
            "Time series forecasting with genetic programming.",
            "On the overlap assembly of strings and languages.",
            "Bio-inspired population-based meta-heuristics for problem solving.",
            "Self-healing strategies for memetic algorithms in unstable and ephemeral computational environments.",
            "Evolved synaptic delay based neural controllers for walking patterns in hexapod robotic structures.",
            "Solving the non-unicost set covering problem by using cuckoo search and black hole optimization.",
            "Genetic algorithms as a tool for structuring collaborative groups.",
            "Online control of enumeration strategies via bat algorithm and black hole optimization.",
            "Preface.",
            "Design of nucleic acid strands with long low-barrier folding pathways.",
            "Dominance and deficiency for Petri nets and chemical reaction networks.",
            "Reflections on tiles (in self-assembly).",
            "Scaled pier fractals do not strictly self-assemble.",
            "A dynamic-edge ACS algorithm for continuous variables problems.",
            "Dynamical regimes in non-ergodic random Boolean networks.",
            "Preface.",
            "Computing the periods of preimages in surjective cellular automata.",
            "Shrinking one-way cellular automata.",
            "A cellular automaton for blocking queen games.",
            "Independent finite automata on Cayley graphs.",
            "Activity in Boolean networks.",
            "Evolutionary computing in recommender systems: a review of recent research.",
            "Minimal reversible circuit synthesis on a DNA computer.",
            "Effectiveness of new Multiple-PSO based Membrane Optimization Algorithms on CEC 2014 benchmarks and Iris classification.",
            "Directed evolution of biocircuits using conjugative plasmids and CRISPR-Cas9: design and in silico experiments.",
            "Preface.",
            "Memetic electromagnetism algorithm for surface reconstruction with rational bivariate Bernstein basis functions.",
            "Cultural particle swarm optimization algorithms for uncertain multi-objective problems with interval parameters.",
            "A multi-objective optimization method based on discrete bacterial algorithm for environmental/economic power dispatch.",
            "Semi-supervised learning for question classification in CQA.",
            "Task-oriented hierarchical control architecture for swarm robotic system.",
            "A Swarm Intelligence Based (SIB) method for optimization in designs of experiments.",
            "A multi-objective ACO for operating room scheduling optimization.",
            "Semi-self-adaptive harmony search algorithm.",
            "Adaptive α-stable differential evolution in numerical optimization.",
            "Erratum to: Adaptive α-stable differential evolution in numerical optimization.",
            "Multi-objective differential evolution based on normalization and improved mutation strategy.",
            "Adaptive multimeme algorithm for flexible job shop scheduling problem."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2016",
        "info": "Volume 15, 2016",
        "count": 54,
        "papers": [
            "Preface.",
            "Synthetic biology of cell signaling.",
            "Halting the hallmarks: a cellular automaton model of early cancer growth inhibition.",
            "Pseudo-inversion: closure properties and decidability.",
            "Producibility in hierarchical self-assembly.",
            "Computational completeness of complete, star-like, and linear hybrid networks of evolutionary processors with a small number of processors.",
            "Doubles and negatives are positive (in self-assembly).",
            "On string languages generated by sequential spiking neural P systems based on the number of spikes.",
            "Counter machines and crystallographic structures.",
            "Fast arithmetic in algorithmic self-assembly.",
            "More on quantum, stochastic, and pseudo stochastic languages with few states.",
            "Size-separable tile self-assembly: a tight bound for temperature-1 mismatch-free systems.",
            "A quantum particle swarm optimization for the 0-1 generalized knapsack sharing problem.",
            "A review of message passing algorithms in estimation of distribution algorithms.",
            "Evolution of new algorithms for the binary knapsack problem.",
            "Preface.",
            "Emulating cellular automata in chemical reaction-diffusion networks.",
            "The computational capability of chemical reaction automata.",
            "On decidability and closure properties of language classes with respect to bio-operations.",
            "Minimal output unstable configurations in chemical reaction networks and deciders.",
            "Probability 1 computation with chemical reaction networks.",
            "Classical, quantum and biological randomness as relative unpredictability.",
            "Physarum in silicon: the Greek motorways study.",
            "Adaptive niche quantum-inspired immune clonal algorithm.",
            "Development of firefly algorithm via chaotic sequence and population diversity to enhance the image contrast.",
            "Global memory schemes for dynamic optimization.",
            "On the model updating operators in univariate estimation of distribution algorithms.",
            "Preface: pattern recognition and mining.",
            "Neighborhood granules and rough rule-base in tracking.",
            "Levy distributed parameter control in differential evolution for numerical optimization.",
            "Detecting outliers in categorical data through rough clustering.",
            "Anytime pack search.",
            "Software cost estimation based on modified K-Modes clustering Algorithm.",
            "A bio inspired and trust based approach for clustering in WSN.",
            "A fast evaluation method for RTS game strategy using fuzzy extreme learning machine.",
            "Gene expression and protein-protein interaction data for identification of colon cancer related genes using f-information measures.",
            "Interactive computations: toward risk management in interactive intelligent systems.",
            "Partition based real-valued encoding scheme for evolutionary algorithms.",
            "Projections onto convex sets parameter estimation through harmony search and its application for image restoration.",
            "A new approach for solving set covering problem using jumping particle swarm optimization method.",
            "Preface.",
            "Simulating P systems with membrane dissolution in a chemical calculus.",
            "Notes on spiking neural P systems and finite automata.",
            "A class of restricted P colonies with string environment.",
            "Monodirectional P systems.",
            "Parallel simulation of Population Dynamics P systems: updates and roadmap.",
            "On the universality of purely catalytic P systems.",
            "An improved dynamic membrane evolutionary algorithm for constrained engineering design problems.",
            "P systems based computing polynomials: design and formal verification.",
            "A multi-objective membrane algorithm guided by the skin membrane.",
            "Activatable tiles for compact robust programmable molecular assembly and other applications.",
            "An improved multi-objective evolutionary algorithm for simultaneously detecting separated and overlapping communities.",
            "Sensor network optimization of gearbox based on dependence matrix and improved discrete shuffled frog leaping algorithm.",
            "Modeling biological gradient formation: combining partial differential equations and Petri nets."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2015",
        "info": "Volume 14, 2015",
        "count": 56,
        "papers": [
            "CoSMoS special issue editorial.",
            "Understanding self-organized regularities in healthcare services based on autonomy oriented modeling.",
            "A tipping point in 300 years of banking? A conceptual simulation of the British banking system.",
            "Non-standard discretization of biological models.",
            "Filling gaps in simulation of complex systems: the background and motivation for CoSMoS.",
            "Principled simulation of cell proliferation dynamics using the CoSMoS approach.",
            "Environment orientation: a structured simulation approach for agent-based complex systems.",
            "Utilising a simulation platform to understand the effect of domain model assumptions.",
            "Understanding tissue morphology: model repurposing using the CoSMoS process.",
            "Advantages of Model Driven Engineering for studying complex systems.",
            "Simulation methods for quantum walks on graphs applied to formal language recognition.",
            "Using a simulated Wolbachia infection mechanism to improve multi-objective evolutionary algorithms.",
            "A novel hybrid artificial bee colony algorithm with crossover operator for numerical optimization.",
            "On the complexity of occurrence and convergence problems in reaction systems.",
            "Preface.",
            "DNA walker circuits: computational potential, design, and verification.",
            "Leaderless deterministic chemical reaction networks.",
            "Parallel computation using active self-assembly.",
            "Signal transmission across tile assemblies: 3D static tiles simulate active self-assembly by 2D signal-passing tiles.",
            "Exponential replication of patterns in the signal tile assembly model.",
            "3-color bounded patterned self-assembly.",
            "Staged self-assembly and polyomino context-free grammars.",
            "Empirical modeling using genetic programming: a survey of issues and approaches.",
            "The parameters setting of a changing range genetic algorithm.",
            "Algorithms and models for complex natural systems.",
            "Combining flux balance analysis and model checking for metabolic network validation and analysis.",
            "A hybrid method for inversion of 3D DC resistivity logging measurements.",
            "An evolutionary procedure for inferring MP systems regulation functions of biological networks.",
            "Bayesian versus data driven model selection for microarray data.",
            "A genome analysis based on repeat sharing gene networks.",
            "Topology driven modeling: the IS metaphor.",
            "Optical SuperComputing: Preface to special issue.",
            "Holographic parallel processor for calculating Kronecker product.",
            "Computation with optical sensitive sheets.",
            "To what extent is zero energy computing feasible?",
            "Compressive scanning of an object signature.",
            "Incorporating user preferences in many-objective optimization using relation ε-preferred.",
            "Logic circuits from zero forcing.",
            "DNA origami and the complexity of Eulerian circuits with turning costs.",
            "Foreword: asynchronous behavior of cellular automata and discrete models.",
            "Local structure approximation as a predictor of second-order phase transitions in asynchronous cellular automata.",
            "Supercritical probabilistic cellular automata: how effective is the synchronous updating?",
            "Computing maximal and minimal trap spaces of Boolean networks.",
            "Asynchronous Boolean networks and hereditarily bijective maps.",
            "Minimization and equivalence in multi-valued logical models of regulatory networks.",
            "Preface.",
            "Granular computing in mosaicing of images from capsule endoscopy.",
            "Knowledge representation of motor activity of patients with Parkinson's disease.",
            "Hardware implementation of evolutionary algorithms using dynamic reconfiguration technology.",
            "Text comprehension and the computational mind-agencies.",
            "Cognition-inspired route evaluation using mobile phone data.",
            "Random choice in amorphous processes.",
            "Dynamic cluster in particle swarm optimization algorithm.",
            "Time-free solution to SAT problem by P systems with active membranes and standard cell division rules.",
            "Multipartite entanglement in Grover's search algorithm.",
            "State complexity of deterministic Watson-Crick automata and time varying Watson-Crick automata."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2014",
        "info": "Volume 13, 2014",
        "count": 45,
        "papers": [
            "Computation of the travelling salesman problem by a shrinking blob.",
            "Quadratic interpolation based orthogonal learning particle swarm optimization algorithm.",
            "Multi-objective evolutionary for synthetic aperture radar image segmentation with non-local means denoising.",
            "Digital FIR filter design using fitness based hybrid adaptive differential evolution with particle swarm optimization.",
            "A new gravitational image edge detection method using edge explorer agents.",
            "Chaotic Evolution: fusion of chaotic ergodicity and evolutionary iteration for optimization.",
            "The Endocrine Control Evolutionary Algorithm: an extensible technique for optimization.",
            "An adaptive genetic algorithm for parameter estimation of biological oscillator models to achieve target quantitative system response.",
            "Non conventional computing and constraint optimization.",
            "Virtual player design using self-learning via competitive coevolutionary algorithms.",
            "Robust swarm optimisation for fuzzy open shop scheduling.",
            "On balance and dynamism in procedural content generation with self-adaptive evolutionary algorithms.",
            "Generation of classification trees from variable weighted features.",
            "A genetic algorithm for job-shop scheduling with operators enhanced by weak Lamarckian evolution and search space narrowing.",
            "Preface.",
            "An introduction to tile-based self-assembly and a survey of recent results.",
            "A self-adaptive communication strategy for flocking in stationary and non-stationary environments.",
            "Symbol representations and signal dynamics in evolving droplet computers.",
            "Generating and accepting P systems with minimal left and right insertion and deletion.",
            "On the complexity of nonuniform wavelength-based machine.",
            "Preface.",
            "An investigation into irreducible autocatalytic sets and power law distributed catalysis.",
            "Bounded noises as a natural tool to model extrinsic fluctuations in biomolecular networks.",
            "A local landscape mapping method for protein structure prediction in the HP model.",
            "An ensemble evolutionary constraint-based approach to understand the emergence of metabolic phenotypes.",
            "A synthetic biology approach to bio-chem-ICT: first moves towards chemical communication between synthetic and natural cells.",
            "Identification of components in biochemical pathways: extensive application to SBML models.",
            "A stochastic model of catalytic reaction networks in protocells.",
            "A cognitive-inspired algorithm for growing networks.",
            "Communication based dynamic role allocation in a group of homogeneous robots.",
            "Morphogenesis through moving membranes.",
            "Immune clonal coevolutionary algorithm for dynamic multiobjective optimization.",
            "Preface.",
            "Quantum Cryptography II: How to re-use a one-time pad safely even if P=NP.",
            "Entanglement sudden death: a threat to advanced quantum key distribution?",
            "How to re-use a one-time pad safely and almost optimally even if P = NP.",
            "Cryptographic encryption scheme based on metastable excited nuclei.",
            "Preface.",
            "Reachability bounds for chemical reaction networks and strand displacement systems.",
            "Deterministic function computation with chemical reaction networks.",
            "Simulating a burnt-bridges DNA motor with a coarse-grained DNA model.",
            "Probabilistic reasoning with a Bayesian DNA device based on strand displacement.",
            "Enforcing logical delays in DNA computing systems.",
            "A DNA based molecular logic gate capable of a variety of logical operations.",
            "Modeling scalable pattern generation in DNA reaction networks."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2013",
        "info": "Volume 12, 2013",
        "count": 51,
        "papers": [
            "Preface.",
            "Continuous input nonlocal games.",
            "Implausible consequences of superstrong nonlocality.",
            "Oblivious transfer and quantum channels as communication resources.",
            "Experimental multipartner quantum communication complexity employing just one qubit.",
            "Preface: nature inspired solutions for high performance computing.",
            "Protein structure prediction using distributed parallel particle swarm optimization.",
            "Description and composition of bio-inspired design patterns: a complete overview.",
            "The grid, the load and the gradient - A bio-inspired approach to load balancing.",
            "Goal distance estimation for automated planning using neural networks and support vector machines.",
            "A novel text and image encryption method based on chaos theory and DNA computing.",
            "A preference multi-objective optimization based on adaptive rank clone and differential evolution.",
            "Preface.",
            "Cloud-based evolutionary algorithms: An algorithmic study.",
            "Designing and testing a pool-based evolutionary algorithm.",
            "Customizable execution environments for evolutionary computation using BOINC + virtualization.",
            "Dealing with hardware heterogeneity: a new parallel search model.",
            "A parallel evolutionary algorithm for technical market indicators optimization.",
            "Preface.",
            "Computing maximal Kleene closures that are embeddable in a given subword-closed language.",
            "Graph-theoretic formalization of hybridization in DNA sticker complexes.",
            "Improved DNA-sticker arithmetic: tube-encoded-carry, Logarithmic Number System and Monte-Carlo methods.",
            "One-dimensional staged self-assembly.",
            "Cooperative linear cargo transport with molecular spiders.",
            "Fault tolerant network design inspired by Physarum polycephalum.",
            "Turing patterns with Turing machines: emergence and low-level structure formation.",
            "Foreword: cellular automata and applications.",
            "Computation of functions on n bits by asynchronous clocking of cellular automata.",
            "Solving the parity problem in one-dimensional cellular automata.",
            "Synchronous cellular automata-based scheduler initialized by heuristic and modeled by a pseudo-linear neighborhood.",
            "Explicit routing schemes for implementation of cellular automata on processor arrays.",
            "Minimal and almost minimal reaction systems.",
            "Amorphous computing: examples, mathematics and theory.",
            "Using transition systems to describe and predict the behaviour of structured excitable media.",
            "On modeling contention for shared caches in multi-core processors with techniques from ecology.",
            "General patterns of interaction in stochastic fusion.",
            "Special issue on the frontiers of natural computing.",
            "Consideration of mobile DNA: new forms of artificial genetic regulatory networks.",
            "Biochemical connectionism.",
            "Geiringer theorems: from population genetics to computational intelligence, memory evolutive systems and Hebbian learning.",
            "Expanding the landscape of biological computation with synthetic multicellular consortia.",
            "Exploring programmable self-assembly in non-DNA based molecular computing.",
            "A review of morphogenetic engineering.",
            "Foreword: asynchronous cellular automata and applications.",
            "Towards intrinsically universal asynchronous CA.",
            "First steps on asynchronous lattice-gas models with an application to a swarming rule.",
            "m-Asynchronous cellular automata: from fairness to quasi-fairness.",
            "An experimental study of noise and asynchrony in elementary cellular automata with sampling compensation.",
            "On computational complexity of graph inference from counting.",
            "Kernel clustering using a hybrid memetic algorithm.",
            "Modeling membrane systems using colored stochastic Petri nets."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2012",
        "info": "Volume 11, 2012",
        "count": 67,
        "papers": [
            "Preface.",
            "The Deutsch-Jozsa problem: de-quantisation and entanglement.",
            "Partitioned quantum cellular automata are intrinsically universal.",
            "Spatial search using the discrete time quantum walk.",
            "A survey of recursive analysis and Moore's notion of real computation.",
            "Supertasks do not increase computational power.",
            "Amorphous computing: a research agenda for the near future.",
            "Editorial for special issue on unconventional computation.",
            "A computational journey into the mind.",
            "Quantum computation with write-only memory.",
            "Sequential and maximally parallel multiset rewriting: reversibility and determinism.",
            "Faster synchronization in P systems.",
            "A Chaitin $$\\Upomega$$ number based on compressible strings.",
            "Solving problems with natural computing.",
            "Biocomputing: an insight from linguistics.",
            "On reverse engineering in the cognitive and brain sciences.",
            "A competent memetic algorithm for complex scheduling.",
            "Topological Active Volume 3D segmentation model optimized with genetic approaches.",
            "Neural computation with cellular cultures.",
            "Foreword.",
            "Simple evolution of complex crystal species.",
            "Self assembly of rectangular shapes on concentration programming and probabilistic tile assembly models.",
            "Efficient 3-SAT algorithms in the tile assembly model.",
            "Design of an artificial functional nanomaterial with high recognition ability.",
            "Preface.",
            "Fermat's last theorem and chaoticity.",
            "The physical Church thesis as an explanation of the Galileo thesis.",
            "Membrane system models for super-Turing paradigms.",
            "How much contextuality?",
            "Foreword: asynchronous cellular automata and nature-inspired computation.",
            "Asynchronous cellular automata and dynamical properties.",
            "An analysis of different types and effects of asynchronicity in cellular automata update schemes.",
            "A study on learning robustness using asynchronous 1D cellular automata rules.",
            "Grids and universal computations on one-dimensional cellular automata.",
            "On Cellular Automata rules of molecular arrays.",
            "Hierarchical self assembly of patterns from the Robinson tilings: DNA tile design in an enhanced Tile Assembly Model.",
            "Comparison of different methods to analyze a DNA computing library using the polymerase chain reaction.",
            "Foreword.",
            "A genetic algorithm for the Zen Puzzle Garden game.",
            "Stateless multicounter 5′ → 3′ Watson-Crick automata: the deterministic case.",
            "Comparing simulation algorithms for multienvironment probabilistic P systems over a standard virtual ecosystem.",
            "Designing a new software tool for Digital Imagery based on P systems.",
            "Using enzymatic numerical P systems for modeling mobile robot controllers.",
            "Towards collaborative feature extraction for face recognition.",
            "Emergence of synchronicity in a self-organizing spiking neuron network: an approach via genetic algorithms.",
            "Preface: EmergeNET4: engineering emergence.",
            "Degeneracy and networked buffering: principles for supporting emergent evolvability in agile manufacturing systems.",
            "Evolutionary mechanics: new engineering principles for the emergence of flexibility in a dynamic and uncertain world.",
            "To boldly go: an occam-π mission to engineer emergence.",
            "Programming and evolving physical self-assembling systems in three dimensions.",
            "The Gestalt heuristic: emerging abstraction to improve combinatorial search.",
            "Parallel predator-prey interaction for evolutionary multi-objective optimization.",
            "Step-wise tile assembly with a constant number of tile types.",
            "Preface.",
            "Probing robustness of cellular automata through variations of asynchronous updating.",
            "Conserved quantities in discrete dynamics: what can be recovered from Noether's theorem, how, and why?",
            "Computation with multiple CTCs of fixed length and width.",
            "Networks of evolutionary processors: computationally complete normal forms.",
            "Abstract geometrical computation 7: geometrical accumulations and computably enumerable real numbers.",
            "Geometric computations by broadcasting automata.",
            "New solutions for disjoint paths in P systems.",
            "Extended Watson-Crick L systems with regular trigger languages and restricted derivation modes.",
            "Computing with planar toppling domino arrangements.",
            "Cellular automata-based systems with fault-tolerance.",
            "A bio-inspired distributed algorithm to improve scheduling performance of multi-broker grids.",
            "A membrane algorithm with quantum-inspired subalgorithms and its application to image processing.",
            "Why 'GSA: a gravitational search algorithm' is not genuinely based on the law of gravity."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2011",
        "info": "Volume 10, 2011",
        "count": 76,
        "papers": [
            "Foreword.",
            "Spatial P systems.",
            "On aggregation in multiset-based self-assembly of graphs.",
            "A computational modeling for real ecosystems based on P systems.",
            "Data analysis pipeline from laboratory to MP models.",
            "The quantification of pollutants in drinking water by use of artificial neural networks.",
            "On discrete models and immunological algorithms for protein structure prediction.",
            "Towards a neighborhood simplification of tile systems: From Moore to quasi-linear dependencies.",
            "Biocircuit design through engineering bacterial logic gates.",
            "Computing transparently: the independent sets in a graph.",
            "A review of the nondeterministic waiting time algorithm.",
            "An empirical evaluation of P system testing techniques.",
            "P systems with active membranes: trading time for space.",
            "Editorial for special issue on the interaction between computation and biology.",
            "An immune-inspired approach to qualitative system identification of biological pathways.",
            "Grammar-based immune programming.",
            "Priming: making the reaction to intrusion or fault predictable.",
            "A hybrid approach for learning concept hierarchy from Malay text using artificial immune network.",
            "An immune system inspired clustering and classification method to detect critical areas in electrical power networks.",
            "Forward.",
            "Distributed agreement in tile self-assembly.",
            "The effect of malformed tiles on tile assemblies within the kinetic tile assembly model.",
            "DNA chips for species identification and biological phylogenies.",
            "NP-completeness of the energy barrier problem without pseudoknots and temporary arcs.",
            "Strand algebras for DNA computing.",
            "Complexity-preserving simulations among three variants of accepting networks of evolutionary processors.",
            "Design of a biomolecular device that executes process algebra.",
            "A renewable, modular, and time-responsive DNA circuit.",
            "An improved multi-agent genetic algorithm for numerical optimization.",
            "Evolutionary and population dynamics of 3 parents differential evolution (3PDE) using self-adaptive tuning methodologies.",
            "Friction-based sorting.",
            "Solving the generalized Subset Sum problem with a light based device.",
            "Optimization of supply diversity for the self-assembly of simple objects in two and three dimensions.",
            "Efficient algorithms for self assembling non-rectangular nano structures.",
            "A simple mass-action model for the eukaryotic heat shock response and its mathematical validation.",
            "The computational power of membrane systems under tight uniformity conditions.",
            "Preface: Petri nets for Systems and Synthetic Biology.",
            "Petri nets as a framework for the reconstruction and analysis of signal transduction pathways and regulatory networks.",
            "The combinatorics of modeling and analyzing biological systems.",
            "A Petri net representation of Bayesian message flows: importance of Bayesian networks for biological applications.",
            "Error-correcting Petri nets.",
            "Petri net representation of multi-valued logical regulatory graphs.",
            "Boundedness analysis for open Chemical Reaction Networks with mass-action kinetics.",
            "Editorial: Computing with biomolecules.",
            "Mutual mobile membranes with objects on surface.",
            "Theoretical and computational properties of transpositions.",
            "Algorithmic applications of XPCR.",
            "(Tissue) P systems working in the k-restricted minimally or maximally parallel transition mode.",
            "Computational power of insertion-deletion (P) systems with rules of size two.",
            "Self-assembly of decidable sets.",
            "A software tool for generating graphics by means of P systems.",
            "Evolutionary computation approaches to the Curriculum Sequencing problem.",
            "Electrostatic field framework for supervised and semi-supervised learning from incomplete data.",
            "Padlock probe-mediated qRT-PCR for DNA computing answer determination.",
            "Graph multiset transformation: a new framework for massively parallel computation inspired by DNA computing.",
            "Preface: Petri nets for Systems and Synthetic Biology.",
            "A discrete Petri net model for cephalostatin-induced apoptosis in leukemic cells.",
            "Quantitative evaluation of time-dependent Petri nets and applications to biochemical networks.",
            "Stochastic Petri net models of Ca2+ signaling complexes and their analysis.",
            "Petri net models for the semi-automatic construction of large scale biological networks.",
            "Hybrid Petri net based modeling for biological pathway simulation.",
            "On stoichiometry for the assembly of flexible tile DNA complexes.",
            "Digital Ecosystems: Ecosystem-Oriented Architectures.",
            "Approximating Mexican highways with slime mould.",
            "Introduction.",
            "Greedy versus social: resource-competing oscillator network as a model of amoeba-based neurocomputer.",
            "Unconventional complexity measures for unconventional computers.",
            "Abstract geometrical computation 5: embedding computable analysis.",
            "On the hierarchy of conservation laws in a cellular automaton.",
            "Computability in planar dynamical systems.",
            "Distributed quantum programming.",
            "Influences on the formation and evolution of Physarum polycephalum inspired emergent transport networks.",
            "Quantum value indefiniteness.",
            "Unwinding performance and power on Colossus, an unconventional computer.",
            "Improving convergence of evolutionary multi-objective optimization with local search: a concurrent-hybrid algorithm.",
            "Evolutionary high-dimensional QoS optimization for safety-critical utility communication networks."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2010",
        "info": "Volume 9, 2010",
        "count": 57,
        "papers": [
            "Special issue on Nature Inspired Cooperative Strategies for Optimisation (NICSO).",
            "Honey Bees Mating Optimization algorithm for large scale vehicle routing problems.",
            "Discrete Particle Swarm Optimization for the minimum labelling Steiner tree problem.",
            "A memetic algorithm for the generalized traveling salesman problem.",
            "Hybrid Functional Petri Nets as MP systems.",
            "Evolutionary swarm cooperative optimization in dynamic environments.",
            "Foreword.",
            "Polyomino-safe DNA self-assembly via block replacement.",
            "Robust self-assembly of graphs.",
            "Self-assembly of discrete self-similar fractals.",
            "Operon structure optimization by random self-assembly.",
            "Isothermal reactivating Whiplash PCR for locally programmable molecular computation.",
            "Experimental validation and optimization of signal dependent operation in whiplash PCR.",
            "Programmable reconfiguration of Physarum machines.",
            "Modelling programmed frameshifting with frameshift machines.",
            "Effect of parent selection and sibling rivalry on building-block assembly.",
            "When to use bit-wise neutrality.",
            "Foreword.",
            "Watson-Crick palindromes in DNA computing.",
            "Computation in Sofic Quantum Dynamical Systems.",
            "Algorithms on ensemble quantum computers.",
            "Bond computing systems: a biologically inspired and high-level dynamics model for pervasive computing.",
            "Representation before computation.",
            "Preface.",
            "Trace monoids with idempotent generators and measure-only quantum automata.",
            "On the regularity of circular splicing languages: a survey and new developments.",
            "Beyond evolutionary trees.",
            "Transducer generated arrays of robotic nano-arms.",
            "Deterministic and stochastic P systems for modelling cellular processes.",
            "On spiking neural P systems.",
            "Computing with energy and chemical reactions.",
            "Stochastic automated search methods in cellular automata: the discovery of tens of thousands of glider guns.",
            "A review of evolutionary and immune-inspired information filtering.",
            "Artificial Immune Systems: structure, function, diversity and an application to biclustering.",
            "Query expansion using an immune-inspired biclustering algorithm.",
            "Structure versus function: a topological perspective on immune networks.",
            "Neural network ensembles: immune-inspired approaches to the diversity of components.",
            "Swarm intelligence: the state of the art special issue of natural computing.",
            "Discrete and continuous optimization based on multi-swarm coevolution.",
            "A novel particle swarm niching technique based on extensive vector operations.",
            "A particle swarm optimization based memetic algorithm for dynamic optimization problems.",
            "BGSA: binary gravitational search algorithm.",
            "Multiobjective particle swarm optimization with nondominated local and global sets.",
            "Flocking based approach for data clustering.",
            "Preface to the Special Issue Unconventional Computing 2008.",
            "On the verification of membrane systems with dynamic structure.",
            "Quantum security in wireless sensor networks.",
            "On the computational complexity of spiking neural P systems.",
            "Output concepts for accelerated Turing machines.",
            "Automata and processes on multisets of communicating objects.",
            "Introduction to special issue on Optical SuperComputing.",
            "Optical solution for hard on average #P-complete instances (using exponential space for solving instances of the permanent).",
            "All-optical binary flip-flop with the help of Terahertz Optical Asymmetric Demultiplexer.",
            "Binary to modified trinary number system conversion and vice-versa for optical super computing.",
            "A relation by palindromic subwords.",
            "Petri nets for modelling metabolic pathways: a survey.",
            "A synthetic genetic circuit whose signal-response curve is temperature-tunable from band-detection to sigmoidal behaviour."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2009",
        "info": "Volume 8, 2009",
        "count": 48,
        "papers": [
            "Introduction to the special issue on learning classifier systems.",
            "Intrusion detection with evolutionary learning classifier systems.",
            "Imitation guided learning in learning classifier systems.",
            "A learning classifier system for mazes with aliasing clones.",
            "Observer-invariant histopathology using genetics-based machine learning.",
            "Light-based string matching.",
            "An evolutionary approach for achieving scalability with general regression neural networks.",
            "Performing DNA computation with RecA-mediated triple-stranded DNA structure.",
            "DNA splicing: computing by observing.",
            "Niching with derandomized evolution strategies in artificial and real-world landscapes.",
            "Nature-inspired learning and adaptive systems.",
            "Integrative connectionist learning systems inspired by nature: current models, future trends and challenges.",
            "A framework for machine learning based on dynamic physical fields.",
            "A survey on metaheuristics for stochastic combinatorial optimization.",
            "Negative correlation in incremental learning.",
            "Solving the subset-sum problem with a light-based device.",
            "Successful preparation and analysis of a 5-site 2-variable DNA library.",
            "Competition and evolution in virtual plant communities: a new modeling approach.",
            "Autopoiesis, the immune system, and adaptive information filtering.",
            "Introduction.",
            "From reaction-diffusion to Physarum computing.",
            "Quantum complementarity and logical indeterminacy.",
            "Abstract geometrical computation 3: black holes for classical and analog computing.",
            "Information processing with structured excitable medium.",
            "A new problem for rule following.",
            "General relativistic hypercomputing and foundation of mathematics.",
            "The computational status of physics.",
            "On the solution of trivalent decision problems by quantum state identification.",
            "Natural strategies for search.",
            "On codeword design in metric DNA spaces.",
            "Error suppression mechanisms for DNA tile self-assembly and their simulation.",
            "Foundations of r-contiguous matching in negative selection for anomaly detection.",
            "Non-conventional computing paradigms.",
            "Neural networks and quantum neurology: a speculative heuristic towards the formal architecture of psychism.",
            "Quantum computation and cryptography: an overview.",
            "Uniform solutions to SAT and Subset Sum by spiking neural P systems.",
            "Complexity aspects of polarizationless membrane systems.",
            "Genetic code optimality studied by means of simulated evolution and within the coevolution theory of the canonical code organization.",
            "Neural computation as adaptive association process in cortical sensorial maps.",
            "Adaptation, anticipation and rationality in natural and artificial systems: computational paradigms mimicking nature.",
            "P-systems and X-machines.",
            "A Petri net model for membrane systems with dynamic structure.",
            "Efficient simulation of tissue-like P systems by transition cell-like P systems.",
            "Complexity of evolution in maximum cooperative P systems.",
            "Transforming communicating X-machines into P systems.",
            "Finite state based testing of P systems.",
            "A photosynthetic process modelled by a metabolic P system.",
            "Rule-based programming for integrative biological modeling."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2008",
        "info": "Volume 7, 2008",
        "count": 40,
        "papers": [
            "Foreword.",
            "On spiking neural P systems and partially blind counter machines.",
            "Mapping non-conventional extensions of genetic programming.",
            "Top-Down modulation of neural responses in visual perception: a computational exploration.",
            "Solving the Hamiltonian path problem with a light-based computer.",
            "On the universality of peptide computing.",
            "Lower bounds on the computational power of an optical model of computation.",
            "A review of particle swarm optimization. Part II: hybridisation, combinatorial, multicriteria and constrained optimization, and indicative applications.",
            "Doubler and linearizer: an approach toward a unified theory for molecular computing based on DNA complementarity.",
            "Foreword.",
            "Spiking neural P systems with extended rules: universality and languages.",
            "On length-separating test tube systems.",
            "On the complexity of graph self-assembly in accretive systems.",
            "Combining self-healing and proofreading in self-assembly.",
            "How crystals that sense and respond to their environments could evolve.",
            "Automating the DNA computer: solving n-Variable 3-SAT problems.",
            "Abstraction layers for scalable microfluidic biocomputing.",
            "Experimental implementation and analysis of a DNA computing readout method based on real-time PCR with TaqMan probes.",
            "Unravel four hairpins!",
            "Preface.",
            "A design and feasibility study of reactions comprising DNA molecular machine that walks autonomously by using a restriction enzyme.",
            "Toward minimum size self-assembled counters.",
            "Large-scale DNA memory based on the nested PCR.",
            "Staged self-assembly: nanomanufacture of arbitrary shapes with O (1) glues.",
            "Multi-fueled approach to DNA nano-robotics.",
            "Solutions to computational problems through gene assembly.",
            "Experimental analysis of the basic idea on the transcription-based diagnostic automata controlled by programmed molecules.",
            "Incorporation and use of modified nucleotides in aqueous DNA computing.",
            "Equivalence in template-guided recombination.",
            "Preface.",
            "Experiments on the reliability of stochastic spiking neural P systems.",
            "On the power of elementary features in spiking neural P systems.",
            "A software tool for verification of Spiking Neural P Systems.",
            "Characterizations of some classes of spiking neural P systems.",
            "Uniform solutions to SAT and 3-SAT by spiking neural P systems with pre-computed resources.",
            "On string languages generated by spiking neural P systems with exhaustive use of rules.",
            "Bibliography of spiking neural P systems.",
            "Evolution strategies with cumulative step length adaptation on the noisy parabolic ridge.",
            "Repeated patterns in genetic programming.",
            "Computation with finite stochastic chemical reaction networks."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2007",
        "info": "Volume 6, 2007",
        "count": 24,
        "papers": [
            "Artificial immune systems - today and tomorrow.",
            "Modelling the immune system: the case of situated cellular agents.",
            "Modeling individual's aging within a bacterial population using a pi-calculus paradigm.",
            "Determination of protein structure and dynamics combining immune algorithms and pattern search methods.",
            "Preface.",
            "A broader view on the limitations of information processing and communication by nature.",
            "Compositional and holistic quantum computational semantics.",
            "Entropy and algorithmic complexity in quantum information theory.",
            "Coupling of quantum angular momenta: an insight into analogic/discrete and local/global models of computation.",
            "The complexity of latching transitions in large scale cortical networks.",
            "On mind & Turing's machines.",
            "Preface.",
            "On how the computational paradigm can help us to model and interpret the neural function.",
            "Orientation contrast sensitive cells in primate V1 a computational model.",
            "Information coding in early stages of the somatosensory system.",
            "Sorting of neural spikes: When wavelet based methods outperform principal component analysis.",
            "Gaussian processes and neuronal modeling.",
            "Reflex-oscillations in evolved single leg neurocontrollers for walking machines.",
            "Self-assembling graphs.",
            "Two proteins for the price of one: the design of maximally compressed coding sequences.",
            "Bond-free DNA language classes.",
            "Design of an irreversible DNA memory element.",
            "Immune system approaches to intrusion detection - a review.",
            "A review of particle swarm optimization. Part I: background and development."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2006",
        "info": "Volume 5, 2006",
        "count": 22,
        "papers": [
            "Automated Design and Programming of a Microfluidic DNA Computer.",
            "Finite Memory Loading in Hairy Neurons.",
            "Simulated Bacterially-Inspired Problem Solving - The Behavioural Domain.",
            "Rainbow Sort: Sorting at the Speed of Light.",
            "Performance Evaluation of Multiagent Genetic Algorithm.",
            "Tenth International Meeting on DNA Computing (DNA 10).",
            "On the Computational Complexity of P Automata.",
            "The Construction of Minimal DNA Expressions.",
            "Application of Mismatch Detection Methods in DNA Computing.",
            "Characterization of Non-crosshybridizing DNA Oligonucleotides Manufactured in vitro.",
            "A DNA Superstructure-based Replicator without Product Inhibition.",
            "Parallelism in Gene Assembly.",
            "Special Issue: Best of GECCO 2005.",
            "The dynamics of the best individuals in co-evolution.",
            "A rigorous analysis of the compact genetic algorithm for linear functions.",
            "A neuro-immune model for discriminating and visualizing anomalies.",
            "Minimum spanning trees made easier via multi-objective optimization.",
            "Dynamic self-assembly in living systems as computation.",
            "On three new approaches to handle constraints within evolution strategies.",
            "Learning short multivariate time series models through evolutionary and sparse matrix computation.",
            "Multiplying with DNA.",
            "Grammatical Swarm: The generation of programs by social programming."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2005",
        "info": "Volume 4, 2005",
        "count": 21,
        "papers": [
            "Protein output for DNA computing.",
            "Application of a breeder genetic algorithm for filter optimization.",
            "Vector quantization using information theoretic concepts.",
            "DNA and quantum based algorithms for VLSI circuits testing.",
            "Preface.",
            "A DNA-based memory with in vitro learning and associative recall.",
            "Hairpin-based state machine and conformational addressing: Design and experiment.",
            "Retrovirus-based computer.",
            "Involution codes: with application to DNA coded languages.",
            "Towards a re-programmable DNA computer.",
            "Evolutionary Algorithms in Drug Design.",
            "A Dual Selection Module for Directed Evolution of Genetic Circuits.",
            "P Systems with Mobile Membranes.",
            "A Design for Cellular Evolutionary Computation by using Bacteria.",
            "Preface.",
            "Thinking About Evolution in Terms of Cellular Computing.",
            "The Mechanistic Basis of Compartmentalized Gene Expression in Bacillus subtilis.",
            "Functional Topology Classification of Biological Computing Networks.",
            "Self-regulated Complexity in Neural Networks.",
            "Towards Development on a Silicon-based Cellular Computing Machine.",
            "Investigations Into Graceful Degradation of Evolutionary Developmental Software."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2004",
        "info": "Volume 3, 2004",
        "count": 24,
        "papers": [
            "Preface.",
            "Population aggregation based on fitness.",
            "A study of drift analysis for estimating computation time of evolutionary algorithms.",
            "Running time analysis of evolutionary algorithms on a simplified multiobjective knapsack problem.",
            "A Study on the use of \"self-generation\" in memetic algorithms.",
            "Learning probability distributions in continuous evolutionary algorithms - a comparative review.",
            "Best approximations of fitness functions of binary strings.",
            "Introduction.",
            "Finding independent components using spikes: A natural result of hebbian learning in a sparse spike coding scheme.",
            "A pulsed neural network model of spectro-temporal receptive fields and population coding in auditory cortex.",
            "The evidence for neural information processing with precise spike-times: A survey.",
            "SINBAD automation of scientific discovery: From factor analysis to theory synthesis.",
            "3D Fractal DNA Assembly from Coding, Geometry and Protection.",
            "Codeword design and information encoding in DNA ensembles.",
            "Early Cognitive Vision: Using Gestalt-Laws for Task-Dependent, Active Image-Processing.",
            "Learning Probability Distributions in Continuous Evolutionary Algorithms - a Comparative Review.",
            "Editorial.",
            "Biomolecular swarms - an agent-based model of the lactose operon.",
            "On the model granularity to simulate protein dynamics: A biological physics view on biomolecular computing.",
            "Flows in micro fluidic networks: From theory to experiment.",
            "Physical modeling of biomolecular computers: Models, limitations, and experimental validation.",
            "Development, evaluation and benchmarking of simulation software for biomolecule-based computing.",
            "Statistical thermodynamic analysis and designof DNA-based computers.",
            "Virtual test tubes."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2003",
        "info": "Volume 2, 2003",
        "count": 22,
        "papers": [
            "Towards a neurally-inspired computer architecture.",
            "Genetic circuit building blocks for cellular computation, communications, and signal processing.",
            "DNA computing capabilities for game theory.",
            "Neutrality and self-adaptation.",
            "Coding and geometrical shapes in nanostructures: A fractal DNA-assembly.",
            "DNA-based algorithms for learning Boolean formulae.",
            "Modelling biological processes by using a probabilistic P system software.",
            "P X systems = P systems + X machines.",
            "Forbidding and enforcing in membrane computing.",
            "Array-rewriting P systems.",
            "Mathematical models of uncertainty with a regard to membrane systems.",
            "Complexity classes in models of cellular computing with membranes.",
            "The computational power of cell division in P systems: Beating down parallel computers?",
            "From Watson-Crick L systems to Darwinian P systems.",
            "On the computational power of insertion-deletion systems.",
            "Unexpected universality results for three classes of P systems with symport/antiport.",
            "How efficiently can room at the bottom be traded away for speed at the top?",
            "Algorithms for testing that sets of DNA words concatenate without secondary structure.",
            "In vitro selection of non-crosshybridizing oligonucleotides for computation.",
            "Self-assembling DNA graphs.",
            "The design of autonomous DNA nano-mechanical devices: Walking and rolling DNA.",
            "Engineering signal processing in cells: Towards molecular concentration band detection."
        ]
    },
    {
        "name": "Natural Computing",
        "year": "2002",
        "info": "Volume 1, 2002",
        "count": 10,
        "papers": [
            "Evolution strategies - A comprehensive introduction.",
            "It started with Watson and Crick, but it sure didn't end there: Pitfalls and possibilities beyond the classic double helix.",
            "Beyond second-order statistics for learning: A pairwise interaction model for entropy estimation.",
            "Model complexity control and statistical learning theory.",
            "Quantum computing - Facts and folklore.",
            "How ciliates manipulate their own DNA - A splendid example of natural computing.",
            "Realizations of quantum computing using optical manipulations of atoms.",
            "Classifiers that approximate functions.",
            "Recent approaches to global optimization problems through Particle Swarm Optimization.",
            "Parallel evolutionary training algorithms for \"hardware-friendly\" neural networks."
        ]
    }
]