[
    {
        "name": "NLE",
        "year": "2022",
        "info": "Volume 28: 2022",
        "count": 11,
        "papers": [
            "Cluster-based mention typing for named entity disambiguation.",
            "Learning from noisy out-of-domain corpus using dataless classification.",
            "Improved feature decay algorithms for statistical machine translation.",
            "A clustering framework for lexical normalization of Roman Urdu.",
            "$NLP: How to spend a billion dollars.",
            "Text Mining with R: A Tidy Approach, by Julia Silge and David Robinson. Sebastopol, CA: O'Reilly Media, 2017. ISBN 978-1-491-98165-8. XI + 184 pages.",
            "Automatic classification of participant roles in cyberbullying: Can we detect victims, bullies, and bystanders in social media text?",
            "Exploiting native language interference for native language identification.",
            "A note on constituent parsing for Korean.",
            "Unsupervised Arabic dialect segmentation for machine translation.",
            "Emerging Trends: SOTA-Chasing."
        ]
    },
    {
        "name": "NLE",
        "year": "2021",
        "info": "Volume 27: 2021",
        "count": 36,
        "papers": [
            "Mining, analyzing, and modeling text written on mobile devices.",
            "Transfer learning for Turkish named entity recognition on noisy text.",
            "Constrained BERT BiLSTM CRF for understanding multi-sentence entity-seeking questions.",
            "Learning to rank for multi-label text classification: Combining different sources of information.",
            "GPT-3: What's it good for?",
            "Processing negation: An introduction to the special issue.",
            "Recent advances in processing negation.",
            "Focus of negation: Its identification in Spanish.",
            "Automatic generation of lexica for sentiment polarity shifters.",
            "Supervised learning for the detection of negation and of its scope in French and Brazilian Portuguese biomedical corpora.",
            "Comparison of rule-based and neural network models for negation detection in radiology reports.",
            "Negation detection for sentiment analysis: A case study in Spanish.",
            "Improving sentiment analysis with multi-task learning of negation.",
            "Neural machine translation of low-resource languages using SMT phrase pair injection.",
            "Nonuniform language in technical writing: Detection and correction.",
            "Syntax-ignorant N-gram embeddings for dialectal Arabic sentiment analysis.",
            "Investigating translated Chinese and its variants using machine learning.",
            "Deep Learning in Natural Language Processing, edited by Li Deng and Yang Liu. Singapore: Springer, 2018. ISBN 9789811052088. XVII + 329 pages.",
            "Neural Machine Translation 2020, by Philipp Koehn, Cambridge, Cambridge University Press, ISBN 978-1-108-49732-9, pages 393.",
            "Emerging trends: Ethics, intimidation, and the Cold War.",
            "Text classification with semantically enriched word embeddings.",
            "Is your document novel? Let attention guide you. An attention-based model for document-level novelty detection.",
            "Sentiment analysis in Turkish: Supervised, semi-supervised, and unsupervised techniques.",
            "Linguistic knowledge-based vocabularies for Neural Machine Translation.",
            "Robert C. Berwick and Edward P. Stabler, editors. Minimalist Parsing. Oxford: Oxford University Press, 2019. ISBN: 978-0-19-879508-7. Price. $40.00 (paperback). $84.00 (hardcover). xvi+192 pages.",
            "The automated writing assistance landscape in 2021.",
            "Temporally anchored spatial knowledge: Corpora and experiments.",
            "Universal Lemmatizer: A sequence-to-sequence model for lemmatizing Universal Dependencies treebanks.",
            "Computational generation of slogans.",
            "Incorporating word embeddings in unsupervised morphological segmentation.",
            "Emerging trends: Deep nets for poets.",
            "A systematic review of unsupervised approaches to grammar induction.",
            "Towards syntax-aware token embeddings.",
            "Imparting interpretability to word embeddings while preserving semantic structure.",
            "Improving speech emotion recognition based on acoustic words emotion dictionary.",
            "Emerging trends: A gentle introduction to fine-tuning."
        ]
    },
    {
        "name": "NLE",
        "year": "2020",
        "info": "Volume 26: 2020",
        "count": 35,
        "papers": [
            "Editorial note.",
            "Query-based summarization of discussion threads.",
            "Term evaluation metrics in imbalanced text categorization.",
            "Robust stylometric analysis and author attribution based on tones and rimes.",
            "Estimating word-level quality of statistical machine translation output using monolingual information alone.",
            "Annotating a broad range of anaphoric phenomena, in a variety of genres: the ARRAU Corpus.",
            "Voice assistance in 2019.",
            "How to evaluate machine translation: A review of automated and human metrics.",
            "Finding next of kin: Cross-lingual embedding spaces for related languages.",
            "Designing a virtual patient dialogue system based on terminology-rich resources: Challenges and evaluation.",
            "A new approach for textual feature selection based on N-composite isolated labels.",
            "Emerging trends: Reviewing the reviewers (again).",
            "Keyword extraction: Issues and methods.",
            "Learning keyphrases from corpora and knowledge models.",
            "Detecting light verb constructions across languages.",
            "Using linguistically defined specific details to detect deception across domains.",
            "Emerging trends: Subwords, seriously?",
            "Tackling challenges of neural purchase stage identification from imbalanced twitter data.",
            "Word sense disambiguation using implicit information.",
            "Measuring diachronic language distance using perplexity: Application to English, Portuguese, and Spanish.",
            "Two approaches to compilation of bilingual multi-word terminology lists from lexical resources.",
            "Natural language generation: The commercial state of the art in 2020.",
            "Horacio Saggion, Automatic Text Simplification. Synthesis lectures on human language technologies, April 2017.",
            "Domain bias in distinguishing Flemish and Dutch subtitles.",
            "Uncovering the language of wine experts.",
            "It all starts with entities: A Salient entity topic model.",
            "Unsupervised modeling anomaly detection in discussion forums posts using global vectors for text representation.",
            "Benchmarks and goals.",
            "Preface.",
            "Natural language processing for similar languages, varieties, and dialects: A survey.",
            "Classification of regional and genre varieties of Chinese: A correspondence analysis approach based on comparable balanced corpora.",
            "Fine-grained analysis of language varieties and demographics.",
            "Compression versus traditional machine learning classifiers to detect code-switching in varieties and dialects: Arabic as a case study.",
            "Effective multi-dialectal arabic POS tagging.",
            "Spoken Arabic dialect recognition using X-vectors."
        ]
    },
    {
        "name": "NLE",
        "year": "2019",
        "info": "Volume 25: 2019",
        "count": 40,
        "papers": [
            "Editorial note.",
            "Arabic community question answering.",
            "A neural approach for inducing multilingual resources and natural language processing tools for low-resource languages.",
            "Identifying signs of syntactic complexity for rule-based sentence simplification.",
            "Extractive multi-document summarization based on textual entailment and sentence compression via knapsack problem.",
            "The effect of morphology in named entity recognition with sequence tagging.",
            "Efficient Phrase Table pruning for Hindi to English machine translation through syntactic and marker-based filtering and hybrid similarity measurement.",
            "Law and Word Order: NLP in Legal Tech.",
            "Neural architectures for open-type relation argument extraction.",
            "Out-domain Chinese new word detection with statistics-based character embedding.",
            "Effectiveness of data-driven induction of semantic spaces and traditional classifiers for sarcasm detection.",
            "InferPortOIE: A Portuguese Open Information Extraction system with inferences.",
            "Weighted finite-state transducers for normalization of historical texts.",
            "GANs vs. good enough.",
            "Integrating LSA-based hierarchical conceptual space and machine learning methods for leveling the readability of domain-specific texts.",
            "A learning to rank approach for cross-language information retrieval exploiting multiple translation resources.",
            "Annotation projection for temporal information extraction.",
            "Anniversary article: Then and now: 25 years of progress in natural language engineering.",
            "NLP commercialisation in the last 25 years.",
            "Representation of sentence meaning (A JNLE Special Issue).",
            "Jointly learning sentence embeddings and syntax with unsupervised Tree-LSTMs.",
            "Learning semantic sentence representations from visually grounded language without lexical knowledge.",
            "Sentence embeddings in NLI with iterative refinement encoders.",
            "A structured distributional model of sentence meaning and processing.",
            "High-dimensional distributed semantic spaces for utterances.",
            "Neural embeddings: accurate and readable inferences based on semantic kernels.",
            "Analyzing and interpreting neural networks for NLP: A report on the first BlackboxNLP workshop.",
            "Preface.",
            "Language model adaptation for language and dialect identification of text.",
            "Neural text normalization with adapted decoding and POS features.",
            "Combining n-grams and deep convolutional features for language variety classification.",
            "Neural morphosyntactic tagging for Rusyn.",
            "How to tag non-standard language: Normalisation versus domain adaptation for Slovene historical and user-generated texts.",
            "Editorial note.",
            "Twenty-five years of information extraction.",
            "An overview of word and sense similarity.",
            "Discovering multiword expressions.",
            "Automatic summarisation: 25 years On.",
            "A survey of 25 years of evaluation.",
            "Five Tips for a Successful API."
        ]
    },
    {
        "name": "NLE",
        "year": "2018",
        "info": "Volume 24: 2018",
        "count": 40,
        "papers": [
            "Editorial note.",
            "To use or not to use: Feature selection for sentiment analysis of highly imbalanced data.",
            "A Semi-automatic and low-cost method to learn patterns for named entity recognition.",
            "CCG supertagging with bidirectional long short-term memory networks.",
            "New treebank or repurposed? On the feasibility of cross-lingual parsing of Romance languages with Universal Dependencies.",
            "A survey of diacritic restoration in abjad and alphabet writing systems.",
            "Emerging trends: A tribute to Charles Wayne.",
            "Formalizing Natural Languages: The NooJ Approach, by Max Silberztein . London, Cognitive science series, Wiley-ISTE, UK, 2016. ISBN 9781848219021.",
            "DEXTER: A workbench for automatic term extraction with specialized corpora.",
            "Exploring open information via event network.",
            "Topics and topical phases in German social media communication during a disaster.",
            "A framework for enriching lexical semantic resources with distributional semantics.",
            "Term variation in specialised corpora: Characterisation, automatic discovery and applications, by B. Daille John Benjamins Publishing Company (Terminology and Lexicography Research and Practice), 2017.",
            "Text analytics APIs, Part 1: The bigger players.",
            "From image to language and back again.",
            "Learning quantification from images: A structured neural architecture.",
            "Assessing multilingual multimodal image description: Studies of native speaker preferences and translator choices.",
            "The role of image representations in vision to language tasks.",
            "Understanding visual scenes.",
            "Where to put the image in an image caption generator.",
            "Unsupervised learning of semantic representation for documents with the law of total probability.",
            "Measuring bilingual corpus comparability.",
            "SaferDrive: An NLG-based behaviour change support system for drivers.",
            "Possession identification in text.",
            "Aspect opinion expression and rating prediction via LDA-CRF hybrid.",
            "Emerging trends: Artificial Intelligence, China and my new job at Baidu.",
            "A state-of-the-art of semantic change computation.",
            "Alignment of comparable documents: Comparison of similarity measures on French-English-Arabic data.",
            "Multilingual SMS-based author profiling: Data and methods.",
            "A closed-domain question answering framework using reliable resources to assist students.",
            "Extraction of templates from phrases using Sequence Binary Decision Diagrams.",
            "Text analytics APIs, Part 2: The smaller players.",
            "Peter Lasersohn. Subjectivity and Perspective in Truth-Theoretic Semantics. Oxford, Oxford University Press, 2017. ISBN 9780199573677. XVIII + 274 pages.",
            "Editorial note.",
            "Models to represent linguistic linked data.",
            "Weighting-based semantic similarity measure based on topological parameters in semantic taxonomy.",
            "A novel ILP framework for summarizing content with high lexical variety.",
            "MUSED: A multimedia multi-document dataset for topic segmentation.",
            "Turing's Imitation Game: Conversations with the Unknown, by Kevin Warwick and Huma Shah, Cambridge University Press, 2016. ISBN 978110705638-1. 202 pages.",
            "Emerging trends: APIs for speech and machine translation and more."
        ]
    },
    {
        "name": "NLE",
        "year": "2017",
        "info": "Volume 23: 2017",
        "count": 39,
        "papers": [
            "Editorial note.",
            "Can machine translation systems be evaluated by the crowd alone.",
            "A classification approach for detecting cross-lingual biomedical term translations.",
            "Mapping Arabic WordNet synsets to Wikipedia articles using monolingual and bilingual features.",
            "NLP-driven citation analysis for scientometrics.",
            "A method based on rules and machine learning for logic form identification in Spanish.",
            "Word2Vec.",
            "Multilingual native language identification.",
            "Translating text into pictographs.",
            "Developing, evaluating, and refining an automatic generator of diagnostic multiple choice cloze questions to assess children's comprehension while reading.",
            "Keyword extraction from emails.",
            "NLP in a post-truth world.",
            "Deep-neural network approaches for speech recognition with heterogeneous groups of speakers including children.",
            "Improving mention detection for Basque based on a deep error analysis.",
            "Supervised approach to recognise Polish temporal expressions and rule-based interpretation of timexes.",
            "POS-tagging arabic texts: A novel approach based on ant colony.",
            "NERA 2.0: Improving coverage and performance of rule-based named entity recognition for Arabic.",
            "Emerging trends: I did it, I did it, I did it, but. . .",
            "Domain-Sensitive Temporal Tagging, by Jannik Strötgen , Michael Gertz . CA, USA. Morgan & Claypool, 2016. ISBN 9781627054591.",
            "One, no one and one hundred thousand events: Defining and processing events in an inter-disciplinary perspective.",
            "A transformation-driven approach for recognizing textual entailment.",
            "Sentiment analysis in Turkish at different granularity levels.",
            "Citation function, polarity and influence classification.",
            "Detecting sexual predators in chats using behavioral features and imbalanced learning.",
            "Find the errors, get the better: Enhancing machine translation via word confidence estimation.",
            "The commercial NLP landscape in 2017.",
            "Natural language processing in mental health applications using non-clinical texts.",
            "Classifying news versus opinions in newspapers: Linguistic features for domain independence.",
            "A scalable architecture for data-intensive natural language processing.",
            "A scaffolding approach to coreference resolution integrating statistical and rule-based models.",
            "Leveraging bilingual terminology to improve machine translation in a CAT environment.",
            "Syntactic methods for topic-independent authorship attribution.",
            "Emerging trends: Inflation.",
            "Generating natural language descriptions using speaker-dependent information.",
            "Social media text normalization for Turkish.",
            "Lemaza : An Arabic why-question answering system.",
            "Dropped personal pronoun recovery in Chinese SMS.",
            "Multilingual extension and evaluation of a poetry generator.",
            "The pros and cons of listening devices."
        ]
    },
    {
        "name": "NLE",
        "year": "2016",
        "info": "Volume 22: 2016",
        "count": 37,
        "papers": [
            "UIMA Ruta: Rapid development of rule-based information extraction applications.",
            "Extractive summarization of multi-party meetings through discourse segmentation.",
            "Exploiting extra-textual and linguistic information in keyphrase extraction.",
            "Predicting word choice in affective text.",
            "Selection of correction candidates for the normalization of Spanish user-generated content.",
            "Non-native text analysis: A survey.",
            "MaltOptimizer: Fast and effective parser optimization.",
            "A statistical model for grammar mapping.",
            "Influence of personal choices on lexical variability in referring expressions.",
            "SCESS: a WFSA-based automated simplified chinese essay scoring system with incremental latent semantic analysis.",
            "How to make money in the translation business.",
            "Survey about citation context analysis: Tasks, techniques, and resources.",
            "Sparsity and normalization in word similarity systems.",
            "Pattern-based unsupervised parsing method.",
            "TwitterNEED: A hybrid approach for named entity extraction and disambiguation for tweet.",
            "Automatic generation of short answer questions for reading comprehension assessment.",
            "Checking in on grammar checking.",
            "Preface.",
            "Recent advances in machine translation using comparable corpora.",
            "End-to-end statistical machine translation with zero or small parallel texts.",
            "Extracting parallel phrases from comparable data for machine translation.",
            "Exploiting unbalanced specialized comparable corpora for bilingual lexicon extraction.",
            "Building and using multimodal comparable corpora for machine translation.",
            "Building a multi-domain comparable corpus using a learning to rank method.",
            "Open-domain extraction of future events from Twitter.",
            "Silhouette + attraction: A simple and effective method for text clustering.",
            "Computational generation and dissection of lexical replacement humor.",
            "Arabic spelling error detection and correction.",
            "Morphologically rich Urdu grammar parsing using Earley algorithm.",
            "The return of the chatbots.",
            "Revisiting the ontologising of semantic relation arguments in wordnet synsets.",
            "ISO standard modeling of a large Arabic dictionary.",
            "Modernising historical Slovene words.",
            "Phonetisaurus: Exploring grapheme-to-phoneme conversion with joint n-gram models in the WFST framework.",
            "Data-driven deep-syntactic dependency parsing.",
            "Editor's Preface to Emerging Trends.",
            "The next generation."
        ]
    },
    {
        "name": "NLE",
        "year": "2015",
        "info": "Volume 21: 2015",
        "count": 31,
        "papers": [
            "Editorial note.",
            "Unsupervised acquisition of entailment relations from the Web.",
            "Similarity computation using semantic networks created from web-harvested data.",
            "Network analysis of narrative content in large corpora.",
            "Improving shift-reduce constituency parsing with large-scale unlabeled data.",
            "A syntactic approach for opinion mining on Spanish reviews.",
            "In Memory of Geoffrey Leech.",
            "Design and realization of a modular architecture for textual entailment.",
            "Backward and trigger-based language models for statistical machine translation.",
            "Improving syntactic rule extraction through deleting spurious links with translation span alignment.",
            "SePaS: Word sense disambiguation by sequential patterns in sentences.",
            "Analysis and feedback of erroneous Arabic verbs.",
            "The limits of intelligent personal assistants.",
            "In Memory of Geoffrey Leech - ERRATUM.",
            "The Kestrel TTS text normalization system.",
            "Relational paraphrase acquisition from Wikipedia: The WRPA method and corpus.",
            "Hierarchical reinforcement learning for situated natural language generation.",
            "Experiments with three approaches to recognizing lexical entailment.",
            "A survey of automatic Arabic diacritization techniques.",
            "Authorship analysis of aliases: Does topic influence accuracy?",
            "Exploring the effectiveness of linguistic knowledge for biographical relation extraction.",
            "(Un/Semi-)supervised SMS text message SPAM detection.",
            "A tree-based learning approach for document structure analysis and its application to web search.",
            "Construction and evaluation of event graphs.",
            "NLP meets the cloud.",
            "Word from the editors.",
            "A survey of graphs in natural language processing.",
            "Textual entailment graphs.",
            "Clique-based semantic kernel with application to semantic relatedness.",
            "CO-graph: A new graph-based technique for cross-lingual word sense disambiguation.",
            "An automatic approach to identify word sense changes in text media across timescales."
        ]
    },
    {
        "name": "NLE",
        "year": "2014",
        "info": "Volume 20: 2014",
        "count": 21,
        "papers": [
            "Sentiment analysis in Twitter.",
            "SongRecommend: From summarization to recommendation.",
            "Morphological disambiguation of Hebrew: a case study in classifier combination.",
            "Explorations in lexical sample and all-words lexical substitution.",
            "BASRAH: an automatic system to identify the meter of Arabic poetry.",
            "A PDTB-styled end-to-end discourse parser.",
            "A semantic space approach to the computational semantics of noun compounds.",
            "Using morphemes in language modeling and automatic speech recognition of Amharic.",
            "Modeling human newspaper readers: The Fuzzy Believer approach.",
            "Inderjeet Mani. Computational Modeling of Narrative. Synthesis Lectures on Human Language Technologies No 18. Seattle, WA: Morgan & Claypool Publishers, 2013. ISBN 978-1-60845-981-0 (paperback: $40); ISBN 978-1-60845-982-7 (e-book: $30). xvii + 124 pages (doi: 10.2200/S00459ED1V01Y201212HLT018).",
            "Using the crowd for readability prediction.",
            "Coping with highly imbalanced datasets: A case study with definition extraction in a multilingual setting.",
            "Adaptive graph walk-based similarity measures for parsed text.",
            "Designing a machine translation system for Canadian weather warnings: A case study.",
            "Lexical Analysis: Norms and Exploitations, by Patrick Hanks. Cambridge, MA., U.S.A. MIT Press, 2013. ISBN 978-0-262-01857-9. xv + 462 pages.",
            "Parallel and nested decomposition for factoid questions.",
            "Densification: Semantic document analysis using Wikipedia.",
            "Retrieving implicit positive meaning from negated statements.",
            "Lexical acquisition and semantic space models: Learning the semantics of unknown words.",
            "Classifying Korean comparative sentences for comparison analysis.",
            "Semantics: From Meaning to Text, Vol. 2 (SLCS 135), by Igor A. Mel'čuk. Amsterdam, Netherlands: John Benjamins, 2013. ISBN: 978-90-272-0602-2; 978-90-272-7165-5. xvi + 400 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "2013",
        "info": "Volume 19: 2013",
        "count": 20,
        "papers": [
            "When the answer comes into question in question-answering: survey and open issues.",
            "A unified alignment algorithm for bilingual data.",
            "A fast and flexible architecture for very large word n-gram datasets.",
            "Automated unsupervised authorship analysis using evidence accumulation clustering.",
            "A SMS normalization system integrating multiple grammatical resources.",
            "COMPENDIUM: a text summarisation tool for generating summaries of multiple purposes, domains, and genres.",
            "Generating example contexts to help children learn word meaning.",
            "Modeling Sociocultural phenomena in discourse.",
            "A novel string distance metric for ranking Persian respelling suggestions.",
            "Introduction to Machine Learning, 2nd ed., by Ethem Alpaydın. Cambridge, MA: The MIT Press 2010. ISBN: 978-0-262-01243-0. $54/£ 39.95 + 584 pages.",
            "On the semantics of noun compounds.",
            "On the interpretation of noun compounds: Syntax, semantics, and entailment.",
            "Interpreting compound nouns with kernel methods.",
            "General and specific paraphrases of semantic relations between nouns.",
            "A lexical semantic approach to interpreting and bracketing English noun compounds.",
            "Karen Spärck Jones Award - Nominations for the 2013 award invited.",
            "Recent advances in methods of lexical semantic relatedness - a survey.",
            "Context identification of sentences in research articles: Towards developing intelligent tools for the research community.",
            "Evaluating authorship distance methods using the positive Silhouette coefficient.",
            "On morphological relatedness."
        ]
    },
    {
        "name": "NLE",
        "year": "2012",
        "info": "Volume 18: 2012",
        "count": 23,
        "papers": [
            "Editorial Note.",
            "Estimating the number of segments for improving dialogue act labelling.",
            "Datasets for generic relation extraction.",
            "A hierarchical approach to mood classification in blogs.",
            "Unsupervised lexicon induction for clause-level detection of evaluations.",
            "Query-focused multi-document summarization: automatic data annotations and supervised learning approaches.",
            "Special issue on statistical learning of natural language structured input and output.",
            "Document ranking refinement using a Markov random field model.",
            "Unsupervised dependency parsing without training.",
            "Structure-guided supertagger learning.",
            "Exploiting the Wikipedia structure in local and global classification of taxonomic relations.",
            "ERD-MedLDA: Entity relation detection using supervised topic models with maximum margin learning.",
            "In Memoriam: David L. Waltz.",
            "Recentred local profiles for authorship attribution.",
            "Exploring patterns in dictionary definitions for synonym extraction.",
            "Semantic composition of AT-LOCATION relation with other relations.",
            "A cross-corpus study of subjectivity identification using unsupervised learning.",
            "Evaluating vector space models with canonical correlation analysis.",
            "Discourse structure and language technology.",
            "Statistical Translation After Source Reordering: Oracles, Context-Aware Models, and Empirical Analysis.",
            "Part of speech tagging for Arabic.",
            "Extraction of multi-word expressions from small parallel corpora.",
            "Syntax-Based Collocation Extraction, by Violeta Seretan. Berlin: Springer, 2011. ISBN-10 9400701330, ISBN-13 978-9400701335. $139.00/£90.00 (Hardcover) xi + 220 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "2011",
        "info": "Volume 17: 2011",
        "count": 24,
        "papers": [
            "Modeling reciprocity in social interactions with probabilistic latent space models.",
            "An information-theoretic, vector-space-model approach to cross-language information retrieval.",
            "Inductive probabilistic taxonomy learning using singular value decomposition.",
            "Affect Analysis Model: novel rule-based approach to affect sensing from text.",
            "Lucy A. Suchman. Human-Machine Reconfigurations: Plans and Situated Actions, 2nd ed. Cambridge, U.K.: Cambridge University Press, 2006. ISBN-10 052167588X, ISBN-13 978-0521675888 326 pages.",
            "Finite-state methods and models in natural language processing.",
            "Syntactic error detection and correction in date expressions using finite-state transducers.",
            "Regular relations for temporal propositions.",
            "Using regular tree grammars to enhance sentence realisation.",
            "A randomised inference algorithm for regular tree languages.",
            "An alternative to synchronous tree substitution grammars.",
            "Finite-state models for speech-based search on mobile devices.",
            "Efficiently generating correction suggestions for garbled tokens of historical language.",
            "Enriching ontologies with multilingual information.",
            "Natural discourse reference generation reduces cognitive load in spoken systems.",
            "Deterministic shift-reduce parsing for unification-based grammars.",
            "Analyzing language samples of Spanish-English bilingual children for the automated prediction of language dominance.",
            "Subjectivity detection in spoken and written conversations.",
            "Steven Bird, Evan Klein and Edward Loper. Natural Language Processing with Python. O'Reilly Media, Inc 2009. ISBN: 978-0-596-51649-9.",
            "Machine learning for query formulation in question answering.",
            "Dependency-based n-gram models for general purpose sentence realisation.",
            "BLANC: Implementing the Rand index for coreference evaluation.",
            "Assessing user simulation for dialog systems using human judges and automatic evaluation measures.",
            "Learning opinions in user-generated web content."
        ]
    },
    {
        "name": "NLE",
        "year": "2010",
        "info": "Volume 16: 2010",
        "count": 21,
        "papers": [
            "Editorial Note.",
            "Learning human multimodal dialogue strategies.",
            "Wisdom of crowds versus wisdom of linguists - measuring the semantic relatedness of words.",
            "Discourse planning for information composition and delivery: A reusable platform.",
            "Learning Machine Translation, edited by Cyril Goutte, Nicola Cancedda, Marc Dymetman and George Foster. MIT Press, 2009.",
            "Christopher D. Manning, Prabhakar Raghavan, Hinrich Schütze, Introduction to Information Retrieval, Cambridge University Press 2008. ISBN-13 978-0-521-86571-5, xxi + 482 pages.",
            "Recognizing textual entailment: Rational, evaluation and approaches - Erratum.",
            "Formal and functional assessment of the pyramid method for summary content evaluation.",
            "Rewriting the orthography of SMS messages.",
            "Automatic summarisation of discussion fora.",
            "Pierre M. Nugues. An Introduction to Language Processing with Perl and Prolog. Springer-Verlag 2006.",
            "Interlingual annotation of parallel text corpora: a new framework for annotation and evaluation.",
            "A topological embedding of the lexicon for semantic distance computation.",
            "WordICA - emergence of linguistic representations for words by independent component analysis.",
            "Instance-based natural language generation.",
            "Distributional lexical semantics: Toward uniform representation paradigms for advanced acquisition and processing tasks.",
            "Directional distributional similarity for lexical inference.",
            "Class-based approach to disambiguating Levin verbs.",
            "A non-negative tensor factorization model for selectional preference induction.",
            "Automatic discovery of word semantic relations using paraphrase alignment and distributional lexical semantics analysis.",
            "The automatic identification of lexical variation between language varieties."
        ]
    },
    {
        "name": "NLE",
        "year": "2009",
        "info": "Volume 15: 2009",
        "count": 25,
        "papers": [
            "Special issue on interactive question answering: Introduction.",
            "Interactive question answering and constraint relaxation in spoken dialogue systems.",
            "HITIQA: High-quality intelligence through interactive question answering.",
            "Does this list contain what you were searching for? Learning adaptive dialogue strategies for interactive question answering.",
            "Designing an interactive open-domain question answering system.",
            "Follow-up question handling in the IMIX and Ritel systems: A comparative study.",
            "Questionnaires for eliciting evaluation data from users of interactive question answering systems.",
            "Adding semantic roles to the Chinese Treebank.",
            "Ordering the suggestions of a spellchecker without using context.",
            "On the subjectivity of human-authored summaries.",
            "A Semantic Scattering model for the automatic interpretation of English genitives.",
            "Adapting SVM for data sparseness and imbalance: a case study in information extraction.",
            "A tractable hybrid DDN-POMDP approach to affective dialogue modeling for probabilistic frame-based dialogue systems.",
            "Abdelhadi Soudi, Antal van den Bosch and Günter Neumann, editors. Arabic Computational Morphology. Knowledge-Based and Empirical Methods. Dordrecht, The Netherlands: Springer. 2007. ISBN 978-1-4020-6045-8.",
            "Hermann Helbig. Knowledge Representation and the Semantics of Natural Language. Berlin, Springer-Verlag. 2006. ISBN-10 3-540-24461-1.",
            "Automatic annotation of context and speech acts for dialogue corpora.",
            "Learning effective and engaging strategies for advice-giving human-machine dialogue.",
            "A corpus-based analysis of argument realization by preposition structures.",
            "The FrameNet model and its applications.",
            "Roland Hausser. A Computational Model of Natural Language Communication. Berlin, Heidelberg: Springer-Verlag, 2006. ISBN-13 978-3-540-35476-5. ii+365 pages.",
            "Inferring textual entailment with a probabilistically sound calculus.",
            "Recognizing entailment in intelligent tutoring systems.",
            "Extracting paraphrase patterns from bilingual parallel corpora.",
            "Assessing the impact of frame semantics on textual entailment.",
            "A machine learning approach to textual entailment recognition."
        ]
    },
    {
        "name": "NLE",
        "year": "2008",
        "info": "Volume 14: 2008",
        "count": 25,
        "papers": [
            "Editorial Note.",
            "DialogueView: annotating dialogues in multiple views with abstraction.",
            "InfoXtract: A customizable intermediate level information extraction engine.",
            "Learning verb complements for Modern Greek: balancing the noisy dataset.",
            "Natural language processing in CLIME, a multilingual legal advisory system.",
            "Ethem Alpaydin. Introduction to Machine Learning (Adaptive Computation and Machine Learning Series). The MIT Press, 2004, ISBN 0 262 01211 1.",
            "Rayner Manny, Ann Hockey Beth, Bouillon Pierrette, Putting Linguistics into Speech Recognition. The Regulus Grammar Compiler. With contributions by Nikos Chatzichrisafis, Marianne Santaholma & Marianne Starlander. Foreword by Aravind K. Joshi. Appeared in the series CSLI Studies in Computational Linguistics, CSLI, ISBN 1-57586-526-2.",
            "Industry Watch.",
            "Using patterns of thematic progression for building a table of contents of a text.",
            "A finite-state morphological grammar of Hebrew.",
            "Active learning and logarithmic opinion pools for HPSG parse selection.",
            "Part-of-speech tagging of Modern Hebrew text.",
            "ELHISA: An architecture for the integration of heterogeneous lexical information.",
            "Industry Watch: Language technology, meet social networking.",
            "Robust parsing and spoken negotiative dialogue with databases.",
            "Bootstrapping spoken dialogue systems by exploiting reusable libraries.",
            "A general feature space for automatic verb classification.",
            "Using automatically labelled examples to classify rhetorical relations: an assessment.",
            "A new PPM variant for Chinese text compression.",
            "Automatic generation of weather forecast texts using comprehensive probabilistic generation-space models.",
            "Strengths and weaknesses of finite-state technology: a case study in morphological grammar development.",
            "Definitional and human constraints on structural annotation of English.",
            "Generating basic skills reports for low-skilled readers.",
            "Multilingual pronunciation by analogy.",
            "A structural approach to the automatic adjudication of word sense disagreements."
        ]
    },
    {
        "name": "NLE",
        "year": "2007",
        "info": "Volume 13: 2007",
        "count": 16,
        "papers": [
            "Can syllabification improve pronunciation by analogy of English?",
            "Choosing the content of textual summaries of large time-series data sets.",
            "Word-based predictive text entry using adaptive language models.",
            "Using shallow linguistic analysis to improve search on Danish compounds.",
            "Industry Watch: Is 2007 the Year of Question-Answering?",
            "MaltParser: A language-independent system for data-driven dependency parsing.",
            "Making fine-grained and coarse-grained sense distinctions, both manually and automatically.",
            "Abbreviated text input using language modeling.",
            "Industry Watch.",
            "Source authoring for multilingual generation of personalised object descriptions.",
            "Segmentation and alignment of parallel text for statistical machine translation.",
            "Some notes on the PARC 700 Dependency Bank.",
            "Industry Watch.",
            "Dialogue act recognition under uncertainty using Bayesian networks.",
            "From UBGs to CFGs A practical corpus-driven approach.",
            "Efficient dictionary-based text rewriting using subsequential transducers."
        ]
    },
    {
        "name": "NLE",
        "year": "2006",
        "info": "Volume 12: 2006",
        "count": 20,
        "papers": [
            "A Reference Architecture for Natural Language Generation Systems.",
            "A weighted finite state transducer translation template model for statistical machine translation.",
            "Definitional, personal, and mechanical constraints on part of speech annotation performance.",
            "Linguistic knowledge in statistical phrase-based word alignment.",
            "Introduction.",
            "Detecting errors in English article usage by non-native speakers.",
            "Evaluating State-of-the-Art Treebank-style Parsers for Coh-Metrix and Other Learning Technology Environments.",
            "Identifying off-topic student essays without topic-specific training data.",
            "Correlations between dialogue acts and learning in spoken tutoring dialogues.",
            "A computer-aided environment for generating multiple-choice test items.",
            "Some useful tactics to modify, map and mine data from intelligent tutors.",
            "A detailed comparison of WSD systems: an analysis of the system answers for the SENSEVAL-2 English all words task.",
            "Learning question classifiers: the role of semantic information.",
            "Automated extraction of Tree-Adjoining Grammars from treebanks.",
            "Lucja M. Iwanska and Stuart C. Shapiro, editors. Natural Language Processing and Knowledge Representation: Language for Knowledge and Knowledge for Language. Cambridge: MIT Press, 2000. ISBN 0-262-59021-2 pb, Price $41.46, xviii + 459 pages.",
            "Reading comprehension tests for computer-based understanding evaluation.",
            "The importance of the lexicon in tagging biological text.",
            "An algorithm for the unsupervised learning of morphology.",
            "How much can part-of-speech tagging help parsing?",
            "Industry Watch."
        ]
    },
    {
        "name": "NLE",
        "year": "2005",
        "info": "Volume 11: 2005",
        "count": 26,
        "papers": [
            "Robust parsing with weighted constraints.",
            "A comparison of parsing technologies for the biomedical domain.",
            "Visualization-enabled multi-document summarization by Iterative Residual Rescaling.",
            "Correcting real-word spelling errors by restoring lexical cohesion.",
            "Industry Watch.",
            "Erratum.",
            "Charles D. Yang. Knowledge and Learning in Natural Language. Oxford University Press, 2002. ISBN 0 19 925414 1 (hardback), Price $60. ISBN 0 19 925415 X (paperback), Price $21.95, 220 pages.",
            "Ali Farghlay, editor. Handbook for Language Engineers (CSLI Lecture Notes, No 164). CSLI Publications, Stanford, California. ISBN 1-57586-395-2 £17.50/$25 (paperback), 1-57586-390-0 £44/$62.50 (hardback). xi + 422 pages.",
            "The head-modifier principle and multilingual term extraction.",
            "Finite-state multimodal integration and understanding.",
            "Machine learning-based named entity recognition via effective integration of various evidences.",
            "The Penn Chinese TreeBank: Phrase structure annotation of a large corpus.",
            "Parallel texts.",
            "Exploiting parallel texts in the creation of multilingual semantically annotated resources: the MultiSemCor Corpus.",
            "Constrained EM for parallel text alignment.",
            "Optimization of word alignment clues.",
            "Comparing example-based and statistical machine translation.",
            "Bootstrapping parsers via syntactic projection across parallel texts.",
            "Automatic bilingual lexicon acquisition using random indexing of parallel corpora.",
            "Implementing clarification dialogues in open domain question answering.",
            "A decision-theoretic framework for the evaluation of language models used in speech recognizers.",
            "Segmenting documents by stylistic character.",
            "Paraphrasing spoken Chinese using a paraphrase corpus.",
            "Industry Watch.",
            "Ruslan Mitkov, Anaphora Resolution. Longman, 2002. ISBN 0-582-32505-6. Price £49.99 (hardback). xiii + 220 pages.",
            "Manny Rayner, David Carter, Pierrette Bouillon, Vassilis Digalakis and Mats Wiren, editors. The Spoken Language Translator. Cambridge University Press, 2000. ISBN 0-521-77077-7 Price $70 (hardback). xviii + 337 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "2004",
        "info": "Volume 10: 2004",
        "count": 21,
        "papers": [
            "Robust garden path parsing.",
            "Evaluation of text coherence for electronic essay scoring systems.",
            "Mood and modality: out of theory and into the fray.",
            "Industry watch.",
            "Editorial.",
            "Towards automatic fine-grained semantic classification of verb-noun collocations.",
            "LearningPinocchio: adaptive information extraction for real world applications.",
            "Improving part-of-speech tagging using lexicalized HMMs.",
            "Industry Watch.",
            "Spotting and Discovering Terms through Natural Language Processing by Christian Jacquemin. The MIT Press, 2001. ISBN 0-262-10085-1. £36.50, 378 pages.",
            "Word Sense Disambiguation: The Case for Combinations of Knowledge Sources, by Mark Stevenson. CLSI, 2003. ISBN: 1-57586-390-1, US$25.00 (paperback); 1-57586-389-8 US$67.50 (hardback), xvi + 175 pages.",
            "Verbmobil: Foundations of Speech-to-Speech Translation, by Wolfgang Wahlster (editor). Springer, 2000. ISBN 3-540-67783-6. Price £44.50 (hardback). xii+679 pages.",
            "Software Architecture for Language Engineering.",
            "International standard for a linguistic annotation framework.",
            "A Reference Architecture for Generation Systems.",
            "Implementation architectures for natural language generation.",
            "Large-scale software integration for spoken language and multimodal dialog systems.",
            "The Talent system: TEXTRACT architecture and data model.",
            "UIMA: an architectural approach to unstructured information processing in the corporate research environment.",
            "Evolving GATE to meet new challenges in language engineering.",
            "KIM - a semantic platform for information extraction and retrieval."
        ]
    },
    {
        "name": "NLE",
        "year": "2003",
        "info": "Volume 9: 2003",
        "count": 22,
        "papers": [
            "Finite state methods in natural language processing.",
            "Finite state methods for hyphenation.",
            "Recursion by optimization: on the complexity of bidirectional optimality theory.",
            "Application of finite-state transducers to the acquisition of verb subcategorization information.",
            "An efficient incremental DFA minimization algorithm.",
            "Logical specification of regular relations for NLP.",
            "Lenient morphological analysis.",
            "High-level authoring of illustrated documents.",
            "Mostly-unsupervised statistical segmentation of Japanese kanji sequences.",
            "A portable method for acquiring information extraction patterns without annotated corpora.",
            "A statistical information extraction system for Turkish.",
            "An approach to the formal specification of lingware.",
            "Open-domain textual question answering techniques.",
            "Analysis of the grammatical functions between adnoun and noun phrases in Korean using Support Vector Machines.",
            "Evaluation-driven design of a robust coreference resolution system.",
            "Do all fragments count?",
            "Surface-marker-based dialog modelling: A progress report on the MAREDI project.",
            "A test of the leaf-ancestor metric for parse accuracy.",
            "An augmented template-based approach to text realization.",
            "Industry Watch.",
            "Jean-Claude Junqa and Gertjan van Noord, editors. Robustness in Language and Speech Technology. Kluwer Academic Publishers, 2001. ISBN 0-7923-6790-1 Price $100 (hardback). x + 269 pages.",
            "EuroWordNet: A Multilingual Database with Lexical Semantic Networks: Edited by Piek Vossen. Kluwer Academic Publishers, 1998. ISBN 0792352955, £58/$92, 179 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "2002",
        "info": "Volume 8: 2002",
        "count": 23,
        "papers": [
            "Editorial.",
            "An LVQ connectionist solution to the non-determinacy problem in Arabic morphological analysis: a learning hybrid algorithm.",
            "Word clustering and disambiguation based on co-occurrence data.",
            "SUMMAC: a text summarization evaluation.",
            "Contextually appropriate reference generation.",
            "Christopher D. Manning and Hinrich Schutze. Foundations of Statistical Natural Language Processing. MIT Press, 2000. ISBN 0-262-13360-1, 620 pp. $64.95/£44.95 (cloth).",
            "Robust methods in analysis of natural language data.",
            "Parsing engineering and empirical robustness.",
            "Robustness beyond shallowness: incremental deep parsing.",
            "Full parsing approximation for information extraction via finite-state cascades.",
            "Learning rules for information extraction.",
            "Selecting effective index terms using a decision tree.",
            "A bootstrapping approach for robust topic analysis.",
            "Robust discourse parsing via discourse markers, topicality and position.",
            "Architectural elements of language engineering robustness.",
            "Dedication to William A. Gale.",
            "Introduction to the special issue on evaluating word sense disambiguation systems.",
            "Evaluating sense disambiguation across diverse parameter spaces.",
            "Parameter optimization for machine-learning of word sense disambiguation.",
            "Combining Classifiers for word sense disambiguation.",
            "Word sense disambiguation with pattern learning and automatic feature selection.",
            "The role of domain information in Word Sense Disambiguation.",
            "Evaluating lexical resources using SENSEVAL."
        ]
    },
    {
        "name": "NLE",
        "year": "2001",
        "info": "Volume 7: 2001",
        "count": 24,
        "papers": [
            "Natural language interface to video database.",
            "Automatic language and information processing: rethinking evaluation.",
            "From data to speech: a general approach.",
            "Wolfgang Minker, Alex Waibel, Joseph Mariani. Stochastically-based Semantic Analysis. Kluwer Academic, Boston/Dordrecht/London, 1999. ISBN 0-7923-8571-3 (Hardback). £74.75. xv+221 pages.",
            "Andrew Radford. Syntactic Theory and the Structure of English: A minimalist approach. Cambridge University Press, 1997. £18.95, ISBN 0-521-47707-7. Andrew Radford. Syntax: A minimalist introduction. Cambridge University Press, 1997. £14.95, ISBN 0-521-58914-2.",
            "Emmanuel Roche and Yves Schabes, Editors, Finite-State Language Processing. MIT Press, Cambridge, MA, 1997. ISBN 0-262-18182-7. ix+464 pages.",
            "Richard F. E. Sutcliffe, Heinze-Detlev Koch, Annette McElligott, Industrial Parsing of Software Manuals. Rodopi, Amsterdam, 1996. ISBN 90-420-0102X $28.00.",
            "Randomized rule selection in transformation-based learning: a comparative study.",
            "A natural language system for retrieval of captioned images.",
            "Real-time automatic insertion of accents in French text.",
            "Compound noun segmentation based on lexical data extracted from corpus.",
            "Sake Jager, John Nerbonne and Arthur van Essen (eds). Language Teaching and Language Technology. Swets & Zeitlinger, 1998. ISBN 90-265-1514-6 (hardback). $87.00, 234 pages.",
            "Special Issue on Robust Methods in Analysis of Natural Language Data.",
            "Scalable generation of texts using causal and temporal expansions of sentences.",
            "Applied morphological processing of English.",
            "ILEX: an architecture for a dynamic hypertext generation system.",
            "A corpus-based approach for Korean nominal compound analysis based on linguistic and statistical information.",
            "Ehud Reiter and Robert Dale. Building Natural Language Generation Systems. Cambridge University Press, 2000. $64.95/£37.50 (Hardback), 234 pages.",
            "Inderjeet Mani and Mark T. Maybury (eds). Advances in Automatic Text Summarization. MIT Press, 1999. ISBN 0-262-13359-8, 442 pp. $47.95/£32.95 (paperback).",
            "Natural language question answering: the view from here.",
            "Complex answers: a case study using a WWW question answering system.",
            "Analyses for elucidating current question answering technology.",
            "Discovery of inference rules for question-answering.",
            "The TREC question answering track."
        ]
    },
    {
        "name": "NLE",
        "year": "2000",
        "info": "Volume 6: 2000",
        "count": 23,
        "papers": [
            "Introduction to this Special Issue.",
            "On building a more effcient grammar by exploiting types.",
            "Efficient feature structure operations without compilation.",
            "The LiLFeS Abstract Machine and its evaluation with the LinGO grammar.",
            "An HPSG parser with CFG filtering.",
            "Parser engineering and performance profiling.",
            "PET - a platform for experimentation with efficient HPSG processing techniques.",
            "Appendix: Definitions of typed feature structures.",
            "A lightweight dependency analyzer for partial parsing.",
            "Semantic interpretation of deverbal nominalizations.",
            "Acquisitions and applications of structure preference relations in Chinese.",
            "A lexicalist approach towards the automatic determination for the syntactic functions of prepositional phrases.",
            "Kevin Gurney, An Introduction to Neural Networks, University College London (UCL) Press, 1997. ISBN 1-85728-673-1 HB. £14.95. xi+234 pages.",
            "Best practice in spoken language dialogue systems engineering: Introduction to the special issue.",
            "An architecture for a generic dialogue shell.",
            "User-guided system development in Interactive Spoken Language Education.",
            "Usability issues in spoken dialogue systems.",
            "Speech technology on trial: Experiences from the August system.",
            "Towards a tool for the Subjective Assessment of Speech System Interfaces (SASSI).",
            "Towards best practice in the development and evaluation of speech recognition components of a spoken language dialog system.",
            "Information state and dialogue management in the TRINDI dialogue move engine toolkit.",
            "Object-oriented modelling of spoken language dialogue systems.",
            "Towards developing general models of usability with PARADISE."
        ]
    },
    {
        "name": "NLE",
        "year": "1999",
        "info": "Volume 5: 1999",
        "count": 24,
        "papers": [
            "A definition and short history of Language Engineering.",
            "Applications of term identification technology: domain description and content characterisation.",
            "Robust grammatical analysis for spoken dialogue systems.",
            "The Verbmobil prototype system - a software engineering perspective.",
            "Distinguishing systems and distinguishing senses: new evaluation methods for Word Sense Disambiguation.",
            "Matching the tagging to the task.",
            "A corpus-based bootstrapping algorithm for Semi-Automated semantic lexicon construction.",
            "Verb sense disambiguation based on dual distributional similarity.",
            "Semantic tagging of unknown proper nouns.",
            "Recognizing subjectivity: a case study in manual tagging.",
            "SENSE: an analogy-based Word Sense Disambiguation system.",
            "An approach to program understanding by natural language understanding.",
            "Routing email automatically by purpose not topic.",
            "A reestimation algorithm for probabilistic dependency grammars.",
            "Parsing with discontinuous phrases.",
            "Roger Garside, Geoffrey Leech, Anthony McEnery (eds). Corpus Annotation: Linguistic Information from Computer Text Corpora. Longman, 1997. ISBN 0-582-29837-7 (Paperback). £26.00, 281 pages.",
            "Ronnie W. Smith and D. Richard Hipp, Spoken Natural Dialog Systems: A Practical Approach. Oxford: Oxford University Press, 1994. Price £45.00 ISBN 0-19-509187-6.",
            "Dafydd Gibbon, Roger Moore, and Richard Winski (eds). Handbook of Standards and Resources for Spoken Language Systems. Mouton de Gruyter, 1997. ISBN 3-11-015366-1. DM 298. xxx+886 pages.",
            "Context-sensitive spoken dialogue processing with the DOP model.",
            "MLDS: A translator-oriented MultiLingual dictionary system.",
            "Topic-based mixture language modelling.",
            "Evaluating two methods for Treebank grammar compaction.",
            "Nomi Erteschik-Shir, The Dynamics of Focus Structure. Cambridge: Cambridge University Press, 1997. ISBN 0 521 59217 8, Price £40.00/$64.96 (hardback), 280+xiv pages.",
            "Jennifer Pearson. Terms in Context. John Benjamins Publishing Co., Amsterdam, 1998. ISBN 90 272 2269 X (Eur.)/1 55619 342 (US). $69.00. xiii+243 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "1998",
        "info": "Volume 4: 1998",
        "count": 35,
        "papers": [
            "The rôle of natural language processing in alternative and augmentative communication.",
            "Interpretation of iconic utterances based on contents representation: Semantic analysis in the PVI system.",
            "Using semantic lexicons for full text message retrieval in a communication aid.",
            "A script-based AAC system for transactional interaction.",
            "Compansion: From research prototype to practical integration.",
            "A dependency-based method for evaluating broad-coverage parsers.",
            "Tactical generation in a free constituent order language.",
            "The grammar of sense: Using part-of-speech tags as a first step in semantic disambiguation.",
            "The DINOUS parser.",
            "Frank Palmer, editor. Grammar and Meaning: Essays in Honour of Sir John Lyons. Cambridge: Cambridge University Press, 1995. ISBN: 0 521 46221 5, £37.50 (hardback), 265+xiii pages.",
            "Karen Sparck Jones and Julia Galliers, Evaluating Natural Language Processing Systems: An Analysis and Review. Berlin: Springer-Verlag, 1996. ISBN 3 540 61309 9, Price DM54.00 (paperback), 228 pages.",
            "Yorick A. Wilks, Brian M. Slator and Louise M. Guthrie, Electric Words: Dictionaries, Computers and Meanings. Cambridge, MA: MIT Press, 1996. ISBN 0 262 23182 4, £24.95 (hardback), ix+289 pages.",
            "Nancy Ide and Jean Veronis, Text Encoding Initiative: Background and Context. Dordrecht: Kluwer Academic, 1995. ISBN 0 7923 3704 2, US$45.00 (paperback), US$99.00 (hardback). (Reprinted from Computers and the Humanities 29, 1-3, 1995.).",
            "Lila Gleitman and Barbara Landau, The Acquisition of the Lexicon. MIT Press, 1994. ISBN: 9 780262 571099, Price: £33.95.",
            "Bas Aarts and Charles F. Meyer, editors, The Verb in Contemporary English: Theory and Description. Cambridge: Cambridge University Press, 1995. ISBN 0 521 46039 5, $37.50/$59.95 (hardback, 313 pages).",
            "Michael L. Geis, Speech Acts and Conversational Interaction. Cambridge: Cambridge University Press, 1995. ISBN 0 521 46499 4 (hardback). £37.50. xiv+248 pages.",
            "A fast method for statistical grammar induction.",
            "Validating the TEMAA LE evaluation methodology: a case study on Danish spelling checkers.",
            "Time, tense and aspect in natural language database interfaces.",
            "Jennifer Cole, Georgia M. Green and Jerry L. Morgan, editors, Linguistics and Computation. CLSI Lecture Notes no 52. Stanford, CA: CLSI, 1995. ISBN 1 881526 81 X, £14.95, xi+296 pages.",
            "Maria Manzano, Extensions of First Order Logic. Cambridge Tracts in Theoretical Computer Science 19. Cambridge, UK: Cambridge University Press (1996). ISBN 0-521-35435-8. xxii+388 pages.",
            "Yoshinori Sagisaka, Nick Campbell and Norio Higuchi (eds.), Computing Prosody: Computational Models for Processing Spontaneous Speech. New York: Springer-Verlag, 1997. ISBN 0-387-94804-X, xvii+401pp.",
            "James Pustejovsky, The Generative Lexicon. Cambridge (Mass.): MIT Press, 1995. ISBN 0 626 16158 3, £29.50 sterling. xiv+298 pages.",
            "Linguistic issues in the development of ReGra: A grammar checker for Brazilian Portuguese.",
            "Splitting-merging model of Chinese word tokenization and segmentation.",
            "Finding a domain-appropriate sense inventory for semantically tagging a corpus.",
            "Understanding pronominal references to quantified expressions.",
            "D. Arnold, L. Balkan, R. Lee Humphries, S. Meijer and L. Sadler. Machine Translation: an Introductory Guide. NCC Blackwell, Oxford, 1994. (Hardback ISBN 1-85554-246-3 $49.95/£40.00; Paperback ISBN 1-85554-217-X $19.95/£18.99) viii+240 pages.",
            "Alex Alsina. The Role of Argument Structure in Grammar: Evidence from Romance. Stanford, California: CSLI, 1996. ISBN 1-57586-035-X (hardback), 1-57586-034-1 (paperback). Price £14.95/US $24.95 (paperback), £40.00 (hardback), 306 pages.",
            "Jerry Seligman and Dag Westerstahl, editors. Logic, Language and Computation, vol 1. Stanford, California: CSLI, 1996. ISBN 1-881526-89-5. US $22.95.",
            "Georgia M. Green and Jerry L. Morgan, Practical Guide to Syntactic Analysis. CSLI Publications, 1996. ISBN 1-57586-016-3. £13.95, 114 pages.",
            "J. B. Paris, The Uncertain Reasoner's Companion: A Mathematical Perspective. Cambridge University Press, Cambridge, 1994. ISBN 0-521-46089-1.",
            "Daniel Jones, Analogical Natural Language Processing. London, UK: UCL Press, 1996. ISBN 1 85728 218 3, £35.00 (hard-back), 155 pages.",
            "Sidney Greenbaum (ed.), Comparing English Worldwide: The International Corpus of English. Oxford: Clarendon Press, 1996. ISBN 0-19-823582-8, xvi+286 pages.",
            "Jaap van der Does and Jan van Eijk, editors. Quantifiers, Logic, and Language. CSLI (Center for the Study of Language and Information) Lecture Notes, No, 54. Stanford, California: CSLI Publications (distributed by Cambridge University Press), 1996. ISBN 1-57586-001-5 (hardback), 1-57586-000-7 (paperback). Price $69.95 (hardback), $24.95 (paperback). vii+424 pages."
        ]
    },
    {
        "name": "NLE",
        "year": "1997",
        "info": "Volume 3: 1997",
        "count": 18,
        "papers": [
            "High-performance bilingual text alignment using statistical and dictionary information.",
            "Enabling technology for multilingual natural language generation: the KPML development environment.",
            "Building applied natural language generation systems.",
            "D. Jones, Analogical Natural Language Processing. UCL Press, London, 1996. ISBN 1-85728-218-3, £35.00.",
            "John Lyons, Linguistic Semantics: An Introduction. Cambridge, UK: Cambridge University Press, 1995. ISBN 0 521 43877 2 (paperback). ISBN 0 521 43302 9, Price £35.00 (hardback). xvii+376 pages.",
            "Lawrence A. Bookman, Trajectories Through Knowledge Space: A Dynamic Framework for Machine Comprehension. Boston, Dordrecht, London: Kluwer, 1994. ISBN 0-7923-9487-9, £62.95/$89.85 271 pp.",
            "Knowledge representation for natural language processing in implemented systems.",
            "A model for habitable and efficient dialogue management for natural language interaction.",
            "Uniform knowledge representation for language processing in the B2 system.",
            "Using a semantic network for information extraction.",
            "TextNet - A text-based intelligent system.",
            "Recovering nonlinearly distributed knowledge: Computing discourse structure in factual reports.",
            "Restricted representation of phrase structure grammar for building a tree annotated corpus of Korean.",
            "NKRL, a knowledge representation tool for encoding the 'meaning' of complex narrative texts.",
            "Example retrieval from a translation memory.",
            "Systematic construction of a versatile case system.",
            "ARIES: A lexical platform for engineering Spanish processing tools.",
            "Keith Devlin, Logic and Information. Cambridge, UK: Cambridge University Press, 1991. ISBN 0-521-49971-2, £19.95 (paperback) 0-521-41031-4 (hardback)."
        ]
    },
    {
        "name": "NLE",
        "year": "1996",
        "info": "Volume 2: 1996",
        "count": 35,
        "papers": [
            "Efficient generation of random sentences.",
            "Distribution of content words and phrases in text and language modelling.",
            "On some applications of finite-state automata theory to natural language processing.",
            "F. R. Palmer, Grammatical Roles and Relations. Cambridge: Cambridge University Press, 1994. ISBN 0 521 45836 6, £12.95 (paperback).",
            "M. Kanazawa, and C. Pinon (editors), Dynamics, Polarity and Quantification. Stanford, CA: CSLI Publications, 1994. ISBN 1 881 52642 0, £17.95/US$22.95 (paperback). ISBN 1 881 52642 9, £35.00/US$45.00 (hardback).",
            "Madeleine Bates and Ralph M. Weischedel (editors), Challenges in Natural Language Processing. Cambridge: Cambridge University Press, 1993. ISBN 0521 41015 0, US$54.95 (hardback), 307 pp.",
            "John Nerbonne, Klaus Netter and Carl Pollard (editors), German in Head-Driven Phrase Structure Grammar. Stanford, CA: CSLI, 1994. ISBN 1 881 52630 5, £16.95/US$21.95 (paperback). £40.00/US$49.95 (hardback).",
            "K. J. Holyoak and P. Thagard, Mental Leaps: Analogy in Creative Thought. Cambridge, MA: Bradford Book, MIT Press, 1995. ISBN 0 262 08233 0, £19.95 (hardback), 320 pp.",
            "Fuzzy network model for part-of-speech tagging under small training data.",
            "Unsupervised learning of part-of-speech guessing rules.",
            "An automated system that assists in the generation of document indexes.",
            "NL-OOPS: from natural language to object oriented requirements using the natural language processing system LOLITA.",
            "Barry J. Blake, Case. Cambridge: Cambridge University Press, 1994. ISBN 0521 44661 9 (paperback), 0521 44114 5 (hardback). xvii + 229 pp.",
            "Towards an adaptive natural language interface to command languages.",
            "Prototype of a second language writing tool for French speakers writing in English.",
            "Constructing an intelligent dictionary help system.",
            "Interpreting communicative acts and building a conversation model.",
            "Donald E. Walker, Antonio Zampolli and Nicoletta Calzolari, (editors), Automating the Lexicon: Research and Practice in a Multilingual Environment. Oxford: Oxford University Press, 1995. ISBN 0 19 823950 5, £50.00 (hardback). xi + 413 pp.",
            "Maureen Caudill, In Our Own Image: Building an Artificial Person. Oxford University Press, 1992. ISBN 0-19-508672-4 (paperback). ISBN 0-19-507338-X $13.95 (hardback), 242 pp.",
            "Scott R. Turner, The Creative Process. A Computer Model of Storytelling and Creativity. Hillsdale, NJ: Lawrence Erlbaum, 1994. ISBN 0-8058-1576-7, £49.95, 298 pp.",
            "Extended finite state models of language.",
            "A parser from antiquity.",
            "Implementing and using finite automata toolkits.",
            "Finite state morphology and formal verification.",
            "Regular expressions for language engineering.",
            "The Japanese lexical transducer based on stem-suffix style forms.",
            "Finite state morphology and information retrieval.",
            "Partial parsing via finite-state cascades.",
            "Transducer parsing of free and frozen sentences.",
            "Text and speech translation by means of subsequential transducers.",
            "Finite state segmentation of discourse into clauses.",
            "Between finite state and Prolog: constraint-based automata for efficient recognition of phrases.",
            "Explanation-based learning and finite state transducers: applications to parsing lexicalized tree adjoining grammars.",
            "Multilingual text analysis for text-to-speech synthesis.",
            "An innovative finite state concept for recognition and parsing of context-free languages."
        ]
    },
    {
        "name": "NLE",
        "year": "1995",
        "info": "Volume 1: 1995",
        "count": 22,
        "papers": [
            "Editorial.",
            "Technical terminology: some linguistic properties and an algorithm for identification in text.",
            "Natural language interfaces to databases - an introduction.",
            "Natural language processing in an operational clinical information system.",
            "Patrick O'Neil, Database Principles, Programming, and Performance. San Francisco, CA: Morgan Kaufmann, 1994, 800 pages. ISBN 1 55860 219 4.",
            "G. Adriaens and U. Hahn (eds.), Parallel Natural Language Processing. Norwood, NJ: Ablex, 1994. $79.50. ISBN 0 89391 869 5.",
            "Several knowledge models and a blackboard memory for human-machine robust dialogues.",
            "Best parse parsing with Earley's and Inside algorithms on probabilistic RTN.",
            "Poisson mixtures.",
            "A rule-based phrase parser for real-time text-to-speech synthesis.",
            "Ray C. Dougherty, Natural Language Computing: An English Generative Grammar in Prolog. Hillsdale, NJ: Lawrence Erlbaum, 1994, 349 pages. ISBN 0 8058 1525 2 (hardback), 0 8058 1526 0 (paperback). $69 (hardback), $36 (paperback).",
            "Anaphora and ellipsis in artificial languages.",
            "Russian morphology: An engineering approach.",
            "Syntactic Analysis of Hebrew Sentences.",
            "A hierarchical Dirichlet language model.",
            "High speed feature unification and parsing.",
            "Engineering \"word experts\" for word disambiguation.",
            "POETIC: A system for gathering and disseminating traffic information.",
            "Peter Flach Simply Logical: Intelligent Reasoning by Example. Chichester, UK: John Wiley & Sons, 1994. ISBN 0 471 94152 2, £27.95.",
            "E. Ashcroft, A. Faustini, Anthony, R. Jagannathan and W. Wadge, Multi-dimensional programming. New York, NY: Oxford University Press, 1995. ISBN 019 507597 8, £40.00.",
            "Aaron Halpern On the Placement and Morphology of Clitics, Stanford, CA, 1995. ISBN 1 881 52660 7, £17.95 (paperback). ISBN 1 881 52661 5, £35.00 (hardback).",
            "Douglas Biber Dimensions of Register Variation: A Cross-linguistic Comparision. Cambridge University Press, 1995. ISBN 0 521 47331 4, £37.50 (hardback), 444pp."
        ]
    }
]