[
    {
        "year": "2021",
        "name": "NLPCC 2021",
        "info": "Qingdao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2021-1",
                "sub_name": "Natural Language Processing and Chinese Computing - 10th CCF International Conference, NLPCC 2021, Qingdao, China, October 13-17, 2021, Proceedings, Part I.",
                "count": 66,
                "papers": [
                    "Coreference Resolution: Are the Eliminated Spans Totally Worthless?",
                    "Chinese Macro Discourse Parsing on Dependency Graph Convolutional Network.",
                    "Predicting Categorial Sememe for English-Chinese Word Pairs via Representations in Explainable Sememe Space.",
                    "Multi-level Cohesion Information Modeling for Better Written and Dialogue Discourse Parsing.",
                    "ProPC: A Dataset for In-Domain and Cross-Domain Proposition Classification Tasks.",
                    "CTRD: A Chinese Theme-Rheme Discourse Dataset.",
                    "Learning to Select Relevant Knowledge for Neural Machine Translation.",
                    "Contrastive Learning for Machine Translation Quality Estimation.",
                    "Sentence-State LSTMs For Sequence-to-Sequence Learning.",
                    "Guwen-UNILM: Machine Translation Between Ancient and Modern Chinese Based on Pre-Trained Models.",
                    "Adaptive Transformer for Multilingual Neural Machine Translation.",
                    "Improving Non-autoregressive Machine Translation with Soft-Masking.",
                    "AutoNLU: Architecture Search for Sentence and Cross-sentence Attention Modeling with Re-designed Search Space.",
                    "AutoTrans: Automating Transformer Design via Reinforced Architecture Search.",
                    "A Word-Level Method for Generating Adversarial Examples Using Whole-Sentence Information.",
                    "RAST: A Reward Augmented Model for Fine-Grained Sentiment Transfer.",
                    "Pre-trained Language Models for Tagalog with Multi-source Data.",
                    "Accelerating Pretrained Language Model Inference Using Weighted Ensemble Self-distillation.",
                    "Employing Sentence Compression to Improve Event Coreference Resolution.",
                    "BRCEA: Bootstrapping Relation-Aware Cross-Lingual Entity Alignment.",
                    "Employing Multi-granularity Features to Extract Entity Relation in Dialogue.",
                    "Attention Based Reinforcement Learning with Reward Shaping for Knowledge Graph Reasoning.",
                    "Entity-Aware Relation Representation Learning for Open Relation Extraction.",
                    "ReMERT: Relational Memory-Based Extraction for Relational Triples.",
                    "Recognition of Nested Entity with Dependency Information.",
                    "HAIN: Hierarchical Aggregation and Inference Network for Document-Level Relation Extraction.",
                    "Incorporate Lexicon into Self-training: A Distantly Supervised Chinese Medical NER.",
                    "Diversified Paraphrase Generation with Commonsense Knowledge Graph.",
                    "Explore Coarse-Grained Structures for Syntactically Controllable Paraphrase Generation.",
                    "Chinese Poetry Generation with Metrical Constraints.",
                    "CNewSum: A Large-Scale Summarization Dataset with Human-Annotated Adequacy and Deducibility Level.",
                    "Question Generation from Code Snippets and Programming Error Messages.",
                    "Extractive Summarization of Chinese Judgment Documents via Sentence Embedding and Memory Network.",
                    "ThinkTwice: A Two-Stage Method for Long-Text Machine Reading Comprehension.",
                    "EviDR: Evidence-Emphasized Discrete Reasoning for Reasoning Machine Reading Comprehension.",
                    "Knowledge-Grounded Dialogue with Reward-Driven Knowledge Selection.",
                    "Multi-intent Attention and Top-k Network with Interactive Framework for Joint Multiple Intent Detection and Slot Filling.",
                    "Enhancing Long-Distance Dialogue History Modeling for Better Dialogue Ellipsis and Coreference Resolution.",
                    "Exploiting Explicit and Inferred Implicit Personas for Multi-turn Dialogue Generation.",
                    "Few-Shot NLU with Vector Projection Distance and Abstract Triangular CRF.",
                    "Cross-domain Slot Filling with Distinct Slot Entity and Type Prediction.",
                    "Semantic Enhanced Dual-Channel Graph Communication Network for Aspect-Based Sentiment Analysis.",
                    "Highway-Based Local Graph Convolution Network for Aspect Based Sentiment Analysis.",
                    "Dual Adversarial Network Based on BERT for Cross-domain Sentiment Classification.",
                    "Syntax and Sentiment Enhanced BERT for Earliest Rumor Detection.",
                    "Aspect-Sentiment-Multiple-Opinion Triplet Extraction.",
                    "Locate and Combine: A Two-Stage Framework for Aspect-Category Sentiment Analysis.",
                    "Emotion Classification with Explicit and Implicit Syntactic Information.",
                    "MUMOR: A Multimodal Dataset for Humor Detection in Conversations.",
                    "Advertisement Extraction from Content Marketing Articles via Segment-Aware Sentence Classification.",
                    "Leveraging Lexical Common-Sense Knowledge for Boosting Bayesian Modeling.",
                    "Aggregating Inter-viewpoint Relationships of User's Review for Accurate Recommendation.",
                    "A Residual Dynamic Graph Convolutional Network for Multi-label Text Classification.",
                    "Sentence Ordering by Context-Enhanced Pairwise Comparison.",
                    "A Dual-Attention Neural Network for Pun Location and Using Pun-Gloss Pairs for Interpretation.",
                    "A Simple Baseline for Cross-Domain Few-Shot Text Classification.",
                    "Shared Component Cross Punctuation Clauses Recognition in Chinese.",
                    "BERT-KG: A Short Text Classification Model Based on Knowledge Graph and Deep Semantics.",
                    "Uncertainty-Aware Self-paced Learning for Grammatical Error Correction.",
                    "Metaphor Recognition and Analysis via Data Augmentation.",
                    "Exploring Generalization Ability of Pretrained Language Models on Arithmetic and Logical Reasoning.",
                    "Skeleton-Based Sign Language Recognition with Attention-Enhanced Graph Convolutional Networks.",
                    "XGPT: Cross-modal Generative Pre-Training for Image Captioning.",
                    "An Object-Extensible Training Framework for Image Captioning.",
                    "Relation-Aware Multi-hop Reasoning forVisual Dialog.",
                    "Multi-modal Sarcasm Detection Based on Contrastive Attention Mechanism."
                ]
            },
            {
                "sub_name_abbr": "conf/nlpcc/2021-2",
                "sub_name": "Natural Language Processing and Chinese Computing - 10th CCF International Conference, NLPCC 2021, Qingdao, China, October 13-17, 2021, Proceedings, Part II.",
                "count": 50,
                "papers": [
                    "Syntax and Coherence - The Effect on Automatic Argument Quality Assessment.",
                    "ExperienceGen 1.0: A Text Generation Challenge Which Requires Deduction and Induction Ability.",
                    "SynXLM-R: Syntax-Enhanced XLM-R in Translation Quality Estimation.",
                    "Memetic Federated Learning for Biomedical Natural Language Processing.",
                    "Event Argument Extraction via a Distance-Sensitive Graph Convolutional Network.",
                    "Exploit Vague Relation: An Augmented Temporal Relation Corpus and Evaluation.",
                    "Searching Effective Transformer for Seq2Seq Keyphrase Generation.",
                    "Prerequisite Learning with Pre-trained Language and Graph Embedding Models.",
                    "Variational Autoencoder with Interactive Attention for Affective Text Generation.",
                    "CUSTOM: Aspect-Oriented Product Summarization for E-Commerce.",
                    "FABERT: A Feature Aggregation BERT-Based Model for Document Reranking.",
                    "Generating Relevant, Correct and Fluent Answers in Natural Answer Generation.",
                    "GeoCQA: A Large-Scale Geography-Domain Chinese Question Answering Dataset from Examination.",
                    "Generating Informative Dialogue Responses with Keywords-Guided Networks.",
                    "Zero-Shot Deployment for Cross-Lingual Dialogue System.",
                    "MultiWOZ 2.3: A Multi-domain Task-Oriented Dialogue Dataset Enhanced with Annotation Corrections and Co-Reference Annotation.",
                    "EmoDialoGPT: Enhancing DialoGPT with Emotion.",
                    "BERT-Based Meta-Learning Approach with Looking Back for Sentiment Analysis of Literary Book Reviews.",
                    "ISWR: An Implicit Sentiment Words Recognition Model Based on Sentiment Propagation.",
                    "An Aspect-Centralized Graph Convolutional Network for Aspect-Based Sentiment Classification.",
                    "Capturing Global Informativeness in Open Domain Keyphrase Extraction.",
                    "Background Semantic Information Improves Verbal Metaphor Identification.",
                    "Towards Unifying the Explainability Evaluation Methods for NLP.",
                    "Detecting Covariate Drift with Explanations.",
                    "A Data-Centric Approach Towards Deducing Bias in Artificial Intelligence Systems for Textual Contexts.",
                    "Enhancing Model Robustness via Lexical Distilling.",
                    "Multi-stage Multi-modal Pre-training for Video Representation.",
                    "Nested Causality Extraction on Traffic Accident Texts as Question Answering.",
                    "MSDF: A General Open-Domain Multi-skill Dialog Framework.",
                    "RoKGDS: A Robust Knowledge Grounded Dialog System.",
                    "Enhanced Few-Shot Learning with Multiple-Pattern-Exploiting Training.",
                    "BIT-Event at NLPCC-2021 Task 3: Subevent Identification via Adversarial Training.",
                    "Few-Shot Learning for Chinese NLP Tasks.",
                    "When Few-Shot Learning Meets Large-Scale Knowledge-Enhanced Pre-training: Alibaba at FewCLUE.",
                    "TKB2ert: Two-Stage Knowledge Infused Behavioral Fine-Tuned BERT.",
                    "A Unified Information Extraction System Based on Role Recognition and Combination.",
                    "An Effective System for Multi-format Information Extraction.",
                    "A Hierarchical Sequence Labeling Model for Argument Pair Extraction.",
                    "Distant Finetuning with Discourse Relations for Stance Classification.",
                    "The Solution of Xiaomi AI Lab to the 2021 Language and Intelligence Challenge: Multi-format Information Extraction Task.",
                    "A Unified Platform for Information Extraction with Two-Stage Process.",
                    "Overview of the NLPCC 2021 Shared Task: AutoIE2.",
                    "Task 1 - Argumentative Text Understanding for AI Debater (AIDebater).",
                    "Two Stage Learning for Argument Pairs Extraction.",
                    "Overview of Argumentative Text Understanding for AI Debater Challenge.",
                    "ACE: A Context-Enhanced Model for Interactive Argument Pair Identification.",
                    "Context-Aware and Data-Augmented Transformer for Interactive Argument Pair Identification.",
                    "ARGUABLY @ AI Debater-NLPCC 2021 Task 3: Argument Pair Extraction from Peer Review and Rebuttals.",
                    "Sentence Rewriting for Fine-Tuned Model Based on Dictionary: Taking the Track 1 of NLPCC 2021 Argumentative Text Understanding for AI Debater as an Example.",
                    "Knowledge Enhanced Transformers System for Claim Stance Classification."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "NLPCC 2020",
        "info": "Zhengzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2020-1",
                "sub_name": "Natural Language Processing and Chinese Computing - 9th CCF International Conference, NLPCC 2020, Zhengzhou, China, October 14-18, 2020, Proceedings, Part I.",
                "count": 66,
                "papers": [
                    "FAQ-Based Question Answering via Knowledge Anchors.",
                    "Deep Hierarchical Attention Flow for Visual Commonsense Reasoning.",
                    "Dynamic Reasoning Network for Multi-hop Question Answering.",
                    "Memory Attention Neural Network for Multi-domain Dialogue State Tracking.",
                    "Learning to Answer Word-Meaning-Explanation Questions for Chinese Gaokao Reading Comprehension.",
                    "Enhancing Multi-turn Dialogue Modeling with Intent Information for E-Commerce Customer Service.",
                    "Robust Spoken Language Understanding with RL-Based Value Error Recovery.",
                    "A Large-Scale Chinese Short-Text Conversation Dataset.",
                    "DVDGCN: Modeling Both Context-Static and Speaker-Dynamic Graph for Emotion Recognition in Multi-speaker Conversations.",
                    "Nominal Compound Chain Extraction: A New Task for Semantic-Enriched Lexical Chain.",
                    "A Hybrid Model for Community-Oriented Lexical Simplification.",
                    "Multimodal Aspect Extraction with Region-Aware Alignment Network.",
                    "NER in Threat Intelligence Domain with TSFL.",
                    "Enhancing the Numeracy of Word Embeddings: A Linear Algebraic Perspective.",
                    "Is POS Tagging Necessary or Even Helpful for Neural Dependency Parsing?",
                    "A Span-Based Distantly Supervised NER with Self-learning.",
                    "A Passage-Level Text Similarity Calculation.",
                    "Using Active Learning to Improve Distantly Supervised Entity Typing in Multi-source Knowledge Bases.",
                    "TransBidiFilter: Knowledge Embedding Based on a Bidirectional Filter.",
                    "Applying Model Fusion to Augment Data for Entity Recognition in Legal Documents.",
                    "Combining Knowledge Graph Embedding and Network Embedding for Detecting Similar Mobile Applications.",
                    "CMeIE: Construction and Evaluation of Chinese Medical Information Extraction Dataset.",
                    "Document-Level Event Subject Pair Recognition.",
                    "Knowledge Enhanced Opinion Generation from an Attitude.",
                    "MTNE: A Multitext Aware Network Embedding for Predicting Drug-Drug Interaction.",
                    "Learning to Generate Representations for Novel Words: Mimic the OOV Situation in Training.",
                    "Reinforcement Learning for Named Entity Recognition from Noisy Data.",
                    "Flexible Parameter Sharing Networks.",
                    "An Investigation on Different Underlying Quantization Schemes for Pre-trained Language Models.",
                    "A Survey of Sentiment Analysis Based on Machine Learning.",
                    "Incorporating Named Entity Information into Neural Machine Translation.",
                    "Non-autoregressive Neural Machine Translation with Distortion Model.",
                    "Incorporating Phrase-Level Agreement into Neural Machine Translation.",
                    "Improving Unsupervised Neural Machine Translation with Dependency Relationships.",
                    "Incorporating Knowledge and Content Information to Boost News Recommendation.",
                    "Multi-domain Transfer Learning for Text Classification.",
                    "A Cross-Layer Connection Based Approach for Cross-Lingual Open Question Answering.",
                    "Learning to Consider Relevance and Redundancy Dynamically for Abstractive Multi-document Summarization.",
                    "A Submodular Optimization-Based VAE-Transformer Framework for Paraphrase Generation.",
                    "MixLab: An Informative Semi-supervised Method for Multi-label Classification.",
                    "A Noise Adaptive Model for Distantly Supervised Relation Extraction.",
                    "CLTS: A New Chinese Long Text Summarization Dataset.",
                    "Lightweight Multiple Perspective Fusion with Information Enriching for BERT-Based Answer Selection.",
                    "Stance Detection with Stance-Wise Convolution Network.",
                    "Emotion-Cause Joint Detection: A Unified Network with Dual Interaction for Emotion Cause Analysis.",
                    "Incorporating Temporal Cues and AC-GCN to Improve Temporal Relation Classification.",
                    "Event Detection with Document Structure and Graph Modelling.",
                    "AFPun-GAN: Ambiguity-Fluency Generative Adversarial Network for Pun Generation.",
                    "Author Name Disambiguation Based on Rule and Graph Model.",
                    "Opinion Transmission Network for Jointly Improving Aspect-Oriented Opinion Words Extraction and Sentiment Classification.",
                    "Label-Wise Document Pre-training for Multi-label Text Classification.",
                    "Hierarchical Sequence Labeling Model for Aspect Sentiment Triplet Extraction.",
                    "Knowledge-Aware Method for Confusing Charge Prediction.",
                    "Aggressive Language Detection with Joint Text Normalization via Adversarial Multi-task Learning.",
                    "A Cross-Modal Classification Dataset on Social Network.",
                    "Sentiment Analysis on Chinese Weibo Regarding COVID-19.",
                    "Pairwise Causality Structure: Towards Nested Causality Mining on Financial Statements.",
                    "Word Graph Network: Understanding Obscure Sentences on Social Media for Violation Comment Detection.",
                    "Data Augmentation with Reinforcement Learning for Document-Level Event Coreference Resolution.",
                    "An End-to-End Multi-task Learning Network with Scope Controller for Emotion-Cause Pair Extraction.",
                    "Clue Extraction for Fine-Grained Emotion Analysis.",
                    "Multi-domain Sentiment Classification on Self-constructed Indonesian Dataset.",
                    "Extracting the Collaboration of Entity and Attribute: Gated Interactive Networks for Aspect Sentiment Analysis.",
                    "Sentence Constituent-Aware Aspect-Category Sentiment Analysis with Graph Attention Networks.",
                    "SciNER: A Novel Scientific Named Entity Recognizing Framework.",
                    "Learning Multilingual Topics with Neural Variational Inference."
                ]
            },
            {
                "sub_name_abbr": "conf/nlpcc/2020-2",
                "sub_name": "Natural Language Processing and Chinese Computing - 9th CCF International Conference, NLPCC 2020, Zhengzhou, China, October 14-18, 2020, Proceedings, Part II.",
                "count": 48,
                "papers": [
                    "DCA: Diversified Co-attention Towards Informative Live Video Commenting.",
                    "The Sentencing-Element-Aware Model for Explainable Term-of-Penalty Prediction.",
                    "Referring Expression Generation via Visual Dialogue.",
                    "Hierarchical Multimodal Transformer with Localness and Speaker Aware Attention for Emotion Recognition in Conversations.",
                    "Generating Emotional Social Chatbot Responses with a Consistent Speaking Style.",
                    "An Interactive Two-Pass Decoding Network for Joint Intent Detection and Slot Filling.",
                    "RuKBC-QA: A Framework for Question Answering over Incomplete KBs Enhanced with Rules Injection.",
                    "Syntax-Guided Sequence to Sequence Modeling for Discourse Segmentation.",
                    "Macro Discourse Relation Recognition via Discourse Argument Pair Graph.",
                    "Dependency Parsing with Noisy Multi-annotation Data.",
                    "Joint Bilinear End-to-End Dependency Parsing with Prior Knowledge.",
                    "Multi-layer Joint Learning of Chinese Nested Named Entity Recognition Based on Self-attention Mechanism.",
                    "Adversarial BiLSTM-CRF Architectures for Extra-Propositional Scope Resolution.",
                    "Analyzing Relational Semantics of Clauses in Chinese Discourse Based on Feature Structure.",
                    "Efficient Lifelong Relation Extraction with Dynamic Regularization.",
                    "Collective Entity Disambiguation Based on Deep Semantic Neighbors and Heterogeneous Entity Correlation.",
                    "Boosting Cross-lingual Entity Alignment with Textual Embedding.",
                    "Label Embedding Enhanced Multi-label Sequence Generation Model.",
                    "Ensemble Distilling Pretrained Language Models for Machine Translation Quality Estimation.",
                    "Weaken Grammatical Error Influence in Chinese Grammatical Error Correction.",
                    "Encoding Sentences with a Syntax-Aware Self-attention Neural Network for Emotion Distribution Prediction.",
                    "Hierarchical Multi-view Attention for Neural Review-Based Recommendation.",
                    "Negative Feedback Aware Hybrid Sequential Neural Recommendation Model.",
                    "MSReNet: Multi-step Reformulation for Open-Domain Question Answering.",
                    "ProphetNet-Ads: A Looking Ahead Strategy for Generative Retrieval Models in Sponsored Search Engine.",
                    "LARQ: Learning to Ask and Rewrite Questions for Community Question Answering.",
                    "Abstractive Summarization via Discourse Relation and Graph Convolutional Networks.",
                    "Chinese Question Classification Based on ERNIE and Feature Fusion.",
                    "An Abstractive Summarization Method Based on Global Gated Dual Encoder.",
                    "Rumor Detection on Hierarchical Attention Network with User and Sentiment Information.",
                    "Measuring the Semantic Stability of Word Embedding.",
                    "Task-to-Task Transfer Learning with Parameter-Efficient Adapter.",
                    "Key-Elements Graph Constructed with Evidence Sentence Extraction for Gaokao Chinese.",
                    "Knowledge Inference Model of OCR Conversion Error Rules Based on Chinese Character Construction Attributes Knowledge Graph.",
                    "Interpretable Machine Learning Based on Integration of NLP and Psychology in Peer-to-Peer Lending Risk Evaluation.",
                    "Algorithm Bias Detection and Mitigation in Lenovo Face Recognition Engine.",
                    "Path-Based Visual Explanation.",
                    "Feature Store for Enhanced Explainability in Support Ticket Classification.",
                    "Incorporating Lexicon for Named Entity Recognition of Traditional Chinese Medicine Books.",
                    "Anaphora Resolution in Chinese for Analysis of Medical Q&A Platforms.",
                    "Weighted Pre-trained Language Models for Multi-Aspect-Based Multi-Sentiment Analysis.",
                    "Iterative Strategy for Named Entity Recognition with Imperfect Annotations.",
                    "The Solution of Huawei Cloud & Noah's Ark Lab to the NLPCC-2020 Challenge: Light Pre-Training Chinese Language Model for NLP Task.",
                    "DuEE: A Large-Scale Dataset for Chinese Event Extraction in Real-World Scenarios.",
                    "Transformer-Based Multi-aspect Modeling for Multi-aspect Multi-sentiment Analysis.",
                    "Overview of the NLPCC 2020 Shared Task: AutoIE.",
                    "Light Pre-Trained Chinese Language Model for NLP Tasks.",
                    "Overview of the NLPCC 2020 Shared Task: Multi-Aspect-Based Multi-Sentiment Analysis (MAMS)."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "NLPCC 2019",
        "info": "Dunhuang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2019-1",
                "sub_name": "Natural Language Processing and Chinese Computing - 8th CCF International Conference, NLPCC 2019, Dunhuang, China, October 9-14, 2019, Proceedings, Part I.",
                "count": 65,
                "papers": [
                    "Variational Attention for Commonsense Knowledge Aware Conversation Generation.",
                    "Improving Question Answering by Commonsense-Based Pre-training.",
                    "Multi-strategies Method for Cold-Start Stage Question Matching of rQA Task.",
                    "Multilingual Dialogue Generation with Shared-Private Memory.",
                    "Learning Personalized End-to-End Task-Oriented Dialogue Generation.",
                    "SMART: A Stratified Machine Reading Test.",
                    "How Question Generation Can Help Question Answering over Knowledge Base.",
                    "We Know What You Will Ask: A Dialogue System for Multi-intent Switch and Prediction.",
                    "Bi-directional Capsule Network Model for Chinese Biomedical Community Question Answering.",
                    "Neural Response Generation with Relevant Emotions for Short Text Conversation.",
                    "Using Bidirectional Transformer-CRF for Spoken Language Understanding.",
                    "Evaluating and Enhancing the Robustness of Retrieval-Based Dialogue Systems with Adversarial Examples.",
                    "Many vs. Many Query Matching with Hierarchical BERT and Transformer.",
                    "A Knowledge Selective Adversarial Network for Link Prediction in Knowledge Graph.",
                    "Feature-Level Attention Based Sentence Encoding for Neural Relation Extraction.",
                    "Domain Representation for Knowledge Graph Embedding.",
                    "Evidence Distilling for Fact Extraction and Verification.",
                    "KG-to-Text Generation with Slot-Attention and Link-Attention.",
                    "Group-Constrained Embedding of Multi-fold Relations in Knowledge Bases.",
                    "Cosine-Based Embedding for Completing Schematic Knowledge.",
                    "Improved DeepWalk Algorithm Based on Preference Random Walk.",
                    "Learning Stance Classification with Recurrent Neural Capsule Network.",
                    "Learning Unsupervised Word Mapping via Maximum Mean Discrepancy.",
                    "Solving Chinese Character Puzzles Based on Character Strokes.",
                    "Improving Multi-head Attention with Capsule Networks.",
                    "REET: Joint Relation Extraction and Entity Typing via Multi-task Learning.",
                    "Detecting and Translating Dropped Pronouns in Neural Machine Translation.",
                    "Select the Best Translation from Different Systems Without Reference.",
                    "Word Position Aware Translation Memory for Neural Machine Translation.",
                    "Cross Aggregation of Multi-head Attention for Neural Machine Translation.",
                    "Target Oriented Data Generation for Quality Estimation of Machine Translation.",
                    "Improved Quality Estimation of Machine Translation with Pre-trained Language Representation.",
                    "An Analytical Study on a Benchmark Corpus Constructed for Related Work Generation.",
                    "Automated Thematic and Emotional Modern Chinese Poetry Composition.",
                    "Charge Prediction with Legal Attention.",
                    "Applying Data Discretization to DPCNN for Law Article Prediction.",
                    "Automatically Build Corpora for Chinese Spelling Check Based on the Input Method.",
                    "Exploration on Generating Traditional Chinese Medicine Prescriptions from Symptoms with an End-to-End Approach.",
                    "Neural Melody Composition from Lyrics.",
                    "Improving Transformer with Sequential Context Representations for Abstractive Text Summarization.",
                    "Beyond Word for Word: Fact Guided Training for Neural Data-to-Document Generation.",
                    "Evaluating Image-Inspired Poetry Generation.",
                    "XCMRC: Evaluating Cross-Lingual Machine Reading Comprehension.",
                    "A Study on Prosodic Distribution of Yes/No Questions with Focus in Mandarin.",
                    "Neural Networks Merging Semantic and Non-semantic Features for Opinion Spam Detection.",
                    "Model the Long-Term Post History for Hashtag Recommendation.",
                    "Multi-Task Multi-Head Attention Memory Network for Fine-Grained Sentiment Analysis.",
                    "Predicting Popular News Comments Based on Multi-Target Text Matching Model.",
                    "User-Characteristic Enhanced Model for Fake News Detection in Social Media.",
                    "Implicit Objective Network for Emotion Detection.",
                    "A Neural Topic Model Based on Variational Auto-Encoder for Aspect Extraction from Opinion Texts.",
                    "Using Dependency Information to Enhance Attention Mechanism for Aspect-Based Sentiment Analysis.",
                    "Stance Influences Your Thoughts: Psychology-Inspired Social Media Analytics.",
                    "Multi-depth Graph Convolutional Networks for Fake News Detection.",
                    "Combining External Sentiment Knowledge for Emotion Cause Detection.",
                    "Multi-grain Representation Learning for Implicit Discourse Relation Recognition.",
                    "Fast and Accurate Bilingual Lexicon Induction via Matching Optimization.",
                    "Learning Diachronic Word Embeddings with Iterative Stable Information Alignment.",
                    "A Word Segmentation Method of Ancient Chinese Based on Word Alignment.",
                    "Constructing Chinese Macro Discourse Tree via Multiple Views and Word Pair Similarity.",
                    "Evaluating Semantic Rationality of a Sentence: A Sememe-Word-Matching Neural Network Based on HowNet.",
                    "Learning Domain Invariant Word Representations for Parsing Domain Adaptation.",
                    "PKU Paraphrase Bank: A Sentence-Level Paraphrase Corpus for Chinese.",
                    "Knowledge-Aware Conversational Semantic Parsing over Web Tables.",
                    "Dependency-Gated Cascade Biaffine Network for Chinese Semantic Dependency Graph Parsing."
                ]
            },
            {
                "sub_name_abbr": "conf/nlpcc/2019-2",
                "sub_name": "Natural Language Processing and Chinese Computing - 8th CCF International Conference, NLPCC 2019, Dunhuang, China, October 9-14, 2019, Proceedings, Part II.",
                "count": 77,
                "papers": [
                    "An Improved Class-Center Method for Text Classification Using Dependencies and WordNet.",
                    "Dynamic Label Correction for Distant Supervision Relation Extraction via Semantic Similarity.",
                    "Classification over Clustering: Augmenting Text Representation with Clusters Helps!",
                    "Document-Based Question Answering Improves Query-Focused Multi-document Summarization.",
                    "BSIL: A Brain Storm-Based Framework for Imbalanced Text Classification.",
                    "A Key-Phrase Aware End2end Neural Response Generation Model.",
                    "A Hierarchical Model with Recurrent Convolutional Neural Networks for Sequential Sentence Classification.",
                    "REKER: Relation Extraction with Knowledge of Entity and Relation.",
                    "IPRE: A Dataset for Inter-Personal Relationship Extraction.",
                    "Shared-Private LSTM for Multi-domain Text Classification.",
                    "Co-attention and Aggregation Based Chinese Recognizing Textual Entailment Model.",
                    "A Knowledge-Gated Mechanism for Utterance Domain Classification.",
                    "Automatic Translating Between Ancient Chinese and Contemporary Chinese with Limited Aligned Corpora.",
                    "FlexNER: A Flexible LSTM-CNN Stack Framework for Named Entity Recognition.",
                    "Domain Adaptive Question Answering over Knowledge Base.",
                    "Extending the Transformer with Context and Multi-dimensional Mechanism for Dialogue Response Generation.",
                    "Co-attention Networks for Aspect-Level Sentiment Analysis.",
                    "Hierarchical-Gate Multimodal Network for Human Communication Comprehension.",
                    "End-to-End Model for Offline Handwritten Mongolian Word Recognition.",
                    "A Recursive Information Flow Gated Model for RST-Style Text-Level Discourse Parsing.",
                    "Relation Classification in Scientific Papers Based on Convolutional Neural Network.",
                    "Effective Soft-Adaptation for Neural Machine Translation.",
                    "Neural Machine Translation with Bilingual History Involved Attention.",
                    "Joint Modeling of Recognizing Macro Chinese Discourse Nuclearity and Relation Based on Structure and Topic Gated Semantic Network.",
                    "Attentional Neural Network for Emotion Detection in Conversations with Speaker Influence Awareness.",
                    "Triple-Joint Modeling for Question Generation Using Cross-Task Autoencoder.",
                    "Deep Multi-task Learning with Cross Connected Layer for Slot Filling.",
                    "A Sequence-to-Action Architecture for Character-Based Chinese Dependency Parsing with Status History.",
                    "A New Fine-Tuning Architecture Based on Bert for Word Relation Extraction.",
                    "Rumor Detection with Hierarchical Recurrent Convolutional Neural Network.",
                    "Automatic Proofreading in Chinese: Detect and Correct Spelling Errors in Character-Level with Deep Neural Networks.",
                    "Linguistic Feature Representation with Statistical Relational Learning for Readability Assessment.",
                    "Neural Classifier with Statistic Information of User and Product for Sentiment Analysis.",
                    "A New Algorithm for Component Decomposition and Type Recognition of Tibetan Syllable.",
                    "Event Temporal Relation Classification Based on Graph Convolutional Networks.",
                    "Event Factuality Detection in Discourse.",
                    "A Multi-pattern Matching Algorithm for Chinese-Hmong Mixed Strings.",
                    "Constructing the Image Graph of Tang Poetry.",
                    "Research on Fine-Grained Sentiment Classification.",
                    "Question Generation Based Product Information.",
                    "Conversion and Exploitation of Dependency Treebanks with Full-Tree LSTM.",
                    "Analysis of Back-Translation Methods for Low-Resource Neural Machine Translation.",
                    "Multi-classification of Theses to Disciplines Based on Metadata.",
                    "Chinese Event Factuality Detection.",
                    "Research of Uyghur-Chinese Machine Translation System Combination Based on Semantic Information.",
                    "Subject Recognition in Chinese Sentences for Chatbots.",
                    "Research on Khalkha Dialect Mongolian Speech Recognition Acoustic Model Based on Weight Transfer.",
                    "GANCoder: An Automatic Natural Language-to-Programming Language Translation Approach Based on GAN.",
                    "Automatic Chinese Spelling Checking and Correction Based on Character-Based Pre-trained Contextual Representations.",
                    "A Context-Free Spelling Correction Method for Classical Mongolian.",
                    "Explainable AI: A Brief Survey on History, Research Areas, Approaches and Challenges.",
                    "Interpretable Spatial-Temporal Attention Graph Convolution Network for Service Part Hierarchical Demand Forecast.",
                    "Disentangling Latent Emotions of Word Embeddings on Complex Emotional Narratives.",
                    "Modeling Human Intelligence in Customer-Agent Conversation Using Fine-Grained Dialogue Acts.",
                    "Feature-Less End-to-End Nested Term Extraction.",
                    "Using Aspect-Based Analysis for Explainable Sentiment Predictions.",
                    "Discrimination Assessment for Saliency Maps.",
                    "A Modified LIME and Its Application to Explain Service Supply Chain Forecasting.",
                    "Cross-lingual Neural Vector Conceptualization.",
                    "A Dynamic Word Representation Model Based on Deep Context.",
                    "A Category Detection Method for Evidence-Based Medicine.",
                    "Gender Prediction Based on Chinese Name.",
                    "Explanation Chains Model Based on the Fine-Grained Data.",
                    "Goal-Oriented Knowledge-Driven Neural Dialog Generation System.",
                    "BERT-Based Multi-head Selection for Joint Entity-Relation Extraction.",
                    "Proactive Knowledge-Goals Dialogue System Based on Pointer Network.",
                    "Multiple Perspective Answer Reranking for Multi-passage Reading Comprehension.",
                    "A Sketch-Based System for Semantic Parsing.",
                    "Overview of the NLPCC 2019 Shared Task: Cross-Domain Dependency Parsing.",
                    "A Transformer-Based Semantic Parser for NLPCC-2019 Shared Task 2.",
                    "A Relation Proposal Network for End-to-End Information Extraction.",
                    "DuIE: A Large-Scale Chinese Dataset for Information Extraction.",
                    "Domain Information Enhanced Dependency Parser.",
                    "Overview of the NLPCC 2019 Shared Task: Open Domain Semantic Parsing.",
                    "An Overview of the 2019 Language and Intelligence Challenge.",
                    "Overview of the NLPCC 2019 Shared Task: Open Domain Conversation Evaluation.",
                    "Cross-Domain Transfer Learning for Dependency Parsing."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "NLPCC 2018",
        "info": "Hohhot, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2018-1",
                "sub_name": "Natural Language Processing and Chinese Computing - 7th CCF International Conference, NLPCC 2018, Hohhot, China, August 26-30, 2018, Proceedings, Part I.",
                "count": 39,
                "papers": [
                    "Question Answering for Technical Customer Support.",
                    "Perception and Production of Mandarin Monosyllabic Tones by Amdo Tibetan College Students.",
                    "Effective Character-Augmented Word Embedding for Machine Reading Comprehension.",
                    "Mongolian Grapheme to Phoneme Conversion by Using Hybrid Approach.",
                    "From Plots to Endings: A Reinforced Pointer Generator for Story Ending Generation.",
                    "A3Net: Adversarial-and-Attention Network for Machine Reading Comprehension.",
                    "When Less Is More: Using Less Context Information to Generate Better Utterances in Group Conversations.",
                    "I Know There Is No Answer: Modeling Answer Validation for Machine Reading Comprehension.",
                    "Learning to Converse Emotionally Like Humans: A Conditional Variational Approach.",
                    "Response Selection of Multi-turn Conversation with Deep Neural Networks.",
                    "Learning Dialogue History for Spoken Language Understanding.",
                    "A Neural Question Generation System Based on Knowledge Base.",
                    "ProjR: Embedding Structure Diversity for Knowledge Graph Completion.",
                    "BiTCNN: A Bi-Channel Tree Convolution Based Neural Network Model for Relation Classification.",
                    "Using Entity Relation to Improve Event Detection via Attention Mechanism.",
                    "Five-Stroke Based CNN-BiRNN-CRF Network for Chinese Named Entity Recognition.",
                    "Learning BLSTM-CRF with Multi-channel Attribute Embedding for Medical Information Extraction.",
                    "Distant Supervision for Relation Extraction with Neural Instance Selector.",
                    "Complex Named Entity Recognition via Deep Multi-task Learning from Scratch.",
                    "Hierarchical Attention Based Semi-supervised Network Representation Learning.",
                    "Joint Binary Neural Network for Multi-label Learning with Applications to Emotion Classification.",
                    "Accelerating Graph-Based Dependency Parsing with Lock-Free Parallel Perceptron.",
                    "Memory-Based Matching Models for Multi-turn Response Selection in Retrieval-Based Chatbots.",
                    "NEUTag's Classification System for Zhihu Questions Tagging Task.",
                    "Otem&Utem: Over- and Under-Translation Evaluation Metric for NMT.",
                    "Improved Neural Machine Translation with Chinese Phonologic Features.",
                    "Coarse-To-Fine Learning for Neural Machine Translation.",
                    "Source Segment Encoding for Neural Machine Translation.",
                    "Youdao's Winning Solution to the NLPCC-2018 Task 2 Challenge: A Neural Machine Translation Approach to Chinese Grammatical Error Correction.",
                    "Target Extraction via Feature-Enriched Neural Networks Model.",
                    "A Novel Attention Based CNN Model for Emotion Intensity Prediction.",
                    "Recurrent Neural CRF for Aspect Term Extraction with Dependency Transmission.",
                    "Dependency Parsing and Attention Network for Aspect-Level Sentiment Classification.",
                    "Abstractive Summarization Improved by WordNet-Based Extractive Sentences.",
                    "Improving Aspect Identification with Reviews Segmentation.",
                    "Cross-Lingual Emotion Classification with Auxiliary and Attention Neural Networks.",
                    "Are Ratings Always Reliable? Discover Users' True Feelings with Textual Reviews.",
                    "The Sogou Spoken Language Understanding System for the NLPCC 2018 Evaluation.",
                    "Improving Pointer-Generator Network with Keywords Information for Chinese Abstractive Summarization."
                ]
            },
            {
                "sub_name_abbr": "conf/nlpcc/2018-2",
                "sub_name": "Natural Language Processing and Chinese Computing - 7th CCF International Conference, NLPCC 2018, Hohhot, China, August 26-30, 2018, Proceedings, Part II.",
                "count": 47,
                "papers": [
                    "A Fusion Model of Multi-data Sources for User Profiling in Social Media.",
                    "First Place Solution for NLPCC 2018 Shared Task User Profiling and Recommendation.",
                    "Summary++: Summarizing Chinese News Articles with Attention.",
                    "Paraphrase Identification Based on Weighted URAE, Unit Similarity and Context Correlation Feature.",
                    "Which Embedding Level is Better for Semantic Representation? An Empirical Research on Chinese Phrases.",
                    "Improving Word Embeddings for Antonym Detection Using Thesauri and SentiWordNet.",
                    "Neural Chinese Word Segmentation with Dictionary Knowledge.",
                    "Recognizing Macro Chinese Discourse Structure on Label Degeneracy Combination Model.",
                    "LM Enhanced BiRNN-CRF for Joint Chinese Word Segmentation and POS Tagging.",
                    "Chinese Grammatical Error Correction Using Statistical and Neural Models.",
                    "Multi-turn Inference Matching Network for Natural Language Inference.",
                    "From Humour to Hatred: A Computational Analysis of Off-Colour Humour.",
                    "Classification of the Structure of Square Hmong Characters and Analysis of Its Statistical Properties.",
                    "Stock Market Trend Prediction Using Recurrent Convolutional Neural Networks.",
                    "Ensemble of Binary Classification for the Emotion Detection in Code-Switching Text.",
                    "A Multi-emotion Classification Method Based on BLSTM-MC in Code-Switching Text.",
                    "Improved Character-Based Chinese Dependency Parsing by Using Stack-Tree LSTM.",
                    "Neural Question Generation with Semantics of Question Type.",
                    "A Feature-Enriched Method for User Intent Classification by Leveraging Semantic Tag Expansion.",
                    "Event Detection via Recurrent Neural Network and Argument Prediction.",
                    "Employing Multiple Decomposable Attention Networks to Resolve Event Coreference.",
                    "Cross-Scenario Inference Based Event-Event Relation Detection.",
                    "SeRI: A Dataset for Sub-event Relation Inference from an Encyclopedia.",
                    "Densely Connected Bidirectional LSTM with Applications to Sentence Classification.",
                    "An End-to-End Scalable Iterative Sequence Tagging with Multi-Task Learning.",
                    "A Comparable Study on Model Averaging, Ensembling and Reranking in NMT.",
                    "Building Corpus with Emoticons for Sentiment Analysis.",
                    "Construction of a Multi-dimensional Vectorized Affective Lexicon.",
                    "Convolution Neural Network with Active Learning for Information Extraction of Enterprise Announcements.",
                    "Research on Construction Method of Chinese NT Clause Based on Attention-LSTM.",
                    "The Research and Construction of Complaint Orders Classification Corpus in Mobile Customer Service.",
                    "The Algorithm of Automatic Text Summarization Based on Network Representation Learning.",
                    "Semi-supervised Sentiment Classification Based on Auxiliary Task Learning.",
                    "A Normalized Encoder-Decoder Model for Abstractive Summarization Using Focal Loss.",
                    "A Relateness-Based Ranking Method for Knowledge-Based Question Answering.",
                    "A Sequence to Sequence Learning for Chinese Grammatical Error Correction.",
                    "Ensemble of Neural Networks with Sentiment Words Translation for Code-Switching Emotion Detection.",
                    "NLPCC 2018 Shared Task User Profiling and Recommendation Method Summary by DUTIR_9148.",
                    "Overview of NLPCC 2018 Shared Task 1: Emotion Detection in Code-Switching Text.",
                    "Overview of the NLPCC 2018 Shared Task: Automatic Tagging of Zhihu Questions.",
                    "Overview of the NLPCC 2018 Shared Task: Grammatical Error Correction.",
                    "Overview of the NLPCC 2018 Shared Task: Multi-turn Human-Computer Conversations.",
                    "Overview of the NLPCC 2018 Shared Task: Open Domain QA.",
                    "Overview of the NLPCC 2018 Shared Task: Single Document Summarization.",
                    "Overview of the NLPCC 2018 Shared Task: Social Media User Modeling.",
                    "Overview of the NLPCC 2018 Shared Task: Spoken Language Understanding in Task-Oriented Dialog Systems.",
                    "WiseTag: An Ensemble Method for Multi-label Topic Classification."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "NLPCC 2017",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2017",
                "sub_name": "Natural Language Processing and Chinese Computing - 6th CCF International Conference, NLPCC 2017, Dalian, China, November 8-12, 2017, Proceedings.",
                "count": 86,
                "papers": [
                    "Jointly Modeling Intent Identification and Slot Filling with Contextual and Hierarchical Information.",
                    "Augmenting Neural Sentence Summarization Through Extractive Summarization.",
                    "Cascaded LSTMs Based Deep Reinforcement Learning for Goal-Driven Dialogue.",
                    "Dialogue Intent Classification with Long Short-Term Memory Networks.",
                    "An Ensemble Approach to Conversation Generation.",
                    "First Place Solution for NLPCC 2017 Shared Task Social Media User Modeling.",
                    "Large-Scale Simple Question Generation by Template-Based Seq2seq Learning.",
                    "A Dual Attentive Neural Network Framework with Community Metadata for Answer Selection.",
                    "Geography Gaokao-Oriented Knowledge Acquisition for Comparative Sentences Based on Logic Programming.",
                    "Chinese Question Classification Based on Semantic Joint Features.",
                    "A Chinese Question Answering System for Single-Relation Factoid Questions.",
                    "Enhancing Document-Based Question Answering via Interaction Between Question Words and POS Tags.",
                    "A Deep Learning Way for Disease Name Representation and Normalization.",
                    "Externally Controllable RNN for Implicit Discourse Relation Classification.",
                    "Random Projections with Bayesian Priors.",
                    "A Convolutional Attention Model for Text Classification.",
                    "Shortcut Sequence Tagging.",
                    "Look-Ahead Attention for Generation in Neural Machine Translation.",
                    "Modeling Indicative Context for Statistical Machine Translation.",
                    "A Semantic Concept Based Unknown Words Processing Method in Neural Machine Translation.",
                    "Research on Mongolian Speech Recognition Based on FSMN.",
                    "Using Bilingual Segments to Improve Interactive Machine Translation.",
                    "Vietnamese Part of Speech Tagging Based on Multi-category Words Disambiguation Model.",
                    "Unsupervised Automatic Text Style Transfer Using LSTM.",
                    "Optimizing Topic Distributions of Descriptions for Image Description Translation.",
                    "Automatic Document Metadata Extraction Based on Deep Networks.",
                    "A Semantic Representation Enhancement Method for Chinese News Headline Classification.",
                    "Abstractive Document Summarization via Neural Model with Joint Attention.",
                    "An Effective Approach for Chinese News Headline Classification Based on Multi-representation Mixed Model with Attention and Ensemble Learning.",
                    "Domain-Specific Chinese Word Segmentation with Document-Level Optimization.",
                    "Will Repeated Reading Benefit Natural Language Understanding?",
                    "A Deep Convolutional Neural Model for Character-Based Chinese Word Segmentation.",
                    "Chinese Zero Pronoun Resolution: A Chain to Chain Approach.",
                    "Towards Better Chinese Zero Pronoun Resolution from Discourse Perspective.",
                    "Neural Domain Adaptation with Contextualized Character Embedding for Chinese Word Segmentation.",
                    "BiLSTM-Based Models for Metaphor Detection.",
                    "Hyper-Gated Recurrent Neural Networks for Chinese Word Segmentation.",
                    "Effective Semantic Relationship Classification of Context-Free Chinese Words with Simple Surface and Embedding Features.",
                    "Classification of Chinese Word Semantic Relations.",
                    "Identification of Influential Users Based on Topic-Behavior Influence Tree in Social Networks.",
                    "Hierarchical Dirichlet Processes with Social Influence.",
                    "A Personality-Aware Followee Recommendation Model Based on Text Semantics and Sentiment Analysis.",
                    "A Novel Community Detection Method Based on Cluster Density Peaks.",
                    "Review Rating with Joint Classification and Regression Model.",
                    "Boosting Collective Entity Linking via Type-Guided Semantic Embedding.",
                    "Biomedical Domain-Oriented Word Embeddings via Small Background Texts for Biomedical Text Mining Tasks.",
                    "Homographic Puns Recognition Based on Latent Semantic Structures.",
                    "Constructing a Chinese Conversation Corpus for Sentiment Analysis.",
                    "Improving Retrieval Quality Using PRF Mechanism from Event Perspective.",
                    "An Information Retrieval-Based Approach to Table-Based Question Answering.",
                    "Building Emotional Conversation Systems Using Multi-task Seq2Seq Learning.",
                    "NLPCC 2017 Shared Task Social Media User Modeling Method Summary by DUTIR_923.",
                    "Babbling - The HIT-SCIR System for Emotional Conversation Generation.",
                    "Unsupervised Slot Filler Refinement via Entity Community Construction.",
                    "Relation Linking for Wikidata Using Bag of Distribution Representation.",
                    "Neural Question Generation from Text: A Preliminary Study.",
                    "Answer Selection in Community Question Answering by Normalizing Support Answers.",
                    "An Empirical Study on Incorporating Prior Knowledge into BLSTM Framework in Answer Selection.",
                    "Enhanced Embedding Based Attentive Pooling Network for Answer Selection.",
                    "A Retrieval-Based Matching Approach to Open Domain Knowledge-Based Question Answering.",
                    "Improved Compare-Aggregate Model for Chinese Document-Based Question Answering.",
                    "Transfer Deep Learning for Low-Resource Chinese Word Segmentation with a Novel Neural Network.",
                    "AHNN: An Attention-Based Hybrid Neural Network for Sentence Modeling.",
                    "Improving Chinese-English Neural Machine Translation with Detected Usages of Function Words.",
                    "Using NMT with Grammar Information and Self-taught Mechanism in Translating Chinese Symptom and Disease Terminologies.",
                    "Learning Bilingual Lexicon for Low-Resource Language Pairs.",
                    "Exploring the Impact of Linguistic Features for Chinese Readability Assessment.",
                    "A Semantic-Context Ranking Approach for Community-Oriented English Lexical Simplification.",
                    "A Multiple Learning Model Based Voting System for News Headline Classification.",
                    "Extractive Single Document Summarization via Multi-feature Combination and Sentence Compression.",
                    "A News Headlines Classification Method Based on the Fusion of Related Words.",
                    "Resolving Chinese Zero Pronoun with Word Embedding.",
                    "Active Learning for Chinese Word Segmentation on Judgements.",
                    "Study on the Chinese Word Semantic Relation Classification with Word Embedding.",
                    "HDP-TUB Based Topic Mining Method for Chinese Micro-blogs.",
                    "Detecting Deceptive Review Spam via Attention-Based Neural Networks.",
                    "A Tensor Factorization Based User Influence Analysis Method with Clustering and Temporal Constraint.",
                    "Cross-Lingual Entity Matching for Heterogeneous Online Wikis.",
                    "A Unified Probabilistic Model for Aspect-Level Sentiment Analysis.",
                    "An Empirical Study on Learning Based Methods for User Consumption Intention Classification.",
                    "Overview of the NLPCC 2017 Shared Task: Chinese Word Semantic Relation Classification.",
                    "Overview of the NLPCC 2017 Shared Task: Emotion Generation Challenge.",
                    "Overview of the NLPCC-ICCPOL 2017 Shared Task: Social Media User Modeling.",
                    "Overview of the NLPCC 2017 Shared Task: Single Document Summarization.",
                    "Overview of the NLPCC 2017 Shared Task: Chinese News Headline Categorization.",
                    "Overview of the NLPCC 2017 Shared Task: Open Domain Chinese Question Answering."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "NLPCC/ICCPOL 2016",
        "info": "Kunming, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2016",
                "sub_name": "Natural Language Understanding and Intelligent Applications - 5th CCF Conference on Natural Language Processing and Chinese Computing, NLPCC 2016, and 24th International Conference on Computer Processing of Oriental Languages, ICCPOL 2016, Kunming, China, December 2-6, 2016, Proceedings.",
                "count": 89,
                "papers": [
                    "Integrating Structural Context with Local Context for Disambiguating Word Senses.",
                    "Tibetan Multi-word Expressions Identification Framework Based on News Corpora.",
                    "Building Powerful Dependency Parsers for Resource-Poor Languages.",
                    "Bidirectional Long Short-Term Memory with Gated Relevance Network for Paraphrase Identification.",
                    "Syntactic Categorization and Semantic Interpretation of Chinese Nominal Compounds.",
                    "TDSS: A New Word Sense Representation Framework for Information Retrieval.",
                    "A Word Vector Representation Based Method for New Words Discovery in Massive Text.",
                    "Better Addressing Word Deletion for Statistical Machine Translation.",
                    "A Simple, Straightforward and Effective Model for Joint Bilingual Terms Detection and Word Alignment in SMT.",
                    "Bilingual Parallel Active Learning Between Chinese and English.",
                    "Study on the English Corresponding Unit of Chinese Clause.",
                    "Research for Uyghur-Chinese Neural Machine Translation.",
                    "MaxSD: A Neural Machine Translation Evaluation Metric Optimized by Maximizing Similarity Distance.",
                    "Automatic Long Sentence Segmentation for Neural Machine Translation.",
                    "Topic Segmentation of Web Documents with Automatic Cue Phrase Identification and BLSTM-CNN.",
                    "Multi-task Learning for Gender and Age Prediction on Chinese Microblog.",
                    "Dropout Non-negative Matrix Factorization for Independent Feature Learning.",
                    "Analysing the Semantic Change Based on Word Embedding.",
                    "Learning Word Sense Embeddings from Word Sense Definitions.",
                    "Character-Based LSTM-CRF with Radical-Level Features for Chinese Named Entity Recognition.",
                    "Improving First Order Temporal Fact Extraction with Unreliable Data.",
                    "Reducing Human Effort in Named Entity Corpus Construction Based on Ensemble Learning and Annotation Categorization.",
                    "A Convolution BiLSTM Neural Network Model for Chinese Event Extraction.",
                    "Detection of Entity Mixture in Knowledge Bases Using Hierarchical Clustering.",
                    "Knowledge Base Question Answering Based on Deep Learning Models.",
                    "An Open Domain Topic Prediction Model for Answer Selection.",
                    "Joint Event Extraction Based on Skip-Window Convolutional Neural Networks.",
                    "Improving Collaborative Filtering with Long-Short Interest Model.",
                    "Leveraging Hierarchical Deep Semantics to Classify Implicit Discourse Relations via Mutual Learning Method.",
                    "Transition-Based Discourse Parsing with Multilayer Stack Long Short Term Memory.",
                    "Predicting Implicit Discourse Relation with Multi-view Modeling and Effective Representation Learning.",
                    "A CDT-Styled End-to-End Chinese Discourse Parser.",
                    "Events Detection and Temporal Analysis in Social Media.",
                    "Discovering Concept-Level Event Associations from a Text Stream.",
                    "A User Adaptive Model for Followee Recommendation on Twitter.",
                    "Who Will Tweet More? Finding Information Feeders in Twitter.",
                    "Discrete and Neural Models for Chinese POS Tagging: Comparison and Combination.",
                    "Improving Word Vector with Prior Knowledge in Semantic Dictionary.",
                    "Adapting Attention-Based Neural Network to Low-Resource Mongolian-Chinese Machine Translation.",
                    "Sentence Similarity on Structural Representations.",
                    "Word Sense Disambiguation Using Context Translation.",
                    "Cyrillic Mongolian Named Entity Recognition with Rich Features.",
                    "Purchase Prediction via Machine Learning in Mobile Commerce.",
                    "Exploring Long Tail Data in Distantly Supervised Relation Extraction.",
                    "Detecting Potential Adverse Drug Reactions from Health-Related Social Networks.",
                    "Iterative Integration of Unsupervised Features for Chinese Dependency Parsing.",
                    "Can We Neglect Function Words in Word Embedding?",
                    "A Similarity Algorithm Based on the Generality and Individuality of Words.",
                    "An Improved Information Gain Algorithm Based on Relative Document Frequency Distribution.",
                    "Finding the True Crowds: User Filtering in Microblogs.",
                    "Learning to Recognize Protected Health Information in Electronic Health Records with Recurrent Neural Network.",
                    "Sentiment Classification of Social Media Text Considering User Attributes.",
                    "Learning from User Feedback for Machine Translation in Real-Time.",
                    "GuideRank: A Guided Ranking Graph Model for Multilingual Multi-document Summarization.",
                    "Fast-Syntax-Matching-Based Japanese-Chinese Limited Machine Translation.",
                    "Value at Risk for Risk Evaluation in Information Retrieval.",
                    "Chinese Paraphrases Acquisition Based on Random Walk N Step.",
                    "A Micro-topic Model for Coreference Resolution Based on Theme-Rheme Structure.",
                    "Learning from LDA Using Deep Neural Networks.",
                    "Relation Classification: CNN or RNN?",
                    "Ensemble of Feature Sets and Classification Methods for Stance Detection.",
                    "Exploiting External Knowledge and Entity Relationship for Entity Search.",
                    "A Flexible and Sentiment-Aware Framework for Entity Search.",
                    "Word Segmentation on Micro-Blog Texts with External Lexicon and Heterogeneous Data.",
                    "Open Domain Question Answering System Based on Knowledge Base.",
                    "Recurrent Neural Word Segmentation with Tag Inference.",
                    "Chinese Word Similarity Computing Based on Combination Strategy.",
                    "An Empirical Study on Chinese Microblog Stance Detection Using Supervised and Semi-supervised Machine Learning Methods.",
                    "Combining Word Embedding and Semantic Lexicon for Chinese Word Similarity Computation.",
                    "Football News Generation from Chinese Live Webcast Script.",
                    "Convolutional Deep Neural Networks for Document-Based Question Answering.",
                    "Research on Summary Sentences Extraction Oriented to Live Sports Text.",
                    "Statistical Entity Ranking with Domain Knowledge.",
                    "Study on the Method of Precise Entity Search Based on Baidu's Query.",
                    "Overview of the NLPCC-ICCPOL 2016 Shared Task: Chinese Word Similarity Measurement.",
                    "Exploring Various Linguistic Features for Stance Detection.",
                    "Overview of Baidu Cup 2016: Challenge on Entity Search.",
                    "A Feature-Rich CRF Segmenter for Chinese Micro-Blog.",
                    "NLPCC 2016 Shared Task Chinese Words Similarity Measure via Ensemble Learning Based on Multiple Resources.",
                    "Overview of the NLPCC-ICCPOL 2016 Shared Task: Sports News Generation from Live Webcast Scripts.",
                    "Sports News Generation from Live Webcast Scripts Based on Rules and Templates.",
                    "A Deep Learning Approach for Question Answering Over Knowledge Base.",
                    "Stance Detection in Chinese MicroBlogs with Neural Networks.",
                    "Overview of the NLPCC-ICCPOL 2016 Shared Task: Chinese Word Segmentation for Micro-Blog Texts.",
                    "Overview of NLPCC Shared Task 4: Stance Detection in Chinese Microblogs.",
                    "Combining Deep Learning with Information Retrieval for Question Answering.",
                    "A Hybrid Approach to DBQA.",
                    "A Chinese Question Answering Approach Integrating Count-Based and Embedding-Based Features.",
                    "Overview of the NLPCC-ICCPOL 2016 Shared Task: Open Domain Chinese Question Answering."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "NLPCC 2015",
        "info": "Nanchang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2015",
                "sub_name": "Natural Language Processing and Chinese Computing - 4th CCF Conference, NLPCC 2015, Nanchang, China, October 9-13, 2015, Proceedings.",
                "count": 57,
                "papers": [
                    "A Maximum Entropy Approach to Discourse Coherence Modeling.",
                    "Transition-Based Dependency Parsing with Long Distance Collocations.",
                    "Recurrent Neural Networks with External Memory for Spoken Language Understanding.",
                    "Improving Chinese Dependency Parsing with Lexical Semantic Features.",
                    "Entity Translation with Collective Inference in Knowledge Graph.",
                    "Stochastic Language Generation Using Situated PCFGs.",
                    "Clustering Sentiment Phrases in Product Reviews by Constrained Co-clustering.",
                    "A Cross-Domain Sentiment Classification Method Based on Extraction of Key Sentiment Sentence.",
                    "Convolutional Neural Networks for Correcting English Article Errors.",
                    "Automatic Detection of Rumor on Social Network.",
                    "Multimodal Learning Based Approaches for Link Prediction in Social Networks.",
                    "Sentiment Analysis Based on User Tags for Traditional Chinese Medicine in Weibo.",
                    "Predicting User Mention Behavior in Social Networks.",
                    "Convolutional Neural Networks for Multimedia Sentiment Analysis.",
                    "An Adaptive Approach to Extract Characters from Digital Ink Text in Chinese Based on Extracted Errors.",
                    "Context-Dependent Metaphor Interpretation Based on Semantic Relatedness.",
                    "Context Vector Model for Document Representation: A Computational Study.",
                    "Refine Search Results Based on Desktop Context.",
                    "Incorporating Semantic Knowledge with MRF Term Dependency Model in Medical Document Retrieval.",
                    "A Full-Text Retrieval Algorithm for Encrypted Data in Cloud Storage Applications.",
                    "How Different Features Contribute to the Session Search?",
                    "Beyond Your Interests: Exploring the Information Behind User Tags.",
                    "Nonparametric Symmetric Correspondence Topic Models for Multilingual Text Analysis.",
                    "Mining RDF from Tables in Chinese Encyclopedias.",
                    "Taxonomy Induction from Chinese Encyclopedias by Combinatorial Optimization.",
                    "Recognition of Person Relation Indicated by Predicates.",
                    "Target Detection and Knowledge Learning for Domain Restricted Question Answering.",
                    "An Improved Algorithm of Logical Structure Reconstruction for Re-flowable Document Understanding.",
                    "Mongolian Inflection Suffix Processing in NLP: A Case Study.",
                    "Resolving Coordinate Structures for Chinese Constituent Parsing.",
                    "P-Trie Tree: A Novel Tree Structure for Storing Polysemantic Data.",
                    "Research on the Extraction of Wikipedia-Based Chinese-Khmer Named Entity Equivalents.",
                    "Bilingual Lexicon Extraction with Temporal Distributed Word Representation from Comparable Corpora.",
                    "Bilingually-Constrained Recursive Neural Networks with Syntactic Constraints for Hierarchical Translation Model.",
                    "Document-Level Machine Translation Evaluation Metrics Enhanced with Simplified Lexical Chain.",
                    "Cross-Lingual Tense Tagging Based on Markov Tree Tagging Model.",
                    "Building a Large-Scale Cross-Lingual Knowledge Base from Heterogeneous Online Wikis.",
                    "Refining Kazakh Word Alignment Using Simulation Modeling Methods for Statistical Machine Translation.",
                    "A Local Method for Canonical Correlation Analysis.",
                    "Learning to Rank Microblog Posts for Real-Time Ad-Hoc Search.",
                    "Fuzzy-Rough Set Based Multi-labeled Emotion Intensity Analysis for Sentence, Paragraph and Document.",
                    "What Causes Different Emotion Distributions of a Hot Event? A Deep Event-Emotion Analysis System on Microblogs.",
                    "Deceptive Opinion Spam Detection Using Deep Level Linguistic Features.",
                    "Multi-sentence Question Segmentation and Compression for Question Answering.",
                    "A User-Oriented Special Topic Generation System for Digital Newspaper.",
                    "Exploiting Heterogeneous Annotations for Weibo Word Segmentation and POS Tagging.",
                    "Entity Recognition and Linking in Chinese Search Queries.",
                    "BosonNLP: An Ensemble Approach for Word Segmentation and POS Tagging.",
                    "Research on Open Domain Question Answering System.",
                    "Overview of the NLPCC 2015 Shared Task: Chinese Word Segmentation and POS Tagging for Micro-blog Texts.",
                    "Overview of the NLPCC 2015 Shared Task: Entity Recognition and Linking in Search Queries.",
                    "Overview of the NLPCC 2015 Shared Task: Weibo-Oriented Chinese News Summarization.",
                    "Overview of the NLPCC 2015 Shared Task: Open Domain QA.",
                    "Word Segmentation of Micro Blogs with Bagging.",
                    "Weibo-Oriented Chinese News Summarization via Multi-feature Combination.",
                    "Linking Entities in Chinese Queries to Knowledge Graph.",
                    "A Hybrid Re-ranking Method for Entity Recognition and Linking in Search Queries."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "NLPCC 2014",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2014",
                "sub_name": "Natural Language Processing and Chinese Computing - Third CCF Conference, NLPCC 2014, Shenzhen, China, December 5-9, 2014. Proceedings.",
                "count": 43,
                "papers": [
                    "A Global Generative Model for Chinese Semantic Role Labeling.",
                    "Chinese Comma Disambiguation on K-best Parse Trees.",
                    "Event Schema Induction Based on Relational Co-occurrence over Multiple Documents.",
                    "Negation and Speculation Target Identification.",
                    "An Adjective-Based Embodied Knowledge Net.",
                    "A Method of Density Analysis for Chinese Characters.",
                    "Computing Semantic Relatedness Using a Word-Text Mutual Guidance Model.",
                    "Short Text Feature Enrichment Using Link Analysis on Topic-Keyword Graph.",
                    "Sentence-Length Informed Method for Active Learning Based Resource-Poor Statistical Machine Translation.",
                    "Detection of Loan Words in Uyghur Texts.",
                    "A Novel Rule Refinement Method for SMT through Simulated Post-Editing.",
                    "Case Frame Constraints for Hierarchical Phrase-Based Translation: Japanese-Chinese as an Example.",
                    "Bridging the Language Gap: Learning Distributed Semantics for Cross-Lingual Sentiment Classification.",
                    "A Short Texts Matching Method Using Shallow Features and Deep Features.",
                    "A Feature Extraction Method Based on Word Embedding for Word Similarity Computing.",
                    "Word Vector Modeling for Sentiment Analysis of Product Reviews.",
                    "Cross-Lingual Sentiment Classification Based on Denoising Autoencoder.",
                    "Aspect-Object Alignment Using Integer Linear Programming.",
                    "Sentiment Classification of Chinese Contrast Sentences.",
                    "Emotion Classification of Chinese Microblog Text via Fusion of BoW and eVector Feature Representations.",
                    "Social Media as Sensor in Real World: Geolocate User with Microblog.",
                    "A Novel Calibrated Label Ranking Based Method for Multiple Emotions Detection in Chinese Microblogs.",
                    "Enhance Social Context Understanding with Semantic Chunks.",
                    "Estimating Credibility of User Clicks with Mouse Movement and Eye-Tracking Information.",
                    "Cannabis_TREATS_cancer: Incorporating Fine-Grained Ontological Relations in Medical Document Ranking.",
                    "A Unified Microblog User Similarity Model for Online Friend Recommendation.",
                    "Weakly-Supervised Occupation Detection for Micro-blogging Users.",
                    "Normalization of Chinese Informal Medical Terms Based on Multi-field Indexing.",
                    "Answer Extraction with Multiple Extraction Engines for Web-Based Question Answering.",
                    "Answering Natural Language Questions via Phrasal Semantic Parsing.",
                    "A Fast and Effective Method for Clustering Large-Scale Chinese Question Dataset.",
                    "A Hybrid Method for Chinese Entity Relation Extraction.",
                    "Linking Entities in Tweets to Wikipedia Knowledge Base.",
                    "Automatic Recognition of Chinese Location Entity.",
                    "Detect Missing Attributes for Entities in Knowledge Bases via Hierarchical Clustering.",
                    "Improved Automatic Keyword Extraction Based on TextRank Using Domain Knowledge.",
                    "A Topic-Based Reordering Model for Statistical Machine Translation.",
                    "Online Chinese-Vietnamese Bilingual Topic Detection Based on RCRP Algorithm with Event Elements.",
                    "Random Walks for Opinion Summarization on Conversations.",
                    "TM-ToT: An Effective Model for Topic Mining from the Tibetan Messages.",
                    "Chinese Microblog Entity Linking System Combining Wikipedia and Search Engine Retrieval Results.",
                    "Emotion Cause Detection with Linguistic Construction in Chinese Weibo Text.",
                    "News Topic Evolution Tracking by Incorporating Temporal Information."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "NLPCC 2013",
        "info": "Chongqing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/nlpcc/2013",
                "sub_name": "Natural Language Processing and Chinese Computing - Second CCF Conference, NLPCC 2013, Chongqing, China, November 15-19, 2013, Proceedings.",
                "count": 44,
                "papers": [
                    "Text Window Denoising Autoencoder: Building Deep Architecture for Chinese Word Segmentation.",
                    "Language Model for Cyrillic Mongolian to Traditional Mongolian Conversion.",
                    "Sentence Compression Based on ILP Decoding Method.",
                    "Chinese Negation and Speculation Detection with Conditional Random Fields.",
                    "Chinese Argument Extraction Based on Trigger Mapping.",
                    "Exploring Multiple Chinese Word Segmentation Results Based on Linear Model.",
                    "A Unified Framework for Emotional Elements Extraction Based on Finite State Matching Machine.",
                    "Structure-Based Web Access Method for Ancient Chinese Characters.",
                    "Simulated Spoken Dialogue System Based on IOHMM with User History.",
                    "A Mixed Model for Cross Lingual Opinion Analysis.",
                    "Semi-supervised Text Categorization by Considering Sufficiency and Diversity.",
                    "Pseudo In-Domain Data Selection from Large-Scale Web Corpus for Spoken Language Translation.",
                    "Discriminative Latent Variable Based Classifier for Translation Error Detection.",
                    "Incorporating Entities in News Topic Modeling.",
                    "An Efficient Framework to Extract Parallel Units from Comparable Data.",
                    "A Method to Construct Chinese-Japanese Named Entity Translation Equivalents Using Monolingual Corpora.",
                    "Collective Corpus Weighting and Phrase Scoring for SMT Using Graph-Based Random Walk.",
                    "A Simple, Fast Strategy for Weighted Alignment Hypergraph.",
                    "Research on Building Family Networks Based on Bootstrapping and Coreference Resolution.",
                    "Learning Sentence Representation for Emotion Classification on Microblogs.",
                    "Every Term Has Sentiment: Learning from Emoticon Evidences for Chinese Microblog Sentiment Analysis.",
                    "Active Learning for Cross-Lingual Sentiment Classification.",
                    "Expanding User Features with Social Relationships in Social Recommender Systems.",
                    "A Hybrid Approach for Extending Ontology from Text.",
                    "Linking Entities in Short Texts Based on a Chinese Semantic Knowledge Base.",
                    "Entity Linking from Microblogs to Knowledge Base Using ListNet Algorithm.",
                    "Automatic Assessment of Information Disclosure Quality in Chinese Annual Reports.",
                    "A Fast Matching Method Based on Semantic Similarity for Short Texts.",
                    "Query Generation Techniques for Patent Prior-Art Search in Multiple Languages.",
                    "Improve Web Search Diversification with Intent Subtopic Mining.",
                    "Understanding Temporal Intent of User Query Based on Time-Based Query Classification.",
                    "Research on Semantic-Based Passive Transformation in Chinese-English Machine Translation.",
                    "Research of an Improved Algorithm for Chinese Word Segmentation Dictionary Based on Double-Array Trie Tree.",
                    "Study on Tibetan Word Segmentation as Syllable Tagging.",
                    "The Spoken/Written Language Classification of English Sentences with Bilingual Information.",
                    "Design and Implementation of News-Oriented Automatic Summarization System Based on Chinese RSS.",
                    "Grey Relational Analysis for Query Expansion.",
                    "A Comprehensive Method for Text Summarization Based on Latent Semantic Analysis.",
                    "A Time-Sensitive Model for Microblog Retrieval.",
                    "Feature Analysis in Microblog Retrieval Based on Learning to Rank.",
                    "Opinion Sentence Extraction and Sentiment Analysis for Chinese Microblogs.",
                    "Research on the Opinion Mining System for Massive Social Media Data.",
                    "Grammatical Phrase-Level Opinion Target Extraction on Chinese Microblog Messages.",
                    "Simple Yet Effective Method for Entity Linking in Microblog-Genre Text."
                ]
            }
        ]
    }
]