[
    {
        "name": "NPL",
        "year": "2021",
        "info": "2021: Volumes\n53,",
        "count": 234,
        "papers": [
            "Exploring Implicit and Explicit Geometrical Structure of Data for Deep Embedded Clustering.",
            "Systematic Homonym Detection and Replacement Based on Contextual Word Embedding.",
            "On the Selection of the Regularization Parameter in Stacking.",
            "Delay-Dependent Criteria for Global Exponential Stability of Time-Varying Delayed Fuzzy Inertial Neural Networks.",
            "Leader-Following Consensus of Non-linear Multi-agent Systems with Interval Time-Varying Delay via Impulsive Control.",
            "Evolved Fuzzy Min-Max Neural Network for Unknown Labeled Data and its Application on Defect Recognition in Depth.",
            "A New Varying-Parameter Design Formula for Solving Time-Varying Problems.",
            "Estimating the Depth of Anesthesia During the Induction by a Novel Adaptive Neuro-Fuzzy Inference System: A Case Study.",
            "A Novel Enhanced Naïve Bayes Posterior Probability (ENBPP) Using Machine Learning: Cyber Threat Analysis.",
            "Context Module Based Multi-patch Hierarchical Network for Motion Deblurring.",
            "Real-Time Lossy Audio Signal Reconstruction Using Novel Sliding Based Multi-instance Linear Regression/Random Forest and Enhanced CGPANN.",
            "Joint Spectral Clustering based on Optimal Graph and Feature Selection.",
            "Leader-Following Mean Square Consensus of Stochastic Multi-agent Systems via Periodically Intermittent Event-Triggered Control.",
            "Finite-Time Stabilization of Memristive Neural Networks with Time Delays.",
            "Densemask RCNN: A Hybrid Model for Skin Burn Image Classification and Severity Grading.",
            "Stick-Breaking Dependent Beta Processes with Variational Inference.",
            "Identification of Nonlinear Dynamical System Based on Raised-Cosine Radial Basis Function Neural Networks.",
            "Label-Embedding Bi-directional Attentive Model for Multi-label Text Classification.",
            "Design of Stochastic Passivity and Passification for Delayed BAM Neural Networks with Markov Jump Parameters via Non-uniform Sampled-Data Control.",
            "Online Support Vector Regression Based Adaptive NARMA-L2 Controller for Nonlinear Systems.",
            "Political Optimizer Based Feedforward Neural Network for Classification and Function Approximation.",
            "On Regularization Based Twin Support Vector Regression with Huber Loss.",
            "Multi-class support vector machine based on the minimization of class variance.",
            "Computation of CNN's Sensitivity to Input Perturbation.",
            "The Future of Human Activity Recognition: Deep Learning or Feature Engineering?",
            "Robust Passivity and Stability Analysis of Uncertain Complex-Valued Impulsive Neural Networks with Time-Varying Delays.",
            "Manifold Preserving CNN for Pixel-Based Object Labelling in Images for High Dimensional Feature spaces.",
            "Bifurcations Induced by Self-connection Delay in High-Order Fractional Neural Networks.",
            "Object Reconstruction Based on Attentive Recurrent Network from Single and Multiple Images.",
            "Deep CNN for Brain Tumor Classification.",
            "Deep Neural Networks Regularization Using a Combination of Sparsity Inducing Feature Selection Methods.",
            "Use of Neural Network Based Prediction Algorithms for Powering Up Smart Portable Accessories.",
            "Network-Based H∞ Filtering for Descriptor Markovian Jump Systems with a Novel Neural Network Event-Triggered Scheme.",
            "An Improved Finite Time Convergence Recurrent Neural Network with Application to Time-Varying Linear Complex Matrix Equation Solution.",
            "Complete Stacked Denoising Auto-Encoders for Regression.",
            "(μ , ν )-Pseudo Almost Automorphic Solutions of Neutral Type Clifford-Valued High-Order Hopfield Neural Networks with D Operator.",
            "Mean Square Stabilization of Neural Networks with Weighted Try once Discard Protocol and State Observer.",
            "Online Social Network Security: A Comparative Review Using Machine Learning and Deep Learning.",
            "Correction to: Fukunaga-Koontz Convolutional Network with Applications on Character Classification.",
            "Quasi-Synchronization of Fractional-Order Complex-Valued Memristive Recurrent Neural Networks with Switching Jumps Mismatch.",
            "State Estimation for Markovian Coupled Neural Networks with Multiple Time Delays Via Event-Triggered Mechanism.",
            "Mutated Cleavages of Images for Stealth Disclosure: A Hopfield Neural Network Attractor (HNNA) Approach.",
            "Synchronization of Fractional Order Neutral Type Fuzzy Cellular Neural Networks with Discrete and Distributed Delays via State Feedback Control.",
            "Robust Discriminant Projection Via Joint Margin and Locality Structure Preservation.",
            "Quantized Sampled-Data Control for Exponential Stabilization of Delayed Complex-Valued Neural Networks.",
            "Illustrative Discussion of MC-Dropout in General Dataset: Uncertainty Estimation in Bitcoin.",
            "Estimating the Optimal Number of Clusters Via Internal Validity Index.",
            "Exponential Synchronization of Nonlinear Multi-weighted Complex Dynamic Networks with Hybrid Time Varying Delays.",
            "Infrared Handprint Classification Using Deep Convolution Neural Network.",
            "Multi-objective Optimization Based Recursive Feature Elimination for Process Monitoring.",
            "Image Captioning with Dense Fusion Connection and Improved Stacked Attention Module.",
            "Modeling Axonal Plasticity in Artificial Neural Networks.",
            "KTBoost: Combined Kernel and Tree Boosting.",
            "Augmented Online Sequential Quaternion Extreme Learning Machine.",
            "Emotion Analysis on Text Using Multiple Kernel Gaussian...",
            "Perceptual Monocular Depth Estimation.",
            "aiTPR: Attribute Interaction-Tensor Product Representation for Image Caption.",
            "Smart Animal Detection and Counting Framework for Monitoring Livestock in an Autonomous Unmanned Ground Vehicle Using Restricted Supervised Learning and Image Fusion.",
            "A Vary-Parameter Convergence-Accelerated Recurrent Neural Network for Online Solving Dynamic Matrix Pseudoinverse and its Robot Application.",
            "Spatial Rough Intuitionistic Fuzzy C-Means Clustering for MRI Segmentation.",
            "Deep Learning Guided Double Hidden Layer Neural Synchronization Through Mutual Learning.",
            "Information Bottleneck Theory on Convolutional Neural Networks.",
            "Person Re-Identification Based on Graph Relation Learning.",
            "Multi-layer Representation Learning and Its Application to Electronic Health Records.",
            "Global Exponential Dissipativity of Impulsive Recurrent Neural Networks with Multi-proportional Delays.",
            "Multitask Classification Method Based on Label Correction for Breast Tumor Ultrasound Images.",
            "Stability of Fractional Order Fuzzy Cellular Neural Networks with Distributed Delays via Hybrid Feedback Controllers.",
            "Beetle Antennae Search Strategy for Neural Network Model Optimization with Application to Glomerular Filtration Rate Estimation.",
            "Compact Deep Color Features for Remote Sensing Scene Classification.",
            "Generalized Twin Support Vector Machines.",
            "Symbolic Regression Based Extreme Learning Machine Models for System Identification.",
            "New Results for Prediction of Chaotic Systems Using Deep Recurrent Neural Networks.",
            "Kernelized Linear Autoencoder.",
            "Prescribed-Time Synchronization of Coupled Memristive Neural Networks with Heterogeneous Impulsive Effects.",
            "Deep Neural Network to Predict Answer Votes on Community Question Answering Sites.",
            "Meta-Heuristic Algorithms-Tuned Elman vs. Jordan Recurrent Neural Networks for Modeling of Electron Beam Welding Process.",
            "Global Optimization of Binary Quadratic Programming: A Neural Network Based Algorithm and Its FPGA Implementation.",
            "Two Matrix-Type Projection Neural Networks for Matrix-Valued Optimization with Application to Image Restoration.",
            "Integrating Classical Control into Reinforcement Learning Policy.",
            "An Effective Microscopic Detection Method for Automated Silicon-Substrate Ultra-microtome (ASUM).",
            "Analysis of Effect of Weight Variation on SNN Chip with PCM-Refresh Method.",
            "N2SkyC: User Friendly and Efficient Neural Network Simulation Fostering Cloud Containers.",
            "A Wiener Causality Defined by Divergence.",
            "Human Activity Recognition by Using Different Deep Learning Approaches for Wearable Sensors.",
            "Multi-object Spatial-Temporal Anomaly Detection Using an LSTM-Based Framework.",
            "Balanced Gradient Training of Feed Forward Networks.",
            "Exponential Synchronization of Delayed Switching Genetic Oscillator Networks via Mode-Dependent Partial Impulsive Control.",
            "Enhancing Top-N Recommendation Using Stacked Autoencoder in Context-Aware Recommender System.",
            "Enhanced Non-parametric Sequence-based Learning Algorithm for Outlier Detection in the Internet of Things.",
            "Detection-Oriented Backbone Trained from Near Scratch and Local Feature Refinement for Small Object Detection.",
            "Pre-Training Acquisition Functions by Deep Reinforcement Learning for Fixed Budget Active Learning.",
            "Formal Derivation of Mesh Neural Networks with Their Forward-Only Gradient Propagation.",
            "Extraction of Competitive Factors in a Competitor Analysis Using an Explainable Neural Network.",
            "Attention-Based Deep Gated Fully Convolutional End-to-End Architectures for Time Series Classification.",
            "Estimation of the Domain of Attraction of Discrete-Time Impulsive Cohen-Grossberg Neural Networks Model With Impulse Input Saturation.",
            "Weighted Discriminative Sparse Representation for Image Classification.",
            "Global convergence of Negative Correlation Extreme Learning Machine.",
            "Sampling Active Learning Based on Non-parallel Support Vector Machines.",
            "User's Review Habits Enhanced Hierarchical Neural Network for Document-Level Sentiment Classification.",
            "Feature Extraction via Sparse Fuzzy Difference Embedding (SFDE) for Robust Subspace Learning.",
            "A Comprehensive Study on VLAD.",
            "Approximate Analytic Solution of Burger Huxley Equation Using Feed-Forward Artificial Neural Network.",
            "Multi-residual Connection Network for Edge Detection.",
            "Exponential Synchronization of Stochastic Neural Networks with Time-Varying Delays and Lévy Noises via Event-Triggered Control.",
            "Multi-Objective Memetic Algorithms with Tree-Based Genetic Programming and Local Search for Symbolic Regression.",
            "Performance of Genetic Algorithm and Levenberg Marquardt Method on Multi-Mother Wavelet Neural Network Training for 3D Huge Meshes Deformation: A Comparative Study.",
            "A New Method for Separating EMI Signal Based on CEEMDAN and ICA.",
            "Related Study Based on Otsu Watershed Algorithm and New Squeeze-and-Excitation Networks for Segmentation and Level Classification of Tea Buds.",
            "NRIC: A Noise Removal Approach for Nonlinear Isomap Method.",
            "Wasserstein Distance-Based Auto-Encoder Tracking.",
            "A Survey of Algorithmic and Hardware Optimization Techniques for Vision Convolutional Neural Networks on FPGAs.",
            "Editorial Expression of Concern: No-Reference Video Quality Assessment Based on the Temporal Pooling of Deep Features.",
            "Special Issue: Capsule Networks and Imaging Science (CNIS).",
            "Canonical Correlation Analysis Based Hyper Basis Feedforward Neural Network Classification for Urban Sustainability.",
            "Introducing the Visual Imaging Feature to the Text Analysis: High Efficient Soft Computing Models with Bayesian Network.",
            "Urban Landscape Ecological Design and Stereo Vision Based on 3D Mesh Simplification Algorithm and Artificial Intelligence.",
            "Burn Image Recognition of Medical Images Based on Deep Learning: From CNNs to Advanced Networks.",
            "VR Design of Public Facilities in Historical Blocks Based on BP Neural Network.",
            "An Efficient Mammogram Image Retrieval System Using an Optimized Classifier.",
            "Intelligent Crime Prevention and Control Big Data Analysis System Based on Imaging and Capsule Network Model.",
            "A City Monitoring System Based on Real-Time Communication Interaction Module and Intelligent Visual Information Collection System.",
            "Brain Tumor Segmentation Using Deep Learning and Fuzzy K-Means Clustering for Magnetic Resonance Images.",
            "Multimedia Imaging Model of Information System Based on Self-Organizing Capsule Neural Network and Game Theory.",
            "Fault Diagnosis of Fuel System Based on Improved Extreme Learning Machine.",
            "Cerebrum Tumor Segmentation of High Resolution Magnetic Resonance Images Using 2D-Convolutional Network with Skull Stripping.",
            "Application of Meta-learning Framework Based on Multiple-Capsule Intelligent Neural Systems in Image Classification.",
            "A Safe Semi-supervised Classification Algorithm Using Multiple Classifiers Ensemble.",
            "Lung Cancer Prediction Using Stochastic Diffusion Search (SDS) Based Feature Selection and Machine Learning Methods.",
            "The Kuramoto Model: The Stability Conditions in the Presence of Phase Shift.",
            "Classification of Alzheimer's Disease Using Deep Convolutional Spiking Neural Network.",
            "DDV: A Taxonomy for Deep Learning Methods in Detecting Prostate Cancer.",
            "Numerical Solution of Fractional Order Advection Reaction Diffusion Equation with Fibonacci Neural Network.",
            "Spatio-Temporal Learning for Video Deblurring based on Two-Stream Generative Adversarial Network.",
            "CloudU-Netv2: A Cloud Segmentation Method for Ground-Based Cloud Images Based on Deep Learning.",
            "Adaptive Synchronization Control and Parameters Identification for Chaotic Fractional Neural Networks with Time-Varying Delays.",
            "Multi-object Tracking Method Based on Efficient Channel Attention and Switchable Atrous Convolution.",
            "Application of Coupled LDA-KPCA and BO-MKRVM Model to Predict Coal and Gas Outbursts.",
            "An Effective Principal Singular Triplets Extracting Neural Network Algorithm.",
            "Boundary Adjusted Network Based on Cosine Similarity for Temporal Action Proposal Generation.",
            "An Energy-Aware Trust and Opportunity Based Routing Algorithm in Wireless Sensor Networks Using Multipath Routes Technique.",
            "Attention Refined Network for Human Pose Estimation.",
            "A Hybrid Multi-gene Genetic Programming with Capuchin Search Algorithm for Modeling a Nonlinear Challenge Problem: Modeling Industrial Winding Process, Case Study.",
            "Deep Learning with ConvNet Predicts Imagery Tasks Through EEG.",
            "Why Does Regularization Help with Mitigating Poisoning Attacks?",
            "A Robust Segmentation Method Based on Improved U-Net.",
            "Finite-Time Synchronization for a Coupled Fuzzy Neutral-Type Rayleigh System.",
            "Grading of Knee Osteoarthritis Using Convolutional Neural Networks.",
            "Research on Robot Motion Planning Based on RRT Algorithm with Nonholonomic Constraints.",
            "Event-Based Projective Synchronization for Different Dimensional Complex Dynamical Networks with Unknown Dynamics by Using Data-Driven Scheme.",
            "Advanced neural network systems for solving complex real problems.",
            "Integrating Machine Learning Techniques in Semantic Fake News Detection.",
            "A Convolutional Neural Network Framework for Accurate Skin Cancer Detection.",
            "Multimodal Machine Learning for Natural Language Processing: Disambiguating Prepositional Phrase Attachments with Images.",
            "Combining Embeddings of Input Data for Text Classification.",
            "Knowledge Acquisition and Design Using Semantics and Perception: A Case Study for Autonomous Robots.",
            "Opportunistic Activity Recognition in IoT Sensor Ecosystems via Multimodal Transfer Learning.",
            "Cross-Domain Polarity Models to Evaluate User eXperience in E-learning.",
            "A Neural Network Based System for Efficient Semantic Segmentation of Radar Point Clouds.",
            "Online Speech Enhancement by Retraining of LSTM Using SURE Loss and Policy Iteration.",
            "The Study of Sailors' Brain Activity Difference Before and After Sailing Using Activated Functional Connectivity Pattern.",
            "Trajectory Association for Person Re-identification.",
            "Improving Open Information Extraction with Distant Supervision Learning.",
            "An Optimization Technique for Solving a Class of Ridge Fuzzy Regression Problems.",
            "Named Entity Recognition by Using XLNet-BiLSTM-CRF.",
            "Jacobi Neural Network Method for Solving Linear Differential-Algebraic Equations with Variable Coefficients.",
            "Existence, Uniqueness and Stability of Mild Solutions to a Stochastic Nonlocal Delayed Reaction-Diffusion Equation.",
            "Interval Neutrosophic Einstein Prioritized Normalized Weighted Geometric Bonferroni Mean Operator and its Application to Multicriteria Decision making.",
            "Improve Semi-supervised Learning with Metric Learning Clusters and Auxiliary Fake Samples.",
            "Anfis-Based Defect Severity Prediction on a Multi-Stage Gearbox Operating Under Fluctuating Speeds.",
            "ℋ∞ Synchronization and Robust ℋ∞ Synchronization of Coupled Neural Networks with Non-identical Nodes.",
            "CSCNN: Cost-Sensitive Convolutional Neural Network for Encrypted Traffic Classification.",
            "Finite/Fixed-Time Synchronization of Delayed Inertial Memristive Neural Networks with Discontinuous Activations and Disturbances.",
            "Convolutional Feature Frequency Adaptive Fusion Object Detection Network.",
            "Semi-Supervised Clustering for Financial Risk Analysis.",
            "Continuous-Time Varying Complex QR Decomposition via Zeroing Neural Dynamics.",
            "A faster and better robustness zeroing neural network for solving dynamic Sylvester equation.",
            "Finite Time Synchronization of Delayed Quaternion Valued Neural Networks with Fractional Order.",
            "Common Spatial Pattern with L21-Norm.",
            "PU Active Learning for Recommender Systems.",
            "Progressive Transfer Learning Approach for Identifying the Leaf Type by Optimizing Network Parameters.",
            "A Novel Architecture with Separate Comparison and Interaction Modules for Chinese Semantic Sentence Matching.",
            "An advanced Hybrid Algorithm for Engineering Design Optimization.",
            "Synchronization Control for Chaotic Neural Networks with Mixed Delays Under Input Saturations.",
            "Observer-Based Adaptive NN Tracking Control for Nonstrict-Feedback Systems with Input Saturation.",
            "Online GBDT with Chunk Dynamic Weighted Majority Learners for Noisy and Drifting Data Streams.",
            "Filippov FitzHugh-Nagumo Neuron Model with Membrane Potential Threshold Control Policy.",
            "Correction to: Modeling Axonal Plasticity in Artificial Neural Networks.",
            "Correction to: Recent Deep Learning Techniques, Challenges and Its Applications for Medical Healthcare System: A Review.",
            "ParsBERT: Transformer-based Model for Persian Language Understanding.",
            "Self-Supervised Convolutional Subspace Clustering Network with the Block Diagonal Regularizer.",
            "A Phase Control Method for the Dynamical Attractor of the HR Neuron Model: The Rotation-Transition Process and Its Experimental Realization.",
            "Correlation Projection for Analytic Learning of a Classification Network.",
            "Study on Neural Network Integration Method Based on Morphological Associative Memory Framework.",
            "New Results on Global Exponential Stability of Genetic Regulatory Networks with Diffusion Effect and Time-Varying Hybrid Delays.",
            "Intermittent Control Based Exponential Synchronization of Inertial Neural Networks with Mixed Delays.",
            "øverline pin-TSVM: A Robust Transductive Support Vector Machine and its Application to the Detection of COVID-19 Infected Patients.",
            "Synchronization in Fixed Time for Reaction-Diffusion Quaternion-Valued NNs with Nonlinear Interconnected Protocol and Its Application.",
            "CCCIH: Content-consistency Coverless Information Hiding Method Based on Generative Models.",
            "Two-Objective Filtering for Takagi-Sugeno Fuzzy Hopfield Neural Networks with Time-Variant Delay.",
            "Identification of Influential Nodes for Drone Swarm Based on Graph Neural Networks.",
            "BLSTM and CNN Stacking Architecture for Speech Emotion Recognition.",
            "Poisonous Label Attack: Black-Box Data Poisoning Attack with Enhanced Conditional DCGAN.",
            "Siamese Pre-Trained Transformer Encoder for Knowledge Base Completion.",
            "Exposing DeepFake Videos Using Attention Based Convolutional LSTM Network.",
            "Refine for Semantic Segmentation Based on Parallel Convolutional Network with Attention Model.",
            "GAN Based Three-Stage-Training Algorithm for Multi-view Facial Expression Recognition.",
            "BERT Based Semi-Supervised Hybrid Approach for Aspect and Sentiment Classification.",
            "SRCNN-PIL: Side Road Convolution Neural Network Based on Pseudoinverse Learning Algorithm.",
            "A Two-Step Classification Method Based on Collaborative Representation for Positive and Unlabeled Learning.",
            "CT-UNet: Context-Transfer-UNet for Building Segmentation in Remote Sensing Images.",
            "Finger Vein De-noising Algorithm Based on Custom Sample-Texture Conditional Generative Adversarial Nets.",
            "Subspace Clustering with Block Diagonal Sparse Representation.",
            "H∞ State Estimation for Round-Robin Protocol-Based Markovian Jumping Neural Networks with Mixed Time Delays.",
            "Gradient-Based Training of Gaussian Mixture Models for High-Dimensional Streaming Data.",
            "Synchronization of Coupled Memristor Neural Networks with Time Delay: Positive Effects of Stochastic Delayed Impulses.",
            "A New Result on Stability Analysis of Recurrent Neural Networks with Time-Varying Delay Based on an Extended Delay-Dependent Integral Inequality.",
            "Subspace Clustering via Integrating Sparse Representation and Adaptive Graph Learning.",
            "Input-to-State Stability for Stochastic Delay Neural Networks with Markovian Switching.",
            "Short Term Solar Power and Temperature Forecast Using Recurrent Neural Networks.",
            "Stack-based Scale-recurrent Network for Face Image Deblurring.",
            "BSS Method Based on Wavelet Transform and Improved EASI Algorithm and Its Application in EMI.",
            "Salp Swarm Optimizer for Modeling Software Reliability Prediction Problems.",
            "Self-supervised Monocular Trained Depth Estimation Using Triplet Attention and Funnel Activation.",
            "Time Analysis in Human Activity Recognition.",
            "Multi-stage Genetic Algorithm and Deep Neural Network for Robot Execution Failure Detection.",
            "Neural Network for a Novel Disturbance Optimal Control Model for Inventory and Production Planning in a Four-Echelon Supply Chain with Reverse Logistic.",
            "Stability and Hopf Bifurcation Analysis of a General Tri-diagonal BAM Neural Network with Delays.",
            "PSO Based Neuro-fuzzy Model for Secondary Structure Prediction of Protein.",
            "Adaboost-based Integration Framework Coupled Two-stage Feature Extraction with Deep Learning for Multivariate Exchange Rate Prediction.",
            "Fuzzy Coefficient of Impulsive Intensity in a Nonlinear Impulsive Control System.",
            "Multilevel Attention Models for Drug Target Binding Affinity Prediction.",
            "Residual Spatiotemporal Autoencoder with Skip Connected and Memory Guided Network for Detecting Video Anomalies.",
            "A Survey of Encoding Techniques for Signal Processing in Spiking Neural Networks.",
            "Correction to: An Energy-Aware Trust and Opportunity Based Routing Algorithm in Wireless Sensor Networks Using Multipath Routes Technique."
        ]
    },
    {
        "name": "NPL",
        "year": "2020",
        "info": "2020: Volumes\n51,\n52",
        "count": 283,
        "papers": [
            "Non-iterative Knowledge Fusion in Deep Convolutional Neural Networks.",
            "Domain Adaptation with Few Labeled Source Samples by Graph Regularization.",
            "Entropy-Based Fuzzy Least Squares Twin Support Vector Machine for Pattern Classification.",
            "Finite-Time Stabilization for Static Neural Networks with Leakage Delay and Time-Varying Delay.",
            "Robust Output Feedback Stabilization for Uncertain Discrete-Time Stochastic Neural Networks with Time-Varying Delay.",
            "Methodologies of Compressing a Stable Performance Convolutional Neural Networks in Image Classification.",
            "ELMAENet: A Simple, Effective and Fast Deep Architecture for Image Classification.",
            "Kernel-Based Subspace Learning on Riemannian Manifolds for Visual Recognition.",
            "Data-Based Online Optimal Temperature Tracking Control in Continuous Microwave Heating System by Adaptive Dynamic Programming.",
            "Exponential Stability and Sampled-Data Synchronization of Delayed Complex-Valued Memristive Neural Networks.",
            "Attentive Semantic and Perceptual Faces Completion Using Self-attention Generative Adversarial Networks.",
            "Speed Up the Training of Neural Machine Translation.",
            "Synchronous Reluctance Motor Speed Tracking Using a Modified Second-Order Sliding Mode Control Method.",
            "Mean-Square Exponential Input-to-State Stability of Stochastic Gene Regulatory Networks with Multiple Time Delays.",
            "Action Recognition with Multiple Relative Descriptors of Trajectories.",
            "A Novel Identification-Based Convex Control Scheme via Recurrent High-Order Neural Networks: An Application to the Internal Combustion Engine.",
            "Complex Projection Synchronization of Fractional-Order Complex-Valued Memristive Neural Networks with Multiple Delays.",
            "Maximum Mean and Covariance Discrepancy for Unsupervised Domain Adaptation.",
            "Global Asymptotic Stability of Periodic Solutions for Neutral-Type BAM Neural Networks with Delays.",
            "A High Generalizable Feature Extraction Method Using Ensemble Learning and Deep Auto-Encoders for Operational Reliability Assessment of Bearings.",
            "Finite Time Stability Analysis of Fractional-Order Complex-Valued Memristive Neural Networks with Proportional Delays.",
            "Improved Delay-Derivative-Dependent Stability Analysis for Generalized Recurrent Neural Networks with Interval Time-Varying Delays.",
            "On Infinite Horizon Optimal Control Problems with a Feed Forward Neural Network Scheme.",
            "A New ExtendFace Representation Method for Face Recognition.",
            "Deep Learning Architectures for Accurate Millimeter Wave Positioning in 5G.",
            "A Novel Geometric Mean Feature Space Discriminant Analysis Method for Hyperspectral Image Feature Extraction.",
            "Novel Sufficient Conditions on Periodic Solutions for Discrete-Time Neutral-Type Neural Networks.",
            "Distributed Neuro-Dynamic Algorithm for Price-Based Game in Energy Consumption System.",
            "Improved Data Modeling Using Coupled Artificial Neural Networks.",
            "A Unified Self-Stabilizing Neural Network Algorithm for Principal Takagi Component Extraction.",
            "Dimensionality Reduction Using Discriminant Collaborative Locality Preserving Projections.",
            "Discriminative Face Recognition Methods with Structure and Label Information via l2-Norm Regularization.",
            "Unsupervised Video Object Segmentation Based on Mixture Models and Saliency Detection.",
            "An Improved Flower Pollination Algorithm with Three Strategies and Its Applications.",
            "Higher-Order ZNN Dynamics.",
            "Non-negative Matrix Factorization with Symmetric Manifold Regularization.",
            "A Discriminative Approach to Sentiment Classification.",
            "Random Regrouping and Factorization in Cooperative Particle Swarm Optimization Based Large-Scale Neural Network Training.",
            "Learning Biased SVM with Weighted Within-Class Scatter for Imbalanced Classification.",
            "AR-ARCH Type Artificial Neural Network for Forecasting.",
            "Traffic Signs Detection for Real-World Application of an Advanced Driving Assisting System Using Deep Learning.",
            "Deep Feature Fusion for High-Resolution Aerial Scene Classification.",
            "A Novel Delay-Dependent Criterion for Global Power Stability of Cellular Neural Networks with Proportional Delay.",
            "Learning the Graph Edit Costs Based on a Learning Model Applied to Sub-optimal Graph Matching.",
            "Training a Neural Network for Cyberattack Classification Applications Using Hybridization of an Artificial Bee Colony and Monarch Butterfly Optimization.",
            "Stochastic Quasi-Synchronization of Delayed Neural Networks: Pinning Impulsive Scheme.",
            "Second Order Training and Sizing for the Multilayer Perceptron.",
            "Adaptively Denoising Proposal Collection for Weakly Supervised Object Localization.",
            "Tuning Parameter Selection Based on Blocked 3˟ 2 Cross-Validation for High-Dimensional Linear Regression Model.",
            "Multi-class Review Rating Classification using Deep Recurrent Neural Network.",
            "Stability of Impulsive Stochastic Reaction Diffusion Recurrent Neural Network.",
            "Image Set-Oriented Dual Linear Discriminant Regression Classification and Its Kernel Extension.",
            "Multi-layer Adaptive Feature Fusion for Semantic Segmentation.",
            "A Smoothing Algorithm with Constant Learning Rate for Training Two Kinds of Fuzzy Neural Networks and Its Convergence.",
            "Mutual Improvement Between Temporal Ensembling and Virtual Adversarial Training.",
            "Neural Network-Based Hybrid Position/Force Tracking Control for Robotic Systems Without Velocity Measurement.",
            "Localization Approach for Tracking the Mobile Nodes Using FA Based ANN in Subterranean Wireless Sensor Networks.",
            "Intelligent Fault Diagnosis of Rolling Bearing Using Adaptive Deep Gated Recurrent Unit.",
            "Bi-directional LSTM Model with Symptoms-Frequency Position Attention for Question Answering System in Medical Domain.",
            "Piecewise Pseudo Almost-Periodic Solutions of Impulsive Fuzzy Cellular Neural Networks with Mixed Delays.",
            "Compressive Sensing of Multichannel EEG Signals Based on Graph Fourier Transform and Cosparsity.",
            "A Feature Selection Algorithm Based on Equal Interval Division and Minimal-Redundancy-Maximal-Relevance.",
            "Stability Analysis on Cohen-Grossberg Neural Networks with Saturated Impulse Inputs.",
            "DropFilterR: A Novel Regularization Method for Learning Convolutional Neural Networks.",
            "Complex Varying-Parameter Zhang Neural Networks for Computing Core and Core-EP Inverse.",
            "Fast Synchronization of Complex Networks via Aperiodically Intermittent Sliding Mode Control.",
            "Almost Automorphic Solutions in Distribution Sense of Quaternion-Valued Stochastic Recurrent Neural Networks with Mixed Time-Varying Delays.",
            "Finite-Time L∞ Performance State Estimation of Recurrent Neural Networks with Sampled-Data Signals.",
            "Parameters Sharing in Residual Neural Networks.",
            "Joint Robust Transfer Metric and Adaptive Transfer Function Learning.",
            "Semi-supervised Fuzzy Min-Max Neural Network for Data Classification.",
            "Synchronization Control of Quaternion-Valued Neural Networks with Parameter Uncertainties.",
            "Finite-Time Mittag-Leffler Stability of Fractional-Order Quaternion-Valued Memristive Neural Networks with Impulses.",
            "Attention-Based Generative Adversarial Network for Semi-supervised Image Classification.",
            "The Optimization of Synchronization Control Parameters for Fractional-Order Delayed Memristive Neural Networks Using SIWPSO.",
            "Global Attractor of Reaction-Diffusion Gene Regulatory Networks with S-Type Delay.",
            "Multi-parallel Extreme Learning Machine with Excitatory and Inhibitory Neurons for Regression.",
            "Maintenance Personnel Detection and Analysis Using Mask-RCNN Optimization on Power Grid Monitoring Video.",
            "A Design Strategy for the Efficient Implementation of Random Basis Neural Networks on Resource-Constrained Devices.",
            "Quantitative Analysis in Delayed Fractional-Order Neural Networks.",
            "Exponential Lag Synchronization and Global Dissipativity for Delayed Fuzzy Cohen-Grossberg Neural Networks with Discontinuous Activations.",
            "Generating Text Sequence Images for Recognition.",
            "Growing Self-Organizing Maps for Nonlinear Time-Varying Function Approximation.",
            "General and Improved Five-Step Discrete-Time Zeroing Neural Dynamics Solving Linear Time-Varying Matrix Equation with Unknown Transpose.",
            "Community Detection in Complex Networks Using Nonnegative Matrix Factorization and Density-Based Clustering Algorithm.",
            "Sp-Almost Periodic Solutions of Clifford-Valued Fuzzy Cellular Neural Networks with Time-Varying Delays.",
            "Daily Activity Feature Selection in Smart Homes Based on Pearson Correlation Coefficient.",
            "A Novel Model Predictive Runge-Kutta Neural Network Controller for Nonlinear MIMO Systems.",
            "Lagrange Stability for Delayed-Impulses in Discrete-Time Cohen-Grossberg Neural Networks with Delays.",
            "Global Lagrange Stability of Inertial Neutral Type Neural Networks with Mixed Time-Varying Delays.",
            "Performance Evaluation of a New BP Algorithm for a Modified Artificial Neural Network.",
            "Memristor Crossbar Array Based ACO For Image Edge Detection.",
            "Feature Enhancement for Multi-scale Object Detection.",
            "Finite-Time Synchronization of Coupled Inertial Memristive Neural Networks with Mixed Delays via Nonlinear Feedback Control.",
            "H∞  Filtering for Markov Jump Neural Networks Subject to Hidden-Markov Mode Observation and Packet Dropouts via an Improved Activation Function Dividing Method.",
            "ANN Based Solution of Uncertain Linear Systems of Equations.",
            "An Image Clustering Auto-Encoder Based on Predefined Evenly-Distributed Class Centroids and MMD Distance.",
            "Class-specific discriminant regularization in real-time deep CNN models for binary classification problems.",
            "Image Inpainting: A Review.",
            "DNN-Based Cross-Lingual Voice Conversion Using Bottleneck Features.",
            "Learning Multi-level Deep Representations for Image Emotion Classification.",
            "Visual Sentiment Analysis by Combining Global and Local Information.",
            "Deep Transfer Learning for Image Emotion Analysis: Reducing Marginal and Joint Distribution Discrepancies Together.",
            "Correction to: Deep Transfer Learning for Image Emotion Analysis: Reducing Marginal and Joint Distribution Discrepancies Together.",
            "Multi-layer Attention Based CNN for Target-Dependent Sentiment Classification.",
            "Inferring Personality Traits from Attentive Regions of User Liked Images Via Weakly Supervised Dual Convolutional Network.",
            "An End-to-End Perceptual Quality Assessment Method via Score Distribution Prediction.",
            "Blind Image Deconvolution via Enhancing Significant Segments.",
            "State Estimation of Quaternion-Valued Neural Networks with Leakage Time Delay and Mixed Two Additive Time-Varying Delays.",
            "A Neural Network Study of Blasius Equation.",
            "On Impulsive Synchronization Control for Coupled Inertial Neural Networks with Pinning Control.",
            "Stepanov-Like Pseudo Almost Periodic Solution of Quaternion-Valued for Fuzzy Recurrent Neural Networks with Mixed Delays.",
            "Superpixels Features Extractor Network (SP-FEN) for Clothing Parsing Enhancement.",
            "An Evaluation of RetinaNet on Indoor Object Detection for Blind and Visually Impaired Persons Assistance Navigation.",
            "Deep Dual-Stream Network with Scale Context Selection Attention Module for Semantic Segmentation.",
            "Efficient Strategies of Static Features Incorporation into the Recurrent Neural Network.",
            "Robust Exponential Stability for Discrete-Time Quaternion-Valued Neural Networks with Time Delays and Parameter Uncertainties.",
            "Finite-Time and Fixed-Time Non-chattering Control for Inertial Neural Networks with Discontinuous Activations and Proportional Delay.",
            "Automatic Semantic Segmentation with DeepLab Dilated Learning Network for Change Detection in Remote Sensing Images.",
            "Anti-periodic Oscillations of Fuzzy Delayed Cellular Neural Networks with Impulse on Time Scales.",
            "Visual Sentiment Prediction with Attribute Augmentation and Multi-attention Mechanism.",
            "Selective Embedding with Gated Fusion for 6D Object Pose Estimation.",
            "Constrained PSO Based Center Selection for RBF Networks Under Concurrent Fault Situation.",
            "Multi-weighted Complex Structure on Fractional Order Coupled Neural Networks with Linear Coupling Delay: A Robust Synchronization Problem.",
            "Distributed Pinning Impulsive Control for Inner-Outer Synchronization of Dynamical Networks on Time Scales.",
            "Semantically Smooth Bilingual Phrase Embeddings Based on Recursive Autoencoders.",
            "Neural Network-Based Optimal Tracking Control of Continuous-Time Uncertain Nonlinear System via Reinforcement Learning.",
            "Global Exponential Stability of High-Order Bidirectional Associative Memory (BAM) Neural Networks with Proportional Delays.",
            "Traffic Sign Recognition in Harsh Environment Using Attention Based Convolutional Pooling Neural Network.",
            "Infrared Image Extraction Algorithm Based on Adaptive Growth Immune Field.",
            "Developer Activity Motivated Bug Triaging: Via Convolutional Neural Network.",
            "Asymptotic Stability and Polynomial Stability of Impulsive Cohen-Grossberg Neural Networks with Multi-proportional Delays.",
            "Regularized Negative Label Relaxation Least Squares Regression for Face Recognition.",
            "Stacked Fusion Supervised Auto-encoder with an Additional Classification Layer.",
            "Gaussian Pyramid of Conditional Generative Adversarial Network for Real-World Noisy Image Denoising.",
            "Impulsive-Interaction-Driven Synchronization in an Array of Coupled Neural Networks.",
            "Intuitionistic Fuzzy Proximal Support Vector Machines for Pattern Classification.",
            "RSDCN: A Road Semantic Guided Sparse Depth Completion Network.",
            "Task-Independent Spiking Central Pattern Generator: A Learning-Based Approach.",
            "Dual Global Structure Preservation Based Supervised Feature Selection.",
            "A Balanced Feature Fusion SSD for Object Detection.",
            "A Metaphor Comprehension Method Based on Culture-Related Hierarchical Semantic Model.",
            "Deep Learning Based Application for Indoor Scene Recognition.",
            "Deep Convolutional Generalized Classifier Neural Network.",
            "Optimizing Deep Feedforward Neural Network Architecture: A Tabu Search Based Approach.",
            "Electrical Resistivity Inversion Based on a Hybrid CCSFLA-MSVR Method.",
            "Legendre Neural Network Method for Several Classes of Singularly Perturbed Differential Equations Based on Mapping and Piecewise Optimization Technology.",
            "Md-Net: Multi-scale Dilated Convolution Network for CT Images Segmentation.",
            "Passivity Analysis of Non-autonomous Discrete-Time Inertial Neural Networks with Time-Varying Delays.",
            "A Human Auditory Perception Loss Function Using Modified Bark Spectral Distortion for Speech Enhancement.",
            "Computational Intelligence Methods for Time Series Analysis and Forecasting: Special Issue of IWANN 2017.",
            "Application of Quantile Graphs to the Automated Analysis of EEG Signals.",
            "Fuzzy Time Series Models Using Pliant- and Asymptotically Pliant Arithmetic-Based Inference.",
            "Ordinal Multi-class Architecture for Predicting Wind Power Ramp Events Based on Reservoir Computing.",
            "A Multi-resolution Approximation for Time Series.",
            "Machine Learning Nowcasting of PV Energy Using Satellite Data.",
            "An Evaluation of Equity Premium Prediction Using Multiple Kernel Learning with Financial Features.",
            "Time Series, Spectral Densities and Robust Functional Clustering.",
            "Binary Output Layer of Extreme Learning Machine for Solving Multi-class Classification Problems.",
            "Deep Learning Neural Network for Unconventional Images Classification.",
            "A Context Based Deep Temporal Embedding Network in Action Recognition.",
            "Optimal Control Based on Neuro Estimator for Fractional Order Uncertain Non-linear Continuous-Time Systems.",
            "GM-CPSO: A New Viewpoint to Chaotic Particle Swarm Optimization via Gauss Map.",
            "Remerging Feigenbaum Trees, Coexisting Behaviors and Bursting Oscillations in a Novel 3D Generalized Hopfield Neural Network.",
            "Finite-Time Synchronization of Hybrid-Coupled Delayed Dynamic Networks via Aperiodically Intermittent Control.",
            "Dual-Path Part-Level Method for Visible-Infrared Person Re-identification.",
            "Semantic Image Segmentation with Improved Position Attention and Feature Fusion.",
            "Learning Stable Robust Adaptive NARMA Controller for UAV and Its Application to Twin Rotor MIMO Systems.",
            "Spikes and Nets (S&N): A New Fast, Parallel Computing, Point Process Software for Multineuronal Discharge and Connectivity Analysis.",
            "Quantized Control for Synchronization of Delayed Fractional-Order Memristive Neural Networks.",
            "An Enhanced Extreme Learning Machine Based on Liu Regression.",
            "Fukunaga-Koontz Convolutional Network with Applications on Character Classification.",
            "Unsupervised Domain Adaptation via Discriminative Classes-Center Feature Learning in Adversarial Network.",
            "Fixed-Time Lag Synchronization Analysis for Delayed Memristor-Based Neural Networks.",
            "Fast and Memory-Efficient Import Vector Domain Description.",
            "Global Exponential Stability of Hybrid Non-autonomous Neural Networks with Markovian Switching.",
            "Path Capsule Networks.",
            "Adaptive Sampled-Data Observer Design for a Class of Nonlinear Systems with Unknown Hysteresis.",
            "Latent-MVCNN: 3D Shape Recognition Using Multiple Views from Pre-defined or Random Viewpoints.",
            "Fractional Order Echo State Network for Time Series Prediction.",
            "PSSA: Polar Coordinate Salp Swarm Algorithm for Curve Design Problems.",
            "Anti-synchronization of a Class Of Fuzzy Memristive Competitive Neural Networks with Different Time Scales.",
            "Wireless Sensor Network Based Smart Grid Supported by a Cognitively Driven Load Management Decision Making.",
            "A Novel Technique for Segmentation of High Resolution Remote Sensing Images Based on Neural Networks.",
            "GrasNet: A Simple Grassmannian Network for Image Set Classification.",
            "Li-Function Activated Zhang Neural Network for Online Solution of Time-Varying Linear Matrix Inequality.",
            "A New Supervised Clustering Framework Using Multi Discriminative Parts and Expectation-Maximization Approach for a Fine-Grained Animal Breed Classification (SC-MPEM).",
            "An Improved Crow Search Algorithm for Test Data Generation Using Search-Based Mutation Testing.",
            "Intra-layer Synchronization in Duplex Networks with Time-Varying Delays and Stochastic Perturbations Under Impulsive Control.",
            "Multilayer Convolutional Neural Network to Filter Low Quality Content from Quora.",
            "SAOSA: Stable Adaptive Optimization for Stacked Auto-encoders.",
            "Multi-geometric Sparse Subspace Clustering.",
            "Semi-supervised Learning Algorithm Based on Linear Lie Group for Imbalanced Multi-class Classification.",
            "Consistent Discriminant Correlation Analysis.",
            "Graph-Theoretic Approach to Finite-Time Synchronization for Fuzzy Cohen-Grossberg Neural Networks with Mixed Delays and Discontinuous Activations.",
            "Refocused Attention: Long Short-Term Rewards Guided Video Captioning.",
            "An Abstract Painting Generation Method Based on Deep Generative Model.",
            "Unsupervised Learning Approach for Abnormal Event Detection in Surveillance Video by Hybrid Autoencoder.",
            "A Multi-modality Sensor System for Unmanned Surface Vehicle.",
            "Hierarchical Temporal Fusion of Multi-grained Attention Features for Video Question Answering.",
            "Construction of Retinal Vessel Segmentation Models Based on Convolutional Neural Network.",
            "Pairwise Generalization Network for Cross-Domain Image Recognition.",
            "3D Model Retrieval Using Bipartite Graph Matching Based on Attention.",
            "Hierarchical Deep Neural Network for Image Captioning.",
            "H∞  State Estimation of Static Neural Networks with Mixed Delay.",
            "Approximately Optimal Control of Discrete-Time Nonlinear Switched Systems Using Globalized Dual Heuristic Programming.",
            "Radical and Stroke-Enhanced Chinese Word Embeddings Based on Neural Networks.",
            "An Analysis of Activation Function Saturation in Particle Swarm Optimization Trained Neural Networks.",
            "Super-Resolution Based Automatic Diagnosis of Retinal Disease Detection for Clinical Applications.",
            "Bifurcation Mechanisation of a Fractional-Order Neural Network with Unequal Delays.",
            "Improved Stabilization Results for Markovian Switching CVNNs with Partly Unknown Transition Rates.",
            "A Novel Combined Model for Short-Term Electric Load Forecasting Based on Whale Optimization Algorithm.",
            "Synchronization of Stochastic Complex Dynamical Networks with Mixed Time-Varying Coupling Delays.",
            "Conditional Generative Adversarial Networks with Multi-scale Discriminators for Prostate MRI Segmentation.",
            "Fixed-Time Synchronization of Complex-Valued Memristor-Based Neural Networks with Impulsive Effects.",
            "A New Fixed-Time Stability Criterion and Its Application to Synchronization Control of Memristor-Based Fuzzy Inertial Neural Networks with Proportional Delay.",
            "Robust Subspace Clustering via Latent Smooth Representation Clustering.",
            "Feature Selection Method Based on Differential Correlation Information Entropy.",
            "Finite/Fixed-Time Bipartite Synchronization of Coupled Delayed Neural Networks Under a Unified Discontinuous Controller.",
            "Exponential Synchronization of Complex-Valued Neural Networks Via Average Impulsive Interval Strategy.",
            "Hyper Autoencoders.",
            "SNRNet: A Deep Learning-Based Network for Banknote Serial Number Recognition.",
            "Partial Pinning Control for the Synchronization of Fractional-Order Directed Complex Networks.",
            "Content-Based Bipartite User-Image Correlation for Image Recommendation.",
            "Flight Delay Prediction Using Deep Convolutional Neural Network Based on Fusion of Meteorological Data.",
            "Time Series Prediction Method Based on Variant LSTM Recurrent Neural Network.",
            "A Review of Dynamic Maps for 3D Human Motion Recognition Using ConvNets and Its Improvement.",
            "A Novel Solution of Using Deep Learning for White Blood Cells Classification: Enhanced Loss Function with Regularization and Weighted Loss (ELFRWL).",
            "Semi-supervised Weighted Ternary Decision Structure for Multi-category Classification.",
            "Logic Negation with Spiking Neural P Systems.",
            "Unsupervised Optical Flow Estimation Based on Improved Feature Pyramid.",
            "A Dynamic Programming Framework for Large-Scale Online Clustering on Graphs.",
            "Pathological lung segmentation based on random forest combined with deep model and multi-scale superpixels.",
            "Label Embedding for Multi-label Classification Via Dependence Maximization.",
            "Spiking Neural Networks: Background, Recent Development and the NeuCube Architecture.",
            "Feature-Based Learning in Drug Prescription System for Medical Clinics.",
            "Extreme Learning Machine for Supervised Classification with Self-paced Learning.",
            "Joint Feature Selection with Dynamic Spectral Clustering.",
            "Flexible Discrete Multi-view Hashing with Collective Latent Feature Learning.",
            "Sparse Low-Rank and Graph Structure Learning for Supervised Feature Selection.",
            "Local Structure Preservation for Nonlinear Clustering.",
            "Using Locality Preserving Projections to Improve the Performance of Kernel Clustering.",
            "Joint Robust Multi-view Spectral Clustering.",
            "Intra- and Inter-modal Multilinear Pooling with Multitask Learning for Video Grounding.",
            "Convolutional Sparse Coded Dynamic Brain Functional Connectivity.",
            "A Style-Specific Music Composition Neural Network.",
            "An Efficient Algorithm Combining Spectral Clustering with Feature Selection.",
            "Parameter-Free Extreme Learning Machine for Imbalanced Classification.",
            "Content-Aware Summarization of Broadcast Sports Videos: An Audio-Visual Feature Extraction Approach.",
            "Bipartite Synchronization Analysis of Fractional Order Coupled Neural Networks with Hybrid Control.",
            "Deep Plot-Aware Generalized Matrix Factorization for Collaborative Filtering.",
            "An Application of Generalized Fuzzy Hyperbolic Model for Solving Fractional Optimal Control Problems with Caputo-Fabrizio Derivative.",
            "Stochastic One-Step Training for Feedforward Artificial Neural Networks.",
            "Ensemble pruning of ELM via migratory binary glowworm swarm optimization and margin distance minimization.",
            "Asynchronous l2-l∞  Filtering for Discrete-Time Fuzzy Markov Jump Neural Networks with Unreliable Communication Links.",
            "An LMI Based State Estimation for Fractional-Order Memristive Neural Networks with Leakage and Time Delays.",
            "Robust Biometrics from Motion Wearable Sensors Using a D-vector Approach.",
            "Low-Rank Discriminative Adaptive Graph Preserving Subspace Learning.",
            "Adaptive Decision Threshold-Based Extreme Learning Machine for Classifying Imbalanced Multi-label Data.",
            "Region Stability and Stabilization of Recurrent Neural Network with Parameter Disturbances.",
            "A New Robust Fuzzy Clustering Approach: DBKIFCM.",
            "Improved Sparsity of Support Vector Machine with Robustness Towards Label Noise Based on Rescaled α-Hinge Loss with Non-smooth Regularizer.",
            "Locate the Bounding Box of Neural Networks with Intervals.",
            "Finite Time Anti-synchronization of Quaternion-Valued Neural Networks with Asynchronous Time-Varying Delays.",
            "Complementary Boundary Estimation Network for Temporal Action Proposal Generation.",
            "Solar Radiation Estimation in Mediterranean Climate by Weather Variables Using a Novel Bayesian Model Averaging and Machine Learning Methods.",
            "Specialization in Hierarchical Learning Systems.",
            "Adaptively Converting Auxiliary Attributes and Textual Embedding for Video Captioning Based on BiLSTM.",
            "A Robust Least Squares Support Vector Machine Based on L∞-norm.",
            "EW-Fisher: A Novel Loss Function for Deep Learning-Based Image Co-Segmentation.",
            "Cost-sensitive Dictionary Learning for Software Defect Prediction.",
            "Global Stabilization of Memristive Neural Networks with Leakage and Time-Varying Delays Via Quantized Sliding-Mode Controller.",
            "Extracting Classification Rules from Artificial Neural Network Trained with Discretized Inputs.",
            "Two-Stage Game Strategy for Multiclass Imbalanced Data Online Prediction.",
            "Robust Two-Dimensional Linear Discriminant Analysis via Information Divergence.",
            "Exploratory Data Analysis and Foreground Detection with the Growing Hierarchical Neural Forest.",
            "Evolutionary Denoising-Based Machine Learning for Detecting Knee Disorders.",
            "Detecting Ordinal Subcascades.",
            "Forecasting Monthly Tourism Demand Using Enhanced Backpropagation Neural Network.",
            "Output Layer Multiplication for Class Imbalance Problem in Convolutional Neural Networks.",
            "Pedestrian Detection Based on Light-Weighted Separable Convolution for Advanced Driver Assistance Systems.",
            "Adaptive Synchronization of Complex Dynamical Networks via Distributed Pinning Impulsive Control.",
            "Convergence of Batch Gradient Method Based on the Entropy Error Function for Feedforward Neural Networks."
        ]
    },
    {
        "name": "NPL",
        "year": "2019",
        "info": "2019: Volumes\n49,\n50",
        "count": 250,
        "papers": [
            "Global Mittag-Leffler Synchronization for Fractional-Order BAM Neural Networks with Impulses and Multiple Variable Delays via Delayed-Feedback Control Strategy.",
            "Neuro-Skins: Dynamics, Plasticity and Effect of Neuron Type and Cell Size on Their Response.",
            "Integrating Data-Driven Segmentation, Local Feature Extraction and Fisher Kernel Encoding to Improve Time Series Classification.",
            "Exponential Stability of Positive Recurrent Neural Networks with Multi-proportional Delays.",
            "New Results for Exponential Synchronization of Memristive Cohen-Grossberg Neural Networks with Time-Varying Delays.",
            "Global Exponential Synchronization of Memristive Competitive Neural Networks with Time-Varying Delay via Nonlinear Control.",
            "Global Mittag-Leffler Boundedness for Fractional-Order Complex-Valued Cohen-Grossberg Neural Networks.",
            "Pinning Synchronization of Nonlinear and Delayed Coupled Neural Networks with Multi-weights via Aperiodically Intermittent Control.",
            "An Artificial Neural Network for Solving Distributed Optimal Control of the Poisson's Equation.",
            "Image Captioning with Text-Based Visual Attention.",
            "Global Exponential Synchronization of Complex-Valued Neural Networks with Time Delays via Matrix Measure Method.",
            "Learning Robust Weighted Group Sparse Graph for Discriminant Visual Analysis.",
            "Weighted Version of Extended Nearest Neighbors.",
            "Pinning Synchronization of Coupled Memristive Recurrent Neural Networks with Mixed Time-Varying Delays and Perturbations.",
            "Automatic Medical Image Registration Based on an Integrated Method Combining Feature and Area Information.",
            "Finite-Time Stability and Synchronization of the Coupled Switched Neural Networks with Nodes of Different Dimensions.",
            "A Novel Gaussian-Bernoulli Based Convolutional Deep Belief Networks for Image Feature Extraction.",
            "New Results on Convergence of CNNs with Neutral Type Proportional Delays and D Operator.",
            "Discrete Analogue for a Class of Impulsive Cohen-Grossberg Neural Networks with Asynchronous Time-Varying Delays.",
            "Global Exponential Convergence of HCNNs with Neutral Type Proportional Delays and D Operator.",
            "Hyperspectral Image Feature Extraction Using Maclaurin Series Function Curve Fitting.",
            "Label Space Embedding of Manifold Alignment for Domain Adaption.",
            "Discriminative K-Means Laplacian Clustering.",
            "A Learning-Based Multimodel Integrated Framework for Dynamic Traffic Flow Forecasting.",
            "Fast and Robust Active Contours Model for Image Segmentation.",
            "Synchronization Criterion of Complex Dynamical Networks with Both Leakage Delay and Coupling Delay on Time Scales.",
            "Pseudo Almost Periodic Solutions for MAMs with an Oscillating Coefficient and Distributed Delays.",
            "Hardware/Software Co-design for a Neural Network Trained by Particle Swarm Optimization Algorithm.",
            "Discriminative Representation Learning with Supervised Auto-encoder.",
            "Homoclinical Structure of Retarded SICNNs with Rectangular Input Currents.",
            "Sparsity Regularization Discriminant Projection for Feature Extraction.",
            "EEG Emotion Recognition Based on Graph Regularized Sparse Linear Regression.",
            "Finite-Time Non-fragile Dissipative Stabilization of Delayed Neural Networks.",
            "Stabilization of Switched Stochastic Genetic Regulatory Networks with Leakage and Impulsive Effects.",
            "Multi-View Intact Space Learning for Tinnitus Classification in Resting State EEG.",
            "Global Convergence on Asymptotically Almost Periodic SICNNs with Nonlinear Decay Functions.",
            "Feature Extraction Based on Support Vector Data Description.",
            "Supervised Training of Spiking Neural Network by Adapting the E-MWO Algorithm for Pattern Classification.",
            "c-RNN: A Fine-Grained Language Model for Image Captioning.",
            "Delayed Feedback Controller based Finite Time Synchronization of Discontinuous Neural Networks with Mixed Time-Varying Delays.",
            "Stacked Marginal Time Warping for Temporal Alignment.",
            "A Novel Flower Pollination Algorithm for Modeling the Boiler Thermal Efficiency.",
            "New Delay-Dependent Stability Criteria for Impulsive Neural Networks with Additive Time-Varying Delay Components and Leakage Term.",
            "One Recurrent Neural Networks Solution for Passive Localization.",
            "Convolutional Shape-Aware Representation for 3D Object Classification.",
            "Stability of Quaternion-Valued Neural Networks with Mixed Delays.",
            "Trust-Aware Collaborative Filtering with a Denoising Autoencoder.",
            "Exponential Stability of Pseudo Almost Periodic Solutions for Fuzzy Cellular Neural Networks with Time-Varying Delays.",
            "Single Shot Text Detector with Rotational Prior Boxes.",
            "Higher-Order Brain Network Analysis for Auditory Disease.",
            "QRKISS: A Two-Stage Metric Learning via QR-Decomposition and KISS for Person Re-Identification.",
            "Rapid Pedestrian Detection Based on Deep Omega-Shape Features with Partial Occlusion Handing.",
            "Enhancing Face Recognition from Massive Weakly Labeled Data of New Domains.",
            "Generalized Discriminant Local Median Preserving Projections (GDLMPP) for Face Recognition.",
            "Structural Reweight Sparse Subspace Clustering.",
            "Binary Filter for Fast Vessel Pattern Extraction.",
            "Fast-Convergent Fully Connected Deep Learning Model Using Constrained Nodes Input.",
            "Obstacle Detection by Fusing Point Clouds and Monocular Image.",
            "Enhanced Bird Detection from Low-Resolution Aerial Image Using Deep Neural Networks.",
            "Bayesian Inference via Variational Approximation for Collaborative Filtering.",
            "Discrete Multi-graph Hashing for Large-Scale Visual Search.",
            "$$\\hbox {U}^2\\hbox {F}^2\\hbox {S}^2$$ U 2 F 2 S 2 : Uncovering Feature-level Similarities for Unsupervised Feature Selection.",
            "Video Synchronization Based on Projective-Invariant Descriptor.",
            "Body Part-Based Person Re-identification Integrating Semantic Attributes.",
            "Weighted Pseudo Almost Periodic Solutions for Cellular Neural Networks with Multi-proportional Delays.",
            "Neural Block Control via Integrator Backstepping for a Robotic Arm in Real-Time.",
            "Alignment Based Kernel Selection for Multi-Label Learning.",
            "Feature Extraction and Classification of Hand Movements Surface Electromyogram Signals Based on Multi-method Integration.",
            "Convergence of Neutral Type Fuzzy Cellular Neural Networks with D Operator.",
            "Invariant and Attracting Sets of Complex-Valued Neural Networks with Both Time-Varying and Infinite Distributed Delays.",
            "Anti-periodic Solutions for Quaternion-Valued High-Order Hopfield Neural Networks with Time-Varying Delays.",
            "Multi-task Character-Level Attentional Networks for Medical Concept Normalization.",
            "A Dynamic ELM with Balanced Variance and Bias for Long-Term Online Prediction.",
            "Discriminative Probabilistic Latent Semantic Analysis with Application to Single Sample Face Recognition.",
            "Bounded Generalized Gaussian Mixture Model with ICA.",
            "Impact Analysis of the Memristor Failure on Real-Time Control System of Robotic Arm.",
            "Application of Hyperspectral Image Classification Based on Overlap Pooling.",
            "An Improved Method for Semantic Image Inpainting with GANs: Progressive Inpainting.",
            "A Comparison: Different DCNN Models for Intelligent Object Detection in Remote Sensing Images.",
            "Biomedical Data Analysis Based on Multi-view Intact Space Learning with Geodesic Similarity Preserving.",
            "Robust Support Vector Regression in Primal with Asymmetric Huber Loss.",
            "Passivity and Synchronization of Coupled Reaction-Diffusion Cohen-Grossberg Neural Networks with Fixed and Switching Topologies.",
            "New Results on Impulsive Cohen-Grossberg Neural Networks.",
            "Locality Density-Based Fuzzy Multiple Empirical Kernel Learning.",
            "Complex Fuzzy Concept Lattice.",
            "On the Choice of Inter-Class Distance Maximization Term in Siamese Neural Networks.",
            "Robust Extreme Learning Machines with Different Loss Functions.",
            "Pseudo Almost Automorphic Solutions for Multidirectional Associative Memory Neural Network with Mixed Delays.",
            "Optimizing Extreme Learning Machine via Generalized Hebbian Learning and Intrinsic Plasticity Learning.",
            "Multi-Delay-Dependent Exponential Synchronization for Neutral-Type Stochastic Complex Networks with Markovian Jump Parameters via Adaptive Control.",
            "Real-Time Implementation of a Neural Integrator Backstepping Control via Recurrent Wavelet First Order Neural Network.",
            "Event Triggered Finite Time H∞ Boundedness of Uncertain Markov Jump Neural Networks with Distributed Time Varying Delays.",
            "Periodic Solution for ∇ -Stochastic High-Order Hopfield Neural Networks with Time Delays on Time Scales.",
            "Contractive Slab and Spike Convolutional Deep Belief Network.",
            "Discriminative Autoencoder for Feature Extraction: Application to Character Recognition.",
            "H∞ State Estimation for Stochastic Jumping Neural Networks with Fading Channels Over a Finite-Time Interval.",
            "LocalBoost: A Parallelizable Approach to Boosting Classifiers.",
            "Improved Recognition Results of Medieval Handwritten Gurmukhi Manuscripts Using Boosting and Bagging Methodologies.",
            "Enhance the Performance of Deep Neural Networks via L2 Regularization on the Input of Activations.",
            "SALA: A Self-Adaptive Learning Algorithm - Towards Efficient Dynamic Route Guidance in Urban Traffic Networks.",
            "Image Captioning with Bidirectional Semantic Attention-Based Guiding of Long Short-Term Memory.",
            "Piecewise Polynomial Activation Functions for Feedforward Neural Networks.",
            "Extraction of Product Evaluation Factors with a Convolutional Neural Network and Transfer Learning.",
            "A Primal Framework for Indefinite Kernel Learning.",
            "Semi-supervised One-Pass Multi-view Learning with Variable Features and Views.",
            "Robust H∞ Filtering of Stochastic Switched Complex Dynamical Networks with Parameter Uncertainties, Disturbances, and Time-Varying Delays.",
            "Graph Regularized Sparse Autoencoders with Nonnegativity Constraints.",
            "Adaptive Learning Based on Tracking and ReIdentifying Objects Using Convolutional Neural Network.",
            "Multi-object Tracking by Joint Detection and Identification Learning.",
            "Pseudo Almost Periodic Solution of Recurrent Neural Networks with D Operator on Time Scales.",
            "Improved GNN Models for Constant Matrix Inversion.",
            "Stability Switches and Hopf Bifurcation of a Neuron System with both Leakage and Distributed Delays.",
            "Sampled-Data State Estimation of Neutral Type Neural Networks with Mixed Time-Varying Delays.",
            "Action Recognition Using Multiple Pooling Strategies of CNN Features.",
            "Age-Invariant Face Recognition Using Coupled Similarity Reference Coding.",
            "Stability Analysis in a Class of Markov Switched Stochastic Hopfield Neural Networks.",
            "Image Caption with Endogenous-Exogenous Attention.",
            "General Decay Lag Synchronization for Competitive Neural Networks with Constant Delays.",
            "Exponential Synchronization of Stochastic Memristive Neural Networks with Time-Varying Delays.",
            "Sign Normalised Hammerstein Spline Adaptive Filtering Algorithm in an Impulsive Noise Environment.",
            "A Forecasting Framework Based on Kalman Filter Integrated Multivariate Local Polynomial Regression: Application to Urban Water Demand.",
            "Synchronization of Switched Coupled Neural Networks with Distributed Impulsive Effects: An Impulsive Strength Dependent Approach.",
            "Weighted Channel-Wise Decomposed Convolutional Neural Networks.",
            "Adaptive Syncretic Attention for Constrained Image Captioning.",
            "Asymptotical Stability of Riemann-Liouville Fractional-Order Neutral-Type Delayed Projective Neural Networks.",
            "Stability Analysis of Fractional Order Hopfield Neural Networks with Optimal Discontinuous Control.",
            "New Results on Periodicity of Non-autonomous Inertial Neural Networks Involving Non-reduced Order Method.",
            "Finite-Time Stability for Caputo-Katugampola Fractional-Order Time-Delayed Neural Networks.",
            "An Ar2p Deep Learning Architecture for the Discovery and the Selection of Features.",
            "An Alternative Approach for Setting the Optimum Coupling Parameters Among the Neural Central Pattern Generators Considering the Amplitude and the Phase Error Calculations.",
            "Event-Triggered Distributed Cooperative Learning Algorithms over Networks via Wavelet Approximation.",
            "Fuzzy One-Class Extreme Auto-encoder.",
            "Exponential Stability of Positive Shunting Inhibitory Cellular Neural Networks with Multi-proportional Delays.",
            "A Comparative Study of Suitability of Certain Features in Classification of Bharatanatyam Mudra Images Using Artificial Neural Network.",
            "Application of Strong Arcs in m-Polar Fuzzy Graphs.",
            "Robust Affine Subspace Clustering via Smoothed ℓ0-Norm.",
            "From Night to Day: GANs Based Low Quality Image Enhancement.",
            "A New LMI Approach to Finite and Fixed Time Stabilization of High-Order Class of BAM Neural Networks with Time-Varying Delays.",
            "Corpus Analysis Using Relaxed Conjugate Gradient Neural Network Training Algorithm.",
            "Stability Analysis for a Class of Impulsive Bidirectional Associative Memory (BAM) Neural Networks with Distributed Delays and Leakage Time-Varying Delays.",
            "Classification of Gait Patterns Using Kinematic and Kinetic Features, Gait Dynamics and Neural Networks in Patients with Unilateral Anterior Cruciate Ligament Deficiency.",
            "Synthesization of Multi-valued Associative High-Capacity Memory Based on Continuous Networks with a Class of Non-smooth Linear Nondecreasing Activation Functions.",
            "An Efficient SMO Algorithm for Solving Non-smooth Problem Arising in ε -Insensitive Support Vector Regression.",
            "On Incremental Learning for Gradient Boosting Decision Trees.",
            "A Hybride Active Contour Model Driven by Global and Local Image Information.",
            "Image Captioning Using Region-Based Attention Joint with Time-Varying Attention.",
            "Bifurcation Analysis of Delayed Complex-Valued Neural Network with Diffusions.",
            "An Improved Structured Low-Rank Representation for Disjoint Subspace Segmentation.",
            "Synchronization for Nonlinear Complex Spatio-Temporal Networks with Multiple Time-Invariant Delays and Multiple Time-Varying Delays.",
            "New Results on Robust Finite-Time Passivity for Fractional-Order Neural Networks with Uncertainties.",
            "Discriminative Feature Learning via Sparse Autoencoders with Label Consistency Constraints.",
            "Concave-Convex Programming for Ramp Loss-Based Maximum Margin and Minimum Volume Twin Spheres Machine.",
            "Competitive Cross-Entropy Loss: A Study on Training Single-Layer Neural Networks for Solving Nonlinearly Separable Classification Problems.",
            "Stability of Inertial Neural Network with Time-Varying Delays Via Sampled-Data Control.",
            "Finite-Time Synchronization of Memristive Neural Networks with Proportional Delay.",
            "Solving Partial Differential Equation Based on Bernstein Neural Network and Extreme Learning Machine Algorithm.",
            "Daily Urban Water Demand Forecasting Based on Chaotic Theory and Continuous Deep Belief Neural Network.",
            "A Soft Sensing Scheme of Gas Utilization Ratio Prediction for Blast Furnace Via Improved Extreme Learning Machine.",
            "Nonnegative Constrained Graph Based Canonical Correlation Analysis for Multi-view Feature Learning.",
            "On Finite-Time Stability for Fractional-Order Neural Networks with Proportional Delays.",
            "Efficient Large Margin-Based Feature Extraction.",
            "Classification of EEG Signals Using Hybrid Feature Extraction and Ensemble Extreme Learning Machine.",
            "Discriminative Graph Based Similarity Boosting.",
            "Global Asymptotic Stability of Periodic Solutions for Discrete Time Delayed BAM Neural Networks by Combining Coincidence Degree Theory with LMI Method.",
            "Multi-step Training of a Generalized Linear Classifier.",
            "Calibrated Multi-label Classification with Label Correlations.",
            "Robust Exponential Stabilization for Switched Neutral Neural Networks with Mixed Time-Varying Delays.",
            "Low-Dimensional Perturb-and-MAP Approach for Learning Restricted Boltzmann Machines.",
            "Recursive Particle Filter-Based RBF Network on Time Series Prediction of Measurement Data.",
            "Multi-view Opinion Mining with Deep Learning.",
            "Fine Tuning Dual Streams Deep Network with Multi-scale Pyramid Decision for Heterogeneous Face Recognition.",
            "A Parallel Image Skeletonizing Method Using Spiking Neural P Systems with Weights.",
            "Improved SMOTE Algorithm to Deal with Imbalanced Activity Classes in Smart Homes.",
            "An Artificial Neural Network Model to Solve the Fuzzy Shortest Path Problem.",
            "Stability and Synchronization Analysis of Discrete-Time Delayed Neural Networks with Discontinuous Activations.",
            "Global Asymptotic Stability of Periodic Solutions for Neutral-Type Delayed BAM Neural Networks by Combining an Abstract Theorem of k-Set Contractive Operator with LMI Method.",
            "A Split-Complex Valued Gradient-Based Descent Neuro-Fuzzy Algorithm for TS System and Its Convergence.",
            "Hierarchical Dialog State Tracking with Unknown Slot Values.",
            "α-Exponential Stability of Impulsive Fractional-Order Complex-Valued Neural Networks with Time Delays.",
            "State Distribution-Aware Sampling for Deep Q-Learning.",
            "Multi-view Intact Discriminant Space Learning for Image Classification.",
            "A Non-linear and Noise-Tolerant ZNN Model and Its Application to Static and Time-Varying Matrix Square Root Finding.",
            "Restricted Convolutional Neural Networks.",
            "Zhang Neural Dynamics Approximated by Backward Difference Rules in Form of Time-Delay Differential Equation.",
            "On the Flexible Dynamics Analysis for the Unified Discrete-Time RNNs.",
            "Finite-Time Synchronization of Complex-Valued Neural Networks with Multiple Time-Varying Delays and Infinite Distributed Delays.",
            "Several Novel Dynamic Ensemble Selection Algorithms for Time Series Prediction.",
            "Weighted Pseudo Almost Periodic Shunting Inhibitory Cellular Neural Networks with Multi-proportional Delays.",
            "Robust Class-Specific Autoencoder for Data Cleaning and Classification in the Presence of Label Noise.",
            "Measuring Entity Relatedness via Entity and Text Joint Embedding.",
            "Spatiotemporal Fusion Networks for Video Action Recognition.",
            "Deep Captioning with Attention-Based Visual Concept Transfer Mechanism for Enriching Description.",
            "Recent Deep Learning Techniques, Challenges and Its Applications for Medical Healthcare System: A Review.",
            "Learning from Imbalanced Data Sets with Weighted Cross-Entropy Function.",
            "A Fast Algorithm for Convolutional Neural Networks Using Tile-based Fast Fourier Transforms.",
            "Global Asymptotic Stabilization of Cellular Neural Networks with Proportional Delay via Impulsive Control.",
            "Improved Gradient Neural Networks for Solving Moore-Penrose Inverse of Full-Rank Matrix.",
            "Adaptive State Estimation of Stochastic Delayed Neural Networks with Fractional Brownian Motion.",
            "End-to-End Trained Sparse Coding Network with Spatial Pyramid Pooling for Image Classification.",
            "Breast Tumor Classification Using Fast Convergence Recurrent Wavelet Elman Neural Networks.",
            "Exponential Synchronization of Inertial Memristor-Based Neural Networks with Time Delay Using Average Impulsive Interval Approach.",
            "Finite-Time and Fixed-Time Synchronization of Complex Networks with Discontinuous Nodes via Quantized Control.",
            "Hessian Regularized Distance Metric Learning for People Re-Identification.",
            "An Ensemble Classification Algorithm Based on Information Entropy for Data Streams.",
            "The Intermittent Control Synchronization of Complex-Valued Memristive Recurrent Neural Networks with Time-Delays.",
            "Relationships Self-Learning Based Gender-Aware Age Estimation.",
            "Two-Stage Method for Diagonal Recurrent Neural Network Identification of a High-Power Continuous Microwave Heating System.",
            "Global Exponential Synchronization of Delayed Complex-Valued Recurrent Neural Networks with Discontinuous Activations.",
            "Impulsive Stabilization and Synchronization of Fractional-Order Complex-Valued Neural Networks.",
            "Bifurcation Analysis for Simplified Five-Neuron Bidirectional Associative Memory Neural Networks with Four Delays.",
            "Online Learning for Time Series Prediction of AR Model with Missing Data.",
            "Surface Electromyography-Based Daily Activity Recognition Using Wavelet Coherence Coefficient and Support Vector Machine.",
            "Feature Selection for Recognition of Online Handwritten Bangla Characters.",
            "Short-Term Traffic Flow Prediction Based on Least Square Support Vector Machine with Hybrid Optimization Algorithm.",
            "Alignment Based Feature Selection for Multi-label Learning.",
            "Artificial Neural Networks with Random Weights for Incomplete Datasets.",
            "Pinning Adaptive and Exponential Synchronization of Fractional-Order Uncertain Complex Neural Networks with Time-Varying Delays.",
            "A Novel Noise-Enhanced Back-Propagation Technique for Weak Signal Detection in Neyman-Pearson Framework.",
            "Finite-Time and Fixed-Time Synchronization of Inertial Cohen-Grossberg-Type Neural Networks with Time Varying Delays.",
            "Remaining Life Prediction Method for Rolling Bearing Based on the Long Short-Term Memory Network.",
            "Application of Mind Evolutionary Algorithm and Artificial Neural Networks for Prediction of Profile and Flatness in Hot Strip Rolling Process.",
            "Stable and Refined Style Transfer Using Zigzag Learning Algorithm.",
            "Dynamic Optimization of Neuron Systems with Leakage Delay and Distributed Delay via Hybrid Control.",
            "Synchronization of Coupled Complex-Valued Impulsive Neural Networks with Time Delays.",
            "Memory-based State Estimation of T-S Fuzzy Markov Jump Delayed Neural Networks with Reaction-Diffusion Terms.",
            "Synchronizing Chaotic Systems with Uncertain Model and Unknown Interference Using Sliding Mode Control and Wavelet Neural Networks.",
            "Generalized Regression Neural Network Optimized by Genetic Algorithm for Solving Out-of-Sample Extension Problem in Supervised Manifold Learning.",
            "No-Reference Video Quality Assessment Based on the Temporal Pooling of Deep Features.",
            "A New Complex-Valued Polynomial Model.",
            "Generalizing the Convolution Operator in Convolutional Neural Networks.",
            "Learning Morpheme Representation for Mongolian Named Entity Recognition.",
            "Online Hard Region Mining for Semantic Segmentation.",
            "An Analysis of IRL-Based Optimal Tracking Control of Unknown Nonlinear Systems with Constrained Input.",
            "The Parameter Identification of PMSM Based on Improved Cuckoo Algorithm.",
            "Increasing Capacity of Association Memory by Means of Synaptic Clustering.",
            "Sample Based Fast Adversarial Attack Method.",
            "A Robust Sentiment Analysis Method Based on Sequential Combination of Convolutional and Recursive Neural Networks.",
            "Time Series Forecasting Using Neural Networks: Are Recurrent Connections Necessary?",
            "Exponential Stabilization for Hybrid Recurrent Neural Networks by Delayed Noises Rooted in Discrete Observations of State and Mode.",
            "Extended H∞ Synchronization Control for Switched Neural Networks with Multi Quantization Densities Based on a Persistent Dwell-Time Approach.",
            "A Stable, Unified Density Controlled Memetic Algorithm for Gene Regulatory Network Reconstruction Based on Sparse Fuzzy Cognitive Maps.",
            "Finite-Time Anti-synchronization of Multi-weighted Coupled Neural Networks With and Without Coupling Delays.",
            "Learning Distance Metric for Support Vector Machine: A Multiple Kernel Learning Approach.",
            "Double-Key Secure for N-1-N Sound Record Data (SRD) by the Drive-Response of BAM NNs.",
            "T-S Fuzzy Model Identification with Sparse Bayesian Techniques.",
            "Optimal Output Feedback Control of Nonlinear Partially-Unknown Constrained-Input Systems Using Integral Reinforcement Learning.",
            "Fisher Discriminative Coupled Dictionaries Learning.",
            "A Note on Liao's Recurrent Neural-Network Learning for Discrete Multi-stage Optimal Control Problems.",
            "A Novel Genetically Optimized Convolutional Neural Network for Traffic Sign Recognition: A New Benchmark on Belgium and Chinese Traffic Sign Datasets.",
            "Projection Recurrent Neural Network Model: A New Strategy to Solve Weapon-Target Assignment Problem."
        ]
    },
    {
        "name": "NPL",
        "year": "2018",
        "info": "2018: Volumes\n47,\n48",
        "count": 165,
        "papers": [
            "Synchronization of a Class of Improved Neural Networks Based on Periodic Intermittent Control.",
            "A Feature Selection Method for Projection Twin Support Vector Machine.",
            "Discriminant Analysis with Local Gaussian Similarity Preserving for Feature Extraction.",
            "Almost Periodic Solutions for SICNNs with Neutral Type Proportional Delays and D Operators.",
            "Mittag-Leffler Stability and Global Asymptotically ω -Periodicity of Fractional-Order BAM Neural Networks with Time-Varying Delays.",
            "Leaf Recognition Based on DPCNN and BOW.",
            "LSTM2 : Multi-Label Ranking for Document Classification.",
            "Power-Rate Synchronization of Fractional-Order Nonautonomous Neural Networks with Heterogeneous Proportional Delays.",
            "Stability Analysis of Impulsive Neural Networks with Piecewise Constant Arguments.",
            "A Capable Neural Network Framework for Solving Degenerate Quadratic Optimization Problems with an Application in Image Fusion.",
            "Fuzzy-Rough Instance Selection Combined with Effective Classifiers in Credit Scoring.",
            "Delta-Differentiable Weighted Pseudo-Almost Automorphicity on Time-Space Scales for a Novel Class of High-Order Competitive Neural Networks with WPAA Coefficients and Mixed Delays.",
            "Chebyshev Functional Link Artificial Neural Network Based on Correntropy Induced Metric.",
            "Cognitive Gravity Model Based Semi-Supervised Dimension Reduction.",
            "Robust Video Face Recognition Under Pose Variation.",
            "Robust Parametric Twin Support Vector Machine for Pattern Classification.",
            "Exponential Stability of Neutral-Type Impulsive Markovian Jump Neural Networks with General Incomplete Transition Rates.",
            "Passivity and Passivity-Based Synchronization of Switched Coupled Reaction-Diffusion Neural Networks with State and Spatial Diffusion Couplings.",
            "Finite-Time Lag Synchronization for Memristive Mixed Delays Neural Networks with Parameter Mismatch.",
            "A Simplified Architecture of the Zhang Neural Network for Toeplitz Linear Systems Solving.",
            "Stability Analysis of TS Fuzzy System with State-Dependent Impulses.",
            "Delay-Independent Stability of Riemann-Liouville Fractional Neutral-Type Delayed Neural Networks.",
            "Mixed H∞ /Passive Projective Synchronization for Nonidentical Uncertain Fractional-Order Neural Networks Based on Adaptive Sliding Mode Control.",
            "Evolutionary Based Weight Decaying Method for Neural Network Training.",
            "A Hyperplane Clustering Algorithm for Estimating the Mixing Matrix in Sparse Component Analysis.",
            "Parallel Bayesian ARTMAP and Its OpenCL Implementation.",
            "Finite-Time Robust Synchronization of Memrisive Neural Network with Perturbation.",
            "Supervised Dictionary Learning with Smooth Shrinkage for Image Denoising.",
            "Fast Learning Network with Parallel Layer Perceptrons.",
            "A Novel Greedy Randomized Dynamic Ensemble Selection Algorithm.",
            "Stability Analysis for Memristive Recurrent Neural Network Under Different External Stimulus.",
            "A Novel Model-Based Approach for Medical Image Segmentation Using Spatially Constrained Inverted Dirichlet Mixture Models.",
            "Stability of Variable-Time Impulsive Systems with Delays via Generalized Razumikhin Technique and Application to Impulsive Neural Networks.",
            "Tensor Locality Preserving Sparse Projection for Image Feature Extraction.",
            "Synchronization Control of Coupled Memristor-Based Neural Networks with Mixed Delays and Stochastic Perturbations.",
            "Nonlinear Dimensionality Reduction for Data with Disconnected Neighborhood Graph.",
            "Novelty Detection in Time Series Using Self-Organizing Neural Networks: A Comprehensive Evaluation.",
            "Competitive Brain Emotional Learning.",
            "Preface.",
            "Support Vector Machine Histogram: New Analysis and Architecture Design Method of Deep Convolutional Neural Network.",
            "Feature Analysis of Unsupervised Learning for Multi-task Classification Using Convolutional Neural Network.",
            "Majorization Minimization Technique for Optimally Solving Deep Dictionary Learning.",
            "Parallel Implementation of the Nonlinear Semi-NMF Based Alternating Optimization Method for Deep Neural Networks.",
            "Sparse Auto-encoder with Smoothed l1 Regularization.",
            "DropCircuit : A Modular Regularizer for Parallel Circuit Networks.",
            "Deep Learning and Preference Learning for Object Tracking: A Combined Approach.",
            "Unsupervised Video Hashing via Deep Neural Network.",
            "Model-Free Deep Inverse Reinforcement Learning by Logistic Regression.",
            "Content-Based Image Retrieval Using Iterative Search.",
            "Direction-of-Arrival Estimation of Ultra-Wideband Signals in Narrowband Interference Environment Based on Power Inversion and Complex-Valued Neural Networks.",
            "Gauge Neural Network with Z(2) Synaptic Variables: Phase Structure and Simulation of Learning and Recalling Patterns.",
            "Learning Algorithms for Quaternion-Valued Neural Networks.",
            "Aggregated Temporal Tensor Factorization Model for Point-of-Interest Recommendation.",
            "Evolutionary Multi-task Learning for Modular Knowledge Representation in Neural Networks.",
            "Hierarchical Tensor SOM Network for Multilevel-Multigroup Analysis.",
            "Words-In-Sequence Memory Formed by Eye Movement Sequences During Reading: A Network Model Based on Theta Phase Coding.",
            "Random Pattern and Frequency Generation Using a Photonic Reservoir Computer with Output Feedback.",
            "Integrated Intelligent Method for Displacement Prediction in Underground Engineering.",
            "Finite-Time and Fixed-Time Stabilization Control of Delayed Memristive Neural Networks: Robust Analysis Technique.",
            "Passivity Analysis of Stochastic Memristor-Based Complex-Valued Recurrent Neural Networks with Mixed Time-Varying Delays.",
            "Passivity of Reaction-Diffusion Genetic Regulatory Networks with Time-Varying Delays.",
            "Single Multiplicative Neuron Model Artificial Neural Network with Autoregressive Coefficient for Time Series Modelling.",
            "Robust l2, 1 Norm-Based Sparse Dictionary Coding Regularization of Homogenous and Heterogenous Graph Embeddings for Image Classifications.",
            "Further Improvement on Delay-Dependent Global Robust Exponential Stability for Delayed Cellular Neural Networks with Time-Varying Delays.",
            "Face Recognition Using Gabor-Based Feature Extraction and Feature Space Transformation Fusion Method for Single Image per Person Problem.",
            "Decentralized Event-Triggered Exponential Stability for Uncertain Delayed Genetic Regulatory Networks with Markov Jump Parameters and Distributed Delays.",
            "Heterogeneous Similarity Learning for More Practical Kinship Verification.",
            "A L-BFGS Based Learning Algorithm for Complex-Valued Feedforward Neural Networks.",
            "Local Bifurcation Analysis of a Fractional-Order Dynamic Model of Genetic Regulatory Networks with Delays.",
            "Stability Analysis of Anti-periodic Neutral Type SICNNs with D Operator.",
            "Stochastic Support Vector Machine for Classifying and Regression of Random Variables.",
            "Concept Learning Using Vague Concept Lattice.",
            "Pruning the Ensemble of ANN Based on Decision Tree Induction.",
            "Sensor Deployment Scheme Based on Social Spider Optimization Algorithm for Wireless Sensor Networks.",
            "Temperature-Based Deep Boltzmann Machines.",
            "Gradient Neural Network with Nonlinear Activation for Computing Inner Inverses and the Drazin Inverse.",
            "Fixed-Size Extreme Learning Machines Through Simulated Annealing.",
            "Supervoxel Segmentation and Bias Correction of MR Image with Intensity Inhomogeneity.",
            "Pseudo Almost Periodic Shunting Inhibitory Cellular Neural Networks with Multi-proportional Delays.",
            "Finite-Time Stability for Delayed Complex-Valued BAM Neural Networks.",
            "Driver State Analysis Based on Imperfect Multi-view Evidence Support.",
            "Determining Approximate Solutions of Nonlinear Ordinary Differential Equations Using Orthogonal Colliding Bodies Optimization.",
            "Robust Stability of Inertial BAM Neural Networks with Time Delays and Uncertainties via Impulsive Effect.",
            "Knowledge Fusion in Feedforward Artificial Neural Networks.",
            "L1-Norm GEPSVM Classifier Based on an Effective Iterative Algorithm for Classification.",
            "Robust Low Rank Subspace Segmentation via Joint ℓ21 -Norm Minimization.",
            "A New Virtual Samples-Based CRC Method for Face Recognition.",
            "Small-Scale Building Load Forecast based on Hybrid Forecast Engine.",
            "Fitness Landscape Analysis of Weight-Elimination Neural Networks.",
            "A Deep Neural Network Based on ELM for Semi-supervised Learning of Image Classification.",
            "A Multi-Valued Neuron Based Complex ELM Neural Network.",
            "Fast Pedestrian Detection Based on the Selective Window Differential Filter.",
            "Safety-Critical Support Vector Regressor Controller for Nonlinear Systems.",
            "Solitary Wave and Periodic Wave Solutions of Generalized Neutral-Type Neural Networks with Delays.",
            "Global Mittag-Leffler Synchronization of Fractional-Order Neural Networks Via Impulsive Control.",
            "Two Novel Versions of Randomized Feed Forward Artificial Neural Networks: Stochastic and Pruned Stochastic.",
            "A Multimodal Optimization Algorithm Inspired by the States of Matter.",
            "Synchronization of Heterogeneous Partially Coupled Networks with Heterogeneous Impulses.",
            "The Global Exponential Stability of the Delayed Complex-Valued Neural Networks with Almost Periodic Coefficients and Discontinuous Activations.",
            "Deep Learning with Darwin: Evolutionary Synthesis of Deep Neural Networks.",
            "Imposing Class-Wise Feature Similarity in Stacked Autoencoders by Nuclear Norm Regularization.",
            "On Extending the Noncircular Fast Independent Vector Analysis Algorithm to the Noisy Model.",
            "Off the Mainstream: Advances in Neural Networks and Machine Learning for Pattern Recognition.",
            "Multilayer Graph Node Kernels: Stacking While Maintaining Convexity.",
            "Time Series Prediction for Graphs in Kernel and Dissimilarity Spaces.",
            "On the Impact of Using Utilities Rather than Costs for Graph Matching.",
            "A Temporal Dependency Based Multi-modal Active Learning Approach for Audiovisual Event Detection.",
            "Dynamic Hybrid Random Fields for the Probabilistic Graphical Modeling of Sequential Data: Definitions, Algorithms, and an Application to Bioinformatics.",
            "Neural Networks Pipeline for Offline Machine Printed Arabic OCR.",
            "Time Series Classification in Reservoir- and Model-Space.",
            "Theoretical Foundations for the Alpha-Beta Associative Memories: 10 Years of Derived Extensions, Models, and Applications.",
            "On the Weighted Pseudo-Almost Periodic Solution for BAM Networks with Delays.",
            "The Influence of Multi-class Feature Selection on the Prediction of Diagnostic Phenotypes.",
            "Ultra-Sparse Classifiers Through Minimizing the VC Dimension in the Empirical Feature Space - Submitted to the Special Issue on \"Off the Mainstream: Advances in Neural Networks and Machine Learning for Pattern Recognition\".",
            "Soft-Constrained Neural Networks for Nonparametric Density Estimation.",
            "Density Based Cluster Growing via Dominant Sets.",
            "A New Conjugate Gradient Method with Smoothing L1/2 Regularization Based on a Modified Secant Equation for Training Neural Networks.",
            "Robust Exponential Synchronization for Stochastic Delayed Neural Networks with Reaction-Diffusion Terms and Markovian Jumping Parameters.",
            "Global Asymptotic Stability for Complex-Valued Neural Networks with Time-Varying Delays via New Lyapunov Functionals and Complex-Valued Inequalities.",
            "Global Asymptotic Periodic Synchronization for Delayed Complex-Valued BAM Neural Networks via Vector-Valued Inequality Techniques.",
            "Short-Term Wind Speed Prediction Using Signal Preprocessing Technique and Evolutionary Support Vector Regression.",
            "Approximate Solutions of Initial Value Problems for Ordinary Differential Equations Using Radial Basis Function Networks.",
            "Exploring Implicit Semantic Constraints for Bilingual Word Embeddings.",
            "An Empirical Study for Transboundary Pollution of Three Gorges Reservoir Area with Emission Permits Trading.",
            "First-Order Sensitivity Analysis for Hidden Neuron Selection in Layer-Wise Training of Networks.",
            "Associative Memory Realized by Reconfigurable Coupled Three-Cell CNNs.",
            "Developmental Network: An Internal Emergent Object Feature Learning.",
            "Fixed-Time Synchronization of Coupled Discontinuous Neural Networks with Nonidentical Perturbations.",
            "Adaptive Finite-Time Synchronization of Neutral Type Dynamical Network with Double Derivative Coupling.",
            "A Novel Least Square Twin Support Vector Regression.",
            "Pseudo Almost Periodic Solutions for Fuzzy Cellular Neural Networks with Multi-proportional Delays.",
            "Domain Adaptation with Twin Support Vector Machines.",
            "Image Segmentation via Mean Curvature Regularized Mumford-Shah Model and Thresholding.",
            "Method for Meteorological Early Warning of Precipitation-Induced Landslides Based on Deep Neural Network.",
            "AIFD Based 2D Image Registration to Multi-View Stereo Mapped 3D Models.",
            "3D Reconstruction of Indoor Scenes via Image Registration.",
            "Robust Non-rigid Registration Based on Affine ICP Algorithm and Part-Based Method.",
            "Automatic Tumor Segmentation with Deep Convolutional Neural Networks for Radiotherapy Applications.",
            "Document Classification via Nonlinear Metric Learning.",
            "Malicious Domain Name Detection Based on Extreme Machine Learning.",
            "Robust Spectral Subspace Clustering Based on Least Square Regression.",
            "Performance Analysis for SVM Combining with Metric Learning.",
            "View-Based 3D Model Retrieval via Multi-graph Matching.",
            "AAM Based Face Sketch Synthesis.",
            "Real-Time Attitude Estimation by Using Parallax Observation System.",
            "Synchronization of Multi-links Memristor-Based Switching Networks Under Uniform Random Attacks.",
            "Impulsive Control for a Class of Cellular Neural Networks with Proportional Delay.",
            "Stability and Hopf Bifurcation of a Three-Neuron Network with Multiple Discrete and Distributed Delays.",
            "Training Visual-Semantic Embedding Network for Boosting Automatic Image Annotation.",
            "Robust Mittag-Leffler Synchronization for Uncertain Fractional-Order Discontinuous Neural Networks via Non-fragile Control Strategy.",
            "Global Dissipativity of Inertial Neural Networks with Proportional Delay via New Generalized Halanay Inequalities.",
            "An Efficient Algorithm for Solving Fuzzy Linear Programming Problems.",
            "Feature Extraction Using Fractional-Order Embedding Direct Linear Discriminant Analysis.",
            "Increment Learning and Rapid Retrieval of Visual Information Based on Pattern Association Memory.",
            "Piecewise Pseudo Almost Periodic Solutions of Generalized Neutral-Type Neural Networks with Impulses and Delays.",
            "An Improved Deep Clustering Model for Underwater Acoustical Targets.",
            "Finite-Time Stabilization of Neutral Hopfield Neural Networks with Mixed Delays.",
            "Robust Subspace Segmentation by Self-Representation Constrained Low-Rank Representation.",
            "An Analysis of Global Stability of Takagi-Sugeno Fuzzy Cohen-Grossberg Neural Networks with Time Delays.",
            "Structure Preserving Sparse Coding for Data Representation.",
            "Centroid Neural Network with Pairwise Constraints for Semi-supervised Learning.",
            "New Algebraic Criteria for Global Exponential Periodicity and Stability of Memristive Neural Networks with Variable Delays.",
            "Fingerprint Extraction and Classification of Wireless Channels Based on Deep Convolutional Neural Networks.",
            "An Efficient, Low-Cost Routing Architecture for Spiking Neural Network Hardware Implementations.",
            "Toward a Cluttered Environment for Learning-Based Multi-Scale Overhead Ground Wire Recognition."
        ]
    },
    {
        "name": "NPL",
        "year": "2017",
        "info": "2017: Volumes\n45,\n46",
        "count": 124,
        "papers": [
            "Realistic Hodgkin-Huxley Axons Using Stochastic Behavior of Memristors.",
            "Novel Switching Jumps Dependent Exponential Synchronization Criteria for Memristor-Based Neural Networks.",
            "Hyperconic Multilayer Perceptron.",
            "A Neural Network Approach for Solving a Class of Fractional Optimal Control Problems.",
            "Multi-focus Image Fusion Based on the Improved PCNN and Guided Filter.",
            "Weighted Average Pinning Synchronization for a Class of Coupled Neural Networks with Time-Varying Delays.",
            "Finite-Time Stability of a Class of CNNs with Heterogeneous Proportional Delays and Oscillating Leakage Coefficients.",
            "Pseudo Almost Automorphic Solutions of Recurrent Neural Networks with Time-Varying Coefficients and Mixed Delays.",
            "Exponential Stability of Pseudo Almost Periodic Solutions for Cellular Neural Networks with Multi-Proportional Delays.",
            "Semi-supervised Collective Classification in Multi-attribute Network Data.",
            "Learning Invariant Features Using Subspace Restricted Boltzmann Machine.",
            "Pseudo Almost Periodic Solutions for SICNNs with Oscillating Leakage Coefficients and Complex Deviating Arguments.",
            "Unified and Coupled Self-Stabilizing Algorithms for Minor and Principal Eigen-pairs Extraction.",
            "Stability Analysis of Fractional-Order Hopfield Neural Networks with Time-Varying External Inputs.",
            "On Chaotic Neural Network Design: A New Framework.",
            "Hierarchical Multilabel Classification with Optimal Path Prediction.",
            "Fractional-Order Embedding Supervised Canonical Correlations Analysis with Applications to Feature Extraction and Recognition.",
            "A Hybrid Heat Rate Forecasting Model Using Optimized LSSVM Based on Improved GSA.",
            "Online Learning Algorithms for Double-Weighted Least Squares Twin Bounded Support Vector Machines.",
            "Evolving Fuzzy Min-Max Neural Network Based Decision Trees for Data Stream Classification.",
            "Classification of EEG Signals Based on Autoregressive Model and Wavelet Packet Decomposition.",
            "Stability Analysis of Fractional Order Complex-Valued Memristive Neural Networks with Time Delays.",
            "Global Exponential Convergence of Neutral Type Shunting Inhibitory Cellular Neural Networks with D Operator.",
            "Cost Sensitive Semi-Supervised Canonical Correlation Analysis for Multi-view Dimensionality Reduction.",
            "Learning and Convergence of Fuzzy Cognitive Maps Used in Pattern Recognition.",
            "Deterministic Convergence of Wirtinger-Gradient Methods for Complex-Valued Neural Networks.",
            "A NN-Based Hybrid Intelligent Algorithm for a Discrete Nonlinear Uncertain Optimal Control Problem.",
            "Fully Complex Valued Wavelet Network for Forecasting the Global Solar Irradiation.",
            "Factor Augmented Artificial Neural Network Model.",
            "Anti-periodic Solutions of Inertial Neural Networks with Time Delays.",
            "Ensemble Multiple-Kernel Based Manifold Regularization.",
            "Pseudo-marginal Markov Chain Monte Carlo for Nonnegative Matrix Factorization.",
            "Centroid Normal Direct Support Vector Machine.",
            "One-Class Classification Based on Extreme Learning and Geometric Class Information.",
            "Stability and Hopf Bifurcation of Time Fractional Cohen-Grossberg Neural Networks with Diffusion and Time Delays in Leakage Terms.",
            "Piecewise Pseudo Almost Periodic Solution for Impulsive Generalised High-Order Hopfield Neural Networks with Leakage Delays.",
            "Multi-view Discriminant Dictionary Learning via Learning View-specific and Shared Structured Dictionaries for Image Classification.",
            "Feature Selection for Adaptive Dual-Graph Regularized Concept Factorization for Data Representation.",
            "Spatiotemporal Behavior of Small-World Neuronal Networks Using a Map-Based Model.",
            "State Preserving Extreme Learning Machine: A Monotonically Increasing Learning Approach.",
            "Editorial for Special Issue on ICONIP 2014.",
            "Sparse and Truncated Nuclear Norm Based Tensor Completion.",
            "Online Depth Image-Based Object Tracking with Sparse Representation and Object Detection.",
            "Visual Saliency Using Binary Spectrum of Walsh-Hadamard Transform and Its Applications to Ship Detection in Multispectral Imagery.",
            "Cross-Modal Saliency Correlation for Image Annotation.",
            "Joint Learning of Unsupervised Dimensionality Reduction and Gaussian Mixture Model.",
            "Directed Connectivity Analysis of Functional Brain Networks during Cognitive Activity Using Transfer Entropy.",
            "Single Layer Chebyshev Neural Network Model for Solving Elliptic Partial Differential Equations.",
            "Properties of a Batch Training Algorithm for Feedforward Networks.",
            "Learning Sparse Feature Representations Using Probabilistic Quadtrees and Deep Belief Nets.",
            "Passivity and Pinning Passivity of Coupled Delayed Reaction-Diffusion Neural Networks with Dirichlet Boundary Conditions.",
            "Incremental Clustering-Based Facial Feature Tracking Using Bayesian ART.",
            "Quaternion Based Maximum Margin Criterion Method for Color Face Recognition.",
            "A Novel Similarity Measure Model for Multivariate Time Series Based on LMNN and DTW.",
            "Further Results on Dissipativity Criterion for Markovian Jump Discrete-Time Neural Networks with Two Delay Components Via Discrete Wirtinger Inequality Approach.",
            "Locality Preserving Collaborative Representation for Face Recognition.",
            "Existence and Global Exponential Stability of Periodic Solution for a Class of Neutral-Type Neural Networks with Time Delays.",
            "A Neural Network Approach for Solving Optimal Control Problems with Inequality Constraints and Some Applications.",
            "Supervised Local High-Order Differential Channel Feature Learning for Pedestrian Detection.",
            "Dynamical Behavior of Complex-Valued Hopfield Neural Networks with Discontinuous Activation Functions.",
            "Semi-supervised Nonnegative Matrix Factorization with Commonness Extraction.",
            "Regularized Matrix-Pattern-Oriented Classification Machine with Universum.",
            "Choosing Between Two Classification Learning Algorithms Based on Calibrated Balanced 5 × 2 Cross-Validated F-Test.",
            "A New Sparse Learning Machine.",
            "Finite-Time Stability of Neural Networks with Impulse Effects and Time-Varying Delay.",
            "Pseudo Almost Periodic Solutions for High-Order Hopfield Neural Networks with Time-Varying Leakage Delays.",
            "Impulsive Synchronization of Stochastic Neural Networks via Controlling Partial States.",
            "Finite-Time Stability of Stochastic Cohen-Grossberg Neural Networks with Markovian Jumping Parameters and Distributed Time-Varying Delays.",
            "p th Moment Exponential Stability of Hybrid Delayed Reaction-Diffusion Cohen-Grossberg Neural Networks.",
            "Exponential Stability of Semi-Markovian Switching Complex Dynamical Networks with Mixed Time Varying Delays and Impulse Control.",
            "Robustly Exponential Stability Analysis for Discrete-Time Stochastic Neural Networks with Interval Time-Varying Delays.",
            "A Novel Two-stage Learning Pipeline for Deep Neural Networks.",
            "A Cluster Splitting Technique by Hopfield Networks and P Systems on Simplices.",
            "Nonlinearly Activated Recurrent Neural Network for Computing the Drazin Inverse.",
            "Multiple Instance Learning via Semi-supervised Laplacian TSVM.",
            "Co-training for Implicit Discourse Relation Recognition Based on Manual and Distributed Features.",
            "A Generalized Logistic Link Function for Cumulative Link Models in Ordinal Regression.",
            "Finite-Time Synchronization of Complex-Valued Neural Networks with Mixed Delays and Uncertain Perturbations.",
            "Backpropagation for Fully Connected Cascade Networks.",
            "Capturing Temporal Structures for Video Captioning by Spatio-temporal Contexts and Channel Attention Mechanism.",
            "Exponential Stability of Pseudo Almost Periodic Solutions for Neutral Type Cellular Neural Networks with D Operator.",
            "Guaranteed Cost Anti-windup Stabilization of Discrete Delayed Cellular Neural Networks.",
            "New Results on Reachable Sets Bounding for Switched Neural Networks Systems with Discrete, Distributed Delays and Bounded Disturbances.",
            "A New Evolving Tree-Based Model with Local Re-learning for Document Clustering and Visualization.",
            "Optimization Based Clustering Algorithms for Authorship Analysis of Phishing Emails.",
            "Graph-Regularized Local Coordinate Concept Factorization for Image Representation.",
            "New Criteria on Exponential Lag Synchronization of Switched Neural Networks with Time-Varying Delays.",
            "Delay-Dependent Passivity and Stability Analysis for a Class of Memristor-Based Neural Networks with Time Delay in the Leakage Term.",
            "New Results for Impulsive Recurrent Neural Networks with Time-Varying Coefficients and Mixed Delays.",
            "Exponential Stability of Weighted Pseudo Almost Periodic Solutions for HCNNs with Mixed Delays.",
            "A Novel Generalized Fuzzy Canonical Correlation Analysis Framework for Feature Fusion and Recognition.",
            "The Sampled-data Exponential Stability of BAM with Distributed Leakage Delays.",
            "Encoding and Decoding Neural Population Signals for Two-Dimensional Stimulus.",
            "Finite-time Stability of Fractional-order Complex-valued Neural Networks with Time Delays.",
            "Cascaded Convolutional Neural Networks for Aspect-Based Opinion Summary.",
            "Normalised Spline Adaptive Filtering Algorithm for Nonlinear System Identification.",
            "Efficient Color Texture Classification Using Color Monogenic Wavelet Transform.",
            "Robust Visual Tracking via Binocular Consistent Sparse Learning.",
            "An Adaptive Extreme Learning Machine for Modeling NOx Emission of a 300 MW Circulating Fluidized Bed Boiler.",
            "Recurrent High Order Neural Observer for Discrete-Time Non-Linear Systems with Unknown Time-Delay.",
            "Scene Classification Using Multi-Resolution WAHOLB Features and Neural Network Classifier.",
            "Multivariate Chaotic Time Series Prediction Based on ELM-PLSR and Hybrid Variable Selection Algorithm.",
            "Pseudo-Almost Periodic Solution on Time-Space Scales for a Novel Class of Competitive Neutral-Type Neural Networks with Mixed Time-Varying Delays and Leakage Delays.",
            "Editorial.",
            "Ensemble of Efficient Minimal Learning Machines for Classification and Regression.",
            "Identifying Market Behaviours Using European Stock Index Time Series by a Hybrid Segmentation Algorithm.",
            "Learners Reliability Estimated Through Neural Networks Applied to Build a Novel Hybrid Ensemble Method.",
            "Interpreting Decision Support from Multiple Classifiers for Predicting Length of Stay in Patients with Colorectal Carcinoma - What can a Professional Get from the Opinions of Different Models?",
            "Deep Neural Networks for Wind and Solar Energy Prediction.",
            "Multi-Domain Transfer Component Analysis for Domain Generalization.",
            "Testing Different Ensemble Configurations for Feature Selection.",
            "Toward a Possibilistic Swarm Multi-robot Task Allocation: Theoretical and Experimental Results.",
            "FPGA Implementation of Neurocomputational Models: Comparison Between Standard Back-Propagation and C-Mantec Constructive Algorithm.",
            "Second Order Training of a Smoothed Piecewise Linear Network.",
            "A Brain-Inspired Method of Facial Expression Generation Using Chaotic Feature Extracting Bidirectional Associative Memory.",
            "Convergence of Quasi-Newton Method for Fully Complex-Valued Neural Networks.",
            "Adaptive Synchronization of Stochastic Memristor-Based Neural Networks with Mixed Delays.",
            "Asymptotic Stability of Cohen-Grossberg BAM Neutral Type Neural Networks with Distributed Time Varying Delays.",
            "Robust State Estimation for Delayed Complex-Valued Neural Networks.",
            "Towards Safe Semi-supervised Classification: Adjusted Cluster Assumption via Clustering.",
            "A Computationally Efficient Received Signal Strength Based Localization Algorithm in Closed-Form for Wireless Sensor Network.",
            "A Hybrid Model Equipped with the Minimum Cycle Decomposition Concept for Short-Term Forecasting of Electrical Load Time Series.",
            "A Two-Stage Bayesian Integration Framework for Salient Object Detection on Light Field.",
            "Foreign Exchange Rates Forecasting with Convolutional Neural Network."
        ]
    },
    {
        "name": "NPL",
        "year": "2016",
        "info": "2016: Volumes\n43,\n44",
        "count": 101,
        "papers": [
            "Embedded Manifold-Based Kernel Fisher Discriminant Analysis for Face Recognition.",
            "Reference Curves Estimation Using Conditional Quantile and Radial Basis Function Network with Mass Constraint.",
            "The Spatial Complexity of Inhomogeneous Multi-layer Neural Networks.",
            "Finite-Time Anti-synchronization Control of Memristive Neural Networks With Stochastic Perturbations.",
            "Enhancing Least Square Support Vector Regression with Gradient Information.",
            "Kernel Local Sparse Representation Based Classifier.",
            "Ill-posed Echo State Network based on L-curve Method for Prediction of Blast Furnace Gas Flow.",
            "Multi-agent Architecture for Corporate Operating Performance Assessment.",
            "Adaptive identifier for uncertain complex-valued discrete-time nonlinear systems based on recurrent neural networks.",
            "A Short-term Traffic Flow Forecasting Method Based on the Hybrid PSO-SVR.",
            "Hopf Bifurcation Analysis of a Reaction-Diffusion Neural Network with Time Delay in Leakage Terms and Distributed Delays.",
            "Mode and Delay-dependent Stochastic Stability Conditions of Fuzzy Neural Networks with Markovian Jump Parameters.",
            "Performance Verification of a Fuzzy Wavelet Neural Network in the First Order Partial Derivative Approximation of Nonlinear Functions.",
            "Asymmetric k-Means Clustering of the Asymmetric Self-Organizing Map.",
            "Stabilization of Coupled Time-delay Neural Networks with Nodes of Different Dimensions.",
            "Anti-synchronization Control of Memristive Neural Networks with Multiple Proportional Delays.",
            "Exponential Convergence for HCNNs with Oscillating Coefficients in Leakage Terms.",
            "Locality Alignment Discriminant Analysis for Visualizing Regional English.",
            "Editorial: Neural Processing Letters Special Issue on \"Neural Networks for Vision and Robotics\".",
            "Asynchronous Event-based Cooperative Stereo Matching Using Neuromorphic Silicon Retinas.",
            "A Scale and Translation Invariant Approach for Early Classification of Spatio-Temporal Patterns Using Spiking Neural Networks.",
            "Selecting the Color Space for Self-Organizing Map Based Foreground Detection in Video.",
            "A Novel Prediction Method for Early Recognition of Global Human Behaviour in Image Sequences.",
            "Adaptive Convolutional Neural Network and Its Application in Face Recognition.",
            "3D Surface Reconstruction of Noisy Point Clouds Using Growing Neural Gas: 3D Object/Scene Reconstruction.",
            "Neural Control for Driving a Mobile Robot Integrating Stereo Vision Feedback.",
            "Stacked Autoencoders Using Low-Power Accelerated Architectures for Object Recognition in Autonomous Systems.",
            "Real-Time Model-Based Video Stabilization for Microaerial Vehicles.",
            "Introducing Synaptic Delays in the NEAT Algorithm to Improve Modelling in Cognitive Robotics.",
            "Human Age Estimation by Considering both the Ordinality and Similarity of Ages.",
            "Estimating the Penetration Rate in Diamond Drilling in Laboratory Works Using the Regression and Artificial Neural Network Analysis.",
            "Neural Mechanism of Corticofugal Modulation of Tuning Property in Frequency Domain of Bat's Auditory System.",
            "Exponential Stability of Switched Time-varying Delayed Neural Networks with All Modes Being Unstable.",
            "Global Rademacher Complexity Bounds: From Slow to Fast Convergence Rates.",
            "Dispersion Constraint Based Non-negative Sparse Coding Model.",
            "Lagrange p-Stability and Exponential p-Convergence for Stochastic Cohen-Grossberg Neural Networks with Time-Varying Delays.",
            "Synthesis of the Resultant Force Position on a Radial Ply Tire of Off-Road Vehicle with a Comparative Trend Between Some Soft Computing Techniques.",
            "Identification of Lags in Nonlinear Autoregressive Time Series Using a Flexible Fuzzy Model.",
            "Approximating the Solution of Optimal Control Problems by Fuzzy Systems.",
            "A New and Fast Implementation of Orthogonal LDA Algorithm and Its Incremental Extension.",
            "Selective Algorithm Outline (SAO); An Alternative Approach for Fusing Different Palm-Print Recognition Algorithms.",
            "Local Tangent Space Discriminant Analysis.",
            "Strong Convergence Analysis of Batch Gradient-Based Learning Algorithm for Training Pi-Sigma Network Based on TSK Fuzzy Models.",
            "Reduced Multi-class Contour Preserving Classification.",
            "A Novel Spatial Analysis Method for Remote Sensing Image Classification.",
            "Face Recognition Using A Low Rank Representation Based Projections Method.",
            "Neural Networks Based PID Control of Bidirectional Inductive Power Transfer System.",
            "Constrained Self Organizing Maps for Data Clusters Visualization.",
            "Existence and Exponential Stability of Periodic Solution for BAM Fuzzy Cohen-Grossberg Neural Networks with Mixed Delays.",
            "Coordinate Descent Algorithm for Ramp Loss Linear Programming Support Vector Machines.",
            "A Method for Metric Learning with Multiple-Kernel Embedding.",
            "Erratum to: A Method for Metric Learning with Multiple-Kernel Embedding.",
            "Editorial.",
            "Training Neural Networks with Krill Herd Algorithm.",
            "An Evolutionary Radial Basis Function Neural Network with Robust Genetic-Based Immunecomputing for Online Tracking Control of Autonomous Robots.",
            "An Improved Neural Network with Random Weights Using Backtracking Search Algorithm.",
            "Adaptive Network-Based Fuzzy Inference Systems Coupled with Genetic Algorithms for Predicting Soil Permeability Coefficient.",
            "Inverse Back Analysis Based on Evolutionary Neural Networks for Underground Engineering.",
            "Computation by Time.",
            "A Cognitive Architecture Based on a Learning Classifier System with Spiking Classifiers.",
            "A Network of Neural Oscillators for Fractal Pattern Recognition.",
            "A Resource Aware MapReduce Based Parallel SVM for Large Scale Image Classifications.",
            "Motor Imagery Electroencephalograph Classification Based on Optimized Support Vector Machine by Magnetic Bacteria Optimization Algorithm.",
            "Hybrid Harmony Search Combined with Stochastic Local Search for Feature Selection.",
            "Unsupervised Clustering Based an Adaptive Particle Swarm Optimization Algorithm.",
            "An SNN-Based Semantic Role Labeling Model with Its Network Parameters Optimized Using an Improved PSO Algorithm.",
            "Memcomputing Implementation of Ant Colony Optimization.",
            "Improving Anomalous Rare Attack Detection Rate for Intrusion Detection System Using Support Vector Machine and Genetic Programming.",
            "Matrixized Learning Machine with Feature-Clustering Interpolation.",
            "Steganography of Digital Watermark Based on Artificial Neural Networks in Image Communication and Intellectual Property Protection.",
            "H∞ Estimation for Markovian Jump Neural Networks With Quantization, Transmission Delay and Packet Dropout.",
            "Bifurcation Analysis in a Three-Neuron Artificial Neural Network Model with Distributed Delays.",
            "Pseudo Almost Periodic Solutions for SICNNs with Leakage Delays and Complex Deviating Arguments.",
            "Graph Maximum Margin Criterion for Face Recognition.",
            "A Complex-valued Encoding Bat Algorithm for Solving 0-1 Knapsack Problem.",
            "Model-Based Clustering Based on Variational Learning of Hierarchical Infinite Beta-Liouville Mixture Models.",
            "Hierarchical Parallel Genetic Optimization Fuzzy ARTMAP Ensemble.",
            "Architecture Selection of ELM Networks Based on Sensitivity of Hidden Nodes.",
            "A Study on Multi-Scale Kernel Optimisation via Centered Kernel-Target Alignment.",
            "Rectifying the Inconsistent Fuzzy Preference Matrix in AHP Using a Multi-Objective BicriterionAnt.",
            "Nonlinear Measure Approach for the Stability Analysis of Complex-Valued Neural Networks.",
            "On the Use of Nominal and Ordinal Classifiers for the Discrimination of States of Development in Fish Oocytes.",
            "Dissipativity and Passivity Analysis of Markovian Jump Neural Networks with Two Additive Time-Varying Delays.",
            "A New Geometry with Cross-Coupling of ART Networks.",
            "Existence and Stability of Pseudo Almost Periodic Solution for Neutral Type High-Order Hopfield Neural Networks with Delays in Leakage Terms on Time Scales.",
            "Learning Feedback Linearization Using Artificial Neural Networks.",
            "An Artificial Neural Network Model for Prediction of Colour Properties of Knitted Fabrics Induced by Laser Engraving.",
            "Exponential stability of a class of competitive neural networks with multi-proportional delays.",
            "Finite-Time Boundedness Analysis of Memristive Neural Network with Time-Varying Delay.",
            "A Multiple Graph Label Propagation Integration Framework for Salient Object Detection.",
            "Fuzzy Local Mean Discriminant Analysis for Dimensionality Reduction.",
            "Bayesian Low-Rank and Sparse Nonlinear Representation for Manifold Clustering.",
            "Learning Informative Features from Restricted Boltzmann Machines.",
            "Global Mean Square Exponential Stability of Impulsive Non-autonomous Stochastic Neural Networks with Mixed Delays.",
            "Periodic Solution for Neutral-Type Neural Networks in Critical Case.",
            "Discriminative Subspace Alignment for Unsupervised Visual Domain Adaptation.",
            "A Novel Twin Support Vector Machine for Binary Classification Problems.",
            "A Kind of Parameters Self-adjusting Extreme Learning Machine.",
            "Selected an Stacking ELMs for Time Series Prediction.",
            "A Novel Adaptive NARMA-L2 Controller Based on Online Support Vector Regression for Nonlinear Systems.",
            "Improving Neuroevolution with Complementarity-Based Selection Operators."
        ]
    },
    {
        "name": "NPL",
        "year": "2015",
        "info": "2015: Volumes\n41,\n42",
        "count": 74,
        "papers": [
            "Robust Stability of Markovian Jump Stochastic Neural Networks with Time Delays in the Leakage Terms.",
            "Exploiting Chaos in Learning System Identification for Nonlinear State Space Models.",
            "Face Recognition Via Weighted Two Phase Test Sample Sparse Representation.",
            "Neural Network Ensembles in Reinforcement Learning.",
            "Finite-Time Function Projective Synchronization in Complex Multi-links Networks with Time-Varying Delay.",
            "Robust Support Vector Regression with Generalized Loss Function and Applications.",
            "Adaptive Constraint Propagation for Semi-Supervised Kernel Matrix Learning.",
            "Effective Parameter Tuning of SVMs Using Radius/Margin Bound Through Data Envelopment Analysis.",
            "Constructing and Combining Orthogonal Projection Vectors for Ordinal Regression.",
            "Editorial.",
            "Reconfigurable Neuromorphic Computing System with Memristor-Based Synapse Design.",
            "Landslide Deformation Prediction Based on Recurrent Neural Network.",
            "Noise-Robust Detection of Symmetric Axes by Self-Correcting Artificial Neural Network.",
            "Bayesian Cell Force Estimation Considering Force Directions.",
            "Predicting Multivariate Time Series Using Subspace Echo State Network.",
            "A Hybrid Genetic Algorithm for the Energy-Efficient Virtual Machine Placement Problem in Data Centers.",
            "TaskRec: A Task Recommendation Framework in Crowdsourcing Systems.",
            "Exponential Convergence of a SICNN with Leakage Delays and Continuously Distributed Delays of Neutral Type.",
            "Recurrent Multiplicative Neuron Model Artificial Neural Network for Non-linear Time Series Forecasting.",
            "Amplitude and Frequency Modulations with Cellular Neural Networks.",
            "Local Perception-Based Intelligent Building Outline Aggregation Approach with Back Propagation Neural Network.",
            "Periodic Solutions of BAM Neural Networks with Continuously Distributed Delays in the Leakage Terms.",
            "Editorial for Special Issue on ICONIP 2013.",
            "Learning Imbalanced Classifiers Locally and Globally with One-Side Probability Machine.",
            "Self-organizing Map (SOM) Based Data Navigation for Identifying Shape Similarities of Graphic Logos.",
            "GPU Accelerated Self-Organizing Map for High Dimensional Data.",
            "Statistically Adaptive Image Denoising Based on Overcomplete Topographic Sparse Coding.",
            "Estimation of Lower Limb Periodic Motions from sEMG Using Least Squares Support Vector Regression.",
            "Graph Based Semi-Supervised Learning via Structure Preserving Low-Rank Representation.",
            "Exponential Generalized H2 Filtering of Delayed Static Neural Networks.",
            "New Results on Exponential Convergence for Cellular Neural Networks with Continuously Distributed Leakage Delays.",
            "Complete Stability Analysis of Complex-Valued Neural Networks with Time Delays and Impulses.",
            "Advances in Artificial Neural Networks and Computational Intelligence - Special Issue of IWANN 2013.",
            "Multi-sensor Fusion Based on Asymmetric Decision Weighting for Robust Activity Recognition.",
            "Using Discriminative Dimensionality Reduction to Visualize Classifiers.",
            "Learning Temperature Dynamics on Agar-Based Phantom Tissue Surface During Single Point CO2 Laser Exposure.",
            "Towards Robust Neural-Network-Based Sensor and Actuator Fault Diagnosis: Application to a Tunnel Furnace.",
            "An Agent-Based Model for Simulating Environmental Behavior in an Educational Organization.",
            "On the Design of Robust Linear Pattern Classifiers Based on M-Estimators.",
            "Ant Colony Optimization Inspired Algorithm for 3D Object Segmentation into its Constituent Parts.",
            "Neighborhood Guided Smoothed Emphasis for Real Adaboost Ensembles.",
            "Non-negative Matrix Factorization with Pairwise Constraints and Graph Laplacian.",
            "Scalable Semi-Supervised Classification via Neumann Series.",
            "Homogenous Spiking Neural P Systems with Inhibitory Synapses.",
            "Passivity Analysis of Delayed Neural Networks with Discontinuous Activations.",
            "Pseudo Almost Periodic Solutions for CNNs with Continuously Distributed Leakage Delays.",
            "Adaptive Agents in Changing Environments, the Role of Modularity.",
            "New Criteria on Delay-Dependent Robust Stability for Uncertain Markovian Stochastic Delayed Neural Networks.",
            "Soft Margin Based Low-Rank Audio Signal Classification.",
            "Orthogonal Multiset Canonical Correlation Analysis based on Fractional-Order and Its Application in Multiple Feature Extraction and Recognition.",
            "Fuzzy Min-Max Neural Network for Learning a Classifier with Symmetric Margin.",
            "Convergence Analysis of Möller Algorithm for Estimating Minor Component.",
            "Error Estimate for Spherical Neural Networks Interpolation.",
            "A Modified Learning Algorithm for Interval Perceptrons with Interval Weights.",
            "Online Training for Open Faulty RBF Networks.",
            "Multistability and Multiperiodicity for a Class of Cohen-Grossberg BAM Neural Networks with Discontinuous Activation Functions and Time Delays.",
            "A New Multilayer Perceptron Pruning Algorithm for Classification and Regression Applications.",
            "An Effective Neural Learning Algorithm for Extracting Cross-Correlation Feature Between Two High-Dimensional Data Streams.",
            "Stability Analysis of Fractional-Order Neural Networks with Time Delay.",
            "Synchronization Analysis of Coupled Stochastic Neural Networks with On-Off Coupling and Time-Delay.",
            "Passivity Analysis of Memristor-Based Complex-Valued Neural Networks with Time-Varying Delays.",
            "Bifurcation Behavior for an Electronic Neural Network Model with Two Different Delays.",
            "Adaptive Finite-Time Complete Periodic Synchronization of Memristive Neural Networks with Time Delays.",
            "A Truly Online Learning Algorithm using Hybrid Fuzzy ARTMAP and Online Extreme Learning Machine for Pattern Classification.",
            "An Efficient Over-sampling Approach Based on Mean Square Error Back-propagation for Dealing with the Multi-class Imbalance Problem.",
            "Delay-Dependent Exponential Synchronization of Recurrent Neural Networks with Multiple Proportional Delays.",
            "Asynchronous Spiking Neural P Systems with Anti-Spikes.",
            "Classification of Skeletal Wireframe Representation of Hand Gesture Using Complex-Valued Neural Network.",
            "An Adaptive Unsupervised Neural Network Based on Perceptual Mechanism for Dynamic Object Detection in Videos with Real Scenarios.",
            "Almost Automorphic Solutions of Impulsive Cellular Neural Networks with Piecewise Constant Argument.",
            "Learning to Rank with Ensemble Ranking SVM.",
            "An Efficient and Effective Multiple Empirical Kernel Learning Based on Random Projection.",
            "A Novel Multiple Kernel Learning Method Based on the Kullback-Leibler Divergence.",
            "Finite-Time Stability and Its Application for Solving Time-Varying Sylvester Equation by Recurrent Neural Network."
        ]
    },
    {
        "name": "NPL",
        "year": "2014",
        "info": "2014: Volumes\n39,\n40",
        "count": 37,
        "papers": [
            "Self-Organizing Map Formation with a Selectively Refractory Neighborhood.",
            "Face Recognition and Micro-expression Recognition Based on Discriminant Tensor Subspace Analysis Plus Extreme Learning Machine.",
            "Dynamic Fuzzy Neural Network Based Learning Algorithms for Ocular Artefact Reduction in EEG Recordings.",
            "Convergence for HRNNs with Unbounded Activation Functions and Time-varying Delays in the Leakage Terms.",
            "An Iterative Thresholding Segmentation Model Using a Modified Pulse Coupled Neural Network.",
            "Different Aspects of Clustering The Self-Organizing Maps.",
            "Non-Gaussian Data Clustering via Expectation Propagation Learning of Finite Dirichlet Mixture Models and Applications.",
            "Approximation and Estimation Bounds for Subsets of Reproducing Kernel Kreǐn Spaces.",
            "Learning to Rank with Extreme Learning Machine.",
            "New Results on Exponential Convergence for HRNNs with Continuously Distributed Delays in the Leakage Terms.",
            "Generalization Bounds of Regularization Algorithm with Gaussian Kernels.",
            "Extension of a Kernel-Based Classifier for Discriminative Spoken Keyword Spotting.",
            "Robust Adaptive Synchronization Control for a Class of Perturbed and Delayed Neural Networks.",
            "Efficient Feature Scaling for Support Vector Machines with a Quadratic Kernel.",
            "Existence and Global Exponential Stability of Almost Periodic Solution for High-Order BAM Neural Networks with Delays on Time Scales.",
            "The Kernel Recursive Least Squares CMAC with Vector Eligibility.",
            "A Neuron Model Including Gene Expression: Bistability, Long-Term Memory, etc.",
            "Boundedness and Convergence of Split-Complex Back-Propagation Algorithm with Momentum and Penalty.",
            "From Different Zhang Functions to Various ZNN Models Accelerated to Finite-Time Convergence for Time-Varying Linear Matrix Equation.",
            "ENAMeL: A Language for Binary Correlation Matrix Memories - Reducing the Memory Constraints of Matrix Memories.",
            "Glowworm Swarm Optimization for Dispatching System of Public Transit Vehicles.",
            "Global Robust Exponential Stability for Interval Delayed Neural Networks with Possibly Unbounded Activation Functions.",
            "Periodic Solution for Fuzzy Cohen-Grossberg BAM Neural Networks with Both Time-Varying and Distributed Delays and Variable Coefficients.",
            "Processing and Transmission of Confidence in Recurrent Neural Hierarchies.",
            "Design of RF MEMS Based Oscillatory Neural Network for Ultra High Speed Associative Memories.",
            "Exponential p-Synchronization of Non-autonomous Cohen-Grossberg Neural Networks with Reaction-Diffusion Terms via Periodically Intermittent Control.",
            "Attractor and Stochastic Boundedness for Stochastic Infinite Delay Neural Networks with Markovian Switching.",
            "Sequence Input-Based Quantum-Inspired Neural Networks with Applications.",
            "Fractional-Neuro-Optimizer: A Neural-Network-Based Optimization Method.",
            "Simultaneous Learning of Nonlinear Manifolds Based on the Bottleneck Neural Network.",
            "Adaptive Graph Embedding Discriminant Projections.",
            "Existence and Exponential Stability of Anti-periodic Solutions for a High-Order Delayed Cohen-Grossberg Neural Networks with Impulsive Effects.",
            "A Rough RBF Neural Network Based on Weighted Regularized Extreme Learning Machine.",
            "Distributed Fault Detection in Sensor Networks using a Recurrent Neural Network.",
            "A Weakly Connected Memristive Neural Network for Associative Memory.",
            "Stability and Bifurcation of a Class of Discrete-Time Cohen-Grossberg Neural Networks with Discrete Delays.",
            "A Novel Indefinite Kernel Dimensionality Reduction Algorithm: Weighted Generalized Indefinite Kernel Discriminant Analysis."
        ]
    },
    {
        "name": "NPL",
        "year": "2013",
        "info": "2013: Volumes\n37,\n38",
        "count": 52,
        "papers": [
            "Preface.",
            "Opposite Maps: Vector Quantization Algorithms for Building Reduced-Set SVM and LSSVM Classifiers.",
            "Weighted Sliding Empirical Mode Decomposition for Online Analysis of Biomedical Time Series.",
            "Active Foreground Region Extraction and Tracking for Sports Video Annotation.",
            "A Competitive Neural Network for Multiple Object Tracking in Video Sequence Analysis.",
            "Image Compression and Video Segmentation Using Hierarchical Self-Organization.",
            "Segmentation of Different Skin Colors with Different Lighting Conditions by Combining Graph Cuts Algorithm with Probability Neural Network Classification, and its Application.",
            "The Multilayer Random Neural Network.",
            "A New Locality-Preserving Canonical Correlation Analysis Algorithm for Multi-View Dimensionality Reduction.",
            "Delay Dependent Exponential Stability for Fuzzy Recurrent Neural Networks with Interval Time-Varying Delay.",
            "Quantized Neural Modeling: Hybrid Quantized Architecture in Elman Networks.",
            "Accelerating a Recurrent Neural Network to Finite-Time Convergence for Solving Time-Varying Sylvester Equation by Using a Sign-Bi-power Activation Function.",
            "Translation Invariance in the Polynomial Kernel Space and Its Applications in kNN Classification.",
            "New H∞ Controller Design for Neural Networks with Interval Time-Varying Delays in State and Observation.",
            "A New Multiplicative Seasonal Neural Network Model Based on Particle Swarm Optimization.",
            "A New Training Method for Large Self Organizing Maps.",
            "Parallel Chaos Search Based Incremental Extreme Learning Machine.",
            "Evolutionary Learning Processes to Design the Dilation-Erosion Perceptron for Weather Forecasting.",
            "Neighborhood Correlation Analysis for Semi-paired Two-View Data.",
            "Feature Extraction Based on Maximum Nearest Subspace Margin Criterion.",
            "PCA-ELM: A Robust and Pruned Extreme Learning Machine Approach Based on Principal Component Analysis.",
            "Exponential Synchronization of Stochastic Fuzzy Cellular Neural Networks with Reaction-Diffusion Terms via Periodically Intermittent Control.",
            "Using Laplacian Eigenmap as Heuristic Information to Solve Nonlinear Constraints Defined on a Graph and Its Application in Distributed Range-Free Localization of Wireless Sensor Networks.",
            "Selective Recurrent Neural Network.",
            "Convolutional Deep Networks for Visual Data Classification.",
            "Global Minima Analysis of Lee and Seung's NMF Algorithms.",
            "Parameterless Local Discriminant Embedding.",
            "Associative Learning of Integrate-and-Fire Neurons with Memristor-Based Synapses.",
            "Smooth Nonparametric Copula Estimation with Least Squares Support Vector Regression.",
            "Editorial.",
            "Fast and Stable Learning Utilizing Singular Regions of Multilayer Perceptron.",
            "Towards a Self-Learning Agent: Using Ranking Functions as a Belief Representation in Reinforcement Learning.",
            "Modular Neural Tile Architecture for Compact Embedded Hardware Spiking Neural Network.",
            "Constraint Score Evaluation for Spectral Feature Selection.",
            "Controlling Relations between the Individuality and Collectivity of Neurons and its Application to Self-Organizing Maps.",
            "A Mathematical Model of Retinal Ganglion Cells and Its Applications in Image Representation.",
            "Covariance Matrix Estimation with Multi-Regularization Parameters based on MDL Principle.",
            "Aircraft Classification and Acoustic Impact Estimation Based on Real-Time Take-off Noise Measurements.",
            "Gait Pattern Based on CMAC Neural Network for Robotic Applications.",
            "Control of an Industrial PA10-7CE Robot Arm Based on Decentralized Neural Backstepping Approach.",
            "Navigation Satellite Clock Error Prediction Based on Functional Network.",
            "Delay-Dependent Robust Exponential Stability of Impulsive Markovian Jumping Reaction-Diffusion Cohen-Grossberg Neural Networks.",
            "Delay-Dependent Exponential Stability of Cellular Neural Networks with Multi-Proportional Delays.",
            "A New Framework for Multiscale Saliency Detection Based on Image Patches.",
            "Extreme Learning Machines for Feature Selection and Classification of Cocaine Dependent Patients on Structural MRI Data.",
            "A Fast Multiclass Classification Algorithm Based on Cooperative Clustering.",
            "Optimized Parameter Search for Large Datasets of the Regularization Parameter and Feature Selection for Ridge Regression.",
            "A Normalized Probabilistic Expectation-Maximization Neural Network for Minimizing Bayesian Misclassification Cost Risk.",
            "Stability of Stochastic $$\\theta $$ -Methods for Stochastic Delay Hopfield Neural Networks Under Regime Switching.",
            "Supervised Distance Preserving Projections.",
            "Weighted Online Sequential Extreme Learning Machine for Class Imbalance Learning.",
            "pth Moment Exponential Stability of Stochastic Recurrent Neural Networks with Markovian Switching."
        ]
    },
    {
        "name": "NPL",
        "year": "2012",
        "info": "2012: Volumes\n35,\n36",
        "count": 37,
        "papers": [
            "A Two Stage Sequential Ensemble Applied to the Classification of Alzheimer's Disease Based on MRI Features.",
            "Spiking Neural P Systems with Weighted Synapses.",
            "Synchronization Criteria for an Array of Neutral-Type Neural Networks with Hybrid Coupling: A Novel Analysis Approach.",
            "Dynamics Analysis of a Class of Memristor-Based Recurrent Networks with Time-Varying Delays in the Presence of Strong External Stimuli.",
            "Making Diversity Enhancement Based on Multiple Classifier System by Weight Tuning.",
            "Feature Selection and Extraction Methods for Power Systems Transient Stability Assessment Employing Computational Intelligence Techniques.",
            "Improved Stability Results for Stochastic Cohen-Grossberg Neural Networks with Discrete and Distributed Delays.",
            "Reverse Engineering the Neural Networks for Rule Extraction in Classification Problems.",
            "Guaranteed Cost Stabilization of Time-varying Delay Cellular Neural Networks via Riccati Inequality Approach.",
            "Feature Extraction Using a Complete Kernel Extension of Supervised Graph Embedding.",
            "A Novel Structure for Radial Basis Function Networks - WRBF.",
            "Existence and Exponential Stability of Multiple Periodic Solutions for a Multidirectional Associative Memory Neural Network.",
            "Fisher Difference Discriminant Analysis: Determining the Effective Discriminant Subspace Dimensions for Face Recognition.",
            "Pinning Synchronization for a General Complex Networks with Multiple Time-Varying Coupling Delays.",
            "Heteroscedastic Sparse Representation Based Classification for Face Recognition.",
            "Synchronization of Non-Identical Unknown Chaotic Delayed Neural Networks Based on Adaptive Sliding Mode Control.",
            "The Effect of Dopamine on Working Memory.",
            "Learning Rates for Regularized Classifiers Using Trigonometric Polynomial Kernels.",
            "Two Types of Haar Wavelet Neural Networks for Nonlinear System Identification.",
            "State Estimation for Discrete-Time Neural Networks with Markov-Mode-Dependent Lower and Upper Bounds on the Distributed Delays.",
            "Validation of Nonlinear PCA.",
            "Incorporation of a Regularization Term to Control Negative Correlation in Mixture of Experts.",
            "Design of Delay-Dependent Exponential Estimator for T-S Fuzzy Neural Networks with Mixed Time-Varying Interval Delays Using Hybrid Taguchi-Genetic Algorithm.",
            "A Chaotic Feature Extracting BAM and Its Application in Implementing Memory Search.",
            "Integrating Spectral Kernel Learning and Constraints in Semi-Supervised Classification.",
            "Supervised Learning of Logical Operations in Layered Spiking Neural Networks with Spike Train Encoding.",
            "A Modified Spiking Neuron that Involves Derivative of the State Function at Firing Time.",
            "Robust Learning Algorithm Based on Iterative Least Median of Squares.",
            "Harmonic Mean of Kullback-Leibler Divergences for Optimizing Multi-Class EEG Spatio-Temporal Filters.",
            "Transfer Learning from Unlabeled Data via Neural Networks.",
            "Bayesian Robust PCA of Incomplete Data.",
            "Semi-Supervised Logistic Discrimination Via Graph-Based Regularization.",
            "Stability of Reaction-Diffusion Recurrent Neural Networks with Distributed Delays and Neumann Boundary Conditions on Time Scales.",
            "MIGSOM: Multilevel Interior Growing Self-Organizing Maps for High Dimensional Data Clustering.",
            "Discriminant Kernel Learning Using Hybrid Regularization.",
            "In-sample Model Selection for Trimmed Hinge Loss Support Vector Machine.",
            "Self-Adaptive Evolutionary Extreme Learning Machine."
        ]
    },
    {
        "name": "NPL",
        "year": "2011",
        "info": "2011: Volumes\n33,\n34",
        "count": 39,
        "papers": [
            "Hybrid Supervised-Unsupervised Channel Estimation Scheme with Dynamic Transmission of Pilots.",
            "On Learning and Cross-Validation with Decomposed Nyström Approximation of Kernel Matrix.",
            "First and Second Order SMO Algorithms for LS-SVM Classifiers.",
            "Distributed Multi-Feature Recognition Scheme for Greyscale Images.",
            "Global Exponential Stability and Existence of Periodic Solution of Impulsive Cohen-Grossberg Neural Networks with Distributed Delays on Time Scales.",
            "Blind Source Separation Using Quadratic form Innovation.",
            "Feature Extraction Using Laplacian Maximum Margin Criterion.",
            "Leakage Delays in T-S Fuzzy Cellular Neural Networks.",
            "Wavelet Neural Network for Corrections Prediction in Single-Frequency GPS Users.",
            "Learning Linear and Nonlinear PCA with Linear Programming.",
            "An Iterative Method for Deciding SVM and Single Layer Neural Network Structures.",
            "A Modified Memory-Based Reinforcement Learning Method for Solving POMDP Problems.",
            "AVLR-EBP: A Variable Step Size Approach to Speed-up the Convergence of Error Back-Propagation Algorithm.",
            "A Neural Network Scheme for Long-Term Forecasting of Chaotic Time Series.",
            "Orthogonal Complete Discriminant Locality Preserving Projections for Face Recognition.",
            "Composite Function Wavelet Neural Networks with Differential Evolution and Extreme Learning Machine.",
            "Locally Minimizing Embedding and Globally Maximizing Variance: Unsupervised Linear Difference Projection for Dimensionality Reduction.",
            "Radial Basis Function Network for Multitask Pattern Recognition.",
            "Optimal Locality Regularized Least Squares Support Vector Machine via Alternating Optimization.",
            "Supervised Discriminant Projection with Its Application to Face Recognition.",
            "A Generalized Ellipsoidal Basis Function Based Online Self-constructing Fuzzy Neural Network.",
            "A Skeletonizing Reconfigurable Self-Organizing Model: Validation Through Text Recognition.",
            "Takagi-Sugeno Fuzzy Hopfield Neural Networks for H¥ Nonlinear System Identification.",
            "Functional Segmentation of Renal DCE-MRI Sequences Using Vector Quantization Algorithms.",
            "Injecting Chaos in Feedforward Neural Networks.",
            "Weighting Efficient Accuracy and Minimum Sensitivity for Evolving Multi-Class Classifiers.",
            "Neuro-logistic Models Based on Evolutionary Generalized Radial Basis Function for the Microarray Gene Expression Classification Problem.",
            "On the Curse of Dimensionality in Supervised Learning of Smooth Regression Functions.",
            "Learning Topographic Representations of Nature Images with Pairwise Cumulant.",
            "Face Recognition Using Kernel UDP.",
            "Supervised Learning Probabilistic Neural Networks.",
            "Fuzzy SVM with a New Fuzzy Membership Function to Solve the Two-Class Problems.",
            "Convergence of a Batch Gradient Algorithm with Adaptive Momentum for Neural Networks.",
            "Multiple-View Multiple-Learner Semi-Supervised Learning.",
            "A Novel Pruning Algorithm for Optimizing Feedforward Neural Network of Classification Problems.",
            "Feature Fusion Using Multiple Component Analysis.",
            "Path Integration Mechanism with Coarse Coding of Neurons.",
            "A method to improve the performance of multilayer perceptron by utilizing various activation functions in the last hidden layer and the least squares method.",
            "A New Sufficient Condition for Global Robust Stability of Delayed Neural Networks."
        ]
    },
    {
        "name": "NPL",
        "year": "2010",
        "info": "2010: Volumes\n31,\n32",
        "count": 36,
        "papers": [
            "A New Canonical Correlation Analysis Algorithm with Local Discrimination.",
            "Complexity Pursuit for Unifying Model.",
            "A Novel Weightless Artificial Neural Based Multi-Classifier for Complex Classifications.",
            "Convergence Analysis of Non-Negative Matrix Factorization for BSS Algorithm.",
            "Global Exponential Stability for Impulsive BAM Neural Networks with Distributed Delays on Time Scales.",
            "On a Stabilization Problem of Nonlinear Programming Neural Networks.",
            "Globally Exponential Stability for Delayed Neural Networks Under Impulsive Control.",
            "Hysteretic HNN MAI-Cancellation for CDMA Signals in Multipath Fading Channels.",
            "Global Asymptotic Stability of Fuzzy Cellular Neural Networks with Unbounded Distributed Delays.",
            "A Novel Regularization Learning for Single-View Patterns: Multi-View Discriminative Regularization.",
            "Equilibrium Analysis for Improved Signal Range Model of Delayed Cellular Neural Networks.",
            "A Hybrid Intelligent Morphological Approach for Stock Market Forecasting.",
            "Evolutionary Fuzzy ARTMAP Neural Networks and their Applications to Fault Detection and Diagnosis.",
            "SSPS: A Semi-Supervised Pattern Shift for Classification.",
            "Anti-Periodic Solutions for Shunting Inhibitory Cellular Neural Networks with Time-Varying Coefficients.",
            "Stability of Quasi-Periodic Orbits in Recurrent Neural Networks.",
            "Use of Phase in Brain-Computer Interfaces based on Steady-State Visual Evoked Potentials.",
            "Spatial Point-Data Reduction Using Pulse Coupled Neural Network.",
            "A Lamarckian Hybrid of Differential Evolution and Conjugate Gradients for Neural Network Training.",
            "Stability Analysis of Stochastic Fuzzy Cellular Neural Networks With Time-Varying Delays and Reaction-Diffusion Terms.",
            "Energy Supervised Relevance Neural Gas for Feature Ranking.",
            "A Modified Semi-Supervised Learning Algorithm on Laplacian Eigenmaps.",
            "Global Robust Exponential Stability of Uncertain Neutral High-Order Stochastic Hopfield Neural Networks with Time-Varying Delays.",
            "Kernel Width Optimization for Faulty RBF Neural Networks with Multi-node Open Fault.",
            "Global Passivity Analysis of Interval Neural Networks with Discrete and Distributed Delays of Neutral Type.",
            "Segmentation and Edge Detection Based on Spiking Neural Network Model.",
            "Cellular Neural Networks for Gray Image Noise Cancellation Based on a Hybrid Linear Matrix Inequality and Particle Swarm Optimization Approach.",
            "Stochastic Processes and Neuronal Modelling: Quantum Harmonic Oscillator Dynamics in Neural Structures.",
            "Improved Output Tracking of a Flexible-Joint Arm using Neural Networks.",
            "New Results on Robust Exponential Stability of Uncertain Stochastic Neural Networks with Mixed Time-Varying Delays.",
            "Sparse RBF Networks with Multi-kernels.",
            "Importance Sampling for Objective Function Estimations in Neural Detector Training Driven by Genetic Algorithms.",
            "Forecast Combination by Using Artificial Neural Networks.",
            "Parallel Approach for Ensemble Learning with Locally Coupled Neural Networks.",
            "Exponential Stability of Uncertain Stochastic Neural Networks with Markovian Switching.",
            "Fast Multiclass SVM Classification Using Decision Tree Based One-Against-All Method."
        ]
    },
    {
        "name": "NPL",
        "year": "2009",
        "info": "2009: Volumes\n29,\n30",
        "count": 32,
        "papers": [
            "On the Identifiability of Finite Mixtures Based on the Union of Logarithmic Series and Discrete Rectangular Families.",
            "Stray Example Sheltering by Loss Regularized SVM and k NN Preprocessor.",
            "Robust Stability Criterion for Delayed Neural Networks with Discontinuous Activation Functions.",
            "Singularity and Slow Convergence of the EM algorithm for Gaussian Mixtures.",
            "Ml-rbf : RBF Neural Networks for Multi-Label Learning.",
            "Structural Properties of Recurrent Neural Networks.",
            "Analysis of a Plurality Voting-based Combination of Classifiers.",
            "Local Dimensionality Reduction for Non-Parametric Regression.",
            "Least Square Transduction Support Vector Machine.",
            "A Winner-Take-All Neural Networks of N Linear Threshold Neurons without Self-Excitatory Connections.",
            "Information Maximization in a Linear Manifold Topographic Map.",
            "Statistical Characterization of Steady-State Visual Evoked Potentials and Their Use in Brain-Computer Interfaces.",
            "Global Exponential Stability and Global Convergence in Finite Time of Neural Networks with Discontinuous Activations.",
            "Boundedness and Convergence of Online Gradient Method with Penalty for Linear Output Feedforward Neural Networks.",
            "A Simplified Neural Network for Linear Matrix Inequality Problems.",
            "Analysis of Time Series Novelty Detection Strategies for Synthetic and Real Data.",
            "On Global Stability of Delayed BAM Stochastic Neural Networks with Markovian Switching.",
            "Enhancing and Relaxing Competitive Units for Feature Discovery.",
            "Learning Dynamic Obstacle Avoidance for a Robot Arm Using Neuroevolution.",
            "Neural Network Architecture Selection: Can Function Complexity Help?",
            "Soft Constraint Harmonic Energy Minimization for Transductive Learning and its Two Interpretations.",
            "A New Discriminant Principal Component Analysis Method with Partial Supervision.",
            "Automatic Model Selection by Cross-Validation for Probabilistic PCA.",
            "Linear Multilayer ICA Using Adaptive PCA.",
            "Stochastic Resonance in Recurrent Neural Network with Hopfield-Type Memory.",
            "Improved Results on Passivity Analysis of Uncertain Neural Networks with Time-Varying Discrete and Distributed Delays.",
            "A New Incremental PCA Algorithm With Application to Visual Learning and Recognition.",
            "Rough Neural Network Based on Bottom-Up Fuzzy Rough Data Analysis.",
            "Global Output Convergence of a Class of Recurrent Delayed Neural Networks with Discontinuous Neuron Activations.",
            "Global Asymptotic Robust Stability and Global Exponential Robust Stability of Neural Networks with Time-Varying Delays.",
            "On EM Estimation for Mixture of Multivariate t-Distributions.",
            "A Self-Stabilizing Neural Algorithm for Total Least Squares Filtering."
        ]
    },
    {
        "name": "NPL",
        "year": "2008",
        "info": "2008: Volumes\n27,\n28",
        "count": 36,
        "papers": [
            "Hopfield Network as Static Optimizer: Learning the Weights and Eliminating the Guesswork.",
            "A Gradient Linear Discriminant Analysis for Small Sample Sized Problem.",
            "Feature Extraction using Unit-linking Pulse Coupled Neural Network and its Applications.",
            "Comparing Combination Rules of Pairwise Neural Networks Classifiers.",
            "A Semi-supervised Learning Algorithm on Gaussian Mixture with Automatic Model Selection.",
            "A Neural Network Based Framework for Directional Primitive Extraction.",
            "Two-level Clustering of Web Sites Using Self-Organizing Maps.",
            "Hinfinity Control Design Using Dynamic Neural Networks.",
            "Neural Model Approach to the Basic Law of Psychophysics.",
            "Adaptive Inverse Control of Excitation System with Actuator Uncertainty.",
            "An Artificial Neural Network Classifier Design Based-on Variable Kernel and Non-Parametric Density Estimation.",
            "Novel Approaches to Probabilistic Neural Networks Through Bagging and Evolutionary Estimating of Prior Probabilities.",
            "Improved MS_CMAC Neural Networks by Integrating a Simplified UFN Model.",
            "Robust Stability in Cohen-Grossberg Neural Network with both Time-Varying and Distributed Delays.",
            "New Routes from Minimal Approximation Error to Principal Components.",
            "Constructive Approximation of Discontinuous Functions by Neural Networks.",
            "Independent Component Analysis for Time-dependent Processes Using AR Source Model.",
            "A Delay-Dependent Approach to Passivity Analysis for Uncertain Neural Networks with Time-varying Delay.",
            "A Direct Locality Preserving Projections (DLPP) Algorithm for Image Recognition.",
            "Improved Global Robust Stability for Interval-Delayed Hopfield Neural Networks.",
            "Dynamic Analysis of Stochastic Recurrent Neural Networks.",
            "Hopfield-Like Neural Nets and Sensor Networks.",
            "Differential Evolution and Levenberg Marquardt Trained Neural Network Scheme for Nonlinear System Identification.",
            "On Non-Uniform Rational B-Splines Surface Neural Networks.",
            "Visual Motor Control of a 7 DOF Robot Manipulator Using Function Decomposition and Sub-Clustering in Configuration Space.",
            "Stability and Chaos of a Class of Learning Algorithms for ICA Neural Networks.",
            "Nonlinear Systems Identification via Two Types of Recurrent Fuzzy CMAC.",
            "Novel Neuronal Activation Functions for Feedforward Neural Networks.",
            "Universal Approximation and QoS Violation Application of Extreme Learning Machine.",
            "Robust Handwritten Character Recognition with Features Inspired by Visual Ventral Stream.",
            "A New Intelligent System Methodology for Time Series Forecasting with Artificial Neural Networks.",
            "A Bidirectional Hetero-Associative Memory for True-Color Patterns.",
            "On Nonparametric Residual Variance Estimation.",
            "Comment on \"On Discriminative vs. Generative Classifiers: A Comparison of Logistic Regression and Naive Bayes\".",
            "A New Associative Model with Dynamical Synapses.",
            "Blind Source Extraction for Noisy Mixtures by Combining Gaussian Moments and Generalized Autocorrelations."
        ]
    },
    {
        "name": "NPL",
        "year": "2007",
        "info": "2007: Volumes\n25,\n26",
        "count": 30,
        "papers": [
            "A New Two-Level Associative Memory for Efficient Pattern Restoration.",
            "Entropy Regularized Likelihood Learning on Gaussian Mixture: Two Gradient Implementations for Automatic Model Selection.",
            "Neuronal spatial learning.",
            "Binary Image Thinning Using Autowaves Generated by PCNN.",
            "Product Demand Forecasting with a Novel Fuzzy CMAC.",
            "Self-Organization through Spike-Timing Dependent Plasticity Using localized Synfire-Chain Patterns.",
            "Robust Prewhitening for ICA by Minimizing beta-Divergence and Its Application to FastICA.",
            "Integrated Biometric Verification System Using Soft Computing Approach.",
            "Global Robust Exponential Stability of Interval BAM Neural Network with Mixed Delays under Uncertainty.",
            "Passivity Analysis of Dynamic Neural Networks with Different Time-scales.",
            "iMLP: Applying Multi-Layer Perceptrons to Interval-Valued Data.",
            "Enhancing positioning accuracy of GPS/INS system during GPS outages utilizing artificial neural network.",
            "Learning independent components on the orthogonal group of matrices by retractions.",
            "A parametric density model for blind source separation.",
            "Output value-based initialization for radial basis function neural networks.",
            "Alpha-Beta bidirectional associative memories: theory and applications.",
            "New Least Squares Support Vector Machines Based on Matrix Patterns.",
            "An Efficient Measure of Signal Temporal Predictability for Blind Source Separation.",
            "Face Detection Using Mixture of MLP Experts.",
            "Local Experts Organization Model for Natural Scene Images Classification.",
            "Robust Control of Uncertain Stochastic Recurrent Neural Networks with Time-varying Delay.",
            "A Global Minimization Algorithm Based on a Geodesic of a Lagrangian Formulation of Newtonian Dynamics.",
            "Improving Neural Networks for Mechanism Kinematic Chain Isomorphism Identification.",
            "Comparison of Stochastic Global Optimization Methods to Estimate Neural Network Weights.",
            "Iterative Contextual Recurrent Classification of Chromosomes.",
            "Convergence Analysis of Batch Gradient Algorithm for Three Classes of Sigma-Pi Neural Networks.",
            "p th Moment Exponential Stability of Stochastic Cohen-Grossberg Neural Networks With Time-varying Delays.",
            "Authentication of Individuals using Hand Geometry Biometrics: A Neural Network Approach.",
            "An Improved Particle Swarm Optimization for Evolving Feedforward Artificial Neural Networks.",
            "Generative Modeling of Autonomous Robots and their Environments using Reservoir Computing."
        ]
    },
    {
        "name": "NPL",
        "year": "2006",
        "info": "2006: Volumes\n23,\n24",
        "count": 39,
        "papers": [
            "Adapting RBF Neural Networks to Multi-Instance Learning.",
            "A Neural Model for Context-dependent Sequence Learning.",
            "A Back-propagation Neural Network Landmine Detector Using the Delta-technique and S-statistic.",
            "Theoretical Properties of Projection Based Multilayer Perceptrons with Functional Inputs.",
            "Using Cellular Probabilistic Self-Organizing Map in Borrowing Channel Assignment for Patterned Traffic Load.",
            "Multi-Classification by Using Tri-Class SVM.",
            "A Modified Backpropagation Training Algorithm for Feedforward Neural Networks*.",
            "How Online Learning Approaches Ornstein Uhlenbeck Processes.",
            "An Equivalence between SILF-SVR and Ordinary Kriging.",
            "Neural Systems with Numerically-Matched Input-Output Statistic: Variate Generation.",
            "Global Robust Exponential Stability of Interval General BAM Neural Network with Delays.",
            "Computing Information in Neuronal Spikes.",
            "Minimal Structure of Self-Organizing HCMAC Neural Network Classifier.",
            "Parameter by Parameter Algorithm for Multilayer Perceptrons.",
            "Almost Periodic Solution for Shunting Inhibitory Cellular Neural Networks with Time-varying Delays and Variable Coefficients.",
            "An RCE-based Associative Memory with Application to Human Face Recognition.",
            "A Neuro-Fuzzy Approach for Compensating Color Backlight Images.",
            "A Neural Control System of a Two Joints Robot for Visual Conferencing.",
            "Face Matching in Large Database by Self-Organizing Maps.",
            "A New Cluster Validity for Data Clustering.",
            "Rule-Based Learning Systems for Support Vector Machines.",
            "BYY Harmony Learning on Finite Mixture: Adaptive Gradient Implementation and A Floating RPCL Mechanism.",
            "Lamb Meat Quality Assessment by Support Vector Machines.",
            "Constrained Projection Approximation Algorithms for Principal Component Analysis.",
            "Distance-Based Sparse Associative Memory Neural Network Algorithm for Pattern Recognition.",
            "CB3: An Adaptive Error Function for Backpropagation Training.",
            "A Symmetric Probabilistic Encryption Scheme Based On CHNN Without Data Expansion.",
            "A Hybrid Training Algorithm for Feedforward Neural Networks.",
            "Activation-Based Recursive Self-Organising Maps: A General Formulation and Empirical Results.",
            "A Fast Feature-based Dimension Reduction Algorithm for Kernel Classifiers.",
            "Adaptive Denoising Using a Modified Sparse Coding Shrinkage Method.",
            "Hierarchical Incremental Class Learning with Reduced Pattern Training.",
            "Soft-Decoding SOM for VQ Over Wireless Channels.",
            "New Results on the Robust Stability of Cohen-Grossberg Neural Networks with Delays.",
            "Real Time Implementation of Fuzzy Gain Scheduling of PI Controller for Induction Motor Machine Control.",
            "Predicting Chaotic Time Series Using Neural and Neurofuzzy Models: A Comparative Study.",
            "A Neuro-Dynamic Programming-Based Optimal Controller for Tomato Seedling Growth in Greenhouse Systems.",
            "Model and Training of QNN with Weight.",
            "A Hybrid SOM-BPN Approach to Lot Output Time Prediction in a Wafer Fab."
        ]
    },
    {
        "name": "NPL",
        "year": "2005",
        "info": "2005: Volumes\n21,\n22",
        "count": 42,
        "papers": [
            "A Learning Rule to Model the Development of Orientation Selectivity in Visual Cortex.",
            "Supervised Neural Gas with General Similarity Measure.",
            "Improving the Robustness of 'Online Agglomerative Clustering Method' Based on Kernel-Induce Distance Measures.",
            "Complete Convergence of Competitive Neural Networks with Different Time Scales.",
            "Global Asymptotic Stability Analysis of Neural Networks with Time-Varying Delays.",
            "Data Fusion in Radial Basis Function Networks for Spatial Regression.",
            "Chained DLS-ICBP Neural Networks with Multiple Steps Time Series Prediction.",
            "On the Generalization Ability of GRLVQ Networks.",
            "Broad-Coverage Parsing with Neural Networks.",
            "Analyzing Global Dynamics of a Neural Field Model.",
            "Hopfield Neural Networks for Parametric Identification of Dynamical Systems.",
            "Blind Source Recovery in a State-Space Famework: Algorithms for Static and Dynamic Environments.",
            "An Incremental Learning Strategy for Support Vector Regression.",
            "A Divide-and-Conquer Learning Approach to Radial Basis Function Networks.",
            "A Preliminary Study on Negative Correlation Learning via Correlation-Corrected Data (NCCD).",
            "Fast Blind Equalization Using Complex-Valued MLP.",
            "Continuous CMAC-QRLS and Its Systolic Array.",
            "Speeding up the Self-Organizing Feature Map Using Dynamic Subset Selection.",
            "Global Stability of a General Class of Discrete-Time Recurrent Neural Networks.",
            "An Improved Algorithm for Kernel Principal Component Analysis.",
            "Refractoriness in Poisson and Gaussian First-order Neural Nets with Chemical Markers.",
            "Online State-Space Modeling Using Recurrent Multilayer Perceptrons with Unscented Kalman Filter.",
            "Associative Gray Level Pattern Processing using Binary Decomposition and alpha beta Memories.",
            "Feature Extraction Using Independent Components of Each Category.",
            "Motion-Driven Segmentation by Competitive Neural Processing.",
            "Merging Strategy for Cross-Lingual Information Retrieval Systems based on Learning Vector Quantization.",
            "A Method of Accelerating Neural Network Learning.",
            "Primal-Dual Monotone Kernel Regression.",
            "On the Effect of the Form of the Posterior Approximation in Variational Learning of ICA Models.",
            "COMAX: A Cooperative Method for Determining the Position of the Maxima.",
            "Performance Evaluation of GAP-RBF Network in Channel Equalization.",
            "Modeling the Random Drift of Micro-Machined Gyroscope with Neural Network.",
            "TCSOM: Clustering Transactions Using Self-Organizing Map.",
            "Aspects of the Binary CMAC: Unimodularity and Probabilistic Reconstruction.",
            "An Examination of Qubit Neural Network in Controlling an Inverted Pendulum.",
            "Color Characterization and Balancing by a Nonlinear Line Attractor Network for Image Enhancement.",
            "A Resampling Test for the Total Independence of Stationary Time Series: Application to the Performance Evaluation of ICA Algorithms.",
            "Linear State Space Feedforward and Feedback Structures for Blind Source Recovery in Dynamic Environments.",
            "Analysis of the BSB Model Dynamics Using Control Theory.",
            "Implementing Temporal-Difference Learning with the Scaled Conjugate Gradient Algorithm.",
            "Estimation of Shape Parameter of GGD Function by Negentropy Matching.",
            "State-Space Recurrent Fuzzy Neural Networks for Nonlinear System Identification."
        ]
    },
    {
        "name": "NPL",
        "year": "2004",
        "info": "2004: Volumes\n19,\n20",
        "count": 32,
        "papers": [
            "Improve Multi-Instance Neural Networks through Feature Selection.",
            "On the Computational Power of Max-Min Propagation Neural Networks.",
            "Ensemble Learning for Chemical Sensor Arrays.",
            "Ecological Neural Networks for Object Recognition and Generalization.",
            "A Learning Algorithm of CMAC Based on RLS.",
            "Minimizing the Cross Validation Error to Mix Kernel Matrices of Heterogeneous Biological Data.",
            "Rough Neural Network of Variable Precision.",
            "A Fuzzy-Related Thesaurus for Query Refinement.",
            "Interaction with In-Vehicle Electronic Systems: A Complete Description of a Neural Network Approach.",
            "Exponential Periodicity of Continuous-time and Discrete-Time Neural Networks with Delays.",
            "Memory Consolidation and Forgetting During Sleep: A Neural Network.",
            "LSISOM - A Latent Semantic Indexing Approach to Self-Organizing Maps of Document Collections.",
            "Neural Network Based Recognition of Smoke Signatures from Lidar Signals.",
            "Ensemble of Evolving Neural Networks in Classification.",
            "Associative Memory Design via Path Embedding into a Graph.",
            "Application of Probabilistic Neural Networks to the Class Prediction of Leukemia and Embryonal Tumor of Central Nervous System.",
            "Fusion of GRNN and FA for Online Noisy Data Regression.",
            "A Modified CMAC Algorithm Based on Credit Assignment.",
            "Visual-Motor Coordination Using a Quantum Clustering Based Neural Control Scheme.",
            "Further Results on the Asymptotic Memory Capacity of the Generalized Hopfield Network.",
            "Novel Self-Organizing Takagi Sugeno Kang Fuzzy Neural Networks Based on ART-like Clustering.",
            "On Robust Exponential Periodicity of Interval Neural Networks with Delays.",
            "Neuronal Signal Transduction Aided by Noise at Threshold and at Saturation.",
            "A New Multi-output Neural Model with Tunable Activation Function and its Applications.",
            "Lazy Learning in Radial Basis Neural Networks: A Way of Achieving More Accurate Models.",
            "A Localized Forgetting Method for Gaussian RBFN Model Adaptation.",
            "Neural Network Based Recognition of Smoke.",
            "A New Fuzzy Support Vector Machine Based on the Weighted Margin.",
            "Lack of Consistency of Mean Field and Variational break Bayes Approximations for State Space Models.",
            "SOM Ensemble-Based Image Segmentation.",
            "Recurrent Algorithms for Selecting the Maximum Input.",
            "The Evolving Tree - A Novel Self-Organizing Network for Data Analysis."
        ]
    },
    {
        "name": "NPL",
        "year": "2003",
        "info": "2003: Volumes\n17,\n18",
        "count": 36,
        "papers": [
            "A Sigma Pi Sigma Neural Network (SPSNN).",
            "A Learning Algorithm for Evolving Cascade Neural Networks.",
            "Weight Initialization for Simultaneous Recurrent Neural Network Trained with a Fixed point Learning Algorithm.",
            "A Note on the Universal Approximation Capability of Support Vector Machines.",
            "A New Learning Algorithm Using Simultaneous Perturbation with Weight Initialization.",
            "Topic Identification in Dynamical Text by Complexity Pursuit.",
            "A Data Reusing Nonlinear Gradient Descent Algorithm for a Class of Complex Valued Neural Adaptive Filters.",
            "Differential Evolution Training Algorithm for Feed Forward Neural Networks.",
            "Global Robust Exponential Stability of Interval Neural Networks with Delays.",
            "Speech Dimensionality Analysis on Hypercubical Self Organizing Maps.",
            "A Method for the Improvement of the Behavior of Bidirectional Associative Memories as Pattern Classifiers.",
            "Extracting Interpretable Fuzzy Rules from RBF Networks.",
            "Recursive Update Algorithm for Least Squares Support Vector Machines.",
            "Efficient Learning in Adaptive Processing of Data Structures.",
            "Accelerating Cyclic Update Algorithms for Parameter Estimation by Pattern Searches.",
            "Automorphism Partitioning with Neural Networks.",
            "A Generative Probabilistic Oriented Wavelet Model for Texture Segmentation.",
            "Human Face Detection in Digital Video Using SVMEnsemble.",
            "Self-Organizing-Map Based Clustering Using a Local Clustering Validity Index.",
            "A Fast Simplified Fuzzy ARTMAP Network.",
            "Stable Neural Attractors Formation: Learning Rules and Network Dynamics.",
            "Adaptive Radial Basis Decomposition by Learning Vector Quantization.",
            "Improving Bayesian Regularization of ANN via Pre-training with Early-Stopping.",
            "Assessing the Noise Immunity and Generalization of Radial Basis Function Networks.",
            "Multiuser Detection of Synchronous MC-CDMA in Multipath Fading Channels Using Hopfield Neural Networks.",
            "Digital Least Squares Support Vector Machines.",
            "2-D Shape Recognition using Recursive Landmark Determination and Fuzzy ART Network Learning.",
            "A People-Counting System Using a Hybrid RBF Neural Network.",
            "Fault Diagnosis Using Wavelet Neural Networks.",
            "A General Learning Scheme for CMAC-based Controller.",
            "On the Kernel Widths in Radial-Basis Function Networks.",
            "Clustering Incomplete Data Using Kernel-Based Fuzzy C-means Algorithm.",
            "Information-Theoretic Competitive Learning with Inverse Euclidean Distance Output Units.",
            "Sigmoidal Function Classes for Feedforward Artificial Neural Networks.",
            "Improved CBP Neural Network Model with Applications in Time Series Prediction.",
            "A Solution for the N-bit Parity Problem Using a Single Translated Multiplicative Neuron."
        ]
    },
    {
        "name": "NPL",
        "year": "2002",
        "info": "2002: Volumes\n15,\n16",
        "count": 45,
        "papers": [
            "Input Multiplexing in Artificial Neurons Employing Stochastic Arithmetic.",
            "Additive Composition of Supervised Self Organizing Maps.",
            "Text Retrieval Using Self Organized Document Maps.",
            "Fast Extraction of Semantic Features from a Latent Semantic Indexed Text Corpus.",
            "Multiclass LS SVMs Moderated Outputs and Coding Decoding Schemes.",
            "Conformal Transformation of Kernel Functions A Data Dependent Way to Improve Support Vector Machine Classifiers.",
            "Emergence of Orienting Behavior in Ecological Neural Networks.",
            "A Greedy EM Algorithm for Gaussian Mixture Learning.",
            "The Equivalence of Support Vector Machine and Regularization Neural Networks.",
            "A Lamarckian Approach for Neural Network Training.",
            "A Neural Network Based Approach to Optical Symbol Recognition.",
            "A Novel Measure for Quantifying the Topology Preservation of Self Organizing Feature Maps.",
            "Kernel Nearest Neighbor Algorithm.",
            "Neural Net Based H infin Control for a Class of Nonlinear Systems.",
            "ε Descending Support Vector Machines for Financial Time Series Forecasting.",
            "RBF Network Methods for Face Detection and Attentional Frames.",
            "Combining Lateral and Elastic Interactions Topology Preserving Elastic Nets.",
            "Invariant Recognition of Spatio Temporal Patterns in The Olfactory System Model.",
            "On the Efficient Speech Feature Extraction Based on Independent Component Analysis.",
            "Supervised Training Using an Unsupervised Approach to Active Learning.",
            "Expansive and Competitive Learning for Vector Quantization.",
            "Complex Weighted One Unit 8216 Rigid Bodies 8217 Learning Rule for Independent Component Analysis.",
            "Principal Feasability Studies Using Neuro 8211 Numerics for Prediction of Flow Fields.",
            "A Novel Method to Handle Inequality Constraints for Convex Programming Neural Network.",
            "Self Organizing Transient Chaotic Neural Network for Cellular Channel Assignment.",
            "A Neural Network with Evolutionary Neurons.",
            "Fusing Neural Networks Through Space Partitioning and Fuzzy Integration.",
            "Image Compression by Layered Quantum Neural Networks.",
            "Hybrid Feedforward Neural Networks for Solving Classification Problems.",
            "Self Organizing Dynamic Graphs.",
            "Gradient Computation of Continuous Time Cellular Neural Nonlinear Networks with Linear Templates via the CNN Universal Machine.",
            "Shape From Shading by Using Neural Based Colour Reflectance Model.",
            "Learning Based Complexity Evaluation of Radial Basis Function Networks.",
            "Piecewise Linear Projection Based on Self Organizing Map.",
            "Beating in Membrane Potential Mediated by Cortical gamma Oscillations for Reading Out Synchronous Neuronal Activities Over Distant Cortical Areas.",
            "Empirical Evidence for Ultrametric Structure in Multi layer Perceptron Error Surfaces.",
            "Associative Neural Network.",
            "The Minimum Number of Errors in the N-Parity and its Solution with an Incremental Neural Network.",
            "Segmentation of MR and CT Images Using a Hybrid Neural Network Trained by Genetic Algorithms.",
            "Walking on Virtual Tiles.",
            "Stochastic Resonance and Coincidence Detection in Single Neurons.",
            "Biologically Plausible Associative Memory: Continuous Unit Response + Stochastic Dynamics.",
            "Importance Sampling and Mean Square Error in Neural Detector Training.",
            "A Stochastic Neural Model for Fast Identification of Spatiotemporal Sequences.",
            "Reduced Rank Kernel Ridge Regression."
        ]
    },
    {
        "name": "NPL",
        "year": "2001",
        "info": "2001: Volumes\n13,\n14",
        "count": 39,
        "papers": [
            "The Neural Solids; For optimization problems.",
            "Efficient Vector Quantization Using the WTA-Rule with Activity Equalization.",
            "Probability Density Estimation Using Adaptive Activation Function Neurons.",
            "A Simple Neural Network Pruning Algorithm with Application to Filter Synthesis.",
            "An Annealed Chaotic Competitive Learning Network with Nonlinear Self-feedback and Its Application in Edge Detection.",
            "Storage Capacity of the Exponential Correlation Associative Memory.",
            "Learning Algorithm and Retrieval Process for the Multiple Classes Random Neural Network Model.",
            "Using a New Model of Recurrent Neural Network for Control.",
            "Multi-step Learning Rule for Recurrent Neural Models: An Application to Time Series Forecasting.",
            "Finite-Sample Convergence Properties of the LVQ1 Algorithm and the Batch LVQ1 Algorithm.",
            "Learning with Nearest Neighbour Classifiers.",
            "Generalizations of the Hamming Associative Memory.",
            "Sequential Extraction of Minor Components.",
            "Evolving Stacked Time Series Predictors with Multiple Window Scales and Sampling Gaps.",
            "Reinforcement Learning Using the Stochastic Fuzzy Min-Max Neural Network.",
            "Recursive Partitioning Technique for Combining Multiple Classifiers.",
            "Temporal Kohonen Map and the Recurrent Self-Organizing Map: Analytical and Experimental Comparison.",
            "Maharadja: A System for the Real Time Simulation of RBF with the Mahalanobis Distance.",
            "A Neuro-Based Optimization Algorithm for Tiling Problems with Rotation.",
            "Dynamic Schedule for Effective On-Line Connection Pruning.",
            "Detection of Ectopic Beats in the Electrocardiogram Using an Auto-Associative Neural Network.",
            "Intrinsic Dimension Estimation of Data: An Approach Based on Grassberger-Procaccia's Algorithm.",
            "Application of the Self-Organizing Feature Map Algorithm in Facial Image Morphing.",
            "Ensemble of Independent Factor Analyzers with Application to Natural Image Analysis.",
            "Learning Convergence of CMAC Algorithm.",
            "Combining the Perceptron Algorithm with Logarithmic Simulated Annealing.",
            "A Family of Canonical Correlation Networks.",
            "Predictive Coding in the Visual Cortex by a Recurrent Network with Gabor Receptive Fields.",
            "Mean-field Theory and Synchronization in Random Recurrent Neural Networks.",
            "Online Text Prediction with Recurrent Neural Networks.",
            "The Computing Capacity of Three-Input Multiple-Valued One-Threshold Perceptrons.",
            "Smoothed Bagging with Kernel Bandwidth Selectors.",
            "Associative Clustering for Clusters of Arbitrary Distribution Shapes.",
            "Using Unlabelled Data to Train a Multilayer Perceptron.",
            "An Efficient Multivalued Hopfield Network for the Traveling Salesman Problem.",
            "Saturated Perceptrons for Maximum Margin and Minimum Misclassification Error.",
            "Combining RBF Networks Trained by Different Clustering Techniques.",
            "Incremental Learning with Respect to New Incoming Input Attributes.",
            "Neural Network Method for Solving Partial Differential Equations."
        ]
    },
    {
        "name": "NPL",
        "year": "2000",
        "info": "2000: Volumes\n11,\n12",
        "count": 44,
        "papers": [
            "Towards the Optimal Learning Rate for Backpropagation.",
            "A New Method to Increase the Margin of Multilayer Perceptrons.",
            "Learning Synaptic Clusters for Nonlinear Dendritic Processing.",
            "Online Interactive Neuro-evolution.",
            "A Minimax Method for Learning Functional Networks.",
            "Evaluating the Generalization Ability of Support Vector Machines through the Bootstrap.",
            "Building Adaptive Basis Functions with a Continuous Self-Organizing Map.",
            "A Formal Model for Definition and Simulation of Generic Neural Networks.",
            "A Practical Sequential Method for Principal Component Analysis.",
            "Single-Iteration Training Algorithm for Multi-Layer Feed-Forward Neural Networks.",
            "An Incremental Algorithm for Parallel Training of the Size and the Weights in a Feedforward Neural Network.",
            "A Novel Self-Creating Neural Network for Learning Vector Quantization.",
            "A Novel Approach Solving for Linear Matrix Inequalities Using Neural Networks.",
            "Erratum: A Bi-Directional Multilayer Perceptron.",
            "A Batch Learning Vector Quantization Algorithm for Nearest Neighbour Classification.",
            "A Comparison between the Tikhonov and the Bayesian Approaches to Calculate Regularisation Matrices.",
            "Competitive and Temporal Inhibition Structures with Spiking Neurons.",
            "An Experimental Comparison of Three PCA Neural Networks.",
            "Neural Net Based Hybrid Modeling of the Methanol Synthesis Process.",
            "Transfusion Cost Containment for Abdominal Surgery with Neural Networks.",
            "Analysis of the Functional Block Involved in the Design of Radial Basis Function Networks.",
            "Control of a Robotic Manipulator Using Artificial Neural Networks with On-line Adaptation.",
            "Simultaneous Identification of Face and Orientation.",
            "Out-of-Vocabulary Rejection based on Selective Attention Model.",
            "Coherent Response in a Chaotic Neural Network.",
            "Clustered Recursive Branching Network.",
            "Learning with Permutably Homogeneous Multiple-Valued Multiple-Threshold Perceptrons.",
            "On-line Algorithm for Blind Signal Extraction of Arbitrarily Distributed, but Temporally Correlated Sources Using Second Order Statistics.",
            "Obtaining Fault Tolerant Multilayer Perceptrons Using an Explicit Regularization.",
            "Evolving Multilayer Perceptrons.",
            "Associative Memories in Infinite Dimensional Spaces.",
            "Embedding Connectionist Autonomous Agents in Time: The ?Road Sign Problem?",
            "Globally Convergent Modification of the Quickprop Method.",
            "Parallel Implementation of Self-Organizing Map on the Partial Tree Shape Neurocomputer.",
            "Improving the Mean-Field Approximation in Belief Networks Using Bahadur's Reparameterisation of the Multivariate Binary Distribution.",
            "Self-Organization by Temporal Inhibition (SOTI).",
            "Parametric Amplification of Signals by Noise in Neurons and Neural Networks.",
            "Using a Neural Network to Approximate an Ensemble of Classifiers.",
            "An Analysis of the Fundamental Structure of Complex-Valued Neurons.",
            "On the Internal Representations of Product Units.",
            "A Direct Link Minimal Resource Allocation Network for Adaptive Noise Cancellation.",
            "A Neural Chaos Model of Multistable Perception.",
            "Bayesian Sampling and Ensemble Learning in Generative Topographic Mapping.",
            "Nonlinear System Identification Using Lyapunov Based Fully Tuned Dynamic RBF Networks."
        ]
    },
    {
        "name": "NPL",
        "year": "1999",
        "info": "1999: Volumes\n9,\n10",
        "count": 53,
        "papers": [
            "A Constructive Approach to Calculating Lower Entropy Bounds.",
            "Fast Convergent Generalized Back-Propagation Algorithm with Constant Learning Rate.",
            "A Fuzzy Neuron with Binary Input and its Training Algorithm.",
            "A New Methodology for Efficient Classification of Multispectral Satellite Images Using Neural Network Techniques.",
            "Neural Short-Term Prediction Based on Dynamics Reconstruction.",
            "Initialization of Supervised Training for Parametric Estimation.",
            "Mixture Density Estimation Based on Maximum Likelihood and Sequential Test Statistics.",
            "A Variable Memory Quasi-Newton Training Algorithm.",
            "Stability Properties of Cerebellar Neural Networks: The {P}urkinje Cell Climbing Fiber Dynamic Module.",
            "New, Faster Algorithms for Supervised Competitive Learning: Counterpropagation and Adaptive-resonance Functionality.",
            "Training Reinforcement Neurocontrollers Using the Polytope Algorithm.",
            "On the Relationship Between the Support Vector Machine for Classification and Sparsified Fisher's Linear Discriminant.",
            "Orthogonal RBF Neural Network Approximation.",
            "Fast Evolutionary Learning with Batch-Type Self-Organizing Maps.",
            "The Study of Chaotic Neural Network and its Applications in Associative Memory.",
            "A Fast Heuristic Global Learning Algorithm for Multilayer Neural Networks.",
            "A Neural Network Model of Semantic Processing Errors in Parkinson's Disease.",
            "Erratum On the Parsimony of the Multi-Layer Perceptrons when Processing Encoded Symbolic Variables.",
            "A Hierarchical Self-Organizing Map Model for Sequence Recognition.",
            "A Multilayer Perceptrons Model for the Stability of a Bipedal Robot.",
            "On the Design and Implementation of a Neuromorphic Self-Tuning Controller.",
            "A Chaotic Annealing Neural Network with Gain Sharpening and Its Application to the 0/1 Knapsack Problem.",
            "Unsupervised Learning of Higher-Order Statistics.",
            "Performance Analysis of Neural Network Detectors by Importance Sampling Techniques.",
            "Constructive Backpropagation for Recurrent Networks.",
            "A Neural-Network-Based Approach to Detecting Hyperellipsoidal Shells.",
            "Least Squares Support Vector Machine Classifiers.",
            "The Fixed-Point Algorithm and Maximum Likelihood Estimation for Independent Component Analysis.",
            "A Pattern Adaptive Technique to Handle Data Quality Variation.",
            "Perceptron Learning Revisited: The Sonar Targets Problem.",
            "Redundant Hash Addressing of Feature Sequences Using the Self-Organizing Map.",
            "Fuzzy Clustering Using A Compensated Fuzzy Hopfield Network.",
            "Improvement on Higher-Order Neural Networks for Invariant Object Recognition.",
            "Extended Self Organizing Feature Map: A Tagged Potential Field Approach.",
            "Walking on Tiles.",
            "A Bi-Directional Multilayer Perceptron.",
            "A Continuous-Time Model of Autoassociative Neural Memories Utilizing the Noise-Subspace Dynamics.",
            "A Fast Neural Learning Vision System for Crowd Estimation at Underground Stations Platform.",
            "An Accurate Measure for Multilayer Perceptron Tolerance to Weight Deviations.",
            "Self-Organized Feature Extraction Achieved with a Parameterized Filterbank.",
            "On the Characteristics of Growing Cell Structures (GCS) Neural Network.",
            "Self-Organizing Maps and Learning Vector Quantization for Feature Sequences.",
            "On a Hopfield Net Arising in the Modelling and Control of Over-Saturated Signalized Intersections.",
            "Training Algorithm with Incomplete Data for Feed-Forward Neural Networks.",
            "A Model for the Dynamic Interaction Between Evolution and Learning.",
            "A Recurrent Neural Network for N-Stage Optimal Control Problems.",
            "Neural Networks in Non-Euclidean Spaces.",
            "A New Relaxation Procedure in the Hopfield Network for Solving Optimization Problems.",
            "Cooperative-Competitive Algorithms for Evolutionary Networks Classifying Noisy Digital Images.",
            "Knowledge Incorporation into Neural Networks From Fuzzy Rules.",
            "Input Feature Extraction for Multilayered Perceptrons Using Supervised Principal Component Analysis.",
            "Sensitivity Analysis for Decision Boundaries.",
            "Convergence of Delayed Dynamical Systems."
        ]
    },
    {
        "name": "NPL",
        "year": "1998",
        "info": "1998: Volumes\n7,\n8",
        "count": 44,
        "papers": [
            "Characterization of the Sonar Signals Benchmark.",
            "Constrained Learning in Neural Networks: Application to Stable Factorization of 2-D Polynomials.",
            "A Layer-by-Layer Least Squares based Recurrent Networks Training Algorithm: Stalling and Escape.",
            "A Dynamic Network Model of the Color Visual Pathways for Attentive Recognition.",
            "Optimal Algorithmic Complexity of Fuzzy ART.",
            "Data Set A is a Pattern Matching Problem.",
            "Maximum Matching on Boltzmann Machines.",
            "A Spurious Equilibria-free Learning Algorithm for the Blind Separation of Non-zoer Skewness Signals.",
            "Chaos and Neural Network Learning. Some Observations.",
            "On-Line Learning Fokker-Planck Machine.",
            "On-line Successive Synthesis of Wavelet Networks.",
            "Centroid based Multilayer Perceptron Networks.",
            "Active Learning with Local Models.",
            "Function Estimation by Feedforward Sigmoidal Networks with Bounded Weights.",
            "Eye Tracking in Image Sequences by Competitive Neural Networks.",
            "Local Adaptive Subspace Regression.",
            "Functional Networks.",
            "Constrained RTRL To Reduce Learning Rate and Forgetting Phenomenon.",
            "Parallel Coarse Grain Computing of Boltzmann Machines.",
            "Prediction of Chaotic Time-Series with a Resource-Allocating RBF Network.",
            "Synchronization of Locally Coupled Neural Oscillators.",
            "Extraction of Logical Rules from Neural Networks.",
            "Classification by Density Intersection.",
            "Arbitrary FIR Filter Synthesis Using a Neural Network.",
            "Constraints Satisfaction through Recursive Neural Networks with Mixed Penalties: a Case Study.",
            "The Latent Variable Data Model for Exploratory Data Analysis and Visualisation: A Generalisation of the Nonlinear Infomax Algorithm.",
            "Improved Representation-burden Conservation Network for Learning Non-stationary VQ.",
            "Automatic Classification of Biological Particles from Electron-microscopy Images Using Conventional and Genetic-algorithm Optimized Learning Vector Quantization.",
            "Ann Algorithm for Incremental Machine Learning: Heuristics in a Bayesian Technique.",
            "A Neuro-fuzzy Coding for Processing Incomplete Data: Application to the Classification of Seismic Events.",
            "Trajectory Control of Convergent Networks.",
            "Behaviour in 0 of the Neural Networks Training Cost.",
            "Collinearity and Parallelism are Statistically Significant Second-Order Relations of Complex Cell Responses.",
            "Approximate Feedback Linearisation Using Multilayer Neural Networks.",
            "On the Parsimony of the Multi-Layer Perceptrons when Processing Encoded Symbolic Variables.",
            "The Self-Organizing Map of Trees.",
            "Speeding up MLP Execution through Difference Forward Propagation.",
            "The Softmap Algorithm.",
            "Deeper Sparsely Nets can be Optimal.",
            "Grammatical Inference using an Adaptive Recurrent Neural Network.",
            "Pruned Feed-forward Networks for Efficient Implementation of Multiple FIR Filters with Arbitrary Frequency Responses.",
            "Minimal complexity velocity-tuned filters with analogue neuromorphic networks: A theoretical approach for efficient design.",
            "Handwritten Digit Recognition by a Mixture of Local Principal Component Analysis.",
            "Extracting Rules from Composite Neural Networks for Medical Diagnostic Problems."
        ]
    },
    {
        "name": "NPL",
        "year": "1997",
        "info": "1997: Volumes\n5,\n6",
        "count": 35,
        "papers": [
            "Implementation of the Exclusive-Or Function in a Hopfield Style Recurrent Network.",
            "Learning Temporally Encoded Patterns in Networks of Spiking Neurons.",
            "Exploitation of Contributions to Information Gain, from Learning Analysis to Architecture Synthesis.",
            "Prediction of Neural Net Tolerance to Noise.",
            "The LBG-U Method for Vector Quantization - an Improvement over LBG Inspired from Neural Networks.",
            "Efficient Minimisation of the KL Distance for the Approximation of Posterior Conditional Probabilities.",
            "The Metric Structure of Weight Space.",
            "A Constrained Generative Model Applied to Face Detection.",
            "Virtual sample generation using a population of networks.",
            "Training a neuron in sequential learning.",
            "Modified Oja's Algorithms For Principal Subspace and Minor Subspace extraction.",
            "Vision Experiments with Neural Deformable Template Matching.",
            "Increasing Attraction of Pseudo-Inverse Autoassociative Networks.",
            "Feedforward Neural Networks Based Input-Output Models for Railway Carriage System Identification.",
            "Computationally Efficient Approximation of a Probabilistic Model for Document Representation in the WEBSOM Full-Text Analysis Method.",
            "Interweaving Kohonen Maps of Different Dimensions to Handle Measure Zero Constraints on Topological Mappings.",
            "Recognising Simple Behaviours Using Time-Delay RBF Networks.",
            "A Recursive Orthogonal Least Squares Algorithm for Training RBF Networks.",
            "SVD Algorithms: APEX-like versus Subspace Methods.",
            "The Continuous Interpolating Self-organizing Map.",
            "Self-Organizing Maps for the Analysis of Complex Movement Patterns.",
            "Synchronization in Time-delayed Binary Oscillatory Network.",
            "Representation-burden Conservation Network Applied to Learning VQ (NPL270).",
            "Promoting Software Reuse Using Self Organizing Maps.",
            "Symmetry and Network Structure.",
            "A New Weight Initialization Method for the MLP with the BP in Multiclass Classification Problems.",
            "Two Neural Network Construction Methods.",
            "A Neural Network for PCA and Beyond.",
            "An Enhancement of Generalization Ability in Cascade Correlation Algorithm by Avoidance of Overfitting/Overtraining Problem.",
            "An Efficient Partition of Training Data Set Improves Speed and Accuracy of Cascade-correlation Algorithm.",
            "Comparative Analysis on Convergence Rates of The EM Algorithm and Its Two Modifications for Gaussian Mixtures.",
            "A Sensitivity Analysis of the Self Organizing Maps as an Adaptive One-pass Non-stationary Clustering Algorithm: the Case of Color Quantization of Image Sequences.",
            "A Neural Network Model of Caenorhabditis Elegans: The Circuit of Touch Sensitivity.",
            "Estimation of the Lipschitz Norm with Neural Networks.",
            "ART1: Similarity Measures."
        ]
    },
    {
        "name": "NPL",
        "year": "1996",
        "info": "1996: Volumes\n3,\n4",
        "count": 35,
        "papers": [
            "Multilayer Perceptrons Combination Applied to Handwritten Character Recognition.",
            "Improving Reinforcement Learning in Stochastic {RAM}-Based Neural Networks.",
            "Radial Basis Function Networks with FIR/IIR Synapses.",
            "A Stochastically Motivated Random Initialization of Pattern Classifying MLPs.",
            "Linear Correlation-Based Learning Models Require a Two-Stage Process for the Development of Orientation and Ocular Dominance.",
            "Self-Organization and Functional Role of Lateral Connections and Multisize Receptive Fields in the Primary Visual Cortex.",
            "A Short Term Memory for Neural Networks Which Allows Recognition and Reproduction of Complex Sequences of Integers with the Minimum Number of Weights.",
            "Neural Recognition of Human Pointing Gestures in Real Images.",
            "Measuring Distribution in Distributed Representations.",
            "Text-Dependent Speaker Identification Based on Input/Output HMMs: An Empirical Study.",
            "A Least Third-Order Cumulants Objective Function.",
            "Use of Modular Architectures for Time Series Prediction.",
            "A Relaxation Algorithm for Estimating the Domain of Validity of Feedforward Neural Networks.",
            "Network Connectivity Changes through Activity-Dependent Neurite Outgrowth.",
            "Robust Image Association by Recurrent Neural Subnetworks.",
            "Neural Network for Optimal {Steiner} Tree Computation.",
            "Convergence Problems due to an RBF Classifier's Learning Process.",
            "Effects of Multiplier Output Offsets on On-Chip Learning for Analog Neuro-Chips.",
            "A Novel Approach for Analyzing Dynamics in Neural Networks with Saturated Characteristics.",
            "An Energy Function for the Random Neural Network.",
            "Adaptive Internal Activation Functions and Their Effect on Learning in Feed Forward Networks.",
            "Multi-Threshold Neurones Perceptron.",
            "Modular Neuro-Chip with On-Chip Learning and Adjustable Learning Parameters.",
            "Effects of Varying Parameters on Properties of Self-Organizing Feature Maps.",
            "Simulation of Cortex-Like Neural Networks on a CNAPS SIMD Neurocomputer.",
            "Simplifying a Neuro-Fuzzy Model.",
            "A Design and Analysis of Objective Function-Based Unsupervised Neural Networks for Fuzzy Clustering.",
            "Combining Topographic Map Formation with Projection Pursuit Learning for Nonparametric Regression Analysis.",
            "Generalized Predictive Control Based on Neural Networks.",
            "The Influence of Photo-Detector Non-Linearity on the Multi-Functionality of an Opto-Electronic Cellular Neural Network.",
            "Health Monitoring of Vibration Signatures in Rotorcraft Wings.",
            "A Temporal Model of Linear Anti-Hebbian Learning.",
            "Two Is Better Than One: A Diploid Genotype for Neural Networks.",
            "Modelling the Belgian Gas Consumption Using Neural Networks.",
            "A Reinforcement Learning Approach Based on the Fuzzy Min-Max Neural Network."
        ]
    },
    {
        "name": "NPL",
        "year": "1995",
        "info": "1995: Volume 2",
        "count": 42,
        "papers": [
            "A new scheme for incremental learning.",
            "A nonlinear extension of the Generalized Hebbian learning.",
            "Morphogenesis of neural networks.",
            "Compartmental modelling with artificial neural networks.",
            "Quantitative object motion prediction by an ART2 and Madaline combined neural network.",
            "An ANNs-based system for the diagnosis and treatment of diseases.",
            "A learning algorithm for Recurrent Radial Basis Function Networks.",
            "Asymptotic performances of a constructive algorithm.",
            "A multilayer incremental neural network architecture for classification.",
            "Fine-tuning Cascade-Correlation trained feedforward network with backpropagation.",
            "Determining initial weights of feedforward neural networks based on least squares method.",
            "Post-processing of coded images by neural network cancellation of the unmasked noise.",
            "Neural learning of chaotic dynamics.",
            "Improving the Counterpropagation network performances.",
            "Book review.",
            "Editorial.",
            "Weighted Radial Basis Functions for improved pattern recognition and signal processing.",
            "Analog weight adaptation hardware.",
            "Adaptative time constants improve the prediction capability of recurrent neural networks.",
            "A general exploratory projection pursuit network.",
            "Improving the approximation and convergence capabilities of projection pursuit learning.",
            "Invariance in radial basis function neural networks in human face classification.",
            "Evolving neural networks with iterative learning scheme for associative memory.",
            "Combining Singular-Spectrum Analysis and neural networks for time series forecasting.",
            "A simplified MMC model for the control of an arm with redundant degrees of freedom.",
            "On the statistical physics of radial basis function networks.",
            "Accelerated training algorithm for feedforward neural networks based on least squares method.",
            "On the search for new learning rules for ANNs.",
            "A strong winner-take-all model based on integration of potential differences.",
            "A biologically plausible neural network for motion detection.",
            "Growing Grid - a self-organizing network with constant neighborhood range and adaptation strength.",
            "A neural network technique of generating empirical bivariate distribution functions.",
            "Approximation of functions by perceptrons: a new approach.",
            "An adaptive geometrical procedure for blind separation of sources.",
            "Hebb-Hopfield neural networks based on one-dimensional sets of neuron states.",
            "Use of some sensitivity criteria for choosing networks with good generalization ability.",
            "Iterative pruning in second-order recurrent neural networks.",
            "Establishment of topological maps - a model study.",
            "The BP-SOM architecture and learning rule.",
            "Feature detectors by autoencoders: Decomposition of input patterns into atomic features by neural networks.",
            "A silicon basis for synaptic plasticity.",
            "Bayesian invariant measurements of generalization."
        ]
    },
    {
        "name": "NPL",
        "year": "1994",
        "info": "1994: Volume 1",
        "count": 16,
        "papers": [
            "Editorial.",
            "Fast learning with incremental RBF networks.",
            "Fractal variation of attractors in complex-valued neural networks.",
            "Basic mechanisms of coding stimulus intensity in the olfactory sensory neuron.",
            "A way to improve an architecture of neural network classifier for remote sensing applications.",
            "Intelligent judge neural network for speech recognition.",
            "An on-line learning algorithm for the orthogonal weight estimation of MLP.",
            "Texture segmentation using pyramidal Gabor functions and self-organising feature maps.",
            "Book review.",
            "Good teaching inputs do not correspond to desired responses in ecological neural networks.",
            "Recurrent Sigma-Pi-linked back-propagation network.",
            "An evolutionary approach to associative memory in recurrent neural networks.",
            "Equivalence between some dynamical systems for optimization.",
            "VISOR: Schema-based scene analysis with structured neural networks.",
            "Nonlinear neural controller with neural Smith predictor.",
            "A neural method for geographical continuous field estimation."
        ]
    }
]