[
    {
        "name": "PAA",
        "year": "2022",
        "info": "Volume 25, 2022",
        "count": 14,
        "papers": [
            "Feature definition and comprehensive analysis on the robust identification of intraretinal cystoid regions using optical coherence tomography images.",
            "A dual encoder DAE neural network for imbalanced binary classification based on NSGA-III and GAN.",
            "Influence of heterogeneous edge weights on assortative mixing patterns in military personnel networks.",
            "Content authentication and tampering detection of Arabic text: an approach based on zero-watermarking and natural language processing.",
            "A new approach for H∞  deconvolution filtering of 2D systems described by the Fornasini-Marchesini and discrete moments.",
            "Extraction and reconstruction of a beetle forewing cross-section point set and its curvature characteristics.",
            "Grafted and vanishing random subspaces.",
            "Degraded document image preprocessing using local adaptive sharpening and illumination compensation.",
            "Maxmin distance sort heuristic-based initial centroid method of partitional clustering for big data mining.",
            "3D hand pose estimation from a single RGB image through semantic decomposition of VAE latent space.",
            "A novel fully parallel skeletonization algorithm.",
            "LineSeg: line segmentation of scanned newspaper documents.",
            "A multi-objective vibrating particle system algorithm for data clustering.",
            "Machine learning applied to emerald gemstone grading: framework proposal and creation of a public dataset."
        ]
    },
    {
        "name": "PAA",
        "year": "2021",
        "info": "Volume 24, 2021",
        "count": 125,
        "papers": [
            "Content-based image retrieval using feature weighting and C-means clustering in a multi-label classification framework.",
            "Deep kernel learning in extreme learning machines.",
            "Correction to: Deep kernel learning in extreme learning machines.",
            "Substep active deep learning framework for image classification.",
            "High-dimensional cluster boundary detection using directed Markov tree.",
            "Effectiveness of symmetric rejection for a secure and user convenient multistage biometric system.",
            "Ternary tree-based structural twin support tensor machine for clustering.",
            "Nonparametric \"anti-Bayesian\" quantile-based pattern classification.",
            "Gestalt descriptions for deep image understanding.",
            "Two-dimensional Subclass Discriminant Analysis for face recognition.",
            "Eccentricity based kinship verification from facial images in the wild.",
            "AFDL: a new adaptive fuzzy dictionary learning for medical image classification.",
            "Deep learning-based data augmentation method and signature verification system for offline handwritten signature.",
            "Seismicity analysis using space-time density peak clustering method.",
            "A new feature selection using dynamic interaction.",
            "Efficient integration of generative topic models into discriminative classifiers using robust probabilistic kernels.",
            "An efficient generic approach for automatic taxonomy generation using HMMs.",
            "PKM3: an optimal Markov model for predicting future navigation sequences of the web surfers.",
            "Learning latent hash codes with discriminative structure preserving for cross-modal retrieval.",
            "Component-based face recognition using statistical pattern matching analysis.",
            "Low-light enhancement based on an improved simplified Retinex model via fast illumination map refinement.",
            "Simultaneous identification of points and circles: structure from motion system in industry scenes.",
            "Deep learning-based effective fine-grained weather forecasting model.",
            "An efficient global representation constrained by Angular Triplet loss for vehicle re-identification.",
            "Spatio-temporal adversarial learning for detecting unseen falls.",
            "Wavelet domain majority coupled binary pattern: a new descriptor for texture classification.",
            "Special issue of PAAA devoted to CIARP 2019.",
            "Classification among healthy, mild cognitive impairment and Alzheimer's disease subjects based on wavelet entropy and relative beta and theta power.",
            "Multi-channel spectrograms for speech processing applications using deep learning methods.",
            "An ensemble of fingerprint matching algorithms based on cylinder codes and mtriplets for latent fingerprint identification.",
            "A convolutional oculomotor representation to model parkinsonian fixational patterns from magnified videos.",
            "Document scanners for minutiae-based palmprint recognition: a feasibility study.",
            "Second-order motion descriptors for efficient action recognition.",
            "Analysis of cancer in histological images: employing an approach based on genetic algorithm.",
            "Simple and efficient pose-based gait recognition method for challenging environments.",
            "Correction to: Simple and efficient pose-based gait recognition method for challenging environments.",
            "Face spoofing detection via ensemble of classifiers toward low-power devices.",
            "A Hermite polynomial algorithm for detection of lesions in lymphoma images.",
            "Deep Kernel machines: a survey.",
            "Representing and analyzing relief patterns using LBP variants on mesh manifold.",
            "Infrared and visible image fusion using modified spatial frequency-based clustered dictionary.",
            "A three-stage shearlet-based algorithm for vessel segmentation in medical imaging.",
            "IM-c-means: a new clustering algorithm for clusters with skewed distributions.",
            "AWkS: adaptive, weighted k-means-based superpixels for improved saliency detection.",
            "RFCL: A new under-sampling method of reducing the degree of imbalance and overlap.",
            "Forensic image analysis using inconsistent noise pattern.",
            "Image matching based on the adaptive redundant keypoint elimination method in the SIFT algorithm.",
            "A multi-class structured dictionary learning method using discriminant atom selection.",
            "OCR error correction using correction patterns and self-organizing migrating algorithm.",
            "The framework of learnable kernel function and its application to dictionary learning of SPD data.",
            "Neighborhood and center difference-based-LBP for face recognition.",
            "A scalable solution to the nearest neighbor search problem through local-search methods on neighbor graphs.",
            "CED-Net: context-aware ear detection network for unconstrained images.",
            "A note on \"New aggregation operators of single-valued neutrosophic hesitant fuzzy set and their application in multi-attribute decision making\".",
            "Adaptive weighted crowd receptive field network for crowd counting.",
            "Improving the accuracy of pruned network using knowledge distillation.",
            "Pedestrian tracking in thermal videos using TFM (tri-feature matrix).",
            "Space-time flexible kernel for recognizing activities from wearable cameras.",
            "Approaches on crowd counting and density estimation: a review.",
            "Tracklet style transfer and part-level feature description for person reidentification in a camera network.",
            "A rotation based regularization method for semi-supervised learning.",
            "Twin-image suppression in digital in-line holography based on wave-front filtering.",
            "Human activity recognition using robust adaptive privileged probabilistic learning.",
            "Unsupervised Change Detection Driven by Floating References: A Pattern Analysis Approach.",
            "A novel framework for rapid diagnosis of COVID-19 on computed tomography scans.",
            "Correction to a novel framework for rapid diagnosis of COVID-19 on computed tomography scans.",
            "BFCNet: a CNN for diagnosis of ductal carcinoma in breast from cytology images.",
            "Medical imaging technique using curvelet transform and machine learning for the automated diagnosis of breast cancer from thermal image.",
            "Coronavirus disease 2019 (COVID-19): survival analysis using deep learning and Cox regression model.",
            "A new approach for generation of generalized basic probability assignment in the evidence theory.",
            "Robust and effective multiple copy-move forgeries detection and localization.",
            "Adjacent LBP and LTP based background modeling with mixed-mode learning for foreground detection.",
            "Text classification based on the word subspace representation.",
            "HDG and HDGG: an extensible feature extraction descriptor for effective face and facial expressions recognition.",
            "Automatic COVID-19 detection from X-ray images using ensemble learning with convolutional neural network.",
            "Blocking sparse method for image denoising.",
            "A 2D and 3D discrete bisector function based on annulus.",
            "Customizable HMM-based measures to accurately compare tree sets.",
            "Real-time one-shot learning gesture recognition based on lightweight 3D Inception-ResNet with separable convolutions.",
            "Recognition of overlapping elliptical objects in a binary image.",
            "Automatic detection of coronavirus disease (COVID-19) using X-ray images and deep convolutional neural networks.",
            "SSD based on contour-material level for domain adaptation.",
            "A novel clustering algorithm by adaptively merging sub-clusters based on the Normal-neighbor and Merging force.",
            "Improved barnacles mating optimizer algorithm for feature selection and support vector machine optimization.",
            "Target re-aware deep tracking based on correlation filters updated online.",
            "Fuzzy kernel K-medoids clustering algorithm for uncertain data objects.",
            "Chaotic sequence and opposition learning guided approach for data clustering.",
            "Learning occlusion-aware view synthesis for light fields.",
            "Advanced skeleton-based action recognition via spatial-temporal rotation descriptors.",
            "An improved small object detection method based on Yolo V3.",
            "An approach to improve SSD through mask prediction of multi-scale feature maps.",
            "Ridgelet moment invariants for robust pattern recognition.",
            "A study on intelligent diagnosis model of shortwave receiving system based on improved KFCM and LapSVM.",
            "A hybrid reciprocal model of PCA and K-means with an innovative approach of considering sub-datasets for the improvement of K-means initialization and step-by-step labeling to create clusters with high interpretability.",
            "Analysing the patterns of spatial contrast discontinuities in natural images for robust edge detection.",
            "A real-time two-stage and dual-check template matching algorithm based on normalized cross-correlation for industrial vision positioning.",
            "A new method of hybrid time window embedding with transformer-based traffic data classification in IoT-networked environment.",
            "Savitzky-Golay filter energy features-based approach to face recognition using symbolic modeling.",
            "Testing the randomness of shares in color visual cryptography.",
            "Assessing task understanding in remote ultrasound diagnosis via gesture analysis.",
            "Hybrid domain adaptation for sensor-based human activity recognition in a heterogeneous setup with feature commonalities.",
            "Domain adaption based on source dictionary regularized RKHS subspace learning.",
            "Chinese font migration combining local and global features learning.",
            "DroneRTEF: development of a novel adaptive framework for railroad track extraction in drone images.",
            "Enhancing performance and user convenience of multi-biometric verification systems.",
            "Multiple circle detection in images: a simple evolutionary algorithm approach and a new benchmark of images.",
            "Clustering and classification with inertia weight and elitism-based particle swarm optimization.",
            "Iterative feature refinement with network-driven prior for image restoration.",
            "Vehicle object detection method based on candidate region aggregation.",
            "On measuring and employing texture directionality for image classification.",
            "HSIC-based affinity measure for learning on graphs.",
            "Superpixel/voxel medical image segmentation algorithm based on the regional interlinked value.",
            "Unrestricted deep metric learning using neural networks interaction.",
            "Dimensionality reduction based on multi-local linear regression and global subspace projection distance minimum.",
            "Batch and online variational learning of hierarchical Dirichlet process mixtures of multivariate Beta distributions in medical applications.",
            "TRFH: towards real-time face detection and head pose estimation.",
            "ChoiceNet: CNN learning through choice of multiple feature map representations.",
            "Video-based person re-identification by semi-supervised adaptive stepwise learning.",
            "Depth and edge auxiliary learning for still image crowd density estimation.",
            "Multi-resolution dictionary collaborative representation for face recognition.",
            "Outlier removal in biomaterial image segmentations using a non-stationary Bayesian learning.",
            "KAGO: an approximate adaptive grid-based outlier detection approach using kernel density estimate.",
            "A robust method for image stitching.",
            "Proposing a new local density estimation outlier detection algorithm: an empirical case study on flow pattern experiments.",
            "Correction to: Outlier removal in biomaterial image segmentations using a non-stationary Bayesian learning."
        ]
    },
    {
        "name": "PAA",
        "year": "2020",
        "info": "Volume 23, 2020",
        "count": 112,
        "papers": [
            "Locality preserving projection least squares twin support vector machine for pattern classification.",
            "Recognition of mixture control chart patterns based on fusion feature reduction and fireworks algorithm-optimized MSVM.",
            "Using semantic context for multiple concepts detection in still images.",
            "Design of a frequency spectrum-based versatile two-dimensional arbitrary shape filter bank: application to contact lens detection.",
            "Automatic computing of number of clusters for color image segmentation employing fuzzy c-means by extracting chromaticity features of colors.",
            "An image segmentation method based on Mumford-Shah model with mask factor and neighborhood factor.",
            "Towards instance-dependent label noise-tolerant classification: a probabilistic approach.",
            "Rare association rule mining from incremental databases.",
            "Iterative scheme-inspired network for impulse noise removal.",
            "Understanding temporal structure for video captioning.",
            "A recursive partitioning approach for subgroup identification in brain-behaviour correlation analysis.",
            "Enhancement of speech signal using diminished empirical mean curve decomposition-based adaptive Wiener filtering.",
            "A novel nearest interest point classifier for offline Tamil handwritten character recognition.",
            "Hybrid minutiae and edge corners feature points for increased fingerprint recognition performance.",
            "Tracking of multiple quantiles in dynamically varying data streams.",
            "Deep learned Inter-Channel Colored Texture Pattern: a new chromatic-texture descriptor.",
            "Weighted feature-task-aware regularization learner for multitask learning.",
            "Video spatiotemporal mapping for human action recognition by convolutional neural network.",
            "Human action recognition: a framework of statistical weighted segmentation and rank correlation-based selection.",
            "ML-SLSTSVM: a new structural least square twin support vector machine for multi-label learning.",
            "Face detection based on evolutionary Haar filter.",
            "Automatic grayscale image segmentation based on Affinity Propagation clustering.",
            "Correlation maximization machine for multi-modalities multiclass classification.",
            "Entropy-based multi-view matrix completion for clustering with side information.",
            "A novel high-performance holistic descriptor for face retrieval.",
            "RTS-ELM: an approach for saliency-directed image segmentation with ripplet transform.",
            "Real-time and robust multiple-view gender classification using gait features in video surveillance.",
            "Single-shot 3D hand pose estimation using radial basis function networks trained on synthetic data.",
            "Pore-based indexing for fingerprints acquired using high-resolution sensors.",
            "Adaptive graph-regularized fixed rank representation for subspace segmentation.",
            "Effect of cluster size distribution on clustering: a comparative study of k-means and fuzzy c-means clustering.",
            "Filter-based feature selection in the context of evolutionary neural networks in supervised machine learning.",
            "Multi-task non-negative matrix factorization for visual object tracking.",
            "On enhancing the deadlock-preventing object migration automaton using the pursuit paradigm.",
            "Performance evaluation of psycho-acoustically motivated front-end compensator for TIMIT phone recognition.",
            "DBSCAN-like clustering method for various data densities.",
            "Smooth estimates of multiple quantiles in dynamically varying data streams.",
            "Confidence-based early classification of multivariate time series with multiple interpretable rules.",
            "A novel 3D dual active contours approach.",
            "Segmentation-free word spotting in historical Bangla handwritten document using Wave Kernel Signature.",
            "Violence detection in videos for an intelligent surveillance system using MoBSIFT and movement filtering algorithm.",
            "Segmentation of scanning tunneling microscopy images using variational methods and empirical wavelets.",
            "A robust tangent PCA via shape restoration for shape variability analysis.",
            "PCAPooL: unsupervised feature learning for face recognition using PCA, LBP, and pyramid pooling.",
            "Color image segmentation using proximal classifier and quaternion radial harmonic Fourier moments.",
            "A novel feature descriptor for image retrieval by combining modified color histogram and diagonally symmetric co-occurrence texture pattern.",
            "CHSPAM: a multi-domain model for sequential pattern discovery and monitoring in contexts histories.",
            "Locality preserving difference component analysis based on the Lq norm.",
            "Pedestrian detection using multiple feature channels and contour cues with census transform histogram and random forest classifier.",
            "Evaluating dynamic texture descriptors to recognize human iris in video image sequence.",
            "The modified generic polar harmonic transforms for image representation.",
            "Local gradient of gradient pattern: a robust image descriptor for the classification of brain strokes from computed tomography images.",
            "Fractal dimension of synthesized and natural color images in Lab space.",
            "A novel CT image segmentation algorithm using PCNN and Sobolev gradient methods in GPU frameworks.",
            "Local tangent space alignment based on Hilbert-Schmidt independence criterion regularization.",
            "Text area segmentation from document images by novel adaptive thresholding and template matching using texture cues.",
            "A novel contextual memory algorithm for edge detection.",
            "Parallel cycle-based branch-and-bound method for Bayesian network learning.",
            "Finding patterns in the degree distribution of real-world complex networks: going beyond power law.",
            "Synchronization correction-based robust digital image watermarking approach using Bessel K-form PDF.",
            "An automatic multi-camera-based event extraction system for real soccer videos.",
            "Manifold ranking graph regularization non-negative matrix factorization with global and local structures.",
            "BISDBx: towards batch-incremental clustering for dynamic datasets using SNN-DBSCAN.",
            "A Chinese unknown word recognition method for micro-blog short text based on improved FP-growth.",
            "Optimal face templates: the next step in surveillance face recognition.",
            "Correction to: Optimal face templates: the next step in surveillance face recognition.",
            "Improved quality assessment of colour surfaces for additive manufacturing based on image entropy.",
            "Novel clustering-based pruning algorithms.",
            "Analysing the intermeshed patterns of road transportation and macroeconomic indicators through neural and clustering techniques.",
            "Scene classification using a new radial basis function classifier and integrated SIFT-LBP features.",
            "A new multi-view learning machine with incomplete data.",
            "Encoding features from multi-layer Gabor filtering for visual smoke recognition.",
            "An empirical comparison of random forest-based and other learning-to-rank algorithms.",
            "Classifying imbalanced data using BalanceCascade-based kernelized extreme learning machine.",
            "Instance-based entropy fuzzy support vector machine for imbalanced data.",
            "Similarity measures of picture fuzzy sets based on entropy and their application in MCDM.",
            "Ensemble Adaptation Networks with low-cost unsupervised hyper-parameter search.",
            "Transductive multi-label learning from missing data using smoothed rank function.",
            "Distributed Learning Automata-based S-learning scheme for classification.",
            "An over-regression suppression method to discriminate occluded objects of same category.",
            "Densely connected network for impulse noise removal.",
            "Adaptive detection of FOREX repetitive chart patterns.",
            "A sparse linear regression model for incomplete datasets.",
            "A novel approach for scene text extraction from synthesized hazy natural images.",
            "Learning CNN features from DE features for EEG-based emotion recognition.",
            "Robust hand gesture recognition system based on a new set of quaternion Tchebichef moment invariants.",
            "Segmentation of handwritten words using structured support vector machine.",
            "Learning multi-scale features for foreground segmentation.",
            "Learning a representation with the block-diagonal structure for pattern classification.",
            "Leveraging deep learning with symbolic sequences for robust head poses estimation.",
            "Separable property-based super-resolution of lousy image data.",
            "Learning discriminative hashing codes for cross-modal retrieval based on multi-view features.",
            "Robust object tracking with crow search optimized multi-cue particle filter.",
            "Customs fraud detection.",
            "Finite point sets in recognizing location and orientation of machine parts of complex shapes.",
            "PathQuery Pregel: high-performance graph query with bulk synchronous processing.",
            "Local binary pattern-based on-road vehicle detection in urban traffic scene.",
            "Incremental one-class classifier based on convex-concave hull.",
            "Accurate quaternion radial harmonic Fourier moments for color image reconstruction and object recognition.",
            "Retrieval of colour and texture images using local directional peak valley binary pattern.",
            "Multi-view region-adaptive multi-temporal DMM and RGB action recognition.",
            "Supervised and semi-supervised twin parametric-margin regularized extreme learning machine.",
            "Automatic plagiarism detection in obfuscated text.",
            "ASCRClu: an adaptive subspace combination and reduction algorithm for clustering of high-dimensional data.",
            "Unsupervised visual domain adaptation via discriminative dictionary evolution.",
            "Margin setting algorithm for pattern classification via spheres.",
            "Cost-sensitive sample shifting in feature space.",
            "An instance and variable selection approach in pixel-based classification for automatic white blood cells segmentation.",
            "TimeFly algorithm: a novel behavior-inspired movie recommendation paradigm.",
            "Face anti-spoofing by identity masking using random walk patterns and outlier detection.",
            "ETIP: a lengthy nested NER problem for Chinese insurance policy analysis.",
            "Extraction and prioritization of product attributes using an explainable neural network."
        ]
    },
    {
        "name": "PAA",
        "year": "2019",
        "info": "Volume 22, 2019",
        "count": 110,
        "papers": [
            "Gabor filter-based texture for ancient degraded document image binarization.",
            "Probabilistic multi-word spotting in handwritten text images.",
            "Depth estimation improvement in 3D integral imaging using an edge removal approach.",
            "Independent component analysis for a low-channel SSVEP-BCI.",
            "A nonparametric Bayesian learning model using accelerated variational inference and feature selection.",
            "An image thresholding approach based on Gaussian mixture model.",
            "Fractal dimension of bag-of-visual words.",
            "Hybrid one-class classifier ensemble based on fuzzy integral for open-lexicon handwritten Arabic word recognition.",
            "Boosted Test-FDA: a transductive boosting method.",
            "A comprehensive study of clustering ensemble weighting based on cluster quality and diversity.",
            "Object recognition based on critical nodes.",
            "Sparse subspace clustering via nonconvex approximation.",
            "DSD: document sparse-based denoising algorithm.",
            "A deep neural network and rule-based technique for fire risk identification in video frames.",
            "Optimal steganography with blind detection based on Bayesian optimization algorithm.",
            "Document representation based on probabilistic word clustering in customer-voice classification.",
            "An online overlaid handwritten Japanese text recognition system for small tablet.",
            "A new method for image encryption by 3D chaotic map.",
            "Markov random fields and facial landmarks for handling uncontrolled images of face sketch synthesis.",
            "Nonlinear sharpening of MR images using a locally adaptive sharpness gain and a noise reduction parameter.",
            "A novel ICA-based clustering algorithm for heart arrhythmia diagnosis.",
            "Exploiting the value of class labels on high-dimensional feature spaces: topic models for semi-supervised document classification.",
            "Automatic hand motion analysis for the sign language space management.",
            "Color image segmentation by combining the convex active contour and the Chan Vese model.",
            "Fault detection and identification using combination of EKF and neuro-fuzzy network applied to a chemical process (CSTR).",
            "A cascading scheme for speeding up multiple classifier systems.",
            "An approximated decision-theoretic algorithm for minimization of the Tversky loss under the multi-label framework.",
            "New aggregation operators of single-valued neutrosophic hesitant fuzzy set and their application in multi-attribute decision making.",
            "Intuitionistic fuzzy similarity measures based on min-max operators.",
            "Local appearance modeling for objects class recognition.",
            "Weight-based canonical sparse cross-view correlation analysis.",
            "Region-based facial representation for real-time Action Units intensity detection across datasets.",
            "Adaptive three-phase support vector data description.",
            "Sparse multilinear Laplacian discriminant analysis for gait recognition.",
            "Implications of the curse of dimensionality for supervised learning classifier systems: theoretical and empirical analyses.",
            "A new F-score gradient-based training rule for the linear model.",
            "Blind image deblurring via gradient orientation-based clustered coupled sparse dictionaries.",
            "Optimized feature selection-based clustering approach for computer-aided detection of lung nodules in different modalities.",
            "SVM with a neutral class.",
            "Boosting sensitivity of a retinal vessel segmentation algorithm.",
            "Efficient health-related abnormal behavior detection with visual and inertial sensor integration.",
            "An approach of feature selection using graph-theoretic heuristic and hill climbing.",
            "Recommendation algorithm based on improved spectral clustering and transfer learning.",
            "DK-means: a deterministic K-means clustering algorithm for gene expression analysis.",
            "Paraphrase plagiarism identification with character-level features.",
            "FAMOS: a framework for investigating the use of face features to identify spontaneous emotions.",
            "Improving optimum-path forest learning using bag-of-classifiers and confidence measures.",
            "Non-deterministic approach to allay replay attack on iris biometric.",
            "Synthetic aperture radar river image segmentation using improved localizing region-based active contour model.",
            "Development of fitted line and fitted cosine curve for recognition and analysis of unnatural patterns in process control charts.",
            "A review of retinal blood vessels extraction techniques: challenges, taxonomy, and future trends.",
            "Feature subset selection for classification of malignant and benign breast masses in digital mammography.",
            "Outlier trajectory detection through a context-aware distance.",
            "Touchless typing with head movements captured in thermal spectrum.",
            "Feature selection via Lèvy Antlion optimization.",
            "Bag of recurrence patterns representation for time-series classification.",
            "SIFT-based iris recognition revisited: prerequisites, advantages and improvements.",
            "Intuitionistic fuzzy linguistic clustering algorithm based on a new correlation coefficient for intuitionistic fuzzy linguistic information.",
            "Unifying the skeletonization methods via modifying images.",
            "Incorporating rotational invariance in convolutional neural network architecture.",
            "Online streaming feature selection: a minimum redundancy, maximum significance approach.",
            "MAP-based image denoising with structured sparsity and Gaussian scale mixture.",
            "A bi-objective hybrid algorithm for the classification of imbalanced noisy and borderline data sets.",
            "Unsupervised feature selection in linked biological data.",
            "BorderShift: toward optimal MeanShift vector for cluster boundary detection in high-dimensional data.",
            "Multi-label classification by polytree-augmented classifier chains with label-dependent features.",
            "An active learning algorithm for multi-class classification.",
            "Fuzzy chromatic co-occurrence matrices for tracking objects.",
            "An accurate HMM-based similarity measure between finite sets of histograms.",
            "Invariant color images representation using accurate quaternion Legendre-Fourier moments.",
            "Extracting closed object contour in the image: remove, connect and fit.",
            "Local support-based partition algorithm for frequent pattern mining.",
            "A linear unsupervised transfer learning by preservation of cluster-and-neighborhood data organization.",
            "Epileptic seizure detection using fuzzy-rules-based sub-band specific features and layered multi-class SVM.",
            "A generalized multi-scale line-detection method to boost retinal vessel segmentation sensitivity.",
            "Feature extraction in palmprint recognition using spiral of moment skewness and kurtosis algorithm.",
            "Commentary on \"New aggregation operators of single-valued neutrosophic hesitant fuzzy set and their application in multi-attribute decision making\".",
            "Error-space representations for multi-dimensional data streams with temporal dependence.",
            "Training neural networks on high-dimensional data using random projection.",
            "Local curve pattern for content-based image retrieval.",
            "3D object recognition and classification: a systematic literature review.",
            "Discriminative ridge regression algorithm for adaptation in statistical machine translation.",
            "Human action recognition in videos with articulated pose information by deep networks.",
            "User-aware dialogue management policies over attributed bi-automata.",
            "Micro-expression recognition based on 3D flow convolutional neural network.",
            "Robust vectorization method for electrical circuit drawings using component morphology.",
            "A novel method for binarization of scene text images and its application in text identification.",
            "An implementation of optimized framework for action classification using multilayers neural network on selected fused features.",
            "Wavelet-like selective representations of multidirectional structures: a mammography case.",
            "Online updating of active function cross-entropy clustering.",
            "Metric-learning-based high-discriminative local features extraction for iris recognition.",
            "Combined Hu moments, orientation knowledge, and grid intersections feature based identification of Bharatanatyam mudra images.",
            "Relevant feature selection in the context of painting classification.",
            "Pedestrian gender classification using combined global and local parts-based convolutional neural networks.",
            "L1-norm orthogonal neighbourhood preserving projection and its applications.",
            "CNN-based gender classification in near-infrared periocular images.",
            "A hybrid cascade method for EEG classification.",
            "A novel binary feature descriptor to discriminate normal and abnormal chest CT images using dissimilarity measures.",
            "Sparsity augmented discriminative sparse representation for face recognition.",
            "Robust palm and knuckle ROI extraction in unconstrained environment.",
            "3D unsupervised modified spatial fuzzy c-means method for segmentation of 3D brain MR image.",
            "Hybrid hidden Markov models and artificial neural networks for handwritten music recognition in mensural notation.",
            "Multi-channel local ternary pattern for content-based image retrieval.",
            "Applying adversarial auto-encoder for estimating human walking gait abnormality index.",
            "Neuro-probabilistic model for object tracking.",
            "Gait-based person re-identification under covariate factors.",
            "Contour recognition of roadheader cutting head based on shape matching.",
            "RACMF: robust attention convolutional matrix factorization for rating prediction.",
            "Evaluation of different chrominance models in the detection and reconstruction of faces and hands using the growing neural gas network.",
            "Correction to: Weighted feature-task-aware regularization learner for multitask learning."
        ]
    },
    {
        "name": "PAA",
        "year": "2018",
        "info": "Volume 21, 2018",
        "count": 80,
        "papers": [
            "An empirical evaluation of translational and rotational invariance of descriptors and the classification of flower dataset.",
            "Partial fingerprint identification for large databases.",
            "An efficient fundamental matrix estimation method for wide baseline images.",
            "Blur robust extremal region-based interest points for medical image registration.",
            "A new feature subset selection using bottom-up clustering.",
            "A fast BP networks with dynamic sample selection for handwritten recognition.",
            "Emotion recognition from EEG signals by using multivariate empirical mode decomposition.",
            "Fusion of eye movement and mouse dynamics for reliable behavioral biometrics.",
            "Task sensitivity in EEG biometric recognition.",
            "The joint use of sequence features combination and modified weighted SVM for improving daily activity recognition.",
            "VPVC: verifiable progressive visual cryptography.",
            "Evidence combination based on credibility and non-specificity.",
            "Estimating number of components in Gaussian mixture model using combination of greedy and merging algorithm.",
            "A feature selection-based speaker clustering method for paralinguistic tasks.",
            "Segmentation of colon and removal of opacified fluid for virtual colonoscopy.",
            "EDTriangles: a high-speed triangle detection algorithm with a false detection control.",
            "A text representation model using Sequential Pattern-Growth method.",
            "Efficient visual code localization with neural networks.",
            "Generalized Gabor filters for palmprint recognition.",
            "An efficient similarity measure approach for PCB surface defect detection.",
            "State of the art in passive digital image forgery detection: copy-move image forgery.",
            "Obtaining calibrated probability using ROC Binning.",
            "An algorithm on sign words extraction and recognition of continuous Persian sign language based on motion and shape features of hands.",
            "Recursive reconstruction of non-facial components using support vector data description.",
            "Dedicated feature descriptor for outdoor augmented reality detection.",
            "A sequential pattern mining approach to design taxonomies for hierarchical music genre recognition.",
            "Dealing with overlap and imbalance: a new metric and approach.",
            "Multi-algorithmic cancelable fingerprint template generation based on weighted sum rule and T-operators.",
            "Unconstrained handwritten digit recognition using perceptual shape primitives.",
            "Gaze stability for liveness detection.",
            "Robust copy-move forgery detection using quaternion exponent moments.",
            "Content-based image retrieval in DCT compressed domain with MPEG-7 edge descriptor and genetic algorithm.",
            "Automatic initialization of active contours in ultrasound images of breast cancer.",
            "Nonnegative matrix factorization with Hessian regularizer.",
            "A novel selection of optimal statistical features in the DWPT domain for discrimination of ictal and seizure-free electroencephalography signals.",
            "Facial beauty analysis based on features prediction and beautification models.",
            "Performing event detection in time series with SwiftEvent: an algorithm with supervised learning of detection criteria.",
            "Precise segmentation of the bulbar conjunctiva for hyperaemia images.",
            "Reservoir-based network traffic stream summarization for anomaly detection.",
            "Automatic identification of Scenedesmus polymorphic microalgae from microscopic images.",
            "A novel active contour model driven by J-divergence entropy for SAR river image segmentation.",
            "A deep learning approach for the forensic evaluation of sexual assault.",
            "BMOG: boosted Gaussian Mixture Model with controlled complexity for background subtraction.",
            "Analysis of single- and dual-dictionary strategies in pedestrian classification.",
            "Statistical moments calculated via integral images in application to landmine detection from Ground Penetrating Radar 3D scans.",
            "A new linear discriminant analysis algorithm based on L1-norm maximization and locality preserving projection.",
            "Scalability of correlation clustering.",
            "Deep kernel learning in core vector machines.",
            "Kernelized inner product-based discriminant analysis for interval data.",
            "A novel ensemble decision tree based on under-sampling and clonal selection for web spam detection.",
            "Matrix-based subspace analysis with the general norm for image feature extraction.",
            "A study on vulnerability and presentation attack detection in palmprint verification system.",
            "A multi-biometric iris recognition system based on a deep learning approach.",
            "Adaptive fuzzy c-means clustering algorithm for interval data type based on interval-dividing technique.",
            "A semi-supervised domain adaptation assembling approach for image classification.",
            "Unsupervised detection of ruptures in spatial relationships in video sequences based on log-likelihood ratio.",
            "Distance metric learning-based kernel gram matrix learning for pattern analysis tasks in kernel feature space.",
            "Accurate image segmentation using Gaussian mixture model with saliency map.",
            "On the definition of shape parts: a dominant sets approach.",
            "Correction to: Detection and classification of vehicles from omnidirectional videos using multiple silhouettes.",
            "A comprehensive survey on word recognition for non-Indic and Indic scripts.",
            "Binary ranking for ordinal class imbalance.",
            "A regression model based on the nearest centroid neighborhood.",
            "Batch-based activity recognition from egocentric photo-streams revisited.",
            "A time-varying quadratic programming for online clustering of streaming data.",
            "Co-occurrence pattern mining based on a biological approximation scoring matrix.",
            "Digital watermarking using Hall property image decomposition method.",
            "Image denoising with norm weighted fusion estimators.",
            "A fast classification strategy for SVM on the large-scale high-dimensional datasets.",
            "A thresholding method based on interval-valued intuitionistic fuzzy sets: an application to image segmentation.",
            "Constant-time monocular object detection using scene geometry.",
            "Dynamic protein-protein interaction networks construction using firefly algorithm.",
            "A method for liver segmentation in perfusion MR images using probabilistic atlases and viscous reconstruction.",
            "Isolated structural error analysis of printed mathematical expressions.",
            "Content-based computational chromatic adaptation.",
            "Gene clustering with hidden Markov model optimized by PSO algorithm.",
            "Texture synthesis and modified filter bank in contourlets for improved iris recognition.",
            "An efficient edge extraction approach for flame image analysis.",
            "Multi-pattern matching with variable-length wildcards using suffix tree.",
            "Pattern matching for industrial object recognition using geometry-based vector mapping descriptors."
        ]
    },
    {
        "name": "PAA",
        "year": "2017",
        "info": "Volume 20, 2017",
        "count": 85,
        "papers": [
            "Improving a firefly meta-heuristic for multilevel image segmentation using Tsallis entropy.",
            "Cluster validity index based on Jeffrey divergence.",
            "MOPG: a multi-objective evolutionary algorithm for prototype generation.",
            "A new run-based algorithm for Euler number computing.",
            "Multivariate fuzzy k-modes algorithm.",
            "An aperiodic feature representation for gait recognition in cross-view scenarios for unconstrained biometrics.",
            "Machine learning-based tools to model and to remove the off-target effect.",
            "Image preprocessing method based on local approximation gradient with application to face recognition.",
            "Multiscale binarised statistical image features for symmetric face matching using multiple descriptor fusion based on class-specific LDA.",
            "Robust eye centers localization with zero-crossing encoded image projections.",
            "Quadratic filter for the enhancement of edges in retinal images for the efficient detection and localization of diabetic retinopathy.",
            "Principal motion components for one-shot gesture recognition.",
            "A fast and noise resilient cluster-based anomaly detection.",
            "Correspondence consensus of two sets of correspondences through optimisation functions.",
            "A new similarity measure between intuitionistic fuzzy sets and the positive definiteness of the similarity matrix.",
            "Supervised image segmentation using Q-Shift Dual-Tree Complex Wavelet Transform coefficients with a texton approach.",
            "Phase portrait analysis for automatic initialization of multiple snakes for segmentation of the ultrasound images of breast cancer.",
            "Fingerprint reference point identification based on chain encoded discrete curvature and bending energy.",
            "Beyond social graphs: mining patterns underlying social interactions.",
            "Bi-level programming modeling and hierarchical hybrid algorithm for antimissile dynamic firepower allocation problem with uncertain environment.",
            "Segmentation and recognition system for unknown-length handwritten digit strings.",
            "A texture-based pixel labeling approach for historical books.",
            "A biologically inspired framework for contour detection.",
            "Extreme entropy machines: robust information theoretic classification.",
            "A learning-based colour image segmentation with extended and compact structural tensor feature representation.",
            "Locally adaptive k parameter selection for nearest neighbor classifier: one nearest cluster.",
            "Selecting locally specialised classifiers for one-class classification ensembles.",
            "MoNGEL: monotonic nested generalized exemplar learning.",
            "A sparse neighborhood preserving non-negative tensor factorization algorithm for facial expression recognition.",
            "High-dimensional image data feature extraction by double discriminant embedding.",
            "A multiple attributes convolution kernel with reproducing property.",
            "Spectral clustering based on similarity and dissimilarity criterion.",
            "Adaptive vectorial lifting concept for convolutive blind source separation.",
            "Detecting and quantifying extended landscape structure with spatial co-occurrence surfaces.",
            "Hyperspectral anomaly detection based on constrained eigenvalue-eigenvector model.",
            "An affine subspace clustering algorithm based on ridge regression.",
            "Early diagnosis of breast cancer by gene expression profiles.",
            "Anisotropic diffusion equation with a new diffusion coefficient for image denoising.",
            "Tied factors analysis for high-dimensional image feature extraction and recognition application.",
            "RLC: ranking lag correlations with flexible sliding windows in data streams.",
            "State-of-the-art in visual geo-localization.",
            "Adaptive binarization method for degraded document images based on surface contrast variation.",
            "Discriminant error correcting output codes based on spectral clustering.",
            "A new feature selection approach based on ensemble methods in semi-supervised classification.",
            "A new validity index for crisp clusters.",
            "A novel supervised cluster adjustment method using a fast exact nearest neighbor search algorithm.",
            "Class-specific image representation for image classification using multiple scale-invariant region detectors.",
            "Global and local scatter based semi-supervised dimensionality reduction with active constraints selection in ensemble subspaces.",
            "KPCA method based on within-class auxiliary training samples and its application to pattern classification.",
            "Decision tree induction based on minority entropy for the class imbalance problem.",
            "Approximation of fruit skin patterns using spherical Voronoi diagrams.",
            "The design of absorbing Bayesian pursuit algorithms and the formal analyses of their ε-optimality.",
            "Nonlinear regression applied to interval-valued data.",
            "Chain coding representation of voxel-based objects with enclosing, edging and intersecting trees.",
            "A stochastic framework for K-SVD with applications on face recognition.",
            "Fuzzy-based algorithm for Fongbe continuous speech segmentation.",
            "On image search result aggregation.",
            "Brain tumor classification from multi-modality MRI using wavelets and machine learning.",
            "Reliable prediction of anti-diabetic drug failure using a reject option.",
            "Detection and classification of vehicles from omnidirectional videos using multiple silhouettes.",
            "Fusion of thermal infrared and visible spectra for robust moving object detection.",
            "Computerised approaches for the detection of diabetic retinopathy using retinal fundus images: a survey.",
            "Robust partial fingerprint recognition using wavelet SIFT descriptors.",
            "The deterministic subspace method for constructing classifier ensembles.",
            "A framework to induce more stable decision trees for pattern classification.",
            "A proposal for touching component segmentation in Arabic manuscripts.",
            "Detecting anomalous patterns in time-series data using sparse hierarchically parameterized transition matrices.",
            "Robust embedded projective nonnegative matrix factorization for image analysis and feature extraction.",
            "Object recognition in noisy RGB-D data using GNG.",
            "υ-Support vector machine based on discriminant sparse neighborhood preserving embedding.",
            "Double-fold localized multiple matrix learning machine with Universum.",
            "Enhancing fractal image compression speed using local features for reducing search space.",
            "Numbering with spiral pattern to prove authenticity and integrity in medical images.",
            "A comparative study of the performance of local feature-based pattern recognition algorithms.",
            "A texture-based approach for word script and nature identification.",
            "A clustered locally linear approach on face manifolds for pose estimation.",
            "Combining discriminative spatiotemporal features for daily life activity recognition using wearable motion sensing suit.",
            "Car make and model recognition under limited lighting conditions at night.",
            "Synergies between texture features: an abstract feature based framework for meningioma subtypes classification.",
            "Overlapping area hyperspheres for kernel-based similarity method.",
            "A new descriptor for image matching based on bionic principles.",
            "Biharmonic density estimate: a scale-space descriptor for 3-D deformable surfaces.",
            "Arabic document layout analysis.",
            "New dissimilarity measures for image phylogeny reconstruction.",
            "An automatic decision approach to coal-rock recognition in top coal caving based on MF-Score."
        ]
    },
    {
        "name": "PAA",
        "year": "2016",
        "info": "Volume 19, 2016",
        "count": 81,
        "papers": [
            "Tree-based binary image dissimilarity measure with meta-heuristic optimization.",
            "Entropy and similarity measure of Atanassov's intuitionistic fuzzy sets and their application to pattern recognition based on fuzzy measures.",
            "Histogram-based embedding for learning on statistical manifolds.",
            "An empirical comparison of V-fold penalisation and cross-validation for model selection in distribution-free regression.",
            "Inexact matching of structural models based on the duality of patterns and classifiers.",
            "Improved nuisance attribute projection for face recognition.",
            "A theoretical investigation of feature partitioning principal component analysis methods.",
            "RHC: a non-parametric cluster-based data reduction for efficient k-NN classification.",
            "A non-parametric symbolic approximate representation for long time series.",
            "Experimenting multiresolution analysis for identifying regions of different classification complexity.",
            "Voiced/non-voiced speech classification using adaptive thresholding with bivariate EMD.",
            "Editing training data for multi-label classification with the k-nearest neighbor rule.",
            "Hierarchical error-correcting output codes based on SVDD.",
            "A Hybrid Mobility Prediction (HMP) strategy for PCS networks.",
            "Odor recognition in robotics applications by discriminative time-series modeling.",
            "Random forest-based scheme using feature and decision levels information for multi-focus image fusion.",
            "A 5 degrees of freedom multi-user pointing device for interactive whiteboards.",
            "VibePhone: efficient surface recognition for smartphones using vibration.",
            "Recognizing human interactions by genetic algorithm-based random forest spatio-temporal correlation.",
            "Texture code matrix-based multi-instance iris recognition.",
            "Hyperspectral anomaly detection based on uniformly partitioned pixel.",
            "An efficient algorithm for large-scale quasi-supervised learning.",
            "Fuzzy linguistic induced OWA Minkowski distance operator and its application in group decision making.",
            "On-line deep learning method for action recognition.",
            "Recursive partitioning clustering tree algorithm.",
            "Term frequency combined hybrid feature selection method for spam filtering.",
            "A local and global classification machine with collaborative mechanism.",
            "An investigation of implicit features in compression-based learning for comparing webpages.",
            "Arabic character recognition using a Haar cascade classifier approach (HCC).",
            "A texture image denoising approach based on fractional developmental mathematics.",
            "Unsupervised joint face alignment with gradient correlation coefficient.",
            "Online identification of appliances from power consumption data collected by smart meters.",
            "Approximate variational inference based on a finite sample of Gaussian latent variables.",
            "Frequency analysis of a bumblebee (Bombus impatiens) wingbeat.",
            "Acquisition of Turkish meronym based on classification of patterns.",
            "On size invariance texture image retrieval by fuzzy logic classifier and scattering statistical features.",
            "Periocular recognition: how much facial expressions affect performance?",
            "Environmental microbiology aided by content-based image analysis.",
            "Using latent features for short-term person re-identification with RGB-D cameras.",
            "Efficient 2D viewpoint combination for human action recognition.",
            "Automated hippocampal segmentation in 3D MRI using random undersampling with boosting algorithm.",
            "Scribble-based object segmentation with modified gaussian mixture models.",
            "An auxiliary gaze point estimation method based on facial normal.",
            "Hyperplane arrangements for the fast matching and classification of visual landmarks.",
            "SWGMM: a semi-wrapped Gaussian mixture model for clustering of circular-linear data.",
            "Cross-document word matching for segmentation and retrieval of Ottoman divans.",
            "Scale-space module detection for random fields observed on a graph non-embedded in a metric space.",
            "Event Pattern Analysis and Prediction at Sentence Level using Neuro-Fuzzy Model for Crime Event Detection.",
            "Novel geometric features for off-line writer identification.",
            "Ball detection in soccer images using isophote's curvature and discriminative features.",
            "Discriminative sequential association latent dirichlet allocation for visual recognition.",
            "Emerging opinion leaders in crowd unfollow crisis: a case study of mobile brands in Twitter.",
            "Two density-based k-means initialization algorithms for non-metric data clustering.",
            "Statistical shape modelling for expression-invariant face analysis and recognition.",
            "Statistical background model-based target detection.",
            "Hidden Markov models for gene sequence classification - Classifying the VSG gene in the Trypanosoma brucei genome.",
            "Data visualization via latent variables and mixture models: a brief survey.",
            "COLOR CHILD: a novel color image local descriptor for texture classification and segmentation.",
            "Approaching the accuracy-cost conflict in embedded classification system design.",
            "A multi-attribute probabilistic matrix factorization model for personalized recommendation.",
            "Explicit and implicit employment of edge-related information in super-resolving distant faces for recognition.",
            "A multi-scale seriation algorithm for clustering sparse imbalanced data: application to spike sorting.",
            "Hierarchical and multi-featured fusion for effective gait recognition under variable scenarios.",
            "Fuzzy clustering with learnable cluster-dependent kernels.",
            "Simplified parameters model of PCNN and its application to image segmentation.",
            "Semi-supervised orthogonal discriminant projection for plant leaf classification.",
            "A segmentation-free word spotting method for historical printed documents.",
            "Face recognition based on Kinect.",
            "Proximal gradient method for huberized support vector machine.",
            "Topic correlation model for cross-modal multimedia information retrieval.",
            "Modified balanced iterative reducing and clustering using hierarchies (m-BIRCH) for visual clustering.",
            "A novel fuzzy approach for handwritten Arabic character recognition.",
            "Incremental maximum margin clustering.",
            "Direction histogram: novel discriminative global feature for Thai offline handwritten OCR.",
            "Tuning of level-set speed function for speckled image segmentation.",
            "An extensive empirical comparison of ensemble learning methods for binary classification.",
            "A large vocabulary system for Arabic online handwriting recognition.",
            "A double circle structure descriptor and Hough voting matching for real-time object detection.",
            "A novel colour- and texture-based image retrieval technique using multi-resolution local extrema peak valley pattern and RGB colour histogram.",
            "Layered hidden Markov models to recognize activity with built-in sensors on Android smartphone.",
            "Applying particle swarm optimisation to the morphological segmentation of words from Ancient Greek texts."
        ]
    },
    {
        "name": "PAA",
        "year": "2015",
        "info": "Volume 18, 2015",
        "count": 65,
        "papers": [
            "Techniques for dealing with incomplete data: a tutorial and survey.",
            "A novel hybrid intelligent system for multi-objective machine parameter optimization.",
            "Differential tracking with a kernel-based region covariance descriptor.",
            "Optimized filters for efficient multi-texture discrimination.",
            "Recognition of control chart patterns using a neural network-based pattern recognizer with features extracted from correlation analysis.",
            "A clustering ensemble framework based on selection of fuzzy weighted clusters in a locally adaptive clustering algorithm.",
            "Beyond hybrid generative discriminative learning: spherical data classification.",
            "Optical flow-based observation models for particle filter tracking.",
            "Automatic band detection on pulsed-field gel electrophoresis images.",
            "Robust relative attributes for human action recognition.",
            "Improvement of virtual metrology performance by removing metrology noises in a training dataset.",
            "Context-aware television-internet mash-ups using logo detection and character recognition.",
            "The FPGA-based multi-classifier.",
            "Directional naive Bayes classifiers.",
            "Generalized multi-scale stacked sequential learning for multi-class classification.",
            "Classification of defects with ensemble methods in the automated visual inspection of sewer pipes.",
            "Accurate object detection using local shape descriptors.",
            "Stacking for multivariate time series classification.",
            "Establishing the provenance of historical manuscripts with a novel distance measure.",
            "Image completion by structure reconstruction and texture synthesis.",
            "A robust approach to detect digital forgeries by exploring correlation patterns.",
            "Robust sparse kernel density estimation by inducing randomness.",
            "A hybrid clustering algorithm based on missing attribute interval estimation for incomplete data.",
            "Signer independent isolated Italian sign recognition based on hidden Markov models.",
            "Max-covering scheme for gesture recognition of Chinese traffic police.",
            "A novel method for vegetation encroachment monitoring of transmission lines using a single 2D camera.",
            "CSIFT based locality-constrained linear coding for image classification.",
            "Automatic fish taxonomy using evolution-constructed features for invasive species removal.",
            "Detecting cracks in reciprocating compressor valves using pattern recognition in the pV diagram.",
            "Application of foreground object patterns analysis for event detection in an innovative video surveillance system.",
            "Genetic algorithm with aggressive mutation for feature selection in BCI feature space.",
            "Integration of complex language models in ASR and LU systems.",
            "Omnifont text recognition of printed cursive scripts via HMMs, compact lossless features, and soft data clustering.",
            "Minimum Bayes' risk subsequence combination for machine translation.",
            "Discriminative learning of generative models: large margin multinomial mixture models for document classification.",
            "Meta-classifiers for high-dimensional, small sample classification for gene expression analysis.",
            "Analyses of pupils' polygonal shape drawing strategy with respect to handwriting performance.",
            "Improved clustering criterion for image clustering with artificial bee colony algorithm.",
            "Matching Islamic patterns in Kufic images.",
            "Hierarchical clustering based on the information bottleneck method using a control process.",
            "Graph regularized linear discriminant analysis and its generalization.",
            "Image-based logical document structure recognition.",
            "Extraction of salient objects based on image clustering and saliency.",
            "Automatic grading system for human tear films.",
            "A new elliptic contour extraction method for reference hole detection in robotic drilling.",
            "Combining spatial and DCT based Markov features for enhanced blind detection of image splicing.",
            "Blind weave detection for woven fabrics.",
            "A review of facial gender recognition.",
            "A new random approach for initialization of the multiple restart EM algorithm for Gaussian model-based clustering.",
            "Linearizing layers of radial binary classifiers with movable centers.",
            "Evaluating cluster detection algorithms and feature extraction techniques in automatic classification of fish species.",
            "Evaluating classifier combination in object classification.",
            "Constructing L1-graphs for subspace learning via recurrent neural networks.",
            "Automatic segmentation of brain MRI through stationary wavelet transform and random forests.",
            "Combining local and global learners in the pairwise multiclass classification.",
            "A GA-based feature selection and parameter optimization of an ANN in diagnosing breast cancer.",
            "A modified kernel clustering method with multiple factors.",
            "Automatic analysis of handwriting for gender classification.",
            "Fuzzy segmentation for finger vessel pattern extraction of infrared images.",
            "Face and palmprint multimodal biometric systems using Gabor-Wigner transform as feature extraction.",
            "Avoiding staff removal stage in optical music recognition: application to scores written in white mensural notation.",
            "A systematic evaluation of the scale invariance of texture recognition methods.",
            "Automatic player detection and identification for sports entertainment applications.",
            "The k-NN classifier and self-adaptive Hotelling data reduction technique in handwritten signatures recognition.",
            "A deep HMM model for multiple keywords spotting in handwritten documents."
        ]
    },
    {
        "name": "PAA",
        "year": "2014",
        "info": "Volume 17, 2014",
        "count": 60,
        "papers": [
            "Reviewing, selecting and evaluating features in distinguishing fine changes of global texture.",
            "Human action recognition from simple feature pooling.",
            "Performance evaluation of early and late fusion methods for generic semantics indexing.",
            "Impact of action unit detection in automatic emotion recognition.",
            "General rotation-invariant local binary patterns operator with application to blood vessel detection in retinal images.",
            "Automatic classifier selection for non-experts.",
            "Consistency of randomized and finite sized decision tree ensembles.",
            "Linear boundary discriminant analysis based on QR decomposition.",
            "Nonnegative class-specific entropy component analysis with adaptive step search criterion.",
            "A non-stationary MRF model for image segmentation from a soft boundary map.",
            "A new set distance and its application to shape registration.",
            "Weighted mean of a pair of clusterings.",
            "P-M equation based multiscale decomposition and its application to image fusion.",
            "One dimensional local binary pattern for bone texture characterization.",
            "Recognizing objects with multiple configurations.",
            "Fast spatio-temporal stereo for intelligent transportation systems.",
            "Topology-oriented self-organizing maps: a survey.",
            "Fuzzy segmentation of video shots using hybrid color spaces and motion information.",
            "Learning distance metric for object contour tracking.",
            "Efficient steganalysis of images: learning is good for anticipation.",
            "Variable factorization model based on numerical optimization for hyperspectral anomaly detection.",
            "Legendre moment invariants to blur and affine transformation and their use in image recognition.",
            "An evolutionary decoding method for HMM-based continuous speech recognition systems using particle swarm optimization.",
            "LS-SVM-based image segmentation using pixel color-texture descriptors.",
            "A reduction method for graph cut optimization.",
            "A robust and outlier-adaptive method for non-rigid point registration.",
            "Exemplar-based color image inpainting: a fractional gradient function approach.",
            "Bayesian classification and unsupervised learning for isolating weeds in row crops.",
            "Defect detection using feature point matching for non-repetitive patterned images.",
            "Gaussian weak classifiers based on co-occurring Haar-like features for face detection.",
            "Fast training procedure for Viola-Jones type object detectors using Laplacian clutter models.",
            "A new approach to signature recognition using the fuzzy method.",
            "Fundamental methodological issues of syntactic pattern recognition.",
            "Geometric algorithm for dominant point extraction from shape contour.",
            "Dimensionality reduction and topographic mapping of binary tensors.",
            "Skeletonization based on angle maps.",
            "A new approach to the design of hybrid finer directional wavelet filter bank for iris feature extraction and classification using k-out-of-n: A post-classifier.",
            "Double indices-induced FCM clustering and its integration with fuzzy subspace clustering.",
            "Adding a rigid motion model to foreground detection: application to moving object detection in rivers.",
            "Performance enhancement of online handwritten Tamil symbol recognition with reevaluation techniques.",
            "Visual-speech-pass filtering for robust automatic lip-reading.",
            "A smartphone-based virtual white cane.",
            "A point symmetry-based clonal selection clustering algorithm and its application in image compression.",
            "Construction of dynamic three-dimensional microstructure for the hydration of cement using 3D image registration.",
            "Liver vasculature refinement with multiple 3D structuring element shapes.",
            "A review of boosting methods for imbalanced data classification.",
            "Recognizing multi-modal sensor signals using evolutionary learning of dynamic Bayesian networks.",
            "Fixed-size ensemble classifier system evolutionarily adapted to a recurring context with an unlimited pool of classifiers.",
            "Evolutionary decision rules for predicting protein contact maps.",
            "MapReduce approach to relational influence propagation in complex networks.",
            "An off-line cheque handwritten forgery detection based on feature route density matrix.",
            "Facial expression recognition based on meta probability codes.",
            "Finger-vein network enhancement and segmentation.",
            "VE dimension induced by Bayesian networks over the boolean domain.",
            "Color video compression using color mapping into textured grayscale video frames.",
            "Algorithms for invariant long-wave infrared face segmentation: evaluation and comparison.",
            "Topographic Bernoulli block mixture mapping for binary tables.",
            "Designing a new standard structure for improving automatic processing of Persian handwritten bank cheques.",
            "Evaluating the reliability level of virtual metrology results for flexible process control: a novelty detection-based approach.",
            "Analysis of small infrared target features and learning-based false detection removal for infrared search and track."
        ]
    },
    {
        "name": "PAA",
        "year": "2013",
        "info": "Volume 16, 2013",
        "count": 46,
        "papers": [
            "Supervised texture classification: color space or texture feature selection?",
            "Ant colony clustering analysis based intelligent fault diagnosis method and its application to rotating machinery.",
            "Automated classification of touching or overlapping M-FISH chromosomes by region fusion and homolog pairing.",
            "Facial emotional classification: from a discrete perspective to a continuous emotional space.",
            "Expectation-maximization algorithms for inference in Dirichlet processes mixture.",
            "Rotation invariant features for color texture classification and retrieval under varying illumination.",
            "A unifying methodology for the evaluation of neural network models on novelty detection tasks.",
            "On utilizing dependence-based information to enhance micro-aggregation for secure statistical databases.",
            "Transductive multi-distance learning for video search.",
            "On using an analogy to heat flow for shape extraction.",
            "Parametric and nonparametric tests for speckled imagery.",
            "Enhanced Gabor wavelet correlogram feature for image indexing and retrieval.",
            "Bayesian mixture of AR models for time series clustering.",
            "4-D pattern structure features by three stages clustering algorithm for image analysis and classification.",
            "Semi-supervised feature extraction for EEG classification.",
            "The active grading ensemble framework for learning visual quality inspection from multiple humans.",
            "Classifier ensembles to improve the robustness to noise of bearing fault diagnosis.",
            "The graph matching problem.",
            "Real-time vision-based eye state detection for driver alertness monitoring.",
            "Spot defects detection in cDNA microarray images.",
            "Control chart pattern recognition using neural networks and efficient features: a comparative study.",
            "Creating ensemble classifiers through order and incremental data selection in a stream - Application to the online learning of road safety indicators.",
            "On the smoothing of multinomial estimates using Liouville mixture models and applications.",
            "A classification and fuzzy-based approach for digital multi-focus image fusion.",
            "Advanced leaf image retrieval via Multidimensional Embedding Sequence Similarity (MESS) method.",
            "Variable subspace model for hyperspectral anomaly detection.",
            "Image-based supervision of a periodically working machine.",
            "Classification using distances from samples to linear manifolds.",
            "Detection of artificial and scene text in images and video frames.",
            "Automatic classification of seam pucker images based on ordinal quality grades.",
            "A methodology for detection and estimation in the analysis of golf putting.",
            "An empirical comparison of learning algorithms for nonparametric scoring: the TreeRank algorithm and other methods.",
            "Joint segmentation and pairing of multispectral chromosome images.",
            "A new invariant descriptor for action recognition based on spherical harmonics.",
            "Text detection in street level images.",
            "A shape-based similarity measure for time series data with ensemble learning.",
            "Evaluation of an adaptive genetic-based signature extraction system for network intrusion detection.",
            "Adaptive edge-preserving image denoising using wavelet transforms.",
            "Unsupervised colour image segmentation by low-level perceptual grouping.",
            "Multi-structure local binary patterns for texture classification.",
            "Classification by nearness in complementary subspaces.",
            "Modelling and predicting news popularity.",
            "A new radial symmetry measure applied to photogrammetry.",
            "Fast and effective color-based object tracking by boosted color distribution.",
            "Automatic authentication of color laser print-outs using machine identification codes.",
            "A hierarchical and scalable model for contemporary document image segmentation."
        ]
    },
    {
        "name": "PAA",
        "year": "2012",
        "info": "Volume 15, 2012",
        "count": 33,
        "papers": [
            "Enclosing trees.",
            "Dimensionality reduction for detection of moving vehicles.",
            "Improving acoustic vehicle classification by information fusion.",
            "Optimization of dependency and pruning usage in text classification.",
            "Bayesian event detection for sport games with hidden Markov model.",
            "Contactless palmprint and knuckle biometrics for mobile devices.",
            "Continuous activity recognition in a maintenance scenario: combining motion sensors and ultrasonic hands tracking.",
            "Confidence voting method ensemble applied to off-line signature verification.",
            "EnMS: early non-maxima suppression - Speeding up pattern localization and other tasks.",
            "2D fragmented object reconstruction with the use of the chromatic and thematic content.",
            "Imprecise information in Bayes classifier.",
            "Preserving objects in Markov Random Fields region growing image segmentation.",
            "Centroid Iteration algorithm for image tracking.",
            "Automatic logo transition detection in digital video contents.",
            "Stereo vision system for moving object detecting and locating based on CMOS image sensor and DSP chip.",
            "Design, development and field evaluation of a Spanish into sign language translation system.",
            "Maximized subspace model for hyperspectral anomaly detection.",
            "An extension to fuzzy support vector data description (FSVDD*).",
            "Feature extraction using orthogonal discriminant local tangent space alignment.",
            "A prototype-based method for classification with time constraints: a case study on automated planning.",
            "Fast evolving neuro-fuzzy model and its application in online classification and time series prediction.",
            "Three-dimensional action recognition using volume integrals.",
            "Design of pattern recognition system for static security assessment and classification.",
            "Fault diagnosis of a railway device using semi-supervised independent factor analysis with mixing constraints.",
            "Gaussian kernel width exploration and cone cluster labeling for support vector clustering.",
            "An experimental comparison of clustering methods for content-based indexing of large image databases.",
            "Online adaptive feature weighting for spatiogram-bank tracking.",
            "A fast SVM-based wrapper feature selection method driven by a fuzzy complementary criterion.",
            "Human body segmentation based on deformable models and two-scale superpixel.",
            "Trajectory clustering in CCTV traffic videos using probability product kernels with hidden Markov models.",
            "A framework for computing asset-sighting distance.",
            "Offline recognition of handwritten Bangla characters: an efficient two-stage approach.",
            "Detecting unknown computer worm activity via support vector machines and active learning."
        ]
    },
    {
        "name": "PAA",
        "year": "2011",
        "info": "Volume 14, 2011",
        "count": 33,
        "papers": [
            "A new hybrid method for gene selection.",
            "Shape feature descriptor using modified Zernike moments.",
            "A multiple layer fusion approach on keystroke dynamics.",
            "Efficient on-line signature recognition based on multi-section vector quantization.",
            "A sparse multinomial probit model for classification.",
            "Robust scale invariant target detection using the scale-space theory and optimization for IRST.",
            "Preserving spatial information and overcoming variations in appearance for face recognition.",
            "Identification of unreliable segments to improve skeletonization of handwriting images.",
            "Automatic gender detection using on-line and off-line information.",
            "Circle detection using discrete differential evolution optimization.",
            "Statistical thresholding method for infrared images.",
            "Iwasawa decomposition: a new approach to 2D affine registration problem.",
            "Self-organizing maps and boundary effects: quantifying the benefits of torus wrapping for mapping SOM trajectories.",
            "Line segment detection using weighted mean shift procedures on a 2D slice sampling strategy.",
            "Classification through incremental max-min separability.",
            "Identifying distributed and overlapping clusters of hemodynamic synchrony in fMRI data sets.",
            "MLiT: mixtures of Gaussians under linear transformations.",
            "A three-step unsupervised neural model for visualizing high complex dimensional spectroscopic data sets.",
            "Robust document binarization with OFF center-surround cells.",
            "On searching for an optimal threshold for morphological image segmentation.",
            "A Center-Surround Histogram for content-based image retrieval.",
            "Relational space classification for malaria diagnosis.",
            "Logistic regression-based pattern classifiers for symbolic interval data.",
            "Adaptive kernel approach to the time series prediction.",
            "Computer-aided detection of lung nodules based on decision fusion techniques.",
            "Detection of moving foreground objects in videos with strong camera motion.",
            "Iris recognition using shape-guided approach and game theory.",
            "A structurally motivated framework for discriminant analysis.",
            "Improving the non-extensive medical image segmentation based on Tsallis entropy.",
            "Piece-wise painting technique for line segmentation of unconstrained handwritten text: a specific study with Persian text documents.",
            "CORES: fusion of supervised and unsupervised training methods for a multi-class classification problem.",
            "Quantitative description of 3D vascularity images: texture-based approach and its verification through cluster analysis.",
            "Adaptive potential active contours."
        ]
    },
    {
        "name": "PAA",
        "year": "2010",
        "info": "Volume 13, 2010",
        "count": 38,
        "papers": [
            "Auto-regressive independent process analysis without combinatorial efforts.",
            "A simple iterative algorithm for parsimonious binary kernel Fisher discrimination.",
            "Joint feature selection and classification for taxonomic problems within fish species complexes.",
            "Shape from shading through photometric motion.",
            "A variant of Rotation Forest for constructing ensemble classifiers.",
            "Face recognition with adaptive local hyperplane algorithm.",
            "Classification error in Bayes multistage recognition task with fuzzy observations.",
            "Applying a sectioned genetic algorithm to word segmentation.",
            "The lip as a biometric.",
            "A survey of graph edit distance.",
            "A new fast prototype selection method based on clustering.",
            "Exploiting visual and text features for direct marketing learning in time and space constrained domains.",
            "3D pore structure characterisation of paper.",
            "A novel SVM-based handwritten Tamil character recognition system.",
            "Chilean wine varietal classification using quadratic Fisher transformation.",
            "Constrained domain maximum likelihood estimation for naive Bayes text classification.",
            "The architecture and performance of the face and eyes detection system based on the Haar cascade classifiers.",
            "Kernel relevance weighted discriminant analysis for face recognition.",
            "Constructing a pedestrian recognition system with a public open database, without the necessity of re-training: an experimental study.",
            "BiosecurID: a multimodal biometric database.",
            "Huan Liu and Hiroshi Motoda (eds): Computational methods of feature selection.",
            "Multiple Condensation filters for road detection and tracking.",
            "A comparative study on feature extraction for fingerprint classification and performance improvements using rank-level fusion.",
            "Domain-independent feature extraction for multi-classification using multi-objective genetic programming.",
            "A template-based approach to automatic face enhancement.",
            "Cancellable biometrics and user-dependent multi-state discretization in BioHash.",
            "Combined invariants to blur and rotation using Zernike moment descriptors.",
            "Symbol spotting in vectorized technical drawings through a lookup table of region strings.",
            "A system for 3D texture-based probabilistic object recognition and its applications.",
            "One-class classification for oil spill detection.",
            "Data pre-processing through reward-punishment editing.",
            "An unsupervised learning approach based on a Hopfield-like network for assessing posterior capsule opacification.",
            "Robust hand image processing for biometric application.",
            "A computer-based quantitative assessment of visuo-spatial neglect using regression and data transformation.",
            "Representation and classification of high-dimensional biomedical spectral data.",
            "3D object model reconstruction from image sequence based on photometric consistency in volume space.",
            "3D object recognition using invariants of 2D projection curves.",
            "Identification of scripts and orientations of degraded document images."
        ]
    },
    {
        "name": "PAA",
        "year": "2009",
        "info": "Volume 12, 2009",
        "count": 32,
        "papers": [
            "Ranked linear models and sequential patterns recognition.",
            "Multi-level classification of emphysema in HRCT lung images.",
            "Ensemble of HMM classifiers based on the clustering validity index for a handwritten numeral recognizer.",
            "Estimation of distributions involving unobservable events: the case of optimal search with unknown Target Distributions.",
            "The aspect Bernoulli model: multiple causes of presences and absences.",
            "Development of assessment criteria for clustering algorithms.",
            "Semi-supervised discriminative classification with application to tumorous tissues segmentation of MR brain images.",
            "Optimizing two-pass connected-component labeling algorithms.",
            "Image change detection from difference image through deterministic simulated annealing.",
            "On Bayesian analysis of a finite generalized Dirichlet mixture via a Metropolis-within-Gibbs sampling.",
            "Human tracking and silhouette extraction for human-robot interaction systems.",
            "A multi-scale template method for shape detection with bio-medical applications.",
            "Recognizing convex polygons with few finger probes.",
            "New scale invariant template matching technique using hyper space image representation.",
            "A multiple expert system for classifying fluorescent intensity in antinuclear autoantibodies analysis.",
            "SUSIG: an on-line signature database, associated protocols and benchmark results.",
            "Soft authentication using an infrared ceiling sensor network.",
            "Soft authentication and behavior analysis using a chair with sensors attached: hipprint authentication.",
            "Towards a measure of biometric feature information.",
            "Audio-visual speech asynchrony detection using co-inertia analysis and coupled hidden markov models.",
            "Classification of image objects in Epo doping control using fuzzy decision tree.",
            "Are Gabor phases really useless for face recognition?",
            "Respiratory sound classification by using an incremental supervised neural network.",
            "Probabilistic classification of acute myocardial infarction from multiple cardiac markers.",
            "Overlapping and multi-touching text-line segmentation by Block Covering analysis.",
            "The use of Hartley transform in OCR with application to printed Arabic character recognition.",
            "Speeding up simplification of polygonal curves using nested approximations.",
            "Finding regions of interest for cancerous masses enhanced by elimination of linear structures and considerations on detection correctness measures in mammography.",
            "Computationally efficient eigenspace decomposition of correlated images characterized by three parameters.",
            "Feature extraction from multi-directional multi-resolution image transformations for the classification of zoom-endoscopy images.",
            "Algorithm of designing compound recognition system on the basis of combining classifiers with simultaneous splitting feature space into competence areas.",
            "Phrase classes in two-level language models for ASR."
        ]
    },
    {
        "name": "PAA",
        "year": "2008",
        "info": "Volume 11, 2008",
        "count": 32,
        "papers": [
            "Human action recognition in videos based on the Transferable Belief Model.",
            "Robust automated multiple view inspection.",
            "Document image binarization by two-stage block extraction and background intensity determination.",
            "Motion synthesis through 1D affine matching.",
            "Landscapes of Naïve Bayes classifiers.",
            "FRCT: fuzzy-rough classification trees.",
            "Diagnosis of lung nodule using Moran's index and Geary's coefficient in computerized tomography images.",
            "Recognising facial expressions in video sequences.",
            "Distributional-based texture classification using non-parametric statistics.",
            "Motion estimation based color transfer and its application to color video compression.",
            "A multiscale approach to texture-based image retrieval.",
            "Extraction and optimization of fuzzy association rules using multi-objective genetic algorithm.",
            "A vector gravitational force model for classification.",
            "Hybrid genetic algorithm for dual selection.",
            "Hierarchical clustering of subpopulations with a dissimilarity based on the likelihood ratio statistic: application to clustering massive data sets.",
            "Gregory Shakhnarovich, Trevor Darrell and Piotr Indyk: Nearest-Neighbors Methods in Learning and Vision. Theory and Practice.",
            "Non-parametric distance-based classification techniques and their applications.",
            "Distance-based discriminant analysis method and its applications.",
            "On kernel difference-weighted k-nearest neighbor classification.",
            "Online nonparametric discriminant analysis for incremental subspace learning and recognition.",
            "On the k-NN performance in a challenging scenario of imbalance and overlapping.",
            "Model-based classification with dissimilarities: a maximum likelihood approach.",
            "A sparse Bayesian approach for joint feature selection and classifier learning.",
            "Feature selection, mutual information, and the classification of high-dimensional patterns.",
            "Converting non-parametric distance-based classification to anytime algorithms.",
            "Classification of dissimilarity data with a new flexible Mahalanobis-like metric.",
            "Prototype reduction using an artificial immune model.",
            "Efficient distance-based per-pixel texture classification with Gabor wavelet filters.",
            "Binarized eigenphases applied to limited memory face recognition systems.",
            "Diversity-based combination of non-parametric classifiers for EMG signal decomposition.",
            "Dissimilarity-based classification of chromatographic profiles.",
            "Fusion of textural statistics using a similarity measure: application to texture recognition and segmentation."
        ]
    },
    {
        "name": "PAA",
        "year": "2007",
        "info": "Volume 10, 2007",
        "count": 28,
        "papers": [
            "Breadth-first search strategies for trie-based syntactic pattern recognition.",
            "Quadtree-based eigendecomposition for pose estimation in the presence of occlusion and background clutter.",
            "A writer identification and verification system using HMM based recognizers.",
            "Using string matching to detect video transitions.",
            "Pairwise feature evaluation for constructing reduced representations.",
            "Extracting content from instructional videos by statistical modelling and classification.",
            "A multi-stage classification system for detecting intrusions in computer networks.",
            "Reverse engineering the way humans rank textures.",
            "Segmentation of regions of interest and post-segmentation edge location improvement in computer-aided bone age assessment.",
            "Optimal binarization of images by neural networks for morphological analysis of ductile cast iron.",
            "Segmentation of news videos based on audio-video information.",
            "Automated personal identification system based on human iris analysis.",
            "Face recognition based on a novel linear discriminant criterion.",
            "Periodicity and stability issues of a chaotic pattern recognition neural network.",
            "An analysis of how training data complexity affects the nearest neighbor classifiers.",
            "Sparse least squares support vector training in the reduced empirical feature space.",
            "Joint estimation of motion and radiometry of rotating camera for HDR global mosaic.",
            "Gait recognition using fractal scale.",
            "Automated image-orientation detection: a scalable boosting approach.",
            "Exploiting computer resources for fast nearest neighbor classification.",
            "Classification of hematologic malignancies using texton signatures.",
            "Salient human detection for robot vision.",
            "Segmentation of microscope images of living cells.",
            "Understanding people motion in video sequences using Voronoi diagrams.",
            "Integrated color, texture and shape information for content-based image retrieval.",
            "Binary object extraction using bi-directional self-organizing neural network (BDSONN) architecture with fuzzy context sensitive thresholding.",
            "Feature-based assessment of visuo-spatial neglect patients using hand-drawing tasks.",
            "Face recognition using an NNSRM classifier in LDA subspace."
        ]
    },
    {
        "name": "PAA",
        "year": "2006",
        "info": "Volume 9, 2006",
        "count": 26,
        "papers": [
            "Content-based image retrieval by using tree-structured features and multi-layer self-organizing map.",
            "Personal authentication using digital retinal images.",
            "A new approach for breast skin-line estimation in mammograms.",
            "Selecting the structuring element for morphological texture classification.",
            "An empirical study of machine learning techniques for affect recognition in human-robot interaction.",
            "Analysis of position based watermarking.",
            "Rotation invariant feature extraction using Ridgelet and Fourier transforms.",
            "A quadtree decomposition approach for surface assessment.",
            "Fusion of phase and orientation information for palmprint authentication.",
            "Moving object detection by mobile Stereo Omni-directional System (SOS) using spherical depth image.",
            "Classifier-independent feature selection on the basis of divergence criterion.",
            "W-operator window design by minimization of mean conditional entropy.",
            "A novel feature-based tracking approach to the detection, localization, and 3-D reconstruction of internal defects in hardwood logs using computer tomography.",
            "A novel look-ahead optimization strategy for trie-based approximate string matching.",
            "Fuzzy histograms, weak fuzzification and accumulation of periodic quantities.",
            "Automatic name extraction from degraded document images.",
            "A DCT-based ownership identification method with gray-level and colorful signatures.",
            "Efficient median based clustering and classification techniques for protein sequences.",
            "Decomposition methodology for classification tasks: a meta decomposer framework.",
            "A review on Gabor wavelets for face recognition.",
            "A semi-automatic system for segmentation of cardiac M-mode images.",
            "Automatic texture segmentation for content-based image retrieval application.",
            "On poem recognition.",
            "Using online linear classifiers to filter spam emails.",
            "Two-stage binary classifier with fuzzy-valued loss function.",
            "An asymmetric fingerprint matching algorithm for Java Card TM."
        ]
    },
    {
        "name": "PAA",
        "year": "2005",
        "info": "Volume 8, 2005/2006",
        "count": 34,
        "papers": [
            "The MSFAM: a modified fuzzy ARTMAP system.",
            "A computer vision system for the detection and classification of vehicles at urban road intersections.",
            "Unsupervised learning of arbitrarily shaped clusters using ensembles of Gaussian models.",
            "A face authentication system using the trace transform.",
            "Audio-visual sports highlights extraction using Coupled Hidden Markov Models.",
            "Affine invariant fitting of algebraic curves using Fourier descriptors.",
            "Canonical representations of discrete curves.",
            "Estimation of generalized entropies with sample spacing.",
            "A black hole novelty detector for video analysis.",
            "Hidden Markov chain estimation and parameterisation via ICA-based feature-selection.",
            "A modified mountain clustering algorithm.",
            "Clustering spatial data with a hybrid EM approach.",
            "A multi-population genetic algorithm for robust and fast ellipse detection.",
            "Use of colour for hand-filled form analysis and recognition.",
            "A supervised data-driven approach for microarray spot quality classification.",
            "Merging face and finger images for human identification.",
            "A comparative study on text representation schemes in text categorization.",
            "An effective 3D target recognition model imitating robust methods of the human visual system.",
            "An ensemble-based method for linear feature extraction for two-class problems.",
            "Wavelet feature space in computer-aided electroretinogram evaluation.",
            "Robust iris location in close-up images of the eye.",
            "The psychology of art and the evolution of the conscious brain by Robert L. Solso, MIT Press, 2004.",
            "Automated ground-based cloud recognition.",
            "A hybrid post-processing system for offline handwritten Chinese script recognition.",
            "A dempster-shafer theoretic framework for boosting based ensemble design.",
            "Estimation of generalized entropies with sample spacing.",
            "An efficient segmentation-free approach to assist old Greek handwritten manuscript OCR.",
            "Classifying image texture with statistical landscape features.",
            "Dynamic clustering using particle swarm optimization with application in image segmentation.",
            "Online signature verification based on null component analysis and principal component analysis.",
            "Complete classification of raw LIDAR data and 3D reconstruction of buildings.",
            "Concealed weapon detection and visualization in a synthesized image.",
            "\"Imitation of life: how biology is inspiring computing\" by Nancy Forbes.",
            "Audio-visual sports highlights extraction using Coupled Hidden Markov Models."
        ]
    },
    {
        "name": "PAA",
        "year": "2004",
        "info": "Volume 7, 2004",
        "count": 39,
        "papers": [
            "Confidence Transformation for Combining Classifiers.",
            "An application of image processing in the medieval mosaic conservation.",
            "The impact of false alarm mitigation on surface landmine detection in MWIR imagery.",
            "A new LDA-KL combined method for feature extraction and its generalisation.",
            "A generalisation of model selection criteria.",
            "Improving recognition accuracy on structured documents by learning structural patterns.",
            "Fingerprint classification: a review.",
            "Fingerprint verification based on minutiae features: a review.",
            "Statistical and neural classifiers: an integrated approach to design (Advances in Pattern Recognition Series). By S.Raudys.",
            "A probabilistic hit-and-miss transform for face localization.",
            "Reducing the classification cost of support vector classifiers through an ROC-based reject rule.",
            "Improving the selection of feature points for tracking.",
            "Fusion of appearance-based face recognition algorithms.",
            "A decision based one-against-one method for multi-class support vector machine.",
            "Episode detection in videos captured using a head-mounted camera.",
            "An optical character recognition system for printed Telugu text.",
            "A new cluster validity measure and its application to image compression.",
            "Bayesian Artificial Intelligence.",
            "A new LDA-KL combined method for feature extraction and its generalisation.",
            "Analysis of spatial variability using geostatistical functions for diagnosis of lung nodule in computerized tomography images.",
            "Bi-modal breast cancer classification system.",
            "Matching graphs with unique node labels.",
            "PalmHashing: a novel approach for dual-factor authentication.",
            "Automatic analysis of collagen fiber orientation in the outermost layer of human arteries.",
            "Optimal resampling and classifier prototype selection in classifier ensembles using genetic algorithms.",
            "Feature dimensionality reduction for the verification of handwritten numerals.",
            "Compression and recognition of dance gestures using a deformable model.",
            "A Bayesian approach to object detection using probabilistic appearance-based models.",
            "Detection of surface defects on raw steel blocks using Bayesian network classifiers.",
            "A framework of joint object tracking and event detection.",
            "Tracking-based event detection for CCTV systems.",
            "Computer vision techniques for traffic flow computation.",
            "An appearance-based approach for consistent labeling of humans and objects in video.",
            "Summarising contextual activity and detecting unusual inactivity in a supportive home environment.",
            "Unsupervised event discrimination based on nonlinear temporal modeling of activity content.",
            "Highlights modeling and detection in sports videos.",
            "Knowledge-based detection of events in video streams from salient regions of activity.",
            "Hierarchical database for a multi-camera surveillance system.",
            "Combining experts for anchorperson shot detection in news videos."
        ]
    },
    {
        "name": "PAA",
        "year": "2003",
        "info": "Volume 6, 2003/2004",
        "count": 30,
        "papers": [
            "Visual modelling and evaluation of surgical skill.",
            "A non-contact method of capturing low-resolution text for OCR.",
            "Limits on the majority vote accuracy in classifier fusion.",
            "A divide-and-conquer method for multi-net classifiers.",
            "Use of Dempster-Shafer theory to combine classifiers which use different class boundaries.",
            "A generalised K-L expansion method which can deal with small sample size and high-dimensional problems.",
            "Randomised hough transform with error propagation for line and circle detection.",
            "Input decimated ensembles.",
            "MDL estimation of a dense map of relative depth and 3D motion from a temporal sequence of images.",
            "Book Reviews. Truth from Trash: How Learning Makes Sense.",
            "Signal recognition: Both components of the short time Fourier transform vs. power spectral density.",
            "Large vocabulary off-line handwriting recognition: A survey.",
            "Faster algorithm of string comparison.",
            "PRISM-A novel framework for pattern recognition.",
            "A hierarchical multiple classifier learning algorithm.",
            "Optimising Colour and Texture Features for Real-time Visual Inspection.",
            "The scale invariants of pseudo-Zernike moments.",
            "Dynamic computation of generalised median strings.",
            "Robust hierarchical image representation using non-negative matrix factorisation with sparse code shrinkage preprocessing.",
            "Generalized rules for combination and joint training of classifiers.",
            "A Dynamic Sub-vector Weighting Scheme for Image Retrieval with Relevance Feedback.",
            "The deviation of a set of strings.",
            "A brief taxonomy and ranking of creative prototype reduction schemes.",
            "New Applications of Ensembles of Classifiers.",
            "Soft Morphological Filtering Using a Fuzzy Model and its Application to Colour Image Processing.",
            "Generative binary codes.",
            "Effectiveness of error correcting output coding methods in ensemble and monolithic learning machines.",
            "Discriminative features for text document classification.",
            "Extraction and recognition of artificial text in multimedia documents.",
            "Comparing and evaluating HMM ensemble training algorithms using train and test and condition number criteria."
        ]
    },
    {
        "name": "PAA",
        "year": "2002",
        "info": "Volume 5, 2002",
        "count": 34,
        "papers": [
            "Reconstruction of 3D Object Models from Vectorised Engineering Drawings.",
            "Finding Hidden Events in Astrophysical Data using PCA and Mixture of Gaussians Clustering.",
            "On the Weighted Mean of a Pair of Strings.",
            "Off-Line Arabic Character Recognition-A Review.",
            "Computer Vision and Pattern Recognition Techniques for 2-D and 3-D MR Cerebral Cortical Segmentation (Part I): A State-of-the-Art Review.",
            "Fusion of Region and Boundary/Surface-Based Computer Vision and Pattern Recognition Techniques for 2-D and 3-D MR Cerebral Cortical Segmentation (Part-II): A State-of-the-Art Review.",
            "A Data Complexity Analysis of Comparative Advantages of Decision Forest Constructors.",
            "A Hybrid Projection-based and Radial Basis Function Architecture: Initial Values and Global Optimisation.",
            "Bagging, Boosting and the Random Subspace Method for Linear Classifiers.",
            "A Multi-Classifier Approach to Fingerprint Classification.",
            "Learning to Listen to the Right Information Retrieval System.",
            "Observational Learning Algorithm for an Ensemble of Neural Networks.",
            "Combining Discriminant Models with New Multi-Class SVMs.",
            "Multiple Classifier Systems: Software Engineered, Automatically Modular Leading to a Taxonomic Overview.",
            "Robust Combining of Disparate Classifiers through Order Statistics.",
            "Combining Different Methods and Numbers of Weak Decision Trees.",
            "Hierarchical Fusion of Multiple Classifiers for Hyperspectral Data Analysis.",
            "Multiple Classifier Fusion in Probabilistic Neural Networks.",
            "Reject Strategies Driven Combination of Pattern Classifiers.",
            "Model Selection by Predictive Validation.",
            "Diagnosis of Visuo-Spatial Neglect Using Dynamic Sequence Features from a Cancellation Task.",
            "Vector Ordering and Morphological Operations for Colour Image Processing: Fundamentals and Applications.",
            "A Multi-stage Online Signature Verification System.",
            "Layered Representation of a Video Shot with Mosaicing.",
            "Dynamic Cluster Recognition with Multiple Self-Organising Maps.",
            "Recognition of Symmetrical Images Using Affine Moment Invariants in both Frequency and Spatial Domains.",
            "Moderating k-NN Classifiers.",
            "A Theoretical Analysis of the Limits of Majority Voting Errors for Multiple Classifier Systems.",
            "Bagged Mixtures of Classifiers using Model Scoring Criteria.",
            "Complex-Valued Feature Masks by Directional Filtering of 323 Compass Feature Masks.",
            "Sensor Geometry and Sampling Methods for Space-Variant Image Processing.",
            "A Feature-Based Serial Approach to Classifier Combination.",
            "Book Reviews. Review of Advances in Distributed and Parallel Knowledge Discovery.",
            "Graphical Models: Foundations of Neural Computation."
        ]
    },
    {
        "name": "PAA",
        "year": "2001",
        "info": "Volume 4, 2001",
        "count": 21,
        "papers": [
            "Affine Curvature Scale Space with Affine Length Parametrisation.",
            "Robust Image Mosaicing of Soccer Videos using Self-Calibration and Line Tracking.",
            "Fast Labelling of Natural Scenes Using Enhanced Knowledge.",
            "Segmenting Traffic Scenes from Grey Level and Motion Information.",
            "Cursive Script Recognition using Wildcards and Multiple Experts.",
            "Feature Extraction Method Based on the Generalised Fisher Discriminant Criterion and Facial Recognition.",
            "Modelling Spatial Relationships between Colour Clusters.",
            "Facial Image Indexing in Multimedia Databases.",
            "Content-based Retrieval Using Local Descriptors: Problems and Issues from a Database Perspective.",
            "Building Visual Vocabulary for Image Indexation and Query Formulation.",
            "Self-Organising Maps as a Relevance Feedback Technique in Content-Based Image Retrieval.",
            "RETIN: A Content-Based Image Indexing and Retrieval System.",
            "Region-based Image Retrieval Using Probabilistic Feature Relevance Learning.",
            "Categorisation and Retrieval of Scene Photographs from JPEG Compressed Database.",
            "Key Points-based Indexing for Pre-attentive Similarities: The KIWI System.",
            "Object-Based Image Content Characterisation for Semantic-Level Image Similarity Calculation.",
            "MLP Based Linear Fea ure Ex rac ion for Nonlinearly Separable Data.",
            "Pulsed-Field Gel Elec rophoresis Pa ern Recogni ion of Bac erial DNA: A Systemic Approach.",
            "Endocardial Boundary E timation and Tracking in Echocardiographic Images using Deformable Template and Markov Random Fields.",
            "Segmentation of Colour Images with Highlights and Shadows sing Fuzzy-like Reasoning.",
            "Volatility Trading ia Temporal Pattern Recognition in Quantised Financial Time Series."
        ]
    },
    {
        "name": "PAA",
        "year": "2000",
        "info": "Volume 3, 2000",
        "count": 28,
        "papers": [
            "Towards Detection of Glasses in Facial Images.",
            "Nearest Neighbour Editing and Condensing Tools-Synergy Exploitation.",
            "Backpropagation of an Image Similarity Metric for Autoassociative Neural Networks.",
            "Greedy Algorithm for Error Correction in Automatically Produced Boundaries from Low Contrast Ventriculograms.",
            "On the Initialisation of Sammon's Nonlinear Mapping.",
            "Using Landmarks to Establish a Point-to-Point Correspondence between Signatures.",
            "New Invariant Moments for Non-Uniformly Scaled Images.",
            "Technical Map Interpretation: A Distributed Approach.",
            "Flexible and Robust Model Matching based on Association Graph for Form Image Understanding.",
            "An Approach for Recognition and Interpretation of Mathematical Expressions in Printed Document.",
            "Automated Reading of Cheque Amounts.",
            "A Knowledge-Aided Line Network Oriented Vectorisation Method for Engineering Drawings.",
            "A Line-Oriented Approach to Word Spotting in Handwritten Documents.",
            "Signature Verification: Increasing Performance by a Multi-Stage System.",
            "Using Physical and Logical Constraints for Invoice Understanding.",
            "Consistent Partition and Labelling of Text Blocks.",
            "Computer Vision, Pattern Recognition and Image Processing in Left Ventricle Segmentation: The Last 50 Years.",
            "A Document Skew Detection Method Using the Hough Transform.",
            "Suitability Analysis of Techniques for Flaw Detection in Textiles using Texture Analysis.",
            "On a Neural Network that Performs an Enhanced Nearest-Neighbour Matching.",
            "A Hierarchical Self-orginising Map Model for Sequence Recognition.",
            "Combined Classifiers for Invariant Face Recognition.",
            "Using Renyi's Information and Wavelets for Target Detection: An Application to Mammograms.",
            "An HMM-MLP Hybrid Model for Cursive Script Recognition.",
            "A Fuzzy Hierarchical Classification System for Olfactory Signals.",
            "Recognition and Grading of Severely Distorted Geometric Shapes from within a Complex Figure.",
            "Clustering by Adaptive Local Search with Multiple Search Operators.",
            "Randomised Local Search Algorithm for the Clustering Problem."
        ]
    },
    {
        "name": "PAA",
        "year": "1999",
        "info": "Volume 2, 1999",
        "count": 29,
        "papers": [
            "Acquisition of 2D Shape Models from Scenes with Overlapping Objects using String Matching.",
            "From Raster to Vectors: Extracting Visual Information from Line Drawings.",
            "Distribution Free Decomposition of Multivariate Data.",
            "Image Classification Using Probabilistic Models that Reflect the Internal Structure of Mixels.",
            "Regularisation of Linear Classifiers by Adding Redundant Features.",
            "Introducing Locality and Softness in Subspace Classification.",
            "MDL Principle for Robust Vector Quantisation.",
            "Algorithms for Fuzzy Segmentation.",
            "Tracking in 3D: Image Variability Decomposition for Recovering Object Pose and Illumination.",
            "Probabilistic and Other Neural Nets in Multi-Hole Probe Calibration and Flow Angularity Pattern Recognition.",
            "Image Feature Extraction and Denoising by Sparse Coding.",
            "The Applicability of Neural Networks to Non-linear Image Processing.",
            "Outdoor Scene Classification by a Neural Tree-Based Approach.",
            "A Neural Network Approach to Planar-Object Recognition in 3D Space.",
            "Colour Image Indexing Using SOM for Region-of-Interest Retrieval.",
            "Detection of Bone Tumours in Radiographic Images using Neural Networks.",
            "Application of a Steerable Wavelet Transform using Neural Network for Signature Verification.",
            "Reducing the Dimensions of Texture Features for Image Retrieval Using Multi-layer Neural Networks.",
            "Reliability Parameters to Improve Combination Strategies in Multi-Expert Systems.",
            "Definition and Validation of a Distance Measure Between Structural Primitives.",
            "Rejection Criteria and Pairwise Discrimination of Handwritten Numerals Based on Structural Features.",
            "Incorporating Gradient Estimations in a Circle-Finding Probabilistic Hough Transform.",
            "Object Recognition Based on Human Saccadic Behaviour.",
            "A Long Memory Pattern Modelling and Recognition System for Financial Time-Series Forecasting.",
            "Multi-spectral Texture Segmentation Based on the Spectral Cooccurrence Matrix.",
            "Vectorising and Feature-Based Filtering for Line-Drawing Image Compression.",
            "Serial Combination of Multiple Experts: A Unified Evaluation.",
            "Improving Feature Tracking with Robust Statistics.",
            "On the Use of Neural Networks and Geometrical Criteria for Localisation of Highly Irregular Elliptical Shapes."
        ]
    },
    {
        "name": "PAA",
        "year": "1998",
        "info": "Volume 1, 1998",
        "count": 27,
        "papers": [
            "Editorial.",
            "Digital boundary tracking.",
            "Combining classifiers: A theoretical framework.",
            "Recognition of legal amounts on bank cheques.",
            "Reclustering techniques improve early vision feature maps.",
            "Resolution of pattern recognition problems using a hybrid Genetic/Random Neural Network learning algorithm.",
            "LED cosmetic flaw vision inspection system.",
            "Affective computing - by Rosalind Picard. Cambridge, Mass, : MIT Press, 1997. Pp. xxii=252. $27.50 cloth.",
            "Principal component neural networks - Theory and applications - By K.I. Diamantaras and S.Y. Kung. John Wiley, New York, 1996. xii+255 pp. ISBN 0-471-05436-4.",
            "A Monte Carlo evaluation of the moving method, k-means and two self-organising neural networks.",
            "Knowledge-based spatiotemporal linear abstraction.",
            "Improving stereovision matching through supervised learning.",
            "A beam search algorithm for PFSA inference.",
            "Recognition of hand-printed Chinese characters using decision trees/machine learning C4.5 system.",
            "Pattern classification - By J. Schürmann. Wiley-Interscience, ISBN: 0-471-13534-8.",
            "Generic object recognition using form and function - By louise stark and kevin bowyer. World scientic, 1996.",
            "Nonparametric image segmentation.",
            "Dual classifier system for handprinted alphanumeric character recognition.",
            "Skeletonisation: An electrostatic field-based approach.",
            "Pose estimation and object identification using complex algebraic representations.",
            "A graph isomorphism algorithm for object recognition.",
            "Hacking the world: On the origin of objects - by B.C. Smith, 1996, Cambridge, MA.: MIT Press.",
            "Homologue matching applications: Recognition of overlapped chromosomes.",
            "Arabic glove-talk (AGT): A communication aid for vocally impaired.",
            "Fusion of images interpreted by a new fuzzy classifier.",
            "Mean fields and two-dimensional Markov random fields in image analysis.",
            "Book Review."
        ]
    }
]