[
    {
        "year": "2020",
        "name": "16th PPSN 2020",
        "info": "Leiden, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2020-1",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XVI - 16th International Conference, PPSN 2020, Leiden, The Netherlands, September 5-9, 2020, Proceedings, Part I.",
                "count": 50,
                "papers": [
                    "Evolving Deep Forest with Automatic Feature Extraction for Image Classification Using Genetic Programming.",
                    "Fast Perturbative Algorithm Configurators.",
                    "Dominance, Indicator and Decomposition Based Search for Multi-objective QAP: Landscape Analysis and Automated Algorithm Selection.",
                    "Deep Learning as a Competitive Feature-Free Approach for Automated Algorithm Selection on the Traveling Salesperson Problem.",
                    "Automatic Configuration of a Multi-objective Local Search for Imbalanced Classification.",
                    "Multi-fidelity Optimization Approach Under Prior and Posterior Constraints and Its Application to Compliance Minimization.",
                    "Model-Based Algorithm Configuration with Default-Guided Probabilistic Sampling.",
                    "Evolving Sampling Strategies for One-Shot Optimization Tasks.",
                    "A Surrogate-Assisted Evolutionary Algorithm with Random Feature Selection for Large-Scale Expensive Problems.",
                    "Designing Air Flow with Surrogate-Assisted Phenotypic Niching.",
                    "Variance Reduction for Better Sampling in Continuous Domains.",
                    "High Dimensional Bayesian Optimization Assisted by Principal Component Analysis.",
                    "Simple Surrogate Model Assisted Optimization with Covariance Matrix Adaptation.",
                    "Proposal of a Realistic Many-Objective Test Suite.",
                    "Approximate Hypervolume Calculation with Guaranteed or Confidence Bounds.",
                    "Can Compact Optimisation Algorithms Be Structurally Biased?",
                    "Parallelized Bayesian Optimization for Expensive Robot Controller Evolution.",
                    "Revisiting Population Models in Differential Evolution on a Limited Budget of Evaluations.",
                    "Continuous Optimization Benchmarks by Simulation.",
                    "Comparative Run-Time Performance of Evolutionary Algorithms on Multi-objective Interpolated Continuous Optimisation Problems.",
                    "On the Design of a Partition Crossover for the Quadratic Assignment Problem.",
                    "A Permutational Boltzmann Machine with Parallel Tempering for Solving Combinatorial Optimization Problems.",
                    "Solution Repair by Inequality Network Propagation in LocalSolver.",
                    "Optimising Tours for the Weighted Traveling Salesperson Problem and the Traveling Thief Problem: A Structural Comparison of Solutions.",
                    "Decentralized Combinatorial Optimization.",
                    "PbO-CCSAT: Boosting Local Search for Satisfiability Using Programming by Optimisation.",
                    "Evaluation of a Permutation-Based Evolutionary Framework for Lyndon Factorizations.",
                    "Optimising Monotone Chance-Constrained Submodular Functions Using Evolutionary Multi-objective Algorithms.",
                    "Parameter-Less Population Pyramid for Permutation-Based Problems.",
                    "Biologically Plausible Learning of Text Representation with Spiking Neural Networks.",
                    "Multi-Objective Counterfactual Explanations.",
                    "Multi-objective Magnitude-Based Pruning for Latency-Aware Deep Neural Network Compression.",
                    "Network Representation Learning Based on Topological Structure and Vertex Attributes.",
                    "A Committee of Convolutional Neural Networks for Image Classification in the Concurrent Presence of Feature and Label Noise.",
                    "Improving Imbalanced Classification by Anomaly Detection.",
                    "BACS: A Thorough Study of Using Behavioral Sequences in ACS2.",
                    "Nash Equilibrium as a Solution in Supervised Classification.",
                    "Analyzing the Components of Distributed Coevolutionary GAN Training.",
                    "Canonical Correlation Discriminative Learning for Domain Adaptation.",
                    "Improving Sampling in Evolution Strategies Through Mixture-Based Distributions Built from Past Problem Instances.",
                    "The Hessian Estimation Evolution Strategy.",
                    "Large Population Sizes and Crossover Help in Dynamic Environments.",
                    "Neuromemetic Evolutionary Optimization.",
                    "Evolved Gossip Contracts - A Framework for Designing Multi-agent Systems.",
                    "A SHADE-Based Algorithm for Large Scale Global Optimization.",
                    "Evolutionary Algorithms with Self-adjusting Asymmetric Mutation.",
                    "Behavior Optimization in Large Distributed Systems Modeled by Cellular Automata.",
                    "Learning Step-Size Adaptation in CMA-ES.",
                    "Sparse Inverse Covariance Learning for CMA-ES with Graphical Lasso.",
                    "Adaptive Stochastic Natural Gradient Method for Optimizing Functions with Low Effective Dimensionality."
                ]
            },
            {
                "sub_name_abbr": "conf/ppsn/2020-2",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XVI - 16th International Conference, PPSN 2020, Leiden, The Netherlands, September 5-9, 2020, Proceedings, Part II.",
                "count": 49,
                "papers": [
                    "Generation of New Scalarizing Functions Using Genetic Programming.",
                    "The Usability Argument for Refinement Typed Genetic Programming.",
                    "Program Synthesis in a Continuous Space Using Grammars and Variational Autoencoders.",
                    "Cooperative Co-Evolutionary Genetic Programming for High Dimensional Problems.",
                    "Image Feature Learning with Genetic Programming.",
                    "Learning a Formula of Interpretability to Learn Interpretable Formulas.",
                    "On Stochastic Fitness Landscapes: Local Optimality and Fitness Landscape Analysis for Stochastic Search Operators.",
                    "Fitness Landscape Analysis of Dimensionally-Aware Genetic Programming Featuring Feynman Equations.",
                    "Global Landscape Structure and the Random MAX-SAT Phase Transition.",
                    "Exploratory Landscape Analysis is Strongly Sensitive to the Sampling Strategy.",
                    "One PLOT to Show Them All: Visualization of Efficient Sets in Multi-objective Landscapes.",
                    "On Sharing Information Between Sub-populations in MOEA/S.",
                    "Multi-objective Optimization by Uncrowded Hypervolume Gradient Ascent.",
                    "An Ensemble Indicator-Based Density Estimator for Evolutionary Multi-objective Optimization.",
                    "Ensuring Smoothly Navigable Approximation Sets by Bézier Curve Parameterizations in Evolutionary Bi-objective Optimization.",
                    "Many-Objective Test Database Generation for SQL.",
                    "A New Paradigm in Interactive Evolutionary Multiobjective Optimization.",
                    "Hypervolume Optimal μ-Distributions on Line-Based Pareto Fronts in Three Dimensions.",
                    "Adaptive Operator Selection Based on Dynamic Thompson Sampling for MOEA/D.",
                    "A Study of Swarm Topologies and Their Influence on the Performance of Multi-Objective Particle Swarm Optimizers.",
                    "Visualising Evolution History in Multi- and Many-objective Optimisation.",
                    "Improving Many-Objective Evolutionary Algorithms by Means of Edge-Rotated Cones.",
                    "Human-Like Summaries from Heterogeneous and Time-Windowed Software Development Artefacts.",
                    "A Search for Additional Structure: The Case of Cryptographic S-boxes.",
                    "Evolutionary Multi-objective Design of SARS-CoV-2 Protease Inhibitor Candidates.",
                    "Generic Relative Relations in Hierarchical Gene Expression Data Classification.",
                    "A Variable Neighborhood Search for the Job Sequencing with One Common and Multiple Secondary Resources Problem.",
                    "Evolutionary Graph-Based V+E Optimization for Protection Against Epidemics.",
                    "Human-Derived Heuristic Enhancement of an Evolutionary Algorithm for the 2D Bin-Packing Problem.",
                    "Towards Novel Meta-heuristic Algorithms for Dynamic Capacitated Arc Routing Problems.",
                    "Robust Evolutionary Bi-objective Optimization for Prostate Cancer Treatment with High-Dose-Rate Brachytherapy.",
                    "A Hybrid Evolutionary Algorithm for Reliable Facility Location Problem.",
                    "Optimality-Based Analysis of XCSF Compaction in Discrete Reinforcement Learning.",
                    "Hybridizing the 1/5-th Success Rule with Q-Learning for Controlling the Mutation Rate of an Evolutionary Algorithm.",
                    "Fitness Landscape Features and Reward Shaping in Reinforcement Learning Policy Spaces.",
                    "ClipUp: A Simple and Powerful Optimizer for Distribution-Based Policy Evolution.",
                    "Warm-Start AlphaZero Self-play Search Enhancements.",
                    "Runtime Analysis of a Heavy-Tailed (1+(λ , λ )) Genetic Algorithm on Jump Functions.",
                    "First Steps Towards a Runtime Analysis When Starting with a Good Solution.",
                    "Optimal Mutation Rates for the (1+λ ) EA on OneMax.",
                    "Maximizing Submodular or Monotone Functions Under Partition Matroid Constraints by Multi-objective Evolutionary Algorithms.",
                    "Lower Bounds for Non-elitist Evolutionary Algorithms via Negative Multiplicative Drift.",
                    "Exponential Upper Bounds for the Runtime of Randomized Search Heuristics.",
                    "Analysis on the Efficiency of Multifactorial Evolutionary Algorithms.",
                    "Improved Fixed-Budget Results via Drift Analysis.",
                    "On Averaging the Best Samples in Evolutionary Computation.",
                    "Filter Sort Is $\\varOmega (N^3)$ in the Worst Case.",
                    "Approximation Speed-Up by Quadratization on LeadingOnes.",
                    "Benchmarking a (μ +λ ) Genetic Algorithm with Configurable Crossover Probability."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th PPSN 2018",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2018-1",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XV - 15th International Conference, Coimbra, Portugal, September 8-12, 2018, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "A Comparative Study of Large-Scale Variants of CMA-ES.",
                    "Design of a Surrogate Model Assisted (1 + 1)-ES.",
                    "Generalized Self-adapting Particle Swarm Optimization Algorithm.",
                    "PSO-Based Search Rules for Aerial Swarms Against Unexplored Vector Fields via Genetic Programming.",
                    "Towards an Adaptive CMA-ES Configurator.",
                    "A Probabilistic Tree-Based Representation for Non-convex Minimum Cost Flow Problems.",
                    "Comparative Study of Different Memetic Algorithm Configurations for the Cyclic Bandwidth Sum Problem.",
                    "Efficient Recombination in the Lin-Kernighan-Helsgaun Traveling Salesman Heuristic.",
                    "Escherization with a Distance Function Focusing on the Similarity of Local Structure.",
                    "Evolutionary Search of Binary Orthogonal Arrays.",
                    "Heavy-Tailed Mutation Operators in Single-Objective Combinatorial Optimization.",
                    "Heuristics in Permutation GOMEA for Solving the Permutation Flowshop Scheduling Problem.",
                    "On the Performance of Baseline Evolutionary Algorithms on the Dynamic Knapsack Problem.",
                    "On the Synthesis of Perturbative Heuristics for Multiple Combinatorial Optimisation Domains.",
                    "EDDA-V2 - An Improvement of the Evolutionary Demes Despeciation Algorithm.",
                    "Extending Program Synthesis Grammars for Grammar-Guided Genetic Programming.",
                    "Filtering Outliers in One Step with Genetic Programming.",
                    "GOMGE: Gene-Pool Optimal Mixing on Grammatical Evolution.",
                    "Self-adaptive Crossover in Genetic Programming: The Case of the Tartarus Problem.",
                    "A Decomposition-Based Evolutionary Algorithm for Multi-modal Multi-objective Optimization.",
                    "A Double-Niched Evolutionary Algorithm and Its Behavior on Polygon-Based Problems.",
                    "Artificial Decision Maker Driven by PSO: An Approach for Testing Reference Point Based Interactive Methods.",
                    "A Simple Indicator Based Evolutionary Algorithm for Set-Based Minmax Robustness.",
                    "Extending the Speed-Constrained Multi-objective PSO (SMPSO) with Reference Point Based Preference Articulation.",
                    "Improving 1by1EA to Handle Various Shapes of Pareto Fronts.",
                    "New Initialisation Techniques for Multi-objective Local Search - Application to the Bi-objective Permutation Flowshop.",
                    "Towards a More General Many-objective Evolutionary Optimizer.",
                    "Towards Large-Scale Multiobjective Optimisation with a Hybrid Algorithm for Non-dominated Sorting.",
                    "Tree-Structured Decomposition and Adaptation in MOEA/D.",
                    "Use of Reference Point Sets in a Decomposition-Based Multi-Objective Evolutionary Algorithm.",
                    "Use of Two Reference Points in Hypervolume-Based Evolutionary Multiobjective Optimization Algorithms.",
                    "Introducing an Event-Based Architecture for Concurrent and Distributed Evolutionary Algorithms.",
                    "Analyzing Resilience to Computational Glitches in Island-Based Evolutionary Algorithms.",
                    "Spark Clustering Computing Platform Based Parallel Particle Swarm Optimizers for Computationally Expensive Global Optimization.",
                    "Weaving of Metaheuristics with Cooperative Parallelism.",
                    "Conditional Preference Learning for Personalized and Context-Aware Journey Planning.",
                    "Critical Fractile Optimization Method Using Truncated Halton Sequence with Application to SAW Filter Design.",
                    "Directed Locomotion for Modular Robots with Evolvable Morphologies.",
                    "Optimisation and Illumination of a Real-World Workforce Scheduling and Routing Application (WSRP) via Map-Elites.",
                    "Prototype Discovery Using Quality-Diversity.",
                    "Sparse Incomplete LU-Decomposition for Wave Farm Designs Under Realistic Conditions.",
                    "Understanding Climate-Vegetation Interactions in Global Rainforests Through a GP-Tree Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/ppsn/2018-2",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XV - 15th International Conference, Coimbra, Portugal, September 8-12, 2018, Proceedings, Part II.",
                "count": 39,
                "papers": [
                    "A General Dichotomy of Evolutionary Algorithms on Monotone Functions.",
                    "Artificial Immune Systems Can Find Arbitrarily Good Approximations for the NP-Hard Partition Problem.",
                    "A Simple Proof for the Usefulness of Crossover in Black-Box Optimization.",
                    "Destructiveness of Lexicographic Parsimony Pressure and Alleviation by a Concatenation Crossover in Genetic Programming.",
                    "Exploration and Exploitation Without Mutation: Solving the Jump Function in \\varTheta (n) Time.",
                    "Fast Artificial Immune Systems.",
                    "First-Hitting Times for Finite State Spaces.",
                    "First-Hitting Times Under Additive Drift.",
                    "Level-Based Analysis of the Population-Based Incremental Learning Algorithm.",
                    "Precise Runtime Analysis for Plateaus.",
                    "Ring Migration Topology Helps Bypassing Local Optima.",
                    "Runtime Analysis of Evolutionary Algorithms for the Knapsack Problem with Favorably Correlated Weights.",
                    "Theoretical Analysis of Lexicase Selection in Multi-objective Optimization.",
                    "Towards a Running Time Analysis of the (1+1)-EA for OneMax and LeadingOnes Under General Bit-Wise Noise.",
                    "A Surrogate Model Based on Walsh Decomposition for Pseudo-Boolean Functions.",
                    "Bridging Elementary Landscapes and a Geometric Theory of Evolutionary Algorithms: First Steps.",
                    "Empirical Analysis of Diversity-Preserving Mechanisms on Example Landscapes for Multimodal Optimisation.",
                    "Linear Combination of Distance Measures for Surrogate Models in Genetic Programming.",
                    "On Pareto Local Optimal Solutions Networks.",
                    "Perturbation Strength and the Global Structure of QAP Fitness Landscapes.",
                    "Sampling Local Optima Networks of Large Combinatorial Search Spaces: The QAP Case.",
                    "Algorithm Configuration Landscapes: - More Benign Than Expected?",
                    "A Model-Based Framework for Black-Box Problem Comparison Using Gaussian Processes.",
                    "A Suite of Computationally Expensive Shape Optimisation Problems Using Computational Fluid Dynamics.",
                    "Automated Selection and Configuration of Multi-Label Classification Algorithms with Grammar-Based Genetic Programming.",
                    "Performance Assessment of Recursive Probability Matching for Adaptive Operator Selection in Differential Evolution.",
                    "Program Trace Optimization.",
                    "Sampling Heuristics for Multi-objective Dynamic Job Shop Scheduling Using Island Based Parallel Genetic Programming.",
                    "Sensitivity of Parameter Control Mechanisms with Respect to Their Initialization.",
                    "Tailoring Instances of the 1D Bin Packing Problem for Assessing Strengths and Weaknesses of Its Solvers.",
                    "Adaptive Advantage of Learning Strategies: A Study Through Dynamic Landscape.",
                    "A First Analysis of Kernels for Kriging-Based Optimization in Hierarchical Search Spaces.",
                    "Challenges in High-Dimensional Reinforcement Learning with Evolution Strategies.",
                    "Lamarckian Evolution of Convolutional Neural Networks.",
                    "Learning Bayesian Networks with Algebraic Differential Evolution.",
                    "Optimal Neuron Selection and Generalization: NK Ensemble Neural Networks.",
                    "What Are the Limits of Evolutionary Induction of Decision Trees?",
                    "Tutorials at PPSN 2018.",
                    "Workshops at PPSN 2018."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "14th PPSN 2016",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2016",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XIV - 14th International Conference, Edinburgh, UK, September 17-21, 2016, Proceedings.",
                "count": 95,
                "papers": [
                    "Online Model Selection for Restricted Covariance Matrix Adaptation.",
                    "Genotype Regulation by Self-modifying Instruction-Based Development on Cellular Automata.",
                    "Evolution Under Strong Noise: A Self-Adaptive Evolution Strategy Can Reach the Lower Performance Bound - The pcCMSA-ES.",
                    "An Evolutionary Hyper-heuristic for the Software Project Scheduling Problem.",
                    "The Multiple Insertion Pyramid: A Fast Parameter-Less Population Scheme.",
                    "Doubly Trained Evolution Control for the Surrogate CMA-ES.",
                    "Efficient Global Optimization with Indefinite Kernels.",
                    "A Fitness Cloud Model for Adaptive Metaheuristic Selection Methods.",
                    "A Study of the Performance of Self-★ Memetic Algorithms on Heterogeneous Ephemeral Environments.",
                    "Lyapunov Design of a Simple Step-Size Adaptation Strategy Based on Success.",
                    "TADE: Tight Adaptive Differential Evolution.",
                    "An Extension of Algebraic Differential Evolution for the Linear Ordering Problem with Cumulative Costs.",
                    "Analysing the Performance of Migrating Birds Optimisation Approaches for Large Scale Continuous Problems.",
                    "How Far Are We from an Optimal, Adaptive DE?",
                    "Feature Based Algorithm Configuration: A Case Study with Differential Evolution.",
                    "An Asynchronous and Steady State Update Strategy for the Particle Swarm Optimization Algorithm.",
                    "Augmented Lagrangian Constraint Handling for CMA-ES - Case of a Single Linear Constraint.",
                    "An Active-Set Evolution Strategy for Optimization with Known Constraints.",
                    "Speciated Evolutionary Algorithm for Dynamic Constrained Optimisation.",
                    "On Constraint Handling in Surrogate-Assisted Evolutionary Many-Objective Optimization.",
                    "Artificially Inducing Environmental Changes in Evolutionary Dynamic Optimization.",
                    "Efficient Sampling When Searching for Robust Solutions.",
                    "Optimising Quantisation Noise in Energy Measurement.",
                    "Syntactical Similarity Learning by Means of Grammatical Evolution.",
                    "Hierarchical Knowledge in Self-Improving Grammar-Based Genetic Programming.",
                    "Parallel Hierarchical Evolution of String Library Functions.",
                    "On the Non-uniform Redundancy in Grammatical Evolution.",
                    "Tournament Selection Based on Statistical Test in Genetic Programming.",
                    "Kin Selection with Twin Genetic Programming.",
                    "Using Scaffolding with Partial Call-Trees to Improve Search.",
                    "Feature Extraction for Surrogate Models in Genetic Programming.",
                    "A General-Purpose Framework for Genetic Improvement.",
                    "On the Use of Semantics in Multi-objective Genetic Programming.",
                    "Semantic Forward Propagation for Symbolic Regression.",
                    "Reducing Dimensionality to Improve Search in Semantic Genetic Programming.",
                    "iMOACO _\\mathbb R : A New Indicator-Based Multi-objective Ant Colony Optimization Algorithm for Continuous Search Spaces.",
                    "Variable Interaction in Multi-objective Optimization Problems.",
                    "Improving Efficiency of Bi-level Worst Case Optimization.",
                    "Multi-objective Selection of Algorithm Portfolios: Experimental Validation.",
                    "Multi-objective Local Search Based on Decomposition.",
                    "Analyzing Inter-objective Relationships: A Case Study of Software Upgradability.",
                    "Multicriteria Building Spatial Design with Mixed Integer Evolutionary Algorithms.",
                    "The Competing Travelling Salespersons Problem Under Multi-criteria.",
                    "A Parallel Multi-objective Memetic Algorithm Based on the IGD+ Indicator.",
                    "Towards Automatic Testing of Reference Point Based Interactive Methods.",
                    "Towards Many-Objective Optimisation with Hyper-heuristics: Identifying Good Heuristics with Indicators.",
                    "Use of Piecewise Linear and Nonlinear Scalarizing Functions in MOEA/D.",
                    "Pareto Inspired Multi-objective Rule Fitness for Noise-Adaptive Rule-Based Machine Learning.",
                    "Decomposition-Based Approach for Solving Large Scale Multi-objective Problems.",
                    "An Evolutionary Framework for Replicating Neurophysiological Data with Spiking Neural Networks.",
                    "A Cross-Platform Assessment of Energy Consumption in Evolutionary Algorithms - Towards Energy-Aware Bioinspired Algorithms.",
                    "Comparing Asynchronous and Synchronous Parallelization of the SMS-EMOA.",
                    "A Parallel Version of SMS-EMOA for Many-Objective Optimization Problems.",
                    "Evolution of Active Categorical Image Classification via Saccadic Eye Movement.",
                    "Cooperative Coevolution of Control for a Real Multirobot System.",
                    "Replicating the Stroop Effect Using a Developmental Spatial Neuroevolution System.",
                    "Evolving Cryptographic Pseudorandom Number Generators.",
                    "Exploring Uncertainty and Movement in Categorical Perception Using Robots.",
                    "Community Structure Detection for the Functional Connectivity Networks of the Brain.",
                    "Data Classification Using Carbon-Nanotubes and Evolutionary Algorithms.",
                    "WS Network Design Problem with Nonlinear Pricing Solved by Hybrid Algorithm.",
                    "A Novel Efficient Mutation for Evolutionary Design of Combinational Logic Circuits.",
                    "Fast and Effective Multi-objective Optimisation of Submerged Wave Energy Converters.",
                    "Evolution of Spiking Neural Networks Robust to Noise and Damage for Control of Simple Animats.",
                    "Anomaly Detection with the Voronoi Diagram Evolutionary Algorithm.",
                    "Evolving Spatially Aggregated Features from Satellite Imagery for Regional Modeling.",
                    "A Hybrid Autoencoder and Density Estimation Model for Anomaly Detection.",
                    "Parameterized Analysis of Multi-objective Evolutionary Algorithms and the Weighted Vertex Cover Problem.",
                    "Fixed-Parameter Single Objective Search Heuristics for Minimum Vertex Cover.",
                    "What Does the Evolution Path Learn in CMA-ES?",
                    "Graceful Scaling on Uniform Versus Steep-Tailed Noise.",
                    "On the Robustness of Evolving Populations.",
                    "Provably Optimal Self-adjusting Step Sizes for Multi-valued Decision Variables.",
                    "Example Landscapes to Support Analysis of Multimodal Optimisation.",
                    "Self-adaptation of Mutation Rates in Non-elitist Populations.",
                    "Hypervolume Sharpe-Ratio Indicator: Formalization and First Theoretical Results.",
                    "k-Bit Mutation with Self-Adjusting k Outperforms Standard Bit Mutation.",
                    "Selection Hyper-heuristics Can Provably Be Helpful in Evolutionary Multi-objective Optimization.",
                    "RK-EDA: A Novel Random Key Based Estimation of Distribution Algorithm.",
                    "REMEDA: Random Embedding EDA for Optimising Functions with Intrinsic Dimension.",
                    "Feature-Based Diversity Optimization for Problem Instance Classification.",
                    "Searching for Quality Diversity When Diversity is Unaligned with Quality.",
                    "Emergence of Diversity and Its Benefits for Crossover in Genetic Algorithms.",
                    "Coarse-Grained Barrier Trees of Fitness Landscapes.",
                    "Rapid Phenotypic Landscape Exploration Through Hierarchical Spatial Partitioning.",
                    "Understanding Environmental Influence in an Open-Ended Evolutionary Algorithm.",
                    "Simple Random Sampling Estimation of the Number of Local Optima.",
                    "evoVision3D: A Multiscale Visualization of Evolutionary Histories.",
                    "Landscape Features for Computationally Expensive Evaluation Functions: Revisiting the Problem of Noise.",
                    "Towards Analyzing Multimodality of Continuous Multiobjective Landscapes.",
                    "Population Diversity Measures Based on Variable-Order Markov Models for the Traveling Salesman Problem.",
                    "Convergence Versus Diversity in Multiobjective Optimization.",
                    "Tunnelling Crossover Networks for the Asymmetric TSP.",
                    "The Workshops at PPSN 2016.",
                    "Tutorials at PPSN 2016."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "13th PPSN 2014",
        "info": "Ljubljana, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2014",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XIII - 13th International Conference, Ljubljana, Slovenia, September 13-17, 2014. Proceedings.",
                "count": 93,
                "papers": [
                    "Some Computational Aspects of Robot Kinematic Redundancy.",
                    "Power Distribution Network Reconfiguration by Evolutionary Integer Programming.",
                    "In Vivo Veritas: Towards the Evolution of Things.",
                    "Online Black-Box Algorithm Portfolios for Continuous Optimization.",
                    "Shuffle and Mate: A Dynamic Model for Spatially Structured Evolutionary Algorithms.",
                    "How to Assess Step-Size Adaptation Mechanisms in Randomised Search.",
                    "Maximum Likelihood-Based Online Adaptation of Hyper-Parameters in CMA-ES.",
                    "Run-Time Parameter Selection and Tuning for Energy Optimization Algorithms.",
                    "Towards a Method for Automatic Algorithm Configuration: A Design Evaluation Using Tuners.",
                    "Parameter Prediction Based on Features of Evolved Instances for Ant Colony Optimization and the Traveling Salesperson Problem.",
                    "Self-Adaptive Genotype-Phenotype Maps: Neural Networks as a Meta-Representation.",
                    "The Baldwin Effect Hinders Self-Adaptation.",
                    "On Low Complexity Acceleration Techniques for Randomized Optimization.",
                    "Stopping Criteria for Multimodal Optimization.",
                    "VLR: A Memory-Based Optimization Heuristic.",
                    "A Differential Evolution Algorithm for the Permutation Flowshop Scheduling Problem with Total Flow Time Criterion.",
                    "A Taxonomy of Heterogeneity and Dynamics in Particle Swarm Optimisation.",
                    "Derivation of a Micro-Macro Link for Collective Decision-Making Systems - Uncover Network Features Based on Drift Measurements.",
                    "Messy Coding in the XCS Classifier System for Sequence Labeling.",
                    "Reevaluating Exponential Crossover in Differential Evolution.",
                    "An Extended Michigan-Style Learning Classifier System for Flexible Supervised Learning, Classification, and Data Mining.",
                    "A Cooperative Evolutionary Approach to Learn Communities in Multilayer Networks.",
                    "Novelty Search in Competitive Coevolution.",
                    "An Immune-Inspired Algorithm for the Set Cover Problem.",
                    "Natural Gradient Approach for Linearly Constrained Continuous Optimization.",
                    "Evolutionary Constrained Optimization for a Jupiter Capture.",
                    "Viability Principles for Constrained Optimization Using a (1+1)-CMA-ES.",
                    "On the Life-Long Learning Capabilities of a NELLI*: A Hyper-Heuristic Optimisation System.",
                    "Adaptation in Nonlinear Learning Models for Nonstationary Tasks.",
                    "On the Effectiveness of Sampling for Evolutionary Optimization in Noisy Environments.",
                    "Evolving Mixtures of n-gram Models for Sequencing and Schedule Optimization.",
                    "A Study on Multimemetic Estimation of Distribution Algorithms.",
                    "Factoradic Representation for Permutation Optimisation.",
                    "Combining Model-Based EAs for Mixed-Integer Problems.",
                    "A New EDA by a Gradient-Driven Density.",
                    "From Expected Improvement to Investment Portfolio Improvement: Spreading the Risk in Kriging-Based Optimization.",
                    "Distance Measures for Permutations in Combinatorial Efficient Global Optimization.",
                    "Boosting Search for Recursive Functions Using Partial Call-Trees.",
                    "Compressing Regular Expression Sets for Deep Packet Inspection.",
                    "Inferring and Exploiting Problem Structure with Schema Grammar.",
                    "Bent Function Synthesis by Means of Cartesian Genetic Programming.",
                    "Population Exploration on Genotype Networks in Genetic Programming.",
                    "Improving Genetic Programming with Behavioral Consistency Measure.",
                    "On Effective and Inexpensive Local Search Techniques in Genetic Programming Regression.",
                    "Combining Semantically-Effective and Geometric Crossover Operators for Genetic Programming.",
                    "On the Locality of Standard Search Operators in Grammatical Evolution.",
                    "Recurrent Cartesian Genetic Programming.",
                    "An Analysis on Selection for High-Resolution Approximations in Many-Objective Optimization.",
                    "A Multiobjective Evolutionary Optimization Framework for Protein Purification Process Design.",
                    "Automatic Design of Evolutionary Algorithms for Multi-Objective Combinatorial Optimization.",
                    "Generic Postprocessing via Subset Selection for Hypervolume and Epsilon-Indicator.",
                    "A Provably Asymptotically Fast Version of the Generalized Jensen Algorithm for Non-dominated Sorting.",
                    "Clustering-Based Selection for Evolutionary Many-Objective Optimization.",
                    "On the Impact of Multiobjective Scalarizing Functions.",
                    "Multi-objective Quadratic Assignment Problem Instances Generator with a Known Optimum Solution.",
                    "Optimized Approximation Sets for Low-Dimensional Benchmark Pareto Fronts.",
                    "Start Small, Grow Big? Saving Multi-objective Function Evaluations.",
                    "Queued Pareto Local Search for Multi-Objective Optimization.",
                    "Distance-Based Analysis of Crossover Operators for Many-Objective Knapsack Problems.",
                    "Discovery of Implicit Objectives by Compression of Interaction Matrix in Test-Based Problems.",
                    "Local Optimal Sets and Bounded Archiving on Multi-objective NK-Landscapes with Correlated Objectives.",
                    "Racing Multi-objective Selection Probabilities.",
                    "Shake Them All! - Rethinking Selection and Replacement in MOEA/D.",
                    "MH-MOEA: A New Multi-Objective Evolutionary Algorithm Based on the Maximin Fitness Function and the Hypervolume Indicator.",
                    "Empirical Performance of the Approximation of the Least Hypervolume Contributor.",
                    "A Portfolio Optimization Approach to Selection in Multiobjective Evolutionary Algorithms.",
                    "Using a Family of Curves to Approximate the Pareto Front of a Multi-Objective Optimization Problem.",
                    "Travelling Salesman Problem Solved 'in materio' by Evolved Carbon Nanotube Device.",
                    "Randomized Parameter Settings for Heterogeneous Workers in a Pool-Based Evolutionary Algorithm.",
                    "PaDe: A Parallel Algorithm Based on the MOEA/D Framework and the Island Model.",
                    "Evolution-In-Materio: Solving Machine Learning Classification Problems Using Materials.",
                    "An Analysis of Migration Strategies in Island-Based Multimemetic Algorithms.",
                    "Tuning Evolutionary Multiobjective Optimization for Closed-Loop Estimation of Chromatographic Operating Conditions.",
                    "A Geometrical Approach to the Incompatible Substructure Problem in Parallel Self-Assembly.",
                    "Application of Evolutionary Methods to Semiconductor Double-Chirped Mirrors Design.",
                    "Evolving Neural Network Weights for Time-Series Prediction of General Aviation Flight Data.",
                    "Random Partial Neighborhood Search for University Course Timetabling Problem.",
                    "Balancing Bicycle Sharing Systems: An Analysis of Path Relinking and Recombination within a GRASP Hybrid.",
                    "Multiobjective Selection of Input Sensors for SVR Applied to Road Traffic Prediction.",
                    "Evolving DPA-Resistant Boolean Functions.",
                    "Combining Evolutionary Computation and Algebraic Constructions to Find Cryptography-Relevant Boolean Functions.",
                    "A Memetic Algorithm for Multi Layer Hierarchical Ring Network Design.",
                    "Scheduling the English Football League with a Multi-objective Evolutionary Algorithm.",
                    "Coupling Evolution and Information Theory for Autonomous Robotic Exploration.",
                    "Local Optima and Weight Distribution in the Number Partitioning Problem.",
                    "Quasi-Stability of Real Coded Finite Populations.",
                    "On the Use of Evolution Strategies for Optimization on Spherical Manifolds.",
                    "Unbiased Black-Box Complexity of Parallel Search.",
                    "A Generalized Markov-Chain Modelling Approach to (1, λ)-ES Linear Optimization.",
                    "Level-Based Analysis of Genetic Algorithms and Other Search Processes.",
                    "Maximizing Submodular Functions under Matroid Constraints by Multi-objective Evolutionary Algorithms.",
                    "On the Runtime Analysis of Fitness Sharing Mechanisms.",
                    "Runtime Analysis of Evolutionary Algorithms on Randomly Constructed High-Density Satisfiable 3-CNF Formulas."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th PPSN 2012",
        "info": "Taormina, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2012-1",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XII - 12th International Conference, Taormina, Italy, September 1-5, 2012, Proceedings, Part I.",
                "count": 53,
                "papers": [
                    "Convergence of the IGO-Flow of Isotropic Gaussian Distributions on Convex Quadratic Problems.",
                    "Homogeneous and Heterogeneous Island Models for the Set Cover Problem.",
                    "Geometric Semantic Genetic Programming.",
                    "Efficient Negative Selection Algorithms by Sampling and Approximate Counting.",
                    "Convergence of the Continuous Time Trajectories of Isotropic Evolution Strategies on Monotonic $\\mathcal C^2$ -composite Functions.",
                    "A Parameterized Runtime Analysis of Simple Evolutionary Algorithms for Makespan Scheduling.",
                    "On Algorithm-Dependent Boundary Case Identification for Problem Classes.",
                    "Cumulative Step-Size Adaptation on Linear Functions.",
                    "On the Behaviour of the (1, λ)-σSA-ES for a Constrained Linear Problem.",
                    "An Empirical Evaluation of O(1) Steepest Descent for NK-Landscapes.",
                    "Experimental Supplements to the Computational Complexity Analysis of Genetic Programming for Problems Modelling Isolated Program Semantics.",
                    "ACO Beats EA on a Dynamic Pseudo-Boolean Function.",
                    "Runtime Analysis of Simple Interactive Evolutionary Biobjective Optimization Algorithms.",
                    "Parsimony Pressure versus Multi-objective Optimization for Variable Length Representations.",
                    "An Evolutionary and Graph-Based Method for Image Segmentation.",
                    "Real-Time GPU Based Road Sign Detection and Classification.",
                    "Acceleration of Evolutionary Image Filter Design Using Coevolution in Cartesian GP.",
                    "Transfer Learning, Soft Distance-Based Bias, and the Hierarchical BOA.",
                    "Reinforcement Learning with N-tuples on the Game Connect-4.",
                    "Efficient Sampling and Handling of Variance in Tuning Data Mining Models.",
                    "A Spatial EA Framework for Parallelizing Machine Learning Methods.",
                    "Competing Mutating Agents for Bayesian Network Structure Learning.",
                    "A Meta-learning Prediction Model of Algorithm Performance for Continuous Optimization Problems.",
                    "Pruning GP-Based Classifier Ensembles by Bayesian Networks.",
                    "A Multi-parent Search Operator for Bayesian Network Building.",
                    "Enhancing Learning Capabilities by XCS with Best Action Mapping.",
                    "Using Expert Knowledge to Guide Covering and Mutation in a Michigan Style Learning Classifier System to Detect Epistasis and Heterogeneity.",
                    "On Measures to Build Linkage Trees in LTGA.",
                    "Evolvability Analysis of the Linkage Tree Genetic Algorithm.",
                    "Alternative Restart Strategies for CMA-ES.",
                    "Are State-of-the-Art Fine-Tuning Algorithms Able to Detect a Dummy Parameter?",
                    "Compressed Network Complexity Search.",
                    "Single Node Genetic Programming on Problems with Side Effects.",
                    "Generalized Compressed Network Search.",
                    "Analyzing Module Usage in Grammatical Evolution.",
                    "On the Anytime Behavior of IPOP-CMA-ES.",
                    "HappyCat - A Simple Function Class Where Well-Known Direct Search Algorithms Do Fail.",
                    "Differential Gene Expression with Tree-Adjunct Grammars.",
                    "Analysing the Effects of Diverse Operators in a Genetic Programming System.",
                    "Quantitative Analysis of Locally Geometric Semantic Crossover.",
                    "Length Scale for Characterising Continuous Optimization Problems.",
                    "Analyzing the Behaviour of Population-Based Algorithms Using Rayleigh Distribution.",
                    "Variable Transformations in Estimation of Distribution Algorithms.",
                    "Controlling Overfitting in Symbolic Regression Based on a Bias/Variance Error Decomposition.",
                    "On Spectral Invariance of Randomized Hessian and Covariance Matrix Adaptation Schemes.",
                    "Variable Neighborhood Search and GRASP for Three-Layer Hierarchical Ring Network Design.",
                    "Extracting Key Gene Regulatory Dynamics for the Direct Control of Mechanical Systems.",
                    "An Evolutionary Optimization Approach for Bulk Material Blending Systems.",
                    "Study of Cancer Hallmarks Relevance Using a Cellular Automaton Tumor Growth Model.",
                    "Between Selfishness and Altruism: Fuzzy Nash-Berge-Zhukovskii Equilibrium.",
                    "A Spanning Tree-Based Encoding of the MAX CUT Problem for Evolutionary Search.",
                    "A Hybrid Approach to Piecewise Modelling of Biochemical Systems.",
                    "An Empirical Comparison of CMA-ES in Dynamic Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/ppsn/2012-2",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XII - 12th International Conference, Taormina, Italy, September 1-5, 2012, Proceedings, Part II.",
                "count": 52,
                "papers": [
                    "Temporal Evolution of Design Principles in Engineering Systems: Analogies with Human Evolution.",
                    "Exploiting Prior Information in Multi-objective Route Planning.",
                    "Analysis on Population Size and Neighborhood Recombination on Many-Objective Optimization.",
                    "Clustering Criteria in Multiobjective Data Clustering.",
                    "Enhancing Profitability through Interpretability in Algorithmic Trading with a Multiobjective Evolutionary Fuzzy System.",
                    "Bootstrapping Aggregate Fitness Selection with Evolutionary Multi-Objective Optimization.",
                    "Network Topology Planning Using MOEA/D with Objective-Guided Operators.",
                    "Elitist Archiving for Multi-Objective Evolutionary Algorithms: To Adapt or Not to Adapt.",
                    "An Improved Multiobjectivization Strategy for HP Model-Based Protein Structure Prediction.",
                    "MOEA/D with Iterative Thresholding Algorithm for Sparse Optimization Problems.",
                    "A Study on Evolutionary Multi-Objective Optimization with Fuzzy Approximation for Computational Expensive Problems.",
                    "Multi-objective Optimization for Selecting and Scheduling Observations by Agile Earth Observing Satellites.",
                    "Tailoring ε-MOEA to Concept-Based Problems.",
                    "Recombination of Similar Parents in SMS-EMOA on Many-Objective 0/1 Knapsack Problems.",
                    "An Artificial Bee Colony Algorithm for the Unrelated Parallel Machines Scheduling Problem.",
                    "Controlling the Parameters of the Particle Swarm Optimization with a Self-Organized Criticality Model.",
                    "The Apiary Topology: Emergent Behavior in Communities of Particle Swarms.",
                    "ACO on Multiple GPUs with CUDA for Faster Solution of QAPs.",
                    "It's Fate: A Self-organising Evolutionary Algorithm.",
                    "Guide Objective Assisted Particle Swarm Optimization and Its Application to History Matching.",
                    "Animal Spirits in Population Spatial Dynamics.",
                    "Autonomous Shaping via Coevolutionary Selection of Training Experience.",
                    "A Parallel Cooperative Co-evolutionary Genetic Algorithm for the Composite SaaS Placement Problem in Cloud Computing.",
                    "Community Detection Using Cooperative Co-evolutionary Differential Evolution.",
                    "On-Line Evolution of Controllers for Aggregating Swarm Robots in Changing Environments.",
                    "Buildable Objects Revisited.",
                    "Collective Robot Navigation Using Diffusion Limited Aggregation.",
                    "Global Equilibrium Search Algorithms for Combinatorial Optimization Problems.",
                    "A Genetic Programming Approach for Evolving Highly-Competitive General Algorithms for Envelope Reduction in Sparse Matrices.",
                    "A Memetic Approach for the Max-Cut Problem.",
                    "An Improved Choice Function Heuristic Selection for Cross Domain Heuristic Search.",
                    "Optimizing Cellular Automata through a Meta-model Assisted Memetic Algorithm.",
                    "A Memetic Algorithm for Community Detection in Complex Networks.",
                    "Local Optima Networks, Landscape Autocorrelation and Heuristic Search Performance.",
                    "A Hyper-Heuristic Classifier for One Dimensional Bin Packing Problems: Improving Classification Accuracy by Attribute Evolution.",
                    "A Framework to Hybridize PBIL and a Hyper-heuristic for Dynamic Environments.",
                    "Parallelization Strategies for Hybrid Metaheuristics Using a Single GPU and Multi-core Resources.",
                    "Adaptive Operator Selection at the Hyper-level.",
                    "Improving Lin-Kernighan-Helsgaun with Crossover on Clustered Instances of the TSP.",
                    "A Comparative Study of Three GPU-Based Metaheuristics.",
                    "The Effect of the Set of Low-Level Heuristics on the Performance of Selection Hyper-heuristics.",
                    "Adaptive Evolutionary Algorithms and Extensions to the HyFlex Hyper-heuristic Framework.",
                    "Applying Genetic Regulatory Networks to Index Trading.",
                    "Evolutionary 3D-Shape Segmentation Using Satellite Seeds.",
                    "Benchmarking CHC on a New Application: The Software Project Scheduling Problem.",
                    "Automatic Evaluation Methods in Evolutionary Music: An Example with Bossa Melodies.",
                    "Efficient Discovery of Chromatography Equipment Sizing Strategies for Antibody Purification Processes Using Evolutionary Computing.",
                    "Beware the Parameters: Estimation of Distribution Algorithms Applied to Circles in a Square Packing.",
                    "Block Diagonal Natural Evolution Strategies.",
                    "Finding Good Affinity Patterns for Matchmaking Parties Assignment through Evolutionary Computation.",
                    "A Benchmark Generator for Dynamic Permutation-Encoded Problems.",
                    "Evolving Femtocell Algorithms with Dynamic and Stationary Training Scenarios."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th PPSN 2010",
        "info": "Kraków, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2010-1",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XI, 11th International Conference, Kraków, Poland, September 11-15, 2010, Proceedings, Part I.",
                "count": 73,
                "papers": [
                    "Optimal Fixed and Adaptive Mutation Rates for the LeadingOnes Problem.",
                    "Mirrored Sampling and Sequential Selection for Evolution Strategies.",
                    "Optimisation and Generalisation: Footprints in Instance Space.",
                    "Adaptive Drift Analysis.",
                    "Optimizing Monotone Functions Can Be Difficult.",
                    "Log-Linear Convergence of the Scale-Invariant (µ/µw, lambda)-ES and Optimal µ for Intermediate Recombination for Large Population Sizes.",
                    "Exploiting Overlap When Searching for Robust Optima.",
                    "Benchmarking Evolutionary Algorithms: Towards Exploratory Landscape Analysis.",
                    "One-Point Geometric Crossover.",
                    "When Does Dependency Modelling Help? Using a Randomized Landscape Generator to Compare Algorithms in Terms of Problem Structure.",
                    "First-Improvement vs. Best-Improvement Local Optima Networks of NK Landscapes.",
                    "Differential Mutation Based on Population Covariance Matrix.",
                    "General Lower Bounds for the Running Time of Evolutionary Algorithms.",
                    "A Binary Encoding Supporting Both Mutation and Recombination.",
                    "Towards Analyzing Recombination Operators in Evolutionary Search.",
                    "Bidirectional Relation between CMA Evolution Strategies and Natural Evolution Strategies.",
                    "A Fine-Grained View of GP Locality with Binary Decision Diagrams as Ant Phenotypes.",
                    "Drift Analysis with Tail Bounds.",
                    "More Effective Crossover Operators for the All-Pairs Shortest Path Problem.",
                    "Comparison-Based Adaptive Strategy Selection with Bandits in Differential Evolution.",
                    "Fixed Parameter Evolutionary Algorithms and Maximum Leaf Spanning Trees: A Matter of Mutation.",
                    "An Archive Maintenance Scheme for Finding Robust Solutions.",
                    "Experimental Supplements to the Theoretical Analysis of Migration in the Island Model.",
                    "General Scheme for Analyzing Running Times of Parallel Evolutionary Algorithms.",
                    "Negative Drift in Populations.",
                    "Log(lambda) Modifications for Optimal Parallelism.",
                    "The Linkage Tree Genetic Algorithm.",
                    "An Analysis of the XOR Dynamic Problem Generator Based on the Dynamical System.",
                    "The Role of Degenerate Robustness in the Evolvability of Multi-agent Systems in Dynamic Environments.",
                    "Evolutionary Learning of Technical Trading Rules without Data-Mining Bias.",
                    "Using Computational Intelligence to Identify Performance Bottlenecks in a Computer System.",
                    "Selecting Small Audio Feature Sets in Music Classification by Means of Asymmetric Mutation.",
                    "Globally Induced Model Trees: An Evolutionary Approach.",
                    "Open-Ended Evolutionary Robotics: An Information Theoretic Approach.",
                    "A Novel Similarity-Based Crossover for Artificial Neural Network Evolution.",
                    "Indirect Encoding of Neural Networks for Scalable Go.",
                    "Comparison-Based Optimizers Need Comparison-Based Surrogates.",
                    "A Cooperative Coevolutionary Approach to Partitional Clustering.",
                    "Feature Selection for Multi-purpose Predictive Models: A Many-Objective Task.",
                    "Incorporating Domain Knowledge into Evolutionary Computing for Discovering Gene-Gene Interaction.",
                    "The Application of Pittsburgh-Style Learning Classifier Systems to Address Genetic Heterogeneity and Epistasis in Association Studies.",
                    "Threshold Selection, Mitosis and Dual Mutation in Cooperative Co-evolution: Application to Medical 3D Tomography.",
                    "Comparative Analysis of Search and Score Metaheuristics for Bayesian Network Structure Learning Using Node Juxtaposition Distributions.",
                    "Analyzing the Credit Default Swap Market Using Cartesian Genetic Programming.",
                    "A Memetic Cooperative Optimization Schema and Its Application to the Tool Switching Problem.",
                    "Ownership and Trade in Spatial Evolutionary Memetic Games.",
                    "A Hyper-Heuristic Approach to Strip Packing Problems.",
                    "Asymptotic Analysis of Computational Multi-Agent Systems.",
                    "Path-Guided Mutation for Stochastic Pareto Local Search Algorithms.",
                    "Scheduling English Football Fixtures over the Holiday Period Using Hyper-heuristics.",
                    "Graph Clustering Based Model Building.",
                    "How to Choose Solutions for Local Search in Multiobjective Combinatorial Memetic Algorithms.",
                    "Secure and Task Abortion Aware GA-Based Hybrid Metaheuristics for Grid Scheduling.",
                    "A Memetic Algorithm for the Pickup and Delivery Problem with Time Windows Using Selective Route Exchange Crossover.",
                    "Ant Based Hyper Heuristics with Space Reduction: A Case Study of the p-Median Problem.",
                    "A Study of Multi-parent Crossover Operators in a Memetic Algorithm.",
                    "A Hybrid Genetic Algorithm for the Traveling Salesman Problem Using Generalized Partition Crossover.",
                    "A Memetic Algorithm with Non Gradient-Based Local Search Assisted by a Meta-model.",
                    "Theoretically Investigating Optimal µ-Distributions for the Hypervolume Indicator: First Results for Three Objectives.",
                    "Convergence Rates of (1+1) Evolutionary Multiobjective Optimization Algorithms.",
                    "Tight Bounds for the Approximation Ratio of the Hypervolume Indicator.",
                    "Evolutionary Multiobjective Optimization Algorithm as a Markov System.",
                    "A Natural Evolution Strategy for Multi-objective Optimization.",
                    "Solving Multiobjective Optimization Problem by Constraint Optimization.",
                    "Enhancing Diversity for Average Ranking Method in Evolutionary Many-Objective Optimization.",
                    "Objective Space Partitioning Using Conflict Information for Many-Objective Optimization.",
                    "How Crossover Speeds Up Evolutionary Algorithms for the Multi-criteria All-Pairs-Shortest-Path Problem.",
                    "Path Relinking on Many-Objective NK-Landscapes.",
                    "In Search of Equitable Solutions Using Multi-objective Evolutionary Algorithms.",
                    "Stopping Criteria for Genetic Algorithms with Application to Multiobjective Optimization.",
                    "Defining and Optimizing Indicator-Based Diversity Measures in Multiobjective Search.",
                    "On Expected-Improvement Criteria for Model-based Multi-objective Optimization.",
                    "Parameter Tuning Boosts Performance of Variation Operators in Multiobjective Optimization."
                ]
            },
            {
                "sub_name_abbr": "conf/ppsn/2010-2",
                "sub_name": "Parallel Problem Solving from Nature - PPSN XI, 11th International Conference, Kraków, Poland, September 11-15, 2010. Proceedings, Part II.",
                "count": 55,
                "papers": [
                    "A Novel Smart Multi-Objective Particle Swarm Optimisation Using Decomposition.",
                    "A Hybrid Scalarization and Adaptive epsilon-Ranking Strategy for Many-Objective Optimization.",
                    "pMODE-LD+SS: An Effective and Efficient Parallel Differential Evolution Algorithm for Multi-Objective Optimization.",
                    "Improved Dynamic Lexicographic Ordering for Multi-Objective Optimisation.",
                    "Privacy-Preserving Multi-Objective Evolutionary Algorithms.",
                    "Optimizing Delivery Time in Multi-Objective Vehicle Routing Problems with Time Windows.",
                    "Speculative Evaluation in Particle Swarm Optimization.",
                    "Towards Directed Open-Ended Search by a Novelty Guided Evolution Strategy.",
                    "Consultant-Guided Search Algorithms with Local Search for the Traveling Salesman Problem.",
                    "Many-Objective Test Problems to Visually Examine the Behavior of Multiobjective Evolution in a Decision Space.",
                    "Preference-Based Multi-Objective Particle Swarm Optimization Using Desirabilities.",
                    "GPGPU-Compatible Archive Based Stochastic Ranking Evolutionary Algorithm (G-ASREA) for Multi-Objective Optimization.",
                    "Hybrid Directional-Biased Evolutionary Algorithm for Multi-Objective Optimization.",
                    "A Framework for Incorporating Trade-Off Information Using Multi-Objective Evolutionary Algorithms.",
                    "Topography-Aware Sensor Deployment Optimization with CMA-ES.",
                    "Evolutionary Optimization on Problems Subject to Changes of Variables.",
                    "On-Line Purchasing Strategies for an Evolutionary Algorithm Performing Resource-Constrained Optimization.",
                    "Parallel Artificial Immune System in Optimization and Identification of Composite Structures.",
                    "Bioreactor Control by Genetic Programming.",
                    "Solving the One-Commodity Pickup and Delivery Problem Using an Adaptive Hybrid VNS/SA Approach.",
                    "Testing the Dinosaur Hypothesis under Empirical Datasets.",
                    "Fractal Gene Regulatory Networks for Control of Nonlinear Systems.",
                    "An Effective Hybrid Evolutionary Local Search for Orienteering and Team Orienteering Problems with Time Windows.",
                    "Discrete Differential Evolution Algorithm for Solving the Terminal Assignment Problem.",
                    "Decentralized Evolutionary Agents Streamlining Logistic Network Design.",
                    "Testing the Permutation Space Based Geometric Differential Evolution on the Job-Shop Scheduling Problem.",
                    "New Uncertainty Handling Strategies in Multi-objective Evolutionary Optimization.",
                    "Evolving a Single Scalable Controller for an Octopus Arm with a Variable Number of Segments.",
                    "An Island Model for the No-Wait Flow Shop Scheduling Problem.",
                    "Environment-Driven Embodied Evolution in a Population of Autonomous Agents.",
                    "Large-Scale Global Optimization Using Cooperative Coevolution with Variable Interaction Learning.",
                    "EvoShelf: A System for Managing and Exploring Evolutionary Data.",
                    "Differential Evolution Algorithms with Cellular Populations.",
                    "Flocking in Stationary and Non-stationary Environments: A Novel Communication Strategy for Heading Alignment.",
                    "Evolution of XPath Lists for Document Data Selection.",
                    "PMF: A Multicore-Enabled Framework for the Construction of Metaheuristics for Single and Multiobjective Optimization.",
                    "Parallel Evolutionary Approach of Compaction Problem Using MapReduce.",
                    "Ant Colony Optimization with Immigrants Schemes in Dynamic Environments.",
                    "Secret Key Specification for a Variable-Length Cryptographic Cellular Automata Model.",
                    "Variable Neighborhood Search and Ant Colony Optimization for the Rooted Delay-Constrained Minimum Spanning Tree Problem.",
                    "Adaptive Modularization of the MAPK Signaling Pathway Using the Multiagent Paradigm.",
                    "Experimental Comparison of Methods to Handle Boundary Constraints in Differential Evolution.",
                    "Entropy-Driven Evolutionary Approaches to the Mastermind Problem.",
                    "Evolutionary Detection of New Classes of Equilibria: Application in Behavioral Games.",
                    "Design and Comparison of two Evolutionary Approaches for Solving the Rubik's Cube.",
                    "Statistical Analysis of Parameter Setting in Real-Coded Evolutionary Algorithms.",
                    "Performance of Network Crossover on NK Landscapes and Spin Glasses.",
                    "Promoting Phenotypic Diversity in Genetic Programming.",
                    "A Genetic Programming Approach to the Matrix Bandwidth-Minimization Problem.",
                    "Using Co-solvability to Model and Exploit Synergetic Effects in Evolution.",
                    "Fast Grammar-Based Evolution Using Memoization.",
                    "Evolution of Conventions and Social Polarization in Dynamical Complex Networks.",
                    "Evolving Strategies for Updating Pheromone Trails: A Case Study with the TSP.",
                    "The Role of Syntactic and Semantic Locality of Crossover in Genetic Programming.",
                    "The Layered Learning Method and Its Application to Generation of Evaluation Functions for the Game of Checkers."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th PPSN 2008",
        "info": "Dortmund, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2008",
                "sub_name": "Parallel Problem Solving from Nature - PPSN X, 10th International Conference Dortmund, Germany, September 13-17, 2008, Proceedings.",
                "count": 114,
                "papers": [
                    "On the Behaviour of the (1+1)-ES for a Simple Constrained Problem.",
                    "sigma-Self-Adaptive Weighted Multirecombination Evolution Strategy with Scaled Weights on the Noisy Sphere.",
                    "Convergence Analysis of Evolution Strategies with Random Numbers of Offspring.",
                    "Multiobjectivization by Decomposition of Scalar Cost Functions.",
                    "A Blend of Markov-Chain and Drift Analysis.",
                    "On Multiplicative Noise Models for Stochastic Search.",
                    "Premature Convergence in Constrained Continuous Search Spaces.",
                    "Approximating Minimum Multicuts by Evolutionary Multi-objective Algorithms.",
                    "Simplified Drift Analysis for Proving Lower Bounds in Evolutionary Computation.",
                    "Ignoble Trails - Where Crossover Is Provably Harmful.",
                    "Lower Bounds for Evolution Strategies Using VC-Dimension.",
                    "Rigorous Runtime Analysis of Inversely Fitness Proportional Mutation Rates.",
                    "Covariance Matrix Adaptation Revisited - The CMSA Evolution Strategy -.",
                    "Enhancing the Performance of Maximum-Likelihood Gaussian EDAs Using Anticipated Mean Shift.",
                    "New Approaches to Coevolutionary Worst-Case Optimization.",
                    "Bio-inspired Search and Distributed Memory Formation on Power-Law Networks.",
                    "Enhancing the Efficiency of the ECGA.",
                    "Extreme Value Based Adaptive Operator Selection.",
                    "Uncertainty Handling in Model Selection for Support Vector Machines.",
                    "Niche Radius Adaptation with Asymmetric Sharing.",
                    "Adaptive Encoding: How to Render Search Coordinate System Invariant.",
                    "Supervised and Evolutionary Learning of Echo State Networks.",
                    "Dynamic Cooperative Coevolutionary Sensor Deployment Via Localized Fitness Evaluation.",
                    "On the Run-Time Dynamics of a Peer-to-Peer Evolutionary Algorithm.",
                    "Mixed-Integer Evolution Strategies with Dynamic Niching.",
                    "A Compass to Guide Genetic Algorithms.",
                    "Testing the Intermediate Disturbance Hypothesis: Effect of Asynchronous Population Incorporation on Multi-Deme Evolutionary Algorithms.",
                    "A Developmental Approach to the Uncapacitated Examination Timetabling Problem.",
                    "QFCS: A Fuzzy LCS in Continuous Multi-step Environments with Continuous Vector Actions.",
                    "A Simple Modification in CMA-ES Achieving Linear Time and Space Complexity.",
                    "Evolutionary Algorithms for Dynamic Environments: Prediction Using Linear Regression and Markov Chains.",
                    "Combination of Natural and Numerical Optimization Methods at the Example of an Internal Gas Turbine Cooling Channel.",
                    "When Does Quasi-random Work?.",
                    "Fitness Expectation Maximization.",
                    "Formally Testing Liveness by Means of Compression Rates.",
                    "How a Generative Encoding Fares as Problem-Regularity Decreases.",
                    "Sub-tree Swapping Crossover, Allele Diffusion and GP Convergence.",
                    "How Single Ant ACO Systems Optimize Pseudo-Boolean Functions.",
                    "Actuation Constraints and Artificial Physics Control.",
                    "Genetic Repair for Optimization under Constraints Inspired by Arabidopsis Thaliana.",
                    "Improved Multilabel Classification with Neural Networks.",
                    "Enhancing Efficiency of Hierarchical BOA Via Distance-Based Model Restrictions.",
                    "Evolution Strategies for Direct Policy Search.",
                    "Optimal Nesting of Species for Exact Cover: Many against Many.",
                    "Nonsynonymous to Synonymous Substitution Ratio ka/ks: Measurement for Rate of Evolution in Evolutionary Computation.",
                    "Examining the Effect of Elitism in Cellular Genetic Algorithms Using Two Neighborhood Structures.",
                    "The Generalisation Ability of a Selection Architecture for Genetic Programming.",
                    "Reinforcement Learning: Insights from Interesting Failures in Parameter Selection.",
                    "Evolvable Agents in Static and Dynamic Optimization Problems.",
                    "The Impact of Global Structure on Search.",
                    "Improved Lower Limits for Pheromone Trails in Ant Colony Optimization.",
                    "Evolving Neural Networks for Online Reinforcement Learning.",
                    "Costs and Benefits of Tuning Parameters of Evolutionary Algorithms.",
                    "Cooperation in Co-evolving Networks: The Prisoner's Dilemma and Stag-Hunt Games.",
                    "Preventing Premature Convergence in a Simple EDA Via Global Step Size Setting.",
                    "A Steady-State Genetic Algorithm with Resampling for Noisy Inventory Control.",
                    "EA-Powered Basin Number Estimation by Means of Preservation and Exploration.",
                    "Coevolving Cellular Automata with Memory for Chemical Computing: Boolean Logic Gates in the BZ Reaction.",
                    "The Influence of Mutation on Protein-Ligand Docking Optimization: A Locality Analysis.",
                    "Testing the CAX on a Real-World Problem and Other Benchmarks.",
                    "Countering Poisonous Inputs with Memetic Neuroevolution.",
                    "Parameter Control Methods for Selection Operators in Genetic Algorithms.",
                    "Evaluation and Diversity in Co-evolution.",
                    "Comparison of Adaptive Approaches for Differential Evolution.",
                    "Analyzing Hypervolume Indicator Based Algorithms.",
                    "Solving Three-Objective Optimization Problems Using a New Hybrid Cellular Genetic Algorithm.",
                    "Runtime Analyses for Using Fairness in Evolutionary Multi-Objective Optimization.",
                    "The Parallel Predator-Prey Model: A Step towards Practical Application.",
                    "Functional-Specialization Multi-Objective Real-Coded Genetic Algorithm: FS-MOGA.",
                    "Investigations into the Effect of Multiobjectivization in Protein Structure Prediction.",
                    "On the Use of Projected Gradients for Constrained Multiobjective Optimization Problems.",
                    "Diversity Maintenance Mechanism for Multi-Objective Genetic Algorithms Using Clustering and Network Inversion.",
                    "Many Objective Optimisation: Direct Objective Boundary Identification.",
                    "Use of Heuristic Local Search for Single-Objective Optimization in Multiobjective Memetic Algorithms.",
                    "Distance Based Ranking in Many-Objective Particle Swarm Optimization.",
                    "A Study of Convergence Speed in Multi-objective Metaheuristics.",
                    "Team Algorithms Based on Ant Colony Optimization - A New Multi-Objective Optimization Approach.",
                    "Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted -Metric Selection.",
                    "Approximating the Knee of an MOP with Stochastic Search Algorithms.",
                    "Approximate Solutions in Space Mission Design.",
                    "A Local Search Based Evolutionary Multi-objective Optimization Approach for Fast and Accurate Convergence.",
                    "A Convergence Criterion for Multiobjective Evolutionary Algorithms Based on Systematic Statistical Testing.",
                    "A Proposal to Hybridize Multi-Objective Evolutionary Algorithms with Non-gradient Mathematical Programming Techniques.",
                    "SPAM: Set Preference Algorithm for Multiobjective Optimization.",
                    "Modeling Human Expertise on a Cheese Ripening Industrial Process Using GP.",
                    "Readable and Accurate Rulesets with ORGA.",
                    "A Distributed Memetic Algorithm for the Routing and Wavelength Assignment Problem.",
                    "Theoretical Analysis of Initial Particle Swarm Behavior.",
                    "Large-Scale Optimization of Non-separable Building-Block Problems.",
                    "Particle Filter with Swarm Move for Optimization.",
                    "A Feasibility-Preserving Crossover and Mutation Operator for Constrained Combinatorial Problems.",
                    "An Iterated Local Search Approach for Finding Provably Good Solutions for Very Large TSP Instances.",
                    "Intrinsic System Model of the Genetic Algorithm with alpha-Selection.",
                    "Imitation Learning in Uncertain Environments.",
                    "Using Ants' Task Division for Better Game Engines - A Contribution to Game Accessibility for Impaired Players.",
                    "A Set-Based Particle Swarm Optimization Method.",
                    "Nature-Inspired Synthesis of Rational Protocols.",
                    "Optimizing Real-Time Ordered-Data Broadcasts in Pervasive Environments Using Evolution Strategy.",
                    "A Multiobjective Evolutionary Algorithm for the Linear Shelf Space Allocation Problem.",
                    "A Memetic Algorithm for the Delineation of Local Labour Markets.",
                    "Evolving XSLT Stylesheets for Document Transformation.",
                    "Fast Multi-objective Scheduling of Jobs to Constrained Resources Using a Hybrid Evolutionary Algorithm.",
                    "Virus Evolution Strategy for Vehicle Routing Problems with Time Windows.",
                    "Learning Fuzzy Rules with Evolutionary Algorithms - An Analytic Approach.",
                    "Evolving Regular Expressions for GeneChip Probe Performance Prediction.",
                    "Evolutionary Market Agents for Resource Allocation in Decentralised Systems.",
                    "GA-Net: A Genetic Algorithm for Community Detection in Social Networks.",
                    "Learning Walking Patterns for Kinematically Complex Robots Using Evolution Strategies.",
                    "Driving Cars by Means of Genetic Algorithms.",
                    "AGE-P: A Platform for Open Evolution.",
                    "Adding Probabilistic Dependencies to the Search of Protein Side Chain Configurations Using EDAs.",
                    "A Scalable Formal Framework for Analyzing the Behavior of Nature-Inspired Routing Protocols.",
                    "A Grouping Genetic Algorithm Using Linear Linkage Encoding for Bin Packing.",
                    "Optimization of Feature Processing Chain in Music Classification by Evolution Strategies."
                ]
            },
            {
                "sub_name_abbr": "books/sp/08/KCD2008",
                "sub_name": "Multiobjective Problem Solving from Nature.",
                "count": 0,
                "papers": []
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th PPSN 2006",
        "info": "Reykjavik, Iceland",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2006",
                "sub_name": "Parallel Problem Solving from Nature - PPSN IX, 9th International Conference, Reykjavik, Iceland, September 9-13, 2006, Procedings.",
                "count": 106,
                "papers": [
                    "Evolutionary Optimization in Spatio-temporal Fitness Landscapes.",
                    "Cumulative Step Length Adaptation on Ridge Functions.",
                    "General Lower Bounds for Evolutionary Algorithms.",
                    "On the Ultimate Convergence Rates for Isotropic Algorithms and the Best Choices Among Various Forms of Isotropy.",
                    "Mixed-Integer NK Landscapes.",
                    "How Comma Selection Helps with the Escape from Local Optima.",
                    "When Do Heavy-Tail Distributions Help?",
                    "Self-adaptation on the Ridge Function Class: First Results for the Sharp Ridge.",
                    "Searching for Balance: Understanding Self-adaptation on Ridge Functions.",
                    "Diversity Loss in General Estimation of Distribution Algorithms.",
                    "Information Perspective of Optimization.",
                    "A Novel Negative Selection Algorithm with an Array of Partial Matching Lengths for Each Detector.",
                    "Hierarchical BOA, Cluster Exact Approximation, and Ising Spin Glasses.",
                    "Towards an Adaptive Multimeme Algorithm for Parameter Optimisation Suiting the Engineers' Needs.",
                    "Niche Radius Adaptation in the CMA-ES Niching Algorithm.",
                    "A Tabu Search Evolutionary Algorithm for Solving Constraint Satisfaction Problems.",
                    "cAS: Ant Colony Optimization with Cunning Ants.",
                    "Genetic Algorithm Based on Independent Component Analysis for Global Optimization.",
                    "Improved Squeaky Wheel Optimisation for Driver Scheduling.",
                    "A Local Genetic Algorithm for Binary-Coded Problems.",
                    "Hill Climbers and Mutational Heuristics in Hyperheuristics.",
                    "A Multi-level Memetic/Exact Hybrid Algorithm for the Still Life Problem.",
                    "Transmission Loss Reduction Based on FACTS and Bacteria Foraging Algorithm.",
                    "Substructural Neighborhoods for Local Search in the Bayesian Optimization Algorithm.",
                    "Theory and Practice of Cellular UMDA for Discrete Optimization.",
                    "A Memetic Approach to Golomb Rulers.",
                    "Some Notes on (Mem)Brane Computation.",
                    "Evolutionary Local Search for Designing Peer-to-Peer Overlay Topologies Based on Minimum Routing Cost Spanning Trees.",
                    "Nature-Inspired Algorithms for the Optimization of Optical Reference Signals.",
                    "Optimum Design of Surface Acoustic Wave Filters Based on the Taguchi's Quality Engineering with a Memetic Algorithm.",
                    "Genetic Algorithm for Burst Detection and Activity Tracking in Event Streams.",
                    "Computationally Intelligent Online Dynamic Vehicle Routing by Explicit Load Prediction in an Evolutionary Algorithm.",
                    "Novel Approach to Develop Rheological Structure-Property Relationships Using Genetic Programming.",
                    "An Evolutionary Approach to the Inference of Phylogenetic Networks.",
                    "An Evolutive Approach for the Delineation of Local Labour Markets.",
                    "Direct Manipulation of Free Form Deformation in Evolutionary Design Optimisation.",
                    "An Evolutionary Approach to Shimming Undulator Magnets for Synchrotron Radiation Sources.",
                    "New EAX Crossover for Large TSP Instances.",
                    "Functional Brain Imaging with Multi-objective Multi-modal Evolutionary Optimization.",
                    "A New Neural Network Based Construction Heuristic for the Examination Timetabling Problem.",
                    "Optimisation of CDMA-Based Mobile Telephone Networks: Algorithmic Studies on Real-World Networks.",
                    "Evolving Novel and Effective Treatment Plans in the Context of Infection Dynamics Models: Illustrated with HIV and HAART Therapy.",
                    "Automatic Test Pattern Generation with BOA.",
                    "Multiobjective Genetic Programming for Natural Language Parsing and Tagging.",
                    "Modelling the Population Distribution in Multi-objective Optimization by Generative Topographic Mapping.",
                    "Multiobjective Optimization of Ensembles of Multilayer Perceptrons for Pattern Classification.",
                    "Multi-Objective Equivalent Random Search.",
                    "Compressed-Objective Genetic Algorithm.",
                    "A New Proposal for Multiobjecive Optimization Using Particle Swarm Optimization and Rough Sets Theory.",
                    "Incorporation of Scalarizing Fitness Functions into Evolutionary Multiobjective Optimization Algorithms.",
                    "Solving Multi-objective Optimisation Problems Using the Potential Pareto Regions Evolutionary Algorithm.",
                    "Pareto Set and EMOA Behavior for Simple Multimodal Multiobjective Functions.",
                    "About Selecting the Personal Best in Multi-Objective Particle Swarm Optimization.",
                    "Are All Objectives Necessary? On Dimensionality Reduction in Evolutionary Multiobjective Optimization.",
                    "Solving Hard Multiobjective Optimization Problems Using epsilon-Constraint with Cultured Differential Evolution.",
                    "A Fast and Effective Method for Pruning of Non-dominated Solutions in Many-Objective Problems.",
                    "Multi-level Ranking for Constrained Multi-objective Evolutionary Optimisation.",
                    "Module Identification from Heterogeneous Biological Data Using Multiobjective Evolutionary Algorithms.",
                    "A Multiobjective Differential Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages.",
                    "Digital Images Enhancement with Use of Evolving Neural Networks.",
                    "Environments Conducive to Evolution of Modularity.",
                    "Arms Races and Car Races.",
                    "BeeHiveAIS: A Simple, Efficient, Scalable and Secure Routing Framework Inspired by Artificial Immune Systems.",
                    "Critical Temperatures for Intermittent Search in Self-Organizing Neural Networks.",
                    "Robust Simulation of Lamprey Tracking.",
                    "Evolutionary Behavior Acquisition for Humanoid Robots.",
                    "Modelling Group-Foraging Behaviour with Particle Swarms.",
                    "Neuroevolution with Analog Genetic Encoding.",
                    "A Two-Level Clustering Method Using Linear Linkage Encoding.",
                    "A New Swarm Intelligence Coordination Model Inspired by Collective Prey Retrieval and Its Application to Image Alignment.",
                    "Exploring the Effect of Proximity and Kinship on Mutual Cooperation in the Iterated Prisoner's Dilemma.",
                    "Investigating the Emergence of Multicellularity Using a Population of Neural Network Agents.",
                    "Building of 3D Environment Models for Mobile Robotics Using Self-organization.",
                    "January: A Parallel Algorithm for Bug Hunting Based on Insect Behavior.",
                    "A Generalized Graph-Based Method for Engineering Swarm Solutions to Multiagent Problems.",
                    "Probabilistic Adaptive Mapping Developmental Genetic Programming (PAM DGP): A New Developmental Approach.",
                    "A Distance-Based Information Preservation Tree Crossover for the Maximum Parsimony Problem.",
                    "Solving SAT and HPP with Accepting Splicing Systems.",
                    "Some Steps Towards Understanding How Neutrality Affects Evolutionary Search.",
                    "Performance of Evolutionary Algorithms on Random Decomposable Problems.",
                    "Evolving Binary Decision Diagrams with Emergent Variable Orderings.",
                    "Life History Evolution of Virtual Plants: Trading Off Between Growth and Reproduction.",
                    "Finding State-of-the-Art Non-cryptographic Hashes with Genetic Programming.",
                    "Offspring Generation Method Using Delaunay Triangulation for Real-Coded Genetic Algorithms.",
                    "An Investigation of Representations and Operators for Evolutionary Data Clustering with a Variable Number of Clusters.",
                    "Lamar: A New Pseudorandom Number Generator Evolved by Means of Genetic Programming.",
                    "Evolving Bin Packing Heuristics with Genetic Programming.",
                    "The Importance of Neutral Mutations in GP.",
                    "New Order-Based Crossovers for the Graph Coloring Problem.",
                    "Assortative Mating Drastically Alters the Magnitude of Error Thresholds.",
                    "Is Self-adaptation of Selection Pressure and Population Size Possible? - A Case Study.",
                    "A Particle Swarm Optimizer for Constrained Numerical Optimization.",
                    "Self-regulated Population Size in Evolutionary Algorithms.",
                    "Starting from Scratch: Growing Longest Common Subsequences with Evolution.",
                    "Local Meta-models for Optimization Using Evolution Strategies.",
                    "Effects of Using Two Neighborhood Structures in Cellular Genetic Algorithms for Function Optimization.",
                    "A Selecto-recombinative Genetic Algorithm with Continuous Chromosome Reconfiguration.",
                    "Exploiting Expert Knowledge in Genetic Programming for Genome-Wide Genetic Analysis.",
                    "Speeding Up Evolutionary Algorithms Through Restricted Mutation Operators.",
                    "Comparing the Niches of CMA-ES, CHC and Pattern Search Using Diverse Benchmarks.",
                    "Model Complexity vs. Performance in the Bayesian Optimization Algorithm.",
                    "Genetic Programming for Kernel-Based Learning with Co-evolving Subsets Selection.",
                    "Product Geometric Crossover.",
                    "Exploration and Exploitation Bias of Crossover and Path Relinking for Permutation Problems.",
                    "Geometric Crossover for Sets, Multisets and Partitions.",
                    "Ordinal Regression in Evolutionary Computation."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "8th PPSN 2004",
        "info": "Birmingham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2004",
                "sub_name": "Parallel Problem Solving from Nature - PPSN VIII, 8th International Conference, Birmingham, UK, September 18-22, 2004, Proceedings.",
                "count": 118,
                "papers": [
                    "On the Quality Gain of (1, lambda)-ES Under Fitness Noise.",
                    "Fitness Distributions and GA Hardness.",
                    "Experimental Supplements to the Theoretical Analysis of EAs on Problems from Combinatorial Optimization.",
                    "The Ising Model: Simple Evolutionary Algorithms as Adaptation Schemes.",
                    "Evolutionary Algorithms with On-the-Fly Population Size Adjustment.",
                    "Search Space Features Underlying the Performance of Stochastic Local Search Algorithms for MAX-SAT.",
                    "Bridging the Gap Between Theory and Practice.",
                    "A Reduced Markov Model of GAs Without the Exact Transition Matrix.",
                    "Expected Runtimes of a Simple Evolutionary Algorithm for the Multi-objective Minimum Spanning Tree Problem.",
                    "On the Importance of Information Speed in Structured Populations.",
                    "Estimating the Number of Solutions for SAT Problems.",
                    "Behavior of Evolutionary Algorithms in Chaotically Changing Fitness Landscapes.",
                    "Expected Rates of Building Block Discovery, Retention and Combination Under 1-Point and Uniform Crossover.",
                    "An Analysis of the Effectiveness of Multi-parent Crossover.",
                    "On the Use of a Non-redundant Encoding for Learning Bayesian Networks from Data with a GA.",
                    "Phase Transition Properties of Clustered Travelling Salesman Problem Instances Generated with Evolutionary Computation.",
                    "A Simple Two-Module Problem to Exemplify Building-Block Assembly Under Crossover.",
                    "Statistical Racing Techniques for Improved Empirical Evaluation of Evolutionary Algorithms.",
                    "LS-CMA-ES: A Second-Order Algorithm for Covariance Matrix Adaptation.",
                    "Learning Probabilistic Tree Grammars for Genetic Programming.",
                    "Sequential Sampling in Noisy Environments.",
                    "Evolutionary Continuous Optimization by Distribution Estimation with Variational Bayesian Independent Component Analyzers Mixture Model.",
                    "Spread of Vector Borne Diseases in a Population with Spatial Structure.",
                    "Hierarchical Genetic Algorithms.",
                    "Migration of Probability Models Instead of Individuals: An Alternative When Applying the Island Model to EDAs.",
                    "Comparison of Steady-State and Generational Evolution Strategies for Parallel Architectures.",
                    "Control of Bloat in Genetic Programming by Means of the Island Model.",
                    "Saving Resources with Plagues in Genetic Algorithms.",
                    "Evaluating the CMA Evolution Strategy on Multimodal Test Functions.",
                    "Exploring the Evolutionary Details of a Feasible-Infeasible Two-Population GA.",
                    "An Evolutionary Algorithm for the Maximum Weight Trace Formulation of the Multiple Sequence Alignment Problem.",
                    "A Novel Programmable Molecular Computing Method Based on Signaling Pathways Regulated by Rho-GTPases in Living MDCK Epithelial Mammalian Cells.",
                    "Empirical Investigations on Parallelized Linkage Identification.",
                    "The EAX Algorithm Considering Diversity Loss.",
                    "Topology-Oriented Design of Analog Circuits Based on Evolutionary Graph Generation.",
                    "A Mixed Bayesian Optimization Algorithm with Variance Adaptation.",
                    "A Swarm Intelligence Based VLSI Multiplication-and-Add Scheme.",
                    "Distribution Tree-Building Real-Valued Evolutionary Algorithm.",
                    "Optimization via Parameter Mapping with Genetic Programming.",
                    "Multi-cellular Development: Is There Scalability and Robustness to Gain?",
                    "Constrained Evolutionary Optimization by Approximate Ranking and Surrogate Models.",
                    "Robust Parallel Genetic Algorithms with Re-initialisation.",
                    "Improving Evolutionary Algorithms with Multi-representation Island Models.",
                    "A Powerful New Encoding for Tree-Based Combinatorial Optimisation Problems.",
                    "Partially Evaluated Genetic Algorithm Based on Fuzzy c-Means Algorithm.",
                    "Applications Metaheuristics for the Vehicle Routing Problem with Stochastic Demands.",
                    "AntHocNet: An Ant-Based Hybrid Routing Algorithm for Mobile Ad Hoc Networks.",
                    "A Scatter Search Algorithm for the 3D Image Registration Problem.",
                    "A Hybrid GRASP - Evolutionary Algorithm Approach to Golomb Ruler Search.",
                    "Design of an Efficient Search Algorithm for P2P Networks Using Concepts from Natural Immune Systems.",
                    "A Novel Ant Algorithm for Solving the Minimum Broadcast Time Problem.",
                    "Designing Multiple-Use Primer Set for Multiplex PCR by Using Compact GAs.",
                    "Robust Inferential Sensors Based on Ensemble of Predictors Generated by Genetic Programming.",
                    "Searching Transcriptional Modules Using Evolutionary Algorithms.",
                    "Evolution of Voronoi-Based Fuzzy Controllers.",
                    "Analyzing Sensor States and Internal States in the Tartarus Problem with Tree State Machines.",
                    "Evolving Genetic Regulatory Networks for Hardware Fault Tolerance.",
                    "Evolving Dynamics in an Artificial Regulatory Network Model.",
                    "The Application of Bayesian Optimization and Classifier Systems in Nurse Scheduling.",
                    "An Evolutionary Approach to Modeling Radial Brightness Distributions in Elliptical Galaxies.",
                    "Conference Paper Assignment Using a Combined Greedy/Evolutionary Algorithm.",
                    "A Primer on the Evolution of Equivalence Classes of Bayesian-Network Structures.",
                    "The Infection Algorithm: An Artificial Epidemic Approach for Dense Stereo Matching.",
                    "Optimising Cancer Chemotherapy Using Particle Swarm Optimisation and Genetic Algorithms.",
                    "An Evolutionary Algorithm for Column Generation in Integer Programming: An Effective Approach for 2D Bin Packing.",
                    "An Improved Evaluation Function for the Bandwidth Minimization Problem.",
                    "Coupling of Evolution and Learning to Optimize a Hierarchical Object Recognition Model.",
                    "Evolution of Small-World Networks of Automata for Computation.",
                    "Recognizing Speed Limit Sign Numbers by Evolvable Hardware.",
                    "Dynamic Routing Problems with Fruitful Regions: Models and Evolutionary Computation.",
                    "Optimising the Performance of a Formula One Car Using a Genetic Algorithm.",
                    "An Inexpensive Cognitive Approach for Bi-objective Optimization Using Bliss Points and Interaction.",
                    "Finding Knees in Multi-objective Optimization.",
                    "Multi-objective Parallel Tabu Search.",
                    "SPEA2+: Improving the Performance of the Strength Pareto Evolutionary Algorithm 2.",
                    "An Extension of Generalized Differential Evolution for Multi-objective Optimization with Constraints.",
                    "Adaptive Weighted Particle Swarm Optimisation for Multi-objective Optimal Design of Alloy Steels.",
                    "Multi-objective Optimisation by Co-operative Co-evolution.",
                    "Sequential Process Optimisation Using Genetic Algorithms.",
                    "On Test Functions for Evolutionary Multi-objective Optimization.",
                    "Multi-objective Optimization of a Composite Material Spring Design Using an Evolutionary Algorithm.",
                    "Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms.",
                    "Evolutionary Bi-objective Controlled Elevator Group Regulates Passenger Service Level and Minimises Energy Consumption.",
                    "Indicator-Based Selection in Multiobjective Search.",
                    "Intransitivity in Coevolution.",
                    "Group Transport of an Object to a Target That Only Some Group Members May Sense.",
                    "Hawks, Doves and Lifetime Reproductive Success.",
                    "Evolutionary Multi-agent Systems.",
                    "Credit Assignment Among Neurons in Co-evolving Populations.",
                    "A Visual Demonstration of Convergence Properties of Cooperative Coevolution.",
                    "Cooperative Coevolution of Image Feature Construction and Object Detection.",
                    "Spatial Embedding and Loss of Gradient in Cooperative Coevolutionary Algorithms.",
                    "A High Performance Multi-objective Evolutionary Algorithm Based on the Principles of Thermodynamics.",
                    "Robotics and Multi-agent Systems Robustness in the Long Run: Auto-teaching vs Anticipation in Evolutionary Robotics.",
                    "A Self-adaptive Neural Learning Classifier System with Constructivism for Mobile Robot Control.",
                    "An Approach to Evolutionary Robotics Using a Genetic Algorithm with a Variable Mutation Rate Strategy.",
                    "Translating the Dances of Honeybees into Resource Location.",
                    "Natural Policy Gradient Reinforcement Learning for a CPG Control of a Biped Robot.",
                    "Evaluation of Adaptive Nature Inspired Task Allocation Against Alternate Decentralised Multiagent Strategies.",
                    "A Neuroevolutionary Approach to Emergent Task Decomposition.",
                    "Evolving the \"Feeling\" of Time Through Sensory-Motor Coordination: A Robot Based Model.",
                    "An Artificial Immune System for Fuzzy-Rule Induction in Data Mining.",
                    "Speeding-Up Pittsburgh Learning Classifier Systems: Modeling Time and Accuracy.",
                    "A Simple Payoff-Based Learning Classifier System.",
                    "Lookahead and Latent Learning in a Simple Accuracy-Based Classifier System.",
                    "Knowledge Extraction and Problem Structure Identification in XCS.",
                    "Forecasting Time Series by Means of Evolutionary Algorithms.",
                    "Detecting and Pruning Introns for Faster Decision Tree Evolution.",
                    "Evolutionary Multiobjective Clustering.",
                    "Web Page Classification with an Ant Colony Algorithm.",
                    "Oneiric Processing Utilising the Anticipatory Classifier System.",
                    "Self-organizing Neural Grove: Efficient Multiple Classifier System Using Pruned Self-generating Neural Trees.",
                    "Evolutionary Multiobjective Knowledge Extraction for High-Dimensional Pattern Classification Problems.",
                    "Ensemble Learning with Evolutionary Computation: Application to Feature Ranking.",
                    "Fast Unsupervised Clustering with Artificial Ants.",
                    "A Novel Method of Searching the Microarray Data for the Best Gene Subsets by Using a Genetic Algorithm.",
                    "Using Genetic Programming for Feature Creation with a Genetic Algorithm Feature Selector.",
                    "AgentP Model: Learning Classifier System with Associative Perception."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "7th PPSN 2002",
        "info": "Granada, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2002",
                "sub_name": "Parallel Problem Solving from Nature - PPSN VII, 7th International Conference, Granada, Spain, September 7-11, 2002, Proceedings.",
                "count": 90,
                "papers": [
                    "Random Dynamics Optimum Tracking with Evolution Strategies.",
                    "On the Behavior of Evolutionary Global-Local Hybrids with Dynamic Fitness Functions.",
                    "Measuring the Searched Space to Guide Efficiency: The Principle and Evidence on Constraint Satisfaction.",
                    "On the Analysis of Dynamic Restart Strategies for Evolutionary Algorithms.",
                    "Running Time Analysis of Multi-objective Evolutionary Algorithms on a Simple Discrete Optimization Problem.",
                    "Fitness Landscapes Based on Sorting and Shortest Paths Problems.",
                    "Performance Measures for Dynamic Environments.",
                    "Direct Representation and Variation Operators for the Fixed Charge Transportation Problem.",
                    "On the Utility of Redundant Encodings in Mutation-Based Evolutionary Search.",
                    "Binary Representations of Integers and the Performance of Selectorecombinative Genetic Algorithms.",
                    "Parallel Varying Mutation in Deterministic and Self-adaptive GAs.",
                    "Self-organizing Maps for Pareto Optimization of Airfoils.",
                    "On Fitness Distributions and Expected Fitness Gain of Mutation Rates in Parallel Evolutionary Algorithms.",
                    "Opposites Attract: Complementary Phenotype Selection for Crossover in Genetic Programming.",
                    "Theoretical Analysis of the Confidence Interval Based Crossover for Real-Coded Genetic Algorithms.",
                    "Deterministic Multi-step Crossover Fusion: A Handy Crossover Composition for GAs.",
                    "Operator Learning for a Problem Class in a Distributed Peer-to-Peer Environment.",
                    "Crossover Operator Effect in Function Optimization with Constraints.",
                    "Reducing Random Fluctuations in Mutative Self-adaptation.",
                    "On Weight-Biased Mutation for Graph Problems.",
                    "Self-adaptive Operator Scheduling Using the Religion-Based EA.",
                    "Probabilistic Model-Building Genetic Algorithms in Permutation Representation Domain Using Edge Histogram.",
                    "From Syntactical to Semantical Mutation Operators for Structure Optimization.",
                    "Parameter Control within a Co-operative Co-evolutionary Genetic Algorithm.",
                    "The Effects of Representational Bias on Collaboration Methods in Cooperative Coevolution.",
                    "Parallel and Hybrid Models for Multi-objective Optimization: Application to the Vehicle Routing Problem.",
                    "Multiobjective Design Optimization of Merging Configuration for an Exhaust Manifold of a Car Engine.",
                    "Multi-objective Co-operative Co-evolutionary Genetic Algorithm.",
                    "Bayesian Optimization Algorithms for Multi-objective Optimization.",
                    "An Evolutionary Algorithm for Controlling Chaos: The Use of Multi-objective Fitness Functions.",
                    "On Modelling Evolutionary Algorithm Implementations through Co-operating Populations.",
                    "Permutation Optimization by Iterated Estimation of Random Keys Marginal Product Factorizations.",
                    "Advanced Population Diversity Measures in Genetic Programming.",
                    "Introducing Start Expression Genes to the Linkage Learning Genetic Algorithm.",
                    "Metamodel-Assisted Evolution Strategies.",
                    "Limiting the Number of Fitness Cases in Genetic Programming Using Statistics.",
                    "Resource-Based Fitness Sharing.",
                    "Evolution Strategy with Neighborhood Attraction Using a Neural Gas Approach.",
                    "A New Asynchronous Parallel Evolutionary Algorithm for Function Optimization.",
                    "Fighting Bloat with Nonparametric Parsimony Pressure.",
                    "Increasing the Serial and the Parallel Performance of the CMA-Evolution Strategy with Large Populations.",
                    "Adaptive Reservoir Genetic Algorithm with On-Line Decision Making.",
                    "Genetic Algorithm Visualization Using Self-organizing Maps.",
                    "Generalised Regression GA for Handling Inseparable Function Interaction: Algorithm and Applications.",
                    "Diversity-Guided Evolutionary Algorithms.",
                    "Evolutionary Optimization of Heterogeneous Problems.",
                    "Automatic Recurrent and Feed-Forward ANN Rule and Expression Extraction with Genetic Programming.",
                    "Learning and Evolution by Minimization of Mutual Information.",
                    "Evolved RBF Networks for Time-Series Forecasting and Function Approximation.",
                    "Evolutive Identification of Fuzzy Systems for Time-Series Prediction.",
                    "HyGLEAM - An Approach to Generally Applicable Hybridization of Evolutionary Algorithms.",
                    "Co-evolving Memetic Algorithms: Initial Investigations.",
                    "Consideration of Multiple Objectives in Neural Learning Classifier Systems.",
                    "On Using Constructivism in Neural Classifier Systems.",
                    "Initial Modifications to XCS for Use in Interactive Evolutionary Design.",
                    "First Results from Experiments in Fuzzy Classifier System Architectures for Mobile Robotics.",
                    "TCS Learning Classifier System Controller on a Real Robot.",
                    "Comparing Synchronous and Asynchronous Cellular Genetic Algorithms.",
                    "Satellite Range Scheduling: A Comparison of Genetic, Heuristic and Local Search.",
                    "The LifeCycle Model: Combining Particle Swarm Optimisation, Genetic Algorithms and HillClimbers.",
                    "Metaheuristics for Group Shop Scheduling.",
                    "Experimental Investigation of Three Distributed Genetic Programming Models.",
                    "Model-Based Search for Combinatorial Optimization: A Comparative Study.",
                    "A Framework for Distributed Evolutionary Algorithms.",
                    "Optimisation of Multilayer Perceptrons Using a Distributed Evolutionary Algorithm with SOAP.",
                    "Off-Line Evolution of Behaviour for Autonomous Agents in Real-Time Computer Games.",
                    "A Parallel Evolutionary Algorithm for Stochastic Natural Language Parsing.",
                    "Evolutionary Learning of Boolean Queries by Multiobjective Genetic Programming.",
                    "Inferring Phylogenetic Trees Using Evolutionary Algorithms.",
                    "Towards a More Efficient Evolutionary Induction of Bayesian Networks.",
                    "Robust Multiscale Affine 2D-Image Registration through Evolutionary Strategies.",
                    "Synthesizing Graphical Models Employing Explaining Away.",
                    "Constructive Geometric Constraint Solving: A New Application of Genetic Algorithms.",
                    "Multimeme Algorithms for Protein Structure Prediction.",
                    "A Dynamic Traffic Model for Frequency Assignment.",
                    "A Parameter-Free Genetic Algorithm for a Fixed Channel Assignment Problem with Limited Bandwidth.",
                    "Real-Coded Parameter-Free Genetic Algorithm for Job-Shop Scheduling Problems.",
                    "Clustering Gene Expression Profiles with Memetic Algorithms.",
                    "Cellular Automata and Genetic Algorithms for Parallel Problem Solving in Human Genetics.",
                    "Evolutionary Graph Generation System and Its Application to Bit-Serial Arithmetic Circuit Synthesis.",
                    "Evaluating Multi-criteria Evolutionary Algorithms for Airfoil Optimisation.",
                    "Hyperheuristics: A Robust Optimisation Method Applied to Nurse Scheduling.",
                    "Evolving the Topology of Hidden Markov Models Using Evolutionary Algorithms.",
                    "Solving a Real World Routing Problem Using Multiple Evolutionary Agents.",
                    "An Ant Colony Optimization Approach to the Probabilistic Traveling Salesman Problem.",
                    "When Model Bias Is Stronger than Selection Pressure.",
                    "Evolution of Asynchronous Cellular Automata.",
                    "Improved Ant-Based Clustering and Sorting.",
                    "An Adaptive Flocking Algorithm for Spatial Clustering.",
                    "Evolution of Asynchronous Cellular Automata for the Density Task."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th PPSN 2000",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/2000",
                "sub_name": "Parallel Problem Solving from Nature - PPSN VI, 6th International Conference, Paris, France, September 18-20, 2000, Proceedings.",
                "count": 88,
                "papers": [
                    "Interacting Trajectories in Design Space and Niche Space: A Philosopher Speculates About Evolution.",
                    "Language as a Complex Adaptive System.",
                    "Cellular Evolutionary Algorithms: Evaluating the Influence of Ratio.",
                    "Efficiency and Mutation Strength Adaptation of the (mu, muI, lambda)-ES in a Noisy Environment.",
                    "An Analysis of the Configuration Space of the Maximal Constraint Satisfaction Problem.",
                    "On the Desired Behaviors of Self-Adaptive Evolutionary Algorithms.",
                    "Practical Implications of New Results in Conservation of Optimizer Performance.",
                    "Large Derivations, Evolutionary Computation and Comparisons of Algorithms.",
                    "On the Choice of the Mutation Probability for the (1+1) EA.",
                    "The Genetic Code-Like Transformations and Their Effect on Learning Functions.",
                    "Perturbation Theory for Evolutionary Algorithms: Towards an Estimation of Convergence Speed.",
                    "Statistical Characteristics of Evolution Strategies.",
                    "Consensus Sequence Plots and Error Thresholds: Tools for Visualising the Structure of Fitness Landscapes.",
                    "Experiments with Tuneable Fitness Landscapes.",
                    "Introducing a New Persistence Measure.",
                    "An Analysis of Dynamic Severity and Population Size.",
                    "Functions as Permutations: Regarding No Free Lunch, Walsh Analysis and Summary Statistics.",
                    "Distributed Hybrid Genetic Programming for Learning Boolean Functions.",
                    "Genetic Programming with Dynamic Fitness for a Remote Sensing Application.",
                    "Genetic Programming Bloat without Semantics.",
                    "Genetic Programming and Domain Knowledge: Beyond the Limitations of Grammar-Guided Machine Discovery.",
                    "Polymorphy and Hybridization in Genetically Programmed Networks.",
                    "Building Optimal Committees of Genetic Programs.",
                    "Distributed Simulated Annealing for Job Shop Scheduling.",
                    "Anticipation in Dynamic Optimization: The Scheduling Case.",
                    "Multirecombinated Evolutionary Algorithms for the Flow Shop Scheduling Problem.",
                    "GA Based on the UV-Structure Hypothesis and Its Application to JSP.",
                    "Neighbourhood Based Robustness Applied to Tardiness and Total Flowtime Job Shops.",
                    "Solving Extended Hybrid-Flow-Shop Problems Using Active Schedule Generation and Genetic Algorithms.",
                    "A Comparison of Genetic Algorithms for the Static Job Shop Scheduling Problem.",
                    "An Empirical Study on GAs \"Without Parameters\".",
                    "Using Dynastic Exploring Recombination to Promote Diversity in Genetic Search.",
                    "Adaptic Control of the Mutation Probability by Fuzzy Logic Controllers.",
                    "A Comparison of Two Representations for the Fixed Charge Transportation Problem.",
                    "Invariance, Self-Adaptation and Correlated Mutations and Evolution Strategies.",
                    "Theoretical Analysis of Simplex Crossover for Real-Coded Genetic Algorithms.",
                    "Applying Self-Organised Criticality to Evolutionary Algorithms.",
                    "Genetic Algorithms, Clustering, and the Breaking of Symmetry.",
                    "Pruefer Numbers and Genetic Algorithms: A Lesson on How the Low Locality of an Encoding Can Harm the Performance of GAs.",
                    "Median-Selection for Parallel Steady-State Evolution Strategies.",
                    "The Origination of Diversity by Adaptive Clustering.",
                    "Symbiotic Combination as an Alternative to Sexual Recombination in Genetic Algorithms.",
                    "Island Model Cooperating with Speciation for Multimodal Optimization.",
                    "Optimizing through Co-evolutionary Avalanches.",
                    "Evolution of Altruism in Viscous Populations: Effects of Altruism on the Evolution of Migrating Behavior.",
                    "A Game-Theoretic Approach to the Simple Coevolutionary Algorithm.",
                    "The Number of People with Whom a Man Interacts.",
                    "NK-Landscapes as Test Functions for Evaluation of Host-Parasite Algorithms.",
                    "Towards Balanced Coevolution.",
                    "Spatial Games with Adaptive Tit-For-Tats.",
                    "Competitive Segmentation: A Struggle for Image Space.",
                    "An Adaptive Algorithm for Constrained Optimization Problems.",
                    "Test-Case Generator TCG-2 for Nonlinear Parameter Optimisation.",
                    "Solving CSP Instances Beyond the Phase Transition Using Stochastic Search Algorithms.",
                    "Steady-State Evolutionary Path Planning, Adaptive Replacement, and Hyper-Diversity.",
                    "Optimization of Noisy Fitness Functions by Means of Genetic Algorithms Using History of Search.",
                    "An Efficient Random Number Generation Architecture for Hardware Parallel Genetic Algorithms.",
                    "An Integrated On-Line Learning System for Evolving Programmable Logic Array Controllers.",
                    "Selection and Reinforcement Learning for Combinatorial Optimization.",
                    "Ant Colony Optimization for the Total Weighted Tardiness Problem.",
                    "Adaptive Fitness Functions for the Satisfiability Problem.",
                    "Large-Scale Permutation Optimization with the Ordering Messy Genetic Algorithm.",
                    "A Hybrid GA for the Edge-Biconnectivity Augmentation Problem.",
                    "A Temporal Representation for GA and TSP.",
                    "A Comparison of Nature Inspired Heuristics on the Traveling Salesman Problem.",
                    "A Genetic Algorithm for VLSI Floorplanning.",
                    "Scalability and Efficiency of Genetic Algorithms for Geometrical Applications.",
                    "Genetic Optimization of the EPR Spectral Parameters: Algorithm Implementation and Preliminary Results.",
                    "Fitting Fluorescence Spectra with Genetic Algorithms.",
                    "Real-Coded Adaptive Range Genetic Algorithm Applied to Transonic Wing Optimization.",
                    "Stream Cyphers with One- and Two-Dimensional Cellular Automata.",
                    "Investigating Generalization in the Anticipatory Classifier System.",
                    "A New Bootstrapping Method to Improve Classification Performance in Learning Classifier Systems.",
                    "Towards Automatic Domain Knowledge Extraction for Evolutionary Heuristics.",
                    "Expanding from Discrete to Continuous Estimation of Distribution Algorithms: The IDEA.",
                    "A New Genetic Algorithms Working on State Domain Order Statistics.",
                    "A Factorized Distribution Algorithm Using Single Connected Bayesian Networks.",
                    "Optimization as Side-Effect of Evolving Allelopathic Diversity.",
                    "Reaction-Diffusion Model of a Honeybee Colony's Foraging Behaviour.",
                    "A Religion-Based Spatial Model for Evolutionary Algorithms.",
                    "Bayesian Evolutionary Optimization Using Helmholtz Machines.",
                    "The Pareto Envelope-Based Selection Algorithm for Multi-objective Optimisation.",
                    "A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimisation: NSGA-II.",
                    "Mechanical Component Design for Multiple Objectives Using Elitist Non-dominated Sorting GA.",
                    "On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem.",
                    "A Hierarchical Genetic Algorithm Using Multiple Models for Optimization.",
                    "Take It EASEA.",
                    "Evolutionary Computation Visualization: Application to G-PROP."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th PPSN 1998",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/1998",
                "sub_name": "Parallel Problem Solving from Nature - PPSN V, 5th International Conference, Amsterdam, The Netherlands, September 27-30, 1998, Proceedings.",
                "count": 101,
                "papers": [
                    "Modelling Genetic Algorithms: From Markov Chains to Dependence with Complete Connections.",
                    "On the Optimization of Unimodal Functions with the (1 + 1) Evolutionary Algorithm.",
                    "A Timing Analysis of Convergence to Fitness Sharing Equilibrium.",
                    "Where Elitists Start Limping Evolution Strategies at Ridge Functions.",
                    "A Bit-Wise Epistasis Measure for Binary Search Spaces.",
                    "Inside GA Dynamics: Ground Basis for Comparison.",
                    "The Effect of Spin-Flip Symmetry on the Performance of the Simple GA.",
                    "Fitness Distance Correlation and Ridge Functions.",
                    "Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.",
                    "Modeling Building-Block Interdependency.",
                    "Mutate Large, But Inherit Small! On the Analysis of Rescaled Mutations in 1-lambda-ES with Noisy Fitness Data.",
                    "Creating Robust Solutions by Means of Evolutionary Algorithms.",
                    "Analytic Curve Detection from a Noisy Binary Edge Map Using Genetic Algorithm.",
                    "A Comparison of Dominance Mechanisms and Simple Mutation on Non-stationary Problems.",
                    "Adaptation to a Changing Environment by Means of the Feedback Thermodynamical Genetic Algorithm.",
                    "Optimization with Noisy Function Evaluations.",
                    "On Risky Methods for Local Selection under Noise.",
                    "Polygenic Inheritance - A Haploid Scheme that Can Outperform Diploidy.",
                    "Averaging Efficiently in the Presence of Noise.",
                    "Solving Binary Constraint Satisfaction Problems Using Evolutionary Algorithms with an Adaptive Fitness Function.",
                    "Varying Fitness Functions in Genetic Algorithms: Studying the Rate of Increase of the Dynamic Penalty Terms.",
                    "Landscape Changes and the Performance of Mapping Based Constraint Handling Methods.",
                    "A Decoder-Based Evolutionary Algorithm for Constrained Parameter Optimization Problems.",
                    "A Spatial Predator-Prey Approach to Multi-objective Optimization: A Preliminary Study.",
                    "Selective Breeding in a Multiobjective Genetic Algorithm.",
                    "Niching and Elitist Models for MOGAs.",
                    "Parallel Evolutionary Optimisation with Constraint Propagation.",
                    "Methods to Evolve Legal Phenotypes.",
                    "Multiobjective Optimization Using Evolutionary Algorithms - A Comparative Case Study.",
                    "Utilizing Dynastically Optimal Forma Recombination in Hybrid Genetic Algorithms.",
                    "Further Experimentations on the Scalability of the GEMGA.",
                    "Indexed Memory as a Generic Protocol for Handling Vectors of Data in Genetic Programming.",
                    "On Genetic Algorithms and Lindenmayer Systems.",
                    "Genome Length as an Evolutionary Self-adaptation.",
                    "Restart Scheduling for Genetic Algorithms.",
                    "A Comparative Study of Global and Local Selection in Evolution Strategies.",
                    "UEGO, an Abstract Niching Technique for Global Optimization.",
                    "Development of Problem-Specific Evolutionary Algorithms.",
                    "The Effects of Control Parameters and Restarts on Search Stagnation in Evolutionary Programming.",
                    "Accelerating the Evolutionary-Gradient-Search Procedure: Individual Step Sizes.",
                    "Extending Population-Based Incremental Learning to Continuous Search Spaces.",
                    "Multi-parent Recombination in Genetic Algorithms with Search Space Boundary Extension by Mirroring.",
                    "Selective Crossover in Genetic Algorithms: An Empirical Study.",
                    "Line-Breeding Schemes for Combinatorial Optimization.",
                    "Finding Regions of Uncertainty in Learned Models: An Application to Face Detection.",
                    "On ZCS in Multi-agent Environments.",
                    "Empirical Analysis of the Factors that Affect the Baldwin Effect.",
                    "Promoting Generalisation of Learned Behaviours in Genetic Programming.",
                    "Generalization in Wilson's Classifier System.",
                    "Symbiotic Coevolution of Artificial Neural Networks and Training Data Sets.",
                    "Information-Theoretic Analysis of a Mobile Agent's Learning in a Discrete State Space.",
                    "The Coevolution of Antibodies for Concept Learning.",
                    "Does Data-Model Co-evolution Improve Generalization Performance of Evolving Learners?",
                    "A Corporate Classifier System.",
                    "Applying Diffusion to a Cooperative Coevolutionary Model.",
                    "Studying Parallel Evolutionary Algorithms: The Cellular Programming Case.",
                    "Learning to Avoid Moving Obstacles Optimally for Mobile Robots Using a Genetic-Fuzzy Approach.",
                    "Evolutionary Neural Networks for Nonlinear Dynamics Modeling.",
                    "Hybrid Distributed Real-Coded Genetic Algorithms.",
                    "Mechanisms of Emergent Computation in Cellular Automata.",
                    "Towards Designing Neural Network Ensembles by Evolution.",
                    "Selection of Training Data for Neural Networks by a Genetic Algorithm.",
                    "Discovery with Genetic Algorithm Scheduling Strategies for Cellular Automata.",
                    "Simple + Parallel + Local = Cellular Computing.",
                    "Evolution, Learning and Speech Recognition in Changing Acoustic Environments.",
                    "Ant Colonies for Adaptive Routing in Packet-Switched Communications Networks.",
                    "The Stud GA: A Mini Revolution?",
                    "An Island Model Based Ant System with Lookahead for the Shortest Supersequence Problem.",
                    "Parameter-Free Genetic Algorithm Inspired by \"Disparity Theory of Evolution\".",
                    "Immune Network Dynamics for Inductive Problem Solving.",
                    "Parallelization Strategies for Ant Colony Optimization.",
                    "Self-Organising Pattern Formation: Fruit Flies and Cell Phones.",
                    "A New Genetic Local Search Algorithm for Graph Coloring.",
                    "Improving the Performance of Evolutionary Algorithms for the Satisfiability Problem by Refining Functions.",
                    "Memetic Algorithms and the Fitness Landscape of the Graph Bi-Partitioning Problem.",
                    "Investigating Evolutionary Approaches to Adaptive Database Management Against Various Quality of Service Metrics.",
                    "Genetic Algorithm Behavior in the MAXSAT Domain.",
                    "An Adaptive Mutation Scheme for a Penalty-Based Graph-Colouring GA.",
                    "Inver-over Operator for the TSP.",
                    "Repair and Brood Selection in the Traveling Salesman Problem.",
                    "The Traveling Salesrep Problem, Edge Assembly Crossover, and 2-opt.",
                    "Load Balancing in Parallel Circuit Testing with Annealing-Based and Genetic Algorithms.",
                    "A Heuristic Combination Method for Solving Job-Shop Scheduling Problems.",
                    "Reduction of Air Traffic Congestion by Genetic Algorithms.",
                    "Timetabling the Classes of an Entire University with an Evolutionary Algorithm.",
                    "Genetic Algorithms for the Multiple Container Packing Problem.",
                    "Buffer Memory Optimization in DSP Applications - An Evolutionary Approach.",
                    "The Breeder Genetic Algorithm for Frequency Assignment.",
                    "A Permutation Based Genetic Algorithm for Minimum Span Frequency Assignment.",
                    "Comparison of Evolutionary Algorithms for Design Optimization.",
                    "Aspects of Digital Evolution: Evolvability and Architecture.",
                    "Integrated Facility Design Using an Evolutionary Approach with a Subordinate Network Algorithm.",
                    "An Evolutionary Algorithm for Synthesizing Optical Thin-Film Designs.",
                    "Implementing Genetic Algorithms with Sterical Constraints for Protein Structure Prediction.",
                    "Optimal Placements of Flexible Objects: An Adaptive Simulated Annealing Approach.",
                    "Encapsulated Evolution Strategies for the Determination of Group Contribution Model Parameters in Order to Predict Thermodynamic Properties.",
                    "Recombination Operators for Evolutionary Graph Drawing.",
                    "Optimisation of Density Estimation Models with Evolutionary Algorithms.",
                    "Genetic Algorithm in Parameter Estimation of Nonlinear Dynamic Systems.",
                    "Optimizing Web Page Layout Using an Annealed Genetic Algorithm as Client-Side Script.",
                    "Solving the Capacitor Placement Problem in a Radial Distribution System Using an Adaptive Genetic Algorithm."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th PPSN 1996",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/1996",
                "sub_name": "Parallel Problem Solving from Nature - PPSN IV, International Conference on Evolutionary Computation. The 4th International Conference on Parallel Problem Solving from Nature, Berlin, Germany, September 22-26, 1996, Proceedings.",
                "count": 103,
                "papers": [
                    "Computational Brittleness and the Evolution of Computer Viruses.",
                    "Evolutionary Computing in Multi-Agent Environments: Specification and Symbiogenesis.",
                    "Evolution Strategies with Subjective Selection.",
                    "Emergent Cooperation for Multiple Agents Using Genetic Programming.",
                    "Evolution Programs Evolved.",
                    "Encoding Scheme Issues for Open-Ended Artificial Evolution.",
                    "Hardware Evolution at Function Level.",
                    "Coevolutionary Life-Time Learning.",
                    "Genetic Programs and Co-Evolution: Developing robust general purpose controllers using local mating in two-dimensional populations.",
                    "Self-Assemblage of Gene Nets in Evolution via Recruiting of New Netters.",
                    "A Survey of Intron Research in Genetics.",
                    "Analytical and Numerical Investigations of Evolutionary Algorithms in Continuous Spaces.",
                    "On the Asymptotic Behavior of Multirecombinant Evolution Strategies.",
                    "Are Long Path Problems Hard for Genetic Algorithms?",
                    "Random Tree Generation for Genetic Programming.",
                    "Implicit Formae in Genetic Algorithms.",
                    "A Probabilistic Database Approach to the Analysis of Genetic Algorithms.",
                    "Mean Field Analysis of Tournament Selection on a Random Manifold.",
                    "From Recombination of Genes to the Estimation of Distributions I. Binary Parameters.",
                    "From Recombination of Genes to the Estimation of Distributions II. Continuous Parameters.",
                    "Searching in the Presence of Noise.",
                    "The Density of States - A Measure of the Difficulty of Optimisation Problems.",
                    "On Interactive Evolutionary Algorithms and Stochastic Mealy Automata.",
                    "The Influence of Different Coding Schemes on the Computational Complexity of Genetic Algorithms in Function Optimization.",
                    "An Analysis of the Effects of Neighborhood Size and Shape on Local Selection Algorithms.",
                    "Evolutionary Computation at the Edge of Feasibility.",
                    "Dimensional Analysis of Allele-Wise Mixing Revisited.",
                    "Gaussian Diffusion in a Simple Genetic Algorithm.",
                    "Erroneous Truncation Selection - A Breeder's Decision Making Perspective.",
                    "New Crossover Methods For Sequencing Problems.",
                    "The Effect of Extensive Use of the Mutation Operator on Generalization in Genetic Programming Using Sparse Data Sets.",
                    "On Permutation Representations for Scheduling Problems.",
                    "Multi-Parent's Niche: n-ary Crossovers on NK-Landscapes.",
                    "A Preliminary Investigation into Directed Mutations in Evolutionary Algorithms.",
                    "Heuristic Crossovers for Real-Coded Genetic Algorithms Based on Fuzzy Connectives.",
                    "Are Evolutionary Algorithms Improved by Large Mutations?",
                    "Mutation by Imitation in Boolean Evolution Strategies.",
                    "Formal Algorithms + Formal Representations = Search Strategies.",
                    "A Genetic Algorithm with Variable Range of Local Search for Tracking Changing Environments.",
                    "An Evolution Strategy with Adaption of the Step Sizes by a Variance Function.",
                    "Every Niching Method has its Niche: Fitness Sharing and Implicit Sharing Compared.",
                    "Effects of Isolation in a Distributed Population Genetic Algorithm.",
                    "Self-Adaptive Genetic Algorithm for Numeric Functions.",
                    "Niche Search: An Evolutionary Algorithm for Global Optimisation.",
                    "Adaptively Parameterised Evolutionary Systems: Self-Adaptive Recombination and Mutation in a Genetic Algorithm.",
                    "Obtaining Multiple Distinct Solutions with Genetic Algorithm Niching Methods.",
                    "Cost Based Operator Rate Adaption: An Investigation.",
                    "Genetic Algorithms and Relational Landscapes.",
                    "IOGA: An Instance-Oriented Genetic Algorithm.",
                    "Explicit Filtering of Building Blocks for Genetic Algorithms.",
                    "Multi-Objective Optimization by Means of the Thermodynamical Genetic Algorithm.",
                    "Adaption to a Changing Environment by Means of the Thermodynamical Genetic Algorithm.",
                    "The Development of a Dual-Agent Strategy for Efficient Search Across Whole System Engineering Design Hierachies.",
                    "A Parallel Cellular Genetic Algorithm Used in Finite Element Simulation.",
                    "A Robust Solution Searching Scheme in Genetic Search.",
                    "Solving Master Mind Using GAs and Simulated Annealing: A Case of Dynamic Constraint Optimization.",
                    "Evolving Compact Solutions in Genetic Programming: A Case Study.",
                    "Climbing Up NP-Hard Hills.",
                    "On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers.",
                    "Paginating the Generalized Newspaper - A Comparison of Simulated Annealing and a Heuristic Method.",
                    "A Comparison of Optimization Techniques for Integrated Manufacturing Planning and Scheduling.",
                    "A Comparison of Search Techniques on a Wing-Box Optimisation Problem.",
                    "A Comparative Study of Evolutionary Algorithms for On-Line Parameter Tracking.",
                    "Modeling Urban Growth by Cellular Automata.",
                    "Democratic Optimization for Discrete and Continuous Systems.",
                    "A Study of Some Properties of Ant-Q.",
                    "Immunoid: An Immunological Approach to Decentralized Behavoir Arbitration of Autonomous Mobile Robots.",
                    "Parallelizable Evolutionary Dynamics Principles for Solving the Maximum Clique Problem.",
                    "Significance of Locality and Selection Pressure in the Grand Deluge Evolutionary Algorithm.",
                    "Parallel Computing with DNA: Toward the Anti-Universal Machine.",
                    "Tackling the \"Curse of Dimensionality\" of Radial Basis Functional Neural Networks Using a Genetic Algorithm.",
                    "A Three-Stage Method for Designing Genetic Fuzzy Systems by Learning from Examples.",
                    "Learning Heuristics for OBDD Minimization by Evolutionary Algorithms.",
                    "Improving the Generalization Performance of Multi-Layer-Perceptrons with Population-Based Incremental Learning.",
                    "Robust GP in Robot Learning.",
                    "A Pattern Recognition System Using Evolvable Hardware.",
                    "Topology Design of Feedforward Neural Networks by Genetic Algorithms.",
                    "An Evolution Strategy for On-line Optimisation of Dynamic Objective Functions.",
                    "Exploiting Competing Subpopulations for Automatic Generation of Test Sequences for Digital Cicuits.",
                    "Constraint Handling in Evolutionary Search: A Case Study of the Frequency Assignment.",
                    "An Application of Genetic Algorithms and Neural Networks to Scheduling Power Generating Systems.",
                    "Evolutionary Algorithms for the Calculation of Electron Distributions in Si-MOSFETs.",
                    "Refueling of a Nuclear Power Plant: Comparison of a Naive and a Specialized Mutation Operator.",
                    "Genetic Algorithms Applied to the Physical Design of VLSI Circuits: A Survey.",
                    "Stochastic Methods for Transistor Size Optimization of CMOS VLSI Circuits.",
                    "An Adaptive Parallel Genetic Algorithm for VLSI-Layout Optimization.",
                    "Genetic Algorithms for Protocol Validation.",
                    "Constraint Handling for the Fault Coverage Code Generation Problem: An Inductive Evolutionary Approach.",
                    "New Genetic Local Search Operators for the Traveling Salesman Problem.",
                    "An Evolutionary Approach to Hardware/ Software Partitioning.",
                    "Evolutionary Air Traffic Flow Management for Large 3D-problems.",
                    "Genetic-Based Dynamic Load Balancing: Implementation and Evaluation.",
                    "Production Scheduling with Genetic Algorithms and Simulation.",
                    "Network Optimization Using Evolutionary Strategies.",
                    "Co-evolving Parallel Random Number Generators.",
                    "Scheduling by Genetic Local Search with Multi-Step Crossover.",
                    "Finding the Conformation of Organic Molecules with Genetic Algorithms.",
                    "Investigating a Parallel Breeder Genetic Algorithm on the Inverse Aerodynamic Design.",
                    "An Evolutionary Design for f-theta Lenses.",
                    "Optimization of Heat Exchanger Networks by Means of Evolution Strategies.",
                    "Industrial Plant Pipe-Route Optimisation with Genetic Algorithms.",
                    "An Evolutionary Algorithm for Design Optimization of Microsystems.",
                    "A Learning Classifier System for Three-Dimensional Shape Optimization."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "3rd PPSN 1994",
        "info": "Jerusalem, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/1994",
                "sub_name": "Parallel Problem Solving from Nature - PPSN III, International Conference on Evolutionary Computation. The Third Conference on Parallel Problem Solving from Nature, Jerusalem, Israel, October 9-14, 1994, Proceedings.",
                "count": 61,
                "papers": [
                    "Lamarckian Evolution, The Baldwin Effect and Function Optimization.",
                    "Control of Parallel Population Dynamics by Social-Like Behavior of GA-Individuals.",
                    "Studying Genotype-Phenotype Interactions: A Model of the Evolution of the Cell Regulation Network.",
                    "A Diploid Genetic Algorithm for Preserving Population Diversity - pseudo-Meiosis GA.",
                    "Co-evolutionary Constraint Satisfaction.",
                    "Towards a Theory of 'Evolution Strategies': Results for (1, +λ)-Strategies on (Nearly) Arbitrary Fitness Functions.",
                    "Advanced Correlation Analysis of Operators for the Traveling Salesman Problem.",
                    "Genetic algorithms with multi-parent recombination.",
                    "On the Mean Convergence Time of Evolutionary Algorithms without Selection and Mutation.",
                    "Estimating the Heritability by Decomposing the Genetic Variance.",
                    "Analyzing Hyperplane Synthesis in Genetic Algorithms Using Clustered Schemata.",
                    "Convergence Models of Genetic Algorithm Selection Schemes.",
                    "Optimal Population Size under Constant Computation Cost.",
                    "An Evolutionary Algorithm for Integer Programming.",
                    "Long Path Problems.",
                    "Evolution Strategies on Noisy Functions: How to Improve Convergence Properties.",
                    "Selection Schemes with Spatial Isolation for Genetic Optimization.",
                    "A Modified Edge Recombination Operator for the Travelling Salesman Problem.",
                    "Step-Size Adaption Based on Non-Local Use of Selection Information.",
                    "Strategy Adaption by Competing Subpopulations.",
                    "Controlling Crossover through Inductive Learning.",
                    "Derivative Operators for Preference Predicate Evolution.",
                    "Adaptive Crossover Using Automata.",
                    "Controlling Dynamics of GA through Filtered Evaluation Function.",
                    "A Cooperative Coevolutionary Approach to Function Optimization.",
                    "A Fuzzy Classifier System Using the Pittsburgh Approach.",
                    "Q-Learning in Evolutionary Rule Based Systems.",
                    "On the Complexity of Learning in Classifier Systems.",
                    "A Representation Scheme To Perform Program Induction in a Canonical Genetic Algorithm.",
                    "Genetic Programming with Local Hill-Climbing.",
                    "Dynamic Training Subset Selection for Supervised Learning in Genetic Programming.",
                    "Genotype-Phenotype-Mapping and Neutral Variation - A Case Study in Genetic Programming.",
                    "Genetic L-System Programming.",
                    "A Genetic Algorithm Discovers Particle-Based Computation in Cellular Automata.",
                    "Simulation of Exaptive Behaviour.",
                    "Artificial Spacing Patterns in a Network of Interacting Celloids.",
                    "Diffuse Pattern Learning with Fuzzy ARTMAP and PASS.",
                    "Different Learning Algorithms for Neural Networks - A Comparative Study.",
                    "Program Search with a Hierarchical Variable Lenght Representation: Genetic Programming, Simulated Annealing and Hill Climbing.",
                    "Problem-Independent Parallel Simulated Annealing using Selection and Migration.",
                    "Parallel Optimization of Evolutionary Algorithms.",
                    "Parallel Simulated Annealing and Genetic Algorithms: a Space of Hybrid Methods.",
                    "ENZO-M - A Hybrid Approach for Optimizing Neural Networks by Evolution and Learning.",
                    "Genetic Lander: An Experiment in Accurate Neuro-Genetic Control.",
                    "Effects of Occam's Razor in Evolving Sigma-Pi Neural Nets.",
                    "Designing Neural Networks by Adaptively Building Blocks in Cascades.",
                    "Hybrid Adaptive Heuristic Critic Architectures for Learning in Mazes with Continuous Search Spaces.",
                    "Mutation Operators for Structure Evolutionof Neural Networks.",
                    "Implementation of Standard Genetic Algorithm on MIMD Machines.",
                    "Loosely Coupled Distributed Genetic Algorithms.",
                    "Applying Evolvable Hardware to Autonomous Agents.",
                    "Genetic Algorithms on LAN-message Passing Architectures using PVM: Application to the Routing Problem.",
                    "Genetic Algorithm Based Design Optimization Of CMOS VLSI Circuits.",
                    "Improving Evolutionary Timetabling with Delta Evaluation and Directed Mutation.",
                    "Genetic Improvement of Railway Timetables.",
                    "Using a Genetic Algorithm to Search for the Representational Bias of a Collective Reinforcement Learner.",
                    "An Evolutionary Algorithm for the Routing of Multi-Chip Modules.",
                    "System Design under Uncertainty: Evolutionary Optimization of the Gravity Probe-B Spacecraft.",
                    "Soft Selection in D-optimal Designs.",
                    "The Weighted Graph Bi-Partitioning Problem: A Look at GA Performance.",
                    "RPL2: A Language and Parallel Framework for Evolutionary Computing."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "2nd PPSN 1992",
        "info": "Brussels, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/1992",
                "sub_name": "Parallel Problem Solving from Nature 2, PPSN-II, Brussels, Belgium, September 28-30, 1992.",
                "count": 60,
                "papers": [
                    "Are Genetic Algorithms Function Optimizers?",
                    "How Genetic Algorithms Really Work: Mutation and Hillclimbing.",
                    "Crowding and Preselection Revisited.",
                    "Massive Multimodality, Deception, and Genetic Algorithms.",
                    "Ordering Genetic Algorithms and Deception.",
                    "Harmonic Analysis, Epistasis and Genetic Algorithms.",
                    "A Local Search Template.",
                    "The Interplay Among the Genetic Algorithm Operators: Information Theory Tools Used in a Holistic Way.",
                    "The Interaction of Mutation Rate, Selection, and Self-Adaptation Within a Genetic Algorithm.",
                    "Dynamics of Diversity in an Evolving Population.",
                    "On Correlated Mutations in Evolution Strategies.",
                    "Investigation of the M-Heuristic for Optimal Mutation Probabilities.",
                    "Biomimetic Use of Genetic Algorithms.",
                    "Genetic Algorithms for Changing Environments.",
                    "Nonstationary Function Optimization using the Structured Genetic Algorithm.",
                    "Hierarchically Structured Distributed Genetic Algorithms.",
                    "BUGS: A Bug-Based Search Strategy using Genetic Algorithms.",
                    "Structure Evolution and Incomplete Induction.",
                    "Alternative Evolution Strategies to Global Optimization.",
                    "An Evolution Strategy with Momentum Adaptation of the Random Number Distribution.",
                    "Reproductive Isolation as Strategy Parameter in Hierarichally Organized Evolution Strategies.",
                    "Genetic Operators, the Fitness Landscape and the Traveling Salesman Problem.",
                    "Exploiting Constraints as Background Knowledge for Genetic Algorithms: A Case-Study for Scheduling.",
                    "Towards Solving Subset Selection Problems with the Aid of the Genetic Algorithm.",
                    "A Genetic Algorithm Application in Nonparametric Functional Estimation.",
                    "Non-Linear Genetic Representations.",
                    "The SAGA Cross: The Mechanics of Recombination for Species with Variable Length Genotypes.",
                    "A Genetic Algorithm Applicable to Large-Scale Job-Shop Problems.",
                    "Application of Genetic Algorithms to Task Planning and Learning.",
                    "A Genetic Algorithm for Parallel Simulated Annealing.",
                    "Adaptive Search Strategy for Genetic Algorithms with Additional Genetic Algorithms.",
                    "Integrating Genetic Algorithms with a Prolog Assignment Program as a Hybrid Solution for a Polytechnic Timetable Problem.",
                    "An Experimental Perspective on Genetic Programming.",
                    "Load Balancing with Genetic Algorithms.",
                    "On the Self-Organisation of Pseudo-Randomness.",
                    "Some Aspects of the 'Evolution Strategiy' for Solving TSP-Like Optimization Problems Appearing at the Design Studies of a 0.5 TeV e+e--Linear Collider.",
                    "Optimizing PWR Reload Core Designs.",
                    "Optimal Control System Synthesis with Genetic Algorithms.",
                    "Genetic Algorithms for Protein Tertiary Structure Prediction.",
                    "Recursive Ensemble Mutagenesis: A Combinatorial Optimization Technique for Protein Engineering.",
                    "Determination of Chemical Equilibria by means of an Evolution Strategy.",
                    "Adaptation of Kohonen Feature Map Topologies by Genetic Algorithms.",
                    "Utilization of Stochastic Automata and Genetic Algorithms for Neural Network Learning.",
                    "Recombination Operators for the Design of Neural Nets by Genetic Algorithm.",
                    "Optimizing Self-Organizing Control Architectures with Genetic Algorithms: The Interaction Between Natural Selection and Ontogenesis.",
                    "The Optimization of a Class of Functionals Based on Developmental Strategies.",
                    "Bio/Computational Sources for PPSN Models.",
                    "In Search of a Good Evolution-Optimization Crossover.",
                    "Differentiable Chromosomes: The Genetic Programming of Switchable Shape-Genes.",
                    "An Approach to Autonomic Spatial Nesting Problem by Vibrating Potential Method.",
                    "An Investigation of some Properties of an \"Ant Algorithm\".",
                    "Hyperplane Annealing and Activator-Inhibitor-Systems.",
                    "Dataflow Parallelism in Genetic Algorithms.",
                    "Parallel Local Search and the Travelling Salesman Problem.",
                    "Comparison of Local Mating Strategies in Massively Parallel Genetic Algorithms.",
                    "An Asynchronous Fine-Grained Parallel Genetic Algorithm.",
                    "A Parallel Genetic Algorithm based on a Neighborhood Model and Its Application to Jobshop Scheduling.",
                    "Putting Artificial Life to Work.",
                    "Mapping by migrating Boltzmann Machine.",
                    "A Silicon VLSI Optical Sensor Based on Mammalian Vision."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "1st PPSN 1990",
        "info": "Dortmund, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ppsn/1990",
                "sub_name": "Parallel Problem Solving from Nature, 1st Workshop, PPSN I, Dortmund, Germany, October 1-3, 1990, Proceedings.",
                "count": 64,
                "papers": [
                    "Global Convergence of Genetic Algorithms: A Markov Chain Analysis.",
                    "The Theory of Virtual Alphabets.",
                    "Towards an Optimal Mutation Probability for Genetic Algorithms.",
                    "An Alternative Genetic Algorithm.",
                    "An Analysis of the Interacting Roles of Population Size and Crossover in Genetic Algorithms.",
                    "GLEAM - A System for Simulated 'Intuitive Learning'.",
                    "Genetic Algorithms and Highly Constrained Problems: The Time-Table Case.",
                    "An Evolution Standing on the Design of Redundant Manipulators.",
                    "Redundant Coding of an NP-Complete Problem Allows Effective Genetic Algorithm Search.",
                    "Circuit Partitioning with Genetic Algorithms Using a Coding Scheme to Preserve the Structure of a Circuit.",
                    "Genetic Algorithms, Production Plan Optimisation, and Scheduling.",
                    "System Identification Using Genetic Algorithms.",
                    "Conformational Analysis of DNA Using Genetic Algorithms.",
                    "Operator-Oriented Genetic Algorithm and its Application to the Sliding Block Puzzle Problem.",
                    "A Topology Exploiting Genetic Algorithm to Control Dynamic Systems.",
                    "Genetic Local Search Algorithms for the Travelling Salesman Problem.",
                    "Genetic Programming: Artificial Nervous Systems, Artificial Embryos and Embryological Electronics.",
                    "Concept Formation and Decision Tree Induction Using the Genetic Programming Paradigm.",
                    "On Solving Travelling Salesman Problems by Genetic Algorithms.",
                    "Genetic Algorithms and Punctuated Equilibria in VLSI.",
                    "Implementing the Genetic Algorithm on Transputer Based Parallel Processing Systems.",
                    "Explicit Parallelism of Genetic Algorithms through Population Structures.",
                    "Parallel Genetic Packing of Rectangles.",
                    "Partitioning a Graph with a Parallel Genetic Algorithm.",
                    "Solving the Mapping Problem - Experiences with a Genetic Algorithm.",
                    "Optimization Using Distributed Genetic Algorithms.",
                    "Application of the 'Evolutionsstrategie' to Discrete Optimization Problems.",
                    "A Variant of Evolution Strategies for Vector Optimization.",
                    "Application of Evolution Strategy in Parallel Populations.",
                    "Global Optimization by Means of Distributed Evolution Strategies.",
                    "Solving Sequential Games with Boltzmann-Learned Tactics.",
                    "Optimizing Simulated Annealing.",
                    "A Local Timing Model for Parallel Optimization with Boltzmann Machines.",
                    "Error-Free Parallel Implementation of Simulated Annealing.",
                    "TRIMM: A Parallel Processor for Image Reconstruction by Simulated Annealing.",
                    "The Response-Time Constraint in Neural Evolution.",
                    "An Artificial Neural Network Representation for Artificial Organisms.",
                    "Feature Construction for Back-Propagation.",
                    "Improved Convergence Rate of Back-Propagation with Dynamic Adaptation of the Learning Rate.",
                    "Performance Evaluation of Evolutionarily Created Neural Network Topologies.",
                    "Optical Image Preprocessing for Neural Network Classifier Systems.",
                    "GANNET: Genetic Design of a Neural Net for Face Recognition.",
                    "The Application of a Genetic Approach as an Algorithm for Neural Networks.",
                    "Genetic Improvements of Feedforward Nets for Approximating Functions.",
                    "Exploring Adaptive Agency III: Simulating the Evolution of Habituation and Sensitization.",
                    "A Learning Strategy for Neural Networks Based on a Modified Evolutionary Strategy.",
                    "Genetic Algorithms and the Immune System.",
                    "Selectionist Categorization.",
                    "A Classifier System with Integrated Genetic Operators.",
                    "The Fuzzy Classifier System: Motivations and first Results.",
                    "Hints for Adaptive Problem Solving Gleaned from Immune Networks.",
                    "A Reactive Robot Navigation System Based on a Fluid Dynamics Metaphor.",
                    "Transfer of Natural Metaphors to Parallel Problem Solvin Applications.",
                    "Modelling and Simulation of Distributed Evolutionary Search Processes for Function Optimization.",
                    "Parallel, Decentralized Spatial Mapping for Robot Navigation and Path Planning.",
                    "Ecological Dynamics under Different Selection Rules in Distributed and Iterated Prisoner's Dilemma Games.",
                    "Adaptation in Signal Spaces.",
                    "A Principle of Minimum Complexity in Evolution.",
                    "The Emergence of Data Structures from Local Interactions.",
                    "The View from the Adaptive Landscape.",
                    "Boltzmann-, Darwin-, and Haeckel-Strategies in Optimization Problems.",
                    "Optimizing Complex Problems by Nature's Algorithms: Simulated Annealing and Evolution Strategy - A Comparative Study.",
                    "Genetic Algorithms and Evolution Strategies - Similarities and Differences.",
                    "Building the Ultimate Machine: The Emergence of Artificial Cognition."
                ]
            }
        ]
    }
]