[
    {
        "name": "TAC",
        "year": "2022",
        "info": "Volume 13: 2022",
        "count": 42,
        "papers": [
            "Editorial: Transactions on Affective Computing - Another Year in the Shade of Covid-19.",
            "Classification of Video Game Player Experience Using Consumer-Grade Electroencephalography.",
            "Affect Estimation in 3D Space Using Multi-Task Active Learning for Regression.",
            "A Comprehensive and Context-Sensitive Neonatal Pain Assessment Using Computer Vision.",
            "Multimodal Self-Assessed Personality Estimation During Crowded Mingle Scenarios Using Wearables Devices and Cameras.",
            "A Novel Sentiment Polarity Detection Framework for Chinese.",
            "First Impressions: A Survey on Vision-Based Apparent Personality Trait Analysis.",
            "Utilizing Deep Learning Towards Multi-Modal Bio-Sensing and Vision-Based Affective Computing.",
            "What an \"Ehm\" Leaks About You: Mapping Fillers into Personality Traits with Quantum Evolutionary Feature Selection Algorithms.",
            "Regression Guided by Relative Ranking Using Convolutional Neural Network (R$^3$3CNN) for Facial Beauty Prediction.",
            "Learning Pain from Action Unit Combinations: A Weakly Supervised Approach via Multiple Instance Learning.",
            "Micro and Macro Facial Expression Recognition Using Advanced Local Motion Patterns.",
            "On-the-Fly Facial Expression Prediction Using LSTM Encoded Appearance-Suppressed Dynamics.",
            "On Emotions as Features for Speech Overlaps Classification.",
            "Emotional Conversation Generation Orientated Syntactically Constrained Bidirectional-Asynchronous Framework.",
            "Emotion Recognition and EEG Analysis Using ADMM-Based Sparse Group Lasso.",
            "Development and Cross-Cultural Evaluation of a Scoring Algorithm for the Biometric Attachment Test: Overcoming the Challenges of Multimodal Fusion with \"Small Data\".",
            "Facial Expression Recognition Using a Temporal Ensemble of Multi-Level Convolutional Neural Networks.",
            "Affective Audio Annotation of Public Speeches with Convolutional Clustering Neural Network.",
            "Participatory Design of Affective Technology: Interfacing Biomusic and Autism.",
            "An Improved Empirical Mode Decomposition of Electroencephalogram Signals for Depression Detection.",
            "Affective Impression: Sentiment-Awareness POI Suggestion via Embedding in Heterogeneous LBSNs.",
            "All-in-One: Emotion, Sentiment and Intensity Prediction Using a Multi-Task Ensemble Framework.",
            "PersEmoN: A Deep Network for Joint Analysis of Apparent Personality, Emotion and Their Relationship.",
            "Multimodal Deception Detection Using Real-Life Trial Data.",
            "Multi-Fusion Residual Memory Network for Multimodal Human Sentiment Comprehension.",
            "Facial Expressions of Comprehension (FEC).",
            "Affect in Multimedia: Benchmarking Violent Scenes Detection.",
            "Rating Vs. Paired Comparison for the Judgment of Dominance on First Impressions.",
            "GCB-Net: Graph Convolutional Broad Network and Its Application in Emotion Recognition.",
            "Multiple Instance Learning for Emotion Recognition Using Physiological Signals.",
            "MES-P: An Emotional Tonal Speech Dataset in Mandarin with Distal and Proximal Labels.",
            "Leveraging the Deep Learning Paradigm for Continuous Affect Estimation from Facial Expressions.",
            "Review on Psychological Stress Detection Using Biosignals.",
            "Psychophysiological Reactions to Persuasive Messages Deploying Persuasion Principles.",
            "Joint Multi-Dimensional Model for Global and Time-Series Annotations.",
            "Exploiting Evolutionary Algorithms to Model Nonverbal Reactions to Conversational Interruptions in User-Agent Interactions.",
            "DepecheMood++: A Bilingual Emotion Lexicon Built Through Simple Yet Powerful Techniques.",
            "Multi-Label Multi-Task Deep Learning for Behavioral Coding.",
            "The Recognition of Multiple Anxiety Levels Based on Electroencephalograph.",
            "Automatic Recognition Methods Supporting Pain Assessment: A Survey.",
            "Study on Horse-Rider Interaction Based on Body Sensor Network in Competitive Equitation."
        ]
    },
    {
        "name": "TAC",
        "year": "2021",
        "info": "Volume 12: 2021",
        "count": 85,
        "papers": [
            "Editorial: Transactions on Affective Computing - Affective Computing in the Times of Pandemics.",
            "Decoding the Perception of Sincerity in Dialogues.",
            "The Ordinal Nature of Emotions: An Emerging Approach.",
            "Recognizing Induced Emotions of Movie Audiences from Multimodal Information.",
            "Faded Smiles? A Largescale Observational Study of Smiling from Adolescence to Old Age.",
            "Induction of Emotional States in Educational Video Games Through a Fuzzy Control System.",
            "Leveraging Affective Hashtags for Ranking Music Recommendations.",
            "Inter-Brain EEG Feature Extraction and Analysis for Continuous Implicit Emotion Tagging During Video Watching.",
            "Brain's Night Symphony (BraiNSy): A Methodology for EEG Sonification.",
            "The MatchNMingle Dataset: A Novel Multi-Sensor Resource for the Analysis of Social Interactions and Group Dynamics In-the-Wild During Free-Standing Conversations and Speed Dates.",
            "A Novel Classification Strategy to Distinguish Five Levels of Pain Using the EEG Signal Features.",
            "Partial Reinforcement in Game Biofeedback for Relaxation Training.",
            "Empirical Evidence Relating EEG Signal Duration to Emotion Classification Performance.",
            "On Social Involvement in Mingling Scenarios: Detecting Associates of F-Formations in Still Images.",
            "Feature Pooling of Modulation Spectrum Features for Improved Speech Emotion Recognition in the Wild.",
            "Induction and Profiling of Strong Multi-Componential Emotions in Virtual Reality.",
            "Multimodal Classification of Stressful Environments in Visually Impaired Mobility Using EEG and Peripheral Biosignals.",
            "Computer Vision Analysis for Quantification of Autism Risk Behaviors.",
            "Bio-Inspired Deep Attribute Learning Towards Facial Aesthetic Prediction.",
            "Integrating Deep and Shallow Models for Multi-Modal Depression Analysis - Hybrid Architectures.",
            "Sparse MDMO: Learning a Discriminative Feature for Micro-Expression Recognition.",
            "Video-Based Depression Level Analysis by Encoding Deep Spatiotemporal Features.",
            "Towards Analyzing and Predicting the Experience of Live Performances with Wearable Sensing.",
            "Introduction to the Special Issue On Computational Modelling of Emotion.",
            "Towards a Prediction and Data Driven Computational Process Model of Emotion.",
            "An Architecture for Emotional Facial Expressions as Social Signals.",
            "Applying Probabilistic Programming to Affective Computing.",
            "A Hybrid Cognitive Architecture with Primal Affect and Physiology.",
            "A Computational Model of Focused Attention Meditation and Its Transfer to a Sustained Attention Task.",
            "Embodied Robot Models for Interdisciplinary Emotion Research.",
            "Towards Transparent Robot Learning Through TDRL-Based Emotional Expressions.",
            "Deep Learning for Spatio-Temporal Modeling of Dynamic Spontaneous Emotions.",
            "Automatic Recognition of Facial Displays of Unfelt Emotions.",
            "On the Influence of Affect in EEG-Based Subject Identification.",
            "Predicting Emotionally Salient Regions Using Qualitative Agreement of Deep Neural Network Regressors.",
            "Brain Dynamics During Arousal-Dependent Pleasant/Unpleasant Visual Elicitation: An Electroencephalographic Study on the Circumplex Model of Affect.",
            "Layered-Modeling of Affective and Sensory Experiences using Structural Equation Modeling: Touch Experiences of Plastic Surfaces as an Example.",
            "Compensation Techniques for Speaker Variability in Continuous Emotion Prediction.",
            "Biofeedback Arrests Sympathetic and Behavioral Effects in Distracted Driving.",
            "Sentiment Polarity Classification at EVALITA: Lessons Learned and Open Challenges.",
            "AMIGOS: A Dataset for Affect, Personality and Mood Research on Individuals and Groups.",
            "A Bi-Hemisphere Domain Adversarial Neural Network Model for EEG Emotion Recognition.",
            "Survey on Emotional Body Gesture Recognition.",
            "Deep Learning for Human Affect Recognition: Insights and New Developments.",
            "Facial Expression Recognition with Identity and Emotion Joint Learning.",
            "Special Issue on Automated Perception of Human Affect from Longitudinal Behavioral Data.",
            "EmoBed: Strengthening Monomodal Emotion Recognition via Training with Crossmodal Emotion Embeddings.",
            "Spatio-Temporal Encoder-Decoder Fully Convolutional Network for Video-Based Dimensional Emotion Recognition.",
            "Modeling Emotion in Complex Stories: The Stanford Emotional Narratives Dataset.",
            "Exploiting Multi-CNN Features in CNN-RNN Based Dimensional Emotion Recognition on the OMG in-the-Wild Dataset.",
            "On the Effect of Observed Subject Biases in Apparent Personality Analysis From Audio-Visual Signals.",
            "Task Load Estimation from Multimodal Head-Worn Sensors Using Event Sequence Features.",
            "Longitudinal Observational Evidence of the Impact of Emotion Regulation Strategies on Affective Expression.",
            "Multilevel Longitudinal Analysis of Shooting Performance as a Function of Stress and Cardiovascular Responses.",
            "Using Circular Models to Improve Music Emotion Recognition.",
            "Autoencoder for Semisupervised Multiple Emotion Detection of Conversation Transcripts.",
            "A Mathematical Description of Emotional Processes and Its Potential Applications to Affective Computing.",
            "Cross-Cultural and Cultural-Specific Production and Perception of Facial Expressions of Emotion in the Wild.",
            "A Scalable Off-the-Shelf Framework for Measuring Patterns of Attention in Young Children and Its Application in Autism Spectrum Disorder.",
            "Multi-Feature Based Network Revealing the Structural Abnormalities in Autism Spectrum Disorder.",
            "Multi-Modal Pain Intensity Recognition Based on the SenseEmotion Database.",
            "Neural Attentive Network for Cross-Domain Aspect-Level Sentiment Classification.",
            "Early Detection of User Engagement Breakdown in Spontaneous Human-Humanoid Interaction.",
            "First Impressions Count! The Role of the Human's Emotional State on Rapport Established with an Empathic versus Neutral Virtual Therapist.",
            "A Review on Nonlinear Methods Using Electroencephalographic Recordings for Emotion Recognition.",
            "Capturing Emotion Distribution for Multimedia Emotion Tagging.",
            "An EEG-Based Brain Computer Interface for Emotion Recognition and Its Application in Patients with Disorder of Consciousness.",
            "Prediction of Car Design Perception Using EEG and Gaze Patterns.",
            "Feature Extraction and Selection for Emotion Recognition from Electrodermal Activity.",
            "Over-Sampling Emotional Speech Data Based on Subjective Evaluations Provided by Multiple Individuals.",
            "Adapting Software with Affective Computing: A Systematic Review.",
            "Improving Attention Model Based on Cognition Grounded Data for Sentiment Analysis.",
            "Designing an Experience Sampling Method for Smartphone Based Emotion Detection.",
            "Survey on Style in 3D Human Body Motion: Taxonomy, Data, Recognition and Its Applications.",
            "SchiNet: Automatic Estimation of Symptoms of Schizophrenia from Facial Behaviour Analysis.",
            "Towards Disorder-Independent Automatic Assessment of Emotional Competence in Neurological Patients with a Classical Emotion Recognition System: Application in Foreign Accent Syndrome.",
            "Automatic Detection of Mind Wandering from Video in the Lab and in the Classroom.",
            "Exploring Macroscopic and Microscopic Fluctuations of Elicited Facial Expressions for Mood Disorder Classification.",
            "Video Affective Content Analysis by Exploring Domain Knowledge.",
            "Deep Facial Action Unit Recognition and Intensity Estimation from Partially Labelled Data.",
            "Speech-Driven Expressive Talking Lips with Conditional Sequential Generative Adversarial Networks.",
            "Effects of Computerized Emotional Training on Children with High Functioning Autism.",
            "Improving Cross-Corpus Speech Emotion Recognition with Adversarial Discriminative Domain Generalization (ADDoG).",
            "Jointly Aligning and Predicting Continuous Emotion Annotations.",
            "Personality Traits Classification Using Deep Visual Activity-Based Nonverbal Features of Key-Dynamic Images."
        ]
    },
    {
        "name": "TAC",
        "year": "2020",
        "info": "Volume 11: 2020",
        "count": 60,
        "papers": [
            "Transactions on Affective Computing - Celebrating the 10th Year of Publication.",
            "Approaches to Automated Detection of Cyberbullying: A Survey.",
            "Feature Learning from Spectrograms for Assessment of Personality Traits.",
            "Dimensional Affect Recognition from HRV: An Approach Based on Supervised SOM and ELM.",
            "Affective Recognition in Dynamic and Interactive Virtual Environments.",
            "A Novel Technique to Develop Cognitive Models for Ambiguous Image Identification Using Eye Tracker.",
            "Continuous, Real-Time Emotion Annotation: A Novel Joystick-Based Analysis Framework.",
            "Automatic ECG-Based Emotion Recognition in Music Listening.",
            "Toward Constructing a Real-time Social Anxiety Evaluation System: Exploring Effective Heart Rate Features.",
            "Personalised, Multi-Modal, Affective State Detection for Hybrid Brain-Computer Music Interfacing.",
            "Facial Expression Recognition with Neighborhood-Aware Edge Directional Pattern (NEDP).",
            "Haptic Expression and Perception of Spontaneous Stress.",
            "Automatic Estimation of Taste Liking Through Facial Expression Dynamics.",
            "Using Temporal Features of Observers' Physiological Measures to Distinguish Between Genuine and Fake Smiles.",
            "Social Signal Detection by Probabilistic Sampling DNN Training.",
            "Idiom-Based Features in Sentiment Analysis: Cutting the Gordian Knot.",
            "Personalized Multitask Learning for Predicting Tomorrow's Mood, Stress, and Health.",
            "Human Observer and Automatic Assessment of Movement Related Self-Efficacy in Chronic Pain: From Exercise to Functional Activity.",
            "Deep Physiological Affect Network for the Recognition of Human Emotions.",
            "Emotion Recognition Based on High-Resolution EEG Recordings and Reconstructed Brain Sources.",
            "Computational Study of Primitive Emotional Contagion in Dyadic Interactions.",
            "Generalized Two-Stage Rank Regression Framework for Depression Score Prediction from Speech.",
            "Singing Robots: How Embodiment Affects Emotional Responses to Non-Linguistic Utterances.",
            "Analysis and Classification of Cold Speech Using Variational Mode Decomposition.",
            "Emotion Recognition in Simulated Social Interactions.",
            "Film Mood and Its Quantitative Determinants in Different Types of Scenes.",
            "Context Sensitivity of EEG-Based Workload Classification Under Different Affective Valence.",
            "Intensional Learning to Efficiently Build Up Automatically Annotated Emotion Corpora.",
            "Co-Clustering to Reveal Salient Facial Features for Expression Recognition.",
            "Speech Synthesis for the Generation of Artificial Personality.",
            "Feature Selection Based Transfer Subspace Learning for Speech Emotion Recognition.",
            "A Case-Based Reasoning Model for Depression Based on Three-Electrode EEG Data.",
            "Detecting Unipolar and Bipolar Depressive Disorders from Elicited Speech Responses Using Latent Affective Structure Model.",
            "Low-Level Characterization of Expressive Head Motion Through Frequency Domain Analysis.",
            "Unsupervised Adaptation of a Person-Specific Manifold of Facial Expressions.",
            "Emotion Recognition on Twitter: Comparative Study and Training a Unison Model.",
            "Pipelined Neural Networks for Phrase-Level Sentiment Intensity Prediction.",
            "Classifying Affective Haptic Stimuli through Gender-Specific Heart Rate Variability Nonlinear Analysis.",
            "Unobtrusive Inference of Affective States in Virtual Rehabilitation from Upper Limb Motions: A Feasibility Study.",
            "Predicting Personality from Book Preferences with User-Generated Content Labels.",
            "Objectivity and Subjectivity in Aesthetic Quality Assessment of Digital Photographs.",
            "Realistic Transformation of Facial and Vocal Smiles in Real-Time Audiovisual Streams.",
            "Gaming Away Stress: Using Biofeedback Games to Learn Paced Breathing.",
            "EEG Emotion Recognition Using Dynamical Graph Convolutional Neural Networks.",
            "Visually Interpretable Representation Learning for Depression Recognition from Facial Images.",
            "Defining Laughter Context for Laughter Synthesis with Spontaneous Speech Corpus.",
            "Computational Analyses of Thin-Sliced Behavior Segments in Session-Level Affect Perception.",
            "Discrete Probability Distribution Prediction of Image Emotions with Shared Sparse Learning.",
            "Physiological Detection of Affective States in Children with Autism Spectrum Disorder.",
            "Segment-Based Methods for Facial Attribute Detection from Partial Faces.",
            "Novel Audio Features for Music Emotion Recognition.",
            "Tracking Dynamics of Opinion Behaviors with a Content-Based Sequential Opinion Influence Model.",
            "Exploring Domain Knowledge for Facial Expression-Assisted Action Unit Activation Recognition.",
            "An Investigation of Partition-Based and Phonetically-Aware Acoustic Features for Continuous Emotion Prediction from Speech.",
            "Look! It's Moving! Is It Alive? How Movement Affects Humans' Affinity Living and Non-Living Entities.",
            "Can We Generate Emotional Pronunciations for Expressive Speech Synthesis?",
            "Automatic Recognition of Children Engagement from Facial Video Using Convolutional Neural Networks.",
            "Strategies to Utilize the Positive Emotional Contagion Optimally in Crowd Evacuation.",
            "A Mutual Information Based Adaptive Windowing of Informative EEG for Emotion Recognition.",
            "HED-ID: An Affective Adaptation Model Explaining the Intensity-Duration Relationship of Emotion."
        ]
    },
    {
        "name": "TAC",
        "year": "2019",
        "info": "Volume 10: 2019",
        "count": 45,
        "papers": [
            "IEEE Transactions on Affective Computing-On Novelty and Valence.",
            "IEEE Transactions on Affective Computing-Entering the 10th Year of Publication.",
            "Editorial of Special Issue on Human Behaviour Analysis \"In-the-Wild\".",
            "AM-FED+: An Extended Dataset of Naturalistic Facial Expressions Collected in Everyday Settings.",
            "AffectNet: A Database for Facial Expression, Valence, and Arousal Computing in the Wild.",
            "Discriminative Spatiotemporal Local Binary Pattern with Revisited Integral Projection for Spontaneous Facial Micro-Expression Recognition.",
            "Estimating Audience Engagement to Predict Movie Ratings.",
            "Audio-Visual Emotion Recognition in Video Clips.",
            "Hidden Smile Correlation Discovery Across Subjects Using Random Walk with Restart.",
            "Cross-Corpus Acoustic Emotion Recognition with Multi-Task Learning: Seeking Common Ground While Preserving Differences.",
            "Interest as a Proxy of Engagement in News Reading: Spectral and Entropy Analyses of EEG Activity Patterns.",
            "Probabilistic Multigraph Modeling for Improving the Quality of Crowdsourced Affective Data.",
            "Studying the Scope of Negation for Spanish Sentiment Analysis on Twitter.",
            "An Adaptive Bayesian Source Separation Method for Intensity Estimation of Facial AUs.",
            "Content-Based Video Emotion Tagging Augmented by Users' Multiple Physiological Responses.",
            "Dynamic Pose-Robust Facial Expression Recognition by Multi-View Pairwise Conditional Random Forests.",
            "Exploring User Experience with Image Schemas, Sentiments, and Semantics.",
            "ISLA: Temporal Segmentation and Labeling for Audio-Visual Emotion Recognition.",
            "Modelling Affect for Horror Soundscapes.",
            "Multi-Objective Based Spatio-Temporal Feature Representation Learning Robust to Expression Intensity Variations for Facial Expression Recognition.",
            "New Methods for Stress Assessment and Monitoring at the Workplace.",
            "Predicting Social Emotions from Readers' Perspective.",
            "Transfer Linear Subspace Learning for Cross-Corpus Speech Emotion Recognition.",
            "Visual Biofeedback and Game Adaptation in Relaxation Skill Transfer.",
            "Multi-Velocity Neural Networks for Facial Expression Recognition in Videos.",
            "Copula Ordinal Regression Framework for Joint Estimation of Facial Action Unit Intensity.",
            "A Novel Method Based on OMPGW Method for Feature Extraction in Automatic Music Mood Classification.",
            "Automatic Analysis of Facial Actions: A Survey.",
            "Capturing Feature and Label Relations Simultaneously for Multiple Facial Action Unit Recognition.",
            "Emotion Classification Using Segmentation of Vowel-Like and Non-Vowel-Like Regions.",
            "Emotions Recognition Using EEG Signals: A Survey.",
            "Fuzzy Histogram of Optical Flow Orientations for Micro-Expression Recognition.",
            "Human-Human Interactional Synchrony Analysis Based on Body Sensor Networks.",
            "Identifying Stable Patterns over Time for Emotion Recognition from EEG.",
            "Novel Audio Feature Projection Using KDLPCCA-Based Correlation with EEG Features for Favorite Music Classification.",
            "Automatic Assessment of Depression Based on Visual Cues: A Systematic Review.",
            "Building Naturalistic Emotionally Balanced Speech Corpus by Retrieving Emotional Speech from Existing Podcast Recordings.",
            "Multimodal Human-Human-Robot Interactions (MHHRI) Dataset for Studying Personality and Engagement.",
            "A Model for an Affective Non-Expensive Utility-Based Decision Agent.",
            "MorpheuS: Generating Structured Music with Constrained Patterns and Tension.",
            "Magnifying Subtle Facial Motions for Effective 4D Expression Recognition.",
            "Listen to Your Face: Inferring Facial Action Units from Audio Channel.",
            "Toward Automating Oral Presentation Scoring During Principal Certification Program Using Audio-Video Low-Level Behavior Profiles.",
            "Profiling Players Using Real-World Datasets: Clustering the Data and Correlating the Results with the Big-Five Personality Traits.",
            "A Methodology for the Automatic Extraction and Generation of Non-Verbal Signals Sequences Conveying Interpersonal Attitudes."
        ]
    },
    {
        "name": "TAC",
        "year": "2018",
        "info": "Volume 9: 2018",
        "count": 47,
        "papers": [
            "Editorial: Transactions on Affective Computing-Good Reasons for Joy and Excitement.",
            "A Combined Rule-Based & Machine Learning Audio-Visual Emotion Recognition Approach.",
            "A Computational Study of Expressive Facial Dynamics in Children with Autism.",
            "Cross-Domain Color Facial Expression Recognition Using Transductive Transfer Subspace Learning.",
            "Facial Expression Recognition in Video with Multiple Feature Fusion.",
            "Individuals' Stress Assessment Using Human-Smartphone Interaction Analysis.",
            "Interactions Between Threat and Executive Control in a Virtual Reality Stroop Task.",
            "Modeling Multiple Time Series Annotations as Noisy Distortions of the Ground Truth: An Expectation-Maximization Approach.",
            "Perception of Emotions and Body Movement in the Emilya Database.",
            "Robust Facial Expression Recognition for MuCI: A Comprehensive Neuromuscular Signal Analysis.",
            "SAMM: A Spontaneous Micro-Facial Movement Dataset.",
            "'Who Likes What and, Why?' Insights into Modeling Users' Personality Based on Image 'Likes'.",
            "ASCERTAIN: Emotion and Personality Recognition Using Commercial Sensors.",
            "Assessing the Influence of Mirroring on the Perception of Professional Competence Using Wearable Technology.",
            "Audio-Based Granularity-Adapted Emotion Classification.",
            "Automated Analysis and Prediction of Job Interview Performance.",
            "Data-Driven Facial Beauty Analysis: Prediction, Retrieval and Manipulation.",
            "Detecting Aggression in Voice Using Inverse Filtered Speech Features.",
            "Detecting Work Stress in Offices by Combining Unobtrusive Sensors.",
            "Emotionally-Relevant Features for Classification and Regression of Music Lyrics.",
            "Heterogeneous Knowledge Transfer in Video Emotion Recognition, Attribution and Summarization.",
            "Spontaneous Expression Detection from 3D Dynamic Sequences by Analyzing Trajectories on Grassmann Manifolds.",
            "Virtual Character Facial Expressions Influence Human Brain and Facial EMG Activity in a Decision-Making Game.",
            "Guest Editorial: Apparent Personality Analysis.",
            "Deep Bimodal Regression of Apparent Personality Traits from Short Video Sequences.",
            "Multimodal First Impression Analysis with Deep Residual Networks.",
            "A Portable Personality Recognizer Based on Affective State Classification Using Spectral Fusion of Features.",
            "Supervised Committee of Convolutional Neural Networks in Automated Facial Expression Analysis.",
            "Improving Socially-Aware Recommendation Accuracy Through Personality.",
            "Emotion Analysis for Personality Inference from EEG Signals.",
            "FiToViz: A Visualisation Approach for Real-Time Risk Situation Awareness.",
            "End-User Development for Interactive Data Analytics: Uncertainty, Correlation and User Confidence.",
            "Affective Video Content Analysis: A Multidisciplinary Insight.",
            "Asynchronous and Event-Based Fusion Systems for Affect Recognition on Naturalistic Data in Comparison to Conventional Approaches.",
            "CAS(ME)2: A Database for Spontaneous Macro-Expression and Micro-Expression Spotting and Recognition.",
            "Combining Facial Expression and Touch for Perceiving Emotional Valence.",
            "Gaze-Sensitive Virtual Reality Based Social Communication Platform for Individuals with Autism.",
            "Leveraging the Bayesian Filtering Paradigm for Vision-Based Facial Affective State Estimation.",
            "Multimodal Depression Detection: Fusion Analysis of Paralinguistic, Head Pose and Eye Gaze Behaviors.",
            "Multimodal Stress Detection from Multiple Assessments.",
            "On the Interrelation Between Listener Characteristics and the Perception of Emotions in Classical Orchestra Music.",
            "Predicting Personalized Image Emotion Perceptions in Social Networks.",
            "Predicting the Probability Density Function of Music Emotion Using Emotion Space Mapping.",
            "Real-Time Movie-Induced Discrete Emotion Recognition from EEG Signals.",
            "Towards Reading Hidden Emotions: A Comparative Study of Spontaneous Micro-Expression Spotting and Recognition Methods.",
            "Automated Depression Diagnosis Based on Deep Networks to Encode Facial Appearance and Dynamics.",
            "Identifying Emotions from Non-Contact Gaits Information Based on Microsoft Kinects."
        ]
    },
    {
        "name": "TAC",
        "year": "2017",
        "info": "Volume 8: 2017",
        "count": 45,
        "papers": [
            "Editorial: IEEE Transactions on Affective Computing - Challenges and Chances.",
            "A Multi-Task Learning Framework for Emotion Recognition Using 2D Continuous Space.",
            "Automated Detection of Engagement Using Video-Based Estimation of Facial Expressions and Heart Rate.",
            "Automatic Prediction of Impressions in Time and across Varying Context: Personality, Attractiveness and Likeability.",
            "Emotion Recognition in Never-Seen Languages Using a Novel Ensemble Method with Emotion Profiles.",
            "Identifying Human Behaviors Using Synchronized Audio-Visual Cues.",
            "MSP-IMPROV: An Acted Corpus of Dyadic Interactions to Study Emotion Perception.",
            "Multiple Instance Learning for Behavioral Coding.",
            "Operationalizing Engagement with Multimedia as User Coherence with Context.",
            "Physiological Responses to Affective Tele-Touch during Induced Emotional Stimuli.",
            "The Cost of Dichotomizing Continuous Labels for Binary Classification Problems: Deriving a Bayesian-Optimal Classifier.",
            "The Indian Spontaneous Expression Database for Emotion Recognition.",
            "Guest Editorial: Toward Commercial Applications of Affective Computing.",
            "Applications of Automated Facial Coding in Media Measurement.",
            "Action Units and Their Cross-Correlations for Prediction of Cognitive Load during Driving.",
            "Cognitive Load Measurement in a Virtual Reality-Based Driving System for Autism Intervention.",
            "MultiSense - Context-Aware Nonverbal Behavior Analysis Framework: A Psychological Distress Use Case.",
            "Adolescent Suicidal Risk Assessment in Clinician-Patient Interaction.",
            "Computational Modeling of Players' Emotional Response Patterns to the Story Events of Video Games.",
            "Cross-Dataset and Cross-Cultural Music Mood Prediction: A Case on Western and Chinese Pop Songs.",
            "Emotion Rendering in Auditory Simulations of Imagined Walking Styles.",
            "Microexpression Identification and Categorization Using a Facial Dynamics Map.",
            "The Pictures We Like Are Our Image: Continuous Mapping of Favorite Pictures into Self-Assessed and Attributed Personality Traits.",
            "Automatic Pain Assessment with Facial Activity Descriptors.",
            "BAUM-1: A Spontaneous Audio-Visual Face Database of Affective and Mental States.",
            "Continuous Estimation of Emotions in Speech by Dynamic Cooperative Speaker Models.",
            "Cyberbullying Detection Based on Semantic-Enhanced Marginalized Denoising Auto-Encoder.",
            "Emotion Rendering in Plantar Vibro-Tactile Simulations of Imagined Walking Styles.",
            "Interaction Style Recognition Based on Multi-Layer Multi-View Profile Representation.",
            "Modeling Dynamics of Expressive Body Gestures In Dyadic Interactions.",
            "Rapport with Virtual Agents: What Do Human Social Cues and Personality Explain?",
            "Sparsity in Dynamics of Spontaneous Subtle Emotions: Analysis and Application.",
            "Toward Use of Facial Thermal Features in Dynamic Assessment of Affect and Arousal Level.",
            "Affective Reasoning for Big Social Data Analysis.",
            "Bootstrapping Social Emotion Classification with Semantically Rich Hybrid Neural Networks.",
            "Inferring Affective Meanings of Words from Word Embedding.",
            "A Neural Word Embeddings Approach for Multi-Domain Sentiment Analysis.",
            "Coarse-Grained +/-Effect Word Sense Disambiguation for Implicit Sentiment Analysis.",
            "Distantly Supervised Lifelong Learning for Large-Scale Social Media Sentiment Analysis.",
            "Guest Editorial: Towards Machines Able to Deal with Laughter.",
            "Laughter and Smiling in 16 Positive Emotions.",
            "Laughter and Tickles: Toward Novel Approaches for Emotion and Behavior Elicitation.",
            "A Wearable Device for Fast and Subtle Spontaneous Smile Recognition.",
            "Audio-Facial Laughter Detection in Naturalistic Dyadic Conversations.",
            "Audio-Driven Laughter Behavior Controller."
        ]
    },
    {
        "name": "TAC",
        "year": "2016",
        "info": "Volume 7: 2016",
        "count": 34,
        "papers": [
            "Editorial: Transactions on Affective Computing - Changes and Continuance.",
            "A Method for Automatic Detection of Psychomotor Entrainment.",
            "Analysis of EEG Signals and Facial Expressions for Continuous Emotion Detection.",
            "Predicting Movie Trailer Viewer's \"Like/Dislike\" via Learned Shot Editing Patterns.",
            "Prediction-Based Audiovisual Fusion for Classification of Non-Linguistic Vocalisations.",
            "Self-Reported Symptoms of Depression and PTSD Are Associated with Reduced Vowel Space in Screening Interviews.",
            "Sentiment Analysis: From Opinion Mining to Human-Agent Interaction.",
            "Two Techniques for Assessing Virtual Agent Personality.",
            "Design and Evaluation of a Touch-Centered Calming Interaction with a Social Robot.",
            "Genre-Adaptive Semantic Computing and Audio-Based Modelling for Music Mood Annotation.",
            "On the Influence of an Iterative Affect Annotation Approach on Inter-Observer and Self-Observer Reliability.",
            "ReBreathe: A Calibration Protocol that Improves Stress/Relax Classification by Relabeling Deep Breathing Relaxation Exercises.",
            "Recognizing Stress Using Semantics and Modulation of Speech and Gestures.",
            "Semi-Automatic Creation of Youth Slang Corpus and Its Application to Affective Computing.",
            "The Geneva Minimalistic Acoustic Parameter Set (GeMAPS) for Voice Research and Affective Computing.",
            "Best of Bodynets 2014: Editorial.",
            "Real-Time Tele-Monitoring of Patients with Chronic Heart-Failure Using a Smartphone: Lessons Learned.",
            "A Wearable Sensor System with Circadian Rhythm Stability Estimation for Prototyping Biomedical Studies.",
            "Piecewise Linear Dynamical Model for Action Clustering from Real-World Deployments of Inertial Body Sensors.",
            "PREVENTER, a Selection Mechanism for Just-in-Time Preventive Interventions.",
            "Inertial BSN-Based Characterization and Automatic UPDRS Evaluation of the Gait Task of Parkinsonians.",
            "Naturalistic Recognition of Activities and Mood Using Wearable Electronics.",
            "Automatic Methods for the Detection of Accelerative Cardiac Defense Response.",
            "A Main Directional Mean Optical Flow Feature for Spontaneous Micro-Expression Recognition.",
            "A Unified Framework for Dividing and Predicting a Large Set of Action Units.",
            "Dancing with Physio: A Mobile Game with Physiologically Aware Virtual Humans.",
            "Dynamics of Non-Verbal Vocalizations and Hormones during Father-Infant Interaction.",
            "Facial Expression Recognition in the Presence of Speech Using Blind Lexical Compensation.",
            "Identifying User-Specific Facial Affects from Spontaneous Expressions with Minimal Annotation.",
            "Increasing the Reliability of Crowdsourcing Evaluations Using Online Quality Assessment.",
            "Partial Matching of Facial Expression Sequence Using Over-Complete Transition Dictionary for Emotion Recognition.",
            "SentiWords: Deriving a High Precision and High Coverage Lexicon for Sentiment Analysis.",
            "Subject-Independent Odor Pleasantness Classification Using Brain and Peripheral Signals.",
            "The Automatic Detection of Chronic Pain-Related Expression: Requirements, Challenges and the Multimodal EmoPain Dataset."
        ]
    },
    {
        "name": "TAC",
        "year": "2015",
        "info": "Volume 6: 2015",
        "count": 35,
        "papers": [
            "Automatic Facial Expression Recognition Using Features of Salient Facial Patches.",
            "Automatic Group Happiness Intensity Analysis.",
            "Investigating the Impact of Sound Angular Position on the Listener Affective State.",
            "LIRIS-ACCEDE: A Video Database for Affective Content Analysis.",
            "Modeling the Affective Content of Music with a Gaussian Mixture Model.",
            "Speech Emotion Recognition Using Fourier Parameters.",
            "Introduction to the \"Best of ACII 2013\" Special Section.",
            "I Can Already Guess Your Answer: Predicting Respondent Reactions during Dyadic Negotiation.",
            "Correcting Time-Continuous Emotional Labels by Modeling the Reaction Lag of Evaluators.",
            "Neuroticism, Extraversion, Conscientiousness and Stress: Physiological Correlates.",
            "Subjective Perceptions in Wartime Negotiation.",
            "Humans versus Computers: Impact of Emotion Expressions on People's Decision Making.",
            "Dynamic Time Warping for Music Retrieval Using Time Series Modeling of Musical Emotions.",
            "Effects of Interactive Sonification on Emotionally Expressive Walking Styles.",
            "Perception and Automatic Recognition of Laughter from Whole-Body Motion: Continuous and Categorical Perspectives.",
            "Predicting Mood from Punctual Emotion Annotations on Videos.",
            "What Your Face Vlogs About: Expressions of Emotion and Big-Five Traits Impressions in YouTube.",
            "Guest Editorial: Challenges and Perspectives for Affective Analysis in Multimedia.",
            "DECAF: MEG-Based Multimodal Database for Decoding Affective Physiological Responses.",
            "Predicting Ad Liking and Purchase Intent: Large-Scale Analysis of Facial Responses to Ads.",
            "Automatic Music Mood Classification Based on Timbre and Modulation Features.",
            "What Strikes the Strings of Your Heart? - Feature Mining for Music Emotion Analysis.",
            "Hierarchical Dirichlet Process Mixture Model for Music Emotion Recognition.",
            "Consensus Analysis and Modeling of Visual Aesthetic Perception.",
            "Modeling Emotion Influence in Image Social Networks.",
            "Assistive Image Comment Robot - A Novel Mid-Level Concept-Based Representation.",
            "Autism Blogs: Expressed Emotion, Language Styles and Concerns in Personal and Community Settings.",
            "Analyzing Interpersonal Empathy via Collective Impressions.",
            "Arousal Recognition Using Audio-Visual Features and FMRI-Based Brain Response.",
            "HapFACS 3.0: FACS-Based Facial Expression Generator for 3D Speaking Virtual Characters.",
            "Head Movement Dynamics during Play and Perturbed Mother-Infant Interaction.",
            "Multimodal Affect Classification at Various Temporal Lengths.",
            "Recognizing Emotions Induced by Affective Sounds through Heart Rate Variability.",
            "UMEME: University of Michigan Emotional McGurk Effect Data Set.",
            "Video Affective Content Analysis: A Survey of State-of-the-Art Methods."
        ]
    },
    {
        "name": "TAC",
        "year": "2014",
        "info": "Volume 5: 2014",
        "count": 37,
        "papers": [
            "Guest Editorial: Emotion in Games.",
            "The Mind Module - Using an Affectand Personality Computational Modelas a Game-Play Element.",
            "Do Prospect-Based Emotions EnhanceBelievability of Game Characters? A CaseStudy in the Context of a Dice Game.",
            "GAMYGDALA: An Emotion Engine for Games.",
            "Affect and Engagement in Game-BasedLearning Environments.",
            "Making Tactile Textures with Predefined Affective Properties.",
            "Multi-View Facial Expression Recognition Based on Group Sparse Reduced-Rank Regression.",
            "The Faces of Engagement: Automatic Recognition of Student Engagementfrom Facial Expressions.",
            "Are They Different? Affect, Feeling, Emotion, Sentiment, and Opinion Detection in Text.",
            "Automatic Detection of Nonverbal Behavior Predicts Learning in Dyadic Interactions.",
            "Emotion Recognition Based on Multi-Variant Correlation of Physiological Signals.",
            "Fully Automated Recognition of Spontaneous Facial Expressions in Videos Using Random Forest Classifiers.",
            "Interpersonal Coordination of HeadMotion in Distressed Couples.",
            "Linking Recognition Accuracy and User Experience in an Affective Feedback Loop.",
            "Measuring Affective-Cognitive Experience and Predicting Market Success.",
            "Predicting Continuous Conflict Perceptionwith Bayesian Gaussian Processes.",
            "Robust Unsupervised Arousal Rating: A Rule-Based Framework withKnowledge-Inspired Vocal Features.",
            "Editorial: State of the Journal.",
            "Affect and Wellbeing: Introduction to Special Section.",
            "Affective and Content Analysis of Online Depression Communities.",
            "Design of a Wearable Device for Reading Positive Expressions from Facial EMG Signals.",
            "Joint Attention Simulation Using Eye-Tracking and Virtual Humans.",
            "Ambulatory Assessment of Affect: Survey of Sensor Systems for Monitoring of Autonomic Nervous Systems Activation in Emotion.",
            "A Survey of Personality Computing.",
            "Current Directions in Personality Science and the Potential for Advances through Computing.",
            "More Personality in Personality Computing.",
            "An Automatic Framework for Textured 3D Video-Based Facial Expression Recognition.",
            "Don't Classify Ratings of Affect; Rank Them!",
            "Feature Extraction and Selection for Emotion Recognition from EEG.",
            "Intra-Class Variation Reduction Using Training Expression Images for Sparse Representation Based Facial Expression Recognition.",
            "Affective Visual Perception Using Machine Pareidolia of Facial Expressions.",
            "Clustering Affective Qualities of Classical Music: Beyond the Valence-Arousal Plane.",
            "CREMA-D: Crowd-Sourced Emotional Multimodal Actors Dataset.",
            "Detection of Psychological Stress Using a Hyperspectral Imaging Technique.",
            "Distributing Recognition in Computational Paralinguistics.",
            "Vision and Attention Theory Based Sampling for Continuous Facial Emotion Recognition.",
            "Zapping Index: Using Smile to Measure Advertisement Zapping Likelihood."
        ]
    },
    {
        "name": "TAC",
        "year": "2013",
        "info": "Volume 4: 2013",
        "count": 38,
        "papers": [
            "Editorial: State of the Journal.",
            "Affective Assessment by Digital Processing of the Pupil Diameter.",
            "Affective Body Expression Perception and Recognition: A Survey.",
            "Analyses of a Multimodal Spontaneous Facial Expression Database.",
            "Classifier-Based Learning of Nonlinear Feature Manifold for Visualization of Emotional Speech Prosody.",
            "Directing Physiology and Mood through Music: Validation of an Affective Music Player.",
            "Projection into Expression Subspaces for Face Recognition from Single Sample per Person.",
            "Facial Expression Recognition in the Encrypted Domain Based on Local Fisher Discriminant Analysis.",
            "Modeling Arousal Phases in Daily Living Using Wearable Sensors.",
            "Predicting Emotional Responses to Long Informal Text.",
            "Seeing Stars of Valence and Arousal in Blog Posts.",
            "Data-Free Prior Model for Facial Action Unit Recognition.",
            "Detecting Depression Severity from Vocal Prosody.",
            "DISFA: A Spontaneous Facial Action Intensity Database.",
            "EEG-Based Classification of Music Appraisal Responses Using Time-Frequency Analysis and Familiarity Ratings.",
            "Emotional Responses to Victory and Defeat as a Function of Opponent.",
            "Exploring Cross-Modality Affective Reactions for Audiovisual Emotion Recognition.",
            "HED: A Computational Model of Affective Adaptation and Emotion Dynamics.",
            "Porting Multilingual Subjectivity Resources across Languages.",
            "Positive Affective Interactions: The Role of Repeated Exposure and Copresence.",
            "Using a Smartphone to Measure Heart Rate Changes during Relived Happiness and Anger.",
            "Challenges in Computational Modeling of Affective Processes.",
            "Computational Modeling of Emotion: Toward Improving the Inter- and Intradisciplinary Exchange.",
            "Affect and Social Processes in Online Communication-Experiments with an Affective Dialog System.",
            "Anchor Models for Emotion Recognition from Speech.",
            "Facial Expression Recognition Influenced by Human Aging.",
            "How Was Your Day? Evaluating a Conversational Companion.",
            "Synesketch: An Open Source Library for Sentence-Based Emotion Recognition.",
            "An Expressive Virtual Audiencewith Flexible Behavioral Styles.",
            "Body Movements for Affective Expression: A Survey of Automatic Recognition and Generation.",
            "Component-Based Recognition of Facesand Facial Expressions.",
            "Introducing Emotions to the Modelingof Intra- and Inter-Personal Influencesin Parent-Adolescent Conversations.",
            "Iterative Feature Normalization Scheme for Automatic Emotion Detection from Speech.",
            "Nonlinear Appraisal Modeling: An Application of Machine Learning to the Study of Emotion Production.",
            "Predicting User-Topic Opinions in Twitter with Social and Topical Context.",
            "Sentiment Word Relations with Affect, Judgment, and Appreciation.",
            "The Role of Affect Analysis in Dialogue Act Identification.",
            "Unimodal and Multimodal Human Perceptionof Naturalistic Non-Basic Affective Statesduring Human-Computer Interactions."
        ]
    },
    {
        "name": "TAC",
        "year": "2012",
        "info": "Volume 3: 2012",
        "count": 44,
        "papers": [
            "Editorial: State of the Journal.",
            "Guest Editorial: Special Section on Naturalistic Affect Resources for System Building and Evaluation.",
            "The SEMAINE Database: Annotated Multimodal Records of Emotionally Colored Conversations between a Person and a Limited Agent.",
            "DEAP: A Database for Emotion Analysis ;Using Physiological Signals.",
            "The Belfast Induced Natural Emotion Database.",
            "A Multimodal Database for Affect Recognition and Implicit Tagging.",
            "A New Approach to Modeling Emotions and Their Use on a Decision-Making System for Artificial Agents.",
            "Bridging the Gap between Social Animal and Unsocial Machine: A Survey of Social Signal Processing.",
            "Building and Exploiting EmotiNet, a Knowledge Base for Emotion Detection Based on the Appraisal Theory Model.",
            "ECG Pattern Analysis for Emotion Detection.",
            "Modeling the Temporal Evolution of Acoustic Parameters for Speech Emotion Recognition.",
            "Affective Computing in Consumer Electronics.",
            "Quantitative Study of Individual Emotional States in Social Networks.",
            "Galvanic Intrabody Communication for Affective Acquiring and Computing.",
            "Generation of Personalized Ontology Based on Consumer Emotion and Behavior Analysis.",
            "Building Autonomous Sensitive Artificial Listeners.",
            "Context-Sensitive Learning for Enhanced Audiovisual Emotion Classification.",
            "Identifying Emotion through Implicit and Explicit Measures: Cultural Differences, Cognitive Load, and Immersion.",
            "Multimodal Emotion Recognition in Response to Videos.",
            "The Effects of an Interactive Software Agent on Student Affective Dynamics while Using ;an Intelligent Tutoring System.",
            "The Role of Nonlinear Dynamics in Affective Valence and Arousal Recognition.",
            "Toward E-Motion-Based Music Retrieval a Study of Affective Gesture Recognition.",
            "Affective Learning: Empathetic Agents with Emotional Facial and Tone of Voice Expressions.",
            "Automatic Personality Perception: Prediction of Trait Attribution Based on Prosodic Features.",
            "Co-Adaptive and Affective Human-Machine Interface for Improving Training Performances of Virtual Myoelectric Forearm Prosthesis.",
            "Detecting Naturalistic Expressions of Nonbasic Affect Using Physiological Signals.",
            "Evaluation of Four Designed Virtual Agent Personalities.",
            "Exploring Temporal Patterns in Classifying Frustrated and Delighted Smiles.",
            "Feelings Elicited by Auditory Feedback from a Computationally Augmented Artifact: The Flops.",
            "Interpersonal Synchrony: A Survey of Evaluation Methods across Disciplines.",
            "Perinasal Imaging of Physiological Stress and Its Affective Potential.",
            "Physiological-Based Affect Event Detector for Entertainment Video Applications.",
            "Editorial for the Special Section on Ethics and Affective Computing.",
            "Are Emotional Robots Deceptive?",
            "Red-Pill Robots Only, Please.",
            "Robots, Love, and Sex: The Ethics of Building a Love Machine.",
            "The Good Our Field Can Hope to Do, the Harm It Should Avoid.",
            "The Affect Dilemma for Artificial Agents: Should We Develop Affective Artificial Agents?",
            "Conative Dimensions of Machine Ethics: A Defense of Duty.",
            "Connecting Meeting Behavior with Extraversion - A Systematic Study.",
            "Crowdsourcing Facial Responses to Online Videos.",
            "Multi-Aspect Rating Inference with Aspect-Based Segmentation.",
            "Representative Segment-Based Emotion Analysis and Classification with Automatic Respiration Signal Segmentation.",
            "The Voice of Leadership: Models and Performances of Automatic Analysis in Online Speeches."
        ]
    },
    {
        "name": "TAC",
        "year": "2011",
        "info": "Volume 2: 2011",
        "count": 18,
        "papers": [
            "Thermal Analysis of Facial Muscles Contractions.",
            "Emotion Recognition of Affective Speech Based on Multiple Classifiers Using Acoustic-Prosodic Information and Semantic Labels.",
            "SentiFul: A Lexicon for Sentiment Analysis.",
            "Aspect-Based Opinion Polling from Customer Reviews.",
            "An Ensemble Method for Classifying Startle Eyeblink Modulation from High-Speed Video Records.",
            "Real-Time Recognition of Affective States from Nonverbal Features of Speech and Its Application for Public Speaking Skill Analysis.",
            "Dynamic Cascades with Bidirectional Bootstrapping for Action Unit Detection in Spontaneous Facial Behavior.",
            "Continuous Prediction of Spontaneous Affect from Multiple Cues and Modalities in Valence-Arousal Space.",
            "Toward a Minimal Representation of Affective Gestures.",
            "Automatic Recognition of Boredom in Video Games Using Novel Biosignal Moment-Based Features.",
            "Constraint-Based Model for Synthesis of Multimodal Sequential Expressions of Emotions.",
            "Experience-Driven Procedural Content Generation.",
            "Interdependencies among Voice Source Parameters in Emotional Speech.",
            "Finding Mutual Benefit between Subjectivity Analysis and Information Extraction.",
            "Recognizing Affect from Linguistic Information in 3D Continuous Space.",
            "Exploring Fusion Methods for Multimodal Emotion Recognition with Missing Data.",
            "Facial Expression Recognition Using Facial Movement Features.",
            "The Role of Visual Complexity in Affective Reactions to Webpages: Subjective, Eye Movement, and Cardiovascular Responses."
        ]
    },
    {
        "name": "TAC",
        "year": "2010",
        "info": "Volume 1: 2010",
        "count": 11,
        "papers": [
            "Affect Detection: An Interdisciplinary Review of Models, Methods, and Their Applications.",
            "Smile When You Read This, Whether You Like It or Not: Conceptual Challenges to Affect Detection.",
            "Broadening the Scope of Affect Detection Research.",
            "CAO: A Fully Automatic Emoticon Analysis System Based on Theory of Kinesics.",
            "Empathic Touch by Relational Agents.",
            "Intimate Heartbeats: Opportunities for Affective Communication Technology.",
            "Emotion Recognition from Brain Signals Using Hybrid Adaptive Filtering and Higher Order Crossings Analysis.",
            "Support Vector Machines to Define and Detect Agitation Transition.",
            "Optimal Arousal Identification and Classification for Affective Computing Using Physiological Signals: Virtual Reality Stroop Task.",
            "Cross-Corpus Acoustic Emotion Recognition: Variances and Strategies.",
            "Inducing Genuine Emotions in Simulated Speech-Based Human-Machine Interaction: The NIMITEK Corpus."
        ]
    }
]