[
    {
        "name": "TALLIP",
        "year": "2022",
        "info": "Volume 21: 2022",
        "count": 22,
        "papers": [
            "Introduction to Special Issue on Misinformation, Fake News and Rumor Detection in Low-Resource Languages.",
            "Denigrate Comment Detection in Low-Resource Hindi Language Using Attention-Based Residual Networks.",
            "A Multimodal Deep Framework for Derogatory Social Media Post Identification of a Recognized Person.",
            "Fake News Classification: A Quantitative Research Description.",
            "Multilingual Offensive Language Identification for Low-resource Languages.",
            "Deep Level Analysis of Legitimacy in Bengali News Sentences.",
            "Enriching Conventional Ensemble Learner with Deep Contextual Semantics to Detect Fake News in Urdu.",
            "An Effective Approach for Rumor Detection of Arabic Tweets Using eXtreme Gradient Boosting Method.",
            "Blockchain-based Framework for Reducing Fake or Vicious News Spread on Social Media/Messaging Platforms.",
            "A Transformer-Based Approach to Multilingual Fake News Detection in Low-Resource Languages.",
            "Persian Fake News Detection: Neural Representation and Classification at Word and Text Levels.",
            "Detecting Arabic Spam Reviews in Social Networks Based on Classification Algorithms.",
            "A Deep Content-Based Model for Persian Rumor Verification.",
            "Roman-Urdu-Parl: Roman-Urdu and Urdu Parallel Corpus for Urdu Language Understanding.",
            "Empirical Evaluation of Shallow and Deep Learning Classifiers for Arabic Sentiment Analysis.",
            "Synonymy Expansion Using Link Prediction Methods: A Case Study of Assamese WordNet.",
            "A New Concept of Electronic Text Based on Semantic Coding System for Machine Translation.",
            "Event Graph Neural Network for Opinion Target Classification of Microblog Comments.",
            "Confidence Indexing of Automated Detected Synsets: A Case Study on Contemporary Turkish Dictionary.",
            "Low Resource Neural Machine Translation: Assamese to/from Other Indo-Aryan (Indic) Languages.",
            "Neural Arabic Text Diacritization: State-of-the-Art Results and a Novel Approach for Arabic NLP Downstream Tasks.",
            "Sentiment Analysis in Hindi - A Survey on the State-of-the-art Techniques."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2021",
        "info": "Volume 20: 2021",
        "count": 110,
        "papers": [
            "Special Issue on Deep Structured Learning for Natural Language Processing.",
            "Cyberbullying Detection, Based on the FastText and Word Similarity Schemes.",
            "Deep Interactive Memory Network for Aspect-Level Sentiment Analysis.",
            "Venue Topic Model-enhanced Joint Graph Modelling for Citation Recommendation in Scholarly Big Data.",
            "The Transnational Happiness Study with Big Data Technology.",
            "Knowledge Discovery of News Text Based on Artificial Intelligence.",
            "Optimisation of the Largest Annotated Tibetan Corpus Combining Rule-based, Memory-based, and Deep-learning Methods.",
            "Multimodal News Feed Evaluation System with Deep Reinforcement Learning Approaches.",
            "Hate Speech Detection in Roman Urdu.",
            "Unsupervised Neural Machine Translation for Similar and Distant Language Pairs: An Empirical Study.",
            "Hybridization between Neural Computing and Nature-Inspired Algorithms for a Sentence Similarity Model Based on the Attention Mechanism.",
            "A Survey of Offensive Language Detection for the Arabic Language.",
            "Real-time Assistive Reader Pen for Arabic Language.",
            "KArSL: Arabic Sign Language Database.",
            "Automatic Indonesian Sentiment Lexicon Curation with Sentiment Valence Tuning for Social Media Sentiment Analysis.",
            "TransBERT: A Three-Stage Pre-training Technology for Story-Ending Prediction.",
            "A Cascaded Unsupervised Model for PoS Tagging.",
            "Improving Semantic Coherence of Gujarati Text Topic Model Using Inflectional Forms Reduction and Single-letter Words Removal.",
            "Recent Developments in Tibetan NLP.",
            "Toward a Sustainable Handling of Interlinear-Glossed Text in Language Documentation.",
            "Applying Text Analytics to the Mind-section Literature of the Tibetan Tradition of the Great Perfection.",
            "Taming the Wild Etext: Managing, Annotating, and Sharing Tibetan Corpora in Open Spaces.",
            "Sanskrit Parsing Following Indian Theories of Verbal Cognition.",
            "Finding Better Subwords for Tibetan Neural Machine Translation.",
            "Recognition of Tibetan Maximal-length Noun Phrases Based on Syntax Tree.",
            "Multi-level Chunk-based Constituent-to-Dependency Treebank Transformation for Tibetan Dependency Parsing.",
            "A Joint Model for Representation Learning of Tibetan Knowledge Graph Based on Encyclopedia.",
            "Chinese Spelling Error Detection Using a Fusion Lattice LSTM.",
            "Plan Optimization to Bilingual Dictionary Induction for Low-resource Language Families.",
            "Neural Dependency Parser for Tibetan Sentences.",
            "Using Sub-character Level Information for Neural Machine Translation of Logographic Languages.",
            "A Hindi Image Caption Generation Framework Using Deep Learning.",
            "Arabic Diacritic Recovery Using a Feature-rich biLSTM Model.",
            "A Systematic Review on Hadith Authentication and Classification Methods.",
            "A Hybrid Model for Named Entity Recognition on Chinese Electronic Medical Records.",
            "A Hierarchical Sequence-to-Sequence Model for Korean POS Tagging.",
            "Introduction to the Special Issue on Deep Structured Learning for Natural Language Processing.",
            "Study on Automated Approach to Recognize Characters for Handwritten and Historical Document.",
            "Design and Development of Heuristic Utility Management Algorithm for Chinese Library Management System.",
            "TAMIZHİ: Historical Tamil-Brahmi Script Recognition Using CNN and MobileNet.",
            "Transfer Learning Based Recurrent Neural Network Algorithm for Linguistic Analysis.",
            "Heuristic Bilingual Graph Corpus Network to Improve English Instruction Methodology Based on Statistical Translation Approach.",
            "A Deep Learning-based Approach for Emotions Classification in Big Corpus of Imbalanced Tweets.",
            "A Framework for Extractive Text Summarization Based on Deep Learning Modified Neural Network Classifier.",
            "An Analysis for Elements of Affecting the Establishment and Promotion of Micro-business Trust in C2C Model under WeChat Circumstance.",
            "Semantic Graphical Dependence Parsing Model in Improving English Teaching Abilities.",
            "A Two-stage Text Feature Selection Algorithm for Improving Text Classification.",
            "SACNN: Self-attentive Convolutional Neural Network Model for Natural Language Inference.",
            "The Effects of Negative Online Reviews on Consumer Perception, Attitude and Purchase Intention: Experimental Investigation of the Amount, Quality, and Presentation Order of eWOM.",
            "An Embedding-Based Topic Model for Document Classification.",
            "Deep Structured Learning for Natural Language Processing.",
            "A Neural Joint Model with BERT for Burmese Syllable Segmentation, Word Segmentation, and POS Tagging.",
            "Approaches for Multilingual Phone Recognition in Code-switched and Non-code-switched Scenarios Using Indian Languages.",
            "A Novel Attack on Monochrome and Greyscale Devanagari CAPTCHAs.",
            "A Framework for Indonesian Grammar Error Correction.",
            "Learning Syllables Using Conv-LSTM Model for Swahili Word Representation and Part-of-speech Tagging.",
            "Sentiment Analysis of Sinhala News Comments.",
            "Graph-based Multimodal Ranking Models for Multimodal Summarization.",
            "An Improved English-to-Mizo Neural Machine Translation.",
            "Two New Large Corpora for Vietnamese Aspect-based Sentiment Analysis at Sentence Level.",
            "Building Arabic Paraphrasing Benchmark based on Transformation Rules.",
            "Query Expansion for Transliterated Text Retrieval.",
            "Cross-lingual Adaptation Using Universal Dependencies.",
            "Facebook Tells Me Your Gender: An Exploratory Study of Gender Prediction for Turkish Facebook Users.",
            "Dependency Parsing-based Entity Relation Extraction over Chinese Complex Text.",
            "Developing the Persian Wordnet of Verbs Using Supervised Learning.",
            "Source-side Reordering to Improve Machine Translation between Languages with Distinct Word Orders.",
            "Reinforced NMT for Sentiment and Content Preservation in Low-resource Scenario.",
            "Intermodal Sentiment Analysis for Images with Text Captions Using the VGGNET Technique.",
            "Introduction to the Special Issue on Deep Structured Learning for Natural Language Processing, Part 3.",
            "Research On Pre-Training Method and Generalization Ability of Big Data Recognition Model of the Internet of Things.",
            "Sequence Alignment with Q-Learning Based on the Actor-Critic Model.",
            "A Comprehensive Survey on Word Representation Models: From Classical to State-of-the-Art Word Representation Language Models.",
            "An OT-ET Analysis of Polish Singular-Plural Pairs.",
            "geoGAT: Graph Model Based on Attention Mechanism for Geographic Text Classification.",
            "Bi-directional Long Short-Term Memory Model with Semantic Positional Attention for the Question Answering System.",
            "Deep Neural Network Based Noised Asian Speech Enhancement and Its Implementation on a Hearing Aid App.",
            "Multi-Objective Heuristic Decision Making and Benchmarking for Mobile Applications in English Language Learning.",
            "Toward Integrated CNN-based Sentiment Analysis of Tweets for Scarce-resource Language - Hindi.",
            "Developing a Vietnamese Tourism Question Answering System Using Knowledge Graph and Deep Learning.",
            "Research on Extraction of Useful Tourism Online Reviews Based on Multimodal Feature Fusion.",
            "Two-channel Attention Mechanism Fusion Model of Stock Price Prediction Based on CNN-LSTM.",
            "A Hybrid CNN-LSTM: A Deep Learning Approach for Consumer Sentiment Analysis Using Qualitative User-Generated Contents.",
            "A Computer Corpus-Based Study of Chinese EFL Learners' Use of Adverbial Connectors and Its Implications for Building a Language-Based Learning Environment.",
            "Configurational Path to Chinese Reading Stickiness of Digital Library.",
            "Betalogger: Smartphone Sensor-based Side-channel Attack Detection and Text Inference Using Language Modeling and Dense MultiLayer Neural Network.",
            "Movie Recommendation System to Solve Data Sparsity Using Collaborative Filtering Approach.",
            "An Investigational Approach for Vowels of the Salar Language Based on a Database of Speech Acoustic Parameters.",
            "Sentiment Analysis Using XLM-R Transformer and Zero-shot Transfer Learning on Resource-poor Indian Language.",
            "A Novel Resource Optimization Algorithm Based on Clustering and Improved Differential Evolution Strategy Under a Cloud Environment.",
            "A BERT-Based Two-Stage Model for Chinese Chengyu Recommendation.",
            "Robust Cross-lingual Task-oriented Dialogue.",
            "Deep Learning Approach for the Morphological Synthesis in Malayalam and Tamil at the Character Level.",
            "Linguistic Resources for Bhojpuri, Magahi, and Maithili: Statistics about Them, Their Similarity Estimates, and Baselines for Three Applications.",
            "Exploring Topic-language Preferences in Multilingual Swahili Information Retrieval in Tanzania.",
            "The Research on Rejoining of the Oracle Bone Rubbings Based on Curve Matching.",
            "Neural Unsupervised Semantic Role Labeling.",
            "A Unified Dialogue Management Strategy for Multi-intent Dialogue Conversations in Multiple Languages.",
            "Mining Domain Terminologies Using Search Engine's Query Log.",
            "Coherent Dialog Generation with Query Graph.",
            "SGATS: Semantic Graph-based Automatic Text Summarization from Hindi Text Documents.",
            "Normalization of Transliterated Mongolian Words Using Seq2Seq Model with Limited Data.",
            "Towards Tokenization and Part-of-Speech Tagging for Khmer: Data and Discussion.",
            "A Novel Classification Model SA-MPCNN for Power Equipment Defect Text.",
            "BYANJON: A Ground Truth Preparation System for Online Handwritten Bangla Documents.",
            "Improving Data Augmentation for Low-Resource NMT Guided by POS-Tagging and Paraphrase Embedding.",
            "SE4ExSum: An Integrated Semantic-aware Neural Approach with Graph Convolutional Network for Extractive Text Summarization.",
            "A Multi-Classification Sentiment Analysis Model of Chinese Short Text Based on Gated Linear Units and Attention Mechanism.",
            "Construction of a Corpus of Rhetorical Devices in Slogans and Structural Analysis of Antitheses.",
            "Exploration of Effective Attention Strategies for Neural Automatic Post-editing with Transformer."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2020",
        "info": "Volume 19: 2020",
        "count": 89,
        "papers": [
            "From Genesis to Creole Language: Transfer Learning for Singlish Universal Dependencies Parsing and POS Tagging.",
            "Chinese Zero Pronoun Resolution: A Chain-to-chain Approach.",
            "Chinese Zero Pronoun Resolution: A Collaborative Filtering-based Approach.",
            "Transform, Combine, and Transfer: Delexicalized Transfer Parser for Low-resource Languages.",
            "Towards Burmese (Myanmar) Morphological Analysis: Syllable-based Tokenization and Part-of-speech Tagging.",
            "Ancient-Modern Chinese Translation with a New Large Training Dataset.",
            "Chinese Syntax Parsing Based on Sliding Match of Semantic String.",
            "Urdu Named Entity Recognition: Corpus Generation and Deep Learning Applications.",
            "Deep Contextualized Word Embeddings for Universal Dependency Parsing.",
            "Sentiment Analysis for a Resource Poor Language - Roman Urdu.",
            "Matching Graph, a Method for Extracting Parallel Information from Comparable Corpora.",
            "μ-Forcing: Training Variational Recurrent Autoencoders for Text Generation.",
            "An Automatic and a Machine-assisted Method to Clean Bilingual Corpus.",
            "Importance of Signal Processing Cues in Transcription Correction for Low-Resource Indian Languages.",
            "Explicitly Modeling Word Translations in Neural Machine Translation.",
            "NeuMorph: Neural Morphological Tagging for Low-Resource Languages - An Experimental Study for Indic Languages.",
            "Adversarial Training for Unknown Word Problems in Neural Machine Translation.",
            "Order-Sensitive Keywords Based Response Generation in Open-Domain Conversational Systems.",
            "Neural Conversation Generation with Auxiliary Emotional Supervised Models.",
            "Enhanced Double-Carrier Word Embedding via Phonetics and Writing.",
            "SentiFars: A Persian Polarity Lexicon for Sentiment Analysis.",
            "Wasf-Vec: Topology-based Word Embedding for Modern Standard Arabic and Iraqi Dialect Ontology.",
            "Extracting Polarity Shifting Patterns from Any Corpus Based on Natural Annotation.",
            "Filtered Pseudo-parallel Corpus Improves Low-resource Neural Machine Translation.",
            "A Deep Neural Network Framework for English Hindi Question Answering.",
            "Layer-Wise De-Training and Re-Training for ConvS2S Machine Translation.",
            "Isarn Dharma Word Segmentation Using a Statistical Approach with Named Entity Recognition.",
            "Punjabi to ISO 15919 and Roman Transliteration with Phonetic Rectification.",
            "Subword Attentive Model for Arabic Sentiment Analysis: A Deep Learning Approach.",
            "Children's Story Classification in Indian Languages Using Linguistic and Keyword-based Features.",
            "Word Reordering for Translation into Korean Sign Language Using Syntactically-guided Classification.",
            "Transliteration of Arabizi into Arabic Script for Tunisian Dialect.",
            "Fusion of Spatio-temporal Information for Indic Word Recognition Combining Online and Offline Text Data.",
            "Efficient Low-Resource Neural Machine Translation with Reread and Feedback Mechanism.",
            "S3-NET: SRU-Based Sentence and Self-Matching Networks for Machine Reading Comprehension.",
            "StyloThai: : A Scalable Framework for Stylometric Authorship Identification of Thai Documents.",
            "Uniformly Interpolated Balancing for Robust Prediction in Translation Quality Estimation: A Case Study of English-Korean Translation.",
            "Learning and Modeling Unit Embeddings Using Deep Neural Networks for Unit-Selection-Based Mandarin Speech Synthesis.",
            "Semantic Role Labeling System for Persian Language.",
            "A Burmese (Myanmar) Treebank: Guideline and Analysis.",
            "Korean Part-of-speech Tagging Based on Morpheme Generation.",
            "Towards Integrated Classification Lexicon for Handling Unknown Words in Chinese-Vietnamese Neural Machine Translation.",
            "Loanword Identification in Low-Resource Languages with Minimal Supervision.",
            "Improving Neural Machine Translation with Linear Interpolation of a Short-Path Unit.",
            "Dynamic Updating of the Knowledge Base for a Large-Scale Question Answering System.",
            "Enhanced Language Modeling with Proximity and Sentence Relatedness Information for Extractive Broadcast News Summarization.",
            "Conducting Natural Language Inference with Word-Pair-Dependency and Local Context.",
            "Editorial from the New Editor-in-Chief: the Era of Natural Language Processing Innovations on Asian and Low-Resource Languages.",
            "Outline Extraction with Question-Specific Memory Cells.",
            "Machine Normalization: Bringing Social Media Text from Non-Standard to Standard Form.",
            "Improving Code-mixed POS Tagging Using Code-mixed Embeddings.",
            "Named Entity Recognition and Classification for Punjabi Shahmukhi.",
            "Hindi EmotionNet: A Scalable Emotion Lexicon for Sentiment Classification of Hindi Text.",
            "Adversarial Evaluation of Robust Neural Sequential Tagging Methods for Thai Language.",
            "Sign Language Generation System Based on Indian Sign Language Grammar.",
            "Native Language Identification of Fluent and Advanced Non-Native Writers.",
            "Context-Dependent Sequence-to-Sequence Turkish Spelling Correction.",
            "Extracting Arabic Composite Names Using Genitive Principles of Arabic Grammar.",
            "Structurally Comparative Hinge Loss for Dependency-Based Neural Text Representation.",
            "Joint Model of Entity Recognition and Relation Extraction with Self-attention Mechanism.",
            "Lipi Gnani: A Versatile OCR for Documents in any Language Printed in Kannada Script.",
            "Chinese Short Text Classification with Mutual-Attention Convolutional Neural Networks.",
            "Speech-Driven End-to-End Language Discrimination toward Chinese Dialects.",
            "Inside Importance Factors of Graph-Based Keyword Extraction on Chinese Short Text.",
            "Emoji-Based Sentiment Analysis Using Attention Networks.",
            "Deep Neural Network-based Machine Translation System Combination.",
            "Robust Arabic Text Categorization by Combining Convolutional and Recurrent Neural Networks.",
            "A Survey of the Model Transfer Approaches to Cross-Lingual Dependency Parsing.",
            "Iterative Training of Unsupervised Neural and Statistical Machine Translation Systems.",
            "Morphological Segmentation to Improve Crosslingual Word Embeddings for Low Resource Languages.",
            "Personalized Query Auto-Completion for Large-Scale POI Search at Baidu Maps.",
            "Deep Learning for Arabic Error Detection and Correction.",
            "Learning Word-vector Quantization: A Case Study in Morphological Disambiguation.",
            "CESS-A System to Categorize Bangla Web Text Documents.",
            "Neural Co-training for Sentiment Classification with Product Attributes.",
            "Grading Tibetan Children's Literature: A Test Case Using the NLP Readability Tool \"Dakje\".",
            "A Technique to Calculate National Happiness Index by Analyzing Roman Urdu Messages Posted on Social Media.",
            "An Extensible Framework of Leveraging Syntactic Skeleton for Semantic Relation Classification.",
            "AyaTEC: Building a Reusable Verse-Based Test Collection for Arabic Question Answering on the Holy Qur'an.",
            "Condition-Transforming Variational Autoencoder for Generating Diverse Short Text Conversations.",
            "A Link Prediction Approach for Accurately Mapping a Large-scale Arabic Lexical Resource to English WordNet.",
            "The Impact of Weighting Schemes and Stemming Process on Topic Modeling of Arabic Long and Short Texts.",
            "Classification of Ancient Handwritten Tamil Characters on Palm Leaf Inscription Using Modified Adaptive Backpropagation Neural Network with GLCM Features.",
            "Attention Mechanism for Uyghur Personal Pronouns Resolution.",
            "Global Encoding for Long Chinese Text Summarization.",
            "Translating Morphologically Rich Indian Languages under Zero-Resource Conditions.",
            "Disambiguating Arabic Words According to Their Historical Appearance in the Document Based on Recurrent Neural Networks.",
            "On the Construction of Web NER Model Training Tool based on Distant Supervision.",
            "Detecting Entities of Works for Chinese Chatbot."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2019",
        "info": "Volume 18: 2019",
        "count": 48,
        "papers": [
            "Using Communities of Words Derived from Multilingual Word Vectors for Cross-Language Information Retrieval in Indian Languages.",
            "Optimizing Automatic Evaluation of Machine Translation with the ListMLE Approach.",
            "Response Selection and Automatic Message-Response Expansion in Retrieval-Based QA Systems using Semantic Dependency Pair Model.",
            "Input Method for Human Translators: A Novel Approach to Integrate Machine Translation Effectively and Imperceptibly.",
            "Arabic Authorship Attribution: An Extensive Study on Twitter Posts.",
            "Word Segmentation for Burmese Based on Dual-Layer CRFs.",
            "Incorporating Multi-Level User Preference into Document-Level Sentiment Classification.",
            "\"UTTAM\": An Efficient Spelling Correction System for Hindi Language Based on Supervised Learning.",
            "Improving NER Tagging Performance in Low-Resource Languages via Multilingual Learning.",
            "Diacritic-Based Matching of Arabic Words.",
            "Sub-Stroke-Wise Relative Feature for Online Indic Handwriting Recognition.",
            "Pause-Based Phrase Extraction and Effective OOV Handling for Low-Resource Machine Translation Systems.",
            "Low-Resource Machine Transliteration Using Recurrent Neural Networks.",
            "Transition-Based Korean Dependency Parsing Using Hybrid Word Representations of Syllables and Morphemes with LSTMs.",
            "Improving Word Embedding Coverage in Less-Resourced Languages Through Multi-Linguality and Cross-Linguality: A Case Study with Aspect-Based Sentiment Analysis.",
            "Wikipedia-Based Relatedness Measurements for Multilingual Short Text Clustering.",
            "NOVA: A Feasible and Flexible Annotation System for Joint Tokenization and Part-of-Speech Tagging.",
            "A Rule-Based Kurdish Text Transliteration System.",
            "Tempo-HindiWordNet: A Lexical Knowledge-base for Temporal Information Processing.",
            "Sentiment Analysis of Iraqi Arabic Dialect on Facebook Based on Distributed Representations of Documents.",
            "Online Handwritten Gurmukhi Words Recognition: An Inclusive Study.",
            "Co-occurrence Weight Selection in Generation of Word Embeddings for Low Resource Languages.",
            "On the Usage of a Classical Arabic Corpus as a Language Resource: Related Research and Key Challenges.",
            "Multitask Pointer Network for Korean Dependency Parsing.",
            "Unsupervised Joint PoS Tagging and Stemming for Agglutinative Languages.",
            "A Survey of Discourse Representations for Chinese Discourse Annotation.",
            "A Survey of Opinion Mining in Arabic: A Comprehensive System Perspective Covering Challenges and Advances in Tools, Resources, Models, Applications, and Visualizations.",
            "Automatic Diacritics Restoration for Tunisian Dialect.",
            "Identifying and Analyzing Different Aspects of English-Hindi Code-Switching in Twitter.",
            "A Comparative Analysis on Hindi and English Extractive Text Summarization.",
            "Regularizing Output Distribution of Abstractive Chinese Social Media Text Summarization for Improved Semantic Consistency.",
            "Leveraging Additional Resources for Improving Statistical Machine Translation on Asian Low-Resource Languages.",
            "Converting Dependency Structure Into Persian Phrase Structure.",
            "Role of Discourse Information in Urdu Sentiment Classification: A Rule-based Method and Machine-learning Technique.",
            "Handwritten Manipuri Meetei-Mayek Classification Using Convolutional Neural Network.",
            "Syntax-Based Chinese-Vietnamese Tree-to-Tree Statistical Machine Translation with Bilingual Features.",
            "A Neural Semantic Parser for Math Problems Incorporating Multi-Sentence Information.",
            "Multi-Round Transfer Learning for Low-Resource NMT Using Multiple High-Resource Languages.",
            "A Supplementary Feature Set for Sentiment Analysis in Japanese Dialogues.",
            "A Sense Annotated Corpus for All-Words Urdu Word Sense Disambiguation.",
            "Multi-Channel Embedding Convolutional Neural Network Model for Arabic Sentiment Classification.",
            "Toward an Effective Igbo Part-of-Speech Tagger.",
            "Chinese-Catalan: A Neural Machine Translation Approach Based on Pivoting and Attention Mechanisms.",
            "Machine Translation Evaluation Metric Based on Dependency Parsing Model.",
            "Experience-based Causality Learning for Intelligent Agents.",
            "POS Tag-enhanced Coarse-to-fine Attention for Neural Machine Translation.",
            "Multi-Entity Aspect-Based Sentiment Analysis with Context, Entity, Aspect Memory and Dependency Information.",
            "Multi-task Stack Propagation for Neural Quality Estimation."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2019",
        "info": "Volume 18: 2019",
        "count": 48,
        "papers": [
            "Using Communities of Words Derived from Multilingual Word Vectors for Cross-Language Information Retrieval in Indian Languages.",
            "Optimizing Automatic Evaluation of Machine Translation with the ListMLE Approach.",
            "Response Selection and Automatic Message-Response Expansion in Retrieval-Based QA Systems using Semantic Dependency Pair Model.",
            "Input Method for Human Translators: A Novel Approach to Integrate Machine Translation Effectively and Imperceptibly.",
            "Arabic Authorship Attribution: An Extensive Study on Twitter Posts.",
            "Word Segmentation for Burmese Based on Dual-Layer CRFs.",
            "Incorporating Multi-Level User Preference into Document-Level Sentiment Classification.",
            "\"UTTAM\": An Efficient Spelling Correction System for Hindi Language Based on Supervised Learning.",
            "Improving NER Tagging Performance in Low-Resource Languages via Multilingual Learning.",
            "Diacritic-Based Matching of Arabic Words.",
            "Sub-Stroke-Wise Relative Feature for Online Indic Handwriting Recognition.",
            "Pause-Based Phrase Extraction and Effective OOV Handling for Low-Resource Machine Translation Systems.",
            "Low-Resource Machine Transliteration Using Recurrent Neural Networks.",
            "Transition-Based Korean Dependency Parsing Using Hybrid Word Representations of Syllables and Morphemes with LSTMs.",
            "Improving Word Embedding Coverage in Less-Resourced Languages Through Multi-Linguality and Cross-Linguality: A Case Study with Aspect-Based Sentiment Analysis.",
            "Wikipedia-Based Relatedness Measurements for Multilingual Short Text Clustering.",
            "NOVA: A Feasible and Flexible Annotation System for Joint Tokenization and Part-of-Speech Tagging.",
            "A Rule-Based Kurdish Text Transliteration System.",
            "Tempo-HindiWordNet: A Lexical Knowledge-base for Temporal Information Processing.",
            "Sentiment Analysis of Iraqi Arabic Dialect on Facebook Based on Distributed Representations of Documents.",
            "Online Handwritten Gurmukhi Words Recognition: An Inclusive Study.",
            "Co-occurrence Weight Selection in Generation of Word Embeddings for Low Resource Languages.",
            "On the Usage of a Classical Arabic Corpus as a Language Resource: Related Research and Key Challenges.",
            "Multitask Pointer Network for Korean Dependency Parsing.",
            "Unsupervised Joint PoS Tagging and Stemming for Agglutinative Languages.",
            "A Survey of Discourse Representations for Chinese Discourse Annotation.",
            "A Survey of Opinion Mining in Arabic: A Comprehensive System Perspective Covering Challenges and Advances in Tools, Resources, Models, Applications, and Visualizations.",
            "Automatic Diacritics Restoration for Tunisian Dialect.",
            "Identifying and Analyzing Different Aspects of English-Hindi Code-Switching in Twitter.",
            "A Comparative Analysis on Hindi and English Extractive Text Summarization.",
            "Regularizing Output Distribution of Abstractive Chinese Social Media Text Summarization for Improved Semantic Consistency.",
            "Leveraging Additional Resources for Improving Statistical Machine Translation on Asian Low-Resource Languages.",
            "Converting Dependency Structure Into Persian Phrase Structure.",
            "Role of Discourse Information in Urdu Sentiment Classification: A Rule-based Method and Machine-learning Technique.",
            "Handwritten Manipuri Meetei-Mayek Classification Using Convolutional Neural Network.",
            "Syntax-Based Chinese-Vietnamese Tree-to-Tree Statistical Machine Translation with Bilingual Features.",
            "A Neural Semantic Parser for Math Problems Incorporating Multi-Sentence Information.",
            "Multi-Round Transfer Learning for Low-Resource NMT Using Multiple High-Resource Languages.",
            "A Supplementary Feature Set for Sentiment Analysis in Japanese Dialogues.",
            "A Sense Annotated Corpus for All-Words Urdu Word Sense Disambiguation.",
            "Multi-Channel Embedding Convolutional Neural Network Model for Arabic Sentiment Classification.",
            "Toward an Effective Igbo Part-of-Speech Tagger.",
            "Chinese-Catalan: A Neural Machine Translation Approach Based on Pivoting and Attention Mechanisms.",
            "Machine Translation Evaluation Metric Based on Dependency Parsing Model.",
            "Experience-based Causality Learning for Intelligent Agents.",
            "POS Tag-enhanced Coarse-to-fine Attention for Neural Machine Translation.",
            "Multi-Entity Aspect-Based Sentiment Analysis with Context, Entity, Aspect Memory and Dependency Information.",
            "Multi-task Stack Propagation for Neural Quality Estimation."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2017",
        "info": "Volume 17: 2017/2018",
        "count": 35,
        "papers": [
            "Role of Morphology Injection in SMT: A Case Study from Indian Language Perspective.",
            "Urdu Named Entity Recognition and Classification System Using Artificial Neural Network.",
            "Predictor-Estimator: Neural Quality Estimation Based on Target Word Prediction for Machine Translation.",
            "Automatically Building VoIP Speech Parallel Corpora for Arabic Dialects.",
            "Linguistic-Relationships-Based Approach for Improving Word Alignment.",
            "An Emotion Cause Corpus for Chinese Microblogs with Multiple-User Structures.",
            "Development and Analysis of Speech Recognition Systems for Assamese Language Using HTK.",
            "Cleaning of Online Bangla Free-form Handwritten Text.",
            "A Generalized Constraint Approach to Bilingual Dictionary Induction for Low-Resource Language Families.",
            "A Basic Language Resource Kit Implementation for the IgboNLP Project.",
            "Improved Discourse Parsing with Two-Step Neural Transition-Based Model.",
            "The Contribution of Stemming and Semantics in Arabic Topic Segmentation.",
            "Expanding Paraphrase Lexicons by Exploiting Generalities.",
            "Empirical Exploring Word-Character Relationship for Chinese Sentence Representation.",
            "Chinese Open Relation Extraction and Knowledge Base Establishment.",
            "Phrase Table Induction Using Monolingual Data for Low-Resource Statistical Machine Translation.",
            "Integrating Shallow Syntactic Labels in the Phrase-Boundary Translation Model.",
            "Arabic Speech Act Recognition Techniques.",
            "End-to-End Korean Part-of-Speech Tagging Using Copying Mechanism.",
            "Application of Structural and Topological Features to Recognize Online Handwritten Bangla Characters.",
            "Leveraging Hierarchical Deep Semantics to Classify Implicit Discourse Relations via a Mutual Learning Method.",
            "Morphological Segmentation and Part-of-Speech Tagging for the Arabic Heritage.",
            "Incorporating Prior Knowledge into Word Embedding for Chinese Word Similarity Measurement.",
            "Constructing a WordNet for Turkish Using Manual and Automatic Annotation.",
            "Learning to Recommend Related Entities With Serendipity for Web Search Users.",
            "Words Are Important: Improving Sentiment Analysis in the Persian Language by Lexicon Refining.",
            "The Rule-Based Sundanese Stemmer.",
            "A Dependency Parser for Spontaneous Chinese Spoken Language.",
            "Improving Vector Space Word Representations Via Kernel Canonical Correlation Analysis.",
            "Novel Character Identification Utilizing Semantic Relation with Animate Nouns in Korean.",
            "Graph-Based Bilingual Word Embedding for Statistical Machine Translation.",
            "CLASENTI: A Class-Specific Sentiment Analysis Framework.",
            "Domain-specific Named Entity Recognition with Document-Level Optimization.",
            "Comparison of Methods to Annotate Named Entity Corpora.",
            "Weakly Supervised POS Tagging without Disambiguation."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2016",
        "info": "Volume 16: 2016/2017",
        "count": 29,
        "papers": [
            "Online Handwritten Gurmukhi Strokes Dataset Based on Minimal Set of Words.",
            "Pairwise Comparative Classification for Translator Stylometric Analysis.",
            "Improving Unsupervised Dependency Parsing with Knowledge from Query Logs.",
            "Boosting Neural POS Tagger for Farsi Using Morphological Information.",
            "A Seed-Based Method for Generating Chinese Confusion Sets.",
            "Improving Semantic Parsing with Enriched Synchronous Context-Free Grammars in Statistical Machine Translation.",
            "Understanding Document Semantics from Summaries: A Case Study on Hindi Texts.",
            "A Semisupervised Tag-Transition-Based Markovian Model for Uyghur Morphology Analysis.",
            "An Approach to Construct a Named Entity Annotated English-Vietnamese Bilingual Corpus.",
            "Boosted Web Named Entity Recognition via Tri-Training.",
            "A Discourse-Based Approach for Arabic Question Answering.",
            "Word Re-Segmentation in Chinese-Vietnamese Machine Translation.",
            "Minimally Supervised Chinese Event Extraction from Multiple Views.",
            "Query Expansion in Resource-Scarce Languages: A Multilingual Framework Utilizing Document Structure.",
            "Inducing a Bilingual Lexicon from Short Parallel Multiword Sequences.",
            "Comparison Study on Critical Components in Composition Model for Phrase Representation.",
            "Improving Transition-Based Dependency Parsing of Hindi and Urdu by Modeling Syntactically Relevant Phenomena.",
            "Named Entity Recognition with Word Embeddings and Wikipedia Categories for a Low-Resource Language.",
            "Implicit Discourse Relation Recognition for English and Chinese with Multiview Modeling and Effective Representation Learning.",
            "Corpus-Based Translation Induction in Indian Languages Using Auxiliary Language Corpora from Wikipedia.",
            "A Hybrid Model for Chinese Spelling Check.",
            "Evaluating the Content of LMF Standardized Dictionaries: A Practical Experiment on Arabic Language.",
            "A Sentiment Treebank and Morphologically Enriched Recursive Deep Models for Effective Sentiment Analysis in Arabic.",
            "Animation of Fingerspelled Words and Number Signs of the Sinhala Sign Language.",
            "AROMA: A Recursive Deep Learning Model for Opinion Mining in Arabic as a Low Resource Language.",
            "A CDT-Styled End-to-End Chinese Discourse Parser.",
            "A Position-Aware Language Modeling Framework for Extractive Broadcast News Speech Summarization.",
            "A Supervised Learning Approach for Authorship Attribution of Bengali Literary Texts.",
            "Translating Low-Resource Languages by Vocabulary Adaptation from Close Counterparts."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2016",
        "info": "Volume 15: 2016",
        "count": 29,
        "papers": [
            "Description of the Chinese-to-Spanish Rule-Based Machine Translation System Developed Using a Hybrid Combination of Human Annotation and Statistical Techniques.",
            "A Hybrid Feature Extraction Algorithm for Devanagari Script.",
            "Improving Handwritten Arabic Character Recognition by Modeling Human Handwriting Distortions.",
            "A Constraint Approach to Pivot-Based Bilingual Dictionary Induction.",
            "Speech Act Identification Using Semantic Dependency Graphs with Probabilistic Context-Free Grammars.",
            "Constructing Complex Search Tasks with Coherent Subtask Search Goals.",
            "Collective Web-Based Parenthetical Translation Extraction Using Markov Logic Networks.",
            "Fuzzy Hindi WordNet and Word Sense Disambiguation Using Fuzzy Graph Connectivity Measures.",
            "Acoustic Features for Hidden Conditional Random Fields-Based Thai Tone Classification.",
            "Integrated Parallel Sentence and Fragment Extraction from Comparable Corpora: A Case Study on Chinese-Japanese Wikipedia.",
            "Converting Continuous-Space Language Models into N-gram Language Models with Efficient Bilingual Pruning for Statistical Machine Translation.",
            "BenLem (A Bengali Lemmatizer) and Its Role in WSD.",
            "Enhancing Shift-Reduce Constituent Parsing with Action N-Gram Model.",
            "Extracting Arabic Causal Relations Using Linguistic Patterns.",
            "Bilingual Semantic Role Labeling Inference via Dual Decomposition.",
            "Modeling Monolingual Character Alignment for Automatic Evaluation of Chinese Translation.",
            "Using Bisect K-Means Clustering Technique in the Analysis of Arabic Documents.",
            "Arabic Cross-Language Information Retrieval: A Review.",
            "Adaptation of Language Models for SMT Using Neural Networks with Topic Information.",
            "Inter-, Intra-, and Extra-Chunk Pre-Ordering for Statistical Japanese-to-English Machine Translation.",
            "Printed Text Image Database for Sindhi OCR.",
            "Word Segmentation for Burmese (Myanmar).",
            "From Image to Translation: Processing the Endangered Nyushu Script.",
            "A \"Suggested\" Picture of Web Search in Turkish.",
            "Classification of Printed Gujarati Characters Using Low-Level Stroke Features.",
            "A Four-Tier Annotated Urdu Handwritten Text Image Dataset for Multidisciplinary Research on Urdu Script.",
            "A Fast and Compact Language Model Implementation Using Double-Array Structures.",
            "Learning Generalized Features for Semantic Role Labeling.",
            "Bangla Handwritten Character Segmentation Using Structural Features: A Supervised and Bootstrapping Approach."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2015",
        "info": "Volume 14: 2015",
        "count": 19,
        "papers": [
            "Integrating Multiple Dependency Corpora for Inducing Wide-Coverage Japanese CCG Resources.",
            "Approaches to Temporal Expression Recognition in Hindi.",
            "Improving Telugu Dependency Parsing using Combinatory Categorial Grammar Supertags.",
            "An EDU-Based Approach for Thai Multi-Document Summarization and Its Application.",
            "TALLIP Perspectives: Editorial Commentary: The Broadened Focus of the Journal.",
            "Model Generation of Accented Speech using Model Transformation and Verification for Bilingual Speech Recognition.",
            "Keyword Extraction from Arabic Documents using Term Equivalence Classes.",
            "Bigram Language Models and Reevaluation Strategy for Improved Recognition of Online Handwritten Tamil Words.",
            "Towards Machine Translation in Semantic Vector Space.",
            "Conditional Random Fields for Korean Morpheme Segmentation and POS Tagging.",
            "Multilingual Topic Models for Bilingual Dictionary Extraction.",
            "A Unified Model for Solving the OOV Problem of Chinese Word Segmentation.",
            "Preordering using a Target-Language Parser via Cross-Language Syntactic Projection for Statistical Machine Translation.",
            "Introduction to the Special Issue on Chinese Spell Checking.",
            "A Probabilistic Framework for Chinese Spelling Check.",
            "A Hybrid Ranking Approach to Chinese Spelling Check.",
            "Chinese Spelling Checker Based on an Inverted Index List with a Rescoring Mechanism.",
            "Correcting Chinese Spelling Errors with Word Lattice Decoding.",
            "TALLIP Perspectives: Editorial Commentary: The State of the Journal."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2014",
        "info": "Volume 13: 2014",
        "count": 18,
        "papers": [
            "Time for More Languages: Temporal Tagging of Arabic, Italian, Spanish, and Vietnamese.",
            "Distortion Model Based on Word Sequence Labeling for Statistical Machine Translation.",
            "Cross-Lingual Annotation Projection for Weakly-Supervised Relation Extraction.",
            "Arabic Text Categorization Based on Arabic Wikipedia.",
            "TALIP Perspectives, Guest Editorial Commentary: What Counts (and What Ought to Count)?",
            "The Effectiveness of a Jawi Stemmer for Retrieving Relevant Malay Documents in Jawi Characters.",
            "Towards Kurdish Information Retrieval.",
            "Word Prediction System for Text Entry in Hindi.",
            "Splitting Arabic Texts into Elementary Discourse Units.",
            "TALIP Perspectives, Guest Editorial Commentary: Pragmatic and Cultural Considerations for Deception Detection in Asian Languages.",
            "Linguistic analysis of non-ITG word reordering between language pairs with different word order typologies.",
            "Allograph modeling for online handwritten characters in devanagari using constrained stroke clustering.",
            "Incremental blind feedback: An effective approach to automatic query expansion.",
            "Stemming resource-poor Indian languages.",
            "The state of the journal.",
            "Pronunciation Variants Prediction Method to Detect Mispronunciations by Korean Learners of English.",
            "Discriminative Training for Log-Linear Based SMT: Global or Local Methods.",
            "Efficient Personalized Probabilistic Retrieval of Chinese Calligraphic Manuscript Images in Mobile Cloud Environment."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2013",
        "info": "Volume 12: 2013",
        "count": 17,
        "papers": [
            "Toward a Professional Platform for Chinese Character Conversion.",
            "The Left and Right Context of a Word: Overlapping Chinese Syllable Word Segmentation with Minimal Context.",
            "A Two-Phase Framework for Learning Logical Structures of Paragraphs in Legal Articles.",
            "Attention-Feedback Based Robust Segmentation of Online Handwritten Isolated Tamil Words.",
            "Learning Abbreviations from Chinese and English Terms by Modeling Non-Local Information.",
            "Design and Evaluation of Soft Keyboards for Brahmic Scripts.",
            "Word Sense Disambiguation by Combining Labeled Data Expansion and Semi-Supervised Learning Method.",
            "Greetings from the new Editor-in-Chief.",
            "A Bayesian Alignment Approach to Transliteration Mining.",
            "A Named Entity Recognition Method Based on Decomposition and Concatenation of Word Chunks.",
            "Normalizing Complex Functional Expressions in Japanese Predicates: Linguistically-Directed Rule-Based Paraphrasing and Its Application.",
            "Syntax-Based Post-Ordering for Efficient Japanese-to-English Translation.",
            "TALIP Perspectives.",
            "How to Choose the Best Pivot Language for Automatic Translation of Low-Resource Languages.",
            "A Computer-Assisted Translation and Writing System.",
            "Chinese-Japanese Machine Translation Exploiting Chinese Characters.",
            "Post-Ordering by Parsing with ITG for Japanese-English Statistical Machine Translation."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2012",
        "info": "Volume 11: 2012",
        "count": 18,
        "papers": [
            "Handwriting Recognition in Indian Regional Scripts: A Survey of Offline Techniques.",
            "RENAR: A Rule-Based Arabic Named Entity Recognition System.",
            "Error Diagnosis of Chinese Sentences Using Inductive Learning Algorithm and Decomposition-Based Testing Mechanism.",
            "Incorporating Sentiment Prior Knowledge for Weakly Supervised Sentiment Analysis.",
            "Toward a Unified Framework for Standard and Update Multi-Document Summarization.",
            "Statistical Extraction and Comparison of Pivot Words for Bilingual Lexicon Extension.",
            "Integrating Generative and Discriminative Character-Based Models for Chinese Word Segmentation.",
            "HPSG-Based Preprocessing for English-to-Japanese Translation.",
            "Adaptive Bayesian HMM for Fully Unsupervised Chinese Part-of-Speech Induction.",
            "Stacking Model-Based Korean Prosodic Phrasing Using Speaker Variability Reduction and Linguistic Feature Engineering.",
            "Cross-Language Latent Relational Search between Japanese and English Languages Using a Web Corpus.",
            "Introduction to the Special Issue on RITE.",
            "Evaluating Textual Entailment Recognition for University Entrance Examinations.",
            "Learning to Recognize Textual Entailment in Japanese Texts with the Utilization of Machine Translation.",
            "Recognizing Inference in Texts with Markov Logic Networks.",
            "Predicate-Argument Structure-Based Textual Entailment Recognition System Exploiting Wide-Coverage Lexical Knowledge.",
            "Validating Contradiction in Texts Using Online Co-Mention Pattern Checking.",
            "Leveraging Diverse Lexical Resources for Textual Entailment Recognition."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2011",
        "info": "Volume 10: 2011",
        "count": 21,
        "papers": [
            "Introduction to the Special Issue on Arabic Computational Linguistics.",
            "Machine Translation Errors: English and Iraqi Arabic.",
            "Spelling Correction for Dialectal Arabic Dictionary Lookup.",
            "Exploiting Separation of Closed-Class Categories for Arabic Tokenization and Part-of-Speech Tagging.",
            "Automatic Detection of Arabic Non-Anaphoric Pronouns for Improving Anaphora Resolution.",
            "Interruption Point Detection of Spontaneous Speech Using Inter-Syllable Boundary-Based Prosodic Features.",
            "Articulation-Disordered Speech Recognition Using Speaker-Adaptive Acoustic Models and Personalized Articulation Patterns.",
            "A Fast Corpus-Based Stemmer.",
            "Weighted Vote-Based Classifier Ensemble for Named Entity Recognition: A Genetic Algorithm-Based Approach.",
            "Visually and Phonologically Similar Characters in Incorrect Chinese Words: Analyses, Identification, and Applications.",
            "Introduction to the Special Issue on Chinese Language Processing.",
            "Automatic Treebank Conversion via Informed Decoding - A Case Study on Chinese Treebanks.",
            "Unified Semantic Role Labeling for Verbal and Nominal Predicates in the Chinese Language.",
            "Developing Position Structure-Based Framework for Chinese Entity Relation Extraction.",
            "Employing Constituent Dependency Information for Tree Kernel-Based Semantic Relation Extraction between Named Entities.",
            "Using Sublexical Translations to Handle the OOV Problem in Machine Translation.",
            "Improved Chinese-English SMT with Chinese \"DE\" Construction Classification and Reordering.",
            "Language Modeling for Syntax-Based Machine Translation Using Tree Substitution Grammars: A Case Study on Chinese-English Translation.",
            "Mining English-Chinese Named Entity Pairs from Comparable Corpora.",
            "User Behaviors in Related Word Retrieval and New Word Detection: A Collaborative Perspective.",
            "Deep Learning Approaches to Semantic Relevance Modeling for Chinese Question-Answer Pairs."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2010",
        "info": "Volume 9: 2010",
        "count": 15,
        "papers": [
            "Mining Synonymous Transliterations from the World Wide Web.",
            "Identification of Soundbite and Its Speaker Name Using Transcripts of Broadcast News Speech.",
            "Inducing Morphemes Using Light Knowledge.",
            "A Reexamination of MRD-Based Word Sense Disambiguation.",
            "A Unified Character-Based Tagging Framework for Chinese Word Segmentation.",
            "A Linguistically Inspired Statistical Model for Chinese Punctuation Generation.",
            "Topic-Dependent Language Model with Voting on Noun History.",
            "The State of the Journal.",
            "Introduction to the Special Issue on Indian Language Information Retrieval Part I.",
            "The FIRE 2008 Evaluation Exercise.",
            "Comparative Study of Indexing and Search Strategies for the Hindi, Marathi, and Bengali Languages.",
            "Sub-Word Indexing and Blind Relevance Feedback for English, Bengali, Hindi, and Marathi IR.",
            "Compositional Machine Transliteration.",
            "Transliteration for Resource-Scarce Languages.",
            "An Information-Extraction System for Urdu - A Resource-Poor Language."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2009",
        "info": "Volume 8: 2009",
        "count": 19,
        "papers": [
            "Introduction to the Special Issue on Recent Advances in Asian Language Spoken Document Retrieval.",
            "Word Topic Models for Spoken Document Retrieval and Transcription.",
            "A Comparative Study of Probabilistic Ranking Models for Chinese Spoken Document Summarization.",
            "Two-Stage Hypotheses Generation for Spoken Language Translation.",
            "Introduction to the Special Issue on Machine Translation of Asian Languages.",
            "Improved Monolingual Hypothesis Alignment for Machine Translation System Combination.",
            "Bilingually Motivated Word Segmentation for Statistical Machine Translation.",
            "Discriminative Machine Translation Using Global Lexical Selection.",
            "A Chinese-Japanese Lexical Machine Translation through a Pivot Language.",
            "Using Short Dependency Relations from Auto-Parsed Data for Chinese Dependency Parsing.",
            "Word-Wise Thai and Roman Script Identification.",
            "Web Search Clustering and Labeling with Hidden Topics.",
            "Introduction to the Special Issue on Arabic Natural Language Processing.",
            "Arabic Natural Language Processing: Challenges and Solutions.",
            "Discriminative Phrase-Based Models for Arabic Machine Translation.",
            "Morphology-Based Segmentation Combination for Arabic Mention Detection.",
            "Cross-Language Information Propagation for Arabic Mention Detection.",
            "Automatic Speech-to-Text Transcription in Arabic.",
            "Sura Length and Lexical Probability Estimation in Cluster Analysis of the Qur'an."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2008",
        "info": "Volume 7: 2008",
        "count": 13,
        "papers": [
            "A Structure-Based Model for Chinese Organization Name Translation.",
            "Improving Speech Recognition and Understanding using Error-Corrective Reranking.",
            "Multidocument Summary Generation: Using Informative and Event Words.",
            "Introduction to the NTCIR-6 Special Issue.",
            "A Hybrid Technique for English-Chinese Cross Language Information Retrieval.",
            "Automatically Acquiring Causal Expression Patterns from Relation-annotated Corpora to Improve Question Answering for why-Questions.",
            "Adapting Support Vector Machines for F-term-based Classification of Patents.",
            "Integrating Cross-Language Hierarchies and Its Application to Retrieving Relevant Documents.",
            "Acquisition of Morphology of an Indic Language from Text Corpus.",
            "TRUES: Tone Recognition Using Extended Segments.",
            "Variant Chinese Domain Name Resolution.",
            "Boosting Chinese Question Answering with Two Lightweight Methods: ABSPs and SCO-QAT.",
            "Using a Hybrid Convolution Tree Kernel for Semantic Role Labeling."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2007",
        "info": "Volume 6: 2007",
        "count": 14,
        "papers": [
            "Transfer-based statistical translation of Taiwanese sign language using PCFG.",
            "Using data mining techniques and rough set theory for language modeling.",
            "On the reliability of factoid question answering evaluation.",
            "Conjugation-based compression for Hebrew texts.",
            "Measuring similarity between transliterations against noise data.",
            "A phonetic similarity model for automatic extraction of transliteration pairs.",
            "The study of a nonstationary maximum entropy Markov model and its application on the pos-tagging task.",
            "Interactive high-dimensional index for large Chinese calligraphic character databases.",
            "Comparison of performance of enhanced morpheme-based language model with different word-based language models for improving the performance of Tamil speech recognition system.",
            "Developing lexicographic sorting: An example for Urdu.",
            "Topic tracking based on bilingual comparable corpora and semisupervised clustering.",
            "Zero-anaphora resolution by learning rich syntactic pattern features.",
            "Stemming Indonesian: A confix-stripping approach.",
            "Named entity recognition in Vietnamese using classifier voting."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2006",
        "info": "Volume 5: 2006",
        "count": 22,
        "papers": [
            "AUTHOR: Text mining and management in biomedicine.",
            "ME-based biomedical named entity recognition using lexical knowledge.",
            "Mining semantically related terms from biomedical literature.",
            "Extracting contrastive information from negation patterns in biomedical literature.",
            "Two-phase learning for biological event extraction and verification.",
            "Terminology-based knowledge mining for new knowledge discovery.",
            "Aligning word senses using bilingual corpora.",
            "Alignment of bilingual named entities in parallel corpora using statistical models and multiple knowledge sources.",
            "Using Japanese honorific expressions: A psychological study.",
            "Emotion recognition from text using semantic labels and separable mixture models.",
            "Introduction to the Special section: Extended best papers from IJCNLP 2005.",
            "A machine transliteration model based on correspondence between graphemes and phonemes.",
            "An empirical study on language model adaptation.",
            "Semantic role labeling of prepositional phrases.",
            "Adapting pivoted document-length normalization for query size: Experiments in Chinese and English.",
            "Effect of relationships between words on Japanese information retrieval.",
            "Introduction to special issue on reasoning in natural language information processing.",
            "Inferential language models for information retrieval.",
            "Statistical query translation models for cross-language information retrieval.",
            "A statistical framework for query translation disambiguation.",
            "Topic tracking with time granularity reasoning.",
            "Improving discriminative sequential learning by discovering important association of statistics."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2005",
        "info": "Volume 4: 2005",
        "count": 24,
        "papers": [
            "Domain-specific FAQ retrieval using independent aspects.",
            "Correction of errors in a verb modality corpus for machine translation with a machine-learning method.",
            "A speech synthesizer for Persian text using a neural network with a smooth ergodic HMM.",
            "Chinese OOV translation and post-translation query expansion in chinese--english cross-lingual information retrieval.",
            "Towards effective strategies for monolingual and bilingual information retrieval: Lessons learned from NTCIR-4.",
            "Flexible pseudo-relevance feedback via selective sampling.",
            "Rich results from poor resources: NTCIR-4 monolingual and cross-lingual retrieval of korean texts using chinese and english.",
            "Comparative study of monolingual and multilingual search models for use with asian languages.",
            "Proposal of two-stage patent retrieval method considering the claim structure.",
            "Revisiting Document Length Hypotheses: A Comparative Study of Japanese Newspaper and Patent Retrieval.",
            "Preface to the special issues on NTCIR-4.",
            "Are open-domain question answering technologies useful for information access dialogues?---an empirical study and a proposal of a novel challenge.",
            "An analysis of a high-performance japanese question answering system.",
            "Japanese question-answering system using A* search and its improvement.",
            "Multi-answer-focused multi-document summarization using a question-answering engine.",
            "Improving chronological ordering of sentences extracted from multiple newspaper articles.",
            "On a combination of probabilistic and boolean ir models for WWW document retrieval.",
            "Chinese information retrieval based on terms and relevant terms.",
            "Introduction to the special issue: Recent advances in information processing and access for Japanese.",
            "Example-based machine translation using efficient sentence retrieval based on edit-distance.",
            "Estimating satisfactoriness of selectional restriction from corpus without a thesaurus.",
            "Anaphora resolution by antecedent identification followed by anaphoricity determination.",
            "Acquiring causal knowledge from text using the connective marker tame.",
            "Topic-structure-based complementary information retrieval and its application."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2004",
        "info": "Volume 3: 2004",
        "count": 17,
        "papers": [
            "Introduction to the special issue on temporal information processing.",
            "A framework for resolution of time in natural language.",
            "Extracting meaning from temporal nouns and temporal prepositions.",
            "Automatic TIMEX2 tagging of Korean news.",
            "An ontology of time for the semantic web.",
            "Introduction to the special issue on statistical language modeling.",
            "Lexical triggers and latent semantic analysis for cross-lingual language model adaptation.",
            "A hybrid language model based on a combination of N-grams and stochastic context-free grammars.",
            "A discriminative HMM/N-gram-based retrieval approach for mandarin spoken documents.",
            "Example-based sentence reduction using the hidden markov model.",
            "A maximum-entropy chinese parser augmented by transformation-based learning.",
            "Analysis and modeling of F0 contours for cantonese text-to-speech.",
            "Using a web-based categorization approach to generate thematic metadata from texts.",
            "Introduction to the special issue on computer processing of oriental languages.",
            "An adaptive k-nearest neighbor text categorization strategy.",
            "Usefulness of temporal information automatically extracted from news articles for topic tracking.",
            "An evaluation of statistical spam filtering techniques."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2003",
        "info": "Volume 2: 2003",
        "count": 22,
        "papers": [
            "Cross-language spoken document retrieval using HMM-based retrieval model with multi-scale fusion.",
            "Offline handwritten Chinese character recognition by radical decomposition.",
            "Task adaptation in stochastic language model for Chinese homophone disambiguation.",
            "An efficient accessing technique for Taiwanese phonetic transcriptions.",
            "The surprise language exercises.",
            "A month to topic detection and tracking in Hindi.",
            "Linguistic resource creation for research and technology development: A recent experiment.",
            "Rapid porting of DUSTer to Hindi.",
            "Extracting named entity translingual equivalence with limited resources.",
            "Hindi CLIR in thirty days.",
            "Experiments with a Hindi-to-English transfer-based MT system under a miserly data scenario.",
            "Cross-lingual retrieval for Hindi.",
            "Surprise! What's in a Cebuano or Hindi Name?",
            "Hindi-english cross-lingual question-answering system.",
            "Adaptive Hindi OCR using generalized Hausdorff image comparison.",
            "Making MIRACLEs: Interactive translingual search for Cebuano and Hindi.",
            "Cross-lingual C*ST*RD: English access to Hindi information.",
            "Cross-language headline generation for Hindi.",
            "Rapid development of Hindi named entity recognition using conditional random fields and feature induction.",
            "Rapid customization of an information extraction system for a surprise language.",
            "Improving partial parsing based on error-pattern analysis for a Korean grammar-checker.",
            "Resolution of referring expressions in a Korean multimodal dialogue system."
        ]
    },
    {
        "name": "TALLIP",
        "year": "2002",
        "info": "Volume 1: 2002",
        "count": 15,
        "papers": [
            "Prologue.",
            "Toward a unified approach to statistical language modeling for Chinese.",
            "Meaningful term extraction and discriminative term selection in text categorization via unknown-word methodology.",
            "Morpheme-based grapheme to phoneme conversion using phonetic patterns and morphophonemic connectivity information.",
            "Using tone information in Cantonese continuous speech recognition.",
            "Building a Chinese-English wordnet for translingual applications.",
            "GLR parsing with multiple grammars for natural language queries.",
            "Comparison of three machine-learning methods for Thai part-of-speech tagging.",
            "Translation of web queries using anchor text mining.",
            "A word-based approach for modeling and discovering temporal relations embedded in Chinese sentences.",
            "Automatic corpus-based tone and break-index prediction using K-ToBI representation.",
            "A comparison of Chinese document indexing strategies and retrieval models.",
            "A language and character set determination method based on N-gram statistics.",
            "A Chinese dictionary construction algorithm for information retrieval.",
            "Combining character-based bigrams with word-based bigrams in contextual postprocessing for Chinese script recognition."
        ]
    }
]