[
    {
        "name": "TAP",
        "year": "2022",
        "info": "Volume 19: 2022",
        "count": 4,
        "papers": [
            "The Perceptual Consistency and Association of the LMA Effort Elements.",
            "Motor Variability in Complex Gesture Learning: Effects of Movement Sonification and Musical Background.",
            "A Virtual Reality Application of the Rubber Hand Illusion Induced by Ultrasonic Mid-air Haptic Stimulation.",
            "The Effects on Driving Behavior When Using a Head-mounted Display in a Dynamic Driving Simulator."
        ]
    },
    {
        "name": "TAP",
        "year": "2021",
        "info": "Volume 18: 2021",
        "count": 23,
        "papers": [
            "Quantification of Displacement for Tactile Sensation in a Contact-type Low Intensity Focused Ultrasound Haptic Device.",
            "Comparison of Subjective Methods for Quality Assessment of 3D Graphics in Virtual Reality.",
            "Evaluating Automated Face Identity-Masking Methods with Human Perception and a Deep Convolutional Neural Network.",
            "Crossing Roads with a Computer-generated Agent: Persistent Effects on Perception-Action Tuning.",
            "Field-of-View Restriction to Reduce VR Sickness Does Not Impede Spatial Learning in Women.",
            "Spot the Difference: Accuracy of Numerical Simulations via the Human Visual System.",
            "Estimating Distances in Action Space in Augmented Reality.",
            "Does What We See Shape History? Examining Workload History as a Function of Performance and Ambient/Focal Visual Attention.",
            "Effects of Tactile Textures on Preference in Visuo-Tactile Exploration.",
            "The Role of Subsurface Scattering in Glossiness Perception.",
            "Eye Tracking Interaction on Unmodified Mobile VR Headsets Using the Selfie Camera.",
            "An Extended Analysis on the Benefits of Dark Mode User Interfaces in Optical See-Through Head-Mounted Displays.",
            "Identification of Words and Phrases Through a Phonemic-Based Haptic Display: Effects of Inter-Phoneme and Inter-Word Interval Durations.",
            "Computational Model for Global Contour Precedence Based on Primary Visual Cortex Mechanisms.",
            "MovEcho: A Gesture-Sound Interface Allowing Blind Manipulations in a Driving Context.",
            "When Scents Help Me Remember My Password.",
            "Editorial.",
            "Introduction to the Special Issue on SAP 2021.",
            "Evaluating Grasping Visualizations and Control Modes in a VR Game.",
            "An Evaluation of Screen Parallax, Haptic Feedback, and Sensory-Motor Mismatch on Near-Field Perception-Action Coordination in VR.",
            "Do Prosody and Embodiment Influence the Perceived Naturalness of Conversational Agents' Speech?",
            "Facial Feature Manipulation for Trait Portrayal in Realistic and Cartoon-Rendered Characters.",
            "Stealth Updates of Visual Information by Leveraging Change Blindness and Computational Visual Morphing."
        ]
    },
    {
        "name": "TAP",
        "year": "2020",
        "info": "Volume 17: 2020",
        "count": 17,
        "papers": [
            "Translational and Rotational Arrow Cues (TRAC) Navigation Method for Manual Alignment Tasks.",
            "Visual Information Requirements for Dismounted Soldier Target Acquisition.",
            "The Impact of the Complexity of Harmony on the Acceptability of Music.",
            "The Impact of Olfactory and Wind Stimuli on 360 Videos Using Head-mounted Displays.",
            "Feature Weighted Linguistics Classifier for Predicting Learning Difficulty Using Eye Tracking.",
            "Three Perceptual Dimensions for Specular and Diffuse Reflection.",
            "Establishing Vibration-Based Tactile Line Profiles for Use in Multimodal Graphics.",
            "Does It Ping or Pong? Auditory and Tactile Classification of Materials by Bouncing Events.",
            "Learning the Vibrotactile Morse Code Alphabet.",
            "On the Perception Analysis of User Feedback for Interactive Face Retrieval.",
            "Providing Semi-private Feedback on a Shared Public Screen by Controlling Presentation Onset.",
            "A Systematic Review of Empirical Measures of Workload Capacity.",
            "Introduction to the Special Issue on SAP 2020.",
            "Toward Quantifying Ambiguities in Artistic Images.",
            "The Effect of Gender and Attractiveness of Motion on Proximity in Virtual Reality.",
            "A Fitts' Law Evaluation of Visuo-haptic Fidelity and Sensory Mismatch on User Performance in a Near-field Disc Transfer Task in Virtual Reality.",
            "How the Presence and Size of Static Peripheral Blur Affects Cybersickness in Virtual Reality."
        ]
    },
    {
        "name": "TAP",
        "year": "2019",
        "info": "Volume 16: 2019",
        "count": 22,
        "papers": [
            "Perceptual Attributes Analysis of Real-world Materials.",
            "Perceptual Effects of Inconsistency in Human Animations.",
            "Influence of Visual Salience on Webpage Product Searches.",
            "Light Shapes: Perception-Based Visualizations of the Global Light Transport.",
            "Quantifying Visual Abstraction Quality for Computer-Generated Illustrations.",
            "Non-visual Perception of Lines on a Multimodal Touchscreen Tablet.",
            "Human and DNN Classification Performance on Images With Quality Distortions: A Comparative Study.",
            "Visual Stabilization of Balance in Virtual Reality Using the HTC Vive.",
            "The FechDeck: A Hand Tool for Exploring Psychophysics.",
            "Shadow-based Illusion of Depth and Transparency in Printed Images.",
            "Context in Photo Albums: Understanding and Modeling User Behavior in Clustering and Selection.",
            "The Supernumerary Hand Illusion in Augmented Reality.",
            "Introduction to the Special Issue on SAP 2019.",
            "Is Photorealism Important for Perception of Expressive Virtual Humans in Virtual Reality?",
            "Predicting Perceived Naturalness of Human Animations Based on Generative Movement Primitive Models.",
            "Keep It Simple: Depth-based Dynamic Adjustment of Rendering for Head-mounted Displays Decreases Visual Comfort.",
            "The Effect of Task on Visual Attention in Interactive Virtual Environments.",
            "Algorithmic Perception of Vertices in Sketched Drawings of Polyhedral Shapes.",
            "Photoplethysmogram-based Cognitive Load Assessment Using Multi-Feature Fusion Model.",
            "Tactile Texture Display with Vibrotactile and Electrostatic Friction Stimuli Mixed at Appropriate Ratio Presents Better Roughness Textures.",
            "Assessing Neural Network Scene Classification from Degraded Images.",
            "Comparative Evaluation of User Perceived Quality Assessment of Design Strategies for HTTP-based Adaptive Streaming."
        ]
    },
    {
        "name": "TAP",
        "year": "2017",
        "info": "Volume 15: 2017/2018",
        "count": 27,
        "papers": [
            "Perceptual Lightness Modeling for High-Dynamic-Range Imaging.",
            "Perceived Space in the HTC Vive.",
            "Improving Human-Machine Cooperative Visual Search With Soft Highlighting.",
            "Facial Features of Non-player Creatures Can Influence Moral Decisions in Video Games.",
            "Visual Quality Assessment of 3D Models: On the Influence of Light-Material Interaction.",
            "The Perceptual Consequences of Curved Screens.",
            "Evaluating the Use of Sound in Static Program Comprehension.",
            "Acting Together: Joint Pedestrian Road Crossing in an Immersive Virtual Environment.",
            "The Contribution of Stereoscopic and Motion Depth Cues to the Perception of Structures in 3D Point Clouds.",
            "Perceptual Constancy in the Reproduction of Virtual Tactile Textures With Surface Displays.",
            "Comparison of Two Methods for Improving Distance Perception in Virtual Reality.",
            "The Effects of Peripheral Vision and Light Stimulation on Distance Judgments Through HMDs.",
            "Perceptual Evaluation of Synthesized Sound Effects.",
            "Creating Thermal Icons - A Model-Based Approach.",
            "Human Perception of Inertial Mass for Joint Human-Robot Object Manipulation.",
            "Sensory Substitution for Force Feedback Recovery: A Perception Experimental Study.",
            "Non-Invasive Measurement of Cognitive Load and Stress Based on the Reflected Stress-Induced Vascular Response Index.",
            "Influence of Screen Size and Field of View on Perceived Brightness.",
            "A Human-Perceived Softness Measure of Virtual 3D Objects.",
            "Behavior Analysis of Human Locomotion in the Real World and Virtual Reality for the Manufacturing Industry.",
            "A Comparison of Distance Estimation in HMD-Based Virtual Environments with Different HMD-Based Conditions.",
            "Toward Affective Handles for Tuning Vibrations.",
            "Introduction to Special Issue SAP 2018.",
            "Perceptual Adjustment of Eyeball Rotation and Pupil Size Jitter for Virtual Characters.",
            "Analysis of Hair Shine Using Rendering and Subjective Evaluation.",
            "Foveated Depth-of-Field Filtering in Head-Mounted Displays.",
            "Comparison of Unobtrusive Visual Guidance Methods in an Immersive Dome Environment."
        ]
    },
    {
        "name": "TAP",
        "year": "2016",
        "info": "Volume 14: 2016/2017",
        "count": 26,
        "papers": [
            "Reproducing Reality: Multimodal Contributions in Natural Scene Discrimination.",
            "A Proposed Methodology for Evaluating HDR False Color Maps.",
            "Top-Down Influences in the Detection of Spatial Displacement in a Musical Scene.",
            "Simulating Visual Contrast Reduction during Nighttime Glare Situations on Conventional Displays.",
            "Effects of Visual Latency on Vehicle Driving Behavior.",
            "Image Quality under Chromatic Impairments.",
            "Detection of Subconscious Face Recognition Using Consumer-Grade Brain-Computer Interfaces.",
            "Summary Statistics and Material Categorization in the Visual Periphery.",
            "Vertical Field-of-View Extension and Walking Characteristics in Head-Worn Virtual Environments.",
            "Seeing, Listening, Drawing: Interferences between Sensorimotor Modalities in the Use of a Tablet Musical Interface.",
            "Subjective and Objective Visual Quality Assessment of Textured 3D Meshes.",
            "Walking in Virtual Reality: Effects of Manipulated Visual Self-Motion on Walking Biomechanics.",
            "Toward a Perceptually Uniform Parameter Space for Filter Transparency.",
            "Automatic Detection of Game Engine Artifacts Using Full Reference Image Quality Metrics.",
            "Row-Interleaved Sampling for Depth-Enhanced 3D Video Coding for Polarized Displays.",
            "Fabric Appearance Control System for Example-Based Interactive Texture and Color Design.",
            "Affective Calibration of Musical Feature Sets in an Emotionally Intelligent Music Composition System.",
            "How Dimensional and Semantic Attributes of Visual Sign Influence Relative Value Estimation.",
            "Remote Sighted Assistants for Indoor Location Sensing of Visually Impaired Pedestrians.",
            "Computational Aesthetic Evaluation of Logos.",
            "Exploring Biological Motion Regularities of Human Actions: A New Perspective on Video Analysis.",
            "Comparative Analysis of Three Different Modalities for Perception of Artifacts in Videos.",
            "Gaze Data for the Analysis of Attention in Feature Films.",
            "Mimebot - Investigating the Expressibility of Non-Verbal Communication Across Agent Embodiments.",
            "Latency Requirements for Foveated Rendering in Virtual Reality.",
            "A Feature-Based Quality Metric for Tone Mapped Images."
        ]
    },
    {
        "name": "TAP",
        "year": "2015",
        "info": "Volume 13: 2015/2016",
        "count": 22,
        "papers": [
            "Strutting Hero, Sneaking Villain: Utilizing Body Motion Cues to Predict the Intentions of Others.",
            "Perception of Emotion and Personality through Full-Body Movement Qualities: A Sport Coach Case Study.",
            "The Effects of Visuomotor Calibration to the Perceived Space and Body, through Embodiment in Immersive Virtual Reality.",
            "Gaze Transition Entropy.",
            "Compensating the Effect of Communication Delay in Client-Server-Based Shared Haptic Virtual Environments.",
            "Biometric Recognition via Eye Movements: Saccadic Vigor and Acceleration Cues.",
            "Assessing and Improving the Identification of Computer-Generated Portraits.",
            "Evaluating Animated Characters: Facial Motion Magnitude Influences Personality Perceptions.",
            "Assessing the Impact of Hand Motion on Virtual Character Personality.",
            "Deformation Lamps: A Projection Technique to Make Static Objects Perceptually Dynamic.",
            "Discerning Ambient/Focal Attention with Coefficient K.",
            "3D Blur Discrimination.",
            "Color Picking: The Initial 20s.",
            "Individual Differences in Image-Quality Estimations: Estimation Rules and Viewing Strategies.",
            "Reconstructing User's Attention on the Web through Mouse Movements and Perception-Based Content Identification.",
            "Using Audio Cues to Support Motion Gesture Interaction on Mobile Devices.",
            "Distinguishing between Abstract Art by Artists vs. Children and Animals: Comparison between Human and Machine Perception.",
            "Introduction to Special Issue SAP 2016.",
            "An Empirical Evaluation of Visuo-Haptic Feedback on Physical Reaching Behaviors During 3D Interaction in Real and Immersive Virtual Environments.",
            "FrankenFolk: Distinctiveness and Attractiveness of Voice and Motion.",
            "Psychoacoustic Characterization of Propagation Effects in Virtual Environments.",
            "Is the Motion of a Child Perceivably Different from the Motion of an Adult?"
        ]
    },
    {
        "name": "TAP",
        "year": "2015",
        "info": "Volume 12: 2015",
        "count": 19,
        "papers": [
            "Eye Height Manipulations: A Possible Solution to Reduce Underestimation of Egocentric Distances in Head-Mounted Displays.",
            "The Effect of Wrinkles, Presentation Mode, and Intensity on the Perception of Facial Actions and Full-Face Expressions of Laughter.",
            "Depth Artifacts Caused by Spatial Interlacing in Stereoscopic 3D Displays.",
            "Visual Enhancement of MR Angiography Images to Facilitate Planning of Arteriovenous Malformation Interventions.",
            "Auditory Distance Presentation in an Urban Augmented Reality Environment.",
            "Affordance Judgments in HMD-Based Virtual Environments: Stepping over a Pole and Stepping off a Ledge.",
            "The Influence of the Stereo Base on Blind and Sighted Reaches in a Virtual Environment.",
            "Welcome Message from the New Editors-in-Chief.",
            "Investigating Perceived Emotional Correlates of Rhythmic Density in Algorithmic Music Composition.",
            "Simulating Fixations When Looking at Visual Arts.",
            "Perceptual Tolerance to Stereoscopic 3D Image Distortion.",
            "Exploring the Effect of Motion Type and Emotions on the Perception of Gender in Virtual Humans.",
            "Discrete Versus Solid: Representing Quantity Using Linear, Area, and Volume Glyphs.",
            "Introduction to Special Issue SAP 2015.",
            "Evaluating the Color Fidelity of ITMOs and HDR Color Appearance Models.",
            "Evidence that Viewers Prefer Higher Frame-Rate Film.",
            "Big Foot: Using the Size of a Virtual Foot to Scale Gap Width.",
            "Multimodal Affect: Perceptually Evaluating an Affective Talking Head.",
            "The Perception of Lighting Inconsistencies in Composite Outdoor Scenes."
        ]
    },
    {
        "name": "TAP",
        "year": "2014",
        "info": "Volume 11: 2014",
        "count": 22,
        "papers": [
            "The Role of Sound Source Perception in Gestural Sound Description.",
            "Effects of Long-Term Exposure on Sensitivity and Comfort with Stereoscopic Displays.",
            "Online 3D Gaze Localization on Stereoscopic Displays.",
            "Improving Transparency in Teleoperation by Means of Cutaneous Tactile Force Feedback.",
            "A Comparative Perceptual Study of Soft-Shadow Algorithms.",
            "Olfactory Adaptation in Virtual Environments.",
            "Human Perception of Visual Realism for Photo and Computer-Generated Face Images.",
            "A New Hypothesis on Facial Beauty Perception.",
            "Towards the Temporally Perfect Virtual Button: Touch-Feedback Simultaneity and Perceived Quality in Mobile Touchscreen Press Interactions.",
            "Perceptual Evaluation of Motion Editing for Realistic Throwing Animations.",
            "Introduction to Special Issue SAP 2014.",
            "Feel Effects: Enriching Storytelling with Haptic Feedback.",
            "Spatial and Temporal Linearities in Posed and Spontaneous Smiles.",
            "Can I Recognize My Body's Weight? The Influence of Shape and Texture on the Perception of Self.",
            "Gaze-to-Object Mapping during Visual Search in 3D Virtual Environments.",
            "Stereo Day-for-Night: Retargeting Disparity for Scotopic Vision.",
            "Design and Analysis of Predictive Sampling of Haptic Signals.",
            "An Automated High-Level Saliency Predictor for Smart Game Balancing.",
            "Depth of Field Affects Perceived Depth in Stereographs.",
            "On the Benefits of Using Constant Visual Angle Glyphs in Interactive Exploration of 3D Scatterplots.",
            "Biometrics via Oculomotor Plant Characteristics: Impact of Parameters in Oculomotor Plant Model.",
            "The Role of Individual Difference in Judging Expressiveness of Computer-Assisted Music Performances by Experts."
        ]
    },
    {
        "name": "TAP",
        "year": "2013",
        "info": "Volume 10: 2013",
        "count": 27,
        "papers": [
            "Perceptual characterization of motion evoked by sounds for synthesis control purposes.",
            "Perceptual importance of lighting phenomena in rendering of animated water.",
            "Generating stereoscopic HDR images using HDR-LDR image pairs.",
            "Sound sample detection and numerosity estimation using auditory display.",
            "Abstract painting with interactive control of perceptual entropy.",
            "Improving relative depth judgments in augmented reality with auxiliary augmentations.",
            "Cueing multimedia search with audiovisual blur.",
            "Measuring the degree of face familiarity based on extended NMF.",
            "Analyzing correspondence between sound objects and body motion.",
            "Graph-based joint clustering of fixations and visual entities.",
            "Learning to walk in virtual reality.",
            "Introduction to special issue SAP 2013.",
            "Preference and artifact analysis for video transitions of places.",
            "Surface perception of planar abstractions.",
            "Shape perception of thin transparent objects with stereoscopic viewing.",
            "Evaluation of monocular depth cues on a high-dynamic-range display for visualization.",
            "Elastic images: Perceiving local elasticity of images through a novel pseudo-haptic deformation effect.",
            "Space perception in virtual environments: Displacement from the center of projection causes less distortion than predicted by cue-based models.",
            "A framework for applying the principles of depth perception to information visualization.",
            "Models of gaze control for manipulation tasks.",
            "Clustering approach to characterize haptic expressions of emotions.",
            "Perceptual impact of gesture control of spatialization.",
            "Walking pace affected by interactive sounds simulating stepping on different terrains.",
            "Intuitiveness of vibrotactile speed regulation cues.",
            "Virtual travel collisions: Response method influences perceived realism of virtual environments.",
            "Saliency-maximized audio visualization and efficient audio-visual browsing for faster-than-real-time human acoustic event detection.",
            "2D Linear oculomotor plant mathematical model: Verification and biometric applications."
        ]
    },
    {
        "name": "TAP",
        "year": "2012",
        "info": "Volume 9: 2012",
        "count": 21,
        "papers": [
            "Voluntary facial activations regulate physiological arousal and subjective experiences during virtual social stimulation.",
            "Multimodal recognition of reading activity in transit using body-worn sensors.",
            "Reinforcement learning utilizes proxemics: An avatar learns to manipulate the position of people in immersive virtual reality.",
            "Scene-motion thresholds during head yaw for immersive virtual environments.",
            "Enhancing visuospatial map learning through action on cellphones.",
            "Gaze-contingent visual presentation technique with electro-ocular-graph-based saccade detection.",
            "Evaluating the effectiveness of orientation indicators with an awareness of individual differences.",
            "Parametric time-frequency representation of spatial sound in virtual worlds.",
            "Real-time adaptive blur for reducing eye strain in stereoscopic displays.",
            "Introduction to special issue SAP 2012.",
            "Which facial profile do humans expect after seeing a frontal view? a comparison with a linear face model.",
            "Single-trial EEG classification of artifacts in videos.",
            "Visual and emotional salience influence eye movements.",
            "Minification affects verbal- and action-based distance judgments differently in head-mounted displays.",
            "Perception of blending in stereo motion panoramas.",
            "Comparing face recognition algorithms to humans on challenging tasks.",
            "Curve shape and curvature perception through interactive sonification.",
            "Perception and replication of planar sonic gestures.",
            "Audio, visual, and audio-visual egocentric distance perception by moving subjects in virtual environments.",
            "On the limits of resolution and visual angle in visualization.",
            "How real is real enough? optimal reality sampling for fast recognition of mobile imagery."
        ]
    },
    {
        "name": "TAP",
        "year": "2010",
        "info": "Volume 8: 2010/2011",
        "count": 27,
        "papers": [
            "Evaluation of force and torque magnitude discrimination thresholds on the human hand-arm system.",
            "Quantifying fidelity for virtual environment simulations employing memory schema assumptions.",
            "Proxemics with multiple dynamic characters in an immersive virtual environment.",
            "An empirical pipeline to derive gaze prediction heuristics for 3D action games.",
            "A supervised combination strategy for illumination chromaticity estimation.",
            "Perceptually guided high-fidelity rendering exploiting movement bias in visual attention.",
            "User-based evaluation of data-driven haptic rendering.",
            "Investigating the performance of path-searching tasks in depth on multiview displays.",
            "Modeling locomotor control: The advantages of mobile gaze.",
            "Perceptual effects of scene context and viewpoint for virtual pedestrian crowds.",
            "Perception-motivated interpolation of image sequences.",
            "Do predictions of visual perception aid design?",
            "Object selection in gaze controlled systems: What you don't look at is what you get.",
            "An other-race effect for face recognition algorithms.",
            "Human-inspired search for redundancy in automatic sign language recognition.",
            "Emulating human observers with bayesian binning: Segmentation of action streams.",
            "Modeling and animating eye blinks.",
            "Near-field distance perception in real and virtual environments using both verbal and action responses.",
            "Evaluation of walking in place on a Wii balance board to explore a virtual environment.",
            "Perceptual considerations for motion blur rendering.",
            "Redirected walking to explore virtual environments: Assessing the potential for spatial interference.",
            "Attentional gradient for crossmodal proximal-distal tactile cueing of visual spatial attention.",
            "Bimodal task-facilitation in a virtual traffic scenario through spatialized sound rendering.",
            "CyberWalk: Enabling unconstrained omnidirectional walking through virtual environments.",
            "Effects of scale change on distance perception in virtual environments.",
            "Modeling human aesthetic perception of visual textures.",
            "Integrating multiple views with virtual mirrors to facilitate scene understanding."
        ]
    },
    {
        "name": "TAP",
        "year": "2010",
        "info": "Volume 7: 2010",
        "count": 27,
        "papers": [
            "Bimodal perception of audio-visual material properties for virtual environments.",
            "Differences in head orientation behavior for speakers and listeners: An experiment in a virtual environment.",
            "Spatial learning and navigation using a virtual verbal display.",
            "Volume composition and evaluation using eye-tracking data.",
            "Simulating believable forward accelerations on a stewart motion platform.",
            "Computational visual attention systems and their cognitive foundations: A survey.",
            "Multidimensional scaling analysis of haptic exploratory procedures.",
            "Impressionism, expressionism, surrealism: Automated recognition of painters and schools of art.",
            "Cognitive transfer of spatial awareness states from immersive virtual environments to reality.",
            "Perception of mechanically and optically simulated bumps and holes.",
            "Making virtual walking real: Perceptual evaluation of a new treadmill control algorithm.",
            "Mesh saliency and human eye fixations.",
            "Comparing lighting quality evaluations of real scenes with those from high dynamic range and conventional images.",
            "Perceptual organization of affective and sensorial expressive intentions in music performance.",
            "Identifying the role of proprioception in upper-limb prosthesis control: Studies on targeted motion.",
            "Evaluating the multivariate visual quality performance of image-processing components.",
            "\"Writing with music\": Exploring the use of auditory feedback in gesture interfaces.",
            "Pilot gaze and glideslope control.",
            "Evaluating 2D and 3D visualizations of spatiotemporal information.",
            "Neural modeling of flow rendering effectiveness.",
            "Editorial - APGV 2010 special issue.",
            "The saliency of anomalies in animated human characters.",
            "Perceptually motivated guidelines for voice synchronization in film.",
            "Pointing in pictorial space: Quantifying the perceived relative depth structure in mono and stereo images of natural scenes.",
            "Analysis of disparity distortions in omnistereoscopic displays.",
            "How does presentation method and measurement protocol affect distance estimation in real and virtual environments?",
            "Visually significant edges."
        ]
    },
    {
        "name": "TAP",
        "year": "2009",
        "info": "Volume 6: 2009",
        "count": 25,
        "papers": [
            "A unified information-theoretic framework for viewpoint selection and mesh saliency.",
            "A psychophysical investigation of global illumination algorithms used in augmented reality.",
            "Negative efficacy of fixed gain error reducing shared control for training in virtual environments.",
            "The spatial resolution of crossmodal attention: Implications for the design of multimodal interfaces.",
            "Perception of image motion during head movement.",
            "Classifying pretended and evoked facial expressions of positive and negative affective states using infrared measurement of skin temperature.",
            "Moving sounds enhance the visually-induced self-motion illusion (circular vection) in virtual reality.",
            "The effects of head-mounted display mechanical properties and field of view on distance judgments in virtual environments.",
            "On spatiochromatic visual sensitivity and peripheral color LOD management.",
            "Toward a definition of visual complexity as an implicit measure of cognitive load.",
            "Real-world vision: Selective perception and task.",
            "Guest editorial.",
            "Investigating the role of body shape on the perception of emotion.",
            "Effect of scenario on perceptual sensitivity to errors in animation.",
            "FixTag: An algorithm for identifying and tagging fixations to simplify the analysis of data collected by portable eye trackers.",
            "Search task performance using subtle gaze direction with the presence of distractions.",
            "On uniform resampling and gaze analysis of bidirectional texture functions.",
            "HMD calibration and its effects on distance judgments.",
            "Auditory self-motion simulation is facilitated by haptic and vibrational cues suggesting the possibility of actual motion.",
            "Guest editorial.",
            "Talking bodies: Sensitivity to desynchronization of conversations.",
            "Screen-space perceptual rendering of human skin.",
            "Perceptual influence of approximate visibility in indirect illumination.",
            "Handling occluders in transitions from panoramic images: A perceptual study.",
            "Perception of differences in natural-image stimuli: Why is peripheral viewing poorer than foveal?"
        ]
    },
    {
        "name": "TAP",
        "year": "2008",
        "info": "Volume 5: 2008",
        "count": 23,
        "papers": [
            "Effectiveness of augmented-reality visualization versus cognitive mediation for learning actions in near space.",
            "Visualizing graphs in three dimensions.",
            "A gaze-based study for investigating the perception of visual realism in simulated scenes.",
            "Enhancing air traffic displays via perceptual cues.",
            "Visual detection of LSB-encoded natural image steganography.",
            "Editorial.",
            "Tactile synthesis and perceptual inverse problems seen from the viewpoint of contact mechanics.",
            "Using haptic cues to aid nonvisual structure recognition.",
            "Applying computational tools to predict gaze direction in interactive visual environments.",
            "Identifying faces across variations in lighting: Psychophysics and computation.",
            "Distinctiveness of faces: A computational approach.",
            "A tone-mapping operator for road visibility experiments.",
            "Data density and trend reversals in auditory graphs: Effects on point-estimation and trend-identification tasks.",
            "A study of the modification of the speed and size of the cursor for simulating pseudo-haptic bumps and holes.",
            "Lead-me interface for a pulling sensation from hand-held devices.",
            "Auditory distance perception in an acoustic pipe.",
            "Recalibration of rotational locomotion in immersive virtual environments.",
            "Guest editorial: Special issue on Applied Perception in Graphics and Visualization (APGV07).",
            "A perceptual approach to trimming and tuning unstructured lumigraphs.",
            "Evaluating the effect of motion and body shape on the perceived sex of virtual characters.",
            "A local roughness measure for 3D meshes and its application to visual masking.",
            "Hybrid image/model-based gaze-contingent rendering.",
            "A perceptive evaluation of volume rendering techniques."
        ]
    },
    {
        "name": "TAP",
        "year": "2007",
        "info": "Volume 4: 2007/2008",
        "count": 24,
        "papers": [
            "Editorial: Walking in real and virtual environments.",
            "Obstacle avoidance during walking in real and virtual environments.",
            "Estimation of travel distance from visual motion in virtual environments.",
            "Calibration of locomotion resulting from visual motion in a treadmill-based virtual environment.",
            "Step frequency and perceived self-motion.",
            "Gender differences in cue preference during path integration in virtual environments.",
            "A feedback-controlled interface for treadmill locomotion in virtual environments.",
            "Heading assessment by \"tunnel vision\" patients and control subjects standing or walking in a virtual reality environment.",
            "Evaluating HDR rendering algorithms.",
            "Discrimination and identification of finger joint-angle position using active motion.",
            "Modeling embodied visual behaviors.",
            "Functional similarities in spatial representations between real and virtual environments.",
            "Development and evaluation of a thermal display for material identification and discrimination.",
            "Guest Editorial.",
            "Perceptual rendering of participating media.",
            "Evaluation of real-world and computer-generated stylized facial expressions.",
            "Perception-based contrast enhancement of images.",
            "Using virtual environments to assess time-to-contact judgments from pedestrian viewpoints.",
            "Categorization of natural scenes: Local versus global information and the role of color.",
            "Perceptual evaluation of tone-reproduction operators using the Cornsweet-Craik-O'Brien illusion.",
            "Content and quality: Interpretation-based estimation of image quality.",
            "Perceptual dependencies in information visualization assessed by complex visual search.",
            "Evaluating the perceptual realism of animated facial expressions.",
            "Evaluation of methods for approximating shapes used to synthesize 3D solid textures."
        ]
    },
    {
        "name": "TAP",
        "year": "2006",
        "info": "Volume 3: 2006",
        "count": 25,
        "papers": [
            "The perceived roughness of resistive virtual textures: I. rendering by a force-feedback mouse.",
            "The perceived roughness of resistive virtual textures: II. effects of varying viscosity with a force-feedback device.",
            "Image retrieval and perceptual similarity.",
            "Detection of electromyographic signals from facial muscles with neural networks.",
            "Face recognition based on polar frequency features.",
            "Simultaneous measurement of steering performance and perceived heading on a curving path.",
            "Perceived quality of compressed stereoscopic images: Effects of symmetric and asymmetric JPEG coding and camera separation.",
            "Evaluation of spatial displays for navigation without sight.",
            "Haptic discrimination of force direction and the influence of visual information.",
            "An application of eyegaze tracking for designing radiologists' workstations: Insights for comparative visual search tasks.",
            "Guest Editorial.",
            "Evaluation of a multiscale color model for visual difference prediction.",
            "Perceptual limits on 2D motion-field visualization.",
            "Cognitive factors can influence self-motion perception (vection) in virtual reality.",
            "Exploring visual and automatic measures of perceptual fidelity in real and simulated imagery.",
            "Object feature validation using visual and haptic similarity ratings.",
            "Sketching shiny surfaces: 3D shape extraction and depiction of specular surfaces.",
            "A perceptual framework for contrast processing of high dynamic range images.",
            "Methods for the assessment of fused images.",
            "A psychophysically plausible model for typicality ranking of natural scenes.",
            "Region-based representations for face recognition.",
            "A perceptually based spectral model for isotropic textures.",
            "A reality check for tone-mapping operators.",
            "Personal space in virtual reality.",
            "Visual calibration and correction for ambient illumination."
        ]
    },
    {
        "name": "TAP",
        "year": "2005",
        "info": "Volume 2: 2005",
        "count": 51,
        "papers": [
            "View changes in augmented reality computer-aided-drawing.",
            "A study of level-of-detail in haptic rendering.",
            "Throwing versus walking as indicators of distance perception in similar real and virtual environments.",
            "Enhancing haptic detection of surface undulation.",
            "EuroHaptics special issue editorial.",
            "Improving human haptic performance in normal and impaired human populations through unattended activation-based learning.",
            "Force constancy and its effect on haptic perception of virtual surfaces.",
            "Waypoint navigation with a vibrotactile waist belt.",
            "First evaluation of a novel tactile display exerting shear force via lateral displacement.",
            "Display of virtual braille dots by lateral skin deformation: feasibility study.",
            "A novel two-dimensional tactile slip display: design, kinematics and perceptual experiments.",
            "HapticWalker - a novel haptic foot device.",
            "Guest Editorial.",
            "Visual cues can be sufficient for triggering automatic, reflexlike spatial updating.",
            "Distance perception in real and virtual environments.",
            "Distance Perception and the Visual Horizon in Head-Mounted Displays.",
            "Manipulating Video Sequences to Determine the Components of Conversational Facial Expressions.",
            "Toward Perceptually Realistic Talking Heads: Models, Methods, and McGurk.",
            "Predicting and Evaluating Saliency for Simplified Polygonal Models.",
            "Collisions and Attention.",
            "Example-Based Color Stylization of Images.",
            "Low-Level Image Cues in the Perception of Translucent Materials.",
            "Sound science: Marking ten international conferences on auditory display.",
            "A perceptual framework for the auditory display of scientific data.",
            "A comprehensive framework for auditory display: Comments on Barrass, ICAD 1994.",
            "Mappings and metaphors in auditory displays: An experimental assessment.",
            "Sonification design and metaphors: Comments on Walker and Kramer, ICAD 1996.",
            "Perceptual plasticity in spatial auditory displays.",
            "Spatial auditory display: Comments on Shinn-Cunningham et al., ICAD 2001.",
            "Optimizing the spatial configuration of a seven-talker speech display.",
            "Optimizing a virtual speech display: Comments on Brungart and Simpson, ICAD 2003.",
            "A principled methodology for the specification and design of nonvisual widgets.",
            "Perceptual auditory design: Comments on Edwards and Mitsopoulos, ICAD 1998.",
            "The design and evaluation of a sonically enhanced tool palette.",
            "Sonically-enhanced widgets: Comments on Brewster and Clarke, ICAD 1997.",
            "Data sonification from the desktop: Should sound be part of standard data analysis software?",
            "Desktop data sonification: Comments on Flowers et al., ICAD 1996.",
            "Musical program auralization: Empirical studies.",
            "Program auralization: Author's comments on Vickers and Alty, ICAD 2000.",
            "After direct manipulation---direct sonification.",
            "Reflections on sonic browsing: Comments on Fernström and McNamara, ICAD 1998.",
            "Data collection and analysis techniques for evaluating the perceptual qualities of auditory stimuli.",
            "Evaluation of auditory displays: Comments on Bonebright et al., ICAD 1998.",
            "Using wavelets to synthesize stochastic-based sounds for immersive virtual environments.",
            "Authors' comments on Miner and Caudell, ICAD 1997.",
            "Physically based models for liquid sounds.",
            "From physics to sound: Comments on van den Doel, ICAD 2004.",
            "Crystallization sonification of high-dimensional datasets.",
            "Model-based sonification revisited---authors' comments on Hermann and Ritter, ICAD 2002.",
            "Comparison of auditory, visual, and audiovisual navigation in a 3D space.",
            "Author's comments on Gröhn, Lokki, and Takala, ICAD 2003."
        ]
    },
    {
        "name": "TAP",
        "year": "2004",
        "info": "Volume 1: 2004",
        "count": 9,
        "papers": [
            "Editorial.",
            "Motion to support rapid interactive queries on node--link diagrams.",
            "EvoFIT: A holistic, evolutionary facial imaging technique for creating composites.",
            "Gazing and frowning as a new human-computer interaction technique.",
            "A multimodal learning interface for grounding spoken language in sensory perceptions.",
            "The effects of subpixel addressing on users' performance and preferences during reading-related tasks.",
            "Numerically estimating internal models of dynamic virtual objects.",
            "Auditory perception of 3D size: Experiments with synthetic resonators.",
            "Understanding concurrent earcons: Applying auditory scene analysis principles to concurrent earcon recognition."
        ]
    }
]