[
    {
        "name": "TEC",
        "year": "2022",
        "info": "Volume 26: 2022",
        "count": 14,
        "papers": [
            "A Visualizable Test Problem Generator for Many-Objective Optimization.",
            "A Review on Convolutional Neural Network Encodings for Neuroevolution.",
            "CoEA: A Cooperative-Competitive Evolutionary Algorithm for Bidirectional Recommendations.",
            "Novel Random Key Encoding Schemes for the Differential Evolution of Permutation Problems.",
            "Searching for Robustness Intervals in Evolutionary Robust Optimization.",
            "Genetic Programming With Niching for Uncertain Capacitated Arc Routing Problem.",
            "Growing and Evolving 3-D Prints.",
            "Elite Archive-Assisted Adaptive Memetic Algorithm for a Realistic Hybrid Differentiation Flowshop Scheduling Problem.",
            "Transfer Learning-Based Parallel Evolutionary Algorithm Framework for Bilevel Optimization.",
            "Evolutionary Machine Learning With Minions: A Case Study in Feature Selection.",
            "Self-Adjusting Multitask Particle Swarm Optimization.",
            "Expensive Multiobjective Evolutionary Optimization Assisted by Dominance Prediction.",
            "Frames-of-Reference-Based Learning: Overcoming Perceptual Aliasing in Multistep Decision-Making Tasks.",
            "A Scalable Many-Objective Pathfinding Benchmark Suite."
        ]
    },
    {
        "name": "TEC",
        "year": "2021",
        "info": "Volume 25: 2021",
        "count": 81,
        "papers": [
            "A Survey on the Hypervolume Indicator in Evolutionary Multiobjective Optimization.",
            "A Grid-Based Inverted Generational Distance for Multi/Many-Objective Optimization.",
            "A Unified Framework of Graph-Based Evolutionary Multitasking Hyper-Heuristic.",
            "Generating Well-Spaced Points on a Unit Simplex for Evolutionary Many-Objective Optimization.",
            "Learning Optimality Theory for Accuracy-Based Learning Classifier Systems.",
            "Investigating the Properties of Indicators and an Evolutionary Many-Objective Algorithm Using Promising Regions.",
            "Genetic Programming With Image-Related Operators and a Flexible Program Structure for Feature Learning in Image Classification.",
            "A Coevolutionary Framework for Constrained Multiobjective Optimization Problems.",
            "Knee Point-Based Imbalanced Transfer Learning for Dynamic Multiobjective Optimization.",
            "Multimodal Multiobjective Evolutionary Optimization With Dual Clustering in Decision and Objective Spaces.",
            "A Multiobjective Evolutionary Algorithm for Finding Knee Regions Using Two Localized Dominance Relationships.",
            "An Efficient Recursive Differential Grouping for Large-Scale Continuous Problems.",
            "Constrained Multiobjective Optimization: Test Problem Construction and Performance Evaluations.",
            "Variable Population Memetic Search: A Case Study on the Critical Node Problem.",
            "A Duplication Analysis-Based Evolutionary Algorithm for Biobjective Feature Selection.",
            "A Classifier-Assisted Level-Based Learning Swarm Optimizer for Expensive Optimization.",
            "Realistic Constrained Multiobjective Optimization Benchmark Problems From Design.",
            "An Evolutionary Multiobjective Framework for Complex Network Reconstruction Using Community Structure.",
            "Regularized Evolutionary Multitask Optimization: Learning to Intertask Transfer in Aligned Subspace.",
            "Multiobjective Evolutionary Design of Deep Convolutional Neural Networks for Image Classification.",
            "Knee-Based Decision Making and Visualization in Many-Objective Optimization.",
            "Frequency Fitness Assignment: Making Optimization Algorithms Invariant Under Bijective Transformations of the Objective Function Value.",
            "MMES: Mixture Model-Based Evolution Strategy for Large-Scale Optimization.",
            "A New Many-Objective Evolutionary Algorithm Based on Determinantal Point Processes.",
            "QED: Using Quality-Environment-Diversity to Evolve Resilient Robot Swarms.",
            "Fitness-Based Linkage Learning in the Real-Valued Gene-Pool Optimal Mixing Evolutionary Algorithm.",
            "Efficient Evolutionary Search of Attention Convolutional Networks via Sampled Training and Node Inheritance.",
            "From Prediction to Prescription: Evolutionary Optimization of Nonpharmaceutical Interventions in the COVID-19 Pandemic.",
            "A Multipopulation Evolutionary Algorithm for Solving Large-Scale Multimodal Multiobjective Optimization Problems.",
            "A Computationally Efficient Evolutionary Algorithm for Multiobjective Network Robustness Optimization.",
            "Preserving Population Diversity Based on Transformed Semantics in Genetic Programming for Symbolic Regression.",
            "Paired Offspring Generation for Constrained Large-Scale Multiobjective Optimization.",
            "Adaptive Multilevel Prediction Method for Dynamic Multimodal Optimization.",
            "SAFE: Scale-Adaptive Fitness Evaluation Method for Expensive Optimization Problems.",
            "A Genetic Programming Approach for Evolving Variable Selectors in Constraint Programming.",
            "Evolutionary Game Analysis Among Three Green-Sensitive Parties in Green Supply Chains.",
            "A Novel Training Protocol for Performance Predictors of Evolutionary Neural Architecture Search Algorithms.",
            "Enhanced Constraint Handling for Reliability-Constrained Multiobjective Testing Resource Allocation.",
            "Correlation Coefficient-Based Recombinative Guidance for Genetic Programming Hyperheuristics in Dynamic Flexible Job Shop Scheduling.",
            "Learnable Evolutionary Search Across Heterogeneous Problems via Kernelized Autoencoding.",
            "Multisource Neighborhood Immune Detector Adaptive Model for Anomaly Detection.",
            "Few-Shots Parallel Algorithm Portfolio Construction via Co-Evolution.",
            "A Survey of Evolutionary Continuous Dynamic Optimization Over Two Decades - Part A.",
            "A Survey of Evolutionary Continuous Dynamic Optimization Over Two Decades - Part B.",
            "Surrogate-Assisted Evolutionary Multitask Genetic Programming for Dynamic Flexible Job Shop Scheduling.",
            "Learning Adaptive Differential Evolution Algorithm From Optimization Experiences by Policy Gradient.",
            "On the Effect of the Cooperation of Indicator-Based Multiobjective Evolutionary Algorithms.",
            "Analysis of Evolutionary Algorithms on Fitness Function With Time-Linkage Property.",
            "Ensemble of Dynamic Resource Allocation Strategies for Decomposition-Based Multiobjective Optimization.",
            "Large-Scale Evolutionary Multiobjective Optimization Assisted by Directed Sampling.",
            "A Dual-Population-Based Evolutionary Algorithm for Constrained Multiobjective Optimization.",
            "Two-Stage Double Niched Evolution Strategy for Multimodal Multiobjective Optimization.",
            "Multiple Penalties and Multiple Local Surrogates for Expensive Constrained Optimization.",
            "Region Encoding Helps Evolutionary Computation Evolve Faster: A New Solution Encoding Scheme in Particle Swarm for Large-Scale Optimization.",
            "Dual-Surrogate-Assisted Cooperative Particle Swarm Optimization for Expensive Multimodal Problems.",
            "Guest Editorial Evolutionary Computation Meets Deep Learning.",
            "Evolving Deep Convolutional Variational Autoencoders for Image Classification.",
            "AS-NAS: Adaptive Scalable Neural Architecture Search With Reinforced Evolutionary Algorithm for Deep Learning.",
            "Task Allocation on Layered Multiagent Systems: When Evolutionary Many-Objective Optimization Meets Deep Q-Learning.",
            "Robust Multimodal Representation Learning With Evolutionary Adversarial Attention Networks.",
            "Convolutional Neural Networks-Based Lung Nodule Classification: A Surrogate-Assisted Evolutionary Algorithm for Hyperparameter Optimization.",
            "Evolutionary Deep Fusion Method and its Application in Chemical Structure Recognition.",
            "A Survey on Evolutionary Construction of Deep Neural Networks.",
            "Adaptive Genetic Algorithm-Aided Neural Network With Channel State Information Tensor Decomposition for Indoor Localization.",
            "Two-Stage Evolutionary Neural Architecture Search for Transfer Learning.",
            "A Fast Kriging-Assisted Evolutionary Algorithm Based on Incremental Learning.",
            "Fast Immune System-Inspired Hypermutation Operators for Combinatorial Optimization.",
            "Solving Mixed Pareto-Lexicographic Multiobjective Optimization Problems: The Case of Priority Levels.",
            "CDE-GAN: Cooperative Dual Evolution-Based Generative Adversarial Network.",
            "Empirical Comparison of Search Heuristics for Genetic Improvement of Software.",
            "A Kriging-Assisted Two-Archive Evolutionary Algorithm for Expensive Many-Objective Optimization.",
            "A Survey of Normalization Methods in Multiobjective Evolutionary Algorithms.",
            "Multitree Genetic Programming With New Operators for Transfer Learning in Symbolic Regression With Incomplete Data.",
            "Weighted Indicator-Based Evolutionary Algorithm for Multimodal Multiobjective Optimization.",
            "Autoencoding With a Classifier System.",
            "Identifying Influential Spreaders in Social Networks Through Discrete Moth-Flame Optimization.",
            "Partial Evaluation Strategies for Expensive Evolutionary Constrained Optimization.",
            "Evolutionary Neural Architecture Search for High-Dimensional Skip-Connection Structures on DenseNet Style Networks.",
            "Set Theory-Based Operator Design in Evolutionary Algorithms for Solving Knapsack Problems.",
            "A Divide-and-Conquer Genetic Programming Algorithm With Ensembles for Image Classification.",
            "Statistical Models for the Analysis of Optimization Algorithms With Benchmark Functions."
        ]
    },
    {
        "name": "TEC",
        "year": "2020",
        "info": "Volume 24: 2020",
        "count": 85,
        "papers": [
            "Scaling Up Dynamic Optimization Problems: A Divide-and-Conquer Approach.",
            "Self-Regulated Evolutionary Multitask Optimization.",
            "Utilizing the Correlation Between Constraints and Objective Function for Constrained Evolutionary Optimization.",
            "Tackling Large-Scale and Combinatorial Bi-Level Problems With a Genetic Programming Hyper-Heuristic.",
            "A Theoretical Guideline for Designing an Effective Adaptive Particle Swarm.",
            "Multifactorial Evolutionary Algorithm With Online Transfer Parameter Estimation: MFEA-II.",
            "Toward a Matrix-Free Covariance Matrix Adaptation Evolution Strategy.",
            "A Many-Objective Evolutionary Algorithm With Pareto-Adaptive Reference Points.",
            "Automatic Niching Differential Evolution With Contour Prediction Approach for Multimodal Optimization Problems.",
            "A Graph-Based Fuzzy Evolutionary Algorithm for Solving Two-Echelon Vehicle Routing Problems.",
            "A Similarity-Based Cooperative Co-Evolutionary Algorithm for Dynamic Interval Multiobjective Optimization Problems.",
            "Toward Efficient Design Space Exploration for Fault-Tolerant Multiprocessor Systems.",
            "Multiple Reference Points-Based Decomposition for Multiobjective Feature Selection in Classification: Static and Dynamic Mechanisms.",
            "R2-Based Hypervolume Contribution Approximation.",
            "A Review of Evolutionary Multimodal Multiobjective Optimization.",
            "A Survey of Automatic Parameter Tuning Methods for Metaheuristics.",
            "Evolutionary Collaborative Human-UAV Search for Escaped Criminals.",
            "Evolutionary Development of Growing Generic Sorting Networks by Means of Rewriting Systems.",
            "Enhancing Decomposition-Based Algorithms by Estimation of Distribution for Constrained Optimal Software Product Selection.",
            "Novel Prediction Strategies for Dynamic Multiobjective Optimization.",
            "An Experimental Method to Estimate Running Time of Evolutionary Algorithms for Continuous Optimization.",
            "A Multimodel Prediction Method for Dynamic Multiobjective Evolutionary Optimization.",
            "Evolutionary Dynamic Multiobjective Optimization Assisted by a Support Vector Regression Predictor.",
            "Decomposition-Based Interactive Evolutionary Algorithm for Multiple Objective Optimization.",
            "Parameter-Free Voronoi Neighborhood for Evolutionary Multimodal Optimization.",
            "Surrogate-Assisted Evolutionary Deep Learning Using an End-to-End Random Forest-Based Performance Predictor.",
            "Efficient Generalized Surrogate-Assisted Evolutionary Algorithm for High-Dimensional Expensive Problems.",
            "An Evolutionary Algorithm for Large-Scale Sparse Multiobjective Optimization Problems.",
            "Evolving Deep Convolutional Neural Networks for Image Classification.",
            "Offline Data-Driven Multiobjective Optimization: Knowledge Transfer Between Surrogates and Generation of Final Solutions.",
            "Multisource Selective Transfer Framework in Multiobjective Optimization Problems.",
            "Adapting Reference Vectors and Scalarizing Functions by Growing Neural Gas to Handle Irregular Pareto Fronts.",
            "Feature Extraction and Selection for Parsimonious Classifiers With Multiobjective Genetic Programming.",
            "Data Structures for Direct Spanning Tree Representations in Mutation-Based Evolutionary Algorithms.",
            "An Estimation of Distribution Algorithm for Mixed-Variable Newsvendor Problems.",
            "Evolutionary Multiobjective Optimization With Robustness Enhancement.",
            "A Niching Memetic Algorithm for Multi-Solution Traveling Salesman Problem.",
            "Evolutionary Network Embedding Preserving Both Local Proximity and Community Structure.",
            "Underestimation-Assisted Global-Local Cooperative Differential Evolution and the Application to Protein Structure Prediction.",
            "Handling Imbalance Between Convergence and Diversity in the Decision Space in Evolutionary Multimodal Multiobjective Optimization.",
            "A Divide-and-Conquer Evolutionary Algorithm for Large-Scale Virtual Network Embedding.",
            "Runtime Analysis of Crowding Mechanisms for Multimodal Optimization.",
            "Analysis of the $(\\mu/\\mu_{I}, \\lambda)-\\sigma$ -Self-Adaptation Evolution Strategy With Repair by Projection Applied to a Conically Constrained Problem.",
            "Understanding Hypervolume Behavior Theoretically for Benchmarking in Evolutionary Multi/Many-Objective Optimization.",
            "Evolutionary Black-Box Topology Optimization: Challenges and Promises.",
            "A Survey of Weight Vector Adjustment Methods for Decomposition-Based Multiobjective Evolutionary Algorithms.",
            "Self-Adaptation in Nonelitist Evolutionary Algorithms on Discrete Problems With Unknown Structure.",
            "Efficacy of the Metropolis Algorithm for the Minimum-Weight Codeword Problem Using Codeword and Generator Search Spaces.",
            "A Data-Driven Parallel Scheduling Approach for Multiple Agile Earth Observation Satellites.",
            "Distributed Pareto Optimization for Large-Scale Noisy Subset Selection.",
            "Distributed Individuals for Multiple Peaks: A Novel Differential Evolution for Multimodal Optimization Problems.",
            "A Framework to Handle Multimodal Multiobjective Optimization in Decomposition-Based Evolutionary Algorithms.",
            "Surrogate-Assisted Robust Optimization of Large-Scale Networks Based on Graph Embedding.",
            "Novel Interactive Preference-Based Multiobjective Evolutionary Optimization for Bolt Supporting Networks.",
            "MUMI: Multitask Module Identification for Biological Networks.",
            "Paradoxes in Numerical Comparison of Optimization Algorithms.",
            "A Novel Evolutionary Algorithm for Dynamic Constrained Multiobjective Optimization Problems.",
            "Erratum to \"R2-Based Hypervolume Contribution Approximation\".",
            "Approximating Complex Pareto Fronts With Predefined Normal-Boundary Intersection Directions.",
            "Multiobjective Multitasking Optimization Based on Incremental Learning.",
            "A New Hypervolume-Based Evolutionary Algorithm for Many-Objective Optimization.",
            "An Analysis of Quality Indicators Using Approximated Optimal Distributions in a 3-D Objective Space.",
            "Evolutionary Large-Scale Multiobjective Optimization for Ratio Error Estimation of Voltage Transformers.",
            "Variable-Size Cooperative Coevolutionary Particle Swarm Optimization for Feature Selection on High-Dimensional Data.",
            "Combining Simple and Adaptive Monte Carlo Methods for Approximating Hypervolume.",
            "A Multifactorial Evolutionary Algorithm for Multitasking Under Interval Uncertainties.",
            "Boosting Data-Driven Evolutionary Algorithm With Localized Data Generation.",
            "A Constrained Multiobjective Evolutionary Algorithm With Detect-and-Escape Strategy.",
            "Limit-Cycle-Based Mutant Multiobjective Pigeon-Inspired Optimization.",
            "Specializing Context-Free Grammars With a (1 + 1)-EA.",
            "Multiobjective Evolution Strategy for Dynamic Multiobjective Optimization.",
            "Guest Editorial Special Issue on Theoretical Foundations of Evolutionary Computation.",
            "A General Dichotomy of Evolutionary Algorithms on Monotone Functions.",
            "Parallel Black-Box Complexity With Tail Bounds.",
            "Significance-Based Estimation-of-Distribution Algorithms.",
            "Finite-Sample Analysis of Information Geometric Optimization With Isotropic Gaussian Distribution on Convex Quadratic Functions.",
            "Population Diversity of Nonelitist Evolutionary Algorithms in the Exploration Phase.",
            "Landscape-Aware Performance Prediction for Evolutionary Multiobjective Optimization.",
            "Does Preference Always Help? A Holistic Study on Preference-Based Evolutionary Multiobjective Optimization Using Reference Points.",
            "Empirical Linkage Learning.",
            "A Hybrid Deep Grouping Algorithm for Large Scale Global Optimization.",
            "Binary Relation Learning and Classifying for Preselection in Evolutionary Algorithms.",
            "Sharp Bounds for Genetic Drift in Estimation of Distribution Algorithms.",
            "A Framework for Scalable Bilevel Optimization: Identifying and Utilizing the Interactions Between Upper-Level and Lower-Level Variables.",
            "Characterizing Genetic Programming Error Through Extended Bias and Variance Decomposition."
        ]
    },
    {
        "name": "TEC",
        "year": "2019",
        "info": "Volume 23: 2019",
        "count": 76,
        "papers": [
            "An Adaptive Estimation of Distribution Algorithm for Multipolicy Insurance Investment Planning.",
            "Multiproblem Surrogates: Transfer Evolutionary Multiobjective Optimization of Computationally Expensive Problems.",
            "An Evolution Path-Based Reproduction Operator for Many-Objective Optimization.",
            "Generalized Multitasking for Evolutionary Optimization of Expensive Problems.",
            "A Learning Automata-Based Multiobjective Hyper-Heuristic.",
            "A Classification-Based Surrogate-Assisted Evolutionary Algorithm for Expensive Many-Objective Optimization.",
            "Evolving Unsupervised Deep Neural Networks for Learning Meaningful Representations.",
            "A Taxonomy for Metamodeling Frameworks for Evolutionary Multiobjective Optimization.",
            "Synthesis of Constraints for Mathematical Programming With One-Class Genetic Programming.",
            "A Review of Features and Limitations of Existing Scalable Multiobjective Test Suites.",
            "Robust Optimization Over Time by Learning Problem Space Characteristics.",
            "Multiobjective Metaheuristic to Design RNA Sequences.",
            "IGD Indicator-Based Evolutionary Algorithm for Many-Objective Optimization Problems.",
            "Distributed Cooperative Co-Evolution With Adaptive Computing Resource Allocation for Large Scale Optimization.",
            "Offline Data-Driven Evolutionary Optimization Using Selective Surrogate Ensembles.",
            "On Scalable Multiobjective Test Problems With Hardly Dominated Boundaries.",
            "Low-Dimensional Euclidean Embedding for Visualization of Search Spaces in Combinatorial Optimization.",
            "Adaptive Sorting-Based Evolutionary Algorithm for Many-Objective Optimization.",
            "Evolutionary Bilevel Optimization Based on Covariance Matrix Adaptation.",
            "New Sampling Strategies When Searching for Robust Solutions.",
            "Decomposition-Based Evolutionary Multiobjective Optimization to Self-Paced Learning.",
            "Two-Archive Evolutionary Algorithm for Constrained Multiobjective Optimization.",
            "Robust Multiobjective Optimization via Evolutionary Algorithms.",
            "A Strengthened Dominance Relation Considering Convergence and Diversity for Evolutionary Many-Objective Optimization.",
            "$I_{\\rm SDE}$ + - An Indicator for Multi and Many-Objective Optimization.",
            "Large Scale Black-Box Optimization by Limited-Memory Matrix Adaptation.",
            "Evolutionary Many-Objective Optimization Based on Dynamical Decomposition.",
            "Learning to Decompose: A Paradigm for Decomposition-Based Multiobjective Optimization.",
            "A Clustering-Based Evolutionary Algorithm for Many-Objective Optimization Problems.",
            "Memetic Evolution for Generic Full-Body Inverse Kinematics in Robotics and Animation.",
            "A Survey on Cooperative Co-Evolutionary Algorithms.",
            "Data-Driven Evolutionary Optimization: An Overview and Case Studies.",
            "Multiobjective Infill Criterion Driven Gaussian Process-Assisted Particle Swarm Optimization of High-Dimensional Expensive Problems.",
            "Variable-Length Particle Swarm Optimization for Feature Selection on High-Dimensional Classification.",
            "Improving Generalization of Genetic Programming for Symbolic Regression With Angle-Driven Geometric Semantic Operators.",
            "Multiphase Balance of Diversity and Convergence in Multiobjective Optimization.",
            "A Covariance Matrix Self-Adaptation Evolution Strategy for Optimization Under Linear Constraints.",
            "A Scalable Indicator-Based Evolutionary Algorithm for Large-Scale Multiobjective Optimization.",
            "Learning From a Stream of Nonstationary and Dependent Data in Multiobjective Evolutionary Optimization.",
            "A Generator for Multiobjective Test Problems With Difficult-to-Approximate Pareto Front Boundaries.",
            "A Many-Objective Evolutionary Algorithm With Two Interacting Processes: Cascade Clustering and Reference Point Incremental Learning.",
            "Coevolutionary Particle Swarm Optimization With Bottleneck Objective Learning Strategy for Many-Objective Optimization.",
            "Quality Diversity Through Surprise.",
            "ACO-A*: Ant Colony Optimization Plus A* for 3-D Traveling in Environments With Dense Obstacles.",
            "A Novel Particle Swarm Optimization Approach for Patient Clustering From Emergency Departments.",
            "An Effective Ensemble Framework for Multiobjective Optimization.",
            "A Multimodal Multiobjective Evolutionary Algorithm Using Two-Archive and Recombination Strategies.",
            "A Bio-Inspired Self-Learning Coevolutionary Dynamic Multiobjective Optimization Algorithm for Internet of Things Services.",
            "Impact of Communication Topology in Particle Swarm Optimization.",
            "Structural Risk Minimization-Driven Genetic Programming for Enhancing Generalization in Symbolic Regression.",
            "Comprehensive Learning Particle Swarm Optimization Algorithm With Local Search for Multimodal Functions.",
            "Evolutionary Multitasking Sparse Reconstruction: Framework and Case Study.",
            "A New Two-Stage Evolutionary Algorithm for Many-Objective Optimization.",
            "Solving Incremental Optimization Problems via Cooperative Coevolution.",
            "A Memetic Algorithm Based on an NSGA-II Scheme for Phylogenetic Tree Inference.",
            "ar-MOEA: A Novel Preference-Based Dominance Relation for Evolutionary Multiobjective Optimization.",
            "Bi-Phase Evolutionary Searching for Biclusters in Gene Expression Data.",
            "A Novel Evolutionary Sampling Assisted Optimization Method for High-Dimensional Expensive Problems.",
            "One Pixel Attack for Fooling Deep Neural Networks.",
            "A Cooperative Co-Evolutionary Approach to Large-Scale Multisource Water Distribution Network Optimization.",
            "Evolutionary Multitasking With Dynamic Resource Allocating Strategy.",
            "Handling Constrained Multiobjective Optimization Problems With Constraints in Both the Decision and Objective Spaces.",
            "Optimal-Margin Evolutionary Classifier.",
            "Dynamic Influence on Replicator Evolution for the Propagation of Competing Technologies.",
            "Distance-Based Subset Selection for Benchmarking in Evolutionary Multi/Many-Objective Optimization.",
            "Approximating Hypervolume and Hypervolume Contributions Using Polar Coordinate.",
            "Evolutionary Generative Adversarial Networks.",
            "Dynamic Cooperative Coevolution for Large Scale Optimization.",
            "Accelerating Large-Scale Multiobjective Optimization via Problem Reformulation.",
            "Evolutionary n-Level Hypergraph Partitioning With Adaptive Coarsening.",
            "Evolutionary Constrained Multiobjective Optimization: Test Suite Construction and Performance Comparisons.",
            "Variable-Length Pareto Optimization via Decomposition-Based Evolutionary Multiobjective Algorithm.",
            "A Multiple Surrogate Assisted Decomposition-Based Evolutionary Algorithm for Expensive Multi/Many-Objective Optimization.",
            "Solving the Latin Square Completion Problem by Memetic Graph Coloring.",
            "A Survey of Statistical Machine Learning Elements in Genetic Programming.",
            "Framework of Evolutionary Algorithm for Investigation of Influential Nodes in Complex Networks."
        ]
    },
    {
        "name": "TEC",
        "year": "2018",
        "info": "Volume 22: 2018",
        "count": 65,
        "papers": [
            "Guest Editorial Evolutionary Many-Objective Optimization.",
            "Localized Weighted Sum Method for Many-Objective Optimization.",
            "On the Performance Degradation of Dominance-Based Evolutionary Algorithms in Many-Objective Optimization.",
            "Particle Swarm Optimization With a Balanceable Fitness Estimation for Many-Objective Optimization Problems.",
            "A Set-Based Genetic Algorithm for Interval Many-Objective Optimization Problems.",
            "Multiline Distance Minimization: A Visualized Many-Objective Test Problem Suite.",
            "A Scalability Study of Many-Objective Optimization Algorithms.",
            "A Decision Variable Clustering-Based Evolutionary Algorithm for Large-Scale Many-Objective Optimization.",
            "An Energy Efficient Ant Colony System for Virtual Machine Placement in Cloud Computing.",
            "A Surrogate-Assisted Reference Vector Guided Evolutionary Algorithm for Computationally Expensive Many-Objective Optimization.",
            "Turning High-Dimensional Optimization Into Computationally Expensive Optimization.",
            "Dynamic Multiobjectives Optimization With a Changing Number of Objectives.",
            "Cooperative Co-Evolution-Based Design Optimization: A Concurrent Engineering Perspective.",
            "Objective Reduction in Many-Objective Optimization: Evolutionary Multiobjective Approaches and Comprehensive Analysis.",
            "Self-Organizing Map-Based Weight Design for Decomposition-Based Many-Objective Evolutionary Algorithm.",
            "On Tchebycheff Decomposition Approaches for Multiobjective Evolutionary Optimization.",
            "Quality and Diversity Optimization: A Unifying Modular Framework.",
            "A Framework for Large-Scale Multiobjective Optimization Based on Problem Transformation.",
            "A Review on Bilevel Optimization: From Classical to Evolutionary Approaches and Applications.",
            "Scalarizing Functions in Decomposition-Based Multiobjective Evolutionary Algorithms.",
            "Evolution of Repertoire-Based Control for Robots With Complex Locomotor Systems.",
            "Guest Editorial Special Issue on Search-Based Software Engineering.",
            "Constructing Cost-Aware Functional Test-Suites Using Nested Differential Evolution Algorithm.",
            "Multiobjective Testing Resource Allocation Under Uncertainty.",
            "Achieving Feature Location in Families of Models Through the Use of Search-Based Software Engineering.",
            "Integrating Weight Assignment Strategies With NSGA-II for Supporting User Preference Multiobjective Optimization.",
            "An Empirical Study of Cohesion and Coupling: Balancing Optimization and Disruption.",
            "Genetic Improvement of Software: A Comprehensive Survey.",
            "Adaptively Allocating Search Effort in Challenging Many-Objective Optimization Problems.",
            "Computing and Updating Hypervolume Contributions in Up to Four Dimensions.",
            "Evolutionary Computation for Community Detection in Networks: A Review.",
            "Escaping Local Optima Using Crossover With Emergent Diversity.",
            "Transfer Learning-Based Dynamic Multiobjective Optimization Algorithms.",
            "An Improved and More Scalable Evolutionary Approach to Multiobjective Clustering.",
            "Evolutionary Algorithms for Finding Nash Equilibria in Electricity Markets.",
            "Population Evolvability: Dynamic Fitness Landscape Analysis for Population-Based Metaheuristic Algorithms.",
            "A Constrained Decomposition Approach With Grids for Evolutionary Multiobjective Optimization.",
            "A Level-Based Learning Swarm Optimizer for Large-Scale Optimization.",
            "Constrained Monotone k-Submodular Function Maximization Using Multiobjective Evolutionary Algorithms With Theoretical Guarantee.",
            "An Indicator-Based Multiobjective Evolutionary Algorithm With Reference Point Adaptation for Better Versatility.",
            "Using Centroidal Voronoi Tessellations to Scale Up the Multidimensional Archive of Phenotypic Elites Algorithm.",
            "A Simple Yet Efficient Evolution Strategy for Large-Scale Black-Box Optimization.",
            "A Recursive Decomposition Method for Large Scale Continuous Optimization.",
            "Improved Regularity Model-Based EDA for Many-Objective Optimization.",
            "Loser-Out Tournament-Based Fireworks Algorithm for Multimodal Function Optimization.",
            "Evolutionary Multiobjective Optimization-Based Multimodal Optimization: Fitness Landscape Approximation and Peak Detection.",
            "Level-Based Analysis of Genetic Algorithms and Other Search Processes.",
            "Standard Steady State Genetic Algorithms Can Hillclimb Faster Than Mutation-Only Evolutionary Algorithms.",
            "Genetic Programming With Mixed-Integer Linear Programming-Based Library Search.",
            "NK Hybrid Genetic Algorithm for Clustering.",
            "A Divide-and-Conquer-Based Ensemble Classifier Learning by Means of Many-Objective Optimization.",
            "ND-Tree-Based Update: A Fast Algorithm for the Dynamic Nondominance Problem.",
            "Schema Theory-Based Data Engineering in Gene Expression Programming for Big Data Analytics.",
            "A Multiobjective Particle Swarm Optimizer Using Ring Topology for Solving Multimodal Multiobjective Problems.",
            "R-Metric: Evaluating the Performance of Preference-Based Evolutionary Multiobjective Optimization Using Reference Points.",
            "A Generic Test Suite for Evolutionary Multifidelity Optimization.",
            "Coevolutionary Multiobjective Evolutionary Algorithms: Survey of the State-of-the-Art.",
            "A Networked N-Player Trust Game and Its Evolutionary Dynamics.",
            "Multiobjective Frog-Leaping Optimization for the Study of Ancestral Relationships in Protein Data.",
            "Dual-Strategy Differential Evolution With Affinity Propagation Clustering for Multimodal Optimization Problems.",
            "A Novel Class of Test Problems for Performance Evaluation of Niching Methods.",
            "Handling Multiple Scenarios in Evolutionary Multiobjective Numerical Optimization.",
            "Dynamic Team Heterogeneity in Cooperative Coevolutionary Algorithms.",
            "Evolutionary Fault Tolerance Method Based on Virtual Reconfigurable Circuit With Neural Network Architecture.",
            "Reference Point Specification in Inverted Generational Distance for Triangular Linear Pareto Front."
        ]
    },
    {
        "name": "TEC",
        "year": "2017",
        "info": "Volume 21: 2017",
        "count": 61,
        "papers": [
            "Necessary and Sufficient Conditions for Surrogate Functions of Pareto Frontiers and Their Synthesis Using Gaussian Processes.",
            "Continuous Dynamic Constrained Optimization With Ensemble of Locating and Tracking Feasible Regions Strategies.",
            "Ranking Vectors by Means of the Dominance Degree Matrix.",
            "Efficient Use of Partially Converged Simulations in Evolutionary Optimization.",
            "A Steady-State and Generational Evolutionary Algorithm for Dynamic Multiobjective Optimization.",
            "Automatically Evolving Rotation-Invariant Texture Image Descriptors by Genetic Programming.",
            "Structured Memetic Automation for Online Human-Like Social Behavior Learning.",
            "Artificial Immune System With Local Feature Selection for Short-Term Load Forecasting.",
            "A Vector Angle-Based Evolutionary Algorithm for Unconstrained Many-Objective Optimization.",
            "The Effect of Information Utilization: Introducing a Novel Guiding Spark in the Fireworks Algorithm.",
            "Performance of Decomposition-Based Many-Objective Algorithms Strongly Depends on Pareto Front Shapes.",
            "Adaptive Multimodal Continuous Ant Colony Optimization.",
            "Optimal Computing Budget Allocation for Particle Swarm Optimization in Stochastic Optimization.",
            "Many-Objective Evolutionary Algorithms Based on Coordinated Selection Strategy.",
            "A Multiobjective Cooperative Coevolutionary Algorithm for Hyperspectral Sparse Unmixing.",
            "Quantifying Variable Interactions in Continuous Optimization Problems.",
            "A Novel Image Representation Framework Based on Gaussian Model and Evolutionary Optimization.",
            "Factored Evolutionary Algorithms.",
            "A Classification and Comparison of Credit Assignment Strategies in Multiobjective Adaptive Operator Selection.",
            "Heterogeneous Cooperative Co-Evolution Memetic Differential Evolution Algorithm for Big Data Optimization Problems.",
            "A Strength Pareto Evolutionary Algorithm Based on Reference Direction for Multiobjective and Many-Objective Optimization.",
            "Toward Fast Niching Evolutionary Algorithms: A Locality Sensitive Hashing-Based Approach.",
            "A Maximal Clique Based Multiobjective Evolutionary Algorithm for Overlapping Community Detection.",
            "Impacts of Coefficients on Movement Patterns in the Particle Swarm Optimization Algorithm.",
            "Shape Optimization With Surface-Mapped CPPNs.",
            "Investigating the Effect of Imbalance Between Convergence and Diversity in Evolutionary Multiobjective Algorithms.",
            "Average Drift Analysis and Population Scalability.",
            "A Survey of Multiobjective Evolutionary Algorithms Based on Decomposition.",
            "How to Pack Trapezoids: Exact and Evolutionary Algorithms.",
            "The Compact Genetic Algorithm is Efficient Under Extreme Gaussian Noise.",
            "Efficient Resource Allocation in Cooperative Co-Evolution for Large-Scale Global Optimization.",
            "Changing the Intensity of Interaction Based on Individual Behavior in the Iterated Prisoner's Dilemma Game.",
            "Seeking Multiple Solutions: An Updated Survey on Niching Methods and Their Applications.",
            "Improving Diversity in Evolutionary Algorithms: New Best Solutions for Frequency Assignment.",
            "Matching-Based Selection With Incomplete Lists for Decomposition Multiobjective Optimization.",
            "Cross-Domain Reuse of Extracted Knowledge in Genetic Programming for Image Classification.",
            "Personalized Search Inspired Fast Interactive Estimation of Distribution Algorithm and Its Application.",
            "An Evolutionary Transfer Reinforcement Learning Framework for Multiagent Systems.",
            "Stochastic Runtime Analysis of the Cross-Entropy Algorithm.",
            "Toward a Steady-State Analysis of an Evolution Strategy on a Robust Optimization Problem With Noise-Induced Multimodality.",
            "Surrogate-Assisted Cooperative Swarm Optimization of High-Dimensional Expensive Problems.",
            "A Two-Phase Differential Evolution for Uniform Designs in Constrained Experimental Domains.",
            "A Surrogate Assisted Approach for Single-Objective Bilevel Optimization.",
            "A Weighted Biobjective Transformation Technique for Locating Multiple Optimal Solutions of Nonlinear Equation Systems.",
            "DMOEA-εC: Decomposition-Based Multiobjective Evolutionary Algorithm With the ε-Constraint Framework.",
            "Opposition-Based Memetic Search for the Maximum Diversity Problem.",
            "Simplify Your Covariance Matrix Adaptation Evolution Strategy.",
            "Autoencoding Evolutionary Search With Learning Across Heterogeneous Problems.",
            "An Adaptive Convergence-Trajectory Controlled Ant Colony Optimization Algorithm With Application to Water Distribution System Design Problems.",
            "Feature Selection to Improve Generalization of Genetic Programming for High-Dimensional Symbolic Regression.",
            "Improving Evolutionary Algorithms in a Continuous Domain by Monitoring the Population Midpoint.",
            "Bridging the Gap: Many-Objective Optimization and Informed Decision-Making.",
            "Keypoints Detection and Feature Extraction: A Dynamic Genetic Programming Approach for Evolving Rotation-Invariant Texture Image Descriptors.",
            "On Partitioning Multivariate Self-Affine Time Series.",
            "An Evolutionary Multiobjective Model and Instance Selection for Support Vector Machines With Pareto-Based Ensembles.",
            "A Similarity-Based Multiobjective Evolutionary Algorithm for Deployment Optimization of Near Space Communication System.",
            "Expected Improvement of Penalty-Based Boundary Intersection for Expensive Multiobjective Optimization.",
            "Combination of Video Change Detection Algorithms by Genetic Programming.",
            "DG2: A Faster and More Accurate Differential Grouping for Large-Scale Black-Box Optimization.",
            "A Platform That Directly Evolves Multirotor Controllers.",
            "Expected Improvement Matrix-Based Infill Criteria for Expensive Multiobjective Optimization."
        ]
    },
    {
        "name": "TEC",
        "year": "2016",
        "info": "Volume 20: 2016",
        "count": 65,
        "papers": [
            "Memetic Music Composition.",
            "A New Dominance Relation-Based Evolutionary Algorithm for Many-Objective Optimization.",
            "A Genetic Bankrupt Ratio Analysis Tool Using a Genetic Algorithm to Identify Influencing Financial Ratios.",
            "Are All the Subproblems Equally Important? Resource Allocation in Decomposition-Based Multiobjective Evolutionary Algorithms.",
            "Self-Learning Gene Expression Programming.",
            "Recursion-Based Biases in Stochastic Grammar Model Genetic Programming.",
            "Estimation of the Distribution Algorithm With a Stochastic Local Search for Uncertain Capacitated Arc Routing Problems.",
            "Automated Design of Production Scheduling Heuristics: A Review.",
            "Memetic Viability Evolution for Constrained Optimization.",
            "Many-Objective Evolutionary Algorithm: Objective Space Reduction and Diversity Improvement.",
            "A Tunable Generator of Instances of Permutation-Based Combinatorial Optimization Problems.",
            "Balancing Convergence and Diversity in Decomposition-Based Many-Objective Optimizers.",
            "Solving Bilevel Multicriterion Optimization Problems With Lower Level Decision Uncertainty.",
            "Leveraged Neighborhood Restructuring in Cultural Algorithms for Solving Real-World Numerical Optimization Problems.",
            "Adaptive Cross-Generation Differential Evolution Operators for Multiobjective Optimization.",
            "Simple Probabilistic Population-Based Optimization.",
            "Tunably Rugged Landscapes With Known Maximum and Minimum.",
            "A Multiobjective Evolutionary Algorithm Based on Decision Variable Analyses for Multiobjective Optimization Problems With Large-Scale Variables.",
            "Generalization of Pareto-Optimality for Many-Objective Evolutionary Optimization.",
            "Average Convergence Rate of Evolutionary Algorithms.",
            "Call for nominations / Applications for the position of the Editor-in-Chief of IEEE Transactions on Emerging Topics in Computational Intelligence.",
            "A Modified Ant Colony Optimization Algorithm for Network Coding Resource Minimization.",
            "Multifactorial Evolution: Toward Evolutionary Multitasking.",
            "A Unified Evolutionary Optimization Procedure for Single, Multiple, and Many Objectives.",
            "Analysis of Stability, Local Convergence, and Transformation Sensitivity of a Variant of the Particle Swarm Optimization Algorithm.",
            "Visualization and Performance Metric in Many-Objective Optimization.",
            "Automatic Component-Wise Design of Multiobjective Evolutionary Algorithms.",
            "A Sparse Spectral Clustering Framework via Multiobjective Evolutionary Algorithm.",
            "The Permutation in a Haystack Problem and the Calculus of Search Landscapes.",
            "Constraint Consensus Mutation-Based Differential Evolution for Constrained Optimization.",
            "Computing Nash Equilibria and Evolutionarily Stable States of Evolutionary Games.",
            "The N-Player Trust Game and its Replicator Dynamics.",
            "Constrained Subproblems in a Decomposition-Based Multiobjective Evolutionary Algorithm.",
            "Entropy-Based Termination Criterion for Multiobjective Evolutionary Algorithms.",
            "A Hybrid Multiobjective Memetic Metaheuristic for Multiple Sequence Alignment.",
            "An Optimality Theory-Based Proximity Measure for Set-Based Multiobjective Optimization.",
            "The Effects of Developer Dynamics on Fitness in an Evolutionary Ecosystem Model of the App Store.",
            "Subpermutation-Based Evolutionary Multiobjective Algorithm for Load Restoration in Power Distribution Networks.",
            "A Primary Theoretical Study on Decomposition-Based Multiobjective Evolutionary Algorithms.",
            "Discrete Planar Truss Optimization by Node Position Variation Using Grammatical Evolution.",
            "An Adaptive Multipopulation Framework for Locating and Tracking Multiple Optima.",
            "A Survey on Evolutionary Computation Approaches to Feature Selection.",
            "An Enhanced Genetic Algorithm for Ab Initio Protein Structure Prediction.",
            "Pareto or Non-Pareto: Bi-Criterion Evolution in Multiobjective Optimization.",
            "An Analysis of the Inertia Weight Parameter for Binary Particle Swarm Optimization.",
            "Algebraic Differential Evolution Algorithm for the Permutation Flowshop Scheduling Problem With Total Flowtime Criterion.",
            "Kuhn-Munkres Parallel Genetic Algorithm for the Set Cover Problem and Its Application to Large-Scale Wireless Sensor Networks.",
            "A Hybrid Evolutionary Immune Algorithm for Multiobjective Optimization Problems.",
            "Metaheuristics for Specialization of a Segmentation Algorithm for Ultrasound Images.",
            "On Routine Evolution of Complex Cellular Automata.",
            "Objective Extraction for Many-Objective Optimization Problems: Algorithm and Test Problems.",
            "A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization.",
            "A Self-Organizing Multiobjective Evolutionary Algorithm.",
            "Pareto Fronts of Many-Objective Degenerate Test Problems.",
            "Stability Analysis of the Particle Swarm Optimization Without Stagnation Assumption.",
            "Decomposition-Based Algorithms Using Pareto Adaptive Scalarizing Methods.",
            "Adaptive Multisubpopulation Competition and Multiniche Crowding-Based Memetic Algorithm for Automatic Data Clustering.",
            "A Cooperative Control Framework for a Collective Decision on Movement Behaviors of Particles.",
            "Cooperative Co-Evolutionary Module Identification With Application to Cancer Disease Module Discovery.",
            "An Effective Hybrid Memetic Algorithm for the Minimum Weight Dominating Set Problem.",
            "Memetic Search for the Generalized Quadratic Multiple Knapsack Problem.",
            "Stochastic Ranking Algorithm for Many-Objective Optimization Based on Multiple Indicators.",
            "Data-Driven Surrogate-Assisted Multiobjective Evolutionary Optimization of a Trauma System.",
            "Accuracy-Based Learning Classifier Systems for Multistep Reinforcement Learning: A Fuzzy Logic Approach to Handling Continuous Inputs and Learning Continuous Actions.",
            "Minimum Manhattan Distance Approach to Multiple Criteria Decision Making in Multiobjective Optimization Problems."
        ]
    },
    {
        "name": "TEC",
        "year": "2015",
        "info": "Volume 19: 2015",
        "count": 58,
        "papers": [
            "Adaptive Multiobjective Particle Swarm Optimization Based on Parallel Cell Coordinate System.",
            "Characterization of the Performance of Memetic Algorithms for the Automation of Bone Tracking With Fluoroscopy.",
            "Enhancing Differential Evolution Utilizing Eigenvector-Based Crossover Operator.",
            "A New Local Search-Based Multiobjective Optimization Algorithm.",
            "Exploratory Landscape Analysis of Continuous Space Optimization Problems Using Information Content.",
            "Learning Value Functions in Interactive Evolutionary Multiobjective Optimization.",
            "The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems.",
            "Optimizing Existing Software With Genetic Programming.",
            "History-Based Topological Speciation for Multimodal Optimization.",
            "Intelligent Bandwidth Estimation for Variable Bit Rate Traffic.",
            "Tikhonov Regularization as a Complexity Measure in Multiobjective Genetic Programming.",
            "Parameter Control in Evolutionary Algorithms: Trends and Challenges.",
            "Convex Hull-Based Multiobjective Genetic Programming for Maximizing Receiver Operating Characteristic Performance.",
            "An Efficient Approach to Nondominated Sorting for Evolutionary Multiobjective Optimization.",
            "Probabilistic Dominance in Multiobjective Reliability-Based Optimization: Theory and Implementation.",
            "Visualization of Pareto Front Approximations in Evolutionary Multiobjective Optimization: A Critical Review and the Prosection Method.",
            "Inducing Niching Behavior in Differential Evolution Through Local Information Sharing.",
            "Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems.",
            "Toward the Coevolution of Novel Vertical-Axis Wind Turbines.",
            "On the Easiest and Hardest Fitness Functions.",
            "Automatic Design of a Hyper-Heuristic Framework With Gene Expression Programming for Combinatorial Optimization Problems.",
            "Semantic Backpropagation for Designing Search Operators in Genetic Programming.",
            "Tuning Optimization Algorithms Under Multiple Objective Function Evaluation Budgets.",
            "Analysis of Cartesian Genetic Programming's Evolutionary Mechanisms.",
            "An Effective Method for Evolving Reaction Networks in Synthetic Biochemical Systems.",
            "Social Networks and Asset Price Dynamics.",
            "An Algorithm for Many-Objective Optimization With Reduced Objective Computations: A Study in Differential Evolution.",
            "Locating Multiple Optimal Solutions of Nonlinear Equation Systems Based on Multiobjective Optimization.",
            "Evolutionary Approach to Approximate Digital Circuits Design.",
            "A Decomposition-Based Evolutionary Algorithm for Many Objective Optimization.",
            "An Edge-Set Representation Based on a Spanning Tree for Searching Cut Space.",
            "Automated Feature Design for Numeric Sequence Classification by Genetic Programming.",
            "Six-Sigma Robust Design Optimization Using a Many-Objective Decomposition-Based Evolutionary Algorithm.",
            "An External Archive Guided Multiobjective Evolutionary Algorithm Based on Decomposition for Combinatorial Optimization.",
            "Two_Arch2: An Improved Two-Archive Algorithm for Many-Objective Optimization.",
            "Online Diversity Assessment in Evolutionary Multiobjective Optimization: A Geometrical Perspective.",
            "Differential Evolution With an Individual-Dependent Mechanism.",
            "A Discrete Particle Swarm Optimization for Covering Array Generation.",
            "A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections.",
            "Meta-Heuristic Algorithms in Car Engine Design: A Literature Survey.",
            "Solving Uncompromising Problems With Lexicase Selection.",
            "Memetic Search With Interdomain Learning: A Realization Between CVRP and CARP.",
            "Computational Cost Reduction of Nondominated Sorting Using the M-Front.",
            "Building Image Feature Kinetics for Cement Hydration Using Gene Expression Programming With Similarity Weight Tournament Selection.",
            "An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition.",
            "Improving Differential Evolution With a Successful-Parent-Selecting Framework.",
            "Robust Optimization Over Time: Problem Difficulties and Benchmark Problems.",
            "A Multioperator Search Strategy Based on Cheap Surrogate Models for Evolutionary Optimization.",
            "A Knee Point-Driven Evolutionary Algorithm for Many-Objective Optimization.",
            "Switch Analysis for Running Time Analysis of Evolutionary Algorithms.",
            "A Boltzmann-Based Estimation of Distribution Algorithm for a General Resource Scheduling Model.",
            "An Estimation of Distribution Algorithm With Cheap and Expensive Local Search Methods.",
            "Gene Regulatory Network Evolution Through Augmenting Topologies.",
            "A Multiobjective Evolutionary Algorithm Using Gaussian Process-Based Inverse Modeling.",
            "Evolutionary Nonlinear Projection.",
            "A Hybrid Swarm-Based Approach to University Timetabling.",
            "Using Learning Classifier Systems to Learn Stochastic Decision Policies.",
            "Network Structural Balance Based on Evolutionary Multiobjective Optimization: A Two-Step Approach."
        ]
    },
    {
        "name": "TEC",
        "year": "2014",
        "info": "Volume 18: 2014",
        "count": 61,
        "papers": [
            "Guest Editorial: Special Issue on Advances in Multiobjective Evolutionary Algorithms for Data Mining.",
            "A Survey of Multiobjective Evolutionary Algorithms for Data Mining: Part I.",
            "Survey of Multiobjective Evolutionary Algorithms for Data Mining: Part II.",
            "Large-Scale Experimental Evaluation of Cluster Representations for Multiobjective Evolutionary Clustering.",
            "A New Multiobjective Evolutionary Algorithm for Mining a Reduced Set of Interesting Positive and Negative Quantitative Association Rules.",
            "Population Classification in Fire Evacuation: A Multiobjective Particle Swarm Optimization Approach.",
            "Complex Network Clustering by Multiobjective Discrete Particle Swarm Optimization Based on Decomposition.",
            "A Novel Graph-Based Estimation of the Distribution Algorithm and its Extension Using Reinforcement Learning.",
            "Adaptive Operator Selection With Bandits for a Multiobjective Evolutionary Algorithm Based on Decomposition.",
            "Performance Metric Ensemble for Multiobjective Evolutionary Algorithms.",
            "Artificial Biochemical Networks: Evolving Dynamical Systems to Control Dynamical Systems.",
            "Multi-Objective Optimization by Using Evolutionary Algorithms: The $p$-Optimality Criteria.",
            "A Gaussian Process Surrogate Model Assisted Evolutionary Algorithm for Medium Scale Expensive Optimization Problems.",
            "Automatic Design of Scheduling Policies for Dynamic Multi-objective Job Shop Scheduling via Cooperative Coevolution Genetic Programming.",
            "An Improved Differential Evolution Algorithm for Practical Dynamic Scheduling in Steelmaking-Continuous Casting Production.",
            "Frequency Fitness Assignment.",
            "Localization of License Plate Number Using Dynamic Image Processing Techniques and Genetic Algorithms.",
            "Comparison Study of Swarm Intelligence Techniques for the Annual Crop Planning Problem.",
            "Fuzzy-Based Pareto Optimality for Many-Objective Evolutionary Algorithms.",
            "A Distance-Based Ranking Model Estimation of Distribution Algorithm for the Flowshop Scheduling Problem.",
            "A Discrete Firefly Algorithm for the Multi-Objective Hybrid Flowshop Scheduling Problems.",
            "A Self-Adjustable Input Genetic Algorithm for the Near-Surface Problem in Geophysics.",
            "Evolutionary Programming for High-Dimensional Constrained Expensive Black-Box Optimization Using Radial Basis Functions.",
            "Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization.",
            "Data Clustering Using Variants of Rapid Centroid Estimation.",
            "Cooperative Co-Evolution With Differential Grouping for Large Scale Optimization.",
            "Optimal Experiment Design for Coevolutionary Active Learning.",
            "Genetic Programming for the Automatic Inference of Graph Models for Complex Networks.",
            "On the Landscape of Combinatorial Optimization Problems.",
            "Cooperative Coevolution With Route Distance Grouping for Large-Scale Capacitated Arc Routing Problems.",
            "Decomposition of a Multiobjective Optimization Problem Into a Number of Simple Multiobjective Subproblems.",
            "Sampling Techniques and Distance Metrics in High Dimensional Continuous Landscape Analysis: Limitations and Improvements.",
            "Reusing Building Blocks of Extracted Knowledge to Solve Complex, Large-Scale Boolean Problems.",
            "Quick Hypervolume.",
            "Ant Colony Optimization for Mixed-Variable Optimization Problems.",
            "Multiobjective Estimation of Distribution Algorithm Based on Joint Modeling of Objectives and Variables.",
            "Evolving an Improved Algorithm for Envelope Reduction Using a Hyper-Heuristic Approach.",
            "Evolving Classifiers to Recognize the Movement Characteristics of Parkinson's Disease Patients.",
            "An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints.",
            "An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point Based Nondominated Sorting Approach, Part II: Handling Constraints and Extending to an Adaptive Approach.",
            "Editorial for the Special Issue on Theoretical Foundations of Evolutionary Computation.",
            "Transforming Evolutionary Search into Higher-Level Evolutionary Search by Capturing Problem Structure.",
            "Convergence of Hypervolume-Based Archiving Algorithms.",
            "Asymptotic Properties of a Generalized Cross-Entropy Optimization Algorithm.",
            "Reevaluating Immune-Inspired Hypermutations Using the Fixed Budget Perspective.",
            "Differential Evolution With Dynamic Parameters Selection for Optimization Problems.",
            "Automated Map Generation for the Physical Traveling Salesman Problem.",
            "Multilocal Search and Adaptive Niching Based Memetic Algorithm With a Consensus Criterion for Data Clustering.",
            "A Knowledge-Based Evolutionary Multiobjective Approach for Stochastic Extended Resource Investment Project Scheduling Problems.",
            "The Dynamics of Self-Adaptive Multirecombinant Evolution Strategies on the General Ellipsoid Model.",
            "Genetic Algorithms for Evolving Computer Chess Programs.",
            "A Comment on \"Correlation as a Heuristic for Accurate and Comprehensible Ant Colony Optimization-Based Classifiers\".",
            "Parameter Optimization Algorithms for Evolving Rule Models Applied to Freshwater Ecosystems.",
            "An Analysis of N\\!K Landscapes: Interaction Structure, Statistical Properties, and Expected Number of Local Optima.",
            "The Effect of Memory Size on the Evolutionary Stability of Strategies in Iterated Prisoner's Dilemma.",
            "An Evolutionary Multiobjective Approach to Sparse Reconstruction.",
            "A New Memetic Algorithm With Fitness Approximation for the Defect-Tolerant Logic Mapping in Crossbar-Based Nanoarchitectures.",
            "Performance Analysis of Evolutionary Algorithms for the Minimum Label Spanning Tree Problem.",
            "Evolutionary Design of Decision-Tree Algorithms Tailored to Microarray Gene Expression Data Sets.",
            "Reusing Genetic Programming for Ensemble Selection in Classification of Unbalanced Data.",
            "Stable Matching-Based Selection in Evolutionary Multiobjective Optimization."
        ]
    },
    {
        "name": "TEC",
        "year": "2013",
        "info": "Volume 17: 2013",
        "count": 52,
        "papers": [
            "Parent Selection Pressure Auto-Tuning for Tournament Selection in Genetic Programming.",
            "A Hybrid Multiobjective Evolutionary Algorithm for Multiobjective Optimization Problems.",
            "Classification of Electromyographic Signals: Comparing Evolvable Hardware to Conventional Classifiers.",
            "A New Sequential Covering Strategy for Inducing Classification Rules With Ant Colony Algorithms.",
            "Objective Reduction in Many-Objective Optimization: Linear and Nonlinear Algorithms.",
            "On the Advantages of Variable Length GRNs for the Evolution of Multicellular Developmental Systems.",
            "The Transferability Approach: Crossing the Reality Gap in Evolutionary Robotics.",
            "The Use of an Analytic Quotient Operator in Genetic Programming.",
            "Guest Editorial: Special Issue on Understanding Complex Evolutionary Systems.",
            "Complex Coevolutionary Dynamics - Structural Stability and Finite Population Effects.",
            "Visualizing Mutually Nondominating Solution Sets in Many-Objective Optimization.",
            "Evolved Features for DNA Sequence Classification and Their Fitness Landscapes.",
            "Fitness Landscapes of Evolved Apoptotic Cellular Automata.",
            "Coevolving Game-Playing Agents: Measuring Performance and Intransitivities.",
            "Agent-Case Embeddings for the Analysis of Evolved Systems.",
            "Particle Swarm Optimization With an Aging Leader and Challengers.",
            "Experimental Analysis of Bound Handling Techniques in Particle Swarm Optimization.",
            "FPGA Implementation of an Evolutionary Algorithm for Autonomous Unmanned Aerial Vehicle On-Board Path Planning.",
            "Evolving Team Compositions by Agent Swapping.",
            "Stochastic Diversity Loss and Scalability in Estimation of Distribution Genetic Programming.",
            "A Survey on Multiobjective Evolutionary Algorithms for the Solution of the Portfolio Optimization Problem and Other Finance and Economics Applications.",
            "A Note on Generalization Loss When Evolving Adaptive Pattern Recognition Systems.",
            "A Novel Genetic Programming Approach for Frequency-Dependent Modeling.",
            "Evolving Diverse Ensembles Using Genetic Programming for Classification With Unbalanced Data.",
            "A Distance-Based Locally Informed Particle Swarm Model for Multimodal Optimization.",
            "Genetic Variation and the Evolution of Consensus in Digital Organisms.",
            "A New Method for Lower Bounds on the Running Time of Evolutionary Algorithms.",
            "A New Particle Swarm Optimization Method Enhanced With a Periodic Mutation Strategy and Neural Networks.",
            "Multiobjective Metaheuristics for Traffic Grooming in Optical Networks.",
            "Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization.",
            "A Hybrid Framework for Evolutionary Multi-Objective Optimization.",
            "A Differential Evolution Algorithm With Dual Populations for Solving Periodic Railway Timetable Scheduling Problem.",
            "Evolutionary Foundation of Bounded Rationality in a Financial Market.",
            "Self-Adaptive Evolution Toward New Parameter Free Image Registration Methods.",
            "Clustered Memetic Algorithm With Local Heuristics for Ab Initio Protein Structure Prediction.",
            "Reverse Engineering of Gene Regulatory Networks Using Dissipative Particle Swarm Optimization.",
            "A Memetic Algorithm for Matching Spatial Configurations With the Histograms of Forces.",
            "On the Convergence of Chemical Reaction Optimization for Combinatorial Optimization.",
            "A Computational Study of Representations in Genetic Programming to Evolve Dispatching Rules for the Job Shop Scheduling Problem.",
            "An Evolutionary Negative-Correlation Framework for Robust Analog-Circuit Design Under Uncertain Faults.",
            "Multimodal Optimization Using a Biobjective Differential Evolution Algorithm Enhanced With Mean Distance-Based Selection.",
            "Correlation as a Heuristic for Accurate and Comprehensible Ant Colony Optimization Based Classifiers.",
            "An Adaptive Particle Swarm Optimization With Multiple Adaptive Methods.",
            "A Grid-Based Evolutionary Algorithm for Many-Objective Optimization.",
            "Striking a Mean- and Parent-Centric Balance in Real-Valued Crossover Operators.",
            "Multiobjective Particle Swarm Optimization With Preference-Based Sort and Its Application to Path Following Footstep Optimization for Humanoid Robots.",
            "An Energy-Based Sampling Technique for Multi-Objective Restricted Boltzmann Machine.",
            "An Efficient Evolutionary Algorithm for Chance-Constrained Bi-Objective Stochastic Optimization.",
            "Scaling Up Estimation of Distribution Algorithms for Continuous Optimization.",
            "Optimal Cycle Program of Traffic Lights With Particle Swarm Optimization.",
            "Grammatical Evolution Hyper-Heuristic for Combinatorial Optimization Problems.",
            "Fitness Modeling With Markov Networks."
        ]
    },
    {
        "name": "TEC",
        "year": "2012",
        "info": "Volume 16: 2012",
        "count": 54,
        "papers": [
            "Robustness Against the Decision-Maker's Attitude to Risk in Problems With Conflicting Objectives.",
            "Preference-Based Solution Selection Algorithm for Evolutionary Multiobjective Optimization.",
            "A Novel Immune Clonal Algorithm for MO Problems.",
            "On Gradients and Hybrid Evolutionary Algorithms for Real-Valued Multiobjective Optimization.",
            "Improving Generalization Performance in Co-Evolutionary Learning.",
            "A Fast Way of Calculating Exact Hypervolumes.",
            "A Rule-Based Evolutionary Approach to Music Performance Modeling.",
            "Edge Orientation and the Design of Problem-Specific Crossover Operators for the OCST Problem.",
            "Combining Multiobjective Optimization With Differential Evolution to Solve Constrained Optimization Problems.",
            "Performance Evaluation of Evolutionary Algorithms for Optimal Filter Design.",
            "A Multiobjective Evolutionary Algorithm That Diversifies Population by Its Density.",
            "Toward Understanding EDAs Based on Bayesian Networks Through a Quantitative Analysis.",
            "Adaptation in Dynamic Environments: A Case Study in Mission Planning.",
            "Cooperatively Coevolving Particle Swarms for Large Scale Optimization.",
            "On the Impact of Mutation-Selection Balance on the Runtime of Evolutionary Algorithms.",
            "Evolving Distributed Algorithms With Genetic Programming.",
            "An Improved Ant-Based Algorithm for the Degree-Constrained Minimum Spanning Tree Problem.",
            "The Effects of Constant and Bit-Wise Neutrality on Problem Hardness, Fitness Distance Correlation and Phenotypic Mutation Rates.",
            "A Cluster and Gradient-Based Artificial Immune System Applied in Optimization Scenarios.",
            "Maximum Satisfiability: Anatomy of the Fitness Landscape for a Hard Combinatorial Optimization Problem.",
            "Real-Coded Chemical Reaction Optimization.",
            "A Study of Collapse in Bare Bones Particle Swarm Optimization.",
            "Multiobjectivization via Helper-Objectives With the Tunable Objectives Problem.",
            "Evolutionary Design of Both Topologies and Parameters of a Hybrid Dynamical System.",
            "Grammatical Evolution of Local Search Heuristics.",
            "A Multiobjective Genetic Algorithm to Find Communities in Complex Networks.",
            "A Genetic Approach to Statistical Disclosure Control.",
            "Decomposition-Based Multiobjective Evolutionary Algorithm With an Ensemble of Neighborhood Sizes.",
            "Solving Multicommodity Capacitated Network Design Problems Using Multiobjective Evolutionary Algorithms.",
            "An Integrated Neuroevolutionary Approach to Reactive Control and High-Level Strategy.",
            "A Process Algebra Genetic Algorithm.",
            "Using the Averaged Hausdorff Distance as a Performance Measure in Evolutionary Multiobjective Optimization.",
            "Promoting Creative Design in Interactive Evolutionary Computation.",
            "Effects of Iterated Interactions in Multiplayer Spatial Evolutionary Games.",
            "A General Framework of Multipopulation Methods With Clustering in Undetectable Dynamic Environments.",
            "On the Design of Constraint Covariance Matrix Self-Adaptation Evolution Strategies Including a Cardinality Constraint.",
            "Differential Evolution With Neighborhood Mutation for Multimodal Optimization.",
            "Progressive Alignment Method Using Genetic Algorithm for Multiple Sequence Alignment.",
            "Approximating the Genetic Diversity of Populations in the Quasi-Equilibrium State.",
            "A Filter Approach to Multiple Feature Construction for Symbolic Learning Classifiers Using Genetic Programming.",
            "Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering.",
            "Review and Study of Genotypic Diversity Measures for Real-Coded Representations.",
            "Evolution of Plastic Learning in Spiking Networks via Memristive Connections.",
            "Memetic Algorithms for De Novo Motif Discovery.",
            "Genetic Algorithms for Discovery of Matrix Multiplication Methods.",
            "Erratum to \"On the Design of Constraint Covariance Matrix Self-Adaptation Evolution Strategies Including a Cardinality Constraint\".",
            "The Technology of the Gaps: An Evolvable Hardware Synthesized Oscillator for the Control of a Flapping-Wing Micro Air Vehicle.",
            "Continuous Dynamic Constrained Optimization - The Challenges.",
            "Hybrid Metaheuristics Based on Evolutionary Algorithms and Simulated Annealing: Taxonomy, Comparison, and Synergy Test.",
            "An Efficient Resource Allocation Scheme Using Particle Swarm Optimization.",
            "Evolving Boolean Networks on Tunable Fitness Landscapes.",
            "Efficient Forest Data Structure for Evolutionary Algorithms Applied to Network Design.",
            "An Artificial Immune System for Classification With Local Feature Selection.",
            "The Automatic Design of Multiobjective Ant Colony Optimization Algorithms."
        ]
    },
    {
        "name": "TEC",
        "year": "2011",
        "info": "Volume 15: 2011",
        "count": 49,
        "papers": [
            "Guest Editorial Special Issue on Differential Evolution.",
            "Differential Evolution: A Survey of the State-of-the-Art.",
            "Compact Differential Evolution.",
            "Differential Evolution With Composite Trial Vector Generation Strategies and Control Parameters.",
            "Improving Classical and Decentralized Differential Evolution With New Mutation Operator and Population Topologies.",
            "Enhancing Differential Evolution Utilizing Proximity-Based Mutation Operators.",
            "Fixed-Structure Hinfinity Controller Synthesis Based on Differential Evolution With Level Comparison.",
            "Efficient Hybrid-Game Strategies Coupled to Evolutionary Algorithms for Robust Multidisciplinary Design Optimization in Aerospace Engineering.",
            "Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem.",
            "Flight of the FINCH Through the Java Wilderness.",
            "Diversity Management in Evolutionary Many-Objective Optimization.",
            "Systematic Initialization Techniques for Hybrid Evolutionary Algorithms for Solving Two-Stage Stochastic Mixed-Integer Programs.",
            "Autonomous Virulence Adaptation Improves Coevolutionary Optimization.",
            "Toward an Evolutionary Computing Modeling Language.",
            "Theoretical Analysis of Phenotypic Diversity in Real-Valued Evolutionary Algorithms With More-Than-One-Element Replacement.",
            "An Inflationary Differential Evolution Algorithm for Space Trajectory Optimization.",
            "Guest Editorial: Special Issue on Evolving Developmental Systems.",
            "On Synergistic Interactions Between Evolution, Development and Layered Learning.",
            "An Investigation of the Importance of Mechanisms and Parameters in a Multicellular Developmental System.",
            "On the Performance of Indirect Encoding Across the Continuum of Regularity.",
            "Evolving Symmetry for Modular System Design.",
            "Robustness and the Halting Problem for Multicellular Artificial Ontogeny.",
            "Stochastic Stability Analysis of the Linear Continuous and Discrete PSO Models.",
            "Hyperinteractive Evolutionary Computation.",
            "Coupling Evolutionary Algorithms With Nonlinear Dynamical Systems: An Efficient Tool for Excitation Design and Optimization.",
            "On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem.",
            "Diversity Through Multiculturality: Assessing Migrant Choice Policies in an Island Model.",
            "Agent-Based Optimization for Large Scale WLAN Design.",
            "Multiobjective Production Planning Optimization Using Hybrid Evolutionary Algorithms for Mineral Processing.",
            "Evolutionary Improvement of Programs.",
            "A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems.",
            "Trustworthy Genetic Programming-Based Synthesis of Analog Circuit Topologies Using Hierarchical Domain-Specific Building Blocks.",
            "Innocent Until Proven Guilty: Reducing Robot Shaping From Polynomial to Linear Time.",
            "Guest Editorial.",
            "A Multi-Facet Survey on Memetic Computation.",
            "Analysis on the Collaboration Between Global Search and Local Search in Memetic Computation.",
            "A Multilevel Memetic Approach for Improving Graph k-Partitions.",
            "DNA Sequence Compression Using Adaptive Particle Swarm Optimization-Based Memetic Algorithm.",
            "A Memetic Algorithm for Global Optimization in Chemical Process Synthesis Problems.",
            "Optimization Approach for 4-D Natural Landscape Evolution.",
            "Maintaining Healthy Population Diversity Using Adaptive Crossover, Mutation, and Selection.",
            "Multi Population Pattern Searching Algorithm: A New Evolutionary Method Based on the Idea of Messy Genetic Algorithm.",
            "An Evolutionary Algorithm That Makes Decision Based on the Entire Previous Search History.",
            "R-EVO: A Reactive Evolutionary Algorithm for the Maximum Clique Problem.",
            "Local Optima Networks of NK Landscapes With Neutrality.",
            "Cluster Guide Particle Swarm Optimization (CGPSO) for Underdetermined Blind Source Separation With Advanced Conditions.",
            "Neighborhood Knowledge-Based Evolutionary Algorithm for Multiobjective Optimization Problems.",
            "Orthogonal Learning Particle Swarm Optimization.",
            "A Multicriteria Statistical Based Comparison Methodology for Evaluating Evolutionary Algorithms."
        ]
    },
    {
        "name": "TEC",
        "year": "2010",
        "info": "Volume 14: 2010",
        "count": 56,
        "papers": [
            "Analysis of Computational Time of Simple Estimation of Distribution Algorithms.",
            "Interaction of Culture-Based Learning and Cooperative Co-Evolution and its Application to Automatic Behavior-Based System Design.",
            "On Set-Based Multiobjective Optimization.",
            "Bi-Objective Multipopulation Genetic Algorithm for Multimodal Function Optimization.",
            "Grouping Genetic Algorithm for the Blockmodel Problem.",
            "HCS: A New Local Search Strategy for Memetic Multiobjective Evolutionary Algorithms.",
            "Customizable FPGA IP Core Implementation of a General-Purpose Genetic Algorithm Engine.",
            "Niching Without Niching Parameters: Particle Swarm Optimization Using a Ring Topology.",
            "Implicitly Controlling Bloat in Genetic Programming.",
            "A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems.",
            "Nonlinear Network Optimization - An Embedding Vector Space Approach.",
            "The CMA-ES on Riemannian Manifolds to Reconstruct Shapes in 3-D Voxel Images.",
            "Automatic Reproduction of a Genius Algorithm: Strassen's Algorithm Revisited by Genetic Search.",
            "On the Importance of Data Balancing for Symbolic Regression.",
            "A Novel Set-Based Particle Swarm Optimization Method for Discrete Optimization Problems.",
            "Computational Evolutionary Embryogeny.",
            "Generalizing Surrogate-Assisted Evolutionary Computation.",
            "An Evolutionary Approach to the Multidepot Capacitated Arc Routing Problem.",
            "Optimizing Capacitance Ratio Assignment for Low-Sensitivity SC Filter Implementation.",
            "Chemical-Reaction-Inspired Metaheuristic for Optimization.",
            "Performance of the $(\\mu /\\mu _{I}, \\lambda )\\hbox {-}\\sigma {\\rm SA}$ -ES on a Class of PDQFs.",
            "Discovering Unique, Low-Energy Pure Water Isomers: Memetic Exploration, Optimization, and Landscape Analysis.",
            "A Dual-System Variable-Grain Cooperative Coevolutionary Algorithm: Satellite-Module Layout Design.",
            "Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model.",
            "Particle Swarm Optimization Aided Orthogonal Forward Regression for Unified Data Modeling.",
            "Benefits of a Population: Five Mechanisms That Advantage Population-Based Algorithms.",
            "Learning the Large-Scale Structure of the MAX-SAT Landscape Using Populations.",
            "Incorporating the Notion of Relative Importance of Objectives in Evolutionary Multiobjective Optimization.",
            "XCS for Personalizing Desktop Interfaces.",
            "Ensemble of Constraint Handling Techniques.",
            "A Hybrid Evolutionary Approach to the Nurse Rostering Problem.",
            "From Local Search to Global Conclusions: Migrating Spin Glass-Based Distributed Portfolio Selection.",
            "Evolutionary Optimization of Service Times in Interactive Voice Response Systems.",
            "A Study of Multiobjective Metaheuristics When Solving Parameter Scalable Problems.",
            "A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation.",
            "Erratum to \"Niching Without Niching Parameters: Particle Swarm Optimization Using a Ring Topology\" [Feb 10 150-169].",
            "Guest Editorial Special Issue on Preference-Based Multiobjective Evolutionary Algorithms.",
            "Brain-Computer Evolutionary Multiobjective Optimization: A Genetic Algorithm Adapting to the Decision Maker.",
            "Integration of Preferences in Hypervolume-Based Multiobjective Evolutionary Algorithms by Means of Desirability Functions.",
            "An Interactive Territory Defining Evolutionary Algorithm: iTDEA.",
            "An Interactive Evolutionary Multiobjective Optimization Method Based on Progressively Approximated Value Functions.",
            "Feasibility Structure Modeling: An Effective Chaperone for Constrained Memetic Algorithms.",
            "Multiobjective Optimization Applied to the Eradication of Persistent Pathogens.",
            "Hybrid Genetic Algorithm Using a Forward Encoding Scheme for Lifetime Maximization of Wireless Sensor Networks.",
            "Population-Based Algorithm Portfolios for Numerical Optimization.",
            "The r-Dominance: A New Dominance Relation for Interactive Evolutionary Multicriteria Decision Making.",
            "Toward an Estimation of Nadir Objective Vector Using a Hybrid of Evolutionary and Local Search Approaches.",
            "Multimodal Optimization by Means of a Topological Species Conservation Algorithm.",
            "A Dual-Population Genetic Algorithm for Adaptive Diversity Control.",
            "Active Categorical Perception of Object Shapes in a Simulated Anthropomorphic Robotic Arm.",
            "An Evolutionary Computing Approach to Robust Design in the Presence of Uncertainties.",
            "Genetics-Based Machine Learning for Rule Induction: State of the Art, Taxonomy, and Comparative Study.",
            "A Genetic Programming Hyper-Heuristic Approach for Evolving 2-D Strip Packing Heuristics.",
            "A Clustering Particle Swarm Optimizer for Locating and Tracking Multiple Optima in Dynamic Environments.",
            "An Accelerating Two-Layer Anchor Search With Application to the Resource-Constrained Project Scheduling Problem.",
            "Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization."
        ]
    },
    {
        "name": "TEC",
        "year": "2009",
        "info": "Volume 13: 2009",
        "count": 79,
        "papers": [
            "Editorial Special Issue: Computational Finance and Economics.",
            "ZIP60: Further Explorations in the Evolutionary Design of Trader Agents and Online Auction-Market Mechanisms.",
            "An Agent-Based Approach to Option Pricing Anomalies.",
            "An Heterogeneous, Endogenous and Coevolutionary GP-Based Financial Market.",
            "Financial Market Trading System With a Hierarchical Coevolutionary Fuzzy Predictive Model.",
            "Computational Intelligence for Evolving Trading Rules.",
            "Evolving Least Squares Support Vector Machines for Stock Market Trend Mining.",
            "A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization.",
            "Optimization of Power Allocation for Interference Cancellation With Particle Swarm Optimization.",
            "Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters.",
            "Optimization of Temporal Processes: A Model Predictive Control Approach.",
            "A Method for Handling Uncertainty in Evolutionary Optimization With an Application to Feedback Control of Combustion.",
            "Lower and Upper Bounds for Linkage Discovery.",
            "Associative Classification With Artificial Immune System.",
            "Multiobjective Groundwater Management Using Evolutionary Algorithms.",
            "Self-Adaptive Multimethod Search for Global Optimization in Real-Parameter Spaces.",
            "Fuzzy-UCS: A Michigan-Style Learning Fuzzy-Classifier System for Supervised Learning.",
            "Multiobjective Optimization Problems With Complicated Pareto Sets, MOEA/D and NSGA-II.",
            "Evolution and Incremental Learning in the Iterated Prisoner's Dilemma.",
            "Accelerating Self-Modeling in Cooperative Robot Teams.",
            "Order of Nonlinearity as a Complexity Measure for Models Generated by Symbolic Regression via Pareto Genetic Programming.",
            "Boundary Search for Constrained Numerical Optimization Problems With an Algorithm Inspired by the Ant Colony Metaphor.",
            "Limitations of Existing Mutation Rate Heuristics and How a Rank GA Overcomes Them.",
            "Differential Evolution Algorithm With Strategy Adaptation for Global Numerical Optimization.",
            "Interactive Evolution of Particle Systems for Computer Graphics and Animation.",
            "An Evolutionary Squeaky Wheel Optimization Approach to Personnel Scheduling.",
            "Evolutionary Algorithms for Minimax Problems in Robust Design.",
            "A Genetic Algorithm That Adaptively Mutates and Never Revisits.",
            "Towards the Validation of Plagiarism Detection Tools by Means of Grammar Evolution.",
            "On the Bias and Performance of the Edge-Set Encoding.",
            "Dynamic Evolutionary Algorithm With Variable Relocation.",
            "Constraint Handling in Multiobjective Evolutionary Optimization.",
            "Differential Evolution Using a Neighborhood-Based Mutation Operator.",
            "Optimal Strategies of the Iterated Prisoner's Dilemma Problem for Multiple Conflicting Objectives.",
            "Search, Neutral Evolution, and Mapping in Evolutionary Computing: A Case Study of Grammatical Evolution.",
            "On the Effects of Adding Objectives to Plateau Functions.",
            "A Probabilistic Memetic Framework.",
            "Arc-Guided Evolutionary Algorithm for the Vehicle Routing Problem With Time Windows.",
            "Genetic Team Composition and Level of Selection in the Evolution of Cooperation.",
            "Preserving and Exploiting Genetic Diversity in Evolutionary Programming Algorithms.",
            "Editorial Special Issue: Swarm Intelligence.",
            "A Swarm Algorithm for a Self-Structured P2P Information System.",
            "Teamwork in Self-Organized Robot Colonies.",
            "Mean and Variance of the Sampling Distribution of Particle Swarm Optimizers During Stagnation.",
            "Self-Organizing Sync in a Robotic Swarm: A Dynamical System View.",
            "Using an Ant Colony Metaheuristic to Optimize Automatic Word Segmentation for Ancient Greek.",
            "From Fireflies to Fault-Tolerant Swarms of Robots.",
            "Using a Local Discovery Ant Algorithm for Bayesian Network Structure Learning.",
            "Evolutionary Game Theoretic Approach for Modeling Civil Violence.",
            "A New Evolutionary Particle Filter for the Prevention of Sample Impoverishment.",
            "Multiobjective Evolutionary Algorithm With Controllable Focus on the Knees of the Pareto Front.",
            "Convergence Acceleration Operator for Multiobjective Optimization.",
            "Two-Phase Genetic Local Search Algorithm for the Multimode Resource-Constrained Project Scheduling Problem.",
            "Latent Variable Model for Estimation of Distribution Algorithm Based on a Probabilistic Context-Free Grammar.",
            "Evolutionary Optimization of Dynamics Models in Sequential Monte Carlo Target Tracking.",
            "Evolutionary Dynamics on Scale-Free Interaction Networks.",
            "A Survey of Particle Swarm Optimization Applications in Electric Power Systems.",
            "Adaptive Computational Chemotaxis in Bacterial Foraging Optimization: An Analysis.",
            "JADE: Adaptive Differential Evolution With Optional External Archive.",
            "Agent-Based Approach to Option Pricing Anomalies.",
            "Group Search Optimizer: An Optimization Algorithm Inspired by Animal Searching Behavior.",
            "Multiobjective Genetic Algorithm-Based Fuzzy Clustering of Categorical Attributes.",
            "Analysis of the (1+1) -EA for Finding Approximate Solutions to Vertex Cover Problems.",
            "Evolutionary Optimization of Constrained k -Means Clustered Assets for Diversification in Small Portfolios.",
            "Reliability-Based Optimization Using Evolutionary Algorithms.",
            "On the Complexity of Computing the Hypervolume Indicator.",
            "Runtime Analysis of an Ant Colony Optimization Algorithm for TSP Instances.",
            "Facetwise Analysis of XCS for Problems With Class Imbalances.",
            "Frankenstein's PSO: A Composite Particle Swarm Optimization Algorithm.",
            "Benchmarking a Wide Spectrum of Metaheuristic Techniques for the Radio Network Design Problem.",
            "Memetic Algorithm With Extended Neighborhood Search for Capacitated Arc Routing Problems.",
            "Approximating the Set of Pareto-Optimal Solutions in Both the Decision and Objective Spaces by an Estimation of Distribution Algorithm.",
            "Using Differential Evolution for a Subclass of Graph Theory Problems.",
            "Correction to \"A Fast Incremental Hypervolume Algorithm\" [Dec 08 714-723].",
            "Guest Editorial: Special Issue on Evolutionary Algorithms Based on Probabilistic Models.",
            "Analyzing Probabilistic Models in Hierarchical BOA.",
            "Quantum-Inspired Evolutionary Algorithm: A Multimodel EDA.",
            "Effective Linkage Learning Using Low-Order Statistics and Clustering.",
            "Matrix-Based Genetic Algorithm for Computing the Minimum Volume Ellipsoid."
        ]
    },
    {
        "name": "TEC",
        "year": "2008",
        "info": "Volume 12: 2008",
        "count": 53,
        "papers": [
            "An Artificial Immune System Heuristic for Generating Short Addition Chains.",
            "Applying a Traffic Lights Evolutionary Optimization Technique to a Real Case: \"Las Ramblas\" Area in Santa Cruz de Tenerife.",
            "RM-MEDA: A Regularity Model-Based Multiobjective Estimation of Distribution Algorithm.",
            "Opposition-Based Differential Evolution.",
            "An Adaptive Tradeoff Model for Constrained Evolutionary Optimization.",
            "Evolving Output Codes for Multiclass Problems.",
            "Accelerating Differential Evolution Using an Adaptive Local Search.",
            "An AM Radio Receiver Designed With a Genetic Algorithm Based on a Bacterial Conjugation Genetic Operator.",
            "A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization.",
            "HAL-Based Evolutionary Inference for Pattern Induction From Psychiatry Web Resources.",
            "Particle Swarm Optimization: Basic Concepts, Variants and Applications in Power Systems.",
            "Rolling System Design Using Evolutionary Sequential Process Optimization.",
            "Real-Valued Compact Genetic Algorithms for Embedded Microcontroller Optimization.",
            "The Self-Organization of Interaction Networks for Nature-Inspired Optimization.",
            "Quantum Genetic Optimization.",
            "Effective Learning Rate Adjustment of Blind Source Separation Basedon an Improved Particle Swarm Optimizer.",
            "Genetic-Fuzzy Data Mining With Divide-and-Conquer Strategy.",
            "A Simulated Annealing-Based Multiobjective Optimization Algorithm: AMOSA.",
            "Registration of CT and Intraoperative 3-D Ultrasound Images of the Spine Using Evolutionary and Gradient-Based Methods.",
            "An Evolutionary Algorithm to Find Associations in Dense Genetic Maps.",
            "On the Scalability of Real-Coded Bayesian Optimization Algorithm.",
            "Dominance-Based Multiobjective Simulated Annealing.",
            "Ergonomic Chair Design by Fusing Qualitative and Quantitative Criteria Using Interactive Genetic Algorithms.",
            "Function Approximation With XCS: Hyperellipsoidal Conditions, Recursive Least Squares, and Compaction.",
            "An Evolutionary Algorithm Approach to Optimal Ensemble Classifiers for DNA Microarray Data Analysis.",
            "An Explicit Selection Intensity of Tournament Selection-Based Genetic Algorithms.",
            "Errata to \"RM-MEDA: A Regularity Model-Based Multiobjective Estimation of Distribution Algorithm\" [Feb 08 41-63].",
            "The Automatic Acquisition, Evolution and Reuse of Modules in Cartesian Genetic Programming.",
            "Protein Folding in Simplified Models With Estimation of Distribution Algorithms.",
            "AbYSS: Adapting Scatter Search to Multiobjective Optimization.",
            "Training Distributed GP Ensemble With a Selective Algorithm Based on Clustering and Pruning for Pattern Classification.",
            "Genetic Programming Approaches for Solving Elliptic Partial Differential Equations.",
            "Measuring Generalization Performance in Coevolutionary Learning.",
            "Crossover-Based Tree Distance in Genetic Programming.",
            "Multiobjective Particle Swarm Algorithm With Fuzzy Clustering for Electrical Power Dispatch.",
            "Population-Based Incremental Learning With Associative Memory for Dynamic Environments.",
            "Fast and Robust Face Detection Using Evolutionary Pruning.",
            "A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks.",
            "A Drug Candidate Design Environment Using Evolutionary Computation.",
            "Normalization for Genetic Algorithms With Nonsynonymously Redundant Encodings.",
            "Darwinian, Lamarckian, and Baldwinian (Co)Evolutionary Approaches for Feature Weighting in K-means-Based Algorithms.",
            "Moving Block Sequence and Organizational Evolutionary Algorithm for General Floorplanning With Arbitrarily Shaped Rectilinear Blocks.",
            "Fingerprinting: Visualization and Automatic Analysis of Prisoner's Dilemma Strategies.",
            "Efficient Evolution of Accurate Classification Rules Using a Combination of Gene Expression Programming and Clonal Selection.",
            "A Multiobjective Evolutionary Conceptual Clustering Methodology for Gene Annotation Within Structural Databases: A Case of Study on the Gene Ontology Database.",
            "Biogeography-Based Optimization.",
            "A Fast Incremental Hypervolume Algorithm.",
            "Binary String Fitness Characterization and Comparative Partner Selection in Genetic Programming.",
            "Coevolution of Fitness Predictors.",
            "A Bayesian Network Approach to Program Generation.",
            "Item-Location Assignment Using Fuzzy Logic Guided Genetic Algorithms.",
            "Corrections to \"A Robust Stochastic Genetic Algorithm (StGA) for Global Numerical Optimization\".",
            "Erratum to \"Dominance-Based Multiobjective Simulated Annealing\"."
        ]
    },
    {
        "name": "TEC",
        "year": "2007",
        "info": "Volume 11: 2007",
        "count": 49,
        "papers": [
            "Nonlinear Least Square Regression by Adaptive Domain Method With Multiple Genetic Algorithms.",
            "An Investigation on Preference Order Ranking Scheme for Multiobjective Evolutionary Optimization.",
            "Combining Neural Networks and Genetic Algorithms to Predict and Reduce Diesel Engine Emissions.",
            "An Evolutionary Approach to Multiobjective Clustering.",
            "Christiansen Grammar Evolution: Grammatical Evolution With Semantics.",
            "The Dandelion Code: A New Coding of Spanning Trees for Genetic Algorithms.",
            "An Immune Algorithm for Protein Structure Prediction on Lattice Models.",
            "Synapsing Variable-Length Crossover: Meaningful Crossover for Variable-Length Genomes.",
            "Guest Editorial: Convergent Approaches to the Understanding of Autonomous Mental Development.",
            "Computational Modeling in Developmental Psychology.",
            "A Survey of Artificial Cognitive Systems: Implications for the Autonomous Development of Mental Capabilities in Computational Agents.",
            "Developing Complex Systems Using Evolved Pattern Generators.",
            "HMM-Based Concept Learning for a Mobile Robot.",
            "Autonomous Language Development Using Dialogue-Act Templates and Genetic Programming.",
            "Task Transfer by a Developmental Robot.",
            "Evolutionary Development of Hierarchical Learning Structures.",
            "Intrinsic Motivation Systems for Autonomous Mental Development.",
            "In Memoriam: Dr. Lawrence J. Fogel.",
            "In Memoriam: Dr. Lawrence J. Fogel.",
            "Imperfect Evolutionary Systems.",
            "Learning Finite-State Transducers: Evolution Versus Heuristic State Merging.",
            "Clustering-Based Adaptive Crossover and Mutation Probabilities for Genetic Algorithms.",
            "An Evolutionary Algorithm-Based Approach to Automated Design of Analog and RF Circuits Using Adaptive Normalized Cost Functions.",
            "An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization.",
            "Emerging Cooperation With Minimal Effort: Rewarding Over Mimicking.",
            "Finding Feasible Timetables Using Group-Based Operators.",
            "Interactive Evolutionary Computation-Based Hearing Aid Fitting.",
            "Time Series Forecasting for Dynamic Environments: The DyFor Genetic Program Model.",
            "Where Are the Niches? Dynamic Fitness Sharing.",
            "Natural Encoding for Evolutionary Supervised Learning.",
            "Evolutionary Gradient Search Revisited.",
            "Learning Classifier System Ensembles With Rule-Sharing.",
            "Applying Genetic Parallel Programming to Synthesize Combinational Logic Circuits.",
            "Revisiting the Foundations of Artificial Immune Systems for Data Mining.",
            "Coarse-Grained Dynamics for Generalized Recombination.",
            "Evolving Problems to Learn About Particle Swarm Optimizers and Other Search Algorithms.",
            "An Evolutionary Algorithm for Global Optimization Based on Level-Set Evolution and Latin Squares.",
            "Analog Genetic Encoding for the Evolution of Circuits and Networks.",
            "A Runtime Analysis of Evolutionary Algorithms for Constrained Optimization Problems.",
            "Solving the Register Allocation Problem for Embedded Systems Using a Hybrid Evolutionary Algorithm.",
            "Visual Learning by Evolutionary and Coevolutionary Feature Synthesis.",
            "Classification With Ant Colony Optimization.",
            "Fault Tolerance Using Dynamic Reconfiguration on the POEtic Tissue.",
            "Multiple Choices and Reputation in Multiagent Interactions.",
            "MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition.",
            "On the Invariance of Ant Colony Optimization.",
            "Properties of Symmetric Fitness Functions.",
            "Evolving Compositionality in Evolutionary Language Games.",
            "On the Evolutionary Optimization of Many Conflicting Objectives."
        ]
    },
    {
        "name": "TEC",
        "year": "2006",
        "info": "Volume 10: 2006",
        "count": 46,
        "papers": [
            "Bounds for probability of success of classical genetic algorithm based on hamming distance.",
            "A saw-tooth genetic algorithm combining the effects of variable population size and reinitialization to enhance performance.",
            "A faster algorithm for calculating hypervolume.",
            "Evolving the structure of hidden Markov models.",
            "ParEGO: a hybrid algorithm with on-line landscape approximation for expensive multiobjective optimization problems.",
            "An organizational coevolutionary algorithm for classification.",
            "Evolutionary discriminant analysis.",
            "Automated passive filter synthesis using a novel tree representation and genetic programming.",
            "From the Dandelion Code to the Rainbow Code: A Class of Bijective Spanning Tree Representations With Linear Complexity and Bounded Locality.",
            "The Edge-Window-Decoder Representation for Tree-Based Problems.",
            "Biased Mutation Operators for Subgraph-Selection Problems.",
            "Representation and Structural Difficulty in Genetic Programming.",
            "Redundancy and Computational Efficiency in Cartesian Genetic Programming.",
            "Offline Speaker Segmentation Using Genetic Algorithms and Mutual Information.",
            "Multiobjective Optimization of Safety Related Systems: An Application to Short-Term Conflict Alert.",
            "Dynamics of Two-Element Populations in the Space of Population States.",
            "A genetic algorithm for the design space exploration of datapaths during high-level synthesis.",
            "Evolutionary multiobjective industrial design: the case of a racing car tire-suspension system.",
            "Stability analysis of the particle dynamics in particle swarm optimizer.",
            "Evolutionary algorithms + domain knowledge = real-world evolutionary computation.",
            "Comprehensive learning particle swarm optimizer for global optimization of multimodal functions.",
            "An evolutionary clustering algorithm for gene expression microarray data analysis.",
            "Multiobjective evolutionary algorithms for electric power dispatch problem.",
            "Application of a fuzzy neural network combined with a chaos genetic algorithm and simulated annealing to short-term load forecasting.",
            "A constrained genetic approach for computing material property of elastic objects.",
            "Multiobjective optimization and evolutionary algorithms for the application mapping problem in multiprocessor system-on-chip design.",
            "A general noise model and its effects on evolution strategy performance.",
            "Max-min surrogate-assisted evolutionary algorithm for robust design.",
            "Efficient search for robust solutions by means of evolutionary algorithms and fitness approximation.",
            "Single- and multiobjective evolutionary optimization assisted by Gaussian random field metamodels.",
            "Locating and tracking multiple dynamic optima by a particle swarm model using speciation.",
            "Multiswarms, exclusion, and anti-convergence in dynamic environments.",
            "A review of multiobjective test problems and a scalable test problem toolkit.",
            "Functions with noise-induced multimodality: a test for evolutionary robust Optimization-properties and performance analysis.",
            "A distributed Cooperative coevolutionary algorithm for multiobjective optimization.",
            "Graph-based evolutionary algorithms.",
            "Fitness uniform optimization.",
            "A general-purpose tunable landscape generator.",
            "GP ensembles for large-scale data classification.",
            "A new query reweighting method for document retrieval based on genetic algorithms.",
            "Biasing Coevolutionary Search for Optimal Multiagent Behaviors.",
            "Self-Adapting Control Parameters in Differential Evolution: A Comparative Study on Numerical Benchmark Problems.",
            "A Multiobjective Optimization-Based Evolutionary Algorithm for Constrained Optimization.",
            "Evolutionary Design of Neural Network Architectures Using a Descriptive Encoding Language.",
            "Clearance of Nonlinear Flight Control Laws Using Hybrid Evolutionary Optimization.",
            "Improved Heuristics for the Minimum Label Spanning Tree Problem."
        ]
    },
    {
        "name": "TEC",
        "year": "2005",
        "info": "Volume 9: 2005",
        "count": 49,
        "papers": [
            "A simple multimembered evolution strategy to solve constrained optimization problems.",
            "Automatic mesh generation for mobile network dimensioning using evolutionary approach.",
            "Handling continuous attributes in an evolutionary inductive learner.",
            "Evolution of Processor microcode.",
            "A one-parameter genetic algorithm for the minimum labeling spanning tree problem.",
            "A hybrid least square-fuzzy bacterial foraging strategy for harmonic estimation.",
            "An improved resource allocation scheme for plane cover multiple access using genetic algorithm.",
            "Domain of competence of XCS classifier system in complexity measurement space.",
            "A graph-based Lamarckian-Baldwinian hybrid for the sorting network problem.",
            "Web-based evolutionary and adaptive information retrieval.",
            "The exploration/exploitation tradeoff in dynamic cellular genetic algorithms.",
            "Multiobjective evolutionary optimization of DNA sequences for reliable DNA computing.",
            "Search bias in ant colony optimization: on the role of competition-balanced systems.",
            "Parametric study for an ant algorithm applied to water distribution system optimization.",
            "An evolutionary algorithm with guided mutation for the maximum clique problem.",
            "A genetic algorithm for automated horizon correlation across faults in seismic images.",
            "A synthesis system for analog circuits based on evolutionary search and topological reuse.",
            "Training genetic programming on half a million patterns: an example from anomaly detection.",
            "Observing the evolution of neural networks learning to play the game of Othello.",
            "A genetic algorithm for searching spatial configurations.",
            "Cooperative coevolution of artificial neural network ensembles for pattern classification.",
            "Evolutionary optimization in uncertain environments-a survey.",
            "Adaptation technique for integrating genetic programming and reinforcement learning for real robots.",
            "Multiobjectivity and Complexity in Embodied Cognition.",
            "Nonlinear System Identification Using Coevolution of Models and Tests.",
            "Large Barrier Trees for Studying Search.",
            "On the Practicality of Using Intrinsic Reconfiguration for Fault Recovery.",
            "Parallel Implementation of EDAs Based on Probabilistic Graphical Models.",
            "A Generic Framework for Constrained Optimization Using Genetic Algorithms.",
            "Constrained optimization by applying the α constrained method to the nonlinear simplex method with mutations.",
            "Gradient descent methods in learning classifier systems: improving XCS performance in multistep problems.",
            "A tutorial for competent memetic algorithms: model, taxonomy, and design issues.",
            "Selection intensity in cellular evolutionary algorithms for regular lattices.",
            "Application of the utility function method for behavioral organization in a locomotion task.",
            "A multiagent model of the UK market in electricity generation.",
            "Behavioral diversity, choices and noise in the iterated prisoner's dilemma.",
            "Evolution of iterated prisoner's dilemma game strategies in structured demes under random pairing in game playing.",
            "Particle swarm optimization approaches to coevolve strategies for the iterated prisoner's dilemma.",
            "A game-theoretic and dynamical-systems analysis of selection methods in coevolution.",
            "Evolutionary asymmetric games for modeling systems of partially cooperative agents.",
            "Systematically incorporating domain-specific knowledge into evolutionary speciated checkers players.",
            "Coevolution versus self-play temporal difference learning for acquiring position evaluation in small-board go.",
            "Planning an endgame move set for the game RISK: a comparison of search algorithms.",
            "Real-time neuroevolution in the NERO video game.",
            "Playing to learn: case-injected genetic algorithms for learning to play computer games.",
            "Coevolutionary optimization of fuzzy logic intelligence for strategic decision support.",
            "Evolving assembly programs: how games help microprocessor validation.",
            "Unraveling ancient mysteries: reimagining the past using evolutionary computation in a complex gaming environment.",
            "Coevolutionary free lunches."
        ]
    },
    {
        "name": "TEC",
        "year": "2004",
        "info": "Volume 8: 2004",
        "count": 41,
        "papers": [
            "Evolutionary programming using mutations based on the Levy probability distribution.",
            "Symbiosis of evolutionary techniques and statistical natural language processing.",
            "Toward a theory of generalization and learning in XCS.",
            "Diversity in genetic programming: an analysis of measures and correlation with fitness.",
            "Symmetry breaking in population-based optimization.",
            "On stability of fixed points of limit models of univariate marginal distribution algorithm and factorized distribution algorithm.",
            "Meta-Lamarckian learning in memetic algorithms.",
            "A family of compact genetic algorithms for intrinsic evolvable hardware.",
            "On the convergence of a class of estimation of distribution algorithms.",
            "Systematic integration of parameterized local search into evolutionary algorithms.",
            "Quantum-inspired evolutionary algorithms with a new termination criterion, Hepsilon gate, and two-phase scheme.",
            "Running time analysis of multiobjective evolutionary algorithms on pseudo-Boolean functions.",
            "A novel approach to design classifiers using genetic programming.",
            "Guest Editorial Special Issue on Particle Swarm Optimization.",
            "The Fully Informed Particle Swarm: Simpler, Maybe Better.",
            "On the Computation of All Global Minimizers Through Particle Swarm Optimization.",
            "A Cooperative Approach to Particle Swarm Optimization.",
            "Self-Organizing Hierarchical Particle Swarm Optimizer With Time-Varying Acceleration Coefficients.",
            "Handling Multiple Objectives With Particle Swarm Optimization.",
            "Learning to Play Games Using a PSO-Based Competitive Learning Approach.",
            "An Approach to Multimodal Biomedical Image Registration Utilizing Particle Swarm Optimization.",
            "Hybrid coevolutionary programming for Nash equilibrium search in games with local optima.",
            "Learning with case-injected genetic algorithms.",
            "A GA-based design space exploration framework for parameterized system-on-a-chip platforms.",
            "On-line genetic design of anti-windup unstructured controllers for electric drives with variable load.",
            "Hybrid Taguchi-genetic algorithm for global numerical optimization.",
            "An efficient data mining method for learning Bayesian networks using an evolutionary algorithm-based hybrid approach.",
            "Statistical exploratory analysis of genetic algorithms.",
            "Ant Colony Optimization.",
            "Dynamic multiobjective optimization problems: test cases, approximations, and applications.",
            "The preservation of favored building blocks in the struggle for fitness: the puzzle algorithm.",
            "A robust stochastic genetic algorithm (StGA) for global numerical optimization.",
            "An evolutionary approach to pattern-based time series segmentation.",
            "Local function approximation in evolutionary algorithms for the optimization of costly functions.",
            "Analysis of fitness functions for electron-beam lithography simulation and evolutionary optimization.",
            "Heuristic design of cancer chemotherapies.",
            "Intelligent evolutionary algorithms for large parameter optimization problems.",
            "Implementing linear models in genetic programming.",
            "Evolutionary optimization with Markov random field prior.",
            "On the role of population size and niche radius in fitness sharing.",
            "A multiobjective module-order model for software quality enhancement."
        ]
    },
    {
        "name": "TEC",
        "year": "2003",
        "info": "Volume 7: 2003",
        "count": 38,
        "papers": [
            "Globally convergent algorithms for DC operating point analysis of nonlinear circuits.",
            "An analysis of the behavior of simplified evolutionary algorithms on trap functions.",
            "An evolutionary approach to the design of controllable cellular automata structure for random number generation.",
            "A scalable cellular implementation of parallel genetic programming.",
            "Inducing oblique decision trees with evolutionary algorithms.",
            "Simulation and evolutionary optimization of electron-beam lithography with genetic and simplex-downhill algorithms.",
            "Evolutionary programming techniques for economic load dispatch.",
            "Guest editorial: special issue on evolutionary multiobjective optimization.",
            "Properties of an adaptive archiving algorithm for storing nondominated vectors.",
            "Performance assessment of multiobjective optimizers: an analysis and review.",
            "Do multiple-objective metaheuristics deliver on their promises? A computational experiment on the set-covering problem.",
            "Considerations in engineering parallel multiobjective evolutionary algorithms.",
            "The balance between proximity and diversity in multiobjective evolutionary algorithms.",
            "Evolutionary multiobjective optimization for base station transmitter placement with frequency assignment.",
            "Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling.",
            "Edge sets: an effective evolutionary coding of spanning trees.",
            "An evolutionary approach to automatic synthesis of high-performance analog integrated circuits.",
            "Dynamic multiobjective evolutionary algorithm: adaptive cell-based rank and density estimation.",
            "Generating robust and flexible job shop schedules using genetic algorithms.",
            "Chaotic sequences to improve the performance of evolutionary algorithms.",
            "Using unconstrained elite archives for multiobjective optimization.",
            "Rank-density-based multiobjective genetic algorithm and benchmark test function study.",
            "Fuzzy coding of genetic algorithms.",
            "Directed variation in evolution strategies.",
            "Elitism-based compact genetic algorithms.",
            "Society and civilization: An optimization algorithm based on the simulation of social behavior.",
            "SOGARG: A self-organized genetic algorithm-based rule generation scheme for fuzzy controllers.",
            "The analysis of a recombinative hill-climber on H-IFF.",
            "Comparing evolutionary algorithms on binary constraint satisfaction problems.",
            "Self-adaptive fitness formulation for constrained optimization.",
            "GENETICA: A computer language that supports general formal expression with evolving data structures.",
            "A collective-based adaptive symbiotic model for surface reconstruction in area-based stereo.",
            "Reducing the run-time complexity of multiobjective EAs: The NSGA-II and other algorithms.",
            "Guest editorial data mining and knowledge discovery with evolutionary algorithms.",
            "Evolving accurate and compact classification rules with gene expression programming.",
            "A novel evolutionary data mining algorithm with applications to churn prediction.",
            "A semantically guided and domain-independent evolutionary model for knowledge discovery from texts.",
            "Using evolutionary algorithms as instance selection for data reduction in KDD: an experimental study."
        ]
    },
    {
        "name": "TEC",
        "year": "2002",
        "info": "Volume 6: 2002",
        "count": 50,
        "papers": [
            "A computational reinforced learning scheme to blind image deconvolution.",
            "Optimization based on bacterial chemotaxis.",
            "Local performance of the (1 + 1)-ES in a noisy environment.",
            "Preferences and their application in evolutionary multiobjective optimization.",
            "The particle swarm - explosion, stability, and convergence in a multidimensional complex space.",
            "Effects of phenotypic redundancy in structure optimization.",
            "Graph-based evolutionary design of arithmetic circuits.",
            "Partial abductive inference in Bayesian belief networks - an evolutionary computation approach by using problem-specific genetic operators.",
            "Genetic object recognition using combinations of views.",
            "On synchronized evolution of the network of automata.",
            "Evolution of central pattern generators for bipedal walking in a real-time physics environment.",
            "Knowledge-intensive genetic discovery in foreign exchange markets .",
            "A fast and elitist multiobjective genetic algorithm: NSGA-II.",
            "Designing a genetic neural fuzzy antilock-brake-system controller.",
            "An empirical study on the synergy of multiple crossover operators.",
            "Guest editorial special issue on artificial immune systems.",
            "Immunotronics - novel finite-state-machine architectures with built-in self-test using self-nonself differentiation.",
            "Learning and optimization using the clonal selection principle.",
            "An artificial immune system architecture for computer security applications.",
            "An immunity-based technique to characterize intrusions in computer networks.",
            "From neurocomputation to immunocomputation - a model and algorithm for fluctuation-induced instability and phase transition in biological systems.",
            "The immune and the chemical crossover.",
            "Guest editorial: special section on ant colony optimization.",
            "Data mining with an ant colony optimization algorithm.",
            "Ant colony optimization for resource-constrained project scheduling.",
            "Ants can solve constraint satisfaction problems.",
            "A short convergence proof for a class of ant colony optimization algorithms.",
            "A weighted sum genetic algorithm to support multiple-party multiple-objective negotiations.",
            "Analysis and modeling of control tasks in dynamic systems.",
            "VLSI placement and area optimization using a genetic algorithm to breed normalized postfix expressions.",
            "On the performance of multiple-objective genetic local search on the 0/1 knapsack problem - a comparative experiment.",
            "Evolving a modular neural network-based behavioral fusion using extended VFF and environment classification for mobile robot navigation .",
            "Design of evolvable computer languages.",
            "In memoriam Alex S. Fraser [1923-2002].",
            "Genetic programming and evolutionary generalization.",
            "Parallelism and evolutionary algorithms.",
            "NOW G-Net: learning classification programs on networks of workstations.",
            "A framework for evolutionary optimization with approximate fitness functions.",
            "From an individual to a population: an analysis of the first hitting time of population-based evolutionary algorithms.",
            "An evolutionary algorithm for resource-constrained project scheduling.",
            "Genetic-fuzzy approach to the Boolean satisfiability problem.",
            "Multi-objective optimization using evolutionary algorithms [Book Review].",
            "Editorial: transition to a new editor-in-chief.",
            "Editorial: Welcome To The IEEE Neural Networks Society.",
            "A (μ + λ) evolutionary algorithm for reconstruction of SPECT data.",
            "Artificial worlds modeling of human resource management systems.",
            "Toward minimal restriction of genetic encoding and crossovers for the two-dimensional Euclidean TSP.",
            "A genetic algorithm for shortest path routing problem and the sizing of populations.",
            "Quantum-inspired evolutionary algorithm for a class of combinatorial optimization.",
            "Evolving pattern recognition systems."
        ]
    },
    {
        "name": "TEC",
        "year": "2001",
        "info": "Volume 5: 2001",
        "count": 55,
        "papers": [
            "Memorial tribute to Dr. Michael Conrad.",
            "A new model of simulated evolutionary computation-convergence analysis and specifications.",
            "A comparison of linear genetic programming and neural networks in medical data mining.",
            "Synthesis of low-power DSP systems using a genetic algorithm.",
            "An orthogonal genetic algorithm with quantization for global numerical optimization.",
            "Evolution of functional link networks.",
            "Kalman-extended genetic algorithm for search in nonstationary environments with noisy fitness evaluations.",
            "Design of optimal disturbance rejection PID controllers using genetic algorithms.",
            "Guest editorial - evolutionary computation and cognitive science: modeling evolution and evolving models.",
            "Evolution of communication and language using signals, symbols, and words.",
            "Spontaneous evolution of linguistic structure-an iterated learning model of the emergence of regularity and irregularity.",
            "Random Boolean nets and features of language.",
            "A voter model of the spatial prisoner's dilemma.",
            "Multimodal control of reaching-simulating the role of tactile feedback.",
            "Design of evolutionary algorithms-A statistical perspective.",
            "Adaptive genetic operators based on coevolution with fuzzy behaviors.",
            "Planning multiple paths with evolutionary speciation.",
            "Locating input and output points in facilities design - a comparison of constructive, evolutionary, and exact methods.",
            "Microgenetic algorithms as generalized hill-climbing operators for GA optimization.",
            "On the performance of (1, Lambda)-evolution strategies for the ridge function class.",
            "Genetic algorithms for communications network design - an empirical study of the factors that influence performance.",
            "On self-adaptive features in real-parameter evolutionary algorithms.",
            "Combined evolution strategies for dynamic calibration of video-based measurement systems.",
            "A case study of scheduling storage tanks using a hybrid genetic algorithm.",
            "Remarks on a recent paper on the \"no free lunch\" theorems.",
            "Genetic algorithms and grouping problems.",
            "The second NASA/DoD workshop on evolvable hardware.",
            "Applying an evolutionary algorithm to telecommunication network design.",
            "Parallel hybrid method for SAT that couples genetic algorithms and local search.",
            "GAVEL - a new tool for genetic algorithm visualization.",
            "Grammatical evolution.",
            "Regularization approach to inductive genetic programming.",
            "Modeling crossover-induced linkage in genetic algorithms.",
            "Evolutionary pattern search algorithms for unconstrained and linearly constrained optimization.",
            "Dynamics of infinite populations evolving in a landscape of uni and bimodal fitness functions.",
            "Self-adaptive mutations may lead to premature convergence.",
            "Parameter optimization of an on-chip voltage reference circuit using evolutionary programming.",
            "Evolving an expert checkers playing program without using human expertise.",
            "Evolutionary robotics: the biology, intelligence, and technology of self-organizing machines.",
            "Guest editorial agent-based modeling of evolutionary economic systems.",
            "Empirical regularities from interacting long- and short-memory investors in an agent-based stock market.",
            "Phase transition in a foreign exchange market-analysis based on an artificial market approach.",
            "To innovate or not to innovate?",
            "Emerging small-world referral networks in evolutionary labor markets.",
            "Agent-based simulation-an application to the new electricity trading arrangements of England and Wales.",
            "Market power and efficiency in a computational electricity market with discriminatory double-auction pricing.",
            "Evolution of unplanned coordination in a market selection game.",
            "Nongovernance rather than governance in a multiagent economic society.",
            "A computational laboratory for evolutionary trade networks.",
            "Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization.",
            "Evolutionary algorithms - how to cope with plateaus of constant fitness and when to reject strings of the same fitness.",
            "Nonlinear blind source separation using higher order statistics and a genetic algorithm.",
            "A hybrid heuristic for the traveling salesman problem.",
            "On spanning-tree recombination in evolutionary large-scale network problems - application to electrical distribution planning.",
            "The third nasa/dod workshop on evolvable hardware."
        ]
    },
    {
        "name": "TEC",
        "year": "2000",
        "info": "Volume 4: 2000",
        "count": 33,
        "papers": [
            "A comparison of predictive measures of problem difficulty in evolutionary algorithms.",
            "Statistical distribution of the convergence time of evolutionary algorithms for long-path problems.",
            "A study of the Lamarckian evolution of recurrent neural networks.",
            "Gradual distributed real-coded genetic algorithms.",
            "Interval-valued GA-P algorithms.",
            "Visual routines for eye location using learning and evolution.",
            "A genetic algorithm approach to image reconstruction in electrical impedance tomography.",
            "Recent developments in evolutionary computation for manufacturing optimization: problems, solutions, and comparisons.",
            "Coevolutionary augmented Lagrangian methods for constrained optimization.",
            "A new evolutionary approach to the degree-constrained minimum spanning tree problem.",
            "An adaptive hybrid genetic algorithm for the three-matching problem .",
            "Using multiple genetic algorithms to generate radar point-scatterer models.",
            "Dimensionality reduction using genetic algorithms.",
            "An evolutionary algorithm for fractal coding of binary images.",
            "Multiobjective evolutionary computation for supersonic wing-shape optimization.",
            "A new mutation rule for evolutionary programming motivated from backpropagation learning.",
            "The simple genetic algorithm-foundations and theory.",
            "Swarm intelligence: from natural to artificial systems.",
            "Test-case generator for nonlinear continuous parameter optimization techniques.",
            "Markov chain models of parallel genetic algorithms.",
            "Modeling of ship trajectory in collision situations by an evolutionary algorithm.",
            "Application of genetic programming for multicategory pattern classification.",
            "Genetic fuzzy learning.",
            "Two fast tree-creation algorithms for genetic programming.",
            "Stochastic ranking for constrained evolutionary optimization.",
            "Solving equations by hybrid evolutionary computation techniques.",
            "Application of evolutionary programming to adaptive regularization in image restoration.",
            "Designing classifier fusion systems by genetic algorithms.",
            "Fitness landscape analysis and memetic algorithms for the quadratic assignment problem.",
            "A hybrid evolutionary approach for solving constrained optimization problems over finite domains.",
            "The computational complexity of N-K fitness functions.",
            "Evolutionary ensembles with negative correlation learning.",
            "Resource sharing and coevolution in evolving cellular automata."
        ]
    },
    {
        "name": "TEC",
        "year": "1999",
        "info": "Volume 3: 1999",
        "count": 28,
        "papers": [
            "Image segmentation using evolutionary computation.",
            "System design by constraint adaptation and differential evolution.",
            "A MS-GS VQ codebook design for wireless image communication using genetic algorithms.",
            "An orthogonal genetic algorithm for multimedia multicast routing.",
            "A multistage evolutionary algorithm for the timetable problem.",
            "Evolutionary programming made faster.",
            "Clustering with a genetically optimized approach.",
            "Evolutionary computation applied to mesh optimization of a 3-D facial image.",
            "Parameter control in evolutionary algorithms.",
            "Inductive reasoning and bounded rationality reconsidered.",
            "Synthesizing a predatory search strategy for VLSI layouts.",
            "Proceedings of the 1998 IEEE International Conference on Evolutionary Computation.",
            "Evolvable systems 1998-Proceedings of the Second International Conference on Evolvable Systems: From Biology to Hardware (ICES'98) .",
            "Adaptive Computing in Design and Manufacture.",
            "Genetic Programming 1998: Proceedings of the Third Annual Conference.",
            "Guest editorial from biology to hardware and back.",
            "Explorations in design space: unconventional electronics design through artificial evolution.",
            "Evolving oscillators in silico.",
            "A circuit representation technique for automated circuit design.",
            "Real-world applications of analog and digital evolvable hardware .",
            "Biomolecular computing and programming.",
            "Evolutionary Algorithms for VLSI CAD [book Review].",
            "Genetic programming III: darwinian invention and problem solving [Book Review].",
            "Multiobjective evolutionary algorithms: a comparative case study and the strength Pareto approach.",
            "Macroevolutionary algorithms: a new optimization method on fitness landscapes.",
            "The compact genetic algorithm.",
            "Genetic drift in genetic algorithm selection schemes.",
            "Proceedings of the first NASD/DoD workshop on evolvable hardware."
        ]
    },
    {
        "name": "TEC",
        "year": "1998",
        "info": "Volume 2: 1998",
        "count": 15,
        "papers": [
            "Bandit problems and the exploration/exploitation tradeoff.",
            "Solving constraint satisfaction problems using hybrid evolutionary search.",
            "Evolutionary search for low autocorrelated binary sequences.",
            "Evolutionary algorithms and gradient search: similarities and differences.",
            "Holder functions and deception of genetic algorithms.",
            "Evolutionary Algorithms In Engineering Applications.",
            "An evolutionary strategy for global minimization and its Markov chain analysis.",
            "Combining mutation operators in evolutionary programming.",
            "Fitness sharing and niching methods revisited.",
            "On the robustness of population-based versus point-based optimization in the presence of noise.",
            "An efficient evolutionary algorithm for channel resource management in cellular mobile systems.",
            "Integrating fuzzy knowledge by genetic algorithms.",
            "A genetic algorithm for the multiple destination routing problems.",
            "Robust design of multilayer optical coatings by means of evolutionary algorithms.",
            "Introduction To Artificial Life."
        ]
    },
    {
        "name": "TEC",
        "year": "1997",
        "info": "Volume 1: 1997",
        "count": 28,
        "papers": [
            "Evolutionary Computation: A New Transactions.",
            "Evolutionary computation: comments on the history and current state.",
            "Adaptive evolutionary planner/navigator for mobile robots.",
            "A parallel genetic algorithm for performance-driven VLSI routing.",
            "Evolving artificial neural networks to combine financial forecasts.",
            "Ant colony system: a cooperative learning approach to the traveling salesman problem.",
            "No free lunch theorems for optimization.",
            "A phylogenetic, ontogenetic, and epigenetic view of bio-inspired hardware systems.",
            "Speciation as automatic categorical modularization.",
            "Automated synthesis of analog electrical circuits by means of genetic programming.",
            "Evolutionary programming techniques for constrained optimization problems.",
            "An evolutionary autonomous agents approach to image feature extraction.",
            "A note on representations and variation operators.",
            "Automatic discovery of self-replicating structures in cellular automata.",
            "Local search genetic algorithm for optimal design of reliable networks.",
            "Generating fuzzy rules for target tracking using a steady-state genetic algorithm.",
            "Genetic algorithms with a robust solution searching scheme.",
            "Evolving computer programs without subtree crossover.",
            "Evolutionary Games And Equilibrium Selection.",
            "Evolutionary Programming VI.",
            "Using cultural algorithms to support re-engineering of rule-based expert systems in dynamic performance environments: a case study in fraud detection.",
            "Training multiple-layer perceptrons to recognize attractors.",
            "Local convergence rates of simple evolutionary algorithms with Cauchy mutations.",
            "Genetic algorithm optimization for blind channel identification with higher order cumulant fitting.",
            "Hybrid genetic algorithms for constrained placement problems.",
            "Using genetic algorithms in process planning for job shop machining.",
            "Schema processing under proportional selection in the presence of random effects.",
            "Genetic Programming 1997: Proceedings Of The Second Annual Conference On Genetic Programming."
        ]
    }
]