[
    {
        "name": "TG",
        "year": "2021",
        "info": "Volume 13: 2021",
        "count": 39,
        "papers": [
            "Generating Stable Building Block Structures From Sketches.",
            "A Multifaceted Surrogate Model for Search-Based Procedural Content Generation.",
            "Does Winning or Losing Change Players' Engagement in Competitive Games? Experiments in Virtual Reality.",
            "Bounded-Search Pathfinders Based on Influence Maps Generated by Attractors and Repulsors.",
            "Automated Video Game Testing Using Synthetic and Humanlike Agents.",
            "A Comparison of Mobile VR Display Running on an Ordinary Smartphone With Standard PC Display for P300-BCI Stimulus Presentation.",
            "Prediction of Player Churn and Disengagement Based on User Activity Data of a Freemium Online Strategy Game.",
            "GAMEREHAB@HOME: A New Engineering System Using Serious Game and Multisensor Fusion for Functional Rehabilitation at Home.",
            "Method for Constructing Artificial Intelligence Player With Abstractions to Markov Decision Processes in Multiplayer Game of Mahjong.",
            "Balancing Turn-Based Games With Chained Strategy Generation.",
            "Winning Rate Prediction Model Based on Monte Carlo Tree Search for Computer Dou Dizhu.",
            "Hexagonal Grid Numbering.",
            "Tension Space Analysis for Emergent Narrative.",
            "Are Exergames Exercise? A Scoping Review of the Short-Term Effects of Exertion Games.",
            "Evolutionary Optimization of Cooperative Strategies for the Iterated Prisoner's Dilemma.",
            "On the Robustness of Stealth Assessment.",
            "Controlling Melody Structures in Automatic Game Soundtrack Compositions With Adversarial Learning Guided Gaussian Mixture Models.",
            "User Activities in Game Replay Sharing Communities and Their Implications for User Retention.",
            "An Augmented Reality Implementation of the Pong Game.",
            "Altruism and Selfishness in Believable Game Agents: Deep Reinforcement Learning in Modified Dictator Games.",
            "Heuristic Search Value Iteration for Zero-Sum Stochastic Games.",
            "Exception-Tolerant Hierarchical Knowledge Bases for Forward Model Learning.",
            "Does Improved Sound Rendering Increase Player Performance? A Graph-Based Spatial Audio Framework.",
            "An Empirical Study of Trends of Popular Virtual Reality Games and Their Complaints.",
            "Impact of Visual and Sound Orchestration on Physiological Arousal and Tension in a Horror Game.",
            "Gamification of Online Surveys: A Systematic Mapping.",
            "Clues About Bluffing in Clue: Is Conventional Wisdom Wise?",
            "More Trees or Larger Trees: Parallelizing Monte Carlo Tree Search.",
            "On Solving Link-a-Pix Picture Puzzles.",
            "Editorial IEEE Transactions on Games: The First Four Years.",
            "Guest Editorial Special Issue on Team AI in Games.",
            "AI World Cup: Robot-Soccer-Based Competitions.",
            "Game Strategies for Physical Robot Soccer Players: A Survey.",
            "The Influence of Social Ties on Performance in Team-Based Online Games.",
            "Win Prediction in Multiplayer Esports: Live Professional Match Prediction.",
            "Discriminative Neural Network for Hero Selection in Professional Heroes of the Storm and DOTA 2.",
            "Operationalizing Intentionality to Play Hanabi With Human Players.",
            "A Game AI Competition to Foster Collaborative AI Research and Development.",
            "Which Heroes to Pick? Learning to Draft in MOBA Games With Neural Networks and Tree Search."
        ]
    },
    {
        "name": "TG",
        "year": "2020",
        "info": "Volume 12: 2020",
        "count": 38,
        "papers": [
            "Deep Learning for Video Game Playing.",
            "Procedural Puzzle Generation: A Survey.",
            "Profit Optimizing Churn Prediction for Long-Term Loyal Customers in Online Games.",
            "Construction of Strongly Mutually Distinct Sudoku Tables and Solid Sudoku Cubes by Cyclotomic Cosets.",
            "Reinforcement Learning to Create Value and Policy Functions Using Minimax Tree Search in Hex.",
            "Manipulating Narrative Salience in Interactive Stories Using Indexter's Pairwise Event Salience Hypothesis.",
            "Avatars of a Feather Flock Together: Gender Homophily in Online Video Games Revealed via Exponential Random Graph Modeling.",
            "Measuring Player Retention and Monetization Using the Mean Cumulative Function.",
            "Gamorithm.",
            "Dual Indicators to Analyze AI Benchmarks: Difficulty, Discrimination, Ability, and Generality.",
            "Self-Adaptive Monte Carlo Tree Search in General Game Playing.",
            "\"Are You Playing a Shooter Again?!\" Deep Representation Learning for Audio-Based Video Game Genre Recognition.",
            "Toward Personalized Adaptive Gamification: A Machine Learning Model for Predicting Performance.",
            "Comparison Training for Computer Chinese Chess.",
            "Crawling in Rogue's Dungeons With Deep Reinforcement Techniques.",
            "Learning the Game of Go by Scalable Network Without Prior Knowledge of Komi.",
            "Winning Is Not Everything: Enhancing Game Development With Intelligent Agents.",
            "A Mobile Game for Automatic Emotion-Labeling of Images.",
            "Infinite Loot Box: A Platform for Simulating Video Game Loot Boxes.",
            "Virtual Environment Positioning Utilizing Play-Script Spatiotemporal Reasoning.",
            "Testing a Protocol for Characterizing Game Playing Agents Trained via Evolution on a New Game.",
            "Video Game Development in a Rush: A Survey of the Global Game Jam Participants.",
            "Improving Solvability for Procedurally Generated Challenges in Physical Solitaire Games Through Entangled Components.",
            "Adaptive Music Composition for Games.",
            "REAL: Reality-Enhanced Applied Games.",
            "AutoRhythm: A Music Game With Automatic Hit-Timing Generation and Percussion Identification.",
            "Solving Sudoku With Ant Colony Optimization.",
            "A Game Design Plot: Exploring the Educational Potential of History-Based Video Games.",
            "Procedural Generation of Multistory Buildings With Interior.",
            "Guest Editorial: Special Issue on Serious Games for Health.",
            "Analysis, Design, and Prototypical Implementation of a Serious Game Reha@Stroke to Support Rehabilitation of Stroke Patients With the Help of a Mobile Phone.",
            "Fammeal: A Gamified Mobile Application for Parents and Children to Help Healthcare Centers Treat Childhood Obesity.",
            "The Anesthesia Crisis Scenario Builder for Authoring Anesthesia Crisis-Based Simulations.",
            "Staying Motivated During Difficult Times: A Snapshot of Serious Games for Paediatric Cancer Patients.",
            "User-Centered Design of a Scenario-Based Serious Game: Game-Based Teaching of Future Healthcare.",
            "A Distributed Multiplayer Game to Promote Active Transport at Workplaces: User-Centered Design, Implementation, and Lessons Learned.",
            "Correlating Psychophysiological Responses of Exergaming Boxing for Predictive Heart Rate Regression Models in Young Adults.",
            "Impact of Using Active Locomotion Interfaces for Gameplay: A Study on Exertion Levels and Presence."
        ]
    },
    {
        "name": "TG",
        "year": "2019",
        "info": "Volume 11: 2019",
        "count": 42,
        "papers": [
            "Guest Editorial Special Issue on AI-Based and AI-Assisted Game Design.",
            "Trained Behavior Trees: Programming by Demonstration to Support AI Game Designers.",
            "Perceptual Experience Management.",
            "Learning How Design Choices Impact Gameplay Behavior.",
            "Multiobjective Evolutionary Map Design for Cube 2: Sauerbraten.",
            "Orchestrating Game Generation.",
            "From Mechanics to Meaning.",
            "Who Killed Albert Einstein? From Open Data to Murder Mystery Games.",
            "Building a Planner: A Survey of Planning Systems Used in Commercial Video Games.",
            "Machine Learning Techniques for Analyzing Training Behavior in Serious Gaming.",
            "Modeling Users' Collaborative Behavior With a Serious Game.",
            "Spread-It: A Strategic Game of Competitive Diffusion Through Social Networks.",
            "Analysis of Agent Expertise in Ms. Pac-Man Using Value-of-Information-Based Policies.",
            "Machine Learning Approaches to Competing in Fantasy Leagues for the NFL.",
            "Evolving Roguelike Dungeons With Deluged Novelty Search Local Competition.",
            "Learning of Behavior Trees for Autonomous Agents.",
            "Guest Editorial Special Issue on Game Competition Frameworks for Research and Education.",
            "General Video Game AI: A Multitrack Framework for Evaluating Agents, Games, and Content Generation Algorithms.",
            "Game Data Mining Competition on Churn Prediction and Survival Analysis Using Commercial Game Log Data.",
            "StarCraft AI Competitions, Bots, and Tournament Manager Software.",
            "Algorithm Selection in Adversarial Settings: From Experiments to Tournaments in StarCraft.",
            "ViZDoom Competitions: Playing Doom From Pixels.",
            "The Text-Based Adventure AI Competition.",
            "Computer Shogi Tournaments and Techniques.",
            "The 2017 AIBIRDS Level Generation Competition.",
            "Dota 2 Bot Competition.",
            "Hierarchical Reinforcement Learning With Monte Carlo Tree Search in Computer Fighting Game.",
            "Pacman Capture the Flag in AI Courses.",
            "Deep Learning Competition Framework on Othello for Education.",
            "Guest Editorial Intelligence in Serious Games.",
            "A Tool to Design Interactive Characters Based on Embodied Cognition.",
            "Implementing Adaptive Game Difficulty Balancing in Serious Games.",
            "The ASC-Inclusion Perceptual Serious Gaming Platform for Autistic Children.",
            "Serious Games for Training Social Skills in Job Interviews.",
            "Automated Playtesting With Procedural Personas Through MCTS With Evolved Heuristics.",
            "Exploration in NetHack With Secret Discovery.",
            "How the Business Model of Customizable Card Games Influences Player Engagement.",
            "Emulating Human Play in a Leading Mobile Card Game.",
            "Recommender System for Items in Dota 2.",
            "Identifying Regional Trends in Avatar Customization.",
            "Inside the Group: Investigating Social Structures in Player Groups and Their Influence on Activity.",
            "Strategy Generation for Multiunit Real-Time Games via Voting."
        ]
    },
    {
        "name": "TG",
        "year": "2018",
        "info": "Volume 10: 2018",
        "count": 37,
        "papers": [
            "IEEE Transactions on Games: A Leading Journal for Games Research.",
            "Mastering 2048 With Delayed Temporal Coherence Learning, Multistage Weight Promotion, Redundant Encoding, and Carousel Shaping.",
            "Learning to Extract Action Descriptions From Narrative Text.",
            "Combat Models for RTS Games.",
            "Authoring Adaptive Game World Generation.",
            "Multiagent Inverse Reinforcement Learning for Two-Person Zero-Sum Games.",
            "Game Tree Search Based on Nondeterministic Action Scripts in Real-Time Strategy Games.",
            "Informed Hybrid Game Tree Search for General Video Game Playing.",
            "Learning Options From Demonstrations: APac-ManCase Study.",
            "Predicting Students' Decisions in a Training Simulation: A Novel Application of TrueSkill.",
            "Integrating Skills and Simulation to Solve Complex Navigation Tasks in Infinite Mario.",
            "Residual Networks for Computer Go.",
            "Symbolic Reasoning for Hearthstone.",
            "Playtime Measurement With Survival Analysis.",
            "Belief-State Monte Carlo Tree Search for Phantom Go.",
            "Learning Constructive Primitives for Real-Time Dynamic Difficulty Adjustment in Super Mario Bros.",
            "HearthBot: An Autonomous Agent Based on Fuzzy ART Adaptive Neural Networks for the Digital Collectible Card Game HearthStone.",
            "Exploring Game Space of Minimal Action Games via Parameter Tuning and Survival Analysis.",
            "Discovering Agent Behaviors Through Code Reuse: Examples From Half-Field Offense and Ms. Pac-Man.",
            "The 2016 Two-Player GVGAI Competition.",
            "An Enhanced Particle Swarm Optimization Method Integrated With Evolutionary Game Theory.",
            "Pac-ManConquers Academia: Two Decades of Research Using a Classic Arcade Game.",
            "Procedural Content Generation via Machine Learning (PCGML).",
            "Procedural Generation of Game Maps With Human-in-the-Loop Algorithms.",
            "Playing Multiaction Adversarial Games: Online Evolutionary Planning Versus Tree Search.",
            "Multimodal Student Engagement Recognition in Prosocial Games.",
            "Tanager: A Generator of Feasible and Engaging Levels forAngry Birds.",
            "Traditional Wisdom and Monte Carlo Tree Search Face-to-Face in the Card Game Scopone.",
            "Guest Editorial Special Issue on Deep/Reinforcement Learning and Games.",
            "Move Prediction Using Deep Convolutional Neural Networks in Hex.",
            "Can Deep Networks Learn to Play by the Rules? A Case Study on Nine Men's Morris.",
            "Learning to Play Othello With Deep Neural Networks.",
            "Automatic Bridge Bidding Using Deep Reinforcement Learning.",
            "Multilabeled Value Networks for Computer Go.",
            "Exploration in Continuous Control Tasks via Continually Parameterized Skills.",
            "Learning to Navigate Through Complex Dynamic Environment With Modular Deep Reinforcement Learning.",
            "Compressing Chinese Dark Chess Endgame Databases by Deep Learning."
        ]
    },
    {
        "name": "TG",
        "year": "2017",
        "info": "Volume 9: 2017",
        "count": 34,
        "papers": [
            "A Hyperheuristic Methodology to Generate Adaptive Strategies for Games.",
            "Opponent Modeling by Expectation-Maximization and Sequence Prediction in Simplified Poker.",
            "Neuroevolution in Games: State of the Art and Open Challenges.",
            "Creating Affective Autonomous Characters Using Planning in Partially Observable Stochastic Domains.",
            "Rapid Skill Capture in a First-Person Shooter.",
            "Partition Search Revisited.",
            "Only-One-Victor Pattern Learning in Computer Go.",
            "Automatic Classification of Player Complaints in Social Games.",
            "Product Propagation: A Backup Rule Better Than Minimaxing?",
            "A Pattern Mining Approach to Study Strategy Balance in RTS Games.",
            "Review of the Use of AI Techniques in Serious Games: Decision Making and Machine Learning.",
            "A Model-Based Approach to Optimizing Ms. Pac-Man Game Strategies in Real Time.",
            "Using Behavior Objects to Manage Complexity in Virtual Worlds.",
            "EvoCommander: A Novel Game Based on Evolving and Switching Between Artificial Brains.",
            "The ANGELINA Videogame Design System - Part I.",
            "HoningStone: Building Creative Combos With Honing Theory for a Digital Card Game.",
            "Design and Evaluation of a Data-Driven Scenario Generation Framework for Game-Based Training.",
            "Evolutionary Behavior Tree Approaches for Navigating Platform Games.",
            "A Survey on Story Generation Techniques for Authoring Computational Narratives.",
            "The ANGELINA Videogame Design System - Part II.",
            "Game Factors Influencing Players to Continue Playing Online Pets.",
            "Understanding the Interplay of Model Complexity and Fidelity in Multiagent Systems via an Evolutionary Framework.",
            "Ahura: A Heuristic-Based Racer for the Open Racing Car Simulator.",
            "A User Trust System for Online Games - Part I: An Activity Theory Approach for Trust Representation.",
            "Changing Resources Available to Game Playing Agents: Another Relevant Design Factor in Agent Experiments.",
            "Effects of Gender on Perception and Interpretation of Video Game Character Behavior and Emotion.",
            "Error Analysis in an Automated Narrative Information Extraction Pipeline.",
            "A User Trust System for Online Games - Part II: A Subjective Logic Approach for Trust Inference.",
            "Multistage Temporal Difference Learning for 2048-Like Games.",
            "Leveraging Intention Revision in Narrative Planning to Create Suspenseful Stories.",
            "Accelerating Board Games Through Hardware/Software Codesign.",
            "Multiagent Path Finding With Persistence Conflicts.",
            "Learning to Generate Video Game Maps Using Markov Models.",
            "Creating AI Characters for Fighting Games Using Genetic Programming."
        ]
    },
    {
        "name": "TG",
        "year": "2016",
        "info": "Volume 8: 2016",
        "count": 39,
        "papers": [
            "Predicting Dominance Rankings for Score-Based Games.",
            "Solving a Complex Language Game by Using Knowledge-Based Word Associations Discovery.",
            "Extending Real-Time Challenge Balancing to Multiplayer Games: A Study on Eco-Driving.",
            "Online Adaptable Learning Rates for the Game Connect-4.",
            "Intelligent Game Engine for Rehabilitation (IGER).",
            "Reinforcement Learning in Video Games Using Nearest Neighbor Interpolation and Metric Learning.",
            "Discovering Multimodal Behavior in Ms. Pac-Man Through Evolution of Modular Neural Networks.",
            "Prolog-Scripted Tactics Negotiation and Coordinated Team Actions for Counter-Strike Game Bots.",
            "Predicting Opponent's Production in Real-Time Strategy Games With Answer Set Programming.",
            "How to Run a Successful Game-Based AI Competition.",
            "Guest Editorial: Physics-Based Simulation Games.",
            "A Bayesian Ensemble Regression Framework on the Angry Birds Game.",
            "Akbaba - An Agent for the Angry Birds AI Challenge Based on Search and Simulation.",
            "Angry-HEX: An Artificial Player for Angry Birds Based on Declarative Knowledge Bases.",
            "s-Birds Avengers: A Dynamic Heuristic Engine-Based Agent for the Angry Birds Problem.",
            "Qualitative Physics in Angry Birds.",
            "Visual Detection of Unknown Objects in Video Games Using Qualitative Stability Analysis.",
            "PEARS: Physics Extension and Representation Through Semantics.",
            "A Distributed Agent for Computational Pool.",
            "A Straight Approach to Planning for 14.1 Billiards.",
            "Elicitation of Strategies in Four Variants of a Round-Robin Tournament: The Case of Goofspiel.",
            "Specialization of a UCT-Based General Game Playing Program to Single-Player Games.",
            "The 2014 General Video Game Playing Competition.",
            "Petalz: Search-Based Procedural Content Generation for the Casual Gamer.",
            "Calculating Ultrastrong and Extended Solutions for Nine Men's Morris, Morabaraba, and Lasker Morris.",
            "Optimization Using Boundary Lookup Jump Point Search.",
            "Comparing Heterogeneous and Homogeneous Flocking Strategies for the Ghost Team in the Game of Ms. Pac-Man.",
            "Exploiting Evolutionary Modeling to Prevail in Iterated Prisoner's Dilemma Tournaments.",
            "Time Management for Monte Carlo Tree Search.",
            "Guest Editorial Real-Time Strategy Games.",
            "Hybrid Pathfinding in StarCraft.",
            "Competitive Algorithms for Coevolving Both Game Content and AI. A Case Study: Planet Wars.",
            "Multiscale Bayesian Modeling for RTS Games: An Application to StarCraft AI.",
            "Evolving Effective Microbehaviors in Real-Time Strategy Games.",
            "Coevolving Robust Build-Order Iterative Lists for Real-Time Strategy Games.",
            "ghost: A Combinatorial Optimization Framework for Real-Time Problems.",
            "Coevolutionary CMA-ES for Knowledge-Free Learning of Game Position Evaluation.",
            "Intentionality and Conflict in The Best Laid Plans Interactive Narrative Virtual Environment.",
            "Statistical Relational Learning for Game Theory."
        ]
    },
    {
        "name": "TG",
        "year": "2015",
        "info": "Volume 7: 2015",
        "count": 33,
        "papers": [
            "Editorial: IEEE Transactions on Computational Intelligence and AI in Games.",
            "On Cost-Effective Incentive Mechanisms in Microtask Crowdsourcing.",
            "An Enhanced Solver for the Game of Amazons.",
            "Job-Level Alpha-Beta Search.",
            "Suspenser: A Story Generation System for Suspense.",
            "Multiple Opponent Optimization of Prisoner's Dilemma Playing Agents.",
            "Design and Implementation of Chinese Dark Chess Programs.",
            "Learning Behaviors of and Interactions Among Objects Through Spatio-Temporal Reasoning.",
            "Learning-Based Procedural Content Generation.",
            "Sequential Halving Applied to Trees.",
            "Equivalence Classes in Chinese Dark Chess Endgames.",
            "Creating Autonomous Adaptive Agents in a Real-Time First-Person Shooter Computer Game.",
            "Integrated Approach to Personalized Procedural Map Generation Using Evolutionary Algorithms.",
            "Stronger Virtual Connections in Hex.",
            "MCTS-Minimax Hybrids.",
            "Adaptive Shooting for Bots in First Person Shooter Games Using Reinforcement Learning.",
            "Fast Algorithm for Catching a Prey Quickly in Known and Partially Known Game Maps.",
            "Memory-Efficient Method for Fast Computation of Short 15-Puzzle Solutions.",
            "The Age of Analytics.",
            "An Analytic and Psychometric Evaluation of Dynamic Game Adaption for Increasing Session-Level Retention in Casual Games.",
            "Detecting Predatory Behavior in Game Chats.",
            "Player Preference and Style in a Leading Mobile Card Game.",
            "Thinking Style and Team Competition Game Performance and Enjoyment.",
            "Churn Prediction in Online Games Using Players' Login Records: A Frequency Analysis Approach.",
            "Clustering Game Behavior Data.",
            "Postprocessing Gameplay Metrics for Gameplay Performance Segmentation Based on Audiovisual Analysis.",
            "Past Our Prime: A Study of Age and Play Style Development in Battlefield 3.",
            "On Learning From Game Annotations.",
            "A Panorama of Artificial and Computational Intelligence in Games.",
            "Temporal Game Challenge Tailoring.",
            "Multiobjective Monte Carlo Tree Search for Real-Time Games.",
            "Distributed Monte Carlo Tree Search: A Novel Technique and its Application to Computer Go.",
            "Automated Planning and Player Modeling for Interactive Storytelling."
        ]
    },
    {
        "name": "TG",
        "year": "2014",
        "info": "Volume 6: 2014",
        "count": 33,
        "papers": [
            "General Self-Motivation and Strategy Identification: Case Studies Based on Sokoban and Pac-Man.",
            "Passing a Hide-and-Seek Third-Person Turing Test.",
            "Solving the Physical Traveling Salesman Problem: Tree Search and Macro Actions.",
            "Two Online Learning Playout Policies in Monte Carlo Go: An Application of Win/Loss States.",
            "DeepQA Jeopardy! Gamification: A Machine-Learning Perspective.",
            "A Micromanagement Task Allocation System for Real-Time Strategy Games.",
            "Procedural Generation of Dungeons.",
            "Guest Editorial: Computational Narrative and Games.",
            "Social Story Worlds With Comme il Faut.",
            "Versu - A Simulationist Storytelling System.",
            "A Computational Model of Narrative Generation for Surprise Arousal.",
            "Automated Story Selection for Color Commentary in Sports.",
            "Skald: Minstrel Reconstructed.",
            "Designing User-Character Dialog in Interactive Narratives: An Exploratory Experiment.",
            "Personalized Interactive Narratives via Sequential Recommendation of Plot Points.",
            "Lessons on Using Computationally Generated Influence for Shaping Narrative Experiences.",
            "A Supervised Learning Framework for Modeling Director Agent Strategies in Educational Interactive Narrative.",
            "Shall I Compare Thee to Another Story? - An Empirical Study of Analogy-Based Story Generation.",
            "Analysis of ReGEN as a Graph-Rewriting System for Quest Generation.",
            "Real-Time Monte Carlo Tree Search in Ms Pac-Man.",
            "An Automatically Generated Evaluation Function in General Game Playing.",
            "A Computational Model of Plan-Based Narrative Conflict at the Fabula Level.",
            "Good Machine Performance in Turing's Imitation Game.",
            "Preference Learning for Move Prediction and Evaluation Function Approximation in Othello.",
            "Guest Editorial: General Games.",
            "The Game Description Language Is Turing Complete.",
            "An Extensible Description Language for Video Games.",
            "The Axiom General Purpose Game Playing System.",
            "Efficiency of GDL Reasoners.",
            "A Neuroevolution Approach to General Atari Game Playing.",
            "Self-Adaptation of Playing Strategies in General Game Playing.",
            "EvoMCTS: A Scalable Approach for General Game Learning.",
            "Decaying Simulation Strategies."
        ]
    },
    {
        "name": "TG",
        "year": "2013",
        "info": "Volume 5: 2013",
        "count": 30,
        "papers": [
            "A Neurally Controlled Computer Game Avatar With Humanlike Behavior.",
            "Designing Automated Allocation Mechanisms for Service Procurement of Imperfectly Substitutable Services.",
            "Optimization of an Evaluation Function of the Four-Sided Dominos Game Using a Genetic Algorithm.",
            "Job-Level Proof Number Search.",
            "Monte Carlo Tree Search for Collaboration Control of Ghosts in Ms. Pac-Man.",
            "A Problem Case for UCT.",
            "Guest Editorial: Brain/neuronal - Computer game interfaces and interaction.",
            "Games, Gameplay, and BCI: The State of the Art.",
            "Steady-State Visual Evoked Potential-Based Computer Gaming on a Consumer-Grade EEG Device.",
            "Toward Contextual SSVEP-Based BCI Controller: Smart Activation of Stimuli and Control Weighting.",
            "Thinking Penguin: Multimodal Brain-Computer Interface Control of a VR Game.",
            "Controlling a Tactile ERP-BCI in a Dual Task.",
            "Adapting the P300-Based Brain-Computer Interface for Gaming: A Review.",
            "Evaluation and Comparison of a Multimodal Combination of BCI Paradigms and Eye Tracking With Affordable Consumer-Grade Hardware in a Gaming Context.",
            "On the Use of Games for Noninvasive EEG-Based Functional Brain Mapping.",
            "Electroencephalogram and Physiological Signal Analysis for Assessing Flow in Games.",
            "Experiencing BCI Control in a Popular Computer Game.",
            "Two Brains, One Game: Design and Evaluation of a Multiuser BCI Video Game Based on Motor Imagery.",
            "Monte Carlo Search Algorithm Discovery for Single-Player Games.",
            "On Scalability, Generalization, and Hybridization of Coevolutionary Learning: A Case Study for Othello.",
            "Database-Driven Real-Time Heuristic Search in Video-Game Pathfinding.",
            "Backward Induction and Repeated Games With Strategy Constraints: An Inspiration From the Surprise Exam Paradox.",
            "An Efficient Approach to Solving Nonograms.",
            "Applicability of GPGPU Computing to Real-Time AI Solutions in Games.",
            "Crowdsourcing the Aesthetics of Platform Games.",
            "A Survey of Real-Time Strategy Game AI Research and Competition in StarCraft.",
            "Repeated Goofspiel: A Game of Pure Strategy.",
            "A Heuristic-Based Planner and Improved Controller for a Two-Layered Approach for the Game of Billiards.",
            "Automated 3-D Animation From Snooker Videos With Information-Theoretical Optimization.",
            "Incentive Learning in Monte Carlo Tree Search."
        ]
    },
    {
        "name": "TG",
        "year": "2012",
        "info": "Volume 4: 2012",
        "count": 24,
        "papers": [
            "A Survey of Monte Carlo Tree Search Methods.",
            "Neurovisual Control in the Quake II Environment.",
            "The Mario AI Benchmark and Competitions.",
            "Monte Carlo Beam Search.",
            "N-Grams and the Last-Good-Reply Policy Applied in General Game Playing.",
            "A Discrete Evolutionary Model for Chess Players' Ratings.",
            "Evolving Multimodal Networks for Multitask Games.",
            "Bitwise-Parallel Reduction for Connection Tests.",
            "Information Set Monte Carlo Tree Search.",
            "Benchmarks for Grid-Based Pathfinding.",
            "Guest Editorial: Special Issue on Computational Aesthetics in Games.",
            "Unsupervised Modeling of Player Style With LDA.",
            "Beyond Skill Rating: Advanced Matchmaking in Ghost Recon Online.",
            "Evaluating the Aesthetics of Endgame Studies: A Computational Model of Human Aesthetic Perception.",
            "Experience-Driven Procedural Music Generation for Games.",
            "Continuous Recognition of Player's Affective Body Expression as Dynamic Quality of Aesthetic Experience.",
            "Adapting Models of Visual Aesthetics for Personalized Content Creation.",
            "Elegance in Game Design.",
            "Ensemble Determinization in Monte Carlo Tree Search for the Imperfect Information Card Game Magic: The Gathering.",
            "Introducing Individual and Social Learning Into Evolutionary Checkers.",
            "Evolutionary Design of FreeCell Solvers.",
            "Monte Carlo Tree Search for the Hide-and-Seek Game Scotland Yard.",
            "AntBot: Ant Colonies for Video Games.",
            "Bayesian-Game-Based Fuzzy Reinforcement Learning Control for Decentralized POMDPs."
        ]
    },
    {
        "name": "TG",
        "year": "2011",
        "info": "Volume 3: 2011",
        "count": 26,
        "papers": [
            "Launchpad: A Rhythm-Based Level Generator for 2-D Platformers.",
            "Modeling the Dynamics of Coalition Formation Games for Cooperative Spectrum Sharing in an Interference Channel.",
            "Effective Racing on Partially Observable Tracks: Indirectly Coupling Anticipatory Egocentric Sensors With Motor Commands.",
            "Reinforcement Learning in First Person Shooter Games.",
            "Best Reply Search for Multiplayer Games.",
            "Evolution of Strategies With Different Representation Schemes in a Spatial Iterated Prisoner's Dilemma Game.",
            "Adaptivity Challenges in Games and Simulations: A Survey.",
            "Two-Stage Monte Carlo Tree Search for Connect6.",
            "Partially Precomputed A*.",
            "A Dynamical Systems Approach for Static Evaluation in Go.",
            "Fast Approximate Max-n Monte Carlo Tree Search for Ms Pac-Man.",
            "Evolving Coordination for Real-Time Strategy Games.",
            "Guest Editorial: Procedural Content Generation in Games.",
            "Search-Based Procedural Content Generation: A Taxonomy and Survey.",
            "Answer Set Programming for Procedural Content Generation: A Design Space Approach.",
            "Tanagra: Reactive Planning and Constraint Solving for Mixed-Initiative Level Design.",
            "Generating Missions and Spaces for Adaptable Play Experiences.",
            "A Generic Approach to Challenge Modeling for the Procedural Creation of Video Game Levels.",
            "Automatic Track Generation for High-End Racing Games Using Evolutionary Computation.",
            "Search-Based Procedural Generation of Maze-Like Levels.",
            "Generating Consistent Buildings: A Semantic Approach for Integrating Procedural Techniques.",
            "Dynamic Game Difficulty Scaling Using Adaptive Behavior-Based AI.",
            "A Robust Learning Approach to Repeated Auctions With Monitoring and Entry Fees.",
            "The MP-MIX Algorithm: Dynamic Search Strategy Selection in Multiplayer Adversarial Search.",
            "The 2010 Mario AI Championship: Level Generation Track.",
            "Engineering Design of Strategies for Winning Iterated Prisoner's Dilemma Competitions."
        ]
    },
    {
        "name": "TG",
        "year": "2010",
        "info": "Volume 2: 2010",
        "count": 25,
        "papers": [
            "Evolutionary Game Design.",
            "RL-DOT: A Reinforcement Learning NPC Team for Playing Domination Games.",
            "Moving-Target Pursuit Algorithm Using Improved Tracking Strategy.",
            "Using Resource-Limited Nash Memory to Improve an Othello Evaluation Function.",
            "Modeling Player Experience for Content Creation.",
            "Cinematic Visual Discourse: Representation, Generation, and Evaluation.",
            "Towards Intelligent Team Composition and Maneuvering in Real-Time Strategy Games.",
            "Progress Through Uncertainty in Some Kriegspiel Endings.",
            "Controlled Procedural Terrain Generation Using Software Agents.",
            "The Design of Puzzle Selection Strategies for ESP-Like GWAP Systems.",
            "The 2009 Simulated Car Racing Championship.",
            "Automatic Generation of Game Level Solutions as Storyboards.",
            "Game Bot Detection via Avatar Trajectory Analysis.",
            "Learning to Drive in the Open Racing Car Simulator Using Online Neuroevolution.",
            "Relevance-Zone-Oriented Proof Search for Connect6.",
            "The Parametrized Probabilistic Finite-State Transducer Probe Game Player Fingerprint Model.",
            "Special Issue on Monte Carlo Techniques and Computer Go.",
            "Current Frontiers in Computer Go.",
            "Monte Carlo Tree Search in Lines of Action.",
            "Monte Carlo Tree Search in Hex.",
            "Fuego - An Open-Source Framework for Board Games and Go Engine Based on Monte Carlo Tree Search.",
            "Combining UCT and Nested Monte Carlo Search for Single-Player General Game Playing.",
            "Evaluating Root Parallelization in Go.",
            "Evaluation of Game Tree Search Methods by Game Records.",
            "The Power of Forgetting: Improving the Last-Good-Reply Policy in Monte Carlo Go."
        ]
    },
    {
        "name": "TG",
        "year": "2009",
        "info": "Volume 1: 2009",
        "count": 24,
        "papers": [
            "Computational Intelligence and AI in Games: A New IEEE Transactions.",
            "CadiaPlayer: A Simulation-Based General Game Player.",
            "Effective and Diverse Adaptive Game AI.",
            "Extending the Applicability of Pattern and Endgame Databases.",
            "Lightweight Procedural Animation With Believable Physical Interactions.",
            "Effects of Shared Perception on the Evolution of Squad Behaviors.",
            "Learning Finite-State Machine Controllers From Motion Capture Data.",
            "The Computational Intelligence of MoGo Revealed in Taiwan's Computer Go Tournaments.",
            "Rapid and Reliable Adaptation of Video Game AI.",
            "Public Goods Provision: An Evolutionary Game Theoretic Study Under Asymmetric Information.",
            "Real-Time Game Adaptation for Optimizing Player Satisfaction.",
            "Distributed Resource Allocation for Delay-Sensitive Services in Satellite Networks Using Game Theory.",
            "Dynamic Intelligent Lighting for Directing Visual Attention in Interactive 3-D Scenes.",
            "Fingerprint Analysis of the Noisy Prisoner's Dilemma Using a Finite-State Representation.",
            "A Turing Test for Computer Game Bots.",
            "Runtime Behavior Adaptation for Real-Time Interactive Games.",
            "Planning-Based Narrative Generation in Simulated Game Universes.",
            "Relationship Between Generalization and Diversity in Coevolutionary Learning.",
            "Proactive Mediation in Plan-Based Narrative Environments.",
            "Automatic Content Generation in the Galactic Arms Race Video Game.",
            "Adaptive Experience Engine for Serious Games.",
            "Simulation of the Dynamics of Nonplayer Characters' Emotions and Social Relations in Games.",
            "Query-Enabled Behavior Trees.",
            "Generation of Adaptive Dilemma-Based Interactive Narratives."
        ]
    }
]