[
    {
        "name": "WI",
        "year": "2021",
        "info": "Volume 19: 2021",
        "count": 24,
        "papers": [
            "A hybrid threat model for system-centric and attack-centric for effective security design in SDLC.",
            "Path coverage enhancement in wireless sensor networks based on CVT model.",
            "A novel gateway node reconfiguration method of IOT based on hierarchical coding particle swarm optimization.",
            "Rider and Sunflower optimization-driven neural network for image classification.",
            "Understanding the link between audience engagement metrics and the perceived quality of online news using machine learning.",
            "Graph-based knowledge tracing: Modeling student proficiency using graph neural networks.",
            "A prison term prediction model based on fact descriptions by capturing long historical information.",
            "Fast mining method of network heterogeneous fault tolerant data based on K-means clustering.",
            "A bit-object-based method for mining maximum frequent patterns in intensive cloud computing data.",
            "Feature mining method of information system operation and maintenance big data based on window function.",
            "Research on complex attribute big data classification based on iterative fuzzy clustering algorithm.",
            "Research on information classification and storage in cloud computing data center based on group collaboration intelligent clustering.",
            "Trends in web data extraction using machine learning.",
            "Research on internal network data security monitoring method based on NB-IoT.",
            "Integrity protection method for trusted data of IoT nodes based on transfer learning.",
            "Packet loss rate monitoring model of IoT based on differential evolution algorithm.",
            "An anti-tampering model of sensitive data in link network based on blockchain technology.",
            "A secure encryption method of communication channel based on cloud computing technology.",
            "Advanced ant colony algorithm for high dimensional abnormal data mining in Internet of things.",
            "Research on dynamic and secure storage of financial data based on cloud platform.",
            "Exponential Ant-Lion Rider Optimization for Privacy Preservation in Cloud Computing.",
            "A comprehensive survey on container resource allocation approaches in cloud computing: State-of-the-art and research challenges.",
            "Trust-based federated learning for network anomaly detection.",
            "A federated learning based semi-supervised credit prediction approach enhanced by multi-layer label mean."
        ]
    },
    {
        "name": "WI",
        "year": "2020",
        "info": "Volume 18: 2020",
        "count": 25,
        "papers": [
            "Real-time visualization to improve quality in computer mediated communication.",
            "2SRM: Learning social signals for predicting relevant search results.",
            "Cross-platform personality exploration system for online social networks: Facebook vs. Twitter.",
            "Deep text classification of Instagram data using word embeddings and weak supervision.",
            "A literature review of the current applications of machine learning and their practical implications.",
            "Interactive minutes generation system based on hierarchical discussion structure.",
            "Special issue on big data networking-challenges and applications.",
            "Fault-tolerant technology for big data cluster in distributed flow processing system.",
            "Research on the integration of library e-book borrowing history data based on big data technology.",
            "Research on interest reading recommendation method of intelligent library based on big data technology.",
            "Research on distributed data stream mining algorithms based on matrix weighted association rules.",
            "Accelerated algorithm for intelligent mining of communication data in cloud computing environment.",
            "Intelligent detection method for abnormal big data in heterogeneous networks based on Bayesian classification.",
            "Redundancy evaluation method of massive heterogeneous data in Internet of Things based on attributes and relations.",
            "Knowledge discovery and management on online social networks and media.",
            "From traceability to provenance of agricultural products through blockchain.",
            "Exploring propagation factors of social media moods for stock prices prediction.",
            "A survey on text classification and its applications.",
            "Image inspired Chinese couplet generation.",
            "ITIL process management to mitigate operations risk in cloud architecture infrastructure for banking and financial services industry.",
            "Document classification using convolutional neural networks with small window sizes and latent semantic analysis.",
            "A measure based pricing framework for data products.",
            "Correlation alignment with attention mechanism for unsupervised domain adaptation.",
            "Active learning strategies for solving the cold user problem in model-based recommender systems.",
            "Adversarial auto-encoder for rating prediction with ratings and reviews."
        ]
    },
    {
        "name": "WI",
        "year": "2019",
        "info": "Volume 17: 2019",
        "count": 30,
        "papers": [
            "Emotional machines: The next revolution.",
            "Sentiment analysis of Kazakh text and their polarity.",
            "Automating facial emotion recognition.",
            "Emotion and attention: Audiovisual models for group-level skin response recognition in short movies.",
            "A functional data analysis approach for continuous 2-D emotion annotations.",
            "'You will be judged by the music I hear': A study on the influence of music on moral judgement.",
            "Tracking a leader's humility and its emotions from body, face and voice.",
            "The universal theory of passionarity.",
            "Stress estimation in pedestrian crowds: Experimental data and simulations results.",
            "Special issue on big data for IoT cloud computing convergence.",
            "Combine availability with user preferences for efficient WSC.",
            "A task scheduling algorithm based on priority list and task duplication in cloud computing environment.",
            "Design of complex wind power generation parameter control system based on embedded control combined with Internet of Things.",
            "Higher mathematics teaching resource scheduling system based on cloud computing.",
            "Trip mode recognition using smartphone sensor data under different sampling frequencies.",
            "Data forwarding mechanism based on node function and node centricity.",
            "A fast optimal node locating algorithm for MIMO system communication based on link balance control.",
            "The importance of unexpectedness: Discovering buzzing stories in anomalous temporal graphs.",
            "Detecting depression from Internet behaviors by time-frequency features.",
            "Energy efficient opportunistic edge computing for the Internet of Things.",
            "Improving collaborative filtering recommender system results and performance using satisfaction degree and emotions of users.",
            "Modelling meme adoption pattern on online social networks.",
            "Website user content navigation behavior modeling using time series neural networks.",
            "Comparative evaluation of two approaches for retweet clustering: A text-based method and graph-based method.",
            "Processing of association rules with ontology in distributed NoSQL systems.",
            "Recommend interesting items: How can social curiosity help?",
            "Proposal of grade training method for quality improvement in microtask crowdsourcing.",
            "Chatbots for online banking services.",
            "Sentiment analysis of customer data.",
            "Combining semantic graph and probabilistic topic models for discovering coherent topics."
        ]
    },
    {
        "name": "WI",
        "year": "2018",
        "info": "Volume 16: 2018",
        "count": 25,
        "papers": [
            "Exploiting item-item relations to improve review-based rating prediction.",
            "A graph-based approach for resolving incoherent ontology mappings.",
            "Mining heterogeneous terrorist attack network using personalized PageRank.",
            "CAMF: Context Aware Matrix Factorization for Social Recommendation.",
            "Collaborative ensemble learning under differential privacy.",
            "Special issue: Mobile Web Data Analytics (part I).",
            "Hot time periods discovery for facility proportioning in urban commercial districts using POIs and mobile phone data.",
            "A Point-of-Interest recommendation method using user similarity.",
            "Content tracking by leveraging hashtag and time information in Twitter social media.",
            "Finger gesture recognition using a smartwatch with integrated motion sensors.",
            "uGait: A platform for automated quantitative gait analysis and its application to Parkinson's disease.",
            "An interview with Professor Raj Reddy on Web Intelligence (WI) and Computational Social Science (CSS).",
            "Special issue: Mobile web data analytics (part II).",
            "Speech emotion recognition of Chinese elderly people.",
            "Determining senior wellness status using an intelligent system based on wireless sensor network and bioinformation.",
            "Recognizing diseases from physiological time series data.",
            "Automatic domain terminology extraction and its evaluation for domain knowledge graph construction.",
            "Stochastic gradient descent with variance reduction technique.",
            "Automatic Chinese character similarity measurement.",
            "Transferring sentiment knowledge between words and tweets.",
            "Pancake graphs for lookup acceleration and optimization in P2P networks.",
            "Improvement of fusion algorithm using cascade method and implementation on proxy server for replacing negative content on a porn site.",
            "Special issue: Trust management.",
            "Negative trust for conflict resolution in software management.",
            "State of the art of reputation-enhanced recommender systems."
        ]
    },
    {
        "name": "WI",
        "year": "2017",
        "info": "Volume 15: 2017",
        "count": 20,
        "papers": [
            "Directional prediction of stock prices using breaking news on Twitter.",
            "A modular architecture for intelligent agents in the evented web.",
            "Discovery of dependency relations in sequential data flow.",
            "Life aspect inference of tweets based on probability distribution.",
            "A composite greedy seller strategy in decentralized many-to-many negotiation.",
            "Research dataset discovery from research publications using web context.",
            "Learning the sentiment of soccer fans from data on bets and social nets.",
            "Overlapping community detection and temporal analysis on Q&A sites.",
            "A survey of agent-oriented programming from software engineering perspective.",
            "The strategy and architecture of a winner broker in a renowned agent-based smart grid competition.",
            "Virtual communities, a typology.",
            "Enriching how-to guides with actionable phrases and linked data.",
            "A model for the behaviors and incentives of users in a decentralized data-sharing network.",
            "Automatic detection of multiple account deception in social media.",
            "Tracking millions of query intents with StarrySky and its applications.",
            "Impact of social influence on trust management within communities of agents.",
            "Mining the information architecture of the WWW using automated website boundary detection.",
            "Applying ontologies to the development and execution of Multi-Agent Systems.",
            "Using online data sources to make query suggestions for children.",
            "Mobile agents path planning based on an extension of Bug-Algorithms and applied to the pursuit-evasion game."
        ]
    },
    {
        "name": "WI",
        "year": "2016",
        "info": "Volume 14: 2016",
        "count": 21,
        "papers": [
            "An interaction-based approach to detecting highly interactive Twitter communities using tweeting links.",
            "Real-time, scalable, content-based Twitter users recommendation.",
            "IR based Task-Model Learning: Automating the hierarchical structuring of tasks.",
            "Paraconsistent argumentation schemes.",
            "A bottom-up search algorithm for size-constrained partitioning of modules to generate configurations in modular robots.",
            "Predicting political conflicts from polarized social media.",
            "An automatic approach for tagging Web services using machine learning techniques.",
            "Accurate and efficient query clustering via top ranked search results.",
            "Bimodal traffic regulation system: A multi-agent approach.",
            "Normative positions in multi-agent systems.",
            "Query aspects approach to web search.",
            "Uncertainty reasoning for smart homes: An ontological decision network based approach.",
            "Review of intelligent microblog short text processing.",
            "Quality improvement by worker filtering and development in crowdsourcing.",
            "Stochastic Petri net-based modeling and formal analysis of fault tolerant Contract Net Protocol.",
            "Special issue on knowledge management of web social media.",
            "Performance evaluation of Twitter datasets on SQL and NoSQL DBMS.",
            "A topic-based sentiment analysis model to predict stock market price movement using Weibo mood.",
            "A topical diversity-based approach to detecting similar question groups from collaborative question-answering archives.",
            "Factors to be considered in cloud computing adoption.",
            "An intelligent recommender system based on predictive analysis in telehealthcare environment."
        ]
    },
    {
        "name": "WI",
        "year": "2015",
        "info": "Volume 13: 2015",
        "count": 23,
        "papers": [
            "Preface.",
            "Semantic web based learning styles identification for social learning environments personalization.",
            "Assisting web document retrieval with topic identification in tourism domain.",
            "A normal-distribution based rating aggregation method for generating product reputations.",
            "Sentiment analysis of texts by capturing underlying sentiment patterns.",
            "Social media gerontology: Understanding social media usage among older adults.",
            "Intelligent interaction, reasoning, and applications.",
            "Card-type tool to support divergent thinking for embodying benefits of inconvenience.",
            "Gen-Meta: Generating metaphors by combining AI and corpus-based modeling.",
            "Automatic generation of visual story for fairy tales with digital narrative.",
            "Rank correlation analysis of RITE datasets and evaluation metrics - an observation on NTCIR-10 RITE Chinese subtasks.",
            "Editorial.",
            "Review mining for estimating users' ratings and weights for product aspects.",
            "DIKEA: Exploiting Wikipedia for keyphrase extraction.",
            "Reinforcement social learning of social optimality with influencer agents.",
            "A BDI-based agent architecture for social competent agents.",
            "Modelling human emotion in interactive environments: Physiological ensemble and grounded approaches for synthetic agents.",
            "Properties of a new adaptive sampling method with applications to scalable learning.",
            "Privacy preserving data release for tagging recommender systems.",
            "Top-N recommendations in the presence of sparsity: An NCD-based approach.",
            "Multi-mode Natural Language Processing for human-robot interaction.",
            "Learning and relearning of target decision strategies in continuous coordinated cleaning tasks with shallow coordination.",
            "On the emergence of semantic agreement among rational agents."
        ]
    },
    {
        "name": "WI",
        "year": "2014",
        "info": "Volume 12: 2014",
        "count": 23,
        "papers": [
            "Querying concepts in product data by means of query expansion.",
            "A framework for evaluating semantic annotations of Web services: A network theory based approach for measuring annotation quality.",
            "Composite match autocompletion (COMMA): A semantic result-oriented autocompletion technique for e-marketplaces.",
            "A method for avoiding the searching bias in ACO deceptive problem solving.",
            "Foundations of automatic system for intrasurgical localization of subthalamic nucleus in Parkinson patients.",
            "CooL-AgentSpeak: Endowing AgentSpeak-DL agents with plan exchange and ontology services.",
            "Dynamic multiagent load balancing using distributed constraint optimization techniques.",
            "Decision as choice of potential intentions.",
            "A syntactic possibilistic belief change operator: Theory and empirical study.",
            "Evaluating the applicability of peer-designed agents for mechanism evaluation.",
            "Activity-based topic discovery.",
            "Building up a class hierarchy with properties by refining and integrating Japanese Wikipedia Ontology and Japanese WordNet.",
            "Music recommenders based on hybrid techniques and serendipity.",
            "Predicting personality traits of microblog users.",
            "Improving cognitive agent decision making: Experience trajectories as plans.",
            "Modelling personal preferences for Top-N movie recommendations.",
            "Learning cooperative behavior for the shout-ahead architecture.",
            "Modeling emergent network organizations.",
            "Agent-based problem solving methods in Big Data environment.",
            "Multi-agent orienteering problem with time-dependent capacity constraints.",
            "Scalable approximating SVD algorithm for recommender systems.",
            "Detecting cyberbullying in social networks using multi-agent system.",
            "Web usage mining based recommender systems using implicit heterogeneous data: - A Particle Swarm Optimization based clustering approach."
        ]
    },
    {
        "name": "WI",
        "year": "2013",
        "info": "Volume 11: 2013",
        "count": 23,
        "papers": [
            "RoClust: Role discovery for graph clustering.",
            "Modelling biased human trust dynamics.",
            "An experimental analysis of suggestions in collaborative tagging.",
            "A computing approach to agent bidding in continuous double auction.",
            "Large-scale cooperative task distribution on peer-to-peer networks.",
            "Multiagent meta-level control for radar coordination.",
            "Investigating query bursts in a web search engine.",
            "A study on dynamic Semantic Web service composition.",
            "Personalized search in digital libraries via spreading activation model.",
            "Multi-label automatic indexing of music by cascade classifiers.",
            "An agent model for analysis of human performance quality.",
            "Analyzing the performance of multiple agents with varying bidding behaviors and standard bidders in online auctions.",
            "Influence of FFM/NEO PI-R personality traits on the rational process of autonomous agents.",
            "Sequential multi-agent exploration for a common goal.",
            "Robust estimation of a global Gaussian mixture by decentralized aggregations of local models.",
            "Qualitative preference-based service selection for multiple agents.",
            "Generating SPARQL queries using templates.",
            "Research topics on web intelligence and communities.",
            "Leveraging social network analysis with topic models and the Semantic Web (extended).",
            "Adaptiveness and social-compliance in trust management within virtual communities.",
            "Towards adaptive normative systems for communities of agents.",
            "A new dissimilarity measure for online social networks moderation.",
            "Acknowledgment."
        ]
    },
    {
        "name": "WI",
        "year": "2012",
        "info": "Volume 10: 2012",
        "count": 32,
        "papers": [
            "A system to support attention allocation: Development and application.",
            "Paraconsistent query answering over DL-Lite ontologies.",
            "Auction Network Trust: Evaluating user reputations from trading relationships in electronic commerce networks.",
            "Expectation of trading agent behaviour in negotiation of electronic marketplace.",
            "A fuzzy attitude based bidding strategy in continuous double auctions.",
            "Selecting queries from sample to crawl deep web data sources.",
            "Introducing Web Intelligence for communities.",
            "Discovering implicit communities in Web forums through ontologies.",
            "Handling privacy as contextual integrity in decentralized virtual communities: The PrivaCIAS framework.",
            "Roles in social networks: Methodologies and research issues.",
            "An obligation-based framework for web service composition via agent conversations.",
            "Text mining in negative relevance feedback.",
            "An intelligent Web agent that autonomously learns how to translate.",
            "On-line coordination: Event interaction and state communication between cooperative agents.",
            "Structure-aware graph anonymization.",
            "Towards improving the online shopping experience: A client-based platform for post-processing Web search results.",
            "Using multiagent self-organization techniques for seeking information in virtual social communities.",
            "OntoStoria2: A shared representation and a web-based tool for the collaboration of services providers.",
            "Visualizing the relevance of social ties in user profile modeling.",
            "Personalized recommender systems integrating tags and item taxonomy.",
            "Towards better understanding and utilizing relations in DBpedia.",
            "Robust distributed scheduling via time-period aggregation.",
            "Bricking Semantic Wikipedia by relation population and predicate suggestion.",
            "Modeling agents with a theory of mind: Theory-theory versus simulation theory.",
            "Embodiment of an agent by anthropomorphization of a common object.",
            "An approach to deriving a virtual thematic folksonomy based system from a social inter-folksonomy based scenario.",
            "Minimization of decoy effects in recommender result sets.",
            "Learning web-service task descriptions from traces.",
            "A distributed multi-agent planning approach for automated web services composition.",
            "Predicting community preference of comments on the Social Web.",
            "Abstraction relations between internal and behavioural agent models for collective decision making.",
            "Acknowledgment."
        ]
    },
    {
        "name": "WI",
        "year": "2011",
        "info": "Volume 9: 2011",
        "count": 24,
        "papers": [
            "sslGolog: When conditional compositions of web services meet semantic links and causal laws.",
            "SimPaD: A word-similarity sentence-based plagiarism detection tool on Web documents.",
            "On data fusion in information retrieval using different aggregation operators.",
            "On virtual agents that regulate each other's emotions.",
            "A cognitive approach to web-based intelligent agents: The TRIPLE architecture.",
            "On the use of reduction relations to relate different types of agent models.",
            "A multi-agent system for decentralised fractional shared resource constraint scheduling.",
            "Mining personal experiences and opinions from Web documents.",
            "Plan representation and execution in multi-actor scenarios by means of social commitments.",
            "Comparing Service-Oriented Computing and Agent-Oriented Programming towards integration.",
            "Agent-based vs. population-based simulation of displacement of crime: A comparative study.",
            "Configuration and control design model for an agent based Flexible Distributed System.",
            "Concept abduction and contraction in semantic-based P2P environments.",
            "Representing privacy regulations with deontico-temporal operators.",
            "Trust-based web service selection in virtual communities.",
            "Modeling user hidden navigational behavior for Web recommendation.",
            "An adaptive approach for the determination of the itinerary of imprecise mobile agents with timing constraints.",
            "A study of the impact of structure on cooperation in networks.",
            "Improving agent interoperability via the automatic enrichment of multi-category ontologies.",
            "Let's dans! An analytic framework of negotiation dynamics and strategies.",
            "Full discrimination of subtopics in search results with keyphrase-based clustering.",
            "Indexing method for transitive relationships of product information.",
            "Social control in a normative framework: An adaptive deterrence approach.",
            "Interplay of ethical trust and social moral norms: Environment modelling and computational mechanisms in agent-based social simulation (ABSS)."
        ]
    },
    {
        "name": "WI",
        "year": "2010",
        "info": "Volume 8: 2010",
        "count": 24,
        "papers": [
            "Collective iterative allocation: Enabling fast and optimal group decision makingThe role of group knowledge, optimism, and decision policies in distributed coordination.",
            "Learning subsumption hierarchies of ontology concepts from texts.",
            "Estimating the size and evolution of categorised topics in web directories.",
            "Multiple criteria programming models for VIP E-Mail behavior analysis.",
            "Towards a systematic approach for designing autonomic systems.",
            "An architectural description language for secure Multi-Agent Systems.",
            "Incentivizing connectivity in structured Peer-to-Peer systems.",
            "HITS algorithm improvement using semantic text portion.",
            "Spatial pattern growth and emergent animat segregation.",
            "Application of rough ensemble classifier to web services categorization and focused crawling.",
            "Information security underlying transparent computing: Impacts, visions and challenges.",
            "Anonymity services for multi-agent systems.",
            "A knowledge-based model using ontologies for personalized web information gathering.",
            "Fluctuated peer selection policy and its performance in large-scale multi-agent systems.",
            "A multiagent architecture for controlling the Palamede satellite.",
            "Leveraging sentiment analysis for topic detection.",
            "Introducing communication in Dis-POMDPs with locality of interaction.",
            "Model identification in interactive influence diagrams using mutual information.",
            "Keyword auction protocol for dynamically adjusting the number of advertisements.",
            "Assumption-based reasoning in dynamic normative agent systems.",
            "Solving coarse-grained DisCSPs with local search.",
            "Emotion Sensitive News Agent (ESNA): A system for user centric emotion sensing from the news.",
            "Formal semantics-preserving translation from fuzzy ER model to fuzzy OWL DL ontology.",
            "Model guided algorithm for mining unordered embedded subtrees."
        ]
    },
    {
        "name": "WI",
        "year": "2009",
        "info": "Volume 7: 2009",
        "count": 24,
        "papers": [
            "Evaluation of properties in the transition of capability based agent organization.",
            "WSMO-MX: A hybrid Semantic Web service matchmaker.",
            "Fine-grained efficient resource allocation using approximated combinatorial auctionsA parallel greedy winner approximation for large-scale problems.",
            "Building more robust multi-agent systems using a log-based approach.",
            "Simulation and formal analysis of visual attention.",
            "Enhancing communication with groups of agents using learned non-unanimous ontology concepts.",
            "Learning the IPA market with individual and social rewards.",
            "Using interaction models to detect and resolve inconsistencies in evolving service compositions.",
            "Acquisition of a concession strategy in multi-issue negotiation.",
            "Fuzzy adaptive agent for supply chain management.",
            "Identifying document topics using the Wikipedia category network.",
            "Privacy-conscious P2P data sharing scheme with bogus profile distribution.",
            "Norm emergence in agent societies formed by dynamically changing networks.",
            "Utility based Q-learning to facilitate cooperation in Prisoner's Dilemma games.",
            "COBRA - mining web for COrporate Brand and Reputation Analysis.",
            "A lightweight fault tolerance framework for Web services.",
            "Wrapping VRXQuery with self-adaptive fuzzy capabilities.",
            "Layered RDF: An object-oriented approach to web information representation.",
            "Concordance-based entity-oriented search.",
            "The price of stability in selfish scheduling games.",
            "Meta-agency and individual power.",
            "Building application ontologies from descriptions of Semantic Web Services.",
            "FICA: A novel intelligent crawling algorithm based on reinforcement learning.",
            "A hybrid plan recognition model for Alzheimer's patients: Interleaved-erroneous dilemma."
        ]
    },
    {
        "name": "WI",
        "year": "2008",
        "info": "Volume 6: 2008",
        "count": 22,
        "papers": [
            "Considering operational issues for multiagent conceptual inferencing in a distributed information retrieval application.",
            "Controlling non-normative behaviors by anticipation for autonomous agents.",
            "Generic command interpretation algorithms for conversational agents.",
            "Knowledge reuse for software reuse.",
            "Fuzzy neural Web agents for efficient NBA scouting.",
            "Optimal combinatorial electricity markets.",
            "Delegations guided by trust and autonomy.",
            "Interval rough mereology and description logic: An approach to formal treatment of imprecision in the Semantic Web ontologies.",
            "Symbolic negotiation: Partial deduction for linear logic with coalition formation.",
            "Neural networks against genetic algorithms for negotiating agent behaviour prediction.",
            "Towards a tuplespace-based middleware for the Semantic Web.",
            "Computational Intelligence techniques for Web personalization.",
            "Monitoring the status of a research community through a Knowledge Map.",
            "Using multi-agent platform for pure decentralised business workflows.",
            "Investigating adaptive, confidence-based strategic negotiations in complex multiagent environments.",
            "A general framework for parallel BDI agents in dynamic environments.",
            "Tools for analyzing intelligent agent systems.",
            "State space segmentation for acquisition of agent behavior.",
            "Exploring local community structures in large networks.",
            "A unified framework for multiple criteria auction mechanisms.",
            "Itinerary determination of imprecise mobile agents with firm deadline.",
            "Web search engine working as a bee hive."
        ]
    },
    {
        "name": "WI",
        "year": "2007",
        "info": "Volume 5: 2007",
        "count": 25,
        "papers": [
            "A novel ant clustering algorithm based on cellular automata.",
            "Real-time cooperative multi-target tracking by dense communication among Active Vision Agents.",
            "Tracking reliability and helpfulness in agent interactions.",
            "Programming mobile intelligent agents: An operational semantics.",
            "Social-oriented engineering of intelligent software.",
            "pRoute: Peer selection using shared term similarity matrices.",
            "Ontology construction and concept reuse with formal concept analysis for improved web document retrieval.",
            "An improved Bayesian network structure learning algorithm and its application in an intelligent B2C portal.",
            "Design, implementation and run-time evolution of a mission-based multiagent system.",
            "Timed environment for web agents.",
            "Personalized redirection and content adaptation for increased user control of communications.",
            "A compositional framework for the specification of interaction protocols in multiagent organizations.",
            "The LighTS tuple space framework and its customization for context-aware applications.",
            "Mining world knowledge for analysis of search engine content.",
            "Building agent-based hybrid intelligent systems: A case study.",
            "Utilization of intelligent agents for supporting citizens in their access to e-government services.",
            "VisiQ: Supporting visual and interactive query refinement.",
            "Fuzzy Q-Learning with the modified fuzzy ART neural network.",
            "Identifying a hierarchy of bipartite subgraphs for web site abstraction.",
            "Multi-party communication and information-need anticipation by experience.",
            "Semantic based collaborative P2P in ubiquitous computing.",
            "From social power to social importance.",
            "Relation discovery from web data for competency management.",
            "Encoding process algebraic descriptions of web services into BPEL.",
            "ForMAAD: A formal method for agent-based application design."
        ]
    },
    {
        "name": "WI",
        "year": "2006",
        "info": "Volume 4: 2006",
        "count": 24,
        "papers": [
            "A complex adaptive system based on squirrels behaviors for distributed resource allocation.",
            "WSIPL: An XML scripting language for integrating web service data and applications.",
            "Usability in mobile interface browsing.",
            "Self-configuration protocols for P2P networks.",
            "A web-based bayesian intelligent tutoring system for computer programming.",
            "A web information system for determining the controllers of financial entities in central bank of Brazil.",
            "On the enhancement of collaborative filtering by demographic data.",
            "Simplification and analysis of transitive trust networks.",
            "Temporal multi-page summarization.",
            "An XML-based agent model for supporting user activities on the Web.",
            "Mechanism design for multi-agent meeting scheduling.",
            "Privacy-preserving agent-based distributed data clustering.",
            "Multi-domain strategy coordination approach for optimal resource usage in agent based filtering framework.",
            "Improving observation-based modeling of other agents using tentative stereotyping and compactification through kd-tree structuring.",
            "TSSP: Multi-features based reinforcement algorithm to find related papers.",
            "Combining multidimensional user models and knowledge representation and management techniques for making web services knowledge-aware.",
            "Ontology-based integration of business intelligence.",
            "A semi-supervised efficient learning approach to extract biological relationships from web-based biomedical digital library.",
            "Defending against distributed denial-of-service attacks with an auction-based method.",
            "Forming and searching content-based hierarchical agent clusters in distributed information retrieval systems.",
            "A default extension to distributed description logics.",
            "An extended agent model embedded with \"intelligent-deliberation\" for improved performances in a container terminal application.",
            "Information extraction and imprecise query answering from web documents.",
            "A study on rough set-aided feature selection for automatic web-page classification."
        ]
    },
    {
        "name": "WI",
        "year": "2005",
        "info": "Volume 3: 2005",
        "count": 16,
        "papers": [
            "SERGEANT: A framework for building more flexible web agents by exploiting a search engine.",
            "Gradient descent for symmetric and asymmetric multiagent reinforcement learning.",
            "Dynamic self organizing maps for discovery and sharing of knowledge in multi agent systems.",
            "Survival of the Assistive. Toward biomimetic ambient intelligence.",
            "Organizational models and interaction patterns for use in the analysis and design of multi-agent systems.",
            "On the stability of a dynamic stochastic capacity pricing scheme for resource allocation in a multi-agent environment.",
            "Many is more: The utility of simple reactive agents with predictive mechanisms in multiagent object collection tasks.",
            "Exploiting Webspace organization for accelerating web prefetching.",
            "Personalisation in news delivery systems: Item summarization and multi-tier item selection using relevance feedback.",
            "Information-need driven query refinement.",
            "A document retrieval support system with term relationship.",
            "Information categorization in web pages and sites.",
            "Clustering web pages about persons and organizations.",
            "An intelligent speech interface for personal assistants applied to knowledge management.",
            "Hybrid negotiation for resource coordination in multiagent systems.",
            "Matching and retrieving sequential patterns using regression."
        ]
    },
    {
        "name": "WI",
        "year": "2004",
        "info": "Volume 2: 2004",
        "count": 19,
        "papers": [
            "The construction of secure mobile agents via evaluating encrypted functions.",
            "Incremental personalized web page mining utilizing self-organizing HCMAC neural network.",
            "World Wide Web site summarization.",
            "XICOMAS_Q: An XML-based Information Content Oriented Multi-Agent System for QoS management in telecommunications networks.",
            "A task-oriented agent-based mechanism for mathematical assistant systems.",
            "A layered approach to complex negotiations.",
            "Asymmetric multiagent reinforcement learning.",
            "Mining natural language answers from the web.",
            "A web navigation system based on a neural network user-model trained with only positive web documents.",
            "Towards a conversation-driven composition of web services.",
            "Multi-agent approach to localization problems: The case of Multilayered Multi-Agent Situated System.",
            "Towards a formalization of value-centric trust in agent societies.",
            "Modelling social behavior with a socio psychological simulation approach.",
            "Proxy ecology - Cooperative proxies with artificial life.",
            "Interval set clustering of web users using modified Kohonen self-organizing maps based on the properties of rough sets.",
            "Information needs in agent teamwork.",
            "Two-phase Web site classification based on Hidden Markov Tree models.",
            "Web directories as a knowledge base to build a multi-agent system for information sharing.",
            "Query cost estimation through remote system contention states analysis over the Internet."
        ]
    },
    {
        "name": "WI",
        "year": "2003",
        "info": "Volume 1: 2003",
        "count": 18,
        "papers": [
            "Introduction: A journal pivotal to the future of Web intelligence and agent systems.",
            "Cooperation strategies for agent-based P2P systems.",
            "Agents handling annotation distribution in a corporate semantic Web.",
            "A new swarm mechanism based on social spiders colonies: From web weaving to region detection.",
            "The ACORN multi-agent system.",
            "Designing Grid services for distributed knowledge discovery.",
            "Dynamic communities in referral networks.",
            "Smart distance principle for \"sense and respond\" enterprise systems.",
            "Emergence of coordination in scale-free networks.",
            "A method for solving distributed service allocation problems.",
            "Context-sensitive text mining and belief revision for intelligent information retrieval on the web.",
            "A resource based framework for planning and replanning.",
            "A multi-agent system integrating reinforcement learning, bidding and genetic algorithms.",
            "Learning when and how to coordinate.",
            "Ontology-based personalized search and browsing.",
            "Complex semantic web ontology mapping.",
            "Context-sensitive filtering for the web.",
            "Design considerations for a CORBA-based architecture for lightweight agents (CARLA)."
        ]
    }
]