[
    {
        "year": "2021",
        "name": "32nd ASAP 2021",
        "info": "Virtual Evenet, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2021",
                "sub_name": "32nd IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2021, Virtual Conference, USA, July 7-9, 2021.",
                "count": 39,
                "papers": [
                    "To Buffer, or Not to Buffer? A Case Study on FFT Accelerators for Ultra-Low-Power Multicore Clusters.",
                    "Algorithm and Hardware Co-Design for FPGA Acceleration of Hamiltonian Monte Carlo Based No-U-Turn Sampler.",
                    "Improving Inference Lifetime of Neuromorphic Systems via Intelligent Synapse Mapping.",
                    "A lightweight ISE for ChaCha on RISC-V.",
                    "RFC-HyPGCN: A Runtime Sparse Feature Compress Accelerator for Skeleton-Based GCNs Action Recognition Model with Hybrid Pruning.",
                    "Virtual Circuit-Switching Network with Flexible Topology for High-Performance FPGA Cluster.",
                    "Power, Performance and Area Consequences of Multi-Context Support in CGRAs.",
                    "SPNC: Accelerating Sum-Product Network Inference on CPUs and GPUs.",
                    "NEMO-CNN: An Efficient Near-Memory Accelerator for Convolutional Neural Networks.",
                    "Edge-disjoint spanning trees in the line graph of hypercubes.",
                    "Customized Instruction on RISC-V for Winograd-Based Convolution Acceleration.",
                    "Real-Time Super-Resolution System of 4K-Video Based on Deep Learning.",
                    "An Efficient Real-Time Object Detection Framework on Resource-Constricted Hardware Devices via Software and Hardware Co-design.",
                    "Binary Complex Neural Network Acceleration on FPGA : (Invited Paper).",
                    "How to Reach Real-Time AI on Consumer Devices? Solutions for Programmable and Custom Architectures.",
                    "Talos: A Weighted Speedup-Aware Device Placement of Deep Learning Models.",
                    "Hodgkin-Huxley-Based Neural Simulation with Networks Connecting to Near-Neighbor Neurons.",
                    "Accelerating Recurrent Neural Networks for Gravitational Wave Experiments.",
                    "Array-Aware Neural Architecture Search.",
                    "TwinDNN: A Tale of Two Deep Neural Networks.",
                    "Image caption generation method based on an interaction mechanism and scene concept selection module.",
                    "OpenCGRA: Democratizing Coarse-Grained Reconfigurable Arrays.",
                    "CGRA-ME: An Open-Source Framework for CGRA Architecture and CAD Research : (Invited Paper).",
                    "Number Theoretic Transform Architecture suitable to Lattice-based Fully-Homomorphic Encryption.",
                    "ABACa: Access Based Allocation on Set Wise Multi-Retention in STT-RAM Last Level Cache.",
                    "DARM: A Low-Complexity and Fast Modular Multiplier for Lattice-Based Cryptography.",
                    "XDIVINSA: eXtended DIVersifying INStruction Agent to Mitigate Power Side-Channel Leakage.",
                    "Memory-aware Efficient Deep Learning Mechanism for IoT Devices.",
                    "AERO: Towards Energy-Efficient Autonomous Flight in MAVs Using Approximate Execution.",
                    "A Low Power Branch Prediction for Deep Learning on RISC-V Processor.",
                    "Parallel Construction of Independent Spanning Trees on Folded Crossed Cubes.",
                    "Assessing Robustness of Hyperdimensional Computing Against Errors in Associative Memory : (Invited Paper).",
                    "Towards Automatic and Agile AI/ML Accelerator Design with End-to-End Synthesis.",
                    "ASBNN: Acceleration of Bayesian Convolutional Neural Networks by Algorithm-hardware Co-design.",
                    "A Novel Ring-based Small-World NoC for Neuromorphic Processor.",
                    "Double-Pumping the Interconnect for Area Reduction in Coarse-Grained Reconfigurable Arrays.",
                    "An Efficient Hardware Architecture for Sparse Convolution using Linear Feedback Shift Registers.",
                    "WinoCNN: Kernel Sharing Winograd Systolic Array for Efficient Convolutional Neural Network Acceleration on FPGAs.",
                    "FlexACC: A Programmable Accelerator with Application-Specific ISA for Flexible Deep Neural Network Inference."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st ASAP 2020",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2020",
                "sub_name": "31st IEEE International Conference on Application-specific Systems, Architectures and Processors , ASAP 2020, Manchester, United Kingdom, July 6-8, 2020.",
                "count": 34,
                "papers": [
                    "Accelerating Radiative Transfer Simulation with GPU-FPGA Cooperative Computation.",
                    "BWOLF: Bit-Width Optimization for Statistical Divergence with -Logarithmic Functions.",
                    "Reconfigurable Stream-based Tensor Unit with Variable-Precision Posit Arithmetic.",
                    "FPGA-Based Network Microburst Analysis System with Flow Specification and Efficient Packet Capturing.",
                    "FPGAs in the Datacenters: the Case of Parallel Hybrid Super Scalar String Sample Sort.",
                    "Combining Fixed-Point and SORN Arithmetic in a MIMO BPSK-Symbol Detection Architecture.",
                    "Dynamic Sharing in Multi-accelerators of Neural Networks on an FPGA Edge Device.",
                    "A New Hardware Approach to Self-Organizing Maps.",
                    "Fast and Accurate Training of Ensemble Models with FPGA-based Switch.",
                    "An Efficient Convolution Engine based on the À-trous Spatial Pyramid Pooling.",
                    "Architecture Support for FPGA Multi-tenancy in the Cloud.",
                    "Improved Side-Channel Resistance by Dynamic Fault-Injection Countermeasures.",
                    "Termination detection for fine-grained message-passing architectures.",
                    "Message from the Conference Chairs - ASAP 2020.",
                    "Temporal Motionless Analysis of Video using CNN in MPSoC.",
                    "ParaHist: FPGA Implementation of Parallel Event-Based Histogram for Optical Flow Calculation.",
                    "FPGA-Accelerated Time Series Mining on Low-Power IoT Devices.",
                    "Anytime Floating-Point Addition and Multiplication-Concepts and Implementations.",
                    "A Template-based Framework for Exploring Coarse-Grained Reconfigurable Architectures.",
                    "Hamamu: Specializing FPGAs for ML Applications by Adding Hard Matrix Multiplier Blocks.",
                    "Hardware Acceleration of Large Scale GCN Inference.",
                    "Design Space Exploration for Softmax Implementations.",
                    "Array Aware Training/Pruning: Methods for Efficient Forward Propagation on Array-based Neural Network Accelerators.",
                    "Condensing an overload of parallel computing ingredients into a single architecture recipe.",
                    "Training Neural Nets using only an Approximate Tableless LNS ALU.",
                    "A Design Methodology for Post-Moore's Law Accelerators: The Case of a Photonic Neuromorphic Processor.",
                    "SLATE: Managing Heterogeneous Cloud Functions.",
                    "Efficient Floating-Point Implementation of the Probit Function on FPGAs.",
                    "A Parallel-friendly Majority Gate to Accelerate In-memory Computation.",
                    "Persistent Fault Analysis of Neural Networks on FPGA-based Acceleration System.",
                    "Efficient FeFET Crossbar Accelerator for Binary Neural Networks.",
                    "A System for Generating Non-Uniform Random Variates using Graphene Field-Effect Transistors.",
                    "Optimizing Grouped Convolutions on Edge Devices.",
                    "Low-Cost DNN Hardware Accelerator for Wearable, High-Quality Cardiac Arrythmia Detection."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th ASAP 2019",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2019",
                "sub_name": "30th IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2019, New York, NY, USA, July 15-17, 2019.",
                "count": 55,
                "papers": [
                    "F-E3D: FPGA-based Acceleration of an Efficient 3D Convolutional Neural Network for Human Action Recognition.",
                    "LP-BNN: Ultra-low-Latency BNN Inference with Layer Parallelism.",
                    "Efficient Weight Reuse for Large LSTMs.",
                    "Photonic Processor for Fully Discretized Neural Networks.",
                    "Transparent Heterogeneous Cloud Acceleration.",
                    "CRbS: A Code Reordering Based Speeding-up Method of Irregular Loops on CMP.",
                    "Impact of Structural Faults on Neural Network Performance.",
                    "Energy-Efficient Near-Sensor Convolution using Pulsed Unary Processing.",
                    "An Efficient Application Specific Instruction Set Processor (ASIP) for Tensor Computation.",
                    "MITRACA: Manycore Interlinked Torus Reconfigurable Accelerator Architecture.",
                    "DeltaNet: Differential Binary Neural Network.",
                    "Using Residue Number Systems to Accelerate Deterministic Bit-stream Multiplication.",
                    "Precision Adaptation for Fast and Accurate Polynomial Evaluation Generation.",
                    "Maestro: A Memory-on-Logic Architecture for Coordinated Parallel Use of Many Systolic Arrays.",
                    "Sparstition: A Partitioning Scheme for Large-Scale Sparse Matrix Vector Multiplication on FPGA.",
                    "End-to-end Dynamic Stream Processing on Maxeler HLS Platforms.",
                    "Sparse Matrix to Matrix Multiplication: A Representation and Architecture for Acceleration.",
                    "HelmGemm: Managing GPUs and FPGAs for Transprecision GEMM Workloads in Containerized Environments.",
                    "Error Analysis of the Square Root Operation for the Purpose of Precision Tuning: A Case Study on K-means.",
                    "FPGA Architectures for Real-time Dense SLAM.",
                    "Customisable Control Policy Learning for Robotics.",
                    "Resilient Neural Network Training for Accelerators with Computing Errors.",
                    "VLIW Based Runtime Reconfigurable Machine Vision Coprocessor Architecture for Edge Computing.",
                    "PAI-FCNN: FPGA Based Inference System for Complex CNN Models.",
                    "Event-Based Re-configurable Hierarchical Processors for Smart Image Sensors.",
                    "OpenVX Graph Optimization for Visual Processor Units.",
                    "Application Specific Architecture for Hardware Accelerating HOG-SVM to Achieve High Throughput on HD Frames.",
                    "A Quantitative Approach for Refactoring NFV-based Mobile Core Networks.",
                    "Fooling AI with AI: An Accelerator for Adversarial Attacks on Deep Learning Visual Classification.",
                    "A Virtual Image Accelerator for Graph Cuts Inference on FPGA.",
                    "Implications for Hardware Acceleration of Malware Detection.",
                    "POSTER: GPUs Pipeline Latency Analysis.",
                    "Context-Aware Number Generator for Deterministic Bit-stream Computing.",
                    "Smart Rabbit - A Wearable Device As An Intelligent Pacer for Marathon Runners.",
                    "Real Processing-in-Memory with Memristive Memory Processing Unit (mMPU).",
                    "PPAC: A Versatile In-Memory Accelerator for Matrix-Vector-Product-Like Operations.",
                    "Parallel Stateful Logic in RRAM: Theoretical Analysis and Arithmetic Design.",
                    "An Overlay Architecture for Pattern Matching.",
                    "Towards Real Time Radiotherapy Simulation.",
                    "Accelerating AP3M-Based Computational Astrophysics Simulations with Reconfigurable Clusters.",
                    "A Programmable Architecture for Robot Motion Planning Acceleration.",
                    "Leveraging Energy Cycle Regularity to Predict Adaptive Mode for Non-volatile Processors.",
                    "An Adaptive Memory Management Strategy Towards Energy Efficient Machine Inference in Event-Driven Neuromorphic Accelerators.",
                    "Improving Emulation of Quantum Algorithms using Space-Efficient Hardware Architectures.",
                    "Combining Clock and Voltage Noise Countermeasures Against Power Side-Channel Analysis.",
                    "Investigating the Feasibility of FPGA-based Network Switches.",
                    "A Well-Equipped Implementation: Normal/Denormalized Half/Single/Double Precision IEEE 754 Floating-Point Adder/Subtracter.",
                    "SMPTE ST 2110 Compliant Scalable Architecture on FPGA for end to end Uncompressed Professional Video Transport Over IP Networks.",
                    "Understanding Performance Gains of Accelerator-Rich Architectures.",
                    "Base64 Encoding on Heterogeneous Computing Platforms.",
                    "Statistical Performance Prediction for Multicore Applications Based on Scalability Characteristics.",
                    "Molecular Dynamics Range-Limited Force Evaluation Optimized for FPGAs.",
                    "Refine and Recycle: A Method to Increase Decompression Parallelism.",
                    "Efficient Architectures and Implementation of Arithmetic Functions Approximation Based Stochastic Computing.",
                    "Bank-selective Strategy for Gate-based Ternary Content-addressable Memory on FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th ASAP 2018",
        "info": "Milano, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2018",
                "sub_name": "29th IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2018, Milano, Italy, July 10-12, 2018.",
                "count": 41,
                "papers": [
                    "GPU Acceleration of Advanced k-mer Counting for Computational Genomics.",
                    "Simple Instruction-Set Computer for Area and Energy-Sensitive IoT Edge Devices.",
                    "A Configurable Framework for Hough-Transform-Based Embedded Object Recognition Systems.",
                    "Reconfigurable Co-Processor Architecture with Limited Numerical Precision to Accelerate Deep Convolutiosnal Neural Networks.",
                    "Hardware Compilation of Deep Neural Networks: An Overview.",
                    "Fast Energy Estimation Through Partial Execution of HPC Applications.",
                    "BiSME: A Hardware Coprocessor to Perform Signature Matching at Multi-Gigabit Rates.",
                    "Resource-efficient Reconfigurable Computer-on-Module for Embedded Vision Applications.",
                    "Clarifications and Optimizations on Rounding for IEEE-compliant Floating-Point Multiplication.",
                    "From Tensor Algebra to Hardware Accelerators: Generating Streaming Architectures for Solving Partial Differential Equations.",
                    "Synthetic Data Approach for Classification and Regression.",
                    "REMAP: Remote mEmory Manager for disAggregated Platforms.",
                    "Design Space Exploration for Orlando Ultra Low-Power Convolutional Neural Network SoC.",
                    "Five-point algorithm: An efficient cloud-based FPGA implementation.",
                    "A Highly Accurate Energy Model for Task Execution on Heterogeneous Compute Nodes.",
                    "Towards Hardware Accelerated Reinforcement Learning for Application-Specific Robotic Control.",
                    "Performance Estimation of Deeply Pipelined Fluid Simulation on Multiple FPGAs with High-speed Communication Subsystem.",
                    "GAP-8: A RISC-V SoC for AI at the Edge of the IoT.",
                    "Meta-implementation of vectorized logarithm function in binary floating-point arithmetic.",
                    "Adaptively Banded Smith-Waterman Algorithm for Long Reads and Its Hardware Accelerator.",
                    "A Scalable FPGA Design for Cloud N-Body Simulation.",
                    "Dynamic Coherent Cluster: A Scalable Sharing Set Management Approach.",
                    "A Unified Backend for Targeting FPGAs from DSLs.",
                    "Invasive Computing for Predictability of Multiple Non-functional Properties: A Cyber-Physical System Case Study.",
                    "Implementing and Parallelizing Real-time Lane Detection on Heterogeneous Platforms.",
                    "Real-Time High-Quality Stereo Matching System on a GPU.",
                    "A Soft Dual-Processor System with a Partially Run-Time Reconfigurable Shared 128-Bit SIMD Engine.",
                    "A Reading Comprehension Style Question Answering Model Based On Attention Mechanism.",
                    "Edge Intelligence: Challenges and Opportunities of Near-Sensor Machine Learning Applications.",
                    "FPGA-based PairHMM Forward Algorithm for DNA Variant Calling.",
                    "Linux synchronization barrier on MPSoC: Hardware/software accurate study and optimization.",
                    "A Real-Time Learning-Based Super-Resolution System Using Direct Simple Functions.",
                    "An Explicitly Parallel Architecture for Packet Parsing in Software Defined Networks.",
                    "A Customized Processing-in-Memory Architecture for Biological Sequence Alignment.",
                    "Touch-based Smartphone Authentication Using Import Vector Domain Description.",
                    "Data-flow Aware CNN Accelerator with Hybrid Wireless Interconnection.",
                    "Solving Maxwell's Equations with Modern C++ and SYCL: A Case Study.",
                    "Enhanced Visual Loop Closing for Laser-Based SLAM.",
                    "Low-power Design of a Gravity Rotation Module for HAR Systems Based on Inertial Sensors.",
                    "Compressive Sensing on Storage Data: An Effective Solution to Alleviate I/0 Bottleneck in Data- Intensive Workloads.",
                    "Clean the Scratch Registers: A Way to Mitigate Return-Oriented Programming Attacks."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28th ASAP 2017",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2017",
                "sub_name": "28th IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2017, Seattle, WA, USA, July 10-12, 2017.",
                "count": 36,
                "papers": [
                    "A message from the general chair and program chair.",
                    "CATERPILLAR: Coarse Grain Reconfigurable Architecture for accelerating the training of Deep Neural Networks.",
                    "Fast and efficient implementation of Convolutional Neural Networks on FPGA.",
                    "Parallel Multi Channel convolution using General Matrix Multiplication.",
                    "High-performance FPGA implementation of equivariant adaptive separation via independence algorithm for Independent Component Analysis.",
                    "Design and comparative evaluation of GPGPU- and FPGA-based MPSoC ECU architectures for secure, dependable, and real-time automotive CPS.",
                    "High-Level Synthesis for side-channel defense.",
                    "DoSGuard: Protecting pipelined MPSoCs against hardware Trojan based DoS attacks.",
                    "Hardwiring the OS kernel into a Java application processor.",
                    "Hardware support for embedded operating system security.",
                    "Hardware-accelerated CCD readout smear correction for Fast Solar Polarimeter.",
                    "Real-time object detection in software with custom vector instructions and algorithm changes.",
                    "An efficient embedded multi-ported memory architecture for next-generation FPGAs.",
                    "A Staged Memory Resource Management Method for CMP systems.",
                    "CFStore: Boosting Hybrid storage performance by device crossfire.",
                    "RVNet: A fast and high energy efficiency network packet processing system on RISC-V.",
                    "Massive spatial query on the Kepler architecture.",
                    "PFSI.sw: A programming framework for sea ice model algorithms based on Sunway many-core processor.",
                    "MicRun: A framework for scale-free graph algorithms on SIMD architecture of the Xeon Phi.",
                    "Hierarchical Dataflow Model for efficient programming of clustered manycore processors.",
                    "Modeling and evaluation for gather/scatter operations in Vector-SIMD architectures.",
                    "reMinMin: A novel static energy-centric list scheduling approach based on real measurements.",
                    "Hardware design and analysis of efficient loop coarsening and border handling for image processing.",
                    "High performance hardware architectures for Intra Block Copy and Palette Coding for HEVC screen content coding extension.",
                    "Design and implementation of adaptive signal processing systems using Markov decision processes.",
                    "An embedded scalable linear model predictive hardware-based controller using ADMM.",
                    "CGRA-ME: A unified framework for CGRA modelling and exploration.",
                    "OpenCL-based design pattern for line rate packet processing.",
                    "Acceleration of Frequent Itemset Mining on FPGA using SDAccel and Vivado HLS.",
                    "OpenMP device offloading to FPGA accelerators.",
                    "DeepPump: Multi-pumping deep Neural Networks.",
                    "Efficiency in ILP processing by using orthogonality.",
                    "A fast and accurate logarithm accelerator for scientific applications.",
                    "Model checking cloud rendering system for the QoS evaluation.",
                    "High-throughput area-efficient processor for 3GPP LTE cryptographic core algorithms.",
                    "KV-FTL: A novel key-value based FTL scheme for large scale SSDs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27th ASAP 2016",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2016",
                "sub_name": "27th IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2016, London, United Kingdom, July 6-8, 2016.",
                "count": 45,
                "papers": [
                    "Message from the ASAP 2016 chairs.",
                    "Compressed L1 data cache and L2 cache in GPGPUs.",
                    "Adaptive ILP control to increase fault tolerance for VLIW processors.",
                    "Supervised and unsupervised machine learning for side-channel based Trojan detection.",
                    "A grain in the silicon: SCA-protected AES in less than 30 slices.",
                    "OpenCL-based erasure coding on heterogeneous architectures.",
                    "Unleashing the performance potential of CPU-GPU platforms for the 3D atmospheric Euler solver.",
                    "HW/SW-database-codesign for compressed bitmap index processing.",
                    "Modulo scheduling of symbolically tiled loops for tightly coupled processor arrays.",
                    "Efficient pointer management of stack data for software managed multicores.",
                    "A unified software approach to specify pipeline and spatial parallelism in FPGA hardware.",
                    "A multi-beam Scan Mode Synthetic Aperture Radar processor suitable for satellite operation.",
                    "Synthesisable recursion for C++ HLS tools.",
                    "A Domain Specific Language for accelerated Multilevel Monte Carlo simulations.",
                    "F-CNN: An FPGA-based framework for training Convolutional Neural Networks.",
                    "Energy efficient deeply fused dot-product multiplication architecture.",
                    "Guarding the guards: Enhancing LNS performance for common applications.",
                    "New non-uniform segmentation technique for software function evaluation.",
                    "Parallel floating-point expansions for extended-precision GPU computations.",
                    "Temporal frequent value locality.",
                    "A MPSoC cache design space exploration approach based on ABC algorithm to optimize energy consumption and performance.",
                    "gemV: A validated toolset for the early exploration of system reliability.",
                    "On-chip networks for mixed-criticality systems.",
                    "Combining GPU and FPGA technology for efficient exhaustive interaction analysis in GWAS.",
                    "Accelerating K-means clustering on a tightly-coupled processor-FPGA heterogeneous system.",
                    "Design space exploration and constrained multiobjective optimization for digital predistortion systems.",
                    "A hardware accelerator for the alignment of multiple DNA sequences in forensic identification.",
                    "Real time all intra HEVC HD encoder on FPGA.",
                    "Parametrized system level design: Real-time X-Ray image processing case study.",
                    "Pipelined FPGA implementation of numerical integration of the Hodgkin-Huxley model.",
                    "FPGA-based frequency estimation of a DFB laser using Rb spectroscopy for space missions.",
                    "Bridging the FPGA programmability-portability Gap via automatic OpenCL code generation and tuning.",
                    "Configuration technique for adaptability of multicore processors on FPGA.",
                    "Performance optimization of Jacobi stencil algorithms based on POWER8 architecture.",
                    "Display power reduction for mobile closed-source games.",
                    "An efficient embedded processor for object detection using ASIP methodology.",
                    "An ESL framework for low power architecture design space exploration.",
                    "soft-NEON: A study on replacing the NEON engine of an ARM SoC with a reconfigurable fabric.",
                    "Architecture for fractal dimension estimation based on Minkowski-Bouligand method using integer distances.",
                    "SHA-3 Instruction Set Extension for A 32-bit RISC processor architecture.",
                    "Temporized data prefetching algorithm for NoC-based multiprocessor systems.",
                    "HW/SW co-design based implementation of Gas discrimination.",
                    "Architecture for quadruple precision floating point division with multi-precision support.",
                    "Oolong: A Baseband processor extension to the RISC-V ISA.",
                    "Relation-oriented resource allocation for multi-accelerator systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26th ASAP 2015",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2015",
                "sub_name": "26th IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2015, Toronto, ON, Canada, July 27-29, 2015.",
                "count": 45,
                "papers": [
                    "BlueDBM: A multi-access, distributed flash store for Big Data analytics.",
                    "Accelerating data centers with reconfigurable logic.",
                    "Automatic design of domain-specific instructions for low-power processors.",
                    "Custom FPGA-based soft-processors for sparse graph acceleration.",
                    "A soft-core processor array for relational operators.",
                    "Atomic stream computation unit based on micro-thread level parallelism.",
                    "Timing speculation-aware instruction set extension for resource-constrained embedded systems.",
                    "A GPU-based correlator X-engine implemented on the CHIME Pathfinder.",
                    "Power and performance trade-offs for Space Time Adaptive Processing.",
                    "Accelerating persistent scatterer pixel selection for InSAR processing.",
                    "An efficient real-time data pipeline for the CHIME Pathfinder radio telescope X-engine.",
                    "An IEEE 754 double-precision floating-point multiplier for denormalized and normalized floating-point numbers.",
                    "Dual-rail active protection system against side-channel analysis in FPGAs.",
                    "Does arithmetic logic dominate data movement? a systematic comparison of energy-efficiency for FFT accelerators.",
                    "An FPGA implementation of a Restricted Boltzmann Machine classifier using stochastic bit streams.",
                    "Application-set driven exploration for custom processor architectures.",
                    "Speeding up graph-based SLAM algorithm: A GPU-based heterogeneous architecture study.",
                    "Range reduction based on Pythagorean triples for trigonometric function evaluation.",
                    "LightSpMV: Faster CSR-based sparse matrix-vector multiplication on CUDA-enabled GPUs.",
                    "GPU-based multifrontal optimizing method in sparse Cholesky factorization.",
                    "A metamorphotic Network-on-Chip for various types of parallel applications.",
                    "Dynamic pipeline-partitioned video decoding on symmetric stream multiprocessors.",
                    "Stochastic circuit design and performance evaluation of vector quantization.",
                    "Mixed-signal implementation of differential decoding using binary message passing algorithms.",
                    "Hardware acceleration of Private Information Retrieval protocols using GPUs.",
                    "Accelerating bootstrapping in FHEW using GPUs.",
                    "Multi-task support for security-enabled embedded processors.",
                    "Towards secure cryptographic software implementation against side-channel power analysis attacks.",
                    "Programmable RNS lattice-based parallel cryptographic decryption.",
                    "Balance power leakage to fight against side-channel analysis at gate level in FPGAs.",
                    "How can Garbage Collection be energy efficient by dynamic offloading?",
                    "Automatic frame rate-based DVFS of game.",
                    "MultiExplorer: A tool set for multicore system-on-chip design exploration.",
                    "Noxim: An open, extensible and cycle-accurate network on chip simulator.",
                    "GPU kernels for high-speed 4-bit astrophysical data processing.",
                    "Loop coarsening in C-based High-Level Synthesis.",
                    "An interpolation-based approach to multi-parameter performance modeling for heterogeneous systems.",
                    "Mixed-length SIMD code generation for VLIW architectures with multiple native vector-widths.",
                    "Comparative analysis of OpenCL vs. HDL with image-processing kernels on Stratix-V FPGA.",
                    "On-demand fault-tolerant loop processing on massively parallel processor arrays.",
                    "A scheduling and binding heuristic for high-level synthesis of fault-tolerant FPGA applications.",
                    "Reconfigurable acceleration of fitness evaluation in trading strategies.",
                    "An efficient architecture solution for low-power real-time background subtraction.",
                    "Large-scale packet classification on FPGA.",
                    "Efficient implementation of structured long block-length LDPC codes."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25th ASAP 2014",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2014",
                "sub_name": "IEEE 25th International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2014, Zurich, Switzerland, June 18-20, 2014.",
                "count": 48,
                "papers": [
                    "Resource-efficient regular expression matching architecture for text analytics.",
                    "Map-reduce processing of k-means algorithm with FPGA-accelerated computer cluster.",
                    "Adaptive scalable SVD unit for fast processing of large LSE problems.",
                    "SIR10US: A tightly coupled elliptic-curve cryptography co-processor for the OpenRISC.",
                    "Customizable coarse-grained energy-efficient reconfigurable packet processing architecture.",
                    "Low latency FPGA acceleration of market data feed arbitration.",
                    "Sum-of-product architectures computing just right.",
                    "Pipelined modular multiplier supporting multiple standard prime fields.",
                    "RNS modular multiplication through reduced base extensions.",
                    "On the computation of the reciprocal of floating point expansions using an adapted Newton-Raphson iteration.",
                    "Polar baseband receiver for low-end WLAN.",
                    "Design of a 2D graphics front-end rendering processor.",
                    "Performance modeling of virtualized custom logic computations.",
                    "HICore1: \"Safety on a chip\" turnkey solution for industrial control.",
                    "A reconfigurable network-on-chip architecture for heterogeneous CMPs in the dark-silicon era.",
                    "Randomized windows for secure scalar multiplication on elliptic curves.",
                    "Virtual semi-concurrent self-checking for heterogeneous MPSoC architectures.",
                    "Distributed synchronization for message-passing based embedded multiprocessors.",
                    "Performance modeling for highly-threaded many-core GPUs.",
                    "Analyzing the energy-efficiency of dense linear algebra kernels by power-profiling a hybrid CPU/FPGA system.",
                    "Coordinated and adaptive power gating and dynamic voltage scaling for energy minimization.",
                    "A case against small data types in GPGPUs.",
                    "He-P2012: Architectural heterogeneity exploration on a scalable many-core platform.",
                    "Function-Level Processor (FLP): Raising efficiency by operating at function granularity for market-oriented MPSoC.",
                    "Design of an accelerator-rich architecture by integrating multiple heterogeneous coarse grain reconfigurable arrays over a network-on-chip.",
                    "Secure interrupts on low-end microcontrollers.",
                    "On the characterization of OpenCL dwarfs on fixed and reconfigurable platforms.",
                    "Evaluating orthogonality between application auto-tuning and run-time resource management for adaptive OpenCL applications.",
                    "Efficient application mapping on CGRAs based on backward simultaneous scheduling/binding and dynamic graph transformations.",
                    "Domain-specific augmentations for High-Level Synthesis.",
                    "Virtual science on the move: Interactive access to simulations on supercomputers.",
                    "A practical network intrusion detection system for inline FPGAs on 10GbE network adapters.",
                    "An approach of processor core customization for stencil computation.",
                    "SWAPHI: Smith-waterman protein database search on Xeon Phi coprocessors.",
                    "A scalable and compact systolic architecture for linear solvers.",
                    "Efficient and scalable CGRA-based implementation of Column-wise Givens Rotation.",
                    "Bandwidth compression of multiple numerical data streams for high performance custom computing.",
                    "A customized GPU acceleration of the princeton ocean model.",
                    "Pipelined reconfigurable accelerator for ordinal pattern encoding.",
                    "Energy efficient canonical huffman encoding.",
                    "Flexible multistandard FEC processor design with ASIP methodology.",
                    "Energy-efficient gear-shift LDPC decoders.",
                    "Exploring DMA-assisted prefetching strategies for software caches on multicore clusters.",
                    "A compression-based morphable PCM architecture for improving resistance drift tolerance.",
                    "PVMC: Programmable Vector Memory Controller.",
                    "Understanding the design space of DRAM-optimized hardware FFT accelerators.",
                    "Quality-aware video decoding on thermally-constrained MPSoC platforms.",
                    "Combining flexibility with low power: Dataflow and wide-pipeline LDPC decoding engines in the Gbit/s era."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th ASAP 2013",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2013",
                "sub_name": "24th International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2013, Washington, DC, USA, June 5-7, 2013.",
                "count": 66,
                "papers": [
                    "The tunnel vision syndrome: Massively delaying progress.",
                    "Wireless health: Challenges and opportunities.",
                    "An application-aware approach to systems support for big data.",
                    "Extreme scale computer architecture: Energy efficiency from the ground up.",
                    "From green computing to big-data learning: A kernel learning perspective.",
                    "Symbolic parallelization of loop programs for massively parallel processor arrays.",
                    "Loop program mapping and compact code generation for programmable hardware accelerators.",
                    "Aspect driven compilation for dataflow designs.",
                    "Enabling development of OpenCL applications on FPGA platforms.",
                    "Modelling communication overhead for accessing local memories in hardware accelerators.",
                    "Cache partitioning and scheduling for energy optimization of real-time MPSoCs.",
                    "Accelerating HAC estimation for multivariate time series.",
                    "Toward a fast stochastic simulation processor for biochemical reaction networks.",
                    "A high-speed and large-scale dictionary matching engine for Information Extraction systems.",
                    "Efficient implementation of cryptographic primitives on the GA144 multi-core architecture.",
                    "iVAMS: Intelligent metamodel-integrated Verilog-AMS for circuit-accurate system-level mixed-signal design exploration.",
                    "Design space exploration for reliable mm-wave wireless NoC architectures.",
                    "Migration-aware loop retiming for STT-RAM based hybrid cache for embedded systems.",
                    "Application-specific processors for web-browsing: An exploration and evaluation of the design space.",
                    "Virtual finite-state-machine architectures for fast compilation and portability.",
                    "Selective validations for efficient protections on Coarse-Grained Reconfigurable Architectures.",
                    "Pseudo-constant logic optimization.",
                    "Fast lossless image compression with Radiation Hardening by hardware/software co-design on platform FPGAs.",
                    "OCP: Offload Co-Processor for energy efficiency in embedded mobile systems.",
                    "Standard deviation of CPI: A new metric to evaluate architectural time predictability.",
                    "Synthesizing accurate floating-point formulas.",
                    "The Denormal Logarithmic Number System.",
                    "A compact and scalable RNS architecture.",
                    "3D stacked wide-operand adders: A case study.",
                    "An effective New CRT based reverse converter for a novel moduli set {22n+1 - 1, 22n+1, 22n - 1}.",
                    "Fused floating-point two-term sum-of-squares unit.",
                    "FARHAD: A Fault-Tolerant Power-Aware Hybrid Adder for add intensive applications.",
                    "A practical measure of FPGA floating point acceleration for High Performance Computing.",
                    "Sparse matrix-vector multiply on the Texas Instruments C6678 Digital Signal Processor.",
                    "Transforming a linear algebra core to an FFT accelerator.",
                    "Reduce, Reuse, Recycle (R3): A design methodology for Sparse Matrix Vector Multiplication on reconfigurable platforms.",
                    "Power optimization of sum-of-products design for signal processing applications.",
                    "An efficient & reconfigurable FPGA and ASIC implementation of a spectral Doppler ultrasound imaging system.",
                    "Hardware acceleration for Just-In-Time compilation on heterogeneous embedded systems.",
                    "Reconfigurable computing middleware for application portability and productivity.",
                    "Microkernel hypervisor for a hybrid ARM-FPGA platform.",
                    "Private configuration environments (PCE) for efficient reconfiguration, in CGRAs.",
                    "A comparison of correntropy-based feature tracking on FPGAs and GPUs.",
                    "BioBlaze: Multi-core SIMD ASIP for DNA sequence alignment.",
                    "A real-time implementation of the Total Focusing Method for rapid and precise diagnostic in non destructive evaluation.",
                    "Novel Multi-Layer Network Decomposition boosting acceleration of multi-core algorithms.",
                    "On the performance of code block segmentation for LTE-advanced.",
                    "Accelerating the performance of stochastic encoding-based computations by sharing bits in consecutive bit streams.",
                    "FPGA-based HPC application design for non-experts.",
                    "Accelerating nonlinear diffusion tensor estimation for medical image processing using high performance GPU clusters.",
                    "FPGA and ASIC square root designs for high performance and power efficiency.",
                    "Linear algebra computations in heterogeneous systems.",
                    "Unifying CORDIC and Box-Muller algorithms: An accurate and efficient Gaussian Random Number generator.",
                    "A highly efficient, thread-safe software cache implementation for tightly-coupled multicore clusters.",
                    "Incorporating temperature-leakage interdependency into dynamic voltage scaling for real-time systems.",
                    "Hybrid SPM-cache architectures to achieve high time predictability and performance.",
                    "A low-power Content-Addressable Memory based on clustered-sparse networks.",
                    "Exploring hardware support for scaling irregular applications on multi-node multi-core architectures.",
                    "Design-for-adaptivity of microarchitectures.",
                    "GPU acceleration of Data Assembly in Finite Element Methods and its energy implications.",
                    "A distributed CPU-GPU framework for pairwise alignments on large-scale sequence datasets.",
                    "A Reconfigurable Application-specific Instruction-set Processor for Fast Fourier Transform processing.",
                    "Correctly rounded architectures for Floating-Point multi-operand addition and dot-product computation.",
                    "Highly scalable on-the-fly interleaved address generation for UMTS/HSPA+ parallel turbo decoder.",
                    "Implementing high-performance, low-power FPGA-based optical flow accelerators in C.",
                    "A scalable RC architecture for mean-shift clustering."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "23rd ASAP 2012",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2012",
                "sub_name": "23rd IEEE International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2012, Delft, The Netherlands, July 9-11, 2012.",
                "count": 28,
                "papers": [
                    "Real Time Iris Segmentation on FPGA.",
                    "A Reconfigurable Computing Approach for Efficient and Scalable Parallel Graph Exploration.",
                    "High Performance Parallel JPEG2000 Streaming Decoder Using GPGPU-CPU Heterogeneous System.",
                    "A Performance Model for Memory Bandwidth Constrained Applications on Graphics Engines.",
                    "EU Collaborative Research on Application-Specific Systems.",
                    "(M, p, k)-Friendly Points: A Table-Based Method for Trigonometric Function Evaluation.",
                    "On-line Decimal Adder with RBCD Representation.",
                    "Virtual Floating-Point Units for Low-Power Embedded Processors.",
                    "Simultaneous Floating-Point Sine and Cosine for VLIW Integer Processors.",
                    "A High-Rate, Low-Power, ASIC Speech Decoder Using Finite State Transducers.",
                    "Partial Expansion Graphs: Exposing Parallelism and Dynamic Scheduling Opportunities for DSP Applications.",
                    "SIMD/MIMD Dynamically-Reconfigurable Architecture for High-Performance Embedded Vision Systems.",
                    "A Speed Area Optimized Embedded Co-processor for McEliece Cryptosystem.",
                    "Interface Design for Mapping a Variety of RSA Exponentiation Algorithms on a HW/SW Co-design Platform.",
                    "Instruction Set Extensions for Cryptographic Hash Functions on a Microcontroller Architecture.",
                    "Design Automation Framework for Application-Specific Logic-in-Memory Blocks.",
                    "Viterbi Accelerator for Embedded Processor Datapaths.",
                    "Accelerating NoC-Based MPI Primitives via Communication Architecture Customization.",
                    "A Linear Algebra Core Design for Efficient Level-3 BLAS.",
                    "Reconfigurable Cluster-Based Networks-on-Chip for Application-Specific MPSoCs.",
                    "Automated Synthesis of FSMD-Based Accelerators for Hardware Compilation.",
                    "Design Space Exploration for the Implementation of a Predictive Current Controller Based on FPGA.",
                    "Design of Low Power On-chip Processor Arrays.",
                    "Novel Application of Genetic Sequencing Algorithms to Optimization of Hardware Resource Sharing for DSP.",
                    "Enabling Automatic Pipeline Utilization Improvement in Polyhedral Process Network Implementations.",
                    "Long Residue Checking for Adders.",
                    "FPGA Based Particle Identification in High Energy Physics Experiments.",
                    "Reconfigurable Design Automation by High-Level Exploration."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22nd ASAP 2011",
        "info": "Santa Monica, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2011",
                "sub_name": "22nd IEEE International Conference on Application-specific Systems, Architectures and Processors, ASAP 2011, Santa Monica, CA, USA, Sept. 11-14, 2011.",
                "count": 40,
                "papers": [
                    "Message from the conference chairs.",
                    "Era of customization and specialization.",
                    "More than 50 years of parallel processing and still no easy path to speedup.",
                    "Architectures for Green routers.",
                    "CusComNet: A customisable network for reconfigurable heterogeneous clusters.",
                    "Address generation scheme for a coarse grain reconfigurable architecture.",
                    "Accelerating vision and navigation applications on a customizable platform.",
                    "A high-performance, low-power linear algebra core.",
                    "A decimal floating-point fused multiply-add unit with a novel decimal leading-zero anticipator.",
                    "Longest Prefix Match and updates in Range Tries.",
                    "Low-cost hardware profiling of run-time and energy in FPGA embedded processors.",
                    "TimeTrial: A low-impact performance profiler for streaming data applications.",
                    "System-level design space exploration for dedicated heterogeneous multi-processor systems.",
                    "Decentralized dynamic resource management support for massively parallel processor arrays.",
                    "Hybrid data structure for IP lookup in virtual routers using FPGAs.",
                    "An area-Efficient LDPC decoder for multi-standard with conflict resolution.",
                    "High-throughput Contention-Free concurrent interleaver architecture for multi-standard turbo decoder.",
                    "Energy-efficient floating-point arithmetic for software-defined radio architectures.",
                    "On the performance of GPU public-key cryptography.",
                    "Exploiting structural redundancy of SIMD accelerators for their built-in self-testing/diagnosis and reconfiguration.",
                    "Accelerating the photon mapping algorithm and its hardware implementation.",
                    "A low power fault-tolerance architecture for the kernel density estimation based image segmentation algorithm.",
                    "Instruction set extension for high throughput disparity estimation in stereo image processing.",
                    "Low energy motion estimation via selective aproximations.",
                    "An FPGA architecture for solving the Table Maker's Dilemma.",
                    "Next-generation massively parallel short-read mapping on FPGAs.",
                    "An FPGA-based real-time nonuniformity correction system for Infrared Focal Plane Arrays.",
                    "Efficient custom instruction enumeration for extensible processors.",
                    "IP-XACT extensions for Reconfigurable Computing.",
                    "An integrated development toolset and implementation methodology for partially reconfigurable system-on-chips.",
                    "Cooperative multitasking for heterogeneous accelerators in the Linux Completely Fair Scheduler.",
                    "Optimal design-space exploration of streaming applications.",
                    "Stack data management for Limited Local Memory (LLM) multi-core processors.",
                    "An energy efficient adaptive event detection scheme for wireless sensor network.",
                    "Architecture model for approximate tandem repeat detection.",
                    "Design of a high performance FPGA based fault injector for real-time safety-critical systems.",
                    "Domain-specific processor with 3D integration for medical image processing.",
                    "A parallel k-partition method to perform Montgomery Multiplication.",
                    "A Residue Logarithmic Number System ALU using interpolation and cotransformation.",
                    "Design and implementation of a belief propagation detector for sparse channels."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21st ASAP 2010",
        "info": "Rennes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2010",
                "sub_name": "21st IEEE International Conference on Application-specific Systems Architectures and Processors, ASAP 2010, Rennes, France, 7-9 July 2010.",
                "count": 52,
                "papers": [
                    "Convergence of design and fabrication technologies, a key enabler for HW-SW integration.",
                    "The light at the end of the CMOS tunnel.",
                    "Dynamic code mapping for limited local memory systems.",
                    "Design of an Automatic Target Recognition algorithm on the IBM Cell Broadband Engine.",
                    "Highly efficient mapping of the Smith-Waterman algorithm on CUDA-compatible GPUs.",
                    "ImpEDE: A multidimensional design-space exploration framework for biomedical-implant processors.",
                    "Design space exploration of parametric pipelined designs.",
                    "Design space exploration for an embedded processor with flexible datapath interconnect.",
                    "Using shared library interposing for transparent application acceleration in systems with heterogeneous hardware accelerators.",
                    "Enhancing performance of network-on-chip architectures with millimeter-wave wireless interconnects.",
                    "A Bayesian network-based framework with Constraint Satisfaction Problem (CSP) formulations for FPGA system design.",
                    "An optimized NoC architecture for accelerating TSP kernels in breakpoint median problem.",
                    "A formal specification of fault-tolerance in prospecting asteroid mission with Reactive Autonomie Systems Framework.",
                    "Comparing the robustness of fault-tolerant enhancements when applied to lookup tables and random logic for nano-computing.",
                    "Dependability analysis of a countermeasure against fault attacks by means of laser shots onto a SRAM-based FPGA.",
                    "Modeling and synthesis of communication subsystems for loop accelerator pipelines.",
                    "Design of throughput-optimized arrays from recurrence abstractions.",
                    "A C++-embedded Domain-Specific Language for programming the MORA soft processor array.",
                    "A forwarding-sensitive instruction scheduling approach to reduce register file constraints in VLIW architectures.",
                    "Dual-purpose custom instruction identification algorithm based on Particle Swarm Optimization.",
                    "Combined scheduling and instruction selection for processors with reconfigurable cell fabric.",
                    "Completeness of automatically generated instruction selectors.",
                    "Implementation of binary edwards curves for very-constrained devices.",
                    "Elliptic Curve point multiplication on GPUs.",
                    "Newton-Raphson algorithms for floating-point division using an FMA.",
                    "An FPGA-specific algorithm for direct generation of multi-variate Gaussian random numbers.",
                    "Automatic generation of polynomial-based hardware architectures for function evaluation.",
                    "A fully-overlapped multi-mode QC-LDPC decoder architecture for mobile WiMAX applications.",
                    "High parallel variation Banyan network based permutation network for reconfigurable LDPC decoder.",
                    "A high efficient memory architecture for H.264/AVC motion compensation.",
                    "FPGA-based lossless compressors of floating-point data streams to enhance memory bandwidth.",
                    "Power dissipation challenges in multicore floating-point units.",
                    "On energy efficiency of reconfigurable systems with run-time partial reconfiguration.",
                    "A GALS FFT processor with clock modulation for low-EMI applications.",
                    "Hardware-assisted middleware: Acceleration of garbage collection operations.",
                    "Flexible hardware/software co-design for scalable elliptic curve cryptography for low-resource applications.",
                    "An efficient computation model for coarse grained reconfigurable architectures and its applications to a reconfigurable computer.",
                    "Potential of using block floating point arithmetic in ASIP-based GNSS-receivers.",
                    "Area optimized H.264 Intra prediction architecture for 1080p HD resolution.",
                    "Memoryless RNS-to-binary converters for the {2n+1 - 1, 2n, 2n - 1} moduli set.",
                    "A pipelined camellia architecture for compact hardware implementation.",
                    "General-purpose FPGA platform for efficient encryption and hashing.",
                    "A compact FPGA-based architecture for elliptic curve cryptography over prime fields.",
                    "Implementing decimal floating-point arithmetic through binary: Some suggestions.",
                    "A New approach in on-line task scheduling for reconfigurable computing systems.",
                    "Exploring algorithmic trading in reconfigurable hardware.",
                    "Optimizing DDR-SDRAM communications at C-level for automatically-generated hardware accelerators an experience with the Altera C2H HLS tool.",
                    "Deadlock-avoidance for streaming applications with split-join structure: Two case studies.",
                    "Customizing controller instruction sets for application-specific architectures.",
                    "Loop transformations for interface-based hierarchies IN SDF graphs.",
                    "Code generation for hardware accelerated AES.",
                    "Function flattening for lease-based, information-leak-free systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20th ASAP 2009",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2009",
                "sub_name": "20th IEEE International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2009, July 7-9, 2009, Boston, MA, USA.",
                "count": 37,
                "papers": [
                    "Division Unit for Binary Integer Decimals.",
                    "A Combined Decimal and Binary Floating-Point Multiplier.",
                    "Parallel Prefix Ling Structures for Modulo 2^n-1 Addition.",
                    "A FPGA-based Parallel Architecture for Scalable High-Speed Packet Classification.",
                    "Implementing a Highly Parameterized Digital PIV System on Reconfigurable Hardware.",
                    "Improving VLIW Processor Performance Using Three-Dimensional (3D) DRAM Stacking.",
                    "Specialization of the Cell SPE for Media Applications.",
                    "A Massively Parallel Coprocessor for Convolutional Neural Networks.",
                    "An FPGA-based Parallel Hardware Architecture for Real-Time Face Detection Using a Face Certainty Map.",
                    "Accelerating a Virtual Ecology Model with FPGAs.",
                    "Parallelized Architecture of Multiple Classifiers for Face Detection.",
                    "Design and Implementation of a Radix-4 Complex Division Unit with Prescaling.",
                    "A Low Power High Performance Radix-4 Approximate Squaring Circuit.",
                    "A Novel Processor Architecture for McEliece Cryptosystem and FPGA Platforms.",
                    "An Input Triggered Polymorphic ASIC for H.264 Decoding.",
                    "A Power-Scalable Switch-Based Multi-processor FFT.",
                    "MSA-CUDA: Multiple Sequence Alignment on Graphics Processing Units with CUDA.",
                    "Parallel Discrete Event Simulation of Molecular Dynamics Through Event-Based Decomposition.",
                    "NeMo: A Platform for Neural Modelling of Spiking Neurons Using GPUs.",
                    "Constraint-Driven Instructions Selection and Application Scheduling in the DURASE system.",
                    "A System Framework for the Design of Embedded Software Targeting Heterogeneous Multi-core SoCs.",
                    "Impact of Loop Tiling on the Controller Logic of Acceleration Engines.",
                    "Evaluating Various Branch-Prediction Schemes for Biomedical-Implant Processors.",
                    "Low-Power ASIP Architecture Exploration and Optimization for Reed-Solomon Processing.",
                    "Scalar Processing Overhead on SIMD-Only Architectures.",
                    "Integral Parallel Architecture & Berkeley's Motifs.",
                    "Application Specific Transistor Sizing for Low Power Full Adders.",
                    "Reconfigurable SWP Operator for Multimedia Processing.",
                    "Filtering Global History: Power and Performance Efficient Branch Predictor.",
                    "Efficient Implementation of Carry-Save Adders in FPGAs.",
                    "Acceleration of Multiresolution Imaging Algorithms: A Comparative Study.",
                    "A High-Performance Hardware Architecture for Spectral Hash Algorithm.",
                    "P3FSM: Portable Predictive Pattern Matching Finite State Machine.",
                    "Run-Time Detection of Malwares via Dynamic Control-Flow Inspection.",
                    "A 16-context Optically Reconfigurable Gate Array.",
                    "Mapping Parallel FFT Algorithm onto SmartCell Coarse-Grained Reconfigurable Architecture.",
                    "An Area-Efficient LDPC Decoder Architecture and Implementation for CMMB Systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19th ASAP 2008",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2008",
                "sub_name": "19th IEEE International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2008, July 2-4, 2008, Leuven, Belgium.",
                "count": 52,
                "papers": [
                    "Fast custom instruction identification by convex subgraph enumeration.",
                    "Bit matrix multiplication in commodity processors.",
                    "Synthesis of application accelerators on Runtime Reconfigurable Hardware.",
                    "Floating point multiplication rounding schemes for interval arithmetic.",
                    "Fast multivariate signature generation in hardware: The case of rainbow.",
                    "Fault-tolerant dynamically reconfigurable NoC-based SoC.",
                    "Security processor with quantum key distribution.",
                    "Fully-pipelined efficient architectures for FPGA realization of discrete Hadamard transform.",
                    "Reconfigurable Viterbi decoder on mesh connected multiprocessor architecture.",
                    "Run-time thread sorting to expose data-level parallelism.",
                    "A new high-performance scalable dynamic interconnection for FPGA-based reconfigurable systems.",
                    "Extending the SIMPPL SoC architectural framework to support application-specific architectures on multi-FPGA platforms.",
                    "PERMAP: A performance-aware mapping for application-specific SoCs.",
                    "Low-cost implementations of NTRU for pervasive security.",
                    "On the high-throughput implementation of RIPEMD-160 hash algorithm.",
                    "Zodiac: System architecture implementation for a high-performance Network Security Processor.",
                    "Efficient systolization of cyclic convolution for systolic implementation of sinusoidal transforms.",
                    "Resource efficient generators for the floating-point uniform and exponential distributions.",
                    "Low discrepancy sequences for Monte Carlo simulations on reconfigurable platforms.",
                    "A subsampling pulsed UWB demodulator based on a flexible complex SVD.",
                    "Dynamically reconfigurable regular expression matching architecture.",
                    "An MPSoC architecture for the Multiple Target Tracking application in driver assistant system.",
                    "Managing multi-core soft-error reliability through utility-driven cross domain optimization.",
                    "An efficient implementation of a phase unwrapping kernel on reconfigurable hardware.",
                    "A parallel hardware architecture for connected component labeling based on fast label merging.",
                    "Operation shuffling over cycle boundaries for low energy L0 clustering.",
                    "An efficient digital circuit for implementing Sequence Alignment algorithm in an extended processor.",
                    "Concurrent systolic architecture for high-throughput implementation of 3-dimensional discrete wavelet transform.",
                    "Design space exploration of a cooperative MIMO receiver for reconfigurable architectures.",
                    "Dynamic holographic reconfiguration on a four-context ODRGA.",
                    "FPGA-based hardware accelerator of the heat equation with applications on infrared thermography.",
                    "FPGA based singular value decomposition for image processing applications.",
                    "Accelerating Nussinov RNA secondary structure prediction with systolic arrays on FPGAs.",
                    "A multi-FPGA application-specific architecture for accelerating a floating point Fourier Integral Operator.",
                    "Reconfigurable acceleration of microphone array algorithms for speech enhancement.",
                    "Configurable and scalable high throughput turbo decoder architecture for multiple 4G wireless standards.",
                    "Architecture and VLSI realization of a high-speed programmable decoder for LDPC convolutional codes.",
                    "Buffer allocation for advanced packet segmentation in Network Processors.",
                    "New insights on Ling adders.",
                    "An efficient method for evaluating polynomial and rational function approximations.",
                    "Integer and floating-point constant multipliers for FPGAs.",
                    "Mapping of the AES cryptographic algorithm on a Coarse-Grain reconfigurable array processor.",
                    "RECONNECT: A NoC for polymorphic ASICs using a low overhead single cycle router.",
                    "Loop-oriented metrics for exploring an application-specific architecture design-space.",
                    "Rapid estimation of instruction cache hit rates using loop profiling.",
                    "Reducing power consumption of embedded processors through register file partitioning and compiler support.",
                    "Lightweight DMA management mechanisms for multiprocessors on FPGA.",
                    "Memory copies in multi-level memory systems.",
                    "Architecture of a polymorphic ASIC for interoperability across multi-mode H.264 decoders.",
                    "An FPGA architecture for CABAC decoding in manycore systems.",
                    "Novel approach on lifting-based DWT and IDWT processor with multi-context configuration to support different wavelet filters.",
                    "Throughput-scalable hybrid-pipeline architecture for multilevel lifting 2-D DWT of JPEG 2000 coder."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18th ASAP 2007",
        "info": "Montréal, Québec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2007",
                "sub_name": "IEEE International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2007, Montréal, Québec, Canada, July 8-11, 2007.",
                "count": 65,
                "papers": [
                    "Parallelizing HMMER for Hardware Acceleration on FPGAs.",
                    "FPGA-Based Efficient Design Approach for Large-Size Two's Complement Squarers.",
                    "A Self-Reconfigurable Implementation of the JPEG Encoder.",
                    "Evaluation of a High-Level-Language Methodology for High-Performance Reconfigurable Computers.",
                    "Windowed FIFOs for FPGA-based Multiprocessor Systems.",
                    "Performance Evaluation of Adaptive Routing Algorithms for achieving Fault Tolerance in NoC Fabrics.",
                    "Transaction Specific Virtual Channel Allocation in QoS Supported On-chip Communication.",
                    "Scalable Multi-FPGA Platform for Networks-On-Chip Emulation.",
                    "Mapping and Topology Customization Approaches for Application-Specific STNoC Designs.",
                    "Performance Evaluation of Probe-Send Fault-tolerant Network-on-chip Router.",
                    "Real-time FPGA-implementation for blue-sky Detection.",
                    "An FPGA Implementation of a Fully Verified Double Precision IEEE Floating-Point Adder.",
                    "Estimating Area Costs of Custom Instructions for FPGA-based Reconfigurable Processors.",
                    "FPGA SAR Processor with Window Memory Accesses.",
                    "The 1D Discrete Cosine Transform For Large Point Sizes Implemented On Reconfigurable Hardware.",
                    "LNS Subtraction Using Novel Cotransformation and/or Interpolation.",
                    "Hardware Design of a Binary Integer Decimal-based IEEE P754 Rounding Unit.",
                    "A Hardware-Oriented Method for Evaluating Complex Polynomials.",
                    "Power6 Decimal Divide.",
                    "Systolic Formulation for Low-Complexity Serial-Parallel Implementation of Unified Finite Field Multiplication over GF(2m).",
                    "Scheduling Register-Allocated Codes in User-Guided High-Level Synthesis.",
                    "Design Flow of a Dedicated Computer Cluster Customized for a Distributed Genetic Algorithm Application.",
                    "A Compact Fading Channel Simulator Using Timing-Driven Resource Sharing.",
                    "0/1 Knapsack on Hardware: A Complete Solution.",
                    "Automatic Generation and Optimisation of Reconfigurable Financial Monte-Carlo Simulations.",
                    "SIMD Vectorization of Histogram Functions.",
                    "A Run-Time Reconfigurable Fabric for 3D Texture Filtering.",
                    "Reconfigurable Universal Adder.",
                    "A Triplet-based Computer Architecture Supporting Parallel Object Computing.",
                    "The Design of a Novel Object-oriented Processor : OOMIPS.",
                    "Run-Time Error Detection in Polynomial Basis Multiplication Using Linear Codes.",
                    "Customizing Reconfigurable On-Chip Crossbar Scheduler.",
                    "Design and Implementation of an Efficient and Power-Aware Architecture for Skin Segmentation in Color Video Stream.",
                    "Entropy Coding on a Programmable Processor Array for Multimedia SoC.",
                    "Temperature-Aware Submesh Allocation Scheme for Heat Balancing on Chip-Multiprocessors.",
                    "Design and implementation of a surface peak thermal detector algorithm.",
                    "A High-Throughput Programmable Decoder for LDPC Convolutional Codes.",
                    "A Novel Low-Power Motion Estimation Design for H.264.",
                    "Reconfigurable Motion Estimation Architecture for Multi-standard Video Compression.",
                    "An Efficient SIMD Architecture with Parallel Memory for 2D Cosine Transforms of Video Coding.",
                    "Reduced Delay BCD Adder.",
                    "Improving the Throughput of On-line Addition for Data Streams.",
                    "Long Live Small Fan-in Majority Gates Their Reign Looks Like Coming!",
                    "Computing Digit Selection Regions for Digit Recurrences.",
                    "Hardware Acceleration for 3-D Radiation Dose Calculation.",
                    "Evaluation of a Tightly Coupled ASIP / Co-Processor Architecture Used in GNSS Receivers.",
                    "Latency Reduction of Global Traffic in Wormhole-Routed Meshes Using Hierarchical Rings for Global Routing.",
                    "Bridging the Gap between FPGAs and Multi-Processor Architectures: A Video Processing Perspective.",
                    "Two-level tiling for MPSoC architecture.",
                    "Architecture Support for Reconfigurable Multithreaded Processors in Programmable Communication Systems.",
                    "Identification of Application Specific Instructions Based on Sub-Graph Isomorphism Constraints.",
                    "A Retargetable Framework for Automated Discovery of Custom Instructions.",
                    "A Simple Central Processing Unit with Multi-Dimensional Logarithmic Number System Extensions.",
                    "A Phase-Coupled Compiler Backend for a New VLIW Processor Architecture Using Two-step Register Allocation.",
                    "An Application Specific Memory Characterization Technique for Co-processor Accelerators.",
                    "GISP: A Transparent Superpage Support Framework for Linux.",
                    "Methodology and Toolset for ASIP Design and Development Targeting Cryptography-Based Applications.",
                    "A 2-Dimension Force-Directed Scheduling Algorithm for Register-File-Connectivity Clustered VLIW Architecture.",
                    "Graphic processors to speed-up simulations for the design of high performance solar receptors.",
                    "Memory Operation Inclusive Instruction-Set Extensions and Data Path Generation.",
                    "Robust Adders Based on Quantum-Dot Cellular Automata.",
                    "A memcpy Hardware Accelerator Solution for Non Cache-line Aligned Copies.",
                    "A Rapid Prototyping Platform for Wireless Medium Access Control Protocols.",
                    "An Efficient Hardware Support for Control Data Validation.",
                    "ISA Support for Fingerprinting and Erasure Codes."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17th ASAP 2006",
        "info": "Steamboat Springs, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2006",
                "sub_name": "2006 IEEE International Conference on Application-Specific Systems, Architecture and Processors (ASAP 2006), 11-13 September 2006, Steamboat Springs, Colorado, USA.",
                "count": 63,
                "papers": [
                    "Message from the Conference Chairs.",
                    "Program Committee.",
                    "External Referees.",
                    "Configurable Computing Platforms - Promises, Promises.",
                    "The Mythical CCM: In Search of Usable (and Resuable) FPGA-Based General Computing Machines.",
                    "Cross Layer Design to Multi-thread a Data-Pipelining Application on a Multi-processor on Chip.",
                    "The Molen FemtoJava Engine.",
                    "A Generic Multi-Phase On-Chip Traffic Generation Environment.",
                    "Minimum Cost for Channels and Registers in Processor Arrays by Avoiding Redundancy.",
                    "NoC Hot Spot minimization Using AntNet Dynamic Routing Algorithm.",
                    "Recent Developments in Configurable and Extensible Processors.",
                    "Software Configurable Processors.",
                    "Reconfigurable Hardware and Software Architectural Constructs for the Enablement of Resilient Computing Systems.",
                    "Application Specific Processing: A Tools Approach.",
                    "Fast Bit Compression and Expansion with Parallel Extract and Parallel Deposit Instructions.",
                    "A Mesh-of-Trees Interconnection Network for Single-Chip Parallel Processing.",
                    "Reconfigurable Shuffle Network Design in LDPC Decoders.",
                    "2D-VLIW: An Architecture Based on the Geometry of Computation.",
                    "An Efficient Implementation of High-Accuracy Finite Difference Computing Engine on FPGAs.",
                    "Performance Evaluation of a Novel Direct Table Lookup Method and Architecture with Application to 16-bit Integer Functions.",
                    "Design of Radix-4 SRT Dividers in 65 Nanometer CMOS Technology.",
                    "Describing Quantum Circuits with Systolic Arrays.",
                    "FPGA Implementation of Beamforming Receivers Based on MRC and NC-LMS for DS-CDMA System.",
                    "Low Complexity Design of High Speed Parallel Decision Feedback Equalizers.",
                    "Quantitative Analysis of Embedded FPGA-Architectures for Arithmetic.",
                    "A Cost Effective Pipelined Divider for Double Precision Floating Point Number.",
                    "A 64-bit Decimal Floating-Point Comparator.",
                    "Pipelined Range Reduction for Floating Point Numbers.",
                    "Systolic FFT Processors: Past, Present and Future.",
                    "From Bit Level Systolic Arrays to HDTV Processor Chips.",
                    "The UCSC Kestrel Application-Unspecific Processor.",
                    "Multicore processors as Array Processors: Research Opportunities.",
                    "Analysis of a Fully-Scalable Digital Fractional Clock Divider.",
                    "Voltage Assignment and Loop Scheduling for Energy Minimization while Satisfying Timing Constraint with Guaranteed Probability.",
                    "Parallel Processing Based Power Reduction in a 256 State Viterbi Decoder.",
                    "Affine Nested Loop Programs and their Binary Parameterized Dataflow Graph Counterparts.",
                    "Polyhedral Modeling and Analysis of Memory Access Profiles.",
                    "Array Processing Using Alternate Arithmetic - A 20 Year Legacy.",
                    "Loop Transformation Methodologies for Array-Oriented Memory Management.",
                    "An Overview of Systolic Array Concepts and Applications for Linear Algebra and Signal Processing.",
                    "Three Computationally Demanding Problems in Search of ASAP Solutions.",
                    "Parameterized Looped Schedules for Compact Representationof Execution Sequences.",
                    "An Improved Systolic Architecture for LU Decomposition.",
                    "Dual-Processor Design of Energy Efficient Fault-Tolerant System.",
                    "An Energy-Delay Efficient Subword Permutation Unit.",
                    "Architecture design of an H.264/AVC decoder for real-time FPGA implementation.",
                    "Dynamic Voltage Scaling for Power Efficient MPEG4-SP Implementation.",
                    "Dynamic-SIMD for lens distortion compensation.",
                    "High Speed Channel Coding Architectures for the Uncoordinated OR Channel.",
                    "Efficient Group KeyManagement with Tamper-resistant ISA Extensions.",
                    "Speeding Up AES By Extending a 32 bit Processor Instruction Set.",
                    "Buffer and register allocation for memory space optimization.",
                    "New Schemes in Clustered VLIW Processors Applied to Turbo Decoding.",
                    "Evaluating Hardware Support for Reference Counting Using Software Configurable Processors.",
                    "Architectural Support on Object-Oriented Programming in a JAVA Processor.",
                    "Reconfigurable Fixed Point Dense and Sparse Matrix-Vector Multiply/Add Unit.",
                    "High Performance VLSI Architecture Design for H.264 CAVLC Decoder.",
                    "An FPGA-Based Application-Specific Processor for Efficient Reduction of Multiple Variable-Length Floating-Point Data Sets.",
                    "A Design Methodology for Hardware Acceleration of Adaptive Filter Algorithms in Image Processing.",
                    "An Adaptable And Scalable Asymmetric Cryptographic Processor.",
                    "Low-Cost Elliptic Curve Digital Signature Coprocessor for Smart Cards.",
                    "Throughput Optimized SHA-1 Architecture Using Unfolding Transformation.",
                    "Configurable, High Throughput, Irregular LDPC Decoder Architecture: Tradeoff Analysis and Implementation."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16th ASAP 2005",
        "info": "Samos, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2005",
                "sub_name": "16th IEEE International Conference on Application-Specific Systems, Architectures, and Processors (ASAP 2005), 23-25 July 2005, Samos, Greece.",
                "count": 66,
                "papers": [
                    "Title Page.",
                    "Copyright Page.",
                    "Message from the Conference Chairs.",
                    "Conference Organizers.",
                    "Program Committee.",
                    "External Referees.",
                    "Area - Time - Power and Design effort: the basic tradeoffs in Application Specific Systems.",
                    "Using Symbolic Feasibility Tests during Design Space Exploration of Heterogeneous Multi-Processor Systems.",
                    "Expression Synthesis in Process Networks generated by LAURA.",
                    "Artificial Deadlock Detection in Process Networks for ECLIPSE.",
                    "Hardware/Software Interface for Multi-Dimensional Processor Arrays.",
                    "Casablanca II: Implementation of a Real-Time RISC.",
                    "Behavioral specification of control interface for signal processing applications.",
                    "Speedups from Partitioning Critical Software Parts to Coarse-Grain Reconfigurable Hardware.",
                    "A SW/Configware Codesign Methodology for Control Dominated Applications.",
                    "Towards a Framework for System-Level Design of Multiprocessor SoC Platforms for Media Processing.",
                    "Communication-Centric SoC Design for Nanoscale Domain.",
                    "Using TLM for Exploring Bus-based SoC Communication Architectures.",
                    "Exploring Design Space of VLIW Architectures.",
                    "The Midlifekicker Microarchitecture Evaluation Metric.",
                    "Design of a Hardware Accelerator for Density Based Clustering Applications.",
                    "Complex Fixed-Point Matrix Inversion Using Transport Triggered Architecture.",
                    "A Parallel Automaton String Matching with Pre-Hashing and Root-Indexing Techniques for Content Filtering Coprocessor.",
                    "Eliminating Sorting in IP Lookup Devices using Partitioned Table.",
                    "Generating Efficient Custom FPGA Soft-Cores for Control-Dominated Applications.",
                    "Multiply-Accumulate Architecture for a Special Class of Optimal Extension Fields.",
                    "Automated Instruction-Set Extension of Embedded Processors with Application to MPEG-4 Video Encoding.",
                    "Instruction Set Architecture Enhancements for Video Processing.",
                    "Instruction Set Customization of Application Specific Processors for Network Processing: A Case Study.",
                    "Alleviating the Data Memory Bandwidth Bottleneck in Coarse-Grained Reconfigurable Arrays.",
                    "Architectural Support for Accelerating Congestion Control Applications in Network Processors.",
                    "Power Breakdown Analysis for a Heterogeneous NoC Platform Running a Video Application.",
                    "A Low-Power Processor Architecture Optimized forWireless Devices.",
                    "CASPER: An Integrated Energy-Driven Approach for Task Graph Scheduling on Distributed Embedded Systems.",
                    "Via-Aware Global Routing for Good VLSI Manufacturability and High Yield.",
                    "Virtual Hierarchical Design Representations for Distributed Optimization of Multi-Million Gate Designs.",
                    "Zippy - A coarse-grained reconfigurable array with support for hardware virtualization.",
                    "An Image Processor for Digital Film.",
                    "On Estimations for Compiling Software to FPGA-based Systems.",
                    "A Programmable DSP Architecture for Wireless Communication Systems.",
                    "Customising Application-Speci.c Multiprocessor Systems: a Case Study.",
                    "Faults, Error Bounds and Reliability of Nanoelectronic Circuits.",
                    "Logic Models Supporting the Design of MOBILE-based RTD Circuits.",
                    "CONAN - A Design Exploration Framework for Reliable Nano-Electronics.",
                    "Analytical approach to massively parallel architectures for nanotechnologies.",
                    "On the Advantages of Serial Architectures for Low-Power Reliable Computations.",
                    "Reducing Interconnection Resource Overhead in Nano-scale FPGAs through MVL Signal Systems.",
                    "Simple 4-Bit Processor Based On Quantum-Dot Cellular Automata (QCA).",
                    "High Radix Addition Via Conditional Charge Transport in Single Electron Tunneling Technology.",
                    "Multiplication Algorithms for Radix-2 RN-Codings and Two's Complement Multiplication Algorithms for Radix-2 RN-Codings and Two's Complement.",
                    "Decimal Floating-Point Square Root Using Newton-Raphson Iteration.",
                    "Variable Radix Real and Complex Digit-Recurrence Division.",
                    "On-line Multioperand Addition Based on On-line Full Adders.",
                    "Table-based polynomials for fast hardware function evaluation.",
                    "Small FPGA polynomial approximations with 3-bit coefficients and low-precision estimations of the powers of x.",
                    "Architectural Extensions for Elliptic Curve Cryptography over GF(2m) on 8-bit Microprocessors.",
                    "Side-channel aware design: Algorithms and Architectures for Elliptic Curve Cryptography over GF(2n).",
                    "On-Chip Lookup Tables for Fast Symmetric-Key Encryption.",
                    "Instruction Set Extensions for Reed-Solomon Encoding and Decoding.",
                    "256-State Rate 1/2 Viterbi Decoder on TTA Processor.",
                    "Recursive Filtering on a Vector DSP with Linear Speedup.",
                    "A Fault-Tolerant Modulus Replication Complex FIR Filter.",
                    "Performance Comparison of SIMD Implementations of the Discrete Wavelet Transform.",
                    "Real-time H/W Implementation of the Approximate Discrete Radon Transform.",
                    "A Thread and Data-Parallel MPEG-4 Video Encoder for a System-On-Chip Multiprocessor.",
                    "Design and Implementation of a High-Performance and Silicon Efficient Arithmetic Coding Accelerator for the H.264 Advanced Video Codec."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15th ASAP 2004",
        "info": "Galveston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2004",
                "sub_name": "15th IEEE International Conference on Application-Specific Systems, Architectures, and Processors (ASAP 2004), 27-29 September 2004, Galveston, TX, USA.",
                "count": 34,
                "papers": [
                    "Modeling and Scheduling Parallel Data Flow Systems using Structured Systems of Recurrence Equations.",
                    "Resource Constrained and Speculative Scheduling of an Algorithm Class with Run-Time Dependent Conditionals.",
                    "CHARMED: A Multi-Objective Co-Synthesis Framework for Multi-Mode Embedded Systems.",
                    "Reliability-Aware Co-Synthesis for Embedded Systems.",
                    "Complex Square Root with Operand Prescaling.",
                    "Parallel Montgomery Multipliers.",
                    "Improved-Throughput Networks of Basic On-Line Arithmetic Modules for DSP Applications.",
                    "Decimal Floating-Point Division Using Newton-Raphson Iteration.",
                    "A Public-Key Cryptographic Processor for RSA and ECC.",
                    "Architectural Support for Arithmetic in Optimal Extension Fields.",
                    "Evaluating Instruction Set Extensions for Fast Arithmetic on Binary Finite Fields.",
                    "Efficient Processing of Color Image Sequences Using a Color-Aware Instruction Set on Mobile Systems.",
                    "Binary Multiplication based on Single Electron Tunneling.",
                    "A Novel Highly Reliable Low-Power Nano Architecture When von Neumann Augments.",
                    "Register Organization for Enhanced On-Chip Parallelism.",
                    "Design and Evaluation of a Network-Based Asynchronous Architecture for Cryptographic Devices.",
                    "Common Subexpression Elimination Involving Multiple Variables for Linear DSP Synthesis.",
                    "Optimizing the Memory Bandwidth with Loop Morphing.",
                    "Switching-Activity Minimization on Instruction-Level Loop Scheduling for VLIWDSP Applications.",
                    "A Digit-Serial Algorithm for the Discrete Logarithm Modulo 2k.",
                    "An Algorithm and Hardware Architecture for Integrated Modular Division and Multiplication in GF(p) and GF(2n).",
                    "Detecting Faults in Four Symmetric Key Block Ciphers.",
                    "A Low-Power Carry Skip Adder with Fast Saturation.",
                    "A Hierarchical Classification Scheme to Derive Interprocess Communication in Process Networks.",
                    "Efficient On-Chip Communications for Data-Flow IPs.",
                    "Automatic Synthesis of Customized Local Memories for Multicluster Application Accelerators.",
                    "Optimized Data-Reuse in Processor Arrays.",
                    "Hyper-Programmable Architectures for Adaptable Networked Systems.",
                    "Programming Transparency and Portable Hardware Interfacing: Towards General-Purpose Reconfigurable Computing.",
                    "Families of FPGA-Based Algorithms for Approximate String Matching.",
                    "Biosequence Similarity Search on the Mercury System.",
                    "Stride Permutation Networks for Array Processors.",
                    "A Packet Scheduling Algorithm for IPSec Multi-Accelerator Based Systems.",
                    "Design of the QBIC Wearable Computing Platform."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14th ASAP 2003",
        "info": "The Hague, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2003",
                "sub_name": "14th IEEE International Conference on Application-Specific Systems, Architectures, and Processors (ASAP 2003), 24-26 June 2003, The Hague, The Netherlands.",
                "count": 44,
                "papers": [
                    "Challenges in the Design of Security-Aware Processors.",
                    "Context-Aware Process Networks.",
                    "Multi-dimentsional Incremetal Loops Fusion for Data Locality.",
                    "Switched Memory Architectures-Moving Beyond Systolic Arrays.",
                    "Hardware Synthesis for Multi-Dimensional Time.",
                    "Using Group Theory to Specify Application Specific Interconnection Networks for SIMD DSPs.",
                    "Systematic Register Bypass Customization for Application-Specific Processors.",
                    "Storage Management in Process Networks using the Lexicographically Maximal Preimage.",
                    "Energy Aware Register File Implementation through Instruction Predecode.",
                    "Physical Planning for On-Chip Multiprocessor Networks and Switch Fabrics.",
                    "Automatic Instruction Set Extension and Utilization for Embedded Processors.",
                    "Nanotechnology in the Development of Future Computing Systems.",
                    "Circuit Characteristics of Molecular Electronic Components.",
                    "Reconfigurable Computing and Electronic Nanotechnology.",
                    "Using Media Processors for Low-Memory AES Implementation.",
                    "Variable-Length Instruction Compression for Area Minimization.",
                    "Generic Tool-Set for SoC Mulitiprocessor Debugging and Synchronization.",
                    "Evaluating Memory Architectures for Media Applications on Coarse-Grained Recon.gurable Architectures.",
                    "Application-Specific Computing with Adaptive Register File Architectures.",
                    "A floating-point CORDIC based SVD processor.",
                    "Combined Multiplication and Sum-of-Squares Units.",
                    "Comparison of Branching CORDIC Implementations.",
                    "Unified Radix-4 Multiplier for GF(p) and GF(2^n).",
                    "Arbitrary Bit Permutations in One or Two Cycles.",
                    "Color Space Conversion for MPEG decoding on FPGA-augmented TriMedia Processor.",
                    "Reducing dynamic power consumption in next generation DS-CDMA mobile communication receivers.",
                    "An Efficient Disk-Array-Based Server Design for a Multicast Video Streaming System.",
                    "An Efficient PIM (Processor-In-Memory) Architecture for Motion Estimation.",
                    "A VLSI Architecture for Advanced Video Coding Motion Estimation.",
                    "Complex Division with Prescaling of Operands.",
                    "Iterative Methods for Logarithmic Subtraction.",
                    "A Family of Parallel-Pre.x Modulo 2n - 1 Adders.",
                    "Performance-Improved Computation of Very Large Word-Length LNS Addition/Subtraction Using Signed-Digit Arithmetic.",
                    "Decimal Multiplication Via Carry-Save Addition.",
                    "Reconfigurable Viterbi Decoding Using a New ACS Pipelining Technique.",
                    "Application-Specific DSP Architecture For Fast Fourier Transform.",
                    "An Architecture for a Radix-4 Modular Pipeline Fast Fourier Transform.",
                    "GFS: An Efficient Implementation of Fair Scheduling for Mult-Gigabit Packet Networks.",
                    "Area and Time Efficient Modular Multiplication of Large Integers.",
                    "Modular Multiplication for FPGA Implementation of the IDEA Block Cipher.",
                    "Concurrent Fault Detection in a Hardware Implementation of the RC5 Encryption Algorithm.",
                    "Hardware Implementation of an Elliptic Curve Processor over GF(p).",
                    "A Cryptograhpic Processor for Arbitrary Elliptic Curves over.",
                    "Instruction Set Extension for Fast Elliptic Curve Cryptography over Binary Finite Fields GF(2m)."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13th ASAP 2002",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2002",
                "sub_name": "13th IEEE International Conference on Application-Specific Systems, Architectures, and Processors (ASAP 2002), 17-19 July 2002, San Jose, CA, USA.",
                "count": 37,
                "papers": [
                    "Nanocomputing with Delays.",
                    "Compositional Technique for Synthesising Multi-Phase Regular Arrays.",
                    "A Compile Time Based Approach for Solving Out-of-Order Communication in Kahn Process Networks.",
                    "Model-Based Exploration of the Design Space for Heterogeneous Systems on Chip.",
                    "A Component Architecture for FPGA-Based, DSP System Design.",
                    "Low Power Memory Design.",
                    "Reduced Power Consumption for MPEG Decoding with LNS.",
                    "A Model-Based Methodology for Application Specific Energy Efficient Data Path Design Using FPGAs.",
                    "Design Space Exploration for Energy-Efficient Secure Sensor Network.",
                    "High-Radix Logarithm with Selection by Rounding.",
                    "An Analysis of the CORDIC Algorithm for Direct Digital Frequency Synthesis.",
                    "Evaluating Products of Non Linear Functions by Indirect Bipartite Table Lookup.",
                    "Efficient Conversion From Binary to Multi-Digit Multi-Dimensional Logarithmic Number Systems Using Arrays of Range Addressable Look-Up Tables.",
                    "Predictable Instruction Caching for Media Processors.",
                    "A Mathematical Model of Trace Cache.",
                    "Implementation of a 32-bit RISC Processor for the Data-Intensive Architecture Processing-In-Memory Chip.",
                    "A Mid-Texturing Pixel Rasterization Pipeline Architecture for 3D Rendering Processors.",
                    "Fast Radix-4 Retimed Division with Selection by Comparisons.",
                    "PAPA - Packed Arithmetic on a Prefix Adder for Multimedia Applications.",
                    "A Combined Interval and Floating-Point Comparator/Selector.",
                    "Reviewing 4-to-2 Adders for Multi-Operand Addition.",
                    "Implications of Programmable General Purpose Processors for Compression/Encryption Applications.",
                    "Design and Evaluation of a Multimedia Computing Architecture Based on a 3D Graphics Pipeline.",
                    "Refining Instruction Set Architecture for High-Performance Multimedia Processing in Constrained Environments.",
                    "Polynomial Evaluation on Multimedia Processors.",
                    "Integrated Design of AES (Advanced Encryption Standard) Encrypter and Decrypter.",
                    "Instruction Stream Mutation for Non-Deterministic Processors.",
                    "A Novel Pipelined Threads Architecture for AES Encryption Algorithm.",
                    "On the Propagation of Faults and Their Detection in a Hardware Implementation of the Advanced Encryption Standard.",
                    "Matrix Engine for Signal Processing Applications Using the Logarithmic Number System.",
                    "A VLSI Architecture for Object Recognition Using Tree Matching.",
                    "Implementation of a Single Chip, Pipelined, Complex, One-Dimensional Fast FourierTransform in 0.25 mu m BulkCMOS.",
                    "Optical Network Reconfiguration for Signal Processing Applications.",
                    "New Results on Array Contraction.",
                    "A CORBA-Based GIS-T for Ambulance Assignment.",
                    "Advances in Bit Width Selection Methodology.",
                    "Tradeoffs Between Quality of Results and Resource Consumption in a Recognition System."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "12th ASAP 2000",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/2000",
                "sub_name": "12th IEEE International Conference on Application-Specific Systems, Architectures, and Processors (ASAP 2000), 10-12 July 2000, Boston, MA, USA.",
                "count": 34,
                "papers": [
                    "High-Performance Front-End Embedded Signal Processors for Adaptive Sensor Arrays.",
                    "Subword Permutation Instructions for Two-Dimensional Multimedia Processing in MicroSIMD Architectures.",
                    "Architecture of an Image Rendering Co-Processor for MPEG-4 Systems.",
                    "A Multiplication-Free Parallel Architecture for Affine Transformation.",
                    "A Simple RISC Microprocessor Core Designed for Digital Set-Top-Box Applications.",
                    "Formal Verification for Microprocessors with Extendable Instruction Set.",
                    "Compiling Image Processing Applications to Reconfigurable Hardware.",
                    "Integration of High-Performance ASICs into Reconfigurable Systems Providing Additional Multimedia Functionality.",
                    "High Level Modeling for Parallel Executions of Nested Loop Algorithms.",
                    "Minimal Complexity Hierarchical Loop Representations of SFG Processors for Optimal High Level Synthesis.",
                    "High Level Synthesis for Peak Power Minimization Using ILP.",
                    "High-Level Synthesis of Nonprogrammable Hardware Accelerators.",
                    "Implementing 1, 024-Bit RSA Exponentiation on a 32-Bit Processor Core.",
                    "Bit Permutation Instructions for Accelerating Software Cryptography.",
                    "Performance-Scalable Array Architectures for Modular Multiplication.",
                    "A 108 Gbps, 1.5 GHz 1D-DCT Architecture.",
                    "Efficient VLSI Architectures for Baseband Signal Processing in Wireless Base-Station Receivers.",
                    "A Vector Multiprocessor for Real-Time Multi-User Detection in Spread-Spectrum Communication.",
                    "A 550 Mb/s Radix-4 Bit-level Pipelined 16-State 0.25-mu m CMOS Viterbi Decoder.",
                    "A Booth Multiplier Accepting Both a Redundant or a Non-Redundant Input with No Additional Delay.",
                    "A Hardware Algorithm for Variable-Precision Logarithm.",
                    "Block-Update Parallel Processing QRD-RLS Algorithm for Throughput Improvement with Low Power Consumption.",
                    "A 16-Bit x 16-Bit MAC Design Using Fast 5: 2 Compressors.",
                    "Control for High-Speed PE Arrays.",
                    "Explicit SIMD Programming for Asynchronous Applications.",
                    "Quadratic Control Signals in Linear Systolic Arrays.",
                    "Contention-Conscious Transaction Ordering in Embedded Multiprocessors.",
                    "Architecture for Wavelet Packet Transform with Best Tree Searching.",
                    "Tradeoff Analysis and Architecture Design of a Hybrid Hardware/Software Sorter.",
                    "A Programmable Processor for Approximate String Matching with High Throughput Rate.",
                    "A New Algorithm for the Elimination of Common Subexpressions in Hardware Implementation of Digital Filters by Using Genetic Programming.",
                    "A Theory for Software-Hardware Co-Scheduling for ASIPs and Embedded Processors.",
                    "Partitioning Conditional Data Flow Graphs for Embedded System Design.",
                    "Generation of Scheduling Functions Supporting LSGP-Partitioning."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "ASAP 1997",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1997",
                "sub_name": "1997 International Conference on Application-Specific Systems, Architectures, and Processors (ASAP '97), 14-16 July 1997, Zurich, Switzerland.",
                "count": 51,
                "papers": [
                    "A Visual Computing Environment for Very Large Scale Biomolecular Modeling.",
                    "On Computing With Locally-Interconnected Architectures in Atomic/Nanoelectronic Systems.",
                    "Realization of a nonlinear digital filter on a DSP array processor.",
                    "A Linear Array Parallel Image Processor: SliM-II.",
                    "A massively parallel implementation of the watershed based on cellular automata.",
                    "A strategy for determining a Jacobi specific dataflow processor.",
                    "Array Placement for Storage Size Reduction in Embedded Multimedia Systems.",
                    "Buffer size optimization for full-search block matching algorithms.",
                    "A VLSI Architecture for Image Geometrical Transformations Using an Embedded Core Based Processor.",
                    "A flexible data-interlacing architecture for full-search block-matching algorithm.",
                    "New arithmetic coder/decoder architectures based on pipelining.",
                    "Processor Elements for the Standard Cell Implementation of Residue Number Systems.",
                    "Low latency word serial CORDIC.",
                    "CORDIC-based computation of arccos and arcsin.",
                    "Accurate Function Approximations by Symmetric Table Lookup and Addition.",
                    "Low Power CORDIC Implementation Using Redundant Number Representation.",
                    "Efficient Implementation of Rotation Operations for High Performance QRD-RLS Filtering.",
                    "A logical framework to prove properties of Alpha programs.",
                    "Determination of the Processor Functionality in the Design of Processor Arrays.",
                    "Three-dimensional orthogonal tile sizing problem: mathematical programming approach.",
                    "Scheduling in Co-Partitioned Array Architectures.",
                    "Tiling with limited resources.",
                    "Libraries of schedule-free operators in Alpha.",
                    "Optimized software synthesis for synchronous dataflow.",
                    "The Processing Graph Method Tool (PGMT).",
                    "Algorithm and architecture-level design space exploration using hierarchical data flows.",
                    "Mapping multirate dataflow to complex RT level hardware models.",
                    "Heterogeneous Multiprocessor Scheduling and Allocation using Evolutionary Algorithms.",
                    "A Methodology for User-Oriented Scalability Analysis.",
                    "Performance model of the Argonne Voyager multimedia server.",
                    "PART: a partitioning tool for efficient use of distributed systems.",
                    "An Approach for Quantitative Analysis of Application-Specific Dataflow Architectures.",
                    "Automatic data mapping of signal processing applications.",
                    "Configurable computing: the catalyst for high-performance architectures.",
                    "Fast Arithmetic and Fault Tolerance in the FERMI System.",
                    "A Multiprocessor System for Real Time High Resolution Image Correlation.",
                    "A Novel Sequencer Hardware for Application Specific Computing.",
                    "A FPGA-based Implementation of an Intravenous Infusion Controller System.",
                    "Conception and design of a RISC CPU for the use as embedded controller within a parallel multimedia architecture.",
                    "A dedicated circuit for charged particles simulation using the Monte Carlo method.",
                    "A Modular Element for Shared Buffer ATM Switch Fabrics.",
                    "A Datapath Generator for Full-Custom Macros of Iterative Logic Arrays.",
                    "On core and more: a design perspective for systems-on-a-chip.",
                    "ADPCM codec: from system level description to versatile HDL model.",
                    "Design methodology for digital signal processing.",
                    "A flexible VLSI architecture for variable block size segment matching with luminance correction.",
                    "Implementation of Orthogonal Wavelet Transforms and their Applications.",
                    "An efficient architecture for the in place fast cosine transform.",
                    "An efficient video decoder design for MPEG-2 MP@ML.",
                    "An Optimized Coefficient Update Processor for High-Throughput Adaptive Equalizers.",
                    "Discrete Lagrangian Method for Optimizing the Design of Multiplierless QMF Filter Banks."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "ASAP 1996",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1996",
                "sub_name": "1996 International Conference on Application-Specific Systems, Architectures, and Processors (ASAP '96), August 19-23, 1996, Chicago, IL , USA.",
                "count": 39,
                "papers": [
                    "An Architectural Design For Parallel Fractal Compression.",
                    "A Decomposition Method For Efficient Use Of Distributed Supercomputers For Finite Element Applications.",
                    "Kestrel: A Programmable Array for Sequence Analysis.",
                    "Finite Word-Length Effects Of An Unified Systolic Array For 2-D DCT/IDCT.",
                    "A New Euclidean Division Algorithm For Residue Number Systems.",
                    "Radix-4 Vectoring Cordic Algorithm And Architectures.",
                    "Architectural Optimizations For A Floating Point Multiply-Accumulate Unit In A Graphics Pipeline.",
                    "Efficient Finite Field Serial/Parallel Multiplication.",
                    "A New FFT Architecture and Chip Design for Motion Compensation based on Phase Correlation.",
                    "Area-Efficient Parallel FIR Digital Filter Implementations.",
                    "A Flexible Motion Estimation Chip for Variable Size Block Matching.",
                    "A Novel Matching Criterion And Low Power Architecture For Real-Time Block Based Motion Estimation.",
                    "Scheduling of Partitioned Regular Algorithms on Processor Arrays with Constrained Resources.",
                    "An Abstract Model for a Low Cost SIMD Architecture.",
                    "Automatic Generation of Modular Mappings.",
                    "High-Speed Viterbi Decoder: An Efficient Scheduling Method to Exploit the Pipelining.",
                    "Monitoring and Debugging a Hard Real-Time Distributed Computer for Aircraft Industry.",
                    "Parallel Algorithm And Architecture For Two-Step Division-Free Gaussian Elimination.",
                    "A Common Architecture For The DWT and IDWT.",
                    "Overcoming chip-to-chip delays and clock skews.",
                    "Diagnosis Algorithm for Mobility-Oriented System.",
                    "A VLSI System Architecture For Real-Time Intelligent Decision Making.",
                    "Microphone Array for Hearing Aid and Speech Enhancement Applications.",
                    "Static Communication Scheduling for Minimizing Collisions in Application Specific Parallel Systems.",
                    "Design of the Distributed Architecture of a Machine-tool Using FIP Fieldbus.",
                    "NULL Convention LogicTM: A Complete And Consistent Logic For Asynchronous Digital Circuit Synthesis.",
                    "A Synthesis System For Bus-Based Wavefront Array Architectures.",
                    "Hardware Synthesis From Encapsulated Verilog Modules.",
                    "Reconfigurable Processing With Field Programmable Gate Arrays.",
                    "Rapid Prototyping of Reconfigurable Coprocessors.",
                    "Performance Modeling and Tradeoff Analysis During Rapid Prototyping.",
                    "Jacobi-Specific Processor Arrays.",
                    "A Coalescing-Partitioning Algorithm for Optimizing Processor Specification and Task Allocation.",
                    "On the Removal of Anti and Output Dependences.",
                    "Latency-constrained Resynchronization for Multiprocessor DSP Implementation.",
                    "Hierarchical Static Analysis Of Structured Systems Of Affine Recurrence Equations.",
                    "Extension Of The Alpha Language To Recurrences On Sparse Periodic Domains.",
                    "On Supernode Transformation with Minimized Total Running Time.",
                    "Parametric Analysis of Polyhedral Iteration Spaces."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "ASAP 1995",
        "info": "Strasbourg, France",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1995",
                "sub_name": "The International Conference on Application Specific Array Processors (ASAP'95), July 24-26, 1995, Strasbourg, France.",
                "count": 38,
                "papers": [
                    "The naive execution of affine recurrence equations.",
                    "Revisiting the Decomposition of Karp, Miller and Winograd.",
                    "A Processor-Time-Minimal Schedule for 3D Rectilinear Mesh Algorithms.",
                    "Data Alignments for Modular Time-Space Mappings of BLAS-like Algorithms.",
                    "Time-optimal ranking algorithms on sorted matrices.",
                    "Recomputing by Operand Exchanging: A Time-redundancy Approach for Fault-tolerant Neural Networks.",
                    "Design and Implementation of a Parallel Image Processor Chip for a SIMD Array Processor.",
                    "A Scalable Halftoning Coprocessor Architecture.",
                    "Horizontal Microcode Compaction for Programmable Systolic Accelerators.",
                    "Column Compression Pipelined Multipliers.",
                    "A Processor for Staggered Interval Arithmetic.",
                    "A simple array processor for binary prefix sums.",
                    "The MGAP's programming environment and the *C++ language.",
                    "The VLSI design and implementation of the array processors of a multilayer vision system architecture.",
                    "A Parallelizing Compilation Method for the Map-oriented Machine.",
                    "VLSI Algorithms for Compressed Pattern Search Using Tree Based Codes.",
                    "Parallel Sequence Comparison and Alignment.",
                    "The Systolic Design of a Block Regularised Parameter Estimator using Hierarchical Signal Flow Graphs.",
                    "Systolic Filter for Fast DNA Similarity Search.",
                    "A Solid Translation Engine using Ray Representation.",
                    "Input buffering requirements of a Systolic Array for the Inverse Discrete Wavelet Transform.",
                    "Synthesis of VLSI Architectures for Two-Dimensional Discrete Wavelet Transforms.",
                    "Parallel Implementation of the Full Search Block Matching Algorithm for Motion Estimation.",
                    "MOVIE: A Building Block for the Design of Real Time Simulator of Moving Pictures Compression Algorithms.",
                    "Motion Estimation Algorithms on Fine Grain Array Processor.",
                    "Bit Level Block Matching Systolic Arrays.",
                    "Techniques for Yield Enhancement of VLSI Adders.",
                    "Interfacing FPGA/VLSI Processor Arrays.",
                    "Implementation of Parallel Arithmetic in a Cellular Automaton.",
                    "Digit On-line Large Radix CORDIC Rotator.",
                    "CORDIC Architectures with Parallel Compensation of the Scale Factor.",
                    "An array processor for inner product computations using a Fermat number ALU.",
                    "Design of a systolic coprocessor for rational addition.",
                    "Multilayer Cellular Algorithm for Complex Number Multiplication.",
                    "Minimizing Synchronization Overhead in Statically Scheduled Multiprocessor Systems.",
                    "Synthesis of Multirate VLSI Arrays.",
                    "A Design Tool for the Specification and the Simulation of Array Processors Architectures - Application to Image Processing: The Extraction of Regions of Interests.",
                    "Precise Tiling for Uniform Loop Nests."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "ASAP 1994",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1994",
                "sub_name": "International Conference on Application Specific Array Processors, ASAP 1994, Proceedings, San Francisco, CA, USA, 22-24 August, 1994.",
                "count": 40,
                "papers": [
                    "Fast linear Hough transform.",
                    "Algorithms and architectures for hierarchical compression of video.",
                    "A high performance IIR filter chip and its evaluation system.",
                    "Automated design of DSP array processor chips.",
                    "Behavioral synthesis of high performance, low cost, and low power application specific processors for linear computations.",
                    "Distributed control synthesis for data-dependent iterative algorithms.",
                    "Rapid prototyping with programmable control paths.",
                    "Minimizing memory requirements in rate-optimal schedules.",
                    "A methodology for performance prediction of Sphinx I in multi-computer architectures.",
                    "Optimal synthesis of application specific heterogeneous pipelined multiprocessors.",
                    "Register transfer modeling and simulation for array processors.",
                    "A systolic array for 2-D DFT and 2-D DCT.",
                    "Analog VLSI arrays for morphological image processing.",
                    "A fast pipelined FFT unit.",
                    "Parallel architectures for computing the Hough transform and CT image reconstruction.",
                    "Verification of regular architectures using ALPHA: a case study.",
                    "A processor-time-minimal schedule for the standard tensor product algorithm.",
                    "A processor for calorimetry at the Large Hadron Collider in the FERMI project.",
                    "Regular array synthesis using ALPHA.",
                    "Data compiling for systems of affine recurrence equations.",
                    "Optimal mapping of systolic algorithms by regular instruction shifts.",
                    "On the injectivity of modular mappings.",
                    "A variable-precision interval arithmetic processor.",
                    "Architectures for lattice structure based orthonormal discrete wavelet transforms.",
                    "A data path array with shared memory as core of a high performance DSP.",
                    "Synthesis of a class of data format converters with specified delays.",
                    "Designing systolic arrays for integer GCD computation.",
                    "A sparse knapsack algo-tech-cuit and its synthesis.",
                    "A parallel system for photo realistic artificial scene rendering.",
                    "Parallel processing of complex data using quaternion and pseudo-quaternion CORDIC algorithms.",
                    "A SIMD solution to the sequence comparison problem on the MGAP.",
                    "Access and alignment of arrays for a bidimensional parallel memory.",
                    "Constant-time triangulation problems on reconfigurable meshes.",
                    "A scalable bit-sequential SIMD array for nearest-neighbor classification using the city-block metric.",
                    "A parallel DSP-based neural network emulator with CMOS VLSI packet switching hardware.",
                    "An efficient VLSI architecture for digital geometry.",
                    "A dynamically reconfigurable wavefront array architecture for evaluation of expressions.",
                    "An optimisation methodology for array mapping of affine recurrence equations in video and image processing.",
                    "Loop transformation methodology for fixed-rate video, image and telecom processing applications.",
                    "Data alignment of loop nests without nonlocal communications."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "ASAP 1993",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1993",
                "sub_name": "International Conference on Application-Specific Array Processors, ASAP 1993, Proceedings, Venice, Italy, 25-27 October, 1993.",
                "count": 62,
                "papers": [
                    "Communication-minimal mapping of uniform loop nests onto distributed memory architectures.",
                    "The Xor embedding: An embedding of hypercubes onto rings and toruses.",
                    "Resource constrained scheduling of uniform algorithm.",
                    "Mapping algorithms onto a multiple-chip data-driven array.",
                    "Scheduling partitioned algorithms on processor arrays with limited communication supports.",
                    "Parallel processing architectures for rank order and stack filters.",
                    "A novel framework for multi-rate scheduling in DSP applications.",
                    "Efficient scalable architectures for Viterbi decoders.",
                    "A wavefront array processor for on the fly processing of digital video streams.",
                    "Subband filtering: Cordic modulation and systolic quadrature mirror filter tree.",
                    "On synthesizing application-specific array architectures from behavioral specifications.",
                    "A simple expert system for the reasoning of systolic designs.",
                    "RELACS for systolic programming.",
                    "Data flow graphs granularity for overhead reduction within a PE in multiprocessor systems.",
                    "A massively parallel diagonal-fold array processor.",
                    "Response-pipelined CAM chips - Building blocks for large associated arrays.",
                    "An array-processor based architecture for classification problems.",
                    "Realization of a real time phasecorrelation chipset used in a hierarchical two step HDTV motion vector estimator.",
                    "Asynchronous relaxation of locally-coupled automata networks, with application to parallel VLSI implementation of iterative image processing algorithms.",
                    "Mapping arbitrary projections for volume rendering onto an array processor.",
                    "M3: A high performance signal processor for RADAR applications.",
                    "COLUMNUS - An SIMD architecture for pattern recognition and simulations of statistical physics.",
                    "Processing of variable size images on a cellular array: Performance analysis with the Abingdon Cross Benchmark.",
                    "Matrix-matrix multiplications and fault tolerance on hypercube multiprocessors.",
                    "A highly-parallel match architecture for AI production systems using application-specific associative matching processors.",
                    "Reconfigurable hardware for molecular biology computing systems.",
                    "Systolic design of a new finite field division/inverse algorithm.",
                    "Mapping Monte Carlo-Metropolis algorithm onto a double ring architecture.",
                    "An application specific processor for implementing stack filters.",
                    "Low-power polygon renderer for computer graphics.",
                    "Volume rendering by wavefront architecture.",
                    "Time-optimal visibility-related algorithms on meshes with multiple broadcasting.",
                    "A real-time systolic algorithm for on-the-fly hidden surface removal.",
                    "An efficient algorithm for image-template product on SIMD mesh connected computers.",
                    "A period-processor-time-minimal schedule for cubical mesh algorithms.",
                    "I/O data management on SIMD systolic arrays.",
                    "Optimum vectorization of scalable synchronous dataflow graphs.",
                    "A new formulation of the mapping conditions for the synthesis of linear systolic arrays.",
                    "The PAPRICA SIMD array: Critical reviews and perspectives.",
                    "Formal descriptions, semantics and verification of VLSI array processors.",
                    "An application-specific array architecture for feedforward with backpropagation ANNs.",
                    "GENES IV: A bit-serial processing element for a built-model neural-network accelerator.",
                    "Implementation of large neural associative memories by massively parallel array processors.",
                    "A fast, storage-efficient parallel sorting algorithm.",
                    "A practical constant time sorting network.",
                    "Multi-rate transformation of directional affine recurrence equations.",
                    "An algorithm for accurate data dependence test.",
                    "Synthesis of dedicated SIMD processors.",
                    "Efficient exploration of nonuniform space-time transformations for optimal systolic array synthesis.",
                    "Node merging: A transformation on bit-level dependence graphs for efficient VLSI array design.",
                    "Heterogeneous BISR techniques for yield and reliability enhancement using high level synthesis transformations.",
                    "Digit systolic algorithms for fine-grain architectures.",
                    "Reduced area multipliers.",
                    "A novel architecture for a decision-feedback equalizer using extended signal-digit feedback.",
                    "Systolic normalization of rational numbers.",
                    "Systolic evaluation of functions: Digit-level algorithm and realization.",
                    "Design of a VLSI circuit for on-line evaluation of several elementary functions using their Taylor expansions.",
                    "VLSI array synthesis for polynomial GCD computation.",
                    "An optimal algo-tech-cuit for the knapsack problem.",
                    "Efficient architecture of a programmable block matching processor.",
                    "A 1D linearly expandable interconnection network performance analysis.",
                    "A CAD tool for electromagnetic simulation on the associative string processor."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "ASAP 1992",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1992",
                "sub_name": "Application Specific Array Processors, ASAP 1992, Proceedings of the International Conference on, Berkeley, CA, USA, 4-7 August, 1992.",
                "count": 50,
                "papers": [
                    "A transformative approach to the partitioning of processor arrays.",
                    "Hierarchical scheduling of DSP programs onto multiprocessors for maximum throughput.",
                    "Linear scheduling is close to optimality.",
                    "On systolic mapping of multi-stage algorithms.",
                    "A projective geometry architecture for scientific computation.",
                    "On cycle borrowing analyses for interconnected chips driven by clocks having different but commensurable speeds.",
                    "On partitioning of multistage algorithms and design of intermediate memories.",
                    "A reconfigurable processor array with routing LSIs and general purpose DSPs.",
                    "Synthesis of application-specific multiprocessor systems including memory components.",
                    "An integrated system for rapid prototyping of high performance algorithm specific data paths.",
                    "ARREST: an interactive graphic analysis tool for VLSI arrays.",
                    "Pipelining: just another transformation.",
                    "SPERT: a VLIW/SIMD microprocessor for artificial neural network computations.",
                    "Implementing a family of high performance, micrograined architectures.",
                    "Deterministic Boltzmann machine VLSI can be scaled using multi-chip modules.",
                    "Discrete wavelet transforms in VLSI.",
                    "Algorithms and architectures for high performance recursive filtering.",
                    "On metrics of 'super performance' [signal processing systems].",
                    "Advanced technology for improved signal processor efficiency.",
                    "Some low power implementations of DSP algorithms.",
                    "MUSE-a systolic array for adaptive nulling with 64 degrees of freedom, using Givens transformations and wafer scale integration.",
                    "Heterogeneous digital signal processing systems for sonar.",
                    "Constant capacity signal flow signal processor architecture benchmark.",
                    "Application and packaging of the AT&T DSP3 parallel signal processor.",
                    "Architecture and realization of a multi signal processor system.",
                    "The Sarnoff Engine: a massively parallel computer for high definition system simulation.",
                    "High speed bit-level pipelined architectures for redundant CORDIC implementation.",
                    "High-speed VLSI architectures for soft-output Viterbi decoding.",
                    "An architecture for tree search based vector quantization for single chip implementation.",
                    "A systolic array chip for robot inverse dynamics computation.",
                    "A method to synthesize modular systolic arrays with local broadcast facility.",
                    "A systolic rank revealing QR algorithm.",
                    "Interval-related problems on reconfigurable meshes.",
                    "A parallel sorting algorithm on an eight-neighbor processor array.",
                    "Fault tolerant matrix triangularization and solution of linear systems of equations.",
                    "Systolic architectures for finite-state vector quantization.",
                    "Matrix computations in arrays of DSPs.",
                    "MAMACG: a tool for automatic mapping of matrix algorithms onto mesh array computational graphs.",
                    "Determining longest common subsequences of two sequences on a linear array of processors.",
                    "Associative information processing: algorithms and system.",
                    "Parallel architecture for a pel-recursive motion estimation algorithm.",
                    "Mapping locally recursive SEGs upon a multiprocessor system in a ring network.",
                    "Transformation techniques for serial array design.",
                    "Compilation of narrowband spectral detection systems for linear MIMD machines.",
                    "Programming systolic arrays.",
                    "Scheduling partitions in systolic algorithms.",
                    "Optimal design of lower dimensional processor arrays for uniform recurrences.",
                    "Efficient scheduling methods for partitioned systolic algorithms.",
                    "Fully static multiprocessor realization for real-time recursive DSP algorithms.",
                    "High level software synthesis for signal processing systems."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "ASAP 1991",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1991",
                "sub_name": "Application Specific Array Processors, 1991. Proceedings of the International Conference on, Barcelona, Spain, 2-4 Sept., 1991.",
                "count": 34,
                "papers": [
                    "The case for application specific computing.",
                    "Implementation of a VLSI polynomial evaluator for real-time applications.",
                    "A defect tolerant systolic array implementation for real time image processing.",
                    "The systematic design of a motion estimation array architecture.",
                    "Transformation of systolic algorithms for interleaving partitions.",
                    "Mapping different node types of dependence graphs into the same processing element.",
                    "Mapping FIR filtering on systolic rings.",
                    "The missing dimension in real-time signal processing architectures.",
                    "A wave digital filter three-port adaptor with fine grained pipelining.",
                    "The Arithmetic Cube: error analysis and simulation.",
                    "Biological information signal processor.",
                    "Parallel digital implementations of neural networks.",
                    "Partitioning schemes for circuit simulation on a multiprocessor array.",
                    "Parallel implementations of discrete relaxation technique on fixed size processor arrays.",
                    "Parallel strong orientation on a mesh connected computer.",
                    "Parallel array architectures for motion estimation.",
                    "CAPMA: a content-addressable pattern match architecture for production systems.",
                    "High speed implementation of 1-D and 2-D morphological operations.",
                    "Pipelining and transposing heterogeneous array circuits.",
                    "A decoupled access/execute processor for matrix algorithms: architecture and programming.",
                    "Uniform but non-local DAGS: a trade-off between pure systolic and SIMD solutions.",
                    "A TSP engine for performing tabu search.",
                    "Synthesis of systolic arrays by equation transformations.",
                    "Automatic formal verification of systolic array designs.",
                    "Consistency in dataflow graphs.",
                    "Synthesizing systolic arrays: some recent developments.",
                    "A design method for on-line reconfigurable array processors.",
                    "Processor clustering for the design of optimal fixed-size systolic arrays.",
                    "A 40 megasample IIR filter chip.",
                    "GFLOPS: a general flexible linearly organized parallel structure for images.",
                    "Fast generation of long sorted runs for sorting a large file.",
                    "A modular systolic 2-D torus for the general knapsack problem.",
                    "A systolic algorithm for the triangular Stein equation.",
                    "Systolic architecture for adaptive eigenstructure decomposition based on simultaneous iteration method."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "ASAP 1990",
        "info": "Princeton, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asap/1990",
                "sub_name": "Application Specific Array Processors, ASAP 1990. Proceedings of the International Conference on, Princeton, NJ, USA, 5-7 Sept., 1990.",
                "count": 68,
                "papers": [
                    "Calculus of space-optimal mappings of systolic algorithms on processor arrays.",
                    "A processor-time minimal systolic array for transitive closure.",
                    "Systolic array implementation of nested loop programs.",
                    "The bit-serial systolic back-projection engine (BSSBPE).",
                    "A database machine based on surrogate files.",
                    "Systolic architectures for decoding Reed-Solomon codes.",
                    "Mapping high-dimension wavefront computations to silicon.",
                    "Systolic architecture for 2-D rank order filtering.",
                    "Scheduling affine parameterized recurrences by means of Variable Dependent Timing Functions.",
                    "The Logic Description Generator.",
                    "Recursive algorithms for AR spectral estimation and their array realizations.",
                    "Analysing parametrised designs by non-standard interpretation.",
                    "Systolic VLSI compiler (SVC) for high performance vector quantisation chips.",
                    "Extensions to linear mapping for regular arrays with complex processing elements.",
                    "Design of run-time fault-tolerant arrays of self-checking processing elements.",
                    "GRAPE: a special-purpose computer for N-body problems.",
                    "Building blocks for a new generation of application specific computing systems.",
                    "Reconfigurable vector register windows for fast matrix computation on the orthogonal multiprocessor.",
                    "Massively parallel architecture: application to neural net emulation and image reconstruction.",
                    "A real-time software programmable processor for HDTV and stereo scope signals.",
                    "Mapping algorithms onto the TUT cellular array processor.",
                    "A 3-D wafer scale architecture for early vision processing.",
                    "Algorithmic mapping of neural network models onto parallel SIMD machines.",
                    "Implementation of systolic algorithms using pipelined functional units.",
                    "Array processing on finite polynomial rings.",
                    "The RAP: a ring array processor for layered network calculations.",
                    "Linear arrays for residue mappers.",
                    "A fault-tolerant two-dimensional sorting network.",
                    "Channel complexity analysis for reconfigurable VLSI/WSI processor arrays.",
                    "Digit-serial DSP architectures.",
                    "PASIC. A sensor/processor array for computer vision.",
                    "An analog VLSI array processor for classical and connectionist AI.",
                    "Systolic two-port adaptor for high performance wave digital filtering.",
                    "An improved multilayer neural model and array processor implementation.",
                    "Reconfiguration of FFT arrays: a flow-driven approach.",
                    "Towards the automated design of application specific array processors (ASAPs).",
                    "Fault-tolerant array processors using N-and-half-track switches.",
                    "Domain flow and streaming architectures.",
                    "An improved systolic extended Euclidean algorithm for Reed-Solomon decoding: design and implementation.",
                    "Digit-serial VLSI microarchitecture.",
                    "CMOS VLSI Lukasiewicz logic arrays.",
                    "Dynamic systolic associative memory chip.",
                    "ASP modules: building-blocks for application-specific massively parallel processors.",
                    "Designing specific systolic arrays with the API15C chip.",
                    "A prototype for a fault tolerant parallel digital signal processor.",
                    "Byte-serial convolvers.",
                    "A VLSI architecture for simplified arithmetic Fourier transform algorithm.",
                    "Fine-grain system architectures for systolic emulation of neural algorithms.",
                    "Programming environment for a line processor-SYMPATI-2.",
                    "A feedback concentrator for the Image Understanding Architecture.",
                    "A design methodology for fixed-size systolic arrays.",
                    "A formal design methodology for parallel architectures.",
                    "A multiple-level heterogeneous architecture for image understanding.",
                    "Application specific VLSI architectures based on De Bruijn graphs.",
                    "A graph-based approach to map matrix algorithms onto local-access processor arrays.",
                    "Application-specific coprocessor computer architecture.",
                    "Embedding pyramids in array processors with pipelined busses.",
                    "Implementation of ANN on RISC processor array.",
                    "Systolic-based computing machinery for radar signal processing studies.",
                    "A systolic array for nonlinear adaptive filtering and pattern recognition.",
                    "Parallel algorithm for traveling salesman problem on SIMD machines using simulated annealing.",
                    "The design of a high-performance scalable architecture for image processing applications.",
                    "Testing a motion estimator array.",
                    "Spacetime-minimal systolic architectures for Gaussian elimination and the algebraic path problem.",
                    "Two-level pipelined implementation of systolic block Householder transformation with application to RLS algorithm.",
                    "Bit-level systolic algorithm for the symmetric eigenvalue problem.",
                    "A practical runtime test method for parallel lattice-gas automata.",
                    "A systolic array programming language."
                ]
            }
        ]
    }
]