[
    {
        "year": "2022",
        "name": "ASPLOS-XXVII 2022",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2022",
                "sub_name": "ASPLOS '22: 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Lausanne, Switzerland, 28 February 2022 - 4 March 2022.",
                "count": 80,
                "papers": [
                    "TaskStream: accelerating task-parallel workloads by recovering program structure.",
                    "DOTA: detect and omit weak attentions for scalable transformer acceleration.",
                    "A full-stack search technique for domain optimized deep learning accelerators.",
                    "FINGERS: exploiting fine-grained parallelism in graph mining accelerators.",
                    "BiSon-e: a lightweight and high-performance accelerator for narrow integer linear algebra computing on the edge.",
                    "Software-defined address mapping: a case on 3D memory.",
                    "Parallel virtualized memory translation with nested elastic cuckoo page tables.",
                    "CARAT CAKE: replacing paging via compiler/kernel cooperation.",
                    "NVAlloc: rethinking heap metadata management in persistent memory allocators.",
                    "Every walk's a hit: making page walks single-access cache hits.",
                    "GPM: leveraging persistent memory from a GPU.",
                    "GPUReplay: a 50-KB GPU stack for client ML.",
                    "ValueExpert: exploring value patterns in GPU-accelerated applications.",
                    "SparseCore: stream ISA and processor specialization for sparse computation.",
                    "JSONSki: streaming semi-structured data with bit-parallel fast-forwarding.",
                    "MineSweeper: a \"clean sweep\" for drop-in use-after-free prevention.",
                    "Revizor: testing black-box CPUs against speculation contracts.",
                    "Protecting adaptive sampling from information leakage on low-power sensors.",
                    "One size does not fit all: security hardening of MIPS embedded systems via static binary debloating for shared libraries.",
                    "ViK: practical mitigation of temporal memory safety violations through object ID inspection.",
                    "Eavesdropping user credentials via GPU side channels on smartphones.",
                    "CRISP: critical slice prefetching.",
                    "Pinned loads: taming speculative loads in secure processors.",
                    "DAGguise: mitigating memory timing side channels.",
                    "RecShard: statistical feature-based memory optimization for industry-scale neural recommendation.",
                    "AStitch: enabling a new multi-dimensional optimization space for memory-intensive ML training and inference on modern SIMT architectures.",
                    "NASPipe: high performance and reproducible pipeline parallel supernet training via causal synchronous parallelism.",
                    "VELTAIR: towards high-performance multi-tenant deep learning services via adaptive compilation and scheduling.",
                    "Breaking the computation and communication abstraction barrier in distributed machine learning workloads.",
                    "Clio: a hardware-software co-designed disaggregated memory system.",
                    "Enzian: an open, general, CPU/FPGA platform for systems software research.",
                    "Efficient and scalable core multiplexing with M³v.",
                    "FlexOS: towards flexible OS isolation.",
                    "Adelie: continuous address space layout re-randomization for Linux drivers.",
                    "Suppressing ZZ crosstalk of Quantum computers through pulse and scheduling co-optimization.",
                    "QUEST: systematically approximating Quantum circuits for higher output fidelity.",
                    "HAMMER: boosting fidelity of noisy Quantum circuits by exploiting Hamming behavior of erroneous outcomes.",
                    "LILLIPUT: a lightweight low-latency lookup-table decoder for near-term Quantum error correction.",
                    "Paulihedral: a generalized block-wise compiler optimization framework for Quantum simulation kernels.",
                    "Astraea: towards QoS-aware and resource-efficient multi-stage GPU services.",
                    "Memory-harvesting VMs in cloud platforms.",
                    "IOCost: block IO control for containers in datacenters.",
                    "TMO: transparent memory offloading in datacenters.",
                    "SOL: safe on-node learning in cloud platforms.",
                    "GenStore: a high-performance in-storage processing system for genome sequence analysis.",
                    "ProSE: the architecture and design of a protein discovery engine.",
                    "A one-for-all and o(v log(v ))-cost solution for parallel merge style operations on sorted key-value arrays.",
                    "Client-optimized algorithms and acceleration for encrypted compute offloading.",
                    "Finding missed optimizations through the lens of dead code elimination.",
                    "A tree clock data structure for causal orderings in concurrent executions.",
                    "RSSD: defend against ransomware with hardware-isolated network-storage codesign and post-attack analysis.",
                    "Creating concise and efficient dynamic analyses with ALDA.",
                    "IceBreaker: warming serverless functions better with heterogeneity.",
                    "INFless: a native serverless system for low-latency, high-throughput inference.",
                    "FaaSFlow: enable efficient workflow execution for function-as-a-service.",
                    "Serverless computing on heterogeneous computers.",
                    "CoolEdge: hotspot-relievable warm water cooling for energy-efficient edge datacenters.",
                    "Yashme: detecting persistency races.",
                    "EXAMINER: automatically locating inconsistent instructions between real devices and CPU emulators for ARM.",
                    "Path-sensitive and alias-aware typestate analysis for detecting OS bugs.",
                    "Efficiently detecting concurrency bugs in persistent memory programs.",
                    "Who goes first? detecting go concurrency bugs via message reordering.",
                    "CryoWire: wire-driven microarchitecture designs for cryogenic computing.",
                    "REVAMP: a systematic framework for heterogeneous CGRA realization.",
                    "PLD: fast FPGA compilation to make reconfigurable acceleration compatible with modern incremental refinement software development.",
                    "Debugging in the brave new world of reconfigurable hardware.",
                    "Temporal and SFQ pulse-streams encoding for area-efficient superconducting accelerators.",
                    "Understanding and exploiting optimal function inlining.",
                    "CirFix: automatically repairing defects in hardware design code.",
                    "Vector instruction selection for digital signal processors using program synthesis.",
                    "HeteroGen: transpiling C to heterogeneous HLS code with automated test generation and program repair.",
                    "Tree traversal synthesis using domain-specific symbolic compilation.",
                    "SRAM has no chill: exploiting power domain separation to steal on-chip secrets.",
                    "Randomized row-swap: mitigating Row Hammer by breaking spatial correlation between aggressor and victim rows.",
                    "ShEF: shielded enclaves for cloud FPGAs.",
                    "Invisible bits: hiding secret messages in SRAM's analog domain.",
                    "Taurus: a data plane architecture for per-packet ML.",
                    "FlexDriver: a network driver for your accelerator.",
                    "The benefits of general-purpose on-NIC memory.",
                    "Domain specific run time optimization for software data planes."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "ASPLOS-XXVI 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2021",
                "sub_name": "ASPLOS '21: 26th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Virtual Event, USA, April 19-23, 2021.",
                "count": 75,
                "papers": [
                    "PacketMill: toward per-Core 100-Gbps networking.",
                    "Autonomous NIC offloads.",
                    "Dagger: efficient and fast RPCs in cloud microservices with near-memory reconfigurable NICs.",
                    "BCD deduplication: effective memory compression using partial cache-line deduplication.",
                    "KLOCs: kernel-level object contexts for heterogeneous memory systems.",
                    "Rethinking software runtimes for disaggregated memory.",
                    "DiAG: a dataflow-inspired architecture for general-purpose processors.",
                    "LifeStream: a high-performance stream processing engine for periodic streams.",
                    "When application-specific ISA meets FPGAs: a multi-layer virtualization framework for heterogeneous cloud FPGAs.",
                    "Sage: practical and scalable ML-driven performance debugging in microservices.",
                    "Nightcore: efficient and scalable serverless computing for latency-sensitive, interactive microservices.",
                    "Sinan: ML-based and QoS-aware resource management for cloud microservices.",
                    "NOREBA: a compiler-informed non-speculative out-of-order commit processor.",
                    "Fast local page-tables for virtualized NUMA servers with vMitosis.",
                    "PTEMagnet: fine-grained physical memory reservation for faster page walks in public clouds.",
                    "In-fat pointer: hardware-assisted tagged-pointer spatial memory safety defense with subobject granularity protection.",
                    "Judging a type by its pointer: optimizing GPU virtual functions.",
                    "Enclosure: language-based restriction of untrusted libraries.",
                    "Switches for HIRE: resource scheduling for data center in-network computing.",
                    "Probabilistic profiling of stateful data planes for adversarial testing.",
                    "MERCI: efficient embedding reduction on commodity hardware via sub-query memoization.",
                    "SherLock: unsupervised synchronization-operation inference.",
                    "SIMDRAM: a framework for bit-serial SIMD processing using DRAM.",
                    "Clobber-NVM: log less, re-execute more.",
                    "Time-optimal Qubit mapping.",
                    "Orchestrated trios: compiling for efficient communication in Quantum programs with 3-Qubit gates.",
                    "FaasCache: keeping serverless computing alive with greedy-dual caching.",
                    "Hippocrates: healing persistent memory bugs without doing any harm.",
                    "Jaaru: efficiently model checking persistent memory programs.",
                    "Corundum: statically-enforced persistent memory safety.",
                    "Qraft: reverse your Quantum circuit and know the correct program output.",
                    "Logical abstractions for noisy variational Quantum algorithm simulation.",
                    "CutQC: using small Quantum computers for large Quantum circuit evaluations.",
                    "PMFuzz: test case generation for persistent memory programs.",
                    "Fast, flexible, and comprehensive bug detection for persistent memory programs.",
                    "PMEM-spec: persistent memory speculation (strict persistency can trump relaxed persistency).",
                    "VSync: push-button verification and optimization for synchronization primitives on weak memory models.",
                    "CubicleOS: a library OS with software componentisation for practical isolation.",
                    "Benchmarking, analysis, and optimization of serverless function snapshots.",
                    "Rhythmic pixel regions: multi-resolution visual sensing system towards high-precision visual computing at low power.",
                    "Q-VR: system-level design for future mobile collaborative virtual reality.",
                    "Warehouse-scale video acceleration: co-design and deployment in the wild.",
                    "Automatically detecting and fixing concurrency bugs in go software systems.",
                    "C11Tester: a race detector for C/C++ atomics.",
                    "Kard: lightweight data race detection with per-thread memory protection.",
                    "Quantifying the design-space tradeoffs in autonomous drones.",
                    "Robomorphic computing: a design methodology for domain-specific accelerators parameterized by robot morphology.",
                    "Gamma: leveraging Gustavson's algorithm to accelerate sparse matrix multiplication.",
                    "Reducing solid-state drive read latency by optimizing read-retry.",
                    "RecSSD: near data processing for solid state drive based recommendation inference.",
                    "Prolonging 3D NAND SSD lifetime via read latency relaxation.",
                    "PIBE: practical kernel control-flow hardening with profile-guided indirect branch elimination.",
                    "Computing with time: microarchitectural weird machines.",
                    "HerQules: securing programs via hardware-enforced message queues.",
                    "Effective simulation and debugging for a high-level hardware language using software compilers.",
                    "A compiler infrastructure for accelerator generators.",
                    "Compiler-driven FPGA virtualization with SYNERGY.",
                    "BayesPerf: minimizing performance monitoring errors using Bayesian statistics.",
                    "Training for multi-resolution inference using reusable quantization terms.",
                    "A hierarchical neural model of data prefetching.",
                    "Vectorization for digital signal processors via equality saturation.",
                    "Scalable FSM parallelization via path fusion and higher-order speculation.",
                    "VeGen: a vectorizer generator for SIMD and beyond.",
                    "Neural architecture search as program transformation exploration.",
                    "Analytical characterization and design space exploration for optimization of CNNs.",
                    "Mind mappings: enabling efficient algorithm-accelerator mapping space search.",
                    "Statistical robustness of Markov chain Monte Carlo accelerators.",
                    "NeuroEngine: a hardware-based event-driven simulation system for advanced brain-inspired computing.",
                    "Defensive approximation: securing CNNs using approximate computing.",
                    "Language-parametric compiler validation with application to LLVM.",
                    "Incremental CFG patching for binary rewriting.",
                    "Who's debugging the debuggers? exposing debug information bugs in optimized binaries.",
                    "Speculative interference attacks: breaking invisible speculation schemes.",
                    "Jamais vu: thwarting microarchitectural replay attacks.",
                    "Streamline: a fast, flushless cache covert-channel attack by enabling asynchronous collusion."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ASPLOS-XXV 2020",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2020",
                "sub_name": "ASPLOS '20: Architectural Support for Programming Languages and Operating Systems, Lausanne, Switzerland, March 16-20, 2020.",
                "count": 88,
                "papers": [
                    "Big Data of the Past, from Venice to Europe.",
                    "Shredder: Learning Noise Distributions to Protect Inference Privacy.",
                    "DNNGuard: An Elastic Heterogeneous DNN Accelerator Architecture against Adversarial Attacks.",
                    "Game of Threads: Enabling Asynchronous Poisoning Attacks.",
                    "Reliable Timekeeping for Intermittent Computing.",
                    "Forget Failure: Exploiting SRAM Data Remanence for Low-overhead Intermittent Computation.",
                    "Time-sensitive Intermittent Computing Meets Legacy Software.",
                    "IOctopus: Outsmarting Nonuniform DMA.",
                    "Lynx: A SmartNIC-driven Accelerator-centric Architecture for Network Servers.",
                    "Egalito: Layout-Agnostic Binary Recompilation.",
                    "Noise-Aware Dynamical System Compilation for Analog Devices with Legno.",
                    "Reproducible Containers.",
                    "Atomicity Checking in Linear Time using Vector Clocks.",
                    "Hermes: A Fast, Fault-Tolerant and Linearizable Replication Protocol.",
                    "FlexAmata: A Universal and Efficient Adaption of Applications to Spatial Automata Processing Accelerators.",
                    "Accelerating Legacy String Kernels via Bounded Automata Learning.",
                    "Why GPUs are Slow at Executing NFAs and How to Make them Faster.",
                    "∅sim: Preparing System Software for a World with Terabyte-scale Memories.",
                    "Mitosis: Transparently Self-Replicating Page-Tables for Large-Memory Machines.",
                    "Hailstorm: Disaggregated Compute and Storage for Distributed LSM-based Databases.",
                    "Peacenik: Architecture Support for Not Failing under Fail-Stop Memory Consistency.",
                    "Durable Transactional Memory Can Scale with Timestone.",
                    "Perspective: A Sensible Approach to Speculative Automatic Parallelization.",
                    "Interstellar: Using Halide's Scheduling Language to Analyze DNN Accelerators.",
                    "DeepSniffer: A DNN Model Extraction Framework Based on Learning Architectural Hints.",
                    "Prague: High-Performance Heterogeneity-Aware Asynchronous Decentralized Training.",
                    "Livia: Data-Centric Computing Throughout the Memory Hierarchy.",
                    "A Computational Temporal Logic for Superconducting Accelerators.",
                    "CryoCache: A Fast, Large, and Cost-Effective Cache Architecture for Cryogenic Computing.",
                    "Current and Projected Needs for High Energy Physics Experiments (with a Particular Eye on CERN LHC).",
                    "Catalyzer: Sub-millisecond Startup for Serverless Computing with Initialization-less Booting.",
                    "High-density Multi-tenant Bare-metal Cloud.",
                    "Data Center Power Oversubscription with a Medium Voltage Power Plane and Priority-Aware Capping.",
                    "Classifying Memory Access Patterns for Prefetching.",
                    "Thesaurus: Efficient Cache Compression via Dynamic Clustering.",
                    "Learning-based Memory Allocation for C++ Server Workloads.",
                    "Optimizing Nested Virtualization Performance Using Direct Virtual Hardware.",
                    "HaRMony: Heterogeneous-Reliability Memory and QoS-Aware Energy Management on Virtualized Servers.",
                    "LeapIO: Efficient and Portable Virtual NVMe Storage on ARM SoCs.",
                    "Challenging Sequential Bitstream Processing via Principled Bitwise Speculation.",
                    "Vortex: Extreme-Performance Memory Abstractions for Data-Intensive Streaming Applications.",
                    "Fleet: A Framework for Massively Parallel Streaming on FPGAs.",
                    "Hurdle: Securing Jump Instructions Against Code Reuse Attacks.",
                    "Exploring Branch Predictors for Constructing Transient Execution Trojans.",
                    "A Benchmark Suite for Evaluating Caches' Vulnerability to Timing Attacks.",
                    "BYOC: A \"Bring Your Own Core\" Framework for Heterogeneous-ISA Research.",
                    "FirePerf: FPGA-Accelerated Full-System Hardware/Software Performance Profiling and Co-Design.",
                    "Accelerometer: Understanding Acceleration Opportunities for Data Center Overheads at Hyperscale.",
                    "AsymNVM: An Efficient Framework for Implementing Persistent Data Structures on Asymmetric NVM Architecture.",
                    "MOD: Minimally Ordered Durable Datastructures for Persistent Memory.",
                    "Pronto: Easy and Fast Persistence for Volatile Data Structures.",
                    "AvA: Accelerated Virtualization of Accelerators.",
                    "A Hypervisor for Shared-Memory FPGA Platforms.",
                    "Virtualizing FPGAs in the Cloud.",
                    "FlexTensor: An Automatic Schedule Exploration and Optimization Framework for Tensor Computation on Heterogeneous System.",
                    "AutoTM: Automatic Tensor Movement in Heterogeneous Memory Systems using Integer Linear Programming.",
                    "Capuchin: Tensor-based GPU Memory Management for Deep Learning.",
                    "PatDNN: Achieving Real-Time DNN Execution on Mobile Devices with Pattern-based Weight Pruning.",
                    "Coterie: Exploiting Frame Similarity to Enable High-Quality Multiplayer VR on Commodity Mobile Devices.",
                    "Orbital Edge Computing: Nanosatellite Constellations as a New Class of Computer System.",
                    "Occlum: Secure and Efficient Multitasking Inside a Single Enclave of Intel SGX.",
                    "COIN Attacks: On Insecurity of Enclave Untrusted Interfaces in SGX.",
                    "MERR: Improving Security of Persistent Memory Objects via Efficient Memory Exposure Reduction and Randomization.",
                    "Software Mitigation of Crosstalk on Noisy Intermediate-Scale Quantum Computers.",
                    "Quantum Circuits for Dynamic Runtime Assertions in Quantum Computation.",
                    "Towards Efficient Superconducting Quantum Processor Architecture Design.",
                    "SAC: A Co-Design Cache Algorithm for Emerging SMR-based High-Density Disks.",
                    "Fair Write Attribution and Allocation for Consolidated Flash Cache.",
                    "FlatStore: An Efficient Log-Structured Key-Value Storage Engine for Persistent Memory.",
                    "Elastic Cuckoo Page Tables: Rethinking Virtual Memory Translation for Parallelism.",
                    "NeuMMU: Architectural Support for Efficient Address Translations in Neural Processing Units.",
                    "Safecracker: Leaking Secrets through Compressed Caches.",
                    "Effective Concurrency Testing for Distributed Systems.",
                    "HMC: Model Checking for Hardware Memory Models.",
                    "Lazy Release Persistency.",
                    "Cross-Failure Bug Detection in Persistent Memory Programs.",
                    "Optimus Prime: Accelerating Data Transformation in Servers.",
                    "The TrieJax Architecture: Accelerating Graph Operations Through Relational Joins.",
                    "IIU: Specialized Architecture for Inverted Index Search.",
                    "Chronos: Efficient Speculative Parallelism for Accelerators.",
                    "Klotski: Efficient Obfuscated Execution against Controlled-Channel Attacks.",
                    "The Guardian Council: Parallel Programmable Hardware Security.",
                    "HEAX: An Architecture for Computing on Encrypted Data.",
                    "Evanesco: Architectural Support for Efficient Data Sanitization in Modern Flash-Based Storage Systems.",
                    "Dimensionality-Aware Redundant SIMT Instruction Elimination.",
                    "SwapAdvisor: Pushing Deep Learning Beyond the GPU Memory Limit via Smart Swapping.",
                    "Batch-Aware Unified Memory Management in GPUs for Irregular Workloads.",
                    "HSM: A Hybrid Slowdown Model for Multitasking GPUs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ASPLOS-XXIV 2019",
        "info": "Providence, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2019",
                "sub_name": "Proceedings of the Twenty-Fourth International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2019, Providence, RI, USA, April 13-17, 2019.",
                "count": 76,
                "papers": [
                    "Keynote: Multicore Programming.",
                    "Keynote: Developing our Quantum Future.",
                    "An Open-Source Benchmark Suite for Microservices and Their Hardware-Software Implications for Cloud & Edge Systems.",
                    "Seer: Leveraging Big Data to Navigate the Complexity of Performance Debugging in Cloud Microservices.",
                    "RPCValet: NI-Driven Tail-Aware Balancing of µs-Scale RPCs.",
                    "A Framework for Memory Oversubscription Management in Graphics Processing Units.",
                    "Swizzle Inventor: Data Movement Synthesis for GPU Kernels.",
                    "Scalable Processing of Contemporary Semi-Structured Data on Commodity Parallel Processors - A Compilation-based Approach.",
                    "Fast and Scalable VMM Live Upgrade in Large Cloud Infrastructure.",
                    "PARTIES: QoS-Aware Resource Partitioning for Multiple Interactive Services.",
                    "X-Containers: Breaking Down Barriers to Improve Performance and Isolation of Cloud-Native Containers.",
                    "Buffets: An Efficient and Composable Storage Idiom for Explicit Decoupled Data Orchestration.",
                    "HiWayLib: A Software Framework for Enabling High Performance Communications for Heterogeneous Pipeline Computations.",
                    "StreamBox-HBM: Stream Analytics on High Bandwidth Hybrid Memory.",
                    "Puddle: A Dynamic, Error-Correcting, Full-Stack Microfluidics Platform.",
                    "Intelligence Beyond the Edge: Inference on Intermittent Embedded Systems.",
                    "Boosted Race Trees for Low Energy Classification.",
                    "Compress Objects, Not Cache Lines: An Object-Based Compressed Memory Hierarchy.",
                    "Beating OPT with Statistical Clairvoyance and Variable Size Caching.",
                    "A Formal Analysis of the NVIDIA PTX Memory Consistency Model.",
                    "Just-In-Time Compilation for Verilog: A New Technique for Improving the FPGA Programming Experience.",
                    "DCNS: Automated Detection Of Conservative Non-Sleep Defects in the Linux Kernel.",
                    "A Case for Lease-Based, Utilitarian Resource Management on Mobile Devices.",
                    "Software-Defined Far Memory in Warehouse-Scale Computers.",
                    "Nimble Page Management for Tiered Memory Systems.",
                    "HawkEye: Efficient Fine-grained OS Support for Huge Pages.",
                    "Architectural Support for Containment-based Security.",
                    "CheriABI: Enforcing Valid Pointer Provenance and Minimizing Pointer Privilege in the POSIX C Run-time Environment.",
                    "Context-Sensitive Fencing: Securing Speculative Execution via Microcode Customization.",
                    "PMTest: A Fast and Flexible Testing Framework for Persistent Memory Programs.",
                    "Finding and Fixing Performance Pathologies in Persistent Memory Software Stacks.",
                    "Fine-Grain Checkpointing with In-Cache-Line Logging.",
                    "Heterogeneous Isolated Execution for Commodity GPUs.",
                    "Morpheus: A Vulnerability-Tolerant Secure Architecture Based on Ensembles of Moving Target Defenses with Churn.",
                    "DeepSigns: An End-to-End Watermarking Framework for Ownership Protection of Deep Neural Networks.",
                    "FA3C: FPGA-Accelerated Deep Reinforcement Learning.",
                    "AcMC 2 : Accelerating Markov Chain Monte Carlo Algorithms for Probabilistic Models.",
                    "Targeting Classical Code to a Quantum Annealer.",
                    "ProbeGuard: Mitigating Probing Attacks Through Reactive Program Transformations.",
                    "kMVX: Detecting Kernel Information Leaks with Multi-variant Execution.",
                    "MVEDSUA: Higher Availability Dynamic Software Updates via Multi-Version Execution.",
                    "PnP: Pruning and Prediction for Point-To-Point Iterative Graph Analytics.",
                    "DiGraph: An Efficient Path-based Iterative Directed Graph Processing System on Multiple GPUs.",
                    "Phoenix: A Substrate for Resilient Distributed Graph Analytics.",
                    "BOGO: Buy Spatial Memory Safety, Get Temporal Memory Safety (Almost) Free.",
                    "Protecting Page Tables from RowHammer Attacks using Monotonic Pointers in DRAM True-Cells.",
                    "ρ: Relaxed Hierarchical ORAM.",
                    "uops.info: Characterizing Latency, Throughput, and Port Usage of Instructions on Intel Microarchitectures.",
                    "Bootstrapping: Using SMT Hardware to Improve Single-Thread Performance.",
                    "CORF: Coalescing Operand Register File for GPUs.",
                    "PUMA: A Programmable Ultra-efficient Memristor-based Accelerator for Machine Learning Inference.",
                    "FPSA: A Full System Stack Solution for Reconfigurable ReRAM-based NN Accelerator Architecture.",
                    "Bit-Tactical: A Software/Hardware Approach to Exploiting Value and Bit Sparsity in Neural Networks.",
                    "pLock: A Fast Lock for Architectures with Explicit Inter-core Message Passing.",
                    "MV-RLU: Scaling Read-Log-Update with Multi-Versioning.",
                    "Fast Fine-Grained Global Synchronization on GPUs.",
                    "TANGRAM: Optimized Coarse-Grained Dataflow for Scalable NN Accelerators.",
                    "Packing Sparse Convolutional Neural Networks for Efficient Systolic Array Implementations: Column Combining Under Joint Optimization.",
                    "Split-CNN: Splitting Window-based Operations in Convolutional Neural Networks for Memory System Optimization.",
                    "Replica: A Wireless Manycore for Communication-Intensive and Approximate Data.",
                    "Understanding Real-World Concurrency Bugs in Go.",
                    "Lazy Determinism for Faster Deterministic Multithreading.",
                    "Hop: Heterogeneity-aware Decentralized Training.",
                    "Astra: Exploiting Predictability to Optimize Deep Learning.",
                    "ADMM-NN: An Algorithm-Hardware Co-Design Framework of DNNs Using Alternating Direction Methods of Multipliers.",
                    "LightStore: Software-defined Network-attached Key-value Drives.",
                    "SOML Read: Rethinking the Read Operation Granularity of 3D NAND SSDs.",
                    "FlatFlash: Exploiting the Byte-Accessibility of SSDs within a Unified Memory-Storage Hierarchy.",
                    "Not All Qubits Are Created Equal: A Case for Variability-Aware Policies for NISQ-Era Quantum Computers.",
                    "Tackling the Qubit Mapping Problem for NISQ-Era Quantum Devices.",
                    "Noise-Adaptive Compiler Mappings for Noisy Intermediate-Scale Quantum Computers.",
                    "Optimized Compilation of Aggregated Instructions for Realistic Quantum Computers.",
                    "Wasabi: A Framework for Dynamically Analyzing WebAssembly.",
                    "Safer Program Behavior Sharing Through Trace Wringing.",
                    "Debugging Support for Pattern-Matching Languages and Accelerators.",
                    "Minotaur: Adapting Software Testing Techniques for Hardware Errors."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2019gpgpu",
                "sub_name": "Proceedings of the 12th Workshop on General Purpose Processing Using GPUs, GPGPU@ASPLOS 2019, Providence, RI, USA, April 13, 2019.",
                "count": 6,
                "papers": [
                    "Scatter-and-Gather Revisited: High-Performance Side-Channel-Resistant AES on GPUs.",
                    "Detailed Characterization of Deep Neural Networks on GPUs and FPGAs.",
                    "Which Graph Representation to Select for Static Graph-Algorithms on a CUDA-capable GPU.",
                    "KNN-Joins Using a Hybrid Approach: Exploiting CPU/GPU Workload Characteristics.",
                    "Characterizing CUDA Unified Memory (UM)-Aware MPI Designs on Modern GPU Architectures.",
                    "Quantifying the NUMA Behavior of Partitioned GPGPU Applications."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ASPLOS-XXIII 2018",
        "info": "Williamsburg, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2018",
                "sub_name": "Proceedings of the Twenty-Third International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2018, Williamsburg, VA, USA, March 24-28, 2018.",
                "count": 57,
                "papers": [
                    "In-Memory Data Parallel Processor.",
                    "Hardware Multithreaded Transactions.",
                    "Blasting through the Front-End Bottleneck with Shotgun.",
                    "Slim NoC: A Low-Diameter On-Chip Network Topology for High Energy Efficiency and Scalability.",
                    "Skyway: Connecting Managed Heaps in Distributed Big Data Systems.",
                    "Espresso: Brewing Java For More Non-Volatility with Non-volatile Memory.",
                    "Enhancing Cross-ISA DBT Through Automatically Learned Translation Rules.",
                    "Gloss: Seamless Live Reconfiguration and Reoptimization of Stream Programs.",
                    "Filtering Translation Bandwidth with Virtual Caching.",
                    "Automatic Hierarchical Parallelization of Linear Recurrences.",
                    "Automatic Matching of Legacy Code to Heterogeneous APIs: An Idiomatic Approach.",
                    "Understanding and Auto-Adjusting Performance-Sensitive Configurations.",
                    "SPECTR: Formal Supervisory Control and Coordination for Many-core Systems Resource Management.",
                    "CALOREE: Learning Control for Predictable Latency and Low Energy.",
                    "Darwin: A Genomics Co-processor Provides up to 15, 000X Acceleration on Long Read Assembly.",
                    "Liquid Silicon-Monona: A Reconfigurable Memory-Oriented Computing Fabric with Scalable Multi-Context Support.",
                    "Time Dilation and Contraction for Programmable Analog Devices with Jaunt.",
                    "Exploiting Dynamic Thermal Energy Harvesting for Reusing in Smartphone with Mobile Applications.",
                    "Static Detection of Event-based Races in Android Apps.",
                    "Potluck: Cross-Application Approximate Deduplication for Computation-Intensive Mobile Applications.",
                    "Quantum Computing is Getting Real: Architecture, PL, and OS Roles in Closing the Gap between Quantum Algorithms and Machines.",
                    "SOFRITAS: Serializable Ordering-Free Regions for Increasing Thread Atomicity Scalably.",
                    "DAMN: Overhead-Free IOMMU Protection for Networking.",
                    "Google Workloads for Consumer Devices: Mitigating Data Movement Bottlenecks.",
                    "Watching for Software Inefficiencies with Witch.",
                    "Optimistic Hybrid Analysis: Accelerating Dynamic Analysis through Predicated Static Analysis.",
                    "Statistical Reconstruction of Class Hierarchies in Binaries.",
                    "Sulong, and Thanks for All the Bugs: Finding Errors in C Programs by Abstracting from the Native Execution Model.",
                    "FirmUp: Precise Static Detection of Common Vulnerabilities in Firmware.",
                    "Frightening Small Children and Disconcerting Grown-ups: Concurrency in the Linux Kernel.",
                    "FCatch: Automatically Detecting Time-of-fault Bugs in Cloud Systems.",
                    "Unconventional Parallelization of Nondeterministic Applications.",
                    "Bridge the Gap between Neural Networks and Neuromorphic Hardware with a Neural Network Compiler.",
                    "MAERI: Enabling Flexible Dataflow Mapping over DNN Accelerators via Reconfigurable Interconnects.",
                    "VIBNN: Hardware Acceleration of Bayesian Neural Networks.",
                    "LTRF: Enabling High-Capacity Register Files for GPUs via Hardware/Software Cooperative Register Prefetching.",
                    "MASK: Redesigning the GPU Memory Hierarchy to Support Multi-Application Concurrency.",
                    "Sugar: Secure GPU Acceleration in Web Browsers.",
                    "SmoothOperator: Reducing Power Fragmentation and Improving Power Utilization in Large-scale Datacenters.",
                    "WSMeter: A Performance Evaluation Methodology for Google's Production Warehouse-Scale Computers.",
                    "Datasize-Aware High Dimensional Configurations Auto-Tuning of In-Memory Cluster Computing.",
                    "An Event-Triggered Programmable Prefetcher for Irregular Workloads.",
                    "Minnow: Lightweight Offload Engines for Worklist Management and Worklist-Directed Prefetching.",
                    "Wonderland: A Novel Abstraction-Based Out-Of-Core Graph Processing System.",
                    "Tigr: Transforming Irregular Graphs for GPU-Friendly Graph Processing.",
                    "Devirtualizing Memory in Heterogeneous Systems.",
                    "LATR: Lazy Translation Coherence.",
                    "VAULT: Reducing Paging Overheads in SGX with Efficient Integrity Verification Structures.",
                    "Making Huge Pages Actually Useful.",
                    "BranchScope: A New Side-Channel Attack on Directional Branch Predictor.",
                    "StrongBox: Confidentiality, Integrity, and Performance using Stream Ciphers for Full Drive Encryption.",
                    "DATS - Data Containers for Web Applications.",
                    "DLibOS: Performance and Protection with a Network-on-Chip.",
                    "The Architectural Implications of Autonomous Driving: Constraints and Acceleration.",
                    "A Reconfigurable Energy Storage Architecture for Energy-harvesting Devices.",
                    "NEOFog: Nonvolatility-Exploiting Optimizations for Fog Computing.",
                    "vbench: Benchmarking Video Transcoding in the Cloud."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2018request",
                "sub_name": "Proceedings of the 1st on Reproducible Quality-Efficient Systems Tournament on Co-designing Pareto-efficient Deep Learning, ReQuEST@ASPLOS 2018, Williamsburg, VA, USA, March 24, 2018.",
                "count": 7,
                "papers": [
                    "Keynote.",
                    "Highly Efficient 8-bit Low Precision Inference of Convolutional Neural Networks with IntelCaffe.",
                    "Optimizing Deep Learning Workloads on ARM GPU with TVM.",
                    "Real-Time Image Recognition Using Collaborative IoT Devices.",
                    "Leveraging the VTA-TVM Hardware-Software Stack for FPGA Acceleration of 8-bit ResNet-18 Inference.",
                    "Multi-objective autotuning of MobileNets across the full software/hardware stack.",
                    "PANEL: Open panel and discussion on tackling complexity, reproducibility and tech transfer challenges in a rapidly evolving AI/ML/systems research."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ASPLOS-XXII 2017",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2017",
                "sub_name": "Proceedings of the Twenty-Second International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2017, Xi'an, China, April 8-12, 2017.",
                "count": 58,
                "papers": [
                    "Big Data Analytics and Intelligence at Alibaba Cloud.",
                    "Determining Application-specific Peak Power and Energy Requirements for Ultra-low Power Processors.",
                    "Prophet: Precise QoS Prediction on Non-Preemptive Accelerators to Improve Utilization in Warehouse-Scale Computers.",
                    "Mallacc: Accelerating Memory Allocation.",
                    "REDSPY: Exploring Value Locality in Software.",
                    "Translation-Triggered Prefetching.",
                    "Typed Architectures: Architectural Support for Lightweight Scripting.",
                    "Failure-Atomic Slotted Paging for Persistent Memory.",
                    "What Scalable Programs Need from Transactional Memory.",
                    "TriCheck: Memory Model Verification at the Trisection of Software, Hardware, and ISA.",
                    "An Analysis of Persistent Memory Use with WHISPER.",
                    "ProRace: Practical Data Race Detection for Production Use.",
                    "Crossing Guard: Mediating Host-Accelerator Coherence Interactions.",
                    "An Architecture Supporting Formal and Compositional Binary Analysis.",
                    "AsyncClock: Scalable Inference of Asynchronous Event Causality.",
                    "Black-box Concurrent Data Structures for NUMA Architectures.",
                    "CoRAL: Confined Recovery in Distributed Asynchronous Graph Processing.",
                    "KickStarter: Fast and Accurate Computations on Streaming Graphs via Trimmed Approximations.",
                    "Browsix: Bridging the Gap Between Unix and the Browser.",
                    "Optimizing CNNs on Multicores for Scalability, Performance and Goodput.",
                    "Locality Transformations for Nested Recursive Iteration Spaces.",
                    "Locality-Aware CTA Clustering for Modern GPUs.",
                    "Sound Loop Superoptimization for Google Native Client.",
                    "Improving Datacenter Efficiency.",
                    "DudeTM: Building Durable Transactions with Decoupling for Persistent Memory.",
                    "ReFlex: Remote Flash ≈ Local Flash.",
                    "Approximate Storage of Compressed and Encrypted Videos.",
                    "Exploiting Intra-Request Slack to Improve SSD Performance.",
                    "Graspan: A Single-machine Disk-based Graph System for Interprocedural Static Analyses of Large-scale Systems Code.",
                    "SC-DCNN: Highly-Scalable Deep Convolutional Neural Network using Stochastic Computing.",
                    "3DGates: An Instruction-Level Energy Analysis and Optimization of 3D Printers.",
                    "Efficient Address Translation for Architectures with Multiple Page Sizes.",
                    "Page Fault Support for Network Controllers.",
                    "Towards \"Full Containerization\" in Containerized Network Function Virtualization.",
                    "FLEP: Enabling Flexible and Efficient Preemption on GPUs.",
                    "SaberLDA: Sparsity-Aware Learning of Topic Models on GPUs.",
                    "Moonwalk: NRE Optimization in ASIC Clouds.",
                    "Dynamic Resource Management for Efficient Utilization of Multitasking GPUs.",
                    "Identifying Security Critical Properties for the Dynamic Verification of a Processor.",
                    "Verification of a Practical Hardware Security Architecture Through Static Information Flow Analysis.",
                    "CHERI JNI: Sinking the Java Security Model into the C.",
                    "GRIFFIN: Guarding Control Flows Using Intel Processor Trace.",
                    "Bolt: I Know What You Did Last Summer... In The Cloud.",
                    "Neurosurgeon: Collaborative Intelligence Between the Cloud and Mobile Edge.",
                    "Thermostat: Application-transparent Page Management for Two-tiered Main Memory.",
                    "Breaking the Boundaries in Heterogeneous-ISA Datacenters.",
                    "Automated Synthesis of Comprehensive Memory Model Litmus Test Suites.",
                    "DCatch: Automatically Detecting Distributed Concurrency Bugs in Cloud Systems.",
                    "Towards Practical Default-On Multi-Core Record/Replay.",
                    "Pallas: Semantic-Aware Checking for Finding Deep Bugs in Fast Path.",
                    "Hardware-Software Co-design to Mitigate DRAM Refresh Overheads: A Case for Refresh-Aware Process Scheduling.",
                    "Kill the Program Counter: Reconstructing Program Behavior in the Processor Cache Hierarchy.",
                    "TETRIS: Scalable and Efficient Neural Network Acceleration with 3D Memory.",
                    "History-Based Arbitration for Fairness in Processor-Interconnect of NUMA Servers.",
                    "Enabling Lightweight Transactions with Precision Time.",
                    "IncBricks: Toward In-Network Computation with an In-Network Cache.",
                    "AMNESIAC: Amnesic Automatic Computer.",
                    "Voltage Regulator Efficiency Aware Power Management."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2017etcd",
                "sub_name": "Proceedings of the first Workshop on Emerging Technologies for software-defined and reconfigurable hardware-accelerated Cloud Datacenters, ETCD@ASPLOS 2017, Xi'an, China, April 8, 2017.",
                "count": 11,
                "papers": [
                    "An Experimental Comparison Between Genetic Algorithm and Particle Swarm Optimization in Spark Performance Tuning.",
                    "Distributed SAR Image Change Detection with OpenCL-Enabled Spark.",
                    "A Study of FPGA Virtualization and Accelerator Scheduling.",
                    "DoCE: Direct Extension of On-Chip Interconnects over Converged Ethernet for Rack-Scale Memory Sharing.",
                    "Slow or Down?: Seem to Be the Same for Cloud Users.",
                    "Anomaly Detection in Clouds: Challenges and Practice.",
                    "Rethinking the SDN Abstraction.",
                    "TCS: FaaS (FPGA as a service).",
                    "Customized Architecture Technology for High Performance Computing.",
                    "Building the Reconfigurable Cloud Ecosystem.",
                    "Programming FPGAs Using OpenCL from Performance Model to Application Study."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ASPLOS-XXI 2016",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2016",
                "sub_name": "Proceedings of the Twenty-First International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2016, Atlanta, GA, USA, April 2-6, 2016.",
                "count": 57,
                "papers": [
                    "Programming Uncertain <T>jhings.",
                    "WiSync: An Architecture for Fast Synchronization through On-Chip Wireless Communication.",
                    "ReBudget: Trading Off Efficiency vs. Fairness in Market-Based Multicore Resource Allocation via Runtime Budget Reassignment.",
                    "Dirigent: Enforcing QoS for Latency-Critical Tasks on Shared Multicore Systems.",
                    "Paravirtual Remote I/O.",
                    "High Performance Packet Processing with FlexNIC.",
                    "Specifying and Checking File System Crash-Consistency Models.",
                    "Prudent Memory Reclamation in Procrastination-Based Synchronization.",
                    "Whirlpool: Improving Dynamic Cache Management with Static Data Classification.",
                    "TPC: Target-Driven Parallelism Combining Prediction and Correction to Reduce Tail Latency in Interactive Services.",
                    "How to Build Static Checking Systems Using Orders of Magnitude Less Code.",
                    "TxRace: Efficient Data Race Detection Using Commodity Hardware Transactional Memory.",
                    "CoGENT: Verifying High-Assurance File System Implementations.",
                    "M3: A Hardware/Operating-System Co-Design to Tame Heterogeneous Manycores.",
                    "Sidewinder: An Energy Efficient and Developer Friendly Heterogeneous Architecture for Continuous Mobile Sensing.",
                    "OpenPiton: An Open Source Manycore Research Framework.",
                    "COATCheck: Verifying Memory Ordering at the Hardware-OS Interface.",
                    "True IOMMU Protection from DMA Attacks: When Copy is Faster than Zero Copy.",
                    "Silent Shredder: Zero-Cost Shredding for Secure Non-Volatile Main Memory Controllers.",
                    "Sego: Pervasive Trusted Metadata for Efficiently Verified Untrusted System Services.",
                    "Synopsis of the ASPLOS '16 Wild and Crazy Ideas (WACI) Invited-Speakers Session.",
                    "Brain Inspired Computing.",
                    "Scaling up Superoptimization.",
                    "Lifting Assembly to Intermediate Representation: A Novel Approach Leveraging Compilers.",
                    "Architecture-Adaptive Code Variant Tuning.",
                    "Scalable Kernel TCP Design and Implementation for Short-Lived Connections.",
                    "SpaceJMP: Programming with Multiple Virtual Address Spaces.",
                    "memif: Towards Programming Heterogeneous Memory Asynchronously.",
                    "NVWAL: Exploiting NVRAM in Write-Ahead Logging.",
                    "High-Performance Transactions for Persistent Memories.",
                    "High-Density Image Storage Using Approximate Memory Cells.",
                    "Failure-Atomic Persistent Memory Updates via JUSTDO Logging.",
                    "Interference Management for Distributed Parallel Applications in Consolidated Clusters.",
                    "Taurus: A Holistic Language Runtime System for Coordinating Distributed Managed-Language Applications.",
                    "HCloud: Resource-Efficient Provisioning in Shared Cloud Systems.",
                    "CloudSeer: Workflow Monitoring of Cloud Infrastructures via Interleaved Logs.",
                    "LDX: Causality Inference by Lightweight Dual Execution.",
                    "TaxDC: A Taxonomy of Non-Deterministic Concurrency Bugs in Datacenter Distributed Systems.",
                    "RID: Finding Reference Count Bugs with Inconsistent Path Pair Checking.",
                    "Maximizing Performance Under a Power Cap: A Comparison of Hardware, Software, and Hybrid Techniques.",
                    "The Computational Sprinting Game.",
                    "An Energy-interference-free Hardware-Software Debugger for Intermittent Energy-harvesting Systems.",
                    "Programmer Productivity in a World of Mushy Interfaces: Challenges of the Post-ISA Reality.",
                    "RAPID Programming of Pattern-Recognition Processors.",
                    "Proactive Control of Approximate Programs.",
                    "AxGames: Towards Crowdsourcing Quality Target Determination in Approximate Computing.",
                    "A DNA-Based Archival Storage System.",
                    "Generating Configurable Hardware from Parallel Patterns.",
                    "DySel: Lightweight Dynamic Selection for Kernel-based Data-parallel Programming Model.",
                    "Baymax: QoS Awareness and Increased Utilization for Non-Preemptive Accelerators in Warehouse Scale Computers.",
                    "Analyzing Behavior Specialized Acceleration.",
                    "PIFT: Predictive Information-Flow Tracking.",
                    "HIPStR: Heterogeneous-ISA Program State Relocation.",
                    "ANVIL: Software-Based Protection Against Next-Generation Rowhammer Attacks.",
                    "ProteusTM: Abstraction Meets Performance in Transactional Memory.",
                    "CSR: Core Surprise Removal in Commodity Operating Systems.",
                    "CASPAR: Breaking Serialization in Lock-Free Multicore Synchronization."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ASPLOS-XX 2015",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2015",
                "sub_name": "Proceedings of the Twentieth International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2015, Istanbul, Turkey, March 14-18, 2015.",
                "count": 50,
                "papers": [
                    "Architectural Support for Cyber-Physical Systems.",
                    "Mojim: A Reliable and Highly-Available Non-Volatile Memory System.",
                    "SD-PCM: Constructing Reliable Super Dense Phase Change Memory under Write Disturbance.",
                    "DEUCE: Write-Efficient Encryption for Non-Volatile Memories.",
                    "Temporally Bounding TSO for Fence-Free Asymmetric Synchronization.",
                    "Reduced Hardware NOrec: A Safe and Scalable Hybrid Transactional Memory.",
                    "Synchronization Using Remote-Scope Promotion.",
                    "GhostRider: A Hardware-Software System for Memory Trace Oblivious Computation.",
                    "Freecursive ORAM: [Nearly] Free Recursion and Integrity Verification for Position-based Oblivious RAM.",
                    "Beyond the PDP-11: Architectural Support for a Memory-Safe C Abstract Machine.",
                    "Supporting Differentiated Services in Computers via Programmable Architecture for Resourcing-on-Demand (PARD).",
                    "Improving Agility and Elasticity in Bare-metal Clouds.",
                    "Few-to-Many: Incremental Parallelism for Reducing Tail Latency in Interactive Services.",
                    "Protecting Data on Smartphones and Tablets from Memory Attacks.",
                    "Nested Kernel: An Operating System Architecture for Intra-Kernel Privilege Separation.",
                    "DIABLO: A Warehouse-Scale Computer Network Simulator using FPGAs.",
                    "Sirius: An Open End-to-End Voice and Vision Personal Assistant and Its Implications for Future Warehouse Scale Computers.",
                    "Automated OS-level Device Runtime Power Management.",
                    "CoolAir: Temperature- and Variation-Aware Management for Free-Cooled Datacenters.",
                    "A Probabilistic Graphical Model-based Approach for Minimizing Energy Under Performance Constraints.",
                    "More is Less, Less is More: Molecular-Scale Photonic NoC Power Topologies.",
                    "Memory Errors in Modern Systems: The Good, The Bad, and The Ugly.",
                    "CommGuard: Mitigating Communication Errors in Error-Prone Parallel Execution.",
                    "Dual Execution for On the Fly Fine Grained Execution Comparison.",
                    "VARAN the Unbelievable: An Efficient N-version Execution Framework.",
                    "rIOMMU: Efficient IOMMU for I/O Devices that Employ Ring Buffers.",
                    "PuDianNao: A Polyvalent Machine Learning Accelerator.",
                    "ApproxHadoop: Bringing Approximations to MapReduce Frameworks.",
                    "Monitoring and Debugging the Quality of Results in Approximate Programs.",
                    "Watson and the Era of Cognitive Computing.",
                    "Ziria: A DSL for Wireless Systems Programming.",
                    "PolyMage: Automatic Optimization for Image Processing Pipelines.",
                    "Compiler Management of Communication and Parallelism for Quantum Computation.",
                    "Kinetic Dependence Graphs.",
                    "Targeted Automatic Integer Overflow Discovery Using Goal-Directed Conditional Branch Enforcement.",
                    "Architectural Support for Software-Defined Metadata Processing.",
                    "A Hardware Design Language for Timing-Sensitive Information-Flow Security.",
                    "SPECS: A Lightweight Runtime Mechanism for Protecting Software from Security-Critical Processor Bugs.",
                    "Asymmetric Memory Fences: Optimizing Both Performance and Implementability.",
                    "DeNovoSync: Efficient Support for Arbitrary Synchronization without Writer-Initiated Invalidations.",
                    "Hybrid Static: Dynamic Analysis for Statically Bounded Region Serializability.",
                    "GPU Concurrency: Weak Behaviours and Programming Assumptions.",
                    "Chimera: Collaborative Preemption for Multitasking on a Shared GPU.",
                    "Page Placement Strategies for GPUs within Heterogeneous Memory Systems.",
                    "On-the-Fly Principled Speculation for FSM Parallelization.",
                    "Asynchronized Concurrency: The Secret to Scaling Concurrent Search Data Structures.",
                    "iThreads: A Threading Library for Parallel Incremental Computation.",
                    "NumaGiC: a Garbage Collector for Big Data on Big NUMA Machines.",
                    "FACADE: A Compiler and Runtime for (Almost) Object-Bounded Big Data Applications.",
                    "Architectural Support for Dynamic Linking."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ASPLOS-XIX 2014",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2014",
                "sub_name": "Architectural Support for Programming Languages and Operating Systems, ASPLOS 2014, Salt Lake City, UT, USA, March 1-5, 2014.",
                "count": 52,
                "papers": [
                    "Inside windows azure: the challenges and opportunities of a cloud operating system.",
                    "Scale-out NUMA.",
                    "Rhythm: harnessing data parallel hardware for server workloads.",
                    "Paraprox: pattern-based approximation for data parallel applications.",
                    "Uncertain: a first-order type for uncertain data.",
                    "Using ARM trustzone to build a trusted language runtime for mobile applications.",
                    "Virtual ghost: protecting applications from hostile operating systems.",
                    "Sapper: a language for hardware-level security policy enforcement.",
                    "Finding trojan message vulnerabilities in distributed systems.",
                    "Quasar: resource-efficient and QoS-aware cluster management.",
                    "REF: resource elasticity fairness with sharing incentives for multiprocessors.",
                    "Price theory based power management for heterogeneous multi-cores.",
                    "Underprovisioning backup power infrastructure for datacenters.",
                    "Comprehending performance from real-world execution traces: a device-driver case.",
                    "Leveraging the short-term memory of hardware to diagnose production-run software failures.",
                    "RelaxReplay: record and replay for relaxed-consistency multiprocessors.",
                    "Prototyping symbolic execution engines for interpreted languages.",
                    "Q100: the architecture and design of a database processing unit.",
                    "DianNao: a small-footprint high-throughput accelerator for ubiquitous machine-learning.",
                    "K2: a mobile operating system for heterogeneous coherence domains.",
                    "Disengaged scheduling for fair, protected access to fast computational accelerators.",
                    "Neuromorphic processing: a new frontier in scaling computer architecture.",
                    "I/o paravirtualization at the device file boundary.",
                    "KVM/ARM: the design and implementation of the linux ARM hypervisor.",
                    "VSwapper: a memory swapper for virtualized environments.",
                    "Cider: native execution of iOS apps on android.",
                    "SI-TM: reducing transactional memory abort rates through snapshot isolation.",
                    "Transactionalizing legacy code: an experience report using GCC and Memcached.",
                    "Fence-free work stealing on bounded TSO processors.",
                    "Heterogeneous-race-free memory models.",
                    "Triple-A: a Non-SSD based autonomic all-flash array for high performance storage systems.",
                    "NVM duet: unified working memory and persistent store architecture.",
                    "SDF: software-defined flash for web-scale internet storage systems.",
                    "Integrated 3D-stacked server designs for increasing physical density of key-value stores.",
                    "Deterministic galois: on-demand, portable and parameterless.",
                    "Energy-efficient work-stealing language runtimes.",
                    "Data-parallel finite-state machines.",
                    "Challenging the \"embarrassingly sequential\": parallelizing finite state machine-based computations through principled speculation.",
                    "The sharing architecture: sub-core configurability for IaaS clouds.",
                    "ASC: automatically scalable computation.",
                    "The benefit of SMT in the multi-core era: flexibility towards degrees of thread-level parallelism.",
                    "Finding the limit: examining the potential and complexity of compilation scheduling for JIT-based runtime systems.",
                    "Speculative hardware/software co-designed floating-point multiply-add fusion.",
                    "Post-compiler software optimization for reducing energy.",
                    "Resolved: specialized architectures, languages, and system software should supplant general-purpose alternatives within a decade.",
                    "Guardrail: a high fidelity approach to protecting hardware devices from buggy drivers.",
                    "Low-level detection of language-level data races with LARD.",
                    "EnCore: exploiting system environment and correlation information for misconfiguration detection.",
                    "High-performance fractal coherence.",
                    "Locality-oblivious cache organization leveraging single-cycle multi-hop NoCs.",
                    "Ubik: efficient cache sharing with strict qos for latency-critical workloads.",
                    "Architectural support for address translation on GPUs: designing memory management units for CPU/GPUs with unified address spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2014gpgpu",
                "sub_name": "Seventh Workshop on General Purpose Processing Using GPUs, GPGPU-7, Salt Lake City, UT, USA, March 1, 2014.",
                "count": 12,
                "papers": [
                    "Application-aware Memory System for Fair and Efficient Execution of Concurrent GPGPU Applications.",
                    "KMA: A Dynamic Memory Manager for OpenCL.",
                    "Efficient Instrumentation of GPGPU Applications Using Information Flow Analysis and Symbolic Execution.",
                    "Measuring GPU Power with the K20 Built-in Sensor.",
                    "Performance Evaluation and Optimization Mechanisms for Inter-operable Graphics and Computation on GPUs.",
                    "GLZSS: LZSS Lossless Data Compression Can Be Faster.",
                    "ad-heap: an Efficient Heap Data Structure for Asymmetric Multicore Processors.",
                    "A CPU: GPU Hybrid Implementation and Model-Driven Scheduling of the Fast Multipole Method.",
                    "ParallelJS: An Execution Framework for JavaScript on Heterogeneous Systems.",
                    "APR: A Novel Parallel Repacking Algorithm for Efficient GPGPU Parallel Code Transformation.",
                    "Power Modeling for Heterogeneous Processors.",
                    "Exploiting GPU Hardware Saturation for Fast Compiler Optimization."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2014bpoe",
                "sub_name": "Big Data Benchmarks, Performance Optimization, and Emerging Hardware - 4th and 5th Workshops, BPOE 2014, Salt Lake City, USA, March 1, 2014 and Hangzhou, China, September 5, 2014, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "On Big Data Benchmarking.",
                    "A Micro-benchmark Suite for Evaluating Hadoop MapReduce on High-Performance Networks.",
                    "MemTest: A Novel Benchmark for In-memory Database.",
                    "DSIMBench: A Benchmark for Microarray Data Using R.",
                    "A Benchmark to Evaluate Mobile Video Upload to Cloud Infrastructures.",
                    "Benchmarking Replication and Consistency Strategies in Cloud Serving Databases: HBase and Cassandra.",
                    "I/O Characterization of Big Data Workloads in Data Centers.",
                    "Characterizing Workload of Web Applications on Virtualized Servers.",
                    "Performance Benefits of DataMPI: A Case Study with BigDataBench.",
                    "InvarNet-X: A Comprehensive Invariant Based Approach for Performance Diagnosis in Big Data Platform.",
                    "Tuning Hadoop Map Slot Value Using CPU Metric.",
                    "A Study of SQL-on-Hadoop Systems.",
                    "Predoop: Preempting Reduce Task for Job Execution Accelerations.",
                    "Record Placement Based on Data Skew Using Solid State Drives.",
                    "Efficient HTTP Based I/O on Very Large Datasets for High Performance Computing with the Libdavix Library.",
                    "Exploring Opportunities for Non-volatile Memories in Big Data Applications."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ASPLOS-XVIII 2013",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2013",
                "sub_name": "Architectural Support for Programming Languages and Operating Systems, ASPLOS 2013, Houston, TX, USA, March 16-20, 2013.",
                "count": 46,
                "papers": [
                    "GPUDet: a deterministic GPU architecture.",
                    "DeNovoND: efficient hardware support for disciplined non-determinism.",
                    "Parallelizing data race detection.",
                    "Cooperative empirical failure avoidance for multithreaded programs.",
                    "Parasol and GreenSwitch: managing datacenters powered by renewable energy.",
                    "Power containers: an OS facility for fine-grained power and energy management on multicore servers.",
                    "Paragon: QoS-aware scheduling for heterogeneous datacenters.",
                    "ReQoS: reactive static/dynamic compilation for QoS in warehouse scale computers.",
                    "Production-run software failure diagnosis via hardware performance counters.",
                    "ConAir: featherweight concurrency bug recovery via single-threaded idempotent execution.",
                    "Transparent mutable replay for multicore debugging and patch validation.",
                    "Using likely invariants for automated software fault localization.",
                    "The rise of the expert amateur: DIY culture and the evolution of computer science.",
                    "Computational sprinting on a hardware/software testbed.",
                    "DeAliaser: alias speculation using atomic region support.",
                    "Regularities considered harmful: forcing randomness to memory accesses to reduce row buffer conflicts for multi-core, multi-bank systems.",
                    "Cyrus: unintrusive application-level record-replay for replay parallelism.",
                    "Why you should care about quantile regression.",
                    "STABILIZER: statistically sound performance evaluation.",
                    "A study of the scalability of stop-the-world garbage collectors on multicores.",
                    "Discerning the dominant out-of-order performance advantage: is it speculation or dynamism?",
                    "Iago attacks: why the system call API is a bad untrusted RPC interface.",
                    "InkTag: secure applications on an untrusted operating system.",
                    "Safe and automatic live update for operating systems.",
                    "Verifying security invariants in ExpressOS.",
                    "Stochastic superoptimization.",
                    "Automated repair of binary and assembly programs for cooperating embedded devices.",
                    "Verifying systems rules using rule-directed symbolic execution.",
                    "HOTL: a higher order theory of locality.",
                    "To hardware prefetch or not to prefetch?: a virtualized environment study and core binding approach.",
                    "Demand-based coordinated scheduling for SMP VMs.",
                    "Traffic management: a holistic approach to memory placement on NUMA systems.",
                    "OWL: cooperative thread array aware scheduling techniques for improving GPGPU performance.",
                    "Improving GPGPU concurrency with elastic kernels.",
                    "Practical automatic loop specialization.",
                    "Portable performance on heterogeneous architectures.",
                    "Efficient virtualization on embedded power architecture® platforms.",
                    "Research directions for 21st century computer systems: asplos 2013 panel.",
                    "Unikernels: library operating systems for the cloud.",
                    "Fine-grained fault tolerance using device checkpoints.",
                    "GPUfs: integrating a file system with GPUs.",
                    "DDOS: taming nondeterminism in distributed systems.",
                    "TSO_ATOMICITY: efficient hardware primitive for TSO-preserving region optimizations.",
                    "Wait-n-GoTM: improving HTM performance by serializing cyclic dependencies.",
                    "Volition: scalable and precise sequential consistency violation detection.",
                    "Hardware support for fine-grained event-driven computation in Anton 2."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2013gpgpu",
                "sub_name": "Proceedings of the 6th Workshop on General Purpose Processor Using Graphics Processing Units, GPGPU-6, Houston, Texas, USA, March 16, 2013.",
                "count": 15,
                "papers": [
                    "Comparison based sorting for systems with multiple GPUs.",
                    "Reducing divergence in GPGPU programs with loop merging.",
                    "Split tiling for GPUs: automatic parallelization using trapezoidal tiles.",
                    "Formalizing address spaces with application to Cuda, OpenCL, and beyond.",
                    "Memory reuse optimizations in the R-Stream compiler.",
                    "Valar: a benchmark suite to study the dynamic behavior of heterogeneous systems.",
                    "Input-aware auto-tuning for directive-based GPU programming.",
                    "Betweenness centrality on GPUs and heterogeneous architectures.",
                    "OpenCL C++.",
                    "Atomic-free irregular computations on GPUs.",
                    "Accelerating simulation of agent-based models on heterogeneous architectures.",
                    "Fast dynamic memory allocator for massively parallel architectures.",
                    "Accelerating financial applications on the GPU.",
                    "Exploring GPU architectures to accelerate semantic comparison for intention-based search.",
                    "Warp size impact in GPUs: large or small?"
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ASPLOS-XVII 2012",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2012",
                "sub_name": "Proceedings of the 17th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2012, London, UK, March 3-7, 2012.",
                "count": 37,
                "papers": [
                    "PocketWeb: instant web browsing for mobile devices.",
                    "Reflex: using low-power processors in smartphones without knowing them.",
                    "Totally green: evaluating and designing servers for lifecycle environmental impact.",
                    "Clearing the clouds: a study of emerging scale-out workloads on modern hardware.",
                    "Iterative optimization for the data center.",
                    "Tarazu: optimizing MapReduce on heterogeneous clusters.",
                    "Leveraging stored energy for handling power emergencies in aggressively provisioned datacenters.",
                    "Understanding modern device drivers.",
                    "Chameleon: operating system support for dynamic processors.",
                    "Cosmic rays don't strike twice: understanding the nature of DRAM errors and the implications for system design.",
                    "Relyzer: exploiting application-level fault equivalence to analyze application resiliency to transient faults.",
                    "Comprehensive kernel instrumentation via dynamic binary translation.",
                    "Continuous object access profiling and optimizations to overcome the memory wall and bloat.",
                    "A case for unlimited watchpoints.",
                    "Aikido: accelerating shared data dynamic analyses.",
                    "Data races vs. data race bugs: telling the difference with portend.",
                    "Scalable address spaces using RCU balanced trees.",
                    "Applying transactional memory to concurrency bugs.",
                    "Bottleneck identification and scheduling in multithreaded applications.",
                    "Optimal task assignment in multithreaded processors: a statistical approach.",
                    "CRUISE: cache replacement and utility-aware scheduling.",
                    "Execution migration in a heterogeneous-ISA chip multiprocessor.",
                    "Efficient sequential consistency via conflict ordering.",
                    "HICAMP: architectural support for efficient concurrency-safe shared structured data access.",
                    "Architecture support for disciplined approximate programming.",
                    "DreamWeaver: architectural support for deep sleep.",
                    "Automatic generation of hardware/software interfaces.",
                    "Path-exploration lifting: hi-fi tests for lo-fi emulators.",
                    "Green-Marl: a DSL for easy and efficient graph analysis.",
                    "SIMD defragmenter: efficient ILP realization on data-parallel architectures.",
                    "An update-aware storage system for low-locality update-intensive workloads.",
                    "Providing safe, user space access to fast, solid state disks.",
                    "Whole-system persistence.",
                    "ELI: bare-metal performance for I/O virtualization.",
                    "DejaVu: accelerating resource allocation in virtualized environments.",
                    "Architectural support for hypervisor-secure virtualization.",
                    "Region scheduling: efficiently using the cache architectures via page-level affinity."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2012gpgpu",
                "sub_name": "The 5th Annual Workshop on General Purpose Processing with Graphics Processing Units, GPGPU-5, London, United Kingdom, March 3, 2012.",
                "count": 13,
                "papers": [
                    "Introducing 'Bones': a parallelizing source-to-source compiler based on algorithmic skeletons.",
                    "A distributed data-parallel framework for analysis and visualization algorithm development.",
                    "FLAT: a GPU programming framework to provide embedded MPI.",
                    "A GPU-based high-throughput image retrieval algorithm.",
                    "Dynamic particle system for mesh extraction on the GPU.",
                    "High-performance sparse matrix-vector multiplication on GPUs for structured grid computations.",
                    "High performance 3-D FFT using multiple CUDA GPUs.",
                    "Paragon: collaborative speculative loop execution on GPU and CPU.",
                    "JaBEE: framework for object-oriented Java bytecode compilation and execution on graphics processor units.",
                    "Enabling task-level scheduling on heterogeneous platforms.",
                    "Auto-tuning interactive ray tracing using an analytical GPU architecture model.",
                    "Full system simulation of many-core heterogeneous SoCs using GPU and QEMU semihosting.",
                    "Reducing off-chip memory traffic by selective cache management scheme in GPGPUs."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ASPLOS-XVI 2011",
        "info": "Newport Beach, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2011",
                "sub_name": "Proceedings of the 16th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2011, Newport Beach, CA, USA, March 5-11, 2011.",
                "count": 33,
                "papers": [
                    "The cloud will change everything.",
                    "Improving software diagnosability via log enhancement.",
                    "DoublePlay: parallelizing sequential logging and replay.",
                    "Hardware acceleration of transactional memory on commodity systems.",
                    "Hybrid NOrec: a case study in the effectiveness of best effort hardware transactional memory.",
                    "Efficient processor support for DRFx, a memory model with exceptions.",
                    "RCDC: a relaxed consistency deterministic computer.",
                    "Specifying and checking semantic atomicity for multithreaded programs.",
                    "Mnemosyne: lightweight persistent memory.",
                    "NV-Heaps: making persistent objects fast and safe with next-generation, non-volatile memories.",
                    "A declarative language approach to device configuration.",
                    "Improved device driver reliability through hardware verification reuse.",
                    "A case for neuromorphic ISAs.",
                    "Mementos: system support for long-running computation on RFID-scale devices.",
                    "Pocket cloudlets.",
                    "Blink: managing server clusters on intermittent power.",
                    "Dynamic knobs for responsive power-aware computing.",
                    "Flikker: saving DRAM refresh-power through critical data partitioning.",
                    "MemScale: active low-power modes for main memory.",
                    "2ndStrike: toward manifesting hidden concurrency typestate bugs.",
                    "ConSeq: detecting concurrency bugs through sequential errors.",
                    "S2E: a platform for in-vivo multi-path analysis of software systems.",
                    "Ensuring operating system kernel integrity with OSck.",
                    "Rethinking the library OS from the top down.",
                    "Faults in linux: ten years later.",
                    "Looking back on the language and hardware revolutions: measured power, performance, and scaling.",
                    "Synthesizing concurrent schedulers for irregular algorithms.",
                    "Exploring circuit timing-aware language and compilation.",
                    "Orchestration by approximation: mapping stream programs onto multicore architectures.",
                    "On-the-fly elimination of dynamic irregularities for GPU computing.",
                    "Sponge: portable stream programming on graphics engines.",
                    "Inter-core prefetching for multicore processors using migrating helper threads.",
                    "Improving the performance of trace-based systems by false loop filtering."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2011gpgpu",
                "sub_name": "Proceedings of 4th Workshop on General Purpose Processing on Graphics Processing Units, GPGPU 2011, Newport Beach, CA, USA, March 5, 2011.",
                "count": 13,
                "papers": [
                    "High performance predictable histogramming on GPUs: exploring and evaluating algorithm trade-offs.",
                    "A new method for GPU based irregular reductions and its application to k-means clustering.",
                    "Reducing branch divergence in GPU programs.",
                    "Register packing for cyclic reduction: a case study.",
                    "Caracal: dynamic translation of runtime environments for GPUs.",
                    "Fast Mersenne prime testing on the GPU.",
                    "Floating-point data compression at 75 Gb/s on a GPU.",
                    "Real-time rendering and dynamic updating of 3-d volumetric data.",
                    "A framework for dynamically instrumenting GPU compute applications within GPU Ocelot.",
                    "Analyzing program flow within a many-kernel OpenCL application.",
                    "Quantifying NUMA and contention effects in multi-GPU systems.",
                    "Automatically generating and tuning GPU code for sparse matrix-vector multiplication from a high-level representation.",
                    "Unstructured grid applications on GPU: performance analysis and improvement."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2011change",
                "sub_name": "1st International Workshop on Computing in Heterogeneous, Autonomous 'N' Goal-Oriented Environments, CHANGE 2011, Newport Beach, CA, USA, March 6, 2011.",
                "count": 5,
                "papers": [
                    "HERA: Hardware evolution over reconfigurable architectures.",
                    "Self-aware adaptation via implementation hot-swap for heterogeneous computing.",
                    "Self-aware heterogeneous MPSoC with dynamic task scheduling for battery lifetime extension.",
                    "Reconfigurable interconnect infrastructure for multi-FPGA-based adaptive multiprocessing systems.",
                    "Static memory management within bytecode languages on multicore systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ASPLOS-XV 2010",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2010",
                "sub_name": "Proceedings of the 15th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2010, Pittsburgh, Pennsylvania, USA, March 13-17, 2010.",
                "count": 33,
                "papers": [
                    "Technology for developing regions: Moore's law is not enough.",
                    "Dynamically replicated memory: building reliable systems from nanoscale resistive memories.",
                    "A power-efficient all-optical on-chip interconnect using wavelength-based oblivious routing.",
                    "A real system evaluation of hardware atomicity for software speculation.",
                    "Dynamic filtering: multi-purpose architecture support for language runtime systems.",
                    "CoreDet: a compiler and runtime system for deterministic multithreaded execution.",
                    "Speculative parallelization using software multi-threaded transactions.",
                    "Respec: efficient online multiprocessor replayvia speculation and external determinism.",
                    "Probabilistic job symbiosis modeling for SMT processor scheduling.",
                    "Request behavior variations.",
                    "Decoupling contention management from scheduling.",
                    "Addressing shared resource contention in multicore processors via scheduling.",
                    "SherLog: error diagnosis by connecting clues from run-time logs.",
                    "Analyzing multicore dumps to facilitate concurrency bug reproduction.",
                    "A randomized scheduler with probabilistic guarantees of finding bugs.",
                    "ConMem: detecting severe concurrency bugs through an effect-oriented approach.",
                    "Characterizing processor thermal behavior.",
                    "Conservation cores: reducing the energy of mature computations.",
                    "Micro-pages: increasing DRAM efficiency with locality-aware data placement.",
                    "Power routing: dynamic power provisioning in the data center.",
                    "Joint optimization of idle and cooling power in data centers while maintaining response time.",
                    "Butterfly analysis: adapting dataflow analysis to dynamic parallel monitoring.",
                    "ParaLog: enabling and accelerating online parallel monitoring of multithreaded applications.",
                    "MacroSS: macro-SIMDization of streaming applications.",
                    "COMPASS: a programmable data prefetcher using idle GPU shaders.",
                    "Flexible architectural support for fine-grain scheduling.",
                    "Specifying and dynamically verifying address translation-aware memory consistency.",
                    "Fairness via source throttling: a configurable and high-performance fairness substrate for multi-core memory systems.",
                    "An asymmetric distributed shared memory model for heterogeneous parallel systems.",
                    "Inter-core cooperative TLB for chip multiprocessors.",
                    "Orthrus: efficient software integrity protection on multi-cores.",
                    "Shoestring: probabilistic soft error reliability on the cheap.",
                    "Virtualized and flexible ECC for main memory."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2010gpgpu",
                "sub_name": "Proceedings of 3rd Workshop on General Purpose Processing on Graphics Processing Units, GPGPU 2010, Pittsburgh, Pennsylvania, USA, March 14, 2010.",
                "count": 14,
                "papers": [
                    "Toward exascale computational science with heterogeneous processing.",
                    "Parallel multiclass classification using SVMs on GPUs.",
                    "Cortical architectures on a GPGPU.",
                    "Compiling Python to a hybrid execution environment.",
                    "Modeling GPU-CPU workloads and systems.",
                    "Implementing the PGI Accelerator model.",
                    "A mapping path for multi-GPGPU accelerated computers from a portable high level programming abstraction.",
                    "GPGPU role within a 500 TFLOPS heterogeneous cluster.",
                    "The Scalable Heterogeneous Computing (SHOC) benchmark suite.",
                    "Accelerating MATLAB Image Processing Toolbox functions on GPUs.",
                    "Best-effort semantic document search on GPUs.",
                    "Accelerating SQL database operations on a GPU with CUDA.",
                    "Accelerating the local outlier factor algorithm on a GPU for intrusion detection systems.",
                    "Iterative induced dipoles computation for molecular mechanics on GPUs."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ASPLOS-XIV 2009",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2009",
                "sub_name": "Proceedings of the 14th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2009, Washington, DC, USA, March 7-11, 2009.",
                "count": 29,
                "papers": [
                    "An evaluation of the TRIPS computer system.",
                    "Architectural implications of nanoscale integrated sensing and computing.",
                    "CTrigger: exposing atomicity violation bugs from their hiding places.",
                    "ASSURE: automatic software self-healing using rescue points.",
                    "Recovery domains: an organizing principle for recoverable operating systems.",
                    "Anomaly-based bug prediction, isolation, and validation: an automated approach for software debugging.",
                    "Capo: a software-hardware interface for practical deterministic multiprocessor replay.",
                    "DMP: deterministic shared memory multiprocessing.",
                    "Kendo: efficient deterministic multithreading in software.",
                    "Complete information flow tracking from the gates up.",
                    "RapidMRC: approximating L2 miss rate curves on commodity systems for online optimizations.",
                    "Per-thread cycle accounting in SMT processors.",
                    "Maximum benefit from a minimal HTM.",
                    "Early experience with a commercial hardware transactional memory implementation.",
                    "Mixed-mode multicore reliability.",
                    "ISOLATOR: dynamically ensuring isolation in comcurrent programs.",
                    "Efficient online validation with delta execution.",
                    "PowerNap: eliminating server idle power.",
                    "Gordon: using flash memory to build fast, power-efficient clusters for data-intensive applications.",
                    "DFTL: a flash translation layer employing demand-based selective caching of page-level address mappings.",
                    "Commutativity analysis for software parallelization: letting program transformations see the big picture.",
                    "Accelerating critical section execution with asymmetric multi-core architectures.",
                    "Producing wrong data without doing anything obviously wrong!",
                    "Leak pruning.",
                    "Dynamic prediction of collection yield for managed runtimes.",
                    "TwinDrivers: semi-automatic derivation of fast and safe hypervisor network drivers from guest OS drivers.",
                    "Phantom-BTB: a virtualized branch target buffer design.",
                    "StreamRay: a stream filtering architecture for coherent ray tracing.",
                    "Architectural support for SWAR text processing with parallel bit streams: the inductive doubling principle."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2009gpgpu",
                "sub_name": "Proceedings of 2nd Workshop on General Purpose Processing on Graphics Processing Units, GPGPU 2009, Washington, DC, USA, March 8, 2009.",
                "count": 12,
                "papers": [
                    "Accelerating cosmological data analysis with graphics processors.",
                    "High performance computation and interactive display of molecular orbitals on GPUs and multi-core CPUs.",
                    "GPU acceleration of a production molecular docking code.",
                    "Accelerating phase unwrapping and affine transformations for optical quadrature microscopy using CUDA.",
                    "Performance analysis of accelerated image registration using GPGPU.",
                    "Accelerating linpack with CUDA on heterogenous clusters.",
                    "hiCUDA: a high-level directive-based language for GPU programming.",
                    "Architecture-aware optimization targeting multithreaded stream computing.",
                    "QR decomposition on GPUs.",
                    "3D finite difference computation on GPUs using CUDA.",
                    "Optimization of tele-immersion codes.",
                    "Understanding software approaches for GPGPU reliability."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ASPLOS-XIII 2008",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2008",
                "sub_name": "Proceedings of the 13th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2008, Seattle, WA, USA, March 1-5, 2008.",
                "count": 32,
                "papers": [
                    "Overshadow: a virtualization-based approach to retrofitting protection in commodity operating systems.",
                    "How low can you go?: recommendations for hardware-supported minimal TCB code execution.",
                    "Accelerating two-dimensional page walks for virtualized systems.",
                    "Efficiency trends and limits from comprehensive microarchitectural adaptivity.",
                    "No \"power\" struggles: coordinated multi-level power management for the data center.",
                    "Exploiting access semantics and program behavior to reduce snoop power in chip multiprocessors.",
                    "PICSEL: measuring user-perceived performance to control dynamic frequency scaling.",
                    "Improving the performance of object-oriented languages with dynamic predication of indirect jumps.",
                    "The mapping collector: virtual memory support for generational, parallel, and concurrent compaction.",
                    "Hardbound: architectural support for spatial safety of the C programming language.",
                    "Archipelago: trading address space for reliability and security.",
                    "Accurate branch prediction for short threads.",
                    "Adaptive set pinning: managing shared caches in chip multiprocessors.",
                    "SoftSig: software-exposed hardware signatures for code analysis and optimization.",
                    "Predictor virtualization.",
                    "The design and implementation of microdrivers.",
                    "Tapping into the fountain of CPUs: on operating system support for programmable devices.",
                    "Hardware counter driven on-the-fly request signatures.",
                    "Dispersing proprietary applications as benchmarks through code mutation.",
                    "Understanding and visualizing full systems with data flow tomography.",
                    "Communication optimizations for global multi-threaded instruction scheduling.",
                    "Optimistic parallelism benefits from data partitioning.",
                    "Xoc, an extension-oriented compiler for systems programming.",
                    "Adapting to intermittent faults in multicore systems.",
                    "Understanding the propagation of hard errors to software and implications for resilient system design.",
                    "Feedback-driven threading: power-efficient and high-performance execution of multi-threaded workloads on CMPs.",
                    "Merge: a programming model for heterogeneous multi-core systems.",
                    "Streamware: programming general-purpose multicore processors using streams.",
                    "Parallelizing security checks on commodity hardware.",
                    "Better bug reporting with better privacy.",
                    "Learning from mistakes: a comprehensive study on real world concurrency bug characteristics.",
                    "Toward molecular programming with DNA."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2008mspc",
                "sub_name": "Proceedings of the 2008 ACM SIGPLAN workshop on Memory Systems Performance and Correctness: held in conjunction with the Thirteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS '08), Seattle, Washington, USA, March 2, 2008.",
                "count": 8,
                "papers": [
                    "General and efficient locking without blocking.",
                    "Concurrency control with data coloring.",
                    "The potential for variable-granularity access tracking for optimistic parallelism.",
                    "Reasoning about the ARM weakly consistent memory model.",
                    "IWannaBit!",
                    "What can performance counters do for memory subsystem analysis?",
                    "The case for simple, visible cache coherency.",
                    "GC assertions: using the garbage collector to check heap properties."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ASPLOS-XII 2006",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2006",
                "sub_name": "Proceedings of the 12th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2006, San Jose, CA, USA, October 21-25, 2006.",
                "count": 39,
                "papers": [
                    "Impact of virtualization on computer architecture and operating systems.",
                    "A comparison of software and hardware techniques for x86 virtualization.",
                    "Geiger: monitoring the buffer cache in a virtual machine environment.",
                    "Temporal search: detecting hidden malware timebombs with virtual machines.",
                    "AVIO: detecting atomicity violations via access interleaving invariants.",
                    "A regulated transitive reduction (RTR) for longer memory race recording.",
                    "Bell: bit-encoding online memory leak detection.",
                    "Ultra low-cost defect protection for microprocessor pipelines.",
                    "Understanding prediction-based partial redundant threading for low-overhead, high- coverage fault tolerance.",
                    "SlicK: slice-based locality exploitation for efficient redundant multithreading.",
                    "Mercury and freon: temperature emulation and management for server systems.",
                    "PicoServer: using 3D stacking technology to enable a compact energy efficient chip multiprocessor.",
                    "A spatial path scheduling algorithm for EDGE architectures.",
                    "Instruction scheduling for a tiled dataflow architecture.",
                    "Exploiting coarse-grained task, data, and pipeline parallelism in stream programs.",
                    "Tartan: evaluating spatial computation for whole program execution.",
                    "A performance counter architecture for computing accurate CPI components.",
                    "Accurate and efficient regression modeling for microarchitectural performance and power prediction.",
                    "Efficiently exploring architectural design spaces via predictive modeling.",
                    "Comprehensively and efficiently protecting the heap.",
                    "HeapMD: identifying heap-based bugs using anomaly detection.",
                    "Recording shared memory dependencies using strata.",
                    "A defect tolerant self-organizing nanoscale SIMD architecture.",
                    "A program transformation and architecture support for quantum uncomputation.",
                    "Introspective 3D chips.",
                    "Stealth prefetching.",
                    "Computation spreading: employing hardware migration to specialize CMP cores on-the-fly.",
                    "Software-based instruction caching for embedded processors.",
                    "Mapping esterel onto a multi-threaded embedded processor.",
                    "Integrated network interfaces for high-bandwidth TCP/IP.",
                    "Accelerator: using data parallelism to program GPUs for general-purpose uses.",
                    "Hybrid transactional memory.",
                    "Unbounded page-based transactional memory.",
                    "Supporting nested transactional memory in logTM.",
                    "Tradeoffs in transactional memory virtualization.",
                    "A new idiom recognition framework for exploiting hardware-assist instructions.",
                    "Automatic generation of peephole superoptimizers.",
                    "Combinatorial sketching for finite programs.",
                    "A probabilistic pointer analysis for speculative optimizations."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2006plos",
                "sub_name": "Proceedings of the 3rd Workshop on Programming Languages and Operating Systems: Linguistic Support for Modern Operating Systems, PLOS 2006, San Jose, California, USA, October 22, 2006.",
                "count": 12,
                "papers": [
                    "Linguistic support for modern operating systems workshop on programming languages and operating systems 2006 (PLOS 2006).",
                    "Atomicity and visibility in tiny embedded systems.",
                    "Writing Solaris device drivers in Java.",
                    "OSEK/VDX API for Java.",
                    "SysObjC: C extension for development of object-oriented operating systems.",
                    "Efficient type and memory safety for tiny embedded systems.",
                    "Type inference for unboxed types and first class mutability.",
                    "A: an assertion language for distributed systems.",
                    "Programming language challenges in systems codes: why systems programmers still use C, and what to do about it.",
                    "Semantic patches for documenting and automating collateral evolutions in Linux device drivers.",
                    "Portability events: a programming model for scalable system infrastructures.",
                    "Issues in holistic system design."
                ]
            },
            {
                "sub_name_abbr": "conf/asplos/2006asid",
                "sub_name": "Proceedings of the 1st Workshop on Architectural and System Support for Improving Software Dependability, ASID 2006, San Jose, California, USA, October 21, 2006.",
                "count": 12,
                "papers": [
                    "Is process or architecture the solution?",
                    "Manitou: a layer-below approach to fighting malware.",
                    "Hunting Trojan Horses.",
                    "Improving software security via runtime instruction-level taint checking.",
                    "Have things changed now?: an empirical study of bug characteristics in modern open source software.",
                    "Accurate and efficient filtering for the Intel thread checker race detector.",
                    "Architectural support for software-based protection.",
                    "Tradeoffs in fine-grained heap memory protection.",
                    "Dependable != unaffordable.",
                    "Log-based architectures for general-purpose monitoring of deployed code.",
                    "ExecRecorder: VM-based full-system replay for attack analysis and system recovery.",
                    "SecCMP: a secure chip-multiprocessor architecture."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ASPLOS-XI 2004",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2004",
                "sub_name": "Proceedings of the 11th International Conference on Architectural Support for Programming Languages and Operating Systems, ASPLOS 2004, Boston, MA, USA, October 7-13, 2004.",
                "count": 24,
                "papers": [
                    "Programming with transactional coherence and consistency (TCC).",
                    "Spatial computation.",
                    "An ultra low-power processor for sensor networks.",
                    "D-SPTF: decentralized request distribution in brick-based storage systems.",
                    "FAB: building distributed enterprise disk arrays from commodity components.",
                    "Deconstructing storage arrays.",
                    "HIDE: an infrastructure for efficiently protecting information leakage on the address bus.",
                    "Secure program execution via dynamic information flow tracking.",
                    "Coherence decoupling: making use of incoherence.",
                    "Continual flow pipelines.",
                    "Scalable selective re-execution for EDGE architectures.",
                    "HOIST: a system for automatically deriving static analyzers for embedded systems.",
                    "Helper threads via virtual multithreading on an experimental itanium® 2 processor-based platform.",
                    "Low-overhead memory leak detection using adaptive statistical profiling.",
                    "Locality phase prediction.",
                    "Dynamic tracking of page miss ratio curve for memory management.",
                    "Compiler orchestrated prefetching via speculation and predication.",
                    "Software prefetching for mark-sweep garbage collection: hardware analysis and software redesign.",
                    "Devirtualizable virtual machines enabling general, single-node, online maintenance.",
                    "Fingerprinting: bounding soft-error detection latency and bandwidth.",
                    "Application-level checkpointing for shared memory programs.",
                    "Formal online methods for voltage/frequency control in multiple clock domain microprocessors.",
                    "Heat-and-run: leveraging SMT and CMP to manage power density through the operating system.",
                    "Performance directed energy management for main memory and disks."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "ASPLOS-X 2002",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2002",
                "sub_name": "Proceedings of the 10th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS-X), San Jose, California, USA, October 5-9, 2002.",
                "count": 25,
                "papers": [
                    "Keynote address: Sensor network research: emerging challenges for architecture, systems, and languages.",
                    "Transactional lock-free execution of lock-based programs.",
                    "Speculative synchronization: applying thread-level speculation to explicitly parallel applications.",
                    "Temporally silent stores.",
                    "Automatically characterizing large scale program behavior.",
                    "Bytecode fetch optimization for a Java interpreter.",
                    "Understanding and improving operating system effects in control flow prediction.",
                    "Maté: a tiny virtual machine for sensor networks.",
                    "Energy-efficient computing for wildlife tracking: design tradeoffs and early experiences with ZebraNet.",
                    "Enabling trusted software integrity.",
                    "ECOSystem: managing energy as a first class operating system resource.",
                    "Cool-Mem: combining statically speculative memory accessing with selective address translation for energy efficiency.",
                    "Joint local and global hardware adaptations for energy.",
                    "Design and evaluation of compiler algorithms for pre-execution.",
                    "Compiler optimization of scalar value communication between speculative threads.",
                    "Enhancing software reliability with speculative threads.",
                    "Dynamic dead-instruction detection and elimination.",
                    "An adaptive, non-uniform cache structure for wire-delay dominated on-chip caches.",
                    "A comparative study of arbitration algorithms for the Alpha 21364 pipelined router.",
                    "Increasing web server throughput with network interface data caching.",
                    "Programming language optimizations for modular router configurations.",
                    "Evolving RPC for active storage.",
                    "A stateless, content-directed data prefetching mechanism.",
                    "A stream compiler for communication-exposed architectures.",
                    "Mondrian memory protection."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "ASPLOS-IX 2000",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/2000",
                "sub_name": "ASPLOS-IX Proceedings of the 9th International Conference on Architectural Support for Programming Languages and Operating Systems, Cambridge, MA, USA, November 12-15, 2000.",
                "count": 24,
                "papers": [
                    "Designing computer systems with MEMS-based storage.",
                    "Architecture and design of AlphaServer GS320.",
                    "Timestamp snooping: an approach for extending SMPs.",
                    "MemorIES: A Programmable, Real-Time Hardware Emulation Tool for Multiprocessor Server Design.",
                    "FLASH vs. (Simulated) FLASH: Closing the Simulation Loop.",
                    "Using Meta-level Compilation to Check FLASH Protocol Code.",
                    "Evaluating Design Alternatives for Reliable Communication on High-Speed Networks.",
                    "Communication Scheduling.",
                    "System Architecture Directions for Networked Sensors.",
                    "Power Aware Page Allocation.",
                    "Hoard: A Scalable Memory Allocator for Multithreaded Applications.",
                    "Thread Level Parallelism and Interactive Performance of Desktop Applications.",
                    "Effective Null Pointer Check Elimination Utilizing Hardware Trap.",
                    "Frequent Value Locality and Value-Centric Data Cache Design.",
                    "Efficient and Flexible Value Sampling.",
                    "Architectural Support for Copy and Tamper Resistant Software.",
                    "Architectural Support for Fast Symmetric-Key Cryptography.",
                    "OceanStore: An Architecture for Global-Scale Persistent Storage.",
                    "Software Profiling for Hot Path Prediction: Less is More.",
                    "OS and Compiler Considerations in the Design of the IA-64 Architecture.",
                    "Hardware Support for Dynamic Management of Compiler-Directed Computation Reuse.",
                    "Symbiotic Jobscheduling for a Simultaneous Multithreading Processor.",
                    "An Analysis of Operating System Behavior on a Simultaneous Multithreaded Architecture.",
                    "Slipstream Processors: Improving both Performance and Fault Tolerance."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "ASPLOS-VIII, 1998",
        "info": "San Jose, California",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1998",
                "sub_name": "ASPLOS-VIII Proceedings of the 8th International Conference on Architectural Support for Programming Languages and Operating Systems, San Jose, California, USA, October 3-7, 1998.",
                "count": 28,
                "papers": [
                    "Compiler-Controlled Memory.",
                    "Segregating Heap Objects by Reference Behavior and Lifetime.",
                    "Schedule-Independent Storage Mapping for Loops.",
                    "An Empirical Analysis of Instruction Repetition.",
                    "Space-Time Scheduling of Instruction-Level Parallelism on a Raw Machine.",
                    "Data Speculation Support for a Chip Multiprocessor.",
                    "VISA: Netstation's Virtual Internet SCSI Adapter.",
                    "Active Disks: Programming Model, Algorithms and Evaluation.",
                    "A Cost-Effective, High-Bandwidth Storage Architecture.",
                    "Hardware-Software Trade-Offs in a Direct Rambus Implementation of the RAMpage Memory Hierarchy.",
                    "Dependance Based Prefetching for Linked Data Structures.",
                    "Performance Counters and State Sharing Annotations: a Unified Approach to Thread Locality.",
                    "Cache-Conscious Data Placement.",
                    "An Out-of-Order Execution Technique for Runtime Binary Translators.",
                    "Overlapping Execution with Transfer Using Non-Strict Execution for Mobile Programs.",
                    "Variable Length Path Branch Prediction.",
                    "Performance Isolation: Sharing and Isolation in Shared-Memory Multiprocessors.",
                    "UTLB: A Mechanism for Address Translation on Network Interfaces.",
                    "Locality-Aware Request Distribution in Cluster-based Network Servers.",
                    "Investigating Optimal Local Memory Performance.",
                    "Precise Miss Analysis for Program Transformations with Caches of Arbitrary Associativity.",
                    "Capturing Dynamic Memory Reference Behavior with Adaptive Cache Topology.",
                    "Accelerating Multi-Media Processing by Implementing Memoing in Multiplication and Division Units.",
                    "Value Speculation Scheduling for High Performance Processors.",
                    "An Empirical Study of Decentralized ILP Execution Models.",
                    "Fast Out-Of-Order Processor Simulation Using Memoization.",
                    "A Look at Several Memory Management Units, TLB-Refill Mechanisms, and Page Table Organizations.",
                    "Performance of Database Workloads on Shared-Memory Systems with Out-of-Order Processors."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "ASPLOS-VII, 1996",
        "info": "Cambridge, Massachusetts",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1996",
                "sub_name": "ASPLOS-VII Proceedings - Seventh International Conference on Architectural Support for Programming Languages and Operating Systems, Cambridge, Massachusetts, USA, October 1-5, 1996.",
                "count": 25,
                "papers": [
                    "The Case for a Single-Chip Multiprocessor.",
                    "An Evaluation of Memory Consistency Models for Shared-Memory Systems with ILP Processors.",
                    "Synchronization and Communication in the T3E Multiprocessor.",
                    "Evaluation of Architectural Support for Global Address-Based Communication in Large-Scale Parallel Machines.",
                    "Whole-Program Optimization for Time and Space Efficient Threads.",
                    "Thread Scheduling for Cache Locality.",
                    "The Rio File Cache: Surviving Operating System Crashes.",
                    "Petal: Distributed Virtual Disks.",
                    "A Quantitative Analysis of Loop Nest Locality.",
                    "The Intrinsic Bandwidth Requirements of Ordinary Programs.",
                    "Multiple-Block Ahead Branch Predictors.",
                    "Analysis of Branch Prediction Via Data Compression.",
                    "Value Locality and Load Value Prediction.",
                    "The Structure and Performance of Interpreters.",
                    "Adapting to Network and Client Variability via On-Demand Dynamic Distillation.",
                    "Shasta: A Low Overhead, Software-Only Approach for Supporting Fine-Grain Shared Memory.",
                    "An Integrated Compile-Time/Run-Time Software Distributed Shared Memory System.",
                    "Hiding Communication Latency and Coherence Overhead in Software DSMs.",
                    "SoftFLASH: Analyzing the Performance of Clustered Distributed Virtual Shared Memory.",
                    "Compiler-Based Prefetching for Recursive Data Structures.",
                    "Exploiting Dual Data-Memory Banks in Digital Signal Processors.",
                    "Compiler-Directed Page Coloring for Multiprocessors.",
                    "Reducing Network Latency Using Subpages in a Global Memory Environment.",
                    "Improving Cache Performance with Balanced Tag and Data Paths.",
                    "Operating System Support for Improving Data Locality on CC-NUMA Compute Servers."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "ASPLOS-VI, 1994",
        "info": "San Jose, California",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1994",
                "sub_name": "ASPLOS-VI Proceedings - Sixth International Conference on Architectural Support for Programming Languages and Operating Systems, San Jose, California, USA, October 4-7, 1994.",
                "count": 29,
                "papers": [
                    "Separating Data and Control Transfer in Distributed Operating Systems.",
                    "Scheduling and Page Migration for Multiprocessor Compute Servers.",
                    "Reactive Synchronization Algorithms for Multiprocessors.",
                    "Integration of Message Passing and Shared Memory in the Stanford FLASH Multiprocessor.",
                    "Software Overhead in Messaging Layers: Where Does the Time Go?",
                    "Where is Time Spent in Message-Passing and Shared-Memory Programs?",
                    "Performance of a Hardware-Assisted Real-Time Garbage Collector.",
                    "eNVy: A Non-Volatile, Main Memory Storage System.",
                    "Resource Allocation in a High Clock Rate Microprocessor.",
                    "Hardware and Software Support for Efficient Exception Handling.",
                    "A Technique for Monitoring Run-Time Dynamics of an Operating System and a Microprocessor Executing User Applications.",
                    "Trap-driven Simulation with Tapeworm II.",
                    "Contrasting Characteristics and Cache Performance of Technical and Multi-User Commercial Workloads.",
                    "Avoiding Conflict Misses Dynamically in Large Direct-Mapped Caches.",
                    "Surpassing the TLB Performance of Superpages with Less Operating System Support.",
                    "Dynamic Memory Disambiguation Using the Memory Conflict Buffer.",
                    "AP1000+: Architectural Support of PUT/GET Interface for Parallelizing Compiler.",
                    "LCM: Memory System Support for Parallel Language Implementation.",
                    "The Performance Advantages of Integrating Block Data Trabsfer in Cache-Coherent Multiprocessors.",
                    "Improving the Accuracy of Static Branch Prediction Using Branch Correlation.",
                    "Reducing Branch Costs via Branch Alignment.",
                    "Compiler Optimizations for Improving Data Locality.",
                    "DCG: An Efficient, Retargetable Dynamic Code Generation System.",
                    "The Performance Impact of Flexibility in the Stanford FLASH Multiprocessor.",
                    "Simple Compiler Algorithms to Reduce Ownership Operhead in Cache Coherence Protocols.",
                    "Fine-grain Access Control for Distributed Shared Memory.",
                    "Interleaving: A Multithreading Technique Targeting Multiprocessors and Workstations.",
                    "Hardware Support for Fast Capability-based Addressing.",
                    "The Effectiveness of Multiple Hardware Contexts."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "ASPLOS-V, 1992",
        "info": "Boston, Massachusetts",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1992",
                "sub_name": "ASPLOS-V Proceedings - Fifth International Conference on Architectural Support for Programming Languages and Operating Systems, Boston, Massachusetts, USA, October 12-15, 1992.",
                "count": 24,
                "papers": [
                    "On-Line Data Compression in a Log-Structured File System.",
                    "Non-Volatile Memory for Fast, Reliable File Systems.",
                    "Parity Declustering for Continuous Operation in Redundant Disk Arrays.",
                    "Software Support for Speculative Loads.",
                    "Reducing Memory Latency via Non-blocking and Prefetching Caches.",
                    "Design and Evaluation of a Compiler Algorithm for Prefetching.",
                    "Improving the Accuracy of Dynamic Branch Prediction Using Branch Correlation.",
                    "Predicting Conditional Branch Directions From Previous Runs of a Program.",
                    "High Speed Switch Scheduling for Local Area Networks.",
                    "A Tightly-Coupled Processor-Network Interface.",
                    "Consistency Management for Virtually Indexed Caches.",
                    "Eliminating the Address Translation Bottleneck for Physical Address Cache.",
                    "A Performance Evaluation of Optimal Hybrid Cache Coherency Protocols.",
                    "Characterizing the Caching and Synchronization Performance of a Multiprocessor Operating System.",
                    "Architectural Support for Single Address Space Operating Systems.",
                    "Application-Controlled Physical Memory using External Page-Cache Management.",
                    "Efficient Data Breakpoints.",
                    "Migrating a CISC Computer Family onto RISC via Object Code Translation.",
                    "Fast Mutual Exclusion for Uniprocessors.",
                    "Sentinel Scheduling for VLIW and Superscalar Processors.",
                    "Efficient Superscalar Performance Through Boosting.",
                    "Cooperative Shared Memory: Software and Hardware Support for Scalable Multiprocesors.",
                    "Closing the Window of Vulnerability in Multiphase Memory Transactions.",
                    "Access Normalization: Loop Restructuring for NUMA Compilers."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "ASPLOS-IV, 1991",
        "info": "Santa Clara, California",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1991",
                "sub_name": "ASPLOS-IV Proceedings - Forth International Conference on Architectural Support for Programming Languages and Operating Systems, Santa Clara, California, USA, April 8-11, 1991.",
                "count": 28,
                "papers": [
                    "A Variable Instruction Stream Extension to the VLIW Architecture.",
                    "Reducing the Branch Penalty by Rearranging Instructions in Double-Width Memory.",
                    "The Floating-Point Performance of a Superscalar SPARC Processor.",
                    "Software Prefetching.",
                    "High-Bandwidth Data Memory Systems for Superscalar Processors.",
                    "The Cache Performance and Optimizations of Blocked Algorithms.",
                    "The Effect of Context Switches on Cache Performance.",
                    "A Portable Interface for On-the-Fly Instruction Space Modifiction.",
                    "Virtual Memory Primitives for User Programs.",
                    "The Interaction of Architecture and Operating System Design.",
                    "Integrating Register Allocation and Instruction Scheduling for RISCs.",
                    "Code Generation for Streaming: An Access/Execute Mechanism.",
                    "Efficient Implementation of High Level Parallel Programs.",
                    "Vector Register Design for Polycyclic Vector Scheduling.",
                    "Fine-Grain Parallelism with Minimal Hardware Support: A Compiler-Controlled Threaded Abstract Machine.",
                    "Limits of Instruction-Level Parallelism.",
                    "Performance Consequences of Parity Placement in Disk Arrays.",
                    "Integration of Compression and Caching for a Two-Level File System.",
                    "NUMA Policies and Their Relation to Memory Architecture.",
                    "LimitLESS Directories: A Scalable Cache Coherence Scheme.",
                    "An Efficient Cache-Based Access Anomaly Detection Scheme.",
                    "Performance Evaluation of Memory Consistency Models for Shared Memory Multiprocessors.",
                    "Process Coordination with Fetch-and-Increment.",
                    "Synchronization without Contention.",
                    "The Case for a Read Barrier.",
                    "An Analysis of SPARC and MIPS Instruction Set Utilization on the SPEC Benchmarks.",
                    "Performance Characteristics of Architectural Features of the IBM RISC System/6000.",
                    "Performance From Architecture: Comparing a RISC and CISC with Similar Hardware Organization."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "ASPLOS-III, 1989",
        "info": "Boston, Massachusetts",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1989",
                "sub_name": "ASPLOS-III Proceedings - Third International Conference on Architectural Support for Programming Languages and Operating Systems, Boston, Massachusetts, USA, April 3-6, 1989.",
                "count": 27,
                "papers": [
                    "Architecture and Compiler Tradeoffs for a Long Instruction Word Microprocessor.",
                    "Tradeoffs in Instruction Format Design for Horizontal Architectures.",
                    "Overlapped Loop Support in the Cydra 5.",
                    "Architectural Support for Synchronous Task Communication.",
                    "The Fuzzy Barrier: A Mechanism for High Speed Synchronization of Processors.",
                    "Efficent Synchronization Primitives for Large-Scale Cache-Coherent Multiprocessors.",
                    "A Software Instruction Counter.",
                    "Efficient Debugging Primitives for Multiprocessors.",
                    "Sheaved Memory: Architectural Support for State Saving and Restoration in Paged Systems.",
                    "Reference History, Page Size, and Migration Daemons in Local/Remote Architectures.",
                    "Translation Lookaside Buffer Consistency: A Software Approach.",
                    "Failure Correction Techniques for Large Disk Arrays.",
                    "A Unified Vector/Scalar Floating-Point Architecture.",
                    "Data Buffering: Run-Time Versus Compile-Time Support.",
                    "An Analysis of 8086 Instruction Set Usage in MS DOS Programs.",
                    "A Real-Time Support Processor for Ada Tasking.",
                    "The Run-Time Environment for Screme, A Scheme Implementation on the 88000.",
                    "Program Optimization for Instruction Caches.",
                    "Using Registers to Optimize Cross-Domain Call Performance.",
                    "The Design of Nectar: A Network Backplane for Heterogeneous Multicomputers.",
                    "A Message Driven Or-Parallel Machine.",
                    "Evaluating the Performance of Software Cache Coherence.",
                    "Analysis of Cache Invalidation Patterns in Multiprocessors.",
                    "The Effect of Sharing on the Cache and Bus Performance of Parallel Programs.",
                    "Available Instruction-Level Parallelism for Superscalar and Superpipelined Machines.",
                    "Micro-Optimization of Floating Point Operations.",
                    "Limits on Multiple Instruction Issue."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "ASPLOS-II, 1987",
        "info": "Palo Alto, California",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1987",
                "sub_name": "Proceedings of the Second International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS II), Palo Alto, California, USA, October 5-8, 1987.",
                "count": 26,
                "papers": [
                    "Hardware Architectures for Programming Languages and Programming Languages for Hardware Architectures.",
                    "VLSI Assist For a Multiprocessor.",
                    "Architectural Support for Multilanguage Parallel Programming on Heterogeneous Systems.",
                    "Machine-Independent Virtual Memory Management for Paged Uniprocessor and Multiprocessor Architectures.",
                    "An Architecture for the Direct Execution of the Forth Programming Language.",
                    "Tags and Type Checking in Lisp: Hardware and Software Approaches.",
                    "The Effect of Instruction Set Complexity on Program Size and Memory Performance.",
                    "The Dragon Processor.",
                    "Coherency for Multiprocessor Virtual Address Caches.",
                    "Cheap Hardware Support for Software Debugging and Profiling.",
                    "An Experimental Coprocessor for Implementing Persistant Objects on an IBM 4381.",
                    "Integer Multiplication and Division on the HP Precision Architecture.",
                    "The Mahler Experience: Using and Intermediate Language as the Machine Description.",
                    "A Study of Scalar Compilation Techniques for Pipelined Supercomputers.",
                    "Compiling Smalltalk-80 to a RISC.",
                    "How Many Addressing Modes are Enough?",
                    "Superoptimizer - A Look at the Smallest Program.",
                    "Performance and Architectural Evaluation of the PSI Machine.",
                    "RISCs versus CISCs for Prolog: A Case Study.",
                    "A RISC Architecture for Symbolic Computation.",
                    "Design Tradeoffs to Support the C Programming Language in the CRISP Microprocessor.",
                    "Firefly: A Multiprocessor Workstation.",
                    "Pipelining and Performance in the VAX 8800 Processor.",
                    "A VLIW Architecture for a Trace Scheduling Compiler.",
                    "Parallel Computers for Graphics Applications.",
                    "The ZS-1 Central Processor."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "ASPLOS-I, 1982",
        "info": "Palo Alto, California",
        "venues": [
            {
                "sub_name_abbr": "conf/asplos/1982",
                "sub_name": "Proceedings of the Symposium on Architectural Support for Programming Languages and Operating Systems, Palo Alto, California, USA, March 1-3, 1982.",
                "count": 26,
                "papers": [
                    "Hardware/Software Cooperation in the iAPX-423.",
                    "Hardware/Software Tradeoffs for Increased Performance.",
                    "Coding Guidelines for Pipelined Processors.",
                    "An Overview of the Mesa Processor Architecture.",
                    "The Operating System and Language Support Features of the BELLMAC-32 Microprocessor.",
                    "The 801 Minicomputer.",
                    "Register Allocation for Free: The C Machine Stack Cache.",
                    "An Architectural Alternative to Optimizing Compilers.",
                    "Fast Procedure Calls.",
                    "Systematic Protection Mechanism Design.",
                    "On a General Property of Memory Mapping Tables.",
                    "An Experiment to Improve Operand Addressing.",
                    "Compiler Chip: A Hardware Implementation of Compiler.",
                    "Architectural Support for the Efficient Generation of Code for Horizontal Architectures.",
                    "Guidelines for Creating a Debuggable Processor.",
                    "Hardware Support for Memory Protection: Capability Implementations.",
                    "Supporting Ada Memory Management in the iAPX-432.",
                    "Direct Execution of Lisp on a List-Directed Architecture.",
                    "Some Requirements for Architectural Support of Software Debugging.",
                    "The Effect of the PDP-11 Architecture on Code Generation for Chill.",
                    "Empirical Analysis of the Mesa Instruction Set.",
                    "An Analysis of a Mesa Instruction Set Using Dynamic Instruction Frequencies.",
                    "A Case Study of VAX-11 Instruction Set Usage for Compiler Execution.",
                    "Firmware Structure and Architectural Support for Monitors, Vertical Migration and User Microprogramming.",
                    "Heart: An Operating System Nucleus Machine Implemented by Firmware.",
                    "A Multi-Microprocessor Architecture with Hardware Support for Communication and Scheduling."
                ]
            }
        ]
    }
]