[
    {
        "year": "2021",
        "name": "30th Asian Test Symposium 2021",
        "info": "Ehime, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2021",
                "sub_name": "30th IEEE Asian Test Symposium, ATS 2021, Matsuyama, Ehime, Japan, November 22-25, 2021.",
                "count": 25,
                "papers": [
                    "ChaoPIM: A PIM-based Protection Framework for DNN Accelerators Using Chaotic Encryption.",
                    "Twine Stack: A Hybrid Mechanism Achieving Less Cost for Return Address Protection.",
                    "Lightweight Hardware-Based Memory Protection Mechanism on IoT Processors.",
                    "Application of Residue Sampling to RF/AMS Device Testing.",
                    "Robust Fault-Tolerant Design Based on Checksum and On-Line Testing for Memristor Neural Network.",
                    "Temperature-Aware Evaluation and Mitigation of Logic Soft Errors Under Circuit Variations.",
                    "Note on CapsNet-Based Wafer Map Defect Pattern Classification.",
                    "SeGa: A Trojan Detection Method Combined With Gate Semantics.",
                    "CausalTester: Measuring the Consistency of Replicated Services via Causality Semantics.",
                    "Detection of Stuck-at and Bridging Fault in Reversible Circuits using an Augmented Circuit.",
                    "Fault Analysis of the Beam Acceleration Control System at the European XFEL using Data Mining.",
                    "A Novel Compaction Approach for SBST Test Programs.",
                    "Effective SAT-based Solutions for Generating Functional Sequences Maximizing the Sustained Switching Activity in a Pipelined Processor.",
                    "Side-Channel Attacks on Triple Modular Redundancy Schemes.",
                    "Polynomial Formal Verification of Prefix Adders.",
                    "Further Analysis of Laser-induced IR-drop.",
                    "Investigation of 0.18μm CMOS Sensitivity to BTI and HCI Mechanisms under Extreme Thermal Stress Conditions.",
                    "On Modeling CMOS Library Cells for Cell Internal Fault Test Pattern Generation.",
                    "Positive and Negative Extra Clocking of LFSR Seeds for Reduced Numbers of Stored Tests.",
                    "Towards a Secure Integrated Heterogeneous Platform via Cooperative CPU/GPU Encryption.",
                    "A Design of Approximate Voting Schemes for Fail-Operational Systems.",
                    "GPU-Accelerated Timing Simulation of Systolic-Array-Based AI Accelerators.",
                    "Analyzing Transient Faults and Functional Error Rates of a RISC-V Core: A Case Study.",
                    "High Precision Measurement of Sub-Nano Ampere Current in ATE Environment.",
                    "A Power Reduction Method for Scan Testing in Ultra-Low Power Designs."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "29th Asian Test Symposium 2020",
        "info": "Penang, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2020",
                "sub_name": "29th IEEE Asian Test Symposium, ATS 2020, Penang, Malaysia, November 23-26, 2020.",
                "count": 40,
                "papers": [
                    "A Unified Formal Model for Proving Security and Reliability Properties.",
                    "Power Supply Noise-Aware Scan Test Pattern Reshaping for At-Speed Delay Fault Testing of Monolithic 3D ICs *.",
                    "LBIST-PUF: An LBIST Scheme Towards Efficient Challenge-Response Pairs Collection and Machine-Learning Attack Tolerance Improvement.",
                    "Theoretical Analysis on Noise Performance of Modulated Wideband Converters for Analog Testing.",
                    "Influence of Device Parameter Variability on Current Sharing of Parallel-Connected SiC MOSFETs.",
                    "C-Testing of AI Accelerators *.",
                    "Summing Node Test Method: Simultaneous Multiple AC Characteristics Testing of Multiple Operational Amplifiers.",
                    "Measurement of BTI-induced Threshold Voltage Shift for Power MOSFETs under Switching Operation.",
                    "Unexpected Error Explosion in NAND Flash Memory: Observations and Prediction Scheme.",
                    "Survey: Hardware Trojan Detection for Netlist.",
                    "Optimization Space Exploration of Hardware Design for CRYSTALS-KYBER.",
                    "A Sextuple Cross-Coupled SRAM Cell Protected against Double-Node Upsets.",
                    "HRAE: Hardware-assisted Randomization against Adversarial Example Attacks.",
                    "Pre-silicon Noise to Timing Test Methodology.",
                    "A comparative analysis of LFSR cascading for hardware efficiency and high fault coverage in BIST applications.",
                    "An ISA-level Accurate Fault Simulator for System-level Fault Analysis.",
                    "A Method to Detect Open Defects in Wire Segments of On-Chip Power Grids.",
                    "A Testability Enhancement Method for the Memristor Ratioed Logic Circuits.",
                    "Accurate Testing of Precision Voltage Reference by DC-AC Conversion.",
                    "An effective technique preventing differential cryptanalysis attack.",
                    "Potentiality of Data Fusion in Analog Circuit Fault Diagnosis.",
                    "On Evaluation for Aging-Tolerant Ring Oscillators with Accelerated Life Test And Its Application to A Digital Sensor.",
                    "Overview of On-Chip Performance Monitors for Clock Signals.",
                    "LUT-based Circuit Approximation with Targeted Error Guarantees.",
                    "Systematic Hold-time Fault Diagnosis and Failure Debug in Production Chips.",
                    "EMI characterization for power conversion circuit with SiC power devices.",
                    "BTI Aging Monitoring based on SRAM Start-up Behavior.",
                    "Scan Chain Diagnosis-Driven Test Response Compactor.",
                    "Analysis and Design of Multi-Tone Signal Generation Algorithms for Reducing Crest Factor.",
                    "Testing of Configurable 8T SRAMs for In-Memory Computing.",
                    "Exploring the Mysteries of System-Level Test.",
                    "An ADC Test Technique With Dual-Path/Multi-Functional Fine Pattern Generator Realizing High Accuracy Measurement for CMOS Image Sensor.",
                    "NodeRank: Observation-Point Insertion for Fault Localization in Monolithic 3D ICs∗.",
                    "CPU Utilization Micro-Benchmarking for RealTime Workload Modeling.",
                    "Artificial Neuron Hardware IP Verification.",
                    "Fault and Soft Error Tolerant Delay-Locked Loop.",
                    "Validating GCSE in the scheduling of high-level synthesis.",
                    "On-chip EOL Prognostics Using Data-Fusion of Embedded Instruments for Dependable MP-SoCs.",
                    "SDPTA: Soft-Delay-aware Pattern-based Timing Analysis and Its Path-Fixing Mechanism.",
                    "Heuristic Approach for Identification of Random TSV Defects in 3D IC During Pre-bond Testing."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "28th Asian Test Symposium 2019",
        "info": "Kolkata, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2019",
                "sub_name": "28th IEEE Asian Test Symposium, ATS 2019, Kolkata, India, December 10-13, 2019.",
                "count": 28,
                "papers": [
                    "Deep Learning Based Test Compression Analyzer.",
                    "Sanity-Check: Boosting the Reliability of Safety-Critical Deep Neural Network Applications.",
                    "Applying Neural Networks to Delay Fault Testing: Test Point Insertion and Random Circuit Training.",
                    "TEA: A Test Generation Algorithm for Designs with Timing Exceptions.",
                    "Fault Coverage of a Test Set on Structure-Preserving Siblings of a Circuit-Under-Test.",
                    "A Built-In Self-Diagnostic Mechanism for Delay Faults Based on Self-Generation of Expected Signatures.",
                    "Self-Checking Residue Number System for Low-Power Reliable Neural Network.",
                    "Novel Radiation Hardened Latch Design with Cost-Effectiveness for Safety-Critical Terrestrial Applications.",
                    "Machine Learning Assisted Accurate Estimation of Usage Duration and Manufacturer for Recycled and Counterfeit Flash Memory Detection.",
                    "Design of a Sextuple Cross-Coupled SRAM Cell with Optimized Access Operations for Highly Reliable Terrestrial Applications.",
                    "Can Monitoring System State + Counting Custom Instruction Sequences Aid Malware Detection?",
                    "Reinforcement-Learning-Based Test Program Generation for Software-Based Self-Test.",
                    "Latency Aware Fault Tolerant Cache in Multicore Using Dynamic Remapping Clusters.",
                    "Recruiting Fault Tolerance Techniques for Microprocessor Security.",
                    "Deep Learning Based Diagnostics for Rowhammer Protection of DRAM Chips.",
                    "Towards Verifiably Secure Systems-on-Chip Platforms.",
                    "Machine-Learning-Based Multiple Abstraction-Level Detection of Hardware Trojan Inserted at Register-Transfer Level.",
                    "Validating Multi-Processor Cache Coherence Mechanisms under Diminished Observability.",
                    "Net Classification Based on Testability and Netlist Structural Features for Hardware Trojan Detection.",
                    "GramsDet: Hardware Trojan Detection Based on Recurrent Neural Network.",
                    "Efficient Testing of Physically Unclonable Functions for Uniqueness.",
                    "Orion: A Technique to Prune State Space Search Directions for Guidance-Based Formal Verification.",
                    "Combining Fault Analysis Technologies for ISO26262 Functional Safety Verification.",
                    "A Structured Approach for Rapid Identification of Fault-Sensitive Nets in Analog Circuits.",
                    "Hierarchical State Space Checks for Errors in Sensors, Actuators and Control of Nonlinear Systems: Diagnosis and Compensation.",
                    "Iterative Parallel Test to Detect and Diagnose Multiple Defects for Digital Microfluidic Biochip.",
                    "Detailed Fault Model for Physical Quantum Circuits.",
                    "Ensuring Correctness of Next Generation Devices: From Reconfigurable to Self-Learning Systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "27th Asian Test Symposium 2018",
        "info": "Hefei, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2018",
                "sub_name": "27th IEEE Asian Test Symposium, ATS 2018, Hefei, China, October 15-18, 2018.",
                "count": 36,
                "papers": [
                    "Identification of Faulty TSV with a Built-In Self-Test Mechanism.",
                    "Test Time Reduction on Testing Delay Faults in 3D ICs Using Boundary Scan Design.",
                    "A Fault Check Graph Approach for Photonic Router in Network on Chip.",
                    "A Built-in Self-Test Scheme for Detecting Defects in FinFET-Based SRAM Circuit.",
                    "Defect Analysis and Parallel March Test Algorithm for 3D Hybrid CMOS-Memristor Memory.",
                    "On Flip-Flop Selection for Multi-cycle Scan Test with Partial Observation in Logic BIST.",
                    "Handling Clock-Domain Crossings in Dual Clock-Edge Logic for DFx Features.",
                    "A Dictionary-Based Test Data Compression Method Using Tri-State Coding.",
                    "A Dynamic-Key Secure Scan Structure Against Scan-Based Side Channel and Memory Cold Boot Attacks.",
                    "A Low-Cost High-Efficiency True Random Number Generator on FPGAs.",
                    "An All-Digital and Jitter-Quantizing True Random Number Generator in SRAM-Based FPGAs.",
                    "A High Reliability FPGA Chip Identification Generator Based on PDLs.",
                    "Hardware Trojan in FPGA CNN Accelerator.",
                    "Lifetime Reliability Trojan Based on Exploring Malicious Aging.",
                    "Hardware Trojan Detection Based on Signal Correlation.",
                    "Aging-Temperature-and-Propagation Induced Pulse-Broadening Aware Soft Error Rate Estimation for nano-Scale CMOS.",
                    "Extending Aging Monitors for Early Life and Wear-Out Failure Prevention.",
                    "Cell Flipping with Distributed Refresh for Cache Ageing Minimization.",
                    "A New Scheme to Extract PUF Information by Scan Chain.",
                    "CIPA: Concurrent IC and PCB Authentication Using On-chip Ring Oscillator Array.",
                    "PUF Based Pay-Per-Device Scheme for IP Protection of CNN Model.",
                    "A Hybrid DMR Latch to Tolerate MNU Using TDICE and WDICE.",
                    "Towards Affordable Fault-Tolerant Nanosatellite Computing with Commodity Hardware.",
                    "RiskCap: Minimizing Effort of Error Regulation for Approximate Computing.",
                    "Dynamic Fine-Grain Power Gating Design in WiNoC.",
                    "Clock-Skew-Aware Scan Chain Grouping for Mitigating Shift Timing Failures in Low-Power Scan Testing.",
                    "Capture-Pattern-Control to Address the Fault Detection Degradation Problem of Multi-cycle Test in Logic BIST.",
                    "Progressive ECC Techniques for Phase Change Memory.",
                    "Area-Efficient and Reliable Hybrid CMOS/Memristor ECC Circuit for ReRAM Storage.",
                    "Precompensation, BIST and Analogue Berger Codes for Self-Healing of Neuromorphic RRAM.",
                    "Digital Rights Management for Paper-Based Microfluidic Biochips.",
                    "Test Diagnosis of Digital Microfluidic Biochips Using Image Segmentation.",
                    "A Monobit Built-In Test and Diagnostic System for Flexible Electronic Interconnect.",
                    "Highly Efficient Waveform Acquisition Condition in Equivalent-Time Sampling System.",
                    "Time-to-Digital Converter Architectures Using Two Oscillators with Different Frequencies.",
                    "Design and Implementation of an FPGA-Based 16-Channel Data/Timing Formatter."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "26th Asian Test Symposium 2017",
        "info": "Taipei City, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2017",
                "sub_name": "26th IEEE Asian Test Symposium, ATS 2017, Taipei City, Taiwan, November 27-30, 2017.",
                "count": 44,
                "papers": [
                    "An Enhanced Boundary Scan Architecture for Inter-Die Interconnect Leakage Measurement in 2.5D and 3D Packages.",
                    "On-Chip Ring Oscillator Based Scheme for TSV Delay Measurement.",
                    "Testing of Interconnect Defects in Memory Based Reconfigurable Logic Device (MRLD).",
                    "Test Pattern Compression for Probabilistic Circuits.",
                    "Test Compression with Single-Input Data Spreader and Multiple Test Sessions.",
                    "Test Compaction with Dynamic Updating of Faults for Coverage of Undetected Transition Fault Sites.",
                    "A New Active IC Metering Technique Based on Locking Scan Cells.",
                    "Tree-Based Logic Encryption for Resisting SAT Attack.",
                    "Intra-Die-Variation-Aware Side Channel Analysis for Hardware Trojan Detection.",
                    "On Securing Scan Design from Scan-Based Side-Channel Attacks.",
                    "An Incremental Aging Analysis Method Based on Delta Circuit Simulation Technique.",
                    "Post-Silicon Test Flow for Aging Prediction.",
                    "Cloud-Based PVT Monitoring System for IoT Devices.",
                    "A Critical Charge Model for Estimating the SET and SEU Sensitivity: A Muller C-Element Case Study.",
                    "Design and Implementation of an EG-Pool Based FPGA Formatter with Temperature Compensation.",
                    "SAR TDC Architecture with Self-Calibration Employing Trigger Circuit.",
                    "Bringing Fault-Tolerant GigaHertz-Computing to Space: A Multi-stage Software-Side Fault-Tolerance Approach for Miniaturized Spacecraft.",
                    "Identification of Efficient Clustering Techniques for Test Power Activity on the Layout.",
                    "Security Implications of Cyberphysical Flow-Based Microfluidic Biochips.",
                    "How to Secure Scan Design Against Scan-Based Side-Channel Attacks?",
                    "Structure-Oriented Test of Reconfigurable Scan Networks.",
                    "Compaction of a Transparent-Scan Sequence to Reduce the Fail Data Volume for Scan Chain Faults.",
                    "Architecture for Reliable Scan-Dump in the Presence of Multiple Asynchronous Clock Domains in FPGA SoCs.",
                    "Scan Chain Grouping for Mitigating IR-Drop-Induced Test Data Corruption.",
                    "Deterministic Path Delay Measurement Using Short Cycle Test Pattern.",
                    "Cell-Aware ATPG to Improve Defect Coverage for FPGA IPs and Next Generation Zynq® MPSoCs.",
                    "Testing Clock Distribution Networks.",
                    "Test Coverage Analysis for Designs with Timing Exceptions.",
                    "Test and Reliability of Emerging Non-volatile Memories.",
                    "Test and Debug Strategy for High Speed JESD204B Rx PHY.",
                    "Post Silicon Debugging of Electrical Bugs Using Trace Buffers.",
                    "On Evaluating and Constraining Assertions Using Conflicts in Absent Scenarios.",
                    "Yield Enhancement by Repair Circuits for Ultra-Fine Pitch Stacked-Chip Connections.",
                    "Error-Tolerability Evaluation and Test for Images in Face Detection Applications.",
                    "PADLOC: Physically-Aware Defect Localization and Characterization.",
                    "Automatic Identification of Yield Limiting Layout Patterns Using Root Cause Deconvolution on Volume Scan Diagnosis Data.",
                    "Scan Chain Diagnosis Based on Unsupervised Machine Learning.",
                    "Using Cell Aware Diagnostic Patterns to Improve Diagnosis Resolution for Cell Internal Defects.",
                    "Automotive IC On-line Test Techniques and the Application of Deterministic ATPG-Based Runtime Test.",
                    "Open Defect Detection with a Built-in Test Circuit by IDDT Appearance Time in CMOS ICs.",
                    "Design for Testability Technique of Reversible Logic Circuits Based on Exclusive Testing.",
                    "Fault-Aware Page Address Remapping Techniques for Enhancing Yield and Reliability of Flash Memories.",
                    "3D IC Memory BIST Controller Allocation for Test Time Minimization Under Power Constraints.",
                    "A Heuristic Algorithm for Automatic Generation of March Tests."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "25th Asian Test Symposium 2016",
        "info": "Hiroshima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2016",
                "sub_name": "25th IEEE Asian Test Symposium, ATS 2016, Hiroshima, Japan, November 21-24, 2016.",
                "count": 61,
                "papers": [
                    "X Marks the Spot: Scan-Flip-Flop Clustering for Faster-than-at-Speed Test.",
                    "Crypt-Delay: Encrypting IP Cores with Capabilities for Gate-level Logic and Delay Simulations.",
                    "On the Switching Activity in Faulty Circuits During Test Application.",
                    "Timing-Accurate Estimation of IR-Drop Impact on Logic- and Clock-Paths During At-Speed Scan Test.",
                    "Repairable Cell-Based Chip Design for Simultaneous Yield Enhancement and Fault Diagnosis.",
                    "A New Approach for Debugging Logic Circuits without Explicitly Debugging Their Functionality.",
                    "A Verification Guided Approach for Selective Program Transformations for Approximate Computing.",
                    "Property Coverage Analysis Based Trustworthiness Verification for Potential Threats from EDA Tools.",
                    "Efficient Attack on Non-linear Current Mirror PUF with Genetic Algorithm.",
                    "Noise-Resilient SRAM Physically Unclonable Function Design for Security.",
                    "On Test Points Enhancing Hardware Security.",
                    "Side-Channel Attack on Flipped Scan Chains.",
                    "Test and Reliability Issues in 2.5D and 3D Integration.",
                    "Testing of Interposer-Based 2.5D Integrated Circuits: Challenges and Solutions.",
                    "Pre-Bond and Post-Bond Testing of TSVs and Die-to-Die Interconnects.",
                    "Multicast Test Architecture and Test Scheduling for Interposer-Based 2.5D ICs.",
                    "A Study on the Transfer Function Based Analog Fault Model for Linear and Time-Invariant Continuous-Time Analog Circuits.",
                    "Concurrent Stimulus and Defect Magnitude Optimization for Detection of Weakest Shorts and Opens in Analog Circuits.",
                    "Model-Free Testing of Analog Circuits.",
                    "Scan Chain Adaptation through ECO.",
                    "Test Strategies for Reconfigurable Scan Networks.",
                    "Test Time Minimization in Reconfigurable Scan Networks.",
                    "Rectangular Waveform Generation with Harmonics Suppression.",
                    "Achieving Acceptable Bit Error Rate for 40 Gbps Link Using Signal Conditioning Techniques.",
                    "Design and Implementation of EMIB Testing on 2.5D FPGA Transceiver.",
                    "Application of Data Mining Based Scan Diagnosis Yield Analysis in a Foundry and Fabless Working Environment.",
                    "rosTest: Universal Test Framework for Real-Time Operating System.",
                    "An Optical/Electrical Test System for 100-Gb/s Optical Interconnection Devices for High Volume Production.",
                    "Multi-configuration Scan Structure for Various Purposes.",
                    "On Achieving Maximal Chain Diagnosis Resolution through Test Pattern Selection.",
                    "A Joint Diagnostic Test Generation Procedure with Dynamic Test Compaction.",
                    "A Neural-Network-Based Fault Classifier.",
                    "High-Throughput Transistor-Level Fault Simulation on GPUs.",
                    "Layout-Oriented Defect Set Reduction for Fast Circuit Simulation in Cell-Aware Test.",
                    "Reliability Assessment and Quantitative Evaluation of Soft-Error Resilient 3D Network-on-Chip Systems.",
                    "An IR-Drop Aware Test Pattern Generator for Scan-Based At-Speed Testing.",
                    "Formal Test Point Insertion for Region-based Low-Capture-Power Compact At-Speed Scan Test.",
                    "On Optimal Power-Aware Path Sensitization.",
                    "Automated Optimization of Scan Chain Structure for Test Compression-Based Designs.",
                    "Critical-Area-Aware Test Pattern Generation and Reordering.",
                    "Efficient Cell-Aware Fault Modeling by Switch-Level Test Generation.",
                    "A Flexible Power Control Method for Right Power Testing of Scan-Based Logic BIST.",
                    "Structure-Based Methods for Selecting Fault-Detection-Strengthened FF under Multi-cycle Test with Sequential Observation.",
                    "Autonomous Testing for 3D-ICs with IEEE Std. 1687.",
                    "Die-to-Die Clock Skew Characterization and Tuning for 2.5D ICs.",
                    "Managing Reliability of Integrated Circuits: Lifetime Metering and Design for Healing.",
                    "Highly Dependable Multi-processor SoCs Employing Lifetime Prediction Based on Health Monitors.",
                    "Runtime NBTI Mitigation for Processor Lifespan Extension via Selective Node Control.",
                    "Modeling Residual Lifetime of an IC Considering Spatial and Inter-Temporal Temperature Variations.",
                    "Functional Diagnosis for Graceful Degradation of NoC Switches.",
                    "Novel Low Cost and Double Node Upset Tolerant Latch Design for Nanoscale CMOS Technology.",
                    "Quality Aware Error Detection in 2-D Separable Linear Transformation.",
                    "An Optical Interconnection Test Method Applicable to 100-Gb/s Transceivers Using an ATE Based Hardware.",
                    "An Ultra-High-Speed Test Module and FPGA-Based Development Platform.",
                    "Parametric Fault Detection in Analog Circuits: A Statistical Approach.",
                    "A Test Method for Finding Boundary Currents of 1T1R Memristor Memories.",
                    "Adaptive ECC Techniques for Yield and Reliability Enhancement of Flash Memories.",
                    "Evaluation Technique for Soft-Error Rate in Terrestrial Environment Utilizing Low-Energy Neutron Irradiation.",
                    "Aging-Leakage Tradeoffs Using Multi-Vth Cell Library.",
                    "Rejuvenation of NBTI-Impacted Processors Using Evolutionary Generation of Assembler Programs.",
                    "Combined Impact of BTI and Temperature Effect Inversion on Circuit Performance."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "24th Asian Test Symposium 2015",
        "info": "Mumbai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2015",
                "sub_name": "24th IEEE Asian Test Symposium, ATS 2015, Mumbai, India, November 22-25, 2015.",
                "count": 37,
                "papers": [
                    "Scan Chain Reordering-Aware X-Filling and Stitching for Scan Shift Power Reduction.",
                    "A Novel Scan Segmentation Design for Power Controllability and Reduction in At-Speed Test.",
                    "A Don't Care Filling Method to Reduce Capture Power Based on Correlation of FF Transitions.",
                    "TestExpress - New Time-Effective Scan-Based Deterministic Test Paradigm.",
                    "A New Scan Flip Flop Design to Eliminate Performance Penalty of Scan.",
                    "Detection of test Patterns with Unreachable States through Efficient Inductive-Invariant Identification.",
                    "A Test Generation Method for Data Paths Using Easily Testable Functional Time Expansion Models and Controller Augmentation.",
                    "SDC-TPG: A Deterministic Zero-Inflation Parallel Test Pattern Generator.",
                    "Integration of Hard Repair Techniques with ECC for Enhancing Fabrication Yield and Reliability of Embedded Memories.",
                    "A Lightweight Timing Channel Protection for Shared Memory Controllers.",
                    "On the Use of Assist Circuits for Improved Coupling Fault Detection in SRAMs.",
                    "Testing Inter-Word Coupling Faults of Wide I/O DRAMs.",
                    "Test Infrastructure Development and Test Scheduling of 3D-Stacked ICs under Resource and Power Constraints.",
                    "At-Speed Testing of Inter-Die Connections of 3D-SICs in the Presence of Shore Logic.",
                    "TWiN: A Turn-Guided Reliable Routing Scheme for Wireless 3D NoCs.",
                    "Securing IEEE 1687-2014 Standard Instrumentation Access by LFSR Key.",
                    "On Improving Transition Test Set Quality to Detect CMOS Transistor Stuck-Open Faults.",
                    "Logic/Clock-Path-Aware At-Speed Scan Test Generation for Avoiding False Capture Failures and Reducing Clock Stretch.",
                    "Optimized Selection of Frequencies for Faster-Than-at-Speed Test.",
                    "A Methodology for Identifying High Timing Variability Paths in Complex Designs.",
                    "Scan-Puf: Puf Elements Selection Methods for Viable IC Identification.",
                    "Challenge Engineering and Design of Analog Push Pull Amplifier Based Physically Unclonable Function for Hardware Security.",
                    "A Soft Error Resilient Low Leakage SRAM Cell Design.",
                    "Analysis of Soft Error Propagation Considering Masking Effects on Re-Convergent Path.",
                    "Diagnostic Tests and Diagnosis for Delay Faults Using Path Segmentation.",
                    "An Integrated Approach for Improving Compression and Diagnostic Properties of Test Sets.",
                    "Intermittent and Transient Fault Diagnosis on Sparse Code Signatures.",
                    "SHAKTI-F: A Fault Tolerant Microprocessor Architecture.",
                    "FPGA Implementation of High Speed Latency Optimized Optical Communication System Based on Orthogonal Concatenated Code.",
                    "Improved Methods for Accurate Safety Analysis of Real-Life Systems.",
                    "Fault Simulation and Test Pattern Generation for Cross-gate Defects in FinFET Circuits.",
                    "A Model Study of Defects and Faults in Embedded Spin Transfer Torque (STT) MRAM Arrays.",
                    "A Technique for Analyzing On-Chip Power Supply Impedance.",
                    "In-Circuit Mutation-Based Automatic Correction of Certain Design Errors Using SAT Mechanisms.",
                    "A New Approach for Minimal Environment Construction for Modular Property Verification.",
                    "On the testability of IEEE 1687 networks.",
                    "Design-for-testability in reversible logic circuits based on bit-swapping."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "23rd Asian Test Symposium 2014",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2014",
                "sub_name": "23rd IEEE Asian Test Symposium, ATS 2014, Hangzhou, China, November 16-19, 2014.",
                "count": 59,
                "papers": [
                    "BIST-Assisted Tuning Scheme for Minimizing IO-Channel Power of TSV-Based 3D DRAMs.",
                    "Dual-Speed TAM Optimization of 3D SoCs for Mid-bond and Post-bond Testing.",
                    "Optimized Pre-bond Test Methodology for Silicon Interposer Testing.",
                    "Design of a Radiation Hardened Latch for Low-Power Circuits.",
                    "Optimal Redundancy Designs for CNFET-Based Circuits.",
                    "A Heuristically Mechanical Model for Accurate and Fast Soft Error Analysis.",
                    "Error Resilient Real-Time State Variable Systems for Signal Processing and Control.",
                    "Variability and Soft-Error Resilience in Dependable VLSI Platform.",
                    "Adaptive Mitigation of Parameter Variations.",
                    "Reliability-Driven Pipelined Scan-Like Testing of Digital Microfluidic Biochips.",
                    "A Cost-Effective Stimulus Generator for Battery Channel Characterization in Electric Vehicles.",
                    "Generator for Test Set Construction of SMGF in Reversible Circuit by Boolean Difference Method.",
                    "High-Speed Serial Embedded Deterministic Test for System-on-Chip Designs.",
                    "A Scalable and Parallel Test Access Strategy for NoC-Based Multicore System.",
                    "On Covering Structural Defects in NoCs by Functional Tests.",
                    "Design, Verification, and Application of IEEE 1687.",
                    "Silicon Evaluation of Cell-Aware ATPG Tests and Small Delay Tests.",
                    "On Supporting Sequential Constraints for On-Chip Generation of Post-silicon Validation Stimuli.",
                    "Predicting IC Defect Level Using Diagnosis.",
                    "Testability-Driven Fault Sampling for Deterministic Test Coverage Estimation of Large Designs.",
                    "Methodology for Early RTL Testability and Coverage Analysis and Its Application to Industrial Designs.",
                    "Circuit Parameter Independent Test Pattern Generation for Interconnect Open Defects.",
                    "Built-In Scrambling Analysis for Yield Enhancement of Embedded Memories.",
                    "Intra-channel Reconfigurable Interface for TSV and Micro Bump Fault Tolerance in 3-D RAMs.",
                    "SRAM Array Yield Estimation under Spatially-Correlated Process Variation.",
                    "Temperature and Voltage Estimation Using Ring-Oscillator-Based Monitor for Field Test.",
                    "On-Line Transition-Time Monitoring for Die-to-Die Interconnects in 3D ICs.",
                    "A Novel Circuit for Transition-Edge Detection: Using a Stochastic Comparator Group to Test Transition-Edge.",
                    "Low Power Test Compression with Programmable Broadcast-Based Control.",
                    "Exploit Dynamic Voltage and Frequency Scaling for SoC Test Scheduling under Thermal Constraints.",
                    "High Quality Testing of Grid Style Power Gating.",
                    "A Resizing Method to Minimize Effects of Hardware Trojans.",
                    "High Resolution Pulse Propagation Driven Trojan Detection in Digital Logic: Optimization Algorithms and Infrastructure.",
                    "Physically-Aware Diagnostic Resolution.",
                    "On-Chip Implementation of an Integrator-Based Servo-Loop for ADC Static Linearity Test.",
                    "An ATE Based 32 Gbaud PAM-4 At-Speed Characterization and Testing Solution.",
                    "Testing of Non-volatile Logic-Based System Chips.",
                    "Dual-Purpose Mixed-Level Test Generation Using Swarm Intelligence.",
                    "Learning from Production Test Data: Correlation Exploration and Feature Engineering.",
                    "Perspectives on Test Data Mining from Industrial Experience.",
                    "Opportunities and Verification Challenges of Run-Time Performance Adaptation.",
                    "An On-Chip Digital Environment Monitor for Field Test.",
                    "On-Chip Monitoring for In-Place Diagnosis of Undesired Power Domain Problems in IC Chips.",
                    "An On-Line Timing Error Detection Method for Silicon Debug.",
                    "An All Digital Distributed Sensor Network Based Framework for Continuous Noise Monitoring and Timing Failure Analysis in SoCs.",
                    "On-Chip Delay Sensor for Environments with Large Temperature Fluctuations.",
                    "Timing Evaluation Tests for Scan Enable Signals with Application to TDF Testing.",
                    "FPGA-Based Subset Sum Delay Lines.",
                    "Parallel Path Delay Fault Simulation for Multi/Many-Core Processors with SIMD Units.",
                    "High Quality System Level Test and Diagnosis.",
                    "An Efficient Diagnosis Pattern Generation Procedure to Distinguish Stuck-at Faults and Bridging Faults.",
                    "On the Generation of Diagnostic Test Set for Intra-cell Defects.",
                    "Diagnosing Cell Internal Defects Using Analog Simulation-Based Fault Models.",
                    "Improving Output Compaction Efficiency with High Observability Scan Chains.",
                    "Two-Step Dynamic Encoding for Linear Decompressors.",
                    "A Case Study on Implementing Compressed DFT Architecture.",
                    "Leveraging Emerging Technology for Hardware Security - Case Study on Silicon Nanowire FETs and Graphene SymFETs.",
                    "Advanced Analysis of Cell Stability for Reliable SRAM PUFs.",
                    "On the Use of Scan Chain to Improve Physical Attacks (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "22nd Asian Test Symposium 2013",
        "info": "Yilan County, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2013",
                "sub_name": "22nd Asian Test Symposium, ATS 2013, Yilan County, Taiwan, November 18-21, 2013.",
                "count": 54,
                "papers": [
                    "Exploration Methodology for 3D Memory Redundancy Architectures under Redundancy Constraints.",
                    "A TSV Repair Scheme Using Enhanced Test Access Architecture for 3-D ICs.",
                    "Testable Design for Electrical Testing of Open Defects at Interconnects in 3D ICs.",
                    "On Achieving Capture Power Safety in At-Speed Scan-Based Logic BIST.",
                    "Thermal Aware Don't Care Filling to Reduce Peak Temperature and Thermal Variance during Testing.",
                    "Peak Capture Power Reduction for Compact Test Sets Using Opt-Justification-Fill.",
                    "Worst-Case Critical-Path Delay Analysis Considering Power-Supply Noise.",
                    "Test Generation of Path Delay Faults Induced by Defects in Power TSV.",
                    "Multicycle-aware At-speed Test Methodology.",
                    "Analog Sensor Based Testing of Phase-Locked Loop Dynamic Performance Parameters.",
                    "Built-In Test of Switched-Mode Power Converters: Avoiding DUT Damage Using Alternative Safe Measurements.",
                    "Design of a Fault-Injectable Fleischer-Laker Switched-Capacitor Biquad for Verifying the Static Linear Behavior Fault Model.",
                    "Failure Localization of Logic Circuits Using Voltage Contrast Considering State of Transistors.",
                    "Handling Missing Syndromes in Board-Level Functional-Fault Diagnosis.",
                    "Diagnosing Resistive Open Faults Using Small Delay Fault Simulation.",
                    "A Transient Fault Tolerant Test Pattern Generator for On-line Built-in Self-Test.",
                    "Leakage Monitoring Technique in Near-Threshold Systems with a Time-Based Bootstrapped Ring Oscillator.",
                    "A New LFSR Reseeding Scheme via Internal Response Feedback.",
                    "Scan Test Data Volume Reduction for SoC Designs in EDT Environment.",
                    "Automotive EEPROM Qualification and Cost Optimization.",
                    "Cost-Effective TAP-Controlled Serialized Compressed Scan Architecture for 3D Stacked ICs.",
                    "Adaptive Source Bias for Improved Resistive-Open Defect Coverage during SRAM Testing.",
                    "A New March Test for Process-Variation Induced Delay Faults in SRAMs.",
                    "Back-End-of-Line Defect Analysis for Rnv8T Nonvolatile SRAM.",
                    "Digital Calibration for 8-Bit Delay Line ADC Using Harmonic Distortion Correction.",
                    "Digital Compensation for Timing Mismatches in Interleaved ADCs.",
                    "An Analysis of Stochastic Self-Calibration of TDC Using Two Ring Oscillators.",
                    "Post-bond Testing of the Silicon Interposer and Micro-bumps in 2.5D ICs.",
                    "Mid-bond Interposer Wire Test.",
                    "A Layout-Aware Test Methodology for Silicon Interposer in System-in-a-Package.",
                    "Formulating Optimal Test Scheduling Problem with Dynamic Voltage and Frequency Scaling.",
                    "Search Space Reduction for Low-Power Test Generation.",
                    "MIRID: Mixed-Mode IR-Drop Induced Delay Simulator.",
                    "A Stochastic Model for NBTI-Induced LSI Degradation in Field.",
                    "Hazard Initialized LOC Tests for TDF Undetectable CMOS Open Defects.",
                    "Single Test Clock with Programmable Clock Enable Constraints for Multi-clock Domain SoC ATPG Testing.",
                    "On the Generation of Compact Deterministic Test Sets for BIST Ready Designs.",
                    "A Cost-Effective Scheme for Network-on-Chip Router and Interconnect Testing.",
                    "Multi-histogram ADC BIST System for ADC Linearity Testing.",
                    "Fault Scrambling Techniques for Yield Enhancement of Embedded Memories.",
                    "Testing Disturbance Faults in Various NAND Flash Memories.",
                    "An Efficient Method for the Test of Embedded Memory Cores during the Operational Phase.",
                    "Functional Test Generation at the RTL Using Swarm Intelligence and Bounded Model Checking.",
                    "Path Constraint Solving Based Test Generation for Hard-to-Reach States.",
                    "Accurate Multi-cycle ATPG in Presence of X-Values.",
                    "Interplay of Failure Rate, Performance, and Test Cost in TCAM under Process Variations.",
                    "Critical Paths Selection and Test Cost Reduction Considering Process Variations.",
                    "A Region-Based Framework for Design Feature Identification of Systematic Process Variations.",
                    "An Active Test Fixture Approach for 40 Gbps and Above At-Speed Testing Using a Standard ATE System.",
                    "Enhanced Resolution Time-Domain Reflectometry for High Speed Channels: Characterizing Spatial Discontinuities with Non-ideal Stimulus.",
                    "Time Domain Reconstruction of Incoherently Undersampled Periodic Waveforms Using Bandwidth Interleaving.",
                    "An Efficient Test Methodology for Image Processing Applications Based on Error-Tolerance.",
                    "Securing Access to Reconfigurable Scan Networks.",
                    "A Die Selection and Matching Method with Two Stages for Yield Enhancement of 3-D Memories."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "21st Asian Test Symposium 2012",
        "info": "Niigata, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2012",
                "sub_name": "21st IEEE Asian Test Symposium, ATS 2012, Niigata, Japan, November 19-22, 2012.",
                "count": 73,
                "papers": [
                    "An Effective At-Speed Scan Testing Approach Using Multiple-Timing Clock Waveforms.",
                    "LBIST/ATPG Technologies for On-Demand Digital Logic Testing in Automotive Circuits.",
                    "Portable/Desktop Testing Solution for Engineering with Cloud.",
                    "Characteristics Variability Evaluation of Actual LSI Transistors with Nanoprobing.",
                    "F-matrix (ABCD-matrix) Circuit Simulation Built in IC Test Program.",
                    "Addressing Test Challenges in Advanced Technology Nodes.",
                    "Diagnosis of Cell Internal Defects with Multi-cycle Test Patterns.",
                    "Automated Post-Silicon Debugging of Failing Speedpaths.",
                    "SAT-Based Automatic Rectification and Debugging of Combinational Circuits with LUT Insertions.",
                    "A New Look Ahead Technique for Customized Testing in Digital Microfluidic Biochips.",
                    "TSV Stress-Aware ATPG for 3D Stacked ICs.",
                    "Linear Programming Formulations for Thermal-Aware Test Scheduling of 3D-Stacked Integrated Circuits.",
                    "Programmable Leakage Test and Binning for TSVs.",
                    "Session Summary I: Quantum informatics: Classical circuit synthesis, resource optimisation and benchmarking.",
                    "Counting Gates, Moving Qubits: Evaluating the Execution Cost of Quantum Circuits.",
                    "Programming a Topological Quantum Computer.",
                    "An Optimization Problem for Topological Quantum Computation.",
                    "Session Summary II: Dependable VLSI for Product Reliability.",
                    "Soft Error Issues with Scaling Technologies.",
                    "In-Field Testing of NAND Flash Storage: Why and How?",
                    "A Few Design Techniques for the \"Dependability\" of a SOC.",
                    "Accessing Embedded DfT Instruments with IEEE P1687.",
                    "Multi-level EDT to Reduce Scan Channels in SoC Designs.",
                    "On Utilizing Test Cube Properties to Reduce Test Data Volume Further.",
                    "Note on Layout-Aware Weighted Probabilistic Bridge Fault Coverage.",
                    "Tailoring Tests for Functional Binning of Integrated Circuits.",
                    "A Thermal-Driven Test Application Scheme for 3-Dimensional ICs.",
                    "A Transition Isolation Scan Cell Design for Low Shift and Capture Power.",
                    "A Probabilistic and Constraint Based Approach for Low Power Test Generation.",
                    "Dual Edge Triggered Flip-Flops for Noise Blocking and Application to Signal Delay Detection.",
                    "Impact of Resistive-Bridge Defects in TAS-MRAM Architectures.",
                    "SoftPCM: Enhancing Energy Efficiency and Lifetime of Phase Change Memory in Video Applications via Approximate Write.",
                    "A Generalized Theory for Formal Assertion Coverage.",
                    "Error Model Free Automatic Design Error Correction of Complex Processors Using Formal Methods.",
                    "Hardware-Accelerated Workload Characterization for Power Modeling and Fault Injection.",
                    "Scan Test Power Simulation on GPGPUs.",
                    "Power Supply Noise Sensor Based on Timing Uncertainty Measurements.",
                    "Peak Power Estimation: A Case Study on CPU Cores.",
                    "Low Power BIST for Scan-Shift and Capture Power.",
                    "Two-Tone Signal Generation for Communication Application ADC Testing.",
                    "A New Procedure for Measuring High-Accuracy Probability Density Functions.",
                    "Design of a High Bandwidth Interposer for Performance Evaluation of ATE Test Fixtures at the DUT Socket.",
                    "Spectral Estimation Based Acquisition of Incoherently Under-sampled Periodic Signals: Application to Bandwidth Interleaving.",
                    "Adaptive Board-Level Functional Fault Diagnosis Using Decision Trees.",
                    "Board-Level Functional Fault Diagnosis Using Learning Based on Incremental Support-Vector Machines.",
                    "Reuse of Structural Volume Test Methods for In-System Testing of Automotive ASICs.",
                    "Session Summary III: Power-Aware Testing: Present and Future.",
                    "Why and How Controlling Power Consumption during Test: A Survey.",
                    "PowerMAX: Fast Power Analysis during Test.",
                    "Current and Future Directions in Automatic Test Pattern Generation for Power Delivery Network Validation.",
                    "Power Supply Droop and Its Impacts on Structural At-Speed Testing.",
                    "Session Summary IV: Post-Silicon Measurements and Tests: Analog Test and High-Speed I/O Test II.",
                    "A Test Screening Method for 28 nm HK/MG Single-Port and Dual-Port SRAMs Considering with Dynamic Stability and Read/Write Disturb Issues.",
                    "Impact of All-Digital PLL on SoC Testing.",
                    "Post-Silicon Jitter Measurements.",
                    "An Active Test Fixture Approach for Testing 28 Gbps Applications Using a Lower Data Rate ATE System.",
                    "Session Summary V: Is Component Interconnection Test Enough for Board or System Test.",
                    "Embedded Tutorial Summary: Diagnosis for Accelerating Yield and Failure Analysis.",
                    "A Scan-Out Power Reduction Method for Multi-cycle BIST.",
                    "A Test-Per-Clock LFSR Reseeding Algorithm for Concurrent Reduction on Test Sequence Length and Test Data Volume.",
                    "A Built-In Characterization Technique for 1-Bit/Stage Pipelined ADC.",
                    "Robust Timing-Aware Test Generation Using Pseudo-Boolean Optimization.",
                    "Functional Pattern Generation for Asynchronous Designs in a Test Processor Environment.",
                    "Reduced-Complexity Transition-Fault Test Generation for Non-scan Circuits through High-Level Mutant Injection.",
                    "Scrambling and Data Inversion Techniques for Yield Enhancement of NROM-Based ROMs.",
                    "A Hybrid Flow for Memory Failure Bitmap Classification.",
                    "Test Cost Reduction for Performance Yield Recovery by Classification of Multiple-Clock Test Data.",
                    "NoC Dynamically Reconfigurable as TAM.",
                    "On-Line Error Detection in Digital Microfluidic Biochips.",
                    "Automatic Test Program Generation for Out-of-Order Superscalar Processors.",
                    "Variation-Aware Fault Grading.",
                    "On-Chip Detection of Process Shift and Process Spread for Silicon Debugging and Model-Hardware Correlation.",
                    "Efficient Trojan Detection via Calibration of Process Variations."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "20th Asian Test Symposium 2011",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2011",
                "sub_name": "Proceedings of the 20th IEEE Asian Test Symposium, ATS 2011, New Delhi, India, November 20-23, 2011.",
                "count": 92,
                "papers": [
                    "On Detecting Transition Faults in the Presence of Clock Delay Faults.",
                    "Testing of Clock-Domain Crossing Faults in Multi-core System-on-Chip.",
                    "On-Chip Programmable Dual-Capture for Double Data Rate Interface Timing Test.",
                    "Time Domain Characterization and Test of High Speed Signals Using Incoherent Sub-sampling.",
                    "Temperature Dependent Test Scheduling for Multi-core System-on-Chip.",
                    "Test Scheduling for Multicore SoCs with Dynamic Voltage Scaling and Multiple Voltage Islands.",
                    "Selective Test Response Collection for Low-Power Scan Testing with Well-Compressed Test Data.",
                    "Low Power Test-Compression for High Test-Quality and Low Test-Data Volume.",
                    "Multi-cycle Test with Partial Observation on Scan-Based BIST Structure.",
                    "SSTKR: Secure and Testable Scan Design through Test Key Randomization.",
                    "An Innovative Methodology for Scan Chain Insertion and Analysis at RTL.",
                    "Adaptation of Standard RT Level BIST Architectures for System Level Communication Testing.",
                    "Rewind-Support for Peak Capture Power Reduction in Launch-Off-Shift Testing.",
                    "Low Power Decompressor and PRPG with Constant Value Broadcast.",
                    "Effective Launch-to-Capture Power Reduction for LOS Scheme with Adjacent-Probability-Based X-Filling.",
                    "Virtual Circuit Model for Low Power Scan Testing in Linear Decompressor-Based Compression Environment.",
                    "Test Pattern Selection for Defect-Aware Test.",
                    "Efficient SAT-Based Search for Longest Sensitisable Paths.",
                    "Mapping Transaction Level Faults to Stuck-At Faults in Communication Hardware.",
                    "On Generation of 1-Detect TDF Pattern Set with Significantly Increased SDD Coverage.",
                    "Yield-per-Area Optimization for 6T-SRAMs Using an Integrated Approach to Exploit Spares and ECC to Efficiently Combat High Defect and Soft-Error Rates.",
                    "A Hybrid Fault Tolerant Architecture for Robustness Improvement of Digital Circuits.",
                    "A New Architecture to Cross-Fertilize On-Line and Manufacturing Testing.",
                    "Online Test Macro Scheduling and Assignment in MPSoC Design.",
                    "Distributed Comparison Test Driven Multiprocessor Speed-Tuning: Targeting Performance Gains under Extreme Process Variations.",
                    "An Online Mechanism to Verify Datapath Execution Using Existing Resources in Chip Multiprocessors.",
                    "An Efficient 2-Phase Strategy to Achieve High Branch Coverage.",
                    "Soft Error Recovery Technique for Multiprocessor SOPC.",
                    "Wrapper Chain Design for Testing TSVs Minimization in Circuit-Partitioned 3D SoC.",
                    "Identification of Defective TSVs in Pre-Bond Testing of 3D ICs.",
                    "A Unified Interconnects Testing Scheme for 3D Integrated Circuits.",
                    "Cost-Effective TSV Grouping for Yield Improvement of 3D-ICs.",
                    "Improved Fault Diagnosis for Reversible Circuits.",
                    "Embedded Test for Highly Accurate Defect Localization.",
                    "On Using Design Partitioning to Reduce Diagnosis Memory Footprint.",
                    "Exploring Impact of Faults on Branch Predictors' Power for Diagnosis of Faulty Module.",
                    "Post-Silicon Timing Validation Method Using Path Delay Measurements.",
                    "Backward Reasoning with Formal Properties: A Methodology for Bug Isolation on Simulation Traces.",
                    "Design of a Test Processor for Asynchronous Chip Test.",
                    "On Generating Vectors for Accurate Post-Silicon Delay Characterization.",
                    "Predicting Scan Compression IP Configurations for Better QoR.",
                    "Low Test Data Volume Low Power At-Speed Delay Tests Using Clock-Gating.",
                    "Test Compression Based on Lossy Image Encoding.",
                    "Multiscan-based Test Data Compression Using UBI Dictionary and Bitmask.",
                    "Diagnostic Test of Robust Circuits.",
                    "An Accurate Timing-Aware Diagnosis Algorithm for Multiple Small Delay Defects.",
                    "Diagnosis of Multiple Scan-Chain Faults in the Presence of System Logic Defects.",
                    "Diagnosing Multiple Slow Gates for Performance Tuning in the Face of Extreme Process Variations.",
                    "A Process Monitor Based Speed Binning and Die Matching Algorithm.",
                    "Optimized Test Error Detection by Probabilistic Retest Recommendation Models.",
                    "Adaptive Test Framework for Achieving Target Test Quality at Minimal Cost.",
                    "A Fault Criticality Evaluation Framework of Digital Systems for Error Tolerant Video Applications.",
                    "Efficient Use of Unused Spare Columns to Improve Memory Error Correcting Rate.",
                    "New Fault Detection Algorithm for Multi-level Cell Flash Memroies.",
                    "A New Test Paradigm for Semiconductor Memories in the Nano-Era.",
                    "On Defect Oriented Testing for Hybrid CMOS/Memristor Memory.",
                    "Improving the Accuracy of RF Alternate Test Using Multi-VDD Conditions: Application to Envelope-Based Test of LNAs.",
                    "On Replacing an RF Test with an Alternative Measurement: Theory and a Case Study.",
                    "Test and Diagnosis of Analog Circuits Using Moment Generating Functions.",
                    "Mixed-Signal Fault Equivalence: Search and Evaluation.",
                    "Efficient BDD-based Fault Simulation in Presence of Unknown Values.",
                    "Analysis of Resistive Bridge Defect Delay Behavior in the Presence of Process Variation.",
                    "Automation of 3D-DfT Insertion.",
                    "MarciaTesta: An Automatic Generator of Test Programs for Microprocessors' Data Caches.",
                    "Testing for Parasitic Memory Effect in SRAMs.",
                    "Transient Noise Failures in SRAM Cells: Dynamic Noise Margin Metric.",
                    "Fault Diagnosis in Memory BIST Environment with Non-march Tests.",
                    "Characterizing Pattern Dependent Delay Effects in DDR Memory Interfaces.",
                    "Breaking the Test Application Time Barriers in Compression: Adaptive Scan-Cyclical (AS-C).",
                    "Exploiting Free LUT Entries to Mitigate Soft Errors in SRAM-based FPGAs.",
                    "A Single-Configuration Method for Application-Dependent Testing of SRAM-based FPGA Interconnects.",
                    "Multi-visit TAMs to Reduce the Post-Bond Test Length of 2.5D-SICs with a Passive Silicon Interposer Base.",
                    "Physical-Aware Memory BIST Datapath Synthesis: Architecture and Case-Studies on Complex SoCs.",
                    "Failure Analysis and Test Solutions for Low-Power SRAMs.",
                    "A Robust Solution for Embedded Memory Test and Repair.",
                    "Nand Flash Memory - Product Trends, Technology Overview, and Technical Challenges.",
                    "High Level Verification and Its Use at Pos-Silicon Debugging and Patching.",
                    "3D Specific Systems: Design and CAD.",
                    "Testing and Design-for-Testability Techniques for 3D Integrated Circuits.",
                    "Yield Improvement and Test Cost Optimization for 3D Stacked ICs.",
                    "Integrated Design & Test: Conquering the Conflicting Requirements of Low-Power, Variation-Tolerance and Test Cost.",
                    "Dependable VLSI Program in Japan: Program Overview and the Current Status of Dependable VLSI Platform Project.",
                    "Reliability: A Cross-Disciplinary and Cross-Layer Approach.",
                    "Underdesigned and Opportunistic Computing.",
                    "Power Aware Shift and Capture ATPG Methodology for Low Power Designs.",
                    "Power-Aware Test Pattern Generation for At-Speed LOS Testing.",
                    "Power Aware Embedded Test.",
                    "Testability of Cryptographic Hardware and Detection of Hardware Trojans.",
                    "Test Scheduling in an IEEE P1687 Environment with Resource and Power Constraints.",
                    "Automatic SoC Level Test Path Synthesis Based on Partial Functional Models.",
                    "A Boundary Scan Circuit with Time-to-Digital Converter for Delay Testing.",
                    "Burst-Mode Transmission and Data Recovery for Multi-GHz Optical Packet Switching Network Testing."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "19th Asian Test Symposium 2010",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2010",
                "sub_name": "Proceedings of the 19th IEEE Asian Test Symposium, ATS 2010, 1-4 December 2010, Shanghai, China.",
                "count": 74,
                "papers": [
                    "Efficient Simulation of Structural Faults for the Reliability Evaluation at System-Level.",
                    "Jitter Characterization of Pseudo-random Bit Sequences Using Incoherent Sub-sampling.",
                    "FSimGP^2: An Efficient Fault Simulator with GPGPU.",
                    "A Quasi-best Random Testing.",
                    "Testing of Low-Cost Digital Microfluidic Biochips with Non-regular Array Layouts.",
                    "Derivation of Optimal Test Set for Detection of Multiple Missing-Gate Faults in Reversible Circuits.",
                    "On Determining the Real Output Xs by SAT-Based Reasoning.",
                    "On Selection of Testable Paths with Specified Lengths for Faster-Than-At-Speed Testing.",
                    "Test Pattern Selection and Compaction for Sequential Circuits in an HDL Environment.",
                    "Tackling the Path Explosion Problem in Symbolic Execution-Driven Test Generation for Programs.",
                    "A Reliability Model for Object-Oriented Software.",
                    "A New Approach to Generating High Quality Test Cases.",
                    "A Study on Software Reliability Prediction Based on Transduction Inference.",
                    "Formula-Oriented Compositional Minimization in Model Checking.",
                    "Variation-Aware Fault Modeling.",
                    "Diagnosis of Multiple Physical Defects Using Logic Fault Models.",
                    "A Memory Fault Simulator for Radiation-Induced Effects in SRAMs.",
                    "On Soft Error Immunity of Sequential Circuits.",
                    "Testing of Digital Microfluidic Biochips Using Improved Eulerization Techniques and the Chinese Postman Problem.",
                    "P^(2)CLRAF: An Pre- and Post-Silicon Cooperated Circuit Lifetime Reliability Analysis Framework.",
                    "A Low Cost Built-In Self-Test Circuit for High-Speed Source Synchronous Memory Interfaces.",
                    "A Complete Logic BIST Technology with No Storage Requirement.",
                    "Built-In Self-Test for Capacitive MEMS Using a Charge Control Technique.",
                    "Defect Coverage-Driven Window-Based Test Compression.",
                    "Controlling Peak Power Consumption for Scan Based Multiple Weighted Random BIST.",
                    "Parallel LFSR Reseeding with Selection Register for Mixed-Mode BIST.",
                    "Efficient Embedding of Deterministic Test Data.",
                    "Test Data Reduction for BIST-Aided Scan Test Using Compatible Flip-Flops and Shifting Inverter Code.",
                    "On-chip Jitter Measurement Using Vernier Ring Time-to-Digital Converter.",
                    "Pattern Encodability Enhancements for Test Stimulus Decompressors.",
                    "High Performance Compaction for Test Responses with Many Unknowns.",
                    "Design-for-Test of Digitally-Assisted Analog IPs for Automotive SoCs.",
                    "Substantial Fault Pair At-a-Time (SFPAT): An Automatic Diagnostic Pattern Generation Method.",
                    "D-Scale: A Scalable System-Level Dependable Method for MPSoCs.",
                    "Bipartite Full Scan Design: A DFT Method for Asynchronous Circuits.",
                    "XOR-Based Response Compactor Adaptive to X-Density Variation.",
                    "DFT + DFD: An Integrated Method for Design for Testability and Diagnosability.",
                    "Accelerating Strategy for Functional Test of NoC Communication Fabric.",
                    "HYPERA: High-Yield Performance-Efficient Redundancy Analysis.",
                    "A Comprehensive System-on-Chip Logic Diagnosis.",
                    "On Signal Tracing for Debugging Speedpath-Related Electrical Errors in Post-Silicon Validation.",
                    "HYPER: A Heuristic for Yield/Area imProvEment Using Redundancy in SoC.",
                    "Enhance Profiling-Based Scan Chain Diagnosis by Pattern Masking.",
                    "Maximal Resilience for Reliability and Yield Enhancement in Interconnect Structure.",
                    "At-speed Test of High-Speed DUT Using Built-Off Test Interface.",
                    "Rapid Radio Frequency Amplitude and Phase Distortion Measurement Using Amplitude Modulated Stimulus.",
                    "Digitally Assisted Concurrent Built-In Tuning of RF Systems Using Hamming Distance Proportional Signatures.",
                    "The Test Ability of an Adaptive Pulse Wave for ADC Testing.",
                    "Bayesian Fault Diagnosis of RF Circuits Using Nonparametric Density Estimation.",
                    "Power-Safe Application of Transition Delay Fault Patterns Considering Current Limit during Wafer Test.",
                    "Circuit Topology-Based Test Pattern Generation for Small-Delay Defects.",
                    "Seed Ordering and Selection for High Quality Delay Test.",
                    "An Efficient Algorithm for Finding a Universal Set of Testable Long Paths.",
                    "Distinguishing Resistive Small Delay Defects from Random Parameter Variations.",
                    "A Noise-Aware Hybrid Method for SDD Pattern Grading and Selection.",
                    "Thermal Safe High Level Test Synthesis for Hierarchical Testability.",
                    "A Low Area On-chip Delay Measurement System Using Embedded Delay Measurement Circuit.",
                    "On Bias in Transition Coverage of Test Sets for Path Delay Faults.",
                    "Adaptive Low Shift Power Test Pattern Generator for Logic BIST.",
                    "Power Supply Noise Reduction in Broadcast-Based Compression Environment for At-speed Scan Testing.",
                    "Modified Scan Flip-Flop for Low Power Testing.",
                    "Capture in Turn Scan for Reduction of Test Data Volume, Test Application Time and Test Power.",
                    "A Test Integration Methodology for 3D Integrated Circuits.",
                    "Performance Characterization of TSV in 3D IC via Sensitivity Analysis.",
                    "Temperature-Aware SoC Test Scheduling Considering Inter-Chip Process Variation.",
                    "Particle Swarm Optimization Based Scheme for Low Power March Sequence Generation for Memory Testing.",
                    "New Microcode's Generation Technique for Programmable Memory Built-In Self Test.",
                    "Software-Based Self-Testing of Processors Using Expanded Instructions.",
                    "Mimicking of Functional State Space with Structural Tests for the Diagnosis of Board-Level Functional Failures.",
                    "Optimization and Selection of Diagnosis-Oriented Fault-Insertion Points for System Test.",
                    "Test Cost Analysis for 3D Die-to-Wafer Stacking.",
                    "Mining Complex Boolean Expressions for Sequential Equivalence Checking.",
                    "On-the-Fly Reduction of Stimuli for Functional Verification.",
                    "Test Time Analysis for IEEE P1687."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "18th Asian Test Symposium 2009",
        "info": "Taichung, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2009",
                "sub_name": "Proceedings of the Eighteentgh Asian Test Symposium, ATS 2009, 23-26 November 2009, Taichung, Taiwan.",
                "count": 76,
                "papers": [
                    "CA Based Built-In Self-Test Structure for SoC.",
                    "A Random Jitter RMS Estimation Technique for BIST Applications.",
                    "A Novel Seed Selection Algorithm for Test Time Reduction in BIST.",
                    "Logic BIST Architecture for System-Level Test and Diagnosis.",
                    "Fault Diagnosis under Transparent-Scan.",
                    "Scan Chain Diagnosis by Adaptive Signal Profiling with Manufacturing ATPG Patterns.",
                    "On Improving Diagnostic Test Generation for Scan Chain Failures.",
                    "On Scan Chain Diagnosis for Intermittent Faults.",
                    "Design-for-Test Circuit for the Reduced Code Based Linearity Test Method in Pipelined ADCs with Digital Error Correction Technique.",
                    "Multi-tone Testing of Linear and Nonlinear Analog Circuits Using Polynomial Coefficients.",
                    "Low Cost Dynamic Test Methodology for High Precision ΣD ADCs.",
                    "Very-Low-Voltage Testing of Amorphous Silicon TFT Circuits.",
                    "Scan Compression Implementation in Industrial Design - Case Study.",
                    "Calibration as a Functional Test: An ADC Case Study.",
                    "Customized Algorithms for High Performance Memory Test in Advanced Technology Node.",
                    "A Practical DFT Approach for Complex Low Power Designs.",
                    "DFT Challenges in Next Generation Multi-media IP.",
                    "Yield Ramp up by Scan Chain Diagnosis.",
                    "CAT: A Critical-Area-Targeted Test Set Modification Scheme for Reducing Launch Switching Activity in At-Speed Scan Testing.",
                    "New Scheme of Reducing Shift and Capture Power Using the X-Filling Methodology.",
                    "Deterministic Built-In Self-Test Using Multiple Linear Feedback Shift Registers for Low-Power Scan Testing.",
                    "Low Overhead Time-Multiplexed Online Checking: A Case Study of An H.264 Decoder.",
                    "A FPGA-Based Reconfigurable Software Architecture for Highly Dependable Systems.",
                    "Using Non-trivial Logic Implications for Trace Buffer-Based Silicon Debug.",
                    "A Post-Silicon Debug Support Using High-Level Design Description.",
                    "A Low Overhead On-Chip Path Delay Measurement Circuit.",
                    "An Adaptive Test for Parametric Faults Based on Statistical Timing Information.",
                    "A Delay Measurement Technique Using Signature Registers.",
                    "Functional Built-In Delay Binning and Calibration Mechanism for On-Chip at-Speed Self Test.",
                    "A Practical Approach to Threshold Test Generation for Error Tolerant Circuits.",
                    "Speeding up SAT-Based ATPG Using Dynamic Clause Activation.",
                    "N-distinguishing Tests for Enhanced Defect Diagnosis.",
                    "Dynamic Compaction in SAT-Based ATPG.",
                    "SIRUP: Switch Insertion in RedUndant Pipeline Structures for Yield and Yield/Area Improvement.",
                    "Transaction Level Modeling and Design Space Exploration for SOC Test Architectures.",
                    "Efficient Software-Based Self-Test Methods for Embedded Digital Signal Processors.",
                    "Is Low Power Testing Necessary? What does the Test Industry Truly Need?.",
                    "A Scalable Scan Architecture for Godson-3 Multicore Microprocessor.",
                    "Kiss the Scan Goodbye: A Non-scan Architecture for High Coverage, Low Test Data Volume and Low Test Application Time.",
                    "Multiple Scan Trees Synthesis for Test Time/Data and Routing Length Reduction under Output Constraint.",
                    "Leveraging Partially Enhanced Scan for Improved Observability in Delay Fault Testing.",
                    "BIST Driven Power Conscious Post-Manufacture Tuning of Wireless Transceiver Systems Using Hardware-Iterated Gradient Search.",
                    "Self-Calibrating Embedded RF Down-Conversion Mixers.",
                    "A BIST Solution for the Functional Characterization of RF Systems Based on Envelope Response Analysis.",
                    "Exploiting Zero-Crossing for the Analysis of FM Modulated Analog/RF Signals Using Digital ATE.",
                    "IEEE 1500 Compatible Interconnect Test with Maximal Test Concurrency.",
                    "Multiple-Core under Test Architecture for HOY Wireless Testing Platform.",
                    "Partition Based SoC Test Scheduling with Thermal and Power Constraints under Deep Submicron Technologies.",
                    "Test Integration for SOC Supporting Very Low-Cost Testers.",
                    "Why is Conventional ATPG Not Sufficient for Advanced Low Power Designs?.",
                    "New Class of Tests for Open Faults with Considering Adjacent Lines.",
                    "Test Pattern Selection and Customization Targeting Reduced Dynamic and Leakage Power Consumption.",
                    "Deterministic Algorithms for ATPG under Leakage Constraints.",
                    "Extended Selective Encoding of Scan Slices for Reducing Test Data and Test Power.",
                    "A Multi-dimensional Pattern Run-Length Method for Test Data Compression.",
                    "Bit-Operation-Based Seed Augmentation for LFSR Reseeding with High Defect Coverage.",
                    "Testing Embedded Memories in the Nano-Era: Will the Existing Approaches Survive?.",
                    "A Non-Intrusive and Accurate Inspection Method for Segment Delay Variabilities.",
                    "Bridging Fault Diagnosis to Identify the Layer of Systematic Defects.",
                    "Delay Fault Diagnosis in Sequential Circuits.",
                    "A Partially-Exhaustive Gate Transition Fault Model.",
                    "An On-Chip Integrator Leakage Characterization Technique and Its Application to Switched Capacitor Circuits Testing.",
                    "LFSR-Based Performance Characterization of Nonlinear Analog and Mixed-Signal Circuits.",
                    "A Jitter Characterizing BIST with Pulse-Amplifying Technique.",
                    "A Low-Cost Output Response Analyzer for the Built-in-Self-Test S-? Modulator Based on the Controlled Sine Wave Fitting Method.",
                    "New Algorithms for Address Decoder Delay Faults and Bit Line Imbalance Faults.",
                    "Testability Exploration of 3-D RAMs and CAMs.",
                    "Fault Diagnosis Using Test Primitives in Random Access Memories.",
                    "Test Generation for Designs with On-Chip Clock Generators.",
                    "On the Generation of Functional Test Programs for the Cache Replacement Logic.",
                    "Compact Test Generation for Small-Delay Defects Using Testable-Path Information.",
                    "At-Speed Scan Test Method for the Timing Optimization and Calibration.",
                    "M-IVC: Using Multiple Input Vectors to Minimize Aging-Induced Delay.",
                    "Analysis of Resistive Bridging Defects in a Synchronizer.",
                    "On-Chip TSV Testing for 3D IC before Bonding Using Sense Amplification.",
                    "Test Pattern Selection for Potentially Harmful Open Defects in Power Distribution Networks."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "17th Asian Test Symposium 2008",
        "info": "Sapporo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2008",
                "sub_name": "17th IEEE Asian Test Symposium, ATS 2008, Sapporo, Japan, November 24-27, 2008.",
                "count": 78,
                "papers": [
                    "Not All Xs are Bad for Scan Compression.",
                    "Evaluation of Entropy Driven Compression Bounds on Industrial Designs.",
                    "Untestable Fault Identification in Sequential Circuits Using Model-Checking.",
                    "A Test Generation Method for State-Observable FSMs to Increase Defect Coverage under the Test Length Constraint.",
                    "LIFTING: A Flexible Open-Source Fault Simulator.",
                    "Digitally-Assisted Analog/RF Testing for Mixed-Signal SoCs.",
                    "Low-Cost One-Port Approach for Testing Integrated RF Substrates.",
                    "Efficient Low-Cost Testing of Wireless OFDM Polar Transceiver Systems.",
                    "Interconnect-Driven Layout-Aware Multiple Scan Tree Synthesis for Test Time, Data Compression and Routing Optimization.",
                    "Sequential Circuit BIST Synthesis Using Spectrum and Noise from ATPG Patterns.",
                    "A Novel BIST Scheme Using Test Vectors Applied by Circuit-under-Test Itself.",
                    "XPDF-ATPG: An Efficient Test Pattern Generation for Crosstalk-Induced Faults.",
                    "A Multi-valued Algebra for Capacitance Induced Crosstalk Delay Faults.",
                    "Increasing Defect Coverage by Generating Test Vectors for Stuck-Open Faults.",
                    "Technique to Improve the Performance of Time-Interleaved A-D Converters with Mismatches of Non-linearity.",
                    "A Reduced Code Linearity Test Method for Pipelined A/D Converters.",
                    "Testing LCD Source Driver IC with Built-on-Scribe-Line Test Circuitry.",
                    "Identifying Non-Robust Untestable RTL Paths in Circuits with Multi-cycle Paths.",
                    "High Quality Pattern Generation for Delay Defects with Functional Sensitized Paths.",
                    "Refining Delay Test Methodology Using Knowledge of Asymmetric Transition Delay.",
                    "Effects of Advances in Analog, Mixed Signal and IO Circuits on Test Strategies.",
                    "Electrical Overstress Prevention & Test Best Practices.",
                    "Low Distortion Sine Waveform Generation by an AWG.",
                    "An Effective Hybrid Test Data Compression Method Using Scan Chain Compaction and Dictionary-Based Scheme.",
                    "Optimizing Test Data Volume Using Hybrid Compression.",
                    "Cost Efficient Methods to Improve Performance of Broadcast Scan.",
                    "Hyperactive Faults Dictionary to Increase Diagnosis Throughput.",
                    "Enhancing Transition Fault Model for Delay Defect Diagnosis.",
                    "Observation Point Oriented Deterministic Diagnosis Pattern Generation (DDPG) for Chain Diagnosis.",
                    "The HiZ Problem of Power Management IC Testing.",
                    "Total Jitter Measurement for Testing HSIO Integrated SoCs.",
                    "Load-Board/PCB Noise Suppression via Electromagnetic Band Gap Power Plane Patterning.",
                    "Defect Detection Rate through IDDQ for Production Testing.",
                    "Variation Aware Analysis of Bridging Fault Testing.",
                    "Prioritizing the Application of DFM Guidelines Based on the Detectability of Systematic Defects.",
                    "How To Increase the Effectiveness of Yield Diagnostics-Is DFM the Answer to This?",
                    "Targeting Leakage Constraints during ATPG.",
                    "Power Management for Wafer-Level Test During Burn-In.",
                    "Test Generation for State Retention Logic.",
                    "Area and Test Cost Reduction for On-Chip Wireless Test Channels with System-Level Design Techniques.",
                    "On-Chip Test Generation Mechanism for Scan-Based Two-Pattern Tests.",
                    "Level-Testability of Multi-operand Adders.",
                    "System Level LBIST Implementation.",
                    "CooLBIST: An Effective Approach of Test Power Reduction for LBIST.",
                    "Practical Challenges in Logic BIST Implementation.",
                    "USB2.0 Logic Built In Self Test Methodology.",
                    "Shared At-Speed BIST for Parallel Test of SRAMs with Different Address Sizes.",
                    "Experimental Results of Built-In Jitter Measurement for Gigahertz Clock.",
                    "Leading Edge Technology and Test Noise.",
                    "DFT Technique to Conclusively Translate Floating Nodes to High IDDQ Current in Analog Circuits.",
                    "Diagnosis of Voltage Dependent Scan Chain Failure Using VBUMP Scan Debug Method.",
                    "Detectability of the Two-Dimensional Detector for Time Resolved Emission Measurement.",
                    "Protocol Aware Test Methodologies Using Today.",
                    "Core-Level Compression Technique Selection and SOC Test Architecture Design.",
                    "Simulation-Driven Thermal-Safe Test Time Minimization for System-on-Chip.",
                    "A Design-for-Debug (DfD) for NoC-Based SoC Debugging via NoC.",
                    "Accelerated Functional Testing of Digital Microfluidic Biochips.",
                    "On Reusing Test Access Mechanisms for Debug Data Transfer in SoC Post-Silicon Validation.",
                    "A Robust Automated Scan Pattern Mismatch Debugger.",
                    "An Interactive Verification and Debugging Environment by Concrete/Symbolic Simulations for System-Level Designs.",
                    "Coverage Directed Test Generation: Godson Experience.",
                    "Test Power Reduction by Blocking Scan Cell Outputs.",
                    "Two-Gear Low-Power Scan Test.",
                    "DCScan: A Power-Aware Scan Testing Architecture.",
                    "A Low-Cost Pipelined BIST Scheme for Homogeneous RAMs in Multicore Chips.",
                    "A Software-Based Test Methodology for Direct-Mapped Data Cache.",
                    "Time-Multiplexed Online Checking: A Feasibility Study.",
                    "On-Line Instruction-Checking in Pipelined Microprocessors.",
                    "Design of FSM with Concurrent Error Detection Based on Viterbi Decoding.",
                    "PHS-Fill: A Low Power Supply Noise Test Pattern Generation Technique for At-Speed Scan Testing in Huffman Coding Test Compression Environment.",
                    "CTX: A Clock-Gating-Based Test Relaxation and X-Filling Scheme for Reducing Yield Loss Risk in At-Speed Scan Testing.",
                    "Power Analysis and Reduction Techniques for Transition Fault Testing.",
                    "Influence of Parasitic Capacitance Variations on 65 nm and 32 nm Predictive Technology Model SRAM Core-Cells.",
                    "Test and Diagnosis Algorithm Generation and Evaluation for MRAM Write Disturbance Fault.",
                    "GDDR5 Training.",
                    "A Re-design Technique for Datapath Modules in Error Tolerant Applications.",
                    "Reliable Network-on-Chip Router for Crosstalk and Soft Error Tolerance.",
                    "Analyses on Trend of Accidents in Financial Information Systems Reported by Newspapers from the Viewpoint of Dependability."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "14th Asian Test Symposium 2005",
        "info": "Calcutta, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2005",
                "sub_name": "14th Asian Test Symposium (ATS 2005), 18-21 December 2005, Calcutta, India.",
                "count": 109,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Foreword.",
                    "ATS Steering Committee.",
                    "Advisory Board and Organizing Committee.",
                    "Program Committee.",
                    "Reviewers.",
                    "Best Paper Awards (2002 and 2003).",
                    "TTTC Introduction.",
                    "TTEP Introduction.",
                    "T1: Design for Manufacturability.",
                    "T2: Statistical Methods for VLSI Test and Burn-in Optimization.",
                    "Design for Testability: The Path to Deep Submicron.",
                    "DFT Aware Layout - Layout Aware DFT.",
                    "Embedded Test Technology - Brief History, Current Status, and Future Directions.",
                    "Faults and Tests in Quantum Circuits.",
                    "Improving Logic Test Quality of Microprocessors.",
                    "Robust Built-In Test of RF ICs Using Envelope Detectors.",
                    "Delay Defect Characterization Using Low Voltage Test.",
                    "Alternate Test Methodology for High Speed A/D Converter Testing on Low Cost Tester.",
                    "IDDQ Testing Method using a Scan Pattern for Production Testing.",
                    "A New, Flexible and Very Accurate Crosstalk Fault Model to Analyze the Effects of Coupling Noise between the Interconnects on Signal Integrity Losses in Deep Submicron Chips.",
                    "An Efficient System-Level to RTL Verification Framework for Computation-Intensive Applications.",
                    "Block-based Schema-driven Assertion Generation for Functional Verification.",
                    "A Framework for Automatic Assembly Program Generator (A2PG) for Verification and Testing of Processor Cores.",
                    "The Automatic Generation of Basis Set of Path for Path Testing.",
                    "Optimal Schemes for ADC BIST Based on Histogram.",
                    "A 5 Gbps Wafer-Level Tester.",
                    "Low-cost Production Test of BER for Wireless Receivers.",
                    "Design of a CMOS Operational Amplifier for Extreme-Voltage Stress Test.",
                    "New Self-checking Output-Duplicated Booth Multiplier with High Fault Coverage for Soft Errors.",
                    "A State Machine for Detecting C/C++ Memory Faults.",
                    "On-Line Testing of Digital Circuits for n-Detect and Bridging Fault Models.",
                    "Boundary Value Testing based on UML Models.",
                    "Random Jitter Testing Using Low Tap-Count Delay Lines.",
                    "Crosstalk Fault Detection for Interconnection Lines Based on Path Delay Inertia Principle.",
                    "A Methodology to Compute Bounds on Crosstalk Effects in Arbitrary Interconnects.",
                    "Non-robust Test Generation for Crosstalk-Induced Delay Faults.",
                    "Using Weighted Scan Enable Signals to Improve the Effectiveness of Scan-Based BIST.",
                    "Circuit Independent Weighted Pseudo-Random BIST Pattern Generator.",
                    "Low Transition LFSR for BIST-Based Applications.",
                    "A BIST Scheme Based on Selecting State Generation of Folding Counters.",
                    "Power-Constrained Area and Time Co-Optimization for SoCs Based on Consecutive Testability.",
                    "Low Cost Delay Testing of Nanometer SoCs Using On-Chip Clocking and Test Compression.",
                    "SOC Test Scheduling with Test Set Sharing and Broadcasting.",
                    "A Statistical Approach to Area-Constrained Yield Enhancement for Pipelined Circuits under Parameter Variations.",
                    "Leakage Current Based Stabilization Scheme for Robust Sense-Amplifier Design for Yield Enhancement in Nano-scale SRAM.",
                    "Flash Memory Die Sort by a Sample Classification Method.",
                    "Chip Identification using the Characteristic Dispersion of Transistor.",
                    "Untestable Multi-Cycle Path Delay Faults in Industrial Designs.",
                    "Improved Delay Fault Coverage Using Subsets of Flip-flops to Launch Transitions.",
                    "Selection of Paths for Delay Testing.",
                    "On Improving Defect Coverage of Stuck-at Fault Tests.",
                    "A Scan Matrix Design for Low Power Scan-Based Test.",
                    "A New Low Power Test Pattern Generator using a Transition Monitoring Window based on BIST Architecture.",
                    "ISC: Reconfigurable Scan-Cell Architecture for Low Power Testing.",
                    "Partial Gating Optimization for Power Reduction During Test Application.",
                    "Bridge Defect Diagnosis with Physical Information.",
                    "Design for Testability Based on Single-Port-Change Delay Testing for Data Paths.",
                    "A Class of Linear Space Compactors for Enhanced Diagnostic.",
                    "On Detection of Resistive Bridging Defects by Low-Temperature and Low-Voltage Testing.",
                    "State-reuse Test Generation for Progressive Random Access Scan: Solution to Test Power, Application Time and Data Size.",
                    "Enhancing Fault Simulation Performance by Dynamic Fault Clustering.",
                    "Cost Optimal Design of Nonlinear CA based PRPG for Test Applications.",
                    "An Effective Design for Hierarchical Test Generation Based on Strong Testability.",
                    "Concurrent Test Generation.",
                    "Novel Bi-partitioned Scan Architecture to Improve Transition Fault Coverage.",
                    "A DFT Method for RTL Data Paths Based on Partially Strong Testability to Guarantee Complete Fault Efficiency.",
                    "Achieving High Test Quality with Reduced Pin Count Testing.",
                    "Design for Cost Effective Scan Testing by Reconfiguring Scan Flip-Flops.",
                    "Adaptive Encoding Scheme for Test Volume/Time Reduction in SoC Scan Testing.",
                    "Choosing the Right Mix of At-speed Structural Test Patterns: Comparisons in Pattern Volume Reduction and Fault Detection Efficiency.",
                    "Efficient Test Compaction for Pseudo-Random Testing.",
                    "Test Data Compression with Partial LFSR-Reseeding.",
                    "CryptoScan: A Secured Scan Chain Architecture.",
                    "Pseudo-Parity Testing with Testable Design.",
                    "Finite State Machine Synthesis for At-Speed Oscillation Testability.",
                    "A Test Cost Reduction Method by Test Response and Test Vector Overlapping for Full-Scan Test Architecture.",
                    "Scan Data Volume Reduction Using Periodically Alterable MUXs Decompressor.",
                    "Efficient Static Compaction Techniques for Sequential Circuits Based on Reverse Order Restoration and Test Relaxation.",
                    "Low Power Test Compression Technique for Designs with Multiple Scan Chain.",
                    "Threshold testing: Covering bridging and other realistic faults.",
                    "Synthesis of Testable Finite State Machine Through Decomposition.",
                    "Shannon Expansion Based Supply-Gated Logic for Improved Power and Testability.",
                    "Flip-flop chaining architecture for power-efficient scan during test application.",
                    "A Unified Approach to Partial Scan Design using Genetic Algorithm.",
                    "A Family of Logical Fault Models for Reversible Circuits.",
                    "Compressing Functional Tests for Microprocessors.",
                    "Investigations of Faulty DRAM Behavior Using Electrical Simulation Versus an Analytical Approach.",
                    "Arithmetic Test Strategy for FFT Processor.",
                    "Efficient Constraint Extraction for Template-Based Processor Self-Test Generation.",
                    "IEEE Std 1500 Compliant Infrastructure forModular SOC Testing.",
                    "DFT for Low Cost SOC Test.",
                    "Managing Test and Repair of Embedded Memory Subsystem in SoC.",
                    "The Ultimate Chase.",
                    "Defect-Oriented Test for Ultra-Low DPM.",
                    "Current Testing for Nanotechnologies: A Demystifying Application Perspective..",
                    "High Level Test Generation for Custom Hardware: An Industrial Perspective.",
                    "High Level Test Generation / SW based Embedded Test.",
                    "Verification of Industrial Designs Using A Computing Grid With More than 100 Nodes.",
                    "Emerging Techniques for Test Data Compression.",
                    "Improving Test Quality Using Test Data Compression.",
                    "Efficient Test Architecture based on Boundary Scan for Comprehensive System Test.",
                    "Challenges in Next Generation Mixed-Signal IC Production Testing.",
                    "Practices in Testing of Mixed-Signal and RF SoCs.",
                    "Challenges in High Speed Interface Testing.",
                    "Practical Aspects of Delay Testing for Nanometer Chips.",
                    "Limitation of structural scan delay test.",
                    "Shortening Burn-In Test: Application of a Novel Approach in optimizing Burn-In Time using Weibull Statistical Analysis with HVST."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "13th Asian Test Symposium 2004",
        "info": "Kenting, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2004",
                "sub_name": "13th Asian Test Symposium (ATS 2004), 15-17 November 2004, Kenting, Taiwan.",
                "count": 74,
                "papers": [
                    "Multi-Frequency Test Access Mechanism Design for Modular SOC Testing.",
                    "Rapid and Energy-Efficient Testing for Embedded Cores.",
                    "Constructing Transparency Paths for IP Cores Using Greedy Searching Strategy.",
                    "Adding Testability to an Asynchronous Interconnect for GALS SoC.",
                    "Test Power Reduction with Multiple Capture Orders.",
                    "Power-Constrained DFT Algorithms for Non-Scan BIST-able RTL Data Paths.",
                    "Low Power BIST with Smoother and Scan-Chain Reorder .",
                    "Techniques for Finding Xs in Test Sequences for Sequential Circuits and Applications to Test Length/Power Reduction.",
                    "A Time Domain Built-In Self-Test Methodology for SNDR and ENOB Tests of Analog-to-Digital Converters.",
                    "A New BIST Scheme Based on a Summing-into-Timing-Signal Principle with Self Calibration for the DAC.",
                    "A Signa-Delta Modulation Based Analog BIST System with a Wide Bandwidth Fifth-Order Analog Response Extractor for Diagnosis Purpose.",
                    "A Built-In Loopback Test Methodology for RF Transceiver Circuits Using Embedded Sensor Circuits.",
                    "Multiple Scan Tree Design with Test Vector Modification.",
                    "An Efficient Low-Overhead Policy for Constructing Multiple Scan-Chains.",
                    "Scan-Based BIST Using an Improved Scan Forest Architecture.",
                    "The Efficient Multiple Scan Chain Architecture Reducing Power Dissipation and Test Time.",
                    "Testing for Missing-Gate Faults in Reversible Circuits.",
                    "Properties of Maximally Dominating Faults.",
                    "I_DDQ Test Method Based on Wavelet Transformation for Noisy Current Measurement Environment.",
                    "High Level Fault Injection for Attack Simulation in Smart Cards.",
                    "Efficient Identification of Crosstalk Induced Slowdown Targets.",
                    "Modeling and Testing Crosstalk Faults in Inter-Core Interconnects that Include Tri-State and Bi-Directional Nets.",
                    "A New Path Delay Test Scheme Based on Path Delay Inertia.",
                    "A Unified Approach to Detecting Crosstalk Faults of Interconnects in Deep Sub-Micron VLSI.",
                    "Efficient Template Generation for Instruction-Based Self-Test of Processor Cores.",
                    "Test Instruction Set (TIS) for High Level Self-Testing of CPU Cores.",
                    "A Snapshot Method to Provide Full Visibility for Functional Debugging Using FPGA.",
                    "A Systematic Way of Functional Testing for VLSI Chips.",
                    "Weighted Pseudo-Random BIST for N-Detection of Single Stuck-at Faults.",
                    "A BIST Approach to On-Line Monitoring of Digital VLSI Circuits: A CAD Tool.",
                    "Seed Selection Procedure for LFSR-Based BIST with Multiple Scan Chains and Phase Shifters.",
                    "Nonlinear CA Based Design of Test Set Generator Targeting Pseudo-Random Pattern Resistant Faults.",
                    "Compactor Independent Direct Diagnosis.",
                    "Scan Chain Fault Identification Using Weight-Based Codes for SoC Circuits.",
                    "Enhancing BIST Based Single/Multiple Stuck-at Fault Diagnosis by Ambiguous Test Set.",
                    "Failure Analysis of Open Faults by Using Detecting/Un-detecting Information on Tests.",
                    "Hybrid BIST Test Scheduling Based on Defect Probabilities.",
                    "Pair Balance-Based Test Scheduling for SOCs.",
                    "RAIN (RAndom Insertion) Scheduling Algorithm for SoC Test.",
                    "March Based Memory Core Test Scheduling for SOC.",
                    "An Integrated Technique for Test Vector Selection and Test Scheduling under Test Time Constraint.",
                    "On Test and Diagnostics of Flash Memories.",
                    "Resistive-Open Defects in Embedded-SRAM Core Cells: Analysis and March Test Solution.",
                    "A Measurement Unit for Input Signal Analysis of SRAM Sense Amplifier.",
                    "An Efficient Diagnosis Scheme for Random Access Memories.",
                    "Evaluation of Intra-Word Faults in Word-Oriented RAMs.",
                    "Low-Cost Analog Signal Generation Using a Pulse-Density Modulated Digital ATE Channel.",
                    "A Low-Cost Diagnosis Methodology for Pipelined A/D Converters.",
                    "Reconfiguration for Enhanced ALternate Test (REALTest) of Analog Circuits.",
                    "Dynamic Analog Testing via ATE Digital Test Channels.",
                    "Design and Implementation of Self-Testable Full Range Window Comparator.",
                    "Efficient Test Methodologies for Conditional Sum Adders.",
                    "A Novel Approach for On-line Testable Reversible Logic Circuit Desig.",
                    "Nonlinear CA Based Scalable Design of On-Chip TPG for Multiple Cores.",
                    "Circuit-Width Based Heuristic for Boolean Reasoning.",
                    "Max-Testable Class of Sequential Circuits having Combinational Test Generation Complexity.",
                    "Classification of Sequential Circuits Based on ?k Notation.",
                    "A New Way of Detecting Reconvergent Fanout Branch Pairs in Logic Circuits.",
                    "Burn-In Stress Test of Analog CMOS ICs.",
                    "Fail Pattern Identification for Memory Built-In Self-Repair.",
                    "Reduce Yield Loss in Delay Defect Detection in Slack Interval.",
                    "Considering Fault Dependency and Debugging Time Lag in Reliability Growth Modeling during Software Testing.",
                    "Intelligible Test Techniques to Support Error-Tolerance.",
                    "Bounding Rollback-Recovery of Large Distributed Computation in WAN Environment.",
                    "Full Restoration of Multiple Faults in WDM Networks without Wavelength Conversion.",
                    "On Improvement in Fault Tolerance of Hopfield Neural Networks.",
                    "Testing and Diagnosis Techniques for LUT-Based FPGA's.",
                    "Device Resizing Based Optimization of Analog Circuits for Reduced Test Cost: Cost Metric and Case Study.",
                    "A Test Decompression Scheme for Variable-Length Coding.",
                    "Alternative Run-Length Coding through Scan Chain Reconfiguration for Joint Minimization of Test Data Volume and Power Consumption in Scan Test.",
                    "Modeling and Simulation for Crosstalk Aggravated by Weak-Bridge Defects between On-Chip Interconnects.",
                    "A Postprocessing Procedure of Test Enrichment for Path Delay Faults.",
                    "Functional Scan Chain Design at RTL for Skewed-Load Delay Fault Testing.",
                    "Analysis and Attenuation Proposal in Ground Bounce."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "12th Asian Test Symposium 2003",
        "info": "Xian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2003",
                "sub_name": "12th Asian Test Symposium (ATS 2003), 17-19 November 2003, Xian, China.",
                "count": 99,
                "papers": [
                    "Outstanding Challenges in Testing Nanotechnology Based Integrated Circuits.",
                    "Leveraging Infrastructure IP for SoC Yield.",
                    "Reducing Scan Shifts Using Folding Scan Trees.",
                    "Improving Test Quality of Scan-Based BIST by Scan Chain Partitioning.",
                    "IC Reliability Simulator ARET and Its Application in Design-for-Reliability.",
                    "Analyzing the Impact of Process Variations on DRAM Testing Using Border Resistance Traces.",
                    "Implementation of Memory Tester Consisting of SRAM-Based Reconfigurable Cells.",
                    "Exhaustive Test of Several Dependable Memory Architectures Designed by GRAAL Tool.",
                    "Chip-Level Diagnostic Strategy for Full-Scan Designs with Multiple Faults.",
                    "Efficient Diagnosis for Multiple Intermittent Scan Chain Hold-Time Faults.",
                    "A Linear Time Fault Diagnosis Algorithm for Hypercube Multiprocessors under the MM* Comparison Model.",
                    "Reducibility of Sequential Test Generation to Combinational Test Generation for Several Delay Fault Models.",
                    "On Estimation of Fault Efficiency for Path Delay Faults.",
                    "Software-Based Delay Fault Testing of Processor Cores.",
                    "A DFT Approach for Path Delay Faults in Interconnected Circuits.",
                    "Non-Linear Celluar Automata Based PRPG Design (Without Prohibited Pattern Set) In Linear Time Complexity.",
                    "A BIST Architecture for FPGA Look-Up Table Testing Reduces Reconfigurations.",
                    "A Heuristic Approach for Design of Easily Testable PLAs Using Pass Transistor Logic.",
                    "Domain Testing Based on Character String Predicate.",
                    "Automated TTCN-3 Test Case Generation by Means of UML Sequence Diagrams and Markov Chains.",
                    "Efficiency Analysis and Safety Assessment of Automatic Testing for Safety-Critical Software.",
                    "An Expression's Single Fault Model and the Testing Methods.",
                    "PLL Based High Speed Functional Testing.",
                    "Issues Related to the Formulation of DFT Solution for Analog Circuit Test Using Equivalent Fault Analysis.",
                    "A Sigma-Delta Modulation Based BIST Scheme for A/D Converters.",
                    "A Method of Test Plan Grouping to Shorten Test Length for RTL Data Paths under a Test Controller Area Constraint.",
                    "Optimal Scan Tree Construction with Test Vector Modification for Test Compression.",
                    "STAGE: A Decoding Engine Suitable for Multi-Compressed Test Data.",
                    "Automatic Design Validation Framework for HDL Descriptions via RTL ATPG.",
                    "An Automatic Circuit Extractor for RTL Verification.",
                    "An Efficient Observability Evaluation Algorithm Based on Factored Use-Def Chains.",
                    "Delay Testing of MOS Transistor with Gate Oxide Short.",
                    "An Enhanced Test Generator for Capacitance Induced Crosstalk Delay Faults.",
                    "Delay Test Pattern Generation Considering Crosstalk-Induced Effects.",
                    "Automated Test Model Generation from Switch Level Custom Circuits.",
                    "Power Conscious BIST Design for Sequential Circuits Using ghost-FSM.",
                    "Average Leakage Current Macromodeling for Dual-Threshold Voltage Circuits.",
                    "Test Data Manipulation Techniques for Energy-Frugal, Rapid Scan Test.",
                    "Analysis of Software Test Item Generation - Comparison between High Skilled and Low Skilled Engineers.",
                    "Conformance Test of Distributed Transaction Service.",
                    "Build-In-Self-Test for Software.",
                    "Testing the Conformity of Transactional Attributes of Components by Simulation.",
                    "Extracting Precise Diagnosis of Bridging Faults from Stuck-at Fault Information.",
                    "Fault Diagnosis for Physical Defects of Unknown Behaviors.",
                    "Fault Detection for Testable Realizations of Multiple-Valued Logic Functions.",
                    "Comparison of Open and Resistive-Open Defect Test Conditions in SRAM Address Decoders.",
                    "Defect Oriented Fault Analysis for SRAM.",
                    "A Novel Method for Online In-Place Detection and Location of Multiple Interconnect Faults in SRAM Based FPGAs.",
                    "Between-Core Vector Overlapping for Test Cost Reduction in Core Testing.",
                    "The VPI-Based Combinational IP Core Module-Based Mixed Level Serial Fault Simulation and Test Generation Methodology.",
                    "A Test Generation Approach for Systems-on-Chip that Use Intellectual Property Cores.",
                    "Mapping Symmetric Functions to Hierarchical Modules for Path-Delay Fault Testability.",
                    "BDD Based Synthesis of Symmetric Functions with Full Path-Delay Fault Testability.",
                    "Test Synthesis for Datapaths Using Datapath-Controller Functions.",
                    "Non-Scan Design for Testability for Mixed RTL Circuits with Both Data Paths and Controller via Conflict Analysis.",
                    "Optimal System-on-Chip Test Scheduling.",
                    "SOC Test Time Minimization Under Multiple Constraints.",
                    "Test Time Minimization for Hybrid BIST of Core-Based Systems.",
                    "On-Chip Short-Time Interval Measurement for High-Speed Signal Timing Characterization.",
                    "An On-Chip Jitter Measurement Circuit for the PLL.",
                    "A Low-Cost Jitter Measurement Technique for BIST Applications.",
                    "Measurement-Based Modeling with Adaptive Sampling.",
                    "Yield, Overall Test Environment Timing Accuracy, and Defect Level Trade-Offs for High-Speed Interconnect Device Testing.",
                    "Minimizing Defective Part Level Using a Linear Programming-Based Optimal Test Selection Method.",
                    "Lowering Cost of Test: Parallel Test or Low-Cost ATE?",
                    "A Processor-Based Built-In Self-Repair Design for Embedded Memories.",
                    "March SL: A Test For All Static Linked Memory Faults.",
                    "Testing Delay Faults in Embedded CAMs.",
                    "Stress Test for Disturb Faults in Non-Volatile Memories.",
                    "A BIST Circuit for IDDQ Tests.",
                    "At-Speed Current Testing.",
                    "IDDT ATPG Based on Ambiguous Delay Assignments.",
                    "Improvement of Detectability for CMOS Floating Gate Defects in Supply Current Test.",
                    "A DFT Selection Method for Reducing Test Application Time of System-on-Chips.",
                    "Sharing BIST with Multiple Cores for System-on-a-Chip.",
                    "Designing Multiple Scan Chains for Systems-on-Chip.",
                    "Optimizing Test Access Mechanism under Constraints by Genetic Local Search Algorithm.",
                    "Test Data Volume Reduction by Test Data Realignment.",
                    "Test Resource Partitioning Based on Efficient Response Compaction for Test Time and Teste.",
                    "Test Response Compression Based on Huffman Coding.",
                    "Probability Model for Faults in Large-Scale Multicomputer Systems.",
                    "Design Retargetable Platform System for Microprocessor Functional Test.",
                    "Assessing Software Implemented Fault Detection and Fault Tolerance Mechanisms.",
                    "Briefing a New Approach to Improve the EMI Immunity of DSP Systems.",
                    "Design Error Diagnosis Based on Verification Techniques.",
                    "SAT-Based Algorithm of Verification for Port Order Fault.",
                    "Equivalence Checking Using Independent Cuts.",
                    "A Method to Calculate the Reliability of Component-Based Software.",
                    "An Object-Oriented Program Automatic Execute Model and the Research of Algorithm.",
                    "User-Level Implementation of Checkpointing for Multithreaded Applications on Windows NT.",
                    "RTL Concurrent Fault Simulation.",
                    "Property Classification for Functional Verification Based.",
                    "Error Detection and Correction in VLSI Systems by Online Testing and Retrying.",
                    "Testability Improvement During High-Level Synthesis.",
                    "A Test Architecture for System-on-a-Chip.",
                    "Test-Point Selection Algorithm Using Small Signal Model for Scan-Based BIST.",
                    "Test Pattern Length Required to Reach the Desired Fault Coverage.",
                    "Damage Size and Software Safety Demonstration Stress Testing.",
                    "Study on the Cost/Benefit/Optimization of Software Safety Test."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "11th Asian Test Symposium 2002",
        "info": "Guam, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2002",
                "sub_name": "11th Asian Test Symposium (ATS 2002), 18-20 November 2002, Guam, USA.",
                "count": 72,
                "papers": [
                    "On Generating High Quality Tests for Transition Faults.",
                    "Exact Computation of Maximally Dominating Faults and Its Application to n-Detection Tests.",
                    "Maximum Distance Testing.",
                    "High Precision Result Evaluation of VLSI.",
                    "A Totally Self-Checking Dynamic Asynchronous Datapath.",
                    "Non-Intrusive Design of Concurrently Self-Testable FSMs.",
                    "Test Limitations of Parametric Faults in Analog Circuits.",
                    "Effects of Amplitude Modulation in Jitter Tolerance Measurements of Communication Devices.",
                    "On-chip Analog Response Extraction with 1-Bit ? - Modulators.",
                    "A State Reduction Method for Non-Scan Based FSM Testing with Don't Care Inputs Identification Technique.",
                    "Improving the Efficiency of Static Compaction Based on Chronological Order Enumeration of Test Sequences.",
                    "Test Data Compression Using Don?t-Care Identification and Statistical Encoding.",
                    "Design for Two-Pattern Testability of Controller-Data Path Circuits.",
                    "MD-SCAN Method for Low Power Scan Testing.",
                    "Non-Scan Design for Testability Based on Fault Oriented Conflict Analysis.",
                    "Specification and Design of a New Memory Fault Simulator.",
                    "DRAM Specific Approximation of the Faulty Behavior of Cell Defects.",
                    "An Access Timing Measurement Unit of Embedded Memory.",
                    "A Partitioning and Storage Based Built-In Test Pattern Generation Method for Delay Faults in Scan Circuits.",
                    "Optimal Seed Generation for Delay Fault Detection BIST.",
                    "On-Chip Tap-Delay Measurements for a Digital Delay-Line Used in High-Speed Inter-Chip Data Communications.",
                    "A Scheduling Method in High-Level Synthesis for Acyclic Partial Scan Design.",
                    "Test Requirement Analysis for Low Cost Hierarchical Test Path Construction.",
                    "Testable Realizations for ESOP Expressions of Logic Functions.",
                    "DPSC SRAM Transparent Test Algorithm.",
                    "Tests for Word-Oriented Content Addressable Memories.",
                    "A High Performance IDDQ Testable Cache for Scaled CMOS Technologies.",
                    "Enhanced Crosstalk Fault Model and Methodology to Generate Tests for Arbitrary Inter-core Interconnect Topology.",
                    "A Testing Scheme for Crosstalk Faults Based on the Oscillation Test Signal.",
                    "Crosstalk Fault Reduction and Simulation for Clock-Delayed Domino Circuits.",
                    "A Concurrent Fault Simulation for Crosstalk Faults in Sequential Circuits.",
                    "Efficient Circuit Specific Pseudoexhaustive Testing with Cellular Automata.",
                    "Fault Set Partition for Efficient Width Compression.",
                    "A Reseeding Technique for LFSR-Based BIST Applications.",
                    "A ROMless LFSR Reseeding Scheme for Scan-based BIST.",
                    "A Fault-Tolerant Architecture for Symmetric Block Ciphers.",
                    "A New Learning Approach to Design Fault Tolerant ANNs: Finally a Zero HW-SW Overhead.",
                    "Experimental Results of a Recovery Block Scheme to Handle Noise in Speech Recognition Systems.",
                    "Easily Testable and Fault-Tolerant Design of FFT Butterfly Networks.",
                    "Fault Detection and Fault Diagnosis Technoques for Lookup Table FPGA's.",
                    "Reduction of Target Fault List for Crosstalk-Induced Delay Faults by using Layout Constraints.",
                    "Diagnosis Of Byzantine Open-Segment Faults.",
                    "Robust Space Compaction of Test Responses.",
                    "An Evolutionary Strategy To Design An On-Chip Test Pattern Generator Without Prohibited Pattern Set (PPS).",
                    "An Embedded Built-In-Self-Test Approach for Analog-to-Digital Converters.",
                    "Statistical Analysis of Time Series Data on the Number of Faults Detected by Statistical Analysis of Time Series Data on the Number of Faults Detected by Software Testing.",
                    "An Analytic Software Testability Model.",
                    "Effective Automated Testing: A Solution of Graphical Object Verification.",
                    "At-Speed Built-in Test for Logic Circuits with Multiple Clocks.",
                    "A Test Point Insertion Method to Reduce the Number of Test Patterns.",
                    "A SoC Test Strategy Based on a Non-Scan DFT Method.",
                    "Embedded Test Solution as a Breakthrough in Reducing Cost of Test for System on Chips.",
                    "Manufacturing Test of SoCs.",
                    "Recent Advances in Test Planning for Modular Testing of Core-Based SOCs.",
                    "A Method to Reduce Power Dissipation during Test for Sequential Circuits.",
                    "Test Power Optimization Techniques for CMOS Circuits.",
                    "Reducing Test Application Time and Power Dissipation for Scan-Based Testing via Multiple Clock Disabling.",
                    "A Simple Wrapped Core Linking Module for SoC Test Access.",
                    "Testing System-On-Chip by Summations of Cores? Test Output Voltages.",
                    "Test Scheduling of BISTed Memory Cores for SOC.",
                    "Effective Error Diagnosis for RTL Designs in HDLs.",
                    "Evolutionary Test Program Induction for Microprocessor Design Verification.",
                    "Hierarchical Fault Simulation Using Behavioral and Gate Level Hardware Models.",
                    "Testing Embedded Systems by Using a C++ Script Interpreter.",
                    "Extending EDA Environment From Design to Test.",
                    "Vector Memory Expansion System For T33xx Logic Tester.",
                    "Integrated Test Scheduling, Test Parallelization and TAMDesign.",
                    "Core - Clustering Based SOC Test Scheduling Optimization.",
                    "Test Scheduling and Test Access Architecture Optimization for System-on-Chip.",
                    "CMOS Floating Gate Defect Detection Using I DDQ Test with DC Power Supply.",
                    "Test Time Reduction for I DDQ Testing by Arranging Test Vectors.",
                    "Time Slot Specification Based Approach to Analog Fault Diagnosis Using Built-in Current Sensors and Test Point Insertion."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "10th Asian Test Symposium 2001",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2001",
                "sub_name": "10th Asian Test Symposium (ATS 2001), 19-21 November 2001, Kyoto, Japan.",
                "count": 79,
                "papers": [
                    "DFT for High-Quality Low Cost Manufacturing Test.",
                    "Design for Hierarchical Two-Pattern Testability of Data Paths.",
                    "A Multiple Phase Partial Scan Design Method.",
                    "Sequential Redundancy Removal Using Test Generation and Multiple Unreachable States.",
                    "Tests for Resistive and Capacitive Defects in Address Decoders.",
                    "Detecting Unique Faults in Multi-port SRAMs.",
                    "A Memory Specific Notation for Fault Modeling.",
                    "On Pass/Fail Dictionaries for Scan Circuits .",
                    "Diagnosis by Repeated Application of Specific Test Inputs and by Output Monitoring of the MISA.",
                    "Simulation-Based Diagnosis for Crosstalk Faults in Sequential Circuits.",
                    "Test Generation for Double Stuck-at Faults.",
                    "Faulty Resistance Sectioning Technique for Resistive Bridging Fault ATPG Systems.",
                    "On Improving a Fault Simulation Based Test Generator for Synchronous Sequential Circuits.",
                    "Automatic Generation of Memory Built-in Self-Test Cores for System-on-Chip.",
                    "A P1500 Compliant BIST-Based Approach to Embedded RAM Diagnosis.",
                    "A Built-in Self-Test and Self-Diagnosis Scheme for Heterogeneous SRAM Clusters.",
                    "IDDQ Sensing Technique for High Speed IDDQ Testing.",
                    "CMOS Open Defect Detection Based on Supply Current in Time-Variable Electric Field and Supply Voltage Application.",
                    "An Approach to Improve the Resolution of Defect-Based Diagnosis.",
                    "A Postprocessing Procedure to Reduce the Number of Different Test Lengths in a Test Set for Scan Circuits.",
                    "A Method of Static Compaction of Test Stimuli.",
                    "Dynamic Test Compression Using Statistical Coding.",
                    "Guardband Determination for the Detection of Off-State and Junction Leakages in DRAM Testing.",
                    "Memory Read Faults: Taxonomy and Automatic Test Generation.",
                    "Simulation and Development of Short Transparent Tests for RAM.",
                    "Test Time Reduction through Minimum Execution of Tester-Hardware Setting Instructions.",
                    "EB-Testing-Pad Method and Its Evaluation by Actual Devices.",
                    "Benefits of Phase Interference Detection to IC Waveform Probing.",
                    "A DFT Method for Core-Based Systems-on-a-Chip Based on Consecutive Testability.",
                    "Compaction Schemes with Minimum Test Application Time.",
                    "Design of an Optimal Test Access Architecture Using a Genetic Algorithm.",
                    "An RT-Level ATPG Based on Clustering of Circuit States.",
                    "An Approach to RTL Fault Extraction and Test Generation.",
                    "Effective Techniques for High-Level ATPG.",
                    "An Efficient Method to Identify Untestable Path Delay Faults.",
                    "SpeedGrade: An RTL Path Delay Fault Simulator.",
                    "Test Generation for Multiple-Threshold Gate-Delay Fault Model.",
                    "A Gated Clock Scheme for Low Power Scan Testing of Logic ICs or Embedded Cores.",
                    "Test Scheduling and Scan-Chain Division under Power Constraint.",
                    "Resource Allocation and Test Scheduling for Concurrent Test of Core-Based SoC D.",
                    "A Unified Scheme for Designing Testable State Machines.",
                    "Generation of an Ordered Sequence of Test Vectors for Single State Transition Faults in Large Sequential Machines.",
                    "Enhancing BIST Quality of Sequential Machines through Degree-of-Freedom Analysis.",
                    "Robust Self Concurrent Test of Linear Digital Systems.",
                    "Control-Flow Checking via Regular Expressions.",
                    "FPGA-Based Fault Injection for Microprocessor Systems.",
                    "BIST Method Based on Concurrent Single-Control Testability of RTL Data Paths.",
                    "Faults in Processor Control Subsystems: Testing Correctness and Performance Faults in the Data Prefetching Unit.",
                    "A SmartBIST Variant with Guaranteed Encoding.",
                    "MEMS Comb-Actuator Resonance Measurement Method Using the 2nd Harmonics of the GND Current.",
                    "On Test and Characterization of Analog Linear Time-Invariant Circuits Using Neural Networks.",
                    "Specification Based Digital Compatible Built-in Test of Embedded Analog Circuits.",
                    "Yield Increase of VLSI after Redundancy-Repairing.",
                    "An Improvement in Weight-Fault Tolerance of Feedforward Neural Networks.",
                    "A New Code-Disjoint Sum-Bit Duplicated Carry Look-Ahead Adder for Parity Codes.",
                    "Selecting a PRPG: Randomness, Primitiveness, or Sheer Luck?",
                    "Hybrid BIST Using Partially Rotational Scan.",
                    "Multiple Attractor Cellular Automata for Hierarchical Diagnosis of VLSI Circuits.",
                    "A Microcode-Based Memory BIST Implementing Modified March Algorithm.",
                    "Fault Simulation for VHDL Based Test Bench and BIST Evaluation.",
                    "Automatic Test Generation for Analog Circuits Using Compact Test Transfer Function Models.",
                    "Distance Constrained Dimensionality Reduction for Parametric Fault Test Generator.",
                    "Short Circuit Faults in State-of-the-Art ADCs - Are They Hard or Soft?",
                    "An Embedded Built-in-Self-Test Approach for Digital-to-Analog Converters.",
                    "An Improved AVPG Algorithm for SoC Design Verification Using Port Order Fault Model.",
                    "Framework of Timed Trace Theoretic Verification Revisited.",
                    "Efficient Pattern-Based Verification of Connections to IP Cores .",
                    "Design Verification and Robust Design Technique for Cross-Talk Faults.",
                    "A Practical Logic BIST for ASIC Designs.",
                    "Tx7901 Dft.",
                    "An Application of Partial Scan Techniques to a High-End System LSI Design.",
                    "Built-out Self-Test (BOST) for Analog Circuits in a System LSI: Test Solution to Reduce Test Costs.",
                    "High-Speed Interface Testing.",
                    "A New Inter-Core Built-In-Self-Test Circuits for Tri-State Buffers in the System on a Chip.",
                    "A Flexible Logic BIST Scheme and Its Application to SoC Designs.",
                    "Experimental Results of Forward-Looking Reverse Order Fault Simulation on Industrial Circuits with Scan.",
                    "Non-exhaustive Parity Testing.",
                    "Built-in Self-Test for State Faults Induced by Crosstalk in Sequential Circuits.",
                    "A Low-Power LFSR Architecture."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "9th Asian Test Symposium 2000",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/2000",
                "sub_name": "9th Asian Test Symposium (ATS 2000), 4-6 December 2000, Taipei, Taiwan.",
                "count": 83,
                "papers": [
                    "Testing in the Fourth Dimension.",
                    "Challenges for the Academic Test Community.",
                    "DFT and BIST techniques for the future.",
                    "DFT closure.",
                    "Current status and future trend on CAD tools for VLSI testing Wu-Tung Cheng.",
                    "Mixed-Signal SoC Testing: Is Mixed-Signal Design-for-Test on Its Way.",
                    "Collaboration between Industry and Academia in Test Research.",
                    "Test generation for fault isolation in analog circuits using behavioral models.",
                    "Fault diagnosis for linear analog circuits.",
                    "Testing mixed-signal cores: practical oscillation-based test in an analog macrocell.",
                    "New built-in self-test technique based on addition/subtraction of selected node voltages.",
                    "A built-in self-test and self-diagnosis scheme for embedded SRAM.",
                    "An FPGA-based re-configurable functional tester for memory chips.",
                    "BIST TPG for SRAM cluster interconnect testing at board level.",
                    "Efficient built-in self-test algorithm for memory.",
                    "Optimal test-set generation for parametric fault detection in switched capacitor filters.",
                    "TI-BIST: a temperature independent analog BIST for switched-capacitor filters.",
                    "Analog circuit equivalent faults in the D.C. domain.",
                    "A methodology for fault model development for hierarchical linear systems.",
                    "Testing a PWM circuit using functional fault models and compact test vectors for operational amplifiers.",
                    "A new framework for static timing analysis, incremental timing refinement, and timing simulation.",
                    "On the feasibility of fault simulation using partial circuit descriptions.",
                    "Fsimac: a fault simulator for asynchronous sequential circuits.",
                    "Simulation of resistive bridging fault to minimize the presence of intermediate voltage and oscillation in CMOS circuits.",
                    "Non-invasive timing analysis of IBM G6 microprocessor L1 cache using picosecond imaging circuit analysis.",
                    "An experimental analysis of spot defects in SRAMs: realistic fault models and tests.",
                    "Enhanced untestable path analysis using edge graphs.",
                    "A waveform simulator based on Boolean process.",
                    "On the superiority of DO-RE-ME/MPG-D over stuck-at-based defective part level prediction.",
                    "Compaction-based test generation using state and fault information.",
                    "Test sequence compaction for sequential circuits with reset states.",
                    "Spirit: satisfiability problem implementation for redundancy identification and test generation.",
                    "Forecasting the efficiency of test generation algorithms for digital circuits.",
                    "Fast hierarchical test path construction for DFT-free controller-datapath circuits.",
                    "Faster processing for microprocessor functional ATPG.",
                    "Verification of deadlock free property of high level robot control.",
                    "Functional Testing of Microprocessors with Graded Fault Coverage.",
                    "Single-control testability of RTL data paths for BIST.",
                    "A BIST methodology for at-speed testing of data communications transceivers.",
                    "High-speed generation of LFSR signatures.",
                    "Strong self-testability for data paths high-level synthesis.",
                    "Generating test items for checking illegal behaviors in software testing.",
                    "Using genetic algorithms for test case generation in path testing.",
                    "A hierarchical test control architecture for core based design.",
                    "Embedded core testing using genetic algorithms.",
                    "Functional testing and fault analysis based fault coverage enhancement techniques for embedded core based systems.",
                    "etection of SRAM cell stability by lowering array supply voltage.",
                    "A realistic fault model for flash memories.",
                    "Impact of memory cell array bridges on the faulty behavior in embedded DRAMs.",
                    "Memory test time reduction by interconnecting test items.",
                    "An efficient parallel transparent diagnostic BIST.",
                    "Test generation for crosstalk-induced faults: framework and computational result.",
                    "Testing programmable interconnect systems: an algorithmic approach.",
                    "Reducing test application time for full scan circuits by the addition of transfer sequences.",
                    "TOF: a tool for test pattern generation optimization of an FPGA application oriented test.",
                    "Formal verification of data-path circuits based on symbolic simulation.",
                    "Is IDDQ testing not applicable for deep submicron VLSI in year 2011?",
                    "High speed IDDQ test and its testability for process variation.",
                    "Memory reduction of IDDQ test compaction for internal and external bridging faults.",
                    "A high-speed IDDQ sensor implementation.",
                    "Cyclic greedy generation method for limited number of IDDQ tests.",
                    "Accelerated test pattern generators for mixed-mode BIST environments.",
                    "Effective parallel processing techniques for the generation of test data for a logic built-in self test system.",
                    "Design and testing of fast and cost effective serial seeding TPGs based on one-dimensional linear hybrid cellular automata.",
                    "An efficient BIST design using LFSR-ROM architecture.",
                    "Novel techniques for improving testability analysis.",
                    "A class of sequential circuits with combinational test generation complexity under single-fault assumption.",
                    "Design for sequential testability: an internal state reseeding approach for 100 % fault coverage.",
                    "Testing approach within FPGA-based fault tolerant systems.",
                    "Transient-fault tolerant VHDL descriptions: a case-study for area overhead analysis.",
                    "Fault tolerant multistage interconnection networks with widely dispersed paths.",
                    "A Testable/Fault Tolerant FFT Processor Design.",
                    "Charge sharing fault analysis and testing for CMOS domino logic circuits.",
                    "Testing domino circuits in SOI technology.",
                    "A case study of failure analysis and guardband determination for a 64M-bit DRAM.",
                    "Peak-power reduction for multiple-scan circuits during test application.",
                    "An adjacency-based test pattern generator for low power BIST design.",
                    "Distribution-graph based approach and extended tree growing technique in power-constrained block-test scheduling.",
                    "A method for determining whether asynchronous circuits are self-checking.",
                    "On testing safety-sensitive digital systems.",
                    "Accumulation-based concurrent fault detection for linear digital state variable systems.",
                    "High Performance/Delay Testing.",
                    "SoC Testing and P1500 Standard."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "8th Asian Test Symposium 1999",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/1999",
                "sub_name": "8th Asian Test Symposium (ATS '99), 16-18 November 1999, Shanghai, China.",
                "count": 60,
                "papers": [
                    "A Method of Test Generation for Weakly Testable Data Paths Using Test Knowledge Extracted from RTL Description.",
                    "Automatic Test Pattern Generation for Improving the Fault Coverage of Microprocessors.",
                    "On Compact Test Sets for Multiple Stuck-at Faults for Large Circuits.",
                    "Identification of Feedback Bridging Faults with Oscillation.",
                    "Defining SRAM Resistive Defects and Their Simulation Stimuli.",
                    "Vector-Based Functional Fault Models for Delay Faults.",
                    "Easily Path Delay Fault Testable Non-Restoring Cellular Array Dividers.",
                    "March Tests for Word-Oriented Two-Port Memories.",
                    "An Evaluation of Test Generation Algorithms for combinational Circuits.",
                    "Research and Implementation of a High Speed Test Generation for Ultra Large Scale Combinational Circuits.",
                    "Pattern Sensitivity: A Property to Guide Test Generation for Combinational Circuits.",
                    "An Accurate Logic Threshold Voltages Determination Model for CMOS Gates to Facilitate Test Generation and Fault Simulation.",
                    "Circuit Partitioning for Low Power BIST Design with Minimized Peak Power Consumption.",
                    "A BIST TPG Approach for Interconnect Testing With the IEEE 1149.1 STD.",
                    "Test Scheduling with Loop Folding and Its Application to Test Configurations with Accumulators.",
                    "A Polynomial-Time Algorithm for Power Constrained Testing of Core Based Systems.",
                    "Accelerating Test Data Processin.",
                    "Procedure to Overcome the Byzantine General's Problem for Bridging Faults in CMOS Circuits.",
                    "A Novel Fault-Detection Technique for The Parallel Multipliers and Dividers.",
                    "A Fault Partitioning Method in Parallel Test Generation for Large Scale VLSI Circuits.",
                    "Fault Simulation Techniques to Reduce IDDQ Measurement Vectors for Sequential Circuits.",
                    "On an Effective Selection of IDDQ Measurement Vectors for Sequential Circuits.",
                    "Scan Chain Diagnosis Using IDDQ Current Measurement.",
                    "IDDQ Current Dependency on Test Vectors and Bridging Resistance.",
                    "A Parallel Generation System of Compact IDDQ Test Sets for Large Combinational Circuits.",
                    "An Effective Methodology for Mixed Scan and Reset Design Based on Test Generation and Structure of Sequential Circuits.",
                    "Genetic Algorithm Based Test Generation for Sequential Circuits.",
                    "Fault (In)Dependent Cost Estimates and Conflict-Directed Backtracking to Guide Sequential Circuit Test Generation.",
                    "Static and Dynamic Test Sequence Compaction Methods for Acyclic Sequential Circuits Using a Time Expansion Model.",
                    "Activation Function Manipulation for Fault Tolerant Feedforward Neural Networks.",
                    "Fault-Tolerant Analysis of Feedback Neural Networks with Threshold Neurons.",
                    "Fault-Tolerant Strategies and Their Design Methods for Application Software.",
                    "Test by Distributed Monitoring.",
                    "Optimized Statistical Analog Fault Simulation.",
                    "Analog Metrology and Stimulus Selection in a Noisy Environment.",
                    "Efficient Test Set Design for Analog and Mixed-Signal Circuits and Systems.",
                    "Railway Signaling Safety-critical Software Testing Based on Dynamic Decision Table.",
                    "A Novel Testing Approach for Safety-Critical Software.",
                    "How to Design an Environment Simulator for Safety Critical Software Testing.",
                    "New DFT Techniques of Non-Scan Sequential Circuits with Complete Fault Efficiency.",
                    "Identification of Redundant Crosspoint Faults in Sequential PLAs with Fault-Free Hardware Reset.",
                    "An Embedded Core DFT Scheme to Obtain Highly Compressed Test Sets.",
                    "Scenario Based Integration Testing for Object-Oriented Software Development.",
                    "An Approach to Testing the Nonexistence of Initial State in Z Specifications.",
                    "Generating Test Cases for Real-Time Software by Time Petri Nets Model.",
                    "Defect Level Prediction Using Multi-Model Fault Coverage.",
                    "A High-Level Synthesis Approach to Partial Scan Design Based on Acyclic Structure.",
                    "An Input Control Technique for Power Reduction in Scan Circuits During Test Application.",
                    "A Simplified Method for Testing the IBM Pipeline Partial-Scan Microprocessor.",
                    "A New Algorithm for Retiming-Based Partial Scan.",
                    "Intelligent EB Test System for Automatic VLSI Fault Tracing.",
                    "Multiple Fault Diagnosis in Logic Circuits Using EB Tester and Multiple/Single Fault Simulators.",
                    "Practical Application of Automated Fault Diagnosis for Stuck-at, Bridging, and Measurement Condition Dependent Faults in Fully Scanned Sequential Circuits.",
                    "Minimizing the Number of Programming Steps for Diagnosis of Interconnect Faults in FPGAs.",
                    "Minimizing the Number of Test Configurations for Different FPGA Families.",
                    "Testing the Logic Cells and Interconnect Resources for FPGAs.",
                    "IDDQ Testing of Input/Output Resources of SRAM-Based FPGAs.",
                    "Failure Analysis Case Studies Using the IR-OBIRCH (Infrared Optical Beam Induced Resistance CHange) Method.",
                    "Investigation of Ga Contamination Due to Analysis by Dual Beam FIB.",
                    "Failure Analysis Case Studies Using the IR-OBIRCH (Infrared Optical Beam Induced Resistance CHange) Method."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "7th Asian Test Symposium 1998",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/1998",
                "sub_name": "7th Asian Test Symposium (ATS '98), 2-4 December 1998, Singapore.",
                "count": 91,
                "papers": [
                    "The New Frontier for Testing: Nano Meter Technologies.",
                    "BIST Diagnostics, Part 1: Simulation Models.",
                    "Configuring Arithmetic Pattern Generators and Response Compactors from the RT-Modules of a Circuit.",
                    "Test Cycle Count Reduction in a Parallel Scan BIST Environment.",
                    "A BIST Scheme for Asynchronous Logic.",
                    "A Methodology for Minimum Area Cellular Automata Generation.",
                    "A High-Level Synthesis Method for Weakly Testable Data Paths.",
                    "Alleviating DFT Cost Using Testability Driven HLS.",
                    "Optimizing HW/SW Codesign towards Reliability for Critical-Application Systems.",
                    "An Efficient Procedure for Obtaining Implication Relations and Its Application to Redundancy Identification.",
                    "Economical Importance of the Maximum Chip Area.",
                    "A Probabilistic Model for Path Delay Faults.",
                    "A New Low-Cost Method for Identifying Untestable Path Delay Faults.",
                    "False-Path Removal Using Delay Fault Simulation.",
                    "An Automatic Test Pattern Generator for At-Speed Robust Path Delay Testing.",
                    "Delay Testing with Double Observations.",
                    "On a Logical Fault Model H1SGLF for Enhancing Defect Coverage.",
                    "Diagnosis of Single Gate Delay Faults in Combinational Circuits using Delay Fault Simulation.",
                    "On the Determination of Threshold Voltages for CMOS Gates to Facilitate Test Pattern Generation and Fault Simulation.",
                    "Fault Characterization of Low Capacitance Full-Swing BiCMOS Logic Circuits.",
                    "Rough-Hierarchical Testing for Safety Critical Software.",
                    "A Structured Testing Approach for DSP Software.",
                    "IDDQ Test Methodology and Tradeoffs for Scan/Non-Scan Designs.",
                    "Design for Diagnosability of CMOS Circuits.",
                    "IDDQ Defect Detection in Deep Submicron CMOS ICs.",
                    "ATE Features for IDDQ Testing.",
                    "A New Technique to Ensure Quality of Test Patterns.",
                    "Testing CPU Based Boards for Functionality Using Bus Cycle Signature System.",
                    "Non-Intrusive Testing of High-Speed CML Circuits.",
                    "Fast Window Test Method of Hysteresis Test.",
                    "Development of a Multi-Channel PC-Based Hard Disk Drive Bode-Plot Generator.",
                    "An Optimal Time Expansion Model Based on Combinational ATPG for RT level Circuits.",
                    "Static Test Compaction for Scan-Based Designs to Reduce Test Application Time.",
                    "A Non-Scan DFT Method for Controllers to Achieve Complete Fault Efficiency.",
                    "Complete Search in Test Generation for Industrial Circuits with Improved Bus-Conflict Detection.",
                    "On Testing of Josephson Logic Circuits Consisting of RSFQ Dual-Rail Logic Gates.",
                    "Testing for Floating Gates Defects in CMOS Circuits.",
                    "Electron Beam Tester Aided Fault Diagnosis for Logic Circuits Based on Sensitized Paths.",
                    "BIST TPG for Combinational Cluster (Glue Logic) Interconnect Testing at Board Level.",
                    "Fault Detection in a Tristate System Environment.",
                    "Comprehensive Interconnect BIST Methodology for Virtual Socket Interface.",
                    "A DFT Methodology for High-Speed MCM Based on Boundary-Scan Techniques.",
                    "SRAM-Based FPGA's: Testing the Interconnect/Logic Interface.",
                    "Built-In Self-Test for Multiple CLB Faults of a LUT Type FPGA.",
                    "A Diagnosis Method for Interconnects in SRAM Based FPGAs.",
                    "Testing and Diagnosis of Interconnect Structures in FPGAs.",
                    "An Approach to the On-Line Testing of Operational Amplifiers.",
                    "Self-Dual Duplication for Error Detection.",
                    "On-Line Error Detection Schemes for a Systolic Finite-Field Inverter.",
                    "Fault Tolerance of a Tree-Connected Multiprocessor System and its Arraylike Layout.",
                    "Observation Time Reduction for IDDQ Testing of Briding Faults in Sequential Circuits.",
                    "An Off-Chip Current Sensor for IDDQ Testing of CMOS ICs.",
                    "Integrated Current Sensing Device for Micro IDDQ Test.",
                    "A High-Speed IDDQ Sensor for Low-Voltage ICs.",
                    "Power Analysis of DRAMs.",
                    "Consequences of Port Restriction on Testing Address Decoders in Two-Port Memories.",
                    "Dynamic Power Supply Current Testing of SRAMs.",
                    "March PS(23N) Test for DRAM Pattern-Sensitive Faults.",
                    "Dynamic Test Set Generation for Analog Circuits and Systems.",
                    "DC Nonlinear Circuit Fault Simulation With Large Change Sensitivity.",
                    "BISTing Switched-Current Circuits.",
                    "Analog Module Metrology Using MNABST-1 P1149.4 Test Chip.",
                    "A Methodology and Design for Effective Testing of Voltage-Controlled Oscillators (VCOs.",
                    "Theory and Application of Multiple Attractor Cellular Automata for Fault Diagnosis.",
                    "Formal Design Techniques - Theory and Engineering Reality.",
                    "Verification of Asynchronous Circuits with Bounded Inertial Gate Delays.",
                    "Verification Pattern Generation for Core-Based Design Using Port Order Fault Model.",
                    "Application of Real-Time Temporal Logic to Design Fault Detection in Responsive Communication Protocols.",
                    "Design and Simulation of a RISC-Based 32-bit Embedded On-Board Computer.",
                    "A Ring Architecture Strategy for BIST Test Pattern Generation.",
                    "Exploiting BIST Approach for Two-Pattern Testing.",
                    "Evaluating BIST Architectures for Low Power.",
                    "A BIST Structure to Test Delay Faults in a Scan Environment.",
                    "An Examination of PRPG Selection Approaches for Large, Industrial Designs.",
                    "Test Generation for Synchronous Sequential Circuits to Reduce Storage Requirements.",
                    "Partitioning and Reordering Techniques for Static Test Sequence Compaction of Sequential Circuits.",
                    "Vector Restoration Using Accelerated Validation and Refinement.",
                    "On Speeding-Up Vector Restoration Based Static Compaction of Test Sequences for Sequential Circuits .",
                    "Synthesis of Sequential Circuits with Clock Control to Improve Testability.",
                    "A Test Pattern Generation Algorithm Exploiting Behavioral Information.",
                    "A Diagnostic Test Generation Procedure for Combinational Circuits Based on Test Elimination.",
                    "Special ATPG to Correlate Test Patterns for Low-Overhead Mixed-Mode BIST.",
                    "Test Pattern Generation for Column Compression Multiplier.",
                    "An Efficient Random-like Testing.",
                    "Microsystem Testing: Challenge or Common Knowledge?",
                    "Microsystems Testing: A Challenge.",
                    "Bridging the Gap between Microelectronics and Micromechanics Testing.",
                    "Testing Embedded Memories: Is BIST the Ultimate Solution?",
                    "An ASIC Designer's Point of View.",
                    "Testing of Embedded Memories - The Aggregate.",
                    "Answers to the Key Issues."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th Asian Test Symposium 1997",
        "info": "Akita, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/1997",
                "sub_name": "6th Asian Test Symposium (ATS '97), 17-18 November 1997, Akita, Japan.",
                "count": 66,
                "papers": [
                    "Embedded Test and Measurement Critical for Deep Submicron Technology.",
                    "On the Compaction of Test Sets Produced by Genetic Optimization.",
                    "On the Adders with Minimum Tests.",
                    "Test Generation for Stuck-On Faults in BDD-Based Pass-Transistor Logic SPL.",
                    "An Algorithmic Test Generation Method for Crosstalk Faults in Synchronous Sequential Circuits.",
                    "Guaranteeing Testability in Re-encoding for Low Power.",
                    "Automatic Testability Analysis of Boards and MCMs at Chip Level.",
                    "Design of C-Testable Multipliers Based on the Modified Booth Algorithm.",
                    "Testability Prediction for Sequential Circuits Using Neural Network.",
                    "A Genetic Algorithm for the Computation of Initialization Sequences for Synchronous Sequential Circuits.",
                    "Sequential Test Generation Based on Circuit Pseudo-Transformation.",
                    "Exploiting Logic Simulation to Improve Simulation-based Sequential ATPG.",
                    "TEMPLATES: A Test Generation Procedure for Synchronous Sequential Circuits.",
                    "Design and Implementation of Strongly Code-Disjoint CMOS Built-in Intermediate Voltage Sensor for Totally Self-Checking Circuits.",
                    "On fault injection approaches for fault tolerance of feedforward neural networks.",
                    "A concurrent fault-detection scheme for FFT processors.",
                    "Code-Disjoint Circuits for Parity Circuits.",
                    "Testability Features of R10000 Microprocessor.",
                    "Application of a Design for Delay Testability Approach to High Speed Logic LSIs.",
                    "An effective fault simulation method for core based LSI.",
                    "Integrated and Automated Design-for-Testability Implementation for Cell-Based ICs.",
                    "ATREX : Design for Testability System for Mega Gate LSIs.",
                    "On energy efficiency of VLSI testing.",
                    "ProTest: A Low Cost Rapid Prototyping Test System for ASICs and FPGAs.",
                    "Computing stress tests for interconnect defects.",
                    "Analysis of the Feasibility of Dynamic Thermal Testing in Digital Circuits.",
                    "A test processor chip implementing multiple seed, multiple polynomial linear feedback shift register.",
                    "Automatic EB Fault Tracing System by Successive Circuit Extraction from VLSI CAD Layout Data.",
                    "An approach to diagnose logical faults in partially observable sequential circuits.",
                    "Guided-Probe Diagnosis of Macro-Cell-Designed LSI Circuits.",
                    "A perturbation based fault modeling and simulation for mixed-signal circuits.",
                    "Static Testing of ADCs Using Wavelet Transforms.",
                    "Analog signal metrology for mixed signal ICs.",
                    "A New Auto-Focus Method in Critical Dimension Measurement SEM.",
                    "Novel Optical Probing System for Quarter-micron VLSI Circuits.",
                    "New Capabilities of OBIRCH Method for Fault Localization and Defect Detection.",
                    "On Acceleration of Logic Circuits Optimization Using Implication Relations.",
                    "A variable reordering method for fast optimization of binary decision diagrams.",
                    "On Decomposition of Kleene TDDs.",
                    "Testing for the programming circuit of LUT-based FPGAs.",
                    "A XOR-Tree Based Technique for Constant Testability of Configurable FPGAs.",
                    "Test Pattern and Test Configuration Generation Methodology for the Logic of RAM-Based FPGA.",
                    "An Algorithm for All-du-path Testing Coverage of Shared Memory Parallel Programs.",
                    "Estimating the Number of Faults using Simulator based on Generalized Stochastic Petri-Net Model.",
                    "On the Complexity of Universal Fault Diagnosis for Look-up Table FPGAs.",
                    "Fault Diagnosis for Static CMOS Circuits.",
                    "Fault diagnosis of odd-even sorting networks.",
                    "On The Tradeoff Between Number of Clocks and Number of Latches in Shift Registers.",
                    "Test Compaction in a Parallel Access Scan Environment.",
                    "A Partial Scan Design Method Based on n-Fold Line-up Structures.",
                    "On the capability of delay tests to detect bridges and opens.",
                    "A Method of Generating Tests for Marginal Delays an Delay Faults in Combinational Circuits.",
                    "Memory Efficient ATPG for Path Delay Faults.",
                    "Design of delay-verifiable combinational logic by adding extra inputs.",
                    "BIST testability enhancement using high level test synthesis for behavioral and structural designs.",
                    "On Chip Weighted Random Patterns.",
                    "Random Pattern Testable Design with Partial Circuit Duplication.",
                    "Accelerated Test Points Selection Method for Scan-Based BIST.",
                    "Power supply current monitoring techniques for testing PLLs.",
                    "Supply Current Test for Unit-to-unit Variations of Electrical Characteristics in Gates.",
                    "IDDT Testing.",
                    "Built-in current sensor designs based on the bulk-driven technique.",
                    "Test Length for Random Testing of Sequential Machines Application to RAMs.",
                    "Built-In Self-Test for Multi-Port RAMs.",
                    "An extended march test algorithm for embedded memories.",
                    "Low Cost Bist for Edac Circuits."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5th Asian Test Symposium 1996",
        "info": "Hsinchu, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/1996",
                "sub_name": "5th Asian Test Symposium (ATS '96), November 20-22, 1996, Hsinchu, Taiwan.",
                "count": 49,
                "papers": [
                    "\"Challenges in Testing\".",
                    "Redundancy Identification Using Transitive Closure.",
                    "Invalid State Identification for Sequential Circuit Test Generation.",
                    "On Test Generation for Interconnected Finite-State Machines: The Input Sequence Propagation Problem.",
                    "Hierarchical Test Generation with Built-In Fault Diagnosis.",
                    "Circuit Partitioned Automatic Test Pattern Generation Constrained by Three-State Buses and Restrictors.",
                    "E-Groups: A New Technique for Fast Backward Propagation in System Level Test Generation.",
                    "Efficient Path Delay Fault Test Generation Algorithms for Weighted Random Robust Testing.",
                    "Hybrid Pin Control Using Boundary-Scan And Its Applications.",
                    "Hierarchical Testing Using the IEEE Std 1149.5 Module Test and Maintenance Slave Interface Module.",
                    "Testing And Diagnosis Of Board Interconnects In Microprocessor-Based Systems.",
                    "Syndrome Simulation And Syndrome Test For Unscanned Interconnects.",
                    "A Test Methodology for Interconnect Structures of LUT-based FPGAs.",
                    "Testable Design and Testing of MCMs Based on Multifrequency Scan.",
                    "A Consistent Scan Design System for Large-Scale ASICs.",
                    "A Design for testability Method Using RTL Partitioning.",
                    "Partially Parallel Scan Chain for Test Length Reduction by Using Retiming Technique.",
                    "Combination Of Automatic Test Pattern Generation And Built-In Intermediate Voltage Sensing For Detecting CMOS Bridging Faults.",
                    "On Design of Fail-Safe Cellular Arrays.",
                    "Concurrent Error Detection and Fault Location in a Fast ATM Switch.",
                    "Formal Verification Of Self-Testing Properties Of Combinational Circuits.",
                    "Constructing an Edge-Route Guaranteed Optimal Fault-Tolerant Routing for Biconnected Graphs.",
                    "An Approach To The Synthesis Of Synchronizable Finite State Machines With Partial Scan.",
                    "Waveform Polynomial Manipulation Using Bdds.",
                    "Easily Testable Data Path Allocation Using Input/Output Registers.",
                    "AND/EXOR based Synthesis of Testable KFDD-Circuits with Small Depth.",
                    "Minimal Delay Test Sets for Unate Gate Networks.",
                    "Two Modeling Techniques For CMOS Circuits To Enhance Test Generation And Fault Simulation For Bridging Faults.",
                    "Algorithmic Test Generation for Supply Current Testing of TTL Combinational Circuits.",
                    "An Efficient Compact Test Generator for IDDQ Testing.",
                    "Realistic Linked Memory Cell Array Faults.",
                    "On Current Testing of Josephson Logic Circuits Using the 4JL Gate Family.",
                    "Built-In Self Test for Analog and Mixed-Signal Designs.",
                    "An Efficient PRPG Strategy By Utilizing Essential Faults.",
                    "DP-BIST: A Built-In Self Test For DSP DataPaths A Low Overhead and High Fault Coverage Technique.",
                    "A MISR Computation Algorithm for Fast Signature Simulation.",
                    "BIST Testability Enhancement of System Level Circuits : Experience with An Industrial Design.",
                    "Low-Complexity Fault Diagnosis Under the Multiple Observation Time Testing Approach.",
                    "Efficient Multifrequency Analysis of Fault Diagnosis in Analog Circuits Based on Large Change Sensitivity Computation.",
                    "A Practical Implementation Of Dynamic Testing Of An Ad Converter.",
                    "Comparison Diagnosis in Large Multiprocessor Systems.",
                    "Lessons Learned from Practical Applications of BIST/B-S Technology.",
                    "Yield Improvement by Test Error Cancellation.",
                    "A Pragmatic, Systematic And Flexible Synthesis For Testability Methodology.",
                    "A New Model with Time Constraints for Conformance Testing of Communication Protocols.",
                    "Test Generation Of Analog Switched-Current Circuits.",
                    "Thermal Monitoring Of Safety-Critical Integrated Systems.",
                    "A New Scheme For The Fault Diagnosis Of Multiprocessor Systems.",
                    "On-Line Testing In Digital Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4th Asian Test Symposium 1995",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ats/1995",
                "sub_name": "4th Asian Test Symposium (ATS '95), November 23-24, 1995. Bangalore, India.",
                "count": 59,
                "papers": [
                    "Distributed off-line testing of parallel systems.",
                    "An SBus Multi-Tracer and its applications.",
                    "Exploitation of parallelism in group probing for testing massively parallel processing systems.",
                    "A cellular array designed from a Multiple-valued Decision Diagram and its fault tests.",
                    "Boolean process-an analytical approach to circuit representation (II).",
                    "Fanout fault analysis for digital logic circuits.",
                    "Metastability evaluation method by propagation delay distribution measurement.",
                    "An approach to hierarchy model checking via evaluating CTL hierarchically.",
                    "Transistor leakage fault location with ZDDQ measurement.",
                    "Enhancing multiple fault diagnosis in combinational circuits based on sensitized paths and EB testing.",
                    "A simple technique for locating gate-level faults in combinational circuits.",
                    "A fault location technique and alternate routing in Benes network.",
                    "Overhead reduction techniques for hierarchical fault simulation.",
                    "On the simulation of Multiple Stuck-at Faults using Multiple Domain Concurrent and Comparative Simulation.",
                    "Fast fault simulation for BIST applications.",
                    "Serial transistor network modeling for bridging fault simulation.",
                    "Hardware-accelerated concurrent fault simulation: eventflow computing versus dataflow computing.",
                    "A design-for-test technique for multistage analog circuits.",
                    "DC control and observation structures for analog circuits.",
                    "A new method for testing mixed analog and digital circuits.",
                    "On the development of power supply voltage control testing technique for analogue circuits.",
                    "Tolerance DC bands of CMOS operational amplifier.",
                    "Theory and applications of cellular automata for synthesis of easily testable combinational logic.",
                    "Unified scan design with scannable memory arrays.",
                    "Test configurations to enhance the testability of sequential circuits.",
                    "Test sequence compaction by reduced scan shift and retiming.",
                    "Testable design of non-scan sequential circuits using extra logic.",
                    "Training diploma students on ATE-related module.",
                    "Panel: New Research Problems in the Emerging Test Technology.",
                    "A STAFAN-like functional testability measure for register-level circuits.",
                    "Testability forecasting for sequential circuits.",
                    "Testability analysis of co-designed systems.",
                    "Generator choices for delay test.",
                    "Static compaction for two-pattern test sets.",
                    "Identification of robust untestable path delay faults.",
                    "An improved hierarchical test generation technique for combinational circuits with repetitive sub-circuits.",
                    "Deterministic test generation for non-classical faults on the gate level.",
                    "A parallel sequential test generation system DESCARTES based on real-valued logic simulation.",
                    "Universal test complexity of field-programmable gate arrays.",
                    "Software transformations for sequential test generation.",
                    "Module level weighted random patterns.",
                    "A programmable multiple-sequence generator for BIST applications.",
                    "An effective BIST design for PLA.",
                    "Fast computation of C-MISR signatures.",
                    "An effective BIST scheme for carry-save and carry-propagate array multipliers.",
                    "Error masking in compact testing based on the Hamming code and its modifications.",
                    "An efficient comparative concurrent Built-In Self-Test technique.",
                    "Totally Self Checking reconfigurable duplication system with separate internal fault indication.",
                    "Generalized modular design of testable m-out-of-n code checker.",
                    "A graph coloring based approach for self-checking logic circuit design.",
                    "Generation of tenacious tests for small gate delay faults in combinational circuits.",
                    "Functional test generation for path delay faults.",
                    "Flip-flop sharing in standard scan path to enhance delay fault testing of sequential circuits.",
                    "Sequential logic path delay test generation by symbolic analysis.",
                    "Low power design and its testability.",
                    "Power supply current detectability of SRAM defects.",
                    "Fast functional testing of delay-insensitive circuits.",
                    "DFT for fast testing of self-timed control circuits.",
                    "Testing of a parallel ternary multiplier using I2L logic."
                ]
            }
        ]
    }
]