[
    {
        "year": "2021",
        "name": "CASES 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2021",
                "sub_name": "CASES '21: Proceedings of the 2021 International Conference on Compilers, Architectures, and Synthesis for Embedded Systems, Virtual Event, October 8 - 15, 2021.",
                "count": 2,
                "papers": [
                    "Fast generation of optimized execution plans for parameterizable CNN accelerators: work-in-progress.",
                    "Multiple approximate instances in neural processing units for energy-efficient circuit synthesis: work-in-progress."
                ]
            },
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: ACM Trans. Embed. Comput. Syst. 20(5s)",
                "count": 116,
                "papers": [
                    "Minimization of WCRT with Recovery Assurance from Hardware Trojans for Tasks on FPGA-based Cloud.",
                    "A TCAM-based Caching Architecture Framework for Packet Classification.",
                    "Generalized Weakly Hard Schedulability Analysis for Real-Time Periodic Tasks.",
                    "Adaptive Task Allocation and Scheduling on NoC-based Multicore Platforms with Multitasking Processors.",
                    "Improving the Performance of Hybrid Caches Using Partitioned Victim Caching.",
                    "Golden Chip-Free Trojan Detection Leveraging Trojan Trigger's Side-Channel Fingerprinting.",
                    "Verifying the Safety of Autonomous Systems with Neural Network Controllers.",
                    "MAGNETO: Fingerprinting USB Flash Drives via Unintentional Magnetic Emissions.",
                    "Analytical Program Power Characterization for Battery Depletion-time Estimation.",
                    "ForSyDe-Atom: Taming Complexity in Cyber Physical System Design with Layers.",
                    "Heuristic Computation Offloading Algorithms for Mobile Users in Fog Computing.",
                    "Optimization of Signal Processing Applications Using Parameterized Error Models for Approximate Adders.",
                    "Reducing Energy in GPGPUs through Approximate Trivial Bypassing.",
                    "Probabilistic Estimation of Threat Intrusion in Embedded Systems for Runtime Detection.",
                    "Facilitating Human Activity Data Annotation via Context-Aware Change Detection on Smartwatches.",
                    "Lane Compression: A Lightweight Lossless Compression Method for Machine Learning on Embedded Systems.",
                    "Beyond Cache Attacks: Exploiting the Bus-based Communication Structure for Powerful On-Chip Microarchitectural Attacks.",
                    "Editorial: Reimagining ACM Transactions on Embedded Computing Systems (TECS).",
                    "Real-time, High-resolution Depth Upsampling on Embedded Accelerators.",
                    "SIKE in 32-bit ARM Processors Based on Redundant Number System for NIST Level-II.",
                    "Code-size-aware Scheduling of Synchronous Dataflow Graphs on Multicore Systems.",
                    "Cooperative Coevolution-based Design Space Exploration for Multi-mode Dataflow Mapping.",
                    "Improving Performance-Power-Programmability in Space Avionics with Edge Devices: VBN on Myriad2 SoC.",
                    "UBAR: User- and Battery-aware Resource Management for Smartphones.",
                    "Sense Your Power: The ECO Approach to Energy Awareness for IoT Devices.",
                    "Precise Cache Profiling for Studying Radiation Effects.",
                    "Microcontroller Fingerprinting Using Partially Erased NOR Flash Memory Cells.",
                    "Introduction to the Special Issue on Specification and Design Languages (FDL 2019).",
                    "Test Generation for Hardware Trojan Detection Using Correlation Analysis and Genetic Algorithm.",
                    "Efficient External Sorting for Memory-Constrained Embedded Devices with Flash Memory.",
                    "LPWAN in the TV White Spaces: A Practical Implementation and Deployment Experiences.",
                    "SystemC Implementation of Stochastic Petri Nets for Simulation and Parameterization of Biological Networks.",
                    "Design Space Exploration for Secure IoT Devices and Cyber-Physical Systems.",
                    "Interactive Programmatic Modeling.",
                    "Time Measurement and Control Blocks for Bare-Metal C++ Applications.",
                    "Event-B Hybridation: A Proof and Refinement-based Framework for Modelling Hybrid Systems.",
                    "Toward a Lingua Franca for Deterministic Concurrent Systems.",
                    "Toward Object-oriented Modeling in SCCharts.",
                    "Determinism.",
                    "Improving Power of DSP and CNN Hardware Accelerators Using Approximate Floating-point Multipliers.",
                    "Integrated Hardware Garbage Collection.",
                    "Reliability-aware Scheduling and Routing for Messages in Time-sensitive Networking.",
                    "A Composable Monitoring System for Heterogeneous Embedded Platforms.",
                    "Skills Gaps in the Industry: Opinions of Embedded Software Practitioners.",
                    "TAMA: Turn-aware Mapping and Architecture - A Power-efficient Network-on-Chip Approach.",
                    "SLAQA: Quality-level Aware Scheduling of Task Graphs on Heterogeneous Distributed Systems.",
                    "A Distributed Real-time Scheduling System for Industrial Wireless Networks.",
                    "The Predictable Execution Model in Practice: Compiling Real Applications for COTS Hardware.",
                    "SEAMS: Self-Optimizing Runtime Manager for Approximate Memory Hierarchies.",
                    "Symbolic Loop Compilation for Tightly Coupled Processor Arrays.",
                    "Two Birds With One Stone: Boosting Both Search and Write Performance for Tree Indices on Persistent Memory.",
                    "CICERO: A Domain-Specific Architecture for Efficient Regular Expression Matching.",
                    "You Only Traverse Twice: A YOTT Placement, Routing, and Timing Approach for CGRAs.",
                    "RiSA: A Reinforced Systolic Array for Depthwise Convolutions and Embedded Tensor Reshaping.",
                    "MARCO: A High-performance Task Mapping and Routing Co-optimization Framework for Point-to-Point NoC-based Heterogeneous Computing Systems.",
                    "Learning to Train CNNs on Faulty ReRAM-based Manycore Accelerators.",
                    "On-device Prior Knowledge Incorporated Learning for Personalized Atrial Fibrillation Detection.",
                    "ROBIN: A Robust Optical Binary Neural Network Accelerator.",
                    "Comparative Analysis and Enhancement of CFG-based Hardware-Assisted CFI Schemes.",
                    "Synergistically Exploiting CNN Pruning and HLS Versioning for Adaptive Inference on Multi-FPGAs at the Edge.",
                    "Domain-specific Hybrid Mapping for Energy-efficient Baseband Processing in Wireless Networks.",
                    "Heterogeneity-aware Multicore Synchronization for Intermittent Systems.",
                    "Prepare: Power-Aware Approximate Real-time Task Scheduling for Energy-Adaptive QoS Maximization.",
                    "FLASH: Fast Neural Architecture Search with Hardware Optimization.",
                    "Intermittent-Aware Neural Architecture Search.",
                    "Hardware Performance Counters: Ready-Made vs Tailor-Made.",
                    "HW-FlowQ: A Multi-Abstraction Level HW-CNN Co-design Quantization Methodology.",
                    "LATTE: LSTM Self-Attention based Anomaly Detection in E mbedded Automotive Platforms.",
                    "SIAM: Chiplet-based Scalable In-Memory Acceleration with Mesh for Deep Neural Networks.",
                    "Data Pattern Aware Reliability Enhancement Scheme for 3D Solid-State Drives.",
                    "REPAIR: Control Flow Protection based on Register Pairing Updates for SW-Implemented HW Fault Tolerance.",
                    "Algorithm-hardware Co-design of Attention Mechanism on FPGA Devices.",
                    "MARS: mmWave-based Assistive Rehabilitation System for Smart Healthcare.",
                    "Exploring Efficient Architectures on Remote In-Memory NVM over RDMA.",
                    "Chauffeur: Benchmark Suite for Design and End-to-End Analysis of Self-Driving Vehicles on Embedded Systems.",
                    "SAGE: A Split-Architecture Methodology for Efficient End-to-End Autonomous Vehicle Control.",
                    "SNR: Squeezing Numerical Range Defuses Bit Error Vulnerability Surface in Deep Neural Networks.",
                    "Exploiting Activation Sparsity for Fast CNN Inference on Mobile GPUs.",
                    "MaxTracker: Continuously Tracking the Maximum Computation Progress for Energy Harvesting ReRAM-based CNN Accelerators.",
                    "Real-time Attack-recovery for Cyber-physical Systems Using Linear-quadratic Regulator.",
                    "Specification Guided Automated Synthesis of Feedback Controllers.",
                    "Regime Inference for Sound Floating-Point Optimizations.",
                    "Towards an Integrated Vehicle Management System in DriveOS.",
                    "Rtkaller: State-aware Task Generation for RTOS Fuzzing.",
                    "Declarative Power Sequencing.",
                    "Tolerating Defects in Low-Power Neural Network Accelerators Via Retraining-Free Weight Approximation.",
                    "A Hierarchical Hybrid Locking Protocol for Parallel Real-Time Tasks.",
                    "Federated Scheduling of Sporadic DAGs on Unrelated Multiprocessors.",
                    "HEART: Hybrid Memory and Energy-Aware Real-Time Scheduling for Multi-Processor Systems.",
                    "Schedulability Analysis for Timed Automata With Tasks.",
                    "Killing Processes or Killing Flash? Escaping from the Dilemma Using Lightweight, Compression-Aware Swap for Mobile Devices.",
                    "PHiLIP on the HiL: Automated Multi-Platform OS Testing With External Reference Devices.",
                    "Compositional Learning and Verification of Neural Network Controllers.",
                    "Structured Proofs for Adversarial Cyber-Physical Systems.",
                    "Precise Correlation Extraction for IoT Fault Detection With Concurrent Activities.",
                    "Improving Variational Autoencoder based Out-of-Distribution Detection for Embedded Real-time Applications.",
                    "Guaranteeing Timely Response to Changes of Monitored Objects by Assigning Deadlines and Periods to Tasks.",
                    "Thermal-aware Adaptive Platform Management for Heterogeneous Embedded Systems.",
                    "Verified Lustre Normalization with Node Subsampling.",
                    "Learning Nondeterministic Real-Time Automata.",
                    "Cross-Layer Adaptation with Safety-Assured Proactive Task Job Skipping.",
                    "Predictive Monitoring with Logic-Calibrated Uncertainty for Cyber-Physical Systems.",
                    "Synthesis-guided Adversarial Scenario Generation for Gray-box Feedback Control Systems with Sensing Imperfections.",
                    "RT-ZooKeeper: Taming the Recovery Latency of a Coordination Service.",
                    "Excluding Parallel Execution to Improve Global Fixed Priority Response Time Analysis.",
                    "MSYNC: A Generalized Formal Design Pattern for Virtually Synchronous Multirate Cyber-physical Systems.",
                    "HMDS: A Makespan Minimizing DAG Scheduler for Heterogeneous Distributed Systems.",
                    "Worst-case Execution Time Calculation for Query-based Monitors by Witness Generation.",
                    "An Interpretable Machine Learning Model Enhanced Integrated CPU-GPU DVFS Governor.",
                    "Horizontal Auto-Scaling for Multi-Access Edge Computing Using Safe Reinforcement Learning.",
                    "Horizontal Side-Channel Vulnerabilities of Post-Quantum Key Exchange and Encapsulation Protocols.",
                    "Hardware Acceleration for Embedded Keyword Spotting: Tutorial and Survey.",
                    "Mapping Computations in Heterogeneous Multicore Systems with Statistical Regression on Program Inputs.",
                    "Verifying Stochastic Hybrid Systems with Temporal Logic Specifications via Model Reduction.",
                    "Adaptive Computation Reuse for Energy-Efficient Training of Deep Neural Networks.",
                    "IoT-Fog-Cloud Centric Earthquake Monitoring and Prediction."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "CASES 2020",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2020",
                "sub_name": "International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2020, Singapore, September 20-25, 2020.",
                "count": 7,
                "papers": [
                    "Run-Time Accuracy Reconfigurable Stochastic Computing for Dynamic Reliability and Power Management: Work-in-Progress.",
                    "Work-in-Process: Smart Migration for Reliability Enhancement of 3D TLC NAND Flash Storage Systems.",
                    "A Lifelong Health Monitoring Framework in Processors: Work-in-Progress.",
                    "The Shift PUF: Technique for Squaring the Machine Learning Complexity of Arbiter-based PUFs: Work-in-Progress.",
                    "Towards Quality-Driven Approximate Software Generation for Accurate Hardware: Work-in-Progress.",
                    "Page Reuse in Cyclic Thrashing of GPU Under Oversubscription: Work-in-Progress.",
                    "Effective Profiling for Data-Intensive GPU Programs: Work-in-Progress."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "CASES 2019",
        "info": "New York City, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2019",
                "sub_name": "2019 International Conference on Compliers, Architectures and Synthesis for Embedded Systems, CASES 2019, Work in Progress Papers, New York, NY, USA, October 13-18, 2019.",
                "count": 11,
                "papers": [
                    "Reconfigurable accelerator on FPGA for scientific computing : From a space-borne instrument to a high-performance computing data center.",
                    "Automatic Generation of Application-Specific FPGA Overlays.",
                    "Flexible Group-Level Pruning of Deep Neural Networks for Fast Inference on Mobile GPUs.",
                    "SAT to SAT-Hard Clause Translator.",
                    "Fine-Grained Acceleration using Runtime Integrated Custom Execution (RICE).",
                    "Sequence-Crafter: Side-Channel Entropy Minimization to Thwart Timing-based Side-Channel Attacks.",
                    "Porting new Versatile Video Coding transforms to a heterogeneous GPU-based technology.",
                    "MicroArchitectural Events and Image Processing-based Hybrid Approach for Robust Malware Detection.",
                    "Computation Offloading of Acoustic Model for Client-Edge-Based Speech-Recognition.",
                    "ECC Management with Rate Compatible LDPC Code for NAND Flash Storage.",
                    "Mitigating Write Disturbance in Phase Change Memory Architectures."
                ]
            },
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: ACM Trans. Embed. Comput. Syst. 18(5s)",
                "count": 126,
                "papers": [
                    "Editorial: Human Factors in Embedded Computing.",
                    "Guest Editorial: Special Issue of ACM TECS on the ACM-IEEE International Conference on Formal Methods and Models for System Design (MEMOCODE 2017).",
                    "Stochastic Assume-Guarantee Contracts for Cyber-Physical System Design.",
                    "Mining Missing Assumptions from Counter-Examples.",
                    "Model-based, Mutation-driven Test-case Generation Via Heuristic-guided Branching Search.",
                    "Compositional Dataflow Circuits.",
                    "The Mechanized Marriage of Effects and Monads with Applications to High-assurance Hardware.",
                    "Quantifying the Information Leakage in Cache Attacks via Symbolic Execution.",
                    "EACAN: Reliable and Resource-Efficient CAN Communications.",
                    "The Bionode: A Closed-Loop Neuromodulation Implant.",
                    "Scratchpad-Memory Management for Multi-Threaded Applications on Many-Core Architectures.",
                    "Control Flow Checking or Not? (for Soft Errors).",
                    "Combining PUF with RLUTs: A Two-party Pay-per-device IP Licensing Scheme on FPGAs.",
                    "Synergy: An HW/SW Framework for High Throughput CNNs on Embedded Heterogeneous SoC.",
                    "Stigmergy-Based Security for SoC Operations From Runtime Performance Degradation of SoC Components.",
                    "Cache Reconfiguration Using Machine Learning for Vulnerability-aware Energy Optimization.",
                    "Single- and Multi-FPGA Acceleration of Dense Stereo Vision for Planetary Rovers.",
                    "FPGA Implementation of the ECC Over GF(2m) for Small Embedded Applications.",
                    "Chimp: A Learning-based Power-aware Communication Protocol for Wireless Body Area Networks.",
                    "Editorial: Reflections on the History of Cyber-Physical versus Embedded Systems.",
                    "BlueIO: A Scalable Real-Time Hardware I/O Virtualization System for Many-core Embedded Systems.",
                    "Design-Level and Code-Level Security Analysis of IoT Devices.",
                    "A Survey of Asynchronous Programming Using Coroutines in the Internet of Things and Embedded Systems.",
                    "Introduction to the Special Issue on Cryptographic Engineering for Internet of Things: Security Foundations, Lightweight Solutions, and Attacks.",
                    "Lightweight Implementations of NIST P-256 and SM2 ECC on 8-bit Resource-Constraint Embedded Device.",
                    "Compact and Flexible FPGA Implementation of Ed25519 and X25519.",
                    "XOR-Based Low-Cost Reconfigurable PUFs for IoT Security.",
                    "Ensuring Secure Application Execution and Platform-Specific Execution in Embedded Devices.",
                    "A Lightweight and Secure Data Collection Serverless Protocol Demonstrated in an Active RFIDs Scenario.",
                    "A Lightweight Cryptographic Protocol with Certificateless Signature for the Internet of Things.",
                    "Catching Escapers: A Detection Method for Advanced Persistent Escapers in Industry Internet of Things Based on Identity-based Broadcast Encryption (IBBE).",
                    "Editorial: Adversaries and Robustness.",
                    "Optimal Power Management with Guaranteed Minimum Energy Utilization for Solar Energy Harvesting Systems.",
                    "Contention-Detectable Mechanism for Receiver-Initiated MAC.",
                    "NQA: A Nested Anti-collision Algorithm for RFID Systems.",
                    "A Task Failure Rate Aware Dual-Channel Solar Power System for Nonvolatile Sensor Nodes.",
                    "Enabling On-the-Fly Hardware Tracing of Data Reads in Multicores.",
                    "Partitioning and Selection of Data Consistency Mechanisms for Multicore Real-Time Systems.",
                    "Thermal-aware Real-time Scheduling Using Timed Continuous Petri Nets.",
                    "Self-Adaptive QoS Management of Computation and Communication Resources in Many-Core SoCs.",
                    "Cooperative Cache Transfer-based On-demand Network Coded Broadcast in Vehicular Networks.",
                    "Optimization and Implementation of Wavelet-based Algorithms for Detecting High-voltage Spindles in Neuron Signals.",
                    "A Closed-Loop Controller to Ensure Performance and Temperature Constraints for Dynamic Applications.",
                    "GRec: Automatic Computation of Reconfiguration Graphs for Multi-core Platforms.",
                    "Sample Essentiality and Its Application to Modeling Attacks on Arbiter PUFs.",
                    "Power-mode-aware Memory Subsystem Optimization for Low-power System-on-Chip Design.",
                    "Distill-Net: Application-Specific Distillation of Deep Convolutional Neural Networks for Resource-Constrained IoT Platforms.",
                    "Response Time Analysis for Tasks with Fixed Preemption Points under Global Scheduling.",
                    "TF-Net: Deploying Sub-Byte Deep Neural Networks on Microcontrollers.",
                    "Aggressive Energy Reduction for Video Inference with Software-only Strategies.",
                    "CompAct: On-chip <underline>Com</underline>pression of <underline>Act</underline>ivations for Low Power Systolic Array Based CNN Acceleration.",
                    "ECAx: Balancing Error Correction Costs in Approximate Accelerators.",
                    "An Ultra-Low Energy Human Activity Recognition Accelerator for Wearable Health Applications.",
                    "CASCADE: High Throughput Data Streaming via Decoupled Access-Execute CGRA.",
                    "Is Your Bus Arbiter Really Fair? Restoring Fairness in AXI Interconnects for FPGA SoCs.",
                    "Analytical Performance Models for NoCs with Multiple Priority Traffic Classes.",
                    "Enabling and Exploiting Partition-Level Parallelism (PALP) in Phase Change Memories.",
                    "Synterface: Efficient Chip-to-World Interfacing for Flow-Based Microfluidic Biochips Using Pin-Count Minimization.",
                    "Output-based Intermediate Representation for Translation of Test-pattern Program.",
                    "READY: A Fine-Grained Multithreading Overlay Framework for Modern CPU-FPGA Dataflow Applications.",
                    "Multi-objective Exploration for Practical Optimization Decisions in Binary Translation.",
                    "End-to-End Timing Analysis of Sporadic Cause-Effect Chains in Distributed Systems.",
                    "High-Level Synthesis of Approximate Designs under Real-Time Constraints.",
                    "Locking the Design of Building Blocks for Quantum Circuits.",
                    "SWARAM: Portable Energy and Cost Efficient Embedded System for Genomic Processing.",
                    "AuthCropper: Authenticated Image Cropper for Privacy Preserving Surveillance Systems.",
                    "Optode Design Space Exploration for Clinically-robust Non-invasive Fetal Oximetry.",
                    "PredictNcool: Leakage Aware Thermal Management for 3D Memories Using a Lightweight Temperature Predictor.",
                    "RMW-F: A Design of RMW-Free Cache Using Built-in NAND-Flash for SMR Storage.",
                    "Enabling Sequential-write-constrained B+-tree Index Scheme to Upgrade Shingled Magnetic Recording Storage Performance.",
                    "Achieving Super-Linear Speedup across Multi-FPGA for Real-Time DNN Inference.",
                    "Achieving Lossless Accuracy with Lossy Programming for Efficient Neural-Network Training on NVM-Based Systems.",
                    "DWMAcc: Accelerating Shift-based CNNs with Domain Wall Memories.",
                    "dMazeRunner: Executing Perfectly Nested Loops on Dataflow Accelerators.",
                    "Compositional Design of Multi-Robot Systems Control Software on ROS.",
                    "Accumulative Display Updating for Intermittent Systems.",
                    "FLORA: FLoorplan Optimizer for Reconfigurable Areas in FPGAs.",
                    "HESSLE-FREE: <u>He</u>terogeneou<u>s</u> <u>S</u>ystems <u>Le</u>veraging <u>F</u>uzzy Control for <u>R</u>untim<u>e</u> Resourc<u>e</u> Management.",
                    "Unified Testing and Security Framework for Wireless Network-on-Chip Enabled Multi-Core Chips.",
                    "Cache Locking Content Selection Algorithms for ARINC-653 Compliant RTOS.",
                    "MOOS: A Multi-Objective Design Space Exploration and Optimization Framework for NoC Enabled Manycore Systems.",
                    "IGOR, Get Me the Optimum! Prioritizing Important Design Decisions During the DSE of Embedded Systems.",
                    "Analyzing Variable Entanglement for Parallel Simulation of SystemC TLM-2.0 Models.",
                    "Efficient Tracing Methodology Using Automata Processor.",
                    "Alleria: An Advanced Memory Access Profiling Framework.",
                    "Memory- and Communication-Aware Model Compression for Distributed Deep Learning Inference on IoT.",
                    "Quality/Latency-Aware Real-time Scheduling of Distributed Streaming IoT Applications.",
                    "Deriving Equations from Sensor Data Using Dimensional Function Synthesis.",
                    "A Dual-Mode Strategy for Performance-Maximisation and Resource-Efficient CPS Design.",
                    "Coherent Extension, Composition, and Merging Operators in Contract Models for System Design.",
                    "Efficient Decentralized LTL Monitoring Framework Using Tableau Technique.",
                    "FPGA Stream-Monitoring of Real-time Properties.",
                    "Will My Program Break on This Faulty Processor?: Formal Analysis of Hardware Fault Activations in Concurrent Embedded Software.",
                    "Thermal-Aware Scheduling for Integrated CPUs-GPU Platforms.",
                    "Timing-Anomaly Free Dynamic Scheduling of Conditional DAG Tasks on Multi-Core Systems.",
                    "Statistical Verification of Hyperproperties for Cyber-Physical Systems.",
                    "Polar: Function Code Aware Fuzz Testing of ICS Protocol.",
                    "Structural Test Coverage Criteria for Deep Neural Networks.",
                    "Graph-Based Modeling, Scheduling, and Verification for Intersection Management of Intelligent Vehicles.",
                    "Specification Mining and Robust Design under Uncertainty: A Stochastic Temporal Logic Approach.",
                    "Robust Reachable Set: Accounting for Uncertainties in Linear Dynamical Systems.",
                    "Counterexample Guided Abstraction Refinement for Polyhedral Probabilistic Hybrid Systems.",
                    "Aggregation Strategies in Reachable Set Computation of Hybrid Systems.",
                    "Memory-Efficient Mixed-Precision Implementations for Robust Explicit Model Predictive Control.",
                    "Numerical Representation of Directed Acyclic Graphs for Efficient Dataflow Embedded Resource Allocation.",
                    "Honey, I Shrunk the ELFs: Lightweight Binary Tailoring of Shared Libraries.",
                    "MxU: Towards Predictable, Flexible, and Efficient Memory Access Control for the Secure IoT.",
                    "Treble: Fast Software Updates by Creating an Equilibrium in an Active Software Ecosystem of Globally Distributed Stakeholders.",
                    "Safety Verification of Cyber-Physical Systems with Reinforcement Learning Control.",
                    "ReachNN: Reachability Analysis of Neural-Network Controlled Systems.",
                    "Worst-case Satisfaction of STL Specifications Using Feedforward Neural Network Controllers: A Lagrange Multipliers Approach.",
                    "Code-Inherent Traffic Shaping for Hard Real-Time Systems.",
                    "Techniques and Analysis for Mixed-criticality Scheduling with Mode-dependent Server Execution Budgets.",
                    "Parametric Scheduler Characterization.",
                    "Editorial: Embedded Computing and Society.",
                    "CxDNN: Hardware-software Compensation Methods for Deep Neural Networks on Resistive Crossbar Systems.",
                    "Overcoming Security Vulnerabilities in Deep Learning-based Indoor Localization Frameworks on Mobile Devices.",
                    "REAL: REquest Arbitration in Last Level Caches.",
                    "Robust Design and Validation of Cyber-physical Systems.",
                    "BTMonitor: Bit-time-based Intrusion Detection and Attacker Identification in Controller Area Network.",
                    "Hardware-Software Collaborative Thermal Sensing in Optical Network-on-Chip-based Manycore Systems.",
                    "ICNN: The Iterative Convolutional Neural Network.",
                    "Tÿcho: A Framework for Compiling Stream Programs.",
                    "Weakly-hard Real-time Guarantees for Earliest Deadline First Scheduling of Independent Tasks.",
                    "ALEXIA: A Processor with Lightweight Extensions for Memory Safety.",
                    "Toward Customized Hybrid Fuel-Cell and Battery-powered Mobile Device for Individual Users."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "CASES 2018",
        "info": "Torino, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2018",
                "sub_name": "Proceedings of the International Conference on Compilers, Architecture and Synthesis for Embedded Systems, CASES 2018, Torino, Italy, September 30 - October 05, 2018.",
                "count": 14,
                "papers": [
                    "Maximizing I/O throughput and minimizing performance variation via reinforcement learning based I/O merging for SSDs: work-in-progress.",
                    "Persistence improvement for distributed cache with NVM based storage system: work-in-progress.",
                    "Multiple alignment of packet sequences for efficient communication in a many-core neuromorphic system: work-in-progress.",
                    "Impact of graph partitioning on SNN placement for a multi-core neuromorphic architecture: work-in-progress.",
                    "A partitioning strategy for exploring error-resilience in circuits: work-in-progress.",
                    "An confidentiality and integrity scheme for the distributed shared memory of embedded multi-core system: work in progress.",
                    "GeMS: a generator for modulo scheduling problems: work in progress.",
                    "Communication-aware scheduling of data-parallel tasks: work-in-progress.",
                    "Performance modeling for data distribution in heterogeneous computing systems: work in progress.",
                    "EPerf: energy-efficient execution of user-interactive event-driven applications: work in progress.",
                    "Writing-aware data variable allocation on hybrid SRAM+NVM SPM: work-in-progress.",
                    "DRAM cache access optimization leveraging line locking in tag cache: work-in-progress.",
                    "Exploiting SIMD capability in an ARMv7-to-ARMv8 dynamic binary translator.",
                    "Advances and throwbacks in hardware-assisted security: special session."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "CASES 2017",
        "info": "Seoul, Republic of Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2017",
                "sub_name": "Proceedings of the 2017 International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2017, Seoul, Republic of Korea, October 15-20, 2017.",
                "count": 22,
                "papers": [
                    "A quantifiable approach to approximate computing: special session.",
                    "Quality-configurable memory hierarchy through approximation: special session.",
                    "Hardware approximate computing: how, why, when and where? (special session).",
                    "Probabilistic reasoning for analysis of approximate computations.",
                    "Efficient pulsed-latch implementation for multiport register files: work-in-progress.",
                    "A \"high resilience\" mode to minimize soft error vulnerabilities in ARM cortex-R CPU pipelines: work-in-progress.",
                    "Balanced cache bypassing for critical warp reduction: work-in-progress.",
                    "SSS: self-aware system-on-chip using static-dynamic hybrid method (work-in-progress).",
                    "Incremental training of CNNs for user customization: work-in-progress.",
                    "Prediction based convolution neural network acceleration: work-in-progress.",
                    "Optimizing DCNN FPGA accelerator design for handwritten hangul character recognition: work-in-progress.",
                    "A high-performance FPGA accelerator for sparse neural networks: work-in-progress.",
                    "Code-size-aware mapping for synchronous dataflow graphs on multicore systems: work-in-progress.",
                    "Multi-grained performance estimation for MPSoC compilers: work-in-progress.",
                    "REDEFINE®™: a case for WCET-friendly hardware accelerators for real time applications (work-in-progress).",
                    "Advanced ahead-of-time compilation for Javascript engine: work-in-progress.",
                    "Emerging (un-)reliability based security threats and mitigations for embedded systems: special session.",
                    "Towards efficient quantized neural network inference on mobile devices: work-in-progress.",
                    "Improving NVMe SSD I/O determinism with PCIe virtual channel: work-in-progress.",
                    "Enabling NVM-based deep learning acceleration using nonuniform data quantization: work-in-progress.",
                    "Enabling reliable main memory using STT-MRAM via restore-aware memory management: work-in-progress.",
                    "Towards industry strength mapping of AUTOSAR automotive functionality on multicore architectures: work-in-progress."
                ]
            },
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: ACM Trans. Embed. Comput. Syst. 16(5s)",
                "count": 190,
                "papers": [
                    "Editorial: Distributed Public Ledgers and Block Chains - What Good Are They for Embedded Systems?",
                    "Guest Editorial: Special Issue on Virtual Prototyping of Parallel and Embedded Systems (ViPES).",
                    "VirtualSoC: A Research Tool for Modern MPSoCs.",
                    "Simulating Reconfigurable Multiprocessor Systems-on-Chip with MPSoCSim.",
                    "A Lightweight Framework for the Dynamic Creation and Configuration of Virtual Platforms in SystemC.",
                    "A Scriptable Standard-Compliant Reporting and Logging Framework for SystemC.",
                    "MPSoC Software Debugging on Virtual Platforms via Execution Control with Event Graphs.",
                    "A Framework for Interconnection-Aware Domain-Specific Many-Accelerator Synthesis.",
                    "Guest Editorial: Special Issue on Emerging Technologies in Embedded Software and Systems.",
                    "Sleep-Mode Voltage Scaling: Enabling SRAM Data Retention at Ultra-Low Power in Embedded Microcontrollers.",
                    "Reducing Power Consumption and Latency in Mobile Devices Using an Event Stream Model.",
                    "Image-Content-Aware I/O Optimization for Mobile Virtualization.",
                    "Cache-Partitioned Preemption Threshold Scheduling.",
                    "Adaptive Workload Management in Mixed-Criticality Systems.",
                    "Automatic Parallelization of Multirate Block Diagrams of Control Systems on Multicore Platforms.",
                    "Crosstalk-Aware Automated Mapping for Optical Networks-on-Chip.",
                    "GPUrpc: Exploring Transparent Access to Remote GPUs.",
                    "Game-Theory-Based Active Defense for Intrusion Detection in Cyber-Physical Embedded Systems.",
                    "ScorePlus: A Software-Hardware Hybrid and Federated Experiment Environment for Smart Grid.",
                    "Autonomous OA Removal in Real-Time from Single Channel EEG Data on a Wearable Device Using a Hybrid Algebraic-Wavelet Algorithm.",
                    "Space-Efficient Index Scheme for PCM-Based Multiversion Databases in Cyber-Physical Systems.",
                    "Modeling Distributed Real-Time Systems in TIOA and UPPAAL.",
                    "Analysis and Scheduling of a Battery-Less Mixed-Criticality System with Energy Uncertainty.",
                    "Integrated Through-Silicon Via Placement and Application Mapping for 3D Mesh-Based NoC Design.",
                    "SPMPool: Runtime SPM Management for Memory-Intensive Applications in Embedded Many-Cores.",
                    "Frequency-Aware ESL Power Estimation for ARM Cortex-A9 Using a Black Box Processor Model.",
                    "Parallel SystemC Simulation for ESL Design.",
                    "Editorial: Continuing the Course.",
                    "Guest Editorial: Special Issue on LCTES 2015.",
                    "Detecting Software Cache Coherence Violations in MPSoC Using Traces Captured on Virtual Platforms.",
                    "Dynamic Data-Cache Locking for Minimizing the WCET of a Single Task.",
                    "Compiler-Directed Soft Error Detection and Recovery to Avoid DUE and SDC via Tail-DMR.",
                    "A Principled Approach to Secure Multi-core Processor Design with ReWire.",
                    "Eager Synching: A Selective Logging Strategy for Fast fsync() on Flash-Based Android Devices.",
                    "Global Optimization of Fixed-Priority Real-Time Systems by RTOS-Aware Control-Flow Analysis.",
                    "Minimizing Cost of Scheduling Tasks on Heterogeneous Multicore Embedded Systems.",
                    "From a Formalized Parallel Action Language to Its Efficient Code Generation.",
                    "Free Rider: A Source-Level Transformation Tool for Retargeting Platform-Specific Intrinsic Functions.",
                    "System-Level Design Optimization for Security-Critical Cyber-Physical-Social Systems.",
                    "Message from the Guest Editors.",
                    "Testing Preorders for dMTS: Deadlock- and the New Deadlock-/DivergenceTesting.",
                    "Multi-valued Simulation and Abstraction Using Lattice Operations.",
                    "Preserving Partial-Order Runs in Parametric Time Petri Nets.",
                    "Non-interference in Partial Order Models.",
                    "Minimizing Test Suites with Unfoldings of Multithreaded Programs.",
                    "Stop It, and Be Stubborn!",
                    "Incremental Inductive Verification of Parameterized Timed Systems.",
                    "When Do We Not Need Complex Assume-Guarantee Rules?",
                    "Task-FIFO Co-Scheduling of Streaming Applications on MPSoCs with Predictable Memory Hierarchy.",
                    "Embedded Device Forensics and Security.",
                    "DLSeF: A Dynamic Key-Length-Based Efficient Real-Time Security Verification Model for Big Data Stream.",
                    "SIPF: A Secure Installment Payment Framework for Drive-Thru Internet.",
                    "Efficient Elliptic Curve Cryptography for Embedded Devices.",
                    "Differential Fault Attack on ITUbee Block Cipher.",
                    "Reduction in the Number of Fault Injections for Blind Fault Attack on SPN Block Ciphers.",
                    "On-Board Format-Independent Security of Functional Magnetic Resonance Images.",
                    "Protecting Mobile Health Records in Cloud Computing: A Secure, Efficient, and Anonymous Design.",
                    "Securely Reinforcing Synchronization for Embedded Online Contests.",
                    "Fault Detection Architectures for Post-Quantum Cryptographic Stateless Hash-Based Secure Signatures Benchmarked on ASIC.",
                    "SA-EAST: Security-Aware Efficient Data Transmission for ITS in Mobile Heterogeneous Cloud Computing.",
                    "Why Data Deletion Fails? A Study on Deletion Flaws and Data Remanence in Android Systems.",
                    "Editorial: Cyber Security, IoT, Block Chains - Risks and Opportunities.",
                    "Guest Editorial: Special Issue on Embedded Computing for IoT.",
                    "Low-Cost Standard Signatures for Energy-Harvesting Wireless Sensor Networks.",
                    "Energy-Aware Memory Mapping for Hybrid FRAM-SRAM MCUs in Intermittently-Powered IoT Devices.",
                    "Axiom: DTLS-Based Secure IoT Group Communication.",
                    "A PUF-Based Secure Communication Protocol for IoT.",
                    "Preserving Smart Sink-Location Privacy with Delay Guaranteed Routing Scheme for WSNs.",
                    "Data-Driven Synchronization for Internet-of-Things Systems.",
                    "A Multi-Quadcopter Cooperative Cyber-Physical System for Timely Air Pollution Localization.",
                    "Seamless Vision-assisted Placement Calibration for Wearable Inertial Sensors.",
                    "Guest Editorial for ACM TECS Special Issue on Effective Divide-and-Conquer, Incremental, or Distributed Mechanisms of Embedded Designs for Extremely Big Data in Large-Scale Devices.",
                    "Distributed Multi-Representative Re-Fusion Approach for Heterogeneous Sensing Data Collection.",
                    "A Load-Balancing Divide-and-Conquer SVM Solver.",
                    "Parallel Sparse Subspace Clustering via Joint Sample and Parameter Blockwise Partition.",
                    "Collaborative PCA/DCA Learning Methods for Compressive Privacy.",
                    "Corrections to and Discussion of \"Implementation and Evaluation of Mixed-criticality Scheduling Approaches for Sporadic Tasks\".",
                    "Hardware Architectures for Embedded Speaker Recognition Applications: A Survey.",
                    "AdaFT: A Framework for Adaptive Fault Tolerance for Cyber-Physical Systems.",
                    "Accelerators for Breast Cancer Detection.",
                    "On Static Binary Translation of ARM/Thumb Mixed ISA Binaries.",
                    "An Indoor Test Methodology for Solar-Powered Wireless Sensor Networks.",
                    "On Space Utilization Enhancement of File Systems for Embedded Storage Systems.",
                    "Serial Arithmetic Strategies for Improving FPGA Throughput.",
                    "Schedulability of Bounded-Rate Multimode Systems.",
                    "DMS-Based Energy Optimizations for Clustered WSNs.",
                    "Fault-Tolerant Preemptive Aperiodic RT Scheduling by Supervisory Control of TDES on Multiprocessors.",
                    "Configurable Detection of SDC-causing Errors in Programs.",
                    "An FPGA-Based Architecture for High-Speed Compressed Signal Reconstruction.",
                    "LiBrA-CAN: Lightweight Broadcast Authentication for Controller Area Networks.",
                    "Editorial: Security of Mobile Devices.",
                    "Guest Editorial: Special Issue on \"Secure and Fault-Tolerant Embedded Computing\".",
                    "Protecting Caches from Soft Errors: A Microarchitect's Perspective.",
                    "A Novel Method for Online Detection of Faults Affecting Execution-Time in Multicore-Based Systems.",
                    "Analyzing the Fault Injection Sensitivity of Secure Embedded Software.",
                    "Area, Throughput, and Power Trade-Offs for FPGA- and ASIC-Based Execution Stream Compression.",
                    "Formal Model-Based Synthesis of Application-Specific Static RTOS.",
                    "The Design and Implementation of the Synchronous Language CÉU.",
                    "The Perfect Getaway: Using Escape Analysis in Embedded Real-Time Systems.",
                    "PMC: A Requirement-Aware DRAM Controller for Multicore Mixed Criticality Systems.",
                    "Harmonicity-Aware Task Partitioning for Fixed Priority Scheduling of Probabilistic Real-Time Tasks on Multi-Core Platforms.",
                    "A DFA-Resistant and Masked PRESENT with Area Optimization for RFID Applications.",
                    "Refining Cache Behavior Prediction Using Cache Miss Paths.",
                    "Automatic Synthesis of Switching Controllers for Linear Hybrid Systems: Reachability Control.",
                    "Task Transition Scheduling for Data-Adaptable Systems.",
                    "Real-Time Simulation Support for Runtime Verification of Cyber-Physical Systems.",
                    "Dynamic Power and Energy Management for Energy Harvesting Nonvolatile Processor Systems.",
                    "Fault-Tolerant Dynamic Task Mapping and Scheduling for Network-on-Chip-Based Multicore Platform.",
                    "Lightweight Architectures for Reliable and Fault Detection Simon and Speck Cryptographic Algorithms on FPGA.",
                    "Exploiting Multiple Write Modes of Nonvolatile Main Memory in Embedded Systems.",
                    "Toward a Practical Regularity-based Model: The Impact of Evenly Distributed Temporal Resource Partitions.",
                    "WCET-Aware Function-Level Dynamic Code Management on Scratchpad Memory.",
                    "Petri Net Models and Collaborativeness for Parallel Processes with Resource Sharing and Message Passing.",
                    "Efficient Automated Code Partitioning for Microcontrollers with Switchable Memory Banks.",
                    "Efficient Kernel Management on GPUs.",
                    "Exploiting Stable Data Dependency in Stream Processing Acceleration on FPGAs.",
                    "High-Performance Ideal Lattice-Based Cryptography on 8-Bit AVR Microcontrollers.",
                    "Modular Compilation of Hybrid Systems for Emulation and Large Scale Simulation.",
                    "Complete and Practical Universal Instruction Selection.",
                    "An Efficient WCET-Aware Instruction Scheduling and Register Allocation Approach for Clustered VLIW Processors.",
                    "A Study of Dynamic Phase Adaptation Using a Dynamic Multicore Processor.",
                    "Implementation of Partitioned Mixed-Criticality Scheduling on a Multi-Core Platform.",
                    "DyPO: Dynamic Pareto-Optimal Configuration Selection for Heterogeneous MpSoCs.",
                    "The CURE: Cluster Communication Using Registers.",
                    "An Out-of-Order Load-Store Queue for Spatial Computing.",
                    "Diagonal Component Expansion for Flow-Layer Placement of Flow-Based Microfluidic Biochips.",
                    "Synthesis of Error-Recovery Protocols for Micro-Electrode-Dot-Array Digital Microfluidic Biochips.",
                    "Low-Cost Memory Fault Tolerance for IoT Devices.",
                    "Approximate Memristive In-memory Computing.",
                    "qLUT: Input-Aware Quantized Table Lookup for Energy-Efficient Approximate Accelerators.",
                    "User-aware Frame Rate Management in Android Smartphones.",
                    "FlowPaP and FlowReR: Improving Energy Efficiency and Performance for STT-MRAM-Based Handheld Devices under Read Disturbance.",
                    "Using Criticality of GPU Accesses in Memory Management for CPU-GPU Heterogeneous Multi-Core Processors.",
                    "Reinforcement Learning-Assisted Garbage Collection to Mitigate Long-Tail Latency in SSD.",
                    "Minimising Access Conflicts on Shared Multi-Bank Memory.",
                    "CAMsure: Secure Content-Addressable Memory for Approximate Search.",
                    "Efficient Control-Flow Subgraph Matching for Detecting Hardware Trojans in RTL Models.",
                    "A High-Speed Accelerator for Homomorphic Encryption using the Karatsuba Algorithm.",
                    "FlashKV: Accelerating KV Performance with Open-Channel SSDs.",
                    "P-BMS: A Bad Block Management Scheme in Parallelized Flash Memory Storage Devices.",
                    "A Program Interference Error Aware LDPC Scheme for Improving NAND Flash Decoding Performance.",
                    "P-Alloc: Process-Variation Tolerant Reliability Management for 3D Charge-Trapping Flash Memory.",
                    "An Automated Security-Aware Approach for Design of Embedded Systems on MPSoC.",
                    "SoftRM: Self-Organized Fault-Tolerant Resource Management for Failure Detection and Recovery in NoC Based Many-Cores.",
                    "Power-Temperature Stability and Safety Analysis for Multiprocessor Systems.",
                    "CGPredict: Embedded GPU Performance Estimation from Single-Threaded Applications.",
                    "Energy-Efficient Run-Time Mapping and Thread Partitioning of Concurrent OpenCL Applications on CPU-GPU MPSoCs.",
                    "GPU Performance Estimation using Software Rasterization and Machine Learning.",
                    "Using Efficient Path Profiling to Optimize Memory Consumption of On-Chip Debugging for High-Level Synthesis.",
                    "COSMOS: Coordination of High-Level Synthesis and Memory Optimization for Hardware Accelerators.",
                    "Machine Intelligence on Resource-Constrained IoT Devices: The Case of Thread Granularity Optimization for CNN Inference.",
                    "Nucleus: Finding the Sharing Limit of Heterogeneous Cores.",
                    "Edge-TM: Exploiting Transactional Memory for Error Tolerance and Energy Efficiency.",
                    "Efficient Virtual Memory Sharing via On-Accelerator Page Table Walking in Heterogeneous Embedded SoCs.",
                    "A DWM-Based Stack Architecture Implementation for Energy Harvesting Systems.",
                    "Flexible PV-cell Modeling for Energy Harvesting in Wearable IoT Applications.",
                    "A Novel Emulation Model of the Cardiac Conduction System.",
                    "RISE: An Automated Framework for Real-Time Intelligent Video Surveillance on FPGA.",
                    "An Inexact Ultra-low Power Bio-signal Processing Architecture With Lightweight Error Recovery.",
                    "Online Scheduling of 2-Re-entrant Flexible Manufacturing Systems.",
                    "Response Time Analysis for Sporadic Server Based Budget Scheduling in Real Time Virtualization Environments.",
                    "Round-trip DRAM Access Fairness in 3D NoC-based Many-core Systems.",
                    "MC-ADAPT: Adaptive Task Dropping in Mixed-Criticality Scheduling.",
                    "Tightening Contention Delays While Scheduling Parallel Applications on Multi-core Architectures.",
                    "On The Design and Application of Thermal Isolation Servers.",
                    "A Fast Method to Compute Disjunctive Quadratic Invariants of Numerical Programs.",
                    "Improving Invariant Mining via Static Analysis.",
                    "Formal Verification of a Timing Enforcer Implementation.",
                    "Timestamp Temporal Logic (TTL) for Testing the Timing of Cyber-Physical Systems.",
                    "Testing Cyber-Physical Systems through Bayesian Optimization.",
                    "Weakly Hard Schedulability Analysis for Fixed Priority Scheduling of Periodic Real-Time Tasks.",
                    "Response-Time Analysis for Task Chains with Complex Precedence and Blocking Relations.",
                    "An Abstraction-Refinement Theory for the Analysis and Design of Real-Time Systems.",
                    "HiCH: Hierarchical Fog-Assisted Computing Architecture for Healthcare IoT.",
                    "Optimization of Real-Time Software Implementing Multi-Rate Synchronous Finite State Machines.",
                    "A Synchronous Look at the Simulink Standard Library.",
                    "Timing Analysis of Synchronous Programs using WCRT Algebra: Scalability through Abstraction.",
                    "Runtime Enforcement of Cyber-Physical Systems.",
                    "BenchPrime: Effective Building of a Hybrid Benchmark Suite.",
                    "Demystifying Soft-Error Mitigation by Control-Flow Checking - A New Perspective on its Effectiveness.",
                    "Adaptive Power Management in Solar Energy Harvesting Sensor Node Using Reinforcement Learning.",
                    "Application-Aware Swapping for Mobile Systems.",
                    "Lightweight Data Compression for Mobile Flash Storage.",
                    "Managing the Performance/Error Tradeoff of Floating-point Intensive Applications.",
                    "Operational Models for Piecewise-Smooth Systems.",
                    "Probabilistic Safety Verification of Stochastic Hybrid Systems Using Barrier Certificates.",
                    "Compositional Relational Abstraction for Nonlinear Hybrid Systems.",
                    "Security-Aware Scheduling of Embedded Control Tasks.",
                    "A Structured Methodology for Pattern based Adaptive Scheduling in Embedded Control.",
                    "Antlab: A Multi-Robot Task Server."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "CASES 2016",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2016",
                "sub_name": "2016 International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2016, Pittsburgh, Pennsylvania, USA, October 1-7, 2016.",
                "count": 21,
                "papers": [
                    "ILP-based modulo scheduling for high-level synthesis.",
                    "Enabling OpenVX support in mW-scale parallel accelerators.",
                    "Handling large data sets for high-performance embedded applications in heterogeneous systems-on-chip.",
                    "Power and thermal management in massive multicore chips: theoretical foundation meets architectural innovation and resource allocation.",
                    "Runtime management of adaptive MPSoCs for graceful degradation.",
                    "Towards the design of fault-tolerant mixed-criticality systems on multicores.",
                    "COMET: communication-optimised multi-threaded error-detection technique.",
                    "Neural network transformation under hardware constraints.",
                    "RRAM based learning acceleration.",
                    "A real-time digital-microfluidic platform for epigenetics.",
                    "LOCUS: low-power customizable many-core architecture for wearables.",
                    "D-PUF: an intrinsically reconfigurable DRAM PUF for device authentication in embedded systems.",
                    "Hybrid network-on-chip architectures for accelerating deep learning kernels on heterogeneous manycore platforms.",
                    "CaffePresso: an optimized library for deep learning on embedded accelerator-based platforms.",
                    "Matrix multiplication beyond auto-tuning: rewrite-based GPU code generation.",
                    "Speculative disassembly of binary code.",
                    "A jump-target identification method for multi-architecture static binary translation.",
                    "On-the-fly load data value tracing in multicores.",
                    "Redesigning a tagless access buffer to require minimal ISA changes.",
                    "Thrifty-malloc: A HW/SW codesign for the dynamic management of hardware transactional memory in embedded multicore systems.",
                    "FastCollect: offloading generational garbage collection to integrated GPUs."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "CASES 2015",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2015",
                "sub_name": "2015 International Conference on Compilers, Architecture and Synthesis for Embedded Systems, CASES 2015, Amsterdam, The Netherlands, October 4-9, 2015.",
                "count": 25,
                "papers": [
                    "Embedded system and application aware design of deregulated energy delivery systems.",
                    "Optimizing mobile display brightness by leveraging human visual perception.",
                    "QuadSeal: Quadruple algorithmic symmetrizing countermeasure against power based side-channel attacks.",
                    "Approximate acceleration: A path through the era of dark silicon and big data.",
                    "Does customizing inexactness help over simplistic precision (bit-width) reduction? A case study.",
                    "Energy-interference-free system and toolchain support for energy-harvesting devices.",
                    "Accuracy-aware optimization of approximate programs.",
                    "Evaluating and exploiting impacts of dynamic power management schemes on system reliability.",
                    "Exploiting cache conflicts to reduce radiation sensitivity of operating systems on embedded systems.",
                    "Optimization of multi-channel BCH error decoding for common cases.",
                    "PAC: Program Analysis for Approximation-aware Compilation.",
                    "Approximation-aware Multi-Level Cells STT-RAM cache architecture.",
                    "Quality-aware data allocation in approximate DRAM?",
                    "Vector-aware register allocation for GPU shader processors.",
                    "A sparse matrix vector multiply accelerator for support vector machine.",
                    "Saving memory movements through vector processing in the DRAM.",
                    "Efficient SAT-based application mapping and scheduling on multiprocessor systems for throughput maximization.",
                    "NUVA: Architectural support for runtime verification of parametric specifications over multicores.",
                    "High performance and energy efficient wireless NoC-enabled multicore architectures for graph analytics.",
                    "Timing characterization of OpenMP4 tasking model.",
                    "Scheduling instruction effects for a statically pipelined processor.",
                    "Reducing shift penalty in Domain Wall Memory through register locality.",
                    "Self-powered wearable sensor platforms for wellness.",
                    "Cognitive cameras: Assistive vision systems.",
                    "Self-powered wearable sensor node: Challenges and opportunities."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "CASES 2014",
        "info": "Uttar Pradesh, India",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2014",
                "sub_name": "2014 International Conference on Compilers, Architecture and Synthesis for Embedded Systems, CASES 2014, Uttar Pradesh, India, October 12-17, 2014.",
                "count": 24,
                "papers": [
                    "The improbable but highly appropriate marriage of 3D stacking and neuromorphic accelerators.",
                    "Heuristics for greedy transport triggered architecture interconnect exploration.",
                    "Energy-efficient VFI-partitioned multicore design using wireless NoC architectures.",
                    "Retargetable automatic generation of compound instructions for CGRA based reconfigurable processor applications.",
                    "COREFAB: Concurrent reconfigurable fabric utilization in heterogeneous multi-core systems.",
                    "Automatic custom instruction identification in memory streaming algorithms.",
                    "Auto-parallelization of data structure operations for GPUs.",
                    "A compilation flow for parametric dataflow: Programming model, scheduling, and application to heterogeneous MPSoC.",
                    "A compiler framework for automatically mapping data parallel programs to heterogeneous MPSoCs.",
                    "Team up: Cooperative memory management in embedded systems.",
                    "A low-cost memory interface for high-throughput accelerators.",
                    "EnVM: Virtual memory design for new memory architectures.",
                    "A system-level simulation framework for evaluating task migration in MPSoCs.",
                    "Context-sensitive timing simulation of binary embedded software.",
                    "Automated ISA branch coverage analysis and test case generation for retargetable instruction set simulators.",
                    "Control-layer optimization for flow-based mVLSI microfluidic biochips.",
                    "Splitting functions into single-entry regions.",
                    "Construction of GCCFG for inter-procedural optimizations in Software Managed Manycore (SMM) architectures.",
                    "CAPED: Context-aware personalized display brightness for mobile devices.",
                    "A high-level model of embedded flash energy consumption.",
                    "Reducing cache leakage energy for hybrid SPM-cache architectures.",
                    "AdaPNet: Adapting process networks in response to resource variations.",
                    "SDCTune: A model for predicting the SDC proneness of an application for configurable protection.",
                    "Fault resilient physical neural networks on a single chip."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "CASES 2013",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2013",
                "sub_name": "International Conference on Compilers, Architecture and Synthesis for Embedded Systems, CASES 2013, Montreal, QC, Canada, September 29 - October 4, 2013.",
                "count": 26,
                "papers": [
                    "Aging-aware hardware-software task partitioning for reliable reconfigurable multiprocessor systems.",
                    "Scrubbing unit repositioning for fast error repair in FPGAs.",
                    "Compiled multithreaded data paths on FPGAs for dynamic workloads.",
                    "Automatic Extraction of pipeline parallelism for embedded heterogeneous multi-core platforms.",
                    "Expandable process networks to efficiently specify and explore task, data, and pipeline parallelism.",
                    "A novel compilation approach for image processing graphs on a many-core platform with explicitly managed memory.",
                    "Exploiting phase inter-dependencies for faster iterative compiler optimization phase order searches.",
                    "Platform-dependent code generation for embedded real-time software.",
                    "CAeSaR: Unified cluster-assignment scheduling and communication reuse for clustered VLIW processors.",
                    "Hybrid compile and run-time memory management for a 3D-stacked reconfigurable accelerator.",
                    "Simultaneously optimizing DRAM cache hit latency and miss rate via novel set mapping policies.",
                    "Minimizing code size via page selection optimization on partitioned memory architectures.",
                    "EVA: An efficient vision architecture for mobile systems.",
                    "Hardware acceleration for programs in SSA form.",
                    "Power-performance modeling on asymmetric multi-cores.",
                    "Bitcoin and the age of Bespoke Silicon.",
                    "Dynamic hardware specialization-using moore's bounty without burning the chip down.",
                    "From software to accelerators with LegUp high-level synthesis.",
                    "Effective code discovery for ARM/Thumb mixed ISA binaries in a static binary translator.",
                    "ILPc: A novel approach for scalable timing analysis of synchronous programs.",
                    "SPM-Sieve: A framework for assisting data partitioning in scratch pad memory based systems.",
                    "Fault detection and recovery efficiency co-optimization through compile-time analysis and runtime adaptation.",
                    "Global property violation detection and diagnosis for wireless sensor networks.",
                    "An efficient run-time encryption scheme for non-volatile main memory.",
                    "Cyber physical systems: Systems engineering of industrial embedded systems - Barriers, enablers and opportunities.",
                    "Tutorial: Methodologies and tools for embedded multisensory systems based on ARM cortex M processors."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "CASES 2012",
        "info": "Tampere, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2012",
                "sub_name": "Proceedings of the 15th International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2012, part of the Eighth Embedded Systems Week, ESWeek 2012, Tampere, Finland, October 7-12, 2012.",
                "count": 29,
                "papers": [
                    "Wireless innovations for smartphones.",
                    "Computing without processors.",
                    "A standards-based, fully-open software platform for smart embedded systems.",
                    "Internet-of-energy: combining embedded computing and communication for the smart grid.",
                    "Trends in automotive embedded systems.",
                    "Research issues in smart phones, notepads and related services.",
                    "Side channel attacks and the non volatile memory of the future.",
                    "A cost-effective tag design for memory data authentication in embedded systems.",
                    "Static secure page allocation for light-weight dynamic information flow tracking.",
                    "From sequential programming to flexible parallel execution.",
                    "A hybrid just-in-time compiler for android: comparing JIT types and the result of cooperation.",
                    "LLBT: an LLVM-based static binary translator.",
                    "Power agnostic technique for efficient temperature estimation of multicore embedded systems.",
                    "Scenario-based design flow for mapping streaming applications onto on-chip many-core systems.",
                    "The RACECAR heuristic for automatic function specialization on multi-core heterogeneous systems.",
                    "Siblingrivalry: online autotuning through local competitions.",
                    "Function inlining and loop unrolling for loop acceleration in reconfigurable processors.",
                    "A low-overhead interconnect architecture for virtual reconfigurable fabrics.",
                    "Energy efficient hybrid display and predictive models for embedded and mobile systems.",
                    "Energy efficient special instruction support in an embedded processor with compact isa.",
                    "When less is more (LIMO): controlled parallelism forimproved efficiency.",
                    "Lazy cache invalidation for self-modifying codes.",
                    "Static task partitioning for locked caches in multi-core real-time systems.",
                    "Revisiting level-0 caches in embedded processors.",
                    "Architectural synthesis of flow-based microfluidic large-scale integration biochips.",
                    "DaaC: device-reserved memory as an eviction-based file cache.",
                    "Integrating software caches with scratch pad memory.",
                    "Analytical approaches for performance evaluation of networks-on-chip.",
                    "Embedded reconfigurable architectures."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "CASES 2011",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2011",
                "sub_name": "Proceedings of the 14th International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2011, part of the Seventh Embedded Systems Week, ESWeek 2011, Taipei, Taiwan, October 9-14, 2011.",
                "count": 27,
                "papers": [
                    "Automatic generation of hardware/software interfaces.",
                    "Low-overhead virtualization of mobile platforms.",
                    "Selective just-in-time compilation for client-side mobile javascript engine.",
                    "A method-based ahead-of-time compiler for android applications.",
                    "Studying optimal spilling in the light of SSA.",
                    "An efficient heuristic for instruction scheduling on clustered vliw processors.",
                    "Graph-coloring and treescan register allocation using repairing.",
                    "A unified approach to eliminate memory accesses early.",
                    "An evaluation of different modeling techniques for iterative compilation.",
                    "A novel thread scheduler design for polymorphic embedded systems.",
                    "Realizing near-true voltage scaling in variation-sensitive l1 caches via fault buffers.",
                    "FFT-cache: a flexible fault-tolerant cache architecture for ultra low voltage operation.",
                    "Smart cache cleaning: energy efficient vulnerability reduction in embedded processors.",
                    "Architecting processors to allow voltage/reliability tradeoffs.",
                    "Cost-effective safety and fault localization using distributed temporal redundancy.",
                    "Stochastic computing: embracing errors in architectureand design of processors and applications.",
                    "WCET-driven cache-aware code positioning.",
                    "Enabling parametric feasibility analysis in real-time calculus driven performance evaluation.",
                    "WCET-driven branch prediction aware code positioning.",
                    "A hybrid strategy for mapping multiple throughput-constrained applications on MPSoCs.",
                    "Evaluation of an accelerator architecture for speckle reducing anisotropic diffusion.",
                    "An FPGA-based heterogeneous coarse-grained dynamically reconfigurable architecture.",
                    "Localizing globals and statics to make C programs thread-safe.",
                    "Vector class on limited local memory (LLM) multi-core processors.",
                    "System-level modeling and synthesis of flow-based microfluidic biochips.",
                    "Hardware/software architecture for flash memory storage systems.",
                    "Compositional analysis of real-time embedded systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "CASES 2010",
        "info": "Scottsdale, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2010",
                "sub_name": "Proceedings of the 2010 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2010, Scottsdale, AZ, USA, October 24-29, 2010.",
                "count": 30,
                "papers": [
                    "Balancing memory and performance through selective flushing of software code caches.",
                    "Erbium: a deterministic, concurrent intermediate representation to map data-flow tasks to scalable, persistent streaming processes.",
                    "Resource recycling: putting idle resources to work on a composable accelerator.",
                    "Instruction selection by graph transformation.",
                    "Routing-based synthesis of digital microfluidic biochips.",
                    "Mosaic of organic development through technology intervention in the rural indian context.",
                    "The virtual hospital: the emergence of telemedicine.",
                    "Parsimonious information technologies for pixels, perception, wetware and simulation: issues for Petrasek's global virtual hospital system.",
                    "Implementing virtual secure circuit using a custom-instruction approach.",
                    "Mighty-morphing power-SIMD.",
                    "Towards minimizing execution delays on dynamically reconfigurable processors: a case study on REDEFINE.",
                    "Implementing dynamic implied addressing mode for multi-output instructions.",
                    "Real-time unobtrusive program execution trace compression using branch predictor events.",
                    "A memory interface for multi-purpose multi-stream accelerators.",
                    "Hardware-based data value and address trace filtering techniques.",
                    "Improving scratchpad allocation with demand-driven data tiling.",
                    "Fine-grain dynamic instruction placement for L0 scratch-pad memory.",
                    "Improved procedure placement for set associative caches.",
                    "Minimizing inter-task interferences in scratch-pad memory usage for reducing the energy consumption of multi-task systems.",
                    "Compilers, architectures and synthesis for embedded computing: retrospect and prospect.",
                    "Optimizing energy to minimize errors in dataflow graphs using approximate adders.",
                    "Eliminating false phase interactions to reduce optimization phase order search space.",
                    "Practical aggregation of semantical program properties for machine learning based optimization.",
                    "Vertical stealing: robust, locality-aware do-all workload distribution for 3D MPSoCs.",
                    "Design space exploration of the turbo decoding algorithm on GPUs.",
                    "Characterization and exploitation of narrow-width loads: the narrow-width cache approach.",
                    "E < MC2: less energy through multi-copy cache.",
                    "Enabling large decoded instruction loop caching for energy-aware embedded processors.",
                    "MNEMEE: a framework for memory management and optimization of static and dynamic data in MPSoCs.",
                    "Challenges for embedded multicore architecture."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "CASES 2009",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2009",
                "sub_name": "Proceedings of the 2009 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2009, Grenoble, France, October 11-16, 2009.",
                "count": 31,
                "papers": [
                    "Sustaining moore's law in embedded computing through probabilistic and approximate design: retrospects and prospects.",
                    "Complete nanowire crossbar framework optimized for the multi-spacer patterning technique.",
                    "III-V/Si integration: potential and outlook for integrated low power micro and nanosystems.",
                    "Exploiting residue number system for power-efficient digital signal processing in embedded processors.",
                    "Fast enumeration of maximal valid subgraphs for custom-instruction identification.",
                    "Hybrid multithreading for VLIW processors.",
                    "Spatial complexity of reversibly computable DAG.",
                    "Mapping stream programs onto heterogeneous multiprocessor systems.",
                    "Optimal loop parallelization for maximizing iteration-level parallelism.",
                    "Progressive spill code placement.",
                    "Slicing based code parallelization for minimizing inter-processor communication.",
                    "Fine-grain performance scaling of soft vector processors.",
                    "Fine-grained parallel application specific computing for RNA secondary structure prediction using SCFGS on FPGA.",
                    "Reducing impact of cache miss stalls in embedded systems by extracting guaranteed independent instructions.",
                    "Streaming FFT on REDEFINE-v2: an application-architecture design space exploration.",
                    "A buffer replacement algorithm exploiting multi-chip parallelism in solid state disks.",
                    "Exposing non-standard architectures to embedded software using compile-time virtualisation.",
                    "A platform for developing adaptable multicore applications.",
                    "Parallel, hardware-supported interrupt handling in an event-triggered real-time operating system.",
                    "CheckerCore: enhancing an FPGA soft core to capture worst-case execution times.",
                    "Instruction cache locking inside a binary rewriter.",
                    "Tabu search-based synthesis of dynamically reconfigurable digital microfluidic biochips.",
                    "Tight WCRT analysis of synchronous C programs.",
                    "An accelerator-based wireless sensor network processor in 130nm CMOS.",
                    "Smartphone-based assistive technologies for the blind.",
                    "OPAIMS: open architecture precision agriculture information monitoring system.",
                    "A case study of on-chip sensor network in multiprocessor system-on-chip.",
                    "A fault tolerant cache architecture for sub 500mV operation: resizable data composer cache (RDC-cache).",
                    "Towards scalable reliability frameworks for error prone CMPs.",
                    "CGRA express: accelerating execution using dynamic operation fusion.",
                    "Energy-aware probabilistic multiplier: design and analysis."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "CASES 2008",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2008",
                "sub_name": "Proceedings of the 2008 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2008, Atlanta, GA, USA, October 19-24, 2008.",
                "count": 29,
                "papers": [
                    "StageNetSlice: a reconfigurable microarchitecture building block for resilient CMP systems.",
                    "A light-weight cache-based fault detection and checkpointing scheme for MPSoCs enabling relaxed execution synchronization.",
                    "ZebraNet and beyond: applications and systems support for mobile, dynamic networks.",
                    "Non-intrusive dynamic application profiler for detailed loop execution characterization.",
                    "Exploring and predicting the architecture/optimising compiler co-design space.",
                    "Optimus: efficient realization of streaming applications on FPGAs.",
                    "Compiling custom instructions onto expression-grained reconfigurable architectures.",
                    "VESPA: portable, scalable, and flexible FPGA-based vector processors.",
                    "Dynamic coprocessor management for FPGA-enhanced compute platforms.",
                    "Power on demand for mobile computing devices.",
                    "Efficiency and scalability of barrier synchronization on NoC based many-core architectures.",
                    "Decoupled root scanning in multi-processor systems.",
                    "SoC-C: efficient programming abstractions for heterogeneous multicore systems on chip.",
                    "Reducing pressure in bounded DBT code caches.",
                    "Efficient code caching to improve performance and energy consumption for java applications.",
                    "Cache-aware cross-profiling for java processors.",
                    "Predictable programming on a precision timed architecture.",
                    "Advanced conservative and optimistic register coalescing.",
                    "Control flow optimization in loops using interval analysis.",
                    "Efficient vectorization of SIMD programs with non-aligned and irregular data access hardware.",
                    "Comprehensive isomorphic subtree enumeration.",
                    "Highly energy and performance efficient embedded computing through approximately correct arithmetic: a mathematical foundation and preliminary experimental validation.",
                    "Multiple sleep mode leakage control for cache peripheral circuits in embedded processors.",
                    "Design space exploration for field programmable compressor trees.",
                    "Multi-granularity sampling for simulating concurrent heterogeneous applications.",
                    "Active control and digital rights management of integrated circuit IP cores.",
                    "A low-power parallel design of discrete wavelet transform using subthreshold voltage technology.",
                    "Power management of MEMS-based storage devices for mobile systems.",
                    "Execution context optimization for disk energy."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "CASES 2007",
        "info": "Salzburg, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2007",
                "sub_name": "Proceedings of the 2007 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2007, Salzburg, Austria, September 30 - October 3, 2007.",
                "count": 36,
                "papers": [
                    "Compiling code accelerators for FPGAs.",
                    "A fast and generic hybrid simulation approach using C virtual machine.",
                    "Compiler generation from structural architecture descriptions.",
                    "Non-transparent debugging for software-pipelined loops.",
                    "An integrated ARM and multi-core DSP simulator.",
                    "SCCP/x: a compilation profile to support testing and verification of optimized code.",
                    "Performance-driven syntax-directed synthesis of asynchronous processors.",
                    "Stack size reduction of recursive programs.",
                    "Performance evaluation and optimization of dual-port SDRAM architecture for mobile embedded systems.",
                    "A hybrid code compression technique using bitmask and prefix encoding with enhanced dictionary selection.",
                    "Techniques for code and data management in the local stores of the cell processor.",
                    "Recursive function data allocation to scratch-pad memory.",
                    "Fragment cache management for dynamic binary translators in embedded systems with scratchpad.",
                    "Scratch-pad memory allocation without compiler support for java applications.",
                    "Towards understanding architectural tradeoffs in MEMS closed-loop feedback control.",
                    "Application driven embedded system design: a face recognition case study.",
                    "Hierarchical coarse-grained stream compilation for software defined radio.",
                    "Rethinking custom ISE identification: a new processor-agnostic method.",
                    "An efficient framework for dynamic reconfiguration of instruction-set customization.",
                    "Lightweight barrier-based parallelization support for non-cache-coherent MPSoC platforms.",
                    "Light-weight synchronization for inter-processor communication acceleration on embedded MPSoCs.",
                    "Supporting multithreading in configurable soft processor cores.",
                    "A group-based wear-leveling algorithm for large-capacity flash memory storage systems.",
                    "Facilitating compiler optimizations through the dynamic mapping of alternate register structures.",
                    "Vertical object layout and compression for fixed heaps.",
                    "Software controlled memory layout reorganization for irregular array access patterns.",
                    "A self-maintained memory module supporting DMM.",
                    "Eliminating inter-process cache interference through cache reconfigurability for real-time and low-power embedded multi-tasking systems.",
                    "Multicore architectures.",
                    "An optimistic and conservative register assignment heuristic for chordal graphs.",
                    "A simplified java bytecode compilation system for resource-constrained embedded processors.",
                    "A backtracking instruction scheduler using predicate-based code hoisting to fill delay slots.",
                    "INTACTE: an interconnect area, delay, and energy estimation tool for microarchitectural explorations.",
                    "Cache leakage control mechanism for hard real-time systems.",
                    "Performance optimal processor throttling under thermal constraints.",
                    "A low power front-end for embedded processors using a block-aware instruction set."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "CASES 2006",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2006",
                "sub_name": "Proceedings of the 2006 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2006, Seoul, Korea, October 22-25, 2006.",
                "count": 42,
                "papers": [
                    "Dances with multimedia: embedded video codec design.",
                    "An accurate and efficient simulation-based analysis for worst case interruption delay.",
                    "Reaching fast code faster: using modeling for efficient software thread integration on a VLIW DSP.",
                    "Automatic performance model construction for the fast software exploration of new hardware designs.",
                    "Supporting precise garbage collection in Java Bytecode-to-C ahead-of-time compiler for embedded systems.",
                    "Adapting compilation techniques to enhance the packing of instructions into registers.",
                    "Modeling heterogeneous SoCs with SystemC: a digital/MEMS case study.",
                    "A network agent for diagnosis and analysis of real-time Ethernet networks.",
                    "Memory optimization by counting points in integer transformations of parametric polytopes.",
                    "State space reconfigurability: an implementation architecture for self modifying finite automata.",
                    "Incremental elaboration for run-time reconfigurable hardware designs.",
                    "FlashCache: a NAND flash memory file cache for low power web servers.",
                    "Adaptive and flexible dictionary code compression for embedded applications.",
                    "Automated compile-time and run-time techniques to increase usable memory in MMU-less embedded systems.",
                    "Modulo graph embedding: mapping applications onto coarse-grained reconfigurable architectures.",
                    "Scalable subgraph mapping for acyclic computation accelerators.",
                    "Probabilistic arithmetic and energy efficient embedded signal processing.",
                    "Power efficient branch prediction through early identification of branch addresses.",
                    "Reducing energy of virtual cache synonym lookup using bloom filters.",
                    "Efficient architectures through application clustering and architectural heterogeneity.",
                    "Minimizing bank selection instructions for partitioned memory architecture.",
                    "Protected heap sharing for memory-constrained java environments.",
                    "A dynamic code placement technique for scratchpad memory using postpass optimization.",
                    "CFLRU: a replacement algorithm for flash memory.",
                    "Code transformation strategies for extensible embedded processors.",
                    "Syntax-driven implementation of software programming language control constructs and expressions on FPGAs.",
                    "A dynamic binary instrumentation engine for the ARM architecture.",
                    "High-level languages for small devices: a case study.",
                    "Adaptive object code compression.",
                    "Limitations of special-purpose instructions for similarity measurements in media SIMD extensions.",
                    "Entropy-based low power data TLB design.",
                    "Compiler optimization of embedded applications for an adaptive SoC architecture.",
                    "Extensible control architectures.",
                    "High-performance packet classification algorithm for many-core and multithreaded network processor.",
                    "Improving the performance and power efficiency of shared helpers in CMPs.",
                    "A case study of multi-threading in the embedded space.",
                    "Architecture and circuit techniques for low-throughput, energy-constrained systems across technology generations.",
                    "Methods for power optimization in distributed embedded systems with real-time requirements.",
                    "High-level power analysis for multi-core chips.",
                    "Integrated scratchpad memory optimization and task scheduling for MPSoC architectures.",
                    "Mitigating soft error failures for multimedia applications by selective data protection.",
                    "Cost-efficient soft error protection for embedded microprocessors."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "CASES 2005",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2005",
                "sub_name": "Proceedings of the 2005 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2005, San Francisco, California, USA, September 24-27, 2005.",
                "count": 32,
                "papers": [
                    "How compilers and tools differ for embedded systems.",
                    "Exploiting pipelining to relax register-file port constraints of instruction-set extensions.",
                    "Exploring the design space of LUT-based transparent accelerators.",
                    "Automating custom-precision function evaluation for embedded processors.",
                    "Energy management for commodity short-bit-width microcontrollers.",
                    "Anomalous path detection with hardware support.",
                    "Hardware support for code integrity in embedded processors.",
                    "Segment protection for embedded systems using run-time checks.",
                    "SECA: security-enhanced communication architecture.",
                    "Compilation techniques for energy reduction in horizontally partitioned cache architectures.",
                    "A post-compilation register reassignment technique for improving hamming distance code compression.",
                    "Verifiable annotations for embedded java environments.",
                    "Memory allocation for embedded systems with a compile-time-unknown scratch-pad size.",
                    "Optimizing stream programs using linear state space analysis.",
                    "Compiler-directed proactive power management for networks.",
                    "Equivalence checking of arithmetic expressions using fast evaluation.",
                    "Single appearance schedule with dynamic loop count for minimum data buffer from synchronous dataflow graphs.",
                    "Architectural support for real-time task scheduling in SMT processors.",
                    "Intra-task scenario-aware voltage scheduling.",
                    "Energy aware kernel for hard real-time systems.",
                    "MTSS: multi task stack sharing for embedded systems.",
                    "The microarchitecture of FPGA-based soft processors.",
                    "Virtual multiprocessor: an analyzable, high-performance architecture for real-time computing.",
                    "An Esterel processor with full preemption support and its worst case reaction time analysis.",
                    "Fast and fair: data-stream quality of service.",
                    "A second-generation sensor network processor with application-driven memory optimizations and out-of-order execution.",
                    "A dual-processor solution for the MAC layer of a software defined radio terminal.",
                    "Instruction set extensions for software defined radio on a multithreaded processor.",
                    "Software-directed power-aware interconnection networks.",
                    "Balancing register pressure and context-switching delays in ASTI systems.",
                    "Developing embedded multi-threaded applications with CATAPULTS, a domain-specific language for generating thread schedulers.",
                    "Micro embedded monitoring for security in application specific instruction-set processors."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "CASES 2004",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2004",
                "sub_name": "Proceedings of the 2004 International Conference on Compilers, Architecture, and Synthesis for Embedded Systems, CASES 2004, Washington DC, USA, September 22 - 25, 2004.",
                "count": 33,
                "papers": [
                    "Programming models and architectures for FPGA platforms.",
                    "Safely exploiting multithreaded processors to tolerate memory latency in real-time systems.",
                    "Dynamic on-chip memory management for chip multiprocessors.",
                    "Cluster miss prediction with prefetch on miss for embedded CPU instruction caches.",
                    "Reducing energy consumption of queries in memory-resident database systems.",
                    "A low power architecture for embedded perception.",
                    "Balancing design options with Sherpa.",
                    "Scalable custom instructions identification for instruction-set extensible processors.",
                    "LNS architectures for embedded model predictive control processors.",
                    "Plug-in of power models in the StepNP exploration platform: analysis of power/performance trade-offs.",
                    "Disk drive energy optimization for audio-video applications.",
                    "High-level power analysis for on-chip networks.",
                    "Energy-efficient dual-voltage soft real-time system with (m, k)-firm deadline guarantee.",
                    "Static next sub-bank prediction for drowsy instruction cache.",
                    "A hamming distance based VLIW/EPIC code compression technique.",
                    "Reducing both dynamic and leakage energy consumption for hard real-time systems.",
                    "Loop-based leakage control for branch predictors.",
                    "Balanced energy optimization.",
                    "Static program analysis of embedded executable assembly code.",
                    "Providing time- and space- efficient procedure calls for asynchronous software thread integration.",
                    "Causality analysis of synchronous programs with delayed actions.",
                    "General loop fusion technique for nested loops considering timing and code size.",
                    "Modular design through component abstraction.",
                    "An efficient system-on-a-chip design methodology for networking applications.",
                    "Translating affine nested-loop programs to process networks.",
                    "Memory and architecture exploration with thread shifting for multithreaded processors in embedded systems.",
                    "Automatic data partitioning for the agere payload plus network processor.",
                    "Analytical computation of Ehrhart polynomials: enabling more compiler analyses and optimizations.",
                    "A post-compiler approach to scratchpad mapping of code.",
                    "Procedure placement using temporal-ordering information: dealing with code size expansion.",
                    "Memory overflow protection for embedded systems using run-time checks, reuse and compression.",
                    "Hardware assisted control flow obfuscation for embedded processors.",
                    "Java cryptography on KVM and its performance and security optimization using HW/SW co-design techniques."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "CASES 2003",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2003",
                "sub_name": "Proceedings of the International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2003, San Jose, California, USA, October 30 - November 1, 2003.",
                "count": 33,
                "papers": [
                    "Moving from embedded systems to embedded computing.",
                    "Vectorizing for a SIMdD DSP architecture.",
                    "Simple offset assignment in presence of subword data.",
                    "Efficient spill code for SDRAM.",
                    "Cluster assignment of global values for clustered VLIW processors.",
                    "Extending STI for demanding hard-real-time systems.",
                    "Clustered calculation of worst-case execution times.",
                    "Task-level timing models for guaranteed performance in multiprocessor networks-on-chip.",
                    "System-level power-performance trade-offs in task scheduling for dynamically reconfigurable architectures.",
                    "Reducing code size with echo instructions.",
                    "Compiler optimization and ordering effects on VLIW code compression.",
                    "Reducing code size for heterogeneous-connectivity-based VLIW DSPs through synthesis of instruction set extensions.",
                    "Energy aware algorithm design via probabilistic computing: from algorithms and models to Moore's law and novel (semiconductor) devices.",
                    "Frequent loop detection using efficient non-intrusive on-chip hardware.",
                    "Increasing the number of effective registers in a low-power processor using a windowed register file.",
                    "Automatic generation of application specific processors.",
                    "A scalable wide-issue clustered VLIW with a reconfigurable interconnect.",
                    "A new look at exploiting data parallelism in embedded systems.",
                    "Fault-tolerant platforms for automotive safety-critical applications.",
                    "Programming challenges in network processor deployment.",
                    "Encryption overhead in embedded systems and sensor network nodes: modeling and analysis.",
                    "AES and the cryptonite crypto processor.",
                    "A low-power accelerator for the SPHINX 3 speech recognition system.",
                    "Architectural optimizations for low-power, real-time speech recognition.",
                    "Graphical user interface energy characterization for handheld computers.",
                    "A hierarchical approach for energy efficient application design using heterogeneous embedded systems.",
                    "A control-theoretic approach to dynamic voltage scheduling.",
                    "Power efficient encoding techniques for off-chip data buses.",
                    "Compiler-decided dynamic memory allocation for scratch-pad based embedded systems.",
                    "Exploiting bank locality in multi-bank memories.",
                    "Lattice-based memory allocation.",
                    "Performance, energy, and reliability tradeoffs in replicating hot cache lines.",
                    "Polynomial-time algorithm for on-chip scratchpad memory partitioning."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "CASES 2002",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2002",
                "sub_name": "Proceedings of the International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2002, Greenoble, France, October 8-11, 2002.",
                "count": 38,
                "papers": [
                    "A case for dynamic pipeline scaling.",
                    "A near-optimal instruction scheduler for a tightly constrained, variable instruction set embedded processor.",
                    "Components for embedded software: the PECOS approach.",
                    "Efficient architecture/compiler co-exploration for ASIPs.",
                    "Cycle-time aware architecture synthesis of custom hardware accelerators.",
                    "An adaptive chip-multiprocessor architecture for future mobile terminals.",
                    "Towards automatic synthesis of a class of application-specific sensor networks.",
                    "Hardware implementation of the Ravenscar Ada tasking profile.",
                    "Bit section instruction set extension of ARM for embedded applications.",
                    "Code coverage and input variability: effects on architecture and compiler research.",
                    "An integrated approach to reducing power dissipation in memory hierarchies.",
                    "Embedded cache architecture with programmable write buffer support for power and performance flexibility.",
                    "Increasing power efficiency of multi-core network processors through data filtering.",
                    "Cost effective memory disambiguation for multimedia codes.",
                    "Optimizing inter-nest data locality.",
                    "Leakage-proof program partitioning.",
                    "Dynamic voltage leveling scheduling for real-time embedded systems on low-power variable speed processors.",
                    "Control-theoretic dynamic frequency and voltage scaling for multimedia workloads.",
                    "Energy aware task scheduling with task synchronization for embedded real time systems.",
                    "Scenario-based software characterization as a contingency to traditional program profiling.",
                    "Experience with a retargetable compiler for a commercial network processor.",
                    "PACT HDL: a C compiler targeting ASICs and FPGAs with power and performance optimizations.",
                    "Wave pipelining for application-specific networks-on-chips.",
                    "Handling of packet dependencies: a critical issue for highly parallel network processors.",
                    "On achieving balanced power consumption in software pipelined loops.",
                    "Low Power Control Techniques For TFT LCD Displays.",
                    "Dynamic battery state aware approaches for improving battery utilization.",
                    "System lifetime extension by battery management: an experimental work.",
                    "Process cruise control: event-driven clock scaling for dynamic power management.",
                    "HW / SW partitioning approach for reconfigurable system design.",
                    "An efficient technique for exploring register file size in ASIP synthesis.",
                    "Instruction generation and regularity extraction for reconfigurable processors.",
                    "Automatic floating-point to fixed-point conversion for DSP code generation.",
                    "Iterative procedural abstraction for code size reduction.",
                    "Validating software pipelining optimizations.",
                    "Ensuring code safety without runtime checks for real-time control systems.",
                    "Predictable programs in barcodes.",
                    "Real Java for real time - gain and pain."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "CASES 2001",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2001",
                "sub_name": "Proceedings of the 2001 International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2001, Atlanta, Georgia, USA, November 16-17, 2001.",
                "count": 31,
                "papers": [
                    "A vision for embedded software.",
                    "Establishing a tight bound on task interference in embedded system instruction caches.",
                    "Storage allocation for embedded processors.",
                    "Patchable instruction ROM architecture.",
                    "Heterogeneous memory management for embedded systems.",
                    "Transparent data-memory organizations for digital signal processors.",
                    "A new method for compiling schizophrenic synchronous programs.",
                    "An empirical evaluation of high level transformations for embedded processors.",
                    "Combined partitioning and data padding for scheduling multiple loop nests.",
                    "A novel approach to code analysis of digital signal processing systems.",
                    "The very portable optimizer for digital signal processors.",
                    "A software development tool chain for a reconfigurable processor.",
                    "Hardware compilation of sequential Ada.",
                    "Design space characterization for architecture/compiler co-exploration.",
                    "A compiler framework for mapping applications to a coarse-grained reconfigurable computer architecture.",
                    "Pattern matching in reconfigurable logic for packet classification.",
                    "Efficient longest executable path search for programs with complex flows and pipeline effects.",
                    "Tailoring pipeline bypassing and functional unit mapping to application in clustered VLIW architectures.",
                    "A system-on-a-chip lock cache with task preemption support.",
                    "ShiftQ: a bufferred interconnect for custom loop accelerators.",
                    "Heads and tails: a variable-length instruction format supporting parallel fetch and decode.",
                    "The emerging power crisis in embedded processors: what can a poor compiler do?",
                    "Application specific architectures: a recipe for fast, flexible and power efficient designs.",
                    "Textiles and computing: background and opportunities for convergence.",
                    "A prototype network embedded in textile fabric.",
                    "Algorithms for energy optimization using processor instructions.",
                    "The performance and energy consumption of three embedded real-time operating systems.",
                    "Comparing power consumption of an SMT and a CMP DSP for mobile phone workloads.",
                    "EDF scheduling using two-mode voltage-clock-scaling for hard real-time systems.",
                    "Energy-efficient instruction cache using page-based placement.",
                    "Computation offloading to save energy on handheld devices: a partition scheme."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "CASES 2000",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cases/2000",
                "sub_name": "Proceedings of the 2000 International Conference on Compilers, Architectures and Synthesis for Embedded Systems, CASES 2000, San Jose, California, USA, November 7-18, 2000.",
                "count": 27,
                "papers": [
                    "Rigorous development of embedded systems.",
                    "Efficient compilation of ESTEREL for real-time embedded systems.",
                    "Eliminating external fragmentation in a non-moving garbage collector for Java.",
                    "A code generation framework for Java component-based designs.",
                    "A joined architecture/compiler design environment for ASIPs.",
                    "A preprocessing step for global loop transformations for data transfer optimization.",
                    "PROMPT: a mapping environment for telecom applications on \"system-on-a-chip\".",
                    "Embedding SDL implemented protocols into DSP.",
                    "Adapting software pipelining for reconfigurable computing.",
                    "Specification and synthesis of real-time embedded distributed and parallel multiprocessor-based signal processing systems.",
                    "Efficient design space exploration in PICO.",
                    "Design and implementation of a hierarchical exception handling extension to systemC.",
                    "Scheduling algorithms for automated synthesis of pipelined designs on FPGAs for applications described in MATLAB.",
                    "Code generator optimizations for the ST120 DSP-MCU core.",
                    "Dynamic scheduling of concurrent tasks with cost performance trade-off.",
                    "An architecture for embedded software integration using reusable components.",
                    "The era of embedded computing.",
                    "Region-based caching: an energy-delay efficient memory architecture for embedded processors.",
                    "Embedded ISA support for enhanced floating-point to fixed-point ANSI-C compilation.",
                    "Energy-oriented compiler optimizations for partitioned memory architectures.",
                    "Unroll-and-jam for imperfectly-nested loops in DSP applications.",
                    "Handling irregular ILP within conventional VLIW schedulers using artificial resource constraints.",
                    "A programmable unified cache architecture for embedded applications.",
                    "Parallel saturating multioperand adders.",
                    "A dynamic memory management unit for embedded real-time system-on-a-chip.",
                    "A first-step towards an architecture tuning methodology for low power.",
                    "Flexible instruction processors."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "CASES 1999",
        "info": "Washington, DC, USA",
        "venues": []
    },
    {
        "year": "1998",
        "name": "CASES 1998",
        "info": "Washington, DC, USA",
        "venues": []
    }
]