[
    {
        "year": "2021",
        "name": "21st CCGRID 2021",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2021",
                "sub_name": "21st IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing, CCGrid 2021, Melbourne, Australia, May 10-13, 2021.",
                "count": 92,
                "papers": [
                    "Living on the Edge: Efficient Handling of Large Scale Sensor Data.",
                    "Learning Early Exit for Deep Neural Network Inference on Mobile Devices through Multi-Armed Bandits.",
                    "IoT Data Placement in the Fog infrastructure with mobile devices.",
                    "Competition-Based Adaptive Caching for Out-of-core Graph Processing.",
                    "Compression of Time Evolutionary Image Data through Predictive Deep Neural Networks.",
                    "Battle of the Defaults: Extracting Performance Characteristics of HDF5 under Production Load.",
                    "FlashByte: Improving Memory Efficiency with Lightweight Native Storage.",
                    "FSSort: External Sort For Solid State Drives.",
                    "DLIO: A Data-Centric Benchmark for Scientific Deep Learning Applications.",
                    "Mind the Gap: Generating Imputations for Satellite Data Collections at Myriad Spatiotemporal Scopes.",
                    "Co-Designing Multi-Level Checkpoint Restart for MPI Applications.",
                    "Adaptive and Hierarchical Large Message All-to-all Communication Algorithms for Large-scale Dense GPU Systems.",
                    "Shared-Memory Communication for Containerized Workflows.",
                    "TiAcc: Triangle-inequality based Hardware Accelerator for K-means on FPGAs.",
                    "RMACXX: An Efficient High-Level C++ Interface over MPI-3 RMA.",
                    "Quantum annealing for ICT system design automation.",
                    "DVQShare: An Analytics System for DNN-based Video Queries.",
                    "Perph: A Workload Co-location Agent with Online Performance Prediction and Resource Inference.",
                    "Machine Learning for Load Balancing in Cloud Datacenters.",
                    "A Simulator for Intelligent Workload Managers in Heterogeneous Clusters.",
                    "Data-driven scheduling in serverless computing to reduce response time.",
                    "Straggler-Aware Parallel Graph Processing in Hybrid Memory Systems.",
                    "CASH: A Credit Aware Scheduling for Public Cloud Platforms.",
                    "IMITA: Imitation Learning for Generalizing Cloud Orchestration.",
                    "Comparing SARS-CoV-2 Sequences using a Commercial Cloud with a Spot Instance Based Dynamic Scheduler.",
                    "Fuzzy-Engineered Multi-Cloud Resource Brokering for Data-intensive Applications.",
                    "User-Centric Design and Evolvable Architecture for Science Gateways: A Case Study.",
                    "Efficient MPI-based Communication for GPU-Accelerated Dask Applications.",
                    "Characterizing Input-sensitivity in Tightly-Coupled Collaborative Graph Algorithms.",
                    "Deep Reinforcement Learning for Collaborative Offloading in Heterogeneous Edge Networks.",
                    "Profile-guided Frequency Scaling for Latency-Critical Search Workloads.",
                    "MEAD: Model-Based Vertical Auto-Scaling for Data Stream Processing.",
                    "SelfWatts: On-the-fly Selection of Performance Events to Optimize Software-defined Power Meters.",
                    "PriPro: Towards Effective Privacy Protection on Edge-Cloud System running DNN Inference.",
                    "Efficient DLP-visor: An efficient hypervisor-based DLP.",
                    "ZSS Signature Based Data Integrity Verification for Mobile Edge Computing.",
                    "SAED: Edge-Based Intelligence for Privacy-Preserving Enterprise Search on the Cloud.",
                    "Experiences Building and Deploying Wireless Sensor Nodes for the Arctic Tundra.",
                    "VRefine: Refining Massive Surveillance Videos for Efficient Store and Fast Analyzing.",
                    "An Allreduce Algorithm and Network Co-design for Large-Scale Training of Distributed Deep Learning.",
                    "Improving adaptive routing performance on large scale Megafly topology.",
                    "T-Rank: A Lightweight Spectrum based Fault Localization Approach for Microservice Systems.",
                    "CaDRoP: Cost Optimized Convergent Causal Consistency in Social Network Systems.",
                    "Enhanced-XGB: An Online Service Resource Demand Forecasting Method for Colocation Data Centers.",
                    "Hybrid Workflow Provisioning and Scheduling on Cooperative Edge Cloud Computing.",
                    "OpenDC 2.0: Convenient Modeling and Simulation of Emerging Technologies in Cloud Datacenters.",
                    "Scheduling Containers Rather Than Functions for Function-as-a-Service.",
                    "Joint Network Selection and Task Offloading in Mobile Edge Computing.",
                    "Deadline-aware Dynamic Resource Management in Serverless Computing Environments.",
                    "EFFECT: Energy-efficient Fog Computing Framework for Real-time Video Processing.",
                    "Resilient Stream Processing in Edge Computing.",
                    "A Two-Sided Matching Model for Data Stream Processing in the Cloud - Fog Continuum.",
                    "TreeNet: A Hierarchical Deep Learning Model to Facilitate Edge Intelligence for Resource-Constrained Devices.",
                    "Automating Conflict Detection and Mitigation in Large-Scale IoT Systems.",
                    "Fused DSConv: Optimizing Sparse CNN Inference for Execution on Edge Devices.",
                    "AI-oriented Workload Allocation for Cloud-Edge Computing.",
                    "Edge (of the Earth) Replication: Optimizing Content Delivery in Large LEO Satellite Communication Networks.",
                    "A Holistic System Software Integration of Disaggregated Memory for Next-Generation Cloud Infrastructures.",
                    "WSGP: A Window-based Streaming Graph Partitioning Approach.",
                    "Forecasting Operation Metrics for Virtualized Network Functions.",
                    "LIMOCE: Live Migration of Containers in the Edge.",
                    "Edge4Emotion: An Edge Computing based Multi-source Emotion Recognition Platform for Human-Centric Software Engineering.",
                    "Towards Straggler-Tolerant and Accuracy-Aware Distributed DNN Training in Clouds.",
                    "AMAS: Adaptive Auto-Scaling on the Edge.",
                    "A Blockchain-aided Self-Sovereign Identity Framework for Edge-based UAV Delivery System.",
                    "IoTwins: Design and Implementation of a Platform for the Management of Digital Twins in Industrial Scenarios.",
                    "Towards a Cognitive Compute Continuum: An Architecture for Ad-Hoc Self-Managed Swarms.",
                    "OCE-DNS: an innovative Osmotic Computing Enabled Domain Name System.",
                    "ECO: Edge-Cloud Optimization of 5G applications.",
                    "Virtual Device Model extending NGSI-LD for FaaS at the Edge.",
                    "From Things into Clouds - and back.",
                    "IOTier: A Virtual Testbed to evaluate systems for IoT environments.",
                    "Distribution of Updates to IoT Nodes in a Resource-Challenged Environment.",
                    "VeerEdge: Towards an Edge-Centric IoT Gateway.",
                    "Security aspects in blockchain-based scheduling in mobile multi-cloud computing.",
                    "Benchmarking Serverless Workloads on Kubernetes.",
                    "Security-aware job allocation in mobile cloud computing.",
                    "Real-Time Scheduling in Drop Computing.",
                    "Autoencoder-based IDS for cloud and mobile devices.",
                    "Software Defined Ambit of Data Integrity for the Internet of Things.",
                    "Trusted Ecosystem for IoT Service Provisioning Based on Brokering.",
                    "Secure Asset Tracking in Manufacturing through Employing IOTA Distributed Ledger Technology.",
                    "Privacy-Aware and Context-Sensitive Access Control for Opportunistic Data Sharing.",
                    "LR-GD-RNS: Enhanced Privacy-Preserving Logistic Regression Algorithms for Secure Deployment in Untrusted Environments.",
                    "Smart Contract based Distributed IoT Security: A Protocol for Autonomous Device Management.",
                    "Algorithms for scheduling scientific workflows on serverless architecture.",
                    "High Performance Serverless Architecture for Deep Learning Workflows.",
                    "A Reinforcement Learning Approach to Reduce Serverless Function Cold Start Frequency.",
                    "AI-based Resource Allocation: Reinforcement Learning for Adaptive Auto-scaling in Serverless Environments.",
                    "QoS aware FaaS platform.",
                    "SNR: Network-aware Geo-Distributed Stream Analytics.",
                    "Partially Encrypted Multi-Party Computation for Federated Learning."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "20th CCGRID 2020",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2020",
                "sub_name": "20th IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing, CCGRID 2020, Melbourne, Australia, May 11-14, 2020.",
                "count": 103,
                "papers": [
                    "Human-centric Software Engineering for Next Generation Cloud- and Edge-based Smart Living Applications.",
                    "A Pattern-Based API for Mapping Applications to a Hierarchy of Multi-Core Devices.",
                    "Reliability Management for Blockchain-Based Decentralized Multi-Cloud.",
                    "Co-Utile Peer-to-Peer Decentralized Computing.",
                    "Performance Optimization for Edge-Cloud Serverless Platforms via Dynamic Task Placement.",
                    "NFV Placement in Resource-Scarce Edge Nodes.",
                    "NAMB: A Quick and Flexible Stream Processing Application Prototype Generator.",
                    "Merge, Split, and Cluster: Dynamic Deployment of Stream Processing Applications.",
                    "Robustness-oriented k Edge Server Placement.",
                    "REDEMON: Resilient Decentralized Monitoring System for Edge Infrastructures.",
                    "Design and Characterization of InfiniBand Hardware Tag Matching in MPI.",
                    "Characterizing Accuracy-Aware Resilience of GPGPU Applications.",
                    "Multi-site Connectivity for Edge Infrastructures : DIMINET: DIstributed Module for Inter-site NETworking.",
                    "Multiverse: Dynamic VM Provisioning for Virtualized High Performance Computing Clusters.",
                    "BBOS: Efficient HPC Storage Management via Burst Buffer Over-Subscription.",
                    "Thermo-Mechanical Coupling Induced Performance Degradation in Storage Systems.",
                    "Efficient Metadata Indexing for HPC Storage Systems.",
                    "DeepFreeze: Towards Scalable Asynchronous Checkpointing of Deep Learning Models.",
                    "Pufferscale: Rescaling HPC Data Services for High Energy Physics Applications.",
                    "Parallel I/O on Compressed Data Files: Semantics, Algorithms, and Performance Evaluation.",
                    "Tracking scientific simulation using online time-series modelling.",
                    "GAN-ASD: Precise Software Aging State Detection for Android System Based on BEGAN Model and State Clustering.",
                    "Using Arm Scalable Vector Extension to Optimize OPEN MPI.",
                    "Energy efficiency and performance modeling of stencil applications on manycore and GPU computing resources.",
                    "Checkpoint Restart Support for Heterogeneous HPC Applications.",
                    "Marabunta: Continuous Distributed Processing of Skewed Streams.",
                    "Alleviating Load Imbalance in Data Processing for Large-Scale Deep Learning.",
                    "MARBLE: A Multi-GPU Aware Job Scheduler for Deep Learning on HPC Systems.",
                    "A NSGA-II-based Approach for Multi-objective Micro-service Allocation in Container-based Clouds.",
                    "Enhancing microservices architectures using data-driven service discovery and QoS guarantees.",
                    "FlexGPU: A Flexible and Efficient Scheduler for GPU Sharing Systems.",
                    "Multi-resource Low-latency Cluster Scheduling without Execution Time Estimation.",
                    "Salamander: a Holistic Scheduling of MapReduce Jobs on Ephemeral Cloud Resources.",
                    "Performance Evaluation of Security-Aware List Scheduling Algorithms in IaaS Cloud.",
                    "Predictable Efficiency for Reconfiguration of Service-Oriented Systems with Concerto.",
                    "CSR2: A New Format for SIMD-accelerated SpMV.",
                    "Trua: Efficient Task Replication for Flexible User-defined Availability in Scientific Grids.",
                    "In Datacenter Performance, The Only Constant Is Change.",
                    "Performance Comparison of Terraform and Cloudify as Multicloud Orchestrators.",
                    "Cross Architectural Power Modelling.",
                    "A Feedforward Neural Network based Model to Predict Sub-optimal Path Attack in IoT-LLNs.",
                    "Two-Phase Multi-Party Computation Enabled Privacy-Preserving Federated Learning.",
                    "Cost-Effective Malware Detection as a Service Over Serverless Cloud Using Deep Reinforcement Learning.",
                    "Solving the Interdependency Problem: A Secure Virtual Machine Allocation Method Relying on the Attacker's Efficiency and Coverage.",
                    "Key-Escrow Free Attribute-Based Multi-Keyword Search with Dynamic Policy Update in Cloud Computing.",
                    "The Power of ARM64 in Public Clouds.",
                    "Trading Data Size and CNN Confidence Score for Energy Efficient CPS Node Communications.",
                    "SmartWatts: Self-Calibrating Software-Defined Power Meter for Containers.",
                    "Energy Efficient Algorithms based on VM Consolidation for Cloud Computing: Comparisons and Evaluations.",
                    "A Distributed Path Query Engine for Temporal Property Graphs.",
                    "Performance benefits of Intel® Optane™ DC persistent memory for the parallel processing of large neuroimaging data.",
                    "Serdab: An IoT Framework for Partitioning Neural Networks Computation across Multiple Enclaves.",
                    "Standard Deviation Based Adaptive Gradient Compression For Distributed Deep Learning.",
                    "SparkLeBLAST: Scalable Parallelization of BLAST Sequence Alignment Using Spark.",
                    "Increasing the Profit of Cloud Providers through DRAM Operation at Reduced Margins.",
                    "Indicator-Directed Dynamic Power Management for Iterative Workloads on GPU-Accelerated Systems.",
                    "Online Multi-User Workflow Scheduling Algorithm for Fairness and Energy Optimization.",
                    "A Data-Driven Frequency Scaling Approach for Deadline-aware Energy Efficient Scheduling on Graphics Processing Units (GPUs).",
                    "An efficient service dispersal mechanism for fog and cloud computing using deep reinforcement learning.",
                    "Adaptive AI-based auto-scaling for Kubernetes.",
                    "DyBatch: Efficient Batching and Fair Scheduling for Deep Learning Inference on Time-sharing Devices.",
                    "Predicting Resource Requirement in Intermediate Palomar Transient Factory Workflow.",
                    "Q-Flink: A QoS-Aware Controller for Apache Flink.",
                    "ApproxDNN: Incentivizing DNN Approximation in Cloud.",
                    "A Network Cost-aware Geo-distributed Data Analytics System.",
                    "Detecting and Reacting to Anomalies in Relaxed Uses of Raft.",
                    "ECHO: A Tool for Empirical Evaluation Cloud Chatbots.",
                    "TDD4Fog: A Test-Driven Software Development Platform for Fog Computing Systems.",
                    "A Graph-Based Indexing Technique to Enhance the Performance of Boolean AND Queries in Big Data Systems.",
                    "A Comparative Analysis of Task Scheduling Approaches in Cloud Computing.",
                    "CUBE - Towards an Optimal Scaling of Cosmological N-body Simulations.",
                    "Deadline-aware Scheduling in Cloud-Fog-Edge Systems.",
                    "Machine learning techniques for transmission parameters classification in multi-agent managed network.",
                    "Adaptive context-aware energy optimization for services on mobile devices with use of machine learning considering security aspects.",
                    "TRM-EAT - a New Tool for Reliability Evaluation of Trust and Reputation Management Systems in Mobile Environments.",
                    "Partial data permutation for training deep neural networks.",
                    "SOL: Effortless Device Support for AI Frameworks without Source Code Changes.",
                    "Benchmarking the Performance and Energy Efficiency of AI Accelerators for AI Training.",
                    "Automatic Parallelization of Probabilistic Models with Varying Load Imbalance.",
                    "Performance Analysis of Distributed and Scalable Deep Learning.",
                    "Integrated Proactive Defense for Software Defined Internet of Things under Multi-Target Attacks.",
                    "Analysis and Optimization of TLS-based Security Mechanisms for Low Power IoT Systems.",
                    "An Edge-based Distributed Ledger Architecture for Supporting Decentralized Incentives in Mobile Crowdsensing.",
                    "Verifiable Secret Share for file storage with cheater identification.",
                    "Efficient Certificate Management in Blockchain based Internet of Vehicles.",
                    "Distributed IoT Attestation via Blockchain.",
                    "An Iterative Feedback Mechanism for Auto-Optimizing Software Resource Allocation in Multi-Tier Web Systems.",
                    "CLAWER: Context-aware Cloud-Fog based Workflow Management Framework for Health Emergency Services.",
                    "Improved Matrix-based Attribute Reduction Algorithm Based on Minimal Elements for Mobile Edge Computing.",
                    "Real-time Situation Awareness of Industrial Process based on Deep Learning at the Edge Server.",
                    "BDSP in the cloud: Scheduling and Load Balancing utlizing SDN and CEP.",
                    "A Locality Sensitive Hashing Based Approach for Federated Recommender System.",
                    "A Service Mesh-Based Load Balancing and Task Scheduling System for Deep Learning Applications.",
                    "Coflow Scheduling with Performance Guarantees for Data Center Applications.",
                    "VM Performance Maximization and PM Load Balancing Virtual Machine Placement in Cloud.",
                    "Exploring Erasure Coding Techniques for High Availability of Intermediate Data.",
                    "Sharing digital object across data infrastructures using Named Data Networking (NDN).",
                    "FLIP-FLexible IoT Path Programming Framework for Large-scale IoT.",
                    "Bitwise Reproducible task execution on unstructured mesh applications.",
                    "Exploring Mobility Behaviours of Moving Agents from Trajectory traces in Cloud-Fog-Edge Collaborative Framework.",
                    "Helibot - A Smart Distributed Energy Resources Platform for Futuristic Smart Grids.",
                    "Data Management in Erasure-Coded Distributed Storage Systems.",
                    "Automatic parallel implementations of adjoint codes for structured mesh applications."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "19th CCGRID 2019",
        "info": "Larnaca, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2019",
                "sub_name": "19th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGRID 2019, Larnaca, Cyprus, May 14-17, 2019.",
                "count": 81,
                "papers": [
                    "One Can Only Gain by Replacing EASY Backfilling: A Simple Scheduling Policies Case Study.",
                    "NBBS: A Non-Blocking Buddy System for Multi-core Machines.",
                    "Optimizing Performance and Computing Resource Management of In-memory Big Data Analytics with Disaggregated Persistent Memory.",
                    "Detection of Silent Data Corruptions in Smoothed Particle Hydrodynamics Simulations.",
                    "EC-Shuffle: Dynamic Erasure Coding Optimization for Efficient and Reliable Shuffle in Spark.",
                    "Application-Level Differential Checkpointing for HPC Applications with Dynamic Datasets.",
                    "Million-Core-Scalable Simulation of the Elastic Migration Algorithm on Sunway TaihuLight Supercomputer.",
                    "Scalable Video Transcoding in Public Clouds.",
                    "Dynamic Scaling of Video Analytics for Wide-Area Tracking in Urban Spaces.",
                    "An Intelligent, Adaptive, and Flexible Data Compression Framework.",
                    "ePipe: Near Real-Time Polyglot Persistence of HopsFS Metadata.",
                    "A Zoom-in Analysis of I/O Logs to Detect Root Causes of I/O Performance Bottlenecks.",
                    "Lamda-Flow: Automatic Pushdown of Dataflow Operators Close to the Data.",
                    "Data Transfer between Scientific Facilities - Bottleneck Analysis, Insights and Optimizations.",
                    "Is it Worth Relaxing Fault Tolerance to Speed Up Decommission in Distributed Storage Systems?",
                    "Visual Performance Analysis of Memory Behavior in a Task-Based Runtime on Hybrid Platforms.",
                    "Autotuning Under Tight Budget Constraints: A Transparent Design of Experiments Approach.",
                    "BOOTABLE: Bioinformatics Benchmark Tool Suite.",
                    "Reproducible Scientific Workflows for High Performance and Cloud Computing.",
                    "Mobile Smart-Contract Lifecycle Governance with Incentivized Proof-of-Stake for Oligopoly-Formation Prevention.",
                    "Towards Efficient Solvers for Optimisation Problems.",
                    "A Performance Driven Micro Services-Based Architecture/System for Analyzing Noisy IoT Data.",
                    "A Preliminary Fault Taxonomy for Multi-tenant SaaS Systems.",
                    "Towards Enabling Dynamic Resource Estimation and Correction for Improving Utilization in an Apache Mesos Cloud Environment.",
                    "DMC: A Differential Marketplace for Cloud Resources.",
                    "Fuzzy Matching: Hardware Accelerated MPI Communication Middleware.",
                    "Efficient Congestion Management for High-Speed Interconnects using Adaptive Routing.",
                    "Batched Sparse Matrix Multiplication for Accelerating Graph Convolutional Networks.",
                    "Anomaly Detection and Classification using Distributed Tracing and Deep Learning.",
                    "Missing Data Recovery in Large-Scale, Sparse Datacenter Traces: An Alibaba Case Study.",
                    "Towards Securing Data Transfers Against Silent Data Corruption.",
                    "Game Theoretic-Based Approaches for Cybersecurity-Aware Virtual Machine Placement in Public Cloud Clusters.",
                    "Beyond Load Balancing: Package-Aware Scheduling for Serverless Platforms.",
                    "SMR-X: Flexible Parallel State Machine Replication for Cloud Computing.",
                    "Exploiting CPU Voltage Margins to Increase the Profit of Cloud Infrastructure Providers.",
                    "CRAM: a Container Resource Allocation Mechanism for Big Data Streaming Applications.",
                    "Efficient Job Scheduling for Clusters with Shared Tiered Storage.",
                    "On the Cost of Acking in Data Stream Processing Systems.",
                    "Multivariate LSTM-Based Location-Aware Workload Prediction for Edge Data Centers.",
                    "DCA-IO: A Dynamic I/O Control Scheme for Parallel and Distributed File Systems.",
                    "A Machine Learning Approach for Productive Data Locality Exploitation in Parallel Computing Systems.",
                    "Scalability of the NewMadeleine Communication Library for Large Numbers of MPI Point-to-Point Requests.",
                    "Real-Time Scheduling Policy Selection from Queue and Machine States.",
                    "A Novel Stochastic Gradient Descent Algorithm Based on Grouping over Heterogeneous Cluster Systems for Distributed Deep Learning.",
                    "Hybrid Resource Management for HPC and Data Intensive Workloads.",
                    "Design and Characterization of Shared Address Space MPI Collectives on Modern Architectures.",
                    "ESprint: QoS-Aware Management for Effective Computational Sprinting in Data Centers.",
                    "Exhaustive Study of Hierarchical AllReduce Patterns for Large Messages Between GPUs.",
                    "Privacy-Preserving Record Linkage with Spark.",
                    "Performance Evaluation of Big Data Processing Strategies for Neuroimaging.",
                    "Distributed Operator Placement for IoT Data Analytics Across Edge and Cloud Resources.",
                    "Adaptive Quality Optimization of Computer Vision Tasks in Resource-Constrained Devices using Edge Computing.",
                    "Proximity-Aware Traffic Routing in Distributed Fog Computing Platforms.",
                    "On Cost-Driven Computation Offloading in the Edge: A New Model Approach.",
                    "Scalable Distributed DNN Training using TensorFlow and CUDA-Aware MPI: Characterization, Designs, and Performance Evaluation.",
                    "Performance Optimization on Model Synchronization in Parallel Stochastic Gradient Descent Based SVM.",
                    "Distributed MCMC Inference in Dirichlet Process Mixture Models Using Julia.",
                    "TensorFlow on State-of-the-Art HPC Clusters: A Machine Learning use Case.",
                    "Theoretical Scalability Analysis of Distributed Deep Convolutional Neural Networks.",
                    "An Evaluation of Transfer Learning for Classifying Sales Engagement Emails at Large Scale.",
                    "Volumetric Segmentation via Neural Networks Improves Neutron Crystallography Data Analysis.",
                    "Effective and Efficient Big Data Management in Distributed Environments: Models, Issues, and Research Perspectives.",
                    "Data Driven Priority Scheduling on a Spark Streaming System.",
                    "Efficient Distributed Range Query Processing in Apache Spark.",
                    "Adapting the Secretary Hiring Problem for Optimal Hot-Cold Tier Placement Under Top-K Workloads.",
                    "Pattern Mining from big IoT Data with fog Computing: Models, Issues, and Research Perspectives.",
                    "Multi-objective Container Deployment on Heterogeneous Clusters.",
                    "Deep Reinforcement Learning for IoT Network Dynamic Clustering in Edge Computing.",
                    "Miracle: An Agile Colocation Platform for Enabling XaaS Cloud Architecture.",
                    "On Distributed Collaboration for Biomedical Analyses.",
                    "Reproducibility and Performance of Deep Learning Applications for Cancer Detection in Pathological Images.",
                    "Exploiting Stream Parallelism of MRI Reconstruction Using GrPPI over Multiple Back-Ends.",
                    "Towards a Science Gateway for Bioinformatics: Experiences in the Brazilian System of High Performance Computing.",
                    "Big Data Analytics Exploration of Green Space and Mental Health in Melbourne.",
                    "Enabling Large Scale Data Production for OpenDose with GATE on the EGI Infrastructure.",
                    "A Framework for SLO-driven Cloud Specification and Brokerage.",
                    "Optimized Memory Management for a Java-Based Distributed In-memory System.",
                    "Extensible Declarative Management of Cloud Resources across Providers.",
                    "Towards Configurable Cloud Application Security.",
                    "Same Same, but Different: A Descriptive Intra-IaaS Differentiation.",
                    "A Performance Improvement Approach for Second-Order Optimization in Large Mini-batch Training."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "18th CCGRID 2018",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2018",
                "sub_name": "18th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGRID 2018, Washington, DC, USA, May 1-4, 2018.",
                "count": 84,
                "papers": [
                    "A Network-Aware Scheduler in Data-Parallel Clusters for High Performance.",
                    "Bandwidth Scheduling with Flexible Multi-paths in High-Performance Networks.",
                    "CAVA: Exploring Memory Locality for Big Data Analytics in Virtualized Clusters.",
                    "Multi-Level Load Balancing with an Integrated Runtime Approach.",
                    "RPPC: A Holistic Runtime System for Maximizing Performance Under Power Capping.",
                    "Enhancing Efficiency of Hybrid Transactional Memory Via Dynamic Data Partitioning Schemes.",
                    "Uncertainty-Aware Elastic Virtual Machine Scheduling for Stream Processing Systems.",
                    "Adaptive Energy-Aware Scheduling of Dynamic Event Analytics Across Edge and Cloud Resources.",
                    "First Hop Mobile Offloading of DAG Computations.",
                    "bQueue: A Coarse-Grained Bucket QoS Scheduler.",
                    "SuperCell: Adaptive Software-Defined Storage for Cloud Storage Workloads.",
                    "Toward Scalable and Asynchronous Object-Centric Data Management for HPC.",
                    "An Empirical Evaluation of Allgatherv on Multi-GPU Systems.",
                    "Achieving Performance Balance Among Spark Frameworks with Two-Level Schedulers.",
                    "Experimental Study on the Performance and Resource Utilization of Data Streaming Frameworks.",
                    "Towards Resource and Contract Heterogeneity Aware Rescaling for Cloud-Hosted Applications.",
                    "Efficient Fault Tolerance Through Dynamic Node Replacement.",
                    "A Provider-Agnostic Approach to Multi-cloud Orchestration Using a Constraint Language.",
                    "AKIN: A Streaming Graph Partitioning Algorithm for Distributed Graph Storage Systems.",
                    "RISP: A Reconfigurable In-Storage Processing Framework with Energy-Awareness.",
                    "Programmable Caches with a Data Management Language and Policy Engine.",
                    "One Size Does Not Fit All: The Case for Chunking Configuration in Backup Deduplication.",
                    "A Trace-Based Performance Study of Autoscaling Workloads of Workflows in Datacenters.",
                    "Towards Massive Consolidation in Data Centers with SEaMLESS.",
                    "Performance Optimization of Budget-Constrained MapReduce Workflows in Multi-Clouds.",
                    "Addressing the Challenges of Executing a Massive Computational Cluster in the Cloud.",
                    "RideMatcher: Peer-to-Peer Matching of Passengers for Efficient Ridesharing.",
                    "Optimizing Preconditioned Conjugate Gradient on TaihuLight for OpenFOAM.",
                    "Adaptive Communication for Distributed Deep Learning on Commodity GPU Cluster.",
                    "Parallel Low Discrepancy Parameter Sweep for Public Health Policy.",
                    "Exposing Hidden Performance Opportunities in High Performance GPU Applications.",
                    "Secure and Dynamic Core and Cache Partitioning for Safe and Efficient Server Consolidation.",
                    "Self-Aware Workload Forecasting in Data Center Power Prediction.",
                    "The Impact of Task Runtime Estimate Accuracy on Scheduling Workloads of Workflows.",
                    "Data Analysis of a Google Data Center.",
                    "Davram: Distributed Virtual Memory in User Space.",
                    "Building Blocks for Workflow System Middleware.",
                    "Distributed Cloud Cache.",
                    "Intelligently-Automated Facilities Expansion with the HEPCloud Decision Engine.",
                    "SAIDS: A Self-Adaptable Intrusion Detection System for IaaS Clouds.",
                    "RaaS: Resilience as a Service.",
                    "Evaluation of Highly Available Cloud Streaming Systems for Performance and Price.",
                    "GPU-Accelerated Algorithms for Allocating Virtual Infrastructure in Cloud Data Centers.",
                    "h-Fair: Asymptotic Scheduling of Heavy Workloads in Heterogeneous Data Centers.",
                    "Location, Location, Location: Exploring Amazon EC2 Spot Instance Pricing Across Geographical Regions.",
                    "High-Cold Environment Joint Observation and Research Cloud of China.",
                    "Optimizing Data Transfers for Improved Performance on Shared GPUs Using Reinforcement Learning.",
                    "An Elasticity Study of Distributed Graph Processing.",
                    "A Conceptual Framework for the Use of Graph Representation Within High Energy Physics Analysis.",
                    "An Overview of Cloud Simulation Enhancement Using the Monte-Carlo Method.",
                    "Improving Energy Efficiency of Database Clusters Through Prefetching and Caching.",
                    "A Comparative Study of Topology Design Approaches for HPC Interconnects.",
                    "A Low-Latency Memory-Efficient IPv6 Lookup Engine Implemented on FPGA Using High-Level Synthesis.",
                    "QAMEM: Query Aware Memory Energy Management.",
                    "Approximations and Bounds for (n, k) Fork-Join Queues: A Linear Transformation Approach.",
                    "Real-Time Graph Partition and Embedding of Large Network.",
                    "SHAD: The Scalable High-Performance Algorithms and Data-Structures Library.",
                    "TýrFS: Increasing Small Files Access Performance with Dynamic Metadata Replication.",
                    "Stocator: Providing High Performance and Fault Tolerance for Apache Spark Over Object Storage.",
                    "HPDV: A Highly Parallel Deduplication Cluster for Virtual Machine Images.",
                    "Understanding scale-Dependent soft-Error Behavior of Scientific Applications.",
                    "CloudRanger: Root Cause Identification for Cloud Native Systems.",
                    "Decentralized Admission Control for High-Throughput Key-Value Data Stores.",
                    "SHMEMGraph: Efficient and Balanced Graph Processing Using One-Sided Communication.",
                    "Process Affinity, Metrics and Impact on Performance: An Empirical Study.",
                    "ApproxG: Fast Approximate Parallel Graphlet Counting Through Accuracy Control.",
                    "A Machine Learning Auditing Model for Detection of Multi-Tenancy Issues Within Tenant Domain.",
                    "Nitro: Network-Aware Virtual Machine Image Management in Geo-Distributed Clouds.",
                    "Modeling Operational Fairness of Hybrid Cloud Brokerage.",
                    "Extreme-Scale Realistic Stencil Computations on Sunway TaihuLight with Ten Million Cores.",
                    "Enabling Trade-offs Between Accuracy and Computational Cost: Adaptive Algorithms to Reduce Time to Clinical Insight.",
                    "Enabling Efficient Inter-Node Message Passing and Remote Memory Access Via a uGNI Based Light-Weight Network Substrate for Cray Interconnects.",
                    "Efficient Messaging for Java Applications Running in Data Centers.",
                    "A Scalable Unified Model for Dynamic Data Structures in Message Passing (Clusters) and Shared Memory (multicore CPUs) Computing environments.",
                    "Improving Data Integrity in Linux Software RAID with Protection Information (T10-PI).",
                    "Accelerating Vertex Cover Optimization on a GPU Architecture.",
                    "Implementation of Unsupervised k-Means Clustering Algorithm Within Amazon Web Services Lambda.",
                    "Service-Oriented Architecture for Big Data Analytics in Smart Cities.",
                    "IoT Edge Device Based Key Frame Extraction for Face in Video Recognition.",
                    "A Hard Real-time Scheduler for Spark on YARN.",
                    "Main-Memory Requirements of Big Data Applications on Commodity Server Platform.",
                    "Information Centric Networking for Sharing and Accessing Digital Objects with Persistent Identifiers on Data Infrastructures.",
                    "A Scalable Cloud-Edge Computing Framework for Supporting Device-Adaptive Big Media Provisioning.",
                    "Pedigree-ing Your Big Data: Data-Driven Big Data Privacy in Distributed Environments."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "17th CCGRID 2017",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2017",
                "sub_name": "Proceedings of the 17th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGRID 2017, Madrid, Spain, May 14-17, 2017.",
                "count": 140,
                "papers": [
                    "Efficient Event Correlation over Distributed Systems.",
                    "4CeeD: Real-Time Data Acquisition and Analysis Framework for Material-related Cyber-Physical Environments.",
                    "Efficient Cache Update for In-Memory Cluster Computing with Spark.",
                    "GPU in-memory processing using Spark for iterative computation.",
                    "Optimal Resource Configuration of Complex Services in the Cloud.",
                    "Modeling Distributed Platforms from Application Traces for Realistic File Transfer Simulation.",
                    "A Comparison of Reinforcement Learning Techniques for Fuzzy Cloud Auto-Scaling.",
                    "Performance Modelling and Cost Effective Execution for Distributed Graph Processing on Configurable VMs.",
                    "Fine-grained Nested Virtual Machine Performance Analysis Through First Level Hypervisor Tracing.",
                    "Adaptive Hybrid Queue Configuration for Supercomputer Systems.",
                    "Flexible Scheduling of Distributed Analytic Applications.",
                    "CtrlCloud: Performance-Aware Adaptive Control for Shared Resources in Clouds.",
                    "QoS-Aware Virtual Infrastructures Allocation on SDN-based Clouds.",
                    "Deploying High Throughput Scientific Workflows on Container Schedulers with Makeflow and Mesos.",
                    "A new on-line method for scheduling independent tasks.",
                    "A Two-Stage Multi-Objective Optimization of Erasure Coding in Overlay Networks.",
                    "Multi-dimensional admission control and capacity planning for IaaS clouds with multiple service classes.",
                    "A Robust Tabu Search Heuristic for VM Consolidation under Demand Uncertainty in Virtualized Datacenters.",
                    "Evaluation of Data Locality Strategies for Hybrid Cloud Bursting of Iterative MapReduce.",
                    "Leveraging Renewable Energy in Edge Clouds for Data Stream Analysis in IoT.",
                    "DOTA: Delay Bounded Optimal Cloudlet Deployment and User Association in WMANs.",
                    "Mitigating YARN Container Overhead with Input Splits.",
                    "Parallel Variable Selection for Effective Performance Prediction.",
                    "Towards Big Data Analytics across Multiple Clusters.",
                    "APHiD: Hierarchical Task Placement to Enable a Tapered Fat Tree Topology for Lower Power and Cost in HPC Networks.",
                    "Swift-X: Accelerating OpenStack Swift with RDMA for Building an Efficient HPC Cloud.",
                    "Offloading communication control logic in GPU accelerated applications.",
                    "Preliminary Performance Analysis of Multi-rail Fat-tree Networks.",
                    "SynAPTIC: Secure And Persistent connecTIvity for Containers.",
                    "CloudSight: A tenant-oriented transparency framework for cross-layer cloud troubleshooting.",
                    "Enabling Distributed Software-Defined Environments Using Dynamic Infrastructure Service Composition.",
                    "CBase: A New Paradigm for Fast Virtual Machine Migration across Data Centers.",
                    "Preemptive Software Transactional Memory.",
                    "Supporting Fault-Tolerance in Presence of In-Situ Analytics.",
                    "Advanced Thread Synchronization for Multithreaded MPI Implementations.",
                    "Unveiling the Interplay Between Global Link Arrangements and Network Management Algorithms on Dragonfly Networks.",
                    "Application-Agnostic Power Monitoring in Virtualized Environments.",
                    "A Performance Study of UCX over InfiniBand.",
                    "Performance Modelling and Verification of Cloud-based Auto-Scaling Policies.",
                    "Joint Optimization of Scaling and Placement of Virtual Network Services.",
                    "Acyclic Partitioning of Large Directed Acyclic Graphs.",
                    "Towards Energy Budget Control in HPC.",
                    "On Estimating Minimum Bids for Amazon EC2 Spot Instances.",
                    "Practical Service Placement Approach for Microservices Architecture.",
                    "Combating the Bandits in the Cloud: A Moving Target Defense Approach.",
                    "Chrysaor: Fine-Grained, Fault-Tolerant Cloud-of-Clouds MapReduce.",
                    "An Anomaly Detection Fabric for Clouds Based on Collaborative VM Communities.",
                    "LogAider: A tool for mining potential correlations of HPC log events.",
                    "Designing and Modelling Selective Replication for Fault-tolerant HPC Applications.",
                    "Security Implications of Blockchain Cloud with Analysis of Block Withholding Attack.",
                    "ProvChain: A Blockchain-based Data Provenance Architecture in Cloud Environment with Enhanced Privacy and Availability.",
                    "T-VMI: Trusted Virtual Machine Introspection in Cloud Environments.",
                    "Modeling correlation between QoS attributes for trust computation in cloud computing environments.",
                    "Crowdsourced Data Integrity Verification for Key-Value Stores in the Cloud.",
                    "Maximum Sustainable Throughput Prediction for Data Stream Processing over Public Clouds.",
                    "WattsKit: Software-Defined Power Monitoring of Distributed Systems.",
                    "Predicting Cloud Performance for HPC Applications: a User-oriented Approach.",
                    "An Approach and Case Study of Cloud Instance Type Selection for Multi-Tier Web Applications.",
                    "Toward a Holistic Framework for Conducting Scientific Evaluations of OpenStack.",
                    "Dynamic Management of In-memory Storage for Efficiently Integrating Compute- and Data-intensive Computing on HPC Systems.",
                    "High-Performance Key-Value Store On OpenSHMEM.",
                    "Energy-efficient I/O Thread Schedulers for NVMe SSDs on NUMA.",
                    "Energy Efficient Algorithm for VNF Placement and Chaining.",
                    "KPI-agnostic Control for Fine-Grained Vertical Elasticity.",
                    "PCSsampler: Sample-based, Private-state Cluster Scheduling.",
                    "Optimized Cloud Deployment of Multi-tenant Software Considering Data Protection Concerns.",
                    "AnalyzeThat: A Programmable Shared-Memory System for an Array of Processing-In-Memory Devices.",
                    "Implementation and Evaluation of One-sided PGAS Communication in XcalableACC for Accelerated Clusters.",
                    "Combining Both a Component Model and a Task-based Model for HPC Applications: a Feasibility Study on Gysela.",
                    "Pattern-Directed Replication Scheme for Heterogeneous Object-based Storage.",
                    "A New File System I/O Mode for Efficient User-level Caching.",
                    "COPS: Cost Based Object Placement Strategies on Hybrid Storage System for DBaaS Cloud.",
                    "Scalable Assembly for Massive Genomic Graphs.",
                    "mD3DOCKxb: An Ultra-Scalable CPU-MIC Coordinated Virtual Screening Framework.",
                    "Scaling a Convolutional Neural Network for classification of Adjective Noun Pairs with TensorFlow on GPU Clusters.",
                    "Scaling HDFS to more than 1 million operations per second with HopsFS.",
                    "Massively Parallel Simulations of Spread of Infectious Diseases over Realistic Social Networks.",
                    "Enhancing the rCUDA Remote GPU Virtualization Framework: from a Prototype to a Production Solution.",
                    "Cable-geometric error-prone approach for low-latency interconnection networks.",
                    "Towards Distributed Software-Defined Environments.",
                    "Dynamic Resource Management Across Cloud-Edge Resources for Performance-Sensitive Applications.",
                    "Optimization of checkpoints and execution model for an implementation of OpenMP on distributed memory architectures.",
                    "Secure cloud storage service for detection of security violations.",
                    "Data-Aware Support for Hybrid HPC and Big Data Applications.",
                    "Performance Optimization by Dynamically Altering Cache Replacement Algorithm in CPU-GPU Heterogeneous Multi-Core Architecture.",
                    "Extending Message Passing Interface Windows to Storage.",
                    "TuNao: A High-Performance and Energy-Efficient Reconfigurable Accelerator for Graph Processing.",
                    "A Live Demo for Showing the Benefits of Applying the Remote GPU Virtualization Technique to Cloud Computing.",
                    "Load and Video Performance Patterns of a Cloud Based WebRTC Architecture.",
                    "Lemonade: A scalable and efficient Spark-based platform for data analytics.",
                    "IBM Research Hybrid Cloud Poster.",
                    "Using the Jetstream Research Cloud to provide Science Gateway resources.",
                    "DSA: Scalable Distributed Sequence Alignment System Using SIMD Instructions.",
                    "AURA: Recovering from Transient Failures in Cloud Deployments.",
                    "BBQ: Elastic MapReduce over Cloud Platforms.",
                    "Multi-agent recommendation system in Internet of Things.",
                    "Massive Data Load on Distributed Database Systems over HBase.",
                    "Mermaid: Integrating Vertex-Centric with Edge-Centric for Real-World Graph Processing.",
                    "Representing Variant Calling Format as Directed Acyclic Graphs to enable the use of cloud computing for efficient and cost effective genome analysis.",
                    "Techniques for Handling Error in User-estimated Execution Times During Resource Management on Systems Processing MapReduce Jobs.",
                    "EffiEye: Application-aware Large Flow Detection in Data Center.",
                    "Using the Cloud for parameter estimation problems: comparing Spark vs MPI with a case-study.",
                    "Analog-Digital Approach in Human Brain Modeling.",
                    "Fine-grained Supervision and Restriction of Biomedical Applications in Linux Containers.",
                    "BIOPET: towards Scalable, Maintainable, User-friendly, Robust and Flexible NGS data analysis pipelines.",
                    "Medical Imaging Processing on a Big Data platform using Python: Experiences with Heterogeneous and Homogeneous Architectures.",
                    "Scheduling Data Stream Jobs on Distributed Systems with Background Load.",
                    "Cloud Resource Scaling for Big Data Streaming Applications Using A Layered Multi-dimensional Hidden Markov Model.",
                    "Cost Model and Analysis of Iterative MapReduce Applications for Hybrid Cloud Bursting.",
                    "Apply Block Index Technique to Scientific Data Analysis and I/O Systems.",
                    "Smart RDF Data storage in Graph Databases.",
                    "A Level-Wise Load Balanced Scientific Workflow Execution Optimization using NSGA-II.",
                    "RAPID: A Fast Data Update Protocol in Erasure Coded Storage Systems for Big Data.",
                    "MapReduce-based Algorithms for Managing Big RDF Graphs: State-of-the-Art Analysis, Paradigms, and Future Directions.",
                    "Optimized MapFile based Storage of Small files in Hadoop.",
                    "An Accuracy-Aware Implementation of Two-Point Three-Dimensional Correlation Function using Bin-Recycling Strategy on GPU.",
                    "A Big Data Architecture for Automotive Applications: PSA Group Deployment Experience.",
                    "Improving Resource Efficiency of Container-instance Clusters on Clouds.",
                    "Hybrid Mobile Edge Computing: Unleashing the Full Potential of Edge Computing in Mobile Device Use Cases.",
                    "Defining Intercloud Security Framework and Architecture Components for Multi-Cloud Data Intensive Applications.",
                    "Analyzing the Parallel I/O Severity of MPI Applications.",
                    "Formal modeling and performance evaluation of a run-time rank remapping technique in Broadcast, Allgather and Allreduce MPI collective operations.",
                    "Automatic Adaption of the Sampling Frequency for Detailed Performance Analysis.",
                    "Performance Models for Communication in Collective I/O Operations.",
                    "Reducing Load Imbalance of Virtual Clusters via Reconfiguration and Adaptive Job Scheduling.",
                    "Empirical Mode Decomposition for Modeling of Parallel Applications on Intel Xeon Phi Processors.",
                    "Energy model for low-power cluster.",
                    "Near-optimal policies for energy-aware task assignment in server farms.",
                    "An Empirical Evaluation of How The Network Impacts The Performance and Energy Efficiency in RAMCloud.",
                    "On the Use of In-Memory Analytics Workflows to Compute eScience Indicators from Large Climate Datasets.",
                    "Exploring Shared State in Key-Value Store for Window-Based Multi-Pattern Streaming Analytics.",
                    "Evaluation of HPC-Big Data Applications Using Cloud Platforms.",
                    "A Data-driven Approach based on Auto-Regressive Models for Energy-Efficient Clouds.",
                    "Automatic Consolidation of Virtual Machines in On-Premises Cloud Platforms.",
                    "A Game-Theoretic Approach for Runtime Capacity Allocation in MapReduce.",
                    "IT Security and Privacy Standards in Comparison: Improving FedRAMP Authorization for Cloud Service Providers.",
                    "A lightweight MapReduce framework for secure processing with SGX.",
                    "PRIVAaaS: privacy approach for a distributed cloud-based data analytics platforms.",
                    "Evaluating the performance of continuous test-based cloud service certification.",
                    "A Game Theoretic Method for VM-to-Hypervisor Attacks Detection in Cloud Environment."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "16th CCGRID 2016",
        "info": "Cartagena, Colombia",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2016",
                "sub_name": "IEEE/ACM 16th International Symposium on Cluster, Cloud and Grid Computing, CCGrid 2016, Cartagena, Colombia, May 16-19, 2016.",
                "count": 100,
                "papers": [
                    "Automatic Communication Optimization of Parallel Applications in Public Clouds.",
                    "Tyrex: Size-Based Resource Allocation in MapReduce Frameworks.",
                    "Demand-Aware Power Management for Power-Constrained HPC Systems.",
                    "Landrush: Rethinking In-Situ Analysis for GPGPU Workflows.",
                    "Service Level and Performance Aware Dynamic Resource Allocation in Overbooked Data Centers.",
                    "DieHard: Reliable Scheduling to Survive Correlated Failures in Cloud Data Centers.",
                    "SHMEMPMI - Shared Memory Based PMI for Improved Performance and Scalability.",
                    "DiBA: Distributed Power Budget Allocation for Large-Scale Computing Clusters.",
                    "KOALA-F: A Resource Manager for Scheduling Frameworks in Clusters.",
                    "Elastic Partition Placement for Non-stationary Graph Algorithms.",
                    "In-Memory Caching Orchestration for Hadoop.",
                    "Increasing the Performance of Data Centers by Combining Remote GPU Virtualization with Slurm.",
                    "Scheduling In-Situ Analytics in Next-Generation Applications.",
                    "CVSS: A Cost-Efficient and QoS-Aware Video Streaming Using Cloud Services.",
                    "AMRZone: A Runtime AMR Data Sharing Framework for Scientific Applications.",
                    "Generalized GPU Acceleration for Applications Employing Finite-Volume Methods.",
                    "Optimizing Massively Parallel Simulations of Infection Spread Through Air-Travel for Policy Analysis.",
                    "Tigres Workflow Library: Supporting Scientific Pipelines on HPC Systems.",
                    "Evaluation of In-Situ Analysis Strategies at Scale for Power Efficiency and Scalability.",
                    "cuART: Fine-Grained Algebraic Reconstruction Technique for Computed Tomography Images on GPUs.",
                    "A Distributed System for Storing and Processing Data from Earth-Observing Satellites: System Design and Performance Evaluation of the Visualisation Tool.",
                    "Towards Fast Overlapping Community Detection.",
                    "Infrastructure Cost Comparison of Running Web Applications in the Cloud Using AWS Lambda and Monolithic and Microservice Architectures.",
                    "Elastic Virtual Machine Scheduling for Continuous Air Traffic Optimization.",
                    "Exploiting Sample Diversity in Distributed Machine Learning Systems.",
                    "OptEx: A Deadline-Aware Cost Optimization Model for Spark.",
                    "Design and Experimental Evaluation of Distributed Heterogeneous Graph-Processing Systems.",
                    "DocLite: A Docker-Based Lightweight Cloud Benchmarking Tool.",
                    "An Automated Tool Profiling Service for the Cloud.",
                    "Hubbub-Scale: Towards Reliable Elastic Scaling under Multi-tenancy.",
                    "Online Power Estimation of Graphics Processing Units.",
                    "A Hybrid Simulation Model for Data Grids.",
                    "Impact and Limitations of Point-to-Point Performance on Collective Algorithms.",
                    "Distem: Evaluation of Fault Tolerance and Load Balancing Strategies in Real HPC Runtimes through Emulation.",
                    "Diagnosing Performance Bottlenecks in Massive Data Parallel Programs.",
                    "Time Provisioning Evaluation of KVM, Docker and Unikernels in a Cloud Platform.",
                    "GoDB: From Batch Processing to Distributed Querying over Property Graphs.",
                    "OS-Based NUMA Optimization: Tackling the Case of Truly Multi-thread Applications with Non-partitioned Virtual Page Accesses.",
                    "iGiraph: A Cost-Efficient Framework for Processing Large-Scale Graphs on Public Clouds.",
                    "Faster: A Low Overhead Framework for Massive Data Analysis.",
                    "Flexible Data-Aware Scheduling for Workflows over an In-memory Object Store.",
                    "Low Latency and Resource-Aware Program Composition for Large-Scale Data Analysis.",
                    "Checkpointing to Minimize Completion Time for Inter-Dependent Parallel Processes on Volunteer Grids.",
                    "mCluster: A Software Framework for Portable Device-Based Volunteer Computing.",
                    "HPC-Reuse: Efficient Process Creation for Running MPI and Hadoop MapReduce on Supercomputers.",
                    "CLARISSE: A Middleware for Data-Staging Coordination and Control on Large-Scale HPC Platforms.",
                    "Usage Pattern-Driven Dynamic Data Layout Reorganization.",
                    "File System Scalability with Highly Decentralized Metadata on Independent Storage Devices.",
                    "DTStorage: Dynamic Tape-Based Storage for Cost-Effective and Highly-Available Streaming Service.",
                    "OptCon: An Adaptable SLA-Aware Consistency Tuning Framework for Quorum-Based Stores.",
                    "Indexing Blocks to Reduce Space and Time Requirements for Searching Large Data Files.",
                    "On Efficient Hierarchical Storage for Big Data Processing.",
                    "Towards Memory-Optimized Data Shuffling Patterns for Big Data Analytics.",
                    "Spatial Support Vector Regression to Detect Silent Errors in the Exascale Era.",
                    "Proof of Violation for Trust and Accountability of Cloud Database Systems.",
                    "CACPPA: A Cloud-Assisted Conditional Privacy Preserving Authentication Protocol for VANET.",
                    "Medusa: An Efficient Cloud Fault-Tolerant MapReduce.",
                    "Say Hello Again: Privacy Preserving Matchmaking Using Cloud in Encounter Based Mobile Social Networks.",
                    "A Formal Approach for Service Composition in a Cloud Resources Sharing Context.",
                    "CloudSwap: A Cloud-Assisted Swap Mechanism for Mobile Devices.",
                    "KVLight: A Lightweight Key-Value Store for Distributed Access in Cloud.",
                    "Efficient Heuristics for Placing Large-Scale Distributed Applications on Multiple Clouds.",
                    "Billing system CPU time on individual VM.",
                    "COMPSs-Mobile: Parallel Programming for Mobile-Cloud Computing.",
                    "Dynamic Adaptation of Policies Using Machine Learning.",
                    "De-Fragmenting the Cloud.",
                    "Towards Understanding Job Heterogeneity in HPC: A NERSC Case Study.",
                    "An Improved Model for Live Migration in Data Centre Simulators.",
                    "Fogbow: A Middleware for the Federation of IaaS Clouds.",
                    "Seeking for the Optimal Energy Modelisation Accuracy to Allow Efficient Datacenter Optimizations.",
                    "Creating Soft Heterogeneity in Clusters Through Firmware Re-configuration.",
                    "RMA-MT: A Benchmark Suite for Assessing MPI Multi-threaded RMA Performance.",
                    "sAXI: A High-Efficient Hardware Inter-Node Link in ARM Server for Remote Memory Access.",
                    "HPC Job Mapping over Reconfigurable Wireless Links.",
                    "Large Scale GPU Accelerated PPMLR-MHD Simulations for Space Weather Forecast.",
                    "Exploring Scalability in Pattern Finding in Galactic Structure Using MapReduce.",
                    "Service Level Agreement Assurance between Cloud Services Providers and Cloud Customers.",
                    "Towards a Resource Manager for Scheduling Frameworks.",
                    "Multiobjective Workflow Scheduling in a Federation of Heterogeneous Green-Powered Data Centers.",
                    "High Performance On-demand Video Transcoding Using Cloud Services.",
                    "Cost-Efficient Elastic Stream Processing Using Application-Agnostic Performance Prediction.",
                    "EDISON: A Web-Based HPC Simulation Execution Framework for Large-Scale Scientific Computing Software.",
                    "Graph-Oriented Code Transformation Approach for Register-Limited Stencils on GPUs.",
                    "Machine Learning Approach for Cloud NoSQL Databases Performance Modeling.",
                    "Reusing Resource Coalitions for Efficient Scheduling on the Intercloud.",
                    "Big Data Analytics Integrating a Parallel Columnar DBMS and the R Language.",
                    "A Quality-Driven Approach for Building Heterogeneous Distributed Databases: The Case of Data Warehouses.",
                    "Management of Distributed Big Data for Social Networks.",
                    "Managing Big Data Analytics Workflows with a Database System.",
                    "I-HASTREAM: Density-Based Hierarchical Clustering of Big Data Streams and Its Application to Big Graph Analytics Tools.",
                    "Sensor Data Air Pollution Prediction by Kernel Models.",
                    "Software Provisioning Inside a Secure Environment as Docker Containers Using Stroll File-System.",
                    "Leveraging High Performance Computing for Bioinformatics: A Methodology that Enables a Reliable Decision-Making.",
                    "Facilitating the Execution of HPC Workloads in Colombia through the Integration of a Private IaaS and a Scientific PaaS/SaaS Marketplace.",
                    "Fostering Collaboration in Energy Research and Technological Developments Applying New Exascale HPC Techniques.",
                    "The Latin American Giant Observatory: A Successful Collaboration in Latin America Based on Cosmic Rays and Computer Science Domains.",
                    "Federated Campus Cloud Colombian Initiative.",
                    "enerGyPU and enerGyPhi Monitor for Power Consumption and Performance Evaluation on Nvidia Tesla GPU and Intel Xeon Phi.",
                    "CUDA Kernel Based Collective Reduction Operations on Large-scale GPU Clusters.",
                    "Fast Parallel Stream Compaction for IA-Based Multi/many-core Processors."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15th CCGRID 2015",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2015",
                "sub_name": "15th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGrid 2015, Shenzhen, China, May 4-7, 2015.",
                "count": 165,
                "papers": [
                    "Analyzing the Impact of CPU Pinning and Partial CPU Loads on Performance and Energy Efficiency.",
                    "Deferred Lightweight Indexing for Log-Structured Key-Value Stores.",
                    "Cowic: A Column-Wise Independent Compression for Log Stream Analysis.",
                    "Dependable Horizontal Scaling Based on Probabilistic Model Checking.",
                    "Towards Efficient Work-Stealing in Virtualized Environments.",
                    "Traffic-Sensitive Live Migration of Virtual Machines.",
                    "Checkpointing as a Service in Heterogeneous Cloud Environments.",
                    "MVAPICH2 over OpenStack with SR-IOV: An Efficient Approach to Build HPC Clouds.",
                    "F/M-CIP: Implementing Flash Memory Cache Using Conservative Insertion and Promotion.",
                    "A Resource Allocation Model for Hybrid Storage Systems.",
                    "Triple-H: A Hybrid Approach to Accelerate HDFS on HPC Clusters with Heterogeneous Storage Architecture.",
                    "PIONEER: A Solution to Parallel I/O Workload Characterization and Generation.",
                    "Revisiting ILP Designs for Throughput-Oriented GPGPU Architecture.",
                    "Non-Blocking PMI Extensions for Fast MPI Startup.",
                    "Reconfigurations for Processor Arrays with Faulty Switches and Links.",
                    "Network-Constrained Packing of Brokered Workloads in Virtualized Environments.",
                    "A Virtual Machine Placement Taxonomy.",
                    "Optimizing Soft Real-Time Scheduling Performance for Virtual Machines with SRT-Xen.",
                    "Integrating Software Defined Networks within a Cloud Federation.",
                    "Partition-Aware Routing to Improve Network Isolation in Infiniband Based Multi-tenant Clusters.",
                    "A Novel Query Caching Scheme for Dynamic InfiniBand Subnets.",
                    "Discovering and Leveraging Content Similarity to Optimize Collective on-Demand Data Access to IaaS Cloud Storage.",
                    "Predicting and Mitigating Jobs Failures in Big Data Clusters.",
                    "Modeling Cross-Architecture Co-Tenancy Performance Interference.",
                    "Taming Latency in Data Center Networking with Erasure Coded Files.",
                    "Adding Storage Simulation Capacities to the SimGrid Toolkit: Concepts, Models, and API.",
                    "Power-Check: An Energy-Efficient Checkpointing Framework for HPC Clusters.",
                    "An Efficient Silent Data Corruption Detection Method with Error-Feedback Control and Even Sampling for HPC Applications.",
                    "Log-Structured Global Array for Efficient Multi-Version Snapshots.",
                    "Towards a High Level Programming Paradigm to Deploy e-Science Applications with Dynamic Workflows on Large Scale Distributed Systems.",
                    "Parallel In Situ Detection of Connected Components in Adaptive Mesh Refinement Data.",
                    "A Multi-GPU Hitting Set Algorithm for GRNs Inference.",
                    "Parallel Clustering of High-Dimensional Social Media Data Streams.",
                    "Optimizing the Bayesian Inference of Phylogeny on Graphic Processors.",
                    "SIRF-1: Enhancing Reliability of Single Flash SSD through Internal Mirroring for Mission-Critical Mobile Applications.",
                    "CloudSky: A Controllable Data Self-Destruction System for Untrusted Cloud Storage Networks.",
                    "Full Integrity and Freshness for Outsourced Storage.",
                    "General Functional Regenerating Codes with Uncoded Repair for Distributed Storage System.",
                    "Lark: Bringing Network Awareness to High Throughput Computing.",
                    "Confuga: Scalable Data Intensive Computing for POSIX Workflows.",
                    "Assessing Safe Task Parallelism in SPEC 2006 INT.",
                    "Optimal Footprint Symbiosis in Shared Cache.",
                    "An Empirical Performance Evaluation of GPU-Enabled Graph-Processing Systems.",
                    "Towards Latency-Optimal Distributed Relay Selection.",
                    "Evaluating the Effectiveness of Replication for Tail-Tolerance.",
                    "ProRenaTa: Proactive and Reactive Tuning to Scale a Distributed Storage System.",
                    "Statistical Characterization of Business-Critical Workloads Hosted in Cloud Datacenters.",
                    "CloudSimSDN: Modeling and Simulation of Software-Defined Cloud Data Centers.",
                    "DualVisor: Redundant Hypervisor Execution for Achieving Hardware Error Resilience in Datacenters.",
                    "An Availability-on-Demand Mechanism for Datacenters.",
                    "Performance-Based Service Differentiation in Clouds.",
                    "Service Clustering for Autonomic Clouds Using Random Forest.",
                    "ProvErr: System Level Statistical Fault Diagnosis Using Dependency Model.",
                    "Quantitative Musings on the Feasibility of Smartphone Clouds.",
                    "Risk-Driven Framework for Decision Support in Cloud Service Selection.",
                    "Architecture Aware Resource Allocation for Structured Grid Applications: Flood Modelling Case.",
                    "Running MAP Inference on Million Node Graphical Models: A High Performance Computing Perspective.",
                    "A Parallel Algorithm for Clipping Polygons with Improved Bounds and a Distributed Overlay Processing System Using MPI.",
                    "Contiguity and Locality in Backfilling Scheduling.",
                    "A Priority-Based Scheduling Heuristic to Maximize Parallelism of Ready Tasks for DAG Applications.",
                    "Scheduling Workloads of Workflows with Unknown Task Runtimes.",
                    "A Scheduler-Level Incentive Mechanism for Energy Efficiency in HPC.",
                    "GERBIL: MPI+YARN.",
                    "YARNsim: Simulating Hadoop YARN.",
                    "Towards Provenance-Based Anomaly Detection in MapReduce.",
                    "Joint Scheduling of Data and Computation in Geo-Distributed Cloud Systems.",
                    "Platform and Co-Runner Affinities for Many-Task Applications in Distributed Computing Platforms.",
                    "Coordinated Resource Management for Large Scale Interactive Data Query Systems.",
                    "A Multi-objective Biogeography-Based Optimization for Virtual Machine Placement.",
                    "Techniques for Enabling Highly Efficient Message Passing on Many-Core Architectures.",
                    "Runtime Support for Irregular Computation in MPI-Based Applications.",
                    "A Framework to Accelerate Protein Structure Comparison Tools.",
                    "Improving Application Performance by Efficiently Utilizing Heterogeneous Many-core Platforms.",
                    "Modeling Gather and Scatter with Hardware Performance Counters for Xeon Phi.",
                    "MIC-Tandem: Parallel X!Tandem Using MIC on Tandem Mass Spectrometry Based Proteomics Data.",
                    "Optimize Parallel Data Access in Big Data Processing.",
                    "mD3DOCKxb: A Deep Parallel Optimized Software for Molecular Docking with Intel Xeon Phi Coprocessors.",
                    "mAMBER: Accelerating Explicit Solvent Molecular Dynamic with Intel Xeon Phi Many-Integrated Core Coprocessors.",
                    "Parallel Solving Method of SOR Based on the Numerical Marine Forecasting Model.",
                    "Towards Self Adaptable Security Monitoring in IaaS Clouds.",
                    "Understanding Unsuccessful Executions in Big-Data Systems.",
                    "Improving Energy Efficiency of Web Servers by Using a Load Distribution Algorithm and Shutting Down Idle Nodes.",
                    "Towards Context-Aware Mobile Crowdsensing in Vehicular Social Networks.",
                    "Towards a Realistic Scheduler for Mixed Workloads with Workflows.",
                    "Predicting the Performance of Parallel Computing Models Using Queuing System.",
                    "Cloud Service Recommendation: State of the Art and Research Challenges.",
                    "Cross-Layer SLA Management for Cloud-hosted Big Data Analytics Applications.",
                    "SWAP-Assembler 2: Scalable Genome Assembler towards Millions of Cores - Practice and Experience.",
                    "FlexiMod: Flexible Coexistence Support for Programming Models.",
                    "A Reliable Distributed Convolutional Neural Network for Biology Image Segmentation.",
                    "A Method to Accelerate GROMACS in Offload Mode on Tianhe-2 Supercomputer.",
                    "Majority Quorum Protocol Dedicated to General Threshold Schemes.",
                    "HAGP: A Hub-Centric Asynchronous Graph Processing Framework for Scale-Free Graph.",
                    "Cost-Efficient High-Performance Internet-Scale Data Analytics over Multi-cloud Environments.",
                    "Big Data Provenance Analysis and Visualization.",
                    "A Novel Approach To Classify Cloud Entities: Universal Cloud Classification (UCC).",
                    "Scalable In-Memory Computing.",
                    "Scaling NWChem with Efficient and Portable Asynchronous Communication in MPI RMA.",
                    "Accurate Scoring of Drug Conformations at the Extreme Scale.",
                    "The Challenge of Scaling Genome Big Data Analysis Software on TH-2 Supercomputer.",
                    "Real-Time Analytics for Fast Evolving Social Graphs.",
                    "Analysing Cancer Genomics in the Elastic Cloud.",
                    "SparkSW: Scalable Distributed Computing System for Large-Scale Biological Sequence Alignment.",
                    "A Comparative Analysis of Scheduling Mechanisms for Virtual Screening Workflow in a Shared Resource Environment.",
                    "Classifications of Computing Sites to Handle Numerical Variability.",
                    "Scaling Machine Learning for Target Prediction in Drug Discovery using Apache Spark.",
                    "Multicenter Data Sharing for Collaboration in Sleep Medicine.",
                    "DBH-CLUS: A Hierarchal Clustering Method to Identify Pick-up/Drop-off Hotspots.",
                    "Experience Based Sink Placement in Mobile Wireless Sensor Network.",
                    "Cloud-Based Machine Learning Tools for Enhanced Big Data Applications.",
                    "Fast Replica Placement and Update Strategies in Tree Networks.",
                    "Cloud-Based OLAP over Big Data: Application Scenarios and Performance Analysis.",
                    "A Data Placement Strategy for Data-Intensive Scientific Workflows in Cloud.",
                    "Computing Heaters - An Energy-Efficient Way to Provide Computing Services.",
                    "Quantifying the Energy Efficiency Challenges of Achieving Exascale Computing.",
                    "Spy: A QoS-Aware Anonymous Multi-Cloud Storage System Supporting DSSE.",
                    "Security-Oriented Cloud Platform for SOA-Based SCADA.",
                    "An Auto-Scaling Framework for Controlling Enterprise Resources on Clouds.",
                    "High Dynamic Range Saturation Intelligence Avoidance for Three-Dimensional Shape Measurement.",
                    "Traffic Management and Forecasting System Based on 3D GIS.",
                    "Sociality Analysis in Wireless Networks.",
                    "PCAH: A PCA-Based Hierarchical Clustering Method for Visual Words Construction.",
                    "Visualizing City Events on Search Engine: Tword the Search Infrustration for Smart City.",
                    "A Structured Light 3D Measurement System Based on Heterogeneous Parallel Computation Model.",
                    "File Multicast Transport Protocol (FMTP).",
                    "Towards Elasticity in Distributed File Systems.",
                    "HPC-ABDS High Performance Computing Enhanced Apache Big Data Stack.",
                    "Programming Heterogeneous Systems with Array Types.",
                    "Characterizing MPI and Hybrid MPI+Threads Applications at Scale: Case Study with BFS.",
                    "Implementation and Evaluation of MPI Nonblocking Collective I/O.",
                    "An Evaluation of Unified Memory Technology on NVIDIA GPUs.",
                    "Analyzing MPI-3.0 Process-Level Shared Memory: A Case Study with Stencil Computations.",
                    "A Task-Type-Based Algorithm for the Energy-Aware Profit Maximizing Scheduling Problem in Heterogeneous Computing Systems.",
                    "On Energy- and Cooling-Aware Data Centre Workload Management.",
                    "Energy Profiling Using IgProf.",
                    "Boosting GPU Performance by Profiling-Based L1 Data Cache Bypassing.",
                    "Lessons Learned Implementing User-Level Failure Mitigation in MPICH.",
                    "A Multilevel Fault-Tolerance Technique for the DAG Data Driven Model.",
                    "Astrophysics Simulation on RSC Massively Parallel Architecture.",
                    "Adaptive Load-Balancing for Consistent Hashing in Heterogeneous Clusters.",
                    "Improving TLB Performance by Increasing Hugepage Ratio.",
                    "Understanding Data Access Patterns Using Object-Differentiated Memory Profiling.",
                    "Assessing Memory Access Performance of Chapel through Synthetic Benchmarks.",
                    "Accelerating Machine Learning Kernel in Hadoop Using FPGAs.",
                    "Parallel DC3 Algorithm for Suffix Array Construction on Many-Core Accelerators.",
                    "A Deep Learning Prediction Process Accelerator Based FPGA.",
                    "Locality-Aware Stencil Computations Using Flash SSDs as Main Memory Extension.",
                    "On the Design of a Demo for Exhibiting rCUDA.",
                    "Toward Implementing Robust Support for Portals 4 Networks in MPICH.",
                    "BigDataDIRAC: Deploying Distributed Big Data Applications.",
                    "A Software Workbench for Interactive, Time Critical and Highly Self-Adaptive Cloud Applications (SWITCH).",
                    "Enumeration System on HBase for Low-Latency.",
                    "Augmenting Performance For Distributed Cloud Storage.",
                    "Discriminative Model for Google Host Load Prediction with Rich Feature Set.",
                    "Self Protecting Data Sharing Using Generic Policies.",
                    "Highly Available Cloud-Based Cluster Management.",
                    "Publish/Subscribe Middleware for Resource Discovery in MANET.",
                    "Hamiltonian Path Strategy for Deadlock-Free and Adaptive Routing in Diametrical 2D Mesh NoCs.",
                    "Design of a More Scalable Database System.",
                    "A Novel Efficient Approach for Screen Image Classification in Remote Display Protocol.",
                    "A QoS Assured Network Service Chaining Algorithm in Network Function Virtualization Architecture.",
                    "Study of the KVM CPU Performance of Open-Source Cloud Management Platforms.",
                    "Modeling the Task of Google MapReduce Workload.",
                    "Eliminating the Redundancy in MapReduce-Based Entity Resolution.",
                    "On-Demand Self-Adaptivity of Service Availability for Cloud Multi-tier Applications."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14th CCGRID 2014",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2014",
                "sub_name": "14th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGrid 2014, Chicago, IL, USA, May 26-29, 2014.",
                "count": 117,
                "papers": [
                    "Improving I/O Throughput of Scientific Applications Using Transparent Parallel Compression.",
                    "Performance Models for CPU-GPU Data Transfers.",
                    "A User-Level InfiniBand-Based File System and Checkpoint Strategy for Burst Buffers.",
                    "Tagged-MapReduce: A General Framework for Secure Computing with Mixed-Sensitivity Data on Hybrid Clouds.",
                    "Toward Detecting Compromised MapReduce Workers through Log Analysis.",
                    "MapReduce Analysis for Cloud-Archived Data.",
                    "Adaptive MapReduce Scheduling in Shared Environments.",
                    "Enabling Efficient Power Provisioning for Enterprise Applications.",
                    "Analytical/ML Mixed Approach for Concurrency Regulation in Software Transactional Memory.",
                    "Bridging Data in the Clouds: An Environment-Aware System for Geographically Distributed Data Transfers.",
                    "Cost-Efficient, Reliable, Utility-Based Session Management in the Cloud.",
                    "A Workflow-Inspired, Modular and Robust Approach to Experiments in Distributed Systems.",
                    "Resource Usage Control in Multi-tenant Applications.",
                    "Mapping Algorithms Optimizing the Overall Manhattan Distance for Pre-Occupied Cluster Computers in SLA-Based Grid Environments.",
                    "SLA-Based Profit Optimization in Cloud Bursting PaaS.",
                    "Evaluating Streaming Strategies for Event Processing Across Infrastructure Clouds.",
                    "CUDAlign 3.0: Parallel Biological Sequence Comparison in Large GPU Clusters.",
                    "Opportunistic High Energy Physics Computing in User Space with Parrot.",
                    "Towards an MPI-Like Framework for the Azure Cloud Platform.",
                    "NoCMsg: Scalable NoC-Based Message Passing.",
                    "Modeling and Optimizing Large-Scale Wide-Area Data Transfers.",
                    "A Language Support for Cloud Elasticity Management.",
                    "Elastic MapReduce Execution.",
                    "JCatascopia: Monitoring Elastically Adaptive Applications in the Cloud.",
                    "Towards a Collective Layer in the Big Data Stack.",
                    "Flexpath: Type-Based Publish/Subscribe System for Large-Scale Science Analytics.",
                    "Transparent in Situ Data Transformations in ADIOS.",
                    "HyCache+: Towards Scalable High-Performance Caching Middleware for Parallel File Systems.",
                    "A Flexible Framework for Asynchronous in Situ and in Transit Analytics for Scientific Simulations.",
                    "Iteration Based Collective I/O Strategy for Parallel I/O Systems.",
                    "Efficiently Handling Skew in Outer Joins on Distributed Systems.",
                    "A PGAS Execution Model for Efficient Stencil Computation on Many-Core Processors.",
                    "A Branch-and-Bound Algorithm for Autonomic Adaptation of Multi-cloud Applications.",
                    "Decentralized Scheduling and Load Balancing for Parallel Programs.",
                    "Multi-objective Scheduling for Heterogeneous Server Systems with Machine Placement.",
                    "PLAStiCC: Predictive Look-Ahead Scheduling for Continuous Dataflows on Clouds.",
                    "Link-Heterogeneous Work Stealing.",
                    "Time-Bound, Thread-Based Live Migration of Virtual Machines.",
                    "Modeling the Virtual Machine Launching Overhead under Fermicloud.",
                    "Controlling the Deployment of Virtual Machines on Clusters and Clouds for Scientific Computing in CBRAIN.",
                    "MIMP: Deadline and Interference Aware Scheduling of Hadoop Virtual Machines.",
                    "Achieving Efficient Distributed Scheduling with Message Queues in the Cloud for Many-Task Computing and High-Performance Computing.",
                    "Efficient Checkpointing of Virtual Machines Using Virtual Machine Introspection.",
                    "Analysis of Labor Efforts and their Impact Factors to Solve Server Incidents in Datacenters.",
                    "CMcloud: Cloud Platform for Cost-Effective Offloading of Mobile Applications.",
                    "A Credential Store for Multi-tenant Science Gateways.",
                    "Cluster-Based SNP Calling on Large-Scale Genome Sequencing Data.",
                    "Platform Calibration for Load Balancing of Large Simulations: TLM Case.",
                    "Enhancing Locality via Caching in the GMU Protocol.",
                    "Energy-Efficient Collective Reduce and Allreduce Operations on Distributed GPUs.",
                    "Network Topology Optimization for Data Aggregation.",
                    "hatS: A Heterogeneity-Aware Tiered Storage for Hadoop.",
                    "A Study of Effective Replica Reconstruction Schemes at Node Deletion for HDFS.",
                    "A Novel Zero-Knowledge Scheme for Proof of Data Possession in Cloud Storage Applications.",
                    "A High Efficient Disk Scheduling Framework with QoS Mechanism in Xen-Based Cloud Platforms.",
                    "Demo Paper: Automatic Provisioning, Deploy and Monitoring of Virtual Machines Based on Security Service Level Agreement in the Cloud.",
                    "RESeED: A Tool for Regular Expression Search over Encrypted Data in Cloud Storage.",
                    "Wave: Trigger Based Synchronous Data Process System.",
                    "Network Traffic-Aware Virtual Machine Placement with Availability Guarantees Based on Shadows.",
                    "An Architecture for Orchestrating Hadoop Applications in Hybrid Cloud.",
                    "Performance Evaluation of an IaaS Opportunistic Cloud Computing.",
                    "Expanding Tasks of Logical Workflows Into Independent Workflows for Improved Scalability.",
                    "Provenance-Based Prediction Scheme for Object Storage System in HPC.",
                    "An Adaptive Separation-Aware FTL for Improving the Efficiency of Garbage Collection in SSDs.",
                    "Strategy-Proof Mechanisms for Resource Management in Clouds.",
                    "Proactive Workload Consolidation for Reducing Energy Cost over a Given Time Horizon.",
                    "Runtime Adaptation for Autonomic Heterogeneous Computing.",
                    "Towards Generic Metadata Management in Distributed Science Gateway Infrastructures.",
                    "Compiler Optimization for Extreme-Scale Scripting.",
                    "Metrics, Models and Methodologies for Energy-Proportional Computing.",
                    "Parallel Computing with P2P Desktop Grids.",
                    "Advanced Virtualization Techniques for High Performance Cloud Cyberinfrastructure.",
                    "Supporting Queries and Analyses of Large-Scale Social Media Data with Customizable and Scalable Indexing Techniques over NoSQL Databases.",
                    "Towards an SLA-Based Service Allocation in Multi-cloud Environments.",
                    "Energy-Aware Profit Maximizing Scheduling Algorithm for Heterogeneous Computing Systems.",
                    "Energy Consumption of Photo Sharing in Online Social Networks.",
                    "Power Consumption Evaluation of an MHD Simulation with CPU Power Capping.",
                    "A Game-Theoretic Approach to Coalition Formation in Green Cloud Federations.",
                    "Energy-Aware Data Transfer Tuning.",
                    "Fuzzy Assisted Event Driven Data Collection from Sensor Nodes in Sensor-Cloud Infrastructure.",
                    "Cloud Supported Building Data Analytics.",
                    "Enforcing Quality of Service on OpenNebula-Based Shared Clouds.",
                    "A New Parallelism-Capable Clustering Algorithm for Wireless Sensor Networks.",
                    "An Evaluation Framework for Buildings-Oriented Wireless Sensor Networks.",
                    "A Cloud-Based Framework for Supporting Effective and Efficient OLAP in Big Data Environments.",
                    "Multiobjective Communication Optimization for Cloud-Integrated Body Sensor Networks.",
                    "From Scripted HPC-Based NGS Pipelines to Workflows on the Cloud.",
                    "A Survey of Approaches and Frameworks to Carry Out Genomic Data Analysis on the Cloud.",
                    "Accelerating Comparative Genomics Workflows in a Distributed Environment with Optimized Data Partitioning.",
                    "Integration of Clustering and Multidimensional Scaling to Determine Phylogenetic Trees as Spherical Phylograms Visualized in 3 Dimensions.",
                    "A Performance Evaluation of Sequence Alignment Software in Virtualized Environments.",
                    "A Storage Policy for a Hybrid Federated Cloud platform: A Case Study for Bioinformatics.",
                    "Evaluation of the Feasibility of Making Large-Scale X-Ray Tomography Reconstructions on Clouds.",
                    "Global Initiative for Sentinel e-Health Network on Grid (GINSENG): Medical Data Integration and Semantic Developments for Epidemiology.",
                    "Extending XNAT towards a Cloud-Based Quality Assessment Platform for Retinal Optical Coherence Tomographies.",
                    "Distributed Detection of Cancer Cells in High-Throughput Cellular Spike Streams.",
                    "A High Performance, QoS-Enabled, S3-Based Object Store.",
                    "Towards Cloud, Service and Tenant Classification for Cloud Computing.",
                    "On the Evaluation of VM Provisioning Time in Cloud Platforms for Mission-Critical Infrastructures.",
                    "Pragmatic Oriented Data Interoperability for Smart Healthcare Information Systems.",
                    "Geospatial Sensor Web Resource Management System for Smart City: Design and Implementation.",
                    "A Robust and Fast Reconstruction Framework for Noisy and Large Point Cloud Data.",
                    "A Survey on Workflow Management and Scheduling in Cloud Computing.",
                    "Intelligent Congestion Avoidance Algorithm and System - Application of Data Vitalization.",
                    "Variable Window for Outlier Detection and Impulsive Noise Recognition in Range Images.",
                    "Data Vitalization's Perspective Towards Smart City: A Reference Model for Data Service Oriented Architecture.",
                    "Scalable Infrastructures for Data in Motion.",
                    "Towards In-Order and Exactly-Once Delivery Using Hierarchical Distributed Message Queues.",
                    "A Scalable System for Community Discovery in Twitter During Hurricane Sandy.",
                    "A Scalable Real-Time Photometric System for Automatic Astronomical Observations on Dome A.",
                    "Improving Resource Matchmaking through Feedback Integration.",
                    "MO-BIZZ: Fostering Mobile Business through Enhanced Cloud Solutions.",
                    "A Comparitive Study of Predictive Models for Cloud Infrastructure Management.",
                    "V for Vicissitude: The Challenge of Scaling Complex Big Data Workflows.",
                    "Emulation at Very Large Scale with Distem.",
                    "ToMaR - A Data Generator for Large Volumes of Content.",
                    "Exploring Infiniband Hardware Virtualization in OpenNebula towards Efficient High-Performance Computing."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th CCGRID 2013",
        "info": "Delft, Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2013",
                "sub_name": "13th IEEE/ACM International Symposium on Cluster, Cloud, and Grid Computing, CCGrid 2013, Delft, Netherlands, May 13-16, 2013.",
                "count": 105,
                "papers": [
                    "Programming Models for High-Performance Computing.",
                    "Exploting Per User Information for Supercomputing Workload Prediction Requires Care.",
                    "Building an Elastic Cloud out of Small Datacenters.",
                    "Simulating Application Workflows and Services Deployed on the European Grid Infrastructure.",
                    "Optimizing Large Data Transfers over 100Gbps Wide Area Networks.",
                    "Automated, Elastic Resource Provisioning for NoSQL Clusters Using TIRAMOLA.",
                    "Autoflex: Service Agnostic Auto-scaling Framework for IaaS Deployment Models.",
                    "Towards QoS-Oriented SLA Guarantees for Online Cloud Services.",
                    "Optimal Cloud Resource Auto-Scaling for Web Applications.",
                    "Cost-Efficient Virtual Machine Provisioning for Multi-tier Web Applications and Video Transcoding.",
                    "Sesame: A User-Transparent Optimizing Framework for Many-Core Processors.",
                    "Reproducing Network Conditions for Tests of Large-Scale Distributed Systems.",
                    "Fast Wide Area Live Migration with a Low Overhead through Page Cache Teleportation.",
                    "Towards an Optimized Big Data Processing System.",
                    "Toward Asynchronous and MPI-Interoperable Active Messages.",
                    "Swift/T: Large-Scale Application Composition via Distributed-Memory Dataflow Processing.",
                    "Scalable PGAS Metadata Management on Extreme Scale Systems.",
                    "SYBL: An Extensible Language for Controlling Elasticity in Cloud Applications.",
                    "GPU-TLS: An Efficient Runtime for Speculative Loop Parallelization on GPUs.",
                    "Efficient Intra-node Communication on Intel-MIC Clusters.",
                    "CUDA vs OpenACC: Performance Case Studies with Kernel Benchmarks and a Memory-Bound CFD Application.",
                    "Evaluation of Inter- and Intra-node Data Transfer Efficiencies between GPU Devices and their Impact on Scalable Applications.",
                    "Massivizing Multi-player Online Games on Clouds.",
                    "Data Usage Control for the Cloud.",
                    "Extending the Capabilities of Mobile Devices for Online Social Applications through Cloud Offloading.",
                    "Adapting Scientific Applications to Cloud by Using Distributed Computing Frameworks.",
                    "Negotiation-Based Flexible SLA Establishment with SLA-driven Resource Allocation in Cloud Computing.",
                    "Cloud Computing for High Performance Image Analysis on a National Infrastructure.",
                    "An MPI-IO Compliant Java Based Parallel I/O Library.",
                    "Specialized File Transfer Service for Large Oil and Gas Datasets.",
                    "TIaaS: Secure Cloud-assisted Traffic Information Dissemination in Vehicular Ad Hoc Networks.",
                    "A Novel Checkpointing Scheme for Amazon EC2 Spot Instances.",
                    "HDFS+: Concurrent Writes Improvements for HDFS.",
                    "Interference-aware Incoming Message Detection for MPI Threaded Progression.",
                    "Accounting Federated Clouds Based on the JiTCloud Platform.",
                    "Predictive Caching in Computer Grids.",
                    "Secure Storage Service for IaaS Cloud Users.",
                    "Towards Assurance of Availability in Virtualized Cloud System.",
                    "Isolated Mini-domain for Trusted Cloud Computing.",
                    "User-Level Remote Memory Paging for Multithreaded Applications.",
                    "An Autonomic and Scalable Management System for Private Clouds.",
                    "Evaluation of Cloud Providers for VPH Applications.",
                    "The Astronomical Multipurpose Software Environment and the Ecology of Star Clusters.",
                    "Multi-objective Workflow Scheduling: An Analysis of the Energy Efficiency and Makespan Tradeoff.",
                    "Hierarchical I/O Scheduling for Collective I/O.",
                    "Stretch Out and Compact: Workflow Scheduling with Resource Abundance.",
                    "Scheduling Transactions in Replicated Distributed Software Transactional Memory.",
                    "Automated SLA Negotiation Framework for Cloud Computing.",
                    "Bi-Hadoop: Extending Hadoop to Improve Support for Binary-Input Applications.",
                    "Non-intrusive Slot Layering in Hadoop.",
                    "Resilin: Elastic MapReduce over Multiple Clouds.",
                    "A Lightweight Continuous Jobs Mechanism for MapReduce Frameworks.",
                    "A Scalable Implementation of a MapReduce-based Graph Processing Algorithm for Large-Scale Heterogeneous Supercomputers.",
                    "V-BOINC: The Virtualization of BOINC.",
                    "Experiences Applying Data Staging Technology in Unconventional Ways.",
                    "Versioned File Backup and Synchronization for Storage Clouds.",
                    "Exploring Dynamic Enactment of Scientific Workflows Using Pilot-Abstractions.",
                    "Evaluating Cloud Computing Techniques for Smart Power Grid Design Using Parallel Scripting.",
                    "Understanding Data Characteristics and Access Patterns in a Cloud Storage System.",
                    "Supporting a Light-Weight Data Management Layer over HDF5.",
                    "PARLO: PArallel Run-Time Layout Optimization for Scientific Data Explorations with Heterogeneous Access Patterns.",
                    "Consistency in the Cloud: When Money Does Matter!",
                    "Partially Separated Page Tables for Efficient Operating System Assisted Hierarchical Memory Management on Heterogeneous Architectures.",
                    "SLOAVx: Scalable LOgarithmic AlltoallV Algorithm for Hierarchical Multicore Systems.",
                    "Optimizing Burrows-Wheeler Transform-Based Sequence Alignment on Multicore Architectures.",
                    "SR-IOV Support for Virtualization on InfiniBand Clusters: Early Experience.",
                    "Clusters, Grids and Clouds: A Look from Both Sides.",
                    "Gang Migration of Virtual Machines Using Cluster-wide Deduplication.",
                    "Improving HPC Application Performance in Cloud through Dynamic Load Balancing.",
                    "Automatic Performance Prediction for Load-Balancing Coupled Models.",
                    "Collocating CPU-only Jobs with GPU-assisted Jobs on GPU-assisted HPC.",
                    "A Chemistry-Inspired Middleware for Self-Adaptive Service Orchestration and Choreography.",
                    "Computation Certification as a Service in the Cloud.",
                    "Security Risk Assessment of Cloud Carrier.",
                    "Efficient Use of Geographically Spread Cloud Resources.",
                    "Large Scale Parallel Solution of Incompressible Flow Problems Using Uintah and Hypre.",
                    "Case Studies in Designing Elastic Applications.",
                    "High-Performance Quantum Computing Simulation for the Quantum Geometric Machine Model.",
                    "Stream-Based Admission Control and Scheduling for Video Transcoding in Cloud Computing.",
                    "Flexible Capacity Partitioning in Many-Core Tiled CMPs.",
                    "On Achieving High Message Rates.",
                    "Simfrastructure: A Flexible and Adaptable Middleware Platform for Modeling and Analysis of Socially Coupled Systems.",
                    "SHStream: Self-Healing Framework for HTTP Video-Streaming.",
                    "ECOFIT: A Framework to Estimate Energy Consumption of Fault Tolerance Protocols for HPC Applications.",
                    "DUAL: Reliability-Aware Power Management in Data Centers.",
                    "A Distributed In-Transit Processing Infrastructure for Forecasting Electric Vehicle Charging Demand.",
                    "A Holistic Architecture for the Internet of Things, Sensing Services and Big Data.",
                    "A Multi-platform Sensor Coordinated Earth Observing Missions Scheduling Method for Hazard Monitoring.",
                    "Empowering the Invulnerability of Wireless Sensor Networks through Super Wires and Super Nodes.",
                    "Implementing BFS-based Traversals of RDF Graphs over MapReduce Efficiently.",
                    "A Development and Execution Environment for Early Warning Systems for Natural Disasters.",
                    "Managing Data and Processes in Cloud-Enabled Large-Scale Sensor Networks: State-of-the-Art and Future Research Directions.",
                    "Operating Cost Reduction for Distributed Internet Data Centers.",
                    "CIVSched: Communication-aware Inter-VM Scheduling in Virtual Machine Monitor Based on the Process.",
                    "HPISecure: Towards Data Confidentiality in Cloud Applications.",
                    "A Framework for Automatic Resource Provisioning for Private Clouds.",
                    "Energy-Saving Virtual Machine Placement in Cloud Data Centers.",
                    "An Adaptive Implementation Case Study of Apriori Algorithm for a Retail Scenario in a Cloud Environment.",
                    "BitDeposit: Deterring Attacks and Abuses of Cloud Computing Services through Economic Measures.",
                    "Formal Analysis of Fault-tolerant Group Key Management Using ZooKeeper.",
                    "Tenant-ID: Tagging Tenant Assets in Cloud Environments.",
                    "Energy Efficient VM Placement Supported by Data Analytic Service.",
                    "Heterogeneity: The Key to Achieve Power-Proportional Computing.",
                    "Energy-aware VM Allocation on an Opportunistic Cloud Infrastructure.",
                    "Energy Efficient VM Scheduling for Cloud Data Centers: Exact Allocation and Migration Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th CCGRID 2012",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2012",
                "sub_name": "12th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGrid 2012, Ottawa, Canada, May 13-16, 2012.",
                "count": 137,
                "papers": [
                    "Design and Implementation of Portable and Efficient Non-blocking Collective Communication.",
                    "Productive Parallel Linear Algebra Programming with Unstructured Topology Adaption.",
                    "User Transparent Data and Task Parallel Multimedia Computing with Pyxis-DT.",
                    "CEFLS: A Cost-Effective File Lookup Service in a Distributed Metadata File System.",
                    "Fine-Grained Access Control in the Chirp Distributed File System.",
                    "Towards Trusted Services: Result Verification Schemes for MapReduce.",
                    "MARLA: MapReduce for Heterogeneous Clusters.",
                    "A Map-Reduce Based Framework for Heterogeneous Processing Element Cluster Environments.",
                    "Workflow Scheduling to Minimize Data Movement Using Multi-constraint Graph Partitioning.",
                    "Decentralized Orchestration of Data-centric Workflows Using the Object Modeling System.",
                    "Efficient Disk I/O Scheduling with QoS Guarantee for Xen-based Hosting Platforms.",
                    "MORPHOSYS: Efficient Colocation of QoS-Constrained Workloads in the Cloud.",
                    "Reward Scheduling for QoS in Cloud Applications.",
                    "Evaluating Dynamics and Bottlenecks of Memory Collaboration in Cluster Systems.",
                    "Energy- and Cost-Efficiency Analysis of ARM-Based Clusters.",
                    "Transparent Accelerator Migration in a Virtualized GPU Environment.",
                    "GPU Performance Enhancement via Communication Cost Reduction: Case Studies of Radix Sort and WSN Relay Node Placement Problem.",
                    "Scheduling Concurrent Applications on a Cluster of CPU-GPU Nodes.",
                    "A Highly Parallel Multi-class Pattern Classification on GPU.",
                    "Client Classification Policies for SLA Enforcement in Shared Cloud Datacenters.",
                    "Policy-Based Automation of SLA Establishment for Cloud Computing Services.",
                    "SLA-based Optimization of Power and Migration Cost in Cloud Computing.",
                    "Service Level Agreement for Distributed Mutual Exclusion in Cloud Computing.",
                    "On Urgency of I/O Operations.",
                    "Boosting Application-Specific Parallel I/O Optimization Using IOSIG.",
                    "SERA-IO: Integrating Energy Consciousness into Parallel I/O Middleware.",
                    "Supporting User-Defined Subsetting and Aggregation over Parallel NetCDF Datasets.",
                    "Scalable Multi-purpose Network Representation for Large Scale Distributed System Simulation.",
                    "Topology Agnostic Dynamic Quick Reconfiguration for Large-Scale Interconnection Networks.",
                    "Scalable Memcached Design for InfiniBand Clusters Using Hybrid Transports.",
                    "Lowering Inter-datacenter Bandwidth Costs via Bulk Data Scheduling.",
                    "A Scalable Parallel Debugging Library with Pluggable Communication Protocols.",
                    "Task Scheduling Algorithm for Multicore Processor System for Minimizing Recovery Time in Case of Single Node Fault.",
                    "Speculative Memory State Transfer for Active-Active Fault Tolerance.",
                    "Checkpointing Orchestration: Toward a Scalable HPC Fault-Tolerant Environment.",
                    "An Autonomous Reliability-Aware Negotiation Strategy for Cloud Computing Environments.",
                    "Separating Performance Anomalies from Workload-Explained Failures in Streaming Servers.",
                    "A Multi-objective Approach for Workflow Scheduling in Heterogeneous Environments.",
                    "Automating Data-Throttling Analysis for Data-Intensive Workflows.",
                    "Self-Healing of Operational Workflow Incidents on Distributed Computing Infrastructures.",
                    "A Workflow-Aware Storage System: An Opportunity Study.",
                    "Using Model Checking to Analyze the System Behavior of the LHC Production Grid.",
                    "WSCOM: Online Task Scheduling with Data Transfers.",
                    "Improving Grid Resource Usage: Metrics for Measuring Fragmentation.",
                    "Malleable Model Coupling with Prediction.",
                    "Load Balancing Query Processing in Metric-Space Similarity Search.",
                    "Distributed Monitoring with Collaborative Prediction.",
                    "Delta Send-Recv for Dynamic Pipelining in MPI Programs.",
                    "Global Futures: A Multithreaded Execution Model for Global Arrays-based Applications.",
                    "Productivity and Performance of Global-View Programming with XcalableMP PGAS Language.",
                    "Distributed S-Net: Cluster and Grid Computing without the Hassle.",
                    "Investigation of Data Locality in MapReduce.",
                    "TomusBlobs: Towards Communication-Efficient Storage for MapReduce Applications in Azure.",
                    "Maestro: Replica-Aware Map Scheduling for MapReduce.",
                    "SciMATE: A Novel MapReduce-Like Framework for Multiple Scientific Data Formats.",
                    "Pricing Cloud Compute Commodities: A Novel Financial Economic Model.",
                    "A Time-Series Pattern Based Noise Generation Strategy for Privacy Protection in Cloud Computing.",
                    "COCA: Computation Offload to Clouds Using AOP.",
                    "ParaLite: Supporting Collective Queries in Database System to Parallelize User-Defined Executable.",
                    "Snooze: A Scalable and Autonomic Virtual Machine Management Framework for Private Clouds.",
                    "RO-BURST: A Robust Virtualization Cost Model for Workload Consolidation over Clouds.",
                    "A Stable Network-Aware VM Placement for Cloud Systems.",
                    "Surreptitious Deployment and Execution of Kernel Agents in Windows Guests.",
                    "Cloud Service Negotiation: Concession vs. Tradeoff Approaches.",
                    "Interactive Use of Cloud Services: Amazon SQS and S3.",
                    "Dynamic Replication in Service-Oriented Systems.",
                    "Selling T-shirts and Time Shares in the Cloud.",
                    "Scalable Join Queries in Cloud Data Stores.",
                    "Privacy Preserving Access Control with Authentication for Securing Data in Clouds.",
                    "A Cost-Effective Mechanism for Cloud Data Reliability Management Based on Proactive Replica Checking.",
                    "A Model and Decision Procedure for Data Storage in Cloud Computing.",
                    "A Bandwidth-Optimized Multi-core Architecture for Irregular Applications.",
                    "Parallel Real-Time OLAP on Multi-core Processors.",
                    "Minimizing the Data Transfer Time Using Multicore End-System Aware Flow Bifurcation.",
                    "Cache Conscious Task Regrouping on Multicore Processors.",
                    "An Analysis of Provisioning and Allocation Policies for Infrastructure-as-a-Service Clouds.",
                    "The Impact of User Rationality in Federated Clouds.",
                    "Automated Tagging for the Retrieval of Software Resources in Grid and Cloud Infrastructures.",
                    "Time and Cost Sensitive Data-Intensive Computing on Hybrid Clouds.",
                    "Lightweight Resource Scaling for Cloud Applications.",
                    "Performance Modeling and Comparative Analysis of the MILC Lattice QCD Application su3_rmd.",
                    "An Efficient Parallel Implementation for Three-Dimensional Incompressible Pipe Flow Based on SIMPLE.",
                    "Parallel Simulation of Peer-to-Peer Systems.",
                    "Automated Construction of Performance Models for High Performance Distributed Applications.",
                    "A Cloud Infrastructure for Optimization of a Massive Parallel Sequencing Workflow.",
                    "Pseudo Random Number Generation for Parallelized Jobs on Clusters.",
                    "Creating Your Own Private Cloud: Ezilla Toolkit - For Coordinated Storage, Computing, and Networking Services.",
                    "On Effective Quality of Service Negotiation.",
                    "IDSaaS: Intrusion Detection System as a Service in Public Clouds.",
                    "Distributed Shared Memory and Compiler-Induced Scalable Locality for Scalable Cluster Performance.",
                    "A Compartive Study of Cloud Computing Middleware.",
                    "Automatic Adaptive Page-Size Control for Remote Memory Paging.",
                    "Analyzing Effect of Network Processor's Cache Dependent Parameter on MPI Broadcast Performance.",
                    "Advanced MAC in HPC Systems: Performance Improvement.",
                    "Cluster as a Service for Self-Deployable Cloud Applications.",
                    "Accelerating 2-opt and 3-opt Local Search Using GPU in the Travelling Salesman Problem.",
                    "Distributed Shared Memory Programming in the Cloud.",
                    "A Fault Tolerance Framework for High Performance Computing in Cloud.",
                    "Business Process Engine Simulator.",
                    "Improving MapReduce Performance in Heterogeneous Network Environments and Resource Utilization.",
                    "Perspectives of UnaCloud: An Opportunistic Cloud Computing Solution for Facilitating Research.",
                    "Provisioning-Based Resource Management for Effective Workflow Scheduling on Utility Grids.",
                    "Mining Concept Drifting Network Traffic in Cloud Computing Environments.",
                    "VM Economics for Java Cloud Computing: An Adaptive and Resource-Aware Java Runtime with Quality-of-Execution.",
                    "Combinatorial Auction-Based Mechanisms for VM Provisioning and Allocation in Clouds.",
                    "Optimistic Scheduling with Geographically Replicated Services in the Cloud Environment (COLOR).",
                    "Kernel-Assisted MPI Collective Communication among Many-core Clusters.",
                    "Enabling Application Resilience with and without the MPI Standard.",
                    "Leveraging Heterogeneity for Energy Minimization in Data Centers.",
                    "Executing Data-Intensive Workloads in a Cloud.",
                    "Integration of Workflow Partitioning and Resource Provisioning.",
                    "Hierarchical MapReduce Programming Model and Scheduling Algorithms.",
                    "Resource Management for Elastic Cloud Workflows.",
                    "Enhanced Energy-Efficient Scheduling for Parallel Applications in Cloud.",
                    "The Cloud: Requirements for a Better Service.",
                    "Reducing Operational Costs through Consolidation with Resource Prediction in the Cloud.",
                    "Cellular STEM: Promoting Interest in Science, Technology, Engineering, and Math Education Using Cellular Messaging, Cloud Computing, and Web-Based Social Networks.",
                    "Design and Implementation of a Secure Healthcare Social Cloud System.",
                    "Optimizing Completion Time and Resource Provisioning of Pig Programs.",
                    "Pricing and Resource Allocation in a Cloud Computing Market.",
                    "Towards the Automated Engineering of Dependable Adaptive Services.",
                    "Integrity Verification of Multiple Data Copies over Untrusted Cloud Servers.",
                    "Optimal Reconfiguration of the Cloud Network for Maximum Energy Savings.",
                    "Optimal Location of Data Centers and Software Components in Cloud Computing Network Design.",
                    "Reducing Complexity in Management of eScience Computations.",
                    "Conservative Distributed Discrete Event Simulation on Amazon EC2.",
                    "Integrating HLA and Service-Oriented Architecture in a Simulation Framework.",
                    "Simulation in the Cloud Using Handheld Devices.",
                    "Goal-Directed Grid-Enabled Computing for Legacy Simulations.",
                    "U.S. Army Modeling and Simulation Executable Architecture Deployment Cloud Virtualization Strategy.",
                    "Simulation Processes in the Cloud for Emergency Planning.",
                    "Development of a Metamodel for Medical Database Management on a Grid Network: Application to Health Watch and Epidemiology for Cancer and Perinatal Health.",
                    "Towards Ontology-based Data Quality Inference in Large-Scale Sensor Networks.",
                    "End-to-End QoS on Shared Clouds for Highly Dynamic, Large-Scale Sensing Data Streams.",
                    "Human Postures Recognition Based on D-S Evidence Theory and Multi-sensor Data Fusion.",
                    "On Managing Very Large Sensor-Network Data Using Bigtable.",
                    "Data Outsourcing Simplified: Generating Data Connectors from Confidentiality and Access Policies."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11th CCGRID 2011",
        "info": "Newport Beach, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2011",
                "sub_name": "11th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, CCGrid 2011, Newport Beach, CA, USA, May 23-26, 2011.",
                "count": 72,
                "papers": [
                    "Characterizing the Performance of Parallel Applications on Multi-socket Virtual Machines.",
                    "CloudSpider: Combining Replication with Scheduling for Optimizing Live Migration of Virtual Machines across Wide Area Networks.",
                    "Optimized Management of Power and Performance for Virtualized Heterogeneous Server Clusters.",
                    "Small Discrete Fourier Transforms on GPUs.",
                    "A Parallel Rectangle Intersection Algorithm on GPU+CPU.",
                    "GPGPU-Accelerated Parallel and Fast Simulation of Thousand-Core Platforms.",
                    "Assertion Based Parallel Debugging.",
                    "Cheetah: A Framework for Scalable Hierarchical Collective Operations.",
                    "Enabling Multi-physics Coupled Simulations within the PGAS Programming Framework.",
                    "Multiple Services Throughput Optimization in a Hierarchical Middleware.",
                    "On the Performance Variability of Production Cloud Services.",
                    "The Grid Observatory.",
                    "Grid Global Behavior Prediction.",
                    "A Robust Communication Framework for Parallel Execution on Volunteer PC Grids.",
                    "Non-cooperative Scheduling Considered Harmful in Collaborative Volunteer Computing Environments.",
                    "Towards Real-Time, Volunteer Distributed Computing.",
                    "GeoServ: A Distributed Urban Sensing Platform.",
                    "Building an Online Domain-Specific Computing Service over Non-dedicated Grid and Cloud Resources: The Superlink-Online Experience.",
                    "Techniques for Fine-Grained, Multi-site Computation Offloading.",
                    "SLA-Based Resource Allocation for Software as a Service Provider (SaaS) in Cloud Computing Environments.",
                    "Improving Utilization of Infrastructure Clouds.",
                    "Resource and Revenue Sharing with Coalition Formation of Cloud Providers: Game Theoretic Approach.",
                    "Self-Healing Distributed Scheduling Platform.",
                    "Towards Reliable, Performant Workflows for Streaming-Applications on Cloud Platforms.",
                    "A Sketch-Based Architecture for Mining Frequent Items and Itemsets from Distributed Data Streams.",
                    "APP: Minimizing Interference Using Aggressive Pipelined Prefetching in Multi-level Buffer Caches.",
                    "PAC-PLRU: A Cache Replacement Policy to Salvage Discarded Predictions from Hardware Prefetchers.",
                    "Contention Modeling for Multithreaded Distributed Shared Memory Machines: The Cray XMT.",
                    "Predictive Data Grouping and Placement for Cloud-Based Elastic Server Infrastructures.",
                    "BAR: An Efficient Data Locality Driven Task Scheduling Algorithm for Cloud Computing.",
                    "On the Scheduling of Checkpoints in Desktop Grids.",
                    "High Performance Pipelined Process Migration with RDMA.",
                    "Failure Avoidance through Fault Prediction Based on Synthetic Transactions.",
                    "A Scalable Method for Signalling Dynamic Reconfiguration Events with OpenSM.",
                    "On the Relation between Congestion Control, Switch Arbitration and Fairness.",
                    "Network-Friendly One-Sided Communication through Multinode Cooperation on Petascale Cray XT5 Systems.",
                    "Evaluating and Optimizing Indexing Schemes for a Cloud-Based Elastic Key-Value Store.",
                    "Sophia: Local Trust for Securing Routing in DHTs.",
                    "The Benefits of Estimated Global Information in DHT Load Balancing.",
                    "DHTbd: A Reliable Block-Based Storage System for High Performance Clusters.",
                    "Adaptive QoS Decomposition and Control for Storage Cache Management in Multi-server Environments.",
                    "A Segment-Level Adaptive Data Layout Scheme for Improved Load Balance in Parallel File Systems.",
                    "Classification and Composition of QoS Attributes in Distributed, Heterogeneous Systems.",
                    "Autonomic SLA-Driven Provisioning for Cloud Applications.",
                    "A Flexible Policy Framework for the QoS Differentiated Provisioning of Services.",
                    "DELMA: Dynamically ELastic MapReduce Framework for CPU-Intensive Applications.",
                    "Cloud MapReduce: A MapReduce Implementation on Top of a Cloud Operating System.",
                    "Ex-MATE: Data Intensive Computing with Large Reduction Objects and Its Application to Graph Mining.",
                    "ASDF: An Autonomous and Scalable Distributed File System.",
                    "Managing Distributed Files with RNS in Heterogeneous Data Grids.",
                    "DDFTP: Dual-Direction FTP.",
                    "Efficient Support for MPI-I/O Atomicity Based on Versioning.",
                    "Implementing Trust in Cloud Infrastructures.",
                    "Detection and Protection against Distributed Denial of Service Attacks in Accountable Grid Computing Systems.",
                    "Dealing with Grid-Computing Authorization Using Identity-Based Certificateless Proxy Signature.",
                    "Open Social Based Collaborative Science Gateways.",
                    "Social Networks of Researchers and Educators on nanoHUB.org.",
                    "A Trustworthiness Fusion Model for Service Cloud Platform Based on D-S Evidence Theory.",
                    "Engineering Incentives in Social Clouds.",
                    "Utilizing \"Opaque\" Resources for Revenue Enhancement on Clouds and Grids.",
                    "Debunking Real-Time Pricing in Cloud Computing.",
                    "Unifying Cloud Management: Towards Overall Governance of Business Level Objectives.",
                    "Defining a Cloud Reference Model.",
                    "Inferring Network Topologies in Infrastructure as a Service Cloud.",
                    "Addressing Resource Fragmentation in Grids through Network-Aware Meta-scheduling in Advance.",
                    "Performance under Failures of MapReduce Applications.",
                    "MPI-IO/Gfarm: An Optimized Implementation of MPI-IO for the Gfarm File System.",
                    "Diagnosing Anomalous Network Performance with Confidence.",
                    "A Performance Goal Oriented Processor Allocation Technique for Centralized Heterogeneous Multi-cluster Environments.",
                    "A Hybrid Shared-Nothing/Shared-Data Storage Architecture for Large Scale Databases.",
                    "EZTrace: A Generic Framework for Performance Analysis.",
                    "Supporting Federated Multi-authority Security Models."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10th CCGRID 2010",
        "info": "Melbourne, Victoria, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2010",
                "sub_name": "10th IEEE/ACM International Conference on Cluster, Cloud and Grid Computing, CCGrid 2010, 17-20 May 2010, Melbourne, Victoria, Australia.",
                "count": 124,
                "papers": [
                    "Enabling the Next Generation of Scalable Clusters.",
                    "Sky Computing: When Multiple Clouds Become One.",
                    "Dynamic Load-Balanced Multicast for Data-Intensive Applications on Clouds.",
                    "Profit-Driven Service Request Scheduling in Clouds.",
                    "Availability Prediction Based Replication Strategies for Grid Environments.",
                    "EGSI: TGKA Based Security Architecture for Group Communication in Grid.",
                    "Elastic Site: Using Clouds to Elastically Extend Site Resources.",
                    "ConnectX-2 InfiniBand Management Queues: First Investigation of the New Support for Network Offloaded Collective Operations.",
                    "Distributed Diskless Checkpoint for Large Scale Systems.",
                    "Enabling Instantaneous Relocation of Virtual Machines with a Lightweight VMM Extension.",
                    "A Map-Reduce System with an Alternate API for Multi-core Environments.",
                    "An Analysis of Traces from a Production MapReduce Cluster.",
                    "An Effective Architecture for Automated Appliance Management System Applying Ontology-Based Cloud Discovery.",
                    "Region-Based Prefetch Techniques for Software Distributed Shared Memory Systems.",
                    "Granularity-Aware Work-Stealing for Computationally-Uniform Grids.",
                    "SAGA BigJob: An Extensible and Interoperable Pilot-Job Abstraction for Distributed Applications and Systems.",
                    "Remote Process Execution and Remote File I/O for Heterogeneous Processors in Cluster Systems.",
                    "An Adaptive Data Prefetcher for High-Performance Processors.",
                    "Designing Accelerator-Based Distributed Systems for High Performance.",
                    "Efficient On-Demand Connection Management Mechanisms with PGAS Models over InfiniBand.",
                    "Methodology for Efficient Execution of SPMD Applications on Multicore Environments.",
                    "An Evaluation of the Benefits of Fine-Grained Value-Based Scheduling on General Purpose Clusters.",
                    "The Effects of Untruthful Bids on User Utilities and Stability in Computing Markets.",
                    "FIRE: A File Reunion Based Data Replication Strategy for Data Grids.",
                    "SAQA: A Self-Adaptive QoS-Aware Scheduling Algorithm for Real-Time Tasks on Heterogeneous Clusters.",
                    "Bandwidth Allocation for Iterative Data-Dependent E-science Applications.",
                    "A Bi-criteria Algorithm for Scheduling Parallel Task Graphs on Clusters.",
                    "Low-Cost Tuning of Two-Step Algorithms for Scheduling Mixed-Parallel Applications onto Homogeneous Clusters.",
                    "ERGOT: A Semantic-Based System for Service Discovery in Distributed Infrastructures.",
                    "Towards Autonomic Service Provisioning Systems.",
                    "WORKEM: Representing and Emulating Distributed Scientific Workflow Execution State.",
                    "Experiments with Memory-to-Memory Coupling for End-to-End Fusion Simulation Workflows.",
                    "Streamflow Programming Model for Data Streaming in Scientific Workflows.",
                    "Representing Eager Evaluation in a Demand Driven Model of Streams on Cloud Infrastructure.",
                    "An MPI-Stream Hybrid Programming Model for Computational Clusters.",
                    "High Performance Dimension Reduction and Visualization for Large High-Dimensional Data Analysis.",
                    "Exploring the Potential of Using Multiple E-science Infrastructures with Emerging Open Standards-Based E-health Research Tools.",
                    "Efficient Runtime Environment for Coupled Multi-physics Simulations: Dynamic Resource Allocation and Load-Balancing.",
                    "On-demand Overlay Networks for Large Scientific Data Transfers.",
                    "Towards Energy Aware Scheduling for Precedence Constrained Parallel Tasks in a Cluster with DVFS.",
                    "Runtime Energy Adaptation with Low-Impact Instrumented Code in a Power-Scalable Cluster System.",
                    "Linear Combinations of DVFS-Enabled Processor Frequencies to Modify the Energy-Aware Scheduling Algorithms.",
                    "The Failure Trace Archive: Enabling Comparative Analysis of Failures in Diverse Distributed Systems.",
                    "Scalable Communication Trace Compression.",
                    "FaReS: Fair Resource Scheduling for VMM-Bypass InfiniBand Devices.",
                    "A Proximity-Based Self-Organizing Framework for Service Composition and Discovery.",
                    "Dynamic TTL-Based Search in Unstructured Peer-to-Peer Networks.",
                    "Enhanced Paxos Commit for Transactions on DHTs.",
                    "Cache Performance Optimization for Processing XML-Based Application Data on Multi-core Processors.",
                    "A Realistic Integrated Model of Parallel System Workloads.",
                    "Discovering Piecewise Linear Models of Grid Workload.",
                    "Identification, Modelling and Prediction of Non-periodic Bursts in Workloads.",
                    "On the Use of Machine Learning to Predict the Time and Resources Consumed by Applications.",
                    "On the Origin of Services Using RIDDL for Description, Evolution and Composition of RESTful Services.",
                    "A Categorisation of Cloud Computing Business Models.",
                    "Dynamic Resource Pricing on Federated Clouds.",
                    "Unibus-managed Execution of Scientific Applications on Aggregated Clouds.",
                    "File-Access Characteristics of Data-Intensive Workflow Applications.",
                    "Overdimensioning for Consistent Performance in Grids.",
                    "Topology Aggregation for E-science Networks.",
                    "Handling Recoverable Temporal Violations in Scientific Workflow Systems: A Workflow Rescheduling Based Strategy.",
                    "A Fair Decentralized Scheduler for Bag-of-Tasks Applications on Desktop Grids.",
                    "A Heuristic Query Optimization Approach for Heterogeneous Environments.",
                    "Planning Large Data Transfers in Institutional Grids.",
                    "Framework for Efficient Indexing and Searching of Scientific Metadata.",
                    "High Performance Data Transfer in Grid Environment Using GridFTP over InfiniBand.",
                    "Data Injection at Execution Time in Grid Environments Using Dynamic Data Driven Application System for Wildland Fire Spread Prediction.",
                    "Expanding the Cloud: A Component-Based Architecture to Application Deployment on the Internet.",
                    "Fine-Grained Profiling for Data-Intensive Workflows.",
                    "Supporting OFED over Non-InfiniBand SANs.",
                    "The Lightweight Approach to Use Grid Services with Grid Widgets on Grid WebOS.",
                    "Energy Efficient Allocation of Virtual Machines in Cloud Data Centers.",
                    "SciCloud: Scientific Computing on the Cloud.",
                    "Rigel: A Scalable and Lightweight Replica Selection Service for Replicated Distributed File System.",
                    "In Search of Visualization Metaphors for PlanetLab.",
                    "Design and Implementation of an Efficient Two-Level Scheduler for Cloud Computing Environment.",
                    "Cluster Computing as an Assembly Process: Coordination with S-Net.",
                    "Dynamic Job-Clustering with Different Computing Priorities for Computational Resource Allocation.",
                    "Dynamic Auction Mechanism for Cloud Resource Allocation.",
                    "Policy-Based Management of QoS in Service Aggregations.",
                    "Feedback-Guided Analysis for Resource Requirements in Large Distributed System.",
                    "TOPP goes Rapid The OpenMS Proteomics Pipeline in a Grid-Enabled Web Portal.",
                    "TrustStore: Making Amazon S3 Trustworthy with Services Composition.",
                    "Polyphony: A Workflow Orchestration Framework for Cloud Computing.",
                    "Virtual Resources Allocation for Workflow-Based Applications Distribution on a Cloud Infrastructure.",
                    "Applying Software Engineering Principles for Designing Cloud@Home.",
                    "User Requirements for Cloud Computing Architecture.",
                    "D-Cloud: Design of a Software Testing Environment for Reliable Distributed Systems Using Cloud Computing Technology.",
                    "Towards Trust in Desktop Grid Systems.",
                    "Decentralized Resource Availability Prediction for a Desktop Grid.",
                    "Predicting the Quality of Service of a Peer-to-Peer Desktop Grid.",
                    "Generalized Spot-Checking for Sabotage-Tolerance in Volunteer Computing Systems.",
                    "UnaGrid: On Demand Opportunistic Desktop Grid.",
                    "Integration of Heterogeneous and Non-dedicated Environments for R.",
                    "A High-Level Interpreted MPI Library for Parallel Computing in Volunteer Environments.",
                    "mPlogP: A Parallel Computation Model for Heterogeneous Multi-core Computer.",
                    "Extending the EGEE Grid with XtremWeb-HEP Desktop Grids.",
                    "Hard Data on Soft Errors: A Large-Scale Assessment of Real-World Error Rates in GPGPU.",
                    "Team-Based Message Logging: Preliminary Results.",
                    "Using Cloud Constructs and Predictive Analysis to Enable Pre-Failure Process Migration in HPC Systems.",
                    "Selective Recovery from Failures in a Task Parallel Programming Model.",
                    "Mobility Support Through Caching in Content-Based Publish/Subscribe Networks.",
                    "Multi-criteria Content Adaptation Service Selection Broker.",
                    "User Provided Cloud Computing.",
                    "Gridifying a Diffusion Tensor Imaging Analysis Pipeline.",
                    "Overview of Medical Data Management Solutions for Research Communities.",
                    "Development and Support of Platforms for Research into Rare Diseases.",
                    "Performance Analysis of Diffusion Tensor Imaging in an Academic Production Grid.",
                    "Programming Challenges for the Implementation of Numerical Quadrature in Atomic Physics on FPGA and GPU Accelerators.",
                    "Asynchronous Communication Schemes for Finite Difference Methods on Multiple GPUs.",
                    "Solving k-Nearest Neighbor Problem on Multiple Graphics Processors.",
                    "Cooperative Multitasking for GPU-Accelerated Grid Systems.",
                    "Multi-FFT Vectorization for the Cell Multicore Processor.",
                    "High Resolution Program Flow Visualization of Hardware Accelerated Hybrid Multi-core Applications.",
                    "Running the NIM Next-Generation Weather Model on GPUs.",
                    "Accelerating Climate and Weather Simulations Through Hybrid Computing.",
                    "A Memory Centric Kernel Framework for Accelerating Short-Range, Interactive Particle Simulation.",
                    "From Sparse Matrix to Optimal GPU CUDA Sparse Matrix Vector Product Implementation.",
                    "Performance of Windows Multicore Systems on Threading and MPI.",
                    "Service Oriented Approach to High Performance Scientific Computing.",
                    "Energy Efficient Resource Management in Virtualized Cloud Data Centers.",
                    "SLA-Driven Dynamic Resource Management for Multi-tier Web Applications in a Cloud.",
                    "On Economic and Computational-Efficient Resource Pricing in Large Distributed Systems.",
                    "A Capabilities-Aware Programming Model for Asymmetric High-End Systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th CCGRID 2009",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2009",
                "sub_name": "9th IEEE/ACM International Symposium on Cluster Computing and the Grid, CCGrid 2009, Shanghai, China, 18-21 May 2009.",
                "count": 87,
                "papers": [
                    "Market-Oriented Cloud Computing: Vision, Hype, and Reality of Delivering Computing as the 5th Utility.",
                    "Challenges and Opportunities on Parallel/Distributed Programming for Large-scale: From Multi-core to Clouds.",
                    "Online Storage and Content Distribution System at a Large Scale: Peer-Assistance and Beyond.",
                    "Efficient Grid Task-Bundle Allocation Using Bargaining Based Self-Adaptive Auction.",
                    "Scheduling Strategies for Cycle Scavenging in Multicluster Grid Systems.",
                    "Developing Scheduling Policies in gLite Middleware.",
                    "Runtime Estimations, Reputation and Elections for Top Performing Distributed Query Scheduling.",
                    "Extending Pastry by an Alphanumerical Overlay.",
                    "Self-Chord: A Bio-inspired Algorithm for Structured P2P Systems.",
                    "BloomCast: Efficient Full-Text Retrieval over Unstructured P2Ps with Guaranteed Recall.",
                    "Multicast Trees for Collaborative Applications.",
                    "Energy-Efficient Cluster Computing via Accurate Workload Characterization.",
                    "Markov Model Based Disk Power Management for Data Intensive Workloads.",
                    "Optimal Power Management for Server Farm to Support Green Computing.",
                    "Minimizing Energy Consumption for Precedence-Constrained Applications Using Dynamic Voltage Scaling.",
                    "The Grid Enablement and Sustainable Simulation of Multiscale Physics Applications.",
                    "Reliability-Oriented Genetic Algorithm for Workflow Applications Using Max-Min Strategy.",
                    "Hybrid Re-scheduling Mechanisms for Workflow Applications on Multi-cluster Grid.",
                    "The Eucalyptus Open-Source Cloud-Computing System.",
                    "GenLM: License Management for Grid and Cloud Computing Environments.",
                    "On-Demand Resource Provisioning for BPEL Workflows Using Amazon's Elastic Compute Cloud.",
                    "Multi-Tiered On-Demand Resource Scheduling for VM-Based Data Center.",
                    "Reliable P2P Feed Delivery.",
                    "PAIS: A Proximity-Aware Interest-Clustered P2P File Sharing System.",
                    "Adaptive Resource Indexing Technique for Unstructured Peer-to-Peer Networks.",
                    "Range Query Using Learning-Aware RPS in DHT-Based Peer-to-Peer Networks.",
                    "GMount: An Ad Hoc and Locality-Aware Distributed File System by Using SSH and FUSE.",
                    "Improving Parallel Write by Node-Level Request Scheduling.",
                    "File Clustering Based Replication Algorithm in a Grid Environment.",
                    "Latency Hiding File I/O for Blue Gene Systems.",
                    "Utility Driven Adaptive Work?ow Execution.",
                    "Hierarchical Caches for Grid Workflows.",
                    "Performance under Failures of DAG-based Parallel Computing.",
                    "Combined Fault Tolerance and Scheduling Techniques for Workflow Applications on Computational Grids.",
                    "Harvesting Large-Scale Grids for Software Resources.",
                    "Resource Allocation Using Virtual Clusters.",
                    "Resource Information Aggregation in Hierarchical Grid Networks.",
                    "Measuring Fragmentation of Two-Dimensional Resources Applied to Advance Reservation Grid Scheduling.",
                    "BLAST Application with Data-Aware Desktop Grid Middleware.",
                    "AVSS: An Adaptable Virtual Storage System.",
                    "Memory-Mapped File Approach for On-Demand Data Co-allocation on Grids.",
                    "Performance Issues in Parallelizing Data-Intensive Applications on a Multi-core Cluster.",
                    "Using Templates to Predict Execution Time of Scientific Workflow Applications in the Grid.",
                    "Modeling Job Arrival Process with Long Range Dependence and Burstiness Characteristics.",
                    "Modeling Job Lifespan Delays in Volunteer Computing Projects.",
                    "A Hybrid Intelligent Method for Performance Modeling and Prediction of Workflow Activities in Grids.",
                    "A Scalable Security Model for Enabling Dynamic Virtual Private Execution Infrastructures on the Internet.",
                    "Self-Tuning Virtual Machines for Predictable eScience.",
                    "Dynamic Provisioning of Virtual Organization Clusters.",
                    "Failure-Aware Construction and Reconfiguration of Distributed Virtual Machines for High Availability Computing.",
                    "Natively Supporting True One-Sided Communication in.",
                    "MPISec I/O: Providing Data Confidentiality in MPI-I/O.",
                    "Dynamic and Distributed Multipath Routing Policy for High-Speed Cluster Networks.",
                    "Handling Persistent States in Process Checkpoint/Restart Mechanisms for HPC Systems.",
                    "Collusion Detection for Grid Computing.",
                    "Multi-scale Real-Time Grid Monitoring with Job Stream Mining.",
                    "Towards Visualization Scalability through Time Intervals and Hierarchical Organization of Monitoring Data.",
                    "A Skyline Approach to the Matchmaking Web Service.",
                    "Flexible and Efficient In-Vivo Enhancement for Grid Applications.",
                    "Evaluating the Divisible Load Assumption in the Context of Economic Grid Scheduling with Deadline-Based QoS guarantees.",
                    "A Live Storage Migration Mechanism over WAN for Relocatable Virtual Machine Services on Clouds.",
                    "A Model-Based Algorithm for Optimizing I/O Intensive Applications in Clouds Using VM-Based Migration.",
                    "C-Meter: A Framework for Performance Analysis of Computing Clouds.",
                    "Programming Abstractions for Data Intensive Computing on Clouds and Grids.",
                    "Online Risk Analytics on the Cloud.",
                    "The \"Any-Schedulability\" Criterion for Providing QoS Guarantees Through Advance Reservation Requests.",
                    "Towards a Virtual Research Environment for Paediatric Endocrinology across Europe.",
                    "Grid-Based Sleep Research: Analysis of Polysomnographies Using a Grid Infrastructure.",
                    "A Clinical Grid Infrastructure Supporting Adverse Hypotensive Event Prediction.",
                    "A Novel Collaborative Grid Framework for Distributed Healthcare.",
                    "An E-infrastructure to Support Collaborative Embryo Research.",
                    "Risk Informed Computer Economics.",
                    "Towards a Cluster Based Incentive Mechanism for P2P Networks.",
                    "Block-Based Concurrent and Storage-Aware Data Streaming for Grid Applications with Lots of Small Files.",
                    "Framework for Decentralizing Legacy Applications.",
                    "Distributed Indexing for Resource Discovery in P2P Networks.",
                    "Transient Analysis of an Overlay Multicast Protocol.",
                    "Automating Malware Scanning Using Workflows.",
                    "Experiment and Workflow Management Using Cyberaide Shell.",
                    "An Agent-Based Approach for Autonomic Web Service Workflow Model.",
                    "Cesar-FD: An Effective Stateful Fault Detection Mechanism in Drug Discovery Grid.",
                    "Supporting Distributed Visualization Services for High Performance Science and Engineering Applications.",
                    "Domain-Specific Groupware Environment for E-research on Chemistry.",
                    "Web-Based Visualization of Atmospheric Nucleation Processes Using Java3D.",
                    "EnVision: A Web-Based Tool for Scientific Visualization.",
                    "Distributed Collaborative Visualization Using Light Field Rendering.",
                    "WSRF-Based Distributed Visualization."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th CCGRID 2008",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2008",
                "sub_name": "8th IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2008), 19-22 May 2008, Lyon, France.",
                "count": 115,
                "papers": [
                    "A Decentralized and Cooperative Workflow Scheduling Algorithm.",
                    "Bi-criteria Scheduling of Scientific Workflows for the Grid.",
                    "Joint Communication and Computation Task Scheduling in Grids.",
                    "Benefits of Job Exchange between Autonomous Sites in Decentralized Computational Grids.",
                    "Anonymity Scheme for Interactive P2P Services.",
                    "A Hybrid P2P Overlay Network for Non-Strictly Hierarchically Categorized Contents.",
                    "Pastel: Bridging the Gap between Structured and Large-State Overlays.",
                    "HyperBone: A Scalable Overlay Network Based on a Virtual Hypercube.",
                    "A FPGA Optimization Tool Based on a Multi-island Genetic Algorithm Distributed over Grid Environments.",
                    "WSRF-Based Modeling of Clinical Trial Information for Collaborative Cancer Research.",
                    "GridMate: A Portable Simulation Environment for Large-Scale Adaptive Scientific Applications.",
                    "On the Performance of Parallel Neural Network Implementations on Distributed Memory Architectures.",
                    "Time-Stamping Authority Grid.",
                    "Advanced Security for Virtual Organizations: The Pros and Cons of Centralized vs Decentralized Security Models.",
                    "A Comprehensive Approach to Self-Restricted Delegation of Rights in Grids.",
                    "Composition and Execution of Secure Workflows in WSRF-Grids.",
                    "MPI Collectives on Modern Multicore Clusters: Performance Optimizations and Communication Characteristics.",
                    "Optimized Distributed Data Sharing Substrate in Multi-core Commodity Clusters: A Comprehensive Study with Applications.",
                    "Scheduling Asymmetric Parallelism on a PlayStation3 Cluster.",
                    "Xen-Based HPC: A Parallel I/O Perspective.",
                    "Operation of the Core D-Grid Infrastructure.",
                    "Initializing a National Grid Infrastructure - Lessons Learned from the Swiss National Grid Association Seed Project.",
                    "Deploying on the Grid with DeployWare.",
                    "COMP Superscalar: Bringing GRID Superscalar and GCM Together.",
                    "Workflow Level Interoperation of Grid Data Resources.",
                    "Collaborative BPEL Design with a Rich Internet Application.",
                    "Orchestrating Data-Centric Workflows.",
                    "Designing Workflows for Grid Enabled Internet Instruments.",
                    "A Stochastic Programming Approach for QoS-Aware Service Composition.",
                    "Using Dynamic Condor-Based Services for Classifying Schizophrenia in Diffusion Tensor Images.",
                    "A Middleware for Developing and Deploying Scalable Remote Mining Services.",
                    "An Autonomic Peer-to-Peer Architecture for Hosting Stateful Web Services.",
                    "Economic Grid Resource Management for CPU Bound Applications with Hard Deadlines.",
                    "Managing Cancellations and No-Shows of Reservations with Overbooking to Increase Resource Revenue.",
                    "Admission Control in a Computational Market.",
                    "Grid Differentiated Services: A Reinforcement Learning Approach.",
                    "GridBatch: Cloud Computing for Large-Scale Data-Intensive Batch Applications.",
                    "Enabling Interoperability among Meta-Schedulers.",
                    "Omnivore: Integration of Grid Meta-Scheduling and Peer-to-Peer Technologies.",
                    "Grid Resource Abstraction, Virtualization, and Provisioning for Time-Targeted Applications.",
                    "Formal Verification of a Grid Resource Allocation Protocol.",
                    "Adaptive Hybrid Model for Long Term Load Prediction in Computational Grid.",
                    "Characterizing, Modeling and Predicting Dynamic Resource Availability in a Large Scale Multi-purpose Grid.",
                    "On the Optimization of Resource Utilization in Distributed Multimedia Applications.",
                    "TCP Connection Scheduler in Single IP Address Cluster.",
                    "Experiences with Fine-Grained Distributed Supercomputing on a 10G Testbed.",
                    "Advanced RDMA-Based Admission Control for Modern Data-Centers.",
                    "A Stable Broadcast Algorithm.",
                    "High Performance Relay Mechanism for MPI Communication Libraries Run on Multiple Private IP Address Clusters.",
                    "View-Based Collective I/O for MPI-IO.",
                    "Grid Services for MPI.",
                    "Scalable Data Gathering for Real-Time Monitoring Systems on Distributed Computing.",
                    "A Proactive Non-Cooperative Game-Theoretic Framework for Data Replication in Data Grids.",
                    "A Reliable DICOM Transfer Grid Service Based on Petri Net Workflows.",
                    "Clustered Workflow Execution of Retargeted Data Analysis Scripts.",
                    "AMP: An Affinity-Based Metadata Prefetching Scheme in Large-Scale Distributed Storage Systems.",
                    "Synthesizing Byzantine Fault-Tolerant Grid Application Wrapper Services.",
                    "Hierarchical Replication Techniques to Ensure Checkpoint Storage Reliability in Grid Environment.",
                    "Fault Tolerance Management for a Hierarchical GridRPC Middleware.",
                    "Heuristic Algorithms for Replication Transition Problem in the Grid Systems.",
                    "Reputation-Based Estimation of Individual Performance in Grids.",
                    "A Probabilistic Model to Analyse Workflow Performance on Production Grids.",
                    "Modeling \"Just-in-Time\" Communication in Distributed Real-Time Multimedia Applications.",
                    "Provenance Services for Distributed Workflows.",
                    "The Ontology Relation Extraction for Semantic Web Annotation.",
                    "A Distributed Economic Meta-scheduler for the Grid.",
                    "Scheduling of Scientific Workflows on Data Grids.",
                    "Application-Level Fault-Tolerance Solutions for Grid Computing.",
                    "Performance Optimization for Multi-agent Based Simulation in Grid Environments.",
                    "Methodologies and Tools for Exploring Transport Protocols in the Context of High-Speed Networks.",
                    "Overlapping Communication and Computation with High Level Communication Routines.",
                    "An Autonomic Workflow Management System for Global Grids.",
                    "DaCAP - A Distributed Anti-Cheating Peer to Peer Architecture for Massive Multiplayer On-line Role Playing Game.",
                    "On the Construction of a Super-Peer Topology underneath Middleware for Distributed Computing.",
                    "RESERV: A Distributed, Load Balanced Information System for Grid Applications.",
                    "A Simple Cache Based Mechanism for Peer to Peer Resource Discovery in Grid Environments.",
                    "Peer-to-Peer Desktop Grids in the Real World: The ShareGrid Project.",
                    "Trade-Offs in Peer Delay Minimization for Video Streaming in P2P Systems.",
                    "Using Policy-Based Management for Privacy-Enhancing Data Access and Usage Control in Grid Environments.",
                    "A Trusted Data Storage Infrastructure for Grid-Based Medical Applications.",
                    "A Performance Study of Secure Data Mining on the Cell Processor.",
                    "Publication and Protection of Sensitive Site Information in a Grid Infrastructure.",
                    "Extending PKI Interoperability in Computational Grids.",
                    "Metadata Management in the Taverna Workflow System.",
                    "A Task Pipelining Framework for e-Science Workflow Management Systems.",
                    "Implementation of Turing Machines with the Scufl Data-Flow Language.",
                    "Scheduling Dynamic Workflows onto Clusters of Clusters using Postponing.",
                    "Provenance Tracking and Querying in the ViroLab Virtual Laboratory.",
                    "A New Approach to Development and Execution of Interactive Applications on the Grid.",
                    "Data Management Challenges of Data-Intensive Scientific Workflows.",
                    "A Lightweight Middleware Monitor for Distributed Scientific Workflows.",
                    "Comparative Studies Made Simple in GPFlow.",
                    "Securing Grid Workflows with Trusted Computing (Extended Abstract).",
                    "Architecture of the DaltOn Data Integration System for Scientific Applications.",
                    "Resource Discovery Based on a Novel Distributed DNS Framework.",
                    "A Framework for Interactive Parameter Sweep Applications.",
                    "Fault-Tolerant Policy for Optical Network Based Distributed Computing System.",
                    "Temporal Routing Metrics for Networks with Advance Reservations.",
                    "Deployment and Interoperability of the Phosphorus Grid Enabled GMPLS (G2MPLS) Control Plane.",
                    "Data Consolidation: A Task Scheduling and Data Migration Technique for Grid Networks.",
                    "A Multi-protocol Bioinformatics Web Service: Use SOAP, Take a REST or Go with HTML.",
                    "CD-HIT Workflow Execution on Grids Using Replication Heuristics.",
                    "TMAinspect, an EGEE Framework for Tissue MicroArray Image Handling.",
                    "HT-RLS: High-Throughput Web Tool for Analysis of DNA Microarray Data Using RLS classifiers.",
                    "Modeling the Latency on Production Grids with Respect to the Execution Context.",
                    "Using Probabilistic Characterization to Reduce Runtime Faults in HPC Systems.",
                    "Bad Words: Finding Faults in Spirit's Syslogs.",
                    "Performance and Availability Tradeoffs in Replicated File Systems.",
                    "Fault Tolerance and Recovery of Scientific Workflows on Computational Grids.",
                    "Reliability-Aware Approach: An Incremental Checkpoint/Restart Model in HPC Environments.",
                    "Application Resilience: Making Progress in Spite of Failure.",
                    "Application MTTFE vs. Platform MTBF: A Fresh Perspective on System Reliability and Application Throughput for Computations at Scale.",
                    "A Technique for Lock-Less Mirroring in Parallel File Systems.",
                    "Fault Tolerance in Cluster Federations with O2P-CF.",
                    "Symmetric Active/Active High Availability for High-Performance Computing System Services: Accomplishments and Limitations."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7th CCGRID 2007",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2007",
                "sub_name": "Seventh IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2007), 14-17 May 2007, Rio de Janeiro, Brazil.",
                "count": 111,
                "papers": [
                    "Toward an International \"Computer Science Grid\".",
                    "Redundancy Management for P2P Storage.",
                    "Design and Implementation of a Middleware for Data Storage in Opportunistic Grids.",
                    "Cooperative Caching for Grid Based DataWarehouses.",
                    "Active Data: Supporting the Grid Data Life Cycle.",
                    "Dynamic Condor-based Services for Distributed Image Analysis.",
                    "BBCLB: A Bulletin-Board based Cooperative Load Balance Strategy for Service Grid.",
                    "CyberBridges A Model Collaboration Infrastructure for e-Science.",
                    "Executing Large Parameter Sweep Applications on a Multi-VO Testbed.",
                    "An On-line Algorithm for Fair-Share Node Allocations in a Cluster.",
                    "Dynamic Scheduling with Process Migration.",
                    "Optimizing jobs timeouts on clusters and production grids.",
                    "A Hybrid Linear Programming and Evolutionary Algorithm based Approach for On-line Resource Matching in Grid Environments.",
                    "A Semantic Framework for Integrated Asset Management in Smart Oilfields.",
                    "Ontology-based Semantic Integration Scheme for Medical Image Grid.",
                    "Incremental Trust in Grid Computing.",
                    "Sustaining Incentive in Grid Resource Allocation: A Reinforcement Learning Approach.",
                    "Hierarchical Replication Control in a Global File System.",
                    "A Predictive Technique for Replica Selection in Grid Environment.",
                    "Study of Different Replica Placement and Maintenance Strategies in Data Grid.",
                    "Intelligent Scheduling and Replication in Datagrids: a Synergistic Approach.",
                    "Analysis and Synthesis of Pseudo-Periodic Job Arrivals in Grids: A Matching Pursuit Approach.",
                    "Profiling Computation Jobs in Grid Systems.",
                    "Build-and-Test Workloads for Grid Middleware: Problem, Analysis, and Applications.",
                    "Impact of Adaptive Resource Allocation Requests in Utility Cluster Computing Environments.",
                    "Access Control Policy Combinations for the Grid Using the Policy Machine.",
                    "An Integrated Approach for Managing Peer-to-Peer Desktop Grid Systems.",
                    "An Accounting Model for Dynamic Virtual Organizations.",
                    "Locality-aware Connection Management and Rank Assignment forWide-area MPI.",
                    "A Simulation Study of Data Partitioning Algorithms for Multiple Clusters.",
                    "Exploiting Lustre File Joining for Effective Collective IO.",
                    "Exploiting Heterogeneity for Collective Data Downloading in Volunteer-based Networks.",
                    "Economic Model for Replicated Database Placement in Grid.",
                    "Super-resolution Imaging Using Grid Computing.",
                    "Resolution of large symmetric eigenproblems on a world wide grid.",
                    "Grid-based PSE for Engineering of Materials (GPEM).",
                    "UIMA GRID: Distributed Large-scale Text Analysis.",
                    "Distributed Resource Selection in Grid Using Decision Theory.",
                    "Heuristic Scheduling of Grid Workflows Supporting Co-Allocation and Advance Reservation.",
                    "Fair Game-Theoretic Resource Management in Dedicated Grids.",
                    "A Static Load-Balancing Scheme for Parallel XML Parsing on Multicore CPUs.",
                    "Processing Mesoscale Climatology in a Grid Environment.",
                    "Specification-correct and Scalable Coordination of Scientific Applications in Grid Environments.",
                    "Distributed Visualization Using VTK in Grid Environments.",
                    "Online Analysis and Runtime Steering of Dynamic Workflows in the ASKALON Grid Environment.",
                    "Scheduling Data-IntensiveWorkflows onto Storage-Constrained Distributed Resources.",
                    "Scheduling deadline-constrained bulk data transfers to minimize network congestion.",
                    "A Distributed Query Execution Engine in a Grid Environment.",
                    "Scheduling Remote Access to Scientific Instruments in Cyberinfrastructure for Education and Research.",
                    "Reliability Analysis of Self-Healing Network using Discrete-Event Simulation.",
                    "An Efficient and Reliable Scientific Workflow System.",
                    "Query-load balancing in structured overlays.",
                    "A Robust Decentralized Job Scheduling Approach for Mobile Peers in Ad-hoc Grids.",
                    "Understanding the Impact of Multi-Core Architecture in Cluster Computing: A Case Study with Intel Dual-Core System.",
                    "Hot-Spot Avoidance With Multi-Pathing Over InfiniBand: An MPI Perspective.",
                    "High-Performance MPI Broadcast Algorithm for Grid Environments Utilizing Multi-lane NICs.",
                    "Reducing Connection Memory Requirements of MPI for InfiniBand Clusters: A Message Coalescing Approach.",
                    "Adaptive Performance Modeling on Hierarchical Grid Computing Environments.",
                    "Performance Analysis of Updating Mechanisms for Dynamic Content in Peer-to-Peer Networks.",
                    "Relative Performance of Scheduling Algorithms in Grid Environments.",
                    "Reparallelization and Migration of OpenMP Programs.",
                    "Power Aware Scheduling of Bag-of-Tasks Applications with Deadline Constraints on DVS-enabled Clusters.",
                    "Virtual Clusters on the Fly - Fast, Scalable, and Flexible Installation.",
                    "Integrated Data Reorganization and Disk Mapping for Reducing Disk Energy Consumption.",
                    "STORM: An Approach to Database Storage Management in Clustered Storage Environments.",
                    "On the Advantages of an Alternative MPI Execution Model for Grids.",
                    "High Performance Distributed Lock Management Services using Network-based Remote Atomic Operations.",
                    "Dynamic Malleability in Iterative MPI Applications.",
                    "Collective Interfaces for Distributed Components.",
                    "Genesis II - Standards Based Grid Computing.",
                    "Standardization of an API for Distributed Resource Management Systems.",
                    "A Service-Oriented System to Support Data Integration on Data Grids.",
                    "Design of a Scalable Peer-to-Peer Information System Using the GT4 Index Service.",
                    "Token Exchange System as incentive mechanism for e-Science Grid.",
                    "Using Jade agent framework to prototype an e-Science workflow bus.",
                    "RABC: A Conceptual Design of Pervasive Infrastructure for Browser Computing based on Ajax technologies.",
                    "Deploying PHYLIP phylogenetic package on a Large Scale Distributed System.",
                    "Workflow Management in a Protein Clustering Application.",
                    "Parameter Sweeps for Functional MRI Research in the \"Virtual Laboratory for e-Science\" Project.",
                    "Large Scale Deployment of Molecular Docking Application on Computational Grid infrastructures for Combating Malaria.",
                    "Mobility-Aware Efficient Job Scheduling in Mobile Grids.",
                    "A Hierarchical Two-Tier Information Management Architecture for Mobile Ad-Hoc Grid Environments.",
                    "Impact of the execution context on Grid job performances.",
                    "DICHOTOMY: A Resource Discovery and Scheduling Protocol for Multihop Ad hoc Mobile Grids.",
                    "MAPGrid: A New Architecture for Empowering Mobile Data Placement in Grid Environments.",
                    "A Semantic Approach to Enhance Service Composition in Workflows that use Mobile Services.",
                    "Characterizing and Classifying Desktop Grid.",
                    "A Parallel P2P Branch-and-Bound Algorithm for Computational Grids.",
                    "Transparent Symmetric Active/Active Replication for Service-Level High Availability.",
                    "Comparison of JXTA and WSRF.",
                    "On the Efficiency and Cost of Introducing QoS in BitTorrent.",
                    "Requirements of Peer-to-Peer-based Massively Multiplayer Online Gaming.",
                    "GiGi: An Ocean of Gridlets on a \"Grid-for-the-Masses\".",
                    "An Aspect-Oriented Programming Model for Bag-of-Tasks Grid Applications.",
                    "Assessing the Quality of Automatically Built Network Representations.",
                    "Revisit of View-Oriented Parallel Programming.",
                    "Development of a Robust and Flexible Weblab Framework based on AJAX and Design Patterns.",
                    "Bridging the High Performance Computing Gap: the OurGrid Experience.",
                    "TVGrid: A Grid Architecture to use the idle resources on a Digital TV network.",
                    "Latin American Perspectives on Grid Computing, from Bahia Blanca, Argentina.",
                    "Building a Grid in Latin America: The EELA Project e-Infrastructure.",
                    "A Computer-Aided Diagnostic System using a Global Data Grid Repository for the Evaluation of Ultrasound Carotid Images.",
                    "QEF - Supporting Complex Query Applications.",
                    "Applications ported to the EELA e-Infrastructure.",
                    "A classification for the implementations of heterogeneous strong migration of computations.",
                    "Performance Evaluation in Grid Computing: A Modeling and Prediction Perspective.",
                    "PACE: Augmenting Personal Mobile Devices with Scalable Computing.",
                    "Detecting, Managing and Querying Replicas and Versions in a Peer-to-Peer Environment.",
                    "Economy-based Content Replication for Peering Content Delivery Networks.",
                    "Overdrive Controllers for Distributed Scientific Computation.",
                    "A Model for Automatic On-Line Process Behavior Extraction, Classification and Prediction in Heterogeneous Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6th CCGRID 2006",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2006",
                "sub_name": "Sixth IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2006), 16-19 May 2006, Singapore.",
                "count": 175,
                "papers": [
                    "Message from the General and Program Chairs.",
                    "Organizing Committee.",
                    "Steering Committee.",
                    "International Program Committee.",
                    "Additional Reviewers.",
                    "Industrial Sponsors.",
                    "Grid Computing in Drug Discovery.",
                    "AIST SOA for Building Service Oriented e-Infrastructure.",
                    "Cyber-Infrastructure in Korea - A Status Report.",
                    "Building Cyber-Infrastructure for the Biomedical Informatics Research Network.",
                    "MPI-Mitten: Enabling Migration Technology in MPI.",
                    "MPI over uDAPL: Can High Performance and Portability Exist Across Architectures?.",
                    "Proposal of MPI Operation Level Checkpoint/Rollback and One Implementation.",
                    "Scalable Approaches for Supporting MPI-IO Atomicity.",
                    "Design of High Performance MVAPICH2: MPI2 over InfiniBand.",
                    "Aspect-Oriented Parallel Discrete Optimization on the Cohesion Desktop Grid Platform.",
                    "Density-Based Clustering for Similarity Search in a P2P Network.",
                    "Towards Soft Real-Time Applications on Enterprise Desktop Grids.",
                    "The Computational and Storage Potential of Volunteer Computing.",
                    "Effective Load Balancing in P2P Systems.",
                    "INTCTD: A Peer-to-Peer Approach for Intrusion Detection.",
                    "SGII: Combining P2P Data Integration Paradigm and Semantic Web Technology On Top Of OGSA-DAI.",
                    "Actor Provenance Capture With Ganglia.",
                    "Architecture Model for Information Service in Large Scale Grid Environments.",
                    "An Extensible Resource Discovery Mechanism for Grid Computing Environments.",
                    "Service Matchmaking with Rough Sets.",
                    "Guarantee of Freshness in Resource Information Cache on WSPE: Web Service Polling Engine.",
                    "Resource Discovery Using PageRank Technique in Grid Environment.",
                    "Compilation of XSLT into Dataflow Graphs for Web Service Composition.",
                    "Statistical Properties of Task Running Times in a Global-Scale Grid Environment.",
                    "Dynamic Workflow Management Using Performance Data.",
                    "An Ontology-Based Conceptual Mapping Framework for Translating FBPML to the Web Services Ontology.",
                    "WS-Messenger: A Web Services-Based Messaging System for Service-Oriented Grid Computing.",
                    "A WSRF-Based Resource Management System of Manufacturing Grid.",
                    "A Core Grid Ontology for the Semantic Grid.",
                    "Integrating Gridcomputing and Metamodeling.",
                    "OGSA-DAI and Bioinformatics Grids: Challenges, Experience and Strategies.",
                    "Biodiversity World: A Problem-Solving Environment for Analysing Biodiversity Patterns.",
                    "Evaluating Performance and Scalability of Advanced Accelerator Simulations.",
                    "The Signal Data Explorer: A High Performance Grid based Signal Search Tool for use in Distributed Diagnostic Applications.",
                    "Distribution of a World Space for Real-Time 3D Applications.",
                    "PACS-CS: A Large-Scale Bandwidth-Aware PC Cluster for Scientific Computations.",
                    "Deploying Scientific Applications to the PRAGMA Grid Testbed: Strategies and Lessons.",
                    "ResGrid: A Grid-aware Toolkit for Reservoir Uncertainty Analysis.",
                    "Interactive Grid-based Free-Form Shape Modeling.",
                    "Supporting the Collaborative Construction of Learning Objects Using the Grid.",
                    "A Parallel Genetic Algorithm for the Optimal Design of Multi-body Model Vehicle Suspensions.",
                    "Network Bandwidth Predictor (NBP): A System for Online Network performance Forecasting.",
                    "Evaluation of BPEL to Scientific Workflows.",
                    "How the JSDL can Exploit the Parallelism?",
                    "Transparent Adaptive Library-Based Checkpointing for Master-Worker Style Parallelism.",
                    "SDCS: Simplified Data Communications in Parallel/Distributed Applications.",
                    "Integrating Computing Resources on Multiple Grid-enabled Job Scheduling Systems Through a Grid RPC System.",
                    "JaSkel: A Java Skeleton-Based Framework for Structured Cluster and Grid Computing.",
                    "GRASG - A Framework for \"Gridifying\" and Running Applications on Service-Oriented Grids.",
                    "GRENCHMARK: A Framework for Analyzing, Testing, and Comparing Grids.",
                    "CPU Load Predictions on the Computational Grid.",
                    "Statistical Data Reduction for Efficient Application Performance Monitoring.",
                    "Improving a Local Learning Technique for QueueWait Time Predictions.",
                    "A Semi-Empirical Model for Maximal LINPACK Performance Predictions.",
                    "gSET: Trust Management and Secure Accounting for Business in the Grid.",
                    "A Shibboleth-Protected Privilege Management Infrastructure for e-Science Education.",
                    "Evaluating Provenance-based Trust for Scientific Workflows.",
                    "Towards a Secure, Tamper-Proof Grid Platform.",
                    "Towards Reliable Trust Establishment in Grid: A Pre-evaluating Set Based Reputation Evaluation Approach1.",
                    "Trustworthy Auctions for Grid-Style Economies.",
                    "Policy-Based Access Control Framework for Grid Computing.",
                    "End-to-End Trustworthy Data Access in Data-Oriented Scientific Computing.",
                    "Designing Efficient Cooperative Caching Schemes for Multi-Tier Data-Centers over RDMA-enabled Networks.",
                    "Nexus: A Novel Weighted-Graph-Based Prefetching Algorithm for Metadata Servers in Petabyte-Scale Storage Systems.",
                    "Optimal Replica Placement Strategy for Hierarchical Data Grid Systems.",
                    "Efficient Multi-Source Data Transfer in Data Grids.",
                    "Relaxed Data Consistency with CONStanza.",
                    "Enabling Transparent Data Sharing in Component Models.",
                    "Replica Placement Design with Static Optimality and Dynamic Maintainability.",
                    "Efficient Many-to-One Communication for a Distributed RAID.",
                    "ReCon: A Fast and Reliable Replica Retrieval Service for the Data Grid.",
                    "GridFTP-APT: Automatic Parallelism Tuning Mechanism for Data Transfer Protocol GridFTP.",
                    "Integrating Logical and Physical File Models in the MPI-IO Implementation for \"Clusterfile\".",
                    "DIMVisual: Data Integration Model for Visualization of Parallel Programs Behavior.",
                    "Heimdhal: A History-Based Policy Engine for Grids.",
                    "PhoenixG: A Unified Management Framework for Industrial Information Grid.",
                    "Mirroring Resources or Mapping Requests: Implementing WS-RF for Grid Workflows.",
                    "Assessing Data Virtualization for Irregularly Replicated Large Datasets.",
                    "Virtual Clusters for Grid Communities.",
                    "Design and Evaluation of Nemesis, a Scalable, Low-Latency, Message-Passing Communication Subsystem.",
                    "Exploit Failure Prediction for Adaptive Fault-Tolerance in Cluster Computing.",
                    "Calder Query Grid Service: Insights and Experimental Evaluation.",
                    "Nova: An Approach to On-Demand Virtual Execution Environments for Grids.",
                    "A Robust Reputation System for the Grid.",
                    "Extending the Entry Consistency Model to Enable Efficient Visualization for Code-Coupling Grid Applications.",
                    "A Co-ordinate Based Resource Allocation Strategy for Grid Environments.",
                    "Scalable Grid Application Scheduling via Decoupled Resource Selection and Scheduling.",
                    "Learning-Based Negotiation Strategies for Grid Scheduling.",
                    "A Feedback Mechanism for Network Scheduling in LambdaGrids.",
                    "Dynamic Co-Scheduling of Distributed Computation and Replication.",
                    "QoS Oriented Resource Reservation in Shared Environments.",
                    "Analysis of Query Matching Criteria and Resource Monitoring Models for Grid Application Scheduling.",
                    "Adaptive Policing for Token-Exchange Based Management of Shared Computing Resources.",
                    "Management Middleware for Enterprise Grids.",
                    "A Portable Grid Infrastructure for Resource-Aware Applications.",
                    "A Repository Adapter for Resource Management Information.",
                    "A Failure-Aware Scheduling Strategy in Large-Scale Cluster System.",
                    "Gang Scheduling and Adaptive Resource Allocation to Mitigate Advance Reservation Impact.",
                    "Imprecise Computation Grid Application Model for Flexible Market-Based Resource Allocation.",
                    "Message from the General and Program Chairs.",
                    "Organizing Committee.",
                    "Steering Committee.",
                    "International Program Committee.",
                    "Additional Reviewers.",
                    "Industrial Sponsors.",
                    "Agents in ChinaGrid Support Platform.",
                    "Agent Oriented Software Engineering for Grid Computing.",
                    "A Middleware Framework for Secure Mobile Grid Services.",
                    "Fault Tolerance in a Mobile Agent Based Computational Grid.",
                    "A Relaxed-Criteria Bargaining Protocol for Grid Resource Management.",
                    "MagCat: An Agent-based Metadata Service for Data Grids.",
                    "Group-Based Dynamic Computational Replication Mechanism in Peer-to-Peer Grid Computing.",
                    "Structured Overlay without Consistent Hashing: Empirical Results.",
                    "Fast Freenet: Improving Freenet Performance by Preferential Partition Routing and File Mesh Propagation.",
                    "Correlating Topology and Path Characteristics of Overlay Networks and the Internet.",
                    "Service Registry Discovery using GridSearch P2P Framework.",
                    "An Adaptive Approach to P2P Resource Discovery in Distributed Scientific Research Communities.",
                    "Applying Trust Mechanisms in an agent-based P2P Network of Service Providers and Requestors.",
                    "Simple Locality-Aware Co-allocation in Peer-to-Peer Supercomputing.",
                    "VODCA: View-Oriented, Distributed, Cluster-Based Approach to Parallel Computing.",
                    "Dynamic Memory Management on Mome DSM.",
                    "GridFS: Targeting Data Sharing in Grid Environments.",
                    "Adapting Distributed Shared Memory Applications in Diverse Environments.",
                    "Design Issues of Prefetching Strategies for Heterogeneous Software DSM.",
                    "Dynamic List Scheduling of Threads on Clusters.",
                    "Closing Cluster Attack Windows Through Server Redundancy and Rotations.",
                    "SAHA: A Scheduling Algorithm for Security-Sensitive Jobs on Data Grids.",
                    "IPMI-based Efficient Notification Framework for Large Scale Cluster Computing.",
                    "Security Issues in On-Demand Grid and Cluster Computing.",
                    "An Overview of Security Issues in Cluster Interconnects.",
                    "Cluster Security Research Involving the Modeling of Network Exploitations Using Exploitation Graphs.",
                    "The Stakkato Intrusions: What Happened and What Have We Learned?.",
                    "Maestro-VC: A Paravirtualized Execution Environment for Secure On-Demand Cluster Computing.",
                    "Work in Progress: RASS Framework for a Cluster-Aware SELinux.",
                    "Byzantine Anomaly Testing for Charm++: Providing Fault Tolerance and Survivability for Charm++ Empowered Clusters.",
                    "Segregate Applications at System Level to Eliminate Security Problems.",
                    "Monitoring High Performance Networks in Large-scale Clusters.",
                    "Survival of the Internet Applications: A Cluster Recovery Model.",
                    "A Vision for the Trust Managed Grid.",
                    "OBIGrid: Towards the 'Ba' for Sharing Resources, Services and Knowledge for Bioinformatics.",
                    "Connecting Hospitals through a Distance Learning Center and Permanent Remote Support Network - A Sicilian Project to Improve Patient Care.",
                    "Building Cyberinfrastructure for Bioinformatics Using Service Oriented Architecture.",
                    "Grid Added Value to Address Malaria.",
                    "Using Multiple Grid Resources for Bioinformatics Applications in GADU.",
                    "Prospects for a Biodiversity Grid: Managing Biodiversity Knowledge.",
                    "Solving the Protein Folding Problem with a Bicriterion Genetic Algorithm on the Grid.",
                    "Analysis of the Bioinformatics Grid Technique Applications in China.",
                    "Cluster and Grid Based Classification of Transposable Elements in Eukaryotic Genomes.",
                    "A Grid Enabled Workflow Management System for Managing Parameter Sweep Applications in Neuroimaging Research.",
                    "Integrating Bioinformatics Resources on the EGEE Grid Platform.",
                    "Grid-User Driven Grid Research, The CoBRA Grid.",
                    "Hierarchical Scheduling of Independent Tasks with Shared Files.",
                    "Instrument Element: A New Grid component that Enables the Control of Remote Instrumentation.",
                    "On Construction and Performance Evaluation of Cluster of Linux PC Clusters Environments.",
                    "ICE: A Service Oriented Approach to Uniform the Access and Management of Cluster Environments.",
                    "Uniform Job Monitoring using the HPC-Europa Single Point of Access.",
                    "The Development of a Computational Grid Portal.",
                    "The PRAGMA Testbed - Building a Multi-Application International Grid.",
                    "NUSgrid: A Computational Grid for a University Campus.",
                    "Analysis of Jobs in a Multi-Organizational Grid Test-bed.",
                    "DotGrid: A .NET-based Infrastructure for Global Grid Computing.",
                    "Component-Based Modeling, Analysis and Animation.",
                    "Large Scale Distributed Simulation on the Grid.",
                    "Towards Building an Intelligent Traffic Simulation Platform.",
                    "Integrating the HLA RTI Services with Scilab.",
                    "GDSA: A Grid-Based Distributed Simulation Architecture.",
                    "Research and Application on Service Oriented Infrastructure for Networkitized M&S.",
                    "SSB : A Grid-based Infrastructure for HLA Systems.",
                    "Research and Realization of Collaborative M&S Services in Simulation Grid."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5th CCGRID 2005",
        "info": "Cardiff, Wales, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2005",
                "sub_name": "5th International Symposium on Cluster Computing and the Grid (CCGrid 2005), 9-12 May, 2005, Cardiff, UK.",
                "count": 161,
                "papers": [
                    "CLAG+grid.edu 2005 organization.",
                    "2005 IEEE International Symposium on Cluster Computing and the Grid.",
                    "Copyright page.",
                    "Message from the programme committee chair.",
                    "International programme committee.",
                    "Message from the organising committee.",
                    "List of industrial sponsors.",
                    "Welcome from the general co-chairs.",
                    "CCGrid 2005 Committees.",
                    "Collaborative and learning applications of grid technology and grid education.",
                    "Enabling technologies for future learning scenarios: the semantic grid for human learning.",
                    "A semantic grid-based e-learning framework (SELF).",
                    "Semantic search of learning services in a grid-based collaborative system.",
                    "The QuarkNet/grid collaborative learning e-Lab.",
                    "The Planet Project: collaborative educational content repositories on structured peer-to-peer grids.",
                    "An advanced grid computing course for application and infrastructure developers.",
                    "Experiences in teaching grid computing to advanced level students.",
                    "Experiences in teaching a geographically distributed undergraduate grid computing course.",
                    "Grid computing in the undergraduate classroom topics, exercises and experiences.",
                    "Cluster security - the paradigm shift.",
                    "Feasibility study and early experimental results towards cluster survivability.",
                    "Increasing distributed storage survivability with a stackable RAID-like file system.",
                    "A rejuvenation methodology of cluster recovery.",
                    "Clusters and security: distributed security for distributed systems.",
                    "Instant attack stopper in InfiniBand architecture.",
                    "A first step toward detecting SSH identity theft in HPC cluster environments: discriminating masqueraders based on command behavior.",
                    "Cluster security with NVisionCC: process monitoring by leveraging emergent properties.",
                    "Incorporating information from a cluster batch scheduler and center management software into automated log file analysis.",
                    "An adaptive instrumented node for efficient anomalies and misuse detections in HPC environment.",
                    "Searching for open windows and unlocked doors: port scanning in large-scale commodity clusters.",
                    "First international workshop on semantic infrastructure for grid computing applications (SIGAW).",
                    "Ontology based service for grid resources description.",
                    "Semi-automated preservation and archival of scientific data using semantic grid services.",
                    "Deductive synthesis of workflows for e-Science.",
                    "Bootstrapping to a semantic grid.",
                    "Semantic integration of file-based data for grid services.",
                    "Using semantic Web technology to automate data integration in grid and Web service architectures.",
                    "A semantic grid-based data access and integration service for bioinformatics.",
                    "International workshop on global and peer-to-peer computing.",
                    "NodeWiz: peer-to-peer resource discovery for grids.",
                    "Reducing maintenance overhead in Chord via heterogeneity.",
                    "Search and index in locality-based clustering overlay.",
                    "Efficient broadcast in P2P grids.",
                    "The distributed spanning tree: a scalable interconnection topology for efficient and equitable traversal.",
                    "Performance evaluation of JXTA communication layers.",
                    "P3: P2P-based middleware enabling transfer and aggregation of computational resources.",
                    "A secure trust and incentive management framework for public-resource based computing utilities.",
                    "An incentives' mechanism promoting truthful feedback in peer-to-peer systems.",
                    "Data distribution in a peer to peer storage system.",
                    "1st international workshop on grid performability.",
                    "Data grid performance analysis through study of replication and storage infrastructure parameters.",
                    "Performance metrics and ontology for describing performance data of grid workflows.",
                    "Empirical evaluation of shared parallel execution on independently scheduled clusters.",
                    "Enhancing the effective utilisation of grid clusters by exploiting on-line performability analysis.",
                    "Workshop on agent-based grid economics.",
                    "Employing economics to achieve fairness in usage policing of cooperatively shared computing resources.",
                    "Large scale multiagent simulation on the grid.",
                    "Developing dynamic strategies for multi-issue automated contracting in the agent based commercial grid.",
                    "An organizational grid of federated MOSIX clusters.",
                    "Design and implementation of an efficient multi-cluster GridRPC system.",
                    "SEMPLAR: high-performance remote parallel I/O over SRB.",
                    "Architecture for caching responses with multiple dynamic dependencies in multi-tier data-centers over InfiniBand.",
                    "Resource management for clusters of virtual machines.",
                    "Policy-based resource topology design for enterprise grids.",
                    "Co-reservation with the concept of virtual resources.",
                    "Third workshop on grids and advanced networks.",
                    "Fast pattern-based throughput prediction for TCP bulk transfers.",
                    "A dynamically adaptive hybrid algorithm for scheduling lightpaths in lambda-grids.",
                    "A distributed resource and network partitioning architecture for service grids.",
                    "Logistical multicast for data distribution.",
                    "Evaluating high-throughput reliable multicast for grid applications in production networks.",
                    "BioGrid- bridging life science and information technology.",
                    "GNARE: an environment for grid-based high-throughput genome analysis.",
                    "Scientific grid activities in Cybermedia Center, Osaka University.",
                    "A grid-based HIV expert system.",
                    "Grid-enabling medical image analysis.",
                    "Grid warehousing of molecular dynamics protein unfolding data.",
                    "Creating virtual storages and searching DICOM medical images through a grid middleware based in OGSA.",
                    "Modeling gene-regulatory networks using evolutionary algorithms and distributed computing.",
                    "HGBS: a hardware-oriented grid BLAST system.",
                    "Grid for Geno-Medicine: a glimpse on the GGM project.",
                    "The potential of parallel computing for locating primary care services.",
                    "Distributed market broker architecture for resource aggregation in grid computing environments.",
                    "An economic-based resource management framework in the grid context.",
                    "Applying grid technology to Web application systems.",
                    "WS-based workflow description language for message passing.",
                    "Continuous resources allocation in Internet data centers.",
                    "Clondike: Linux cluster of non-dedicated workstations.",
                    "Application-level simulation modelling of large grids.",
                    "Towards agent based grid resource management.",
                    "Efficient resource description and high quality selection for virtual grids.",
                    "Online resource matching for heterogeneous grid environments.",
                    "n-Cycle: a set of algorithms for task distribution on a commodity grid.",
                    "Q-SAC: toward QoS optimized service automatic composition.",
                    "Providing support for integrated scientific computing: metacomputing meets the grid and the semantic Web.",
                    "Security solution to manufacturing grid usage scenarios.",
                    "Intra-engine service security for grids based on WSRF.",
                    "Implementing a secure, service oriented accounting system for computational economies.",
                    "Scalable enterprise level workflow and infrastructure management in a grid computing environment.",
                    "OGSA-based grid workload monitoring.",
                    "Specification of grid workflow applications with AGWL: an Abstract Grid Workflow Language.",
                    "A grid-based problem solving environment for GECEM.",
                    "A grid application development platform for WebCom-G.",
                    "An enabling framework for parallel optimization on the computational grid.",
                    "A scripting based architecture for management of streams and services in real-time grid applications.",
                    "ReGS: user-level reliability in a grid environment.",
                    "Servicing range queries on multidimensional datasets with partial replicas.",
                    "Improving parallel data transfer times using predicted variances in shared networks.",
                    "Spatial indexing of distributed multidimensional datasets.",
                    "Query planning for the grid: adapting to dynamic resource availability.",
                    "Task scheduling strategies for workflow-based applications in grids.",
                    "Scheduling complex computer simulations on heterogeneous non-dedicated machines: a case study in structural bioinformatics.",
                    "A batch scheduler with high level components.",
                    "Experiences with the KOALA co-allocating scheduler in multiclusters.",
                    "A hypergraph partitioning based approach for scheduling of tasks with batch-shared I/O.",
                    "Exploiting the advantages of object-based DSM in a heterogeneous cluster environment.",
                    "Supporting the dynamic grid service lifecycle.",
                    "Behavioural specification of grid services with the KAoS policy language.",
                    "Object-oriented SPMD.",
                    "Secret sequence comparison on public grid computing resources.",
                    "Semantic support for computational land-use modelling.",
                    "A new dynamical domain decomposition method for parallel molecular dynamics simulation.",
                    "Mapping DAG-based applications to multiclusters with background workload.",
                    "A dynamic grid services deployment mechanism for on-demand resource provisioning.",
                    "Fifth international workshop on distributed shared memory.",
                    "View-oriented update protocol with integrated diff for view-based consistency.",
                    "Execution time prediction in DSM-based mobile grids.",
                    "The performance analysis of portable parallel programming interface MpC for SDSM and pthread.",
                    "A practical transparent data sharing service for the grid.",
                    "Teamster-G: a grid-enabled software DSM system.",
                    "A distributed shared buffer space for data-intensive applications.",
                    "Distributed synchronization with shared semaphore sets.",
                    "Version vector protocols implementing session guarantees.",
                    "Reconfigurable consistency model for object-based software DSM.",
                    "Can high performance software DSM systems designed with InfiniBand features benefit from PCI-Express?",
                    "User group-based workload analysis and modelling.",
                    "Computational workload prediction for grid oriented industrial applications: the case of 3D-image rendering.",
                    "Information policies for load balancing on heterogeneous systems.",
                    "A grid-based system for microbial genome comparison and analysis.",
                    "Analyzing the advance reservation of lightpaths in lambda-grids.",
                    "Programmable optical burst switched network: a novel infrastructure for grid services.",
                    "On the design and performance of kernel-level TCP connection endpoint migration in cluster-based servers.",
                    "Memory registration caching correctness.",
                    "OpenMosix, OpenSSI and Kerrighed: a comparative study.",
                    "Performance analysis for distributed and parallel Java programs with Aksum.",
                    "Evaluating the performance of the dNFSP file system.",
                    "Scaling NFSv4 with parallel file systems.",
                    "Network performance variability in NOW clusters.",
                    "A novel workload migration scheme for heterogeneous distributed computing.",
                    "Dynamic load balancing experiments in a grid.",
                    "A distributed load-based failure recovery mechanism for advance reservation environments.",
                    "ZetaSAT - Boolean SATisfiability solving on Desktop Grids.",
                    "Construction of a diagnostic support system for circulatory disease in a volume communications environment.",
                    "Implementing phylogenetic inference with GRID superscalar.",
                    "NETIBIS: an efficient and dynamic communication system for heterogeneous grids.",
                    "aIOLi: an input/output library for cluster of SMP.",
                    "A high performance configurable transport protocol for grid computing.",
                    "The Composite Endpoint Protocol (CEP): scalable endpoints for terabit flows.",
                    "Implementing MPI-IO atomic mode without file system support.",
                    "Selfish grid computing: game-theoretic modeling and NAS performance results.",
                    "GangSim: a simulator for grid scheduling studies."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "4th CCGRID 2004",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2004",
                "sub_name": "4th IEEE/ACM International Symposium on Cluster Computing and the Grid (CCGrid 2004), April 19-22, 2004, Chicago, Illinois, USA.",
                "count": 105,
                "papers": [
                    "Incentive mechanisms for large collaborative resource sharing.",
                    "Probabilistic file indexing and searching in unstructured peer-to-peer networks.",
                    "SCALLOP: a scalable and load-balanced peer-to-peer lookup protocol for high-performance distributed systems.",
                    "Analysis of large-scale topological properties for peer-to-peer networks.",
                    "Net-dbx-G: a Web-based debugger of MPI programs over Grid environments.",
                    "Parallel program debugging: interface design and implementation.",
                    "A Java-based programming environment for hierarchical Grid: Jojo.",
                    "Ubiquitous information browsing.",
                    "Cluster Computing on the Fly: resource discovery in a cycle sharing peer-to-peer system.",
                    "Supporting quality of service in a non-dedicated opportunistic environment.",
                    "Adaptive congestion control for hotspot management in structured peer-to-peer systems.",
                    "Data durability in peer to peer storage systems.",
                    "Adaptive QoS for collaborative service-oriented learning environments.",
                    "GRIDCOLE: a Grid Collaborative Learning Environment.",
                    "On distributed systems and CSCL.",
                    "ULabGrid framework for computationally intensive remote and collaborative learning laboratories.",
                    "The virtual resource manager: an architecture for SLA-aware resource management.",
                    "QoS support for high-performance scientific Grid applications.",
                    "Sizing the streaming media cluster solution for a given workload.",
                    "Data Grid tutorials with hands-on experience.",
                    "Learning Grid technologies in a project-based computer architecture course.",
                    "GridForce: a comprehensive model for improving the technical preparedness of our workforce for the Grid.",
                    "HTTP(P2P): a transaction based (HTTP) peer-to-peer protocol for the dissemination of Web-objects in congested networks.",
                    "Cache replacement policies revisited: the case of P2P traffic.",
                    "Automatic methods for predicting machine availability in desktop Grid and peer-to-peer systems.",
                    "Towards a generic platform for developing CSCL applications using Grid infrastructure.",
                    "A workflow-based architecture for E-learning in the Grid.",
                    "Agent mediated Grid services in E-learning.",
                    "Classifiers for the causes of data loss using packet-loss signatures.",
                    "A decentralized scheduler for distributed video streaming in a server-less video streaming system.",
                    "GTP: group transport protocol for lambda-Grids.",
                    "Grid computing as applied distributed computation: a graduate seminar on Internet and Grid computing.",
                    "Incorporating Grid computing concepts into a course in performance measurement.",
                    "A reputation-based trust management system for P2P networks.",
                    "Effective use of reputation in peer-to-peer environments.",
                    "Keyword fusion to support efficient keyword-based search in peer-to-peer file sharing.",
                    "Understanding Grid resource information management through a synthetic database benchmark/workload.",
                    "Theoretical scalability analysis for heterogeneous clusters.",
                    "Adaptive multi-resource prediction in distributed resource sharing environment.",
                    "Predicting job start times on clusters.",
                    "An interactive Grid for non-invasive vascular reconstruction.",
                    "Molecular structure determination on a computational and data Grid.",
                    "Evolutionary molecular structure determination using Grid-enabled data mining.",
                    "Exploring the combination of computational Grid processing techniques and public health information in relation to modeling the effects of hospital closure proposals.",
                    "Building near real-time P-2-P applications with JXTA.",
                    "Search performance analysis and robust search algorithm in unstructured peer-to-peer networks.",
                    "Multi-dimensional quorum sets for read-few write-many replica control protocols.",
                    "Performance evaluation of the mobile peer-to-peer service.",
                    "Using a DSM application to locally align DNA sequences.",
                    "PAT: a postmortem object access pattern analysis and visualization tool.",
                    "CPAR-Cluster: a runtime system for heterogeneous clusters with mono and multiprocessor nodes.",
                    "Involving memory resource consideration into workload distribution for software DSM systems.",
                    "HLogGP: a new parallel computational model for heterogeneous clusters.",
                    "Privacy-preserving association rule mining in large-scale distributed systems.",
                    "Capability matching of data streams with network services.",
                    "Performance analysis of computational biology applications on hierarchical Grid systems.",
                    "A perspective on the Healthgrid initiative.",
                    "When can an autonomous reputation scheme discourage free-riding in a peer-to-peer system?",
                    "Dynamic offloading in a multi-provider environment: a behavioral framework for use in influencing peering.",
                    "Locks and barriers in checkpointing and recovery.",
                    "Designing high performance DSM systems using InfiniBand features.",
                    "Parallel ray-tracing with a transactional DSM.",
                    "Remote partial file access using compact pattern descriptions.",
                    "Serving queries to multi-resolution datasets on disk-based storage clusters.",
                    "Distributed mining of maximal frequent itemsets from databases on a cluster of workstations.",
                    "Parallel program performance evaluation and their behavior analysis on an OpenMP cluster.",
                    "A distributed shared object model based on a hierarchical consistency protocol for heterogeneous clusters.",
                    "Unifier: unifying cache management and communication buffer management for PVFS over InfiniBand.",
                    "High performance MPI-2 one-sided communication over InfiniBand.",
                    "Hierarchical token based mutual exclusion algorithms.",
                    "With great reliability comes great responsibility: tradeoffs of run-time policy on high reliability systems.",
                    "Fuzzy based resource management framework for high throughput computing.",
                    "Surfer: an extensible pull-based framework for resource selection and ranking.",
                    "A resource manager for optimal resource selection and fault tolerance service in Grids.",
                    "Server directed file domain allocation for noncontiguous file access.",
                    "An efficient replicated data access approach for large-scale distributed systems.",
                    "Cooperation model of a multiagent parallel file system for clusters.",
                    "An analytical throughput model for bulk data transfers over wide area networks.",
                    "Grid coordination by using the Grid coordination protocol.",
                    "Lambda scheduling algorithm for file transfers on high-speed optical circuits.",
                    "The File Mover: an efficient data transfer system for Grid applications.",
                    "Requirements and design of a dynamic Grid networking layer.",
                    "A hardware-secured credential repository for Grid PKIs.",
                    "OGSI.NET: OGSI-compliance on the .NET framework.",
                    "Protection mechanisms for application service hosting platforms.",
                    "Towards a Grid enabled system for multicomponent materials design.",
                    "Routing and resource discovery in Phoenix Grid-enabled message passing library.",
                    "High performance LU factorization for non-dedicated clusters.",
                    "Developing a user-level middleware for out-of-core computation on Grids.",
                    "Policy of file migration at server in cluster file system.",
                    "A multi-path routing service for immersive environments.",
                    "DWDM-RAM: enabling Grid services with dynamic optical networks.",
                    "Distributed virtual computers (DVC): simplifying the development of high performance Grid applications.",
                    "Skeleton based performance prediction on shared networks.",
                    "A resource allocation architecture with support for interactive sessions in utility Grids.",
                    "An simple and efficient fault tolerance mechanism for divide-and-conquer systems.",
                    "Adaptive control system for server groups in enterprise data centers.",
                    "An evaluation of component-based software design approaches.",
                    "Design and implementation of an OGSI-compliant Grid broker service.",
                    "DWDM-RAM: a data intensive Grid service architecture enabled by dynamic optical networks.",
                    "Extended forecast of CPU and network load on computational Grid.",
                    "Hybrid checkpointing for parallel applications in cluster federations.",
                    "Photonic infrastructure for Grid enabled networks.",
                    "Scheduling workflow applications in GrADS.",
                    "Using a Jini based desktop Grid for test vector compaction and a refined economic model."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "3rd CCGRID 2003",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2003",
                "sub_name": "3rd IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2003), 12-15 May 2003, Tokyo, Japan.",
                "count": 95,
                "papers": [
                    "Application-Bypas Broadcast in MPICH over GM.",
                    "Evaluation of MPI Implementations on Grid-connected Clusters using an Emulated WAN Environmen.",
                    "Grid enabled MPI solutions for Clusters.",
                    "MPICH/MADIII: a Cluster of Clusters Enabled MPI Implementation.",
                    "Image Processing or the Grid: A Toolkit or Building Grid-enabled Image Processing Applications.",
                    "A Row-Permutated Data Reorganization Algorithm for Growing Server-less Video-on-Demand Systems.",
                    "Building a Performance Model of Streaming Media Applications in Utility Data Center Environment.",
                    "A Method to Find Uniq e Sequences on Distrib ted Genomic Databases.",
                    "A Parallel FPT Application For Clusters.",
                    "A Synthesis of P rallel Out-of-core Sorting Programs on Heterogeneous Clusters.",
                    "Parallel Multi-Dimensional ROLAP Indexing.",
                    "Discretionary Caching for I/O on Clusters.",
                    "Noncontiguous I/O Accesses Through MPI-IO.",
                    "CARDs: Cluster-Aware Remote Disks.",
                    "Leveraging Non-Uniform Resources for Parallel Query Processing.",
                    "A Performance Oriented Migration Framework For The Grid.",
                    "Scheduling Distributed Applications: the SimGrid Simulation Framework.",
                    "Fair Share on High Performance Computing Systems: What Does Fair Really Mean?",
                    "Distributed Computing with Hierarchical Master-worker Paradigm for Parallel Branch and Bound Algorithm.",
                    "Programming for Dependability in a Service-based Grid.",
                    "Improving Access to Multi-dimensional Self-describing Scientific Dataset.",
                    "Merging the CCA Component Model with the OGSI Framework.",
                    "PortalLab: A Web Services Toolkit for Building Semantic Grid Portals.",
                    "GridFlow: Workflow Management for Grid Computing.",
                    "OmniRPC: a Grid RPC ystem for Parallel Programming in Cluster and Grid Environment.",
                    "A Scalable Infrastructure for Peer-to-Peer Networks Using Web Service Registries and Intelligent Peer Locators.",
                    "Creating Services with Hard Guarantees from Cycle-Harvesting Systems.",
                    "Explore the \"Small World Phenomena\" in Pure P2P Information Sharing Systems.",
                    "Combining Task- and Data Parallelism to Speed up Protein Folding on a Desktop Grid Platform.",
                    "A Slacker Coherence rotocol for Pull-based Monitoring of On-line Data Source.",
                    "Chameleon: A Resource Scheduler in A Data Grid Environment.",
                    "Fault-Tolerant Distributed Mass Storage for LHC Computing.",
                    "Performance Guarantees for Cluster-Based Internet Services.",
                    "Network QoS Management Framework for Server Clusters An End-Host Retrofitting Event-Handler Approachusin Netnice.",
                    "Specifying and Monitoring Guarantees in Commercial Grids through SLA.",
                    "The Performance of Processor Co-Allocation in Multicluster Systems.",
                    "MAGNET: A Tool for Debugging, Analyzing and Adapting Computing Systems.",
                    "Performance Evaluation of RHiNET-2/NI: A Network Interface for Distributed Parallel Computing Systems.",
                    "PM/Ehernet-kRMA: A High Performance Remote Memory Access Facility Using Multiple Gigabit Ethernet Cards.",
                    "A Tree Model for Structured Peer-to-Peer Protocols.",
                    "DKS (N, k, f): A Family of Low Communication, Scalable and Fault-Tolerant Infrastructures for P2P Applications.",
                    "Criticality-based Analysis and Design of Unstructured Peer-to-Peer Networks as \"Complex Systems\".",
                    "Peer-to-Peer Keyword Search Using Keyword Relationship.",
                    "Clustering Hosts in P2P and Global Computing Platforms.",
                    "Evaluation of the inter-cluster data transfer on Grid environment.",
                    "XtremWeb & Condor sharing resources between Internet connected Condor pools.",
                    "Supporting Peer-to-Peer Computing with FlexiNet.",
                    "A Transport Layer A straction for Peer-to-Peer Networks.",
                    "P2P-RPC: Programming Scientific Applications on Peer-to-Peer Systems with Remote Procedure Call.",
                    "Secure Communication in a Distributed System Using Identity Based Encryption.",
                    "Large Scale Dissemination Using a Peer-to-Peer Network.",
                    "Towards a Framework for Collaborative Peer Groups.",
                    "RelayCast: A Middleware for Application-level Multicast Services.",
                    "Improving Performance via Computational Replication on a Large-Scale Computational Grid.",
                    "Performance of Cluster-enabled OpenMP for the SCASH Software Distributed Shared Memory System.",
                    "Distributed Shared Memory Using The .NET Framework.",
                    "Preliminary Evaluation of Dynamic Load Balancing Using Loop Re-partitioning on Omni/SCASH.",
                    "Checkpointing an Recovery of Share Memory Parallel Applications in a Cluster.",
                    "Implementation of Page Management in Mome, a User-Level DSM.",
                    "Kernel Level Speculative DSM.",
                    "The Performance Model of SilkRoad - A Multithreaded DSM System for Clusters.",
                    "A Gaming Framework for a Transactional DSM System.",
                    "An Extended Home-ased Coherence Protocol for Causally Consistent Replicated Read-Write Objects.",
                    "Making a DSM Consistency Protocol Hierarchy-Aware: an Efficient Synchronization Scheme.",
                    "An Exposed Approach to Reliable Multicast in Heterogeneous Logistical Networks.",
                    "Using Topology-Aware Communication Services in Grid Environments.",
                    "Recovering Internet Symmetry in Distributed Computing.",
                    "Multi-class Applications for Parallel Usage of a Guaranteed Rate and a Scavenger Service.",
                    "HMCS-G: Grid-enabled Hybrid Computing System for Computational Astrophysics.",
                    "Grid-based Nonequilibrium Multiple-Time Scale Molecular Dynamics/Brownian Dynamics Simulations of Ligand-Receptor Interactions in Structured Protein Systems.",
                    "Cluster Infrastructure for Biological and Health Related Research.",
                    "Magnetic Resonance Imaging (Mri) Simulation On A Grid Computing Architecture.",
                    "Using grid technologies to face medical image analysis challenges.",
                    "Can the Grid Help to Solve the Data Integration Problems in Molecular Biology?",
                    "An Overlay-Network Approach for Distributed Access to SRS.",
                    "DM2: A Distributed Medical Data Manager for Grids.",
                    "A-peer: An Agent Platform Integrating Peer-to-Peer Network.",
                    "Agile Computing: Bridging the Gap between Grid Computing and Ad-hoc Peer-to-Peer Resource Sharing.",
                    "An Ontology for Scientific Information in a Grid Environment: the Earth System Grid.",
                    "Agent-Based Service Management in Large Datacentres and Grids.",
                    "An Agent Version of a Cluster Server.",
                    "Decentralized Resource Allocation in Application Layer Networks.",
                    "Towards Data-Parallel Skeletons for Grid Computing: An Itinerant Mobile Agent Approach.",
                    "On the Use of Agents in BioInformatics Grid.",
                    "Evaluation of an economy-based file replication strategy for a data grid.",
                    "Communication Paradigms for Mobile Grid Users.",
                    "MONET: service discovery and composition for mathematical problems.",
                    "Fault Tolerance in Scalable Agent Support Systems: Integrating DARX in the AgentScape Framework.",
                    "READ2: Put disks at network level.",
                    "Design and implementation of PVFS-PM: a cluster file system on SCore.",
                    "A Greedy I/O Scheduling Method in the Storage System of Clusters.",
                    "Data Allocation and Load Balancing for Heterogeneous Cluster Storage Systems.",
                    "Performance Analysis of Parallel I/O Scheduling Approaches on Cluster Computing Systems.",
                    "Improved Read Performance in a Cost-Effective, Fault-Tolerant Parallel Virtual File System (CEFT-PVFS).",
                    "Performability Evaluation of Networked Storage Systems Using N-SPEK."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "2nd CCGRID 2002",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2002",
                "sub_name": "2nd IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2002), 22-24 May 2002, Berlin, Germany.",
                "count": 87,
                "papers": [
                    "Jini and the Grid.",
                    "Three Tools to Help with Cluster and Grid Computing: SANS-Effort, PAPI, and NetSolve.",
                    "LDAP and the Grid.",
                    "Cluster Tools.",
                    "The Philosophy of TeraGrid: Building an Open, Extensible, Distributed TeraScale Facility.",
                    "Distributed Computing Technologies and Their Application to Drug Discovery.",
                    "From the \"Higgs Particle\" to Technology, From the Web to the Grid: Fundamental Science, Technology, and International Cooperation.",
                    "Drug Discovery on Cluster Farms.",
                    "Visualization and VR for the Grid.",
                    "A Report from the U.S. National Science Foundation Blue Ribbon Panel on Cyberinfrastructure.",
                    "Grids Deployment at the Crossroads - An Update on the EU-Funded Research Efforts.",
                    "Adaptive Scheduling under Memory Pressure on Multiprogrammed Cluster.",
                    "User-Centric Performance Analysis of Market-Based Cluster Batch Schedulers.",
                    "On Advantages of Grid Computing for Parallel Job Scheduling.",
                    "Representing Dynamic Performance Information in Grid Environments with the Network Weather Service.",
                    "Neptune: A Dynamic Resource Allocation and Planning System for a Cluster Computing Utility.",
                    "Tracing a Large-Scale Peer to Peer System: An Hour in the Life of Gnutella.",
                    "RVision: An Open and High Configurable Tool for Cluster Monitoring.",
                    "Implementing Data Cube Construction using a Cluster Middleware: Algorithms, Implementation Experience, and Performance Evaluation.",
                    "On the Migration of the Scientific Code Dyana from SMPs to Clusters of PCs and on to the Grid.",
                    "Grid Datafarm Architecture for Petascale Data Intensive Computing.",
                    "A Grid Application for an Evaluation of Brain Function using Independent Component Analysis (ICA).",
                    "Using TOP-C and AMPIC to Port Large Parallel Applications to the Computational Grid.",
                    "The gSOAP Toolkit for Web Services and Peer-to-Peer Computing Networks.",
                    "Symphony - A Java-Based Composition and Manipulation Framework for Computational Grids.",
                    "PadicoTM: An Open Integration Framework for Communication Middleware and Runtimes.",
                    "Multiple Query Optimization for Data Analysis Applications on Clusters of SMPs.",
                    "MS-I/O: A Distributed Multi-Storage I/O System.",
                    "The Cluster File System: Integration of High Performance Communication and I/O in Clusters.",
                    "Sensitivity of Cluster File System Access to I/O Server Selection.",
                    "The Internet Backplane Protocol: A Study in Resource Sharing.",
                    "A Formal Framework for Defining Grid Systems.",
                    "Virtual Private Grid: A Command Shell for Utilizing Hundreds of Machines Efficiently.",
                    "Agents for the Grid: A Comparison with Web Services (Part I: Transport Layer).",
                    "A Malleable-Job System for Timeshared Parallel Machines.",
                    "Efficient Utilization of Memory Mapped NICs onto Clusters using Pipelined Schedules.",
                    "SMiLE: An Integrated, Multi-Paradigm Software Infrastructure for SCI-Based Clusters.",
                    "M-JavaMPI: A Java-MPI Binding with Process Migration Support.",
                    "MAPFS_MAS: A Model of Interaction among Information Retrieval Agents.",
                    "Scheduling Co-Reservations with Priorities in Grid Computing Systems.",
                    "Study of Load Balancing Issues Based on Intra-Movie Skewness for Parallel Video Servers.",
                    "Brain Activity Detection in Functional Magnetic Resonance Imaging on Heterogeneous Cluster.",
                    "Exploiting Web Technologies for Grid Architecture.",
                    "A Novel Architecture for Grid Information Systems.",
                    "Load Balancing by Remote Execution of Short Processes on Linux Clusters.",
                    "The Virtual Laboratory: A Toolset for Utilising the World-Wide Grid to Design Drug.",
                    "Nomadic Migration: Fault Tolerance in a Disruptive Grid Environment.",
                    "PVM Emulation in the Harness Metacomputing Framework - Design and Performance Evaluation.",
                    "Accounting and Accountability for Distributed and Grid Systems.",
                    "Scalable Algorithms for Complete Exchange on Multi-Cluster Networks.",
                    "Grid Computing, A Vendor's Vision.",
                    "The Emerging Information Power Grid: From Distributed P2P Computing to e-Utilities.",
                    "GridDemo: International Workshop on Live Demonstrations of Grid Technologies and Applications.",
                    "Towards Compliant Distributed Shared Memory.",
                    "The Virtual Shared Memory Performance of a Parallel Graph Reduce.",
                    "Overcoming the Problems Associated with the Existence of Too Many DSM APIs.",
                    "Process Migration Based on Gobelins Distributed Shared Memory.",
                    "Optimistic Synchronization and Transactional Consistency.",
                    "Towards an Economy-Based Optimisation of File Access and Replication on a Data Grid.",
                    "Scalability Analysis of the Contract Net Protocol.",
                    "Monitoring and Controlling Distributed Applications with Relocatable Objects.",
                    "Agent-Based Resource Management for Grid Computing.",
                    "Using Mobile Agents for Software Distribution and Maintenance: Autonomous Stations Capable of Securely Executing Dynamically Uploaded Applications.",
                    "Agents Based Load Balancing with Component Distribution Capability.",
                    "Self-Organizing Control in Plantetary-Scale Computing.",
                    "A Framework for Classifying Peer-to-Peer Technologies.",
                    "Improving Data Availability through Dynamic Model-Driven Replication in Large Peer-to-Peer Communities.",
                    "NEVRLATE: Scalable Resource Discovery.",
                    "Maintaining Connectivity in a Scalable and Robust Distributed Environment.",
                    "JM: A Jini Framework for Global Computing.",
                    "Motivating Computational Grids.",
                    "Latency Performance of SOAP Implementations.",
                    "Experiments of Network Throughput Measurement and Forecasting Using the Network Weather.",
                    "End-Host Multicast Communication Using Switch-Trees Protocols.",
                    "evolution@home: Experiences with Work Units That Span More than 7 Orders of Magnitude in Computational Complexity.",
                    "Java Coglets.",
                    "Bayanihan Computing .NET: Grid Computing with XML Web Services.",
                    "Negotiating Agents in a Market-Oriented Grid.",
                    "Handling Multimedia Objects in Peer-to-Peer Networks.",
                    "Developing Distributed Data Mining Implementations for a Grid Environment.",
                    "CatNet: Catallactic Mechanisms for Service Control and Resource Allocation in Large-Scale Application-Layer Networks.",
                    "A Study of Discovery Mechanisms for Peer-to-Peer Applications.",
                    "Logistical Networking: When Institutions Peer.",
                    "Towards Trust-Aware Resource Management in Grid Computing Systems.",
                    "IPSec and DNSSEC to Support GRID Application Security.",
                    "Invisible Network: Concepts and Architecture.",
                    "The iDorm - A Practical Deployment of Grid Technology."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "1st CCGRID 2001",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ccgrid/2001",
                "sub_name": "First IEEE International Symposium on Cluster Computing and the Grid (CCGrid 2001), May 15-18, 2001, Brisbane, Australia.",
                "count": 99,
                "papers": [
                    "The Globus Toolkit for Grid Computing.",
                    "An Introduction to OpenMP.",
                    "The Anatomy of the Grid: Enabling Scalable Virtual Organizations.",
                    "Making Parallel Processing on Clusters Efficient, Transparent and Easy for Programmers.",
                    "Programming High Performance Applications in Grid Environments.",
                    "Global Internet Content Delivery.",
                    "Grid RPC meets Data Grid: Network Enabled Services for Data Farming on the Grid.",
                    "The Promise of InfiniBand for Cluster Computing.",
                    "The World Wide Computer: Prospects for Parallel and Distributed Computing on the Web.",
                    "Terraforming Cyberspace.",
                    "High Performance Computing at Intel: The OSCAR Software Solution Stack for Cluster Computing.",
                    "MPI/FTTM: Architecture and Taxonomies for Fault-Tolerant, Message-Passing Middleware for Performance-Portable Parallel Computing.",
                    "Effective Internet Grid Computing for Industrial Users.",
                    "Sun Grid Engine: Towards Creating a Compute Power Grid.",
                    "Design of a Generic Platform for Efficient and Scalable Cluster Computing based on Middleware Technology.",
                    "Declarative Flow Control for Distributed Instrumentation.",
                    "Optimizing Execution of Component-based Applications using Group Instances.",
                    "Containers: A Sound Basis For a True Single System Image.",
                    "View-Based Consistency and Its Implementation.",
                    "Coupling DSM-Based Parallel Applications.",
                    "QoS-Aware Discovery of Wide-Area Distributed Services.",
                    "Effective Metacomputing using LSF MultiCluster.",
                    "Replica Selection in the Globus Data Grid.",
                    "User Preference Driven Multiobjective Resource Management in Grid Environments.",
                    "Data Staging Effects in Wide Area Task Farming Applications.",
                    "Early Experiences with the EGrid Testbed.",
                    "Document Distribution Algorithm for Load Balancing on an Extensible Web Server Architecture.",
                    "KelpIO: A Telescope-Ready Domain-Specific I/O Library for Irregular Block-Structured Applications.",
                    "Cluster Computers and Grid Processing in the First Radio-Telescope of a New Generation.",
                    "A Cluster Architecture for Parallel Data Warehousing.",
                    "Managable Storage via Adaptation in WiND.",
                    "Parallel Processing of \"GroupBy-Before-Join\" Queries in Cluster Architecture.",
                    "Parallel I/O Support for HPF on Clusters.",
                    "Armada: A Parallel File System for Computational Grids.",
                    "Software Environments For Cluster-Based Display Systems.",
                    "OVM: Out-of-Order Execution Parallel Virtual Machine.",
                    "A New Software Architecture for the BIP/Myrinet Firmware.",
                    "An Adaptive, Reconfigurable Interconnect for Computational Clusters.",
                    "xBSP: An Efficient BSP Implementation for clan.",
                    "Implementing Virtual Interface Architecture on top of the GM Message Passing Interface.",
                    "TACO-Exploiting Cluster Networks for High-Level Collective Operations.",
                    "OPIOM: Off-Processor IO with Myrinet.",
                    "Gekko: A Metalevel for Adaptation in Nexus.",
                    "Supporting Disconnectedness-Transparent Information Delivery for Mobile and Invisible Computing.",
                    "Evaluating the Performance of CORBA for Distributed and Grid Computing Applications.",
                    "The Characteristics of Workload on ASCI Blue-Pacific at Lawrence Livermore National Laboratory.",
                    "Lessons Learned While Operating Two Large SCI Clusters.",
                    "Performance Evaluation of an Agent-Based Resource Management Infrastructure for Grid Computing.",
                    "Evaluation of Strategies to Reduce the Impact of Machine Reclaim in Cycle-Stealing Environments.",
                    "Scheduling Aspects for Image Retrieval in Cluster-Based Image Databases.",
                    "Sabotage-Tolerance Mechanisms for Volunteer Computing Systems.",
                    "Latency Hiding in Dynamic Partitioning and Load Balancing of Grid Computing Applications.",
                    "Developing a Cost/Benefit Estimating Service for Dynamic Resource Sharing in Heterogeneous Clusters: Experience with SNL Clusters.",
                    "Preferential Load Balancing for Distributed Internet Servers.",
                    "A Group-Based Load Balance Scheme for Software Distributed Shared Memory Systems.",
                    "Using Consensus for Solving Conflict Situations in Fault-Tolerant Distributed Systems.",
                    "M3C: Managing and Monitoring Multiple Clusters.",
                    "Efficient Tracing for On-the-Fly Space-Time Displays in a Debugger for Message Passing Programs.",
                    "NwsAlarm: A Tool for Accurately Detecting Resource Performance Degradation.",
                    "XML-Based Visual Specification of Multidisciplinary Applications.",
                    "A Preliminary Topological Debugger for MPI Programs.",
                    "Simgrid: A Toolkit for the Simulation of Application Scheduling.",
                    "Reflections on Qualitative Attributes of Mobile Agents for Computational, Data, and Service Grids.",
                    "On the Use of Mobile Code Technology for Monitoring Grid System.",
                    "Modelling and Simulation of Aggregation Nets.",
                    "Enhancing a Multi-Agent System's Performance: From Implementation to Simulation Analysis.",
                    "While You're Away: A System for Load-Balancing and Resource Sharing Based on Mobile Agents.",
                    "Cluster Computing in the Classroom: Topics, Guidelines, and Experiences.",
                    "Teaching Distributed and Parallel Computing with Java and CSP.",
                    "A Distributed Shared Memory Programming Course.",
                    "ORESPICS: A Friendly Environment to Learn Cluster Programming.",
                    "Teamster: A Transparent Distributed Shared Memory for Cluster Symmetric Multiprocessors.",
                    "A Two-Level Checkpoint Algorithm in a Highly-Available Parallel Single Level Store System.",
                    "Adaptive Prefetching Technique for Shared Virtual Memory.",
                    "An Efficient Lock Protocol for Home-Based Lazy Release Consistency.",
                    "Parallel Pull-Based LRU: A Request Distribution Algorithm for Clustered Web Caches Using a DSM for Memory Mapped Networks.",
                    "Mosaic: A Non-Intrusive Complete Garbage Collector for DSM System.",
                    "A DSM Cluster Architecture Supporting Aggressive Computation in Active Networks.",
                    "Distributed and Parallel Execution of Java Programs on a DSM System.",
                    "A Market-Based Protocol with Leasing Support for Globally Distributed Computing.",
                    "A WOSTM-Based Solution for High Performance Computing.",
                    "Compute Power Market: Towards a Market-Oriented Grid.",
                    "XtremWeb: A Generic Global Computing System.",
                    "XPulsaratsignhome - Schools help Scientists.",
                    "Charging Distributed Services of a Computational Grid Architecture.",
                    "A Relative Bandwidth Differentiated Service for TCP Micro-Flows.",
                    "Markovian Model of RED Mechanism.",
                    "Group Communication in Differentiated Services Networks.",
                    "Universal Network of Small Wireless Operators (UNSWo).",
                    "Automating the Construction of Replicated Objects in a Cluster of Workstations.",
                    "On Component-Based Communication Systems for Clusters of Workstation.",
                    "A CORBA-Based Architecture for Parallel Applications: Experimentations with the WZ Matrix Factorization.",
                    "A Benefit Function Mapping Heuristic for a Class of Meta-Tasks in Grid Environments.",
                    "Divisible Load Scheduling on a Hypercube Cluster with Finite-Size Buffers and Granularity Constraints.",
                    "A Protocol for Load Sharing among a Cluster of Heterogeneous Unix Workstations.",
                    "A Bayesian RunTime Load Manager on a Shared Cluster.",
                    "A General Scheduling Framework for Parallel Execution Environments.",
                    "Cooperative Scheduling for Multimedia Services and Computation Intensive Applications for Cluster Server.",
                    "A Fuzzy Approach to Load Balancing in a Distributed Object Computing Network."
                ]
            }
        ]
    }
]