[
    {
        "year": "2021",
        "name": "18th Conference On Computing Frontiers 2021",
        "info": "Virtual Event, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2021",
                "sub_name": "CF '21: Computing Frontiers Conference, Virtual Event, Italy, May 11-13, 2021.",
                "count": 37,
                "papers": [
                    "Quantum computing: a scalable, systems approach.",
                    "Leveraging ML to handle the increasing complexity of the cloud.",
                    "Ultra-compact binary neural networks for human activity recognition on RISC-V processors.",
                    "A comparative survey of open-source application-class RISC-V processor implementations.",
                    "Dynamic row activation mechanism for multi-core systems.",
                    "TEA-fed: time-efficient asynchronous federated learning for edge computing.",
                    "Intelligent UAV-aided controller placement scheme for software-defined vehicular networks.",
                    "An online guided tuning approach to run CNN pipelines on edge devices.",
                    "Performance prediction for convolutional neural networks on edge GPUs.",
                    "DFShards: effective construction of MRCs online for non-stack algorithms.",
                    "Exploring the potential of context-aware dynamic CPU undervolting.",
                    "Diolkos: improving ethernet throughput through dynamic port selection.",
                    "A methodology and framework for software memoization of functions.",
                    "Online model swapping for architectural simulation.",
                    "Design space for scaling-in general purpose computing within the DDR DRAM hierarchy for map-reduce workloads.",
                    "On the role of system software in energy management of neuromorphic computing.",
                    "Reducing quantum annealing biases for solving the graph partitioning problem.",
                    "A golden age for computing frontiers, a dark age for computing education?",
                    "Scaling of multi-core quantum architectures: a communications-aware structured gap analysis.",
                    "Near real-time intrusion alert aggregation using concept-based learning.",
                    "ShuffleFL: gradient-preserving federated learning using trusted execution environment.",
                    "An efficient fault tolerant cloud market mechanism for profit maximization.",
                    "The Italian research on HPC key technologies across EuroHPC.",
                    "When wearable technology meets computing in future networks: a road ahead.",
                    "Architecting more than Moore: wireless plasticity for massive heterogeneous computer architectures (WiPLASH).",
                    "cREAtIve: reconfigurable embedded artificial intelligence.",
                    "EVOLVE: HPC and cloud enhanced testbed for extracting value from large-scale diverse data.",
                    "Evolving 5G: ANIARA, an edge-cloud perspective.",
                    "Scalable topological data analysis for life science applications.",
                    "Graph analytics in the exascale era.",
                    "Interactive data science at scale.",
                    "AvesTerra: a framework for global-scale knowledge representation and analytic interoperability.",
                    "Parallel graph algorithms by blocks: from I/O to algorithms.",
                    "Tapeout of a RISC-V crypto chip with hardware trojans: a case-study on trojan design and pre-silicon detectability.",
                    "A threat model method for ICS malware: the TRISIS case.",
                    "On resilience of security-oriented error detecting architectures against power attacks: a theoretical analysis.",
                    "Fault injection attacks on SoftMax function in deep neural networks."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th Conference On Computing Frontiers 2020",
        "info": "Catania, Sicily, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2020",
                "sub_name": "Proceedings of the 17th ACM International Conference on Computing Frontiers, CF 2020, Catania, Sicily, Italy, May 11-13, 2020.",
                "count": 39,
                "papers": [
                    "Approximate trivial instructions.",
                    "Combining learning and optimization for transprecision computing.",
                    "Approximating trigonometric functions for posits using the CORDIC method.",
                    "Scale-out beam longitudinal dynamics simulations.",
                    "A runtime system for finite element methods in a partitioned global address space.",
                    "Contention-aware application performance prediction for disaggregated memory systems.",
                    "Verified instruction-level energy consumption measurement for NVIDIA GPUs.",
                    "Application-specific network-on-chip design space exploration framework for neuromorphic processor.",
                    "Design of an open-source bridge between non-coherent burst-based and coherent cache-line-based memory systems.",
                    "Efficient architecture design for the AES-128 algorithm on embedded systems.",
                    "Time-sliced quantum circuit partitioning for modular architectures.",
                    "Approximate approximation on a quantum annealer.",
                    "Automaton-based methodology for implementing optimization constraints for quantum annealing.",
                    "Compressed quadratization of higher order binary optimization problems.",
                    "Constant weight strings in constant time: a building block for code-based post-quantum cryptosystems.",
                    "Terminator: a data-level hybrid framework for intellectual property theft detection and prevention.",
                    "Building a portable deeply-nested implicit information flow tracking.",
                    "RCecker: a lightweight rule-based mechanism for backward control-flow integrity.",
                    "Byzantine fault tolerance for centrally coordinated missions with unmanned vehicles.",
                    "An efficient object detection framework with modified dense connections for small objects optimizations.",
                    "Deffe: a data-efficient framework for performance characterization in domain-specific computing.",
                    "Direction-optimizing label propagation and its application to community detection.",
                    "Outlier detection based on sparse coding and neighbor entropy in high-dimensional space.",
                    "HiLSM: an LSM-based key-value store for hybrid NVM-SSD storage systems.",
                    "Enabling mixed-precision quantized neural networks in extreme-edge devices.",
                    "High-level synthesis of throughput-optimized and energy-efficient approximate designs.",
                    "Freeway: an order-less user-space framework for non-real-time applications.",
                    "Management of container-based genetic algorithm workloads over cloud infrastructure.",
                    "StoneCutter: a very high level instruction set design language.",
                    "An evolutionary framework for automatic and guided discovery of algorithms.",
                    "Software stack for an analog mesh computer: the case of a nanophotonic PDE accelerator.",
                    "Analysis of control and sensing interfaces in a photonic integrated chip solution for quantum computing.",
                    "Quantum splines for non-linear approximations.",
                    "SoundFactory: a framework for generating datasets for deep learning SELD algorithms.",
                    "Similarity-aware popularity-based caching in wireless edge computing.",
                    "SCoEmbeddings: encoding sentiment information into contextualized embeddings for sentiment analysis.",
                    "Adaptive entropy coding method for stream-based lossless data compression.",
                    "A comprehensive analysis of constant-time polynomial inversion for post-quantum cryptosystems.",
                    "A critical view on moving target defense and its analogies."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th Conference On Computing Frontiers 2019",
        "info": "Alghero, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2019",
                "sub_name": "Proceedings of the 16th ACM International Conference on Computing Frontiers, CF 2019, Alghero, Italy, April 30 - May 2, 2019.",
                "count": 70,
                "papers": [
                    "High performance, power efficient hardware accelerators: emerging devices, circuits and architecture co-design.",
                    "Artificial intelligent sensors at the core of cyber-physical-systems: from theory to practical applications.",
                    "nGraph-HE: a graph compiler for deep learning on homomorphically encrypted data.",
                    "Iterative machine learning (IterML) for effective parameter pruning and tuning in accelerators.",
                    "The parameter optimization based on LVPSO algorithm for detecting multi-step attacks.",
                    "CacheGuard: a security-enhanced directory architecture against continuous attacks.",
                    "Towards realistic battery-DoS protection of implantable medical devices.",
                    "SPADA: a statistical program attack detection analysis.",
                    "On the maximum function in stochastic computing.",
                    "A case for superconducting accelerators.",
                    "Solving large minimum vertex cover problems on a quantum annealer.",
                    "Quantum computing simulator on a heterogenous HPC system.",
                    "Approximate loop unrolling.",
                    "TIGER: topology-aware task assignment approach using ising machines.",
                    "Accelerating parallel graph computing with speculation.",
                    "Parallel edge-based sampling for static and dynamic graphs.",
                    "An adaptive concurrent priority queue for NUMA architectures.",
                    "A new memory reliability technique for multiple bit upsets mitigation.",
                    "Ghost loads: what is the cost of invisible speculation?",
                    "ISA mapper: a compute and hardware agnostic deep learning compiler.",
                    "Capturing source code semantics via tree-based convolution over API-enhanced AST.",
                    "NeuPow: artificial neural networks for power and behavioral modeling of arithmetic components in 45nm ASICs technology.",
                    "NPUFort: a secure architecture of DNN accelerator against model inversion attack.",
                    "Sentiment evaluation of forex news.",
                    "Spatially fine-grained air quality prediction based on DBU-LSTM.",
                    "Performance statistics and learning based detection of exploitative speculative attacks.",
                    "Assessing transferability of adversarial examples against malware detection classifiers.",
                    "Anytime instructions for programmable accuracy floating-point arithmetic.",
                    "Quantum encoded quantum evolutionary algorithm for the design of quantum circuits.",
                    "On the limitations of the chimera graph topology in using analog quantum computers.",
                    "Realizing parallelism in quantum MISD architecture.",
                    "Embedding principal component analysis for data reduction in structural health monitoring on low-cost IoT gateways.",
                    "Personal volunteer computing.",
                    "User-centered context-aware CPU/GPU power management for interactive applications on smartphones.",
                    "Designing a secure DRAM+NVM hybrid memory module.",
                    "Analyzing the suitability of contemporary 3D-stacked PIM architectures for HPC scientific applications.",
                    "MP net as abstract model of communication for message-passing applications.",
                    "A comparative study of parallel programming frameworks for distributed GPU applications.",
                    "Simulation with skeletons of applications using dimemas.",
                    "Abstracting parallel program specification: a case study on k-means clustering.",
                    "IMD security vs. energy: are we tilting at windmills?: POSTER.",
                    "Will sentiment of forex news effect forecast of the RMB exchange rate?: POSTER.",
                    "Run-time performance monitoring of hardware accelerators: POSTER.",
                    "Fixed point exploitation via compiler analyses and transformations: POSTER.",
                    "Accelerating tile low-rank GEMM on sunway architecture: POSTER.",
                    "An hybrid approach to accelerate a molecular docking application for virtual screening in heterogeneous nodes: POSTER.",
                    "Go green radio astronomy: Approximate Computing Perspective: Opportunities and Challenges: POSTER.",
                    "The german informatics society's new ethical guidelines: POSTER.",
                    "Using community detection for spatial networks: POSTER.",
                    "Next-generation arithmetic: major performance gains with minimal disruption.",
                    "Toward a graph-based dependence analysis framework for high level design verification.",
                    "Extending classical processors to support future large scale quantum accelerators.",
                    "Scaling up performance of fat nodes for HPC.",
                    "European processor initiative: the industrial cornerstone of EuroHPC for exascale era.",
                    "CERBERO: Cross-layer modEl-based fRamework for multi-oBjective dEsign of reconfigurable systems in unceRtain hybRid envirOnments: Invited paper: CERBERO teams from UniSS, UniCA, IBM Research, TASE, INSA-Rennes, UPM, USI, Abinsula, AmbieSense, TNO, S&T, CRF.",
                    "Optimization and deployment of CNNs at the edge: the ALOHA experience.",
                    "The FitOptiVis ECSEL project: highly efficient distributed embedded image/video processing in cyber-physical systems.",
                    "Towards resilient EU HPC systems: a blueprint.",
                    "Parallel algorithms through approximation: graphs, data privacy and machine learning.",
                    "PGAS for graph analytics: can one sided communications break the scalability barrier?",
                    "Analysing the tor web with high performance graph algorithms.",
                    "Data and model convergence: a case for software defined architectures.",
                    "Evaluation of variable bit-width units in a RISC-V processor for approximate computing.",
                    "A runtime-adaptive cognitive IoT node for healthcare monitoring.",
                    "Energy-efficient approximate least squares accelerator: a case study of radio astronomy calibration processing.",
                    "Exploration of task-based scheduling for convolutional neural networks accelerators under memory constraints.",
                    "Examining the practical side channel resilience of ARX-boxes.",
                    "A privacy-preserving protocol for indoor wi-fi localization.",
                    "A secure and authenticated host-to-memory communication interface.",
                    "Highway to HAL: open-sourcing the first extendable gate-level netlist reverse engineering framework."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th Conference On Computing Frontiers 2018",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2018",
                "sub_name": "Proceedings of the 15th ACM International Conference on Computing Frontiers, CF 2018, Ischia, Italy, May 08-10, 2018.",
                "count": 62,
                "papers": [
                    "Low-power appliances for big-data analytics using flash storage and hardware accelerators.",
                    "Programmability versus performance tradeoff: overcoming the hardware challenges from a task-based approach.",
                    "FreeDA: deploying incompatible stock dynamic analyses in production via multi-version execution.",
                    "Disease gene identification by walking on multilayer heterogeneous networks.",
                    "Similarity based classification of ADHD using singular value decomposition.",
                    "MOCL: an efficient openCL implementation for the matrix-2000 architecture.",
                    "QUENN: QUantization engine for low-power neural networks.",
                    "Evaluating the impact of pushing voice-driven interaction pipelines to the edge.",
                    "Adaptive and polymorphic VLIW processor to optimize fault tolerance, energy consumption, and performance.",
                    "MIComp: 3D on-chip magneto-inductive computing with simultaneous wireless information and power transfer.",
                    "An FPGA framework for edge-centric graph processing.",
                    "A prefetch-aware memory system for data access patterns in multimedia applications.",
                    "Flexible associativity for DRAM caches.",
                    "A file system bypassing volatile main memory: towards a single-level persistent store.",
                    "A methodology for efficient code optimizations and memory management.",
                    "Design space exploration for PIM architectures in 3D-stacked memories.",
                    "CMH: compression management for improving capacity in the hybrid memory cube.",
                    "Opportunistic named functions in disruption-tolerant emergency networks.",
                    "GANFuzz: a GAN-based industrial network protocol fuzzing framework.",
                    "Taming irregular applications via advanced dynamic parallelism on GPUs.",
                    "Modeling SSD RAID reliability under general settings.",
                    "On the theory of speculative checkpointing: time and energy considerations.",
                    "Comparative analysis of soft-error detection strategies: a case study with iterative methods.",
                    "Vulnerability analysis of Android auto infotainment apps.",
                    "VPsec: countering fault attacks in general purpose microprocessors with value prediction.",
                    "Comparative realization of error detection schemes for implementations of mixcolumns in lightweight cryptography.",
                    "Reliable hardware architectures for efficient secure hash functions ECHO and fugue.",
                    "Gathering and analyzing identity leaks for a proactive warning of affected users.",
                    "Comprehensive assessment of run-time hardware-supported malware detection using general and ensemble learning.",
                    "Network-on-chip evaluation for a novel neural architecture.",
                    "D3NoC: a dynamic data-driven hybrid photonic plasmonic NoC.",
                    "Dual-threshold directed execution progress maximization for nonvolatile processors.",
                    "An area and power efficient on-the-fly LBCS transformation for implantable neuronal signal acquisition systems.",
                    "Automatic instrumentation of dataflow applications using PAPI.",
                    "Make software harder.",
                    "GPU power prediction via ensemble machine learning for DVFS space exploration.",
                    "A decoupled access-execute architecture for reconfigurable accelerators.",
                    "APAT: an access pattern analysis tool for distributed arrays.",
                    "Horizon: a multi-abstraction framework for graph analytics.",
                    "Online anomaly detection framework for spark systems via stage-task behavior modeling.",
                    "GraphBLAS: handling performance concerns in large graph analytics.",
                    "Streaming graph analysis: new models, new architectures.",
                    "A hybrid data model for large-scale analytics.",
                    "Autotuning and adaptivity in energy efficient HPC systems: the ANTAREX toolbox.",
                    "LEGaTO: towards energy-efficient, secure, fault-tolerant toolset for heterogeneous computing.",
                    "HPC4AI: an AI-on-demand federated platform endeavour.",
                    "The SAGE project: a storage centric approach for exascale computing: invited paper.",
                    "Data cube and cloud resources as platform for seamless geospatial computation.",
                    "Improving public datasets markings' quality using unsupervised refinement kernels.",
                    "The D.A.V.I.D.E. big-data-powered fine-grain power and performance monitoring support.",
                    "Power modeling on FPGA: a neural model for RT-level power estimation.",
                    "Always-ON visual node with a hardware-software event-based binarized neural network inference engine.",
                    "A constrained extremum-seeking control for CPU thermal management.",
                    "Thermal image-based CNN's for ultra-low power people recognition.",
                    "Hash-based signatures for the internet of things: position paper.",
                    "Higher order side-channel attack resilient S-boxes.",
                    "Digital signatures and signcryption schemes on embedded devices: a trade-off between computation and storage.",
                    "Machine learning application for patients activity recognition with pressure sensing in bed.",
                    "Learning-based indoor localization for industrial applications.",
                    "Supporting sensor orchestration in non-stationary environments.",
                    "Forest fire detection using spiking neural networks.",
                    "Distributed learning-based state prediction for multi-agent systems with reduced communication effort."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th Conference On Computing Frontiers 2017",
        "info": "Siena, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2017",
                "sub_name": "Proceedings of the Computing Frontiers Conference, CF'17, Siena, Italy, May 15-17, 2017.",
                "count": 66,
                "papers": [
                    "Runtime Aware Architectures.",
                    "The Future of Deep Learning: Challenges & Solutions.",
                    "Stream Drive: A Dynamic Dataflow Framework For Clustered Embedded Architectures.",
                    "Quality Optimization of Resilient Applications under Temperature Constraints.",
                    "DYCE: A Resilient Shared Memory Paradigm for Heterogenous Distributed Systems without Memory Coherence.",
                    "RAGuard: A Hardware Based Mechanism for Backward-Edge Control-Flow Integrity.",
                    "SGXKernel: A Library Operating System Optimized for Intel SGX.",
                    "Data mining the memory access stream to detect anomalous application behavior.",
                    "Boda: A Holistic Approach for Implementing Neural Network Computations.",
                    "Finding Maximum Cliques on a Quantum Annealer.",
                    "An Ensemble Model for Diabetes Diagnosis in Large-scale and Imbalanced Dataset.",
                    "Self-Sustainability in Nano Unmanned Aerial Vehicles: A Blimp Case Study.",
                    "Data Analytics with NVLink: An SpMV Case Study.",
                    "An Enhanced Image Reconstruction Tool for Computed Tomography on CPUs.",
                    "GPU-UniCache: Automatic Code Generation of Spatial Blocking for Stencils on CPUs.",
                    "High Performance Coordinate Descent Matrix Factorization for Recommender Systems.",
                    "Vectorization of Hybrid Breadth First Search on the Intel Xeon Phi.",
                    "Recommending Resources to Cloud Applications based on Custom Templates Composition.",
                    "Advanced Manufacturing Collaboration in a Cloud-based App Marketplace.",
                    "Understanding the I/O Behavior of Desktop Applications in Virtualization.",
                    "Work Stealing in a Shared Virtual-Memory Heterogeneous Environment: A Case Study with Betweenness Centrality.",
                    "Designing Scalable Distributed Memory Models: A Case Study.",
                    "Trading Fault Tolerance for Performance in AN Encoding.",
                    "ExanaDBT: A Dynamic Compilation System for Transparent Polyhedral Optimizations at Runtime.",
                    "Task-parallel Runtime System Optimization Using Static Compiler Analysis.",
                    "Exploring the Performance Limits of Out-of-order Commit.",
                    "Optimizing memory affinity with a hybrid compiler/OS approach.",
                    "BC-AMAT: Considering Blocked Time in Memory System Measurement.",
                    "Optimal On-Line Computation of Stack Distances for MIN and OPT.",
                    "Analytical Performance Modeling and Validation of Intel's Xeon Phi Architecture.",
                    "Using Personality Metrics to Improve Cache Interference Management in Multicore Processors.",
                    "Selective off-loading to Memory: Task Partitioning and Mapping for PIM-enabled Heterogeneous Systems.",
                    "Large-Scale Plant Classification with Deep Neural Networks.",
                    "Software-defined networks in large-scale radio telescopes.",
                    "Evolution of Friendship: a case study of MobiClique.",
                    "A Large-Scale Malleable Tsunami Simulation Realized on an Elastic MPI Infrastructure.",
                    "Peak load optimization through 2-dimensional packing and multi-processor real-time scheduling.",
                    "Cloud Workload Prediction by Means of Simulations.",
                    "Hardware Support for Secure Stream Processing in Cloud Environments.",
                    "Let's Go: a Data-Driven Multi-Threading Support.",
                    "Brain-Inspired Memory Architecture for Sparse Nonlocal and Unstructured Workloads.",
                    "CAROL-FI: an Efficient Fault-Injection Tool for Vulnerability Evaluation of Modern HPC Parallel Accelerators.",
                    "BONSEYES: Platform for Open Development of Systems of Artificial Intelligence: Invited paper.",
                    "Designing Swarms of Cyber-Physical Systems: the H2020 CPSwarm Project: Invited Paper.",
                    "HELICoiD: interdisciplinary and collaborative project for real-time brain cancer detection: Invited Paper.",
                    "Social Engineering 2.0: A Foundational Work: Invited Paper.",
                    "Center for High-Performance Reconfigurable Computing (CHREC): A Ten-Year Odyssey.",
                    "Designing and Programming the Configurable Cloud.",
                    "ARM HPC Ecosystem and the Reemergence of Vectors: Invited Paper.",
                    "Extending the comfort zone: DAVIDE.",
                    "AXIOM project: from applied research towards embedded systems.",
                    "Towards Big Data Visualization for Monitoring and Diagnostics of High Volume Semiconductor Manufacturing.",
                    "Big Data Analytics on Large-Scale Scientific Datasets in the INDIGO-DataCloud Project.",
                    "Sorting big data on heterogeneous near-data processing systems.",
                    "Finding the Critical Sampling of Big Datasets.",
                    "An Empirical Comparison of Stream Clustering Algorithms.",
                    "Addressing Hadoop's Small File Problem With an Appendable Archive File Format.",
                    "Improving Error Resilience Analysis Methodology of Iterative Workloads for Approximate Computing.",
                    "Instruction level energy model for the Adapteva Epiphany multi-core processor.",
                    "On Learning the Energy Model of an MPSoC for Convex Optimization.",
                    "DCT Learning-Based Hardware Design for Neural Signal Acquisition Systems.",
                    "Private inter-network routing for Wireless Sensor Networks and the Internet of Things.",
                    "Using Tweaks To Design Fault Resistant Ciphers (Full Version).",
                    "Design of S-boxes Defined with Cellular Automata Rules.",
                    "DPA on hardware implementations of Ascon and Keyak.",
                    "Do we need a holistic approach for the design of secure IoT systems?"
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th Conference On Computing Frontiers 2016",
        "info": "Como, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2016",
                "sub_name": "Proceedings of the ACM International Conference on Computing Frontiers, CF'16, Como, Italy, May 16-19, 2016.",
                "count": 68,
                "papers": [
                    "Sub-PicoJoule per operation scalable computing: why, when, how?",
                    "Big data analytics and the LHC.",
                    "Breadth first search vectorization on the Intel Xeon Phi.",
                    "Scalable 2D K-SVD parallel algorithm for dictionary learning on GPUs.",
                    "Accelerating graph applications on integrated GPU platforms via instrumentation-driven optimizations.",
                    "Scalable betweenness centrality on multi-GPU systems.",
                    "Area-energy tradeoffs of logic wear-leveling for BTI-induced aging.",
                    "SIMD-based soft error detection.",
                    "Techniques for modulating error resilience in emerging multi-value technologies.",
                    "Accelerating the mining of influential nodes in complex networks through community detection.",
                    "Graph programming interface (GPI): a linear algebra programming model for large scale graph computations.",
                    "Automated compiler optimization of multiple vector loads/stores.",
                    "Libra: an automated code generation and tuning framework for register-limited stencils on GPUs.",
                    "Optimizing sparse matrix computations through compiler-assisted programming.",
                    "CAOS: combined analysis with online sifting for dynamic compilation systems.",
                    "Secure key-exchange protocol for implants using heartbeats.",
                    "Automated parsing and interpretation of identity leaks.",
                    "Sequential pattern mining with the Micron automata processor.",
                    "P-Socket: optimizing a communication library for a PCIe-based intra-rack interconnect.",
                    "IVM: a task-based shared memory programming model and runtime system to enable uniform access to CPU-GPU clusters.",
                    "Application characterization at scale: lessons learned from developing a distributed open community runtime system for high performance computing.",
                    "Towards co-designed optimizations in parallel frameworks: a MapReduce case study.",
                    "Boosting performance of directory-based cache coherence protocols with coherence bypass at subpage granularity and a novel on-chip page table.",
                    "Mitigating sync overhead in single-level store systems.",
                    "A consistency mechanism for NVM-Based in-memory file systems.",
                    "Lock-based synchronization for GPU architectures.",
                    "Exploring embedded systems virtualization using MIPS virtualization module.",
                    "vSIP: virtual scheduler for interactive performance.",
                    "Conserving cooling and computing power by distributing workloads in data centers.",
                    "Using colored petri nets for GPGPU performance modeling.",
                    "A novel approach for all-to-all routing in all-optical hypersquare torus network.",
                    "Decoding EEG and LFP signals using deep learning: heading TrueNorth.",
                    "InfiniCortex: present and future invited paper.",
                    "From FLOPS to BYTES: disruptive change in high-performance computing towards the post-moore era.",
                    "CryoCMOS hardware technology a classical infrastructure for a scalable quantum computer.",
                    "The ANTAREX approach to autotuning and adaptivity for energy efficient HPC systems.",
                    "Integrated measurement and modeling for performance and power.",
                    "Exploring dataflow-based thread level parallelism in cyber-physical systems.",
                    "Prototyping real-time tracking systems on mobile devices.",
                    "PHIDIAS: ultra-low-power holistic design for smart bio-signals computing platforms.",
                    "Secure architectures of future emerging cryptography SAFEcrypto.",
                    "A heterogeneous quantum computer architecture.",
                    "Adaptable AES implementation with power-gating support.",
                    "A non von neumann continuum computer architecture for scalability beyond Moore's law.",
                    "Towards low-power embedded vector processor.",
                    "A lightweight user tracking method for app providers.",
                    "Guarantee-aware cost effective virtual machine placement algorithm for the cloud.",
                    "Resolving frontier problems of mastering large-scale supercomputer complexes.",
                    "Accelerating the 3D euler atmospheric solver through heterogeneous CPU-GPU platforms.",
                    "An architecture for near-data processing systems.",
                    "First impressions from detailed brain model simulations on a Xeon/Xeon-Phi node.",
                    "Shared resource aware scheduling on power-constrained tiled many-core processors.",
                    "Predictive modeling based power estimation for embedded multicore systems.",
                    "Curbing the roofline: a scalable and flexible architecture for CNNs on FPGA.",
                    "Power and clock gating modelling in coarse grained reconfigurable systems.",
                    "An energy-efficient parallel algorithm for real-time near-optimal UAV path planning.",
                    "Energy reduction in video systems: the GreenVideo project.",
                    "Heterogeneous chip multiprocessor architectures for big data applications.",
                    "On the design of scalable and reusable accelerators for big data applications.",
                    "Applications of supervised learning techniques on undergraduate admissions data.",
                    "Large transfers for data analytics on shared wide-area networks.",
                    "An in-memory based framework for scientific data analytics.",
                    "Malevolent app pairs: an Android permission overpassing scheme.",
                    "Security analysis and exploitation of arduino devices in the internet of things.",
                    "Partial FPGA bitstream encryption enabling hardware DRM in mobile environments.",
                    "Does it sound as it claims: a detailed side-channel security analysis of QuadSeal countermeasure.",
                    "Automated instantiation of side-channel attacks countermeasures for software cipher implementations.",
                    "New directions in IoT privacy using attribute-based authentication."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th Conference On Computing Frontiers 2015",
        "info": "Caligari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2015",
                "sub_name": "Proceedings of the 12th ACM International Conference on Computing Frontiers, CF'15, Ischia, Italy, May 18-21, 2015.",
                "count": 65,
                "papers": [
                    "An empirical high level performance model for future many-cores.",
                    "Just-in-time component-wise power and thermal modeling.",
                    "An instrumentation approach for hardware-agnostic software characterization.",
                    "Near threshold cloud processors for dark silicon mitigation: the impact on emerging scale-out workloads.",
                    "An energy-efficient custom architecture for the SKA1-low central signal processor.",
                    "Data access optimization in a processing-in-memory system.",
                    "Compiler analysis for OpenMP tasks correctness.",
                    "Genesis: a language for generating synthetic training programs for machine learning.",
                    "A significance-driven programming framework for energy-constrained approximate computing.",
                    "Enhanced GPU-based distributed breadth first search.",
                    "An evaluation and analysis of graph processing frameworks on five key issues.",
                    "Optimizing irregular applications for energy and performance on the Tilera many-core architecture.",
                    "Hierarchical synthesis of quantum and reversible architectures.",
                    "Cooperative repair based on tree structure for multiple failures in distributed storage systems with regenerating codes.",
                    "Asteroid: scalable online memory diagnostics.",
                    "TaPEr: tackling power emergencies in the dark silicon era by exploiting resource scalability.",
                    "HRF: a resource allocation scheme for moldable jobs.",
                    "Scheduling stream programs with improving arithmetic unit usage on NoC-based VLIW multi-core architectures.",
                    "Chrysso: an integrated power manager for constrained many-core processors.",
                    "Achieving high throughput and low delay in mobile data networks by accurately predicting queue lengths.",
                    "Position-aware thread-level speculative parallelization for large-scale chip-multiprocessor.",
                    "SARP: producing approximate results with small correctness losses for cloud interactive services.",
                    "Software-managed energy-efficient hybrid DRAM/NVM main memory.",
                    "DP2: reducing transaction overhead with differential and dual persistency in persistent memory.",
                    "Dysource: a high performance and scalable NAND flash controller architecture based on source synchronous interface.",
                    "ETD-Cache: an expiration-time driven cache scheme to make SSD-based read cache endurable and cost-efficient.",
                    "HOSA: hybrid optical switch architecture for data center networks.",
                    "Fast packet forwarding engine based on software circuits.",
                    "AMTCP: an adaptive multi-path transmission control protocol.",
                    "BandArb: mitigating the effects of thermal and process variations in silicon-photonic network.",
                    "Scaling application properties to exascale.",
                    "Moving to memoryland: in-memory computation for existing applications.",
                    "Socialness in the recruiting of software engineers.",
                    "ProductiveC: enabling high productivity in C-family languages.",
                    "Heterogeneous energy-efficient cache design in warehouse scale computers.",
                    "B2L: a case for buffered and bufferless hybrid NoCs.",
                    "Removing duplicated writes at DB checkpointing with file system-level block remapping.",
                    "Two-level logging with non-volatile byte-addressable memory in log-structured file systems.",
                    "Handling consistent web service recovery in a RESTful way.",
                    "Optimizing the accuracy of a rocket trajectory simulation by program transformation.",
                    "Enhancing an x86_64 multi-core architecture with data-flow execution support.",
                    "A practical evaluation of synchronicity in action potentials with noise.",
                    "A practical framework for real-time diffusion analysis in social media.",
                    "Approximating dictionary-based optimal data compression on a distributed system.",
                    "Understanding the limiting factors of page migration in hybrid main memory.",
                    "Free atomic consistency in storage class memory with software based write-aside persistence.",
                    "Programmer-directed partial redundancy for resilient HPC.",
                    "The improved parallel ray casting algorithm in embedded multi-core DSP system.",
                    "Towards building an analytics platform in the cloud.",
                    "Mapping design patterns to cloud patterns to support application portability: a preliminary study.",
                    "A PaaS for composite analytics solutions.",
                    "Big data analytics for climate change and biodiversity in the EUBrazilCC federated cloud infrastructure.",
                    "SparkBench: a comprehensive benchmarking suite for in memory data analytic platform Spark.",
                    "Attention: moving target defense networks, how well are you moving?.",
                    "Optimal allocation of virtual resources using genetic algorithm in cloud environments.",
                    "Escalation of TRUST analysis in web.",
                    "The able amble: gait recognition using Gaussian mixture model for biometric applications.",
                    "Authentication and privacy preserving message transfer scheme for vehicular ad hoc networks (VANETs).",
                    "PHP-sensor: a prototype method to discover workflow violation and XSS vulnerabilities in PHP web applications.",
                    "A modified HEVC decoder for low power decoding.",
                    "Automated power gating methodology for dataflow-based reconfigurable systems.",
                    "Energy efficiency of a parallel HEVC software decoder for embedded devices.",
                    "A matrix multiplier case study for an evaluation of a configurable dataflow-machine.",
                    "Exploring multi-banked shared-L1 program cache on ultra-low power, tightly coupled processor clusters.",
                    "Green adaptive streaming."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th Conference On Computing Frontiers 2014",
        "info": "Caligari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2014",
                "sub_name": "Computing Frontiers Conference, CF'14, Cagliari, Italy - May 20 - 22, 2014.",
                "count": 37,
                "papers": [
                    "ScaffCC: a framework for compilation and analysis of quantum computing programs.",
                    "On generating multicast routes for SpiNNaker.",
                    "Enabling FPGAs in the cloud.",
                    "DaSH: a benchmark suite for hybrid dataflow and shared memory programming models: with comparative evaluation of three hybrid dataflow models.",
                    "Accurate off-line phase classification for HW/SW co-designed processors.",
                    "SKOPE: a framework for modeling and exploring workload behavior.",
                    "VALib and SimpleVector: tools for rapid initial research on vector architectures.",
                    "Getting ready for approximate computing: trading parallelism for accuracy for DSS workloads.",
                    "Feature-based device selection in heterogeneous computing systems.",
                    "Embracing heterogeneity with dynamic core boosting.",
                    "Towards a performance-portable FFT library for heterogeneous computing.",
                    "DTT: program structure-aware indirect branch optimization via direct-TPC-table in DBT system.",
                    "Micro-checkpointing in fault tolerant runtimes.",
                    "Accelerating synchronization communications for high-density blade enclosure.",
                    "Ultra-low-latency lightweight DMA for tightly coupled multi-core clusters.",
                    "Towards a new tuple-based programming paradigm for expressing and optimizing irregular parallel computations.",
                    "Moving computations from run-time to compile-time: hyper-metaprogramming in practice.",
                    "Dynamic transaction coalescing.",
                    "Chameleon: a data organization transformation scheme for big data systems.",
                    "A collaborative divide-and-conquer K-means clustering algorithm for processing large data.",
                    "Power availability provisioning in large data centers.",
                    "Hardware support for address mapping in PGAS languages: a UPC case study.",
                    "Supporting localized OpenVX kernel execution for efficient computer vision application development on STHORM many-core platform.",
                    "PEACH: a model for performance and energy aware cooperative hybrid computing.",
                    "An argument for thread-level speculation and just-in-time compilation in the Google's V8 JavaScript engine.",
                    "TFluxSCC: a case study for exploiting performance in future many-core systems.",
                    "Optimization of neural network through genetic algorithm searches for the prediction of international crude oil price based on energy products prices.",
                    "High throughput genetic sequence analysis.",
                    "A neuro-fuzzy fan speed controller for dynamic thermal management of multi-core processors.",
                    "Object-centric bank partition for reducing memory interference in CMP systems.",
                    "Concurrent page migration for mobile systems with OS-managed hybrid memory.",
                    "Cache-conscious graph collaborative filtering on multi-socket multicore systems.",
                    "SAMO: store aware memory optimizations.",
                    "Multiple stream tracker: a new hardware stride prefetcher.",
                    "High performance two-dimensional phase unwrapping on GPUs.",
                    "Symbiotic scheduling of concurrent GPU kernels for performance and energy optimizations.",
                    "A framework for predicting trajectories using global and local information."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th Conference On Computing Frontiers 2013",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2013",
                "sub_name": "Computing Frontiers Conference, CF'13, Ischia, Italy, May 14 - 16, 2013.",
                "count": 36,
                "papers": [
                    "A high performance reliable dataflow based processor for space applications.",
                    "System integration of tightly-coupled processor arrays using reconfigurable buffer structures.",
                    "A shared-FPU architecture for ultra-low power MPSoCs.",
                    "Fault tolerance for multi-threaded applications by leveraging hardware transactional memory.",
                    "Scheduling optimization in multicore multithreaded microprocessors through dynamic modeling.",
                    "Addressing the challenges of future large-scale many-core architectures.",
                    "Mapping applications for high performance on multithreaded, NUMA systems.",
                    "An algorithm for parallel calculation of trigonometric functions.",
                    "Strategies for improving performance and energy efficiency on a many-core.",
                    "Network stacking considered harmful.",
                    "An IT-infrastructure capability model.",
                    "Reasoning and prediction on opportunistic networks to improve data dissemination.",
                    "Uncovering CPU load balancing policies with harmony.",
                    "Glinda: a framework for accelerating imbalanced applications on heterogeneous platforms.",
                    "Performance analysis and predictability of the software layer in dynamic binary translators/optimizers.",
                    "Kinship: efficient resource management for performance and functionally asymmetric platforms.",
                    "Distributed queues in shared memory: multicore performance and scalability through quantitative relaxation.",
                    "GPU acceleration of regular expression matching for large datasets: exploring the implementation space.",
                    "DCNSim: a unified and cross-layer computer architecture simulation framework for data center network research.",
                    "Investigating hybrid SSD FTL schemes for Hadoop workloads.",
                    "Load balancing in a changing world: dealing with heterogeneity and performance variability.",
                    "Nail-it-down: nailing and fixing configuration faults in cloud environments.",
                    "Experimental evaluation of an adiabiatic quantum system for combinatorial optimization.",
                    "RTS - an integrated analytic solution for managing regulation changes and their impact on business compliance.",
                    "Multi-processor architectural support for protecting virtual machine privacy in untrusted cloud environment.",
                    "Memristors for neural branch prediction: a case study in strict latency and write endurance challenges.",
                    "Software-defined massive multicore networking via freespace optical interconnect.",
                    "RFiof: an RF approach to I/O-pin and memory controller scalability for off-chip memories.",
                    "Cost-effective soft-error protection for SRAM-based structures in GPGPUs.",
                    "Bridging the programming gap between persistent and volatile memory using WrAP.",
                    "To cache or not to cache: a trade-off analysis for locally cached database systems.",
                    "Computationally unifying urban masterplanning.",
                    "TCNet: cross-node virtual machine communication acceleration.",
                    "Trace construction using enhanced performance monitoring.",
                    "Scaling analytics applications with OpenCL for loosely coupled heterogeneous clusters.",
                    "A divide-and-conquer approach for solving singular value decomposition on a heterogeneous system."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th Conference On Computing Frontiers 2012",
        "info": "Caligari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2012",
                "sub_name": "Proceedings of the Computing Frontiers Conference, CF'12, Caligari, Italy - May 15 - 17, 2012.",
                "count": 43,
                "papers": [
                    "Towards truly integrated photonic and electronic computing.",
                    "Algorithmic methodologies for ultra-efficient inexact architectures for sustaining technology scaling.",
                    "A reconfigurable optical/electrical interconnect architecture for large-scale clusters and datacenters.",
                    "BSArc: blacksmith streaming architecture for HPC accelerators.",
                    "A limits study of benefits from nanostore-based future data-centric system architectures.",
                    "Mesh independent loop fusion for unstructured mesh applications.",
                    "GA-GPU: extending a library-based global address spaceprogramming model for scalable heterogeneouscomputing systems.",
                    "SnCTM: reducing false transaction aborts by adaptively changing the source of conflict detection.",
                    "Architectural support of multiple hypervisors over single platform for enhancing cloud computing security.",
                    "SuperCoP: a general, correct, and performance-efficient supervised memory system.",
                    "Exploring latency-power tradeoffs in deep nonvolatile memory hierarchies.",
                    "The tradeoffs of fused memory hierarchies in heterogeneous computing architectures.",
                    "DMA-circular: an enhanced high level programmable DMA controller for optimized management of on-chip local memories.",
                    "Studying the impact of application-level optimizations on the power consumption of multi-core architectures.",
                    "Improving energy efficiency for mobile platforms by exploiting low-power sleep states.",
                    "Improving coherence protocol reactiveness by trading bandwidth for latency.",
                    "A programmable processing array architecture supporting dynamic task scheduling and module-level prefetching.",
                    "Adaptive task duplication using on-line bottleneck detection for streaming applications.",
                    "Concurrent hybrid switching for massively parallel systems-on-chip: the CYBER architecture.",
                    "A hierachical configuration system for a massively parallel neural hardware platform.",
                    "Reuse distance based performance modeling and workload mapping.",
                    "The boat hull model: enabling performance prediction for parallel computing prior to code development.",
                    "Parameterized micro-benchmarking: an auto-tuning approach for complex applications.",
                    "A flexible OS-based approach for characterizing solid-state disk endurance.",
                    "An out-of-order vector processing mechanism for multimedia applications.",
                    "Towards player-driven procedural content generation.",
                    "An efficient vectorization of linked-cell particle simulations.",
                    "Dynamic percolation: a case of study on the shortcomings of traditional optimization in many-core architectures.",
                    "CoreSymphony architecture.",
                    "Instructions activating conditions for hardware-based auto-scheduling.",
                    "Selective search of inlining vectors for program optimization.",
                    "D3AS project: a different approach to the manycore challenges.",
                    "A capacity-efficient insertion policy for dynamic cache resizing mechanisms.",
                    "Accelerated high-performance computing through efficient multi-process GPU resource sharing.",
                    "Improving the performance of k-means clustering through computation skipping and data locality optimizations.",
                    "Learning, evolution and adaptation in racing games.",
                    "Game AI revisited.",
                    "Towards more intelligent adaptive video game agents: a computational intelligence perspective.",
                    "How AI can change the way we play games.",
                    "CRESTA: a software focussed approach to exascale co-design.",
                    "TERAFLUX: exploiting dataflow parallelism in teradevices.",
                    "DEEP: an exascale prototype architecture based on a flexible configuration.",
                    "Mont-Blanc: towards energy-efficient HPC systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th Conference On Computing Frontiers 2011",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2011",
                "sub_name": "Proceedings of the 8th Conference on Computing Frontiers, 2011, Ischia, Italy, May 3-5, 2011.",
                "count": 40,
                "papers": [
                    "SoftHV: a HW/SW co-designed processor with horizontal and vertical fusion.",
                    "Efficient stack distance computation for priority replacement policies.",
                    "Elastic pipeline: addressing GPU on-chip shared memory bank conflicts.",
                    "Pruning hardware evaluation space via correlation-driven application similarity analysis.",
                    "BarrierWatch: characterizing multithreaded workloads across and within program-defined epochs.",
                    "Scaling scientific applications on clusters of hybrid multicore/GPU nodes.",
                    "Performance optimization by dynamic code transformation.",
                    "Increasing power/performance resource efficiency on virtualized enterprise servers.",
                    "A reconfigurable cache architecture for energy efficiency.",
                    "Manycore work stealing.",
                    "MPOpt-Cell: a high-performance data-flow programming environment for the CELL BE processor.",
                    "Hybrid high-performance low-power and ultra-low energy reliable caches.",
                    "Dynamic co-management of persistent RAM main memory and storage resources.",
                    "Cluster-based topologies for 3D stacked architectures.",
                    "Maintaining real-time synchrony on SpiNNaker.",
                    "Universal optical multi-drop bus for heterogeneous memory architecture.",
                    "Quantitative analysis of parallelism and data movement properties across the Berkeley computational motifs.",
                    "CnC-Hadoop: a graphical coordination language for distributed multiscale parallelism.",
                    "Towards self-adaptive networks on chip for massively parallel processors: multilevel quality of service programmability.",
                    "An MPSoC design approach for multiple use-cases of throughput constrainted applications.",
                    "AstroLIT: enabling simulation-based microarchitecture comparison between Intel® and Transmeta designs.",
                    "A parallel programming framework orchestrating multiple languages and architectures.",
                    "Composable local memory organisation for streaming applications on embedded MPSoCs.",
                    "Rematerialization-based register allocation through reverse computing.",
                    "On-the-fly detection of precise loop nests across procedures on a dynamic binary translation system.",
                    "Harmonia: a transparent, efficient, and harmonious dynamic binary translator targeting the Intel® architecture.",
                    "Bounding the effect of partition camping in GPU kernels.",
                    "Leveraging data-structure semantics for efficient algorithmic parallelism.",
                    "Multi- and many-core data mining with adaptive sparse grids.",
                    "Understanding stencil code performance on multicore architectures.",
                    "Parametrizing multicore architectures for multiple sequence alignment.",
                    "Performance analysis and optimization of molecular dynamics simulation on Godson-T many-core processor.",
                    "Performing bitwise logic operations in cache using spintronics-based magnetic tunnel junctions.",
                    "Virtual base station pool: towards a wireless network cloud for radio access networks.",
                    "FACT: a framework for adaptive contention-aware thread migrations.",
                    "Tolerating correlated failures for generalized Cartesian distributions via bipartite matching.",
                    "SIFT: a low-overhead dynamic information flow tracking architecture for SMT processors.",
                    "Scalable memory registration for high performance networks using helper threads.",
                    "A flexible approach to efficient resource sharing in virtualized environments.",
                    "Evaluation of dynamic voltage and frequency scaling for stream programs."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th Conference On Computing Frontiers 2010",
        "info": "Bertinoro, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2010",
                "sub_name": "Proceedings of the 7th Conference on Computing Frontiers, 2010, Bertinoro, Italy, May 17-19, 2010.",
                "count": 56,
                "papers": [
                    "Towards chip-on-chip neuroscience: fast mining of neuronal spike streams using graphics hardware.",
                    "SpiNNaker: impact of traffic locality, causality and burstiness on the performance of the interconnection network.",
                    "Scalable event-driven native parallel processing: the SpiNNaker neuromimetic system.",
                    "Operating system support for mitigating software scalability bottlenecks on asymmetric multicore processors.",
                    "Efficient cache design for solid-state drives.",
                    "Programmable matter with self-reconfiguring robots.",
                    "Supporting lock-free composition of concurrent data objects.",
                    "Collaborative scheduling of DAG structured computations on multicore processors.",
                    "Efficient and scalable barrier synchronization for many-core CMPs.",
                    "A communication infrastructure for a million processor machine.",
                    "A hyperscalar multi-core architecture.",
                    "Augmenting cache partitioning with thread-aware insertion/promotion policies to manage shared caches.",
                    "Performance and power evaluation of an in-line accelerator.",
                    "Energy efficient biomolecular simulations with FPGA-based reconfigurable computing.",
                    "Efficient implementation of GPGPU synchronization primitives on CPUs.",
                    "Efficient pattern matching on GPUs for intrusion detection systems.",
                    "Efficient parallel implementation of multilayer backpropagation networks on SpiNNaker.",
                    "Porting existing cache-oblivious linear algebra HPC modules to larrabee architecture.",
                    "Novel low-cost aging sensor.",
                    "A high-speed AES architecture implementation.",
                    "A predictable communication assist.",
                    "Exploitation of nested thread-level speculative parallelism on multi-core systems.",
                    "Combining deblurring and denoising for handheld HDR imaging in low light conditions.",
                    "From volunteer to cloud computing: cloud@home.",
                    "Design of a cloud naming framework.",
                    "A service-based approach for the execution of scientific workflows in grids.",
                    "Variability-tolerant run-time workload allocation for MPSoC energy minimization under real-time constraints.",
                    "A portable parallel finite element simulation system.",
                    "Low cost and low intrusive approach to test on-line the scheduler of high performance microprocessors.",
                    "Automatic tuning of MPI runtime parameter settings by using machine learning.",
                    "Exposing parallelism and locality in a runtime parallel optimization framework.",
                    "ERBIUM: a deterministic, concurrent intermediate representation for portable and scalable performance.",
                    "NCID: a non-inclusive cache, inclusive directory architecture for flexible and efficient cache hierarchies.",
                    "Global management of cache hierarchies.",
                    "Where replacement algorithms fail: a thorough analysis.",
                    "Nature-inspired techniques for self-organization in dynamic networks.",
                    "Load balancing using dynamic cache allocation.",
                    "EXACT: explicit dynamic-branch prediction with active updates.",
                    "Hybrid parallel programming with MPI and unified parallel C.",
                    "A heterogeneous parallel system running open mpi on a broadband network of embedded set-top devices.",
                    "Variant-based competitive parallel execution of sequential programs.",
                    "Enabling a highly-scalable global address space model for petascale computing.",
                    "On-chip communication and synchronization mechanisms with cache-integrated network interfaces.",
                    "Models for generating locality-tuned traveling threads for a hierarchical multi-level heterogeneous multicore.",
                    "Proposition for a sequential accelerator in future general-purpose manycore processors and the problem of migration-induced cache misses.",
                    "High precision quantum query algorithm for computing AND-based boolean functions.",
                    "Reversible online BIST using bidirectional BILBO.",
                    "Power and performance optimization of voltage/frequency island-based networks-on-chip using reconfigurable synchronous/bi-synchronous FIFOs.",
                    "Applying statistical machine learning to multicore voltage & frequency scaling.",
                    "Interval-based models for run-time DVFS orchestration in superscalar processors.",
                    "Multiple sleep modes leakage control in peripheral circuits of a all major SRAM-based processor units.",
                    "Towards greener data centers with storage class memory: minimizing idle power waste through coarse-grain management in fine-grain scale.",
                    "Protective redundancy overhead reduction using instruction vulnerability factor.",
                    "Self organization on a swarm computing fabric: a new way to look at fault tolerance.",
                    "Dynamic load management for MMOGs in distributed environments.",
                    "Scalable simulation of complex network routing policies."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th Conference On Computing Frontiers 2009",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2009",
                "sub_name": "Proceedings of the 6th Conference on Computing Frontiers, 2009, Ischia, Italy, May 18-20, 2009.",
                "count": 28,
                "papers": [
                    "A light-weight fairness mechanism for chip multiprocessor memory systems.",
                    "Extending concurrency of transactional memory programs by using value prediction.",
                    "Space-and-time efficient garbage collectors for parallel systems.",
                    "Core monitors: monitoring performance in multicore processors.",
                    "A study on optimally co-scheduling jobs of different lengths on chip multiprocessors.",
                    "A multi-streaming SIMD architecture for multimedia applications.",
                    "Quantitative analysis of sequence alignment applications on multiprocessor architectures.",
                    "Mapping the LU decomposition on a many-core architecture: challenges and solutions.",
                    "New applications of quantum algorithms to computer graphics: the quantum random sample consensus algorithm.",
                    "Towards automatic program partitioning.",
                    "Non-clairvoyant speed scaling for batched parallel jobs on multiprocessors.",
                    "Pleiad: a cross-environment middleware providing efficient multithreading on clusters.",
                    "Data parallel acceleration of decision support queries using Cell/BE and GPUs.",
                    "Wave field synthesis for 3D audio: architectural prospectives.",
                    "Accelerating total variation regularization for matrix-valued images on GPUs.",
                    "A control-structure splitting optimization for GPGPU.",
                    "Improving performance of simple cores by exploiting loop-level parallelism through value prediction and reconfiguration.",
                    "Scheduling dynamic parallelism on accelerators.",
                    "Power consumption and reduction in a real, commercial multimedia core.",
                    "High-performance SIMT code generation in an active visual effects library.",
                    "True value: assessing and optimizing the cost of computing at the data center level.",
                    "High accuracy failure injection in parallel and distributed systems using virtualization.",
                    "Scalable transparent checkpoint-restart of global address space applications on virtual machines over infiniband.",
                    "Evaluating multi-core platforms for HPC data-intensive kernels.",
                    "Strategies for dynamic memory allocation in hybrid architectures.",
                    "Characterizing the performance penalties induced by irregular code using pointer structures and indirection arrays on the intel core 2 architecture.",
                    "Larrabee: a many-core Intel architecture for visual computing.",
                    "Pervasive massively multithreaded GPU processors."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th Conference On Computing Frontiers 2008",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2008",
                "sub_name": "Proceedings of the 5th Conference on Computing Frontiers, 2008, Ischia, Italy, May 5-7, 2008.",
                "count": 39,
                "papers": [
                    "Scaling up next generation supercomputers.",
                    "Accelerating computing with the cell broadband engine processor.",
                    "Cell-SWat: modeling and scheduling wavefront computations on the cell broadband engine.",
                    "DMA-based prefetching for i/o-intensive workloads on the cell architecture.",
                    "Exact multi-pattern string matching on the cell/b.e. processor.",
                    "Principles of a reversible programming language.",
                    "Fpga-based prototype of a pram-on-chip processor.",
                    "The limits of software transactional memory (STM): dissecting Haskell STM applications on a many-core environment.",
                    "A study of the effects of machine geometry and mapping on distributed transpose performance.",
                    "Optimizing sparse matrix-vector multiplication using index and value compression.",
                    "A framework for scheduling parallel dbms user-defined programs on an attached high-performance computer.",
                    "A multi-mode video-stream processor with cyclically reconfigurable architecture.",
                    "Effective runtime scalability metric to measure productivity in high performance computing systems.",
                    "Exploiting the GPU to accelerate DSS query execution.",
                    "Virtual interacting network community: exploiting multi-core architectures to increase security.",
                    "Application-based early performance evaluation of SGI altix 4700 systems for SGI systems.",
                    "Methodology for the model-driven development of self-managing systems.",
                    "Data-parallel abstractions for irregular programs.",
                    "Optimizing thread throughput for multithreaded workloads on memory constrained CMPs.",
                    "Reducing the impact of intra-core process variability with criticality-based resource allocation and prefetching.",
                    "Credit-based dynamic reliability management using online wearout detection.",
                    "Low power microarchitecture with instruction reuse.",
                    "A modular 3d processor for flexible product design and technology migration.",
                    "Design of a spintronic arithmetic and logic unit using magnetic tunnel junctions.",
                    "Exact combinational logic synthesis and non-standard circuit design.",
                    "Optimization strategies for a java virtual machine interpreter on the cell broadband engine.",
                    "Compiling for an indirect vector register architecture.",
                    "Compiler-directed frequency and voltage scaling for a multiple clock domain microarchitecture.",
                    "JANUS: reconfigurable high-performance computing for physics.",
                    "Emergent algorithms for centroid and orientation detection in high-performance embedded cameras.",
                    "Profiling of symmetric-encryption algorithms for a novel biomedical-implant architecture.",
                    "Multi-terabit ip lookup using parallel bidirectional pipelines.",
                    "Improving single-thread performance with fine-grain state maintenance.",
                    "Accelerating advanced mri reconstructions on gpus.",
                    "GPU acceleration of cutoff pair potentials for molecular modeling applications.",
                    "Cost-effective medical image reconstruction: from clusters to graphics processing units.",
                    "Active storage revisited: the case for power and performance benefits for unstructured data processing applications.",
                    "Scalable dht-based information service for large-scale grids.",
                    "A distributed evolutionary method to design scheduling policies for volunteer computing."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th Conference On Computing Frontiers 2007",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2007",
                "sub_name": "Proceedings of the 4th Conference on Computing Frontiers, 2007, Ischia, Italy, May 7-9, 2007.",
                "count": 31,
                "papers": [
                    "Recent technological trends and their impact on system design.",
                    "An analysis of the effects of miss clustering on the cost of a cache miss.",
                    "Analysis of hardware prefetching across virtual page boundaries.",
                    "Unified microprocessor core storage.",
                    "Accelerating memory decryption and authentication with frequent value prediction.",
                    "Evaluating the potential of multithreaded platforms for irregular scientific computations.",
                    "Parallel genomic sequence-search on a massively parallel system.",
                    "Scaling time warp-based discrete event execution to 104 processors on a Blue Gene supercomputer.",
                    "General floorplan for reversible quantum-dot cellular automata.",
                    "Automated generation of layout and control for quantum circuits.",
                    "Models for parallel and hierarchical computation.",
                    "By-passing the out-of-order execution pipeline to increase energy-efficiency.",
                    "Computational and storage power optimizations for the O-GEHL branch predictor.",
                    "Adaptive VP decay: making value predictors leakage-efficient designs for high performance processors.",
                    "An intra-task dvfs technique based on statistical analysis of hardware events.",
                    "Fast compiler optimisation evaluation using code-feature based performance prediction.",
                    "Identifying potential parallelism via loop-centric profiling.",
                    "System management software for virtual environments.",
                    "A unified evaluation framework for coarse grained reconfigurable array architectures.",
                    "Assessing the potential of hybrid hpc systems for scientific applications: a case study.",
                    "Reconfigurable hybrid interconnection for static and dynamic scientific applications.",
                    "The quantum challenge to computer science.",
                    "Design and implementation of a stream-based distributedcomputing platform using graphics processing units.",
                    "Data buffering optimization methods toward a uniform programming interface for gpu-based applications.",
                    "Fuce: the continuation-based multithreading processor.",
                    "Scalability of continuation-based fine-grained multithreading in handling multiple I/O requests on FUCE.",
                    "Memory-miser: a performance-constrained runtime system for power-scalable clusters.",
                    "Performance/area efficiency in chip multiprocessors with micro-caches.",
                    "Speculative supplier identification for reducing power of interconnects in snoopy cache coherence protocols.",
                    "Converting massive TLP to DLP: a special-purpose processor for molecular orbital computations.",
                    "Massively parallel processing on a chip."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd Conference On Computing Frontiers 2006",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2006",
                "sub_name": "Proceedings of the Third Conference on Computing Frontiers, 2006, Ischia, Italy, May 3-5, 2006.",
                "count": 41,
                "papers": [
                    "Chip multiprocessing and the cell broadband engine.",
                    "The potential of the cell processor for scientific computing.",
                    "MPSoC ECG biochip: a multiprocessor system-on-chip for real-time human heart monitoring and analysis.",
                    "Dynamic thread assignment on heterogeneous multiprocessor architectures.",
                    "Landing openMP on cyclops-64: an efficient mapping of openMP to a many-core system-on-a-chip.",
                    "Current and future research directions in embedded systems: a european perspective.",
                    "Morphogenesis as an amorphous computation.",
                    "A nano-scale reconfigurable mesh with spin waves.",
                    "Implementing quantum genetic algorithms: a solution based on Grover's algorithm.",
                    "Tile size selection for low-power tile-based architectures.",
                    "Profile-driven compression scheme for embedded systems.",
                    "Energy-aware data prefetching for multi-speed disks.",
                    "\"Empty space\" computes: the evolution of an unconventional supercomputer.",
                    "Dynamic parallelization and mapping of binary executables on hierarchical platforms.",
                    "Instruction folding in a hardware-translation based java virtual machine.",
                    "On the decidability of phase ordering problem in optimizing compilation.",
                    "Multi-compilation: capturing interactions among concurrently-executing applications.",
                    "An opportunistic reconfiguration strategy for environmentally powered devices.",
                    "Using managed communication channels in software components.",
                    "REPLICA2Pro: task relocation by bitstream manipulation in virtex-II/Pro FPGAs.",
                    "A dependability perspective on emerging technologies.",
                    "Self-replication for reliability: bio-inspired hardware and the embryonics project.",
                    "Dependability in an evolving world.",
                    "On dependability of FPGA-based evolvable hardware systems that utilize virtual reconfigurable circuits.",
                    "Memory efficient parallel matrix multiplication operation for irregular problems.",
                    "Database hash-join algorithms on multithreaded computer architectures.",
                    "Improving the memory behavior of vertical filtering in the discrete wavelet transform.",
                    "Dynamic testing of legacy code resources on the grid.",
                    "Kilo-instruction processors, runahead and prefetching.",
                    "Exploiting locality to ameliorate packet queue contention and serialization.",
                    "Speculative early register release.",
                    "VICTORIA: VMX indirect compute technology oriented towards in-line acceleration.",
                    "Cache miss behavior: is it sqrt(2)?",
                    "An efficient cache design for scalable glueless shared-memory multiprocessors.",
                    "Lazy direct-to-cache transfer during receive operations in a message passing environment.",
                    "Simple penalty-sensitive replacement policies for caches.",
                    "Static cache partitioning robustness analysis for embedded on-chip multi-processors.",
                    "Evaluation of the field-programmable cache: performance and energy consumption.",
                    "Intermediately executed code is the key to find refactorings that improve temporal data locality.",
                    "Topology-aware tile mapping for clusters of SMPs.",
                    "Performance characteristics of an adaptive mesh refinement calculation on scalar and vector platforms."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd Conference On Computing Frontiers 2005",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2005",
                "sub_name": "Proceedings of the Second Conference on Computing Frontiers, 2005, Ischia, Italy, May 4-6, 2005.",
                "count": 54,
                "papers": [
                    "Marching-pixels: a new organic computing paradigm for smart sensor processor arrays.",
                    "First steps towards organic computing systems: monitoring an adaptive protocol stack with a fuzzy classifier system.",
                    "Balancing clustering-induced stalls to improve performance in clustered processors.",
                    "ELDORADO.",
                    "Reversible computing: from mathematical group theory to electronical circuit experiment.",
                    "Two-state, reversible, universal cellular automata in three dimensions.",
                    "Specific ergodicity: an informative indicator for invertible computational media.",
                    "Jalapeno: secentralized grid computing using peer-to-peer technology.",
                    "A two level market model for resource allocation optimization in computational grid.",
                    "Reconfigurable universal SAD-multiplier array.",
                    "Evaluation of extended dictionary-based static code compression schemes.",
                    "Grid result checking.",
                    "GRID Based Federated Digital Library.",
                    "Dynamic loop pipelining in data-driven architectures.",
                    "Owl: next generation system monitoring.",
                    "Power and performance optimization at the system level.",
                    "Improving quantum circuit dependability with reconfigurable quantum gate arrays.",
                    "Using a hybrid CA based model for a flexible qualitative qubit simulation: fully frustrated josephson junction ladder (JJL) application.",
                    "Skewed caches from a low-power perspective.",
                    "Controlling leakage power with the replacement policy in slumberous caches.",
                    "Matrix register file and extended subwords: two techniques for embedded media processors.",
                    "Optimizing general purpose compiler optimization.",
                    "Transition aware scheduling: increasing continuous idle-periods in resource units.",
                    "Scheduling for heterogeneous processors in server systems.",
                    "Dynamic run-time architecture techniques for enabling continuous optimization.",
                    "A QoS-enabled packet scheduling algorithm for IPSec multi-accelerator based systems.",
                    "Sparse matrix storage revisited.",
                    "Contextual information management using contract: based workflow.",
                    "Communication and security extensions for a ubiquitous mobile agent system (UbiMAS).",
                    "A case for a working-set-based memory hierarchy.",
                    "Exploiting processor groups to extend scalability of the GA shared memory programming model.",
                    "A computing architecture for physics.",
                    "A combined hardware and software architecture for secure computing.",
                    "Reducing misspeculation overhead for module-level speculative execution.",
                    "Partially ordered epochs for thread-level speculation.",
                    "A time-predictable execution mode for superscalar pipelines with instruction prescheduling.",
                    "SPANIDS: a scalable network intrusion detection loadbalancer.",
                    "Reliability assessment in embryonics inspired by fault-tolerant quantum computation.",
                    "Improving branch prediction accuracy with parallel conservative correctors.",
                    "When prefetching improves/degrades performance.",
                    "An efficient wakeup design for energy reduction in high-performance superscalar processors.",
                    "On the energy-efficiency of speculative hardware.",
                    "Exploiting temporal locality in drowsy cache policies.",
                    "Drowsy region-based caches: minimizing both dynamic and static power dissipation.",
                    "Introduction to reversible computing: motivation, progress, and challenges.",
                    "Reversible logic for supercomputing.",
                    "Reversible computation with quantum-dot cellular automata (QCA).",
                    "The electron waveguide y-branch switch: a review and arguments for its use as a base for reversible logic.",
                    "Fast, efficient, recovering, and irreversible.",
                    "Making adiabatic circuits attractive for todays VLSI industry by multi-mode operation-adiabatic mode circuits.",
                    "Implementation of a simple 8-bit microprocessor with reversible energy recovery logic.",
                    "Scaling trends in adiabatic logic.",
                    "Time, space, and energy in reversible computing.",
                    "Thermodynamical cost of reversible computing."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st Conference On Computing Frontiers 2004",
        "info": "Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cf/2004",
                "sub_name": "Proceedings of the First Conference on Computing Frontiers, 2004, Ischia, Italy, April 14-16, 2004.",
                "count": 54,
                "papers": [
                    "Quantum parallelism and the exact simulation of physical systems.",
                    "Javaset: Declarative programming in Java with sets.",
                    "Effect of auto-tuning with user's knowledge for numerical software.",
                    "Introduction to NOMADS: networks of mobile adaptive dependable systems.",
                    "An architectural framework and a middleware for cooperating smart components.",
                    "An architecture to support cooperating mobile embedded systems.",
                    "Model-based evaluation of a radio resource management system for wireless networks.",
                    "Modeling service-based multimedia content adaptation in pervasive computing.",
                    "A framework for resource discovery in pervasive computing for mobile aware task execution.",
                    "Application-level power management in pervasive computing systems: a case study.",
                    "Quantum designer and network simulator.",
                    "Using HDLs for describing quantum circuits: a framework for efficient quantum algorithm simulation.",
                    "Toward a quantum process algebra.",
                    "States of matter, information organization and dimensions of expressiveness.",
                    "BLOB computing.",
                    "Biologically inspired rule-based multiset programming paradigm for soft-computing.",
                    "Watson-Crick automata and PCFAS with two components: a computational power analogy.",
                    "Reflections on the memory wall.",
                    "Fighting the memory wall with assisted execution.",
                    "Self-correcting LRU replacement policies.",
                    "Dynamic techniques to reduce memory traffic in embedded systems.",
                    "Overcoming the \"Memory Wall\" by improved system design exploration and a link to process technology options.",
                    "A first glance at Kilo-instruction based multiprocessors.",
                    "An active data-aware cache consistency protocol for highly-scalable data-shipping DBMS architectures.",
                    "Reducing traffic generated by conflict misses in caches.",
                    "Combining compiler and runtime IPC predictions to reduce energy in next generation architectures.",
                    "A docked-aware storage architecture for mobile computing.",
                    "Knowledge-based generic intelligent network model.",
                    "An information-interconnectivity-based retrieval method for network attached storage.",
                    "Improving the execution time of global communication operations.",
                    "Mobile agent: based module distribution in heterogeneous networks.",
                    "Berserkr: a virtual beowulf cluster for fast prototyping and teaching.",
                    "A parallel backtracking framework (BkFr) for single and multiple clusters.",
                    "Approximating the optimal replacement algorithm.",
                    "Parallel simulation of orography influence on large-scale atmosphere motion on APEmille.",
                    "A new technique to calculate dipolar energy and its implementation onto an application specific processor.",
                    "Repairing return address stack for buffer overflow protection.",
                    "MaRS: a macro-pipelined reconfigurable system.",
                    "Fault tolerant clockless wave pipeline design.",
                    "The digital divide of computing.",
                    "The happy marriage of architecture and application in next-generation reconfigurable systems.",
                    "Reconfigurable platforms for ubiquitous computing.",
                    "Physical design methodologies for performance predictability and manufacturability.",
                    "Platform-independent methodology for partial reconfiguration.",
                    "Adaptive architectures for an OTN processor: reducing design costs through reconfigurability and multiprocessing.",
                    "Designing and testing fault-tolerant techniques for SRAM-based FPGAs.",
                    "Predictable performance in SMT processors.",
                    "Fault secureness need for next generation high performance microprocessor design for testability structures.",
                    "High performance code compression architecture for the embedded ARM/THUMB processor.",
                    "Integrated temporal and spatial scheduling for extended operand clustered VLIW processors.",
                    "Accelerating the secure remote password protocol using reconfigurable hardware.",
                    "SoC design of Ogg Vorbis decoder using embedded processor.",
                    "A perspective on the future of massively parallel computing: fine-grain vs. coarse-grain parallel models comparison & contrast.",
                    "Opportunities and challenges in application-tuned circuits and architectures based on nanodevices."
                ]
            }
        ]
    }
]