[
    {
        "year": "2021",
        "name": "23rd CLUSTER 2021",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2021",
                "sub_name": "IEEE International Conference on Cluster Computing, CLUSTER 2021, Portland, OR, USA, September 7-10, 2021.",
                "count": 101,
                "papers": [
                    "tcFFT: A Fast Half-Precision FFT Library for NVIDIA Tensor Cores.",
                    "MiniMod: A Modular Miniapplication Benchmarking Framework for HPC.",
                    "Reproducible Performance Optimization of Complex Applications on the Edge-to-Cloud Continuum.",
                    "WIRE: Resource-efficient Scaling with Online Prediction for DAG-based Workflows.",
                    "HPC AI500 V2.0: The Methodology, Tools, and Metrics for Benchmarking HPC AI Systems.",
                    "RPTCN: Resource Prediction for High-dynamic Workloads in Clouds based on Deep Learning.",
                    "READYS: A Reinforcement Learning Based Strategy for Heterogeneous Dynamic Scheduling.",
                    "Accelerating DNN Architecture Search at Scale Using Selective Weight Transfer.",
                    "SAP-SGD: Accelerating Distributed Parallel Training with High Communication Efficiency on Heterogeneous Clusters.",
                    "2PGraph: Accelerating GNN Training over Large Graphs on GPU Clusters.",
                    "HFlow: A Dynamic and Elastic Multi-Layered I/O Forwarder.",
                    "Building A Fast and Efficient LSM-tree Store by Integrating Local Storage with Cloud Storage.",
                    "Virtual Log-Structured Storage for High-Performance Streaming.",
                    "RISE: Reducing I/O Contention in Staging-based Extreme-Scale In-situ Workflows.",
                    "Lazy-WL: A Wear-aware Load Balanced Data Redistribution Method for Efficient SSD Array Scaling.",
                    "Streamlining distributed Deep Learning I/O with ad hoc file systems.",
                    "Accelerating GPU Message Communication for Autonomous Navigation Systems.",
                    "csTuner: Scalable Auto-tuning Framework for Complex Stencil Computation on GPUs.",
                    "Octo-Tiger's New Hydro Module and Performance Using HPX+CUDA on ORNL's Summit.",
                    "Pipelined Preconditioned s-step Conjugate Gradient Methods for Distributed Memory Systems.",
                    "Thrifty Label Propagation: Fast Connected Components for Skewed-Degree Graphs.",
                    "Optimizing Distributed Load Balancing for Workloads with Time-Varying Imbalance.",
                    "Distributed Work Stealing at Scale via Matchmaking.",
                    "Bellamy: Reusing Performance Models for Distributed Dataflow Jobs Across Contexts.",
                    "CSWAP: A Self-Tuning Compression Framework for Accelerating Tensor Swapping in GPUs.",
                    "Optimizing Error-Bounded Lossy Compression for Scientific Data on GPUs.",
                    "Exploring Autoencoder-based Error-bounded Compression for Scientific Data.",
                    "cuZ-Checker: A GPU-Based Ultra-Fast Assessment System for Lossy Compressions.",
                    "DPZ: Improving Lossy Compression Ratio with Information Retrieval on Scientific Data.",
                    "O(1) Communication for Distributed SGD through Two-Level Gradient Averaging.",
                    "Distributed Computation of Persistent Homology from Partitioned Big Data.",
                    "FineQuery: Fine-Grained Query Processing on CPU-GPU Integrated Architectures.",
                    "Packet Forwarding Cache of Commodity Switches for Parallel Computers.",
                    "Two-Chains: High Performance Framework for Function Injection and Execution.",
                    "HNGraph: Parallel Graph Processing in Hybrid Memory Based NUMA Systems.",
                    "Modeling the Linux page cache for accurate simulation of data-intensive applications.",
                    "Characterizing Impacts of Storage Faults on HPC Applications: A Methodology and Insights.",
                    "Understanding the Effects of DRAM Correctable Error Logging at Scale.",
                    "Tackling Cold Start of Serverless Applications by Efficient and Adaptive Container Runtime Reusing.",
                    "Reusability First: Toward FAIR Workflows.",
                    "Thinking More about RDMA Memory Semantics.",
                    "Monitoring Large Scale Supercomputers: A Case Study with the Lassen Supercomputer.",
                    "Robustness Analysis of Loop-Free Floating-Point Programs via Symbolic Automatic Differentiation.",
                    "Understanding Soft Error Sensitivity of Deep Learning Models and Frameworks through Checkpoint Alteration.",
                    "On-the-Fly, Robust Translation of MPI Libraries.",
                    "Daps: A Dynamic Asynchronous Progress Stealing Model for MPI Communication.",
                    "Combining One-Sided Communications with Task-Based Programming Models.",
                    "Optimizing Barrier Synchronization on ARMv8 Many-Core Architectures.",
                    "Evaluation of SPEC CPU and SPEC OMP on the A64FX.",
                    "Energy Efficiency Aspects of the AMD Zen 2 Architecture.",
                    "Explicit uncore frequency scaling for energy optimisation policies with EAR in Intel architectures.",
                    "FIRESTARTER 2: Dynamic Code Generation for Processor Stress Tests.",
                    "Cooling the Data Center: Design of a Mechanical Controls Owner Project Requirements (OPR) Template.",
                    "A Conceptual Framework for HPC Operational Data Analytics.",
                    "An Execution Fingerprint Dictionary for HPC Application Recognition.",
                    "An Integrated Job Monitor, Analyzer and Predictor.",
                    "Backfilling HPC Jobs with a Multimodal-Aware Predictor.",
                    "Sequence-RTG: Efficient and Production-Ready Pattern Mining in System Log Messages.",
                    "The Challenge of Disproportionate Importance of Temporal Features in Predicting HPC Power Consumption.",
                    "Dynamic and Adaptive Monitoring and Analysis for Many-task Ensemble Computing.",
                    "A Scalability Study of Data Exchange in HPC Multi-component Workflows.",
                    "The Case for Storage Optimization Decoupling in Deep Learning Frameworks.",
                    "MONARCH: Hierarchical Storage Management for Deep Learning Frameworks.",
                    "pMEMCPY: a simple, lightweight, and portable I/O library for storing data in persistent memory.",
                    "Parallel I/O Evaluation Techniques and Emerging HPC Workloads: A Perspective.",
                    "Special function neural network (SFNN) models.",
                    "AMR-Net: Convolutional Neural Networks for Multi-resolution Steady Flow Prediction.",
                    "A Deep Learning-Based Particle-in-Cell Method for Plasma Simulations.",
                    "Hybrid workflow of Simulation and Deep Learning on HPC: A Case Study for Material Behavior Determination.",
                    "Higgs Boson Classification: Brain-inspired BCPNN Learning with StreamBrain.",
                    "A64FX performance: experience on Ookami.",
                    "Early Evaluation of Fugaku A64FX Architecture Using Climate Workloads.",
                    "Performance Evaluation and Analysis of A64FX many-core Processor for the Fiber Miniapp Suite.",
                    "A64FX - Your Compiler You Must Decide!",
                    "Cluster of emerging technology: evaluation of a production HPC system based on A64FX.",
                    "Sequences of Sparse Matrix-Vector Multiplication on Fugaku's A64FX processors.",
                    "From Domain-Specific Languages to Memory-Optimized Accelerators for Fluid Dynamics.",
                    "Accelerating advection for atmospheric modelling on Xilinx and Intel FPGAs.",
                    "Optimisation of an FPGA Credit Default Swap engine by embracing dataflow techniques.",
                    "TIGRA: A Tightly Integrated Generic RISC-V Accelerator Interface.",
                    "HBM2 Memory System for HPC Applications on an FPGA.",
                    "A memory bandwidth improvement with memory space partitioning for single-precision floating-point FFT on Stratix 10 FPGA.",
                    "An FPGA-based storage control with load balancing.",
                    "CVFCC: CV-Based Framework for Container Consolidation in Cloud Data Centers.",
                    "A Dynamic Power Capping Library for HPC Applications.",
                    "SDIS: A PB-level seismic data index system with ML methods.",
                    "Malleability Implementation in a MPI Iterative Method.",
                    "Computational Storage to Increase the Analysis Capability of Tier-2 HEP Data Sites.",
                    "NUMA-aware I/O System Call Steering.",
                    "A Roadmap to Robust Science for High-throughput Applications: The Developers' Perspective.",
                    "A Transfer Learning Scheme for Time Series Forecasting Using Facebook Prophet.",
                    "Exploring Node Connection Modes in Multi-Rail Fat-tree.",
                    "RELAR: A Reinforcement Learning Framework for Adaptive Routing in Network-on-Chips.",
                    "A Generative Approach to Visualizing Satellite Data.",
                    "Load Balancing Policies for Nested Fork-Join.",
                    "Supporting Elastic Compaction of LSM-tree with a FaaS Cluster.",
                    "Automatic Parallelisation of Sturctured Mesh Computations with SYCL.",
                    "Halcyon: Unified HPC Center Operations.",
                    "CASQ: Accelerate Distributed Deep Learning with Sketch-Based Gradient Quantization.",
                    "Toward a Comprehensive Benchmark Suite for Evaluating GASPI in HPC Environments.",
                    "Incorporating Fault-Tolerance Awareness into System-Level Modeling and Simulation."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "22nd CLUSTER 2020",
        "info": "Kobe, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2020",
                "sub_name": "IEEE International Conference on Cluster Computing, CLUSTER 2020, Kobe, Japan, September 14-17, 2020.",
                "count": 71,
                "papers": [
                    "Efficient Process-to-Node Mapping Algorithms for Stencil Computations.",
                    "CuVPP: Filter-based Longest Prefix Matching in Software Data Planes.",
                    "HAN: a Hierarchical AutotuNed Collective Communication Framework.",
                    "DelveFS - An Event-Driven Semantic File System for Object Stores.",
                    "NeoMPX: Characterizing and Improving Estimation of Multiplexing Hardware Counters for PAPI.",
                    "Grade10: A Framework for Performance Characterization of Distributed Graph Processing.",
                    "Evaluating Worksharing Tasks on Distributed Environments.",
                    "Resilient Scheduling of Moldable Jobs on Failure-Prone Platforms.",
                    "Modeling the Performance of Scientific Workflow Executions on HPC Platforms with Burst Buffers.",
                    "Co-scheML: Interference-aware Container Co-scheduling Scheme Using Machine Learning Application Profiles for GPU Clusters.",
                    "Opportunities and limitations of Quality-of-Service in Message Passing applications on adaptively routed Dragonfly and Fat Tree networks.",
                    "MonSTer: An Out-of-the-Box Monitoring Tool for High Performance Computing Systems.",
                    "Dynamic Kernel Fusion for Bulk Non-contiguous Data Transfer on GPU Clusters.",
                    "Autoscaling High-Throughput Workloads on Container Orchestrators.",
                    "SSP: Speeding up Small Flows for Proactive Transport in Datacenters.",
                    "Quantifying the impact of network congestion on application performance and network metrics.",
                    "Analysis of Cooling Water Temperature Impact on Computing Performance and Energy Consumption.",
                    "E2Clab: Exploring the Computing Continuum through Repeatable, Replicable and Reproducible Edge-to-Cloud Experiments.",
                    "Streaming File Transfer Optimization for Distributed Science Workflows.",
                    "Exploring the Potential of Fast Delta Encoding: Marching to a Higher Compression Ratio.",
                    "Staging Based Task Execution for Data-driven, In-Situ Scientific Workflows.",
                    "Flexible Data Redistribution in a Task-Based Runtime System.",
                    "DeepClone: Lightweight State Replication of Deep Learning Models for Data Parallel Training.",
                    "Exploring Non-Volatility of Non-Volatile Memory for High Performance Computing Under Failures.",
                    "HCL: Distributing Parallel Data Structures in Extreme Scales.",
                    "Predicting MPI Collective Communication Performance Using Machine Learning.",
                    "Decomposing MPI Collectives for Exploiting Multi-lane Communication.",
                    "Power Budgeting of Big Data Applications in Container-based Clusters.",
                    "Estimating Power Consumption of Containers and Virtual Machines in Data Centers.",
                    "Fast Scalable Approximate Nearest Neighbor Search for High-dimensional Data.",
                    "A Hybrid MPI+PGAS Approach to Improve Strong Scalability Limits of Finite Element Solvers.",
                    "Towards Data-Flow Parallelization for Adaptive Mesh Refinement Applications.",
                    "Towards End-to-end SDC Detection for HPC Applications Equipped with Lossy Compression.",
                    "Efficient Execution of Dynamic Programming Algorithms on Apache Spark.",
                    "ECS2: A Fast Erasure Coding Library for GPU-Accelerated Storage Systems with Parallel & Direct IO.",
                    "tf-Darshan: Understanding Fine-grained I/O Performance in Machine Learning Workloads.",
                    "Extending High-Level Synthesis with High-Performance Computing Performance Visualization.",
                    "Parallel Particle Advection Bake-Off for Scientific Visualization Workloads.",
                    "Data Life Aware Model Updating Strategy for Stream-based Online Deep Learning.",
                    "Optimizing GPU Memory Transactions for Convolution Operations.",
                    "System-Level vs. Application-Level Checkpointing.",
                    "An HPC-based Prediction on the Practicality of Long-distance Quantum Key Distributions.",
                    "Performance Evaluation of Supercomputer Fugaku using Breadth-First Search Benchmark in Graph500.",
                    "OctCNN: An Energy-Efficient FPGA Accelerator for CNNs using Octave Convolution Algorithm.",
                    "ChOWDER: A New Approach for Viewing 3D Web GIS on Ultra-High-Resolution Scalable Display.",
                    "An FPGA-based Sound Field Rendering System.",
                    "The Case for Better Integrating Scalable Data Stores and Stream-Processing Systems.",
                    "Prompt Report on Exa-Scale HPL-AI Benchmark.",
                    "Implementing a Comprehensive Networks-on-Chip Generator with Optimal Configurations.",
                    "Toward OpenACC-enabled GPU-FPGA Accelerated Computing.",
                    "PIKA: Center-Wide and Job-Aware Cluster Monitoring.",
                    "HPC System Data Pipeline to Enable Meaningful Insights through Analysis-Driven Visualizations.",
                    "MAP: A Visual Analytics System for Job Monitoring and Analysis.",
                    "Towards workload-adaptive scheduling for HPC clusters.",
                    "Democratizing Parallel Filesystem Monitoring.",
                    "LDMS Monitoring of EDR InfiniBand Networks.",
                    "Energy Optimization and Analysis with EAR.",
                    "Toward an End-to-End Auto-tuning Framework in HPC PowerStack.",
                    "Evaluation of Power Management Control on the Supercomputer Fugaku.",
                    "HUD-Oden: A Practical Evaluation Environment for Analyzing Hot-Water Cooled Processors.",
                    "Global Experiences with HPC Operational Data Measurement, Collection and Analysis.",
                    "A Study of Operational Impact on Power Usage Effectiveness using Facility Metrics and Server Operation Logs in the K Computer.",
                    "A Supercomputing Center Experience With Cooling Control Design.",
                    "Investigative Report on Electrical Commissioning in HPC Data Centers.",
                    "Preliminary Performance Evaluation of the Fujitsu A64FX Using HPC Applications.",
                    "The Effects of Wide Vector Operations on Processor Caches.",
                    "CoreNEURON: Performance and Energy Efficiency Evaluation on Intel and Arm CPUs.",
                    "Investigating Applications on the A64FX.",
                    "Porting Applications to Arm-based Processors.",
                    "Performance Evaluation of ParalleX Execution model on Arm-based Platforms.",
                    "On the Usage of the Arm C Language Extensions for a High-Order Finite-Element Kernel."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "21st CLUSTER 2019",
        "info": "Albuquerque, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2019",
                "sub_name": "2019 IEEE International Conference on Cluster Computing, CLUSTER 2019, Albuquerque, NM, USA, September 23-26, 2019.",
                "count": 58,
                "papers": [
                    "Quantifying the Impact of Memory Errors in Deep Learning.",
                    "HarpGBDT: Optimizing Gradient Boosting Decision Tree for Parallel Efficiency.",
                    "Fast and Scalable Implementations of Influence Maximization Algorithms.",
                    "Compact Filters for Fast Online Data Partitioning.",
                    "A Quantitative Study of Deep Learning Training on Heterogeneous Supercomputers.",
                    "Propagation and Decay of Injected One-Off Delays on Clusters: A Case Study.",
                    "Improving Access to HDFS using NVMeoF.",
                    "Standardized Environment for Monitoring Heterogeneous Architectures.",
                    "On the Benefits of Anticipating Load Imbalance for Performance Optimization of Parallel Applications.",
                    "MBECN: Enabling ECN with Micro-burst Traffic in Multi-queue Data Center.",
                    "Large-Scale Analysis of the Docker Hub Dataset.",
                    "Learning from Five-year Resource-Utilization Data of Titan System.",
                    "MPI Sessions: Evaluation of an Implementation in Open MPI.",
                    "Leveraging Machine Learning for Anticipatory Data Delivery in Extreme Scale In-situ Workflows.",
                    "X-RDMA: Effective RDMA Middleware in Large-scale Production Environments.",
                    "Engineering a Distributed Histogram Sort.",
                    "Building Reliable High-Performance Storage Systems: An Empirical and Analytical Study.",
                    "Mitigating Inter-Job Interference via Process-Level Quality-of-Service.",
                    "Efficient Distributed Graph Analytics using Triply Compressed Sparse Format.",
                    "mSMS: PGAS Runtime with Efficient Thread-based Communication for Global-view Programming.",
                    "Automatic Power Saving Method by Energy Aware Job Scheduler.",
                    "Fast and Faithful Performance Prediction of MPI Applications: the HPL Case Study.",
                    "Parallelizing Training of Deep Generative Models on Massive Scientific Datasets.",
                    "RE-Store: Reliable and Efficient KV-Store with Erasure Coding and Replication.",
                    "NORNS: Extending Slurm to Support Data-Driven Workflows through Asynchronous Data Staging.",
                    "Give MPI Threading a Fair Chance: A Study of Multithreaded MPI Designs.",
                    "ClusterCockpit - A web application for job-specific performance monitoring.",
                    "Scalable, High-Order Continuity Across Block Boundaries of Functional Approximations Computed in Parallel.",
                    "Training Google Neural Machine Translation on an Intel CPU Cluster.",
                    "μDBSCAN: An Exact Scalable DBSCAN Algorithm for Big Data Exploiting Spatial Locality.",
                    "Improving Resource Utilization in Data Centers using an LSTM-based Prediction Model.",
                    "Efficient User-Level Storage Disaggregation for Deep Learning.",
                    "Leveraging Task-Based Polar Decomposition Using PARSEC on Massively Parallel Systems.",
                    "Rapidly Measuring Loop Footprints.",
                    "DiffTrace: Efficient Whole-Program Trace Analysis and Diffing for Debugging.",
                    "STASH : Fast Hierarchical Aggregation Queries for Effective Visual Spatiotemporal Explorations.",
                    "DP_Greedy: A Two-Phase Caching Algorithm for Mobile Cloud Services.",
                    "Diagnostic Analysis: Directional Relation Graph.",
                    "An Empirical Study of Cryptographic Libraries for MPI Communications.",
                    "Algorithm-Based Fault Tolerance for Parallel Stencil Computations.",
                    "LogGOPSC: A Parallel Computation Model Extending Network Contention into LogGOPS.",
                    "Improving Performance of Data Dumping with Lossy Compression for Scientific Simulation.",
                    "FluentPS: A Parameter Server Design with Low-frequency Synchronization for Distributed Deep Learning.",
                    "Accelerating Hyperdimensional Classifier on Multiple GPUs.",
                    "Kube-Knots: Resource Harvesting through Dynamic Container Orchestration in GPU-based Datacenters.",
                    "Multi-physics simulations of particle tracking in arterial geometries with a scalable moving window algorithm.",
                    "Performance Characterization of DNN Training using TensorFlow and PyTorch on Modern Clusters.",
                    "Workflows for Performance Predictable and Reproducible HPC Applications.",
                    "Design Exploration of Multi-FPGAs for Accelerating Deep Learning.",
                    "FSMonitor: Scalable File System Monitoring for Arbitrary Storage Systems.",
                    "Cost-efficiency of Large-scale Electronic Structure Simulations with Intel Xeon Phi Processors.",
                    "SMQoS: Improving Utilization and Energy Efficiency with QoS Awareness on GPUs.",
                    "Scheduling independent stochastic tasks on heterogeneous cloud platforms.",
                    "Proxy or Imposter? A Method and Case Study to Determine the Answer.",
                    "Evaluating Burst Buffer Placement in HPC Systems.",
                    "Analyzing the Impact of Lossy Compressor Variability on Checkpointing Scientific Simulations.",
                    "Harmony: An Approach for Geo-distributed Processing of Big-Data Applications.",
                    "Asynchronous Task-Based Execution of the Reverse Time Migration for the Oil and Gas Industry."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "20th CLUSTER 2018",
        "info": "Belfast, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2018",
                "sub_name": "IEEE International Conference on Cluster Computing, CLUSTER 2018, Belfast, UK, September 10-13, 2018.",
                "count": 76,
                "papers": [
                    "PaSTRI: Error-Bounded Lossy Compression for Two-Electron Integrals in Quantum Chemistry.",
                    "SALaR: Scalable and Adaptive Designs for Large Message Reduction Collectives.",
                    "Energy Analysis and Optimization for Resilient Scalable Linear Systems.",
                    "Load-Balancing-Aware Parallel Algorithms of H-Matrices with Adaptive Cross Approximation for GPUs.",
                    "A New Approach for Sparse Matrix Classification Based on Deep Learning Techniques.",
                    "Janus: A Generic QoS Framework for Software-as-a-Service Applications.",
                    "Exploring HPC and Big Data Convergence: A Graph Processing Study on Intel Knights Landing.",
                    "Whole Program Generation of Massively Parallel Shallow Water Equation Solvers.",
                    "OpenACC vs the Native Programming on Sunway TaihuLight: A Case Study with GTC-P.",
                    "Parallel Approximation of the Maximum Likelihood Estimation for the Prediction of Large-Scale Geostatistics Simulations.",
                    "Modeling I/O Performance Variability Using Conditional Variational Autoencoders.",
                    "SciDP: Support HPC and Big Data Applications via Integrated Scientific Data Processing.",
                    "Applying Pwrake Workflow System and Gfarm File System to Telescope Data Processing.",
                    "UniviStor: Integrated Hierarchical and Distributed Storage for HPC.",
                    "HIDStore: A Hierarchical Intermediate Data Storage System for Seismic Processing Application.",
                    "Performance Evaluation of Parallel Stripmap CS-SAR Imaging on NVLink-Connected GPUs.",
                    "C2-HyTM : An Adaptive Hybrid Transactional Memory Scheme as Efficient Synchronization Mechanism for Multicore Parallel Processing.",
                    "Scalable Shared-Memory Parallelization of the Block Recursive Inversion Algorithm.",
                    "Maximizing Throughput on Power-Bounded HPC Systems.",
                    "EDDAPS: An Efficient Data Distribution Approach for PCM-Based SSD.",
                    "PADS: Performance-Aware Dynamic Scheduling for Effective MapReduce Computation in Heterogeneous Clusters.",
                    "Reducing Tail Latency of Interactive Multi-tier Workloads in the Cloud.",
                    "A Non-blocking Buddy System for Scalable Memory Allocation on Multi-core Machines.",
                    "Graph Partitioning Algorithm with LSH: Poster Extended Abstract.",
                    "Neural Network Based Silent Error Detector.",
                    "An Efficient Transformation Scheme for Lossy Data Compression with Point-Wise Relative Error Bound.",
                    "A Methodology for Characterizing the Correspondence Between Real and Proxy Applications.",
                    "Lightweight Requirements Engineering for Exascale Co-design.",
                    "Next Stop \"NoOps\": Enabling Cross-System Diagnostics Through Graph-Based Composition of Logs and Metrics.",
                    "Cutting the Tail: Designing High Performance Message Brokers to Reduce Tail Latencies in Stream Processing.",
                    "Dynamic Control of CPU Usage in a Lambda Platform.",
                    "A Heterogeneity-Aware Task Scheduler for Spark.",
                    "Computing Exact Vertex Eccentricity on Massive-Scale Distributed Graphs.",
                    "A Scalable Distributed Louvain Algorithm for Large-Scale Graph Community Detection.",
                    "Optimizing Distributed Data-Intensive Workflows.",
                    "Harmonia: An Interference-Aware Dynamic I/O Scheduler for Shared Non-volatile Burst Buffers.",
                    "CRUM: Checkpoint-Restart Support for CUDA's Unified Memory.",
                    "Fixed-PSNR Lossy Compression for Scientific Data.",
                    "GekkoFS - A Temporary Distributed File System for HPC Applications.",
                    "Hierarchical Clock Synchronization in MPI.",
                    "Hybrid MPI+OpenMP Reactive Work Stealing in Distributed Memory in the PDE Framework sam(oa)^2.",
                    "Co-Scheduling HPC Workloads on Cache-Partitioned CMP Platforms.",
                    "Leveraging Dependency in Scheduling and Preemption for High Throughput in Data-Parallel Clusters.",
                    "Self-Consumption Optimization of Renewable Energy Production in Distributed Clouds.",
                    "Elasticity in Graph Analytics? A Benchmarking Framework for Elastic Graph Processing.",
                    "Efficient Training of Convolutional Neural Nets on Large Distributed Systems.",
                    "Accelerating Deep Learning Frameworks with Micro-Batches.",
                    "swCaffe: A Parallel Framework for Accelerating Deep Learning Applications on Sunway TaihuLight.",
                    "CharmPy: A Python Parallel Programming Model.",
                    "And Now for Something Completely Different: Running Lisp on GPUs.",
                    "The AllScale Runtime Application Model.",
                    "PDFE: Flexible Parallel State Machine Replication for Cloud Computing.",
                    "IOMiner: Large-Scale Analytics Framework for Gaining Knowledge from I/O Logs.",
                    "A Transparent Server-Managed Object Storage System for HPC.",
                    "Efficient Algorithms for the Summed Area Tables Primitive on GPUs.",
                    "Relaxing Scalability Limits with Speculative Parallelism in Sequential Monte Carlo.",
                    "Predicting Performance Using Collaborative Filtering.",
                    "A Failure Prediction-Based Adaptive Checkpointing Method with Less Reliance on Temperature Monitoring for HPC Applications.",
                    "Challenges in Developing MPI Fault-Tolerant Fortran Applications.",
                    "Large-Scale System Monitoring Experiences and Recommendations.",
                    "Modeling Expected Application Runtime for Characterizing and Assessing Job Performance.",
                    "Improving Power Efficiency Through Fine-Grain Performance Monitoring in HPC Clusters.",
                    "Characterizing Supercomputer Traffic Networks Through Link-Level Analysis.",
                    "A Big Data Analytics Framework for HPC Log Data: Three Case Studies Using the Titan Supercomputer Log.",
                    "Federating XDMoD to Monitor Affiliated Computing Resources.",
                    "MiniApp for Density Matrix Renormalization Group Hamiltonian Application Kernel.",
                    "UnSNAP: A Mini-App for Exploring the Performance of Deterministic Discrete Ordinates Transport on Unstructured Meshes.",
                    "Towards a Mini-App for Smoothed Particle Hydrodynamics at Exascale.",
                    "BookLeaf: An Unstructured Hydrodynamics Mini-Application.",
                    "SVE-Enabling Lattice QCD Codes.",
                    "Optimizations of COAWST for a Large Simulation on the Earth Simulator.",
                    "Simulating SVE-Optimised Genomics Workloads on Gem5.",
                    "Performing SVE Studies using the Arm Instruction Emulator.",
                    "Stillwater Knowledge Processing Unit (KPU^TM).",
                    "Cost Modelling for Vectorization on ARM.",
                    "The Tofu Interconnect D."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th CLUSTER 2017",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2017",
                "sub_name": "2017 IEEE International Conference on Cluster Computing, CLUSTER 2017, Honolulu, HI, USA, September 5-8, 2017.",
                "count": 120,
                "papers": [
                    "Towards Practical and Robust Labeled Pattern Matching in Trillion-Edge Graphs.",
                    "Contention-Aware Kernel-Assisted MPI Collectives for Multi-/Many-Core Systems.",
                    "Parallel and Efficient Sensitivity Analysis of Microscopy Image Segmentation Workflows in Hybrid Systems.",
                    "S-Aligner: Ultrascalable Read Mapping on Sunway Taihu Light.",
                    "A Unified Optimization Approach for Sparse Tensor Operations on GPUs.",
                    "Canopus: A Paradigm Shift Towards Elastic Extreme-Scale Data Analytics on HPC Storage.",
                    "TAPIOCA: An I/O Library for Optimized Topology-Aware Data Aggregation on Large-Scale Supercomputers.",
                    "Could Blobs Fuel Storage-Based Convergence Between HPC and Big Data?",
                    "Eley: On the Effectiveness of Burst Buffers for Big Data Processing in HPC Systems.",
                    "Predicting the Energy-Consumption of MPI Applications at Scale Using Only a Single Node.",
                    "Mira: A Framework for Static Performance Analysis.",
                    "Delay Spotter: A Tool for Spotting Scheduler-Caused Delays in Task Parallel Runtime Systems.",
                    "Automating the Application Data Placement in Hybrid Memory Systems.",
                    "QoS- and Contention- Aware Resource Provisioning in a Stream Processing Engine.",
                    "Runtime Techniques for Programming with Fast and Slow Memory.",
                    "Utility-Based Hybrid Memory Management.",
                    "Performance Modeling for Optimal Data Placement on GPU with Heterogeneous Memory Systems.",
                    "A Case for Uni-directional Network Topologies in Large-Scale Clusters.",
                    "A Wait-Free Multi-word Atomic (1, N) Register for Large-Scale Data Sharing on Multi-core Machines.",
                    "Visual Analytics Techniques for Exploring the Design Space of Large-Scale High-Radix Networks.",
                    "Quantifying I/O and Communication Traffic Interference on Dragonfly Networks Equipped with Burst Buffers.",
                    "Spatiotemporal Wavelet Compression for Visualization of Scientific Simulation Data.",
                    "AUTOBAHN: Accelerating Concurrent, Durable File I/O via a Non-volatile Buffer.",
                    "Justice: A Deadline-Aware, Fair-Share Resource Allocator for Implementing Multi-Analytics.",
                    "Accelerating a Burst Buffer Via User-Level I/O Isolation.",
                    "GraphH: High Performance Big Graph Analytics in Small Clusters.",
                    "Parallel Multivariate Spatio-Temporal Clustering of Large Ecological Datasets on Hybrid Supercomputers.",
                    "A Comparison of Graph-Based Synthetic Data Generators for Benchmarking Next-Generation Intrusion Detection Systems.",
                    "Dynamically Compiled Artifact Sharing for Clouds.",
                    "ConVGPU: GPU Management Middleware in Container Based Virtualized Environment.",
                    "Enabling Diverse Software Stacks on Supercomputers Using High Performance Virtual Clusters.",
                    "EclipseMR: Distributed and Parallel Task Processing with Consistent Hashing.",
                    "Understanding the Role of GPGPU-Accelerated SoC-Based ARM Clusters.",
                    "Effective Running of End-to-End HPC Workflows on Emerging Heterogeneous Architectures.",
                    "High Throughput and Low Latency on Hadoop Clusters Using Explicit Congestion Notification: The Untold Truth.",
                    "A Scalable Network-Based Performance Analysis Tool for MPI on Large-Scale HPC Systems.",
                    "SoMeta: Scalable Object-Centric Metadata Management for High Performance Computing.",
                    "Automatic Data Filtering for In Situ Workflows.",
                    "Task Allocation for Stream Processing with Recovery Latency Guarantee.",
                    "A Comparative Analysis of Materialized Views Selection and Concurrency Control Mechanisms in NoSQL Databases.",
                    "Automatic, Abstracted and Portable Topology-Aware Thread Placement.",
                    "Dynamic Co-Scheduling Driven by Main Memory Bandwidth Utilization.",
                    "Tracking System Behavior from Resource Usage Data.",
                    "Flexible Data Aggregation for Performance Profiling.",
                    "Implementing Lattice QCD Application with XcalableACC Language on Accelerated Cluster.",
                    "DH-Falcon: A Language for Large-Scale Graph Processing on Distributed Heterogeneous Systems.",
                    "Fast Failure Erasure Encoding Using Just in Time Compilation for CPUs, GPUs, and FPGAs.",
                    "Toward a General Theory of Optimal Checkpoint Placement.",
                    "Algorithm-Directed Crash Consistence in Non-volatile Memory for HPC.",
                    "Checkpointing Workflows for Fail-Stop Errors.",
                    "Exploring On-Node Parallelism with Neutral, a Monte Carlo Neutral Particle Transport Mini-App.",
                    "Manala: A Flexible Flow Control Library for Asynchronous Task Communication.",
                    "Distributed Affine-Invariant MCMC Sampler.",
                    "A Stencil Framework to Realize Large-Scale Computations Beyond Device Memory Capacity on GPU Supercomputers.",
                    "Trade-Off Between Prediction Accuracy and Underestimation Rate in Job Runtime Estimates.",
                    "CLIP: Cluster-Level Intelligent Power Coordination for Power-Bounded Systems.",
                    "Pure Functions in C: A Small Keyword for Automatic Parallelization.",
                    "The Effect of Resource Allocation and System Events on VM Consolidation.",
                    "Extending Skel to Support the Development and Optimization of Next Generation I/O Systems.",
                    "keybin: Key-Based Binning for Distributed Clustering.",
                    "Optimizing the Datapath for Key-value Middleware with NVMe SSDs over RDMA Interconnects.",
                    "TGE: Machine Learning Based Task Graph Embedding for Large-Scale Topology Mapping.",
                    "Detection of Silent Data Corruption in Adaptive Numerical Integration Solvers.",
                    "Evaluating the Viability of Using Compression to Mitigate Silent Corruption of Read-Mostly Application Data.",
                    "A Gaussian Process Approach for Effective Soft Error Detection.",
                    "A Novel Hybrid Transactional Memory Based on Abort Prediction and Adaptive Retry Policy.",
                    "Mitigating the Write Amplification Problem of Write-Optimized File Systems on Flash Storage.",
                    "Acceleration of Turbulent Flow Simulations with Intel Xeon Phi(TM) Manycore Processors.",
                    "Distributed Parallel Backprojection for Real-Time Stripmap SAR Imaging on GPU Clusters.",
                    "Parallelized Recovery of Hundreds of Millions Small Data Objects.",
                    "OmniGraph: A Scalable Hardware Accelerator for Graph Processing.",
                    "A Comparative Study of HDD and SSD RAIDs' Impact on Server Energy Consumption.",
                    "Analyzing Hybrid Transactional Memory Performance Using Intel SDE.",
                    "A Power-Efficient Accelerator Based on FPGAs for LSTM Network.",
                    "A Power-Efficient Accelerator for Convolutional Neural Networks.",
                    "Investigating the Effect of Garbage Collection on Service Level Objectives of Clouds.",
                    "Performance of Large-Scale Electronic Structure Calculations on Built-in FPGA Systems.",
                    "Efficient Swap Protocol of Remote Memory Paging for Out-of-Core Multi-thread Applications.",
                    "Evaluating Effect of Write Combining on PCIe Throughput to Improve HPC Interconnect Performance.",
                    "Preliminary Interference Study About Job Placement and Routing Algorithms in the Fat-Tree Topology for HPC Applications.",
                    "A Preliminary Study of Intra-Application Interference on Dragonfly Network.",
                    "A New Direction for Streaming Graph Analysis.",
                    "SharP Hash: A High-Performing Distributed Hash for Extreme-Scale Systems.",
                    "AMM: Scalable Memory Reuse Model to Predict the Performance of Physics Codes.",
                    "A Probabilistic Monte Carlo Framework for Branch Prediction.",
                    "HPC-Oriented Toolchain for Hardware Simulators.",
                    "Introducing Weirs: An Abstraction for Next Generation Streaming Workflows.",
                    "A Comparison of Parallel Graph Processing Implementations.",
                    "Co-locating Graph Analytics and HPC Applications.",
                    "Accelerating Smith-Waterman Alignment Workload with Scalable Vector Computing.",
                    "Halide Vectorization for Android Photography Applications - A Case Study.",
                    "Preliminary Performance Evaluation of Application Kernels Using ARM SVE with Multiple Vector Lengths.",
                    "Vectorization-Aware Loop Optimization with User-Defined Code Transformations.",
                    "Performance and Power Analysis of SX-ACE Using HP-X Benchmark Programs.",
                    "Performance Evaluation of Quantum ESPRESSO on NEC SX-ACE.",
                    "Assuming Failure Independence: Are We Right to be Wrong?",
                    "MACORD: Online Adaptive Machine Learning Framework for Silent Error Detection.",
                    "cudaCR: An In-Kernel Application-Level Checkpoint/Restart Scheme for CUDA-Enabled GPUs.",
                    "Application-Based Fault Tolerance Techniques for Fully Protecting Sparse Matrix Solvers.",
                    "Performance Implications of Failures on MapReduce Applications.",
                    "A Malleable and Fault-Tolerant Task Pool Framework for X10.",
                    "Big Data Meets HPC Log Analytics: Scalable Approach to Understanding Systems at Extreme Scale.",
                    "Data Mining-Based Analysis of HPC Center Operations.",
                    "Job Storage Performance Monitoring on Sonexion with Project Caribou.",
                    "LIKWID Monitoring Stack: A Flexible Framework Enabling Job Specific Performance monitoring for the masses.",
                    "Monitoring Infrastructure: The Challenges of Moving Beyond Petascale.",
                    "PFAnalyzer: A Toolset for Analyzing Application-Aware Dynamic Interconnects.",
                    "Holistic Measurement-Driven System Assessment.",
                    "lo2s - Multi-core System and Application Performance Analysis for Linux.",
                    "Measuring Minimum Switch Port Metric Retrieval Time and Impact for Multi-layer InfiniBand Fabrics.",
                    "Understanding Performance Variability on the Aries Dragonfly Network.",
                    "YAViT (Yet Another Viz Tool): Raising the Level of Abstraction in End-User HPC Interactions.",
                    "Assessing Representativeness of Kernels Using Descriptive Statistics.",
                    "A Performance Projection of Mini-Applications onto Benchmarks Toward the Performance Projection of Real-Applications.",
                    "Achieving Performance Portability for a Heat Conduction Solver Mini-Application on Modern Multi-core Systems.",
                    "TeaLeaf: A Mini-Application to Enable Design-Space Explorations for Iterative Sparse Linear Solvers.",
                    "The Arch Project: Physics Mini-Apps for Algorithmic Exploration and Evaluating Programming Environments on HPC Architectures.",
                    "Thoughtful Precision in Mini-Apps.",
                    "Quicksilver: A Proxy App for the Monte Carlo Transport Code Mercury.",
                    "Pushing the Limits of Irregular Access Patterns on Emerging Network Architecture: A Case Study."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th CLUSTER 2016",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2016",
                "sub_name": "2016 IEEE International Conference on Cluster Computing, CLUSTER 2016, Taipei, Taiwan, September 12-16, 2016.",
                "count": 82,
                "papers": [
                    "Adaptive and Dynamic Design for MPI Tag Matching.",
                    "A Low Disk-Bound Transaction Logging System for In-memory Distributed Data Stores.",
                    "Realizing Out-of-Core Stencil Computations Using Multi-tier Memory Hierarchy on GPGPU Clusters.",
                    "Parallel DTFE Surface Density Field Reconstruction.",
                    "Evaluation of Topology-Aware Broadcast Algorithms for Dragonfly Networks.",
                    "(SAI) Stalled, Active and Idle: Characterizing Power and Performance of Large-Scale Dragonfly Networks.",
                    "Compiler-Assisted Overlapping of Communication and Computation in MPI Applications.",
                    "vProbe: Scheduling Virtual Machines on NUMA Systems.",
                    "GLAP: Distributed Dynamic Workload Consolidation through Gossip-Based Learning.",
                    "CORP: Cooperative Opportunistic Resource Provisioning for Short-Lived Jobs in Cloud Systems.",
                    "Towards Resource Disaggregation - Memory Scavenging for Scientific Workloads.",
                    "CHOPPER: Optimizing Data Partitioning for In-memory Data Analytics Frameworks.",
                    "Improving Collective I/O Performance Using Non-volatile Memory Devices.",
                    "SMARTPARTITION: Efficient Partitioning for Natural Graphs.",
                    "Accelerating I/O Performance of SVM on HDFS.",
                    "Energy and Performance Efficient Underloading Detection Algorithm of Virtual Machines in Cloud Data Centers.",
                    "Machine Status Prediction for Dynamic and Heterogenous Cloud Environment.",
                    "Design and Analysis of Fault Tolerance Mechanisms for Big Data Transfers.",
                    "Time Optimization Modeling for Big Data Placement and Analysis for Geo-Distributed Data Centers.",
                    "Enhancing Performance of Large-Scale Electronic Structure Calculations with Many-Core Computing.",
                    "Reduced-Precision Floating-Point Formats on GPUs for High Performance and Energy Efficient Computation.",
                    "Themis: A Scalable Performance Evaluation Framework for Virtualized Datacenter.",
                    "Conflict Prediction-Based Transaction Execution for Transactional Memory in Multi-core In-memory Databases.",
                    "Skyline Service Selection Based on QoS Prediction.",
                    "Minimizing CMT Miss Penalty in Selective Page-Level Address Mapping Table.",
                    "Efficient Semantic-Aware Coflow Scheduling for Data-Parallel Jobs.",
                    "Quick Eviction of Virtual Machines through Proactive Snapshots.",
                    "Spatial Locality Aware, Fast, and Scalable SLINK Algorithm for Commodity Clusters.",
                    "High Throughput Log-Based Replication for Many Small In-Memory Objects.",
                    "TwinPCG: Dual Thread Redundancy with forward Recovery for Preconditioned Conjugate Gradient Methods.",
                    "Optimizing Locality by Topology-Aware Placement for a Task Based Programming Model.",
                    "SSDUP: An Efficient SSD Write Buffer Using Pipeline.",
                    "streamingRPHash: Random Projection Clustering of High-Dimensional Data in a MapReduce Framework.",
                    "SuperGlue: Standardizing Glue Components for HPC Workflows.",
                    "Fast Multi-parameter Performance Modeling.",
                    "Active Learning in Performance Analysis.",
                    "A Model for Weak Scaling to Many GPUs at the Basis of the Linpack Benchmark.",
                    "When Amdahl Meets Young/Daly.",
                    "A Case for Criticality Models in Exascale Systems.",
                    "Dynamically Building Energy Proportional Data Centers with Heterogeneous Computing Resources.",
                    "On Energy Proportionality and Time-Energy Performance of Heterogeneous Clusters.",
                    "Unequal Failure Protection Coding Technology for Cloud Storage Systems.",
                    "Probabilistic Network-Aware Task Placement for MapReduce Scheduling.",
                    "Tiresias: Low-Overhead Sample Based Scheduling with Task Hopping.",
                    "Machine Learning Predictions of Runtime and IO Traffic on High-End Clusters.",
                    "Exploring Plan-Based Scheduling for Large-Scale Computing Systems.",
                    "Adaptive Performance-Constrained In Situ Visualization of Atmospheric Simulations.",
                    "Bredala: Semantic Data Redistribution for In Situ Applications.",
                    "Exploring Data Migration for Future Deep-Memory Many-Core Systems.",
                    "GraphMeta: A Graph-Based Engine for Managing Large-Scale HPC Rich Metadata.",
                    "Extending SSD Lifetime with Persistent In-Memory Metadata Management.",
                    "FlashStager: Improving the Performance of SSD-Based Data Staging Systems via Write Redirection.",
                    "Performance Optimization for All Flash Scale-Out Storage.",
                    "Distributed Parallel #SAT Solving.",
                    "Smart-MLlib: A High-Performance Machine-Learning Library.",
                    "Distributed Bayesian Probabilistic Matrix Factorization.",
                    "A Software-Defined Storage for Workflow Applications.",
                    "VOLAP: A Scalable Distributed System for Real-Time OLAP with High Velocity Data.",
                    "Horme: Random Access Big Data Analytics.",
                    "In-cache MapReduce: Leverage Tiling to Boost Temporal Locality-Sensitive MapReduce Computations.",
                    "Intra-host Rate Control with Centralized Approach.",
                    "Fast Big Data Analysis in Geo-Distributed Cloud.",
                    "A Lightweight Causal Message Logging Protocol to Lower Fault Tolerance Overhead.",
                    "Design and Implementation for Checkpointing of Distributed Resources Using Process-Level Virtualization.",
                    "Deduplication Potential of HPC Applications' Checkpoints.",
                    "A Comparative Survey of the HPC and Big Data Paradigms: Analysis and Experiments.",
                    "Spark Versus Flink: Understanding Performance in Big Data Analytics Frameworks.",
                    "Results of a Model for Hadoop YARN MapReduce Tasks.",
                    "Application-Assisted Writeback for Hadoop Clusters.",
                    "Custody: Towards Data-Aware Resource Sharing in Cloud-Based Big Data Processing.",
                    "ARCS: Adaptive Runtime Configuration Selection for Power-Constrained OpenMP Applications.",
                    "A Review of Lightweight Thread Approaches for High Performance Computing.",
                    "Directive-Based Pipelining Extension for OpenMP.",
                    "Serving More GPU Jobs, with Low Penalty, Using Remote GPU Execution and Migration.",
                    "VarySched: A Framework for Variable Scheduling in Heterogeneous Environments.",
                    "Extending the Roofline Model for Asynchronous Many-Task Runtimes.",
                    "FTS 2016 Workshop Keynote Speech.",
                    "A Runtime Heuristic to Selectively Replicate Tasks for Application-Specific Reliability Targets.",
                    "TwinPCG: Dual Thread Redundancy with Forward Recovery for Preconditioned Conjugate Gradient Methods.",
                    "An ABFT Scheme Based on Communication Characteristics.",
                    "Separation Kernel Robustness Testing: The XtratuM Case Study.",
                    "MBL: A Multi-stage Bufferless High-radix Router."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th CLUSTER 2015",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2015",
                "sub_name": "2015 IEEE International Conference on Cluster Computing, CLUSTER 2015, Chicago, IL, USA, September 8-11, 2015.",
                "count": 135,
                "papers": [
                    "Parallel Modularity-Based Community Detection on Large-Scale Graphs.",
                    "Optimizing Explicit Hydrodynamics for Power, Energy, and Performance.",
                    "Machines Tuning Machines: Configuring Distributed Stream Processors with Bayesian Optimization.",
                    "Workload-Aware Resource Reservation for Multi-tenant NoSQL.",
                    "Automatic Command Queue Scheduling for Task-Parallel Workloads in OpenCL.",
                    "Taming Non-local Stragglers Using Efficient Prefetching in MapReduce.",
                    "IOSIG+: On the Role of I/O Tracing and Analysis for Hadoop Systems.",
                    "Exploring Memory Hierarchy to Improve Scientific Data Read Performance.",
                    "A Case Study of Optimizing Big Data Analytical Stacks Using Structured Data Shuffling.",
                    "An SSD-HDD Integrated Storage Architecture for Write-Once-Read-Once Applications on Clusters.",
                    "Exploiting GPUDirect RDMA in Designing High Performance OpenSHMEM for NVIDIA GPU Clusters.",
                    "Improving Strong-Scaling on GPU Cluster Based on Tightly Coupled Accelerators Architecture.",
                    "Exploring the Suitability of Remote GPGPU Virtualization for the OpenACC Programming Model Using rCUDA.",
                    "PLB-HeC: A Profile-Based Load-Balancing Algorithm for Heterogeneous CPU-GPU Clusters.",
                    "A TSQR Based Krylov Basis Computation Method on Hybrid GPU Cluster.",
                    "Fast and Accurate Support Vector Machines on Large Scale Systems.",
                    "A Machine-Learning Approach for Communication Prediction of Large-Scale Applications.",
                    "Collective I/O Tuning Using Analytical and Machine Learning Models.",
                    "Large Scale Frequent Pattern Mining Using MPI One-Sided Model.",
                    "Fast Fault Injection and Sensitivity Analysis for Collective Communications.",
                    "A Practical Approach for Handling Soft Errors in Iterative Applications.",
                    "Ensuring Data Durability with Increasingly Interdependent Content.",
                    "On the Need for Reproducible Numerical Accuracy through Intelligent Runtime Selection of Reduction Algorithms at the Extreme Scale.",
                    "Towards Building Resilient Scientific Applications: Resilience Analysis on the Impact of Soft Error and Transient Error Tolerance with the CLAMR Hydrodynamics Mini-App.",
                    "DINO: Divergent Node Cloning for Sustained Redundancy in HPC.",
                    "Dynamic Model-Driven Parallel I/O Performance Tuning.",
                    "TRIO: Burst Buffer Based I/O Orchestration.",
                    "BPS: A Balanced Partial Stripe Write Scheme to Improve the Write Performance of RAID-6.",
                    "RDMA-Based Direct Transfer of File Data to Remote Page Cache.",
                    "High Performance MPI Datatype Support with User-Mode Memory Registration: Challenges, Designs, and Benefits.",
                    "Overcoming Hadoop Scaling Limitations through Distributed Task Execution.",
                    "SideWalk: A Facility of Lightweight Out-of-Band Communications for Augmenting Distributed Data Processing Flows.",
                    "High-Performance, Distributed Dictionary Encoding of RDF Datasets.",
                    "I/O-Aware Batch Scheduling for Petascale Computing Systems.",
                    "Performance-to-Power Ratio Aware Virtual Machine (VM) Allocation in Energy-Efficient Clouds.",
                    "A Workload-Aware Energy Model for Virtual Machine Migration.",
                    "GraphTrek: Asynchronous Graph Traversal for Property Graph-Based Metadata Management.",
                    "Towards Multi-site Metadata Management for Geographically Distributed Cloud Workflows.",
                    "PaRSEC in Practice: Optimizing a Legacy Chemistry Application through Distributed Task-Based Execution.",
                    "Optimizing I/O for Petascale Seismic Simulations on Unstructured Meshes.",
                    "LBM-HPC - An Open-Source Tool for Fluid Simulations. Case Study: Unified Parallel C (UPC-PGAS).",
                    "Scaling Data Intensive Physics Applications to 10k Cores on Non-dedicated Clusters with Lobster.",
                    "RE-PAGE: Domain-Specific REplication and PArallel Processing of GEnomic Data.",
                    "Re-evaluating Network Onload vs. Offload for the Many-Core Era.",
                    "Fast Calculation of Max-Min Fair Rates for Multi-commodity Flows in Fat-Tree Networks.",
                    "Comparing Global Link Arrangements for Dragonfly Networks.",
                    "Towards the InfiniBand SR-IOV vSwitch Architecture.",
                    "MPC: A Massively Parallel Compression Algorithm for Scientific Data.",
                    "Balancing Thread-Level and Task-Level Parallelism for Data-Intensive Workloads on Clusters and Clouds.",
                    "LU Factorization: Towards Hiding Communication Overheads with a Lookahead-Free Algorithm.",
                    "Distributed-Memory Algorithms for Maximal Cardinality Matching Using Matrix Algebra.",
                    "The Cost of Synchronizing Imbalanced Processes in Message Passing Systems.",
                    "An Approach to Selecting Thread + Process Mixes for Hybrid MPI + OpenMP Applications.",
                    "On the Application Task Granularity and the Interplay with the Scheduling Overhead in Many-Core Shared Memory Systems.",
                    "OpenSHMEM as a Portable Communication Layer for PGAS Models: A Case Study with Coarray Fortran.",
                    "A Team-Based Methodology of Memory Hierarchy-Aware Runtime Support in Coarray Fortran.",
                    "Optimizing Caching DSM for Distributed Software Speculation.",
                    "Empirical Comparison of Three Versioning Architectures.",
                    "Detecting Thread-Safety Violations in Hybrid OpenMP/MPI Programs.",
                    "Toward Rapid Understanding of Production HPC Applications and Systems.",
                    "ObsCon: Integrated Monitoring and Control for Parallel, Real-Time Applications.",
                    "VecMeter: Measuring Vectorization on the Xeon Phi.",
                    "Toward Interlanguage Parallel Scripting for Distributed-Memory Scientific Computing.",
                    "A Cache Management Scheme for Hiding Garbage Collection Latency in Flash-Based Solid State Drives.",
                    "A Performance Comparison of CUDA Remote GPU Virtualization Frameworks.",
                    "A Two-Tiered Approach to I/O Quality of Service in Docker Containers.",
                    "Accelerating Laue Depth Reconstruction Algorithm with CUDA.",
                    "An FPGA-Based Accelerator for Neighborhood-Based Collaborative Filtering Recommendation Algorithms.",
                    "Can Cloud Service Get His Family? A Step Towards Service Family Detecting.",
                    "Design a Hash-Based Control Mechanism in vSwitch for Software-Defined Networking Environment.",
                    "Development of MapReduce and MPI Programs for Motif Search.",
                    "Distributed Modular Monitoring (DiMMon) Approach to Supercomputer Monitoring.",
                    "Efficient Distributed Data Clustering on Spark.",
                    "Energy-Aware Job Management Approaches for Workflow in Cloud.",
                    "Evaluating R-Based Big Data Analytic Frameworks.",
                    "Evaluating the Support of MTC Applications on Intel Xeon Phi Many-Core Accelerators.",
                    "Flexible Error Recovery Using Versions in Global View Resilience.",
                    "GO-Docker: A Batch Scheduling System with Docker Containers.",
                    "GRAPH/Z: A Key-Value Store Based Scalable Graph Processing System.",
                    "Highly Scalable Parallel Search-Tree Algorithms: The Virtual Topology Approach.",
                    "HRDBMS: A NewSQL Database for Analytics.",
                    "Minimizing Data Transmission Latency by Bipartite Graph in MapReduce.",
                    "monBench: A Database Performance Benchmark for Cloud Monitoring System.",
                    "Mutated Near Optimal Vertex Cover Algorithm (NOVCA) Visualization on a Tile Display.",
                    "Network Quality of Service in Docker Containers.",
                    "Pallas: An Application-Driven Task and Network Simulation Framework.",
                    "Peer Comparison of XSEDE and NCAR Publication Data.",
                    "Performance of the NVIDIA Jetson TK1 in HPC.",
                    "Dynamic CPU Resource Allocation in Containerized Cloud Environments.",
                    "Toward Auto-tuned Krylov Basis Computation for Different Sparse Matrix Formats and Interconnects on GPU Clusters.",
                    "Towards Building a Lightweight Key-Value Store on Parallel File System.",
                    "Understanding the Propagation of Error Due to a Silent Data Corruption in a Sparse Matrix Vector Multiply.",
                    "Exploiting Spatial Information in Datasets to Enable Fault Tolerant Sparse Matrix Solvers.",
                    "Partial Differential Equations Preconditioner Resilient to Soft and Hard Faults.",
                    "Fault-Tolerant Protocol for Hybrid Task-Parallel Message-Passing Applications.",
                    "Programmer-Guided Reliability for Extreme-Scale Applications.",
                    "Building a Fault Tolerant Application Using the GASPI Communication Layer.",
                    "Stay Alive, Don't Give Up: DUE and SDC Reduction with Memory Repair.",
                    "Detecting and Correcting Data Corruption in Stencil Applications through Multivariate Interpolation.",
                    "Pairwise Sequence Alignment with Gaps with GPU.",
                    "Scalable Relativistic High-Resolution Shock-Capturing for Heterogeneous Computing.",
                    "On the Execution of Computationally Intensive CPU-Based Libraries on Remote Accelerators for Increasing Performance: Early Experience with the OpenBLAS and FFTW Libraries.",
                    "Hybrid Communication with TCA and InfiniBand on a Parallel Programming Language XcalableACC for GPU Clusters.",
                    "Evaluation of FFT for GPU Cluster Using Tightly Coupled Accelerators Architecture.",
                    "Analysis of XDMoD/SUPReMM Data Using Machine Learning Techniques.",
                    "Practical Resource Monitoring for Robust High Throughput Computing.",
                    "New Systems, New Behaviors, New Patterns: Monitoring Insights from System Standup.",
                    "A LogP Extension for Modeling Tree Aggregation Networks.",
                    "Push Me Pull You: Integrating Opposing Data Transport Modes for Efficient HPC Application Monitoring.",
                    "The Performance Implication of Task Size for Applications on the HPX Runtime System.",
                    "Comparison of Vendor Supplied Environmental Data Collection Mechanisms.",
                    "WattProf: A Flexible Platform for Fine-Grained HPC Power Profiling.",
                    "Real Time Visualization of Monitoring Data for Large Scale HPC Systems.",
                    "Evolution of Monitoring over the Lifetime of a High Performance Computing Cluster.",
                    "Monitoring High Performance Computing Systems for the End User.",
                    "Extending LDMS to Enable Performance Monitoring in Multi-core Applications.",
                    "Performance Evaluation of Unstructured Mesh Physics on Advanced Architectures.",
                    "Expressing Parallelism on Many-Core for Deterministic Discrete Ordinates Transport.",
                    "Design and Development of Domain Specific Active Libraries with Proxy Applications.",
                    "Enabling Tractable Exploration of the Performance of Adaptive Mesh Refinement.",
                    "Developing MiniApps on Modern Platforms Using Multiple Programming Models.",
                    "Evaluation of Parallel Communication Models in Nekbone, a Nek5000 Mini-Application.",
                    "Mini-App Driven Optimisation of Inertial Confinement Fusion Codes.",
                    "Introducing and Exploiting Hierarchical Structural Information.",
                    "CMT-bone: A Mini-App for Compressible Multiphase Turbulence Simulation Software.",
                    "Fault-Tolerant Routing for Exascale Supercomputer: The BXI Routing Architecture.",
                    "Throughput Unfairness in Dragonfly Networks under Realistic Traffic Patterns.",
                    "Modeling a Large Data-Acquisition Network in a Simulation Framework.",
                    "Efficient Queuing Schemes for HoL-Blocking Reduction in Dragonfly Topologies with Minimal-Path Routing.",
                    "InfiniBand Verbs Optimizations for Remote GPU Virtualization.",
                    "Multipath Load Balancing for M × N Communication Patterns on the Blue Gene/Q Supercomputer Interconnection Network.",
                    "VEF Traces: A Framework for Modelling MPI Traffic in Interconnection Network Simulators.",
                    "SlimUpdate: Minimal Routing Update for Performance-Based Reconfigurations in Fat-Trees.",
                    "XCBC and XNIT - Tools for Cluster Implementation and Management in Research and Training.",
                    "Building Bridges from the Campus to XSEDE."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th CLUSTER 2014",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2014",
                "sub_name": "2014 IEEE International Conference on Cluster Computing, CLUSTER 2014, Madrid, Spain, September 22-26, 2014.",
                "count": 61,
                "papers": [
                    "Exploring void search for fault detection on extreme scale systems.",
                    "High performance OpenSHMEM for Xeon Phi clusters: Extensions, runtime designs and application co-design.",
                    "Scalable replay with partial-order dependencies for message-logging fault tolerance.",
                    "Applying frequency analysis techniques to dag-based workflows to benchmark and predict resource behavior on non-dedicated clusters.",
                    "GIRAFFE: A scalable distributed coordination service for large-scale systems.",
                    "Evaluating job packing in warehouse-scale computing.",
                    "KOALA-C: A task allocator for integrated multicluster and multicloud environments.",
                    "On the use of microservers in supporting hadoop applications.",
                    "zFabric: How to virtualize lossless ethernet?",
                    "Checkpoint/restart in practice: When 'simple is better'.",
                    "To checkpoint or not to checkpoint: Understanding energy-performance-I/O tradeoffs in HPC checkpointing.",
                    "Digging deeper into cluster system logs for failure prediction and root cause diagnosis.",
                    "Memory management for billions of small objects in a distributed in-memory storage.",
                    "Toward the efficient use of multiple explicitly managed memory subsystems.",
                    "Software technologies coping with memory hierarchy of GPGPU clusters for stencil computations.",
                    "Balancing job performance with system performance via locality-aware scheduling on torus-connected systems.",
                    "A spatiotemporal data aggregation technique for performance analysis of large-scale execution traces.",
                    "Efficient speed (ES): Adaptive DVFS and clock modulation for energy efficiency.",
                    "Disk cache-aware task scheduling for data-intensive and many-task workflow.",
                    "Multi-tenant fair share in NoSQL data stores.",
                    "How file access patterns influence interference among cluster applications.",
                    "Parallel query evaluation as a Scientific Data Service.",
                    "SCALER: Scalable parallel file write in HDFS.",
                    "CD-RAIS: Constrained dynamic striping in redundant array of independent SSDs.",
                    "Out-of-core GPU memory management for MapReduce-based large-scale graph processing.",
                    "Scalable Graph500 design with MPI-3 RMA.",
                    "Evaluation of emerging memory technologies for HPC, data intensive applications.",
                    "UPC++ for bioinformatics: A case study using genome-wide association studies.",
                    "SWAPHI-LS: Smith-Waterman Algorithm on Xeon Phi coprocessors for Long DNA Sequences.",
                    "Boosting the performance of remote GPU virtualization using InfiniBand connect-IB and PCIe 3.0.",
                    "Leveraging deep memory hierarchies for data staging in coupled data-intensive simulation workflows.",
                    "QMapper: Scalability and energy saving for virtualized web server clusters.",
                    "MemFS: An in-memory runtime file system with symmetrical data distribution.",
                    "Profit-aware cloud resource provisioner for ecommerce.",
                    "a generic framework for asynchronous progression and multithreaded communications.",
                    "Energy-performance tradeoffs in multilevel checkpoint strategies.",
                    "An innovative storage stack addressing extreme scale platforms and Big Data applications.",
                    "Optimizing scientific file I/O patterns using advice based knowledge.",
                    "Preliminary evaluation of optimized transfer method for cluster-wide RAID-4.",
                    "Load analysis and cost estimation of parallel constrained producer-consumer algorithms.",
                    "Fingerprinting application dependencies.",
                    "High-performance implementations for shear-shear correlation calculation.",
                    "Performance evaluation of a signal extraction algorithm for the Cherenkov Telescope Array's Real Time Analysis pipeline.",
                    "\"Analysis of scalability: A parallel application model approach\".",
                    "Utilizing dataflow-based execution for coupled cluster methods.",
                    "A hybrid OpenMP and OpenMPI approach to geometrical motif search in proteins.",
                    "Applying OpenMP-based parallel implementations of NSGA-II and SPEA2 to study phylogenetic relationships.",
                    "Feature selection in high-dimensional EEG data by parallel multi-objective optimization.",
                    "Smith-Waterman algorithm on heterogeneous systems: A case study.",
                    "High-performance X-ray tomography reconstruction algorithm based on heterogeneous accelerated computing systems.",
                    "Anisotropic nonlinear diffusion for filtering 3D images on GPUs.",
                    "Multi-GPU acceleration of DARTEL (early detection of Alzheimer).",
                    "Job scheduling in Hadoop with Shared Input Policy and RAMDISK.",
                    "Support for bioinformatics applications through volunteer and scalable computing frameworks.",
                    "Evaluating Grasp-based cloud dimensioning for comparative genomics: A practical approach.",
                    "A scalable framework for large-scale analysis of gene-gene interactions.",
                    "Power monitoring with PAPI for extreme scale architectures and dataflow-based programming models.",
                    "It takes a village: Monitoring the blue waters supercomputer.",
                    "Methodologies and application of machine learning algorithms to classify the performance of high performance cluster components.",
                    "Demonstrating improved application performance using dynamic monitoring and task mapping.",
                    "Multiobjective optimization technique based on monitoring information to increase the performance of thread migration on multicores."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th CLUSTER 2013",
        "info": "Indianapolis, IN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2013",
                "sub_name": "2013 IEEE International Conference on Cluster Computing, CLUSTER 2013, Indianapolis, IN, USA, September 23-27, 2013.",
                "count": 92,
                "papers": [
                    "An object interface storage node for clustered file systems.",
                    "I/O scheduling for solid state devices in virtual machines.",
                    "A synthetic bursty workload generation method for web 2.0 benchmark.",
                    "ECG identification of arrhythmias by using an associative Petri net.",
                    "Authoring a Science Gateway Cookbook.",
                    "A case of system-wide power management for scientific applications.",
                    "Force-directed geographical load balancing and scheduling for batch jobs in distributed datacenters.",
                    "Towards high-performance and cost-effective distributed storage systems with information dispersal algorithms.",
                    "On service migration in the cloud to facilitate mobile accesses.",
                    "A-Cache: Resolving cache interference for distributed storage with mixed workloads.",
                    "BioExtract Server, a Web-based workflow enabling system, leveraging iPlant collaborative resources.",
                    "Globus Nexus: An identity, profile, and group management platform for science gateways and other collaborative science applications.",
                    "Toward a unified object storage foundation for scalable storage systems.",
                    "A new design of RDMA-based small message channels for InfiniBand clusters.",
                    "Lit: A high performance massive data computing framework based on CPU/GPU cluster.",
                    "Teaching undergraduates using local virtual clusters.",
                    "Enabling multi-task computation on Galaxy-based gateways using swift.",
                    "The scaling of many-task computing approaches in python on cluster supercomputers.",
                    "Insight and reduction of MapReduce stragglers in heterogeneous environment.",
                    "Parallelizing windowed stream joins in a shared-nothing cluster.",
                    "Capturing inter-application interference on clusters.",
                    "K MapReduce: A scalable tool for data-processing and search/ensemble applications on large-scale supercomputers.",
                    "Distributed resource exchange: Virtualized resource management for SR-IOV InfiniBand clusters.",
                    "A cost-aware region-level data placement scheme for hybrid parallel I/O systems.",
                    "ConHA: An SOA-based API gateway for consolidating heterogeneous HA clusters.",
                    "LVFS: A scalable big data scientific storage system.",
                    "On transactional memory concurrency control in distributed real-time programs.",
                    "FlexQuery: An online query system for interactive remote visual data exploration at large scale.",
                    "Zput: A speedy data uploading approach for the Hadoop Distributed File System.",
                    "Write bandwidth optimization of online Erasure Code based cluster file system.",
                    "Optimizing blocking and nonblocking reduction operations for multicore systems: Hierarchical design and implementation.",
                    "Design of network topology aware scheduling services for large InfiniBand clusters.",
                    "Highly optimized full GPU-acceleration of non-hydrostatic weather model SCALE-LES.",
                    "JUMMP: Job Uninterrupted Maneuverable MapReduce Platform.",
                    "EDR: An energy-aware runtime load distribution system for data-intensive applications in the cloud.",
                    "PEXTA: A Parallel Chunked Extendible Dense Array I/O for global array (GA).",
                    "Structured Participation Toolkit: An enabler for knowledge production in Science Gateway.",
                    "V2-Code: A new non-MDS array code with optimal reconstruction performance for RAID-6.",
                    "Optimizing power allocation to CPU and memory subsystems in overprovisioned HPC systems.",
                    "AptStore: Dynamic storage management for hadoop.",
                    "BASE: Benchmark analysis software for energy-efficient solutions in large-scale storage systems.",
                    "MOLAR: A cost-efficient, high-performance hybrid storage cache.",
                    "Accelerating subsurface transport simulation on heterogeneous clusters.",
                    "Counting sort for the live migration of virtual machines.",
                    "A parallel optimization method for stencil computation on the domain that is bigger than memory capacity of GPUs.",
                    "Nekkloud: A software environment for high-order finite element analysis on clusters and clouds.",
                    "Parallelization of software pipelines using the mpififo Tool.",
                    "STREAMER: A distributed framework for incremental closeness centrality computation.",
                    "Using a shared, remote cluster for teaching HPC.",
                    "Mercury: Enabling remote procedure call for high-performance computing.",
                    "Understanding the performance of stencil computations on Intel's Xeon Phi.",
                    "LittleFe: The high performance computing education appliance.",
                    "MPI collective I/O based on advanced reservations to obtain performance guarantees from shared storage systems.",
                    "GPU-accelerated scalable solver for banded linear systems.",
                    "A multi-level approach for understanding I/O activity in HPC applications.",
                    "Automotive big data.",
                    "Distributed data provenance for large-scale data-intensive computing.",
                    "Communication and topology-aware load balancing in Charm++ with TreeMatch.",
                    "Cyberinfrastructure: The key to building successful science gateways.",
                    "The WeFold gateway: Enabling large-scale science coopetition.",
                    "Making work queue cluster-friendly for data intensive scientific applications.",
                    "Co-processing SPMD computation on CPUs and GPUs cluster.",
                    "Letter from the general chair.",
                    "Checkpoint-restart for a network of virtual machines.",
                    "Active-learning-based surrogate models for empirical performance tuning.",
                    "Fast data analysis with integrated statistical metadata in scientific datasets.",
                    "Dynamic slot allocation technique for MapReduce clusters.",
                    "Dynamic file striping and data layout transformation on parallel system with fluctuating I/O workload.",
                    "Using clusters in undergraduate research: Distributed animation rendering, photo processing, and image transcoding.",
                    "Influence of InfiniBand FDR on the performance of remote GPU virtualization.",
                    "Expediting scientific data analysis with reorganization of data.",
                    "Building an open Genome Wide Association Study (GWAS) platform.",
                    "Twitter bootstrap and AngularJS: Frontend frameworks to expedite science gateway development.",
                    "HPC runtime support for fast and power efficient locking and synchronization.",
                    "CyberGIS Gateway for enabling data-rich geospatial research and education.",
                    "Rockhopper, a true HPC system built with cloud concepts.",
                    "User-friendly metaworkflows in quantum chemistry.",
                    "Optimizations on the Parallel Virtual File System implementation integrated with Object-Based Storage Devices.",
                    "A scalable and portable approach to accelerate hybrid HPL on heterogeneous CPU-GPU clusters.",
                    "Thermal aware automated load balancing for HPC applications.",
                    "Integrating deadline-modification SCAN algorithm to Xen-based cloud platform.",
                    "GGAS: Global GPU address spaces for efficient communication in heterogeneous clusters.",
                    "The Oklahoma PetaStore: Big data on a small budget.",
                    "Application power profiling on IBM Blue Gene/Q.",
                    "Model-driven multisite workflow scheduling.",
                    "Oncilla: A GAS runtime for efficient resource allocation and data movement in accelerated clusters.",
                    "Distance-aware virtual cluster performance optimization: A hadoop case study.",
                    "Science gateway security recommendations.",
                    "Runtime system design of decoupled execution paradigm for data-intensive high-end computing.",
                    "Unified and efficient HEC storage system with a working-set based reorganization scheme.",
                    "Developing communication-aware service placement frameworks in the Cloud economy.",
                    "Improving performance and energy efficiency of matrix multiplication via pipeline broadcast."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th CLUSTER 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2012",
                "sub_name": "2012 IEEE International Conference on Cluster Computing, CLUSTER 2012, Beijing, China, September 24-28, 2012.",
                "count": 79,
                "papers": [
                    "Adapting Irregular Computations to Large CPU-GPU Clusters in the MADNESS Framework.",
                    "A GPU-accelerated Branch-and-Bound Algorithm for the Flow-Shop Scheduling Problem.",
                    "A Node-based Parallel Game Tree Algorithm Using GPUs.",
                    "Using 1000+ GPUs and 10000+ CPUs for Sedimentary Basin Simulations.",
                    "Evaluating Power-Monitoring Capabilities on IBM Blue Gene/P and Blue Gene/Q.",
                    "eco-IDC: Trade Delay for Energy Cost with Service Delay Guarantee for Internet Data Centers.",
                    "Synergy: A Middleware for Energy Conservation in Mobile Devices.",
                    "Affinity-aware Virtual Cluster Optimization for MapReduce Applications.",
                    "Mastiff: A MapReduce-based System for Time-Based Big Data Analytics.",
                    "Community Clustering for Distributed Publish/Subscribe Systems.",
                    "D2T: Doubly Distributed Transactions for High Performance and Distributed Computing.",
                    "Cx: Concurrent Execution for the Cross-Server Operations in a Distributed File System.",
                    "Multicore-Enabled Smart Storage for Clusters.",
                    "The Load Rebalancing Problem in Distributed File Systems.",
                    "Clover: A Distributed File System of Expandable Metadata Service Derived from HDFS.",
                    "sEBP: Event Based Polling for Efficient I/O Virtualization.",
                    "The Power and Challenges of Transformative I/O.",
                    "Damaris: How to Efficiently Leverage Multicore Parallelism to Achieve Scalable, Jitter-free I/O.",
                    "DOSAS: Mitigating the Resource Contention in Active Storage Systems.",
                    "High Performance and High Capacity Hybrid Shingled-Recording Disk System.",
                    "Replication Based QoS Framework for Flash Arrays.",
                    "Data Partitioning on Heterogeneous Multicore and Multi-GPU Systems Using Functional Performance Models of Data-Parallel Applications.",
                    "A Decoupled Execution Paradigm for Data-Intensive High-End Computing.",
                    "Improving I/O Throughput with PRIMACY: Preconditioning ID-Mapper for Compressing Incompressibility.",
                    "Performance Analysis of Parallel Processing Systems with Horizontal Decomposition.",
                    "Characterization and Comparison of Cloud versus Grid Workloads.",
                    "DisplayCluster: An Interactive Visualization Environment for Tiled Displays.",
                    "An Out-of-Core Eigensolver on SSD-equipped Clusters.",
                    "On Optimal and Balanced Sparse Matrix Partitioning Problems.",
                    "Autotuning Stencil-Based Computations on GPUs.",
                    "Accelerating Expectation-Maximization Algorithms with Frequent Updates.",
                    "SDM: A Stripe-Based Data Migration Scheme to Improve the Scalability of RAID-6.",
                    "Harmony: Towards Automated Self-Adaptive Consistency in Cloud Storage.",
                    "Accelerating Distributed Updates with Asynchronous Ordered Writes in a Parallel File System.",
                    "HerpRap: A Hybrid Array Architecture Providing Any Point-in-Time Data Tracking for Datacenter.",
                    "A New End-to-End Flow-Control Mechanism for High Performance Computing Clusters.",
                    "Minimizing Network Contention in InfiniBand Clusters with a QoS-Aware Data-Staging Framework.",
                    "Adjustable Credit Scheduling for High Performance Network Virtualization.",
                    "Low-Latency Collectives for the Intel SCC.",
                    "Hierarchical Clustering Strategies for Fault Tolerance in Large Scale HPC Systems.",
                    "Hiding Checkpoint Overhead in HPC Applications with a Semi-Blocking Algorithm.",
                    "Automated Load Balancing Invocation Based on Application Characteristics.",
                    "Overlay-Centric Load Balancing: Applications to UTS and B&B.",
                    "PIC: Partitioned Iterative Convergence for Clusters.",
                    "Improving Resource Utilization in MapReduce.",
                    "Differentiating Your Friends for Scaling Online Social Networks.",
                    "Generic Parallel Programming for Massive Remote Sensing Data Processing.",
                    "KNOWAC: I/O Prefetch via Accumulated Knowledge.",
                    "Evaluation and Optimization of Breadth-First Search on NUMA Cluster.",
                    "GPGPU Memory Estimation and Optimization Targeting OpenCL Architecture.",
                    "Adaptive and Scalable Optimizations for High Performance SR-IOV.",
                    "Enabling Fast, Noncontiguous GPU Data Movement in Hybrid MPI+GPU Environments.",
                    "Designing an Offloaded Nonblocking MPI_Allgather Collective Using CORE-Direct.",
                    "Optimizing Process-to-Core Mappings for Application Level Multi-dimensional MPI Communications.",
                    "On the Effects of CPU Caches on MPI Point-to-Point Communications.",
                    "ANOLE: A Profiling-Driven Adaptive Lock Waiter Detection Scheme for Efficient MP-guest Scheduling.",
                    "Backfilling under Two-tier Virtual Machines.",
                    "A Job Scheduling Design for Visualization Services Using GPU Clusters.",
                    "Cache Promotion Policy Using Re-reference Interval Prediction.",
                    "Built-in Device Simulator for OS Performance Evaluation.",
                    "Dynamic Network Forecasting Using SimGrid Simulations.",
                    "BWCC: A FS-Cache Based Cooperative Caching System for Network Storage System.",
                    "Towards a Cost-Aware Data Migration Approach for Key-Value Stores.",
                    "DFG-base Dynamic Operation Partitioning for Heterogeneous Multicluster VLIW DSP Processor.",
                    "Memvisor: Application Level Memory Mirroring via Binary Translation.",
                    "A Locality-based Performance Model for Load-and-Compute Style Computation.",
                    "Transactional Multi-row Access Guarantee in the Key-Value Store.",
                    "Building a TaaS Platform for Web Service Load Testing.",
                    "Design of Hardware-Based Communication Performance Measurement Tool.",
                    "Phase Detection for Loop-Based Programs on Multicore Architectures.",
                    "SOME: Selective Offloading for a Mobile Computing Environment.",
                    "clone_n(): Parallel Thread Creation for Upcoming Many-Core Architectures.",
                    "D4D: Inter-datacenter Bulk Transfers with ISP Friendliness.",
                    "Cloud Based Short Read Mapping Service.",
                    "Memory Affinity: Balancing Performance, Power, Thermal and Fairness for Multi-core Systems.",
                    "ME2: Efficient Live Migration of Virtual Machine with Memory Exploration and Encoding.",
                    "A Reliable and High-Performance Distributed Storage System for P2P-VoD Service.",
                    "HAaaS: Towards Highly Available Distributed Systems.",
                    "Towards Fault-Tolerant Energy-Efficient High Performance Computing in the Cloud."
                ]
            },
            {
                "sub_name_abbr": "conf/cluster/2012w",
                "sub_name": "2012 IEEE International Conference on Cluster Computing Workshops, CLUSTER Workshops 2012, Beijing, China, September 24-28, 2012.",
                "count": 30,
                "papers": [
                    "Fast Approximate Matching of Astronomical Objects.",
                    "Modeling Parallel Scientific Applications through their Input/Output Phases.",
                    "One Phase Commit: A Low Overhead Atomic Commitment Protocol for Scalable Metadata Services.",
                    "Substituting Disk Failure Avoidance for Redundancy in Wide Area Fault Tolerant Storage Systems.",
                    "ERMS: An Elastic Replication Management System for HDFS.",
                    "A Novel Scalable Architecture of Cloud Storage System for Small Files Based on P2P.",
                    "Sedna: A Memory Based Key-Value Storage System for Realtime Processing in Cloud.",
                    "Optimizing Energy Consumption for Time-Constraint Data Query in Wireless Environment.",
                    "DTS: Using Dynamic Time-Slice Scaling to Address the OS Problem Incurred by DVFS.",
                    "System Level Power Characterization of Multi-core Computers with Dynamic Frequency Scaling Support.",
                    "Predictive Data and Energy Management under Budget.",
                    "Secure Networking for Virtual Machines in the Cloud.",
                    "Virtual Machine Proactive Scaling in Cloud Systems.",
                    "High Availability through Output Continuity.",
                    "Trust-Based and QoS Demand Clustering Analysis Customizable Cloud Workflow Scheduling Strategies.",
                    "Smart-DRS: A Strategy of Dynamic Resource Scheduling in Cloud Data Center.",
                    "Hybrid Computer Cluster with High Flexibility.",
                    "Performance Prediction for MPI Parallel Jobs.",
                    "Towards an Adaptable Middleware for Parallel Computing in Heterogeneous Environments.",
                    "vHadoop: A Scalable Hadoop Virtual Cluster Platform for MapReduce-Based Parallel Machine Learning with Performance Consideration.",
                    "Task Scheduling for GPU Heterogeneous Cluster.",
                    "Transient-Error Detection and Recovery via Reverse Computation and Checkpointing.",
                    "Modelling the Power and Energy Consumption of NIOS II Softcores on FPGA.",
                    "A Novel Clustering Ant-Based QoS-aware Routing Algorithm in Large Scale Wireless Multimedia Sensor Networks.",
                    "Target Tracking with Pairwise Uncertainty in Wireless Sensor Networks: Qualitatively and Quantitatively.",
                    "OpenMP/MPI Hybrid Parallel Multigrid Method on Fujitsu FX10 Supercomputer System.",
                    "A GPU Implementation of Generalized Graph Processing Algorithm GIM-V.",
                    "Tuning MPI Runtime Parameter Setting for High Performance Computing.",
                    "Can Network-Offload Based Non-blocking Neighborhood MPI Collectives Improve Communication Overheads of Irregular Graph Algorithms?",
                    "A Practical Performance Model for Hadoop MapReduce."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th CLUSTER 2011",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2011",
                "sub_name": "2011 IEEE International Conference on Cluster Computing (CLUSTER), Austin, TX, USA, September 26-30, 2011.",
                "count": 77,
                "papers": [
                    "Multiphase LBM Distributed over Multiple GPUs.",
                    "Performance Emulation of Cell-Based AMR Cosmology Simulations.",
                    "BMF: Bitmapped Mass Fingerprinting for Fast Protein Identification.",
                    "Optimizing Network I/O Virtualization with Efficient Interrupt Coalescing and Virtual Receive Side Scaling.",
                    "RDMA Based Replication of Multiprocessor Virtual Machines over High-Performance Interconnects.",
                    "ResourceExchange: Latency-Aware Scheduling in Virtualized Environments with High Performance Fabrics.",
                    "Large-Scale Simulator for Global Data Infrastructure Optimization.",
                    "Achieving Scalable Parallelization for the Hessenberg Factorization.",
                    "Design and Implementation of Broadcast Algorithms for Extreme-Scale Systems.",
                    "Model-Driven Simulation to Evaluate Performance Impact of Workload Features on Parallel Systems.",
                    "EDO: Improving Read Performance for Scientific Applications through Elastic Data Organization.",
                    "PIDX: Efficient Parallel I/O for Multi-resolution Multi-dimensional Scientific Datasets.",
                    "AA-Dedupe: An Application-Aware Source Deduplication Approach for Cloud Backup Services in the Personal Computing Environment.",
                    "Incorporating Network RAM and Flash into Fast Backing Store for Clusters.",
                    "Design of HPC Node with Heterogeneous Processors.",
                    "Performance Analysis and Benchmarking of the Intel SCC.",
                    "Supporting Computing Element Heterogeneity in P2P Grids.",
                    "DARE: Adaptive Data Replication for Efficient Cluster Scheduling.",
                    "A Framework for Data-Intensive Computing with Cloud Bursting.",
                    "Automatic Hybrid OpenMP + MPI Program Generation for Dynamic Programming Problems.",
                    "On Scalability for MPI Runtime Systems.",
                    "Process Distance-Aware Adaptive MPI Collective Communications.",
                    "Experience on Comparison of Operating Systems Scalability on the Multi-core Architecture.",
                    "Automatic Computer System Characterization for a Parallelizing Compiler.",
                    "Energy Templates: Exploiting Application Information to Save Energy.",
                    "Performance Characterization and Optimization of Atomic Operations on AMD GPUs.",
                    "Analyzing the Performance Bottlenecks of the POWER7-IH Network.",
                    "Play It Again, SimMR!",
                    "An ISO-Energy-Efficient Approach to Scalable System Power-Performance Optimization.",
                    "High Performance Dense Linear System Solver with Soft Error Resilience.",
                    "Dynamic Load Balance for Optimized Message Logging in Fault Tolerant HPC Applications.",
                    "Accelerating Galois Field Arithmetic for Reed-Solomon Erasure Codes in Storage Applications.",
                    "A Sampling-Based Approach for Communication Libraries Auto-Tuning.",
                    "Optimized Non-contiguous MPI Datatype Communication for GPU Clusters: Design, Implementation and Evaluation with MVAPICH2.",
                    "Design and Evaluation of Network Topology-/Speed- Aware Broadcast Algorithms for InfiniBand Clusters.",
                    "An RMS for Non-predictably Evolving Applications.",
                    "Automatic Task Re-organization in MapReduce.",
                    "Evolutionary Scheduling of Parallel Tasks Graphs onto Homogeneous Clusters.",
                    "Symphony: A Scheduler for Client-Server Applications on Coprocessor-Based Heterogeneous Clusters.",
                    "Multicore/GPGPU Portable Computational Kernels via Multidimensional Arrays.",
                    "Implementation of Multigrid on QPACE.",
                    "Heterogeneous Cloud Computing.",
                    "Exploring Fine-Grained Task-Based Execution on Multi-GPU Systems.",
                    "Performance Portability of a GPU Enabled Factorization with the DAGuE Framework.",
                    "CULZSS: LZSS Lossless Data Compression on CUDA.",
                    "Quartile and Outlier Detection on Heterogeneous Clusters Using Distributed Radix Sort.",
                    "MPI Alltoall Personalized Exchange on GPGPU Clusters: Design Alternatives and Benefit.",
                    "Automatically Selecting the Number of Aggregators for Collective I/O Operations.",
                    "Improving I/O Forwarding Throughput with Data Compression.",
                    "Application I/O and Data Management.",
                    "FastQuery: A Parallel Indexing System for Scientific Data.",
                    "Parallel I/O Performance for Application-Level Checkpointing on the Blue Gene/P System.",
                    "Methodology for Performance Evaluation of the Input/Output System on Computer Clusters.",
                    "Can a Decentralized Metadata Service Layer Benefit Parallel Filesystems?",
                    "Asynchronous Collective Output with Non-dedicated Cores.",
                    "Improving PCM Endurance with Randomized Address Remapping in Hybrid Memory System.",
                    "HEaRS: A Hierarchical Energy-Aware Resource Scheduler for Virtualized Data Centers.",
                    "Parallel Greedy Genetic Algorithm for Job Scheduling in Cluster Enviornments.",
                    "Scheduling Workflows in Opportunistic Environments.",
                    "TDP-Shell: A Generic Framework to Improve Interoperability between Batch Queue Systems and Monitoring Tools.",
                    "Locality-Aware Parallel Process Mapping for Multi-core HPC Systems.",
                    "Evaluating Performance Impacts of Delayed Failure Repairing on Large-Scale Systems.",
                    "Reservation-Based Overbooking for HPC Clusters.",
                    "Investigating Scenario-Conscious Asynchronous Rendezvous over RDMA.",
                    "Implementing High Performance Remote Method Invocation in CCA.",
                    "Predictive and Distributed Routing Balancing for High Speed Interconnection Networks.",
                    "Improving MapReduce Performance via Heterogeneity-Load-Aware Partition Function.",
                    "Scalability of Semi-implicit Time Integrators for Nonhydrostatic Galerkin-Based Atmospheric Models on Large Scale Clusters.",
                    "Performance Behavior Prediction Scheme for Shared-Memory Parallel Applications.",
                    "Performance Optimization of Data Structures Using Memory Access Characterization.",
                    "Experimental and Numerical Study of the Effect of Geometric Parameters on Liquid Single-Phase Pressure Drop in Micro-Scale Pin-Fin Arrays.",
                    "Data Partitioning on Heterogeneous Multicore Platforms.",
                    "Frequent Itemset Mining on Large-Scale Shared Memory Machines.",
                    "GPApriori: GPU-Accelerated Frequent Itemset Mining.",
                    "An Energy-Efficient Scheme for Cloud Resource Provisioning Based on CloudSim.",
                    "Performance of a Virtual Cluster in a General-Purpose Teaching Laboratory.",
                    "Datamation: A Quarter of a Century and Four Orders of Magnitude Later."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th CLUSTER 2010",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2010",
                "sub_name": "Proceedings of the 2010 IEEE International Conference on Cluster Computing, Heraklion, Crete, Greece, 20-24 September, 2010.",
                "count": 33,
                "papers": [
                    "Minimizing MPI Resource Contention in Multithreaded Multicore Environments.",
                    "TCCluster: A Cluster Architecture Utilizing the Processor Host Interface as a Network Interconnect.",
                    "Adaptive Optimization for Petascale Heterogeneous CPU/GPU Computing.",
                    "How to Scale Nested OpenMP Applications on the ScaleMP vSMP Architecture.",
                    "Synchronizing the Timestamps of Concurrent Events in Traces of Hybrid MPI/OpenMP Applications.",
                    "Getting Rid of Coherency Overhead for Memory-Hungry Applications.",
                    "Energy-Aware Scheduling in Virtualized Datacenters.",
                    "TRACER: A Trace Replay Tool to Evaluate Energy-Efficiency of Mass Storage Systems.",
                    "Designing OS for HPC Applications: Scheduling.",
                    "Exploiting Data Deduplication to Accelerate Live Virtual Machine Migration.",
                    "SHelp: Automatic Self-Healing for Multiple Application Instances in a Virtual Machine Environment.",
                    "Virtualizing Modern High-Speed Interconnection Networks with Performance and Scalability.",
                    "RDMA-Based Job Migration Framework for MPI over InfiniBand.",
                    "Host Side Dynamic Reconfiguration with InfiniBand.",
                    "Multiplexing Endpoints of HCA for Scaling MPI Applications: Design and Performance Evaluation with uDAPL.",
                    "The Impact of System Design Parameters on Application Noise Sensitivity.",
                    "Computing Contingency Statistics in Parallel: Design Trade-Offs and Limiting Cases.",
                    "Integration Experiences and Performance Studies of A COTS Parallel Archive System.",
                    "Enforcing SLAs in Scientific Clouds.",
                    "CDRM: A Cost-Effective Dynamic Replication Management Scheme for Cloud Storage Cluster.",
                    "An Efficient Process Live Migration Mechanism for Load Balanced Distributed Virtual Environments.",
                    "Acceleration of Streamed Tensor Contraction Expressions on GPGPU-Based Clusters.",
                    "Efficient Parallel Subgraph Counting Using G-Tries.",
                    "Cluster versus GPU implementation of an Orthogonal Target Detection Algorithm for Remotely Sensed Hyperspectral Images.",
                    "Breaking the MapReduce Stage Barrier.",
                    "Asynchronous Algorithms in MapReduce.",
                    "Reducing Communication Overhead in Large Eddy Simulation of Jet Engine Noise.",
                    "Performance Analysis of Multi-level Time Sharing Task Assignment Policies on Cluster-Based Systems.",
                    "A Simulation Framework to Automatically Analyze the Communication-Computation Overlap in Scientific Applications.",
                    "Analysis of Tasks Reallocation in a Dedicated Grid Environment.",
                    "Replication-Based Highly Available Metadata Management for Cluster File Systems.",
                    "Improving Parallel I/O Performance with Data Layout Awareness.",
                    "Optimization Techniques at the I/O Forwarding Layer."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th CLUSTER 2009",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2009",
                "sub_name": "Proceedings of the 2009 IEEE International Conference on Cluster Computing, August 31 - September 4, 2009, New Orleans, Louisiana, USA.",
                "count": 85,
                "papers": [
                    "Improving I/O performance using soft-QoS-based dynamic storage cache partitioning.",
                    "Analytical modeling and optimization for affinity based thread scheduling on multicore systems.",
                    "Finding a tradeoff between host interrupt load and MPI latency over Ethernet.",
                    "Comparing map-reduce and FREERIDE for data-intensive applications.",
                    "Computing median values in a cloud environment using GridBatch and MapReduce.",
                    "A global operating system for HPC clusters.",
                    "On-demand file staging system for Linux clusters.",
                    "Utility analysis for Internet-oriented server consolidation in VM-based data centers.",
                    "Using clouds for metagenomics: A case study.",
                    "Scalable I/O forwarding framework for high-performance computing systems.",
                    "Cluster fault-tolerance: An experimental evaluation of checkpointing and MapReduce through simulation.",
                    "Batch queue resource scheduling for workflow applications.",
                    "VCCP: A transparent, coordinated checkpointing system for virtualization-based cluster computing.",
                    "How reliable are parallel disk systems when energy-saving schemes are involved?",
                    "On-line automatic resource selection in distributed computing.",
                    "Power-aware scheduling of virtual machines in DVFS-enabled clusters.",
                    "Topics on measuring real power usage on high performance computing platforms.",
                    "Using a cluster as a memory resource: A fast and large virtual memory on MPI.",
                    "Reliability-aware scalability models for high performance computing.",
                    "SJMR: Parallelizing spatial join with MapReduce on clusters.",
                    "Data mining analysis to validate performance tuning practices for HPL.",
                    "Integrating software distributed shared memory and message passing programming.",
                    "Overlapping computation and communication in SMT clusters with commodity interconnects.",
                    "HPMR: Prefetching and pre-shuffling in shared MapReduce computation environment.",
                    "DCR: A fully transparent checkpoint/restart framework for distributed systems.",
                    "A scalable and generic task scheduling system for communication libraries.",
                    "Live virtual machine migration with adaptive, memory compression.",
                    "Extending I/O through high performance data services.",
                    "An efficient hardware-software approach to network fault tolerance with InfiniBand.",
                    "XCPU2 distributed seamless desktop extension.",
                    "Increasing the availability provided by RADIC with low overhead.",
                    "Dynamic screen division for load balancing the raycasting of irregular data.",
                    "Numerically stable, single-pass, parallel statistics algorithms.",
                    "Reducing network contention with mixed workloads on modern multicore, clusters.",
                    "MDCSim: A multi-tier data center simulation, platform.",
                    "Granules: A lightweight, streaming runtime for cloud computing with support, for Map-Reduce.",
                    "Reasons for a pessimistic or optimistic message logging protocol in MPI uncoordinated failure, recovery.",
                    "Fault-aware, utility-based job scheduling on Blue, Gene/P systems.",
                    "Two-phase load distribution for rendering large 3D models on a graphics cluster.",
                    "Resource selection and allocation for dynamic adaptive computing in heterogeneous clusters.",
                    "MITHRA: Multiple data independent tasks on a heterogeneous resource architecture.",
                    "A distributed device paradigm for commodity, applications.",
                    "Design alternatives for implementing fence synchronization in MPI-2 one-sided communication for InfiniBand clusters.",
                    "Zone Clusters: A virtual cluster based upon solaris containers.",
                    "An application based MPI message throughput benchmark.",
                    "GridAtlas - A grid application and resource configuration repository and discovery service.",
                    "Implementing WebGIS on Hadoop: A case study of improving small file I/O performance on HDFS.",
                    "Coordinating the use of GPU and CPU for improving performance of compute intensive applications.",
                    "An innovative application execution toolkit for multicluster grids.",
                    "Cross-domain metadata management in data intensive distributed computing environment.",
                    "Two-phase conflict detection for transactional memory on clusters.",
                    "Accelerating SIFT on parallel architectures.",
                    "HPC failure prediction proficiency metrics.",
                    "Parallel implementation of a tightly coupled ablation prediction code using MPI.",
                    "WinBioinfTools: Bioinformatics tools for Windows cluster.",
                    "Architecting iSCSI-based I/O systems for high performance computing clusters.",
                    "A symmetric O(n log n) message distributed snapshot algorithm for large-scale systems.",
                    "HPP-Controller: An intra-node controller designed for connecting heterogeneous CPUs.",
                    "An assessment of multi-core for a performance prediction model of tomographic reconstruction.",
                    "Resource manager with multi-core support for parallel desktop.",
                    "How SPMD applications could be efficiently executed on multicore environments?",
                    "Parallel application signature.",
                    "Improving metadata management for small files in HDFS.",
                    "Scheduling strategies for HPC as a service (HPCaaS).",
                    "Fast-Response Dynamic Routing Balancing for high-speed interconnection networks.",
                    "Distributed control plane architecture of next generation IP routers.",
                    "RDMA over Ethernet - A preliminary study.",
                    "Oblivious routing schemes in extended generalized Fat Tree networks.",
                    "On optimizing I/O through InfiniBand RDMA for commodity clusters.",
                    "The event data store and I/O framework for the ATLAS experiment at the Large Hadron Collider.",
                    "A performance evaluation of scientific I/O workloads on Flash-based SSDs.",
                    "Analyzing massive astrophysical datasets: Can Pig/Hadoop or a relational DBMS help?",
                    "24/7 Characterization of petascale I/O workloads.",
                    "Workload-adaptive management of energy-smart disk storage systems.",
                    "Interfaces for coordinated access in the file system.",
                    "Combining I/O operations for multiple array variables in parallel netCDF.",
                    "Overlapped checkpointing with hardware assist.",
                    "Experiences with hybrid clusters.",
                    "A compiler for high performance computing with many-core accelerators.",
                    "GPU clusters for high-performance computing.",
                    "Message passing for GPGPU clusters: CudaMPI.",
                    "Performance analysis of memory transfers and GEMM subroutines on NVIDIA Tesla GPU cluster.",
                    "Investigating the use of GPU-accelerated nodes for SAR image formation.",
                    "Integrating Web 2.0 technologies with scientific simulation codes for real-time collaboration.",
                    "V-MCS: A configuration system for virtual machines."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th CLUSTER 2008",
        "info": "Tsukuba, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2008",
                "sub_name": "Proceedings of the 2008 IEEE International Conference on Cluster Computing, 29 September - 1 October 2008, Tsukuba, Japan.",
                "count": 63,
                "papers": [
                    "Clouds, clusters and ManyCore: The revolution ahead.",
                    "Reliable adaptable Network RAM.",
                    "Magnet: A novel scheduling policy for power reduction in cluster with virtual machines.",
                    "Active CoordinaTion (ACT) - toward effectively managing virtualized multicore clouds.",
                    "Variable-grain and dynamic work generation for Minimal Unique Itemset mining.",
                    "A large-grained parallel algorithm for nonlinear eigenvalue problems and its implementation using OmniRPC.",
                    "Redistribution aware two-step scheduling for mixed-parallel applications.",
                    "Implications of non-constant clock drifts for the timestamps of concurrent events.",
                    "In search of sweet-spots in parallel performance monitoring.",
                    "Workflows for performance evaluation and tuning.",
                    "Combining Virtual Machine migration with process migration for HPC on multi-clusters and Grids.",
                    "Live and incremental whole-system migration of virtual machines using block-bitmap.",
                    "Efficient one-copy MPI shared memory communication in Virtual Machines.",
                    "Multistage switches are not crossbars: Effects of static routing in high-performance networks.",
                    "A HyperTransport-based personal parallel computer.",
                    "High message rate, NIC-based atomics: Design and performance considerations.",
                    "A dependency-aware task-based programming environment for multi-core architectures.",
                    "Are nonblocking networks really needed for high-end-computing workloads?",
                    "OpenMP-centric performance analysis of hybrid applications.",
                    "DWC2: A dynamic weight-based cooperative caching scheme for object-based storage cluster.",
                    "An OSD-based approach to managing directory operations in parallel file systems.",
                    "DifferStore: A differentiated storage service in object-based storage system.",
                    "A novel hint-based I/O mechanism for centralized file server of cluster.",
                    "Designing next generation clusters with InfiniBand and 10GE/iWARP: Opportunities and challenges.",
                    "Scalable MPI design over InfiniBand using eXtended Reliable Connection.",
                    "Message progression in parallel computing - to thread or not to thread?",
                    "Improving message passing over Ethernet with I/OAT copy offload in Open-MX.",
                    "A trace-driven emulation framework to predict scalability of large clusters in presence of OS Jitter.",
                    "Prediction of behavior of MPI applications.",
                    "A novel model for synthesizing parallel I/O workloads in scientific applications.",
                    "Divisible load scheduling with improved asymptotic optimality.",
                    "DLM: A distributed Large Memory System using remote memory swapping over cluster nodes.",
                    "RI2N: High-bandwidth and fault-tolerant network with multi-link Ethernet for PC clusters.",
                    "Impact of topology and link aggregation on a PC cluster with Ethernet.",
                    "Predictive models for bandwidth sharing in high performance clusters.",
                    "Context-aware address translation for high performance SMP cluster system.",
                    "Parallel multistage preconditioners by Hierarchical Interface Decomposition on \"T2K Open Super Computer (Todai Combined Cluster)\" with Hybrid parallel programming models.",
                    "Load-balancing methods for parallel and distributed constraint solving.",
                    "Enabling lock-free concurrent fine-grain access to massive distributed data: Application to supernovae detection.",
                    "A multicore-enabled multirail communication engine.",
                    "Multi-core aware optimization for MPI collectives.",
                    "Environmental-aware optimization of MPI checkpointing intervals.",
                    "Towards an understanding of the performance of MPI-IO in Lustre file systems.",
                    "Gather-arrange-scatter: Node-level request reordering for parallel file systems on multi-core clusters.",
                    "Empirical-based probabilistic upper bounds for urgent computing applications.",
                    "Supporting storage resources in Urgent Computing Environments.",
                    "Runtime DVFS control with instrumented Code in power-scalable cluster system.",
                    "Intelligent compilers.",
                    "Continuous adaptation for high performance throughput computing across distributed clusters.",
                    "Performance models for dynamic tuning of parallel applications on Computational Grids.",
                    "SPRAT: Runtime processor selection for energy-aware computing.",
                    "Using cluster computing to support automatic and dynamic database clustering.",
                    "A dynamic programming approach to optimizing the blocking strategy for the Householder QR decomposition.",
                    "Reinforcement learning for automated performance tuning: Initial evaluation for sparse matrix format selection.",
                    "A comparison of search heuristics for empirical code optimization.",
                    "An optimized Dynamic Load Balancing method for parallel 3-D mesh refinement for finite element electromagnetics with Tetrahedra.",
                    "Design and implementation of an effective HyperTransport core in FPGA.",
                    "New techniques for simulating high performance MPI applications on large storage networks.",
                    "Scalable, high performance InfiniBand-attached SAN Volume Controller.",
                    "Jetter: a multi-pattern parallel I/O benchmark.",
                    "Enhancing write performance of a shared-disk cluster filesystem through a fine-grained locking strategy.",
                    "Active storage using object-based devices.",
                    "Exploiting data compression in collective I/O techniques."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9th CLUSTER 2007",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2007",
                "sub_name": "Proceedings of the 2007 IEEE International Conference on Cluster Computing, 17-20 September 2007, Austin, Texas, USA.",
                "count": 82,
                "papers": [
                    "Message from the conference chairs, Cluster 2007.",
                    "Scaling to PetaFlops.",
                    "The challenges and rewards of petascale clusters.",
                    "The science of programming dense linear algebra libraries.",
                    "Handling heterogeneous storage devices in clusters.",
                    "Designing high-end computing systems with InfiniBand and10-Gigabit Ethernet iWARP.",
                    "Security-aware resource management for real-time applications on clusters.",
                    "The future of multi-core technologies.",
                    "Efficient quantum computing simulation through dynamic matrix restructuring and distributed evaluation.",
                    "High performance virtual machine migration with RDMA over modern interconnects.",
                    "Evaluating memory energy efficiency in parallel I/O workloads.",
                    "Parallel access of out-of-core dense extendible arrays.",
                    "Non-collective parallel I/O for global address space programming models.",
                    "Red storm IO performance analysis.",
                    "The computer as software component: A mechanism for developing and testing resource management software.",
                    "Evaluating the EASY-backfill job scheduling of static workloads on clusters.",
                    "Transparent system-level migration of PGAS applications using Xen on InfiniBand.",
                    "Dynamic Virtual Clustering.",
                    "Satisfying your dependencies with SuperMatrix.",
                    "Performance vs. accuracy trade-offs for large-scale image analysis applications.",
                    "Taste of AOP : Blending concerns in cluster computing software.",
                    "A feasibility analysis of power-awareness and energy minimization in modern interconnects for high-performance computing.",
                    "Thermal-aware task scheduling for data centers through minimizing heat recirculation.",
                    "Runtime system support for software-guided disk power management.",
                    "Balancing productivity and performance on the cell broadband engine.",
                    "Efficient asynchronous memory copy operations on multi-core systems and I/OAT.",
                    "Efficient offloading of collective communications in large-scale systems.",
                    "Zero-copy protocol for MPI using infiniband unreliable datagram.",
                    "The software interface for a cluster interconnect based on the Kautz digraph.",
                    "Network performance model for TCP/IP based cluster computing.",
                    "High performance clusters using NEOS.",
                    "An architecture to perform NIC based MPI matching.",
                    "Scheduling multiple divisible and indivisible tasks on bus networks.",
                    "The design of MPI based distributed shared memory systems to support OpenMP on clusters.",
                    "Multi-dimensional dynamic loop scheduling algorithms.",
                    "Performance analysis of a user-level memory server.",
                    "Towards an integrated IO and clustering solution using PCI express.",
                    "An optimal scheduling scheme for tiling in distributed systems.",
                    "FlexRPC: A flexible Remote Procedure Call facility for modern cluster file systems.",
                    "Parallel compression of correlated files.",
                    "Blutopia: Stackable storage for cluster management.",
                    "Evaluation of fault-tolerant policies using simulation.",
                    "Reliability-aware resource allocation in HPC systems.",
                    "Anomaly localization in large-scale clusters.",
                    "Identifying sources of Operating System Jitter through fine-grained kernel instrumentation.",
                    "LIVE data workspace: A flexible, dynamic and extensible platform for petascale applications.",
                    "Scalable, fault-tolerant management of Grid Services.",
                    "High throughput grid computing with an IBM Blue Gene/L.",
                    "Enabling JaSkel skeletons for clusters and computational Grids.",
                    "Scheduling malleable applications in multicluster systems.",
                    "Effects of packet pacing for MPI programs in a Grid environment.",
                    "Sequential and parallel implementation of a constraint-based algorithm for searching protein structures.",
                    "Optimized scheduling for group communication in data parallelism.",
                    "A layered design methodology of cluster system stack.",
                    "Optimal synchronization frequency for dynamic pipelined computations on heterogeneous systems.",
                    "CHAF - an object-oriented framework for configuring applications in a clustered environment.",
                    "A proposal of metaheuristics to schedule independent tasks in heterogeneous memory-constrained systems.",
                    "Multi-dimensional range query for data management using bloom filters.",
                    "System-level performance phase characterization for on-demand resource provisioning.",
                    "Parallel iteration space alternate tiling Gauss-Seidel solver.",
                    "Lightweight kernel-level primitives for high-performance MPI intra-node communication over multi-core systems.",
                    "A reliability-aware approach for an optimal checkpoint/restart model in HPC environments.",
                    "Comparison and tuning of MPI implementations in a grid context.",
                    "Dolphin express: A transparent approach to enhancing PCI Express.",
                    "Integrating hardware management with cluster administration toolkits.",
                    "Motivating co-ordination of power management solutions in data centers.",
                    "On developing a fast, cost-effective and non-invasive method to derive data center thermal maps.",
                    "Measurement-based power profiling of data center equipment.",
                    "Improving system efficiency through scheduling and power management.",
                    "Some work in progress at IBM's Austin Research Lab.",
                    "Cost-aware scheduling for heterogeneous enterprise machines (CASH'EM).",
                    "Identifying energy-efficient concurrency levels using machine learning.",
                    "Message from the HeteroPar 2007 chair.",
                    "Complexity results for throughput and latency optimization of replicated and data-parallel workflows.",
                    "Dynamic scheduling of multi-processor tasks on clusters of clusters.",
                    "Multi-criteria scheduling of pipeline workflows.",
                    "Performance analysis of parallel database sortoperations in a heterogenous Grid Environment.",
                    "A parallel algorithm to solve large stiff ODE systems on grid systems.",
                    "A pipelined parallel OSIC algorithm based on the square root Kalman Filter for heterogeneous networks.",
                    "Toward power-aware computing with dynamic voltage scaling for heterogeneous platforms.",
                    "A Comparison of robustness metrics for scheduling DAGs on heterogeneous systems.",
                    "Building the communication performance model of heterogeneous clusters based on a switched network."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8th CLUSTER 2006",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2006",
                "sub_name": "Proceedings of the 2006 IEEE International Conference on Cluster Computing, September 25-28, 2006, Barcelona, Spain.",
                "count": 83,
                "papers": [
                    "The Petacomp Machine: A MIMD Cluster for Parallel Pattern-mining.",
                    "Emprical study on Reducing Energy of Parallel Programs using Slack Reclamation by DVFS in a Power-scalable High Performance Cluster.",
                    "Cluster-based IP Router: Implementation and Evaluation.",
                    "Protocol Offload Evaluation Using Simics.",
                    "Autonomic Management of Clustered Applications.",
                    "XCPU: a new, 9p-based, process management system for clusters and grids.",
                    "Autonomic Resource Management for a Cluster that Executes Batch Jobs.",
                    "Rapid Node Reallocation Between Virtual Clusters for Data Intensive Utility Computing.",
                    "The Influence of Operating Systems on the Performance of Collective Operations at Extreme Scale.",
                    "Kernel-Level Measurement for Integrated Parallel Performance Views: the KTAU Project.",
                    "Efficient MPI Collective Operations for Clusters in Long-and-Fast Networks.",
                    "Fine-Grained Message Pipelining for Improved MPI Performance.",
                    "Designing High Performance and Scalable MPI Intra-node Communication Support for Clusters.",
                    "FAIL-MPI: How Fault-Tolerant Is Fault-Tolerant MPI?",
                    "A Hybrid MPI Simulator.",
                    "Lightweight I/O for Scientific Applications.",
                    "I/O Scheduling Service for Multi-Application Clusters.",
                    "JOSHUA: Symmetric Active/Active Replication for Highly Available HPC Job and Resource Management.",
                    "NVision-PA: A Process Accounting Analysis Tool with a Security Focus on Masquerade Detection in HPC Clusters.",
                    "MSSG: A Framework for Massive-Scale Semantic Graphs.",
                    "Z-align: An Exact and Parallel Strategy for Local Biological Sequence Alignment in User-Restricted Memory Space.",
                    "A Simple Synchronous Distributed-Memory Algorithm for the HPCC RandomAccess Benchmark.",
                    "Energy-Aware Duplication Strategies for Scheduling Precedence-Constrained Parallel Tasks on Clusters.",
                    "Locality Conscious Processor Allocation and Scheduling for Mixed Parallel Applications.",
                    "Using Simulation, Historical and Hybrid Estimation Systems for Enhacing Job Scheduling on NOWs.",
                    "An Iteration Aware Multidimensional Data Distribution Prototype for Computing Clusters.",
                    "Improving Communication Performance on InfiniBand by Using Efficient Data Placement Strategies.",
                    "A New Flexible MPI Collective I/O Implementation.",
                    "Stochastic Scheduling with Availability Constraints in Heterogeneous Clusters.",
                    "Parallel Morphological/Neural Classification of Remote Sensing Images Using Fully Heterogeneous and Homogeneous Commodity Clusters.",
                    "Robust task scheduling in non-deterministic heterogeneous computing systems.",
                    "Parallelizing Lattice Gauge Theory Models on Commodity Clusters.",
                    "HPC Cluster Readiness of Xen and User Mode Linux.",
                    "Scheduling Workflow-based Parameter-Sweep Applications with Best-Intermediate-Result-First Heuristic.",
                    "Increasing the cluster availability using RADIC.",
                    "Multi-Objective Models for Scheduling Jobs on Parallel Computer Systems.",
                    "Can a Helmholtz solver run on a cluster?",
                    "SLA-Based Coordinated Superscheduling Scheme for Computational Grids.",
                    "Performance Analysis, Modeling and Prediction of a Parallel Multiblock Lattice Boltzmann Application Using Prophesy System.",
                    "Implementation Tradeoffs of the Array Files Library for Out-of-Core Computations.",
                    "Implementation and Evaluation of Parallel Sparse Matrix-Vector Products on Distributed Memory Parallel Computers.",
                    "A Performance Prediction Methodology for Data-dependent Parallel Applications.",
                    "Combining Clusters for Business Continuity.",
                    "Replay: A Model-Based Service for Supporting Transparent Cluster Analysis Tools.",
                    "STAS: A Scalability Testing and Analysis System.",
                    "A Model-Based Framework for the Integration of Parallel Tools.",
                    "An Integrated Adaptive Management System for Cluster-based Web Services.",
                    "On the Effectiveness of Content-aware Load Distribution for Web Clusters.",
                    "Application-aware Interface for SOAP Communication in Web Services.",
                    "A Performance Instrumentation Framework to Characterize Computation-Communication Overlap in Message-Passing Systems.",
                    "Predictive Performance Analysis of a Parallel Pipelined Synchronous Wavefront Application for Commodity Processor Cluster Systems.",
                    "Modeling Network Contention Effects on All-to-All Operations.",
                    "MPJ Express: Towards Thread Safe Java HPC.",
                    "Automatic Clustering for Self-Organizing Grids.",
                    "Resource Management for Interactive Jobs in a Grid Environment.",
                    "A Virtual Registry For Wide-Area Messaging.",
                    "Parallel Basic Matrix Algebra on the Grid'5000 Large Scale Distributed Platform.",
                    "Marching Towards Nirvana: Configurations for Very High Performance Parallel File Systems.",
                    "Using Lightweight Transactions and Snapshots for Fault-Tolerant Services Based on Shared Storage Bricks.",
                    "Efficient Data-Movement for Lightweight I/O.",
                    "Improving the Performance of Cluster Applications through I/O Proxy Architecture.",
                    "Fairness and Performance Isolation: an Analysis of Disk Scheduling Algorithms.",
                    "Positioning Dynamic Storage Caches for Transient Data.",
                    "Matrix Multiplication on Two Interconnected Processors.",
                    "Analytical Network Modeling of Heterogeneous Large-Scale Cluster Systems.",
                    "Heterogeneous Parallel Computing in Remote Sensing Applications: Current Trends and Future Perspectives.",
                    "Open MPI: A High-Performance, Heterogeneous MPI.",
                    "A 2-Approximation Algorithm for Scheduling Independent Tasks onto a Uniform Parallel Machine and its Extension to a Computational Grid.",
                    "JaceP2P: an Environment for Asynchronous Computations on Peer-to-Peer Networks.",
                    "Virtual Structured P2P Network Topology for Distributed Computing.",
                    "A Parallel Algorithm for the Solution of the Deconvolution Problem on Heterogeneous Networks.",
                    "Well balanced sparse matrix-vector multiplication on a parallel heterogeneous system.",
                    "TGrid - Grid runtime support for hierarchically structured task-parallel programs.",
                    "A Quadratic Self-Scheduling Algorithm for Heterogeneous Distributed Computing Systems.",
                    "Self-Adapting Scheduling for Tasks with Dependencies in Stochastic Environments.",
                    "A Framework for Adaptive Communication Modeling on Heterogeneous Hierarchical Clusters.",
                    "Out of User Space Storage and RDMA.",
                    "Initial Performance Evaluation of the NetEffect 10 Gigabit iWARP Adapter.",
                    "Exploiting RDMA operations for Providing Efficient Fine-Grained Resource Monitoring in Cluster-based Servers.",
                    "Software iSCSI over iWARP on a General Purpose CPU.",
                    "Architecture and Implementation of Sockets Direct Protocol in Windows.",
                    "Experiences from Debugging a PCIX-based RDMA-capable NIC.",
                    "Performance Study of Winsock Direct with 10 Gb Ethernet RDMA-Enabled NIC."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th CLUSTER 2005",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2005",
                "sub_name": "2005 IEEE International Conference on Cluster Computing (CLUSTER 2005), September 26 - 30, 2005, Boston, Massachusetts, USA.",
                "count": 85,
                "papers": [
                    "TCP Adaptation for MPI on Long-and-Fat Networks.",
                    "Extracting Critical Path Graphs from MPI Applications.",
                    "Accelerating List Management for MPI.",
                    "Search-based Job Scheduling for Parallel Computer Workloads.",
                    "A Case for Cooperative and Incentive-Based Coupling of Distributed Clusters.",
                    "Transparent Checkpoint-Restart of Distributed Applications on Commodity Clusters.",
                    "Load Balancing using Grid-based Peer-to-Peer Parallel I/O.",
                    "An Efficient, Nonintrusive, Log-Based I/O Mechanism for Scientific Simulations on Clusters.",
                    "Near Overhead-free Heterogeneous Thread-migration.",
                    "Job-Site Level Fault Tolerance for Cluster and Grid environments.",
                    "An Efficient Network API for in-Kernel Applications in Clusters.",
                    "Toward an Optimal Redundancy Strategy for Distributed Computations.",
                    "Efficient and Robust Computation of Resource Clusters in the Internet.",
                    "Fast Query Processing by Distributing an Index over CPU Caches.",
                    "Online Critical Path Profiling for Parallel Applications.",
                    "Bandwidth Efficient All-to-All Broadcast on Switched Clusters.",
                    "Swapping to Remote Memory over InfiniBand: An Approach using a High Performance Network Block Device.",
                    "Optimizing Latency under Throughput Requirements for Streaming Applications on Cluster Execution.",
                    "Experiment Management and Analysis with perfbase.",
                    "Service Augmentation for High End Interactive Data Services.",
                    "Distributed Out-of-Core Preprocessing of Very Large Microscopy Images for Efficient Querying.",
                    "A Generic Proxy Mechanism for Secure Middlebox Traversal.",
                    "A Load Balancing Scheme for Cluster-based Secure Network Servers.",
                    "A New Allocation Scheme for Parallel Applications with Deadline and Security Constraints on Clusters.",
                    "Reliability-aware Checkpoint/Restart Scheme: A Performability Trade-off.",
                    "A pipelined data-parallel algorithm for ILP.",
                    "An Efficient Metadata Distribution Policy for Cluster File Systems.",
                    "Implementation and Performance of Portals 3.3 on the Cray XT3.",
                    "A Cost/Benefit Estimating Service for Mapping Parallel Applications on Heterogeneous Clusters.",
                    "A Feasibility Analysis of Power Awareness in Commodity-Based High-Performance Clusters.",
                    "VioCluster: Virtualization for Dynamic Computational Domains.",
                    "Analysis of Distributed Java Applications Using Dynamic Instrumentation.",
                    "Fire Phoenix Cluster Operating System Kernel and its Evaluation.",
                    "Exploiting NIC Memory for Improving Cluster-Based Webserver Performance.",
                    "Head-to-TOE Evaluation of High-Performance Sockets over Protocol Offload Engines.",
                    "Modeling Protocol Offload for Message-oriented Communication.",
                    "A Web Services and Ontology Based Performance Visualization Framework for Grid Environments.",
                    "Grid and Cluster Matrix Computation with Persistent Storage and Out-of-core Programming.",
                    "An Infrastructure of Network Services for Seamless Integration in Advanced Collaborative Computing Environments.",
                    "Harnessing Shared Wide-area Clusters for Dynamic High End Services.",
                    "Minimizing the Network Overhead of Checkpointing in Cycle-harvesting Cluster Environments.",
                    "Service Level Agreement based Allocation of Cluster Resources: Handling Penalty to Enhance Utility.",
                    "On the Discovery of Brokers in Distributed Messaging Infrastructures.",
                    "A Case for Dynamic Page Migration in Multiple-Writer Software DSM Systems.",
                    "Macro-Dataflow using Software Distributed Shared Memory.",
                    "Restricted Slow-Start for TCP.",
                    "A TCO Analysis of Cluster Servers Based on TPC-H Benchmarks.",
                    "The SMASH Impacts to Cluster Computing.",
                    "Scalable Consistency Management in Dynamic Content Distribution Overlays.",
                    "A Biologically-inspired Adaptation Mechanism for Autonomic Grid Networks.",
                    "Registration and Resource Allocation Mechanisms in High-Performance Application Frameworks.",
                    "Hierarchical CPU Schedulers for Multiprocessor Systems, Fair CPU Scheduling and Processes Isolation.",
                    "SymbioticSphere: Towards an Autonomic Grid Network System.",
                    "Cluster Spanning with Virtual Environments.",
                    "IBRIX File System: Architecture and Design.",
                    "Performance Effects of Interrupt Throttle Rate on Linux Clusters using Intel Gigabit Network Adapters.",
                    "Meaningful Automated Statistical Analysis of Large Computational Clusters.",
                    "The ELIHE High-Performance Cluster.",
                    "Spare Instance: an Adaptive Mechanism for Managing Cluster Applications.",
                    "Illuminator: a Free Graphics Toolkit for Parallel Visualization of Continuum Field Data.",
                    "An integrated Retrieval and Pre-fetching algorithms for Segmented Streaming in Mobile Peer-to-Peer Networks.",
                    "Experience Of OS Optimization For Linpack On Dawning4000A.",
                    "Adaptive Checkpointing for Master-Worker Style Parallelism.",
                    "Adaptive Management of a Utility Computing.",
                    "Dynamic Multi-Resource Monitoring for Predictive Job Scheduling with ScoPro.",
                    "Co-Scheduling Parallel Electronic Structure Calculations in SMP Cluster Environments.",
                    "Quantum Trajectories with Dynamic Loop Scheduling and Reinforcement Learning.",
                    "Parallel Out-of-Core Matlab for Extreme Virtual Memory.",
                    "Automatic Parallelization with pMapper.",
                    "Providing Local ORB-Like Services to Collocated CORBA Components.",
                    "A Framework for Statistical Analysis of Datasets on Heterogeneous Clusters.",
                    "A Poly-Algorithm for Efficient Parallel Matrix Multiplication on Metacomputing Platforms.",
                    "Processes Distribution of Homogeneous Parallel Linear Algebra Routines on Heterogeneous Clusters.",
                    "TreeP: A Tree Based P2P Network Architecture.",
                    "Robust Processor Allocation for Independent Tasks When Dollar Cost for Processors is a Constraint.",
                    "Static scheduling of dependent parallel tasks on heterogeneous clusters.",
                    "Topology-Based Meshes for Local Communication in Data-Parallel Applications.",
                    "Toward global and grid computing for large scale linear algebra problems.",
                    "Transparently Achieving Superior Socket Performance Using Zero Copy Socket Direct Protocol over 20Gb/s InfiniBand Links.",
                    "A Performance Analysis of the Ammasso RDMA Enabled Ethernet Adapter and its iWARP API.",
                    "Interoperability through Conformance; The iWARP validation process.",
                    "RNIC-PI: The last step in standardizing RDMA.",
                    "Memory Management Support for Multi-Programmed Remote Direct Memory Access (RDMA) Systems.",
                    "Supporting iWARP Compatibility and Features for Regular Network Adapters.",
                    "Multi-stream MPA."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th CLUSTER 2004",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2004",
                "sub_name": "2004 IEEE International Conference on Cluster Computing (CLUSTER 2004), September 20-23 2004, San Diego, California, USA.",
                "count": 67,
                "papers": [
                    "Parallel I/O: lessons learnt in the last 20 years.",
                    "Building highly available HPC clusters with HA-OSCAR.",
                    "State of InfiniBand in designing HPC clusters, storage/file systems, and datacenters [datacenters read as data centers].",
                    "MPI tuning with Intel© Trace Analyzer and Intel Trace Collector.",
                    "MPIIMGEN - a code transformer that parallelizes image processing codes to run on a cluster of workstations.",
                    "The design and implementation of an asynchronous communication mechanism for the MPI communication model.",
                    "Communicating efficiently on cluster based grids with MPICH-VMI.",
                    "On fairness in distributed job scheduling across multiple sites.",
                    "Bandwidth-aware co-allocating meta-schedulers for mini-grid architectures.",
                    "A comparison of local and gang scheduling on a Beowulf cluster.",
                    "A parallel I/O mechanism for distributed systems.",
                    "RFS: efficient and flexible remote file access for MPI-IO.",
                    "An efficient end-host architecture for cluster communication.",
                    "FTC-Charm++: an in-memory checkpoint-based fault tolerant runtime for Charm++ and MPI.",
                    "Fault-tolerant grid services using primary-backup: feasibility and performance.",
                    "Improved message logging versus improved coordinated checkpointing for fault tolerant MPI.",
                    "Scalable, high-performance NIC-based all-to-all broadcast over Myrinet/GM.",
                    "Efficient Barrier and Allreduce on Infiniband clusters using multicast and adaptive algorithms.",
                    "On optimizing collective communication.",
                    "RAAC: an architecture for scalable, reliable storage in clusters.",
                    "Hierarchical Bloom filter arrays (HBA): a novel, scalable metadata management system for large cluster-based storage.",
                    "Simplifying administration through dynamic reconfiguration. in a cooperative cluster storage system.",
                    "GNET-1: gigabit Ethernet network testbed.",
                    "A comparison of 4X InfiniBand and Quadrics Elan-4 technologies.",
                    "NIC-based offload of dynamic user-defined modules for Myrinet clusters.",
                    "A novel adaptive home migration protocol in home-based DSM.",
                    "LOTS: a software DSM supporting large object space.",
                    "Cluster computing environment supporting single system image.",
                    "Towards provision of quality of service guarantees in job scheduling.",
                    "Implementation and design analysis of a network messaging module using virtual interface architecture.",
                    "A distributed data management middleware for data-driven application systems.",
                    "Kerrighed and data parallelism: cluster computing on single system image operating systems.",
                    "An evaluation of the close-to-files processor and data co-allocation policy in multiclusters.",
                    "Location management in object-based distributed computing.",
                    "Towards informatic analysis of Syslogs.",
                    "Component-based cluster systems software architecture a case study.",
                    "Predicting memory-access cost based on data-access patterns.",
                    "Grid systems deployment & management using Rocks.",
                    "Computation-at-risk: employing the grid for computational risk management.",
                    "Management of grid jobs and data within SAMGrid.",
                    "Performance analysis tools for large-scale Linux clusters.",
                    "Analysis of microbenchmarks for performance tuning of clusters.",
                    "NWPerf: a system wide performance monitoring tool for large Linux clusters.",
                    "TeraVision: a distributed, scalable, high resolution graphics streaming system.",
                    "ClusterSim: a Java-based parallel discrete-event simulation tool for cluster computing.",
                    "JuxtaView - a tool for interactive visualization of large imagery on scalable tiled displays.",
                    "Rolls: modifying a standard system installer to support user-customizable cluster frontend appliances.",
                    "A client-centric grid knowledgebase.",
                    "Give your bootstrap the boot: using the operating system to boot the operating system.",
                    "Parallel competitive learning algorithm for fast codebook design on partitioned space.",
                    "Implementing parallel conjugate gradient on the EARTH multithreaded architecture.",
                    "XChange: coupling parallel applications in a dynamic environment.",
                    "APENet: a high speed, low latency 3D interconnect network.",
                    "Predicting resource demand profiles by periodicity mining.",
                    "Application-specific scheduling for the organic grid.",
                    "Attaining higher performance in collective communication.",
                    "QMP-MVIA: a message passing system for Linux clusters with gigabit Ethernet mesh connections.",
                    "GRID-enabled bioinformatics applications for comparative genomic analysis at the CBBC.",
                    "Fast broadcast by the divide-and-conquer algorithm.",
                    "Master slave scheduling on heterogeneous star-shaped platforms with limited memory.",
                    "Reliability algorithms for network swapping systems with page migration.",
                    "A community faulted-crust model using PYRAMID on cluster platforms.",
                    "Flexible and dynamic control of network QoS in grid environments: the QoSINUS approach.",
                    "Improving the performance of communication-intensive parallel applications executing on clusters.",
                    "Dynamic page migration in software DSM systems.",
                    "A shared virtual memory network with fast remote direct memory access and message passing.",
                    "The Los Alamos Crestone Project: cluster computing applications."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5th CLUSTER 2003",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2003",
                "sub_name": "2003 IEEE International Conference on Cluster Computing (CLUSTER 2003), 1-4 December 2003, Kowloon, Hong Kong, China.",
                "count": 79,
                "papers": [
                    "Message from the TFCC Co-Chairs.",
                    "Message from the General Co-Chairs.",
                    "Message from the Program Co-Chairs.",
                    "Cluster 2003 Conference Organization Committee.",
                    "Program Committee.",
                    "Additional Reviewers.",
                    "Cluster 2003 Sponsors.",
                    "Designing Next Generation Clusters with Infiniband: Opportunities and Challenges.",
                    "Using MPI-2: Advanced Features of the Message Passing Interface.",
                    "The Gridbus Toolkit for Grid and Utility Computing.",
                    "Building and Managing Clusters with NPACI Rocks.",
                    "Grid Demo - Live Demonstrations of Grid Technologies and Applications.",
                    "Dynamic Scheduling of Parallel Real-Time Jobs by Modelling Spare Capabilities in Heterogeneous Clusters.",
                    "Parallel Job Scheduling on Multicluster Computing Systems.",
                    "Interstitial Computing: Utilizing Spare Cycles on Supercomputers.",
                    "A Cluster-Based Solution for High Performance Hmmpfam Using EARTH Execution Model.",
                    "Computing Large-Scale Alignments on a Multi-Cluster.",
                    "Auto-CFD: Efficiently Parallelizing CFD Applications on Clusters.",
                    "Performance Analysis of a Large-Scale Cosmology Application on Three Cluster Systems.",
                    "A Performance Monitor Based on Virtual Global Time for Clusters of PCs.",
                    "A Distributed Performance Analysis Architecture for Clusters.",
                    "Co-Ordinated Coscheduling in Time-Sharing Clusters through a Generic Framework.",
                    "A Robust Scheduling Strategy for Moldable Scheduling of Parallel Jobs.",
                    "Towards Load Balancing Support for I/O-Intensive Parallel Jobs in a Cluster of Workstations.",
                    "JavaSplit: A Runtime for Execution of Monolithic Java Programs on Heterogeneous Collections of Commodity Workstations.",
                    "Performance Analysis of Java Message-Passing Libraries on Fast Ethernet, Myrinet and SCI Clusters.",
                    "Compiler Optimized Remote Method Invocation.",
                    "Optimizing Mechanisms for Latency Tolerance in Remote Memory Access Communication on Clusters.",
                    "Impact of Computational Resource Reservation to the Communication Performance in the Hypercluster Environment.",
                    "Kernel Implementations of Locality-Aware Dispatching Techniques for Web Server Clusters.",
                    "OptimalGrid: Middleware for Automatic Deployment of Distributed FEM Problems on an Internet-Based Computing Grid.",
                    "Adaptive Grid Resource Brokering.",
                    "HPCM: A Pre-Compiler Aided Middleware for the Mobility of Legacy Code.",
                    "The ProcessManagement Component of a Scalable Systems Software Environment.",
                    "Load Distribution for Heterogeneous and Non-Dedicated Clusters Based on Dynamic Monitoring and Differentiated Services.",
                    "GridRM: An Extensible Resource Monitoring System.",
                    "A High Performance Redundancy Scheme for Cluster File Systems.",
                    "VegaFS: A Prototype for File-Sharing Crossing Multiple Administrative Domains.",
                    "Design and Performance of the Dawning Cluster File System.",
                    "Coordinated Checkpoint versus Message Log for Fault Tolerant MPI.",
                    "A Performance Comparison of Linux and a Lightweight Kernel.",
                    "Implications of a PIM Architectural Model for MPI.",
                    "Reusable Mobile Agents for Cluster Computing.",
                    "High Service Reliability for Cluster Server Systems.",
                    "Wide Area Cluster Monitoring with Ganglia.",
                    "Efficient Parallel Out-of-Core Matrix Transposition.",
                    "A Case Study of Parallel I/O for Biological Sequence Search on Linux Clusters.",
                    "CTFS: A New Light-Weight, Cooperative Temporary File System for Cluster-Based Web Servers.",
                    "Efficient Structured Data Access in Parallel File Systems.",
                    "View I/O: Improving the Performance of Non-Contiguous I/O.",
                    "Supporting Efficient Noncontiguous Access in PVFS over InfiniBand.",
                    "A General Self-Adaptive Task Scheduling System for Non-Dedicated Heterogeneous Computing.",
                    "Adding Memory Resource Consideration into Workload Distribution for Software DSM Systems.",
                    "An Energy-Based Implicit Co-Scheduling Model for Beowulf Cluster.",
                    "Availability Prediction and Modeling of High Availability OSCAR Cluster.",
                    "A System Recovery Benchmark for Clusters.",
                    "Performance Evaluation of Routing Algorithms in RHiNET-2 Cluster.",
                    "Application-Bypass Reduction for Large-Scale Clusters.",
                    "Improving the Performance of MPI Derived Datatypes by Optimizing Memory-Access Cost.",
                    "Shared Memory Mirroring for Reducing Communication Overhead on Commodity Networks.",
                    "\"Plug-and-Play\" Cluster Computing Using Mac OS X.",
                    "Improving Performance of a Dynamic Load Balancing System by Using Number of Effective Tasks.",
                    "Dynamic Self-Adaptive Replica Location Method in Data Grids.",
                    "Efficient Distributed Disk Caching in Data Grid Management.",
                    "Optimized Implementation of Extendible Hashing to Support Large File System Directory.",
                    "Parallel Design Pattern for Computational Biology and Scientific Computing Applications.",
                    "FJM: A High Performance Java Message Library.",
                    "Cluster Architecture with Lightweighted Redundant TCP Stacks.",
                    "From Clusters to the Fabric: The Job Management Perspective.",
                    "Towards an Efficient Cluster-Based E-Commerce Server.",
                    "A Kernel Running in a DSM - Design Aspects of a Distributed Operating System.",
                    "Distributed Recursive Sets: Programmability and Effectiveness for Data Intensive Applications.",
                    "Run-Time Prediction of Parallel Applications on Shared Environments.",
                    "An Instance-Oriented Security Mechanism in Grid-Based Mobile Agent System.",
                    "A Hierarchical and Distributed Approach for Mapping Large Applications to Heterogeneous Grids Using Genetic Algorithms.",
                    "BCFG: A Con.guration Management Tool for Heterogeneous Environments.",
                    "Communication Middleware Systems for Heterogenous Clusters: A Comparative Study.",
                    "QoS-Aware Adaptive Resource Management in Distributed Multimedia System Using Server Clusters.",
                    "On the InfiniBand Subnet Discovery Process."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4th CLUSTER 2002",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2002",
                "sub_name": "2002 IEEE International Conference on Cluster Computing (CLUSTER 2002), 23-26 September 2002, Chicago, IL, USA.",
                "count": 68,
                "papers": [
                    "Blades - An Emerging System Design Model for Economic Delivery of High Performance Computing.",
                    "ZENTURIO: An Experiment Management System for Cluster and Grid Computing.",
                    "An Agent-Based Infrastructure for Parallel Java on Heterogeneous Cluster.",
                    "Shell over a Cluster (SHOC): Towards Achieving Single System Image via the Shell.",
                    "Supermon: A High-Speed Cluster Monitoring System.",
                    "Leveraging Standard Core Technologies to Programmatically Build Linux Cluster Appliances.",
                    "Clusters as Large-Scale.",
                    "Experience in Offloading Protocol Processing to a Programmable NIC.",
                    "Supporting MPI Collective Communication on Network Processors.",
                    "Efficient Barrier Using Remote Memory Operations on VIA-Based Clusters.",
                    "I-Cluster: The Execution Sandbox.",
                    "BioOpera: Cluster-Aware Computing.",
                    "Selective Buddy Allocation for Scheduling Parallel Jobs on Clusters.",
                    "I/O Analysis and Optimization for an AMR Cosmology Application.",
                    "Parallel Pattern Identification in Biological Sequences on Clusters.",
                    "Performance and Implementation of Distributed Data CPHF and SCF Algorithms.",
                    "Design and Implementation of CC-NUMA Card II for SCI-Based PC Clustering.",
                    "Impact of On-Demand Connection Management in MPI over VIA.",
                    "MyVIA: A Design and Implementation of the High Performance Virtual Interface Architecture.",
                    "Production Clustering at Pratt & Whitney: Desktop Supercomputing for Engineering Design.",
                    "Trends in High Performance Computing and Using Numerical Libraries on Cluster.",
                    "First Light of the Earth Simulator and Its PC Cluster Applications.",
                    "High Performance User Level Sockets over Gigabit Ethernet.",
                    "Protocol-Dependent Message-Passing Performance on Linux Clusters.",
                    "Mixed Mode Matrix Multiplication.",
                    "Cplant? Runtime System Support for Multi-Processor and Heterogeneous Compute Nodes.",
                    "Scalable Cluster Administration - Chiba City I Approach and Lessons Learned.",
                    "Disaster Tolerant Wolfpack Geo-Clusters.",
                    "Memory Mapped Networks: A New Deal for Distributed Shared Memories? The SciFS Experience.",
                    "Adaptive Message Management Using Hybrid Channel Model in Parallel File System.",
                    "The Bladed Beowulf: A Cost-Effective Alternative to Traditional Beowulf.",
                    "Goals Guiding Design: PVM and MP.",
                    "Design and Validation of Portable Communication Infrastructure for Fault-Tolerant Cluster Middleware.",
                    "A Parallelization Technique that Improves Performance and Cluster Utilization Efficiency for Heterogeneous Clusters of Workstations.",
                    "An Extensible, Portable, Scalable Cluster Management Software Architecture.",
                    "Processor Allocation on Cplant: Achieving General Processor Locality Using One-Dimensional Allocation Strategies.",
                    "Scalable Resource Management in High Performance Computers.",
                    "Reliable Blast UDP: Predictable High Performance Bulk Data Transfer.",
                    "Integrated Admission and Congestion Control for QoS Support in Clusters.",
                    "Socket Cloning for Cluster-Based Web Servers.",
                    "Indexing the Web - A Challenge for Supercomputers.",
                    "Interconnects: Which One Is Right for You?",
                    "Launching into the Future of Commodity Cluster Computing.",
                    "Blue Gene/L, a System-On-A-Chip.",
                    "Scalable Loop Self-Scheduling Schemes for Heterogeneous Clusters.",
                    "Compiling Tiled Iteration Spaces for Clusters.",
                    "An Architecture for Integrated Resource Management of MPI Jobs.",
                    "JESSICA2: A Distributed Java Virtual Machine with Transparent Thread Migration Support.",
                    "CEJVM: \"Cluster Enabled Java Virtual Machine\".",
                    "On the Evaluation of JavaSymphony for Cluster Applications.",
                    "Noncontiguous I/O through PVFS.",
                    "Using Idle Disks in a Cluster as a High-Performance Storage System.",
                    "Kernel-Level Caching for Optimizing I/O by Exploiting Inter-Application Data Sharing.",
                    "MPI in 2002: Has it Been Ten Years Already?",
                    "Research Directions in Parallel I/O for Clusters.",
                    "Low-Cost Non-Intrusive Debugging Strategies for Distributed Parallel Programs.",
                    "SilkRoad II: A Multi-Paradigm Runtime System for Cluster Computing.",
                    "Algorithmic Mechanism Design for Load Balancing in Distributed Systems.",
                    "Community Services: A Toolkit for Rapid Deployment of Network Services.",
                    "A Data Parallel Programming Model Based on Distributed Objects.",
                    "Cluster Based Hybrid Hash Join: Analysis and Evaluation.",
                    "MAGE- A Metacomputing Environment for Parallel Program Development on Cluster Computers.",
                    "COMB: A Portable Benchmark Suite for Assessing MPI Overlap.",
                    "A Distributed Data Implementation of Parallel Full CI Program.",
                    "User-Level Remote Data Access in Overlay Metacomputers.",
                    "Design of a Middleware-Based Cluster Management Platform with Task Management and Migration.",
                    "Job Scheduling for Prime Time vs. Non-Prime Time.",
                    "A New Architecture for Secure Carrier-Class Clusters."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3rd CLUSTER 2001",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2001",
                "sub_name": "2001 IEEE International Conference on Cluster Computing (CLUSTER 2001), 8-11 October 2001, Newport Beach, CA, USA.",
                "count": 73,
                "papers": [
                    "\"Architecture Recapitulates Phylogeny\": How Scalability Requires Specializatio.",
                    "Early Experiences with the Myricom 2000 Switch on an SMP Beowulf-Class Cluster for Unstructured Adaptive Meshing.",
                    "Using Multirail Networks in High-Performance Clusters.",
                    "Next Generation Parallel Virtual File System.",
                    "Experiences with Oasis+: A Fault Tolerant Storage System.",
                    "Clusterfile: A Flexible Physical Layout Parallel File System.",
                    "High Performance Computing with Microsoft Windows 2000.",
                    "GulfStream - a System for Dynamic Topology Management in Multi-domain Server Farms.",
                    "Cluster Rolling Upgrade using Multiple Version Support.",
                    "Dense Computing with Transmeta's Crusoe (invited).",
                    "PVL: An Object Oriented Software Library for Parallel Signal Processing.",
                    "Numerically-Intensive \"Plug-and-Play\" Parallel Computing.",
                    "Parallel Standard Cell Placement on a Cluster of Workstations.",
                    "Stingray: Cone tracing using a software DSM for SCI clusters.",
                    "Parallel and Adaptive Reduction of Hyperspectral Data to Intrinsic Dimensionality.",
                    "Workload Management: More Than Just Job Scheduling.",
                    "Scheduling parallel adaptive applications in networks of workstations and clusters of processors.",
                    "Sharing Partitionable Workloads in Heterogeneous NOWs: Greedier Is Not Better.",
                    "High Performance Computing and Trends: Connected Computational Requirements with Computing Resources.",
                    "Future Directions for the Scyld Advanced Beowulf Management System.",
                    "OSCAR and the Beowulf Arms Race for the \"Cluster Standard\".",
                    "CPPvm - Parallel Programming in C++.",
                    "Dynamic Cluster Configuration and Management using JavaSpaces.",
                    "Communication with Threads in Software DSM.",
                    "IEEE 1394 and RFC 2734; a viable HSI for hypercubes.",
                    "Hierarchical Cluster for Scalable Web Servers.",
                    "A Low-Cost, High-Density Mounting System for Computer Clusters.",
                    "Table-Comparison Prefetching in VIA-based Parallel File System.",
                    "Cluster Trend: DataSpeaking.",
                    "Performance Evaluation of Parallel File Systems for PC Clusters and ASCI Red.",
                    "A High-Availability Clustering Architecture with Data Integrity Guarantees.",
                    "PVM Support for Cluster.",
                    "A Distributed Object Model for Solving Irregularly Structured Problems on Cluster.",
                    "Towards High-Level Programming Support for Scientific Computing on Clusters.",
                    "Performance and Analysis of the PCI-DDC Remote-Write Implementation.",
                    "GMSOCKS - A Direct Sockets Implementation on Myrinet.",
                    "A Reconfigurable Extension to the Network Interface of Beowulf Clusters.",
                    "Intelligence in High Performance Network Interface Card: Hardware vs. Software.",
                    "An SCI-based Software VIA System for PC Clustering.",
                    "A Parallel Programming Environment for a V-Busbased PC-cluste.",
                    "Cluster Software Tools : Beauty is in Simplicity.",
                    "Dynamic Allocation of Nodes on a Large Space-Shared Cluster.",
                    "NPACI Rocks: Tools and Techniques for Easily Deploying Manageable Linux Clusters.",
                    "Graph Partitioning for Dynamic, Adaptive and Multi-phase Scientific Simulations.",
                    "Approximation Algorithms for Data Distribution with Load Balancing of Web Servers.",
                    "A Class of Loop Self-Scheduling for Heterogeneous Clusters.",
                    "A Visualization Tool for Analyzing Cluster Performance Data.",
                    "Semi-Continuous Transmission for Cluster-Based Video Servers.",
                    "Building a Scalable Web Server with Global Object Space Support on Heterogeneous Clusters.",
                    "Adaptive Cluster Computing using JavaSpaces.",
                    "Programmability and Performance of M++ Self-Migrating Threads.",
                    "Cluster-Based Computing with Active, Persistent Objects on the Web.",
                    "Cluster and Grid Superservers: The Dawning Experiences in China.",
                    "Teragrids: The Future of Terascale Cluster Computing.",
                    "Programming with MPI on Clusters.",
                    "Recent Advances in Cluster Networks.",
                    "Aspects of the InfiniBand(tm) Architecture.",
                    "DECK-SCI: High-Performance Communication and Multithreading for SCI Clusters.",
                    "Dynamic Reconfiguration in High-Speed Computer Clusters.",
                    "The Lightweight Protocol CLIC: Performance of an MPI implementation on CLIC.",
                    "SOVIA: A User-level Sockets Layer Over Virtual Interface Architecture.",
                    "Reliably Locking System V Shared Memory for User Level Communication in Linux.",
                    "The Master-Slave Paradigm with Heterogeneous Processors.",
                    "An efficiency and scalability model for heterogeneous clusters.",
                    "Adaptive Runtime Partitioning of AMR Applications on Heterogeneous Clusters.",
                    "The Grid, Virtual Organizations, and Problem-Solving Environments.",
                    "Scalable Cluster Computing-Opportunities and Challenges.",
                    "SCore: An Integrated Cluster System Software Package for High Performance Cluster Computing.",
                    "Advanced Cluster Programming with MP.",
                    "Design and Implementation of Highly Available Linux Clusters.",
                    "The Scyld Beowulf System.",
                    "The Parallel Virtual File System for Commodity Clusters.",
                    "Emerging Technologies for MultiCluster/Grid Computing."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "2nd CLUSTER 2000",
        "info": "Chemnitz, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cluster/2000",
                "sub_name": "2000 IEEE International Conference on Cluster Computing (CLUSTER 2000), November 28th - December 1st, 2000, Technische Universität Chemnitz, Saxony, Germany.",
                "count": 80,
                "papers": [
                    "Tutorial A: Design and Analysis of High Performance Clusters.",
                    "Tutorial B: CORBA: As a Cluster Middleware.",
                    "Tutorial C: Current and Emerging Trends in Cluster Computing.",
                    "Tutorial D: An Introduction to OpenMP and Its Use on Clusters.",
                    "Tutorial E: Hot Topics in Grid Computing.",
                    "Tutorial F: Implementing Agent Applications in Java: Using Mobile and Intelligent Agents.",
                    "Entropia: Megacomputing on the Internet.",
                    "MEMOnet : Network interface plugged into a memory slot.",
                    "The Impact of Caching in a Loosely-coupled Clustered Software DSM System.",
                    "Design and Performance of Maestro Cluster Network.",
                    "Impact of Level 2 Cache and Memory Subsystem on the Scalability of Clusters of Small-Scale SMP Servers.",
                    "Internet Security and Cluster Architecture for Federated E-Commerce.",
                    "Contention-free Complete Exchange Algorithm on Clusters.",
                    "Study of the medium message performance of BIP/Myrinet.",
                    "IP over SCI.",
                    "Madeleine II: a Portable and Efficient Communication Library for High-Performance Cluster Computing.",
                    "Characterization of Communications between Processes in Message-Passing Applications.",
                    "From Metacomputing to Metabusiness Processing.",
                    "An Overview of the Galaxy Management Framework for Scalable Enterprise Cluster Computing.",
                    "Development of a Spaceborne Embedded Cluster.",
                    "The Dolphin D330 Cluster Adapter Card.",
                    "Cluster Optimized High Density Alpha Compute Nodes.",
                    "Cluster Computing at Intel.",
                    "Agilent's Key Technologies in Remote System Management.",
                    "Remote System Management Principles.",
                    "Advanced Cluster Systems - Computing Power to simulate complex systems in a complex world.",
                    "Programming Support for Distributed Clustercomputing.",
                    "JavaSymphony: A System for Development of Locality-Oriented Distributed and Parallel Java Applications.",
                    "Architectural Software Support for Processing Clusters.",
                    "Distributed Solution of Optimal Hybrid Control Problems on Networks of Workstations.",
                    "Scalable Web Clusters with Static and Dynamic Contents.",
                    "The Future of Cluster Interconnects: InfiniBand or Ethernet?",
                    "SCore: An Integrated Cluster System Software Package for High Performance Cluster Computing.",
                    "Parallel Simulation of 3D Nonlinear Acoustic Fields on a Linux-cluster.",
                    "Cluster Based Power System Analysis Applications.",
                    "Browsing Virtual Reality on a PC Cluster.",
                    "An MPI-Based Tool for Distributed Genetic Programming.",
                    "Multi-Grid Acceleration of a SIMPLE-Based CFD-Code and Aspects of Parallelization.",
                    "Proposing a Mechanism for Reliably Locking VIA Communication Memory in Linux.",
                    "Partition Repositories for Partition Cloning - OS Independent Software Maintenance in Large Clusters of PCs.",
                    "SilkRoad: A Multithreaded Runtime System with Software Distributed Shared Memory for SMP Clusters.",
                    "Towards Single Image System: Preemptive migration of system threads with the SCI network.",
                    "A Flexible Monitoring Platform to Build Cluster Management Services.",
                    "PC Clusters - The Convergence of High Performance Systems Architecture.",
                    "A Fair and Effective Scheduling Strategy for Workstation Clusters.",
                    "A Model of Completion Queue Mechanisms using the Virtual Interface API.",
                    "Request Rate Adaptive Dispatching Architecture for Scalable Internet Server.",
                    "A Concurrent Programming Environment with Support for Distributed Computations and Code Mobility.",
                    "A Gracefully Degradable Declustered RAID Architecture with near Optimal Maximal Read and Write Parallelism.",
                    "A Case for Heterogeneous Disk Arrays.",
                    "Efficient Cooperative Caching for File Systems in Cluster-Based Web Servers.",
                    "Performance analysis of storage and network subsystems in cluster architectures.",
                    "Enabling High Performance Data Transfer on Cluster Architecture.",
                    "Design Choices and First Results of Our VIA-Capable PCI-SCI Bridge.",
                    "Parallel Job Scheduling Policy for Workstation Cluster Environments.",
                    "Agent based Resource Discovery for Dynamic Clusters.",
                    "The Océano Project - A Multi-Domain Cluster for a Computing Utility.",
                    "Accelerated Socket Communications in System Area Networks.",
                    "Low-cost Gigabit Ethernet at Work.",
                    "Adaptive Dual-Cache Scheme with Dynamic Prefetching Scheme in Parallel File System.",
                    "FireCluster: PC Cluster System Employing IEEE 1394.",
                    "CLIC: Fast Communication on Linux Clusters.",
                    "Consistent Checkpointing for High Performance Clusters.",
                    "Atomicity, Serialization and Recovery in the Island-Based File System.",
                    "Efficient Parallel I/O on SCI Connected Clusters.",
                    "Using the Resizable Working-set Notion for Software Distributed Shared Memory.",
                    "A CC-NUMA Prototype Card for SCI-Based PC Clustering.",
                    "Inversion of Huge Matrices on Clusters.",
                    "Chained Declustering using Multiple Conventional Filesystems.",
                    "Towards a Generic Information Provision System for the Metacomputing Environment.",
                    "An Over-partitioning Scheme for Parallel Sorting on Clusters with Processors Running at different Speeds.",
                    "Efficient Parallelization of Eulerian-Lagrangian Approach for Disperse Multiphase Flow Calculations on MIMD Computer Architectures.",
                    "ORNL M3C tool.",
                    "Parallel Pull-Based LRU : a New Request Distribution Algorithm for Large Scale SCI Clustered Web Caches.",
                    "Experiments with PVMaple and Parallel Methods for ODEs.",
                    "Parallel Programming Environment for Cluster Computing.",
                    "Distributed Processor Allocation in Multicomputers.",
                    "Parallelizing a CAD-Model-Based Object Localization for Initialization of Tracking in Visual Servoing.",
                    "Yabat: An Administration and Monitoring Software for Beowulf Clusters.",
                    "Heterogeneity Considered Harmful to Algorithm Designers."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "IWCC 1999",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/iwcc/1999",
                "sub_name": "International Workshop on Cluster Computing (IWCC '99), 2-3 December 1999, Melbourne, Australia.",
                "count": 43,
                "papers": [
                    "Fault-Tolerant Cluster Architecture for Business and Scientific Applications.",
                    "Clustering for Research and Production Scale, Parallel and Distributed Computing.",
                    "From PC Clusters to a Global Computational Grid.",
                    "Design and Analysis of the Alliance/University of New Mexico Roadrunner Linux SMP SuperCluster.",
                    "Comparative Performance of a Commodity Alpha Cluster Running Linux and Windows NT.",
                    "Comparing the Communication Performance and Scalability of a Linux and an NT Cluster of PCs, a Cray Origin 2000, an IBM SP and a Cray T3E-600.",
                    "An Assessment of Gigabit Ethernet as Cluster Interconnect.",
                    "Evaluation of the Performance of Multithreaded Cilk Runtime System on SMP Clusters.",
                    "A Communication Staging Technique for Network Cache Interconnected Clusters.",
                    "Communication Kernel for High Speed Networks in the Parallel Environment LANDA-HSN.",
                    "Smart Cluster Network (SCnet): Design of High Performance Communication System for SAN.",
                    "A High Performance Communication Subsystem for PODOS.",
                    "Realistic Communication Model for Parallel Computing on Cluster.",
                    "Optimizing User-Level Communication Patterns on the Fujitsu AP3000.",
                    "Algorithms for Stable Sorting to Minimize Communications in Networks of Workstations and Their Implementations in BSP.",
                    "Key Message Algorithm: A Communication Optimization Algorithm in Cluster-Based Parallel Computing.",
                    "Soda: A File System for a Multicomputer.",
                    "File Replication for Enhancing the Availability of Parallel I/O Systems on Clusters.",
                    "I/O in the Gardens Non-Dedicated Cluster Computing Environment.",
                    "MPI-IO on a Parallel File System for Cluster of Workstations.",
                    "Single I/O Space for Scalable Cluster Computing.",
                    "Formal Specification of Virtual Process Topologies.",
                    "Task Partitioning Utilizing Available Time on Multiprocessor Systems for a Given Schedule.",
                    "An Efficient Resource Allocation Scheme for Gang Scheduling.",
                    "Building and Scheduling Parallel Adaptive Applications in Heterogeneous Environments.",
                    "Cost-Efficient Load Distribution Using Multicasting.",
                    "Investigation to Make Best Use of LSF with High Efficiency.",
                    "Self-Migrating Threads for Multi-Agent Applications.",
                    "High Performance Distributed Objects for Cluster Computing.",
                    "Resource Manager for Globus-Based Wide-Area Cluster Computing.",
                    "Nomad: A Scalable Operating System for Clusters of Uni and Multiprocessors.",
                    "Contractual Operating System - Design and Problems.",
                    "ClusterProbe: An Open, Flexible and Scalable Cluster Monitoring Tool.",
                    "Sharing the Garden GATE: Towards an Efficient Uniform Programming Model for CLUMPS.",
                    "Debugging Parallel Programs Using Incomplete Information.",
                    "The Influence of Concurrent Process Duplication on the Performance of Parallel Applications Executing on COWs.",
                    "Massively Parallel Simulated Annealing Embedded with Downhill - A SPMD Algorithm for Cluster Computing.",
                    "Unobtrusive Workstation Farming Without Inconveniencing Owners: Learning Backgammon with a Genetic Algorithm.",
                    "Lattice Field Theory on Cluster Computers: Vector- Vs. Cache-Centric Programming.",
                    "A Finite Element Solver for Convection Diffusion Problems Using a Cluster of PC's.",
                    "Sun ClusterTM Architecture: A White Paper.",
                    "Global Resource Director (GRD): Customer Scenarios for Large Multiprocessor Environments.",
                    "HP Hyperplex® Clustering Technology."
                ]
            }
        ]
    }
]