[
    {
        "name": "DC",
        "year": "2022",
        "info": "Volume 35, 2022",
        "count": 11,
        "papers": [
            "The consensus number of a cryptocurrency.",
            "Correction to: The consensus number of a cryptocurrency.",
            "Dynamic scheduling in distributed transactional memory.",
            "Synthesizing optimal bias in randomized self-stabilization.",
            "Distributed bare-bones communication in wireless networks.",
            "On atomic registers and randomized consensus in M&M systems.",
            "TuringMobile: a turing machine of oblivious mobile robots with limited visibility and its applications.",
            "Unbeatable consensus.",
            "Strong eventual consistency of the collaborative editing framework WOOT.",
            "Equivalence classes and conditional hardness in massively parallel computations.",
            "Distributed computation and reconfiguration in actively dynamic networks."
        ]
    },
    {
        "name": "DC",
        "year": "2021",
        "info": "Volume 34, 2021",
        "count": 26,
        "papers": [
            "Computing approximate Nash equilibria in network congestion games with polynomially decreasing cost functions.",
            "Property testing of planarity in the CONGEST model.",
            "Tractable low-delay atomic memory.",
            "Optimal extension protocols for byzantine broadcast and agreement.",
            "Low-Congestion shortcuts without embedding.",
            "Time-space trade-offs in population protocols for the majority problem.",
            "Redundancy in distributed proofs.",
            "The complexity of verifying population protocols.",
            "Reviewer Acknowledgement (2020).",
            "Lower bounds for in-network computation of arbitrary functions.",
            "MinMax algorithms for stabilizing consensus.",
            "Phase transition of the 2-Choices dynamics on core-periphery networks.",
            "Special issue on PODC 2018 and DISC 2018.",
            "Lower bounds for searching robots, some faulty.",
            "Improved distributed Δ-coloring.",
            "Almost global problems in the LOCAL model.",
            "Broadcast and minimum spanning tree with o(m) messages in the asynchronous CONGEST model.",
            "Multi-shot distributed transaction commit.",
            "Precision, recall, and sensitivity of monitoring partially synchronous distributed programs.",
            "Low-congestion shortcut and graph parameters.",
            "Windowed backoff algorithms for WiFi: theory and performance under batched arrivals.",
            "Optimistically tuning synchronous byzantine consensus: another win for null messages.",
            "Special issue on PODC 2019.",
            "Concurrent disjoint set union.",
            "Composable computation in discrete chemical reaction networks.",
            "Fast approximate shortest paths in the congested clique."
        ]
    },
    {
        "name": "DC",
        "year": "2020",
        "info": "Volume 33, 2020",
        "count": 27,
        "papers": [
            "Some lower bounds in dynamic networks with oblivious adversaries.",
            "Distributed exploration of dynamic rings.",
            "Shape formation by programmable particles.",
            "The computational structure of progress conditions and shared objects.",
            "A complexity-based classification for multiprocessor synchronization.",
            "Fast distributed approximation for TAP and 2-edge-connectivity.",
            "Deciding and verifying network properties locally with few output bits.",
            "The complexity of leader election in diameter-two networks.",
            "Editorial: Special issue of PODC 2017 and DISC 2017.",
            "Adding concurrency to smart contracts.",
            "What can be sampled locally?",
            "Life beyond set agreement.",
            "Improved deterministic distributed matching via rounding.",
            "Improved distributed degree splitting and edge coloring.",
            "Demand-aware network designs of bounded degree.",
            "Extending hardware transactional memory capacity via rollback-only transactions and suspend/resume.",
            "Derandomizing local distributed algorithms under bandwidth restrictions.",
            "Confidential gossip.",
            "Self-stabilizing gathering of mobile robots under crash or Byzantine faults.",
            "Preserving stabilization while practically bounding state space using incorruptible partially synchronized clocks.",
            "Meeting in a polygon by anonymous oblivious robots.",
            "A tight lower bound for semi-synchronous collaborative grid exploration.",
            "The RedBlue family of universal constructions.",
            "Communication complexity of approximate maximum matching in the message-passing model.",
            "Detecting cliques in CONGEST networks.",
            "Fooling views: a new lower bound technique for distributed computations under congestion.",
            "Fault-tolerant simulation of population protocols."
        ]
    },
    {
        "name": "DC",
        "year": "2019",
        "info": "Volume 32, 2019",
        "count": 30,
        "papers": [
            "Automation of fault-tolerant graceful degradation.",
            "Distributed approximation of k-service assignment.",
            "Fast distributed algorithms for testing graph properties.",
            "Self-stabilizing repeated balls-into-bins.",
            "Scalable eventually consistent counters over unreliable networks.",
            "Asynchronous Arbitrary Pattern Formation: the effects of a rigorous approach.",
            "Distributed distance computation and routing with small messages.",
            "Leveraging multiple channels in ad hoc networks.",
            "Minimizing message size in stochastic communication patterns: fast self-stabilizing protocols with 3 bits.",
            "Chemical foundations of distributed aspects.",
            "Randomized proof-labeling schemes.",
            "The topology of look-compute-move robot wait-free algorithms with hard termination.",
            "Noisy rumor spreading and plurality consensus.",
            "Defending non-Bayesian learning against adversarial attacks.",
            "Embedded pattern formation by asynchronous robots without chirality.",
            "Asynchronous approach in the plane: a deterministic polynomial algorithm.",
            "Near-optimal self-stabilising counting and firing squads.",
            "Secretary markets with local information.",
            "Ordered and delayed adversaries and how to work against them on a shared channel.",
            "Making asynchronous distributed computations robust to noise.",
            "Non-blocking Patricia tries with replace operations.",
            "Consensus in rooted dynamic networks with short-lived stability.",
            "Special issue on PODC 2015 and PODC 2016.",
            "Algebraic methods in the congested clique.",
            "The weakest failure detector for eventual consistency.",
            "Search on a line with faulty robots.",
            "Reliable communication over highly connected noisy networks.",
            "Contention resolution on a fading channel.",
            "Recoverable mutual exclusion.",
            "Efficient randomized test-and-set implementations."
        ]
    },
    {
        "name": "DC",
        "year": "2018",
        "info": "Volume 31, 2018",
        "count": 26,
        "papers": [
            "Gathering of robots on meeting-points: feasibility and optimal resolution algorithms.",
            "Choreographies, logically.",
            "Computing large independent sets in a single round.",
            "Distributed backup placement in networks.",
            "Anonymous obstruction-free (n, k)-set agreement with n-k+1 atomic read/write registers.",
            "On efficient distributed construction of near optimal routing schemes.",
            "Compact deterministic self-stabilizing leader election on a ring: the exponential advantage of being talkative.",
            "Inherent limitations of hybrid transactional memory.",
            "Parameterized model checking of rendezvous systems.",
            "Distributed construction of purely additive spanners.",
            "Sade: competitive MAC under adversarial SINR.",
            "Introduction to the special issue of papers from DISC 2015.",
            "Stable leader election in population protocols requires linear time.",
            "Smoothed analysis of dynamic networks.",
            "Geometric and combinatorial views on asynchronous computability.",
            "On the optimal space complexity of consensus for anonymous processes.",
            "Passive testing with asynchronous communications and timestamps.",
            "Terminating distributed construction of shapes and patterns in a fair solution of automata.",
            "TM2C: a software transactional memory for many-cores.",
            "The entropy of a distributed computation random number generation from memory interleaving.",
            "A resource-competitive jamming defense.",
            "Simple multi-party set reconciliation.",
            "How many cooks spoil the soup?",
            "Time-communication impossibility results for distributed transactional memory.",
            "Communication-efficient randomized consensus.",
            "Breaking the $$\\log n$$ log n barrier on rumor spreading."
        ]
    },
    {
        "name": "DC",
        "year": "2017",
        "info": "Volume 30, 2017",
        "count": 23,
        "papers": [
            "Determining majority in networks with local interactions and very small local memory.",
            "A unified approach for gathering and exclusive searching on rings under weak assumptions.",
            "A coded shared atomic memory algorithm for message passing architectures.",
            "Optimal gathering of oblivious robots in anonymous graphs and its application on trees and rings.",
            "Reliable broadcast with respect to topology knowledge.",
            "Who are you? Secure identities in single hop ad hoc networks.",
            "The multi-agent rotor-router on the ring: a deterministic alternative to parallel random walks.",
            "The ANTS problem.",
            "Searching without communicating: tradeoffs between performance and selection complexity.",
            "Secure multi-party computation in large networks.",
            "Lower and upper bounds for single-scanner snapshot implementations.",
            "Distributed algorithms for the Lovász local lemma and graph coloring.",
            "Fault-tolerant aggregation: Flow-Updating meets Mass-Distribution.",
            "Simple dynamics for plurality consensus.",
            "Special issue on DISC 2013, 2014 and PODC 2014.",
            "When distributed computation is communication expensive.",
            "Linear-in-Δ lower bounds in the LOCAL model.",
            "Breathe before speaking: efficient information dissemination despite noisy, limited and anonymous communication.",
            "Vertex fault tolerant additive spanners.",
            "Speed faults in computation by chemical reaction networks.",
            "A theoretical and empirical evaluation of an algorithm for self-healing computation.",
            "Distributed computing by mobile robots: uniform circle formation.",
            "On the uncontended complexity of anonymous agreement."
        ]
    },
    {
        "name": "DC",
        "year": "2016",
        "info": "Volume 29, 2016",
        "count": 25,
        "papers": [
            "Fair and resilient Incentive Tree mechanisms.",
            "Near-optimal communication-time tradeoff in fault-tolerant computation of aggregate functions.",
            "A distributed low tree-depth decomposition algorithm for bounded expansion classes.",
            "Time versus cost tradeoffs for deterministic rendezvous in networks.",
            "Close to linear space routing schemes.",
            "Special issue in memory of Berthold Vöcking.",
            "Nearly optimal bounds for distributed wireless scheduling in the SINR model.",
            "Simple and optimal randomized fault-tolerant rumor spreading.",
            "Concurrent imitation dynamics in congestion games.",
            "Tight bounds for parallel randomized load balancing.",
            "A simple approach for adapting continuous load balancing processes to discrete settings.",
            "DEX: self-healing expanders.",
            "Rendezvous in networks in spite of delay faults.",
            "Simple and efficient local codes for distributed stable network construction.",
            "Upper and lower bounds for deterministic broadcast in powerline communication networks.",
            "Universal constructions that ensure disjoint-access parallelism and wait-freedom.",
            "Modelling and verifying the AODV routing protocol.",
            "Efficient randomised broadcasting in random regular networks with applications in peer-to-peer systems.",
            "Randomized mutual exclusion on a multiple access channel.",
            "Distributed algorithms for barrier coverage using relocatable sensors.",
            "Feedback from nature: simple randomised distributed algorithms for maximal independent set selection and greedy colouring.",
            "The computability of relaxed data structures: queues and stacks as examples.",
            "On the effect of the deployment setting on broadcasting in Euclidean radio networks.",
            "Byzantine gathering in networks.",
            "Formal verification of mobile robot protocols."
        ]
    },
    {
        "name": "DC",
        "year": "2015",
        "info": "Volume 28, 2015",
        "count": 28,
        "papers": [
            "Special issue with selected papers from PODC 2012.",
            "Wait-freedom with advice.",
            "Faster randomized consensus with an oblivious adversary.",
            "Weak models of distributed computing, with connections to modal logic.",
            "Information spreading in dynamic graphs.",
            "Soft-error mitigation by means of decoupled transactional memory threads.",
            "Adversarial topology discovery in network virtualization environments: a threat for ISPs?",
            "Deterministic polynomial approach in the plane.",
            "Forming sequences of geometric patterns with oblivious mobile robots.",
            "Fence patrolling by mobile agents with distinct speeds.",
            "Distributed graph searching with a sense of direction.",
            "Scalable mechanisms for rational secret sharing.",
            "Allowing each node to communicate only once in a distributed system: shared whiteboard models.",
            "The complexity of automated addition of fault-tolerance without explicit legitimate states.",
            "Knowledge, level of symmetry, and time of leader election.",
            "A nearly optimal upper bound for the self-stabilization time in Herman's algorithm.",
            "Localization for a system of colliding robots.",
            "Fast and compact self-stabilizing verification, computation, and fault detection of an MST.",
            "Bounded-Contention Coding for the additive network model.",
            "Efficient distributed computation of distance sketches in networks.",
            "A local approximation algorithm for minimum dominating set problem in anonymous planar networks.",
            "Getting close without touching: near-gathering for autonomous mobile robots.",
            "Sub-logarithmic distributed algorithms for metric facility location.",
            "Special issue on PODC 2013.",
            "On the complexity of asynchronous agreement against powerful adversaries.",
            "Stable and scalable universal swarms.",
            "Randomized broadcast in radio networks with collision detection.",
            "Multidimensional agreement in Byzantine systems."
        ]
    },
    {
        "name": "DC",
        "year": "2014",
        "info": "Volume 27, 2014",
        "count": 21,
        "papers": [
            "Structuring unreliable radio networks.",
            "Leader election for anonymous asynchronous agents in arbitrary networks.",
            "Xheal: a localized self-healing algorithm using expanders.",
            "Tolerating permanent and transient value faults.",
            "Combinatorial algorithms for distributed graph coloring.",
            "Time versus space trade-offs for rendezvous in trees.",
            "Asynchronous Byzantine Agreement with optimal resilience.",
            "Leakage-resilient coin tossing.",
            "Tight space bounds for #8467;-exclusion.",
            "Timed implementation relations for the distributed test architecture.",
            "Reconciling fault-tolerant distributed algorithms and real-time computing.",
            "Greedy routing in small-world networks with power-law degrees.",
            "Gathering on rings under the Look-Compute-Move model.",
            "Fault tolerance in distributed systems using fused state machines.",
            "LiMoSense: live monitoring in dynamic sensor networks.",
            "Distributed transactional memory for general networks.",
            "Partition consistency - A case study in modeling systems with weak memory consistency and proving correctness of their implementations.",
            "Special issue with selected papers from DISC 2012.",
            "The CB tree: a practical concurrent self-adjusting search tree.",
            "Randomized distributed decision.",
            "No sublogarithmic-time approximation scheme for bipartite vertex cover."
        ]
    },
    {
        "name": "DC",
        "year": "2013",
        "info": "Volume 26, 2013",
        "count": 21,
        "papers": [
            "Fast message dissemination in random geometric networks.",
            "Fast flooding over Manhattan.",
            "Bounding the locality of distributed routing algorithms.",
            "Efficient broadcasting in radio networks with long-range interference.",
            "A leader election algorithm for dynamic networks with causal clocks.",
            "Order optimal information spreading using algebraic gossip.",
            "Distributed minimum dominating set approximations in restricted families of graphs.",
            "Special issue on DISC 2010.",
            "Anonymous asynchronous systems: the case of failure detectors.",
            "Competitive throughput in multi-hop wireless networks despite adaptive jamming.",
            "The topology of distributed adversaries.",
            "Special issue on DISC 2011.",
            "Beeping a maximal independent set.",
            "Misleading stars: what cannot be measured in the internet?",
            "Locality and checkability in wait-free computing.",
            "Fast and scalable rendezvousing.",
            "Special issue with selected papers from PODC 2011.",
            "Distributed deterministic edge coloring using bounded neighborhood independence.",
            "Toward more localized local algorithms: removing assumptions concerning global knowledge.",
            "Compact policy routing.",
            "Byzantine agreement with homonyms."
        ]
    },
    {
        "name": "DC",
        "year": "2012",
        "info": "Volume 25, 2012",
        "count": 26,
        "papers": [
            "Announcement: best reviewer award 2011.",
            "Concurrency theory: timed automata, testing, program synthesis.",
            "A study on shuffle, stopwatches and independently evolving clocks.",
            "Implementation relations and test generation for systems with distributed interfaces.",
            "Overcoming controllability problems in distributed testing from an input output transition system.",
            "Symbolic synthesis of masking fault-tolerant distributed programs.",
            "RMR-efficient implementations of comparison primitives using read and write operations.",
            "Special section with selected papers from PODC 2010.",
            "How to meet when you forget: log-space rendezvous in arbitrary graphs.",
            "A modular approach to shared-memory consensus, with applications to the probabilistic-write model.",
            "Efficient distributed approximation algorithms via probabilistic tree embeddings.",
            "Fault-containing self-stabilization in asynchronous systems with constant fault-gap.",
            "Window-based greedy contention management for transactional memory: theory and practice.",
            "Partial synchrony based on set timeliness.",
            "The Forgiving Graph: a distributed data structure for low stretch under adversarial attack.",
            "Opportunistic information dissemination in mobile ad-hoc networks: the profit of global synchrony.",
            "Election in partially anonymous networks with arbitrary knowledge in message passing systems.",
            "Failure detectors encapsulate fairness.",
            "Optimizing scrip systems: crashes, altruists, hoarders, sybils and collusion.",
            "Dynamics in network interaction games.",
            "The correctness proof of Ben-Or's randomized consensus algorithm.",
            "A framework for automated distributed implementation of component-based models.",
            "Renaming and the weakest family of failure detectors.",
            "Leader election using loneliness detection.",
            "On space complexity of self-stabilizing leader election in mediated population protocol.",
            "Gathering identical autonomous systems on a circle using stigmergy."
        ]
    },
    {
        "name": "DC",
        "year": "2011",
        "info": "Volume 24, 2011/2012",
        "count": 23,
        "papers": [
            "Special issue on PODC 2009.",
            "Randomized mutual exclusion with sub-logarithmic RMR-complexity.",
            "Load balancing without regret in the bulletin board model.",
            "Parsimonious flooding in dynamic graphs.",
            "Distributed algorithms for covering, packing and maximum weighted matching.",
            "How much memory is needed for leader election.",
            "Distributed discovery of large near-cliques.",
            "Derandomizing random walks in undirected graphs using locally fair exploration strategies.",
            "Modeling radio networks.",
            "Fully-adaptive algorithms for long-lived renaming.",
            "Special issue with selected papers from DISC 2009.",
            "The disagreement power of an adversary.",
            "On set consensus numbers.",
            "Randomization can be a healer: consensus with dynamic omission failures.",
            "New bounds for the controller problem.",
            "The abstract MAC layer.",
            "Distributed data clustering in sensor networks.",
            "Meeting the deadline: on the complexity of fault-tolerant continuous gossip.",
            "On best response dynamics in weighted congestion games with polynomial delays.",
            "The minimum information about failures for solving non-local tasks in message-passing systems.",
            "A time complexity lower bound for adaptive mutual exclusion.",
            "Consensus in the presence of mortal Byzantine faulty processes.",
            "Reconciling fault-tolerant distributed computing and systems-on-chip."
        ]
    },
    {
        "name": "DC",
        "year": "2010",
        "info": "Volume 23, 2010/2011",
        "count": 19,
        "papers": [
            "Refined quorum systems.",
            "On the performance of Dijkstra's third self-stabilizing algorithm for mutual exclusion and related algorithms.",
            "A spatial equational logic for the applied pi-calculus.",
            "Special issue on DISC 2008.",
            "Closing the complexity gap between FCFS mutual exclusion and mutual exclusion.",
            "The mailbox problem.",
            "Threshold protocols in survivor set systems.",
            "On the complexity of distributed stable matching with small messages.",
            "Packet mode and QoS algorithms for buffered crossbar switches with FIFO queuing.",
            "On the power of synchronization between two adjacent processes.",
            "A knowledge-based analysis of global function computation.",
            "Rambo: a robust, reconfigurable atomic memory service for dynamic networks.",
            "A taxonomy of process calculi for distribution and mobility.",
            "Incentive-compatible interdomain routing.",
            "Distributed algorithms for QoS load balancing.",
            "An optimal bit complexity randomized distributed MIS algorithm.",
            "Verification of consensus algorithms using satisfiability solving.",
            "Efficient online algorithm for identifying useless states in distributed systems.",
            "Secure and highly-available aggregation queries in large-scale sensor networks via set sampling."
        ]
    },
    {
        "name": "DC",
        "year": "2009",
        "info": "Volume 22, 2009/2010",
        "count": 24,
        "papers": [
            "Editorial: It's all about change.",
            "Distributed edge coloration for bipartite networks.",
            "Distributed construction of low-interference spanners.",
            "The Theta-Model: achieving synchrony without clocks.",
            "The Heard-Of model: computing in distributed systems with benign faults.",
            "Causing communication closure: safe program composition with reliable non-FIFO channels.",
            "Maximum throughput of multiple access channels in adversarial environments.",
            "The cost of monotonicity in distributed graph searching.",
            "Model checking transactional memories.",
            "Distributed algorithms for ultrasparse spanners and linear size skeletons.",
            "Broadcasting in UDG radio networks with missing and inaccurate information.",
            "The k-simultaneous consensus problem.",
            "On quorum systems for group resources allocation.",
            "Proof labeling schemes.",
            "On spectrum sharing games.",
            "Towards worst-case churn resistant peer-to-peer systems.",
            "Fast primal-dual distributed algorithms for scheduling and matching problems.",
            "Special issue on PODC 2008.",
            "New combinatorial topology bounds for renaming: the lower bound.",
            "Adaptive progress: a gracefully-degrading liveness property.",
            "Anti-Omega: the weakest failure detector for set agreement.",
            "An optimal maximal independent set algorithm for bounded-independence graphs.",
            "Sublogarithmic distributed MIS algorithm for sparse graphs using Nash-Williams decomposition.",
            "The impact of randomization in smoothing networks."
        ]
    },
    {
        "name": "DC",
        "year": "2008",
        "info": "Volume 21, 2008/2009",
        "count": 27,
        "papers": [
            "Approximate distributed top- k queries.",
            "Contention-free MAC protocols for asynchronous wireless sensor networks.",
            "Solo-valency and the cost of coordination.",
            "Consensus and collision detectors in radio networks.",
            "Special issue on DISC 07.",
            "A simple population protocol for fast robust approximate majority.",
            "The space complexity of unbounded timestamps.",
            "Time efficient k-shot broadcasting in known topology radio networks.",
            "Approximating Wardrop equilibria with finitely many agents.",
            "Compact separator decompositions in dynamic trees and applications to labeling schemes.",
            "Implementing dataflow with threads.",
            "Fast computation by population protocols with a leader.",
            "On the computability power and the robustness of set agreement-oriented failure detector classes.",
            "Checking sequences for distributed test architectures.",
            "Lower bound for scalable Byzantine Agreement.",
            "Sequentially consistent versus linearizable counting networks.",
            "Coloring unstructured radio networks.",
            "On implementing omega in systems with weak reliability and synchrony assumptions.",
            "Special issue on PODC 2007.",
            "Greedy distributed optimization of multi-commodity flows.",
            "Broadcasting in UDG radio networks with unknown topology.",
            "On the weakest failure detector ever.",
            "Optimal inter-object correlation when replicating for availability.",
            "The expansion and mixing time of skip graphs with applications.",
            "Distributed computing with advice: information sensitivity of graph coloring.",
            "Bounded-wait combining: constructing robust and high-throughput shared objects.",
            "Distributed speculative execution for reliability and fault tolerance: an operational semantics."
        ]
    },
    {
        "name": "DC",
        "year": "2007",
        "info": "Volume 20, 2007/2008",
        "count": 30,
        "papers": [
            "Introduction.",
            "Snap-stabilization and PIF in tree networks.",
            "The alternator.",
            "Parallel composition for time-to-fault adaptive stabilization.",
            "Transient fault detectors.",
            "Fault-containing self-stabilizing distributed protocols.",
            "Randomized self-stabilizing and space optimal leader election under arbitrary scheduler on rings.",
            "The design of novel distributed protocols from differential equations.",
            "Booting clock synchronization in partially synchronous systems with hybrid process and link failures.",
            "A family of optimal termination detection algorithms.",
            "Special Issue DISC 2005.",
            "Anonymous and fault-tolerant shared-memory computing.",
            "General compact labeling schemes for dynamic trees.",
            "Distributed transactional memory for metric-space networks.",
            "Concise version vectors in WinFS.",
            "Efficient adaptive collect algorithms.",
            "Common2 extended to stacks and unbounded concurrency.",
            "Distributed verification of minimum spanning trees.",
            "Peer counting and sampling in overlay networks based on random walks.",
            "The computational power of population protocols.",
            "Continuous consensus via common knowledge.",
            "An optimistic approach to lock-free FIFO queues.",
            "Failure detectors as type boosters.",
            "Sketching asynchronous data streams over sliding windows.",
            "HyperTree for self-stabilizing peer-to-peer systems.",
            "Introduction to special issue dedicated to the DISC 20th anniversary.",
            "A fast distributed approximation algorithm for minimum spanning trees.",
            "Renaming in synchronous message passing systems with Byzantine failures.",
            "The weakest failure detectors to boost obstruction-freedom.",
            "Low-latency atomic broadcast in the presence of contention."
        ]
    },
    {
        "name": "DC",
        "year": "2006",
        "info": "Volume 19, 2006/2007",
        "count": 23,
        "papers": [
            "Searching for a black hole in arbitrary networks: optimal mobile agents protocols.",
            "Nonatomic mutual exclusion with local spinning.",
            "Optimizing content-based routers: posets and forests.",
            "Fast Paxos.",
            "Lower bounds for asynchronous consensus.",
            "Concurrent Maintenance of Rings.",
            "An efficient fault-containing self-stabilizing algorithm for the shortest path problem.",
            "Efficient dependency tracking for relevant events in concurrent systems.",
            "Optimal Deterministic Broadcasting in Known Topology Radio Networks.",
            "Adaptive mutual exclusion with local spinning.",
            "On private computation in incomplete networks.",
            "Editorial.",
            "A network pricing game for selfish traffic.",
            "On the establishment of distinct identities in overlay networks.",
            "Faster communication in known topology radio networks.",
            "Building scalable and robust peer-to-peer overlay networks for broadcasting using network coding.",
            "Distance estimation and object location via rings of neighbors.",
            "The weakest failure detector to solve nonuniform consensus.",
            "Activating anonymous ad hoc radio networks.",
            "The overhead of consensus failure recovery.",
            "Timestamping messages and events in a distributed system using synchronous communication.",
            "Randomized leader election.",
            "The Doomsday distributed termination detection protocol."
        ]
    },
    {
        "name": "DC",
        "year": "2005",
        "info": "Volume 18, 2005/2006",
        "count": 35,
        "papers": [
            "Efficient reliable communication over partially authenticated networks.",
            "Lock-free dynamic hash tables with open addressing.",
            "Broadcasting in undirected ad hoc radio networks.",
            "Introduction.",
            "A BGP-based mechanism for lowest-cost routing.",
            "Active Disk Paxos with infinitely many processes.",
            "The inherent price of indulgence.",
            "Tight bounds for shared memory systems accessed by Byzantine processes.",
            "Introduction to the special issue DISC 2003.",
            "Probabilistic quorums for dynamic systems.",
            "GeoQuorums: implementing atomic memory in mobile ad hoc networks.",
            "Tight bounds for k-set agreement with limited-scope failure detectors.",
            "On the importance of having an identity or, is consensus really universal?.",
            "Editorial: Introduction.",
            "Efficient adaptive collect using randomization.",
            "A dynamic-sized nonblocking work stealing deque.",
            "Relationships between broadcast and shared memory in reliable anonymous distributed systems.",
            "Coupling and self-stabilization.",
            "Introduction to the special issue PODC'2004.",
            "Computation in networks of passively mobile finite-state sensors.",
            "Gradient clock synchronization.",
            "On the inherent weakness of conditional primitives.",
            "Eclecticism shrinks even small worlds.",
            "Mechanism design for policy routing.",
            "Signed quorum systems.",
            "Synchronous condition-based consensus.",
            "Self-stabilizing smoothing and balancing networks.",
            "Dynamic group communication.",
            "Efficient algorithms for constructing (1+epsilon, beta)-spanners in the distributed and streaming models.",
            "Byzantine disk paxos: optimal resilience with byzantine shared memory.",
            "Distributed scheduling for disconnected cooperation.",
            "Practical load balancing for content requests in peer-to-peer networks.",
            "Performing work in broadcast networks.",
            "Distributed MST for constant diameter graphs.",
            "Optimal propagation-based protocols implementing causal memories."
        ]
    },
    {
        "name": "DC",
        "year": "2004",
        "info": "Volume 17, 2004/2005",
        "count": 22,
        "papers": [
            "Condition-based consensus solvability: a hierarchy of conditions and efficient protocols.",
            "The wake up and report problem is time-equivalent to the firing squad synchronization problem.",
            "Read-modify-write networks.",
            "The complexity of synchronous iterative Do-All with crashes.",
            "Randomized dining philosophers without fairness assumption.",
            "Optimal smoothing schedules for real-time streams.",
            "Using counterfactuals in knowledge-based programming.",
            "Finding missing synchronization in a distributed computation using controlled re-execution.",
            "The power of logical clock abstractions.",
            "A linear-time optimal-message distributed algorithm for minimum spanning trees.",
            "Distributed reconfiguration of metamorphic robot chains.",
            "Efficient low-contention asynchronous consensus with the value-oblivious adversary scheduler.",
            "Randomized registers and iterative algorithms.",
            "A knowledge-theoretic analysis of uniform distributed coordination and failure detectors.",
            "Low complexity Byzantine-resilient consensus.",
            "Techniques and applications of computation slicing.",
            "Unifying stabilization and termination in message-passing systems.",
            "Introduction.",
            "Oblivious signature-based envelope.",
            "Constant-time distributed dominating set approximation.",
            "Scalable and dynamic quorum systems.",
            "Scalable public-key tracing and revoking."
        ]
    },
    {
        "name": "DC",
        "year": "2003",
        "info": "Volume 16, 2003",
        "count": 20,
        "papers": [
            "Disk Paxos.",
            "Protocol synthesis and re-synthesis with optimal allocation of resources based on extended Petri nets.",
            "Objects shared by Byzantine processes.",
            "Tolerating malicious gossip.",
            "Introduction.",
            "Some perspectives on PODC.",
            "Shared-memory mutual exclusion: major research trends since 1986.",
            "Compact and localized distributed data structures.",
            "Hundreds of impossibility results for distributed computing.",
            "Randomized protocols for asynchronous consensus.",
            "Cryptography and cryptographic protocols.",
            "Action systems in incremental and aspect-oriented modeling.",
            "Arbitration-free synchronization.",
            "Appraising two decades of distributed computing theory research.",
            "Resilient-optimal interactive consistency in constant time.",
            "Alternators on uniform rings of odd size.",
            "Safety assurance via on-line monitoring.",
            "Lower bounds for sense of direction in regular graphs.",
            "Remote method invocation as a first-class citizen.",
            "Delegation of cryptographic servers for capture-resilient devices."
        ]
    },
    {
        "name": "DC",
        "year": "2002",
        "info": "Volume 15, 2002",
        "count": 20,
        "papers": [
            "Causality tracking in causal message-logging protocols.",
            "Non-blocking atomic commit in asynchronous distributed systems with failure detectors.",
            "Deterministic broadcasting in ad hoc radio networks.",
            "Torus orientation.",
            "A self-stabilizing quorum-based protocol for maxima computing.",
            "The optimal location of replicas in a network using a READ-ONE-WRITE-ALL policy.",
            "Long lived adaptive splitter and applications.",
            "An adaptive collect algorithm with applications.",
            "Handling message semantics with Generic Broadcast protocols.",
            "The design of a configurable and reconfigurable middleware platform.",
            "Randomized two-process wait-free test-and-set.",
            "Universal dynamic synchronous self-stabilization.",
            "The congenial talking philosophers problem in computer networks.",
            "Adaptive and efficient mutual exclusion.",
            "Introduction.",
            "An efficient distributed algorithm for constructing small dominating sets.",
            "Nearly optimal perfectly periodic schedules.",
            "An improved lower bound for the time complexity of mutual exclusion.",
            "Lock-free reference counting.",
            "Restoration by path concatenation: fast recovery of MPLS paths."
        ]
    },
    {
        "name": "DC",
        "year": "2001",
        "info": "Volume 14, 2001",
        "count": 20,
        "papers": [
            "A decision-theoretic approach to reliable message delivery.",
            "A new fast-path mechanism for mutual exclusion.",
            "Wait-free concurrent memory management by Create and Read until Deletion (CaRuD).",
            "Access cost for asynchronous Byzantine quorum systems.",
            "Performing tasks on synchronous restartable message-passing processors.",
            "ATM layouts with bounded hop count and congestion.",
            "An algorithm for the asynchronous Write-All problem based on process collision.",
            "Proving convergence of self-stabilizing systems using first-order rewriting and regular languages.",
            "Some simple distributed algorithms for sparse networks.",
            "How to reconcile fault-tolerant interval intersection with the Lipschitz condition.",
            "Implementing the CORBA GIOP in a high-performance object request broker environment.",
            "The BG distributed simulation algorithm.",
            "Self-stabilization with r-operators.",
            "Assigning labels in an unknown anonymous network with a leader.",
            "Distributed computing on oriented anonymous hypercubes with faulty components.",
            "Introduction.",
            "Laziness pays! Using lazy synchronization mechanisms to improve non-blocking constructions.",
            "Sparse communication networks and efficient routing in the plane.",
            "Interval routing schemes allow broadcasting with linear message-complexity.",
            "X-Ability: a theory of replication."
        ]
    },
    {
        "name": "DC",
        "year": "2000",
        "info": "Volume 13, 2000",
        "count": 16,
        "papers": [
            "Superstabilizing Mutual Exclusion.",
            "Secure Reliable Multicast Protocols in a WAN.",
            "Communication-Based Prevention of Useless Checkpoints in Fistributed Computations.",
            "Synchronous Byzantine Quorum Systems.",
            "Networks on Which Hot-Potato Routing Does Not Livelock.",
            "Computable Obstructions to Wait-Free Computability.",
            "Detecting Global Predicates in Distributed Systems with Clocks.",
            "Failure Detection and Consensus in the Crash-Recovery Model.",
            "Automatic verification for a class of distributed systems.",
            "A note on knowledge-based programs and specifications.",
            "Verification of the randomized consensus algorithm of Aspnes and Herlihy: a case study.",
            "Editorial: Time for Change.",
            "Asynchronous group mutual exclusion.",
            "Self-stabilizing depth-first token circulation in arbitrary rooted networks.",
            "On the power of shared object types to implement one-resilient Consensus.",
            "Fairness and hyperfairness."
        ]
    },
    {
        "name": "DC",
        "year": "1999",
        "info": "Volume 12, 1999",
        "count": 17,
        "papers": [
            "Constraint-based Structuring of Network Protocols.",
            "A Sound and Complete Algorithm for Distributed Commerce Transactions.",
            "Generating FSMs from Interworkings.",
            "Self-stabilizing 2m-Clock for Unidirectional Rings of Odd Size.",
            "A Self-Stabilizing Algorithm for Bridge Finding.",
            "Introduction.",
            "Sequential Consistency and the Lazy Caching Algorithm.",
            "Cache Consistency by Design.",
            "Characterization of a Sequentially Consistent Memory and Verification of a Cache Memory by Abstraction.",
            "Using CSP to Verify Sequential Consistency.",
            "The Compositional Approach to Sequential Consistency and Lazy Caching.",
            "Proving Refinement Using Transduction.",
            "Lazy Caching in TLA.",
            "Comments on Deriving Protocol Specifications from Service Specifications Written in LOTOS.",
            "Plausible Clocks: Constant Size Logical Clocks for Distributed Systems.",
            "Progress Under Bounded Fairness.",
            "A Simple and Fast Asynchronous Consensus Protocol Based on a Weak Failure Detector."
        ]
    },
    {
        "name": "DC",
        "year": "1997",
        "info": "Volume 11, 1997/1998",
        "count": 12,
        "papers": [
            "Using Local-Spin k-Exclusion Algorithms to Improve Wait-Free Object Implementations.",
            "Vector Time and Causality Among Abstract Events in Distributed Computations.",
            "The Level of Handshake Required for Managing a Connection.",
            "Efficient Detection of Discrepancies in Multiple File Copies.",
            "A Logical Approach to Multilevel Security of Probabilistic Systems.",
            "Necessary and Sufficient Conditions on Information for Causal Message Ordering and Their Optimal Implementation.",
            "Randomized Naming Using Wait-Free Shared Variables.",
            "Model Checking for a Probabilistic Branching Time Logic with Fairness.",
            "A Modular Algorithm for Resource Allocation.",
            "Causality and Atomicity in Distributed Computations.",
            "Detection of Global Predicates: Techniques and Their Limitations.",
            "Byzantine Quorum Systems."
        ]
    },
    {
        "name": "DC",
        "year": "1996",
        "info": "Volume 10, 1996/1997",
        "count": 17,
        "papers": [
            "Fast Timing-Based Algorithms.",
            "The Inhibition Spectrum and the Achievement of Causal Consistency.",
            "Deriving Protocol Specifications from Service Specifications Written in LOTOS.",
            "Distributed Shortest-Path Protocols for Time-Dependent Networks.",
            "Universal Routing Schemes.",
            "Collecting Cyclic Distributed Garbage by Controlled Migration.",
            "Crumbling Walls: A Class of Practical and Efficient Quorum Systems.",
            "Software Transactional Memory.",
            "On the Use of Registers in Achieving Wait-Free Consensus.",
            "Lower Bounds for the Broadcast Problem in Mobile Radio Networks.",
            "Keeping Track of the Latest Gossip in a Distributed System.",
            "Early Consensus in an Asynchronous System with a Weak Failure Detector.",
            "Efficient Leader Election Using Sense of Direction.",
            "A Self-Stabilizing Algorithm for the Maximum Flow Problem.",
            "Self-Stabilizing Token Circulation in Uniform Networks.",
            "Constant Time per Edge is Optimal on Rooted Tree Networks.",
            "Knowledge-Based Programs."
        ]
    },
    {
        "name": "DC",
        "year": "1995",
        "info": "Volume 9, 1995/1996",
        "count": 14,
        "papers": [
            "Greedy Hot-Potato Routing on the Two-Dimensional Mesh.",
            "Wait-Free Linearization with a Mechanical Proof.",
            "Causal Memory: Definitions, Implementation, and Programming.",
            "A Fast, Scalable Mutual Exclusion Algorithm.",
            "Generating Diagnostic Information for Behavioral Preorders.",
            "On Deadlocks of Exclusive AND-Requests for Resources.",
            "Optimal Time Byzantine Agreement for t<n/8 With Linear-Messages.",
            "Using Adaptive Timeouts to Achieve At-Most-Once Message Delivery.",
            "Implementing Hybrid Consistency with High-Level Synchronization Operations.",
            "Efficient Network Authentication Protocols: Lower Bounds and Optimal Implementations.",
            "Optimal Asynchronous Agreement and Leader Election Algorithm for Complete Networks with Byzantine Faulty Links.",
            "Design and Analysis of Dynamic Leader Election Protocols in Broadcast Networks.",
            "Synchronous, Asynchronous, and Causally Ordered Communication.",
            "Linearizable Counting Networks."
        ]
    },
    {
        "name": "DC",
        "year": "1994",
        "info": "Volume 8, 1994/1995",
        "count": 19,
        "papers": [
            "Adaptive Solutions to the Mutual Exclusion Problem.",
            "Naming Symmetric Processes Using Shared Variables.",
            "On Multilevel Voting.",
            "Fast and Simple Distributed Consensus.",
            "Wait-Free Linearization with an Assertional Proof.",
            "Efficient Detection of a Class of Stable Properties.",
            "Strong Stable Properties in Distributed Systems.",
            "Efficient Algorithms for Optimistic Crash Recovery.",
            "On the Comnplexity of Global Computation in the Presence of Link Failures: The General Case.",
            "Atomic Snapshots Using Lattice Agreement.",
            "Self-Stabilizing Multi-Token Rings.",
            "Calculational Derivation of aCounter with Bounded Response Time and Bounded Power Dissipation.",
            "A Highly Asynchronous Minimum Spanning Tree Protocol.",
            "Counting Networks with Arbitrary Fan-Out.",
            "A Class of High Performance Maekawa-Type Algorithms for Distributed Systems Under Heavy Demand.",
            "Parallel Simulation on the Hypercube Multiprocessor.",
            "Optimal Coteries for Rings and Related Networks.",
            "Closed Schedulers: A Novel Technique for Analyzing Asynchronous Protocols.",
            "Implementation of Hierarchical F-Channels for High-Performance Distributed Computing."
        ]
    },
    {
        "name": "DC",
        "year": "1993",
        "info": "Volume 7, 1993/1994",
        "count": 19,
        "papers": [
            "Self-Stabilization of Dynamic Systems Assuming Only Read/Write Atomicity.",
            "Self-Stabilizing Extensions for Message-Passing Systems.",
            "Self-Stabilization Over Unreliable Communication Media.",
            "Stabilization and Pseudo-Stabilization.",
            "Convergence of Iteration Systems.",
            "A Self-Stabilizing Algorithm for Coloring Planar Graphs.",
            "Self-Stabilizing Depth-First Token Circulation on Networks.",
            "Fast Consensus in Networks of Bounded Degree.",
            "Necessary and Sufficient Conditions for Broadcast Consensus Protocols.",
            "Efficient Agreement Using Fault Diagnosis.",
            "Knowledge in Shared Memory Systems.",
            "A Note on Consistency in Asynchronous Multicaches.",
            "Reliability Versus Cost: Design of a Probabilistic Broadcast Algorithm.",
            "Decidability of the Termination Problem for Completely Specified Protocols.",
            "Towards the Construction of Distributed Detection Programs, with an Application to Distributed Termination.",
            "Detecting Causal Relationships in Distributed Computations: In Search of the Holy Grail.",
            "Multi-Writer Composite Registers.",
            "A Fully Abstract Trace Model for Dataflow and Asynchronous Networks.",
            "Atomic m-Register Operations."
        ]
    },
    {
        "name": "DC",
        "year": "1992",
        "info": "Volume 6, 1992/1993",
        "count": 20,
        "papers": [
            "Introduction.",
            "Algebraic and Functional Specification of an Interactive Serializable Database Interface.",
            "Operational Specification with Joint Actions: Serializable Databases.",
            "Specifying Modules to Satisfy Interfaces: A State Transition System Approach.",
            "Critique of the Lake Arrowhead Three.",
            "Concurrent Common Knowledge: Defining Agreement for Asynchronous Systems.",
            "Self-Stabilization: Randomness to Reduce Space.",
            "Rank Order Filters and Priority Queues.",
            "Verification of Distributed Programs Using Representative Interleaving Sequences.",
            "Using Mappings to Prove Timing Properties.",
            "Composite Registers.",
            "Generating BDDs for Symbolic Model Checking in CCS.",
            "Mapping Dynamic Programming Onto Modular Linear Systolic Arrays.",
            "Common Knowledge and Consistent Simultaneous Coordination.",
            "Low-Cost Clock Synchronization.",
            "Bonded Time-Stamps.",
            "Practical Uses of Synchronized Clocks in Distributed Systems.",
            "Some Impossibility Results in Interprocess Synchronization.",
            "A Modular Drinking Philosophers Algorithm.",
            "Fairness and Hyperfairness in Multi-Party Interactions."
        ]
    },
    {
        "name": "DC",
        "year": "1991",
        "info": "Volume 5, 1991/1992",
        "count": 18,
        "papers": [
            "Bounds on Evacuation Time for Deflection Routing.",
            "Towards Systolizing Compilation.",
            "Analysis of Toggle Protocols.",
            "P - A Logic - A Compositional Proof System for Distributed Programs.",
            "Optimal Geometric Algorithms for Digitized Images on Fixed-Size Linear Arrays and Scan-Line Arrays.",
            "Efficient Emulation of Single-Hop Radio Network with Collision Detection on Multi-Hop Radio Network with no Collision Detection.",
            "Clock Synchronization and the Power of Broadcasting.",
            "An Incremental Specification of the Sliding-Window Protocol.",
            "Design and Verification of Fault Tolerant Systems with CSP.",
            "A Formal Approach to Designing Delay-Insensitive Circuits.",
            "On the Complexity of Computation in the Presence of Link Failures: The Case of a Ring.",
            "Computing Transitive Closure on Systolic Arrays of Fixed Size.",
            "Specification and Analysis of a Data Transfer Protocol Using Systems of Communicating Machines.",
            "A Complete Axiomatic Semantics of Spawning.",
            "On the Message Complexity of Binary Byzantine Agreement under Crash Failures.",
            "On-The-Fly Garbage Collection for Several Mutators.",
            "Efficient Parallel Algorithms can be Made Robust.",
            "A Self-Adjusting Algorithm for Byzantine Agreement."
        ]
    },
    {
        "name": "DC",
        "year": "1990",
        "info": "Volume 4, 1990/1991",
        "count": 18,
        "papers": [
            "One-Bit Algorithms.",
            "Asymptotically Optimal Algorithms for Approximate Agreement.",
            "Asynchronous Multicaches.",
            "Designing Systolic, Distributed Buffers with Bounded Response Time.",
            "Behavioural Notions for Elementary Net Systems.",
            "A Theorem on Atomicity in Distributed Algorithms.",
            "Fault-Tolerant Atomic Computations in an Object-Based Distributed System.",
            "Concurrent Reading While Writing Revisited.",
            "Transaction Commit in a Realistic Timing Model.",
            "Consensus Algorithms with One-Bit Messages.",
            "The Distributed Simulation of Clustered Processes.",
            "Hierarchical Deadlock Detection for Nested Transactions.",
            "A Class of Deadlock-Free Meakawa-Type Algorithms for Mutual Exclusion in Distributed Systems.",
            "Failures Semantics Based on Interval Semiwords is a Congruence for Refinement.",
            "Achieving Graceful Performance in Distributed Error-Prone Databases.",
            "Reaching Agreement on Processor-Group Memebership in Synchronous Distributed Systems.",
            "Highly Concurrent Logically Synchronous Multicast.",
            "Deadlock Analysis in Networks of Communicating Processes."
        ]
    },
    {
        "name": "DC",
        "year": "1988",
        "info": "Volume 3, 1988/1989",
        "count": 17,
        "papers": [
            "Delay-Insensitive Codes - an Overview.",
            "A State-Based Approach to Communicating Processes.",
            "Distributed Election in Complete Networks.",
            "A Methodology for Constructing Communication Protocols with Multiple Concurrent Functions.",
            "An Incremental Garbage Collection Algorithm for Multi-Mutator Systems.",
            "Understanding Naming in Distributed Systems.",
            "Choice Coordination with Limited Failure.",
            "Decentralization of Process Nets with Centralized Control.",
            "Synthesizing Systolic Arrays with Control Signals from Recurrence Equations.",
            "Randomized Function Evaluation on a Ring.",
            "Probabilistic Verification of Communication Protocols.",
            "Step Semantics for \"True\" Concurrency with Recursion.",
            "Probabilistic Clock Synchronization.",
            "Modelling Knowledge and Action in Distributed Systems.",
            "Deadlock-Free Message Routing in Multicomputer Networks.",
            "Fault Tolerant Processes.",
            "An Operator Net Model for Distributed Systems."
        ]
    },
    {
        "name": "DC",
        "year": "1987",
        "info": "Volume 2, 1987/1988",
        "count": 19,
        "papers": [
            "Algebraic Specification and Proof of a Distributed Recovery Algorithm.",
            "Semantics of Finite and Infinite Networks of Concurrent Communicating Agents.",
            "A Proof Technique for Concurrency Control and Recovery Algorithms for Replicated Databases.",
            "Distributed Optimistic Concurrency Control with Reduced Rollback.",
            "Time-Dependent Distributed Systems: Proving Safety, Liveness and Real-Time Properties.",
            "Simulating Authenticated Broadcasts to Derive Simple Fault-Tolerant Algorithms.",
            "Connectivity Requirements for Byzantine Agreement under Restricted Types of Failures.",
            "The Construction of Self-Synchronizing Finite State Protocols.",
            "Fair Mutual Exclusion on a Graph of Processes.",
            "Recognizing Safety and Liveness.",
            "Distributed Deadlock Detection.",
            "Distributed Algorithms for Constructing a Minimum-Weight Spaning Tree in a Broadcast Network.",
            "An Improved Upperbound for Distributed Election in Bidirectional Rings of Processors.",
            "Algorithms for Distributed Termination Detection.",
            "Reliable Broadcasts and Communication Models: Tradeoffs and Lower Bounds.",
            "Semantics and Verification of Monitors and Systems of Monitors and Processes.",
            "An Approach to Efficient Distributed Transactions.",
            "Exhaustive Analysis and Simulation for Distributed Systems, both Sides of the Same Coin.",
            "Appraising Fairness in Languages for Distributed Programming."
        ]
    },
    {
        "name": "DC",
        "year": "1986",
        "info": "Volume 1, 1986",
        "count": 20,
        "papers": [
            "A Belated Proof of Self-Stabilization.",
            "A Model and Temporal Proof System for Networks of Processes.",
            "Easy Impossibility Proofs for Distributed Consensus Problems.",
            "How Processes Learn.",
            "Verification of Multiprocess Probabilistic Protocols.",
            "On Interprocess Communication. Part I: Basic Formalism.",
            "On Interprocess Communication. Part II: Algorithms.",
            "Specifications of Distributed Programs.",
            "Mutual Exclusion in Partitioned Distributed Systems.",
            "The Evolution of the SR Language.",
            "Compiling Path Expressions Into VLSI Circuits.",
            "Cheating Husbands and other Stories: A Case Study of Knowledge, Action, and Communication.",
            "Systolic Algorithms as Programs.",
            "Distributed Computing Issues in Hardware Design.",
            "The Torus Routing Chip.",
            "A Formal Model for Defining and Classifying Delay-Insensitive Circuits and Systems.",
            "On the Existence of Delay-Insensitive Fair Arbiters: Trace Theory and its Limitations.",
            "Compiling Communicating Processes Into Delay-Insensitive VLSI Circuits.",
            "Semantics of Digital Networks Containing Indeterminate Modules.",
            "Mapping Image Processing Operations onto a Linear Systolic Machine."
        ]
    }
]