[
    {
        "year": "2021",
        "name": "26th ETS 2021",
        "info": "Bruges, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2021",
                "sub_name": "26th IEEE European Test Symposium, ETS 2021, Bruges, Belgium, May 24-28, 2021.",
                "count": 44,
                "papers": [
                    "Chill Out: Freezing Attacks on Capacitors and DC/DC Converters.",
                    "A 3DIC interconnect interface test and repair scheme based on Hybrid IEEE1838 Die Wrapper Register and BIST circuit.",
                    "A Tutorial of How to Ensure High Automotive Microcontroller Quality.",
                    "ESD-PCM: Constructing Reliable Super Dense Phase Change Memory Under Write Disturbance.",
                    "MBIST-supported Trim Adjustment to Compensate Thermal Behavior of MRAM.",
                    "BIST-Assisted Analog Fault Diagnosis.",
                    "Testing Embedded Toggle Pattern Generation Through On-Chip IR Drop Monitoring.",
                    "Online Testing of a Row-Stationary Convolution Accelerator.",
                    "A Survey and Tutorial on Security and Resilience of Quantum Computing.",
                    "Intermittent Undefined State Fault in RRAMs.",
                    "An Ordinal Optimization-Based Approach To Die Distribution Estimation For Massive Multi-site Testing Validation: A Case Study.",
                    "Unsupervised Learning in Test Generation for Digital Integrated Circuits.",
                    "Test Data-Driven Machine Learning Models for Reliable Quantum Circuit Output.",
                    "Emerging Computing Devices: Challenges and Opportunities for Test and Reliability*.",
                    "ArsoNISQ: Analyzing Quantum Algorithms on Near-Term Architectures.",
                    "System-Level Access to On-Chip Instruments.",
                    "Trustworthy computing on untrustworthy and Trojan-infected on-chip interconnects.",
                    "Analysis and mitigation of timing inaccuracies in high-frequency on-chip sinusoidal signal generators based on harmonic cancellation.",
                    "TDMS Test Scheduler: An Integrated Framework for Test Scheduling of DVFS-based SoCs with Multiple Voltage Islands.",
                    "Opacity preserving Countermeasure using Finite State Machines against Differential Scan Attacks.",
                    "Transit-Guard: An OS-based Defense Mechanism Against Transient Execution Attacks.",
                    "Hierarchical Fault Simulation of Deep Neural Networks on Multi-Core Systems.",
                    "Recent Advances in Photonic Physical Unclonable Functions.",
                    "RHAT: Efficient RowHammer-Aware Test for Modern DRAM Modules.",
                    "Exploring and Comparing IEEE P1687.1 and IEEE 1687 Modeling of Non-TAP Interfaces.",
                    "Detecting Random Read Faults to Reduce Test Escapes in FinFET SRAMs.",
                    "SafeSU: an Extended Statistics Unit for Multicore Timing Interference.",
                    "NeuroScrub: Mitigating Retention Failures Using Approximate Scrubbing in Neuromorphic Fabric Based on Resistive Memories.",
                    "Run Time Management of Faulty Data Caches.",
                    "Security, Reliability and Test Aspects of the RISC-V Ecosystem.",
                    "Arithmetic Circuit Correction by Adding Optimized Correctors Based on Groebner Basis Computation.",
                    "Automatic Inspection for Wafer Defect Pattern Recognition with Unsupervised Clustering.",
                    "Design of Fault-Tolerant and Thermally Stable XOR Gate in Quantum dot Cellular Automata.",
                    "Designing Recurrent Neural Networks for Monitoring Embedded Devices.",
                    "Applying IEEE Std 1838 to the 3DIC Design Trishul - A Case Study.",
                    "Convolutional Compaction-Based MRAM Fault Diagnosis.",
                    "GPU-based ATPG System by Scaling Memory Usage and Reducing Data Transfer.",
                    "Analyzing the Impact of Approximate Adders on the Reliability of FPGA Accelerators.",
                    "Speeding up Cell-Aware Library Characterization by Preceding Simulation with Structural Analysis.",
                    "Compact Protection Codes for protecting memory from malicious data and address manipulations.",
                    "Exploiting Active Learning for Microcontroller Performance Prediction.",
                    "Exploration of a digital-based solution for the generation of 2.4GHz OQPSK test stimuli.",
                    "Synergies Between Delay Test and Post-silicon Speed Path Validation: A Tutorial Introduction.",
                    "A Plug and Play Digital ABIST Controller for Analog Sensors in Secure Devices."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "25th ETS 2020",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2020",
                "sub_name": "IEEE European Test Symposium, ETS 2020, Tallinn, Estonia, May 25-29, 2020.",
                "count": 42,
                "papers": [
                    "Detection of Rowhammer Attacks in SoCs with FPGAs.",
                    "IEEE Std. P1687.1 for Access Control of Reconfigurable Scan Networks.",
                    "Design, Verification, Test and In-Field Implications of Approximate Computing Systems.",
                    "Device-Aware Test for Emerging Memories: Enabling Your Test Program for DPPB Level.",
                    "Hardware Trojan Attacks in Analog/Mixed-Signal ICs via the Test Access Mechanism.",
                    "G-PUF: An Intrinsic PUF Based on GPU Error Signatures.",
                    "A New Monitor Insertion Algorithm for Intermittent Fault Detection.",
                    "MBIST Support for Reliable eMRAM Sensing.",
                    "Monitoring of BTI and HCI Aging in SRAM Decoders.",
                    "Minimal Witnesses for Security Weaknesses in Reconfigurable Scan Networks.",
                    "Tightening the Mesh Size of the Cell-Aware ATPG Net for Catching All Detectable Weakest Faults.",
                    "Determined-Safe Faults Identification: A step towards ISO26262 hardware compliant designs.",
                    "Dynamic Authentication-Based Secure Access to Test Infrastructure.",
                    "Automated Graph-Based Fault Injection Into Virtual Prototypes for Robustness Evaluation.",
                    "QAMR: an Approximation-Based Fully Reliable TMR Alternative for Area Overhead Reduction.",
                    "Built-In Predictors for Dynamic Crosstalk Avoidance.",
                    "Digital Defect Based Built-in Self-Test for Low Dropout Voltage Regulators.",
                    "PUF Enrollment and Life Cycle Management: Solutions and Perspectives for the Test Community.",
                    "Accurate Measurements of Small Resistances in Vertical Interconnects with Small Aspect Ratios.",
                    "Failure and Attack Detection by Digital Sensors.",
                    "Analog Fault Simulation - a Hot Topic!",
                    "Defect Characterization and Test Generation for Spintronic-based Compute-In-Memory.",
                    "Modeling Static Noise Margin for FinFET based SRAM PUFs.",
                    "Test Sequence-Optimized BIST for Automotive Applications.",
                    "Efficient Prognostication of Pattern Count with Different Input Compression Ratios.",
                    "A Built-In Self-Test Method For MEMS Piezoresistive Sensor.",
                    "On-chip reduced-code static linearity test of Vcm-based switching SAR ADCs using an incremental analog-to-digital converter.",
                    "Design Obfuscation versus Test.",
                    "Functional-Like Transition Delay Fault Test-Pattern Generation using a Bayesian-Based Circuit Model.",
                    "Nonlinear Codes for Control Flow Checking.",
                    "Latent Defect Screening with Visually-Enhanced Dynamic Part Average Testing.",
                    "The Risk of Outsourcing: Hidden SCA Trojans in Third-Party IP-Cores Threaten Cryptographic ICs.",
                    "Linking Chip, Board, and System Test via Standards.",
                    "Anomaly Detection in Embedded Systems Using Power and Memory Side Channels.",
                    "Thermal Neutrons: a Possible Threat for Supercomputers and Safety Critical Applications.",
                    "PWS: Potential Wafermap Scratch Defect Pattern Recognition with Machine Learning Techniques.",
                    "A SIFT-based Waveform Clustering Method for aiding analog/mixed-signal IC Verification.",
                    "Variation-Aware Defect Characterization at Cell Level.",
                    "Learning-Based Cell-Aware Defect Diagnosis of Customer Returns.",
                    "Avoiding Mixed-Signal Field Returns by Outlier Detection of Hard-to-Detect Defects based on Multivariate Statistics.",
                    "LiD-CAT: A Lightweight Detector for Cache ATtacks.",
                    "Testing Scouting Logic-Based Computation-in-Memory Architectures."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th ETS 2019",
        "info": "Baden-Baden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2019",
                "sub_name": "24th IEEE European Test Symposium, ETS 2019, Baden-Baden, Germany, May 27-31, 2019.",
                "count": 41,
                "papers": [
                    "PaTran: Translation Platform for Test Pattern Program.",
                    "Test Adapted Shielding by a Multipurpose Crosstalk Avoidance Scheme.",
                    "Hybrid Architecture for Embedded Test Compression to Process Rejected Test Patterns.",
                    "On Generating Fault Diagnosis Patterns for Designs with X Sources.",
                    "LearnX: A Hybrid Deterministic-Statistical Defect Diagnosis Methodology.",
                    "Model-driven AMS Test Setup Validation Tool prepared for IEEE P1687.2.",
                    "Test Pattern Generator for Majority Voter based QCA Combinational Circuits targeting MMC Defect.",
                    "Built-in Self-Test for Inter-Layer Vias in Monolithic 3D ICs.",
                    "Non-Adaptive Pattern Reordering to Improve Scan Chain Diagnostic Resolution.",
                    "DFT Scheme for Hard-to-Detect Faults in FinFET SRAMs.",
                    "Pinhole Defect Characterization and Fault Modeling for STT-MRAM Testing.",
                    "A Dynamic Greedy Test Scheduler for Optimizing Probe Motion in In-Circuit Testers.",
                    "K3 TAM Optimization for Testing 3D-SoCs using Non-Regular Time-Division-Multiplexing.",
                    "A Functional Approach to Test and Debug of IEEE 1687 Reconfigurable Networks.",
                    "Approximate computing design exploration through data lifetime metrics.",
                    "B-open: A New Defect in Nanometer Technologies due to SADP Process.",
                    "Symbolic Circuit Analysis under an Arc Based Timing Model.",
                    "High-Level Combined Deterministic and Pseudo-exhuastive Test Generation for RISC Processors.",
                    "On the Evaluation of the PIPB Effect within SRAM-based FPGAs.",
                    "Inter-Lock: Logic Encryption for Processor Cores Beyond Module Boundaries.",
                    "A Machine Learning-based Approach to Optimize Repair and Increase Yield of Embedded Flash Memories in Automotive Systems-on-Chip.",
                    "Test Solutions for High Density 3D-IC Interconnects - Focus on SRAM-on-Logic Partitioning.",
                    "A 52 dB-SFDR 166 MHz sinusoidal signal generator for mixed-signal BIST applications in 28 nm FDSOI technology.",
                    "Digital Built-in Self-Test for Phased Locked Loops to Enable Fault Detection.",
                    "Hardware-Based Aging Mitigation Scheme for Memory Address Decoder.",
                    "Concurrent Estimation of a PLL Transfer Function by Cross-Correlation with pseudo-random Jitter.",
                    "IJTAG Compatible Timing Monitor with Robust Self-Calibration for Environmental and Aging Variation.",
                    "Power Measurement and Spectral Test of ZigBee Transmitters from 1-bit Under-sampled Acquisition.",
                    "Exploring Algebraic Interpolants for Rectification of Finite Field Arithmetic Circuits with Gröbner Bases.",
                    "Feature Engineering for Recycled FPGA Detection Based on WID Variation Modeling.",
                    "On Integrating Lightweight Encryption in Reconfigurable Scan Networks.",
                    "STAHL: A Novel Scan-Test-Aware Hardened Latch Design.",
                    "Post-Silicon Validation of IEEE 1687 Reconfigurable Scan Networks.",
                    "Machine Learning-based Prediction of Test Power.",
                    "Back-annotation of Interconnect Physical Properties for System-Level Crosstalk Modeling.",
                    "Revisiting Logic Locking for Reversible Computing.",
                    "Dependable Wireless Industrial IoT Networks: Recent Advances and Open Challenges.",
                    "Security in Autonomous Systems.",
                    "A supervised machine learning application in volume diagnosis.",
                    "Impact of Reduced Precision in the Reliability of Deep Neural Networks for Object Detection.",
                    "Alternatives to Fault Injections for Early Safety/Security Evaluations."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd ETS 2018",
        "info": "Bremen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2018",
                "sub_name": "23rd IEEE European Test Symposium, ETS 2018, Bremen, Germany, May 28 - June 1, 2018.",
                "count": 32,
                "papers": [
                    "Detection of IJTAG attacks using LDPC-based feature reduction and machine learning.",
                    "Online prevention of security violations in reconfigurable scan networks.",
                    "Locking of biochemical assays for digital microfluidic biochips.",
                    "ADC test methods using an impure stimulus: A survey.",
                    "Measuring mixed-signal test stimulus quality.",
                    "Assisted test design for non-intrusive machine learning indirect test of millimeter-wave circuits.",
                    "IEEE Std P1838's flexible parallel port and its specification with Google's protocol buffers.",
                    "A software reconfigurable assertion checking unit for run-time error detection.",
                    "Towards the formal verification of security properties of a Network-on-Chip router.",
                    "Design of fault-tolerant neuromorphic computing systems.",
                    "The impact of production defects on the soft-error tolerance of hardened latches.",
                    "Modeling and testing comparison faults of memristive ternary content addressable memories.",
                    "Sense amplifier offset characterisation and test implications for low-voltage SRAMs in 65 nm.",
                    "Design and testing methodologies for true random number generators towards industry certification.",
                    "BISTs for post-bond test and electrical analysis of high density 3D interconnect defects.",
                    "Interconnect-aware tests to complement gate-exhaustive tests.",
                    "Challenges in Cell-Aware Test.",
                    "Machine learning applications in IC testing.",
                    "Device aging: A reliability and security concern.",
                    "Model-based avionic systems testing for the airbus family.",
                    "Covering undetected transition fault sites with optimistic unspecified transition faults under multicycle tests.",
                    "Covering hard-to-detect defects by thermal quorum sensing.",
                    "ReiNN: Efficient error resilience in artificial neural networks using encoded consistency checks.",
                    "Fault-detection-strengthened method to enable the POST for very-large automotive MCU in compliance with ISO26262.",
                    "Hardware Trojan detection using path delay order encoding with process variation tolerance.",
                    "Extending post-silicon coverage measurement using time-multiplexed FPGA overlays.",
                    "Methodology for determining the influencing factors of lifetime variation for power devices.",
                    "On no-reference on-line error-tolerability testing for videos.",
                    "An efficient fault-tolerant valve-based microfluidic routing fabric for single-cell analysis.",
                    "Recycled IC detection through aging sensor.",
                    "Automatic generation of in-circuit tests for board assembly defects.",
                    "On the mitigation of single event transients on flash-based FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22nd ETS 2017",
        "info": "Limassol, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2017",
                "sub_name": "22nd IEEE European Test Symposium, ETS 2017, Limassol, Cyprus, May 22-26, 2017.",
                "count": 43,
                "papers": [
                    "Foreword.",
                    "Best paper.",
                    "Detection of resistive open and short defects in FDSOI under delay-based test: Optimal VDD and body biasing conditions.",
                    "Mitigating read & write errors in STT-MRAM memories under DVS.",
                    "Extension of power supply impedance emulation method on ATE for multiple power domain.",
                    "Automated area and coverage optimization of minimal latency checkers.",
                    "A homogeneous framework for AMS languages instrumentation, abstraction and simulation.",
                    "Integrated circuits' characterization for non-normal data in semiconductor quality analysis.",
                    "Design of a sinusoidal signal generator with calibrated harmonic cancellation for mixed-signal BIST in a 28 nm FDSOI technology.",
                    "Automatic testing of analog ICs for latent defects using topology modification.",
                    "Contact-less near-field measurement of RF phased array antenna mismatches.",
                    "Exploiting STT-MRAM for approximate computing.",
                    "Real-time self-learning for control law adaptation in nonlinear systems using encoded check states.",
                    "Rout3D: A lightweight adaptive routing algorithm for tolerating faulty vertical links in 3D-NoCs.",
                    "ISO26262-compliant soft-error mitigation in register banks.",
                    "Periodic Bias-Temperature Instability monitoring in SRAM cells.",
                    "Mixed-signal BIST computation offloading using IEEE 1687.",
                    "Impact of the switching activity on the aging of delay-PUFs.",
                    "Derivation of the reliability metric for digital circuits.",
                    "A very low cost and highly parallel DfT method for analog and mixed-signal circuits.",
                    "Probabilistic sensitization analysis for variation-aware path delay fault test evaluation.",
                    "Bridge over troubled waters: Critical area based pattern generation.",
                    "Aging-aware coding scheme for memory arrays.",
                    "ROM fault diagnosis for O(n2) test algorithms.",
                    "Counteracting malicious faults in cryptographic circuits.",
                    "Multiple-defect diagnosis for Logic Characterization Vehicles.",
                    "Data-driven fault diagnosis with missing syndromes imputation for functional test through conditional specification.",
                    "Refresh frequency reduction of data stored in SSDs based on A-timer and timestamps.",
                    "Online Profiling for cluster-specific variable rate refreshing in high-density DRAM systems.",
                    "Security and trust in the analog/mixed-signal/RF domain: A survey and a perspective.",
                    "A phase locking test solution for MEMS devices.",
                    "Coverage-driven mixed-signal verification of smart power ICs in a UVM environment.",
                    "Volume diagnosis data mining.",
                    "Low power probabilistic online monitoring of systematic erroneous behaviour.",
                    "SIC pair generation in optimal time using rotatable counters.",
                    "An efficient test technique to prevent scan-based side-channel attacks.",
                    "Application-aware lifetime estimation of power devices.",
                    "Improving the dependability of AMR sensors used in automotive applications.",
                    "Extended binary nonlinear codes and their application in testing and compression.",
                    "A built-in self-test scheme for classifying refresh periods of DRAMs.",
                    "Detecting hardware Trojans without a Golden IC through clock-tree defined circuit partitions.",
                    "Specification and verification of security in reconfigurable scan networks.",
                    "Scan chain encryption for the test, diagnosis and debug of secure circuits."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21st ETS 2016",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2016",
                "sub_name": "21th IEEE European Test Symposium, ETS 2016, Amsterdam, Netherlands, May 23-27, 2016.",
                "count": 54,
                "papers": [
                    "ETS 2016 foreword.",
                    "ETS 2015 best paper.",
                    "Securely connected vehicles - what it takes to make self-driving cars a reality.",
                    "Compressor design for silicon debug.",
                    "An optical/electrical test system for 100Gb/s optical interconnection devices with high volume testing capability.",
                    "CPE: Codeword Prediction Encoder.",
                    "Reliability enhancement of embedded memory with combination of aging-aware adaptive in-field self-repair and ECC.",
                    "In situ measurement of aging-induced performance degradation in digital circuits.",
                    "A novel threshold voltage defined switch for circuit camouflaging.",
                    "Study of a delayed single-event effect in the Muller C-element.",
                    "A self-reconfiguring IEEE 1687 network for fault monitoring.",
                    "Addressing transient routing errors in fault-tolerant Networks-on-Chips.",
                    "Formal verification of secure reconfigurable scan network infrastructure.",
                    "Testing of small delay faults in a clock network.",
                    "Analysis of electrostatic coupling in monolithic 3D integrated circuits and its impact on delay testing.",
                    "A built-in method for measuring the delay of TSVs in 3D ICs.",
                    "On the diagnostic analysis of IEEE 1687 networks.",
                    "On coverage of timing related faults at board level.",
                    "A low-cost susceptibility analysis methodology to selectively harden logic circuits.",
                    "A 40Gbps economic extension board and FPGA-based testing platform.",
                    "Combining the histogram method and the ultrafast segmented model identification of linearity errors algorithm for ADC linearity testing.",
                    "A scheduling method for hierarchical testability based on test environment generation results.",
                    "The influence of hysteresis voltage on single event transients in a 65nm CMOS high speed comparator.",
                    "Analysis and design of an on-chip retargeting engine for IEEE 1687 networks.",
                    "A novel test generation and application flow for functional access to IEEE 1687 instruments.",
                    "VecTHOR: Low-cost compression architecture for IEEE 1149-compliant TAP controllers.",
                    "Is IoT coming to the rescue of semiconductor?",
                    "Behavior and test of open-gate defects in FinFET based cells.",
                    "Test-station for flexible semi-automatic wafer-level silicon photonics testing.",
                    "Questioning the reliability of Monte Carlo simulation for machine learning test validation.",
                    "Linearity test of high-speed high-performance ADCs using a self-testable on-chip generator.",
                    "Automotive embedded software architecture in the multi-core age.",
                    "IJTAG supported 3D DFT using chiplet-footprints for testing multi-chips active interposer system.",
                    "A design-for-test solution for monolithic 3D integrated circuits.",
                    "Two-dimensional time-division multiplexing for 3D-SoCs.",
                    "Cell-aware diagnosis: Defective inmates exposed in their cells.",
                    "A fast sweep-line-based failure pattern extractor for memory diagnosis.",
                    "Bit-flip detection-driven selection of trace signals.",
                    "Cell Aware and stuck-open tests.",
                    "Practices in High-Speed IO testing.",
                    "Cross-layer resilience.",
                    "Testing in the year 2024 - big changes are coming.",
                    "Measuring defect tolerance within mixed-signal ICs.",
                    "Group delay filter measurement using a chirp.",
                    "Component fault localization using switching current measurements.",
                    "A new EDA flow for the mitigation of SEUs in dynamic reconfigurable FPGAs.",
                    "Failure mechanisms and test methods for the SRAM TVC write-assist technique.",
                    "Read path degradation analysis in SRAM.",
                    "A hybrid algorithm to conservatively check the robustness of circuits.",
                    "SAT-based post-processing for regional capture power reduction in at-speed scan test generation.",
                    "Utilizing shared memory multi-cores to speed-up the ATPG process.",
                    "Transistor stuck-on fault detection tests for digital CMOS circuits.",
                    "IEEE Std P1838: DfT standard-under-development for 2.5D-, 3D-, and 5.5D-SICs.",
                    "IoT: Source of test challenges."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20th ETS 2015",
        "info": "Cluj-Napoca, Romania",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2015",
                "sub_name": "20th IEEE European Test Symposium, ETS 2015, Cluj-Napoca, Romania, 25-29 May, 2015.",
                "count": 50,
                "papers": [
                    "Expanding the boundaries of test and diagnostics: Prognostics and Health Management (PHM) for complex systems.",
                    "A practical approach for logic simplification based on fault acceptability for error tolerant application.",
                    "Evaluating the self-testing property of AES' finite field inversion units.",
                    "Testing of digital microfluidic biochips with arbitrary layouts.",
                    "Software-based self-test techniques of computational modules in dual issue embedded processors.",
                    "Reliability analysis for power MOSFET based on multi-physics simulation.",
                    "Session-less based thermal-aware 3D-SIC test scheduling.",
                    "An effective hybrid fault-tolerant architecture for pipelined cores.",
                    "An ECC-based memory architecture with online self-repair capabilities for reliability enhancement.",
                    "Protecting caches against multi-bit errors using embedded erasure coding.",
                    "Microfluidic very large-scale integration for biochips: Technology, testing and fault-tolerant design.",
                    "Branch guided functional test generation at the RTL.",
                    "Improving test pattern generation in presence of unknown values beyond restricted symbolic logic.",
                    "Reliability-aware operation chaining in high level synthesis.",
                    "A low capture power test generation method using capture safe test vectors.",
                    "Tackling the complexity of exact path delay fault grading for path intensive circuits.",
                    "Designing area-efficient controllers for multi-cycle transient fault tolerant systems.",
                    "A soft-error tolerant TCAM using partial don't-care keys.",
                    "Symmetric transparent on-line BIST of word-organized memories with binary adders.",
                    "A Bayesian model for system level reliability estimation.",
                    "A branch-&-bound algorithm for TAM optimization in multi-Vdd SoCs.",
                    "On resistive open defect detection in DRAMs: The charge accumulation effect.",
                    "Power-aware voltage tuning for STT-MRAM reliability.",
                    "Improving RO-PUF quality on FPGAs by incorporating design-dependent frequency biases.",
                    "Testing visions.",
                    "New drain current model for nano-meter MOS transistors on-chip threshold voltage test.",
                    "NBTI and leakage aware sleep transistor design for reliable and energy efficient power gating.",
                    "Variability-aware aging modeling for reliability analysis of an analog neural measurement system.",
                    "Automatic generation of autonomous built-in observability structures for analog circuits.",
                    "Boundary cost optimization for Alternate Test.",
                    "An FPGA-based ATE extension module for low-cost multi-GHz memory test.",
                    "Is adaptive testing the panacea for the future test problems?",
                    "Advancements in diagnosis driven yield analysis (DDYA): A survey of state-of-the-art scan diagnosis and yield analysis technologies.",
                    "Testing of Analog/Mixed Signal ICs: Past, present and future.",
                    "High frequency jitter estimator for SoCs.",
                    "A new technique for low-cost phase noise production testing from 1-bit signal acquisition.",
                    "Robust amplitude measurement for RF BIST applications.",
                    "Cyber-physical systems: A security perspective.",
                    "A fault tolerant response analyzer with self-error-correction capability.",
                    "LSI aging estimation using ring oscillators.",
                    "Software-based repair for memories in tiny embedded systems.",
                    "Efficient diagnosis technique for aging defects on automotive semiconductor chips.",
                    "Re-using BIST for circuit aging monitoring.",
                    "Compact test set generation for test compression-based designs.",
                    "Improve the compression ratios for code-based test vector compressions by decomposing.",
                    "On test program compaction.",
                    "Analog test: Why still \"à la mode\" after more than 25 years of research?",
                    "Identification of high power consuming areas with gate type and logic level information.",
                    "Diagnosis of power switches with power-distribution-network consideration.",
                    "Aging guardband reduction through selective flip-flop optimization."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19th ETS 2014",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2014",
                "sub_name": "19th IEEE European Test Symposium, ETS 2014, Paderborn, Germany, May 26-30, 2014.",
                "count": 58,
                "papers": [
                    "Improving polynomial datapath debugging with HEDs.",
                    "Avoiding burnt probe tips: Practical solutions for testing internally regulated power supplies.",
                    "An off-line MDSI interconnect BIST incorporated in BS 1149.1.",
                    "M-S specification binning based on digitally coded indirect measurements.",
                    "Power efficient scan testing by exploiting existing error tolerance circuitry in a design.",
                    "Factoring variability in the Design/Technology Co Optimisation (DTCO) in advanced CMOS.",
                    "Error detection and recovery in better-than-worst-case timing designs.",
                    "Towards a general purpose mixed-signal instrumentation layer in the die stack of a 3D-SIC.",
                    "Verification of the decimal floating-point square root operation.",
                    "Smart-hopping: Highly efficient ISA-level fault injection on real hardware.",
                    "Incremental computation of delay fault detection probability for variation-aware test generation.",
                    "iBoX - Jitter based Power Supply Noise sensor.",
                    "Property-checking based LBIST for improved diagnosability.",
                    "GPU-based timing-aware test generation for small delay defects.",
                    "A new efficiency criterion for security oriented error correcting codes.",
                    "Diagnosis of multiple faults with highly compacted test responses.",
                    "Optimization-based multiple target test generation for highly compacted test sets.",
                    "Analysis and mitigation of single event effects on flash-based FPGAS.",
                    "Triple error detection for Imai-Kamiyanagi codes based on subsyndrome computations.",
                    "Reconfigurable high performance architectures: How much are they ready for safety-critical applications?",
                    "Automatic correction of certain design errors using mutation technique.",
                    "A collision resistant deterministic random bit generator with fault attack detection possibilities.",
                    "Accumulator-based test-per-clock scheme for low-power on-chip application of test patterns.",
                    "Shadow-scan design with low latency overhead and in-situ slack-time monitoring.",
                    "Cell-aware experiences in a high-quality automotive test suite.",
                    "Built-in self-calibration of CMOS-compatible thermopile sensor with on-chip electrical stimulus.",
                    "Using dynamic shift to reduce test data volume in high-compression designs.",
                    "Detection conditions for errors in self-adaptive better-than-worst-case designs.",
                    "Output-bit selection with X-avoidance using multiple counters for test-response compaction.",
                    "Design of low cost fault tolerant analog circuits using real-time learned error compensation.",
                    "Concurrent online BIST for sequential circuits exploiting input reduction and output space compaction.",
                    "Analysis of cell-aware test pattern effectiveness - A case study using a 32-bit automotive microcontroller.",
                    "A novel adaptive fault tolerant flip-flop architecture based on TMR.",
                    "Sat-based speedpath debugging using waveforms.",
                    "Variation-aware deterministic ATPG.",
                    "Aging and voltage scaling impacts under neutron-induced soft error rate in SRAM-based FPGAs.",
                    "Test-mode-only scan attack using the boundary scan chain.",
                    "Optimization of analog fault coverage by exploiting defect-specific masking.",
                    "Site dependencies in a multisite testing environment.",
                    "On-the-fly timing-aware built-in self-repair for high-speed interposer wires in 2.5-D ICs.",
                    "Secure and efficient LBIST for feedback shift register-based cryptographic systems.",
                    "Quantified contribution of design for manufacturing to yield at 28nm.",
                    "Systematic generation of diagnostic software-based self-test routines for processor components.",
                    "A generic and high-level model of large unreliable NoCs for fault tolerance and performance analysis.",
                    "On the impact of process variability and aging on the reliability of emerging memories (Embedded tutorial).",
                    "A true random number generator with on-line testability.",
                    "INL systematic reduced-test technique for Pipeline ADCs.",
                    "Major eras of Design for Test.",
                    "Reducing embedded software radiation-induced failures through cache memories.",
                    "Homogeneous many-core processor system test distribution and execution mechanism.",
                    "Model based generation of high coverage test suites for embedded systems.",
                    "Fault injection and fault tolerance methodologies for assessing device robustness and mitigating against ionizing radiation.",
                    "Interleaved scrambling technique: A novel low-power security layer for cache memories.",
                    "Two soft-error mitigation techniques for functional units of DSP processors.",
                    "A distance-based test cube merging procedure for compatible and incompatible test cubes.",
                    "Logic simulation and fault collapsing with shared structurally synthesized bdds.",
                    "Post-bond test of Through-Silicon Vias with open defects.",
                    "Quantitative evaluation of register vulnerabilities in RTL control paths."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18th ETS 2013",
        "info": "Avignon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2013",
                "sub_name": "18th IEEE European Test Symposium, ETS 2013, Avignon, France, May 27-30, 2013.",
                "count": 45,
                "papers": [
                    "A minimum MSE sensor fusion algorithm with tolerance to multiple faults.",
                    "Novel approach to reduce power droop during scan-based logic BIST.",
                    "Efficient system-level testing and adaptive tuning of MIMO-OFDM wireless transmitters.",
                    "Bias temperature instability analysis in SRAM decoder.",
                    "Analyzing resistive-open defects in SRAM core-cell under the effect of process variability.",
                    "RF BIST and test strategy for the receive part of an RF transceiver in CMOS technology.",
                    "Analytical modeling for EVM in OFDM transmitters including the effects of IIP3, I/Q imbalance, noise, AM/AM and AM/PM distortion.",
                    "BIST architecture to detect defects in tsvs during pre-bond testing.",
                    "Reducing power dissipation in memory repair for high defect densities.",
                    "Scan pattern retargeting and merging with reduced access time.",
                    "Semiconductor failure modes and mitigation for critical systems embedded tutorial.",
                    "Run-time detection of hardware Trojans: The processor protection unit.",
                    "Error-correction schemes with erasure information for fast memories.",
                    "Efficient selection of signatures for analog/RF alternate test.",
                    "Optimization for timing-speculated circuits by redundancy addition and removal.",
                    "PinPoint: An algorithm for enhancing diagnostic resolution using capture cycle power information.",
                    "Hybrid 3D pre-bonding test framework design.",
                    "Efficient minimization of test frequencies for linear analog circuits.",
                    "Generation of compact multi-cycle diagnostic test sets.",
                    "An error-detection and self-repairing method for dynamically and partially reconfigurable systems.",
                    "Current testing: Dead or alive?",
                    "Aggresive scan chain masking for improved diagnosis of multiple scan chain failures.",
                    "Efficient fault simulation through dynamic binary translation for dependability analysis of embedded software.",
                    "Implementing model redundancy in predictive alternate test to improve test confidence.",
                    "New test compression scheme based on low power BIST.",
                    "A software-based self test of CUDA Fermi GPUs.",
                    "Panel session what is the electronics industry doing to win the battle against the expected scary failure rates in future technology nodes?",
                    "Computing detection probability of delay defects in signal line tsvs.",
                    "Experimental evaluation of thread distribution effects on multiple output errors in GPUs.",
                    "Reconciling the IC test and security dichotomy.",
                    "M-S test based on specification validation using octrees in the measure space.",
                    "Utilizing circuit structure for scan chain diagnosis.",
                    "Magical thinking applied to test engineering reality (and vice versa).",
                    "Test generation for circuits with embedded memories using SMT.",
                    "Robust optimization of test-architecture designs for core-based SoCs.",
                    "Variability-aware and fault-tolerant self-adaptive applications for many-core chips.",
                    "Automated DfT insertion and test generation for 3D-SICs with embedded cores and multiple towers.",
                    "A layout-aware x-filling approach for dynamic power supply noise reduction in at-speed scan testing.",
                    "A mutual characterization based SAR ADC self-testing technique.",
                    "Outlook for many-core systems: Cloudy with a chance of virtualization.",
                    "On combining alternate test with spatial correlation modeling in analog/RF ICs.",
                    "Information-theoretic syndrome and root-cause analysis for guiding board-level fault diagnosis.",
                    "Approximate computing: An emerging paradigm for energy-efficient design.",
                    "Adaptive quality binning for analog circuits.",
                    "Extracting device-parameter variations using a single sensitivity-configurable ring oscillator."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17th ETS 2012",
        "info": "Annecy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2012",
                "sub_name": "17th IEEE European Test Symposium, ETS 2012, Annecy, France, May 28 - June 1 2012.",
                "count": 56,
                "papers": [
                    "Power-aware testing: The next stage.",
                    "DfT support for launch and capture power reduction in launch-off-capture testing.",
                    "Cost and power efficient timing error tolerance in flip-flop based microprocessor cores.",
                    "Bandwidth-aware test compression logic for SoC designs.",
                    "On-line software-based self-test of the Address Calculation Unit in RISC processors.",
                    "Fast error detection through efficient use of hardwired resources in FPGAs.",
                    "Increasing autonomous fault-tolerant FPGA-based systems' lifetime.",
                    "Fault tolerant FPGA processor based on runtime reconfigurable modules.",
                    "BIST design for analog cell matching.",
                    "Enhanced reduced code linearity test technique for multi-bit/stage pipeline ADCs.",
                    "Adaptive multi-site testing for analog/mixed-signal circuits incorporating neighborhood information.",
                    "Characterization and handling of low-cost micro-architectural signatures in MPSoCs.",
                    "Reducing wearout in embedded processors using proactive fine-grain dynamic runtime adaptation.",
                    "OBT for settling error test of sampled-data systems using signal-dependent clocking.",
                    "On-chip delay measurement circuit.",
                    "On the detection of path delay faults by functional broadside tests.",
                    "Functional test generation for hard to detect stuck-at faults using RTL model checking.",
                    "Exact stuck-at fault classification in presence of unknowns.",
                    "Memory reliability improvements based on maximized error-correcting codes.",
                    "Time-division multiplexing for testing SoCs with DVS and multiple voltage islands.",
                    "Combining dynamic slicing and mutation operators for ESL correction.",
                    "Multi-voltage aware resistive open fault modeling.",
                    "Indirect method for random jitter measurement on SoCs using critical path characterization.",
                    "Adaptive testing of chips with varying distributions of unknown response bits.",
                    "Toggle-masking scheme for x-filtering.",
                    "Built-in self-diagnosis exploiting strong diagnostic windows in mixed-mode test.",
                    "Multi-conditional SAT-ATPG for power-droop testing.",
                    "On the quality of test vectors for post-silicon characterization.",
                    "Efficient system-level aging prediction.",
                    "Diagnostic system based on support-vector machines for board-level functional diagnosis.",
                    "Disturbance fault testing on various NAND flash memories.",
                    "Functional analysis of circuits under timing variations.",
                    "Enhanced wafer matching heuristics for 3-D ICs.",
                    "Defect analysis in power mode control logic of low-power SRAMs.",
                    "Coupling-based resistive-open defects in TAS-MRAM architectures.",
                    "On-chip temperature and voltage measurement for field testing.",
                    "Impact of NBTI on analog components.",
                    "Through-Silicon-Via resistive-open defect analysis.",
                    "Testing of digitally assisted adaptive analog/RF systems using tuning knob - Performance space estimation.",
                    "On-chip test comparison for protecting confidential data in secure ICs.",
                    "Fault-Tolerant Algebraic Architecture for radiation induced soft-errors.",
                    "Online detection and recovery of transient errors in front-end structures of microprocessors.",
                    "Test tool qualification through fault injection.",
                    "A Software-Based Self-Test methodology for on-line testing of data TLBs.",
                    "Embedded synthetic instruments for Board-Level testing.",
                    "Adaptive testing: Conquering process variations.",
                    "Introduction to the defect-oriented cell-aware test methodology for significant reduction of DPPM rates.",
                    "VLSI Test technology: Why is the field not sexy enough?",
                    "The impact of functional safety standards in the design and test of reliable and available integrated circuits.",
                    "Re-using chip level DFT at board level.",
                    "Funding project DIANA - Integrated diagnostics for the analysis of electronic failures in vehicles.",
                    "Reducing test cost for mixed signal circuits \"From TOETS to ELESIS\".",
                    "FP7 collaborative research project DIAMOND: Diagnosis, error modeling and correction for reliable systems design.",
                    "Dependable embedded systems: The German research foundation DFG priority program SPP 1500.",
                    "Introducing MEDIAN: A new COST Action on manufacturable and dependable multicore architectures at nanoscale.",
                    "A robust metric for screening outliers from analogue product manufacturing tests responses."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16th ETS 2011",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2011",
                "sub_name": "16th European Test Symposium, ETS 2011, Trondheim, Norway, May 23-27, 2011.",
                "count": 52,
                "papers": [
                    "Diagnosis of Failing Scan Cells through Orthogonal Response Compaction.",
                    "Improved DFT for Testing Power Switches.",
                    "Signature Analysis for Testing, Diagnosis, and Repair of Multi-mode Power Switches.",
                    "Scan Attacks and Countermeasures in Presence of Scan Response Compactors.",
                    "Memory Optimized Two-Stimuli INL Test Method for DAC-ADC Pairs.",
                    "Signature Testing and Diagnosis of High Precision S? ADC Dynamic Specifications Using Model Parameter Estimation.",
                    "A Pre- and Post-bond Self-Testing and Calibration Methodology for SAR ADC Array in 3-D CMOS Imager.",
                    "Layer Redundancy Based Yield Improvement for 3D Wafer-to-Wafer Stacked Memories.",
                    "DfT Architecture for 3D-SICs with Multiple Towers.",
                    "Power Aware Post-manufacture Tuning of Analog Nanocircuits.",
                    "Tomographic Testing and Validation of Probabilistic Circuits.",
                    "Fault Masking and Diagnosis in Reversible Circuits.",
                    "Extraction of EVM from Transmitter System Parameters.",
                    "A Mixed-Signal Test Bus and Analog BIST with 'Unlimited' Time and Voltage Resolution.",
                    "AVF Analysis Acceleration via Hierarchical Fault Pruning.",
                    "Efficient Fault Detection Architecture Design of Latch-Based Low Power DSP/MCU Processor.",
                    "Reduced ATE Interface for High Test Data Compression.",
                    "Toggle-Based Masking Scheme for Clustered Unknown Response Bits.",
                    "Structural In-Field Diagnosis for Random Logic Circuits.",
                    "Accelerating RTL Fault Simulation through RTL-to-TLM Abstraction.",
                    "Improving Reliability in NoCs by Application-Specific Mapping Combined with Adaptive Fault-Tolerant Method in the Links.",
                    "Latency Analysis for Sequential Circuits.",
                    "Input/Output Pad for Direct Contact and Contactless Testing.",
                    "An Approach for Quantifying Path Correlation in Digital Circuits without any Path or Segment Enumeration.",
                    "Constraint-Based Hierarchical Untestability Identification for Synchronous Sequential Circuits.",
                    "A Functional Power Evaluation Flow for Defining Test Power Limits during At-Speed Delay Testing.",
                    "A Robust Metric for Screening Outliers from Analogue Product Manufacturing Tests Responses.",
                    "Fast and Accurate DPPM Computation Using Model Based Filtering.",
                    "Optimization of Assertion Placement in Time-Constrained Embedded Systems.",
                    "Critical Fault-Based Pattern Generation for Screening SDDs.",
                    "Structural Test for Graceful Degradation of NoC Switches.",
                    "On Transition Fault Diagnosis Using Multicycle At-Speed Broadside Tests.",
                    "Ranking of Suspect Faulty Blocks Using Dataflow Analysis and Dempster-Shafer Theory for the Diagnosis of Board-Level Functional Failures.",
                    "Online Univariate Outlier Detection in Final Test: A Robust Rolling Horizon Approach.",
                    "Timing Vulnerability Factors of Ultra Deep-sub-micron CMOS.",
                    "F-Scan Test Generation Model for Delay Fault Testing at RTL Using Standard Full Scan ATPG.",
                    "Viterbi-Based Efficient Test Data Compression.",
                    "Memory Test Optimization for Parasitic Bit Line Coupling in SRAMs.",
                    "A Novel SRAM-Cell Based Input Vector Monitoring Concurrent BIST Architecture.",
                    "FPGA Soft Error Recovery Mechanism with Small Hardware Overhead.",
                    "I-BIRAS: Interconnect Built-In Self-Repair and Adaptive Serialization in 3D Integrated Systems.",
                    "A Hardware-Based Approach for Fault Detection in RTOS-Based Embedded Systems.",
                    "High-Performance Diagnostic Fault Simulation on GPUs.",
                    "Dynamic Test Set Selection Using Implication-Based On-Chip Diagnosis.",
                    "A Low-Cost Emulation System for Fast Co-verification and Debug.",
                    "Revisiting Application-Dependent Test for FPGA Devices.",
                    "Temperature-Variation-Aware Test Pattern Optimization.",
                    "Analysis and Mitigation of Electromigration in RF Circuits: An LNA Case Study.",
                    "Enhancement of Clock Delay Faults Testing.",
                    "Dual Edge Triggered Flip-Flops for Noise Aware Design.",
                    "On High-Quality Test Pattern Selection and Manipulation.",
                    "Towards Variation-Aware Test Methods."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15th ETS 2010",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2010",
                "sub_name": "15th European Test Symposium, ETS 2010, Prague, Czech Republic, May 24-28, 2010.",
                "count": 64,
                "papers": [
                    "Plenary presentations: Keynote: The product complexity and test - How product complexity impacts test industry.",
                    "Invited talk: Self-aware wireless communication and signal processing systems: Real-time adaptation for error resilience, low power and performance.",
                    "Adaptive test directions.",
                    "Production test challenges for highly integrated mobile phone SOCs - A case study.",
                    "Test-architecture optimization for TSV-based 3D stacked ICs.",
                    "A low-cost and scalable test architecture for multi-core chips.",
                    "On the cost-effectiveness of matching repositories of pre-tested wafers for wafer-to-wafer 3D chip stacking.",
                    "On the use of standard digital ATE for the analysis of RF signals.",
                    "Sensors for built-in alternate RF test.",
                    "Low-cost signature test of RF blocks based on envelope response analysis.",
                    "Combining scan and trace buffers for enhancing real-time observability in post-silicon debugging.",
                    "Parametric failure analysis of embedded SRAMs using fast & accurate dynamic analysis.",
                    "A low-cost built-in self-test scheme for an array of memories.",
                    "A two-layer SPICE model of the ATMEL TSTACTM eFlash memory technology for defect injection and faulty behavior prediction.",
                    "A transient error tolerant self-timed asynchronous architecture.",
                    "Multiple fault diagnosis in crossbar nano-architectures.",
                    "Full-circuit SPICE simulation based validation of dynamic delay estimation.",
                    "On estimation of NBTI-Induced delay degradation.",
                    "Modified T-Flip-Flop based scan cell for RAS.",
                    "Calibration-enabled scalable built-in current sensor compatible with very low cost ATE.",
                    "Computing the detection of Small Delay Defects caused by resistive opens of nanometer ICs.",
                    "Analysis of resistive-bridging defects in SRAM core-cells: A comparative study from 90nm down to 40nm technology nodes.",
                    "A reconfigurable online BIST for combinational hardware using digital neural networks.",
                    "A Built-In Self-Test scheme for high speed I/O using cycle-by-cycle edge control.",
                    "Constructing augmented time compactors.",
                    "Predicting dynamic specifications of ADCs with a low-quality digital input signal.",
                    "Test of embedded analog circuits based on a built-in current sensor.",
                    "Novel built-in methodology for defect testing of capacitor oxide in SAR analog to digital converters for critical automotive applications.",
                    "Improving CNF representations in SAT-based ATPG for industrial circuits using BDDs.",
                    "A distributed architecture to check global properties for post-silicon debug.",
                    "Automated conformance evaluation of SystemC designs using timed automata.",
                    "A software-based self-test methodology for system peripherals.",
                    "Microprocessor fault-tolerance via on-the-fly partial reconfiguration.",
                    "Scan based speed-path debug for a microprocessor.",
                    "An integrated flow for the design of hardened circuits on SRAM-based FPGAs.",
                    "Diagnosis of failing scan cells through orthogonal response compaction.",
                    "An adaptive tester architecture for volume diagnosis.",
                    "Diagnosis of full open defects in interconnect lines with fan-out.",
                    "Input test data volume reduction based on test vector chains.",
                    "On measurement uncertainty of ADC nonlinearities in oscillation-based test.",
                    "Fast simulation based testing of anti-tearing mechanisms for small embedded systems.",
                    "New scan-based test strategy for a dependable many-core processor using a NoC as a Test Access Mechanism.",
                    "Design and implementation of Automatic Test Equipment IP module.",
                    "Add-on blocks and algorithms for improving stimulus compression.",
                    "Defect-aware nanocrossbar logic mapping using Bipartite Subgraph Isomorphism & canonization.",
                    "Hybrid test application in hybrid delay scan design.",
                    "Reconfigurable Concurrent Error Detection adaptive to dynamicity of power constraints.",
                    "Test power reduction in compression-based reconfigurable scan architectures.",
                    "Multivariate model for test response analysis.",
                    "Robustness evaluation and improvements under laser-based fault attacks of an AES crypto-processor implemented on a SRAM-based FPGA.",
                    "Evaluation of concurrent error detection techniques on the Advanced Encryption Standard.",
                    "Algorithm-based fault tolerance for many-core architectures.",
                    "A diagnostic test generation system and a coverage metric.",
                    "A shared BIST optimization methodology for memory test.",
                    "Pipelined parallel test structure for mixed-signal SoCs.",
                    "Setting test conditions for improving SRAM reliability.",
                    "Configurable fault-tolerant link for inter-die communication in 3D on-chip networks.",
                    "Scan cell reordering to minimize peak power during test cycle: A graph theoretic approach.",
                    "Test pattern selection to optimize delay test quality with a limited size of test set.",
                    "Increasing reliability of programmable mixed-signal systems by applying design diversity redundancy.",
                    "Current-based testable design of level shifters in liquid crystal display drivers.",
                    "A multi-mode MEMS sensor design to support system test and health & usage monitoring applications.",
                    "A new built-in IDDQ testing method using programmable BICS.",
                    "Defect filter for alternate RF test."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th ETS 2009",
        "info": "Sevilla, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2009",
                "sub_name": "14th IEEE European Test Symposium, ETS 2009, Sevilla, Spain, May 25-29, 2009.",
                "count": 26,
                "papers": [
                    "We Have Got Compression, What Next?",
                    "Something I Always Wanted to Know About Test, But Was Afraid to Ask.",
                    "Testing of High Resolution ADCs Using Lower Resolution DACs via Iterative Transfer Function Estimation.",
                    "Speed-Path Debug Using At-Speed Scan Test Patterns.",
                    "Resource-Efficient Programmable Trigger Units for Post-Silicon Validation.",
                    "On Minimization of Peak Power for Scan Circuit during Test.",
                    "Exploiting Thread-Level Parallelism in Functional Self-Testing of CMT Processors.",
                    "Doubling Test Cell Throughput by On-Loadboard Hardware- Implementation and Experience in a Production Environment.",
                    "Algorithms for ADC Multi-site Test with Digital Input Stimulus.",
                    "Concurrent Self-Test with Partially Specified Patterns for Low Test Latency and Overhead.",
                    "Design and Test Challenges in Resistive Switching RAM (ReRAM): An Electrical Model for Defect Injections.",
                    "Novel Solution for the Built-in Gate Oxide Stress Test of LDMOS in Integrated Circuits for Automotive Applications.",
                    "Built-in Test Solutions for the Electrode Structures in Bio-Fluidic Microsystems.",
                    "Increasing Robustness of SAT-based Delay Test Generation Using Efficient Dynamic Learning Techniques.",
                    "Input Cubes with Lingering Synchronization Effects and their Use in Random Sequential Test Generation.",
                    "Automatic Functional Stress Pattern Generation for SoC Reliability Characterization.",
                    "Defect Filter for Alternate RF Test.",
                    "Signature-Based Testing for Digitally-Assisted Adaptive Equalizers in High-Speed Serial Links.",
                    "A Two Phase Approach for Minimal Diagnostic Test Set Generation.",
                    "Categorizing and Analysis of Activated Faults in the FlexRay Communication Controller Registers.",
                    "Low-Complexity Off-Chip Skew Measurement and Compensation Module (SMCM) Design for Built-Off Test Chip.",
                    "A Voltage-Mode Testing Method to Detect IDDQ Defects in Digital Circuits.",
                    "Partial Scan Approach for Secret Information Protection.",
                    "Masking of X-values by Use of a Hierarchically Configurable Register.",
                    "Test Encoding for Extreme Response Compaction.",
                    "Critical Path Selection for Delay Test Considering Coupling Noise."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th ETS 2008",
        "info": "Verbania, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2008",
                "sub_name": "13th European Test Symposium, ETS 2008, Verbania, Italy, May 25-29, 2008.",
                "count": 30,
                "papers": [
                    "The Role of Test in Circuits Built with Unreliable Components.",
                    "The Future Is Low Power and Test.",
                    "Safe Fault Collapsing Based on Dominance Relations.",
                    "A Reliable Architecture for the Advanced Encryption Standard.",
                    "Bandwidth Analysis for Reusing Functional Interconnect as Test Access Mechanism.",
                    "Analog Test Bus Infrastructure for RF/AMS Modules in Core-Based Design.",
                    "Confidence Estimation in Non-RF to RF Correlation-Based Specification Test Compaction.",
                    "Built-in Test of Frequency Modulated RF Transmitters Using Embedded Low-Pass Filters.",
                    "Using Temperature as Observable of the Frequency Response of RF CMOS Amplifiers.",
                    "A Capture-Safe Test Generation Scheme for At-Speed Scan Testing.",
                    "Temporally Extended High-Level Decision Diagrams for PSL Assertions Simulation.",
                    "On Bypassing Blocking Bugs during Post-Silicon Validation.",
                    "Applying March Tests to K-Way Set-Associative Cache Memories.",
                    "Hierarchical Code Correction and Reliability Management in Embedded nor Flash Memories.",
                    "Self-Programmable Shared BIST for Testing Multiple Memories.",
                    "Bridge Defect Diagnosis for Multiple-Voltage Design.",
                    "Diagnose Multiple Stuck-at Scan Chain Faults.",
                    "A Simulator of Small-Delay Faults Caused by Resistive-Open Defects.",
                    "Critical Path Selection for Delay Test Considering Coupling Noise.",
                    "Low Overhead Partial Enhanced Scan Technique for Compact and High Fault Coverage Transition Delay Test Patterns.",
                    "Accelerated Shift Registers for X-tolerant Test Data Compaction.",
                    "An Innovative and Low-Cost Industrial Flow for Reliability Characterization of SoCs.",
                    "An Improved Algorithm to Identify the Test Stimulus in Histogram-Based A/D Converter Testing.",
                    "Jitter Decomposition in High-Speed Communication Systems.",
                    "Risks for Signal Integrity in System in Package and Possible Remedies.",
                    "Function-Inherent Code Checking: A New Low Cost On-Line Testing Approach for High Performance Microprocessor Control Logic.",
                    "Tunable Transient Filters for Soft Error Rate Reduction in Combinational Circuits.",
                    "Selective Hardening in Early Design Steps.",
                    "Convolutional Coding for SEU mitigation.",
                    "Adaptive Debug and Diagnosis without Fault Dictionaries."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th ETS 2007",
        "info": "Freiburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2007",
                "sub_name": "12th European Test Symposium, ETS 2007, Freiburg, Germany, May 20, 2007.",
                "count": 34,
                "papers": [
                    "If It's All about Yield, Why Talk about Testing?",
                    "Electronics Design-for-Test: Past, Present and Future.",
                    "Adaptive Debug and Diagnosis without Fault Dictionaries.",
                    "DERRIC: A Tool for Unified Logic Diagnosis.",
                    "A Digitally Testable Capacitance-Insensitive Mixed-Signal Filter.",
                    "Test Configurations for Diagnosing Faulty Links in NoC Switches.",
                    "Optimization of NoC Wrapper Design under Bandwidth and Test Time Constraints.",
                    "FPGA Architecture for RF Transceiver System and Mixed-Signal Low Cost Tests.",
                    "Digital Generation of Signals for Low Cost RF BIST.",
                    "Variance Reduction for Supply Ramp Based Cheap RF Test Alternatives.",
                    "Parallel Scan-Like Testing and Fault Diagnosis Techniques for Digital Microfluidic Biochips.",
                    "Communication-Centric SoC Debug Using Transactions.",
                    "Electrical Simulation Model of the 2T-FLOTOX Core-Cell for Defect Injection and Faulty Behavior Prediction in eFlash Memories.",
                    "PPM Reduction on Embedded Memories in System on Chip.",
                    "An Integrated Built-In Test and Repair Approach for Memories with 2D Redundancy.",
                    "Dynamic Two-Cell Incorrect Read Fault Due to Resistive-Open Defects in the Sense Amplifiers of SRAMs.",
                    "A Novel Approach for Online Sensor Testing Based on an Encoded Test Stimulus.",
                    "Selecting Power-Optimal SBST Routines for On-Line Processor Testing.",
                    "Optimal Contexts for the Self-Test of Coarse Grain Dynamically Reconfigurable Processors.",
                    "A Seed-Selection Method to Increase Defect Coverage for LFSR-Reseeding-Based Test Compression.",
                    "Ultra Fast Parallel Fault Analysis on Structurally Synthesized BDDs.",
                    "Computation and Application of Absolute Dominators in Industrial Designs.",
                    "Analyzing Volume Diagnosis Results with Statistical Learning for Yield Improvement.",
                    "Diagnostic Test Generation Based on Subsets of Faults.",
                    "Static and Dynamic Analysis of SEU Effects in SRAM-Based FPGAs.",
                    "System Level Approaches for Mitigation of Long Duration Transient Faults in Future Technologies.",
                    "Automatic Generation of Instructions to Robustly Test Delay Defects in Processors.",
                    "On the Automatic Generation of Test Programs for Path-Delay Faults in Microprocessor Cores.",
                    "Purely Digital BIST for Any PLL or DLL.",
                    "System-in-Package, a Combination of Challenges and Solutions.",
                    "Embedded Tutorial: IC Test Cost Benchmarking.",
                    "Wafer Level Reliability Screens.",
                    "Embedded Tutorial on Low Power Test.",
                    "\"Analogue Network of Converters\": A DFT Technique to Test a Complete Set of ADCs and DACs Embedded in a Complex SiP or SOC."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th ETS 2006",
        "info": "Southhampton, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2006",
                "sub_name": "11th European Test Symposium, ETS 2006, Southhampton, UK, May 21-24, 2006.",
                "count": 39,
                "papers": [
                    "Innovation and Wealth Creation from Technology.",
                    "Living with Failure: Lessons from Nature?",
                    "Low Cost Launch-on-Shift Delay Test with Slow Scan Enable.",
                    "Dynamic Voltage Scaling Aware Delay Fault Testing.",
                    "Enhancing Delay Fault Coverage through Low Power Segmented Scan.",
                    "Single-Event Upset Analysis and Protection in High Speed Circuits.",
                    "Improving SNR for DSM Linear Systems Using Probabilistic Error Correction and State Restoration: A Comparative Study.",
                    "Minimal March Tests for Dynamic Faults in Random Access Memories.",
                    "A 22n March Test for Realistic Static Linked Faults in SRAMs.",
                    "Testing Active Neighborhood Pattern-Sensitive Faults of Ternary Content Addressable Memories.",
                    "Fault Identification in Reconfigurable Carry Lookahead Adders Targeting Nanoelectronic Fabrics.",
                    "Built-In Self-Test for PEs of Coarse Grained Dynamically Reconfigurable Devices.",
                    "Fault Injection-based Reliability Evaluation of SoPCs.",
                    "Retention-Aware Test Scheduling for BISTed Embedded SRAMs.",
                    "A Transparent based Programmable Memory BIST.",
                    "A Flexible and Scaleable Methodology for Testing High Speed Source Synchronous Interfaces on ATE with Multiple Fixed Phase Capture and Compare.",
                    "On-Chip Time Measurement Architecture with Femtosecond Timing Resolution.",
                    "On-Chip Test Generation Using Linear Subspaces.",
                    "Convolutional Compactors with Variable Polynomials.",
                    "Deterministic Logic BIST for Transition Fault Testing.",
                    "Experimental Validation of a Fully Digital BISTfor Cascaded Sigma Delta Modulators.",
                    "Evaluating Sigma-Delta Modulated Signals to Develop Fault-Tolerant Circuits.",
                    "Testing and Diagnosis of Power Switches in SOCs.",
                    "A Robust 130nm-CMOS Built-In Current Sensor Dedicated to RF Applications.",
                    "\"Analogue Network of Converters\": A DFT Technique to Test a Complete Set of ADCs and DACs Embedded in a Complex SiP or SOC.",
                    "Reducing Sampling Clock Jitter to Improve SNR Measurement of A/D Converters in Production Test.",
                    "Fault Collapsing for Transition Faults Using Extended Transition Faults.",
                    "FATE: a Functional ATPG to Traverse Unstabilized EFSMs.",
                    "A Unified Method to Detect Transistor Stuck-Open Faults and Transition Delay Faults.",
                    "A Low Cost Alternative Method for Harmonics Estimation in a BIST Context.",
                    "Optimized Signature-Based Statistical Alternate Test for Mixed-Signal Performance Parameters.",
                    "Low Cost Parametric Failure Diagnosis of RF Transceivers.",
                    "Wrapper Design for the Reuse of Networks-on-Chip as Test Access Mechanism.",
                    "A DFT Architecture for Asynchronous Networks-on-Chip.",
                    "Low-Cost Online Testing of Asynchronous Handshakes.",
                    "Test-per-Clock Detection, Localization and Identification of Interconnect Faults.",
                    "On-Chip Evaluation, Compensation, and Storage of Scan Diagnosis Data - A Test Time Efficient Scan Diagnosis Architecture.",
                    "Soft-Error Rate Testing of Deep-Submicron Integrated Circuits.",
                    "New Techniques for Accessing Embedded Instrumentation: IEEE P1687 (IJTAG)."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th ETS 2005",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2005",
                "sub_name": "10th European Test Symposium, ETS 2005, Tallinn, Estonia, May 22-25, 2005.",
                "count": 35,
                "papers": [
                    "Energy minimization for hybrid BIST in a system-on-chip test environment.",
                    "Test scheduling for modular SOCs in an abort-on-fail environment.",
                    "A new SoC test architecture with RF/wireless connectivity.",
                    "A unified fault model and test generation procedure for interconnect opens and bridges.",
                    "Defective behaviours of resistive opens in interconnect lines.",
                    "Testing of resistive opens in CMOS latches and flip-flops.",
                    "Using dummy bridging faults to define a reduced set of target faults.",
                    "Acceleration of transition test generation for acyclic sequential circuits utilizing constrained combinational stuck-at test generation.",
                    "Path-oriented transition fault test generation considering operating conditions.",
                    "Evaluation of signature-based testing of RF/analog circuits.",
                    "Accurate measurement of multi-tone power ratio (MTPR) of ADSL devices using low cost testers.",
                    "Towards on-line testing of MEMS using electro-thermal excitation.",
                    "Evaluation of impulse response-based BIST techniques for MEMS in the presence of weak nonlinearities.",
                    "Bias Superposition - An On-Line Test Strategy for a MEMS Based Conductivity Sensor.",
                    "DOT: new deterministic defect-oriented ATPG tool.",
                    "Logic circuit testing for transient faults.",
                    "A novel delay fault testing methodology using on-chip low-overhead delay measurement hardware at strategic probe points.",
                    "Resistive-open defect influence in SRAM pre-charge circuits: analysis and characterization.",
                    "Automatic March tests generation for static and dynamic faults in SRAMs.",
                    "A programmable time measurement architecture for embedded memory characterization.",
                    "Multiple errors produced by single upsets in FPGA configuration memory: a possible solution.",
                    "Fault collapsing for flash memory disturb faults.",
                    "Low power embedded DRAMs with high quality error correcting capabilities.",
                    "Design validation of behavioral VHDL descriptions for arbitrary fault models.",
                    "Coverage of formal properties based on a high-level fault model and functional ATPG.",
                    "Built-in self-test of molecular electronics-based nanofabrics.",
                    "Convolutional compaction-driven diagnosis of scan failures.",
                    "Stuck-open fault diagnosis with stuck-at model.",
                    "Test control for secure scan designs.",
                    "Time-multiplexed test data decompression architecture for core-based SOCs with improved utilization of tester channels.",
                    "Exploiting an infrastructure IP to reduce memory diagnosis costs in SoCs.",
                    "The anatomy of nanometer timing failures.",
                    "From embedded test to embedded diagnosis.",
                    "Test for low cost CMOS image sensors.",
                    "Testing of MEMS-based microsystems."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th ETS 2004",
        "info": "Ajaccio, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2004",
                "sub_name": "9th European Test Symposium, ETS 2004, Ajaccio, France, May 23-26, 2004.",
                "count": 26,
                "papers": [
                    "At-speed on-chip diagnosis of board-level interconnect faults.",
                    "Accurate tap-delay measurements using a di .erential oscillation technique.",
                    "Delay chain based programmable jitter generator.",
                    "Application of local design-for-reliability techniques for reducing wear-out degradation of CMOS combinational logic circuits.",
                    "A new self-checking multiplier by use of a code-disjoint sum-bit duplicated adder.",
                    "Software development for an open architecture test system.",
                    "Delay fault testing and silicon debug using scan chains.",
                    "Manufacturing-oriented testing of delay faults in the logic architecture of symmetrical FPGAs.",
                    "Electrically-induced thermal stimuli for MEMS testing.",
                    "Mems built-in-self-test using MLS.",
                    "Test planning and test resource optimization for droplet-based microfluidic systems.",
                    "User-constrained test architecture design for modular SOC testing.",
                    "Pipelined test of SOC cores through test data transformations.",
                    "Relating entropy theory to test data compression.",
                    "A compression-driven test access mechanism design approach.",
                    "Enhanced 3-valued logic/fault simulation for full scan circuits using implicit logic values.",
                    "Signal integrity verification using high speed monitors.",
                    "Towards a BIST technique for noise figure evaluation.",
                    "A new BIST scheme for 5GHz low noise amplifiers.",
                    "All-pass SC biquad reconfiguration scheme for oscillation based analog BIST.",
                    "Dynamic read destructive fault in embedded-SRAMs: analysis and march test solution.",
                    "Tests for address decoder delay faults in RAMs due to inter-gate opens.",
                    "Functional fault coverage: the chamber of secrets or an accurate estimation of gate-level coverage?",
                    "Automatic test pattern generation for resistive bridging faults.",
                    "A design methodology to realize delay testable controllers using state transition information.",
                    "An efficient scan tree design for test time reduction."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8th ETW 2003",
        "info": "Maastricht, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2003",
                "sub_name": "8th European Test Workshop, ETW 2003, Maastricht, The Netherlands, May 25-28, 2003.",
                "count": 23,
                "papers": [
                    "TPI for improving PR fault coverage of Boolean and three-state circuits.",
                    "On the selection of efficient arithmetic additive test pattern generators [logic test].",
                    "Parity-based output compaction for core-based SOCs [logic testing].",
                    "Defect-oriented dynamic fault models for embedded-SRAMs.",
                    "Importance of dynamic faults for new SRAM technologies.",
                    "Yield analysis for repairable embedded memories.",
                    "Scan test strategy for asynchronous-synchronous interfaces [SoC testing].",
                    "An efficient approach to SoC wrapper design, TAM configuration and test scheduling.",
                    "Control-aware test architecture design for modular SOC testing.",
                    "A practical evaluation of IDDQ test strategies for deep submicron production test application. Experiences and targets from the field.",
                    "Automating the device interface board modeling for virtual test.",
                    "Signal integrity loss in bus lines due to open shielding defects.",
                    "Process-variability aware delay fault testing of ΔVT and weak-open defects.",
                    "Modeling feedback bridging faults with non-zero resistance.",
                    "Automating test program generation in STIL - expectations and experiences using IEEE 1450 [standard test interface language].",
                    "Automatic worst case pattern generation using neural networks & genetic algorithm for estimation of switching noise on power supply lines in CMOS circuits.",
                    "Code generation for functional validation of pipelined microprocessors.",
                    "Enhanced P1500 compliant wrapper suitable for delay fault testing of embedded cores.",
                    "RF ATE equipment benefit from advanced network analyzer technology.",
                    "Characterization of the EME of integrated circuits with the help of the IEC standard 61967 [electromagnetic emission].",
                    "On path selection for delay fault testing considering operating conditions [logic IC testing].",
                    "Requirements for delay testing of look-up tables in SRAM-based FPGAs.",
                    "Debug architecture for system on chip taking full advantage of the test access port."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "7th ETW 2002",
        "info": "Corfu, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2002",
                "sub_name": "7th European Test Workshop, ETW 2002, Corfu, Greece, May 26-29, 2002.",
                "count": 17,
                "papers": [
                    "Silicon technology advances and implications on test.",
                    "A novel test time reduction algorithm for test architecture design for core-based system chips.",
                    "Modeling gate oxide short defects in CMOS minimum transistors.",
                    "ATPG for timing-induced functional errors on trigger events in hardware-software systems.",
                    "Dependable testing of compactor MISR: an imperceptible problem?",
                    "RESPIN++ - deterministic embedded test.",
                    "Novel ATPG algorithms for transition faults.",
                    "On selecting testable paths in scan designs.",
                    "Data invalidation analysis for scan-based debug on multiple-clock system chips.",
                    "System level testing of virtual switch (re-)configuration over IP.",
                    "Simulating realistic bridging and crosstalk faults in an industrial setting.",
                    "A real world application used to implement a true IDDQ based test strategy (facts and figures).",
                    "A high accuracy triangle-wave signal generator for on-chip ADC testing.",
                    "Investigations for minimum invasion digital only built-in \"ramp\" based test techniques for charge pump PLL's.",
                    "Combining deterministic logic BIST with test point insertion.",
                    "Dynamic test data transformations for average and peak power reductions.",
                    "Power constrained preemptive TAM scheduling."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "6th ETW 2001",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2001",
                "sub_name": "6th European Test Workshop, ETW 2001, Stockholm, Sweden, May 29 - June 1, 2001.",
                "count": 18,
                "papers": [
                    "Analyzing bridging faults impact on EEPROM cell array.",
                    "Internal feedback bridging faults in combinational CMOS circuits: analysis and testing.",
                    "System-level DFT for consumer products.",
                    "A fault model for function and delay testing.",
                    "Reducing the susceptibility of design-for-delay-testability structures to process- and application-induced variations.",
                    "Demodulation based testing of off-chip driver performance.",
                    "Automated regression testing of CTI-systems.",
                    "Reducing analogue fault-simulation time by using high-level modelling in dotss for an industrial design.",
                    "On-chip signal level evaluation for mixed-signal ICs using digital window comparators.",
                    "The use of equivalent fault analysis to improve static D.C. fault diagnosis - a potentiometric DAC case study.",
                    "A packet switching communication-based test access mechanism for system chips.",
                    "System level diagnosis - a comparison of two alternative approaches.",
                    "RTL design validation, DFT and test pattern generation for high defects coverage.",
                    "An implementation for test-time reduction in VLIW transport-triggered architectures.",
                    "On hardware generation of random single input change test sequences.",
                    "Reusing scan chains for test pattern decompression.",
                    "A VHDL-based virtual test concept for pre-silicon test-program debug.",
                    "Using at-speed BIST to test LVDS serializer/deserializer function."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "5th ETW 2000",
        "info": "Cascais, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/2000",
                "sub_name": "5th European Test Workshop, ETW 2000, Cascais, Portugal, May 23-26, 2000.",
                "count": 25,
                "papers": [
                    "Bridging the testing speed gap: design for delay testability.",
                    "Delay fault testing: choosing between random SIC and random MIC test sequences.",
                    "Microprocessor cores.",
                    "System-level test bench generation in a co-design framework.",
                    "LEAP: An accurate defect-free IDDQ estimator.",
                    "Defect detection from visual abnormalities in manufacturing process using IDDQ.",
                    "Static and dynamic on-chip test response evaluation using a two-mode comparator.",
                    "Towards an ADC BIST scheme using the histogram test technique.",
                    "A parameterizable fault simulator for bridging faults.",
                    "Hierarchical defect-oriented fault simulation for digital circuits.",
                    "Analyzing the test generation problem for an application-oriented test of FPGAs.",
                    "Test challenges in nanometer technologies.",
                    "Current testing procedure for deep submicron devices.",
                    "RTL-based functional test generation for high defects coverage in digital SOCs.",
                    "Combining symbolic and genetic techniques for efficient sequential circuit test generation.",
                    "How to avoid random walks in hierarchical test path identification.",
                    "An effective distributed BIST architecture for RAMs.",
                    "Compressed bit fail maps for memory fail pattern classification.",
                    "A method for trading off test time, area and fault coverage in datapath BIST synthesis.",
                    "Low cost concurrent test implementation for linear digital systems.",
                    "On the use of multiple fault detection times in a method for built-in test pattern generation for synchronous sequential circuits.",
                    "A system level boundary scan controller board for VME applications [to CERN experiments].",
                    "Fast and low-area TPGs based on T-type flip-flops can be easily integrated to the scan path.",
                    "CA-CSTP: a new BIST architecture for sequential circuits.",
                    "Comparison of defect detection capabilities of current-based and voltage-based test methods."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "4th ETW 1999",
        "info": "Constance, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ets/1999",
                "sub_name": "4th European Test Workshop, ETW 1999, Constance, Germany, May 25-28, 1999.",
                "count": 27,
                "papers": [
                    "A high-level EDA environment for the automatic insertion of HD-BIST structures.",
                    "On calculating efficient LFSR seeds for built-in self test.",
                    "On random pattern testability of cryptographic VLSI cores.",
                    "Functional and structural testing of switched-current circuits.",
                    "Practical implementation of defect-oriented testing for a mixed-signal class-D amplifier.",
                    "A new approach for the nonlinearity test of ADCs/DACs and its application for BIST.",
                    "Compaction of IDDQ test sequence using reassignment method.",
                    "Experimental results on BIC sensors for transient current testing.",
                    "Application of supply current testing to analogue circuits, towards a structural analogue test methodology.",
                    "A DFT for semi-DC fault diagnosis for switched-capacitor circuits.",
                    "Extending fault-based testing to microelectromechanical systems.",
                    "The role of test protocols in testing embedded-core-based system ICs.",
                    "Debug facilities in the TriMedia CPU64 architecture.",
                    "High-level path activation technique to speed up sequential circuit test generation.",
                    "On avoiding undetectable faults during test generation.",
                    "A scalable BIST architecture for delay faults.",
                    "Partial set for flip-flops based on state requirement for non-scan BIST scheme.",
                    "Deterministic BIST with partial scan.",
                    "On the fault-injection-caused increase of the DAE-index in analogue fault simulation.",
                    "On maximizing the coverage of catastrophic and parametric faults.",
                    "Using the BS register for capturing and storing n-bit sequences in real-time.",
                    "From system level to defect-oriented test: a case study.",
                    "Cost effective testing of systems on silicon: areas for optimization.",
                    "Test configuration minimization for the logic cells of SRAM-based FPGAs: a case study.",
                    "Design of an automatic testing for FPGAs.",
                    "A new BIST architecture for low power circuits.",
                    "Low power BIST by filtering non-detecting vectors."
                ]
            }
        ]
    }
]