[
    {
        "year": "2021",
        "name": "EuroSys 2021",
        "info": "Virtual Event, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2021",
                "sub_name": "EuroSys '21: Sixteenth European Conference on Computer Systems, Online Event, United Kingdom, April 26-28, 2021.",
                "count": 38,
                "papers": [
                    "SmartHarvest: harvesting idle CPUs safely and efficiently in the cloud.",
                    "Tripoline: generalized incremental graph processing via graph triangle inequality.",
                    "Towards timeout-less transport in commodity datacenter networks.",
                    "PaSh: light-touch data-parallel shell processing.",
                    "FlexGraph: a flexible and efficient distributed framework for GNN training.",
                    "DZiG: sparsity-aware incremental processing of streaming graphs.",
                    "Ethanos: efficient bootstrapping for full nodes on account-based blockchain.",
                    "Virtual machine preserving host updates for zero day patching in public cloud.",
                    "DGCL: an efficient communication library for distributed GNN training.",
                    "Zeus: locality-aware distributed transactions.",
                    "Mitigating vulnerability windows with hypervisor transplant.",
                    "Efficient replication via timestamp stability.",
                    "ChameleonDB: a key-value store for optane persistent memory.",
                    "Achieving low tail-latency and high scalability for serializable transactions in edge computing.",
                    "OFC: an opportunistic caching system for FaaS platforms.",
                    "Odyssey: the impact of modern hardware on strongly-consistent replication protocols.",
                    "Parallelizing packet processing in container overlay networks.",
                    "Memory-mapped I/O on steroids.",
                    "Confidential computing for OpenPOWER.",
                    "Accelerating graph sampling for graph machine learning using GPUs.",
                    "RubberBand: cloud-based hyperparameter tuning.",
                    "Bridging the performance gap for copy-based garbage collectors atop non-volatile memory.",
                    "Seastar: vertex-centric programming for graph neural networks.",
                    "Unikraft: fast, specialized unikernels the easy way.",
                    "Characterizing, exploiting, and detecting DMA code injection vulnerabilities in the presence of an IOMMU.",
                    "Finding heterogeneous-unsafe configuration parameters in cloud systems.",
                    "Tahoe: tree structure-aware high performance inference engine for decision tree ensemble on GPU.",
                    "Understanding and dealing with hard faults in persistent memory systems.",
                    "Tesseract: distributed, general graph pattern mining on evolving graphs.",
                    "Profiling dataflow systems on multiple abstraction levels.",
                    "rkt-io: a direct I/O stack for shielded execution.",
                    "M3: end-to-end memory management in elastic system software stacks.",
                    "REBOUND: defending distributed systems against attacks with bounded-time recovery.",
                    "On-demand-fork: a microsecond fork for memory-intensive and latency-sensitive applications.",
                    "Take it to the limit: peak prediction-driven resource overcommitment in datacenters.",
                    "Site-to-site internet traffic control.",
                    "Home, safehome: smart home reliability with visibility and atomicity.",
                    "TraceSplitter: a new paradigm for downscaling traces."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "EuroSys 2020",
        "info": "Heraklion, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2020",
                "sub_name": "EuroSys '20: Fifteenth EuroSys Conference 2020, Heraklion, Greece, April 27-30, 2020.",
                "count": 43,
                "papers": [
                    "Balancing efficiency and fairness in heterogeneous GPU clusters for deep learning.",
                    "Experiences of landing machine learning onto market-scale mobile malware detection.",
                    "Provable multicore schedulers with Ipanema: application to work conservation.",
                    "Delegation sketch: a parallel design with support for fast and accurate concurrent operations.",
                    "Persistent memory and the rise of universal constructions.",
                    "Design of a symbolically executable embedded hypervisor.",
                    "Autarky: closing controlled channels with self-paging enclaves.",
                    "Scalable range locks for scalable address spaces and beyond.",
                    "Avoiding scheduler subversion using scheduler-cooperative locks.",
                    "Statically inferring performance properties of software configurations.",
                    "A Linux in unikernel clothing.",
                    "Subway: minimizing data transfer during out-of-GPU-memory graph processing.",
                    "Peregrine: a pattern-aware graph mining system.",
                    "Can far memory improve job throughput?",
                    "A fault-tolerance shim for serverless computing.",
                    "Autopilot: workload autoscaling at Google.",
                    "Meerkat: multicore-scalable replicated transactions following the zero-coordination principle.",
                    "MPTEE: bringing flexible and efficient memory protection to Intel SGX.",
                    "Rhythm: component-distinguishable workload deployment in datacenters.",
                    "Improving resource utilization by timely fine-grained scheduling.",
                    "AniFilter: parallel and failure-atomic cuckoo filter for non-volatile memories.",
                    "Balancing storage efficiency and data confidentiality with tunable encrypted deduplication.",
                    "Kollaps: decentralized and dynamic topology emulation.",
                    "State-machine replication for planet-scale systems.",
                    "HovercRaft: achieving scalability and fault-tolerance for microsecond-scale datacenter services.",
                    "RAIDP: replication with intra-disk parity.",
                    "EvenDB: optimizing key-value storage for spatial locality.",
                    "Accessible near-storage computing with FPGAs.",
                    "StRoM: smart remote memory.",
                    "Borg: the next generation.",
                    "AlloX: compute allocation in hybrid clusters.",
                    "SEUSS: skip redundant paths to make serverless fast.",
                    "CSI: inferring mobile ABR video adaptation behavior under HTTPS and QUIC.",
                    "Mousse: a system for selective symbolic execution of programs with untamed environments.",
                    "Don't shoot down TLB shootdowns!",
                    "BinRec: dynamic binary lifting and recompilation.",
                    "An HTM-based update-side synchronization for RCU on NUMA systems.",
                    "Keystone: an open framework for architecting trusted execution environments.",
                    "Oblivious coopetitive analytics using hardware enclaves.",
                    "Accelerating winograd convolutions using symbolic computation and meta-programming.",
                    "Env2Vec: accelerating VNF testing with deep learning.",
                    "PLASMA: programmable elasticity for stateful cloud computing applications.",
                    "Analyzing system performance with probabilistic performance annotations."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "EuroSys 2019",
        "info": "Dresden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2019",
                "sub_name": "Proceedings of the Fourteenth EuroSys Conference 2019, Dresden, Germany, March 25-28, 2019.",
                "count": 45,
                "papers": [
                    "Time Protection: The Missing OS Abstraction.",
                    "Why Joanie Can Encrypt: Easy Email Encryption with Easy Key Management.",
                    "Conclave: secure multi-party computation on big data.",
                    "ConfLLVM: A Compiler for Enforcing Data Confidentiality in Low-Level Code.",
                    "Per-Application Power Delivery.",
                    "AnDrone: Virtual Drone Computing in the Cloud.",
                    "When eXtended Para - Virtualization (XPV) Meets NUMA.",
                    "Make the Most out of Last Level Cache in Intel Processors.",
                    "SkyBridge: Fast and Secure Inter-Process Communication for Microkernels.",
                    "CoPart: Coordinated Partitioning of Last-Level Cache and Memory Bandwidth for Fairness-Aware Workload Consolidation on Commodity Servers.",
                    "LockDoc: Trace-Based Analysis of Locking in the Linux Kernel.",
                    "Compact NUMA-aware Locks.",
                    "Project Almanac: A Time-Traveling Solid-State Drive.",
                    "ShieldStore: Shielded In-memory Key-value Storage with SGX.",
                    "URSA: Hybrid Block Storage for Cloud-Scale Virtual Disks.",
                    "VStore: A Data Store for Analytics on Large Videos.",
                    "Managing Tail Latency in Datacenter-Scale File Systems Under Production Constraints.",
                    "Wormhole: A Fast Ordered Index for In-memory Data Management.",
                    "Scalable RDMA RPC on Reliable Connection with Efficient Resource Sharing.",
                    "FlyMC: Highly Scalable Testing of Complex Interleavings in Distributed Systems.",
                    "The Case For In-Network Computing On Demand.",
                    "I Sent It: Where Does Slow Data Go to Wait?",
                    "Efficient and Safe Network Updates with Suffix Causal Consistency.",
                    "TAS: TCP Acceleration as an OS Service.",
                    "GraphBolt: Dependency-Driven Synchronous Processing of Streaming Graphs.",
                    "Supporting Very Large Models using Automatic Dataflow Graph Partitioning.",
                    "Matrix Algebra Framework for Portable, Scalable and Efficient Query Engines for RDF Graphs.",
                    "Runtime Object Lifetime Profiler for Latency Sensitive Big Data Applications.",
                    "Keeping Master Green at Scale.",
                    "Serving Mobile Apps: A Slice at a Time.",
                    "A Lightweight Framework for Fine-Grained Lifecycle Control of Android Applications.",
                    "Teaching Rigorous Distributed Systems With Efficient Model Checking.",
                    "Resource Deflation: A New Approach For Transient Resource Reclamation.",
                    "GrandSLAm: Guaranteeing SLAs for Jobs in Microservices Execution Frameworks.",
                    "Hourglass: Leveraging Transient Resources for Time-Constrained Graph Processing in the Cloud.",
                    "Efficient, Consistent Distributed Computation with Predictive Treaties.",
                    "Multiverse: Compiler-Assisted Management of Dynamic Variability in Low-Level System Software.",
                    "Grapple: A Graph System for Static Finite-State Property Checking of Large-Scale Systems Code.",
                    "Replayable Execution Optimized for Page Sharing for a Managed Runtime Environment.",
                    "Deferred Runtime Pipelining for contentious multicore software transactions.",
                    "GRNN: Low-Latency and Scalable RNN Inference on GPUs.",
                    "Automating Dependence-Aware Parallelization of Machine Learning Training on Distributed Shared Memory.",
                    "Parallax: Sparsity-aware Data Parallel Training of Deep Neural Networks.",
                    "Fast Distributed Deep Learning over RDMA.",
                    "μLayer: Low Latency On-Device Inference Using Cooperative Single-Layer Acceleration and Processor-Friendly Quantization."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "EuroSys 2018",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2018",
                "sub_name": "Proceedings of the Thirteenth EuroSys Conference, EuroSys 2018, Porto, Portugal, April 23-26, 2018.",
                "count": 43,
                "papers": [
                    "Decoupling the control plane from program control flow for flexibility and performance in cloud computing.",
                    "3Sigma: distribution-based cluster scheduling for runtime uncertainty.",
                    "Optimus: an efficient dynamic resource scheduler for deep learning clusters.",
                    "Medea: scheduling of long running applications in shared production clusters.",
                    "Scrub: online troubleshooting for large mission-critical applications.",
                    "Hang doctor: runtime detection and diagnosis of soft hangs for smartphone apps.",
                    "Pcatch: automatically detecting performance cascading bugs in cloud systems.",
                    "Universal context propagation for distributed system instrumentation.",
                    "DumbNet: a smart data center network fabric with dumb switches.",
                    "BDS: a centralized near-optimal overlay network for inter-datacenter data replication.",
                    "Turboflow: information rich flow record generation on commodity switches.",
                    "Wide-area analytics with multiple resources.",
                    "DCAPS: dynamic cache allocation with partial sharing.",
                    "dCat: dynamic cache management for efficient, performance-sensitive infrastructure-as-a-service.",
                    "Flashabacus: a self-governing flash-based accelerator for low-power systems.",
                    "Welcome to zombieland: practical and energy-efficient memory disaggregation in a datacenter.",
                    "Analytics with smart arrays: adaptive and efficient language-independent data.",
                    "Dynamic control flow in large-scale machine learning.",
                    "Improving the expressiveness of deep learning frameworks with recursion.",
                    "Rock you like a hurricane: taming skew in large scale analytics.",
                    "Scale-out ccNUMA: exploiting skew with strongly consistent caching.",
                    "Delta pointers: buffer overflow checks without the checks.",
                    "MultiNyx: a multi-level abstraction framework for systematic analysis of hypervisors.",
                    "LibSEAL: revealing service integrity violations using trusted execution.",
                    "Pesos: policy enhanced secure object store.",
                    "Scheduling-context capabilities: a principled, light-weight operating-system mechanism for managing time.",
                    "RTVirt: enabling time-sensitive computing on virtualized systems through cross-layer CPU scheduling.",
                    "Tableau: a high-throughput and predictable VM scheduler for high-density workloads.",
                    "Accelerating critical OS services in virtualized systems with flexible micro-sliced cores.",
                    "Hyperledger fabric: a distributed operating system for permissioned blockchains.",
                    "Low latency RNN inference with cellular batching.",
                    "G-Miner: an efficient task-oriented graph mining system.",
                    "Service fabric: a distributed platform for building microservices in the cloud.",
                    "A scalable ordering primitive for multicore machines.",
                    "Characterizing and optimizing hotspot parallel garbage collection on multicore systems.",
                    "Solros: a data-centric operating system architecture for heterogeneous computing.",
                    "Power sandbox: power awareness redefined.",
                    "Model-driven computational sprinting.",
                    "Fast and strongly-consistent per-item resilience in key-value stores.",
                    "Popular is cheaper: curtailing memory costs in interactive analytics engines.",
                    "A frugal approach to reduce RCU grace period overhead.",
                    "Reducing DRAM footprint with NVM in facebook.",
                    "Riffle: optimized shuffle service for large-scale data analytics."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "EuroSys 2017",
        "info": "Belgrade, Serbia",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2017",
                "sub_name": "Proceedings of the Twelfth European Conference on Computer Systems, EuroSys 2017, Belgrade, Serbia, April 23-26, 2017.",
                "count": 41,
                "papers": [
                    "RFP: When RPC is Faster than Server-Bypass with RDMA.",
                    "Direct Inter-Process Communication (dIPC): Repurposing the CODOMs Architecture to Accelerate IPC.",
                    "COCONUT: Seamless Scale-out of Network Elements.",
                    "Design and Evaluation of an RDMA-aware Data Shuffling Operator for Parallel Database Systems.",
                    "Statistical Analysis of Latency Through Semantic Profiling.",
                    "FloDB: Unlocking Memory in Persistent Key-Value Stores.",
                    "Rein: Taming Tail Latency in Key-Value Stores via Multiget Scheduling.",
                    "Saturn: a Distributed Metadata Service for Causal Consistency.",
                    "The Unwritten Contract of Solid State Drives.",
                    "Node.fz: Fuzzing the Server-Side Event-Driven Architecture.",
                    "ROS: A Rack-based Optical Storage System with Inline Accessibility for Long-Term Data Preservation.",
                    "Malacology: A Programmable Storage System.",
                    "MiniCrypt: Reconciling Encryption and Compression for Big Data Stores.",
                    "SGXBOUNDS: Memory Safety for Shielded Execution.",
                    "Hybrids on Steroids: SGX-Based High Performance BFT.",
                    "Eleos: ExitLess OS Services for SGX Enclaves.",
                    "Pandia: comprehensive contention-sensitive thread placement.",
                    "Taming Parallelism in a Multi-Variant Execution Environment.",
                    "The lock holder and the lock waiter pre-emption problems: nip them in the bud using informed spinlocks (I-Spinlock).",
                    "SyncPerf: Categorizing, Detecting, and Diagnosing Synchronization Performance Bugs.",
                    "Malthusian Locks.",
                    "An Empirical Study on the Correctness of Formally Verified Distributed Systems.",
                    "Online Reconstruction of Structural Information from Datacenter Logs.",
                    "GfxDoctor: A Holistic Graphics Energy Profiler for Mobile Devices.",
                    "One Primitive to Diagnose Them All: Architectural Support for Internet Diagnostics.",
                    "A Characterization of State Spill in Modern Operating Systems.",
                    "DangSan: Scalable Use-after-free Detection.",
                    "kR^X: Comprehensive Kernel Protection against Just-In-Time Code Reuse.",
                    "No Need to Hide: Protecting Safe Regions on Commodity Hardware.",
                    "An interface to implement NUMA policies in the Xen hypervisor.",
                    "NVthreads: Practical Persistence for Multi-threaded Applications.",
                    "Forkscan: Conservative Memory Reclamation for Modern Operating Systems.",
                    "Atomic In-place Updates for Non-volatile Main Memories with Kamino-Tx.",
                    "High-Throughput Subset Matching on Commodity GPU-Based Systems.",
                    "Mosaic: Processing a Trillion-Edge Graph on a Single Machine.",
                    "Abstracting Multi-Core Topologies with MCTOP.",
                    "DStress: Efficient Differentially Private Computations on Distributed Data.",
                    "Pado: A Data Processing Engine for Harnessing Transient Resources in Datacenters.",
                    "Proteus: agile ML elasticity through tiered reliability in dynamic resource markets.",
                    "CloudTalk: Enabling Distributed Application Optimisations in Public Clouds.",
                    "Exploiting Spot and Burstable Instances for Improving the Cost-efficacy of In-Memory Caches on the Public Cloud."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "EuroSys 2016",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2016",
                "sub_name": "Proceedings of the Eleventh European Conference on Computer Systems, EuroSys 2016, London, United Kingdom, April 18-21, 2016.",
                "count": 38,
                "papers": [
                    "The Linux scheduler: a decade of wasted cores.",
                    "vScale: automatic and efficient processor scaling for SMP virtual machines.",
                    "Application-specific quantum for multi-core platform scheduler.",
                    "GeePS: scalable deep learning on distributed GPUs with a GPU-specialized parameter server.",
                    "STRADS: a distributed framework for scheduled model parallel machine learning.",
                    "Flint: batch-interactive data-intensive processing on transient servers.",
                    "Hold 'em or fold 'em?: aggregation queries under performance variations.",
                    "Increasing large-scale data center capacity by statistical power control.",
                    "Exploiting variability for energy optimization of parallel programs.",
                    "Oasis: energy proportionality with hybrid server consolidation.",
                    "Crayon: saving power through shape and color approximation on next-generation displays.",
                    "A high performance file system for non-volatile main memory.",
                    "pVM: persistent virtual memory for efficient capacity scaling and object storage.",
                    "zExpander: a key-value cache with both high performance and fewer misses.",
                    "Data tiering in heterogeneous memory systems.",
                    "A study of modern Linux API usage and compatibility: what to support when you're supporting.",
                    "BB: booting booster for consumer electronics with modern OS.",
                    "Shared address translation revisited.",
                    "POSIX abstractions in modern operating systems: the old, the new, and the missing.",
                    "Juggler: a practical reordering resilient network stack for datacenters.",
                    "Yoda: a highly available layer-7 load balancer.",
                    "NChecker: saving mobile app developers from network disruptions.",
                    "TFC: token flow control in data center networks.",
                    "On the capacity of thermal covert channels in multicores.",
                    "HAFT: hardware-assisted fault tolerance.",
                    "Fast and general distributed transactions using RDMA and HTM.",
                    "Sinter: low-bandwidth remote access for the visually-impaired.",
                    "PSLO: enforcing the Xth percentile latency and throughput SLOs for consolidated VM storage.",
                    "Flash storage disaggregation.",
                    "Partial-parallel-repair (PPR): a distributed technique for repairing erasure coded storage.",
                    "Type-aware transactions for faster concurrent code.",
                    "Practical condition synchronization for transactional memory.",
                    "Parallel sections: scaling system-level data-structures.",
                    "Hardware read-write lock elision.",
                    "TetriSched: global rescheduling with adaptive plan-ahead in dynamic heterogeneous clusters.",
                    "Efficient queue management for cluster scheduling.",
                    "Picocenter: supporting long-lived, mostly-idle applications in cloud environments.",
                    "Optimizing distributed actor systems for dynamic interactive services."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "EuroSys 2015",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2015",
                "sub_name": "Proceedings of the Tenth European Conference on Computer Systems, EuroSys 2015, Bordeaux, France, April 21-24, 2015.",
                "count": 32,
                "papers": [
                    "PowerLyra: differentiated graph computation and partitioning on skewed graphs.",
                    "Musketeer: all for one, one for all in data processing systems.",
                    "MALT: distributed data-parallelism for existing ML applications.",
                    "An in-memory object caching framework with adaptive load balancing.",
                    "GD-Wheel: a cost-aware replacement policy for key-value stores.",
                    "Putting consistency back into eventual consistency.",
                    "Simba: tunable end-to-end data consistency for mobile apps.",
                    "Visigoth fault tolerance.",
                    "Taming uncertainty in distributed systems with help from the network.",
                    "Extensible distributed coordination.",
                    "Deriving and comparing deduplication techniques using a model-based classification.",
                    "An efficient page-level FTL to optimize address translation in flash memory.",
                    "Guardat: enforcing data policies at the storage layer.",
                    "Process-level power estimation in VM-based systems.",
                    "Application-assisted live migration of virtual machines with Java applications.",
                    "SpotCheck: designing a derivative IaaS cloud on the spot market.",
                    "CYRUS: towards client-defined cloud storage.",
                    "Large-scale cluster management at Google with Borg.",
                    "ConfValley: a systematic configuration validation framework for cloud services.",
                    "Guaranteeing deadlines for inter-datacenter transfers.",
                    "Synapse: a microservices architecture for heterogeneous-database web applications.",
                    "NBA (network balancing act): a high-performance packet processing framework for heterogeneous processors.",
                    "In-Net: in-network processing for the masses.",
                    "Flux: multi-surface computing in Android.",
                    "μPnP: plug and play peripherals for the internet of things.",
                    "Maxoid: transparently confining mobile applications with custom views of state.",
                    "TinMan: eliminating confidential mobile data exposure with security oriented offloading.",
                    "Verifiable differential privacy.",
                    "Popcorn: bridging the programmability gap in heterogeneous-ISA platforms.",
                    "Hare: a file system for non-cache-coherent multicores.",
                    "High-performance determinism with total store order consistency.",
                    "Scaling concurrent log-structured data stores."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "EuroSys 2014",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2014",
                "sub_name": "Ninth Eurosys Conference 2014, EuroSys 2014, Amsterdam, The Netherlands, April 13-16, 2014.",
                "count": 27,
                "papers": [
                    "Chronos: a graph engine for temporal graph analysis.",
                    "DynMR: dynamic MapReduce with ReduceTask interleaving and MapTask backfilling.",
                    "Kronos: the design and implementation of an event ordering service.",
                    "Reconciling high server utilization and sub-millisecond quality-of-service.",
                    "WCMP: weighted cost multipathing for improved fairness in data centers.",
                    "DIBS: just-in-time congestion mitigation for data centers.",
                    "TAQ: enhancing fairness and performance predictability in small packet regimes.",
                    "Practical techniques to obviate setuid-to-root binaries.",
                    "Cooperation and security isolation of library OSes for multi-process applications.",
                    "TrustLite: a security architecture for tiny embedded devices.",
                    "Rex: replication at the speed of multi-core.",
                    "Relational access to Unix kernel data structures.",
                    "Caching in video CDNs: building strong lines of defense.",
                    "Aerie: flexible file-system interfaces to storage-class memory.",
                    "System software for persistent memory.",
                    "An efficient design and implementation of LSM-tree based key-value store on open-channel SSD.",
                    "From application requests to virtual IOPs: provisioned key-value storage with Libra.",
                    "Efficiently, effectively detecting mobile app bugs with AppDoctor.",
                    "TESLA: temporally enhanced system logic assertions.",
                    "T-Rex: a dynamic race detection tool for C/C++ transactional memory applications.",
                    "Archiving cold data in warehouses with clustered network coding.",
                    "An aggressive worn-out flash block management scheme to alleviate SSD performance degradation.",
                    "Snapshots in a flash with ioSnap.",
                    "Callisto: co-scheduling parallel runtime systems.",
                    "StackTrack: an automated transactional approach to concurrent memory reclamation.",
                    "Using restricted transactional memory to build a scalable in-memory database.",
                    "Algorithmic improvements for fast concurrent Cuckoo hashing."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "EuroSys 2013",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2013",
                "sub_name": "Eighth Eurosys Conference 2013, EuroSys '13, Prague, Czech Republic, April 14-17, 2013.",
                "count": 28,
                "papers": [
                    "TimeStream: reliable stream computation in the cloud.",
                    "Optimus: a dynamic rewriting framework for data-parallel execution plans.",
                    "BlinkDB: queries with bounded errors and bounded response times on very large data.",
                    "IFDB: decentralized information flow control for databases.",
                    "Process firewalls: protecting processes during resource access.",
                    "Resolving the conflict between generality and plausibility in verified computation.",
                    "ChainReaction: a causal+ consistent datastore based on chain replication.",
                    "Augustus: scalable and robust storage for cloud applications.",
                    "MDCC: multi-data center consistency.",
                    "Conversion: multi-version concurrency control for main memory segments.",
                    "Whose cache line is it anyway?: operating system support for live detection and repair of false sharing.",
                    "Adaptive parallelism for web search.",
                    "Mizan: a system for dynamic load balancing in large-scale graph processing.",
                    "MeT: workload aware elasticity for NoSQL.",
                    "Presto: distributed machine learning and graph processing with sparse matrices.",
                    "RadixVM: scalable address spaces for multithreaded applications.",
                    "Failure-atomic msync(): a simple and efficient mechanism for preserving the integrity of durable data.",
                    "Composing OS extensions safely and efficiently with Bascule.",
                    "Hypnos: understanding and treating sleep conflicts in smartphones.",
                    "Prefetching mobile ads: can advertising systems afford it?",
                    "Maygh: building a CDN from client web browsers.",
                    "A compiler-level intermediate representation based binary analysis and rewriting system.",
                    "hClock: hierarchical QoS for packet scheduling in a hypervisor.",
                    "RapiLog: reducing system complexity through verification.",
                    "Application level ballooning for efficient server consolidation.",
                    "Omega: flexible, scalable schedulers for large compute clusters.",
                    "Choosy: max-min fair sharing for datacenter jobs with constraints.",
                    "CPI2: CPU performance isolation for shared compute clusters."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "EuroSys 2012",
        "info": "Bern, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2012",
                "sub_name": "European Conference on Computer Systems, Proceedings of the Seventh EuroSys Conference 2012, EuroSys '12, Bern, Switzerland, April 10-13, 2012.",
                "count": 27,
                "papers": [
                    "STM in the small: trading generality for performance in software transactional memory.",
                    "Improving server applications with system transactions.",
                    "Where is the energy spent inside my app?: fine grained energy accounting on smartphones with Eprof.",
                    "Energy efficiency for large-scale MapReduce workloads with significant interactive analysis.",
                    "GreenHadoop: leveraging green energy in data-processing frameworks.",
                    "Frugal storage for cloud file systems.",
                    "Kineograph: taking the pulse of a fast-changing and connected world.",
                    "Jockey: guaranteed job latency in data parallel clusters.",
                    "The Xen-Blanket: virtualize once, run everywhere.",
                    "Isolating commodity hosted hypervisors with HyperLock.",
                    "Delusional boot: securing hypervisors without massive re-engineering.",
                    "A critique of snapshot isolation.",
                    "LazyBase: trading freshness for performance in a scalable database.",
                    "Cache craftiness for fast multicore key-value storage.",
                    "MadLINQ: large-scale distributed matrix computation for the cloud.",
                    "Jettison: efficient idle desktop consolidation with partial VM migration.",
                    "Practical TDMA for datacenter ethernet.",
                    "Scalable testing of file system checkers.",
                    "Delta-FTL: improving SSD lifetime via exploiting content locality.",
                    "FlashTier: a lightweight, consistent and durable storage cache.",
                    "Fast black-box testing of system recovery code.",
                    "CheapBFT: resource-efficient byzantine fault tolerance.",
                    "Canal: scaling social network-based Sybil tolerance schemes.",
                    "Improving interrupt response time in a verifiable protected microkernel.",
                    "Improving network connection locality on multicore systems.",
                    "TM2C: a software transactional memory for many-cores.",
                    "BWS: balanced work stealing for time-sharing multicores."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "EuroSys 2011",
        "info": "Salzburg, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2011",
                "sub_name": "European Conference on Computer Systems, Proceedings of the Sixth European conference on Computer systems, EuroSys 2011, Salzburg, Austria, April 10-13, 2011.",
                "count": 24,
                "papers": [
                    "Keypad: an auditing file system for theft-prone devices.",
                    "Database engines on multicores, why parallelize when you can distribute?",
                    "DepSky: dependable and secure storage in a cloud-of-clouds.",
                    "Feature consistency in compile-time-configurable system software: facing the linux 10, 000 feature problem.",
                    "A case for scaling applications to many-core with OS clustering.",
                    "Refuse to crash with Re-FUSE.",
                    "Increasing performance in byzantine fault-tolerant systems with on-demand replica consistency.",
                    "Efficient middleware for byzantine fault tolerant database replication.",
                    "ZZ and the art of practical BFT execution.",
                    "Energy management in mobile devices with the cinder operating system.",
                    "Fine-grained power modeling for smartphones using system call tracing.",
                    "Sierra: practical power-proportionality for data center storage.",
                    "Parallel symbolic execution for automated real-world software testing.",
                    "Striking a new balance between program instrumentation and debugging time.",
                    "Finding complex concurrency bugs in large multi-threaded applications.",
                    "Operating system support for application-specific speculation.",
                    "SRM-buffer: an OS buffer management technique to prevent last level cache from thrashing in multicores.",
                    "Is co-scheduling too expensive for SMP VMs?",
                    "Kaleidoscope: cloud micro-elasticity via VM state coloring.",
                    "Scarlett: coping with skewed content popularity in mapreduce clusters.",
                    "CloneCloud: elastic execution between mobile device and cloud.",
                    "Symbolic crosschecking of floating-point and SIMD code.",
                    "Scheduling large jobs by abstraction refinement.",
                    "Cycles, cells and platters: an empirical analysisof hardware failures on a million consumer PCs."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "EuroSys 2010",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2010",
                "sub_name": "European Conference on Computer Systems, Proceedings of the 5th European conference on Computer systems, EuroSys 2010, Paris, France, April 13-16, 2010.",
                "count": 27,
                "papers": [
                    "Using transparent compression to improve SSD-based I/O caches.",
                    "Differential RAID: rethinking RAID for SSD reliability.",
                    "Evaluation of AMD's advanced synchronization facility within a complete transactional memory stack.",
                    "Transactional memory support for scalable and transparent parallelization of multiplayer games.",
                    "Self-tuning schedulers for legacy real-time applications.",
                    "High-level programming of embedded hard real-time devices.",
                    "Barricade: defending systems against operator mistakes.",
                    "Splitter: a proxy-based approach for post-migration testing of web applications.",
                    "Fingerprinting the datacenter: automated classification of performance crises.",
                    "Bias scheduling in heterogeneous multi-core architectures.",
                    "A comprehensive scheduler for asymmetric multicore systems.",
                    "Resource-conscious scheduling for energy efficiency on multicore processors.",
                    "Reverse engineering of binary device drivers with RevNIC.",
                    "Otherworld: giving applications a chance to survive OS kernel crashes.",
                    "Defeating return-oriented rootkits with \"Return-Less\" kernels.",
                    "NOVA: a microhypervisor-based secure virtualization architecture.",
                    "Boom analytics: exploring data-centric, declarative programming for the cloud.",
                    "Q-clouds: managing performance interference effects for QoS-aware clouds.",
                    "HadoopToSQL: a mapReduce query optimizer.",
                    "Delay scheduling: a simple technique for achieving locality and fairness in cluster scheduling.",
                    "Residue objects: a challenge to web browser security.",
                    "Policy-based access control for weakly consistent replication.",
                    "Kivati: fast detection and prevention of atomicity violations.",
                    "Execution synthesis: a technique for automated software debugging.",
                    "Locating cache performance bottlenecks using data profiling.",
                    "Dr. multicast: Rx for data center communication scalability.",
                    "The next 700 BFT protocols."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "EuroSys 2009",
        "info": "Nuremberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2009",
                "sub_name": "Proceedings of the 2009 EuroSys Conference, Nuremberg, Germany, April 1-3, 2009.",
                "count": 25,
                "papers": [
                    "SnowFlock: rapid virtual machine cloning for cloud computing.",
                    "Automated control of multiple virtualized resources.",
                    "Improving the responsiveness of internet services with automatic cache placement.",
                    "Orchestra: intrusion detection using parallel execution and monitoring of program variants in user-space.",
                    "Multi-aspect profiling of kernel rootkit behavior.",
                    "Pointless tainting?: evaluating the practicality of pointer tainting.",
                    "Memory resource allocation for file system prefetching: from a supply chain management perspective.",
                    "Towards practical page coloring-based multicore cache management.",
                    "Fair and timely scheduling via cooperative polling.",
                    "SCAN-Lite: enterprise-wide analysis on the cheap.",
                    "Effective and efficient compromise recovery for weakly consistent replication.",
                    "Migrating server storage to SSDs: analysis of tradeoffs.",
                    "First-aid: surviving and preventing memory management bugs during production runs.",
                    "Transparent checkpoints of closed distributed systems in Emulab.",
                    "Ksplice: automatic rebootless kernel updates.",
                    "Tralfamadore: unifying source code and execution experience.",
                    "User interactions in social networks and their implications.",
                    "Isolating web programs in modern browser architectures.",
                    "Privacy-preserving browser-side scripting with BFlow.",
                    "xCalls: safe I/O in memory transactions.",
                    "A runtime system for software lock elision.",
                    "Dingo: taming device drivers.",
                    "Koala: a platform for OS-level power management.",
                    "Predicting replicated database scalability from standalone database profiling.",
                    "Statistical profiling-based techniques for effective power provisioning in data centers."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "EuroSys 2008",
        "info": "Glasgow, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2008",
                "sub_name": "Proceedings of the 2008 EuroSys Conference, Glasgow, Scotland, UK, April 1-4, 2008.",
                "count": 24,
                "papers": [
                    "Task activity vectors: a new metric for temperature-aware scheduling.",
                    "Efficient guaranteed disk request scheduling with fahrrad.",
                    "Enforcing appropriate process execution for exploiting idle resources from outside operating systems.",
                    "Parallax: virtual disks for virtual machines.",
                    "Replication degree customization for high availability.",
                    "GreenFS: making enterprise computers greener by protecting them better.",
                    "VPFS: building a virtual private file system with a small trusted computing base.",
                    "Application-level isolation and recovery with solitude.",
                    "Towards cinematic internet video-on-demand.",
                    "Experiences with open overlays: a middleware approach to network heterogeneity.",
                    "Protectit: trusted distributed services operating on sensitive data.",
                    "Modeling viral economies for digital media.",
                    "DepSpace: a byzantine fault-tolerant coordination service.",
                    "Hang analysis: fighting responsiveness bugs.",
                    "BorderPatrol: isolating events for black-box tracing.",
                    "30 seconds is not enough!: a study of operating system timer usage.",
                    "Samurai: protecting critical data in unsafe languages.",
                    "Controlled, systematic, and efficient code replacement for running java programs.",
                    "Documenting and automating collateral evolutions in linux device drivers.",
                    "Itrustpage: a user-assisted anti-phishing tool.",
                    "Switchblade: enforcing dynamic personalized system call models.",
                    "Eudaemon: involuntary and on-demand emulation against zero-day exploits.",
                    "Manageable fine-grained information flow.",
                    "Flicker: an execution infrastructure for tcb minimization."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "EuroSys 2007",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2007",
                "sub_name": "Proceedings of the 2007 EuroSys Conference, Lisbon, Portugal, March 21-23, 2007.",
                "count": 29,
                "papers": [
                    "JIT instrumentation: a novel approach to dynamically instrument operating systems.",
                    "Whodunit: transactional profiling for multi-tier applications.",
                    "Exploiting nonstationarity for performance prediction.",
                    "Thread clustering: sharing-aware scheduling on SMP-CMP-SMT multiprocessors.",
                    "Dryad: distributed data-parallel programs from sequential building blocks.",
                    "Enabling scalability and performance in a large scale CMP environment.",
                    "Latency and bandwidth-minimizing failure detectors.",
                    "Melange: creating a \"functional\" internet.",
                    "Sweeper: a lightweight end-to-end system for defending against fast worms.",
                    "Removing the memory limitations of sensor networks with flash-based virtual memory.",
                    "A virtual machine for sensor networks.",
                    "Macroprogramming heterogeneous sensor networks using cosmos.",
                    "hFS: a hybrid file system prototype for improving small file and metadata performance.",
                    "Competitive prefetching for concurrent sequential I/O.",
                    "Secure file system versioning at the block level.",
                    "Automatic configuration of internet services.",
                    "Comparing the performance of web server architectures.",
                    "Concierge: a service platform for resource-constrained devices.",
                    "Fine grained kernel logging with KLogger: experience and insights.",
                    "Container-based operating system virtualization: a scalable, high-performance alternative to hypervisors.",
                    "Adaptive control of virtualized resources in utility computing environments.",
                    "Discrete control for safe execution of IT automation workflows.",
                    "STMBench7: a benchmark for software transactional memory.",
                    "Dynamic and adaptive updates of non-quiescent subsystems in commodity operating system kernels.",
                    "Sealing OS processes to improve dependability and safety.",
                    "Authorizing applications in singularity.",
                    "Antiquity: exploiting a secure log for wide-area distributed storage.",
                    "Sprint: a middleware for high-performance transaction processing.",
                    "Tashkent+: memory-aware load balancing and update filtering in replicated databases."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "EuroSys 2006",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/eurosys/2006",
                "sub_name": "Proceedings of the 2006 EuroSys Conference, Leuven, Belgium, April 18-21, 2006.",
                "count": 29,
                "papers": [
                    "Fireflies: scalable support for intrusion-tolerant network overlays.",
                    "Argos: an emulator for fingerprinting zero-day attacks for advertised honeypots with automatic signature generation.",
                    "Practical taint-based protection using demand emulation.",
                    "Solving the starting problem: device drivers as self-describing artifacts.",
                    "Understanding collateral evolution in Linux device drivers.",
                    "Thorough static analysis of device drivers.",
                    "Database replication policies for dynamic content applications.",
                    "The SMART way to migrate replicated stateful services.",
                    "Tashkent: uniting durability with transaction ordering for high-performance scalable database replication.",
                    "K42: building a complete operating system.",
                    "Experiences in building and operating ePOST, a reliable peer-to-peer application.",
                    "Reducing TCB complexity for security-sensitive applications: three case studies.",
                    "Language support for fast and reliable message-based communication in singularity OS.",
                    "A quantitative analysis of aspects in the eCos kernel.",
                    "Context-specific middleware specialization techniques for optimizing software product-line architectures.",
                    "A fresh look at the reliability of long-term digital storage.",
                    "On the road to recovery: restoring data after disasters.",
                    "RIMAC: a novel redundancy-based hierarchical cache architecture for energy efficient, high performance storage systems.",
                    "Evaluating network processing efficiency with processor partitioning and asynchronous I/O.",
                    "TCP offload through connection handoff.",
                    "Emergent (mis)behavior vs. complex software systems.",
                    "Predictive log-synchronization.",
                    "Ferret: a toolkit for content-based similarity search of feature-rich data.",
                    "Understanding user behavior in large-scale video-on-demand systems.",
                    "URICA: Usage-awaRe Interactive Content Adaptation for mobile devices.",
                    "Peer sharing behaviour in the eDonkey network, and implications for the design of server-less file sharing systems.",
                    "Automated known problem diagnosis with event traces.",
                    "Using queries for distributed monitoring and forensics.",
                    "Balancing power consumption in multiprocessor systems."
                ]
            }
        ]
    }
]