[
    {
        "year": "2021",
        "name": "29th FCCM 2021",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2021",
                "sub_name": "29th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2021, Orlando, FL, USA, May 9-12, 2021.",
                "count": 56,
                "papers": [
                    "XBERT: Xilinx Logical-Level Bitstream Embedded RAM Transfusion.",
                    "A Safari through FPGA-based Neural Network Compilation and Design Automation Flows.",
                    "Flexible Instrumentation for Live On-Chip Debug of Machine Learning Training on FPGAs.",
                    "BoostGCN: A Framework for Optimizing GCN Inference on FPGA.",
                    "FA-LAMP: FPGA-Accelerated Learned Approximate Matrix Profile for Time Series Similarity Prediction.",
                    "HAO: Hardware-aware Neural Architecture Optimization for Efficient Inference.",
                    "GAME: Gaussian Mixture Model Mapping and Navigation Engine on Embedded FPGA.",
                    "Systematically migrating an operational microphysics parameterisation to FPGA technology.",
                    "Solving Large Top-K Graph Eigenproblems with a Memory and Compute-optimized FPGA Design.",
                    "Compute-Capable Block RAMs for Efficient Deep Learning Acceleration on FPGAs.",
                    "GORDON: Benchmarking Optane DC Persistent Memory Modules on FPGAs.",
                    "FANS: FPGA-Accelerated Near-Storage Sorting.",
                    "Mocarabe: High-Performance Time-Multiplexed Overlays for FPGAs.",
                    "HEDAcc: FPGA-based Accelerator for High-order Epistasis Detection.",
                    "The Importance of Being X-Drop: High Performance Genome Alignment on Reconfigurable Hardware.",
                    "Upgrade of FPGA Range-Limited Molecular Dynamics to Handle Hundreds of Processors.",
                    "FPGA-accelerated Iterative Reconstruction for Transmission Electron Tomography.",
                    "Optimized FPGA-based Deep Learning Accelerator for Sparse CNN using High Bandwidth Memory.",
                    "unzipFPGA: Enhancing FPGA-based CNN Engines with On-the-Fly Weights Generation.",
                    "ESCA: Event-Based Split-CNN Architecture with Data-Level Parallelism on UltraScale+ FPGA.",
                    "3D-VNPU: A Flexible Accelerator for 2D/3D CNNs on FPGA.",
                    "Clockwork: Resource-Efficient Static Scheduling for Multi-Rate Image Processing Applications on FPGAs.",
                    "Probabilistic Scheduling in High-Level Synthesis.",
                    "Extending High-Level Synthesis for Task-Parallel Programs.",
                    "HLS-Compatible, Embedded-Processor Stream Links.",
                    "An Empirical Study of the Reliability of High-Level Synthesis Tools.",
                    "Cloud FPGA Cartography using PCIe Contention.",
                    "Trusted Configuration in Cloud FPGAs.",
                    "Remote Power Attacks on the Versatile Tensor Accelerator in Multi-Tenant FPGAs.",
                    "Runtime Detection of Probing/Tampering on Interconnecting Buses.",
                    "A General Video Processing Framework on Edge Computing FPGAs.",
                    "A Tunable Dual-Edge Time-to-Digital Converter.",
                    "Accelerating Large-Scale Nearest Neighbor Search with Computational Storage Device.",
                    "ARC: Reconfigurable Cache Security Assurance with Application-Specific Randomized Mapping in FPGA-Based Heterogeneous Computing.",
                    "AutoTEA: Automated Transistor-level Efficient and Accurate Optimization for GRM FPGA Design.",
                    "Configurable Pipelined Datapath for Data Acquisition in Interventional Computed Tomography.",
                    "DMA Medusa: A Vendor-Independent FPGA-Based Architecture for 400 Gbps DMA Transfers.",
                    "Edge Accelerator for Lifelong Deep Learning using Streaming Linear Discriminant Analysis.",
                    "Enabling OpenMP Task Parallelism on Multi-FPGAs.",
                    "Extending HLS with High-Level Descriptive Language for Configurable Algorithm-Level Spatial Structure Design.",
                    "FERMAT: FPGA-Accelerated Heterogeneous Computing Platform Near NVMe Storage.",
                    "FFIVE: An FPGA Framework for Interactive VNF Environments.",
                    "Heterogeneous Dual-Core Overlay Processor for Light-Weight CNNs.",
                    "Near-Storage Acceleration of Database Query Processing with SmartSSDs.",
                    "NullaNet Tiny: Ultra-low-latency DNN Inference Through Fixed-function Combinational Logic.",
                    "ONT-X: An FPGA Approach to Real-time Portable Genomic Analysis.",
                    "Particle Mesh Ewald for Molecular Dynamics in OpenCL on an FPGA Cluster.",
                    "Pharos: a Performance Monitor for Multi-FPGA Systems.",
                    "Reconfigurable Synthesizable Synchronization FIFOs.",
                    "Scalable FPGA Median Filtering via a Directional Median Cascade.",
                    "Scheduling Persistent and Fully Cooperative Instructions.",
                    "TOCO: A Systolic Network for Efficient Transposed Convolutions with Output-Reuse Paths.",
                    "TwinDNN: A Tale of Two Deep Neural Networks.",
                    "Using hls4ml to Map Convolutional Neural Networks on Interconnected FPGA Devices.",
                    "An FPGA Based Hardware Accelerated Framework for Solar Spectra Matching with Parameterized Matched Filter IP Core.",
                    "Time-Domain FPGA Power Delivery Network Characterization Methodology."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th FCCM 2020",
        "info": "Fayetteville, AR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2020",
                "sub_name": "28th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2020, Fayetteville, AR, USA, May 3-6, 2020.",
                "count": 65,
                "papers": [
                    "High-Throughput Convolutional Neural Network on an FPGA by Customized JPEG Compression.",
                    "Optimizing Reconfigurable Recurrent Neural Networks.",
                    "Accelerating Proximal Policy Optimization on CPU-FPGA Heterogeneous Platforms.",
                    "Evaluating Low-Memory GEMMs for Convolutional Neural Network Inference on FPGAs.",
                    "CNN-based Feature-point Extraction for Real-time Visual SLAM on Embedded FPGA.",
                    "Corundum: An Open-Source 100-Gbps Nic.",
                    "FFShark: A 100G FPGA Implementation of BPF Filtering for Wireshark.",
                    "Hardware Architecture of a Number Theoretic Transform for a Bootstrappable RNS-based Homomorphic Encryption Scheme.",
                    "Power-hammering through Glitch Amplification - Attacks and Mitigation.",
                    "Exploring The Impact Of Switch Arity On Butterfly Fat Tree Fpga Nocs.",
                    "Comparison of Arithmetic Number Formats for Inference in Sum-Product Networks on FPGAs.",
                    "High Density 8-Bit Multiplier Systolic Arrays For Fpga.",
                    "Low-Cost Approximate Constant Coefficient Hybrid Binary-Unary Multiplier for DSP Applications.",
                    "Enabling Efficient and Flexible FPGA Virtualization for Deep Learning in the Cloud.",
                    "Shuhai: Benchmarking High Bandwidth Memory On FPGAS.",
                    "Exploring Writeback Designs for Efficiently Leveraging Parallel-Execution Units in FPGA-Based Soft-Processors.",
                    "Safely Preventing Unbounded Delays During Bus Transactions in FPGA-based SoC.",
                    "Grapefruit: An Open-Source, Full-Stack, and Customizable Automata Processing on FPGAs.",
                    "FP-AMG: FPGA-Based Acceleration Framework for Algebraic Multigrid Solvers.",
                    "Algorithm-Hardware Co-design for BQSR Acceleration in Genome Analysis ToolKit.",
                    "A Turbo Maximum-a-Posteriori Equalizer for Faster-than-Nyquist Applications.",
                    "FPGA-accelerated Automatic Alignment for Three-dimensional Tomography.",
                    "Artisan: a Meta-Programming Approach For Codifying Optimisation Strategies.",
                    "Hierarchical Modelling of Generators in Design-Space Exploration.",
                    "Investigating Performance Losses in High-Level Synthesis for Stencil Computations.",
                    "Proposing a Fast and Scalable Systolic Array for Matrix Multiplication.",
                    "An Automated Tool for Design Space Exploration of Matrix Vector Multiplication (MVM) Kernels Using OpenCL Based Implementation on FPGAs.",
                    "Fast Arithmetic Hardware Library For RLWE-Based Homomorphic Encryption.",
                    "Primitive Instantiation for Speed-Area Efficient Architecture Design of Cellular Automata based Mageto Logic on FPGA with Built-In Testability.",
                    "TBOX-Based Mask Scrambling Against SCA.",
                    "FPGA Implementation of Post-Quantum DME Cryptosystem.",
                    "A Dynamic Frequency Scaling Framework Against Reliability and Security Issues in Multi-tenant FPGA.",
                    "SHIP: Storage for Hybrid Interconnected Processors.",
                    "RISC-V Barrel Processor for Accelerator Control.",
                    "Update Latency Optimization of Packet Classification for SDN Switch on FPGA.",
                    "Accommodating Multi-Tenant FPGAs in the Cloud.",
                    "Accelerating MPI Collectives with FPGAs in the Network and Novel Communicator Support.",
                    "MeXT-SE: A System-Level Design Tool to Transparently Generate Secure MPSoC.",
                    "Early-stage Automated Identification Tool for Shared Accelerators.",
                    "An Analytical Model of Memory-Bound Applications Compiled with High Level Synthesis.",
                    "FPGA Virtualization for Deprecated Devices.",
                    "ZRLMPI: A Unified Programming Model for Reconfigurable Heterogeneous Computing Clusters.",
                    "Designing Domain Specific Computing Systems.",
                    "Improving the Availability of Secure Space Links through the Partial Reconfiguration of FPGAs.",
                    "An FPGA-Optimized Architecture of Real-time Farneback Optical Flow.",
                    "High-Performance Parallel Radix Sort on FPGA.",
                    "FPGA-Based Gesture Recognition with Capacitive Sensor Array using Recurrent Neural Networks.",
                    "Gbit/s Non-Binary LDPC Decoders: High-Throughput using High-Level Specifications.",
                    "A Quaternary FPGA Architecture Using Floating Gate Memories.",
                    "Rotary Register File: A Micro-Architectural Primitive on FPGA.",
                    "Tiny On-Chip Memory Realization of Weight Sparseness Split-CNNs on Low-end FPGAs.",
                    "An Efficient FPGA-based Architecture for Contractive Autoencoders.",
                    "Systolic-CNN: An OpenCL-defined Scalable Run-time-flexible FPGA Accelerator Architecture for Accelerating Convolutional Neural Network Inference in Cloud/Edge Computing.",
                    "Explore Efficient LUT-based Architecture for Quantized Convolutional Neural Networks on FPGA.",
                    "Realization of Quantized Neural Network for Super-resolution on PYNQ.",
                    "Scalable Full Hardware Logic Architecture for Gradient Boosted Tree Training.",
                    "Optimized Distribution of an Accelerated Convolutional Neural Network across Multiple FPGAs.",
                    "SqueezeJet-3: An Accelerator Utilizing FPGA MPSoCs for Edge CNN Applications.",
                    "Automatic Generation of FPGA Kernels From Open Format CNN Models.",
                    "High-Throughput DNN Inference with LogicNets.",
                    "AIgean: An Open Framework for Machine Learning on Heterogeneous Clusters.",
                    "FPGA Based High-Throughput Real-Time Feature Extraction for Modulation Classification.",
                    "Accelerating Large Scale GCN Inference on FPGA.",
                    "EASpiNN: Effective Automated Spiking Neural Network Evaluation on FPGA.",
                    "A High-performance Inference Accelerator Exploiting Patterned Sparsity in CNNs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th FCCM 2019",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2019",
                "sub_name": "27th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2019, San Diego, CA, USA, April 28 - May 1, 2019.",
                "count": 70,
                "papers": [
                    "Yosys+nextpnr: An Open Source Framework from Verilog to Bitstream for Commercial FPGAs.",
                    "EFCAD - An Embedded FPGA CAD Tool Flow for Enabling On-chip Self-Compilation.",
                    "Maverick: A Stand-Alone CAD Flow for Partially Reconfigurable FPGA Modules.",
                    "An Efficient Hardware Accelerator for Sparse Convolutional Neural Networks on FPGAs.",
                    "LUTNet: Rethinking Inference in FPGA Soft Logic.",
                    "PIR-DSP: An FPGA DSP Block Architecture for Multi-precision Deep Neural Networks.",
                    "Towards Efficient Deep Neural Network Training by FPGA-Based Batch-Level Parallelism.",
                    "CRoute: A Fast High-Quality Timing-Driven Connection-Based FPGA Router.",
                    "RapidRoute: Fast Assembly of Communication Structures for FPGA Overlays.",
                    "Generic Connectivity-Based CGRA Mapping via Integer Linear Programming.",
                    "LAMDA: Learning-Assisted Multi-stage Autotuning for FPGA Design Closure.",
                    "Memory Mapping for Multi-die FPGAs.",
                    "Impact of FPGA Architecture on Area and Performance of CGRA Overlays.",
                    "An FPGA-Based BWT Accelerator for Bzip2 Data Compression.",
                    "π-BA: Bundle Adjustment Acceleration on Embedded FPGAs with Co-observation Optimization.",
                    "Deep Packet Inspection in FPGAs via Approximate Nondeterministic Automata.",
                    "Active Stereo Vision with High Resolution on an FPGA.",
                    "Hardware Acceleration of Long Read Pairwise Overlapping in Genome Sequencing: A Race Between FPGA and GPU.",
                    "Processor Assisted Worklist Scheduling for FPGA Accelerated Graph Processing on a Shared-Memory Platform.",
                    "MEG: A RISCV-Based System Simulation Infrastructure for Exploring Memory Optimization Using FPGAs and Hybrid Memory Cube.",
                    "Enhancing Butterfly Fat Tree NoCs for FPGAs with Lightweight Flow Control.",
                    "SimAcc: A Configurable Cycle-Accurate Simulator for Customized Accelerators on CPU-FPGAs SoCs.",
                    "Towards Efficient and Scalable Acceleration of Online Decision Tree Learning on FPGA.",
                    "T2S-Tensor: Productively Generating High-Performance Spatial Hardware for Dense Tensor Computations.",
                    "SparseHD: Algorithm-Hardware Co-optimization for Efficient High-Dimensional Computing.",
                    "Why Compete When You Can Work Together: FPGA-ASIC Integration for Persistent RNNs.",
                    "Design Patterns for Code Reuse in HLS Packet Processing Pipelines.",
                    "Module-per-Object: A Human-Driven Methodology for C++-Based High-Level Synthesis Design.",
                    "Templatised Soft Floating-Point for High-Level Synthesis.",
                    "Exploiting Irregular Memory Parallelism in Quasi-Stencils through Nonlinear Transformation.",
                    "FP-AMR: A Reconfigurable Fabric Framework for Adaptive Mesh Refinement Applications.",
                    "Compressed Sensing MRI Reconstruction on Intel HARPv2.",
                    "GhostSZ: A Transparent FPGA-Accelerated Lossy Compression Framework.",
                    "Efficient Hardware Acceleration for Design Diversity Calculation to Mitigate Common Mode Failures.",
                    "Fast Voltage Transients on FPGAs: Impact and Mitigation Strategies.",
                    "FASE: FPGA Acceleration of Secure Function Evaluation.",
                    "Rethinking Integer Divider Design for FPGA-Based Soft-Processors.",
                    "High Precision, High Performance FPGA Adders.",
                    "Automated Tool and Runtime Support for Fine-Grain Reconfiguration in Highly Flexible Reconfigurable Systems.",
                    "AutoPhase: Compiler Phase-Ordering for HLS with Deep Reinforcement Learning.",
                    "Efficient FPGA Floorplanning for Partial Reconfiguration-Based Applications.",
                    "Towards Prototyping and Acceleration of Java Programs onto Intel FPGAs.",
                    "Sonar: Writing Testbenches through Python.",
                    "Raparo: Resource-Level Angle-Based Parallel Routing for FPGAs.",
                    "Automated Acceleration of Dataflow-Oriented C Applications on FPGA-Based Systems.",
                    "Automated Design Space Exploration and Roofline Analysis for FPGA-Based HLS Applications.",
                    "Formalizing Loop-Carried Dependencies in Coq for High-Level Synthesis.",
                    "Exploring the Random Network of Hodgkin and Huxley Neurons with Exponential Synaptic Conductances on OpenCL FPGA Platform.",
                    "A Scalable OpenCL-Based FPGA Accelerator for YOLOv2.",
                    "Model-Extraction Attack Against FPGA-DNN Accelerator Utilizing Correlation Electromagnetic Analysis.",
                    "SimBNN: A Similarity-Aware Binarized Neural Network Acceleration Framework.",
                    "KPynq: A Work-Efficient Triangle-Inequality Based K-Means on FPGA.",
                    "A High Throughput and Energy-Efficient Retina-Inspired Tone Mapping Processor.",
                    "An OpenCL-Based Acceleration for Canny Algorithm Using a Heterogeneous CPU-FPGA Platform.",
                    "Scalable P4 Deparser for Speeds Over 100 Gbps.",
                    "Wire-Speed Multirate Accelerator for Aggregation Operations on Sorted Data.",
                    "Hybrid XML Parser Based on Software and Hardware Co-design.",
                    "Sorting Large Data Sets with FPGA-Accelerated Samplesort.",
                    "Cost-Effective Energy Monitoring of a Zynq-Based Real-Time System Including Dual Gigabit Ethernet.",
                    "Improved Techniques for Sensing Intra-Device Side Channel Leakage.",
                    "Safe Task Interruption for FPGAs.",
                    "OpenCL Kernel Vectorization on the CPU, GPU, and FPGA: A Case Study with Frequent Pattern Compression.",
                    "A 4.8x Faster FPGA-Based Iterative Closest Point Accelerator for Object Pose Estimation of Picking Robot Applications.",
                    "Monobit Wideband Receiver with Integrated Dithering in FPGA.",
                    "An FPGA-Based Computing Infrastructure Tailored to Efficiently Scaffold Genome Sequences.",
                    "FlexGibbs: Reconfigurable Parallel Gibbs Sampling Accelerator for Structured Graphs.",
                    "A Fine-Grained Parallel Snappy Decompressor for FPGAs Using a Relaxed Execution Model.",
                    "Analyzing the Energy-Efficiency of Vision Kernels on Embedded CPU, GPU and FPGA Platforms.",
                    "Large-Scale and High-Throughput QR Decomposition on an FPGA.",
                    "Flexi-AES: A Highly-Parameterizable Cipher for a Wide Range of Design Constraints."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th FCCM 2018",
        "info": "Boulder, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2018",
                "sub_name": "26th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2018, Boulder, CO, USA, April 29 - May 1, 2018.",
                "count": 53,
                "papers": [
                    "Evaluating the Performance Efficiency of a Soft-Processor, Variable-Length, Parallel-Execution-Unit Architecture for FPGAs Using the RISC-V ISA.",
                    "ST-Accel: A High-Level Programming Platform for Streaming Applications on FPGA.",
                    "Hoplite-Q: Priority-Aware Routing in FPGA Overlay NoCs.",
                    "A Bandwidth-Optimized Routing Algorithm for Hybrid FPGA Networks-on-Chip.",
                    "Improved Lightweight Implementations of CAESAR Authenticated Ciphers.",
                    "High-Throughput Lossless Compression on Tightly Coupled CPU-FPGA Platforms.",
                    "FPGA Side Channel Attacks without Physical Access.",
                    "Inheriting Software Security Policies within Hardware IP Components.",
                    "ReBNet: Residual Binarized Neural Network.",
                    "FlexiGAN: An End-to-End Solution for FPGA Acceleration of Generative Adversarial Networks.",
                    "Exploration of Low Numeric Precision Deep Learning Inference Using Intel® FPGAs.",
                    "FPDeep: Acceleration and Load Balancing of CNN Training on FPGA Clusters.",
                    "Hot & Spicy: Improving Productivity with Python and HLS for FPGAs.",
                    "Understanding Performance Differences of FPGAs and GPUs.",
                    "High-Frequency Absorption-FIFO Pipelining for Stratix 10 HyperFlex.",
                    "Concurrency-Aware Thread Scheduling for High-Level Synthesis.",
                    "High-Level Synthesis of FPGA Circuits with Multiple Clock Domains.",
                    "LegUp-NoC: High-Level Synthesis of Loops with Indirect Addressing.",
                    "Latte: Locality Aware Transformation for High-Level Synthesis.",
                    "Fast and Accurate Estimation of Quality of Results in High-Level Synthesis with Machine Learning.",
                    "RapidWright: Enabling Custom Crafted Implementations for FPGAs.",
                    "Improving the Effectiveness of TMR Designs on FPGAs with SEU-Aware Incremental Placement.",
                    "Demand Driven Assembly of FPGA Configurations Using Partial Reconfiguration, Ubuntu Linux, and PYNQ.",
                    "HODS: Hardware Object Deserialization Inside SSD Storage.",
                    "CAMAS: Static and Dynamic Hybrid Cache Management for CPU-FPGA Platforms.",
                    "Microscope on Memory: MPSoC-Enabled Computer Memory System Assessments.",
                    "FPGA-Based Real-Time Super-Resolution System for Ultra High Definition Videos.",
                    "OpenCL-Based FPGA Design to Accelerate the Nodal Discontinuous Galerkin Method for Unstructured Meshes.",
                    "A High-Performance and Cost-Effective Hardware Merge Sorter without Feedback Datapath.",
                    "EM-Aware Memory Mapping Algorithms for SRAM Based FPGA.",
                    "SMEM++: A Pipelined and Time-Multiplexed SMEM Seeding Accelerator for DNA Sequencing.",
                    "PQ-CNN: Accelerating Product Quantized Convolutional Neural Network on FPGA.",
                    "NewGraph: Balanced Large-Scale Graph Processing on FPGAs with Low Preprocessing Overheads.",
                    "Exploiting Box Expansion and Grid Partitioning for Parallel FPGA Routing.",
                    "AccDNN: An IP-Based DNN Generator for FPGAs.",
                    "Reloc - An Open-Source Vivado Workflow for Generating Relocatable End-User Configuration Tiles.",
                    "From C to Fault-Tolerant FPGA-Based Systems.",
                    "Wibheda: Framework for Data Dependency-Aware Multi-Constrained Hardware-Software Partitioning in FPGA-Based SoCs for IoT Devices.",
                    "High-Speed Regular Expression Matching with Pipelined Memory-Based Automata.",
                    "Rethinking Secure FPGAs: Towards a Cryptography-Friendly Configurable Cell Architecture and Its Automated Design Flow.",
                    "A High-Level Synthesis Case Study on Light Propagation Simulation in Turbid Media.",
                    "Enabling Transparent Acceleration of OpenCV Library Kernels on a Hybrid Memory Cube Computer.",
                    "Accelerator Design with Effective Resource Utilization for Binary Convolutional Neural Networks on an FPGA.",
                    "High Performance Dynamic Communication on Reconfigurable Clusters.",
                    "Performance Prediction for Large-Scale Heterogeneous Platforms.",
                    "Design Space Exploration for Hardware Acceleration of Machine Learning Applications in MapReduce.",
                    "Efficient FPGA Implementation of Binary Field Multipliers Based on Irreducible Trinomials.",
                    "A PYNQ-Based Framework for Rapid CNN Prototyping.",
                    "Automatic Offloading of Cluster Accelerators.",
                    "Cross Component Optimization for Modern LTE Downlink Shared Channel Implementation.",
                    "Bridging the Gap between Advanced Memory and Heterogeneous Architectures.",
                    "Acceleration Framework for FPGA Implementation of OpenVX Graph Pipelines.",
                    "Automatic Interior I/O Elimination in Systolic Array Architecture."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th FCCM 2017",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2017",
                "sub_name": "25th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2017, Napa, CA, USA, April 30 - May 2, 2017.",
                "count": 56,
                "papers": [
                    "High-Performance Hardware Merge Sorter.",
                    "Communication-Aware MCMC Method for Big Data Applications on FPGAs.",
                    "Terabyte Sort on FPGA-Accelerated Flash Storage.",
                    "Improved Synthesis of Compressor Trees on FPGAs in High-Level Synthesis.",
                    "SWiF: A Simplified Workload-Centric Framework for FPGA-Based Computing.",
                    "Megrez: Parallelizing FPGA Routing with Strictly-Ordered Partitioning.",
                    "An FPGA Design Framework for CNN Sparsification and Acceleration.",
                    "FPGA Delay Model Considering Logic-Level and Transistor-Level Parameters.",
                    "Scheduling Considerations for Voter Checking in TMR-MER Systems.",
                    "Bit-Width Based Resource Partitioning for CNN Acceleration on FPGA.",
                    "On Bit-Serial NoCs for FPGAs.",
                    "Implementing FPGA Overlay NoCs Using the Xilinx UltraScale Memory Cascades.",
                    "Efficient GPGPU Computing with Cross-Core Resource Sharing and Core Reconfiguration.",
                    "An Architecture for the Acceleration of a Hybrid Leaky Integrate and Fire SNN on the Convey HC-2ex FPGA-Based Processor.",
                    "FPGA-Based Real-Time Charged Particle Trajectory Reconstruction at the Large Hadron Collider.",
                    "Bonded Force Computations on FPGAs.",
                    "Efficient Particle-Grid Space Interpolation of an FPGA-Accelerated Particle-in-Cell Plasma Simulation.",
                    "A High-Level Synthesis Approach Optimizing Accumulations in Floating-Point Programs Using Custom Formats and Operators.",
                    "A Case for Common-Case: On FPGA Acceleration of Erasure Coding.",
                    "Accelerating Large-Scale Graph Analytics with FPGA and HMC.",
                    "Fast and Energy-Driven Design Space Exploration for Heterogeneous Architectures.",
                    "A Parameterizable Activation Function Generator for FPGA-Based Neural Network Applications.",
                    "Customizing Neural Networks for Efficient FPGA Implementation.",
                    "Escher: A CNN Accelerator with Flexible Buffering to Minimize Off-Chip Transfer.",
                    "Evaluating Fast Algorithms for Convolutional Neural Networks on FPGAs.",
                    "Using Runahead Execution to Hide Memory Latency in High Level Synthesis.",
                    "Energy Efficient Loop Unrolling for Low-Cost FPGAs.",
                    "Evaluating Rapid Application Development with Python for Heterogeneous Processor-Based FPGAs.",
                    "HLScope: High-Level Performance Debugging for FPGA Designs.",
                    "TLegUp: A TMR Code Generation Tool for SRAM-Based FPGA Applications Using HLS.",
                    "Exploration of FPGA-Based Packet Switches for Rack-Scale Computers on a Board.",
                    "An Out-of-Order Load-Store Queue for Spatial Computing.",
                    "Fine-Grained Acceleration of Binary Neural Networks Using Intel® Xeon® Processor with Integrated FPGA.",
                    "Enabling Long Debug Traces of HLS Circuits Using Bandwidth-Limited Off-Chip Storage Devices.",
                    "The Potential of Dynamic Binary Modification and CPU-FPGA SoCs for Simulation.",
                    "FP-DNN: An Automated Framework for Mapping Deep Neural Networks onto FPGAs with RTL-HLS Hybrid Templates.",
                    "FPGA-Accelerated Dense Linear Machine Learning: A Precision-Convergence Trade-Off.",
                    "A Configurable FPGA Implementation of the Tanh Function Using DCT Interpolation.",
                    "ParaDiMe: A Distributed Memory FPGA Router Based on Speculative Parallelism and Path Encoding.",
                    "Automata-to-Routing: An Open-Source Toolchain for Design-Space Exploration of Spatial Automata Processing Architectures.",
                    "Relocating Encrypted Partial Bitstreams by Advance Task Address Loading.",
                    "CPRring: A Structure-Aware Ring-Based Checkpointing Architecture for FPGA Computing.",
                    "Multi-FPGA Evaluation Platform for Disaggregated Computing.",
                    "Dynamic Module Partitioning for Library Based Placement on Heterogeneous FPGAs.",
                    "Exploring High Efficiency Hardware Accelerator for the Key Algorithm of Square Kilometer Array Telescope Data Processing.",
                    "Minimalist Design for Accelerating Convolutional Neural Networks for Low-End FPGA Platforms.",
                    "A Network-on-Chip Based H.264 Video Decoder Prototype Implemented on FPGAs.",
                    "Applying the Flask Security Architecture to Secure SoC Design.",
                    "A Real-Time Embedded FPGA Processor for a Stand-Alone Dual-Mode Assistive Device.",
                    "CAPSL: A Tool for Automatic Generation of Hardware Sandboxes for IP Security.",
                    "A Scalable FPGA-Based Accelerator for High-Throughput MCMC Algorithms.",
                    "Improving the Accuracy of Arctan for Face Detection.",
                    "K-Mer Counting Using Bloom Filters with an FPGA-Attached HMC.",
                    "Centaur: A Framework for Hybrid CPU-FPGA Databases.",
                    "Scalable Network Function Virtualization for Heterogeneous Middleboxes.",
                    "A Nanosecond-Level Hybrid Table Design for Financial Market Data Generators."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th FCCM 2016",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2016",
                "sub_name": "24th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2016, Washington, DC, USA, May 1-3, 2016.",
                "count": 53,
                "papers": [
                    "DeCO: A DSP Block Based FPGA Accelerator Overlay with Low Overhead Interconnect.",
                    "High Performance Instruction Scheduling Circuits for Out-of-Order Soft Processors.",
                    "GRVI Phalanx: A Massively Parallel RISC-V FPGA Accelerator Accelerator.",
                    "Tinker: Generating Custom Memory Architectures for Altera's OpenCL Compiler.",
                    "Evaluating Embedded FPGA Accelerators for Deep Learning Applications.",
                    "Communication Optimization for the 16-Core Epiphany Floating-Point Processor Array.",
                    "A LUT-Based Approximate Adder.",
                    "Power-Efficient Accelerated Genomic Short Read Mapping on Heterogeneous Computing Platforms.",
                    "When Spark Meets FPGAs: A Case Study for Next-Generation DNA Sequencing Acceleration.",
                    "Parallelism for High-Performance Tsunami Simulation with FPGA: Spatial or Temporal?",
                    "RP-Ring: A Heterogeneous Multi-FPGA Accelerating Solution for N-Body Simulations.",
                    "The SMEM Seeding Acceleration for DNA Sequence Alignment.",
                    "fpgaConvNet: A Framework for Mapping Convolutional Neural Networks on FPGAs.",
                    "Increasing Network Size and Training Throughput of FPGA Restricted Boltzmann Machines Using Dropout.",
                    "Two-Hit Filter Synthesis for Genomic Database Search.",
                    "KAPow: A System Identification Approach to Online Per-Module Power Estimation in FPGA Designs.",
                    "SynADT: Dynamic Data Structures in High Level Synthesis.",
                    "Loop Splitting for Efficient Pipelining in High-Level Synthesis.",
                    "Improving Classification Accuracy of a Machine Learning Approach for FPGA Timing Closure.",
                    "Knowledge Transfer in Automatic Optimisation of Reconfigurable Designs.",
                    "Reconfiguration Control Networks for TMR Systems with Module-Based Recovery.",
                    "Vertex-Centric Graph Processing on FPGA.",
                    "High-Speed RTL Implementations and FPGA Benchmarking of Three Authenticated Ciphers Competing in CAESAR Round Two.",
                    "Accelerating Apache Spark Big Data Analysis with FPGAs.",
                    "Parallel Hardware Merge Sorter.",
                    "High-Throughput and Energy-Efficient Graph Processing on FPGA.",
                    "Continuous Online Self-Monitoring Introspection Circuitry for Timing Repair by Incremental Partial-Reconfiguration (COSMIC TRIP).",
                    "Sectors: Divide & Conquer and Softwarization in the Design and Validation of the Stratix® 10 FPGA.",
                    "AutoSLIDE: Automatic Source-Level Instrumentation and Debugging for HLS.",
                    "Cost Effective Partial Scan for Hardware Emulation.",
                    "Initiation Interval Aware Resource Sharing for FPGA DSP Blocks.",
                    "A Dynamically Scheduled Architecture for the Synthesis of Graph Database Queries.",
                    "Acceleration of the Pair-HMM Algorithm for DNA Variant Calling.",
                    "An Empirical Analysis of the Fidelity of VPR Area Models.",
                    "Heterogeneous Implementation of ECG Encryption and Identification on the Zynq SoC.",
                    "A Multi-ported Memory Compiler Utilizing True Dual-Port BRAMs.",
                    "P4-to-VHDL: Automatic Generation of 100 Gbps Packet Parsers.",
                    "Marathon: Statically-Scheduled Conflict-Free Routing on FPGA Overlay NoCs.",
                    "Parallelizing FPGA Technology Mapping through Partitioning.",
                    "Online Bandwidth Reduction Using Dynamic Partial Reconfiguration.",
                    "Energy Efficiency of Full Pipelining: A Case Study for Matrix Multiplication.",
                    "Spatial Predicates Evaluation in the Geohash Domain Using Reconfigurable Hardware.",
                    "A Content Adapted FPGA Memory Architecture with Pattern Recognition Capability for L1 Track Triggering in the LHC Environment.",
                    "FPGA-Accelerated Particle-Grid Mapping.",
                    "Finding Space-Time Stream Permutations for Minimum Memory and Latency.",
                    "Application-Aware Collective Communication (Extended Abstract).",
                    "Bridging the Performance-Programmability Gap for FPGAs via OpenCL: A Case Study with OpenDwarfs.",
                    "ECO Based Placement and Routing Framework for 3D FPGAs with Micro-fluidic Cooling.",
                    "FPGA-Based Reduction Techniques for Efficient Deep Neural Network Deployment.",
                    "CS-Based Secured Big Data Processing on FPGA.",
                    "High Level Synthesis Based E-Nose System for Gas Applications.",
                    "Runtime Parameterizable Regular Expression Operators for Databases.",
                    "Accelerating Equi-Join on a CPU-FPGA Heterogeneous Platform."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd FCCM 2015",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2015",
                "sub_name": "23rd IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2015, Vancouver, BC, Canada, May 2-6, 2015.",
                "count": 61,
                "papers": [
                    "Technology Scaling in FPGAs: Trends in Applications and Architectures.",
                    "Revisiting Serial Arithmetic: A Performance and Tradeoff Analysis for Parallel Applications on Modern FPGAs.",
                    "Rapid Overlay Builder for Xilinx FPGAs.",
                    "Adjustable-Cost Overlays for Runtime Compilation.",
                    "Efficient Overlay Architecture Based on DSP Blocks.",
                    "High Performance Sparse LU Solver FPGA Accelerator Using a Static Synchronous Data Flow Model.",
                    "Cycle-Accurate Replay and Debugging of Running FPGA Systems.",
                    "Heterogeneous Platform to Accelerate Compute Intensive Applications.",
                    "High Performance Memory Accesses on FPGA-SoCs: A Quantitative Analysis.",
                    "Sparse Graph Processing with Soft-Processors.",
                    "Improving Data Partitioning Performance on OpenCL-Based FPGAs.",
                    "Performance and Energy Optimization on MPSoCs by Enabling STT-MRAM LUTs.",
                    "Scalable 10Gbps TCP/IP Stack Architecture for Reconfigurable Hardware.",
                    "Enabling High Throughput and Virtualization for Traffic Classification on FPGA.",
                    "A Scalable High-Bandwidth Architecture for Lossless Compression on FPGAs.",
                    "Enabling Fast and Accurate Emulation of Large-Scale Network on Chip Architectures on a Single FPGA.",
                    "Accelerating SpMV on FPGAs by Compressing Nonzero Values.",
                    "Zedwulf: Power-Performance Tradeoffs of a 32-Node Zynq SoC Cluster.",
                    "Energy-Efficient Acceleration of OpenCV Saliency Computation Using Soft Vector Processors.",
                    "Autotuning FPGA Design Parameters for Performance and Power.",
                    "FIR Filter Based on Stochastic Computing with Reconfigurable Digital Fabric.",
                    "Accelerating Interconnect Analysis Using High-Level HDLs and FPGA, SpiNNaker as a Case Study.",
                    "Fast Design Space Exploration Using Vivado HLS: Non-binary LDPC Decoders.",
                    "Design of a Distributed Compressor for Astronomy SSD.",
                    "Scalable Key/Value Search in Datacenters.",
                    "Function Proxies for Improved Resource Sharing in High Level Synthesis.",
                    "Automatic Soft CGRA Overlay Customization for High-Productivity Nested Loop Acceleration on FPGAs.",
                    "Adaptive Configurable Transactional Memory for Multi-processor FPGA Platforms.",
                    "Pipelined Genetic Propagation.",
                    "FPGA Acceleration of Recurrent Neural Network Based Language Model.",
                    "Driving Timing Convergence of FPGA Designs through Machine Learning and Cloud Computing.",
                    "Using Dynamic Signal-Tracing to Debug Compiler-Optimized HLS Circuits on FPGAs.",
                    "High-Level Debugging and Verification for FPGA-Based Multicore Architectures.",
                    "Estimating Soft Processor Soft Error Sensitivity through Fault Injection.",
                    "Protecting against Cryptographic Trojans in FPGAs.",
                    "Automatic High-Level Hardware Checkpoint Selection for Reconfigurable Systems.",
                    "Offline Synthesis of Online Dependence Testing: Parametric Loop Pipelining for HLS.",
                    "HATCH: Hash Table Caching in Hardware for Efficient Relational Join on FPGA.",
                    "Accelerating Big Data Analytics Using FPGAs.",
                    "Massively Parallel Dynamically Reconfigurable Multi-FPGA Computing System.",
                    "A System on Reconfigurable Chip for Handwritten Digit Recognition.",
                    "An Efficient KNN Algorithm Implemented on FPGA Based Heterogeneous Computing System Using OpenCL.",
                    "Architectures and Precision Analysis for Modelling Atmospheric Variables with Chaotic Behaviour.",
                    "Fast and Flexible Conversion of Geohash Codes to and from Latitude/Longitude Coordinates.",
                    "SSketch: An Automated Framework for Streaming Sketch-Based Analysis of Big Data on FPGA.",
                    "An Open-Source Tool Flow for the Composition of Reconfigurable Hardware Thread Pool Architectures.",
                    "A Novel High-Throughput Acceleration Engine for Read Alignment.",
                    "A Parallel and Pipelined Architecture for Accelerating Fingerprint Computation in High Throughput Data Storages.",
                    "Modular SRAM-Based Binary Content-Addressable Memories.",
                    "A Low-Latency, Low-Area Hardware Oblivious RAM Controller.",
                    "Measuring the Accuracy of Minimum Width Transistor Area in Estimating FPGA Layout Area.",
                    "Offset Pipelined Scheduling: Conditional Branching for CGRAs.",
                    "A Highly-Efficient, Adaptive and Fault-Tolerant SoC Implementation of a Fourier Transform Spectrometer Data Processing.",
                    "FPGA Design for PCANet Deep Learning Network.",
                    "Functional Locking Modules for Design Protection of Intellectual Property Cores.",
                    "Virtual Channel and Switch Allocation for Low Latency Network-on-Chip Routers.",
                    "Early Experiences with OpenCL on FPGAs: Convolution Case Study.",
                    "Optimizing Residue Number Reverse Converters through Bitwise Arithmetic on FPGAs.",
                    "A Reconfigurable Multiclass Support Vector Machine Architecture for Real-Time Embedded Systems Classification.",
                    "Floorplanning for Partially-Reconfigurable FPGAs via Feasible Placements Detection.",
                    "Designing Partial Bitstreams for Multiple Xilinx FPGA Partitions."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd FCCM 2014",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2014",
                "sub_name": "22nd IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2014, Boston, MA, USA, May 11-13, 2014.",
                "count": 70,
                "papers": [
                    "Separation Logic-Assisted Code Transformations for Efficient High-Level Synthesis.",
                    "A Fully Pipelined and Dynamically Composable Architecture of CGRA.",
                    "Reducing Processing Latency with a Heterogeneous FPGA-Processor Framework.",
                    "Integrated CUDA-to-FPGA Synthesis with Network-on-Chip.",
                    "GraphGen: An FPGA Framework for Vertex-Centric Graph Computation.",
                    "Using Multi-op Instructions as a Way to Generate ASIPs with Optimized Pipeline Structure.",
                    "FPGA Architecture Enhancements to Support Heterogeneous Partially Reconfigurable Regions.",
                    "Customizable Compression Architecture for Efficient Configuration in CGRAs.",
                    "Exploiting Outer Loop Parallelism of Nested Loop on Coarse-Grained Reconfigurable Architectures.",
                    "Mapping Tasks to a Dynamically Reconfigurable Coarse Grained Array.",
                    "Better-Than-DMR Techniques for Yield Improvement.",
                    "A Multi-phase Clock Time-to-Digital Convertor Based on ISERDES Architecture.",
                    "A High Memory Bandwidth FPGA Accelerator for Sparse Matrix-Vector Multiplication.",
                    "A New Algorithm for Carry-Free Addition of Binary Signed-Digit Numbers.",
                    "On Hard Adders and Carry Chains in FPGAs.",
                    "Breaking Sequential Dependencies in FPGA-Based Sparse LU Factorization.",
                    "An Efficient Architecture for Floating-Point Eigenvalue Decomposition.",
                    "3D FFTs on a Single FPGA.",
                    "Rapid Post-Map Insertion of Embedded Logic Analyzers for Xilinx FPGAs.",
                    "System-Level Retiming and Pipelining.",
                    "GROK-INT: Generating Real On-Chip Knowledge for Interconnect Delays Using Timing Extraction.",
                    "Timing Fault Detection in FPGA-Based Circuits.",
                    "Design Space Exploration to Accelerate Nelder-Mead Algorithm Using FPGA.",
                    "Experiments in Mapping Expressions to DSP Blocks.",
                    "Memory Optimized Re-gridding for Non-uniform Fast Fourier Transform on FPGAs.",
                    "Reducing Overheads for Fault-Tolerant Datapaths with Dynamic Partial Reconfiguration.",
                    "Accelerator of Stacked Convolutional Independent Subspace Analysis for Deep Learning-Based Action Recognition.",
                    "Building Optimized Packet Filters with COFFi.",
                    "From GPU to FPGA: A Pipelined Hierarchical Approach to Fast and Memory-Efficient NDN Name Lookup.",
                    "High-Throughput Fixed-Point Object Detection on FPGAs.",
                    "UTOPIA: Generic User-Level Access to the Physical Memory Address Space for IP Core Debugging and Validation on FPGA Based PCIe Extension Cards.",
                    "FPGAs in the Cloud: Booting Virtualized Hardware Accelerators with OpenStack.",
                    "LEAP Shared Memories: Automating the Construction of FPGA Coherent Memories.",
                    "Performance Comparison between Multi-FPGA Prototyping Platforms: Hardwired Off-the-Shelf, Cabling, and Custom.",
                    "Fast, Power-Efficient Biophotonic Simulations for Cancer Treatment Using FPGAs.",
                    "SMCGen: Generating Reconfigurable Design for Sequential Monte Carlo Applications.",
                    "FPGA Gaussian Random Number Generators with Guaranteed Statistical Accuracy.",
                    "FPGA Implementation of EM Algorithm for 3D CT Reconstruction.",
                    "A Scalable Multi-engine Xpress9 Compressor with Asynchronous Data Transfer.",
                    "FPGA Accelerated Online Boosting for Multi-target Tracking.",
                    "An Architectural Approach to Characterizing and Eliminating Sources of Inefficiency in a Soft Processor Design.",
                    "Abstract: Shared L2 Cache Management in Multicore Real-Time System.",
                    "Harmonica: An FPGA-Based Data Parallel Soft Core.",
                    "FPGA Acceleration for Simultaneous Medical Image Reconstruction and Segmentation.",
                    "A Hierarchical Memory Architecture with NoC Support for MPSoC on FPGAs.",
                    "Accurate and Efficient Three Level Design Space Exploration Based on Constraints Satisfaction Optimization Problem Solver.",
                    "FPGA Implementation of Optical Flow Algorithm Based on Cost Aggregation.",
                    "Image Signal Processors on FPGAs.",
                    "A Fully-Pipelined FPGA Design for Tree-Reweighted Message Passing Algorithm.",
                    "Speeding Up FPGA Placement: Parallel Algorithms and Methods.",
                    "Floorplanning for Partially-Reconfigurable FPGA Systems via Mixed-Integer Linear Programming.",
                    "A Grammar Induction Method for Clustering of Operations in Complex FPGA Designs.",
                    "Automated Partial Reconfiguration Design for Adaptive Systems with CoPR for Zynq.",
                    "MixFX-SCORE: Heterogeneous Fixed-Point Compilation of Dataflow Computations.",
                    "Automating Optimization of Reconfigurable Designs.",
                    "Kung Fu Data Energy - Minimizing Communication Energy in FPGA Computations.",
                    "Reconstructing AES Key Schedules from Decayed Memory with FPGAs.",
                    "Low Power Reconfigurable Controllers for Wireless Sensor Network Nodes.",
                    "Compiling Higher Order Functional Programs to Composable Digital Hardware.",
                    "Fast Design-Space Exploration Method for SW/HW Codesign on FPGAs.",
                    "Flexibility and Circuit Overheads in Reconfigurable SIMD/MIMD Systems.",
                    "Fast and Power Efficient Heapsort IP for Image Compression Application.",
                    "A Hardware MPI Spawn for Distributed Multiprocessing Reconfigurable System on Chip (MP-RSoC).",
                    "MRAPI Implementation for Heterogeneous Reconfigurable Systems-on-Chip.",
                    "Scheduling Mixed-Architecture Processes in Tightly Coupled FPGA-CPU Reconfigurable Computers.",
                    "A Power-Efficient FPGA-Based Mixture-of-Gaussian (MoG) Background Subtraction for Full-HD Resolution.",
                    "High-Throughput and Low-Cost Hardware Accelerator for Privacy Preserving Publishing.",
                    "Energy Reduction through Differential Reliability and Lightweight Checking.",
                    "A Self-Adaptive SEU Mitigation System for FPGAs with an Internal Block RAM Radiation Particle Sensor.",
                    "Look-up Table Design for Deep Sub-threshold through Full-Supply Operation."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st FCCM 2013",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2013",
                "sub_name": "21st IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2013, Seattle, WA, USA, April 28-30, 2013.",
                "count": 52,
                "papers": [
                    "Reconfigurable computing in the era of post-silicon scaling [panel discussion].",
                    "Parallel Computation of Skyline Queries.",
                    "Minerva: Accelerating Data Analysis in Next-Generation SSDs.",
                    "Accelerating Join Operation for Relational Databases with FPGAs.",
                    "Boosting Memory Performance of Many-Core FPGA Device through Dynamic Precedence Graph.",
                    "Acceleration of SQL Restrictions and Aggregations through FPGA-Based Dynamic Partial Reconfiguration.",
                    "Accuracy-Performance Tradeoffs on an FPGA through Overclocking.",
                    "Safe Overclocking of Tightly Coupled CGRAs and Processor Arrays using Razor.",
                    "Escaping the Academic Sandbox: Realizing VPR Circuits on Xilinx Devices.",
                    "A Case for Heterogeneous Technology-Mapping: Soft Versus Hard Multiplexers.",
                    "Accurate Thermal-Profile Estimation and Validation for FPGA-Mapped Circuits.",
                    "On-chip Context Save and Restore of Hardware Tasks on Partially Reconfigurable FPGAs.",
                    "A High Throughput No-Stall Golomb-Rice Hardware Decoder.",
                    "Image Segmentation Using Hardware Forest Classifiers.",
                    "A Reconfigurable Architecture for 1-D and 2-D Discrete Wavelet Transform.",
                    "High Speed Video Processing Using Fine-Grained Processing on FPGA Platform.",
                    "The Effect of Compiler Optimizations on High-Level Synthesis for FPGAs.",
                    "Automating Elimination of Idle Functions by Run-Time Reconfiguration.",
                    "Open-Source Bitstream Generation.",
                    "ShrinkWrap: Compiler-Enabled Optimization and Customization of Soft Memory Interconnects.",
                    "PRML: A Modeling Language for Rapid Design Exploration of Partially Reconfigurable FPGAs.",
                    "Atacama: An Open FPGA-Based Platform for Mixed-Criticality Communication in Multi-segmented Ethernet Networks.",
                    "Latency-Optimized Networks for Clustering FPGAs.",
                    "A Range and Scaling Study of an FPGA-Based Digital Wireless Channel Emulator.",
                    "Enabling Hardware Exploration in Software-Defined Networking: A Flexible, Portable OpenFlow Switch.",
                    "An FPGA Based PCI-E Root Complex Architecture for Standalone SOPCs.",
                    "Application Composition and Communication Optimization in Iterative Solvers Using FPGAs.",
                    "Parallel Generation of Gaussian Random Numbers Using the Table-Hadamard Transform.",
                    "Hardware-Software Codesign for Embedded Numerical Acceleration.",
                    "FAssem: FPGA Based Acceleration of De Novo Genome Assembly.",
                    "Accelerating the Computation of Induced Dipoles for Molecular Mechanics with Dataflow Engines.",
                    "On Optimizing the Arithmetic Precision of MCMC Algorithms.",
                    "Exploiting Input Parameter Uncertainty for Reducing Datapath Precision of SPICE Device Models.",
                    "Efficient Large Integer Squarers on FPGA.",
                    "Elementary Function Implementation with Optimized Sub Range Polynomial Evaluation.",
                    "High-Level Description and Synthesis of Floating-Point Accumulators on FPGA.",
                    "Reconfigurable Acceleration of Short Read Mapping.",
                    "An FPGA-Based Data Flow Engine for Gaussian Copula Model.",
                    "A Delay-based PUF Design Using Multiplexers on FPGA.",
                    "Binding Hardware IPs to Specific FPGA Device via Inter-twining the PUF Response with the FSM of Sequential Circuits.",
                    "A Soft Coarse-Grained Reconfigurable Array Based High-level Synthesis Methodology: Promoting Design Productivity and Exploring Extreme FPGA Frequency.",
                    "FPGA Simulation Engine for Customized Construction of Neural Microcircuit.",
                    "Global Atmospheric Simulation on a Reconfigurable Platform.",
                    "An Approach to a Fully Automated Partial Reconfiguration Design Flow.",
                    "A Multithreaded VLIW Soft Processor Family.",
                    "A Configurable Architecture for a Visual Saliency System and Its Application in Retail.",
                    "The Impact of Hardware Communication on a Heterogeneous Computing System.",
                    "An Evaluation of High-Performance Embedded Processing on MPPAs.",
                    "A Fast and Accurate FPGA-Based Fault Injection System.",
                    "Memory Access Scheduling on the Convey HC-1.",
                    "Exploring Manycore Multinode Systems for Irregular Applications with FPGA Prototyping.",
                    "Global Control and Storage Synthesis for a System Level Synthesis Approach."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th FCCM 2012",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2012",
                "sub_name": "2012 IEEE 20th Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2012, 29 April - 1 May 2012, Toronto, Ontario, Canada.",
                "count": 44,
                "papers": [
                    "A Low-Overhead Profiling and Visualization Framework for Hybrid Transactional Memory.",
                    "Towards a Universal FPGA Matrix-Vector Multiplication Architecture.",
                    "Impact of Cache Architecture and Interface on Performance and Area of FPGA-Based Processor/Parallel-Accelerator Systems.",
                    "Area-Efficient Architectures for Large Integer and Quadruple Precision Floating Point Multipliers.",
                    "Multi-Resolution Real-Time Dense Stereo Vision Processing in FPGA.",
                    "A Mixed Precision Methodology for Mathematical Optimisation.",
                    "Go Ahead: A Partial Reconfiguration Framework.",
                    "On-the-fly Composition of FPGA-Based SQL Query Accelerators Using a Partially Reconfigurable Module Library.",
                    "Fixed Point Lanczos: Sustaining TFLOP-equivalent Performance in FPGAs for Scientific Computing.",
                    "Formic: Cost-efficient and Scalable Prototyping of Manycore Architectures.",
                    "Fast Multi-Objective Algorithmic Design Co-Exploration for FPGA-based Accelerators.",
                    "FLEXDET: Flexible, Efficient Multi-Mode MIMO Detection Using Reconfigurable ASIP.",
                    "FX-SCORE: A Framework for Fixed-Point Compilation of SPICE Device Models Using Gappa++.",
                    "FPGA-based Acceleration for Tracking Audio Effects in Movies.",
                    "ZUMA: An Open FPGA Overlay Architecture.",
                    "Efficient Query Processing for Web Search Engine with FPGAs.",
                    "Power Management Strategies for Serial RapidIO Endpoints in FPGAs.",
                    "Online Measurement of Timing in Circuits: For Health Monitoring and Dynamic Voltage & Frequency Scaling.",
                    "An Extensible and Portable Tool Suite for Managing Multi-Node FPGA Systems.",
                    "Remote Execution in Distributed Memory MPSoC.",
                    "A Heterogeneous Architecture for Evaluating Real-Time One-Dimensional Computational Fluid Dynamics on FPGAs.",
                    "Bluehive - A Field-Programable Custom Computing Machine for Extreme-Scale Real-Time Neural Network Simulation.",
                    "Emulating Mammalian Vision on Reconfigurable Hardware.",
                    "Exploiting Modified Placement and Hardwired Resources to Provide High Reliability in FPGAs.",
                    "A Custom Precision Based Architecture for Accelerating Parallel Tempering MCMC on FPGAs without Introducing Sampling Error.",
                    "Exploiting Memory-Level Parallelism in Reconfigurable Accelerators.",
                    "Hardware Acceleration of Short Read Mapping.",
                    "Short-Read Mapping by a Systolic Custom FPGA Computation.",
                    "FMSA: FPGA-Accelerated ClustalW-Based Multiple Sequence Alignment through Pipelined Prefiltering.",
                    "Accelerating Millions of Short Reads Mapping on a Heterogeneous Architecture with FPGA Accelerator.",
                    "Memory Bandwidth Efficient Two-Dimensional Fast Fourier Transform Algorithm and Implementation for Large Problem Sizes.",
                    "Specifying Compiler Strategies for FPGA-based Systems.",
                    "Bus-based MPSoC Security through Communication Protection: A Latency-efficient Alternative.",
                    "PATS: A Performance Aware Task Scheduler for Runtime Reconfigurable Processors.",
                    "RIFFA: A Reusable Integration Framework for FPGA Accelerators.",
                    "Groundhog - A Serial ATA Host Bus Adapter (HBA) for FPGAs.",
                    "Shortening Design Time through Multiplatform Simulations with a Portable OpenCL Golden-model: The LDPC Decoder Case.",
                    "Accelerating a Random Forest Classifier: Multi-Core, GP-GPU, or FPGA?",
                    "Cognitive Radio Universal Software Hardware.",
                    "Designing Flexible Reconfigurable Regions to Relocate Partial Bitstreams.",
                    "EBRAM - Extending the BlockRAMs in FPGAs to Support Caches and Hash Tables in an Efficient Manner.",
                    "Implementing Murf: Accelerating Large State Space Exploration on FPGAs.",
                    "ScalaPipe: A Streaming Application Generator.",
                    "VENICE: A Compact Vector Processor for FPGA Applications."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th FCCM 2011",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2011",
                "sub_name": "IEEE 19th Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2011, Salt Lake City, Utah, USA, 1-3 May 2011.",
                "count": 48,
                "papers": [
                    "A Sparse Matrix Personality for the Convey HC-1.",
                    "Modeling Dynamically Reconfigurable Systems for Simulation-Based Functional Verification.",
                    "Mixed Precision Processing in Reconfigurable Systems.",
                    "Dynamic Communication in a Coarse Grained Reconfigurable Array.",
                    "Run-Time Resource Allocation for Simultaneous Multi-tasking in Multi-core Reconfigurable Processors.",
                    "An Autonomous Vector/Scalar Floating Point Coprocessor for FPGAs.",
                    "Hecto-Scale Frame Rate Face Detection System for SVGA Source on FPGA Board.",
                    "An FPGA Implementation of Information Theoretic Visual-Saliency System and Its Optimization.",
                    "Scalable, High Performance Fourier Domain Optical Coherence Tomography: Why FPGAs and Not GPGPUs.",
                    "Architecture, Design, and Experimental Evaluation of a Lightfield Descriptor Depth Buffer Algorithm on Reconfigurable Logic and on a GPU.",
                    "Implementation and Performance Analysis of SEAL Encryption on FPGA, GPU and Multi-core Processors.",
                    "FPGA Communication Framework.",
                    "Efficient Calculation of Pairwise Nonbonded Forces.",
                    "High Performance IP Lookup on FPGA with Combined Length-Infix Pipelined Search.",
                    "A Scalable Multi-FPGA Platform for Complex Networking Applications.",
                    "An FPGA-Based Optical IOH Architecture for Embedded System.",
                    "On Comparing Financial Option Price Solvers on FPGA.",
                    "Low-Latency FPGA Based Financial Data Feed Handler.",
                    "Design and Implementation of an FPGA-Based Real-Time Face Recognition System.",
                    "FPGA-Based Solid-State Drive Prototyping Platform.",
                    "Accelerating Statistical LOR Estimation for a High-Resolution PET Scanner Using FPGA Devices and a High Level Synthesis Tool.",
                    "SYSCORE: A Coarse Grained Reconfigurable Array Architecture for Low Energy Biosignal Processing.",
                    "High-Throughput, Lossless Data Compresion on FPGAs.",
                    "HMFlow: Accelerating FPGA Compilation with Hard Macros for Rapid Prototyping.",
                    "Automatic HDL-Based Generation of Homogeneous Hard Macros for FPGAs.",
                    "Using Functional Programming to Generate an LDPC Forward Error Corrector.",
                    "Reconfigurable Data Processing for Clouds.",
                    "TMbox: A Flexible and Reconfigurable 16-Core Hybrid Transactional Memory System.",
                    "The PowerPC 405 Memory Sentinel and Injection System.",
                    "Checkpoint/Restart and Beyond: Resilient High Performance Computing with FPGAs.",
                    "FUSE: Front-End User Framework for O/S Abstraction of Hardware Accelerators.",
                    "Multilevel Granularity Parallelism Synthesis on FPGAs.",
                    "Synthesis of Platform Architectures from OpenCL Programs.",
                    "Programming Real-Time Autofocus on a Massively Parallel Reconfigurable Architecture Using Occam-pi.",
                    "Towards Synthesis-Free JIT Compilation to Commodity FPGAs.",
                    "Automated Placement for Parallelized FPGA FFTs.",
                    "Reducing the Energy Cost of Irregular Code Bases in Soft Processor Systems.",
                    "Extending Force-Directed Scheduling with Explicit Parallel and Timed Constructs for High-Level Synthesis.",
                    "String Matching in Hardware Using the FM-Index.",
                    "Accelerating Phylogeny-Aware Short DNA Read Alignment with FPGAs.",
                    "Scalable Streaming-Array of Simple Soft-Processors for Stencil Computations with Constant Memory-Bandwidth.",
                    "Memory-Efficient IPv4/v6 Lookup on FPGAs Using Distance-Bounded Path Compression.",
                    "A Key Size Configurable High Speed RSA Coprocessor.",
                    "A Model for Peak Matrix Performance on FPGAs.",
                    "Reconsideration of Computing Paradigms and a Novel Reconfigurable Architecture.",
                    "Hybrid Data Structure for IP Lookup in Virtual Routers Using FPGAs.",
                    "FPGA Architecture of Generalized Laguerre-Volterra MIMO Model for Neural Population Spiking Activities.",
                    "Implementation and Performance Comparison of the Motion Compensation Kernel of the AVS Video Decoder on FPGA, GPU and Multicore Processors."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th FCCM 2010",
        "info": "Charlotte, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2010",
                "sub_name": "18th IEEE Annual International Symposium on Field-Programmable Custom Computing Machines, FCCM 2010, Charlotte, North Carolina, USA, 2-4 May 2010.",
                "count": 41,
                "papers": [
                    "Fast and Efficient FPGA-Based Feature Detection Employing the SURF Algorithm.",
                    "Accelerating Viola-Jones Face Detection to FPGA-Level Using GPUs.",
                    "Accelerating the Nonuniform Fast Fourier Transform Using FPGAs.",
                    "Increased Performace of FPGA-Based Color Classification System.",
                    "Pipelined Hardware Architecture for High-Speed Optical Flow Estimation Using FPGA.",
                    "Distributed Hardware-Based Microkernels: Making Heterogeneous OS Functionality a System Primitive.",
                    "Improving the Robustness of a Softcore Processor against SEUs by Using TMR and Partial Reconfiguration.",
                    "Energy-Aware Optimisation for Run-Time Reconfiguration.",
                    "A Communication Aware Online Task Scheduling Algorithm for FPGA-Based Partially Reconfigurable Systems.",
                    "Fine-Grained Partial Runtime Reconfiguration on Virtex-5 FPGAs.",
                    "Combining Duplication, Partial Reconfiguration and Software for On-line Error Diagnosis and Recovery in SRAM-Based FPGAs.",
                    "Hardware Acceleration of Approximate Tandem Repeat Detection.",
                    "Rapid RNA Folding: Analysis and Acceleration of the Zuker Recurrence.",
                    "Reaping the Processing Potential of FPGA on Double-Precision Floating-Point Operations: An Eigenvalue Solver Case Study.",
                    "Performing Floating-Point Accumulation on a Modern FPGA in Single and Double Precision.",
                    "Blocking LU Decomposition for FPGAs.",
                    "Acceleration of a DWT-Based Algorithm for Short Exposure Stellar Images Processing on a HPRC Platform.",
                    "A TDMA Ethernet Switch for Dynamic Real-Time Communication.",
                    "Designing Modular Hardware Accelerators in C with ROCCC 2.0.",
                    "SIRC: An Extensible Reconfigurable Computing Communication API.",
                    "ShapeUp: A High-Level Design Approach to Simplify Module Interconnection on FPGAs.",
                    "Odin II - An Open-Source Verilog HDL Synthesis Tool for CAD Research.",
                    "Automated Precision Analysis: A Polynomial Algebraic Approach.",
                    "FPGA Circuit Synthesis of Accelerator Data-Parallel Programs.",
                    "Impulse C vs. VHDL for Accelerating Tomographic Reconstruction.",
                    "Integrating High-Level Synthesis into MPI.",
                    "Interprocedural Placement-Aware Configuration Prefetching for FPGA-Based Systems.",
                    "BURAQ: A Dynamically Reconfigurable System for Stateful Measurement of Network Traffic.",
                    "A Memory-Efficient and Modular Approach for String Matching on FPGAs.",
                    "A Large-Scale Architecture for Restricted Boltzmann Machines.",
                    "A Heterogeneous FPGA Architecture for Support Vector Machine Training.",
                    "A High-Speed and Memory Efficient Pipeline Architecture for Packet Classification.",
                    "FARM: A Prototyping Environment for Tightly-Coupled, Heterogeneous Architectures.",
                    "Highly Versatile DSP Blocks for Improved FPGA Arithmetic Performance.",
                    "Using the Power Side Channel of FPGAs for Communication.",
                    "Design of a Reconfigurable Hybrid Database System.",
                    "A Comparative Study on the Architecture Templates for Dynamic Nested Loops.",
                    "A Scripting Engine for Combining Design Transformations.",
                    "A Design Methodology for Application Partitioning and Architecture Development of Reconfigurable Multiprocessor Systems-on-Chip.",
                    "Enumeration of Bent Boolean Functions by Reconfigurable Computer.",
                    "DPA Resistant AES on FPGA Using Partial DDL."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th FCCM 2009",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2009",
                "sub_name": "FCCM 2009, 17th IEEE Symposium on Field Programmable Custom Computing Machines, Napa, California, USA, 5-7 April 2009, Proceedings.",
                "count": 47,
                "papers": [
                    "On-Orbit Flight Results from the Reconfigurable Cibola Flight Experiment Satellite (CFESat).",
                    "Accelerating Cosmological Data Analysis with FPGAs.",
                    "FPGA Design Analysis of the Clustering Algorithm for the CERN Large Hadron Collider.",
                    "Accelerating Quadrature Methods for Option Valuation.",
                    "Accelerating SPICE Model-Evaluation using FPGAs.",
                    "FPGA Accelerated Simulation of Biologically Plausible Spiking Neural Networks.",
                    "Generic Software Framework for Adaptive Applications on FPGAs.",
                    "Block, Drop or Roll(back): Alternative Preemption Methods for RH Multi-Tasking.",
                    "Size-Reconfiguration Delay Tradeoffs for a Class of DSP Blocks in Multi-mode Communication Systems.",
                    "CAAD BLASTP: NCBI BLASTP Accelerated with FPGA-Based Accelerated Pre-Filtering.",
                    "RC-BLASTn: Implementation and Evaluation of the BLASTn Scan Function.",
                    "Multi-Core Architecture on FPGA for Large Dictionary String Matching.",
                    "Memory-Efficient Pipelined Architecture for Large-Scale String Matching.",
                    "A Massively Parallel FPGA-Based Coprocessor for Support Vector Machines.",
                    "Application Specific Customization and Scalability of Soft Multiprocessors.",
                    "Benchmarking Reconfigurable Architectures in the Mobile Domain.",
                    "Optical Flow on the Ambric Massively Parallel Processor Array (MPPA).",
                    "Real-Time Fisheye Lens Distortion Correction Using Automatically Generated Streaming Accelerators.",
                    "FPGA-based Monte Carlo Computation of Light Absorption for Photodynamic Cancer Therapy.",
                    "Scalable High Throughput and Power Efficient IP-Lookup on FPGA.",
                    "Architectural Comparison of Instruments for Transaction Level Monitoring of FPGA-Based Packet Processing Systems.",
                    "A Fine-grained Pipelined Implementation of the LINPACK Benchmark on FPGAs.",
                    "Compact and Flexible Microcoded Elliptic Curve Processor for Reconfigurable Devices.",
                    "Non-Preconditioned Conjugate Gradient on Cell and FPGA Based Hybrid Supercomputer Nodes.",
                    "More Flops or More Precision? Accuracy Parameterizable Linear Equation Solvers for Model Predictive Control.",
                    "In-situ FPGA Debug Driven by On-Board Microcontroller.",
                    "Exploiting Matrix Symmetry to Improve FPGA-Accelerated Conjugate Gradient.",
                    "Accelerating the Gauss-Seidel Power Flow Solver on a High Performance Reconfigurable Computer.",
                    "Evaluation of Static Analysis Techniques for Fixed-Point Precision Optimization.",
                    "A Packet Generator on the NetFPGA Platform.",
                    "Shared Memory Cache Organizations for Reconfigurable Computing Systems.",
                    "Exploiting Partially Reconfigurable FPGAs for Situation-Based Reconfiguration in Wireless Sensor Networks.",
                    "Efficient Mapping of Hardware Tasks on Reconfigurable Computers Using Libraries of Architecture Variants.",
                    "Minimizing Internal Fragmentation by Fine-Grained Two-Dimensional Module Placement for Runtime Reconfiguralble Systems.",
                    "Acceleration and Energy Efficiency of a Geometric Algebra Computation using Reconfigurable Computers and GPUs.",
                    "FPGA Floating Point Datapath Compiler.",
                    "A Parameterized Stereo Vision Core for FPGAs.",
                    "FPGA Implementation of a Single-Precision Floating-Point Multiply-Accumulator with Single-Cycle Accumulation.",
                    "AIREN: A Novel Integration of On-Chip and Off-Chip FPGA Networks.",
                    "IMORC: Application Mapping, Monitoring and Optimization for High-Performance Reconfigurable Computing.",
                    "Optimal Placement-aware Trace-Based Scheduling of Hardware Reconfigurations for FPGA Accelerators.",
                    "Employment of Reduced Precision Redundancy for Fault Tolerant FPGA Applications.",
                    "High-End Reconfigurable Systems for Fast Windows' Password Cracking.",
                    "Application Experiments: MPPA and FPGA.",
                    "FPGA Implementation of the Interior-Point Algorithm with Applications to Collision Detection.",
                    "Design Exploration for FPGA-Based Multiprocessor Architecture: JPEG Encoding Case Study.",
                    "An FPGA Implementation for Solving Least Square Problem."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th FCCM 2008",
        "info": "Stanford, Palo Alto, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2008",
                "sub_name": "16th IEEE International Symposium on Field-Programmable Custom Computing Machines, FCCM 2008, 14-15 April 2008, Stanford, Palo Alto, California, USA.",
                "count": 51,
                "papers": [
                    "Kiwi: Synthesis of FPGA Circuits from Parallel Programs.",
                    "Hardware Scripting in Gel.",
                    "Performance Analysis with High-Level Languages for High-Performance Reconfigurable Computing.",
                    "A SRAM-based Architecture for Trie-based IP Lookup Using FPGA.",
                    "A Scalable High Throughput Firewall in FPGA.",
                    "A Memory-Efficient FPGA-based Classification Engine.",
                    "The Effectiveness of Configuration Merging in Point-to-Point Networks for Module-based FPGA Reconfiguration.",
                    "Autonomous System on a Chip Adaptation through Partial Runtime Reconfiguration.",
                    "Scheduling Intervals for Reconfigurable Computing.",
                    "DSPs, BRAMs and a Pinch of Logic: New Recipes for AES on FPGAs.",
                    "High-Speed Elliptic Curve Cryptography Accelerator for Koblitz Curves.",
                    "An FPGA Implementation of Explicit-State Model Checking.",
                    "Power-Aware and Branch-Aware Word-Length Optimization.",
                    "Simultaneous Retiming and Placement for Pipelined Netlists.",
                    "Map-reduce as a Programming Model for Custom Computing Machines.",
                    "FPGA-Based Co-processor for Singular Value Array Reconciliation Tomography.",
                    "Real-Time Optical Flow Calculations on FPGA and GPU Architectures: A Comparison Study.",
                    "Multiobjective Optimization of FPGA-Based Medical Image Registration.",
                    "Scaling Soft Processor Systems.",
                    "Reconfigurable Work Farms on a Massively Parallel Processor Array.",
                    "Titan-R: A Reconfigurable Hardware Implementation of a High-Speed Compressor.",
                    "Credit Risk Modelling using Hardware Accelerated Monte-Carlo Simulation.",
                    "Sparse Matrix-Vector Multiplication on a Reconfigurable Supercomputer.",
                    "An Efficient O(1) Priority Queue for Large FPGA-Based Discrete Event Simulations of Molecular Dynamics.",
                    "Analysis of a Dynamically Reconfigurable Dataflow Architecture and its Scalable Parallel Extension for Multi-FPGA Platforms.",
                    "Improving Performance of Partial Reconfiguration Using Strategy of Virtual Deletion.",
                    "ShareStreams-V: A Virtualized QoS Packet Scheduling Accelerator.",
                    "An Extensible I/O Subsystem.",
                    "Multi-stage Pipelining MD5 Implementations on FPGA with Data Forwarding.",
                    "MPLEM: An 80-processor FPGA Based Multiprocessor System.",
                    "An Area-Efficient Timing-Driven Routing Algorithm for Scalable FPGAs with Time-Multiplexed Interconnects.",
                    "SMILE: Scientific Parallel Multiprocessing based on Low-Cost Reconfigurable Hardware.",
                    "Reconfigurable Constraint Repetition Unit for Regular Expression Matching.",
                    "Fast Multivariate Signature Generation in Hardware: The Case of Rainbow.",
                    "Configurable Flow Models for FPGA Particle Graphics Engines.",
                    "Runtime Filesystem Support for Reconfigurable FPGA Hardware Processes in BORPH.",
                    "Efficient Reconfigurable On-Chip Buses for FPGAs.",
                    "Investigation of Programming Models for Emerging FPGA-Based High Performance Computing Systems.",
                    "Hardware Compilation from Machine Code with M2V.",
                    "An Implementation of the Conjugate Gradient Algorithm on FPGAs.",
                    "FPGA Session Control (FSC): Providing Remote Access to a Cluster of FPGAs.",
                    "Reconfigurable Computing Cluster Project: Phase I Brief.",
                    "Scalable and Portable Architecture for Probability Density Function Estimation on FPGAs.",
                    "A Hardware Efficient Support Vector Machine Architecture for FPGA.",
                    "Optimization of Routing and Reconfiguration Overhead in Programmable Processor Array Architectures.",
                    "Matrix Computations on Heterogeneous Reconfigurable Systems.",
                    "System Level Design Methodology for Hybrid Multi-Processor SoC on FPGA.",
                    "A New Powerful Scalable Generic Multi-Standard LDPC Decoder Architecture.",
                    "An Efficient Implementation of a Phase Unwrapping Kernel on Reconfigurable Hardware.",
                    "Facilitating Processor-Based DPR Systems for non-DPR Experts.",
                    "Combining Rewriting-Logic, Architecture Generation, and Simulation to Exploit Coarse-Grained Reconfigurable Architectures."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th FCCM 2007",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2007",
                "sub_name": "IEEE Symposium on Field-Programmable Custom Computing Machines, FCCM 2007, 23-25 April 2007, Napa, California, USA.",
                "count": 57,
                "papers": [
                    "Sampling from the Multivariate Gaussian Distribution using Reconfigurable Hardware.",
                    "A Fast FPGA-Based 2-Opt Solver for Small-Scale Euclidean Traveling Salesman Problem.",
                    "On the Acceleration of Shortest Path Calculations in Transportation Networks.",
                    "Enhancing Relocatability of Partial Bitstreams for Run-Time Reconfiguration.",
                    "A Library and Platform for FPGA Bitstream Manipulation.",
                    "A Structural Object Programming Model, Architecture, Chip and Tools for Reconfigurable Computing.",
                    "Configurable Transactional Memory.",
                    "A Reconfigurable Hardware Interface for a Modern Computing System.",
                    "FPGA Acceleration of Gene Rearrangement Analysis.",
                    "FPGA-accelerated seed generation in Mercury BLASTP.",
                    "Systolic Architecture for Computational Fluid Dynamics on FPGAs.",
                    "FPGA-Based Multigrid Computation for Molecular Dynamics Simulations.",
                    "Reconfigurable Computing Cluster (RCC) Project: Investigating the Feasibility of FPGA-Based Petascale Computing.",
                    "Efficient Mapping of Dimensionality Reduction Designs onto Heterogeneous FPGAs.",
                    "K-means Clustering for Multispectral Images Using Floating-Point Divide.",
                    "Optimizing Logarithmic Arithmetic on FPGAs.",
                    "Generating FPGA-Accelerated DFT Libraries.",
                    "An FPGA implementation of pipelined multiplicative division with IEEE Rounding.",
                    "Integer Factorization Based on Elliptic Curve Method: Towards Better Exploitation of Reconfigurable Hardware.",
                    "Matched Filter Computation on FPGA, Cell and GPU.",
                    "A Data-Driven Approach for Pipelining Sequences of Data-Dependent Loops.",
                    "Writing Portable Applications that Dynamically Bind at Run Time to Reconfigurable Hardware.",
                    "Mitrion-C Application Development on SGI Altix 350/RC100.",
                    "Automatic On-chip Memory Minimization for Data Reuse.",
                    "Scientific Application Acceleration with Reconfigurable Functional Units.",
                    "Design and Implementation of a Highly Parameterised FPGA-Based Skeleton for Pairwise Biological Sequence Alignment.",
                    "The Case for Dynamic Execution on Dynamic Hardware.",
                    "On Solving RC5 Challenges with FPGAs.",
                    "Operating System Integration and Performance of a Multi Stream Cipher Architecture for Reconfigurable System-on-Chip.",
                    "A Novel Technique to Create Energy-Efficient Contexts for Reconfigurable Logic.",
                    "New Protection Mechanisms for Intellectual Property in Reconfigurable Logic.",
                    "Establishing Chain of Trust in Reconfigurable Hardware.",
                    "Hand-based Interface for Augmented Reality.",
                    "Discrete-Time Cellular Neural Networks in FPGA.",
                    "Run-time mapping and communication strategies for Homogeneous NoC-Based MPSoCs.",
                    "Code Compressor and Decompressor for Ultra Large Instruction Width Coarse-Grain Reconfigurable Systems.",
                    "Software/Hardware Co-Scheduling for Reconfigurable Computing Systems.",
                    "Mapping Real Time Operating System on Reconfigurable Instruction Cell Based Architectures.",
                    "Abstracting Modern FCCMs To Provide a Single Interface to Architectural Resources.",
                    "A Novel Technique to Create Energy-Efficient Contexts for Reconfigurable Logic.",
                    "Heterogeneous Floorplanner for FPGA.",
                    "Automatic Self-Reconfiguration of System-on-Chip Peripherals.",
                    "A Hybrid Memory Sub-system for Video Coding Applications.",
                    "Rapid Prototyping of Large-scale Analog Circuits With Field Programmable Analog Array.",
                    "PixelStreams-based implementation of videodetector.",
                    "Design Space Exploration for the BLAST Algorithm Implementation.",
                    "An Integrated Video Compression, Encryption and Information Hiding Architecture based on the SCAN Algorithm and the Stretch Technology.",
                    "A Configurable Processor Synthesis System.",
                    "Low-Cost Stereo Vision on an FPGA.",
                    "Methodology and Experimental Setup for the Determination of System-level Dynamic Reconfiguration Overhead.",
                    "Quantifying Effective Memory Bandwidth of Platform FPGAs.",
                    "A Flexible Filter Processor for Fading Channel Simulation.",
                    "RBoot: Software Infrastructure for a Remote FPGA Laboratory.",
                    "Jumble: A Hardware-in-the-Loop Simulation System for JHDL.",
                    "Sparse Matrix-Vector Multiplication Design on FPGAs.",
                    "Changing Output Quality for Thermal Management.",
                    "Hardware/Software co-design of a key point detector on FPGA."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th FCCM 2006",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2006",
                "sub_name": "14th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2006), 24-26 April 2006, Napa, CA, USA, Proceedings.",
                "count": 66,
                "papers": [
                    "A Hybrid Approach for Mapping Conjugate Gradient onto an FPGA-Augmented Reconfigurable Supercomputer.",
                    "A case study in porting a production scientific supercomputing application to a reconfigurable computer.",
                    "Hardware/Software Approach to Molecular Dynamics on Reconfigurable Computers.",
                    "Virtual Embedded Blocks: A Methodology for Evaluating Embedded Elements in FPGAs.",
                    "Automated Generation of Hardware Accelerators with Direct Memory Access from ANSI/ISO Standard C Functions.",
                    "Efficient Hardware Generation of Random Variates with Arbitrary Distributions.",
                    "An Architecture for Efficient Hardware Data Mining using Reconfigurable Computing Systems.",
                    "Automatic Sliding Window Operation Optimization for FPGA-Based.",
                    "Enabling a Uniform Programming Model Across the Software/Hardware Boundary.",
                    "A Type Architecture for Hybrid Micro-Parallel Computers.",
                    "A Scalable FPGA-based Multiprocessor.",
                    "A Reconfigurable Distributed Computing Fabric Exploiting Multilevel Parallelism.",
                    "A Multithreaded Soft Processor for SoPC Area Reduction.",
                    "GraphStep: A System Architecture for Sparse-Graph Algorithms.",
                    "Hardware/Software Integration for FPGA-based All-Pairs Shortest-Paths.",
                    "A Field Programmable RFID Tag and Associated Design Flow.",
                    "Combining Instruction Coding and Scheduling to Optimize Energy in System-on-FPGA.",
                    "Power Visualization, Analysis, and Optimization Tools for FPGAs.",
                    "Systematic Characterization of Programmable Packet Processing Pipelines.",
                    "Packet Switched vs. Time Multiplexed FPGA Overlay Networks.",
                    "Single Pass, BLAST-Like, Approximate String Matching on FPGAs.",
                    "An FPGA Solution for Radiation Dose Calculation.",
                    "A Parallel Hardware Architecture for fast Gaussian Elimination over GF(2).",
                    "Advanced Components in the Variable Precision Floating-Point Library.",
                    "Pipelined Mixed Precision Algorithms on FPGAs for Fast and Accurate PDE Solvers from Low Precision Components.",
                    "ASC-Based Acceleration in an FPGA with a Processor Core Using Software-Only Skills.",
                    "COMMA: A Communications Methodology for Dynamic Module Reconfiguration in FPGAs.",
                    "A Novel Hueristic and Provable Bounds for Reconfigurable Architecture Design.",
                    "Defect-Tolerant Nanocomputing Using Bloom Filters.",
                    "A Programmable, Maximal Throughput Architecture for Neighborhood Image Processing.",
                    "VPN Acceleration Using Reconfigurable System-On-Chip Technology.",
                    "An Optimized Finite Difference Computing Engine on FPGAs.",
                    "Highly Efficient String Matching Circuit for IDS with FPGA.",
                    "Effects of High-Level Discrete Signal Transform Formulations on Partitioning for Multi-FPGA Architectures.",
                    "Scheduling divisible loads on partially reconfigurable hardware.",
                    "General Architecture for Hardware Implementation of Genetic Algorithm.",
                    "Sparse Matrix-Vector Multiplication for Finite Element Method Matrices on FPGAs.",
                    "Scalable Softcore Vector Processor for Biosequence Applications.",
                    "Generating Parametrised Hardware Libraries from Higher-Order Descriptions.",
                    "Technology Mapping for Field Programmable Gate Arrays using Content-Addressable Memory (CAM).",
                    "Rapid Design of Special-Purpose Pipeline Processors with FPGAs and its Application to Computational Fluid Dynamics.",
                    "Floating-Point Accumulation Circuit for Matrix Applications.",
                    "Application-Specific Memory Interleaving Enables High Performance in FPGA-based Grid Computations.",
                    "A Task Graph Approach for Efficient Exploitation of Reconfiguration in Dynamically Reconfigurable Systems.",
                    "A Low-Energy Reconfigurable Fabric for the SuperCISC Architecture.",
                    "COPACOBANA A Cost-Optimized Special-Purpose Hardware for Code-Breaking.",
                    "FPGAs, GPUs and the PS2 - A Single Programming Methodology.",
                    "Integrating FPGA Acceleration into the Protomol Molecular Dynamics Code: Preliminary Report.",
                    "A Co-Verification Tool for a High Level Language Compiler for FPGAs.",
                    "Parrotfish: Task Distribution in a Low Cost Autonomous ad hoc Sensor Network through Dynamic Runtime Reconfiguration.",
                    "Intrinsic Hardware Evolution of Neural Networks in Reconfigurable Analogue and Digital Devices.",
                    "The STAR-C Truth: Analyzing Reconfigurable Supercomputing Reliability.",
                    "Pre-synthesis Queue Size Estimation of Streaming Data Flow Graphs.",
                    "Hierarchical Clustering using Reconfigurable Devices.",
                    "CAD Tool for FPGAs with Embedded Hard Cores for Design Space Exploration of Future Architectures.",
                    "A Scalable Architecture for RSA Cryptography on Large FPGAs.",
                    "Design of a Reconfigurable Processor for NIST Prime Field ECC.",
                    "Switch Box Architectures for Three-Dimensional FPGAs.",
                    "A Scalable Hybrid Regular Expression Pattern Matcher.",
                    "Hardware/Software Co-Design Architecture for Lattice Decoding Algorithms.",
                    "High Performance Feature Detection on a Reconfigurable Co-Processor.",
                    "DSynth: A Pipeline Synthesis Environment for FPGAs.",
                    "Template-Based Generation of Streaming Accelators from a High Level Presentation.",
                    "Scalable Hardware Architecture for Real-Time Dynamic Programming Applications.",
                    "Open Source High Performance Floating-Point Modules.",
                    "A Reconfigurable Cluster-on-Chip Architecture with MPI Communication Layer."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th FCCM 2005",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2005",
                "sub_name": "13th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2005), 17-20 April 2005, Napa, CA, USA, Proceedings.",
                "count": 60,
                "papers": [
                    "Conference Organizers.",
                    "Efficient Hardware Data Mining with the Apriori Algorithm on FPGAs.",
                    "A Novel 2D Filter Design Methodology for Heterogeneous Devices.",
                    "Prototyping Architectural Support for Program Rollback Using FPGAs.",
                    "Register File Architecture Optimization in a Coarse-Grained Reconfigurable Architecture.",
                    "Handling Different Computational Granularity by a Reconfigurable IC Featuring Embedded FPGAs and a Network-on-Chip.",
                    "A Study of the Scalability of On-Chip Routing for Just-in-Time FPGA Compilation.",
                    "Simplifying the Integration of Processing Elements in Computing Systems Using a Programmable Controller.",
                    "Evaluation of Code Generation Strategies for Scalar Replaced Codes in Fine-Grain Configurable Architectures.",
                    "FPGA Particle Graphics Hardware.",
                    "Reconfigurable Designs for Radiosity.",
                    "Hardware Factorization Based on Elliptic Curve Method.",
                    "Metropolitan Road Traffic Simulation on FPGAs.",
                    "Time Domain Numerical Simulation for Transient Waves on Reconfigurable Coprocessor Platform.",
                    "COMA: A COoperative MAnagement Scheme for Energy Efficient Implementation of Real-Time Operating Systems on FPGA Based Soft Processors.",
                    "An Execution Environment for Reconfigurable Computing.",
                    "Higher Radix Floating-Point Representations for FPGA-Based Arithmetic.",
                    "An Analysis of the Double-Precision Floating-Point FFT on FPGAs.",
                    "A Comparison of Floating Point and Logarithmic Number Systems for FPGAs.",
                    "Terrestrial-Based Radiation Upsets: A Cautionary Tale.",
                    "Automating the Layout of Reconfigurable Subsystems Using Circuit Generators.",
                    "Fast Reconfiguring Deep Packet Filter for 1+ Gigabit Network.",
                    "A Framework for Rule Processing in Reconfigurable Network Systems.",
                    "A Signature Match Processor Architecture for Network Intrusion Detection.",
                    "Interleaving Behavioral and Cycle-Accurate Descriptions for Reconfigurable Hardware Compilation.",
                    "Modeling and FPGA Implementation of Applications Using Parameterized Process Networks with Non-Static Parameters.",
                    "A BIST Approach for Testing FPGAs Using JBITS.",
                    "Preliminary Report: FPGA Acceleration of Molecular Dynamics Computations.",
                    "A High-Performance Asynchronous FPGA: Test Results.",
                    "Considering Run-Time Reconfiguration Overhead in Task Graph Transformations for Dynamically Reconfigurable Architectures.",
                    "RAVIOLI - Reconfigurable Arithmetic Variable-Precision Implementations of On-Line Instructions.",
                    "FIFO Communication Models in Operating Systems for Reconfigurable Computing.",
                    "Astrophysical Hydrodynamics Simulations on a Reconfigurable System.",
                    "Post Synthesis Level Power Modeling of FPGAs.",
                    "FPGA-Based CDMA Switch for Networks-on-Chip.",
                    "Design of Networked Reconfigurable Encryption Engine.",
                    "A Virtual Machine for Merit-Based Runtime Reconfiguration.",
                    "Automatic Creation of Domain-Specific Reconfigurable CPLDs for SoC.",
                    "The GAPLA: A Globally Asynchronous Locally Synchronous FPGA Architecture.",
                    "Optimizing Technology Mapping for FPGAs Using CAMs.",
                    "An Architecture for Video Compression Based on the SCAN Algorithm.",
                    "An Open TCP/IP Core for Reconfigurable Logic.",
                    "Mutable Codesign for Embedded Protocol Processing.",
                    "Accelerating Applications by Mapping Critical Kernels on Coarse-Grain Reconfigurable Hardware in Hybrid Systems.",
                    "An Embedded Reconfigurable Datapath for SoC.",
                    "Systolic Architecture for Computing the Discrete Fourier Transform on FPGAs.",
                    "Hardware Solution to Java Compressed Heap.",
                    "A General Purpose, Highly Efficient Communication Controller Architecture for Hardware Acceleration Platforms.",
                    "Parallel Hardware Implementation of Cellular Learning Automata Based Evolutionary Computing (CLA-EC) on FPGA.",
                    "Performance and Cost Analysis of Time-Multiplexed Execution on the Dynamically Reconfigurable Processor.",
                    "A System-on-Programmable Chip Approach for MIMO Sphere Decoder.",
                    "The Erlangen Slot Machine: A Highly Flexible FPGA-Based Reconfigurable Platform.",
                    "Caronte: A Complete Methodology for the Implementation of Partially Dynamically Self-Reconfiguring Systems on FPGA Platforms.",
                    "High-Performance FPGA-Based General Reduction Methods.",
                    "Core-Based Methodology: An Automated Approach for Implementing a Complete System from Algorithms to a Heterogeneous Network including FPGAs.",
                    "The DARPA Dynamic Programming Benchmark on a Reconfigurable Computer.",
                    "Massively Parallel Processors Generator for Reconfigurable System.",
                    "FPGA-Based Vector Processing for Solving Sparse Sets of Equations.",
                    "Exploiting Multi-Grained Parallelism in Reconfigurable SBC Architectures.",
                    "On Distributed Reconfigurable Systems: Open Problems and Some Initial Solutions."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th FCCM 2004",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2004",
                "sub_name": "12th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2004), 20-23 April 2004, Napa, CA, USA, Proceedings.",
                "count": 58,
                "papers": [
                    "Time-Critical Software Deceleration in an FCCM.",
                    "Design Patterns for Reconfigurable Computing.",
                    "Virtual Memory Window for a Portable Reconfigurable Cryptography Coprocessor.",
                    "Overview of the FREEDOM Compiler for Mapping DSP Software to FPGAs.",
                    "PyGen: A MATLAB/Simulink Based Tool for Synthesizing Parameterized and Energy Efficient Designs Using FPGAs.",
                    "Automated Least-Significant Bit Datapath Optimization for FPGAs.",
                    "An Arithmetic Library and Its Application to the N-body Problem.",
                    "Unifying Bit-Width Optimisation for Fixed-Point and Floating-Point Designs.",
                    "A Dynamically-Reconfigurable, Power-Efficient Turbo Decoder.",
                    "A Flexible Hardware Encoder for Low-Density Parity-Check Codes.",
                    "ShareStreams: A Scalable Architecture and Hardware Support for High-Speed QoS Packet Schedulers.",
                    "Deep Packet Filter with Dedicated Logic and Read Only Memories.",
                    "A Methodology for Synthesis of Efficient Intrusion Detection Systems on FPGAs.",
                    "Smart Camera Based on Reconfigurable Hardware Enables Diverse Real-Time Applications.",
                    "FPGA-Based Acceleration of the 3D Finite-Difference Time-Domain Method.",
                    "Register Binding for FPGAs with Embedded Memory.",
                    "Defect and Fault Tolerance of Reconfigurable Molecular Computing.",
                    "Communications Scheduling for Concurrent Processes on Reconfigurable Computers.",
                    "Reconfigurable Molecular Dynamics Simulator.",
                    "Accelerating Seismic Migration Using FPGA-Based Coprocessor Platform.",
                    "Closing the Gap: CPU and FPGA Trends in Sustainable Floating-Point BLAS Performance.",
                    "FPGA-Based Implementation of a Robust IEEE-754 Exponential Unit.",
                    "Design of an On-Line IEEE Floating-Point Addition Unit for FPGAs.",
                    "Scalable Pattern Matching for High Speed Networks.",
                    "Pre-Decoded CAMs for Efficient and High-Speed NIDS Pattern Matching.",
                    "A Structured System Methodology for FPGA Based System-on-A-Chip Design.",
                    "Fine-Tuning Loop-Level Parallelism for Increasing Performance of DSP Applications on FPGAs.",
                    "Accelerating DSP Applications on a Mixed Granularity Platform with a New Reconfigurable Coarse-Grain Data-Path.",
                    "Hardware-in-the-Loop Evolution of a 3-bit Multiplier.",
                    "FPGA Montgomery Multiplier Architectures - A Comparison.",
                    "Design Methodology of a Configurable System-on-Chip Architecture.",
                    "Word-Length Optimization of Folded Polynomial Evaluation.",
                    "Migrating Functionality from ROMS to Embedded Multipliers.",
                    "A Quantitative Comparison of Reconfigurable, Tiled, and Conventional Architectures on Bit-Level Computation.",
                    "Validation of an Advanced Encryption Standard (AES) IP Core.",
                    "Unidirectional Switch-Boxes for Synthesizable Reconfigurable Arrays.",
                    "The MOLEN Processor Prototype.",
                    "FPGA Acceleration of Rigid Molecule Interactions.",
                    "A Single Program Multiple Data Parallel Processing Platform for FPGAs.",
                    "Hyperreconfigurable Architectures for Fast Run Time Reconfiguration.",
                    "A Generator of High-Speed Floating-Point Modules.",
                    "A 21.54 Gbits/s Fully Pipelined AES Processor on FPGA.",
                    "An FPGA Interpolation Processor for Soft-Decision Reed-Solomon Decoding.",
                    "Buffer Schemes for Runtime Reconfiguration of Function Variants in Communication Systems.",
                    "FPGA Based Network Intrusion Detection using Content Addressable Memories.",
                    "Using FIFOs in Hardware-Software Co-Design for FPGA Based Embedded Systems.",
                    "A Reconfigurable SoC Architecture and Caching Scheme for 3D Medical Image Processing.",
                    "Implementation Results of Bloom Filters for String Matching.",
                    "An FPGA Implementation for a High Throughput Adaptive Filter Using Distributed Arithmetic.",
                    "Power Management for FPGAs: Power-Driven Design Partitioning.",
                    "Implementing and Evaluating Stream Applications on the Dynamically Reconfigurable Processor.",
                    "FPGA based Embedded Processing Architecture for the QRD-RLS Algorithm.",
                    "A Dataflow Control Unit for C-to-Configurable Pipelines Compilation Flow.",
                    "Secure Remote Control of Field-programmable Network Devices.",
                    "An Alternate Wire Database for Xilinx FPGAs.",
                    "Duty Cycle Aware Application Design using FPGAs.",
                    "Automating the Layout of Reconfigurable Subsystems Via Template Reduction.",
                    "Efficient Execution of Process Networks on a Reconfigurable Hardware Virtual Machine."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th FCCM 2003",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2003",
                "sub_name": "11th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2003), 8-11 April 2003, Napa, CA, USA, Proceedings.",
                "count": 47,
                "papers": [
                    "A High I/O Reconfigurable Crossbar Switch.",
                    "Congruential Sieves on a Reconfigurable Computer.",
                    "Performance Analysis of Fixed, Reconfigurable, and Custom Architectures for the SCAN Image and Video Encryption Algorithm.",
                    "Implementation of a Content-Scanning Module for an Internet Firewall.",
                    "Compiling Policy Descriptions into Reconfigurable Firewall Processors.",
                    "Compact FPGA-based True and Pseudo Random Number Generators.",
                    "Accelerating Bit Error Rate Testing Using a System Level Design Tool.",
                    "A Hardware Gaussian Noise Generator for Channel Code Evaluation.",
                    "Perturbation Analysis for Word-length Optimization.",
                    "Improved Small Multiplier Based Multiplication, Squaring and Division.",
                    "Efficient Application Representation for HASTE: Hybrid Architectures with a Single, Transformable Executable.",
                    "Issues and Approaches to Coarse-Grain Reconfigurable Architecture Development.",
                    "Asynchronous PipeRench: Architecture and Performance Estimations.",
                    "The Reliability of FPGA Circuit Designs in the Presence of Radiation Induced Configuration Upsets.",
                    "Adaptive Fault Recovery for Networked Reconfigurable Systems.",
                    "Gamma-Ray Pulsar Detection using Reconfigurable Computing Hardware.",
                    "Design and Implementation of a Generic 2-D Orthogonal Discrete Wavelet Transform on FPGA.",
                    "Runtime Assignment of Reconfigurable Hardware Components for Image Processing Pipelines.",
                    "Floating Point Unit Generation and Evaluation for FPGAs.",
                    "Tradeoffs of Designing Floating-Point Division and Square Root on Virtex FPGAs.",
                    "Data Search and Reorganization Using FPGAs: Application to Spatial Pointer-based Data Structures.",
                    "Simulation and Synthesis of CSP-based Interprocess Communication.",
                    "Source Level Debugger for the Sea Cucumber Synthesizing Compiler.",
                    "Performance Modeling of Reconfigurable SoC Architectures and Energy-Efficient Mapping of a Class of Applications.",
                    "Reconfigurable Computing Application Frameworks.",
                    "Automatic Conversion of Floating Point MATLAB Programs into Fixed Point FPGA Based Hardware Design.",
                    "Fast Reconfiguration Through Difference Compression.",
                    "FPGA-based SIMD Processor.",
                    "Implementation of Three-Dimensional FPGA-Based FDTD Solvers: An Architectural Overview.",
                    "A Pipelined SoPC Architecture for 2.5 Gbps Network Processing.",
                    "A Novel FIR Filter Architecture for Efficient Signal Boundary Handling on Xilinx VIRTEX FPGAs.",
                    "Reconfigurable High Resolution Network Camera.",
                    "Application of Task Concurrency Management on Dynamically Reconfigurable Hardware Platforms.",
                    "A Logic Based Hardware Development Environment.",
                    "Standardizing the Performance Assessment of Reconfigurable Processor Architectures.",
                    "An Automated and Power-Aware Framework for Utilization of IP Cores in Hardware Generated from C Descriptions Targeting FPGAs.",
                    "A Configurable Network Protocol for Cluster Based Communications using Modular Hardware Primitives on an Intelligent NIC.",
                    "Fabric-Based Systems: Model, Tools, Applications.",
                    "An Estimation and Simulation Framework for Energy Efficient Design using Platform FPGAs.",
                    "Exploiting Reconfigurable Hardware for Network Security.",
                    "A Second Generation Embedded Reconfigurable Input Device for Kinetically Challenged Persons.",
                    "Performance and Area Modeling of Complete FPGA Designs in the presence of Loop Transformations.",
                    "Synthesis and Estimation of Memory Interfaces for FPGA-based Reconfigurable Computing Engines.",
                    "Linear Placement for Static / Dynamic Reconfiguration in JBits.",
                    "Real-time Extensions to a C-like Hardware Description Language.",
                    "RSA encryption using Extended Modular Arithmetic on the Quicksilver COSM Adaptive Computing Machine.",
                    "Kernel Formation in Garpcc."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th FCCM 2002",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2002",
                "sub_name": "10th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2002), 22-24 April 2002, Napa, CA, USA, Proceedings.",
                "count": 44,
                "papers": [
                    "Image Registration of Real-Time Video Data Using the SONIC Reconfigurable Computer Platform.",
                    "A Massively Parallel RC4 Key Search Engine.",
                    "An FPGA Implementation of Triangle Mesh Decompression.",
                    "Single-Chip Gigabit Mixed-Version IP Router on Virtex-II Pro.",
                    "Control and Configuration Software for a Reconfigurable Networking Hardware Platform.",
                    "Peer-to-Peer Hardware-Software Interfaces for Reconfigurable Fabrics.",
                    "PAM-Blox II: Design and Evaluation of C++ Module Generation for Computing with FPGAs.",
                    "Coarse-Grain Pipelining on Multiple FPGA Architectures.",
                    "FPGA-Based Template Matching Using Distance Transforms.",
                    "Reconfigurable Shape-Adaptive Template Matching Architectures.",
                    "Assisting Network Intrusion Detection with Reconfigurable Hardware.",
                    "GRIP: A Reconfigurable Architecture for Host-Based Gigabit-Rate Packet Processing.",
                    "Design and Analysis of a Layer Seven Network Processor Accelerator Using Reconfigurable Logic.",
                    "Using On-Chip Configurable Logic to Reduce Embedded System Software Energy.",
                    "Queue Machines: Hardware Compilation in Hardware.",
                    "Custom Computing Machines for the Set Covering Problem.",
                    "Analysis and Implementation of the Discrete Element Method Using a Dedicated Highly Parallel Architecture in Reconfigurable Computing.",
                    "Using Floating-Point Arithmetic on FPGAs to Accelerate Scientific N-Body Simulations.",
                    "Mobile Memory: Improving Memory Locality in Very Large Reconfigurable Fabrics.",
                    "Hardware-Assisted Fast Routing.",
                    "Optimum Wordlength Allocation.",
                    "Précis: A Design-Time Precision Analysis Tool.",
                    "Fast Area Estimation to Support Compiler Optimizations in FPGA-Based Reconfigurable Systems.",
                    "Hyperspectral Image Compression on Reconfigurable Platforms.",
                    "MPEG-Compliant Entropy Decoding on FPGA-Augmented TriMedia/CPU64.",
                    "On Sparse Matrix-Vector Multiplication with FPGA-Based System.",
                    "Implementing a Simple Continuous Speech Recognition System on an FPGA.",
                    "RACER - A Rapid Prototyping Accelerator for Pulsed Neural Networks.",
                    "Accelerating Radiosity Calculations Using Reconfigurable Platforms.",
                    "On Implementing a Configware/Software SAT Solver.",
                    "Reconfigurable Object Detection in FLIR Image Sequences.",
                    "TCP-Stream Reassembly and State Tracking in Hardware.",
                    "Fast and Guaranteed C Compilation onto the PACT-XPP? Reconfigurable Computing Platform.",
                    "Module Generators Driving the Compilation for Adaptive Computing Systems.",
                    "System-Level Modelling and Implementation Technique for Run-Time Reconfigurable Systems.",
                    "Tabu Search with Intensification Strategy for Functional Partitioning in Hardware-Software Codesign.",
                    "Automatic Latency-Optimal Design of FPGA-Based Systolic Arrays.",
                    "Compiling ATR Probing Codes for Execution on FPGA Hardware.",
                    "The Effects of Datapath Placement and C-Slow Retiming on Three Computational Benchmarks.",
                    "A Scalable FPGA-Based Custom Computing Machine for a Medical Image Processing.",
                    "The Design of the Amalgam Reconfigurable Cluster.",
                    "Mapping Algorithms to the Amalgam Programmable-Reconfigurable Processor.",
                    "Customising Floating-Point Designs.",
                    "Mapping Multi-Mode Circuits to LUT-Based FPGA Using Embedded MUXes."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th FCCM 2001",
        "info": "Rohnert Park, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2001",
                "sub_name": "The 9th Annual IEEE Symposium on Field-Programmable Custom Computing Machines, FCCM 2001, Rohnert Park, California, USA, April 29 - May 2, 2001.",
                "count": 46,
                "papers": [
                    "Parallelization of MATLAB Applications for a Multi-FPGA System.",
                    "Automatic Mapping of Multiple Applications to Multiple Adaptive Computing Systems.",
                    "Parameterized Module Generator for an FPGA-Based Electronic Cochlea.",
                    "Novel Algorithm Combining Temporal Partitioning and Sharing of Functional Units.",
                    "Instrumenting Bitstreams for Debugging FPGA Circuits.",
                    "The Multiple Wordlength Paradigm.",
                    "FPGA Implementation of Pipelined On-Line Scheme for 3-D Vector Normalization.",
                    "A Reconfigurable Co-Processor for Variable Long Precision Arithmetic Using Indian Algorithms.",
                    "An Efficient Content-Addressable Memory Implementation Using Dynamic Routing.",
                    "Lava and JBits: From HDL to Bitstream in Seconds.",
                    "Architecture and Application of PLATO, A Reconfigurable Active Network Platform.",
                    "Totem: Custom Reconfigurable Array Generation.",
                    "A Cellular Automata System with FPGA.",
                    "A Fault-Tolerance Scheme for a MIN-Based Multi-Sensor System.",
                    "Column-Based Precompiled Configuration Techniques for FPGA.",
                    "Configuration Compression for Virtex FPGAs.",
                    "An 8x8 IDCT Implementation on an FPGA-Augmented TriMedia.",
                    "Pilchard - A Reconfigurable Computing Platform with Memory Slot Interface.",
                    "Acceleration of a 2D-FFT on an Adaptable Computing Cluster.",
                    "Design and Implementation of a Generic 2-D Biorthogonal Discrete Wavelet Transform on an FPGA.",
                    "An Application-Specific Compiler for High-Speed Binary Image Morphology.",
                    "One-Step Compilation of Image Processing Applications to FPGAs.",
                    "High Level Programming for FPGA Based Image and Video Processing Using Hardware Skeletons.",
                    "Fast Regular Expression Matching Using FPGAs.",
                    "A Configurable Hardware/Software Approach to SAT Solving.",
                    "The Development of an Operating System for Reconfigurable Computing.",
                    "JBits™ Design Abstractions.",
                    "A Behavioral Synthesis Estimation Interface for Configurable Computing.",
                    "An Approach for Automatic Data Allocation in C to HDL Compilers.",
                    "System on a FPGA Virtual Concatenation.",
                    "Secure Configuration of a Field Programmable Gate Array.",
                    "Circlets: Circuitry over the Internet.",
                    "Evaluation of Reconfigurable Cache Module Architecture.",
                    "An External Memory Interface for FPGA-Based Computing Engines.",
                    "A SW/HW Interface API for Java/FPGA Co-Designed Applets.",
                    "The FPGA Development System CHDL.",
                    "Combining Instruction and Loop Level Parallelism for FPGAs.",
                    "Mutable Functional Units: Initial Results.",
                    "Rapid Synthesis of Pattern Classification Circuits.",
                    "The Effect of FPGA Granularity on Video Codec Implementations.",
                    "Accelerating Statistical Texture Analysis with an FPGA-DSP Hybrid Architecture.",
                    "Hardware Implementation of Automated Sensor Self-Validation System for Cupola Furnaces.",
                    "Reconfigurable Designs for Ray Tracing.",
                    "Manufacturing Shop-Floor Supercomputer for Distributed Simulation and Control.",
                    "Pipelined Function Evaluation on FPGAs.",
                    "Optimization of Logic Use on Stereo Vision Algorithm Example."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th FCCM 2000",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/2000",
                "sub_name": "8th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM 2000), 17-19 April 2000, Napa Valley, CA, USA, Proceedings.",
                "count": 56,
                "papers": [
                    "Design of a VLIW Compute Accelerator on the Transmogrifier-2.",
                    "A Scalable, Loadable Custom Programmable Logic Device for Solving Boolean Satisfiability Problems.",
                    "Configuration Caching Management Techniques for Reconfigurable Computing.",
                    "A MATLAB Compiler for Distributed, Heterogeneous, Reconfigurable Computing Systems.",
                    "Stream-Oriented FPGA Computing in the Streams-C High Level Language.",
                    "A Reconfigurable Computing Architecture for Microsensors.",
                    "FPGA Implementation of a Microcoded Elliptic Curve Cryptographic Processor.",
                    "Customizing Graphics Applications: Techniques and Programming Interface.",
                    "Automatic Synthesis of Data Storage and Control Structures for FPGA-Based Computing Engines.",
                    "A C to HDL Compiler for Pipeline Processing on FPGAs.",
                    "High Performance DES Encryption in Virtex(tm) FPGAs Using Jbits(tm).",
                    "A Bit-Serial Implementation of the International Data Encryption Algorithm IDEA.",
                    "An Adaptive Cryptographic Engine for IPSec Architectures.",
                    "Death of the RLOC?",
                    "Automated Extraction of Run-Time Parameterizable Cores from Programmable Device Configurations.",
                    "Dynamic Fault Tolerance in FPGAs via Partial Reconfiguration.",
                    "An ACS Robotic Control Algorithm with Fault Tolerant Capabilities.",
                    "Tunable Fault Tolerance for Runtime Reconfigurable Architectures.",
                    "Synchronization in Software Radios-Carrier and Timing Recovery Using FPGAs.",
                    "Architecture and Application of a Dynamically Reconfigurable Hardware Array for Future Mobile Communication Systems.",
                    "Implementation of Near Shannon Limit Error-Correcting Codes Using Reconfigurable Hardware.",
                    "Hardware-Software Codesign and Parallel Implementation of a Golomb Ruler Derivation Engine.",
                    "An FPGA-Based Coprocessor for the Parsing of Context-Free Grammars.",
                    "A Reliable LZ Data Compressor on Reconfigurable Coprocessors.",
                    "EVIDENCE: An FPGA-Based System for Photon EVent IDENtification and CEntroiding.",
                    "Improving the Performance and Efficiency of an Adaptive Amplification Operation Using Configurable Hardware.",
                    "Configuration Relocation and Defragmentation for Reconfigurable Computing.",
                    "Mapping Algorithms for a Multi-Bit Data Path Processing Reconfigurable Chip RHW.",
                    "Hardware Accelerator for Subgraph Isomorphism Problems.",
                    "A Reconfigurable Hardware Platform for Digital Real-Time Signal Processing in Television Studios.",
                    "Reconfigurable Array Media Processor (RAMP).",
                    "Internet Connected FPGAs.",
                    "A Reconfigurable Stochastic Model Simulator for Analysis of Parallel Systems.",
                    "A Virtual Hardware System on a Dynamically Reconfigurable Logic Device.",
                    "Optimal vs. Heuristic Approaches to Context Scheduling for Multi-Context Reconfigurable Architectures.",
                    "A Communication Scheduling Algorithm for Multi-FPGA Systems.",
                    "Preemptive Multitasking on FPGAs.",
                    "BigSky-An On-Line Arithmetic Design Tool for FPGAs.",
                    "Improving the FPGA Design Process through Determining and Applying Logical-to-Physical Design Mappings.",
                    "Multiple Precision for Resource Minimization.",
                    "StReAm: Object-Oriented Programming of Stream Architectures Using PAM-Blox.",
                    "An FPGA-Based Array Processor for an Ionospheric-Imaging Radar.",
                    "Embedded Compilation for Multimedia Applications.",
                    "Interfacing Reconfigurable Logic with a CPU.",
                    "A Run-Time Reconfigurable Plug-In for the Winamp MP3 Player.",
                    "Accelerating Embedded Applications using Dynamically Reconfigurable Hardware and Evolutionary Algorithms.",
                    "Implementation of a Configurable Controller for an AC Drive Control: A Case Study.",
                    "Pattern Recognition and Reconstruction on an FPGA Coprocessor Board.",
                    "FCCMS and the Memory Wall.",
                    "A C to Hardware/Software Compiler.",
                    "Evaluating Hardware Compilation Techniques.",
                    "Adapting Constant Multipliers in a Neural Network Implementation.",
                    "A Networked FPGA-Based Hardware Implementation of a Neural Network Application.",
                    "Design of C++ Class Library and Bit-Serial Compiler for Variable-Precision Datapath Synthesis on Adaptive Computing Systems.",
                    "An Investigation of Reconfigurable Multipliers for Use in Adaptive Signal Processing.",
                    "Combining Serialization and Reconfiguration for Convolver Designs."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th FCCM 1999",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/1999",
                "sub_name": "7th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM '99), 21-23 April 1999, Napa, CA, USA.",
                "count": 50,
                "papers": [
                    "Macro-Based Hardware Compilation of Java(tm) Bytecodes into a Dynamic Reconfigurable Computing System.",
                    "A CAD Suite for High-Performance FPGA Design.",
                    "Formal Verification of Reconfigurable Cores.",
                    "Transmutable Telecom System and Its Application.",
                    "Implementation and Evaluation of a Prototype Reconfigurable Router.",
                    "Pipeline Vectorization for Reconfigurable Systems.",
                    "Automatic Allocation of Arrays to Memories in FPGA Processors with Multiple Memory Banks.",
                    "Parallelizing Applications into Silicon.",
                    "Reconfigurable Elements for a Video Pipeline Processor.",
                    "ConCISe: A Compiler-Driven CPLD-Based Instruction Set Accelerator.",
                    "CPR: A Configuration Profiling Tool.",
                    "Debugging Techniques for Dynamically Reconfigurable Hardware.",
                    "Improving Simulation Accuracy in Design Methodologies for Dynamically Reconfigurable Logic Systems.",
                    "Reconfigurable Computing for Augmented Reality.",
                    "Sepia: Scalable 3D Compositing Using PCI Pamette.",
                    "An Edge-Endpoint-Based Configurable Hardware Architecture for VLSI CAD Layout Design Rule Checking.",
                    "FAFNER-Accelerating Nesting Problems with FPGAs.",
                    "Field Programmable Gate Array Based Radar Front-End Digital Signal Processing.",
                    "Optimizing FPGA-Based Vector Product Designs.",
                    "PCI-PipeRench and the SWORDAPI: A System for Stream-Based Reconfigurable Computing.",
                    "Safe and Protected Execution for the Morph/AMRM Reconfigurable Processor.",
                    "Implementing an API for Distributed Adaptive Computing Systems.",
                    "A Super-Serial Galois Fields Multiplier for FPGAs and its Application to Public-Key Algorithms.",
                    "Automatic Floating to Fixed Point Translation and its Application to Post-Rendering 3D Warping.",
                    "Dynamic Precision Management for Loop Computations on Reconfigurable Architectures.",
                    "Accelerating Run-Time Reconfiguration on FCCMs.",
                    "A Virtual Hardware Handler for RTR Systems.",
                    "Algorithm Analysis and Mapping Environment for Adaptive Computing Systems: Further Results.",
                    "Development System for FPGA-Based Digital Circuits.",
                    "Design of a JTAG Based Run Time Reconfigurable System.",
                    "Architectures for System-Level Applications of Adaptive Computing.",
                    "Task-Level Partitioning and RTL Design Space Exploration for Multi-FPGA Architectures.",
                    "Enabling Automatic Module Generation for FCCM Compilers.",
                    "ICARUS: A Dynamically Reconfigurable Computer Architecture.",
                    "SONIC - A Plug-In Architecture for Video Processing.",
                    "A Reconfigurable Platform for Academic Purposes.",
                    "VHDL Placement Directives for Parametric IP Blocks.",
                    "Runlength Compression Techniques for FPGA Configurations.",
                    "Accelerating an IR Automatic Target Recognition Application with FPGAs.",
                    "Mapping of an Automated Target Recognition Application from a Graphical Software Environment to FPGA-Based Reconfigurable Hardware.",
                    "Hybrid Data/Configuration Caching for Striped FPGAs.",
                    "On Reconfiguring Cache for Computing.",
                    "Reconfigurable Pipelines in VLIW Execution Units.",
                    "Fast Online Placement for Reconfigurable Computing.",
                    "A Compact Fast Variable Key Size Elliptic Curve Cryptosystem Coprocessor.",
                    "A Virtual Logic Algorithm for Solving Satisfiability Problems Using Reconfigurable Hardware.",
                    "Reducing Compilation Time of Zhong's FPGA-Based SAT Solver.",
                    "FPGA-Based Structures for On-Line FFT and DCT.",
                    "An FPGA-Based Fan Beam Image Reconstruction Module.",
                    "Bézier Curve Rendering on Virtex(tm)."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th FCCM 1998",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/1998",
                "sub_name": "6th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM '98), 15-17 April 1998, Napa Valley, CA, USA.",
                "count": 65,
                "papers": [
                    "A Quantitative Analysis of Reconfigurable Coprocessors for Multimedia Applications.",
                    "Exploring Optimal Cost-Performance Designs for Raw Microprocessors.",
                    "The NAPA Adaptive Processing Architecture.",
                    "A Stream-Based Configurable Computing Radio Testbed.",
                    "Architecture and Design of GE1, a FCCM for Golomb Ruler Derivation.",
                    "New FPGA Architecture for Bit-Serial Pipeline Datapath.",
                    "Plastic Cell Architecture: Towards Reconfigurable Computing for General-Purpose.",
                    "The Design and Implementation of a Context Switching FPGA.",
                    "A Run-Time Reconfigurable Engine for Image Interpolation.",
                    "Hardware/Software Integration in Solar Polarimetry.",
                    "An Overview of the COBRA-ABS High Level Synthesis System for Multi-FPGA Systems.",
                    "Specifying and Compiling Applications for RaPiD.",
                    "NAPA C: Compiling for a Hybrid RISC/FPGA Architecture.",
                    "Configuration Compression for the Xilinx XC6200 FPGA.",
                    "Automating Production of Run-Time Reconfigurable Designs.",
                    "Object Oriented Circuit-Generators in Java.",
                    "PAM-Blox: High Performance FPGA Design for Adaptive Computing.",
                    "JHDL - An HDL for Reconfigurable Systems.",
                    "Accelerating Boolean Satisfiability with Configurable Hardware.",
                    "Dynamic Circuit Generation for Solving Specific Problem Instances of Boolean Satisfiability.",
                    "A Re-evaluation of the Practicality of Floating-Point Operations on FPGAs.",
                    "A Variable Long-Precision Arithmetic Unit Design for Reconfigurable Coprocessor Architectures.",
                    "A Reconfigurable Multiplier Array For Video Image Processing Tasks, Suitable For Embedding In An FPGA Structure.",
                    "Accelerating Adobe Photoshop with the Reconfigurable Logic.",
                    "Analysis of the XC6000 Architecture for Embedded System Design.",
                    "A FPGA Based Forth Microprocessor.",
                    "PROGRAPE-1: A Programmable Special-Purpose Computer for Many-Body Simulations.",
                    "RVC - A Reconfigurable Coprocessor for Vector Processing Applications.",
                    "The Systolic Array Genetic Algorithm, An Example of Systolic Arrays as a Reconfigurable Design Methodology.",
                    "50 kHz Pattern Recognition on the Large FPGA Processor Enable++.",
                    "An Embedded DRAM-FPGA Chip with Instantaneous Logic Reconfiguration.",
                    "Mapping the MD5 Hash Algorithm onto the NAPA Architecture.",
                    "General Purpose vs. Custom FCCM's: a Comparison of Splash2, Quickturn RPM, and GE1 for Golomb Ruler Derivation.",
                    "An Architecture Simulator for National Semiconductor's Adaptive Processing Architecture (NAPA).",
                    "Benchmarking Technology for Configurable Computing System.",
                    "Reconfigurable Processor Architectures Exploiting High Bandwidth Optical Channels.",
                    "Some Applications of FPGAs in Bio-Inspired Hardware.",
                    "A Prototype System for Rapid Application Development using Dynamically Reconfigurable Hardware.",
                    "Scalable Network Based FPGA Accelerators for an Automatic Target Recognition Application.",
                    "An FPGA Implementation of GENET for Solving Graph Coloring Problems .",
                    "SLAAC: A Distributed Architecture for Adaptive Computing.",
                    "RENCO: A Reconfigurable Network Computer.",
                    "Hardware Implementation of Generalized Profile Search on the GENSTORM Machine.",
                    "FPGA-Based Architecture Evaluation of Cryptographic Coprocessors for Smartcards.",
                    "Characterization and Parameterization of a Pipeline Reconfigurable FPGA.",
                    "A FPGA-Based Custom Computing System for Solving the Assignment Problem.",
                    "Circlets: Circuits as Applets.",
                    "Dynamic Reconfiguration to Support Concurrent Applications.",
                    "A Comparative Analysis of Fuzzy ART Neural Network Implementations: The Advantages of Reconfigurable Computing.",
                    "Frequency-Domain Sonar Processing in FPGAs and DSPs.",
                    "Dynamic Specialization of XC6200 FPGAs by Partial Evaluation.",
                    "DES Key Breaking, Encryption and Decryption on the XC6216.",
                    "An Effective Design System for Dynamically Reconfigurable Architectures.",
                    "Mapping Homogeneous Computations onto Dynamically Configurable Coarse-Grained Architectures.",
                    "Fast Partial Reconfiguration for FCCMs.",
                    "Reconfigurable Hardware as Shared Resource for Parallel Threads.",
                    "Digit-Serial DSP Library for Optimized FPGA Configuration.",
                    "A Methodology for Task Based Partitioning and Scheduling of Dynamically Reconfigurable Systems.",
                    "High Level Synthesis for Designing Custom Computing Hardware.",
                    "Temporal Partitioning and Scheduling for Reconfigurable Computing.",
                    "Implementation of RNS Addition and RNS Multiplication into FPGAs.",
                    "A Scalable FIR Filter Using 32-bit Floating-Point Complex Arithmetic on a Configurable Computing Machine.",
                    "Reconfigurable Computing for Space-Time Adaptive Processing.",
                    "Self Sorting Radix_2 FFT on FPGA using Parallel Pipelined Distributed Arithmetic Blocks.",
                    "Implementing C Algorithms in Reconfigurable Hardware Using C2Verilog."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th FCCM 1997",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/1997",
                "sub_name": "5th IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM '97), 16-18 April 1997, Napa Valley, CA, USA.",
                "count": 32,
                "papers": [
                    "An FPGA architecture for DRAM-based systolic computations.",
                    "Garp: a MIPS processor with a reconfigurable coprocessor.",
                    "A time-multiplexed FPGA.",
                    "An FPGA-based coprocessor for ATM firewalls.",
                    "A wireless LAN demodulator in a Pamette: design and experience.",
                    "Incremental reconfiguration for pipelined applications.",
                    "Compilation tools for run-time reconfigurable designs.",
                    "A dynamic reconfiguration run-time system.",
                    "The swappable logic unit: a paradigm for virtual hardware.",
                    "The Chimaera reconfigurable functional unit.",
                    "Computing kernels implemented with a wormhole RTR CCM.",
                    "Mapping applications to the RaPiD configurable architecture.",
                    "Defect tolerance on the Teramac custom computer.",
                    "Systems performance measurement on PCI Pamette.",
                    "The RAW benchmark suite: computation structures for general purpose computing.",
                    "Automated field-programmable compute accelerator design using partial evaluation.",
                    "FPGA synthesis on the XC6200 using IRIS and Trianus/Hades (or from heaven to hell and back again).",
                    "High level compilation for fine grained FPGAs.",
                    "Acceleration of an FPGA router.",
                    "Fault simulation on reconfigurable hardware.",
                    "Automated target recognition on SPLASH 2.",
                    "Real-time stereo vision on the PARTS reconfigurable computer.",
                    "Increased FPGA capacity enables scalable, flexible CCMs: an example from image processing.",
                    "Comparison of arithmetic architectures for Reed-Solomon decoders in reconfigurable hardware.",
                    "Implementation of single precision floating point square root on FPGAs.",
                    "Datapath-oriented FPGA mapping and placement for configurable computing.",
                    "Mapping a real-time video algorithm to a context-switched FPGA.",
                    "A parallel hardware evolvable computer POLYP.",
                    "Laser defect correction applications to FPGA based custom computers.",
                    "Speech recognition HMM training on reconfigurable parallel processor.",
                    "Efficient implementation of the DCT on custom computers.",
                    "On acceleration of the check tautology logic synthesis algorithm using an FPGA-based reconfigurable coprocessor."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th FCCM 1996",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/1996",
                "sub_name": "4th IEEE Symposium on FPGAs for Custom Computing Machines (FCCM '96), Napa Valley, CA, USA, April 17-19, 1996.",
                "count": 24,
                "papers": [
                    "VLSI architectures for field programmable gate arrays: a case study.",
                    "Assessing document relevance with run-time reconfigurable machines.",
                    "Using MORRPH in an industrial machine vision system.",
                    "A software development system for FPGA-based data acquisition systems.",
                    "Bit-serial pipeline synthesis for multi-FPGA systems with C++ design capture.",
                    "Revisiting Smalltalk-80 blocks: a logic generator for FPGAs.",
                    "RACER: a reconfigurable constraint-length 14 Viterbi decoder.",
                    "Configurable computing solutions for automatic target recognition.",
                    "Exploring architectures for volume visualization on the Teramac custom computer.",
                    "Using rapid prototyping to teach the design of complete computing solutions.",
                    "Aizup-a pipelined processor design and implementation on XILINX FPGA chip.",
                    "Implementation of IEEE single precision floating point addition and multiplication on FPGAs.",
                    "Mixing fixed and reconfigurable logic for array processing.",
                    "OneChip: an FPGA processor with reconfigurable logic.",
                    "A PCI-compatible FPGA-coprocessor for 2D/3D image processing.",
                    "SOP: a reconfigurable massively parallel system and its control-data-flow based compiling method.",
                    "MATRIX: a reconfigurable computing architecture with configurable instruction distribution and deployable resources.",
                    "Modelling and optimising run-time reconfigurable systems.",
                    "Scheduling and partitioning ANSI-C programs onto multi-FPGA CCM architectures.",
                    "Expressing dynamic reconfiguration by partial evaluation.",
                    "Supporting FPGA microprocessors through retargetable software tools.",
                    "On the viability of FPGA-based integrated coprocessors.",
                    "Genetic algorithms in software and in hardware-a performance analysis of workstation and custom computing machine implementations.",
                    "A quantitative analysis of processor-programmable logic interface."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd FCCM 1995",
        "info": "Napa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fccm/1995",
                "sub_name": "3rd IEEE Symposium on Field-Programmable Custom Computing Machines (FCCM '95), 19-21 April 1995, Napa Valley, CA, USA.",
                "count": 26,
                "papers": [
                    "A FCCM for dataflow (spreadsheet) programs.",
                    "MORRPH: a modular and reprogrammable real-time processing hardware.",
                    "Architecture of a FPGA-based coprocessor: the PAR-1.",
                    "Teramac-configurable custom computing.",
                    "Common processor element packaging for CHAMP.",
                    "Enable ++: A Second Generation FPGA Processor.",
                    "Design and implementation of a multicomputer interconnection network using FPGAs.",
                    "Routability improvement using dynamic interconnect architecture.",
                    "Reconfigurable real-time signal transport system using custom FPGAs.",
                    "Design methodologies for partially reconfigured systems.",
                    "Issues in wireless video coding using run-time-reconfigurable FPGAs.",
                    "Run time reconfiguration of FPGA for scanning genomic databases.",
                    "A dynamic instruction set computer.",
                    "Emulating static faults using a Xilinx based emulator.",
                    "Acceleration of template-based ray casting for volume visualization using FPGAs.",
                    "Flexible image acquisition using reconfigurable hardware.",
                    "The Transmogrifier C hardware description language and compiler for FPGAs.",
                    "Architectural descriptions for FPGA circuits.",
                    "Quantitative analysis of floating point arithmetic on FPGA based custom computing machines.",
                    "A declarative approach to incremental custom computing.",
                    "A C++ compiler for FPGA custom execution units synthesis.",
                    "Implementing a genetic algorithm on a parallel custom computing machine.",
                    "Rapid prototyping of a RISC architecture for implementation in FPGAs.",
                    "FPGA-based transformable computers for fast digital signal processing.",
                    "Convolution on Splash 2.",
                    "Hidden Markov modeling and fuzzy controllers in FPGAs."
                ]
            }
        ]
    }
]