[
    {
        "year": "2022",
        "name": "30th FPGA 2022",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2022",
                "sub_name": "FPGA '22: The 2022 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, Virtual Event, USA, 27 February 2022 - 1 March 2022.",
                "count": 38,
                "papers": [
                    "RapidStream: Parallel Physical Implementation of FPGA HLS Designs.",
                    "How to Shrink My FPGAs - Optimizing Tile Interfaces and the Configuration Logic in FABulous FPGA Fabrics.",
                    "Revisiting PathFinder Routing Algorithm.",
                    "Multi-input Serial Adders for FPGA-like Computational Fabric.",
                    "Towards Agile DNN Accelerator Design Using Incremental Synthesis on FPGAs.",
                    "Logic Scaling Options for the Next 10 Years: From FinFet to CFET, from Dual Damascene to Semi Damascene.",
                    "A High Throughput Multi-bit-width 3D Systolic Accelerator for NAS Optimized Deep Neural Networks on FPGA.",
                    "Automated Accelerator Optimization Aided by Graph Neural Networks.",
                    "Efficient FPGA-based ECDSA Verification Engine For Permissioned Blockchains.",
                    "End-to-End Acceleration of Homomorphic Encrypted CNN Inference on FPGAs.",
                    "FPGA Accelerators for Robust Visual SLAM on Humanoid Robots.",
                    "Hardware Acceleration of Nonparametric Belief Propagation for Efficient Robot Manipulation.",
                    "HMT: A Hardware-Centric Hybrid Bonsai Merkle Tree Algorithm for High-Performance Authentication.",
                    "MathRAMs: Configurable Fused Compute-Memory Blocks for FPGAs.",
                    "Synthesized Garbage Collection for FPGA Accelerators.",
                    "High-Performance Sparse Linear Algebra on HBM-Equipped FPGAs Using HLS: A Case Study on SpMV.",
                    "Sextans: A Streaming Accelerator for General-Purpose Sparse-Matrix Dense-Matrix Multiplication.",
                    "HeteroFlow: An Accelerator Programming Model with Decoupled Data Placement for Software-Defined FPGAs.",
                    "Finding and Finessing Static Islands in Dynamically Scheduled Circuits.",
                    "Logic Shrinkage: Learned FPGA Netlist Sparsity for Efficient Neural Network Inference.",
                    "N3H-Core: Neuron-designed Neural Network Accelerator via FPGA-based Heterogeneous Computing Cores.",
                    "HP-GNN: Generating High Throughput GNN Training Implementation on CPU-FPGA Heterogeneous Platform.",
                    "FILM-QNN: Efficient FPGA Acceleration of Deep Neural Networks with Intra-Layer, Mixed-Precision Quantization.",
                    "An FPGA-based RNN-T Inference Accelerator with PIM-HBM.",
                    "The Virtuous Cycles of Determinism: Programming Groq's Tensor Streaming Processor.",
                    "DecGNN: A Framework for Mapping Decoupled GNN Models onto CPU-FPGA Heterogeneous Platform.",
                    "FPGA-based Trainable Autoencoder for Communication Systems.",
                    "Highly Scalable Runtime Countermeasure Against Microprobing Attacks on Die-to-Die Interconnections in System-in-Package.",
                    "HiPR: Fast, Incremental Custom Partial Reconfiguration for HLS Developers.",
                    "MAQO: A Scalable Many-Core Annealer for Quadratic Optimization on a Stratix 10 FPGA.",
                    "An Integrity Checking Framework for AXI Protocol in Multi-tenant FPGA.",
                    "SPA-GCN: Efficient and Flexible GCN Accelerator with Application for Graph Similarity Computation.",
                    "Ultra Low-Complexity Implementation of Binary Ring-LWE based Post-Quantum Cryptography on FPGA Platform.",
                    "Yosys+Odin-II: The Odin-II Partial Mapper with Yosys Coarse-grained Netlists in VTR.",
                    "REMOT: A Hardware-Software Architecture for Attention-Guided Multi-Object Tracking with Dynamic Vision Sensors on FPGAs.",
                    "Accelerating Constraint-Based Causal Discovery by Shifting Speed Bottleneck.",
                    "Co-Design for Energy Efficient and Fast Genomic Search: Interleaved Bloom Filter on FPGA.",
                    "Accelerating SSSP for Power-Law Graphs."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "29th FPGA 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2021",
                "sub_name": "FPGA '21: The 2021 ACM/SIGDA International Symposium on Field Programmable Gate Arrays, Virtual Event, USA, February 28 - March 2, 2021.",
                "count": 50,
                "papers": [
                    "Top-down Physical Design of Soft Embedded FPGA Fabrics.",
                    "NetCracker: A Peek into the Routing Architecture of Xilinx 7-Series FPGAs.",
                    "Tensor Slices to the Rescue: Supercharging ML Acceleration on FPGAs.",
                    "Global Is the New Local: FPGA Architecture at 5nm and Beyond.",
                    "FABulous: An Embedded FPGA Framework.",
                    "Stratix 10 NX Architecture and Applications.",
                    "Scientific Applications of FPGAs at the LHC.",
                    "ThunderGP: HLS-based Graph Processing Framework on FPGAs.",
                    "AutoBridge: Coupling Coarse-Grained Floorplanning and Pipelining for High-Frequency HLS Design on Multi-Die FPGAs.",
                    "AutoSA: A Polyhedral Compiler for High-Performance Systolic Arrays on FPGA.",
                    "Demystifying the Memory System of Modern Datacenter FPGAs for Software Programmers through Microbenchmarking.",
                    "HBM Connect: High-Performance HLS Interconnect for FPGA HBM.",
                    "PRGA: An Open-Source FPGA Research and Prototyping Framework.",
                    "Interactive Debugging at IP Block Interfaces in FPGAs.",
                    "Probabilistic Optimization for High-Level Synthesis.",
                    "A Framework for Optimizing GCN Inference on FPGA.",
                    "Clockwork: Resource-Efficient Static Scheduling for Multi-Rate Image Processing Applications on FPGAs.",
                    "LEAP: A Deep Learning based Aging-Aware Architecture Exploration Framework for FPGAs.",
                    "Modeling FPGA-Based Systems via Few-Shot Learning.",
                    "APCNN: Explore Multi-Layer Cooperation for CNN Optimization and Acceleration on FPGA.",
                    "ScalaBFS: A Scalable BFS Accelerator on FPGA-HBM Platform.",
                    "AutoDSE: Enabling Software Programmers Design Efficient FPGA Accelerators.",
                    "SWIFT: Small-World-based Structural Pruning to Accelerate DNN Inference on FPGA.",
                    "Fuzzing High-Level Synthesis Tools.",
                    "RIFL: A Reliable Link Layer Network Protocol for FPGA-to-FPGA Communication.",
                    "GraSU: A Fast Graph Update Library for FPGA-based Dynamic Graph Processing.",
                    "Folded Integer Multiplication for FPGAs.",
                    "FracBNN: Accurate and FPGA-Efficient Binary Neural Networks with Fractional Activations.",
                    "DYNAMAP: Dynamic Algorithm Mapping Framework for Low Latency CNN Inference.",
                    "S2N2: A FPGA Accelerator for Streaming Spiking Neural Networks.",
                    "CoDeNet: Efficient Deployment of Input-Adaptive Object Detection on Embedded FPGAs.",
                    "Efficient FPGA Modular Multiplication Implementation.",
                    "Are We Alone? Searching for ET with FPGAs.",
                    "Stealing Neural Network Structure through Remote FPGA Side-channel Analysis.",
                    "Exploring PGAS Communication for Heterogeneous Clusters with FPGAs.",
                    "Extending High-Level Synthesis for Task-Parallel Programs.",
                    "Simulating and Evaluating a Quaternary Logic FPGA Based on Floating-gate Memories and Voltage Division.",
                    "Resource Sharing in Dataflow Circuits.",
                    "Triggered Scheduling: Efficient Detection of Dataflow Network Idleness on Heterogeneous Systems.",
                    "Classifying Computations on Multi-Tenant FPGAs.",
                    "NPE: An FPGA-based Overlay Processor for Natural Language Processing.",
                    "PyLog: An Algorithm-Centric Python-Based FPGA Programming and Synthesis Flow.",
                    "MLBlocks: FPGA Blocks for Machine Learning Applications.",
                    "3M-AI: A Multi-task and Multi-core Virtualization Framework for Multi-FPGA AI Systems in the Cloud.",
                    "Reconfigurable Acceleration of Short Read Mapping with Biological Consideration.",
                    "An FPGA-based 7-ENOB 600 MSample/s ADC without any External Components.",
                    "A Framework for Customizable FPGA-based Image Registration Accelerators.",
                    "NASCENT: Near-Storage Acceleration of Database Sort on SmartSSD.",
                    "MOCHA: Multinode Cost Optimization in Heterogeneous Clouds with Accelerators.",
                    "Design Principles for Packet Deparsers on FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th FPGA 2020",
        "info": "Seaside, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2020",
                "sub_name": "FPGA '20: The 2020 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, Seaside, CA, USA, February 23-25, 2020.",
                "count": 84,
                "papers": [
                    "Invited Tutorial: Dynamatic: From C/C++ to Dynamically Scheduled Circuits.",
                    "Invited Tutorial: FPGA Hardware Security for Datacenters and Beyond.",
                    "Establishing Trust in Microelectronics.",
                    "Thermal and Voltage Side and Covert Channels and Attacks in Cloud FPGAs.",
                    "Multi-tenant FPGA Security: Challenges and Opportunities.",
                    "FPGA / SoC Security: Arms Race in the Cloud.",
                    "What To Do With Datacenter FPGAs Besides Deep Learning.",
                    "Symbiosis in Action: Reconfigurable Architectures and EDA.",
                    "Maximizing the Serviceability of Partially Reconfigurable FPGA Systems in Multi-tenant Environment.",
                    "AutoDNNchip: An Automated DNN Chip Predictor and Builder for Both FPGAs and ASICs.",
                    "HeteroHalide: From Image Processing DSL to Efficient FPGA Acceleration.",
                    "Fingerprinting Cloud FPGA Infrastructures.",
                    "Massively Simulating Adiabatic Bifurcations with FPGA to Solve Combinatorial Optimization.",
                    "High-Performance FPGA Network Switch Architecture.",
                    "Using OpenCL to Enable Software-like Development of an FPGA-Accelerated Biophotonic Cancer Treatment Simulator.",
                    "Energy-Efficient 360-Degree Video Rendering on FPGA via Algorithm-Architecture Co-Design.",
                    "Real-Time Spatial 3D Audio Synthesis on FPGAs for Blind Sailing.",
                    "When Massive GPU Parallelism Ain't Enough: A Novel Hardware Architecture of 2D-LSTM Neural Network.",
                    "Light-OPU: An FPGA-based Overlay Processor for Lightweight Convolutional Neural Networks.",
                    "End-to-End Optimization of Deep Learning Applications.",
                    "Architectural Enhancements in Intel® Agilex™ FPGAs.",
                    "Straight to the Point: Intra- and Intercluster LUT Connections to Mitigate the Delay of Programmable Routing.",
                    "LUXOR: An FPGA Logic Cell Architecture for Efficient Compressor Tree Implementations.",
                    "FPGAs will Never be the Same Again: How the Newest FPGA Architectures are Totally Disrupting the Entire FPGA Ecosystem as We Know It.",
                    "Xilinx Vitis Unified Software Platform.",
                    "StateMover: Combining Simulation and Hardware Execution for Efficient FPGA Debugging.",
                    "Buffer Placement and Sizing for High-Performance Dataflow Circuits.",
                    "Closing Leaks: Routing Against Crosstalk Side-Channel Attacks.",
                    "Built-in Self-Evaluation of First-Order Power Side-Channel Leakage for FPGAs.",
                    "Dependency-Driven Trace-Based Network-on-Chip Emulation on FPGAs.",
                    "FPGA-Accelerated Samplesort for Large Data Sets.",
                    "BiS-KM: Enabling Any-Precision K-Means on FPGAs.",
                    "Flexible Communication Avoiding Matrix Multiplication on FPGA with High-Level Synthesis.",
                    "GraphACT: Accelerating GCN Training on CPU-FPGA Heterogeneous Platforms.",
                    "Reuse Kernels or Activations?: A Flexible Dataflow for Low-latency Spectral CNN Acceleration.",
                    "Finding and Understanding Bugs in FPGA Synthesis Tools.",
                    "Combining Dynamic & Static Scheduling in High-level Synthesis.",
                    "Boyi: A Systematic Framework for Automatically Deciding the Right Execution Model of OpenCL Applications on FPGAs.",
                    "Programming Abstractions for Configurable Hardware: Survey and Research Directions.",
                    "Pipeline-aware Logic Deduplication in High-Level Synthesis for Post-Quantum Cryptography Algorithms.",
                    "Advanced Dataflow Programming using Actor Machines for High-Level Synthesis.",
                    "Analysis and Optimization of the Implicit Broadcasts in FPGA HLS to Improve Maximum Frequency.",
                    "Productive Hardware Designs using Hybrid HLS-RTL Development.",
                    "Unleashing the Power of FPGAs as Programmable Switches.",
                    "Early-stage Automated Identification of Similar Hardware Implementations with Abstract-Syntax-Tree.",
                    "Hardware Description Beyond Register-Transfer Level Languages.",
                    "MLSBench: A Synthesizable Dataset of HLS Designs to Support ML Based Design Flows.",
                    "A Top-Down Design Methodology for Synthesizing FPGA Fabrics Using Standard ASIC Flow.",
                    "ConvCloud: An Adaptive Convolutional Neural Network Accelerator on Cloud FPGAs.",
                    "Scalable FPGA Median Filtering using Multiple Efficient Passes.",
                    "FeCaffe: FPGA-enabled Caffe with OpenCL for Deep Learning Training and Inference on Intel Stratix 10.",
                    "DOMIS: Dual-Bank Optimal Micro-Architecture for Iterative Stencils.",
                    "Scalable FPGA-based Architecture for High-Performance Per-Flow Traffic Measurement.",
                    "Codesign-NAS: Automatic FPGA/CNN Codesign Using Neural Architecture Search.",
                    "Placement Aware Design and Automation of High Speed Architectures for Tree-Structured Linear Cellular Automata on FPGAs with Scan Path Insertion.",
                    "INCAME: INterruptible CNN Accelerator for Multi-robot Exploration.",
                    "LPAC: A Low-Precision Accelerator for CNN on FPGAs.",
                    "Enable Efficient and Flexible FPGA Virtualization for Deep Learning in the Cloud.",
                    "Evaluation of Optimized CNNs on FPGA and non-FPGA based Accelerators using a Novel Benchmarking Approach.",
                    "CloudMoles: Surveillance of Power-Wasting Activities by Infiltrating Undercover Sensors.",
                    "Studying the Potential of Automatic Optimizations in the Intel FPGA SDK for OpenCL.",
                    "CANSEE: Customized Accelerator for Neural Signal Enhancement and Extraction from the Calcium Image in Real Time.",
                    "Low Precision Floating Point Arithmetic for High Performance FPGA-based CNN Acceleration.",
                    "Maximizing CNN Throughput on FPGA Clusters.",
                    "R2CNN: Recurrent Residual Convolutional Neural Network on FPGA.",
                    "Synthesis-Free, Flexible and Fast Hardware Library for Biophysically Plausible Neurosimulations.",
                    "HPIPE: Heterogeneous Layer-Pipelined and Sparse-Aware CNN Inference for FPGAs.",
                    "FTDL: An FPGA-tailored Architecture for Deep Learning Systems.",
                    "Cash: A Single-Source Hardware-Software Codesign Framework for Rapid Prototyping.",
                    "Performance Evaluation and Power Analysis of Teraflop-scale Fluid Simulation with Stratix 10 FPGA.",
                    "On the Exploration of Connection-aware Partitioning for Parallel FPGA Routing.",
                    "High Density Pipelined 8bit Multiplier Systolic Arrays for FPGA.",
                    "Reactive Signal Obfuscation with Time-Fracturing to Counter Information Leakage in FPGAs.",
                    "Cycle-Free FPGA Routing Graphs.",
                    "An Algorithm for Delay Optimal Logic Replication for FPGAs Accounting for Combinational Loops.",
                    "QTAccel: A Generic FPGA based Design for Q-Table based Reinforcement Learning Accelerators.",
                    "The Case for Hard Matrix Multiplier Blocks in an FPGA.",
                    "Performance Portable FPGA Design.",
                    "Accuracy-Aware Memory Allocation to Mitigate BRAM Errors for Voltage Underscaling on FPGA Overlay Accelerators.",
                    "Near-memory Acceleration for Scalable Phylogenetic Inference.",
                    "FPTLOPT: An Automatic Transistor-Level Optimization Tool for GRM FPGA.",
                    "INTB: A New FPGA Interconnect Model for Architecture Exploration.",
                    "V-LSTM: An Efficient LSTM Accelerator Using Fixed Nonzero-Ratio Viterbi-Based Pruning.",
                    "DBHI: A Tool for Decoupled Functional Hardware-Software Co-Design on SoCs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th FPGA 2019",
        "info": "Seaside, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2019",
                "sub_name": "Proceedings of the 2019 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, FPGA 2019, Seaside, CA, USA, February 24-26, 2019.",
                "count": 94,
                "papers": [
                    "The P4->NetFPGA Workflow for Line-Rate Packet Processing.",
                    "Visual System Integrator: Invited Tutorial.",
                    "Build Your Own Domain-specific Solutions with RapidWright: Invited Tutorial.",
                    "Synetgy: Algorithm-hardware Co-design for ConvNet Accelerators on Embedded FPGAs.",
                    "REQ-YOLO: A Resource-Aware, Efficient Quantization Framework for Object Detection on FPGAs.",
                    "Reconfigurable Convolutional Kernels for Neural Networks on FPGAs.",
                    "F5-HD: Fast Flexible FPGA-based Framework for Refreshing Hyperdimensional Computing.",
                    "Efficient and Effective Sparse LSTM on FPGA with Bank-Balanced Sparsity.",
                    "Cloud-DNN: An Open Framework for Mapping DNN Models to Cloud FPGAs.",
                    "Versal: The Xilinx Adaptive Compute Acceleration Platform (ACAP).",
                    "Xilinx Adaptive Compute Acceleration Platform: VersalTM Architecture.",
                    "Math Doesn't Have to be Hard: Logic Block Architectures to Enhance Low-Precision Multiply-Accumulate on FPGAs.",
                    "LANMC: LSTM-Assisted Non-Rigid Motion Correction on FPGA for Calcium Image Stabilization.",
                    "On-chip FPGA Debug Instrumentation for Machine Learning Applications.",
                    "Scheduling Data in Neural Network Applications.",
                    "Fault Testing a Synthesizable Embedded Processor at Gate Level using UltraScale FPGA Emulation.",
                    "Base64 Encoding on OpenCL FPGA Platform.",
                    "Scalable High Performance SDN Switch Architecture on FPGA for Core Networks.",
                    "A Deep-Reinforcement-Learning-Based Scheduler for High-Level Synthesis.",
                    "Accelerating 3D CNN-based Lung Nodule Segmentation on a Multi-FPGA System.",
                    "SparseBNN: Joint Algorithm/Hardware Optimization to Exploit Structured Sparsity in Binary Neural Network.",
                    "A Deep Learning Inference Accelerator Based on Model Compression on FPGA.",
                    "Sparse Winograd Convolutional Neural Networks on Small-scale Systolic Arrays.",
                    "HSC-FPGA.",
                    "Evaluating and Enhancing Intel® Stratix® 10 FPGAs for Persistent Real-Time AI.",
                    "Parrot: A More Effective Parallel Routing Approach to FPGAs.",
                    "A Reconfigurable Accelerator for Sparse Convolutional Neural Networks.",
                    "Overcoming Data Transfer Bottlenecks in DNN Accelerators via Layer-Conscious Memory Managment.",
                    "A Pixel-Parallel Virtual-Image Architecture for High Performance and Power Efficient Graph Cuts Inference.",
                    "Unleashing the Power of Soft Logic for Convolutional Neural Network Acceleration via Product Quantization.",
                    "Highly Efficient Sparse Neural Network Computing: Hardware and Software Solutions.",
                    "FPGA-based Distributed Edge Training of SVM.",
                    "Transistor-Level Optimization Methodology for GRM FPGA Interconnect Circuits.",
                    "Multi-Commodity Flow-Based Spreading in a Commercial Analytic Placer.",
                    "Simultaneous Placement and Clock Tree Construction for Modern FPGAs.",
                    "EASY: Efficient Arbiter SYnthesis from Multi-threaded Code.",
                    "Substream-Centric Maximum Matchings on FPGA.",
                    "Speculative Dataflow Circuits.",
                    "Constructing Concurrent Data Structures on FPGA with Channels.",
                    "Rapid Cycle-Accurate Simulator for High-Level Synthesis.",
                    "PAI-FCNN: FPGA Based CNN Inference System.",
                    "JuxtaPiton: Enabling Heterogeneous-ISA Research with RISC-V and SPARC FPGA Soft-cores.",
                    "MODA-PSO: Towards Fast Hard Block Legalization for Analytical FPGA Placement.",
                    "A PYNQ-compliant Online Platform for Zynq-based DNN Developers.",
                    "SwitchAgg: A Further Step Towards In-Network Computation.",
                    "A Fine-Grained Sparse Accelerator for Multi-Precision DNN.",
                    "Building FPGA State Machines from Sequential Code.",
                    "Design and Implementation of a Deterministic FPGA Router on a CPU+FPGA Acceleration Platform.",
                    "An FPGA-based Fine Tuning Accelerator for a Sparse CNN.",
                    "Embracing Systolic: Super Systolization of Large-Scale Circulant Matrix-vector Multiplication on FPGA with Subquadratic Space Complexity.",
                    "Dataflow Systolic Array Implementations of Matrix Decomposition Using High Level Synthesis.",
                    "Speedy: An Accelerator for Sparse Convolutional Neural Networks on FPGAs.",
                    "DNNVM: End-to-End Compiler Leveraging Operation Fusion on FPGA-based CNN Accelerators.",
                    "A Hybrid Data-Consistent Framework for Link-Aware AccessManagement in Emerging CPU-FPGA Platforms.",
                    "On Feasibility of FPGAs Without Dedicated Programmable Interconnect Structure.",
                    "Fast Confidence Detection: One Hot Way to Detect Adversarial Attacks via Sensor Pattern Noise Fingerprinting.",
                    "FTConv: FPGA Acceleration for Transposed Convolution Layers in Deep Neural Networks.",
                    "Compressed CNN Training with FPGA-based Accelerator.",
                    "Optimizing Order-Associative Kernel Computation with Joint Memory Banking and Data Reuse.",
                    "PVT-Aware Sensing and Voltage Scaling for Energy Efficient FPGAs.",
                    "Software Hardware Co-Optimized BFS on FPGAs.",
                    "Compute-Efficient Neural-Network Acceleration.",
                    "FPGAs in Supercomputers: Opportunity or Folly?",
                    "Fractal Synthesis: Invited Tutorial.",
                    "Network-on-Chip Programmable Platform in VersalTM ACAP Architecture.",
                    "HopliteBuf: FPGA NoCs with Provably Stall-Free FIFOs.",
                    "The Network Management Unit (NMU): Securing Network Access for Direct-Connected FPGAs.",
                    "HeteroCL: A Multi-Paradigm Programming Infrastructure for Software-Defined Reconfigurable Computing.",
                    "AFFIX: Automatic Acceleration Framework for FPGA Implementation of OpenVX Vision Algorithms.",
                    "A Modular Heterogeneous Stack for Deploying FPGAs and CPUs in the Data Center.",
                    "Impact of Soft Errors on Large-Scale FPGA Cloud Computing.",
                    "Breaking the Trust Dependence on Third Party Processes for Reconfigurable Secure Hardware.",
                    "Characterization of Long Wire Data Leakage in Deep Submicron FPGAs.",
                    "Temporal Thermal Covert Channels in Cloud FPGAs.",
                    "How to Accelerate FPGA Application in an Asynchronous Way?",
                    "Nuclear Reactor Simulations on OpenCL FPGA Platform.",
                    "Storage Mirroring for Bare-Metal Systems on FPGA Devices.",
                    "Fast Inference of Deep Neural Networks for Real-time Particle Physics Applications.",
                    "XFER: A Novel Design to Achieve Super-Linear Performance on Multiple FPGAs for Real-Time AI.",
                    "An Energy-Efficient FPGA Implementation of an LSTM Network Using Approximate Computing.",
                    "Towards Fast and Energy-Efficient Binarized Neural Network Inference on FPGA.",
                    "BRISC-V: An Open-Source Architecture Design Space Exploration Toolbox.",
                    "Maverick: A Stand-alone CAD Flow for Xilinx 7-Series FPGAs.",
                    "Hierarchical FPGA Fabrics using 2D-Benes-BFT-Pyramid Network Layouts with Optimizations.",
                    "Flat FPGA Fabrics Derived from 2D-Benes-BFT-Pyramid Networks with Optimizations and Enhancements.",
                    "HOTMeTaL: Hardware Optimization Tool for Memory Table and Logic Conversion.",
                    "Engaging Heterogeneous FPGAs in the Cloud.",
                    "Enhancing Butterfly Fat Tree NoCs for FPGAs with Lightweight Flow Control.",
                    "Efficient FPGA Implementation of Conjugate Gradient Methods for Laplacian System using HLS.",
                    "A FPGA Implementation of Farneback Optical Flow by High-Level Synthesis.",
                    "Efficient Acceleration of CNNs for Semantic Segmentation on FPGAs.",
                    "Stop Crying Over Your Cache Miss Rate: Handling Efficiently Thousands of Outstanding Misses in FPGAs.",
                    "Improving Performance of Graph Processing on FPGA-DRAM Platform by Two-level Vertex Caching.",
                    "FASED: FPGA-Accelerated Simulation and Evaluation of DRAM."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th FPGA 2018",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2018",
                "sub_name": "Proceedings of the 2018 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, FPGA 2018, Monterey, CA, USA, February 25-27, 2018.",
                "count": 61,
                "papers": [
                    "CausaLearn: Automated Framework for Scalable Streaming-based Causal Bayesian Learning using FPGAs.",
                    "C-LSTM: Enabling Efficient LSTM using Structured Compression Techniques on FPGAs.",
                    "DeltaRNN: A Power-efficient Recurrent Neural Network Accelerator.",
                    "A Lightweight YOLOv2: A Binarized CNN with A Parallel Support Vector Regression for an FPGA.",
                    "Architecture and Circuit Design of an All-Spintronic FPGA.",
                    "Liquid Silicon: A Data-Centric Reconfigurable Architecture Enabled by RRAM Technology.",
                    "Improving FPGA Performance with a S44 LUT Structure.",
                    "ParaDRo: A Parallel Deterministic Router Based on Spatial Partitioning and Scheduling.",
                    "Routing Magic: Performing Computations Using Routing Networks and Voting Logic on Unary Encoded Data.",
                    "A Full-System VM-HDL Co-Simulation Framework for Servers with PCIe-Connected FPGAs.",
                    "Towards a Uniform Template-based Architecture for Accelerating 2D and 3D CNNs on FPGA.",
                    "A Customizable Matrix Multiplication Framework for the Intel HARPv2 Xeon+FPGA Platform: A Deep Learning Case Study.",
                    "A Framework for Generating High Throughput CNN Implementations on FPGAs.",
                    "Dynamically Scheduled High-level Synthesis.",
                    "A Scalable Approach to Exact Resource-Constrained Scheduling Based on a Joint SDC and SAT Formulation.",
                    "P4-Compatible High-Level Synthesis of Low Latency 100 Gb/s Streaming Packet Parsers in FPGAs.",
                    "Combined Spatial and Temporal Blocking for High-Performance Stencil Computation on FPGAs Using OpenCL.",
                    "A HOG-based Real-time and Multi-scale Pedestrian Detector Demonstration System on FPGA.",
                    "Scalable Window Generation for the Intel Broadwell+Arria 10 and High-Bandwidth FPGA Systems.",
                    "High-Performance QR Decomposition for FPGAs.",
                    "ADAM: Automated Design Analysis and Merging for Speeding up FPGA Development.",
                    "Graph-Theoretically Optimal Memory Banking for Stencil-Based Computing Kernels.",
                    "Architecture Exploration for HLS-Oriented FPGA Debug Overlays.",
                    "Memory-Efficient Fast Fourier Transform on Streaming Data by Fusing Permutations.",
                    "Degree-aware Hybrid Graph Traversal on FPGA-HMC Platform.",
                    "Accelerating Graph Analytics by Co-Optimizing Storage and Access on an FPGA-HMC Platform.",
                    "Configurable FPGA Packet Parser for Terabit Networks with Guaranteed Wire-Speed Throughput.",
                    "FASTCF: FPGA-based Accelerator for STochastic-Gradient-Descent-based Collaborative Filtering.",
                    "Rosetta: A Realistic High-Level Synthesis Benchmark Suite for Software Programmable FPGAs.",
                    "FPGA Fastfood - A High Speed Systolic Implementation of a Large Scale Online Kernel Method.",
                    "Optimizations of Sequence Alignment on FPGA: A Case Study of Extended Sequence Alignment (Abstact Only).",
                    "Automatic Optimising CNN with Depthwise Separable Convolution on FPGA: (Abstact Only).",
                    "Continuous Skyline Computation Accelerator with Parallelizing Dominance Relation Calculations: (Abstract Only).",
                    "FastTrack: Exploiting Fast FPGA Wiring for Implementing NoC Shortcuts (Abstract Only).",
                    "An Optimal Microarchitecture for Stencil Computation with Data Reuse and Fine-Grained Parallelism: (Abstract Only).",
                    "A FPGA Friendly Approximate Computing Framework with Hybrid Neural Networks: (Abstract Only).",
                    "In-Package Domain-Specific ASICs for Intel® Stratix® 10 FPGAs: A Case Study of Accelerating Deep Learning Using TensorTile ASIC(Abstract Only).",
                    "Evaluation of OpenCL Performance-oriented Optimizations for Streaming Kernels on the FPGA: (Abstract Only).",
                    "K-Flow: A Programming and Scheduling Framework to Optimize Dataflow Execution on CPU-FPGA Platforms: (Abstract Only).",
                    "FPGA-based LSTM Acceleration for Real-Time EEG Signal Processing: (Abstract Only).",
                    "Understanding Performance Differences of FPGAs and GPUs: (Abtract Only).",
                    "Software/Hardware Co-design for Multichannel Scheduling in IEEE 802.11p MLME: (Abstract Only).",
                    "Solving Satisfiability Problem on Quantum Annealer: A Lesson from FPGA CAD Tools: (Abstract Only).",
                    "Domino: An Asynchronous and Energy-efficient Accelerator for Graph Processing: (Abstract Only).",
                    "Towards Serial-Equivalent Parallel Routing for FPGAs: (Abstract Only).",
                    "Performance Comparison of Multiple Approaches of Status Register for Medium Density Memory Suitable for Implementation of a Lossless Compression Dictionary: (Abstract Only).",
                    "BoxPlacer: Force Directed-Based Timing-Driven Placement for Large-Scale FPGAs: (Abstract Only).",
                    "DATuner: An Extensible Distributed Autotuning Framework for FPGA Design and Design Automation: (Abstract Only).",
                    "Mapping Large-Scale DNNs on Asymmetric FPGAs: (Abstract Only).",
                    "Software-Defined FPGA-Based Accelerator for Deep Convolutional Neural Networks: (Abstract Only).",
                    "Design of an MTJ-Based Nonvolatile LUT Circuit with a Data-Update Minimized Shift Operation for an Ultra-Low-Power FPGA: (Abstract Only).",
                    "High-Throughput Lossless Compression on Tightly Coupled CPU-FPGA Platforms: (Abstract Only).",
                    "HexCell: a Hexagonal Cell for Evolvable Systolic Arrays on FPGAs: (Abstract Only).",
                    "Performance Comparison of Multiples and Target Detection with Imager-driven Processing Mode for Ultrafast-Imager: (Abstract Only).",
                    "A Low-Power Deconvolutional Accelerator for Convolutional Neural Network Based Segmentation on FPGA: Abstract Only.",
                    "FPGAs in the Datacenters: the Case of Parallel Hybrid Super Scalar String Sample Sort (pHS5)(Abstract Only).",
                    "SIFT Keypoint Descriptor Matching Algorithm: A Fully Pipelined Accelerator on FPGA(Abstract Only).",
                    "FGC: A Tool-flow for Generating and Configuring Custom FPGAs(Abstract Only).",
                    "Exploration of Low Numeric Precision Deep Learning Inference Using Intel® FPGAs: (Abstract Only).",
                    "LEOSoC: An Open-Source Cross-Platform Embedded Linux Library for Managing Hardware Accelerators in Heterogeneous System-on-Chips(Abstract Only).",
                    "A Self-adaptation Method of Fitting Convolutional Neural Network into FPGA: Abstract Only)."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th FPGA 2017",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2017",
                "sub_name": "Proceedings of the 2017 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, FPGA 2017, Monterey, CA, USA, February 22-24, 2017.",
                "count": 62,
                "papers": [
                    "OLAF'17: Third International Workshop on Overlay Architectures for FPGAs.",
                    "The Role of FPGAs in Deep Learning.",
                    "Can FPGAs Beat GPUs in Accelerating Next-Generation Deep Neural Networks?",
                    "Accelerating Binarized Convolutional Neural Networks with Software-Programmable FPGAs.",
                    "Improving the Performance of OpenCL-based FPGA Accelerator for Convolutional Neural Network.",
                    "Frequency Domain Acceleration of Convolutional Neural Networks on CPU-FPGA Shared Memory System.",
                    "Optimizing Loop Operation and Dataflow in FPGA Acceleration of Deep Convolutional Neural Networks.",
                    "An OpenCL™ Deep Learning Accelerator on Arria 10.",
                    "FINN: A Framework for Fast, Scalable Binarized Neural Network Inference.",
                    "ESE: Efficient Speech Recognition Engine with Sparse LSTM on FPGA.",
                    "Quality-Time Tradeoffs in Component-Specific Mapping: How to Train Your Dynamically Reconfigurable Array of Gates with Outrageous Network-delays.",
                    "Synchronization Constraints for Interconnect Synthesis.",
                    "Corolla: GPU-Accelerated FPGA Routing Based on Subgraph Dynamic Expansion.",
                    "Don't Forget the Memory: Automatic Block RAM Modelling, Optimization, and Architecture Exploration.",
                    "Automatic Construction of Program-Optimized FPGA Memory Networks.",
                    "NAND-NOR: A Compact, Fast, and Delay Balanced FPGA Logic Element.",
                    "120-core microAptiv MIPS Overlay for the Terasic DE5-NET FPGA board.",
                    "A Parallelized Iterative Improvement Approach to Area Optimization for LUT-Based Technology Mapping.",
                    "A Parallel Bandit-Based Approach for Autotuning FPGA Compilation.",
                    "FPGAs in the Cloud.",
                    "Hardware Synthesis of Weakly Consistent C Concurrency.",
                    "A New Approach to Automatic Memory Banking using Trace-Based Address Mining.",
                    "Dynamic Hazard Resolution for Pipelining Irregular Loops in High-Level Synthesis.",
                    "Accelerating Face Detection on Programmable SoC Using C-Based Synthesis.",
                    "Packet Matching on FPGAs Using HMC Memory: Towards One Million Rules.",
                    "Boosting the Performance of FPGA-based Graph Processor using Hybrid Memory Cube: A Case for Breadth First Search.",
                    "ForeGraph: Exploring Large-scale Graph Processing on Multi-FPGA Architecture.",
                    "FPGA-Accelerated Transactional Execution of Graph Workloads.",
                    "Enabling Flexible Network FPGA Clusters in a Heterogeneous Cloud Data Center.",
                    "Energy Efficient Scientific Computing on FPGAs using OpenCL.",
                    "Secure Function Evaluation Using an FPGA Overlay Architecture.",
                    "FPGA Acceleration for Computational Glass-Free Displays.",
                    "Hardware Acceleration of the Pair-HMM Algorithm for DNA Variant Calling.",
                    "Measuring the Power-Constrained Performance and Energy Gap between FPGAs and Processors (Abstract Only).",
                    "A Mixed-Signal Data-Centric Reconfigurable Architecture enabled by RRAM Technology (Abstract Only).",
                    "A Framework for Iterative Stencil Algorithm Synthesis on FPGAs from OpenCL Programming Model (Abstract Only).",
                    "Scala Based FPGA Design Flow (Abstract Only).",
                    "Thermal Flattening in 3D FPGAs Using Embedded Cooling (Abstract Only).",
                    "A Machine Learning Framework for FPGA Placement (Abstract Only).",
                    "Precise Coincidence Detection on FPGAs: Three Case Studies (Abstract Only).",
                    "Towards Efficient Design Space Exploration of FPGA-based Accelerators for Streaming HPC Applications (Abstract Only).",
                    "Accurate and Efficient Hyperbolic Tangent Activation Function on FPGA using the DCT Interpolation Filter (Abstract Only).",
                    "An FPGA Overlay Architecture for Cost Effective Regular Expression Search (Abstract Only).",
                    "Using Vivado-HLS for Structural Design: a NoC Case Study (Abstract Only).",
                    "Automatic Generation of Hardware Sandboxes for Trojan Mitigation in Systems on Chip (Abstract Only).",
                    "Accelerating Financial Market Server through Hybrid List Design (Abstract Only).",
                    "Joint Modulo Scheduling and Memory Partitioning with Multi-Bank Memory for High-Level Synthesis (Abstract Only).",
                    "A Batch Normalization Free Binarized Convolutional Deep Neural Network on an FPGA (Abstract Only).",
                    "A 7.663-TOPS 8.2-W Energy-efficient FPGA Accelerator for Binary Convolutional Neural Networks (Abstract Only).",
                    "CPU-FPGA Co-Optimization for Big Data Applications: A Case Study of In-Memory Samtool Sorting (Abstract Only).",
                    "Stochastic-Based Multi-stage Streaming Realization of a Deep Convolutional Neural Network (Abstract Only).",
                    "fpgaConvNet: Automated Mapping of Convolutional Neural Networks on FPGAs (Abstract Only).",
                    "FPGA-based Hardware Accelerator for Image Reconstruction in Magnetic Resonance Imaging (Abstract Only).",
                    "Storage-Efficient Batching for Minimizing Bandwidth of Fully-Connected Neural Network Layers (Abstract Only).",
                    "ASAP: Accelerated Short Read Alignment on Programmable Hardware (Abstract Only).",
                    "RxRE: Throughput Optimization for High-Level Synthesis using Resource-Aware Regularity Extraction (Abstract Only).",
                    "GRT 2.0: An FPGA-based SDR Platform for Cognitive Radio Networks (Abstract Only).",
                    "FPGA Implementation of Non-Uniform DFT for Accelerating Wireless Channel Simulations (Abstract Only).",
                    "Learning Convolutional Neural Networks for Data-Flow Graph Mapping on Spatial Programmable Architectures (Abstract Only).",
                    "Cache Timing Attacks from The SoCFPGA Coherency Port (Abstract Only).",
                    "Dynamic Partitioning for Library based Placement on Heterogeneous FPGAs (Abstract Only).",
                    "An Energy-Efficient Design-Time Scheduler for FPGAs Leveraging Dynamic Frequency Scaling Emulation (Abstract Only)."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th FPGA 2016",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2016",
                "sub_name": "Proceedings of the 2016 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, Monterey, CA, USA, February 21-23, 2016.",
                "count": 67,
                "papers": [
                    "OLAF'16: Second International Workshop on Overlay Architectures for FPGAs.",
                    "HyperPipelining of High-Speed Interface Logic.",
                    "Spatial Debug & Debug Without Re-programming in FPGAs: On-Chip debugging in FPGAs.",
                    "SDSoC: A Higher-level Programming Environment for Zynq SoC and Ultrascale+ MPSoC.",
                    "FCUDA-SoC: Platform Integration for Field-Programmable SoC with the CUDA-to-FPGA Compiler.",
                    "Agile Co-Design for a Reconfigurable Datacenter.",
                    "Throughput-Optimized OpenCL-based FPGA Accelerator for Large-Scale Convolutional Neural Networks.",
                    "Going Deeper with Embedded FPGA Platform for Convolutional Neural Network.",
                    "Using Stochastic Computing to Reduce the Hardware Requirements for a Restricted Boltzmann Machine Classifier.",
                    "A Platform-Oblivious Approach for Heterogeneous Computing: A Case Study with Monte Carlo-based Simulation for Medical Applications.",
                    "A Case for Work-stealing on FPGAs with OpenCL Atomics.",
                    "Physical Design of 3D FPGAs Embedded with Micro-channel-based Fluidic Cooling.",
                    "Stratix™ 10 High Performance Routable Clock Networks.",
                    "Boolean Satisfiability-Based Routing and Its Application to Xilinx UltraScale Clock Network.",
                    "FPRESSO: Enabling Express Transistor-Level Exploration of FPGA Architectures.",
                    "Towards PVT-Tolerant Glitch-Free Operation in FPGAs.",
                    "Pitfalls and Tradeoffs in Simultaneous, On-Chip FPGA Delay Measurement.",
                    "FPGP: Graph Processing Framework on FPGA A Case Study of Breadth-First Search.",
                    "GraphOps: A Dataflow Library for Graph Analytics Acceleration.",
                    "High Performance Linkage Disequilibrium: FPGAs Hold the Key.",
                    "LMC: Automatic Resource-Aware Program-Optimized Memory Partitioning.",
                    "Efficient Memory Partitioning for Parallel Data Access via Data Reuse.",
                    "Intel Acquires Altera: How Will the World of FPGAs be Affected?",
                    "PRFloor: An Automatic Floorplanner for Partially Reconfigurable FPGA Systems.",
                    "The Stratix™ 10 Highly Pipelined FPGA Architecture.",
                    "Case for Design-Specific Machine Learning in Timing Closure of FPGA Designs.",
                    "Just In Time Assembly of Accelerators.",
                    "CASK: Open-Source Custom Architectures for Sparse Kernels.",
                    "GPU-Accelerated High-Level Synthesis for Bitwidth Optimization of FPGA Datapaths.",
                    "Resolve: Generation of High-Performance Sorting Architectures from High-Level Synthesis.",
                    "SEU Mitigation and Validation of the LEON3 Soft Processor Using Triple Modular Redundancy for Space Processing.",
                    "Optimal Circuits for Streamed Linear Permutations Using RAM.",
                    "High Level Synthesis of Complex Applications: An H.264 Video Decoder.",
                    "Automatically Optimizing the Latency, Area, and Accuracy of C Programs for High-Level Synthesis.",
                    "Reducing Memory Requirements for High-Performance and Numerically Stable Gaussian Elimination.",
                    "FGPU: An SIMT-Architecture for FPGAs.",
                    "A Study of Pointer-Chasing Performance on Shared-Memory Processor-FPGA Systems.",
                    "A Low DDR Bandwidth 100FPS 1080p Video 2D Discrete Wavelet Transform Implementation on FPGA (Abstract Only).",
                    "A Scalable Heterogeneous Dataflow Architecture For Big Data Analytics Using FPGAs (Abstract Only).",
                    "Accelerating Database Query Processing on OpenCL-based FPGAs (Abstract Only).",
                    "An Improved Global Stereo-Matching on FPGA for Real-Time Applications (Abstract Only).",
                    "ENFIRE: An Energy-efficient Fine-grained Spatio-temporal Reconfigurable Computing Fabric (Abstact Only).",
                    "Floorplanning of Partially Reconfigurable Design on Heterogeneous FPGA (Abstract Only).",
                    "Increasing the Utility of Self-Calibration Methods in High-Precision Time Measurement Systems (Abstract Only).",
                    "Knowledge is Power: Module-level Sensing for Runtime Optimisation (Abstact Only).",
                    "Machine-Learning driven Auto-Tuning of High-Level Synthesis for FPGAs (Abstract Only).",
                    "Re-targeting Optimization Sequences from Scalar Processors to FPGAs in HLS compilers (Abstract Only).",
                    "A High-throughput Architecture for Lossless Decompression on FPGA Designed Using HLS (Abstract Only).",
                    "An Activity Aware Placement Approach For 3D FPGAs (Abstract Only).",
                    "an Extensible Heterogeneous Multi-FPGA Framework for Accelerating N-body Simulation (Abstract Only).",
                    "An FPGA-Based Controller for a 77 GHz MEMS Tri-Mode Automotive Radar (Abstract Only).",
                    "An FPGA-SOC Based Accelerating Solution for N-body Simulations in MOND (Abstract Only).",
                    "Automated Verification Code Generation in HLS Using Software Execution Traces (Abstract Only).",
                    "DCPUF: Placement and Routing Constraint based Dynamically Configured Physical Unclonable Function on FPGA (Abstact Only).",
                    "Evaluating the Impact of Environmental Factors on Physically Unclonable Functions (Abstract Only).",
                    "Stochastic-Based Spin-Programmable Gate Array with Emerging MTJ Device Technology (Abstract Only).",
                    "Testing FPGA Local Interconnects Based on Repeatable Configuration Modules (Abstract Only).",
                    "A 1 GSa/s, Reconfigurable Soft-core FPGA ADC (Abstract Only).",
                    "A Full-Capacity Local RoutingArchitecture for FPGAs (Abstract Only).",
                    "ARAPrototyper: Enabling Rapid Prototyping and Evaluation for Accelerator-Rich Architecture (Abstact Only).",
                    "Doubling FPGA Throughput via a Soft SerDes Architecture for Full-Bandwidth Serial Pipelining (Abstract Only).",
                    "Enhanced TERO-PUF Implementations and Characterization on FPGAs (Abstract Only).",
                    "FPGA Power Estimation Using Automatic Feature Selection (Abstract Only).",
                    "HGum: Messaging Framework for Hardware Accelerators (Abstact Only).",
                    "Low-Swing Signaling for FPGA Power Reduction (Abstract Only).",
                    "Stochastic-Based Convolutional Networks with Reconfigurable Logic Fabric (Abstract Only).",
                    "t-QuadPlace: Timing Driven Quadratic Placement using Quadrisection Partitioning for FPGAs (Abstact Only)."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd FPGA 2015",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2015",
                "sub_name": "Proceedings of the 2015 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, Monterey, CA, USA, February 22-24, 2015.",
                "count": 83,
                "papers": [
                    "Physical Design Space Exploration.",
                    "Using Source-Level Transformations to Improve High-Level Synthesis Debug and Validation on FPGAs.",
                    "High-Level Design Tools for Floating Point FPGAs.",
                    "Software-Driven Hardware Development.",
                    "InTime: A Machine Learning Approach for Efficient Selection of FPGA CAD Tool Parameters.",
                    "Unlocking FPGAs Using High Level Synthesis Compiler Technologies.",
                    "Enhancing Hardware Design Flows with MyHDL.",
                    "Rapid Prototyping of Wireless Physical Layer Modules Using Flexible Software/Hardware Design Flow.",
                    "The BEEcube Story: Lessons Learned from Running a FPGA Startup for the Past 7 Years.",
                    "Application of Specific Delay Window Routing for Timing Optimization in FPGA Designs.",
                    "Fine-Grained Interconnect Synthesis.",
                    "Delay-Bounded Routing for Shadow Registers.",
                    "RapidSmith 2: A Framework for BEL-level CAD Exploration on Xilinx FPGAs.",
                    "Technology Mapping into General Programmable Cells.",
                    "EURECA: On-Chip Configuration Generation for Effective Dynamic Data Access.",
                    "Energy-Efficient Discrete Signal Processing with Field Programmable Analog Arrays (FPAAs).",
                    "Expanding OpenFlow Capabilities with Virtualized Reconfigurable Hardware.",
                    "Take the Highway: Design for Embedded NoCs on FPGAs.",
                    "Enhancements in UltraScale CLB Architecture.",
                    "Floating-Point DSP Block Architecture for FPGAs.",
                    "Superoptimized Memory Subsystems for Streaming Applications.",
                    "MATCHUP: Memory Abstractions for Heap Manipulating Programs.",
                    "Impact of Memory Architecture on FPGA Energy Consumption.",
                    "Design Space Exploration of L1 Data Caches for FPGA-Based Multiprocessor Systems.",
                    "Growing a Healthy FPGA Ecosystem.",
                    "Optimizing FPGA-based Accelerator Design for Deep Convolutional Neural Networks.",
                    "Wavefront Skipping using BRAMs for Conditional Algorithms on Vector Processors.",
                    "On Data Forwarding in Deeply Pipelined Soft Processors.",
                    "Mapping-Aware Constrained Scheduling for LUT-Based FPGAs.",
                    "Resource-Aware Throughput Optimization for High-Level Synthesis.",
                    "Numerical Program Optimization for High-Level Synthesis.",
                    "System-level Linking of Synthesised Hardware and Compiled Software Using a Higher-order Type System.",
                    "Automatic Time-Redundancy Transformation for Fault-Tolerant Circuits.",
                    "200 MS/s ADC implemented in a FPGA employing TDCs.",
                    "0.5-V Highly Power-Efficient Programmable Logic using Nonvolatile Configuration Switch in BEOL.",
                    "Energy and Memory Efficient Mapping of Bitonic Sorting on FPGA.",
                    "Ramethy: Reconfigurable Acceleration of Bisulfite Sequence Alignment.",
                    "An Efficient and Flexible FPGA Implementation of a Face Detection System (Abstract Only).",
                    "A Novel Method for Enabling FPGA Context-Switch (Abstract Only).",
                    "FPGA Acceleration for Simultaneous Image Reconstruction and Segmentation based on the Mumford-Shah Regularization (Abstract Only).",
                    "Logic Gates in the routing network of FPGAs (Abstract Only).",
                    "Real-Time Obstacle Avoidance for Mobile Robots via Stereoscopic Vision Using Reconfigurable Hardware (Abstract Only).",
                    "Towards More Efficient Logic Blocks By Exploiting Biconditional Expansion (Abstract Only).",
                    "An Automated Design Framework for Floating Point Scientific Algorithms using Field Programmable Gate Arrays (FPGAs) (Abstract Only).",
                    "Sequence-based In-Circuit Breakpoints for Post-Silicon Debug (Abstract Only).",
                    "Cost-Effective Memory Architecture to Achieve Flexible Configuration and Efficient Data Transmission for Coarse-Grained Reconfigurable Array (Abstract Only).",
                    "Exploring Efficiency of Ring Oscillator-Based Temperature Sensor Networks on FPGAs (Abstract Only).",
                    "Formal Verification ATPG Search Engine Emulator (Abstract Only).",
                    "Platform-Independent Gigabit Communication for Low-Cost FPGAs (Abstract Only).",
                    "An FPGA-Based Accelerator for the 2D Implicit FDM and Its Application to Heat Conduction Simulations (Abstract Only).",
                    "An FPGA Implementation of a Timing-Error Tolerant Discrete Cosine Transform (Abstract Only).",
                    "A Parallel And Scalable Multi-FPGA based Architecture for High Performance Applications (Abstract Only).",
                    "A Mixed-Grained Reconfigurable Computing Platform for Multiple-Standard Video Decoding (Abstract Only).",
                    "FiT: An Automated Toolkit for Matching Processor Architecture to Applications (Abstract Only).",
                    "FPGA-based BLOB Detection Using Dual-pipelining (Abstract Only).",
                    "An FPGA Implementation of Multi-stream Tracking Hardware using 2D SIMD Array (Abstract Only).",
                    "300 Thousand Gates Single Event Effect Hardened SRAM-based FPGA for Space Application (Abstract Only).",
                    "REPROC: A Dynamically Reconfigurable Architecture for Symmetric Cryptography (Abstract Only).",
                    "Architecture of Reconfigurable-Logic Cell Array with Atom Switch: Cluster Size & Routing Fabrics (Abstract Only).",
                    "A Novel Method for FPGA Test Based on Partial Reconfiguration and Sorting Algorithm (Abstract Only).",
                    "A Novel Composite Method to Accelerate Control Flow on Reconfigurable Architecture (Abstract Only).",
                    "Acceleration of Synthetic Aperture Radar (SAR) Algorithms using Field Programmable Gate Arrays (FPGAs) (Abstract Only).",
                    "An Embedded FPGA Operating System Optimized for Vision Computing (Abstract Only).",
                    "FPGA Implementation of Trained Coarse Carrier Frequency Offset Estimation and Correction for OFDM Signals (Abstract Only).",
                    "Energy-Efficient High-Order FIR Filtering through Reconfigurable Stochastic Processing (Abstract Only).",
                    "Silicon Verification using High-Level Design Tools (Abstract Only).",
                    "A Hardware Implementation of a Unit for Geometric Algebra Operations With Parallel Memory Arrays (Abstract Only).",
                    "Efficient Generation of Energy and Performance Pareto Front for FPGA Designs (Abstract Only).",
                    "A Novel Coefficient Address Generation Algorithm for Split-Radix FFT (Abstract Only).",
                    "RapidPath: Accelerating Constrained Shortest Path Finding in Graphs on FPGA (Abstract Only).",
                    "High Level Programming of Document Classification Systems for Heterogeneous Environments using OpenCL (Abstract Only).",
                    "Low-Resource Bluespec Design of a Modular Acquisition and Stimulation System for Neuroscience (Abstract Only).",
                    "Bridging Architecture and Programming for Throughput-Oriented Vision Processing (Abstract Only).",
                    "An Automatic Design Flow for Hybrid Parallel Computing on MPSoCs (Abstract Only).",
                    "MedianPipes: An FPGA based Highly Pipelined and Scalable Technique for Median Filtering (Abstract Only).",
                    "Toward Wave Digital Filter based Analog Circuit Emulation on FPGA (Abstract Only).",
                    "Optimized Fixed-Point FPGA Implementation of SVPWM for a Two-Level Inverter (Abstract Only).",
                    "Area Optimization of Arithmetic Units by Component Sharing for FPGAs (Abstract Only).",
                    "Customizable and High Performance Matrix Multiplication Kernel on FPGA (Abstract Only).",
                    "Accelerating Complete Decision Support Queries Through High-Level Synthesis Technology (Abstract Only).",
                    "FPGA Acceleration of Irregular Iterative Computations using Criticality-Aware Dataflow Optimizations (Abstract Only).",
                    "On Implementation of LUT with Large Numbers of Inputs (Abstract Only).",
                    "Design of a Loeffler DCT using Xilinx Vivado HLS (Abstract Only)."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd FPGA 2014",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2014",
                "sub_name": "The 2014 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays, FPGA '14, Monterey, CA, USA - February 26 - 28, 2014.",
                "count": 69,
                "papers": [
                    "Fast and effective placement and routing directed high-level synthesis for FPGAs.",
                    "Optimizing effective interconnect capacitance for FPGA power reduction.",
                    "Towards interconnect-adaptive packing for FPGAs.",
                    "Rent's rule based FPGA packing for routability optimization.",
                    "Modular multi-ported SRAM-based memories.",
                    "Revisiting and-inverter cones.",
                    "Scalable multi-access flash store for big data analytics.",
                    "Dynamic voltage & frequency scaling with online slack measurement.",
                    "Cad and routing architecture for interposer-based multi-FPGA systems.",
                    "Memory block based scan-BIST architecture for application-dependent FPGA testing.",
                    "FPGA-based biophysically-meaningful modeling of olivocerebellar neurons.",
                    "Square-rich fixed point polynomial evaluation on FPGAs.",
                    "Accelerating frequent item counting with FPGA.",
                    "A power side-channel-based digital to analog converterfor Xilinx FPGAs.",
                    "Soft vector processors with streaming pipelines.",
                    "MORP: makespan optimization for processors with an embedded reconfigurable fabric.",
                    "OmpSs@Zynq all-programmable SoC ecosystem.",
                    "A FPGA prototype design emphasis on low power technique.",
                    "Hardware acceleration of database operations.",
                    "A scalable sparse matrix-vector multiplication kernel for energy-efficient sparse-blas on FPGAs.",
                    "Binary stochastic implementation of digital logic.",
                    "Accelerating parameter estimation for multivariate self-exciting point processes.",
                    "Energy-efficient multiplier-less discrete convolver through probabilistic domain transformation.",
                    "Wordwidth, instructions, looping, and virtualization: the role of sharing in absolute energy minimization.",
                    "Theory and algorithm for generalized memory partitioning in high-level synthesis.",
                    "Using high-level synthesis and formal analysis to predict and preempt attacks on industrial control systems.",
                    "Combining computation and communication optimizations in system synthesis for streaming applications.",
                    "Quantifying the cost and benefit of latency insensitive communication on FPGAs.",
                    "MPack: global memory optimization for stream applications in high-level synthesis.",
                    "A soft error vulnerability analysis framework for Xilinx FPGAs.",
                    "FPGA LUT design for wide-band dynamic voltage and frequency scaled operation (abstract only).",
                    "A configurable mapreduce accelerator for multi-core FPGAs (abstract only).",
                    "A new basic logic structure for data-path computation (abstract only).",
                    "A methodology for identifying and placing heterogeneous cluster groups based on placement proximity data (abstract only).",
                    "A scalable routability-driven analytical placer with global router integration for FPGAs (abstract only).",
                    "Towards high performance GHASH for pipelined AES-GCM using FPGAs (abstract only).",
                    "Hierarchical library-based power estimator for versatile FPGAs (abstract only).",
                    "Transformations for throughput optimization in high-level synthesis (abstract only).",
                    "On hybrid memory allocation for FPGA behavioral synthesis (abstract only).",
                    "Pushing the performance boundary of linear projection designs through device specific optimisations (abstract only).",
                    "Accelerating massive short reads mapping for next generation sequencing (abstract only).",
                    "Application specific processor with high level synthesized instructions (abstract only).",
                    "Optimally mitigating BTI-induced FPGA device aging with discriminative voltage scaling (abstract only).",
                    "Design, implementation and security analysis of hardware trojan threats in FPGA (abstract only).",
                    "A power-efficient adaptive heapsort for fpga-based image coding application (abstract only).",
                    "Big data genome sequencing on Zynq based clusters (abstract only).",
                    "BMP: a fast B*-tree based modular placer for FPGAs (abstract only).",
                    "Redefining the role of FPGAs in the next generation avionic systems (abstract only).",
                    "Co-processing with dynamic reconfiguration on heterogeneous MPSoC: practices and design tradeoffs (abstract only).",
                    "Control signal aware slice-level window based legalization method for FPGA placement (abstract only).",
                    "Future inter-FPGA communication architecture for multi-FPGA based prototyping (abstract only).",
                    "1K manycore FPGA shared memory architecture for SOC (abstract only).",
                    "Non-adaptive sparse recovery and fault evasion using disjunct design configurations (abstract only).",
                    "Novel FPGA clock network with low latency and skew (abstract only).",
                    "Asynchronous physical unclonable function using FPGA-based self-timed ring oscillator (abstract only).",
                    "APMC: advanced pattern based memory controller (abstract only).",
                    "On energy efficiency and amdahl's law in FPGA based chip heterogeneous multiprocessor systems (abstract only).",
                    "Producing high-quality real-time HDR video system with FPGA (abstract only).",
                    "xDEFENSE: an extended DEFENSE for mitigating next generation intrusions (abstract only).",
                    "Coordinating routing resources for hex pips test in island-style FPGAs (abstract only).",
                    "Pipelining FPPGA-based defect detction in FPDs (abstract only).",
                    "EPEE: an efficient PCIe communication library with easy-host-integration property for FPGA accelerators (abstract only).",
                    "Implementing FPGA-based energy-efficient dense optical flow computation with high portability in C (abstract only).",
                    "Methodology to generate multi-dimensional systolic arrays for FPGAs using openCL (abstract only).",
                    "Improving the security and the scalability of the AES algorithm (abstract only).",
                    "Power estimation tool for system on programmable chip based platforms (abstract only).",
                    "Using DSP blocks to compute CRC hash in FPGA (abstract only).",
                    "An automatic netlist and floorplanning approach to improve the MTTR of scrubbing techniques (abstract only).",
                    "Exploring duty cycle distortions along signal paths in FPGAs (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st FPGA 2013",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2013",
                "sub_name": "The 2013 ACM/SIGDA International Symposium on Field Programmable Gate Arrays, FPGA '13, Monterey, CA, USA, February 11-13, 2013.",
                "count": 70,
                "papers": [
                    "Building zynq® accelerators with Vivado® high level synthesis.",
                    "Cross-platform FPGA accelerator development using CoRAM and CONNECT.",
                    "Harnessing the power of FPGAs using altera's OpenCL compiler.",
                    "High-level synthesis with LegUp: a crash course for users and researchers.",
                    "Improving high level synthesis optimization opportunity through polyhedral transformations.",
                    "Towards simulator-like observability for FPGAs: a virtual overlay network for trace-buffers.",
                    "Polyhedral-based data reuse optimization for configurable computing.",
                    "Faithful single-precision floating-point tangent for FPGAs.",
                    "Accelerating ncRNA homology search with FPGAs.",
                    "Accelerating subsequence similarity search based on dynamic time warping distance with FPGA.",
                    "Video-rate stereo matching using markov random field TRW-S inference on a hybrid CPU+FPGA computing platform.",
                    "Fully-functional FPGA prototype with fine-grain programmable body biasing.",
                    "GROK-LAB: generating real on-chip knowledge for intra-cluster delays using timing extraction.",
                    "Side-channel attacks on the bitstream encryption mechanism of Altera Stratix II: facilitating black-box analysis using software reverse-engineering.",
                    "Sensing nanosecond-scale voltage attacks and natural transients in FPGAs.",
                    "Word-length optimization beyond straight line code.",
                    "Placement of repair circuits for in-field FPGA repair.",
                    "Heracles: a tool for fast RTL-based design space exploration of multicore processors.",
                    "Are FPGAs suffering from the innovator's dilemna?",
                    "Location, location, location: the role of spatial locality in asymptotic energy minimization.",
                    "Architectural enhancements in Stratix V™.",
                    "Minimum energy operation for clustered island-style FPGAs.",
                    "Improving bitstream compression by modifying FPGA architecture.",
                    "Elastic CGRAs.",
                    "Embedding-based placement of processing element networks on FPGAs for physical model simulation.",
                    "Area-efficient near-associative memories on FPGAs.",
                    "Dynafuse: dynamic dependence analysis for FPGA pipeline fusion and locality optimizations.",
                    "A remote memory access infrastructure for global address space programming models in FPGAs.",
                    "C-to-CoRAM: compiling perfect loop nests to the portable CoRAM abstraction.",
                    "Architecture support for custom instructions with memory operations.",
                    "An FPGA based parallel architecture for music melody matching.",
                    "An FPGA memcached appliance.",
                    "High throughput and programmable online trafficclassifier on FPGA.",
                    "FPGA bitstream compression and decompression using LZ and golomb coding (abstract only).",
                    "Indirect connection aware attraction for FPGA clustering (abstract only).",
                    "Towards automatic customization of interconnect and memory in the CoRAM abstraction (abstract only).",
                    "A latency-optimized hybrid network for clustering FPGAs (abstract only).",
                    "Genome sequencing using mapreduce on FPGA with multiple hardware accelerators (abstract only).",
                    "Hardware implemented real-time operating system (abstract only).",
                    "Hybrid masking using intra-masking dual-rail memory on LUT for SCA-Resistant AES implementation on FPGA (abstract only).",
                    "FPGA-based acceleration of cascaded support vector machines for embedded applications (abstract only).",
                    "Precision fault injection method based on correspondence between configuration bitstream and architecture (abstract only).",
                    "Custom instruction generation and mapping for reconfigurable instruction set processors (abstract only).",
                    "High performance architecture for object detection in streamed video (abstract only).",
                    "Automatic multidimensional memory partitioning for FPGA-based accelerators (abstract only).",
                    "A novel multithread routing method for FPGAs (abstract only).",
                    "FPGA meta-data management system for accelerating implementation time with incremental compilation (abstract only).",
                    "Achieving modular dynamic partial reconfiguration with a difference-based flow (abstract only).",
                    "A novel run-time auto-reconfigurable FPGA architecture for fast fault recovery with backward compatibility (abstract only).",
                    "Hardware acceleration of TEA and XTEA algorithms on FPGA, GPU and multi-core processors (abstract only).",
                    "A novel FPGA design framework with VLSI post-routing performance analysis (abstract only).",
                    "An FPGA-based transient error simulator for evaluating resilient system designs (abstract only).",
                    "Acceleration of the long read mapping on a PC-FPGA architecture (abstract only).",
                    "Effect of fixed-point arithmetic on deep belief networks (abstract only).",
                    "A memory-efficient hardware architecture for real-time feature detection of the SIFT algorithm (abstract only).",
                    "Exploiting algorithmic-level memory parallelism in distributed logic-memory architecture through hardware-assisted dynamic graph (abstract only).",
                    "FPGA-based HPC application design for non-experts (abstract only).",
                    "AutoMapper: an automated tool for optimal hardware resource allocation for networking applications on FPGA (abstract only).",
                    "Performance and toolchain of a combined GPU/FPGA desktop (abstract only).",
                    "Hardware description and synthesis of control-intensive reconfigurable dataflow architectures (abstract only).",
                    "Automating resource optimisation in reconfigurable design (abstract only).",
                    "Low power FPGA design using post-silicon device aging (abstract only).",
                    "Circuit optimizations to minimize energy in the global interconnect of a low-power-FPGA (abstract only).",
                    "Efficient system-level mapping from streaming applications to FPGAs (abstract only).",
                    "Defect recovery in nanodevice-based programmable interconnects (abstract only).",
                    "A high-performance, low-energy FPGA accelerator for correntropy-based feature tracking (abstract only).",
                    "Scalable high-throughput architecture for large balanced tree structures on FPGA (abstract only).",
                    "Co-simulation framework of SystemC SoC virtual prototype and custom logic (abstract only).",
                    "Rectification of advanced microprocessors without changing routing on FPGAs (abstract only).",
                    "Shadow AICs: reaping the benefits of and-inverter cones with minimal architectural impact (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th FPGA 2012",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2012",
                "sub_name": "Proceedings of the ACM/SIGDA 20th International Symposium on Field Programmable Gate Arrays, FPGA 2012, Monterey, California, USA, February 22-24, 2012.",
                "count": 56,
                "papers": [
                    "Intra-masking dual-rail memory on LUT implementation for tamper-resistant AES on FPGA.",
                    "Speedy FPGA-based packet classifiers with low on-chip memory requirements.",
                    "A real-time stereo vision system using a tree-structured dynamic programming on FPGA.",
                    "Incremental clustering applied to radar deinterleaving: a parameterized FPGA implementation.",
                    "X-ORCA: FPGA-based wireless localization in the sub-millimeter range.",
                    "Communication visualization for bottleneck detection of high-level synthesis applications.",
                    "CONNECT: re-examining conventional wisdom for designing nocs in the context of FPGAs.",
                    "A performance and energy comparison of FPGAs, GPUs, and multicores for sliding-window applications.",
                    "A mixed precision Monte Carlo methodology for reconfigurable accelerator systems.",
                    "Saturating the transceiver bandwidth: switch fabric design on FPGAs.",
                    "The VTR project: architecture and CAD for FPGAs from verilog to routing.",
                    "Compiling high throughput network processors.",
                    "Limit study of energy & delay benefits of component-specific routing.",
                    "Analyzing and predicting the impact of CAD algorithm noise on FPGA speed performance and power.",
                    "Impact of FPGA architecture on resource sharing in high-level synthesis.",
                    "A fast discrete placement algorithm for FPGAs.",
                    "Rethinking FPGAs: elude the flexibility excess of LUTs with and-inverter cones.",
                    "Securing netlist-level FPGA design through exploiting process variation and degradation.",
                    "Prototype and evaluation of the CoRAM memory architecture for FPGA-based computing.",
                    "A coarse-grained stream architecture for cryo-electron microscopy images 3D reconstruction.",
                    "A cycle-accurate, cycle-reproducible multi-FPGA system for accelerating multi-core processor simulation.",
                    "FPGA-accelerated 3D reconstruction using compressive sensing.",
                    "Reconfigurable architecture and automated design flow for rapid FPGA-based LDPC code emulation.",
                    "Reliability of a softcore processor in a commercial SRAM-based FPGA.",
                    "Leveraging latency-insensitivity to ease multiple FPGA design.",
                    "A scalable approach for automated precision analysis.",
                    "Optimizing SDRAM bandwidth for custom FPGA loop accelerators.",
                    "VirtualRC: a virtual FPGA platform for applications and tools portability.",
                    "Multi-ported memories for FPGAs via XOR.",
                    "OCTAVO: an FPGA-centric processor family.",
                    "Accelerator compiler for the VENICE vector processor.",
                    "FCache: a system for cache coherent processing on FPGAs.",
                    "A lean FPGA soft processor built using a DSP block.",
                    "Functionally verifying state saving and restoration in dynamically reconfigurable systems.",
                    "A configurable architecture to limit wakeup current in dynamically-controlled power-gated FPGAs.",
                    "Reducing the cost of floating-point mantissa alignment and normalization in FPGAs.",
                    "Accelerating short read mapping on an FPGA (abstract only).",
                    "The masala machine: accelerating thread-intensive and explicit memory management programs with dynamically reconfigurable FPGAs (abstract only).",
                    "Timing yield improvement of FPGAs utilizing enhanced architectures and multiple configurations under process variation (abstract only).",
                    "A field programmable array core for image processing (abstract only).",
                    "EmPower: FPGA based emulation of dynamic power management algorithms for multi-core systems on chip (abstract only).",
                    "Adaptive FPGA-based robotics state machine architecture derived with genetic algorithms (abstract only).",
                    "A novel full coverage test method for CLBs in FPGA (abstract only).",
                    "Constraint-driven automatic generation of interconnect for partially reconfigurable architectures (abstract only).",
                    "Thermal-aware logic block placement for 3D FPGAs considering lateral heat dissipation (abstract only).",
                    "Power-aware FPGA technology mapping for programmable-VT architectures (abstract only).",
                    "FPGA-RR: an enhanced FPGA architecture with RRAM-based reconfigurable interconnects (abstract only).",
                    "Efficient in-system RTL verification and debugging using FPGAs (abstract only).",
                    "Parallel FPGA placement based on individual LUT placement (abstract only).",
                    "Dataflow-driven execution control in a coarse-grained reconfigurable array (abstract only).",
                    "OpenCL memory infrastructure for FPGAs (abstract only).",
                    "Operation scheduling and architecture co-synthesis for energy-efficient dataflow computations on FPGAs (abstract only).",
                    "Post-silicon debugging targeting electrical errors with patchable controllers (abstract only).",
                    "Algorithm and architecture optimization for large size two dimensional discrete fourier transform (abstract only).",
                    "Early timing estimation for system-level design using FPGAs (abstract only).",
                    "Scalable architecture for 135 GBPS IPv6 lookup on FPGA (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th FPGA 2011",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2011",
                "sub_name": "Proceedings of the ACM/SIGDA 19th International Symposium on Field Programmable Gate Arrays, FPGA 2011, Monterey, California, USA, February 27, March 1, 2011.",
                "count": 61,
                "papers": [
                    "The role of FPGAs in a converged future with heterogeneous programmable processors: pre-conference workshop.",
                    "Should the academic community launch an open-source FPGA device and tools effort?: evening panel.",
                    "Comparing FPGA vs. custom cmos and the impact on processor microarchitecture.",
                    "VEGAS: soft vector processor with scratchpad memory.",
                    "Leap scratchpads: automatic memory and cache management for reconfigurable logic.",
                    "NetTM: faster and easier synchronization for soft multicores via transactional memory.",
                    "LegUp: high-level synthesis for FPGA-based processor/accelerator systems.",
                    "Automatic SoC design flow on many-core processors: a software hardware co-design approach for FPGAs.",
                    "Torc: towards an open-source tool flow.",
                    "FPGASort: a high performance sorting architecture exploiting run-time reconfiguration on fpgas for large problem sorting.",
                    "Real-time high-definition stereo matching on FPGA.",
                    "Eliminating the memory bottleneck: an FPGA-based solution for 3d reverse time migration.",
                    "A platform for high level synthesis of memory-intensive image processing algorithms.",
                    "Improved double angle complex rotation QRD-RLS.",
                    "Authenticated encryption for FPGA bitstreams.",
                    "A 65nm flash-based FPGA fabric optimized for low cost and power.",
                    "CoRAM: an in-fabric memory architecture for FPGA-based computing.",
                    "Energy-efficient specialization of functional units in a coarse-grained reconfigurable array.",
                    "Thermal and power characterization of field-programmable gate arrays.",
                    "DEEP: an iterative fpga-based many-core emulation system for chip verification and architecture research.",
                    "Bridging the GPGPU-FPGA efficiency gap.",
                    "A CAD framework for Malibu: an FPGA with time-multiplexed coarse-grained elements.",
                    "Line-level incremental resynthesis techniques for FPGAs.",
                    "Towards scalable FPGA CAD through architecture.",
                    "Scalable and deterministic timing-driven parallel placement for FPGAs.",
                    "Improved delay measurement method in FPGA based on transition probability.",
                    "Timing-driven pathfinder pathology and remediation: quantifying and reducing delay noise in VPR-pathfinder.",
                    "Performance estimation framework for automated exploration of CPU-accelerator architectures.",
                    "An analytical model relating FPGA architecture parameters to routability.",
                    "The RLOC is dead - long live the RLOC.",
                    "Building a multi-FPGA virtualized restricted boltzmann machine architecture using embedded MPI.",
                    "A monte-carlo floating-point unit for self-validating arithmetic.",
                    "An FPGA implementation of a sparse quadratic programming solver for constrained predictive control.",
                    "Exploration of FPGA interconnect for the design of unconventional antennas.",
                    "Architecture description and packing for logic blocks with hierarchy, modes and complex interconnect.",
                    "Reducing the pressure on routing resources of FPGAs with generic logic chains.",
                    "Co-synthesis of FPGA-based application-specific floating point simd accelerators.",
                    "Memory-efficient and scalable virtual routers using FPGA.",
                    "FPGA side-channel receivers.",
                    "An accelerated and energy-efficient traffic monitor using the NetFPGA (abstract only).",
                    "Low power interconnect design for fpgas with bidirectional wiring using nanocrystal floating gate devices (abstract only).",
                    "Dealing with the \"itanium effect\" (abstract only).",
                    "On timing yield improvement for FPGA designs using architectural symmetry (abstract only).",
                    "High level synthesis for FPGAs applied to a sphere decoder channel preprocessor (abstract only).",
                    "Resolving implicit barrier synchronizations in FPGA HLS (abstract only).",
                    "A prototype FPGA for subthreshold-optimized CMOS (abstract only).",
                    "Fault modeling and characteristics of SRAM-based FPGAs (abstract only).",
                    "A streaming FPGA implementation of a steerable filter for real-time applications (abstract only).",
                    "Using many-core architectural templates for FPGA-based computing (abstract only).",
                    "A chip-level path-delay-distribution based Dual-VDD method for low power FPGA (abstract only).",
                    "A comparison of FPGAs, GPUS and CPUS for Smith-Waterman algorithm (abstract only).",
                    "Variation tolerant asynchronous FPGA (abstract only).",
                    "Microblaze: an application-independent fpga-based profiler (abstract only).",
                    "FPGA-based fine-grain parallel computing (abstract only).",
                    "Memory based computing: reshaping the fine-grained logic in a reconfigurable framework (abstract only).",
                    "Health monitoring of live circuits in FPGAs based on time delay measurement (abstract only).",
                    "FPGA placement by graph isomorphism (abstract only).",
                    "Regular fabric for regular FPGA (abstract only).",
                    "FPGA-based nand flash memory error characterization and solid-state drive prototyping platform (abstract only).",
                    "Towards automated optimisation of tool-generated HW/SW sopc designs (abstract only).",
                    "BBFEX: a bloom-bloomier filter extension for long patterns in FPGA-based pattern matching system (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th FPGA 2010",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2010",
                "sub_name": "Proceedings of the ACM/SIGDA 18th International Symposium on Field Programmable Gate Arrays, FPGA 2010, Monterey, California, USA, February 21-23, 2010.",
                "count": 66,
                "papers": [
                    "FPGA-2010 pre-conference workshop on open-source for FPGA.",
                    "Intel nehalem processor core made FPGA synthesizable.",
                    "FPGA prototyping of an amba-based windows-compatible SoC.",
                    "Predicting the performance of application-specific NoCs implemented on FPGAs.",
                    "Combining multicore and reconfigurable instruction set extensions.",
                    "Energy efficient sensor node implementations.",
                    "Efficient multi-ported memories for FPGAs.",
                    "Automatic generation of high-performance multipliers for FPGAs with asymmetric multiplier blocks.",
                    "Bit-level optimization for high-level synthesis and FPGA-based acceleration.",
                    "Designing hardware with dynamic memory abstraction.",
                    "High-throughput bayesian computing machine with reconfigurable hardware.",
                    "High throughput and large capacity pipelined dynamic search tree on FPGA.",
                    "FPMR: MapReduce framework on FPGA.",
                    "Acceleration of an analytical approach to collateralized debt obligation pricing.",
                    "A 3d-audio reconfigurable processor.",
                    "Accelerating Monte Carlo based SSTA using FPGA.",
                    "Axel: a heterogeneous cluster with FPGAs and GPUs.",
                    "Server-side coprocessor updating for mobile devices with FPGAs.",
                    "Accurately evaluating application performance in simulated hybrid multi-tasking systems.",
                    "Programming high performance signal processing systems in high level languages.",
                    "Towards scalable placement for FPGAs.",
                    "FPGA power reduction by guarded evaluation.",
                    "A comprehensive approach to modeling, characterizing and optimizing for metastability in FPGAs.",
                    "Variation-aware placement for FPGAs with multi-cycle statistical timing analysis.",
                    "Global delay optimization using structural choices.",
                    "Building a faster boolean matcher using bloom filter.",
                    "Haptic rendering of deformable objects using a multiple FPGA parallel computing architecture.",
                    "A 1 cycle-per-byte XML parsing accelerator.",
                    "A modular NFA architecture for regular expression matching.",
                    "Scalable network virtualization using FPGAs.",
                    "Degradation in FPGAs: measurement and modelling.",
                    "On-line sensing for healthier FPGA systems.",
                    "Voter insertion algorithms for FPGA designs using triple modular redundancy.",
                    "Maximizing area-constrained partial fault tolerance in reconfigurable logic.",
                    "The impact of interconnect architecture on via-programmed structured ASICs (VPSAs).",
                    "Efficient FPGAs using nanoelectromechanical relays.",
                    "A multi-FPGA based platform for emulating a 100m-transistor-scale processor with high-speed peripherals (abstract only).",
                    "Towards 5ps resolution TDC on a dynamically reconfigurable FPGA (abstract only).",
                    "An architecture for graphics processing in an FPGA (abstract only).",
                    "FPGA implementation of highly parallelized decoder logic for network coding (abstract only).",
                    "Application of a reconfigurable computing cluster to ultra high throughput genome resequencing (abstract only).",
                    "FPGA based chip emulation system for test development and verification of analog and mixed signal circuits (abstract only).",
                    "LambdaRank acceleration for relevance ranking in web search engines (abstract only).",
                    "Memory efficient string matching: a modular approach on FPGAs (abstract only).",
                    "Implementing dynamic information flow tracking on microprocessors with integrated FPGA fabric (abstract only).",
                    "A semi-automatic toolchain for reconfigurable multiprocessor systems-on-chip: architecture development and application partitioning (abstract only).",
                    "A dependency graph based methodology for parallelizing HLL applications on FPGA (abstract only).",
                    "Design space exploration of throughput-optimized arrays from recurrence abstractions (abstract only).",
                    "Reconfigurable custom floating-point instructions (abstract only).",
                    "Multiplier architectures for FPGA double precision functions (abstract only).",
                    "Automatic tool flow for shift-register-LUT reconfiguration: making run-time reconfiguration fast and easy (abstract only).",
                    "Odin II: an open-source verilog HDL synthesis tool for FPGA cad flows (abstract only).",
                    "LUT-based FPGA technology mapping for reliability (abstract only).",
                    "Aggressive overclocking support using a novel timing error recovery technique on FPGAs (abstract only).",
                    "A heuristic algorithm for LUT-based FPGA technology mapping using the lower bound for DAG covering problem (abstract only).",
                    "Heterogeneous-ASIF: an application specific inflexible FPGA using heterogeneous logic blocks (abstract only).",
                    "Scalable architecture for programmable quantum gate array (abstract only).",
                    "Fine-grained vs. coarse-grained shift-and-add arithmetic in FPGAs (abstract only).",
                    "DRAM-based FPGA enabled by three-dimensional (3d) memory stacking (abstract only).",
                    "Modeling and simulation of nano quantum FPGAs (abstract only).",
                    "Nano-magnetic non-volatile CMOS circuits for nano-scale FPGAs (abstract only).",
                    "High-performance FPGA based on novel DSS-MOSFET and non-volatile configuration memory (abstract only).",
                    "Design and evaluation of a parameterizable NoC router for FPGAs (abstract only).",
                    "Energy reduction with run-time partial reconfiguration (abstract only).",
                    "Minimizing partial reconfiguration overhead with fully streaming DMA engines and intelligent ICAP controller (abstract only).",
                    "FPGA-based prototyping of a 2D MESH / TORUS on-chip interconnect (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th FPGA 2009",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2009",
                "sub_name": "Proceedings of the ACM/SIGDA 17th International Symposium on Field Programmable Gate Arrays, FPGA 2009, Monterey, California, USA, February 22-24, 2009.",
                "count": 64,
                "papers": [
                    "Emerging application domains: research challenges and opportunities for FPGAs.",
                    "Towards automated ECOs in FPGAs.",
                    "Clock power reduction for virtex-5 FPGAs.",
                    "Choose-your-own-adventure routing: lightweight load-time defect avoidance.",
                    "Architectural enhancements in Stratix-IIITM and Stratix-IVTM.",
                    "Towards reliable 5Gbps wave-pipelined and 3Gbps surfing interconnect in 65nm FPGAs.",
                    "A comparison of via-programmable gate array logic cell circuits.",
                    "A comparison of CPUs, GPUs, FPGAs, and massively parallel processor arrays for random number generation.",
                    "A high-performance FPGA architecture for restricted boltzmann machines.",
                    "A multi-fpga 10x-real-time high-speed search engine for a 5000-word vocabulary speech recognizer.",
                    "FPGA-based front-end electronics for positron emission tomography.",
                    "Fpga-based face detection system using Haar classifiers.",
                    "A 17ps time-to-digital converter implemented in 65nm FPGA technology.",
                    "CMOS vs Nano: comrades or rivals?",
                    "Making good points: application-specific pareto-point generation for design space exploration using statistical methods.",
                    "VPR 5.0: FPGA cad and architecture exploration tools with single-driver routing, heterogeneity and process scaling.",
                    "FPGA technology mapping with encoded libraries andstaged priority cuts.",
                    "Scalable don't-care-based logic optimization and resynthesis.",
                    "FPCNA: a field programmable carbon nanotube array.",
                    "Flexible multi-mode embedded floating-point unit for field programmable gate arrays.",
                    "Wirelength modeling for homogeneous and heterogeneous FPGA architectural development.",
                    "SPR: an architecture-adaptive CGRA mapping tool.",
                    "Synthesis of reconfigurable high-performance multicore systems.",
                    "Intel® atomTM processor core made FPGA-synthesizable.",
                    "Large-scale wire-speed packet classification on FPGAs.",
                    "Fast and scalable packet classification using perfect hash functions.",
                    "SmartOpt: an industrial strength framework for logic synthesis.",
                    "Cholesky decomposition using fused datapath synthesis.",
                    "Diagonal tracks in FPGAs: a performance evaluation.",
                    "A high performance fpga-based implementation of position specific iterated blast.",
                    "A communication architecture for complex runtime reconfigurable systems and its implementation on spartan-3 FPGAs.",
                    "PERG-Rx: a hardware pattern-matching engine supporting limited regular expressions.",
                    "High-performance, energy-efficient platforms using in-socket FPGA accelerators.",
                    "HW/SW methodologies for synchronization in FPGA multiprocessors.",
                    "Automatic bus macro placement for partially reconfigurable FPGA designs.",
                    "Bus mastering PCI express in an FPGA.",
                    "Soft vector processors vs FPGA custom hardware: measuring and reducing the gap.",
                    "Data streaming and simd support for the microblaze architecture.",
                    "Small scale multiprocessor soft IP (SSM IP): single FPGA chip area and performance evaluation.",
                    "Customizable bit-width in an OpenMP-based circuit design tool.",
                    "Revisiting bitwidth optimizations.",
                    "A clustering framework for task partitioning based on function-level data usage analysis.",
                    "An intermediate hardware model with load/store unit for C to FPGA.",
                    "N-port memory mapping for LUT-based FPGAs.",
                    "Parallel placement for FPGAs revisited.",
                    "Simultaneous multi-channel data acquisition with variable sampling frequencies using a scalable adaptive synchronous controller.",
                    "Performance and power of cache-based reconfigurable computing.",
                    "Computation reuse in domain-specific optimization of signal recognition.",
                    "The input-aware dynamic adaptation of area and performance for reconfigurable accelerator.",
                    "Implementation of the reconfiguration port scheduling on the erlangen slot machine.",
                    "HMMer acceleration using systolic array based reconfigurable architecture.",
                    "FPGA implementation of real-time skin color detection with mean-based surface flattening.",
                    "Streaming implementation of a sequential decompression algorithm on an FPGA.",
                    "32-bit floating-point FPGA gaussian elimination.",
                    "A parallel/vectorized double-precision exponential core to accelerate computational science applications.",
                    "FPGAs with time-division multiplexed wiring: an architectural exploration and area analysis.",
                    "A novel BIST approach for testing input/output buffers in FPGAs.",
                    "Impact and compensation of correlated process variation on ring oscillator based puf.",
                    "A novel minloop SB design to improve FPGA routability.",
                    "High-performance, cost-effective heterogeneous 3D FPGA architectures.",
                    "Measuring and modeling variabilityusing low-cost FPGAs.",
                    "3D configuration caching for 2D FPGAs.",
                    "Implementation of a genetic algorithm on a virtex-ii pro FPGA.",
                    "Closed-loop modeling of power and temperature profiles of FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th FPGA 2008",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2008",
                "sub_name": "Proceedings of the ACM/SIGDA 16th International Symposium on Field Programmable Gate Arrays, FPGA 2008, Monterey, California, USA, February 24-26, 2008.",
                "count": 46,
                "papers": [
                    "Designing with extreme parallelism.",
                    "Architecture-specific packing for virtex-5 FPGAs.",
                    "High-quality, deterministic parallel placement for FPGAs on commodity hardware.",
                    "Enforcing long-path timing closure for FPGA routing with path searches on clamped lexicographic spirals.",
                    "Beyond the arithmetic constraint: depth-optimal mapping of logic chains in LUT-based FPGAs.",
                    "WireMap: FPGA technology mapping for improved routability.",
                    "Mapping for better than worst-case delays in LUT-based FPGA designs.",
                    "Lithographic aerial image simulation with FPGA-based hardwareacceleration.",
                    "A complexity-effective architecture for accelerating full-system multiprocessor simulations using FPGAs.",
                    "A-Ports: an efficient abstraction for cycle-accurate performance models on FPGAs.",
                    "Efficient ASIP design for configurable processors with fine-grained resource sharing.",
                    "Pattern-based behavior synthesis for FPGA resource reduction.",
                    "C is for circuits: capturing FPGA circuits as sequential code for portability.",
                    "Extreme parallel architectures for the masses.",
                    "TORCH: a design tool for routing channel segmentation in FPGAs.",
                    "Modeling routing demand for early-stage FPGA architecture development.",
                    "Area and delay trade-offs in the circuit and architecture design of FPGAs.",
                    "Trace-based framework for concurrent development of process and FPGA architecture considering process variation and reliability.",
                    "A novel FPGA logic block for improved arithmetic performance.",
                    "Architectural improvements for field programmable counter arrays: enabling efficient synthesis of fast compressor trees on FPGAs.",
                    "The amorphous FPGA architecture.",
                    "Reconfigurable computing for learning Bayesian networks.",
                    "HybridOS: runtime support for reconfigurable accelerators.",
                    "Vector processing as a soft-core CPU accelerator.",
                    "FPGA-optimised high-quality uniform random number generators.",
                    "A hardware framework for the fast generation of multiple long-period random number streams.",
                    "Efficient tiling patterns for reconfigurable gate arrays.",
                    "FPGA interconnect design using logical effort.",
                    "Speed and yield enhancement by track swapping on critical paths utilizing random variations for FPGAs.",
                    "A type system for static typing of a domain-specific language.",
                    "Measuring and modeling FPGA clock variability.",
                    "High-throughput interconnect wave-pipelining for global communication in FPGAs.",
                    "Configurable decoders with application in fast partial reconfiguration of FPGAs.",
                    "When FPGAs are better at floating-point than microprocessors.",
                    "Efficient FPGA implementation of qr decomposition using a systolic array architecture.",
                    "An integrated debugging environment for FPGA computing platforms.",
                    "CHiMPS: a high-level compilation flow for hybrid CPU-FPGA architectures.",
                    "Retrieving 3-d information with FPGA-based stream processing.",
                    "Communication bottleneck in hardware-software partitioning.",
                    "FPGA based multiple-channel vibration analyzer for industrial applications with reconfigurable post-processing capabilities for automatic failure detection on machinery.",
                    "FPGA implementation of a novel algorithm for on-line bar breakage detection on induction motors.",
                    "Implementing high-speed string matching hardware for network intrusion detection systems.",
                    "Fpga-based data acquisition system for a positron emission tomography (PET) scanner.",
                    "A pipelined binary tree as a case study on designing efficient circuits for an FPGA in a bram aware design.",
                    "From the bitstream to the netlist.",
                    "Flexible FPGA-based parallel architecture for identification of repetitive sequences in interleaved pulse trains."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th FPGA 2007",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2007",
                "sub_name": "Proceedings of the ACM/SIGDA 15th International Symposium on Field Programmable Gate Arrays, FPGA 2007, Monterey, California, USA, February 18-20, 2007.",
                "count": 26,
                "papers": [
                    "A routing fabric for monolithically stacked 3D-FPGA.",
                    "Design of a logic element for implementing an asynchronous FPGA.",
                    "Designing efficient input interconnect blocks for LUT clusters using counting and entropy.",
                    "A synthesizable datapath-oriented embedded FPGA fabric.",
                    "A versatile, low latency HyperTransport core.",
                    "An FPGA-based Pentium in a complete desktop system.",
                    "A 1000-word vocabulary, speaker-independent, continuous live-mode speech recognizer implemented in a single FPGA.",
                    "Variation-aware routing for FPGAs.",
                    "Stochastic physical synthesis for FPGAs with pre-routing interconnect uncertainty and process variation.",
                    "Post-route LUT output polarity selection for timing optimization.",
                    "Synthesis of an application-specific soft multiprocessor system.",
                    "FPGA-friendly code compression for horizontal microcoded custom IPs.",
                    "A practical FPGA-based framework for novel CMP research.",
                    "High-level languages: the future or a passing fad?",
                    "Integrating FPGAs in high-performance computing: introduction.",
                    "Integrating FPGAs in high-performance computing: the architecture and implementation perspective.",
                    "Integrating FPGAs in high-performance computing: programming models for parallel systems -- the programmer's perspective.",
                    "Improved SAT-based Boolean matching using implicants for LUT-based FPGAs.",
                    "Power-aware FPGA logic synthesis using binary decision diagrams.",
                    "GlitchLess: an active glitch minimization technique for FPGAs.",
                    "Performance and yield enhancement of FPGAs with within-die variation using multiple configurations.",
                    "Parametric yield in FPGAs due to within-die delay variations: a quantitative analysis.",
                    "Efficient hardware checkpointing: concepts, overhead analysis, and implementation.",
                    "The shunt: an FPGA-based accelerator for network intrusion prevention.",
                    "Attacking elliptic curve cryptosystems with special-purpose hardware.",
                    "CReconfigurable finite field instruction set architecture."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th FPGA 2006",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2006",
                "sub_name": "Proceedings of the ACM/SIGDA 14th International Symposium on Field Programmable Gate Arrays, FPGA 2006, Monterey, California, USA, February 22-24, 2006.",
                "count": 52,
                "papers": [
                    "A 90nm low-power FPGA for battery-powered applications.",
                    "Embedded floating-point units in FPGAs.",
                    "Measuring the gap between FPGAs and ASICs.",
                    "Optimality study of logic synthesis for LUT-based FPGAs.",
                    "Improvements to technology mapping for LUT-based FPGAs.",
                    "Improving performance and robustness of domain-specific CPLDs.",
                    "Design, implementation, and verification of active cache emulator (ACE).",
                    "Modeling the data-dependent performance of pattern-matching architectures.",
                    "An iterative division algorithm for FPGAs.",
                    "Yield enhancements of design-specific FPGAs.",
                    "FPGA clock network architecture: flexibility vs. area and power.",
                    "Performance benefits of monolithically stacked 3D-FPGA.",
                    "Magnetic tunnelling junction based FPGA.",
                    "A reconfigurable architecture for hybrid CMOS/Nanodevice circuits.",
                    "A reconfigurable hardware based embedded scheduler for buffered crossbar switches.",
                    "An adaptive Reed-Solomon errors-and-erasures decoder.",
                    "A compact FPGA implementation of the hash function whirlpool.",
                    "Armada: timing-driven pipeline-aware routing for FPGAs.",
                    "Combining module selection and resource sharing for efficient FPGA pipeline synthesis.",
                    "Power-aware RAM mapping for FPGA embedded memory blocks.",
                    "Application-specific customization of soft processor microarchitecture.",
                    "Fast and accurate resource estimation of automatically generated custom DFT IP cores.",
                    "FPGAs with multidimensional mesh topology.",
                    "Evaluation of granularity on threshold voltage control in flex power FPGA.",
                    "A novel methodology for designing high-performance and low-energy FPGA routing architecture.",
                    "Autonomous-repair cell for fault tolerant dynamic-reconfigurable devices.",
                    "A multilevel hierarchical interconnection structure for FPGA.",
                    "A programmable majority logic array using molecular scale electronics.",
                    "Fine-grained island style architecture for molecular electronic devices.",
                    "Test and recovery for fine-grained nanoscale architectures.",
                    "Post-placement interconnect entropy.",
                    "A type architecture for hybrid micro-parallel computers.",
                    "Jaguar: a compiler infrastructure for Java reconfigurable computing.",
                    "Testing embedded RAM modules in SRAM-based FPGAs.",
                    "Configuration tools for a new multilevel hierarchical FPGA.",
                    "Effective clustering technique to optimize routability of outer cluster nets.",
                    "Simulative analysis of dynamic scheduling heuristics for reconfigurable computing of parallel applications.",
                    "High speed FIR filter implementation using add and shift method.",
                    "Manifold similarity search of DNA sequences with reconfigurable hardware.",
                    "The routability of multiprocessor network topologies in FPGAs.",
                    "FPGA based RAID 6 hardware accelerator.",
                    "A real-time implementation of Richardson-Lucy deconvolution.",
                    "A generic lookup cache architecture for network processing applications.",
                    "Building a flexible and scalable DRAM interface for networking applications on FPGAs.",
                    "Efficient use of communications between an FPGA's embedded processor and its reconfigurable logic.",
                    "Periodic licensing of FPGA based intellectual property.",
                    "A Performance model for accelerating scientific applications on reconfigurable computers.",
                    "Reconfigurable computing with multiscale data fusion for remote sensing.",
                    "A reconfigurable architecture for network intrusion detection using principal component analysis.",
                    "Flexible implementation of genetic algorithms on FPGAs.",
                    "GSFAP adaptive filtering using log arithmetic for resource-constrained embedded systems.",
                    "Context-free-grammar based token tagger in reconfigurable devices."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th FPGA 2005",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2005",
                "sub_name": "Proceedings of the ACM/SIGDA 13th International Symposium on Field Programmable Gate Arrays, FPGA 2005, Monterey, California, USA, February 20-22, 2005.",
                "count": 64,
                "papers": [
                    "Using bus-based connections to improve field-programmable gate array density for implementing datapath circuits.",
                    "The Stratix II logic and routing architecture.",
                    "HARP: hard-wired routing pattern FPGAs.",
                    "Skew-programmable clock design for FPGA and skew-aware placement.",
                    "The effect of post-layout pin permutation on timing.",
                    "Simultaneous timing-driven placement and duplication.",
                    "Sparse Matrix-Vector multiplication on FPGAs.",
                    "Floating-point sparse matrix-vector multiply for FPGAs.",
                    "64-bit floating-point FPGA matrix multiplication.",
                    "Instruction set extension with shadow registers for configurable processors.",
                    "An FPGA-based VLIW processor with custom hardware execution.",
                    "Techniques for synthesizing binaries to an advanced register/memory structure.",
                    "Design of programmable interconnect for sublithographic programmable logic arrays.",
                    "Analysis of yield loss due to random photolithographic defects in the interconnect structure of FPGAs.",
                    "Soft error rate estimation and mitigation for SRAM-based FPGAs.",
                    "Automated synthesis for asynchronous FPGAs.",
                    "Efficient static timing analysis and applications using edge masks.",
                    "Evaluating heuristics in automatically mapping multi-loop applications to FPGAs.",
                    "Power modeling and architecture evaluation for FPGA with novel circuits for Vdd programmability.",
                    "Combining low-leakage techniques for FPGA routing design.",
                    "Design, layout and verification of an FPGA using automated tools.",
                    "Hyper customized processors for bio-sequence database scanning on FPGAs.",
                    "Efficient packet classification for network intrusion detection using FPGA.",
                    "CUSP: a modular framework for high speed network applications on FPGAs.",
                    "Figaro: an automatic tool flow for designs with dynamic reconfiguration (abstract only).",
                    "A petri-net based Pre-runtime scheduler for dynamically self-reconfiguration of FPGAs (abstract only).",
                    "A New Universal Test Pattern Auto-generating Approach for FPGA Logic Resources (abstract only).",
                    "VPart: an automatic partitioning tool for dynamic reconfiguration (abstract only).",
                    "3D FPGAs: placement, routing, and architecture evaluation (abstract only).",
                    "Efficient utilization of heterogeneous routing resources for FPGAs (abstract only).",
                    "Enabling a RealTime Solution for Neuron Detection with Reconfigurable Hardware (abstract only).",
                    "Time-multiplexed execution on the dynamically reconfigurable processor: a performance/cost evaluation.",
                    "Efficient methodology for detection and correction of SEU-based interconnect errors in FPGAs using partial reconfiguration (abstract only).",
                    "Architecture Adaptive Routability-Driven Placement for FPGAs (abstract only).",
                    "Routing algorithms: enhancing routability & enabling ECO (abstract only).",
                    "An execution environment for reconfigurable computing (abstract only).",
                    "A leakage-aware CAD flow for MTCMOS FPGA architectures (abstract only).",
                    "Energy-efficient FPGA interconnect architecture design (abstract only).",
                    "Exploration of heterogeneous reconfigurable architectures (abstract only).",
                    "Prototyping globally asynchronous locally synchronous circuits on commercial synchronous FPGAs (abstract only).",
                    "Domain Specific Non-Uniform Routing Architecture for Embedded Programmable IP Core (abstract only).",
                    "3D-SoftChip: a novel 3D vertically integrated adaptive computing system (abstract only).",
                    "Dynamic hardware multiplexing for coarse grain reconfigurable architectures.",
                    "Soft multiprocessor systems for network applications (abstract only).",
                    "Firm-core Virtual FPGA for Just-in-Time FPGA Compilation (abstract only).",
                    "Hierarchical LUT structures for leakage power reduction (abstract only).",
                    "Dual-Vt FPGA design for leakage power reduction (abstract only).",
                    "SMPS: an FPGA-based prototyping environment for multiprocessor embedded systems (abstract only).",
                    "Dynamic reconfiguration in FPGA-based SoC designs (abstract only).",
                    "Configurable hardware solutions for computing autocorrelation coefficients: a case study (abstract only).",
                    "Design and implementation of packet classification with FPGA (abstract only).",
                    "A partial reconfigurable FPGA implementation for industrial controllers using SFC-petri net description (abstract only).",
                    "Image processing library for reconfigurable computers (abstract only).",
                    "A 2005 review of FPGA arithmetic (abstract only).",
                    "Rapid prototyping of a test harness for forward error correcting codes (abstract only).",
                    "A framework for rule processing in reconfigurable network systems (abstract only).",
                    "An FPGA based SDRAM controller with complex QoS scheduling and traffic shaping (abstract only).",
                    "An integrated framework for the high level design of high performance signal processing circuits on FPGAs (abstract only).",
                    "Reconfigurable computers: an empirical analysis (abstract only).",
                    "A VLIW-based cryptoprocessor on FPGAs architecture and performance issues (abstract only).",
                    "Accelerating mutual information-based 3D medical image registration with An FPGA computing platform (abstract only).",
                    "Choice of base revisited: higher radices for FPGA-based floating-point computation (abstract only).",
                    "An FPGA generator for multipoint distributed random variables (abstract only).",
                    "A constant array multiplier core generator with dynamic partial evaluation architecture selection (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th FPGA 2004",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2004",
                "sub_name": "Proceedings of the ACM/SIGDA 12th International Symposium on Field Programmable Gate Arrays, FPGA 2004, Monterey, California, USA, February 22-24, 2004.",
                "count": 67,
                "papers": [
                    "The SFRA: a corner-turn FPGA architecture.",
                    "Exploration of pipelined FPGA interconnect structures.",
                    "Evaluation of low-leakage design techniques for field programmable gate arrays.",
                    "Active leakage power optimization for FPGAs.",
                    "Low-power FPGA using pre-defined dual-Vdd/dual-Vt fabrics.",
                    "Reducing leakage energy in FPGAs using region-constrained placement.",
                    "A high performance 32-bit ALU for programmable logic.",
                    "An embedded true random number generator for FPGAs.",
                    "Making visible the thermal behaviour of embedded microprocessors on FPGAs: a progress report.",
                    "A synthesis oriented omniscient manual editor.",
                    "Incremental physical resynthesis for timing optimization.",
                    "Low-power technology mapping for FPGA architectures with dual supply voltages.",
                    "What is the right model for programming and using modern FPGAs?",
                    "Nanowire-based sublithographic programmable logic arrays.",
                    "Highly pipelined asynchronous FPGAs.",
                    "A magnetoelectronic macrocell employing reconfigurable threshold logic.",
                    "Flexibility measurement of domain-specific reconfigurable hardware.",
                    "A quantitative analysis of the speedup factors of FPGAs over processors.",
                    "FPGAs vs. CPUs: trends in peak floating-point performance.",
                    "Application-specific instruction generation for configurable processor architectures.",
                    "Using reconfigurability to achieve real-time profiling for hardware/software codesign.",
                    "A reconfigurable unit for a clustered programmable-reconfigurable processor.",
                    "An FPGA implementation of the two-dimensional finite-difference time-domain (FDTD) algorithm.",
                    "Time and area efficient pattern matching on FPGAs.",
                    "A compiled accelerator for biological cell signaling simulations.",
                    "An FPGA implementation of bene permutation networks.",
                    "Subframe multiplexing for FPGA manufacturing test configuration.",
                    "An FPGA implementation of block truncation coding for gray and color images.",
                    "Routing architecture for multi-context FPGAs.",
                    "A flexible hardware architecture for 2-D discrete wavelet transform.",
                    "A VHDL MPEG-7 shape descriptor extractor.",
                    "Hardware co-simulation in system generator of the AES-128 encryption algorithm.",
                    "Buffer schemes for runtime reconfiguration of function variants in communication systems.",
                    "Using an FPGA coprocessor for improving execution speed of TRT-LUT: one of the feature extraction algorithms for ATLAS LVL2 trigger.",
                    "High-speed systolic array for gene matching.",
                    "The gigahertz FPGA: design consideration and applications.",
                    "FPGA-based implementation of single-precision exponential unit.",
                    "High level area, delay and power estimation for FPGAs.",
                    "Bit-level super-systolic array for FIR filter with a FPGA-based bit-serial semi-systolic multiplier.",
                    "Transistor grouping and metal layer trade-offs in automatic tile layout of FPGAs.",
                    "SPFD-based one-to-many rewiring.",
                    "Addressing application integrity attacks using a reconfigurable architecture.",
                    "Fast adders in modern FPGAs.",
                    "SHAPER: synthesis for hybrid FPGA architectures containing PLA elements using reconvergence analysis.",
                    "Least-significant bit optimization techniques for FPGAs.",
                    "FPGA modelling for high-performance algorithms.",
                    "A novel coarse-grain reconfigurable data-path for accelerating DSP kernels.",
                    "Improving the reliability of FPGA circuits using triple-modular redundancy (TMR) & efficient voter placement.",
                    "A constraints programming approach to communication scheduling on SoPC architectures.",
                    "FPGA-based supercomputing: an implementation for molecular dynamics.",
                    "Multi-resource aware partitioning algorithms for FPGAs with heterogeneous resources.",
                    "An FPGA prototype for the experimental evaluation of a multizone network cache.",
                    "An algorithmic approach by heuristics to dynamical reconfiguration of logic resources on reconfigurable FPGAs.",
                    "Dynamically reconfigurable architecture for high-throughput processing of data centric applications.",
                    "FPGA implementation of a high speed network interface card for optical burst switched networks.",
                    "Low energy FPGA interconnect design.",
                    "In-system FPGA prototyping of an itanium microarchitecture.",
                    "Online placement infrastructure to support run-time reconfiguration.",
                    "An algorithm for trading off quantization error with hardware resources for MATLAB based FPGA design.",
                    "Automatic discovery, selection, and specialization of modules in RCADE.",
                    "Roving testing using new built-in-self-tester designs for FPGAs.",
                    "Preliminary performance analysis of flex power FPGA, a power reconfigurable device with fine granularity.",
                    "Divide and concatenate: a scalable hardware architecture for universal MAC.",
                    "On the design of a function-specific reconfigurable: hardware accelerator for the MAC-layer in WLANs.",
                    "Implementation of elliptic curve cryptosystems over GF(2n) in optimal normal basis on a reconfigurable computer.",
                    "A left-edge algorithm approach for scheduling and allocation of hardware contexts in dynamically reconfigurable architectures.",
                    "Power analysis and estimation tool integrated with XPOWER."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th FPGA 2003",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2003",
                "sub_name": "Proceedings of the ACM/SIGDA International Symposium on Field Programmable Gate Arrays, FPGA 2003, Monterey, CA, USA, February 23-25, 2003.",
                "count": 52,
                "papers": [
                    "Architectures and algorithms for synthesizable embedded programmable logic cores.",
                    "The StratixTM routing and logic architecture.",
                    "A pipelined configurable gate array for embedded processors.",
                    "Hardware-assisted simulated annealing with application for fast FPGA placement.",
                    "Parallel placement for field-programmable gate arrays.",
                    "I/O placement for FPGAs with multiple I/O standards.",
                    "Wire type assignment for FPGA routing.",
                    "PipeRoute: a pipelining-aware router for FPGAs.",
                    "Stochastic, spatial routing for hypergraphs, trees, and meshes.",
                    "Implementation of BEE: a real-time large-scale hardware emulation engine.",
                    "High-level modeling and FPGA prototyping of microprocessors.",
                    "Reducing pin and area overhead in fault-tolerant FPGA-based designs.",
                    "A scalable 2 V, 20 GHz FPGA using SiGe HBT BiCMOS technology.",
                    "Design of FPGA interconnect for multilevel metalization.",
                    "Automatic transistor and physical design of FPGA tiles from an architectural specification.",
                    "Architecture evaluation for power-efficient FPGAs.",
                    "Post-placement C-slow retiming for the xilinx virtex FPGA.",
                    "An FPGA architecture with enhanced datapath functionality.",
                    "A fully pipelined memoryless 17.8 Gbps AES-128 encryptor.",
                    "A methodology to implement block ciphers in reconfigurable hardware and its application to fast and compact AES RIJNDAEL.",
                    "Energy-efficient signal processing using FPGAs.",
                    "Making area-performance tradeoffs at the high level using the AccelFPGA compiler for FPGAs.",
                    "FPGA implementation of a fast Hadamard transformer for WCDMA.",
                    "FPGA-based design of an evolutionary controller for collision-free robot navigation.",
                    "A single-FPGA implementation of image connected component labelling.",
                    "A logic based approach to hardware abstraction.",
                    "Design framework for the implementation of the 2-D orthogonal discrete wavelet transform on FPGA.",
                    "An estimation and exploration methodology from system-level specifications: application to FPGAs.",
                    "A granularity-based classification model for systems-on-a-chip.",
                    "Design of a fingerprint system using a hardware/software environment.",
                    "Customized regular channel design in FPGAs.",
                    "Track placement: orchestrating routing structures to maximize routability.",
                    "Implementation of digital fixed-point approximations to continuous-time IIR filters.",
                    "On hiding latency in reconfigurable systems: the case of merge-sort for an FPGA-based system.",
                    "Recursive circuit clustering for minimum delay and area.",
                    "Using FPGAs for data and reorganization engines: preliminary results for spatial pointer-based data structures.",
                    "A SC-based novel configurable analog cell.",
                    "Testing for bit error rate in FPGA communication interfaces.",
                    "On computation and resource management in an FPGA-based computation environment.",
                    "An automated and power-aware framework for utilization of IP cores in hardware generated from C descriptions targeting FPGAs.",
                    "FPGAs in critical hardware/software systems.",
                    "Power-aware architectures and circuits for FPGA-based signal processing.",
                    "Reconfigurable randomized K-way graph partitioning.",
                    "Synthetic circuit generation using clustering and iteration.",
                    "An FPGA architecture with built-in error correction capability.",
                    "Lattice adaptive filter implementation for FPGA.",
                    "Wireless sensor networks: a power-scalable motion estimation IP for hybrid video coding.",
                    "A physical retiming algorithm for field programmable gate arrays.",
                    "Design strategies and modified descriptions to optimize cipher FPGA implementations: fast and compact results for DES and triple-DES.",
                    "A high resolution diagnosis technique for open and short defects in FPGA interconnects.",
                    "A four-bit full adder implemented on fast SiGe FPGAs with novel power control scheme.",
                    "Application-dependent testing of FPGAs for bridging faults."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th FPGA 2002",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2002",
                "sub_name": "Proceedings of the ACM/SIGDA International Symposium on Field Programmable Gate Arrays, FPGA 2002, Monterey, CA, USA, February 24-26, 2002.",
                "count": 26,
                "papers": [
                    "Interconnect enhancements for a high-speed PLD architecture.",
                    "FPGA switch block layout and evaluation.",
                    "Circuit design of routing switches.",
                    "A faster distributed arithmetic architecture for FPGAs.",
                    "Efficient architectures for implementing montgomery modular multiplication and RSA modular exponentiation on reconfigurable logic.",
                    "A flexible floating-point format for optimizing data-paths and operators in FPGA based DSPs.",
                    "Efficient circuit clustering for area and power reduction in FPGAs.",
                    "Integrated retiming and placement for field programmable gate arrays.",
                    "SPFD-based global rewiring.",
                    "EVE: a CAD tool for manual placement and pipelining assistance of FPGA circuits.",
                    "Application of FPGA technology to accelerate the finite-difference time-domain (FDTD) method.",
                    "FPGA implementation of neighborhood-of-four cellular automata random number generators.",
                    "Cryptographic rights management of FPGA intellectual property cores.",
                    "Constrained clock shifting for field programmable gate arrays.",
                    "Timing verification of dynamically reconfigurable logic for the xilinx virtex FPGA series.",
                    "FPGA test time reduction through a novel interconnect testing scheme.",
                    "On the sensitivity of FPGA architectural conclusions to experimental assumptions, tools, and techniques.",
                    "Dynamic power consumption in Virtex[tm]-II FPGA family.",
                    "Automatic layout of domain-specific reconfigurable subsystems for system-on-a-chip.",
                    "Performance-constrained pipelining of software loops onto reconfigurable hardware.",
                    "Configuration prefetching techniques for partial reconfigurable coprocessor with relocation and defragmentation.",
                    "Analysis of quasi-static scheduling techniques in a virtualized reconfigurable machine.",
                    "Incremental reconfiguration of multi-FPGA systems.",
                    "Parallel-beam backprojection: an FPGA implementation optimized for medical imaging.",
                    "A dynamically reconfigurable adaptive viterbi decoder.",
                    "Data reorganization engines for the next generation of system-on-a-chip FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th FPGA 2001",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2001",
                "sub_name": "Proceedings of the ACM/SIGDA International Symposium on Field Programmable Gate Arrays, FPGA 2001, Monterey, CA, USA, February 11-13, 2001.",
                "count": 24,
                "papers": [
                    "LRoute: a delay minimal router for hierarchical CPLDs.",
                    "A crosstalk-aware timing-driven router for FPGAs.",
                    "Runtime and quality tradeoffs in FPGA placement and routing.",
                    "Performance-driven mapping for CPLD architectures.",
                    "Simultaneous logic decomposition with technology mapping in FPGA designs.",
                    "Using sparse crossbars within LUT.",
                    "Detailed routing architectures for embedded programmable logic IP cores.",
                    "Mixing buffers and pass transistors in FPGA routing architectures.",
                    "Reprogrammable network packet processing on the field programmable port extender (FPX).",
                    "Fast implementations of secret-key block ciphers using mixed inner- and outer-round pipelining.",
                    "Algorithmic transformations in the implementation of K- means clustering on reconfigurable hardware.",
                    "Is marriage in the cards for programmable logic, microprocessors and ASICs?",
                    "Attacking the semantic gap between application programming languages and configurable hardware.",
                    "Matching and searching analysis for parallel hardware implementation on FPGAs.",
                    "Evaluation of the streams-C C-to-FPGA compiler: an applications perspective.",
                    "The effect of reconfigurable units in superscalar processors.",
                    "Interconnect pipelining in a throughput-intensive FPGA architecture.",
                    "The case for registered routing switches in field programmable gate arrays.",
                    "Configuration compression for FPGA-based embedded systems.",
                    "A memory coherence technique for online transient error recovery of FPGA configurations.",
                    "Run-Time defect tolerance using JBits.",
                    "A pipelined architecture for partitioned DWT based lossy image compression using FPGA's.",
                    "An FPGA-based video compressor for H.263 compatible bit streams.",
                    "FPGA implementation of a novel, fast motion estimation algorithm for real-time video compression."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th FPGA 2000",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/2000",
                "sub_name": "Proceedings of the ACM/SIGDA International Symposium on Field Programmable Gate Arrays, FPGA 2000, Monterey, CA, USA, February 10-11, 2000.",
                "count": 40,
                "papers": [
                    "The effect of LUT and cluster size on deep-submicron FPGA performance and density.",
                    "Programmable memory blocks supporting content-addressable memory.",
                    "A novel high throughput reconfigurable FPGA architecture.",
                    "An FPGA implementation and performance evaluation of the Serpent block cipher.",
                    "Factoring large numbers with programmable hardware.",
                    "Technology mapping for k/m-macrocell based FPGAs.",
                    "Technology mapping issues for an FPGA with lookup tables and PLA-like blocks.",
                    "Heterogeneous technology mapping for FPGAs with dual-port embedded memory arrays.",
                    "Synthesis for FPGAs with embedded memory blocks.",
                    "A reconfigurable multi-function computing cache architecture.",
                    "A C compiler for a processor with a reconfigurable functional unit.",
                    "The John Henry Syndrome (panel session)(abstract only): humans vs. machines as FPGA designers.",
                    "A representation for dynamic graphs in reconfigurable hardware and its application to fundamental graph algorithms.",
                    "The application of genetic algorithms to the design of reconfigurable reasoning VLSI chips.",
                    "A benchmark suite for evaluating configurable computing systems--status, reflections, and future directions.",
                    "Field programmable port extender (FPX) for distributed routing and queuing.",
                    "Implementing a RAKE receiver for wireless communications on an FPGA-based computer system.",
                    "Generating highly-routable sparse crossbars for PLDs.",
                    "New parallelization and convergence results for NC: a negotiation-based FPGA router.",
                    "Automatic generation of FPGA routing architectures from high-level descriptions.",
                    "Tolerating operational faults in cluster-based FPGAs.",
                    "Power estimation approach for SRAM-based FPGAs.",
                    "Timing-driven placement for FPGAs.",
                    "Algorithm analysis and mapping environment for adaptive computing systems (poster abstract).",
                    "Coarse-grained carry architecture for FPGA (poster abstract).",
                    "Cost minimization of partitioned circuits with complex resource constraints in FPGAs (poster abstract).",
                    "Design and implementation of an FPGA based processor for compressed images (poster abstract).",
                    "Determining the optimum extended instruction-set architecture for application specific reconfigurable VLIW CPUs (poster abstract).",
                    "An FPGA-based genetic algorithm machine (poster abstract).",
                    "FPGA clock management for low power applications (poster abstract).",
                    "FPGA implementation and analysis of image restoration.",
                    "Improving the performance and efficiency of an adaptive amplification operation using configurable hardware (poster abstract).",
                    "Novel hardware-software architecture for the recursive merge filtering algorithm (poster abstract).",
                    "Low power digital design in FPGAs (poster abstract): a study of pipeline architectures implemented in a FPGA using a low supply voltage to reduce power consumption.",
                    "Real-time, frame-rate face detection on a configurable hardware system (poster abstract).",
                    "Reconfigurable target recognition system (poster abstract).",
                    "Scalable interconnect and power distribution for island-style FPGAs (poster abstract).",
                    "Synthesis and domain-specific optimization of KressArray-based reconfigurable computing engines (poster abstract).",
                    "Synthesizing full-systolic arrays for matrix product on Xilinx's XC4000(E, EX) FPGAs (poster abstract).",
                    "Virtualization of FPGA via segmentation (poster abstract)."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th FPGA 1999",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/1999",
                "sub_name": "Proceedings of the 1999 ACM/SIGDA Seventh International Symposium on Field Programmable Gate Arrays, FPGA 1999, Monterey, CA, USA, February 21-23, 1999.",
                "count": 56,
                "papers": [
                    "A New High Density and Very Low Cost Reprogrammable FPGA Architecture.",
                    "Hybrid Product Term and LUT Based Architectures Using Embedded Memory Blocks.",
                    "An Innovative, Segmented High Performance FPGA Family with Variable-Grain-Architecture and Wide-Gating Functions.",
                    "Cut Ranking and Pruning: Enabling a General and Efficient FPGA Mapping Solution.",
                    "Using Cluster-Based Logic Blocks and Timing-Driven Packing to Improve FPGA Speed and Density.",
                    "A Methodology for Fast FPGA Floorplanning.",
                    "FPGA Routing Architecture: Segmentation and Buffering to Optimize Speed and Density.",
                    "Balancing Interconnect and Computation in a Reconfiguable Computing Array (or, why you don't really want 100% LUT utilization).",
                    "Configuration Cloning: Exploiting Regularity in Dynamic DSP Architectures.",
                    "Don't Care Discovery for FPGA Configuration Compression.",
                    "A FPGA-Based Hardware Implementation of Generalized Profile Search Using Online Arithmetic.",
                    "Procedural Texture Mapping on FPGAs.",
                    "HSRA: High-Speed, Hierarchical Synchroous Reconfigurable Array.",
                    "A Reconfigurable Arithmetic Array for Multimedia Application.",
                    "Memory Interfacing and Instruction Specification for Reconfigurable Processors.",
                    "Trading Quality for Compile Time: Ultra-Fast Placement for FPGAs.",
                    "Satisfiability-Based Layout Revisited: Detailed Routing of Complex FPGAs vis Search-Based Boolean SAT.",
                    "Multi-Terminal Net Routing for Partial Crossbar-Based Multi-FPGA Systems.",
                    "Circuit Partitioning for Dynamically Reconfigurable FPGAs.",
                    "Fast Compilation for Pipelined Reconfigurable Fabrics.",
                    "Configuration Caching Vs Data Caching for Striped FPGAs.",
                    "String Natching on Nulticontext FPGAs Using Self-Reconfiguration.",
                    "Reduction of Latency and Resource Usage in Bit-Level Pipelined Data Paths for FPGAs.",
                    "Exploiting FPGA-Features During the Emulation of a Fast Reactive Embedded System.",
                    "400-MHz Frequency Counter: A Case Study in Semi-Synchronous Design.",
                    "Architecture Considerations for Mixed Signals FPGAs.",
                    "ATLANTIS - A Hybrid Approach Combining the Power of FPGA and RISC Processors Based on CompactPCI.",
                    "A Computational Intelligence Based Coarse-Grained Reconfigurable Element.",
                    "Design Issues in the Development of a JAVA-Processor for Small Embedded Applications.",
                    "Dynamically Programmable Cache Evaluation and Virtualization.",
                    "Efficient Support of Hardware Debugging Through FPGA Physical Design Partitioning.",
                    "Exploiting Early Partial Reconfiguration of Run-Time Reconfigurable FPGAs in Embedded Systems Design.",
                    "Extra-Dimensional Island-Style FPGAs.",
                    "FPGA Based Computer Vision Camera.",
                    "FPGA Design Experiences Using the CSELT VIP (TM) Library.",
                    "FPGA-Targeted Development System for Embedded Applications.",
                    "Hardware/Software Partitioning Between Microprocessor and Reconfigurable Hardware.",
                    "High-Performance Low-Cost Implementation of Two-Dimensional DCT Processor nn FPGA.",
                    "High-Performance 2-D FPGA DCTs Using Polynomial Transforms.",
                    "High Speed Calculation of Cyclic Redundancy Codes.",
                    "Hierarchical Placement Directives for Parametric IP Blocks.",
                    "Implementing an Artificial CPG Using Fine-Grain FPGAs.",
                    "A Method for Implementing Fractal Image Compression on Reconfigurable Architecture.",
                    "Module Generation of High Performance FPGA-Based Multipliers.",
                    "Partitioning Large Designs by Filling PFGA Devices with Hierarchy Blocks.",
                    "Practical Applications of Recursive VHDL Components in FPGA Synthesis.",
                    "Prototyping Board and Development Environment for Rapid Prototyping of Real Time and Regular Digital Signal Processing Application.",
                    "Run-Time Parameterizable Cores.",
                    "Self-Checking Logic Design for LUT-Based FPGAs.",
                    "Special Arithmetic Operations on FPGAs.",
                    "Throughput Optimization with Design Space Exploration During Partitioning for Multi-FPGA Architectures.",
                    "Towards Adaptable Hierarchical Placement for FPGAs.",
                    "Unified Access to Heterogeneous Module Generators.",
                    "Universal Switch Blocks for Three-Dimensional FPGA Design.",
                    "Why a CAD-Verified FPGA Makes Routing so Simple and Fast! A Result of Co-Designing FPGAs and CAD Algorithms.",
                    "The X-MatchLITE FPGA-Based Data Compressor."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th FPGA 1998",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/1998",
                "sub_name": "Proceedings of the 1998 ACM/SIGDA Sixth International Symposium on Field Programmable Gate Arrays, FPGA 1998, Monterey, CA, USA, February 22-24, 1998.",
                "count": 48,
                "papers": [
                    "A Novel Predictable Segmented FPGA Routing Architecture.",
                    "More Wires and Fewer LUTs: A Design Methodology for FPGAs.",
                    "Optimizations for a Highly Cost-Efficient Programmable Logic Architecture.",
                    "Boolean Matching for Complex PLBs in LUT-based FPGAs with Application to Architecture Evaluation.",
                    "A New Retiming-Based Technology Mapping Algorithm for LUT-based FPGAs.",
                    "A Hybrid Complete-Graph Partial-Crossbar Routing Architecture for Multi-FPGA Systems.",
                    "Managing Pipeline-Reconfigurable FPGAs.",
                    "Configuration Prefetch for Single Context Reconfigurable Coprocessors.",
                    "Circuit Partitioning with Complex Resource Constraints in FPGAs.",
                    "Timing Driven Floorplanning on Programmable Hierarchical Targets.",
                    "Bridging Fault Detection in FPGA Interconnects Using IDDQ.",
                    "Efficiently Supporting Fault-Tolerance in FPGAs.",
                    "Constraints from Hell: How to Tell Makes a Good FPGA (Panel).",
                    "Fast Module Mapping and Placement for Datapaths in FPGAs.",
                    "Fast Integrated Tools for Circuit Design with FPGAs.",
                    "A Fast Routability-Driven Router for FPGAs.",
                    "Scheduling Designs into a Time-Multiplexed FPGA.",
                    "Partitioning Sequential Circuits on Dynamically Reconfiguable FPGAs.",
                    "SMAP: Heterogeneous Technology Mapping for Area Reduction in FPGAs with Embedded Memory Arrays.",
                    "Technology Mapping for FPGAs with Embedded Memory Blocks.",
                    "A Survey of CORDIC Algorithms for FPGA Based Computers.",
                    "FPGA-Based Sonar Processing.",
                    "Evolving Computer Programs Using Rapidly Reconfigurable Field-Programmable Gate Arrays and Genetic Programming.",
                    "High-Performance Carry Chains for FPGAs.",
                    "A Coarse-Grained FPGA Architecture for High-Performance FIR Filtering.",
                    "An LPGA with Foldable PLA-style Logic Blocks.",
                    "Advantages of the XC6000 Architecture for Embedded System Design (Abstract).",
                    "A Fast FPGA (FFPGA) Using Active Interconnect (Abstract).",
                    "A New FPGA Architecture for High-Performance bit-Serial Pipeline Datapath (Abstract).",
                    "A 100 MHz PLL Implemented on a 100K Gate Programmable Logic Device (Abstract).",
                    "Block and IP Wrapping for Efficient Design on FPGAs (Abstract).",
                    "Design of a Three-Dimensional FPGA for Reconfigurable Computing Machines (Abstract).",
                    "FPGA Circuit Optimization Based on Block Integration (Abstract).",
                    "FPGA Logic Block Architecture for Digit-Serial DSP Applications (Abstract).",
                    "GART: A New, Flexible Placement and Routing Tool for Research on FPGA Architectures (Abstract).",
                    "Hardware Implementation of Generalized Profile Search on the GENSTROM Machine (Abstract).",
                    "High-Level Synthesis Using Genetic Algorithms for Dynamically Reconfigurable FPGAs (Abstract).",
                    "Implementation of IEEE Single-Precision Floating-Point Operations on FPGAs (Abstract).",
                    "Minimizing the Application Time for Manufacturer Testing of FPGA (Abstract).",
                    "Mapping Multiplication Algorithms into a Family of LUT-based FPGAs (Abstract).",
                    "Partial FPGA Rearrangement by Local Repacking (Abstract).",
                    "Performance-Driven Board-Level Routing for FPGA-Based Logic Emulation (Abstract).",
                    "Rapid Prototyping of Multi-Recommendation Modem (Abstract).",
                    "Reconfigurable Processing for Robust Navigation and Control (Abstract).",
                    "REMARC: Reconfigurable Multimedia Array Coprocessor (Abstract).",
                    "RENCO: A Reconfigurable Network Computer (Abstract).",
                    "Soft Decision Maximum Likelihood Decoders for Binary Linear Block Codes Implemented on FPGAs (Abstract).",
                    "FPGA Implementation of an ATM Traffic Shaper: ATS (Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th FPGA 1997",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/1997",
                "sub_name": "Proceedings of the 1997 ACM/SIGDA Fifth International Symposium on Field Programmable Gate Arrays, FPGA 1997, Monterey, CA, USA, February 9-11, 1997.",
                "count": 23,
                "papers": [
                    "Architecture Issues and Solutions for a High-Capacity FPGA.",
                    "Memory-to-Memory Connection Structures in FPGAs with Embedded Memory Arrays.",
                    "Laser Correcting Defects to Create Transparent Routing for Large Area FPGA's.",
                    "I/O and Performance Tradeoffs with the FunctionBus During Multi-FPGA Partitioning.",
                    "Partially-Dependent Functional Decomposition with Applications in FPGA Synthesis and Mapping.",
                    "General Modeling and Technology-Mapping Technique for LUT-Based FPGAs.",
                    "The Transmogrifier-2: A 1 Million Gate Rapid Prototyping System.",
                    "Signal Processing at 250 MHz Using High-Performance FPGA's.",
                    "Module Generation of Complex Macros for Logic-Emulation Applications.",
                    "Wormhole Run-Time Reconfiguration.",
                    "Improving Functional Density Through Run-Time Constant Propagation.",
                    "YARDS: FPGA/MPU Hybrid Architecture for Telecommunication Data Processing.",
                    "Is Reconfigurable Computing Commercially Viable (panel)?",
                    "Synthesis and Floorplanning for Large Hierarchical FPGAs.",
                    "Performance Driven Floorplanning for FPGA Based Designs.",
                    "FPGA Routing and Routability Estimation via Boolean Satisfiability.",
                    "Architectural and Physical Design Challenges for One-Million Gate FPGAs and Beyond.",
                    "Challenges in CAD for the One Million Gate FPGA.",
                    "A CMOS Continuous-Time Field Programmable Analog Array.",
                    "Buffer Minimization and Time-Multiplexed I/O on Dynamically Reconfigurable FPGAs.",
                    "Generation of Synthetic Sequential Benchmark Circuits.",
                    "Synchronous Up/Down Binary Counter for LUT FPGAs with Counting Frequency Independent of Counter Size.",
                    "A FPGA-Based Implementation of a Fault-Tolerant Neural Architecture for Photon Identification."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th FPGA 1996",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/1996",
                "sub_name": "Proceedings of the 1996 Fourth International Symposium on Field Programmable Gate Arrays, FPGA 1996, Monterey, CA, USA, February 11-13, 1996.",
                "count": 22,
                "papers": [
                    "Hybrid FPGA Architecture.",
                    "Plasma: An FPGA for Million Gate Systems.",
                    "Flexible FPGA Architecture Realized of General Purpose SOG.",
                    "Using BDDs to Design ULMs for FPGAs.",
                    "Universal Logic Modules for Series-Parallel Functions.",
                    "Combined Spectral Techniques for Boolean Matching.",
                    "The Wave Pipeline Effect on LUT-Based FPGA Architectures.",
                    "Area-Speed Tradeoffs for Hierarchical Field-Programmable Gate Arrays.",
                    "Technology Mapping of Sequential Circuits for LUT-Based FPGAs for Performance.",
                    "A Method for Generating Random Circuits and Its Application to Routability Measurement.",
                    "Entropy, Counting, and Programmable Interconnect.",
                    "Universal Switch-Module Design for Symmetric-Array-Based FPGAs.",
                    "Design and Implementation of a Field Programmable Analogue Array.",
                    "The EPAC Architecture: An Expert Cell Approach to Field Programmable Analog Devices.",
                    "Diagnosing Programmable Interconnect Systems for FPGAs.",
                    "Evaluation of FPGA Resources for Built-In Self-Test of Programmable Logic Blocks.",
                    "DPGA Utilization and Application.",
                    "Sequencing Run-Time Reconfigured Hardware with Software.",
                    "Computing the Discrete Fourier Transform on FPGA Based Systolic Arrays.",
                    "RASP: A General Logic Synthesis System for SRAM-Based FPGAs.",
                    "Emerald: An Architecture-Driven Tool Compiler for FPGAs.",
                    "Structured Design Implementation: A Strategy for Implementing Regular Datapaths on FPGAs."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd FPGA 1995",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fpga/1995",
                "sub_name": "Proceedings of the Third International ACM Symposium on Field-Programmable Gate Arrays,FPGA 1995, Monterey, California, USA, February 12-14, 1995.",
                "count": 24,
                "papers": [
                    "On Designing ULM-based FPGA Logic Modules.",
                    "Using Architectural \"Families\" to Increase FPGA Speed and Density.",
                    "Design of FPGAs with Area I/O for Field Programmable MCM.",
                    "TIERS: Topology Independent Pipelined Routing and Scheduling for VirtualWire Compilation.",
                    "Logic Partition Orderings for Multi-FPGA Systems.",
                    "Hardware Assists for High Performance Computing Using a Mathematics of Arrays.",
                    "High-Energy Physics on DECPeRLe-1 Programmable Active Memory.",
                    "HGA: A Hardware-Based Genetic Algorithm.",
                    "The Design of RPM: An FPGA-based Multiprocessor Emulator.",
                    "Simultaneous Depth and Area Minimization in LUT-based FPGA Mapping.",
                    "Synthesis of Signal Processing Structured Datapaths for FPGAs Supporting RAMs and Busses.",
                    "On Nominal Delay Minimization in LUT-based FPGA Technology Mapping.",
                    "Revisiting the Cascade Circuit in Logic Cells of Lookup Table Based FPGAs.",
                    "Architecture of Centralized Field-Configurable Memory.",
                    "A Field-Programmable Mixed-Analog-Digital Array.",
                    "PathFinder: A Negotiation-based Performance-driven Router for FPGAs.",
                    "Applications of Slack Neighborhood Graphs to Timing Driven Optimization Problems in FPGAs.",
                    "Testing of Uncustomized Segmented Channel Field Programmable Gate Arrays.",
                    "Spectral-Based Multi-Way FPGA Partitioning.",
                    "Multi-way System Partitioning into a Single Type or Multiple Types of FPGAs.",
                    "Multiple FPGA Partitioning with Performance Optimization.",
                    "Techniques for FPGA Implementation of Video Compression Systems.",
                    "An SBus Monitor Board.",
                    "High-Level Bit-Serial Datapath Synthesis for Multi-FPGA Systems."
                ]
            }
        ]
    }
]