[
    {
        "year": "2021",
        "name": "FPT 2021",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2021",
                "sub_name": "International Conference on Field-Programmable Technology, (IC)FPT 2021, Auckland, New Zealand, December 6-10, 2021.",
                "count": 51,
                "papers": [
                    "A High-Performance and Flexible FPGA Inference Accelerator for Decision Forests Based on Prior Feature Space Partitioning.",
                    "Scalable and Flexible High-Performance In-Network Processing of Hash Joins in Distributed Databases.",
                    "A Hexagon-Based Honeycomb Routing Architecture for FPGA.",
                    "ac2SLAM: FPGA Accelerated High-Accuracy SLAM with Heapsort and Parallel Keypoint Extractor.",
                    "An area-efficient multiply-accumulation architecture and implementations for time-domain neural processing.",
                    "Development of Autonomous Driving System based on Image Recognition using Programmable SoCs.",
                    "StreamSVD: Low-rank Approximation and Streaming Accelerator Co-design.",
                    "Dataflow Systolic Array Implementations of Exploring Dual-Triangular Structure in QR Decomposition Using High-Level Synthesis.",
                    "Profiling-Based Control-Flow Reduction in High-Level Synthesis.",
                    "Efficient Physical Page Migrations in Shared Virtual Memory Reconfigurable Computing Systems.",
                    "FPGAs as General-Purpose Accelerators for Non-Experts via HLS: The Graph Analysis Example.",
                    "Tens of gigabytes per second JSON-to-Arrow conversion with FPGA accelerators.",
                    "Low Precision Networks for Efficient Inference on FPGAs.",
                    "Algorithm-Hardware Co-Optimization for Energy-Efficient Drone Detection on Resource-Constrained FPGA.",
                    "High-performance pipeline architecture for packet classification accelerator in DPU.",
                    "StateLink: FPGA System Debugging via Flexible Simulation/Hardware Integration.",
                    "Optimizing Bayesian Recurrent Neural Networks on an FPGA-based Accelerator.",
                    "An FPGA-Based Image Recognition with Remote Update Functions for Autonomous Driving on \"ad-refkit\".",
                    "Autonomous Driving System implemented on Robot Car using SoC FPGA.",
                    "Increasing Memory Efficiency of Hash-Based Pattern Matching for High-Speed Networks.",
                    "A High-Precision Flexible Symmetry-Aware Architecture for Element-Wise Activation Functions.",
                    "Efficient Queue-Balancing Switch for FPGAs.",
                    "On the Performance Effect of Loop Trace Window Size on Scheduling for Configurable Coarse Grain Loop Accelerators.",
                    "Parallel-Pipeline Fast Walsh-Hadamard Transform Implementation Using HLS.",
                    "Parallelized Technology Mapping to General PLBs by Adaptive Circuit Partitioning.",
                    "A dataset generation for object recognition and a tool for generating ROS2 FPGA node.",
                    "Resource-saving FPGA Implementation of the Satisfiability Problem Solver: AmoebaSATslim.",
                    "Zytlebot : FPGA integrated ros-based autonomous mobile robot.",
                    "A unified accelerator design for LiDAR SLAM algorithms for low-end FPGAs.",
                    "High performance lattice regression on FPGAs via a high level hardware description language.",
                    "In-Storage Computation of Histograms with differential privacy.",
                    "Exponential sine sweep measurement implementation targeting FPGA platforms.",
                    "SoC FPGA implementation of an unmanned mobile vehicle with an image transmission system over VNC.",
                    "Efficient Stride 2 Winograd Convolution Method Using Unified Transformation Matrices on FPGA.",
                    "A modular RFSoC-based approach to interface superconducting quantum bits.",
                    "Total-ionizing-dose tolerance evaluation of an optoelectronic field programmable gate array VLSI during operation.",
                    "Real-time Implementation of Cyclostationary Analysis using FPGAs.",
                    "High-Performance Hardware Implementation of CRYSTALS-Dilithium.",
                    "LETA: A lightweight exchangeable-track accelerator for efficientnet based on FPGA.",
                    "APIR-DSP: An approximate PIR-DSP architecture for error-tolerant applications.",
                    "FastCGRA: A Modeling, Evaluation, and Exploration Platform for Large-Scale Coarse-Grained Reconfigurable Arrays.",
                    "FLOWER: A comprehensive dataflow compiler for high-level synthesis.",
                    "A streaming hardware architecture for real-time SIFT feature extraction.",
                    "Energy-efficient FPGA-accelerated LiDAR-based SLAM for embedded robotics.",
                    "General routing architecture modelling and exploration for modern FPGAs.",
                    "An autonomous driving system utilizing image processing accelerated by FPGA.",
                    "An efficient RTL buffering scheme for an FPGA-accelerated simulation of diffuse radiative transfer.",
                    "Fast controling autonomous vehicle based on real time image processing.",
                    "AMAH-Flex: A Modular and Highly Flexible Tool for Generating Relocatable Systems on FPGAs.",
                    "Characterization of IOBUF-based Ring Oscillators.",
                    "StreamZip: Compressed Sliding-Windows for Stream Aggregation."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "FPT 2020",
        "info": "Maui, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfpt/2020",
                "sub_name": "International Conference on Field-Programmable Technology, (IC)FPT 2020, Maui, HI, USA, December 9-11, 2020.",
                "count": 48,
                "papers": [
                    "Mapping Multiple LSTM models on FPGAs.",
                    "Beyond Peak Performance: Comparing the Real Performance of AI-Optimized FPGAs and GPUs.",
                    "A Reconfigurable Multithreaded Accelerator for Recurrent Neural Networks.",
                    "An FPGA Accelerator for Bayesian Network Structure Learning with Iterative Use of Processing Elements.",
                    "A Low-Cost Reconfigurable Nonlinear Core for Embedded DNN Applications.",
                    "Optimizing Fully Spectral Convolutional Neural Networks on FPGA.",
                    "Memory-Efficient Dataflow Inference for Deep CNNs on FPGA.",
                    "From TensorFlow Graphs to LUTs and Wires: Automated Sparse and Physically Aware CNN Hardware Generation.",
                    "INFER: INterFerence-aware Estimation of Runtime for Concurrent CNN Execution on DPUs.",
                    "DASH: Design Automation for Synthesis and Hardware Generation for CNN.",
                    "How Much Does Regularity Help FPGA Placement?",
                    "Learn to Place: FPGA Placement Using Reinforcement Learning and Directed Moves.",
                    "Revisiting FPGA Routing under Varying Operating Conditions.",
                    "Neighbors From Hell: Voltage Attacks Against Deep Learning Accelerators on Multi-Tenant FPGAs.",
                    "Jitter-based Adaptive True Random Number Generation for FPGAs in the Cloud.",
                    "New Directions for NewHope: Improving Performance of Post-Quantum Cryptography through Algorithm-level Pipelining.",
                    "Bandwidth Efficient Near-Storage Accelerator for High-Dimensional Similarity Search.",
                    "CHIP-KNN: A Configurable and High-Performance K-Nearest Neighbors Accelerator on Cloud FPGAs.",
                    "A High Throughput Parallel Hash Table Accelerator on HBM-enabled FPGAs.",
                    "Cloud FPGA Security with RO-Based Primitives.",
                    "A Reconfigurable Compute-in-the-Network FPGA Assistant for High-Level Collective Support with Distributed Matrix Multiply Case Study.",
                    "Designing Universal Logic Module FPGA Architectures for Use With Ambipolar Transistor Technology.",
                    "GIB: A Novel Unidirectional Interconnection Architecture for FPGA.",
                    "A Complete Open Source Design Flow for Gowin FPGAs.",
                    "FlexBex: A RISC-V with a Reconfigurable Instruction Extension.",
                    "Fast Linking of Separately-Compiled FPGA Blocks without a NoC.",
                    "StateReveal: Enabling Checkpointing of FPGA Designs with Buried State.",
                    "Build Automation and Runtime Abstraction for Partial Reconfiguration on Xilinx Zynq UltraScale+.",
                    "Moving Compute towards Data in Heterogeneous multi-FPGA Clusters using Partial Reconfiguration and I/O Virtualisation.",
                    "Automatic Selection and Insertion of HLS Directives Via a Source-to-Source Compiler.",
                    "A Design Exploration of Scalable Mesh-based Fully Pipelined Accelerators.",
                    "Quantisation-aware Dimensionality Reduction.",
                    "A High-Throughput, Resource-Efficient Implementation of the RoCEv2 Remote DMA Protocol for Network-Attached Hardware Accelerators.",
                    "Hardware Implementations with High Throughput, Low-Latency and Low-Area for Matrix Inversion.",
                    "Acceleration of Short Read Alignment with Runtime Reconfiguration.",
                    "Service Chaining for Heterogeneous Middleboxes.",
                    "ReconROS: Flexible Hardware Acceleration for ROS2 Applications.",
                    "A Bucket-Stream rBRIEF Extraction Architecture for SLAM Applications on Embedded Platforms.",
                    "Battling the CPU Bottleneck in Apache Parquet to Arrow Conversion Using FPGA.",
                    "Ultra-Low-Latency Video Encoding on Heterogenous Hardware Platforms.",
                    "Nonintrusive and Adaptive Monitoring for Locating Voltage Attacks in Virtualized FPGAs.",
                    "High Throughput and Low Latency Multi-Version Management Key-Value Storage Accelerator.",
                    "Automated Integration of High-Level Synthesis FPGA Modules with ROS2 Systems.",
                    "Design Method for an LUT Network-Based CNN with a Sparse Local Convolution.",
                    "An FPGA-Based Upper-Limb Rehabilitation Device for Gesture Recognition and Motion Evaluation Using Multi-Task Recurrent Neural Networks.",
                    "Performance Exploration on Pre-implemented CNN Hardware Accelerator on FPGA.",
                    "Exploring performance enhancement of event-driven processor networks.",
                    "Towards Overlay-based Rapid In-Circuit Tuning of Deep Learning Designs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "FPT 2019",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfpt/2019",
                "sub_name": "International Conference on Field-Programmable Technology, FPT 2019, Tianjin, China, December 9-13, 2019.",
                "count": 89,
                "papers": [
                    "Training Deep Neural Networks in Low-Precision with High Accuracy Using FPGAs.",
                    "A Machine Learning Approach for Power Gating the FPGA Routing Network.",
                    "Exploring Resource-Efficient Acceleration Algorithm for Transposed Convolution of GANs on FPGA.",
                    "Static Block Floating-Point Quantization for Convolutional Neural Networks on FPGA.",
                    "SkyCastle: A Resource-Aware Multi-Loop Scheduler for High-Level Synthesis.",
                    "Automatic Generation of Multi-Precision Multi-Arithmetic CNN Accelerators for FPGAs.",
                    "Synchronizing On-Chip Software and Hardware Traces for HLS-Accelerated Programs.",
                    "An Open Source FPGA-Optimized Out-of-Order RISC-V Soft Processor.",
                    "Time-SWAD: A Dataflow Engine for Time-Based Single Window Stream Aggregation.",
                    "A Coarse-Grained Reconfigurable Architecture with a Fault Tolerant Non-Volatile Configurable Memory.",
                    "Accelerated Approximate Nearest Neighbors Search Through Hierarchical Product Quantization.",
                    "OpenCL Implementation of Cannon's Matrix Multiplication Algorithm on Intel Stratix 10 FPGAs.",
                    "Pipelined Parallel Finite Automata Evaluation.",
                    "ZFP-V: Hardware-Optimized Lossy Floating Point Compression.",
                    "Merge-Exchange Sort Based Discrete Gaussian Sampler with Fixed Memory Access Pattern.",
                    "An Overlay for Rapid FPGA Debug of Machine Learning Applications.",
                    "Partitioning FPGA-Optimized Systolic Arrays for Fun and Profit.",
                    "Reducing FPGA Compile Time with Separate Compilation for FPGA Building Blocks.",
                    "Enhanced Heterogeneous Cloud: Transparent Acceleration and Elasticity.",
                    "An Open-Source Lightweight Timing Model for RapidWright.",
                    "Unexpected Diversity: Quantitative Memory Analysis for Zynq UltraScale+ Systems.",
                    "In Search of Lost Bandwidth: Extensive Reordering of DRAM Accesses on FPGA.",
                    "Shrink It or Shed It! Minimize the Use of LSQs in Dataflow Designs.",
                    "Implementing and Benchmarking Three Lattice-Based Post-Quantum Cryptography Algorithms Using Software/Hardware Codesign.",
                    "A High Performance FPGA-Based Accelerator Design for End-to-End Speaker Recognition System.",
                    "High-Throughput and Low-Latency Distributed Management Proxy for Key-Value Store Over 100Gbps Ethernet on FPGA.",
                    "Optimized Polynomial Multiplier Over Commutative Rings on FPGAs: A Case Study on BIKE.",
                    "An OpenCL-Based FPGA Accelerator for Compressed YOLOv2.",
                    "Secure Internal Communication of a Trustzone-Enabled Heterogeneous Soc Lightweight Encryption.",
                    "Amoeba-Inspired Hardware SAT Solver with Effective Feedback Control.",
                    "A Study on Switch Block Patterns for Tileable FPGA Routing Architectures.",
                    "Resource-Efficient Logarithmic Number Scale Arithmetic for SPN Inference on FPGAs.",
                    "SpWMM: A High-Performance Sparse-Winograd Matrix-Matrix Multiplication Accelerator for CNNs.",
                    "Network Enabled Partial Reconfiguration for Distributed FPGA Edge Acceleration.",
                    "A 307-fps 351.7-GOPs/W Deep Learning FPGA Accelerator for Real-Time Scene Text Recognition.",
                    "A Dataflow Pipelining Architecture for Tile Segmentation with a Sparse MobileNet on an FPGA.",
                    "A High Energy-Efficiency FPGA-Based LSTM Accelerator Architecture Design by Structured Pruning and Normalized Linear Quantization.",
                    "ASAP: Automatic Sizing and Partitioning for Dynamic Memory Heaps in High-Level Synthesis.",
                    "Survey on FPGAs in Medical Radiology Applications: Challenges, Architectures and Programming Models.",
                    "An OpenCL-Based Hybrid CNN-RNN Inference Accelerator On FPGA.",
                    "A Resource Consumption and Performance Overhead Optimized Reduction Circuit on FPGAs.",
                    "Extending the Lifetime of Coarse-Grained Runtime Reconfigurable FPGAs by Balancing Processing Element Usage.",
                    "A Complete CPU-FPGA Architecture for Protein Identification with Tandem Mass Spectrometry.",
                    "Real-Time Automatic Modulation Classification.",
                    "Automatic Generation of Application-Specific FPGA Overlays with RapidWright.",
                    "Scalable Low-Latency Persistent Neural Machine Translation on CPU Server with Multiple FPGAs.",
                    "RNA: Reconfigurable LSTM Accelerator with Near Data Approximate Processing.",
                    "OBFS: OpenCL Based BFS Optimizations on Software Programmable FPGAs.",
                    "AutoBoxing: Improving GCC Passes to Optimize HW/SW Multi-Versioning of Kernels for HLS.",
                    "ZyNet: Automating Deep Neural Network Implementation on Low-Cost Reconfigurable Edge Computing Platforms.",
                    "Power-Aware FPGA Mapping of Convolutional Neural Networks.",
                    "HILL: A Hardware Isolation Framework Against Information Leakage on Multi-Tenant FPGA Long-Wires.",
                    "Storage Mirroring for Bare-Metal Malware Analysis on FPGA Devices.",
                    "MajorityNets: BNNs Utilising Approximate Popcount for Improved Efficiency.",
                    "Lina: Timing-Constrained High-Level Synthesis Performance Estimator for Fast DSE.",
                    "Evaluation of Partially Constant, Fine-Grained, Dynamic Partial Reconfigurable Functions in FPGAs.",
                    "Optimizing FPGA-Based Streaming Applications for Throughput Using Pipelining.",
                    "Lightweight Programmable DSP Block Overlay for Streaming Neural Network Acceleration.",
                    "Optimisation of System Throughput Exploiting Tasks Heterogeneity on Space Shared FPGAs.",
                    "Hybrid Network Utilization for Efficient Communication in a Tightly Coupled FPGA Cluster.",
                    "Efficient OS Hardware Accelerators Preemption Management in FPGA.",
                    "A High-Level Synthesis Approach to the Software/Hardware Codesign of NTT-Based Post-Quantum Cryptography Algorithms.",
                    "High-Level Synthesis Techniques to Generate Deeply Pipelined Circuits for FPGAs with Registered Routing.",
                    "Real-Time Anomaly Detection for Flight Testing Using AutoEncoder and LSTM.",
                    "Revisiting Deep Learning Parallelism: Fine-Grained Inference Engine Utilizing Online Arithmetic.",
                    "Implementation of Distributed Processing Using a PC-FPGA Hybrid System.",
                    "SoC-FPGA-Based Implementation of Iris Recognition Enhanced by QC-LDPC Codes.",
                    "Evolved Binary Neural Networks Through Harnessing FPGA Capabilities.",
                    "FPNet: Customized Convolutional Neural Network for FPGA Platforms.",
                    "An Iterative Technique for Runtime Efficient Hardware-Software Partitioning.",
                    "Parallelization of Recursive Function in Ruby-Based High-Level Synthesis.",
                    "Dependency-Aware Clustering for Variable-Grained Hardware-Software Partitioning.",
                    "Improving Memory Access Locality for Vectorized Bit-Serial Matrix Multiplication in Reconfigurable Computing.",
                    "Real-Time Object Detection on 640x480 Image With VGG16+SSD.",
                    "Winograd-Based Real-Time Super-Resolution System on FPGA.",
                    "An End-to-End Solution to Autonomous Driving Based on Xilinx FPGA.",
                    "Autonomous Driving Developed with an FPGA Design.",
                    "Self-Driving Car Application of a Stream-Oriented Accelerator Framework.",
                    "Towards the Improvement of Training Efficiency and Image Recognition Accuracy for an FPGA Controlled Mini-Car by Offloading Neural Network Training.",
                    "Design and Implementation of Autonomous Driving Robot Car Using SoC FPGA.",
                    "ZytleBot: FPGA Integrated Development Platform for ROS Based Autonomous Mobile Robot.",
                    "Autonomous Vehicle Development Using FPGA for Image Processing.",
                    "Development of Autonomous Driving System Using Programmable SoCs.",
                    "Implementation of a ROS-Based Autonomous Vehicle on an FPGA Board.",
                    "Autonomous Vehicle Driving Using the Stream-Based Real-Time Hardware Line Detector.",
                    "FPGA-Based Object Detection for Autonomous Driving System.",
                    "An SoC-FPGA-Based Micro UGV with Localization and Motion Planning.",
                    "Design and Development of Networked Multiple FPGA Components for Autonomous Tiny Robot Car.",
                    "Image Processing and Vehicles - Using FPGA to Reduce Latency of Time Critical Tasks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "FPT 2018",
        "info": "Naha, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2018",
                "sub_name": "International Conference on Field-Programmable Technology, FPT 2018, Naha, Okinawa, Japan, December 10-14, 2018.",
                "count": 83,
                "papers": [
                    "Digital Transformation of Automobile and Mobility Service.",
                    "Dither NN: An Accurate Neural Network with Dithering for Low Bit-Precision Hardware.",
                    "A Real-Time Object Detection Accelerator with Compressed SSDLite on FPGA.",
                    "FPGA Accelerated HPC and Data Analytics.",
                    "Implementing NEF Neural Networks on Embedded FPGAs.",
                    "Accelerator-in-Switch: A Novel Cooperation Framework for FPGAs and GPUs.",
                    "Novel Neural Network Applications on New Python Enabled Platforms.",
                    "Memory-Efficient Architecture for Accelerating Generative Networks on FPGA.",
                    "Live Migration for OpenCL FPGA Accelerators.",
                    "An Empirically Guided Optimization Framework for FPGA OpenCL.",
                    "Software-Specified FPGA Accelerators for Elementary Functions.",
                    "Scaling Up Loop Pipelining for High-Level Synthesis: A Non-iterative Approach.",
                    "Application Acceleration on FPGAs with OmpSs@FPGA.",
                    "FLiMS: Fast Lightweight Merge Sorter.",
                    "Very Massive Hardware Merge Sorter.",
                    "Stream-Based ORB Feature Extractor with Dynamic Power Optimization.",
                    "R3SGM: Real-Time Raster-Respecting Semi-Global Matching for Power-Constrained Systems.",
                    "Tatum: Parallel Timing Analysis for Faster Design Cycles and Improved Optimization.",
                    "SAT Based Place-And-Route for High-Speed Designs on 2.5D FPGAs.",
                    "Compact Area and Performance Modelling for CGRA Architecture Evaluation.",
                    "MultiMQC: A Multilevel Message Queuing Cache Combining In-NIC and In-Kernel Memories.",
                    "Ultra-Low-Latency and Flexible In-memory Key-Value Store System Design on CPU-FPGA.",
                    "A Nearest Neighbor Search Engine Using Distance-Based Hashing.",
                    "DaCO: A High-Performance Token Dataflow Coprocessor Overlay for FPGAs.",
                    "Scheduling Algorithms for High Performance Network Switching on FPGAs: A Survey.",
                    "Enabling Overclocking Through Algorithm-Level Error Detection.",
                    "Secure Hardware Kernels Execution in CPU+FPGA Heterogeneous Cloud.",
                    "A High-Speed Constant-Time Hardware Implementation of NTRUEncrypt SVES.",
                    "Injecting FPGA Configuration Faults in Parallel.",
                    "Evaluating The Highly-Pipelined Intel Stratix 10 FPGA Architecture Using Open-Source Benchmarks.",
                    "FPGA Architecture Enhancements for Efficient BNN Implementation.",
                    "Synthesizable Heterogeneous FPGA Fabrics.",
                    "QoS-Aware Cross-Layer Reliability-Integrated FPGA-Based Dynamic Partially Reconfigurable System Partitioning.",
                    "High-Speed Computation of CRC Codes for FPGAs.",
                    "FCLNN: A Flexible Framework for Fast CNN Prototyping on FPGA with OpenCL and Caffe.",
                    "Accelerating Top-k ListNet Training for Ranking Using FPGA.",
                    "GridGAS: An I/O-Efficient Heterogeneous FPGA+CPU Computing Platform for Very Large-Scale Graph Analytics.",
                    "Lossy Multiport Memory.",
                    "An FPGA Implementation of Robust Matting.",
                    "Improving Confidentiality in Virtualized FPGAs.",
                    "High Performance High-Precision Floating-Point Operations on FPGAs Using OpenCL.",
                    "Efficient Inter-Kernel Communication for OpenCL Database Operators on FPGAs.",
                    "FPGA Acceleration of a Supervised Learning Method for Hyperspectral Image Classification.",
                    "High Throughput CNN Accelerator Design Based on FPGA.",
                    "Hardware-Accelerated Index Construction for Semantic Web.",
                    "DP-Pack: Distributed Parallel Packing for FPGAs.",
                    "Checking for Electrical Level Security Threats in Bitstreams for Multi-tenant FPGAs.",
                    "An Accelerated OpenVX Overlay for Pure Software Programmers.",
                    "Mapping Estimator for OpenCL Heterogeneous Accelerators.",
                    "A Tri-State Weight Convolutional Neural Network for an FPGA: Applied to YOLOv2 Object Detector.",
                    "Investigating How Hardware Architectures are Expressed in High-Level Languages for an SKA Algorithm.",
                    "Simultaneous Inference and Training Using On-FPGA Weight Perturbation Techniques.",
                    "An FPGA Realization of OpenPose Based on a Sparse Weight Convolutional Neural Network.",
                    "Performance Estimation for Exascale Reconfigurable Dataflow Platforms.",
                    "Lattice-Based Scheduling for Multi-FPGA Systems.",
                    "ReFiRe: Efficient Deployment of Remote Fine-Grained Reconfigurable Accelerators.",
                    "AConFPGA: A Multiple-Output Boolean Function Approximation DSE Technique Targeting FPGAs.",
                    "Face-off Between the CAESAR Lightweight Finalists: ACORN vs. Ascon.",
                    "Large Utility Sorting on FPGAs.",
                    "A System-Level Transprecision FPGA Accelerator for BLSTM Using On-chip Memory Reshaping.",
                    "Transparent Acceleration of Image Processing Kernels on FPGA-Attached Hybrid Memory Cube Computers.",
                    "A Scalable Pipelined Dataflow Accelerator for Object Region Proposals on FPGA Platform.",
                    "Distributed-Memory Based FPGA Debug: Design Timing Impact.",
                    "Unified On-Chip Software and Hardware Debug for HLS-Accelerated Programs.",
                    "Optimisation of Convolution of Multiple Different Sized Filters in SKA Pulsar Search Engine.",
                    "Speed and Resource Optimization of BFGS Quasi-Newton Implementation on FPGA Using Inexact Line Search Method for Neural Network Training.",
                    "A Short-Transfer Model for Tightly-Coupled CPU-FPGA Platforms.",
                    "An Automated FPGA-Based Fault Injection Platform for Granularly-Pipelined Fault Tolerant CORDIC.",
                    "An Area-Efficient Out-of-Order Soft-Core Processor Without Register Renaming.",
                    "Enhancing Memory Bandwidth in a Single Stream Computation with Multiple FPGAs.",
                    "Demonstration of Full-Duplex Packet Transfers Over PCI Express with Sustained 200 Gbps Throughput.",
                    "Lens Distortion Self-Calibration Using the Hough Transform.",
                    "Real-Time Object Detection and Semantic Segmentation Hardware System with Deep Learning Networks.",
                    "LeFlow: Automatic Compilation of TensorFlow Machine Learning Applications to FPGAs.",
                    "Introduction of MNSTbot.",
                    "Development of an FPGA Controlled \"Mini-Car\" Toward Autonomous Driving.",
                    "A Platform on All-Programmable SoC for Micro Autonomous Robots.",
                    "Implementation of an Autonomous Driving System for FPT2018 FPGA Design Competition Using the Zynqberry Processing Board.",
                    "Development of an Autonomous Driving Robot Car Using FPGA.",
                    "Development of a Robot Car by Single Line Search Method for White Line Detection with FPGA.",
                    "Development of a Control Target Recognition for Autonomous Vehicle Using FPGA with Python.",
                    "A Study on Introducing FPGA to ROS Based Autonomous Driving System.",
                    "FPGA Design for Autonomous Vehicle Driving Using Binarized Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "FPT 2017",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2017",
                "sub_name": "International Conference on Field Programmable Technology, FPT 2017, Melbourne, Australia, December 11-13, 2017.",
                "count": 53,
                "papers": [
                    "RBSA: Range-based simulated annealing for FPGA placement.",
                    "Automatic circuit design and modelling for heterogeneous FPGAs.",
                    "Liquid: High quality scalable placement for large heterogeneous FPGAs.",
                    "Performance characterization of Altera and Xilinx 28 nm FPGAs at cryogenic temperatures.",
                    "High performance serial ATA Gen3 controllers on FPGA devices.",
                    "SMEFF: A scalable memory extension fabric for FPGA.",
                    "AXI over Ethernet; a protocol for the monitoring and control of FPGA clusters.",
                    "Ultra-low latency continuous block-parallel stream windowing using FPGA on-chip memory.",
                    "HopliteRT: An efficient FPGA NoC for real-time applications.",
                    "architect: Arbitrary-precision constant-hardware iterative compute.",
                    "A state machine block for high-level synthesis.",
                    "An IP core integration tool-flow for prototyping software-defined radios using static dataflow with access patterns.",
                    "Synthesis of program binaries into FPGA accelerators with runtime dependence validation.",
                    "Pass a pointer: Exploring shared virtual memory abstractions in OpenCL tools for FPGAs.",
                    "Single window stream aggregation using reconfigurable hardware.",
                    "Toward a new HLS-based methodology for FPGA benchmarking of candidates in cryptographic competitions: The CAESAR contest case study.",
                    "Comparing the cost of protecting selected lightweight block ciphers against differential power analysis in low-cost FPGAs.",
                    "Accelerating NFV application using CPU-FPGA tightly coupled architecture.",
                    "An energy efficient approach for C4.5 algorithm using OpenCL design flow.",
                    "Exploring automated space/time tradeoffs for OpenVX compute graphs.",
                    "NnCore: A parameterized non-linear function generator for machine learning applications in FPGAs.",
                    "An object detector based on multiscale sliding window search using a fully pipelined binarized CNN on an FPGA.",
                    "Lowering dynamic power in stream-based harris corner detection architecture.",
                    "A 42fps full-HD ORB feature extraction accelerator with reduced memory overhead.",
                    "A scalable hybrid architecture for high performance data-parallel applications.",
                    "Homeostatic fault tolerance in spiking neural networks utilizing dynamic partial reconfiguration of FPGAs.",
                    "Model-based hardware design based on compatible sets of isomorphic subgraphs.",
                    "A NoC-based custom FPGA configuration memory architecture for ultra-fast micro-reconfiguration.",
                    "An FPGA-based processor for training convolutional neural networks.",
                    "An FPGA-accelerated high-throughput data optimization system for high-speed transfer via wide area network.",
                    "Evolvable caches: Optimization of reconfigurable cache mappings for a LEON3/Linux-based multi-core processor.",
                    "An open source PXIe ecosystem based on FPGA modules.",
                    "FPGA-based high-performance time-to-digital converters by utilizing multi-channels looped carry chains.",
                    "Instruction driven cross-layer CNN accelerator with winograd transformation on FPGA.",
                    "An FPGA-based tree crown detection approach for remote sensing images.",
                    "A light-weight hardware/software co-design for pairing-based cryptography with low power and energy consumption.",
                    "FPGA-based training of convolutional neural networks with a reduced precision floating-point library.",
                    "Selection of an error-correcting code for FPGA-based physical unclonable functions.",
                    "Streaming sorting network based BWT acceleration on FPGA for lossless compression.",
                    "Runtime rule-reconfigurable high throughput NIPS on FPGA.",
                    "Designing and accelerating spiking neural networks using OpenCL for FPGAs.",
                    "Customizable FPGA OpenCL matrix multiply design template for deep neural networks.",
                    "A comprehensive hardware/software infrastructure for IP cores design protection.",
                    "hCODE 2.0: An open-source toolkit for building efficient FPGA-enabled clouds.",
                    "Calling hardware procedures in a reconfigurable accelerator using RPC-FPGA.",
                    "FPGA-based ORB feature extraction for real-time visual SLAM.",
                    "PipeCNN: An OpenCL-based open-source FPGA accelerator for convolution neural networks.",
                    "Hough transform line reconstruction on FPGA using back-projection.",
                    "FPGA implementation of convolutional neural network based on stochastic computing.",
                    "All binarized convolutional neural network and its implementation on an FPGA.",
                    "FPGA-based accelerator for losslessly quantized convolutional neural networks.",
                    "FPGA implementation of a real-time super-resolution system with a CNN based on a residue number system.",
                    "A unified reconfigurable floating-point arithmetic architecture based on CORDIC algorithm."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "FPT 2016",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2016",
                "sub_name": "2016 International Conference on Field-Programmable Technology, FPT 2016, Xi'an, China, December 7-9, 2016.",
                "count": 67,
                "papers": [
                    "High-level synthesis - the right side of history.",
                    "The configurable cloud - accelerating hyperscale datacenter services with FPGAs.",
                    "FPGA as service in public Cloud: Why and how.",
                    "High density, low energy, magnetic tunnel junction based block RAMs for memory-rich FPGAs.",
                    "Analysis of transient voltage fluctuations in FPGAs.",
                    "An energy-efficient near/sub-threshold FPGA interconnect architecture using dynamic voltage scaling and power-gating.",
                    "Integer computations with soft GPGPU on FPGAs.",
                    "Network-attached FPGAs for data center applications.",
                    "Hypervisor mechanisms to manage FPGA reconfigurable accelerators.",
                    "FPGA-based acceleration of FDAS module using OpenCL.",
                    "Automatic code generation of convolutional neural networks in FPGA implementation.",
                    "An efficient implementation of online arithmetic.",
                    "Accelerating Binarized Neural Networks: Comparison of FPGA, CPU, GPU, and ASIC.",
                    "Random projections for scaling machine learning on FPGAs.",
                    "High-speed regular expression matching with pipelined automata.",
                    "Fine-grained module-based error recovery in FPGA-based TMR systems.",
                    "Enhanced source-level instrumentation for FPGA in-system debug of High-Level Synthesis designs.",
                    "A Programmable Configuration Controller for fault-tolerant applications.",
                    "Tessellation-based multi-block memory mapping scheme for high-level synthesis with FPGA.",
                    "High-level synthesis of resource-shared microarchitectures from irregular complex C-code.",
                    "Spector: An OpenCL FPGA benchmark suite.",
                    "Deflection routing for multi-level FPGA overlay NoCs.",
                    "Hybrid hard NoCs for efficient FPGA communication.",
                    "Debugging framework for FPGA-based soft processors.",
                    "Dynamic scheduling of voter checks in FPGA-based TMR systems.",
                    "Energy-aware scheduling for task adaptive FPGAs.",
                    "Enriching C-based High-Level Synthesis with parallel pattern templates.",
                    "Automatic wire modeling to explore novel FPGA architectures.",
                    "Rapid design space exploration for soft core processor customization and selection.",
                    "Application debug in FPGAs in the presence of multiple asynchronous clocks.",
                    "Hardware Trojan avoidance and detection for dynamically re-configurable FPGAs.",
                    "Dataflow design for optimal incremental SVM training.",
                    "FPGA acceleration of TreePM N-body simulations for Modified Newton Dynamics.",
                    "hCODE: An open-source platform for FPGA accelerators.",
                    "Fast polynomial arithmetic for Somewhat Homomorphic Encryption operations in hardware with Karatsuba algorithm.",
                    "FAU: Fast and error-optimized approximate adder units on LUT-Based FPGAs.",
                    "Variable pipeline structure for Coarse Grained Reconfigurable Array CMA.",
                    "A survey of NoC evaluation platforms on FPGAs.",
                    "A modular architecture for dynamically reconfigurable middlebox with customized reconfiguration handler.",
                    "Exploring shared SRAM tables among NPN equivalent large LUTs in SRAM-based FPGAs.",
                    "Enabling in-situ logic-in-memory capability using resistive-RAM crossbar memory.",
                    "Design and implementation of open-source SATA III core for Stratix V FPGAs.",
                    "Time-independent discrete Gaussian sampling for post-quantum cryptography.",
                    "High performance Deformable Part Model accelerator based on FPGA.",
                    "FPGA implementation of a real-time super-resolution system using a convolutional neural network.",
                    "EMA-FPRMs: An efficient minimization algorithm for fixed polarity Reed-Muller expressions.",
                    "An efficient FPGA implementation of Mahalanobis distance-based outlier detection for streaming data.",
                    "Real-time object detection and classification for high-speed asymmetric-detection time-stretch optical microscopy on FPGA.",
                    "Caffeinated FPGAs: FPGA framework For Convolutional Neural Networks.",
                    "Hardware TCP Offload Engine based on 10-Gbps Ethernet for low-latency network communication.",
                    "Fixed-ratio DXT format Frame Buffer Compressor for mobile graphics systems.",
                    "A memory-based realization of a binarized deep convolutional neural network.",
                    "FPGA based hardware accelerator for KAZE feature extraction algorithm.",
                    "IC security evaluation against fault injection attack based on FPGA emulation.",
                    "An acceleration of a random forest classification using Altera SDK for OpenCL.",
                    "Functional verification as a tool for monitoring impact of faults in SRAM-based FPGAs.",
                    "Random stimuli generation based on a stochastic context-free grammar.",
                    "Implementation of fault tolerant techniques into FPNNs.",
                    "Evaluation of variable precision computing with variable precision FFT implementation on FPGA.",
                    "HLS-based fault tolerance approach for SRAM-based FPGAs.",
                    "SMCFA: A Zynq-based stacked multi CPU-FPGA architecture.",
                    "A moving object extraction and classification system based on Zynq and IBM SuperVessel.",
                    "Implementation of parallel medical ultrasound imaging algorithm on CAPI-enabled FPGA.",
                    "Asymmetric multiprocessing for motion control based on Zynq SoC.",
                    "Identification of Trax threats using pattern matching.",
                    "Trax solver on Zynq using incremental update algorithm.",
                    "Trax player implementation on FPGA using high level synthesis tool."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "FPT 2015",
        "info": "Queenstown, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2015",
                "sub_name": "2015 International Conference on Field Programmable Technology, FPT 2015, Queenstown, New Zealand, December 7-9, 2015.",
                "count": 44,
                "papers": [
                    "Accelerated cell imaging and classification on FPGAs for quantitative-phase asymmetric-detection time-stretch optical microscopy.",
                    "FPGA acceleration of reference-based compression for genomic data.",
                    "Leftmost longest regular expression matching in reconfigurable logic.",
                    "Bringing programmability to the data plane: Packet processing with a NoC-enhanced FPGA.",
                    "An adaptive virtual overlay for fast trigger insertion for FPGA debug.",
                    "Using Round-Robin Tracepoints to debug multithreaded HLS circuits on FPGAs.",
                    "Using source-to-source compilation to instrument circuits for debug with High Level Synthesis.",
                    "QuickDough: A rapid FPGA loop accelerator design framework using soft CGRA overlay.",
                    "Energy minimization in the time-space continuum.",
                    "Automatic FPGA system and interconnect construction with multicast and customizable topology.",
                    "Improved carry chain mapping for the VTR flow.",
                    "HETRIS: Adaptive floorplanning for heterogeneous FPGAs.",
                    "Analyzing the divide between FPGA academic and commercial results.",
                    "OpenCL library of stream memory components targeting FPGAs.",
                    "Exploring pipe implementations using an OpenCL framework for FPGAs.",
                    "An exact MCMC accelerator under custom precision regimes.",
                    "FPGA implementation of low-power and high-PSNR DCT/IDCT architecture based on adaptive recoding CORDIC.",
                    "Braiding: A scheme for resolving hazards in kernel adaptive filters.",
                    "Custom-sized caches in application-specific memory hierarchies.",
                    "Resource and memory management techniques for the high-level synthesis of software threads into parallel FPGA hardware.",
                    "Provably Correct Development of reconfigurable hardware designs via equational reasoning.",
                    "Behavioral-level IP integration in high-level synthesis.",
                    "Optimized high-level synthesis of SMT multi-threaded hardware accelerators.",
                    "Minimizing DSP block usage through multi-pumping.",
                    "An adaptive cross-layer fault recovery solution for reconfigurable SoCs.",
                    "A co-design approach for accelerated SQL query processing via FPGA-based data filtering.",
                    "A self-aware data compression system on FPGA in Hadoop.",
                    "An FPGA-based real-time simultaneous localization and mapping system.",
                    "Hardware design of a fast, parallel Random Tree path planner.",
                    "Lower precision for higher accuracy: Precision and resolution exploration for shallow water equations.",
                    "Comparison of thread signatures for error detection in hybrid multi-cores.",
                    "Advanced Bayer demosaicing on FPGAs.",
                    "JIT trace-based verification for high-level synthesis.",
                    "Cryptographic techniques in redundant number systems.",
                    "2D Discrete Fourier Transform with simultaneous edge artifact removal for real-time applications.",
                    "FPGA based acceleration of FDAS module for Pulsar Search.",
                    "FPGA implementation of a SIMD-based array processor with torus interconnect.",
                    "An efficient architecture for zero overhead data en-/decryption using reconfigurable cryptographic engine.",
                    "Smart camera for Trax playing robot.",
                    "Development of a Trax Artificial Intelligence algorithm using path and edge.",
                    "FPGA Trax Solver based on a neural network design.",
                    "An architecture-algorithm co-design of artificial intelligence for Trax player.",
                    "An Implementation of Trax player using programmable SoC.",
                    "Trax solver on Zynq with Deep Q-Network."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "FPT 2014",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2014",
                "sub_name": "2014 International Conference on Field-Programmable Technology, FPT 2014, Shanghai, China, December 10-12, 2014.",
                "count": 73,
                "papers": [
                    "Logic emulation in the megaLUT era - Moore's Law beats Rent's Rule.",
                    "Automating customized computing.",
                    "Doing FPGA in a former software company.",
                    "Design re-use for compile time reduction in FPGA high-level synthesis flows.",
                    "Is high level synthesis ready for business? A computational finance case study.",
                    "Comparing performance, productivity and scalability of the TILT overlay processor to OpenCL HLS.",
                    "Size aware placement for island style FPGAs.",
                    "Analyzing the impact of heterogeneous blocks on FPGA placement quality.",
                    "Low-latency option pricing using systolic binomial trees.",
                    "Collaborative processing of Least-Square Monte Carlo for American options.",
                    "Accelerating transfer entropy computation.",
                    "FPGA-accelerated Monte-Carlo integration using stratified sampling and Brownian bridges.",
                    "Time sharing of Runtime Coarse-Grain Reconfigurable Architectures processing elements in multi-process systems.",
                    "Architectural synthesis of computational pipelines with decoupled memory access.",
                    "Improve memory access for achieving both performance and energy efficiencies on heterogeneous systems.",
                    "Approaching overhead-free execution on FPGA soft-processors.",
                    "Low-latency double-precision floating-point division for FPGAs.",
                    "Efficient FPGA implementation of digit parallel online arithmetic operators.",
                    "An efficient FPGA implementation of QR decomposition using a novel systolic array architecture based on enhanced vectoring CORDIC.",
                    "Area efficient floating-point adder and multiplier with IEEE-754 compatible semantics.",
                    "A universal FPGA-based floating-point matrix processor for mobile systems.",
                    "A survey on security and trust of FPGA-based systems.",
                    "Hardware Trojan detection acceleration based on word-level statistical properties management.",
                    "Power supply noise aware evaluation framework for side channel attacks and countermeasures.",
                    "Memory security in reconfigurable computers: Combining formal verification with monitoring.",
                    "An FPGA-based spectral anomaly detection system.",
                    "RotoRouter: Router support for endpoint-authorized decentralized traffic filtering to prevent DoS attacks.",
                    "Parallel resampling for particle filters on FPGAs.",
                    "Evaluation of SNMP-like protocol to manage a NoC emulation platform.",
                    "A high-performance low-power near-Vt RRAM-based FPGA.",
                    "A pure-CMOS nonvolatile multi-context configuration memory for dynamically reconfigurable FPGAs.",
                    "A flexible interface architecture for reconfigurable coprocessors in embedded multicore systems using PCIe Single-root I/O virtualization.",
                    "Gigabyte-scale alignment acceleration of biological sequences via Ethernet streaming.",
                    "Power modelling and capping for heterogeneous ARM/FPGA SoCs.",
                    "Analysis and optimization of a deeply pipelined FPGA soft processor.",
                    "A circuit to synchronize high speed serial communication channel.",
                    "Novel reconfigurable hardware implementation of polynomial matrix/vector multiplications.",
                    "A complementary architecture for high-speed true random number generator.",
                    "Fanout decomposition dataflow optimizations for FPGA-based Sparse LU factorization.",
                    "Zero latency encryption with FPGAs for secure time-triggered automotive networks.",
                    "Using C to implement high-efficient computation of dense optical flow on FPGA-accelerated heterogeneous platforms.",
                    "Hardware architecture of bi-cubic convolution interpolation for real-time image scaling.",
                    "FPGA-based high throughput XTS-AES encryption/decryption for storage area network.",
                    "Zyndroid: An Android platform for software/hardware coprocessing.",
                    "A dataflow system for anomaly detection and analysis.",
                    "Design space exploration for FPGA-based hybrid multicore architecture.",
                    "Reducing the overhead of dynamic partial reconfiguration for multi-mode circuits.",
                    "HW acceleration of multiple applications on a single FPGA.",
                    "Towards automatic partial reconfiguration in FPGAs.",
                    "Achieving higher performance of memcached by caching at network interface.",
                    "No zero padded sparse matrix-vector multiplication on FPGAs.",
                    "AMMC: Advanced Multi-Core Memory Controller.",
                    "Assessing scrubbing techniques for Xilinx SRAM-based FPGAs in space applications.",
                    "A fast, energy efficient, field programmable threshold-logic array.",
                    "A novel three-dimensional FPGA architecture with high-speed serial communication links.",
                    "Scalable radio processor architecture for modern wireless communications.",
                    "Integrating FPGA-based processing elements into a runtime for parallel heterogeneous computing.",
                    "Deep and narrow binary content-addressable memories using FPGA-based BRAMs.",
                    "Development productivity in implementing a complex heterogeneous computing application.",
                    "Real-time 3D reconstruction for FPGAs: A case study for evaluating the performance, area, and programmability trade-offs of the Altera OpenCL SDK.",
                    "Online scheduling for FPGA computation in the Cloud.",
                    "High performance relevance vector machine on HMPSoC.",
                    "Improving the reliability of RO PUF using frequency offset.",
                    "Network recorder and player: FPGA-based network traffic capture and replay.",
                    "Implementation of LS-SVM with HLS on Zynq.",
                    "A high-performance and high-programmability reconfigurable wireless development platform.",
                    "Image processing by A 0.3V 2MW coarse-grained reconfigurable accelerator CMA-SOTB with a solar battery.",
                    "Hardware/software co-design architecture for Blokus Duo solver.",
                    "Optimize MinMax algorithm to solve Blokus Duo game by HDL.",
                    "An improved FPGA-based specific processor for Blokus Duo.",
                    "Highly scalable, shared-memory, Monte-Carlo tree search based Blokus Duo Solver on FPGA.",
                    "Blokus Duo engine on a Zynq.",
                    "FPGA implementation of Blokus Duo player using hardware/software co-design."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "FPT 2013",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2013",
                "sub_name": "2013 International Conference on Field-Programmable Technology, FPT 2013, Kyoto, Japan, December 9-11, 2013.",
                "count": 93,
                "papers": [
                    "Recent advances in die stacking and 3D FPGA.",
                    "Reconfigurable chip advantage compared with GPGPU from the compiler perspective.",
                    "Why Put FPGAs in your CPU socket?",
                    "Accelerating validation of time-triggered automotive systems on FPGAs.",
                    "Exploiting partially defective LUTs: Why you don't need perfect fabrication.",
                    "Maximum flow algorithms for maximum observability during FPGA debug.",
                    "The architecture and placement algorithm for a uni-directional routing based 3D FPGA.",
                    "COFFE: Fully-automated transistor sizing for FPGAs.",
                    "A case for hardened multiplexers in FPGAs.",
                    "Debugging processors with advanced features by reprogramming LUTs on FPGA.",
                    "Virtual-to-Physical address translation for an FPGA-based interconnect with host and GPU remote DMA capabilities.",
                    "Accelerating iterative algorithms with asynchronous accumulative updates on FPGAs.",
                    "High throughput, tree automata based XML processing using FPGAs.",
                    "Transparent FPGA based device for SQL DDoS mitigation.",
                    "Discrete event system specification, synthesis, and optimization of low-power FPGA-based embedded systems.",
                    "Optimizing time and space multiplexed computation in a dynamically reconfigurable processor.",
                    "SOAP: Structural optimization of arithmetic expressions for high-level synthesis.",
                    "Making domain-specific hardware synthesis tools cost-efficient.",
                    "System-level FPGA device driver with high-level synthesis support.",
                    "Bitwidth-optimized hardware accelerators with software fallback.",
                    "A low latency kernel recursive least squares processor using FPGA technology.",
                    "Implementation of high performance hardware architecture of OpenSURF algorithm on FPGA.",
                    "TROJANUS: An ultra-lightweight side-channel leakage generator for FPGAs.",
                    "Real-time and low power embedded ℓ1-optimization solver design.",
                    "Efficient execution of augmented reality applications on mobile programmable accelerators.",
                    "An OpenCL optimizing compiler for reconfigurable processors.",
                    "Real-time ray tracing on coarse-grained reconfigurable processor.",
                    "Mobile GPU shader processor based on non-blocking Coarse Grained Reconfigurable Arrays architecture.",
                    "Acceleration of real-time Proximity Query for dynamic active constraints.",
                    "Dynamic Stencil: Effective exploitation of run-time resources in reconfigurable clusters.",
                    "FlexGrip: A soft GPGPU for FPGAs.",
                    "Maximizing speed and density of tiled FPGA overlays via partitioning.",
                    "Improving clock-rate of hard-macro designs.",
                    "Exploiting stochastic delay variability on FPGAs with adaptive partial rerouting.",
                    "Automated multi-device placement, I/O voltage supply assignment, and pin assignment in circuit board design.",
                    "From software threads to parallel hardware in high-level synthesis for FPGAs.",
                    "StML: Bridging the gap between FPGA design and HDL circuit description.",
                    "Derivation of efficient FSM from loop nests.",
                    "An automated flow for the High Level Synthesis of coarse grained parallel applications.",
                    "A high-throughput FPGA architecture for parallel connected components analysis based on label reuse.",
                    "Teaching FPGA security.",
                    "Fast Boolean matching based on NPN classification.",
                    "Multi-personality partitioning for heterogeneous systems.",
                    "A hardware acceleration of a phylogenetic tree reconstruction with maximum parsimony algorithm using FPGA.",
                    "Application-specific customisation of market data feed arbitration.",
                    "A connection-based router for FPGAs.",
                    "Flexible hierarchy ray tracing on FPGAs.",
                    "Design and optimization of heterogeneous tree-based FPGA using 3D technology.",
                    "NFA reduction for regular expressions matching using FPGA.",
                    "Runtime hardware/software task transition scheduling for data-adaptable embedded systems.",
                    "A speculative gather system for Cool Mega-Array.",
                    "An acceleration method of short read mapping using FPGA.",
                    "Quantum FPGA architecture design.",
                    "Real-time high-quality stereo vision system in FPGA.",
                    "High-level synthesis of dynamic data structures: A case study using Vivado HLS.",
                    "Datapath fault tolerance for parallel accelerators.",
                    "Hardware acceleration of biomedical models with OpenCMISS and CellML.",
                    "sAES: A high throughput and low latency secure cloud storage with pipelined DMA based PCIe interface.",
                    "A 66.1 Gbps single-pipeline AES on FPGA.",
                    "Partially reconfigurable flux calculation scheme in advection term computation.",
                    "FPGA-accelerated key search for cold-boot attacks against AES.",
                    "A low power reconfigurable accelerator using a back-gate bias control technique.",
                    "Adaptive compression for instruction code of Coarse Grained Reconfigurable Architectures.",
                    "A non-intrusive portable fault injection framework to assess reliability of FPGA-based designs.",
                    "High-order reconfigurable FIR filter design based on statistical analysis of CSD coefficients.",
                    "Color configuration method for an optically reconfigurable gate array.",
                    "Revisiting the reduction circuit: A case study for simultaneous architecture and precision optimisation.",
                    "EasyPR - An easy usable open-source PR system.",
                    "A hardware implementation of Bag of Words and Simhash for image recognition.",
                    "An FPGA-cluster-accelerated match engine for content-based image retrieval.",
                    "Spatio-Temporally-Shared Reconfigurable Fast Fourier Transform architecture design.",
                    "A high-speed FFT based on a six-step algorithm: Applied to a radio telescope for a solar radio burst.",
                    "A defect-tolerant cluster in a mesh SRAM-based FPGA.",
                    "Reconfigurable filtered acceleration of short read alignment.",
                    "Efficient methods for out-of-order load/store execution for high-performance soft processors.",
                    "Semantics-directed machine architecture in ReWire.",
                    "ZCluster: A Zynq-based Hadoop cluster.",
                    "An open-source SATA core for Virtex-4 FPGAs.",
                    "Direct virtual memory access from FPGA for high-productivity heterogeneous computing.",
                    "Testing reliability techniques for SoCs with fault tolerant CGRA by using live FPGA fault injection.",
                    "Task level pipelining with PEACH2: An FPGA switching fabric for high performance computing.",
                    "Enhancing communication on automotive networks using data layer extensions.",
                    "A prototyping system for hardware distributed objects with diversity of programming languages design and preliminary evaluation.",
                    "Fast simulation of Digital Spiking Silicon Neuron model employing reconfigurable dataflow computing.",
                    "Hardware acceleration for the banded Smith-Waterman algorithm with the cycled systolic array.",
                    "Implementation of a highly scalable blokus duo solver on FPGA.",
                    "From C to Blokus Duo with LegUp high-level synthesis.",
                    "The Liquid Metal Blokus Duo Design.",
                    "FPGA Blokus Duo Solver using a massively parallel architecture.",
                    "Artificial intelligence of Blokus Duo on FPGA using Cyber Work Bench.",
                    "An FPGA-based specific processor for Blokus Duo.",
                    "An implementation of Blokus Duo player on FPGA.",
                    "Correction to \"Graph Minor Approach for Application Mapping on CGRAs\"."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "FPT 2012",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2012",
                "sub_name": "2012 International Conference on Field-Programmable Technology, FPT 2012, Seoul, Korea (South), December 10-12, 2012.",
                "count": 61,
                "papers": [
                    "Rapid RTL-based signal ranking for FPGA prototyping.",
                    "K-way partitioning based packing for FPGA logic blocks without input bandwidth constraint.",
                    "Neural network based pre-placement wirelength estimation.",
                    "Heterogeneous configuration memory scrubbing for soft error mitigation in FPGAs.",
                    "FPGA based memory efficient high resolution stereo vision system for video tolling.",
                    "A task-level OoO framework for heterogeneous systems.",
                    "FPGA-GPU-CPU heterogenous architecture for real-time cardiac physiological optical mapping.",
                    "Managing mutex variables in a cache-coherent shared-memory system for FPGAs.",
                    "FPGA optimized packet-switched NoC using split and merge primitives.",
                    "Parallel dataflow execution for sequential programs on reconfigurable hybrid MPSoCs.",
                    "Guppy: A GPU-like soft-core processor.",
                    "A high speed open source controller for FPGA Partial Reconfiguration.",
                    "Design space exploration and implementation of a high performance and low area Coarse Grained Reconfigurable Processor.",
                    "Small virtual channel routers on FPGAs through block RAM sharing.",
                    "uBRAM-based run-time reconfigurable FPGA and corresponding reconfiguration methodology.",
                    "An FPGA with power-gated switch blocks.",
                    "Design tradeoffs for hard and soft FPGA-based Networks-on-Chip.",
                    "Rule-based data communication optimization using quantitative communication profiling.",
                    "Parametric reconfigurable designs with Machine Learning Optimizer.",
                    "Option space exploration using distributed computing for efficient benchmarking of FPGA cryptographic modules.",
                    "A study of adaptable co-processors for Cyclic Redundancy Check on an FPGA.",
                    "Side-channel resistant AES architecture utilizing randomized composite field representations.",
                    "Resiliency-aware scheduling: Resource allocation for hardened computation on configurable devices.",
                    "FPGA-based design and implementation of an approximate polynomial matrix EVD algorithm.",
                    "Automatic rectification of design errors in complex processors with programmable hardware.",
                    "Verification of streaming hardware and software codesigns.",
                    "iDEA: A DSP block based FPGA soft processor.",
                    "A memory-efficient parallel single pass architecture for connected component labeling of streamed images.",
                    "An energy-efficient, fast FPGA hardware architecture for OpenCV-Compatible object detection.",
                    "A high-performance architecture for training Viola-Jones object detectors.",
                    "A fully-pipelined expectation-maximization engine for Gaussian Mixture Models.",
                    "Software/hardware framework for generating parallel Gaussian random numbers based on the Monty Python method.",
                    "Design considerations of real-time adaptive beamformer for medical ultrasound research using FPGA and GPU.",
                    "Designing a hardware in the loop wireless digital channel emulator for software defined radio.",
                    "Investigation of aging effects in different implementations and structures of programmable routing resources of FPGAs.",
                    "Accelerated evaluation of SEU failure-in-time using frame-based partial reconfiguration.",
                    "Introducing irregularity to routing architecture of structured ASIC for better routability.",
                    "VersaPower: Power estimation for diverse FPGA architectures.",
                    "Pipeline frequency boosting: Hiding dual-ported block RAM latency using intentional clock skew.",
                    "Acceleration of fault attack emulation by consideration of fault propagation.",
                    "Implementation of a volume rendering on coarse-grained reconfigurable multiprocessor.",
                    "Area constraint propagation in high level synthesis.",
                    "A hardware security module for quadrotor communication.",
                    "A new hardware coprocessor for accelerating Notification-Oriented applications.",
                    "VENICE: A compact vector processor for FPGA applications.",
                    "A partially reconfigurable architecture supporting hardware threads.",
                    "Software-managed automatic data sharing for Coarse-Grained Reconfigurable coprocessors.",
                    "Graph minor approach for application mapping on CGRAs.",
                    "Dynamic power control with a heterogeneous multi-core system using a 3-D wireless inductive coupling interconnect.",
                    "Area-time estimation of C-based functions for design space exploration.",
                    "An island-style-routing compatible fault-tolerant FPGA architecture with self-repairing capabilities.",
                    "Streamed high dynamic range imaging.",
                    "SimXMD: Integrated debugging of C code and hardware components.",
                    "Design evaluation of OpenCL compiler framework for Coarse-Grained Reconfigurable Arrays.",
                    "SCC based modulo scheduling for coarse-grained reconfigurable processors.",
                    "ULP-SRP: Ultra low power Samsung Reconfigurable Processor for biomedical applications.",
                    "Efficient performance scaling of future CGRAs for mobile applications.",
                    "ZIP-IO: Architecture for application-specific compression of Big Data.",
                    "Parallelizing sparse LU decomposition on FPGAs.",
                    "Minimizing the error: A study of the implementation of an Integer Split-Radix FFT on an FPGA for medical imaging.",
                    "Low complexity and hardware-friendly spectral modular multiplication."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "FPT 2011",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2011",
                "sub_name": "2011 International Conference on Field-Programmable Technology, FPT 2011, New Delhi, India, December 12-14, 2011.",
                "count": 65,
                "papers": [
                    "Reconfigurable acceleration and dynamic partial self-reconfiguration in general purpose computing.",
                    "A framework for FPGA acceleration of large graph problems: Graphlet counting case study.",
                    "Cool Mega-Array: A highly energy efficient reconfigurable accelerator.",
                    "A self-healing autonomous neural network hardware for trustworthy biomedical systems.",
                    "FPGA implementation of reconfigurable ADPLL network for distributed clock generation.",
                    "A framework for verifying functional correctness in Odin II.",
                    "Floating-point mixed-radix FFT core generation for FPGA and comparison with GPU and CPU.",
                    "An analysis of ring oscillator PUF behavior on FPGAs.",
                    "A low power technology mapping method for Adaptive Logic Module.",
                    "Hydrate: Hybrid Reconfigurable Architecture Expressions.",
                    "A novel architecture for a secure update of cryptographic engines on trusted platform module.",
                    "Interconnect-topology independent mapping algorithm for a Coarse Grained Reconfigurable Architecture.",
                    "VLIW-SCORE: Beyond C for sequential control of SPICE FPGA acceleration.",
                    "Deep pipelined one-chip FPGA implementation of a real-time image-based human detection algorithm.",
                    "Use of embedded FPGA resources in implementations of 14 round 2 SHA-3 candidates.",
                    "Variable and clause elimination in SAT problems using an FPGA.",
                    "Constant power reconfigurable computing.",
                    "An analytical energy model to accelerate FPGA logic architecture investigation.",
                    "Accelerated FPGA architecture design: Capabilities and limitations of analytical models.",
                    "A scalable memory interface for multicore reconfigurable computing systems.",
                    "The realtime image processing demonstration with CMA-1: An ultra low-power reconfigurable accelerator.",
                    "3D implication logic: Preliminary results.",
                    "Enabling high level design of adaptive systems with partial reconfiguration.",
                    "Architecture and tools for programmable QCA.",
                    "A unified emulation/simulation environment for reconfigurable system-on-chip development.",
                    "Exploring FPGA technology mapping for fracturable LUT minimization.",
                    "Automating formal verification of customized soft-processors.",
                    "Operational mode exploration for reconfigurable systems with multiple applications.",
                    "FPGA power consumption measurements and estimations under different implementation parameters.",
                    "Objective-driven workload allocation in heterogeneous computing systems.",
                    "Design methodology for FPGA implementation of lattice piecewise-affine functions.",
                    "Accelerating on-line training of LS-SVM with run-time reconfiguration.",
                    "High speed low complexity FPGA-based FIR filters using pipelined adder graphs.",
                    "Formulation-level design space exploration for partially reconfigurable FPGAs.",
                    "A novel online hardware task scheduling and placement algorithm for 3D partially reconfigurable FPGAs.",
                    "Spiking neural network-based auto-associative memory using FPGA interconnect delays.",
                    "A reconfigurable macro-pipelined systolic accelerator architecture.",
                    "Scrubbing-based SEU mitigation approach for Systems-on-Programmable-Chips.",
                    "Investigation of NBTI and PBTI induced aging in different LUT implementations.",
                    "A novel architecture for a secure update of cryptographic engines on trusted platform module.",
                    "Timing speculation in FPGAs: Probabilistic inference of data dependent failure rates.",
                    "Reducing power for dynamically reconfigurable processor array by reducing number of reconfigurations.",
                    "Partially reconfigurable system-on-chips for adaptive fault tolerance.",
                    "ReSim: A reusable library for RTL simulation of dynamic partial reconfiguration.",
                    "Hardware-accelerated execution of Pi-calculus reconfiguration schedules.",
                    "Design & development of soft-core processor based remote terminal units for nuclear reactors.",
                    "A scalable network port scan detection system on FPGA.",
                    "An adaptive-method for velocity estimation using time-to-digital converter.",
                    "Design methodology for analog circuit designs using proposed field programmable basic analog building blocks.",
                    "Efficient nested loop pipelining in high level synthesis using polyhedral bubble insertion.",
                    "High level synthesis of stereo matching: Productivity, performance, and software constraints.",
                    "Implementation of a Reverse Time Migration kernel using the HCE High Level Synthesis tool.",
                    "Pipelined high precision beamforming delay calculator for ultrasound imaging.",
                    "Compact generic intermediate representation (CGIR) to enable late binding in coarse grained reconfigurable architectures.",
                    "Partial reconfiguration logic synthesis by temporal slicing.",
                    "Hardware module reuse and runtime assembly for dynamic management of reconfigurable resources.",
                    "Efficient key-dependent message authentication in reconfigurable hardware.",
                    "An FPGA-based object detector with dynamic workload balancing.",
                    "Sharing FPUs in many-soft-cores.",
                    "SW and HW co-design of Connect6 accelerator with scalable streaming cores.",
                    "A threat-based Connect6 implementation on FPGA.",
                    "Runtime stress-aware replica placement on reconfigurable devices under safety constraints.",
                    "Efficient region allocation for adaptive partial reconfiguration.",
                    "An FPGA Connect6 Solver with a two-stage pipelined evaluation.",
                    "An FPGA implementation of a threat-based strategy for Connect6."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "FPT 2010",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2010",
                "sub_name": "Proceedings of the International Conference on Field-Programmable Technology, FPT 2010, 8-10 December 2010, Tsinghua University, Beijing, China.",
                "count": 100,
                "papers": [
                    "Reconfigurable computing - evolution of Von Neumann architecture.",
                    "FPGA platforms leading the way in the application of 'more than Moore's' technology.",
                    "Bringing FPGA design to application domain experts.",
                    "Technology issues facing the world's largest integrated circuits.",
                    "In search for better silicon and human efficiency.",
                    "An FPGA architecture supporting dynamically controlled power gating.",
                    "A tiled programmable fabric using QCA.",
                    "Phase-change-memory-based storage elements for configurable logic.",
                    "Dynamic reconfigurable bit-parallel architecture for large-scale regular expression matching.",
                    "Impact of reconfigurable hardware on accelerating MPI_Reduce.",
                    "Accelerating HMMER on FPGA using parallel prefixes and reductions.",
                    "Multiple data set reduction on FPGAs.",
                    "Accelerating FPGA development through the automatic parallel application of standard implementation tools.",
                    "Parallelizing FPGA placement using Transactional Memory.",
                    "A message-passing multi-softcore architecture on FPGA for Breadth-first Search.",
                    "Deterministic multi-core parallel routing for FPGAs.",
                    "The TransC process model and interprocess communication.",
                    "Comparing performance and energy efficiency of FPGAs and GPUs for high productivity computing.",
                    "Local-and-global stall mechanism for systolic computational-memory array on extensible multi-FPGA system.",
                    "Floating-point exponential functions for DSP-enabled FPGAs.",
                    "Modular design of fully pipelined accumulators.",
                    "Efficient implementation of parallel BCD multiplication in LUT-6 FPGAs.",
                    "High performance and memory efficient implementation of matrix multiplication on FPGAs.",
                    "Fine-grained characterization of process variation in FPGAs.",
                    "A stochastic method for security evaluation of cryptographic FPGA implementations.",
                    "Fine-grain fault diagnosis for FPGA logic blocks.",
                    "A robust reconfigurable logic device based on less configuration memory logic cell.",
                    "Compact implementations of BLAKE-32 and BLAKE-64 on FPGA.",
                    "Lightweight DPA resistant solution on FPGA to counteract power models.",
                    "An FPGA-based text search engine for approximate regular expression matching.",
                    "Real-time detection of line segments on FPGA.",
                    "True random number generation in block memories of reconfigurable devices.",
                    "Obstacle-free two-dimensional online-routing for run-time reconfigurable FPGA-based systems.",
                    "The effect of multi-bit based connections on the area efficiency of FPGAs utilizing unidirectional routing resources.",
                    "ATB: Area-Time response Balancing algorithm for scheduling real-time hardware tasks.",
                    "Dynamic scheduling Monte-Carlo framework for multi-accelerator heterogeneous clusters.",
                    "Multi-dimensional packet classification on FPGA: 100 Gbps and beyond.",
                    "Automatic synthesis of processor arrays with local memories on FPGAs.",
                    "GVE: Godson-T Verification Engine for many-core architecture rapid prototyping and debugging.",
                    "Synthesis of a unified unit for evaluating an application-specific set of elementary functions.",
                    "A compression method for inverted index and its FPGA-based decompression solution.",
                    "FPGA implementation of GZIP compression and decompression for IDC services.",
                    "Application-specific hardware accelerator for implementing recursive sorting algorithms.",
                    "Towards an embedded biologically-inspired machine vision processor.",
                    "Wireless sensors networks emulator implemented on a FPGA.",
                    "A novel FPGA-based SVM classifier.",
                    "High-throughput IP-lookup supporting dynamic routing tables using FPGA.",
                    "A novel design flow for tamper-resistant self-healing properties of FPGA devices without configuration readback capability.",
                    "A novel HDL coding style to reduce power consumption for reconfigurable devices.",
                    "Wire congestion aware synthesis for a dynamically reconfigurable processor.",
                    "A FPGA implementation of the two-dimensional Digital Huygens' Model.",
                    "Reconfigurable Number Theoretic Transform architectures for cryptographic applications.",
                    "An FPGA chip identification generator using configurable ring oscillator.",
                    "FPGA implementation of an interior point solver for linear model predictive control.",
                    "General switch box modeling and optimization for FPGA routing architectures.",
                    "Efficient hardware task reuse and interrupt handling mechanisms for FPGA-based partially reconfigurable systems.",
                    "A debugging method for repairing post-silicon bugs of high performance processors in the fields.",
                    "Integration of PSoC technology with educational robotics.",
                    "A graphical programming and design environment for FPGA-based hardware.",
                    "Using partial reconfiguration and high-level models to accelerate FPGA design validation.",
                    "FPGA-based video processing for a vision prosthesis.",
                    "Reducing power consumption for Dynamically Reconfigurable Processor Array with Partially Fixed Configuration Mapping.",
                    "Rapid prototyping tools for FPGA designs: RapidSmith.",
                    "VMODEX: A visualization tool for multi-objective Design Space Exploration.",
                    "Advanced partial run-time reconfiguration on Spartan-6 FPGAs.",
                    "Mapping real-life applications on run-time reconfigurable NoC-based MPSoC on FPGA.",
                    "Design space exploration for sparse matrix-matrix multiplication on FPGAs.",
                    "Accelerating FPGA design space exploration using circuit similarity-based placement.",
                    "Structured ASIC: Methodology and comparison.",
                    "OpenPipes: Making distributed hardware systems easier.",
                    "Design space exploration of instruction schedulers for out-of-order soft processors.",
                    "An area-efficient dynamically reconfigurable Spatial Division Multiplexing network-on-chip with static throughput guarantee.",
                    "A VLIW softcore processor with dynamically adjustable issue-slots.",
                    "An FPGA implementation of full-search variable block size motion estimation.",
                    "A multiported register file with register renaming for configurable softcore VLIW processors.",
                    "A configurable framework for investigating workload execution.",
                    "Performance estimation framework for FPGA-based processors.",
                    "Evaluation of FPGA design guardband caused by inhomogeneous NBTI degradation considering process variations.",
                    "Efficient implementation of greyscale morphological filters.",
                    "A many processing element framework for the Discrete Fourier Transform.",
                    "Acceleration of control flow on CGRA using advanced predicated execution.",
                    "Efficient implementation of CIOQ switches with sequential iterative matching algorithms.",
                    "On identifying and optimizing instruction sequences for dynamic compilation.",
                    "A datapath classification method for FPGA-based scientific application accelerator systems.",
                    "Efficient custom instructions generation for system-level design.",
                    "Histogram-based probability density function estimation on FPGAs.",
                    "A parallel FPGA design of the Smith-Waterman traceback.",
                    "Routing optimizations for component-based system design and partial run-time reconfiguration on FPGAs.",
                    "Solving Sudokus through an incidence matrix on an FPGA.",
                    "GE3: A single FPGA client-server architecture for Golomb Ruler derivation.",
                    "An FPGA-based scalable platform for high-speed malware collection in large IP networks.",
                    "FPGA based soft-core SIMD processing: A MIMO-OFDM Fixed-Complexity Sphere Decoder case study.",
                    "A deeply pipelined and parallel architecture for denoising medical images.",
                    "SEU tolerant SRAM for FPGA applications.",
                    "Convex models for accelerating applications on FPGA-based clusters.",
                    "A 64-context MEMS optically reconfigurable gate array.",
                    "Minimalistic architecture for reconfigurable audio Beamforming.",
                    "FPGA implementation of a strong Reversi player.",
                    "Othello Solver based on a soft-core MIMD processor array.",
                    "CarlOthello : An FPGA-Based Monte Carlo Othello player."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "FPT 2009",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2009",
                "sub_name": "Proceedings of the 2009 International Conference on Field-Programmable Technology, FPT 2009, Sydney, Australia, December 9-11, 2009.",
                "count": 21,
                "papers": [
                    "Packets everywhere: The great opportunity for field programmable technology.",
                    "From dynamic reconfiguration to self-reconfiguration: Invasive algorithms and architectures.",
                    "ASKAP beamformer.",
                    "Design of a Vehicle-to-Vehicle communication system on reconfigurable hardware.",
                    "Implementation of a foveal vision mapping.",
                    "An architecture of optimised SIFT feature detection for an FPGA implementation of an image matcher.",
                    "Exploiting memory customization in FPGA for 3D stencil computations.",
                    "Towards a balanced ternary FPGA.",
                    "Concurrently optimizing FPGA architecture parameters and transistor sizing: Implications for FPGA design.",
                    "Simulation of a QCA-based CLB and a multi-CLB application.",
                    "A flexible DSP block to enhance FPGA arithmetic performance.",
                    "VMATCH: Using logical variation to counteract physical variation in bottom-up, nanoscale systems.",
                    "PGR: Period and glitch reduction via clock skew scheduling, delay padding and GlitchLess.",
                    "A detailed delay path model for FPGAs.",
                    "Leakage power reduction for coarse-grained dynamically reconfigurable processor arrays using Dual Vt cells.",
                    "ASIF: Application Specific Inflexible FPGA.",
                    "The challenges of using an embedded MPI for hardware-based processing nodes.",
                    "Transforming write collisions in block RAMs into security applications.",
                    "FPGA implementation of an invasive computing architecture.",
                    "FFPU: Fractured floating point unit for FPGA soft processors.",
                    "Rapid synthesis and simulation of computational circuits in an MPPA."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "FPT 2008",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2008",
                "sub_name": "2008 International Conference on Field-Programmable Technology, FPT 2008, Taipei, Taiwan, December 7-10, 2008.",
                "count": 68,
                "papers": [
                    "Re-visiting the challenges of programmable concurrent architectures.",
                    "FPGA timing, power, signal integrity and other challenges at 65 and 45 nm.",
                    "FPGA design productivity a discussion of the state of the art and a research agenda.",
                    "Co-optimisation of datapath and memory in outer loop pipelining.",
                    "Wave-pipelined signaling for on-FPGA communication.",
                    "Portable and scalable FPGA-based acceleration of a direct linear system solver.",
                    "A system-level stochastic circuit generator for FPGA architecture evaluation.",
                    "An FPGA-specific approach to floating-point accumulation and sum-of-products.",
                    "Optimizing residue arithmetic on FPGAs.",
                    "Reconfigurable array for transcendental functions calculation.",
                    "Optimizing coarse-grained units in floating point hybrid FPGA.",
                    "Hardware acceleration of approximate palindromes searching.",
                    "PERG: A scalable FPGA-based pattern-matching engine with consolidated Bloomier filters.",
                    "Design and implementation of a high performance financial Monte-Carlo simulation engine on an FPGA supercomputer.",
                    "Estimation of sample mean and variance for Monte-Carlo simulations.",
                    "Reducing latency times by accelerated routing mechanisms for an FPGA gateway in the automotive domain.",
                    "A transition probability based delay measurement method for arbitrary circuits on FPGAs.",
                    "A profiler for a heterogeneous multi-core multi-FPGA system.",
                    "Defining neighborhood relations for fast spatial-temporal partitioning of applications on reconfigurable architectures.",
                    "Accelerating hardware simulation: Testbench code emulation.",
                    "Exploring the optimal size for multicasting configuration data of dynamically reconfigurable processors.",
                    "A scalable reconfiguration mechanism for fast dynamic reconfiguration.",
                    "Memory security management for reconfigurable embedded systems.",
                    "ACS: An Addressless Configuration Support for efficient partial reconfigurations.",
                    "An adaptive pattern recognition hardware with on-chip shift register-based partial reconfiguration.",
                    "A run-length based connected component algorithm for FPGA implementation.",
                    "Optimised single pass connected components analysis.",
                    "Exploiting memory hierarchy for a Computational Fluid Dynamics accelerator on FPGAs.",
                    "FPGA implementation and analysis of random delay insertion countermeasure against DPA.",
                    "Netlist-level IP protection by watermarking for LUT-based FPGAs.",
                    "Modelling and compensating for clock skew variability in FPGAs.",
                    "Kernel sharing on reconfigurable multiprocessor systems.",
                    "Evaluating the impact of customized instruction set on coarse grained reconfigurable arrays.",
                    "Balanced allocation of compute time in hardware-accelerated systems.",
                    "Processor customization for wearable bio-monitoring platforms.",
                    "An implementation of a watershed algorithm based on connected components on FPGA.",
                    "A new flexible PR domain model to replace the fixed multi-PR region model for DPR systems.",
                    "Exploring hard and soft networks-on-chip for FPGAs.",
                    "An approach for downscaling images for real-time pattern detection.",
                    "Dynamically programmable Reed Solomon processor with embedded Galois Field multiplier.",
                    "Evaluation of compact high-throughput reconfigurable architecture based on bit-serial computation.",
                    "Synthesis of efficiently reconfigurable datapaths for reconfigurable computing.",
                    "Makespan minimization in automatic synthesis of multiprocessor systems from parallel programs.",
                    "A new coarse-grained FPGA architecture exploration environment.",
                    "An analog reconfiguration-period adjustment technique for optically reconfigurable gate arrays.",
                    "An 11, 424-gate dynamic optically reconfigurable gate array VLSI.",
                    "A systolic regular expression pattern matching engine and its application to network intrusion detection.",
                    "Evaluating power and energy consumption of FPGA-based custom computing machines for scientific floating-point computation.",
                    "A dynamically reconfigurable Field Programmable Gate Array hardware foundation for security applications.",
                    "Quad-level bit-stream signal processing on FPGAs.",
                    "A low power reconfigurable heterogeneous architecture for a mobile SDR system.",
                    "High level quantitative interconnect estimation for Early Design Space Exploration.",
                    "Unrolling-based loop mapping and scheduling.",
                    "Concurrent timing based and routability driven depopulation technique for FPGA packing.",
                    "Leakage power reduction for coarse grained dynamically reconfigurable processor arrays with fine grained Power Gating technique.",
                    "Extending Booth algorithm to multiplications of three numbers on FPGAs.",
                    "A scalable FPGA architecture for non-linear SVM training.",
                    "A low memory bandwidth Gaussian mixture model (GMM) processor for 20, 000-word real-time speech recognition FPGA system.",
                    "Creating digital fingerprints on commercial field programmable gate arrays.",
                    "An area-efficient FPGA realisation of a codebook-based image compression method.",
                    "A floating-point solver for band structured linear equations.",
                    "Efficient FPGA elliptic curve cryptographic processor over GF(2m).",
                    "An on-chip testbed that emulates runtime traffic and reduces design verification time for FPGA designs.",
                    "Delay evaluation of 90nm CMOS multi-context FPGA with shift-register-type temporal communication module for large-scale circuit emulation.",
                    "p-VEX: A reconfigurable and extensible softcore VLIW processor.",
                    "Automatic generation of decomposition based matrix inversion architectures.",
                    "Inversion/non-inversion zero-overhead dynamic optically reconfigurable gate array VLSI.",
                    "Real-time FPGA architecture of extended linear convolution for digital image scaling."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "FPT 2007",
        "info": "Kitakyushu, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2007",
                "sub_name": "2007 International Conference on Field-Programmable Technology, ICFPT 2007, Kitakyushu, Japan, December 12-14, 2007.",
                "count": 69,
                "papers": [
                    "Power and the Future FPGA Architectures.",
                    "GRAPE-DR Project: a combination of peta-scale computing and high-speed networking.",
                    "Memory Footprint Reduction for FPGA Routing Algorithms.",
                    "SOC implementation of wave-pipelined circuits.",
                    "Self-characterization of Combinatorial Circuit Delays in FPGAs.",
                    "FPGA Cluster Computing in the ETA Radio Telescope.",
                    "FPGA-based Accelerator Design for RankBoost in Web Search Engines.",
                    "Asymmetric Multi-Processor Architecture for Reconfigurable System-on-Chip and Operating System Abstractions.",
                    "Design and Implementation of an FPGA Architecture for High-Speed Network Feature Extraction.",
                    "Architecting Hard Crossbars on FPGAs and Increasing their Area Efficiency with Shadow Clusters.",
                    "A Method and FPGA Architecture for Real-Time Polymorphic Reconfiguration.",
                    "Reconfigurable Functional Units for Scientific Superscalar Processors.",
                    "A Coarse Grained Reconfigurable Architecture for Variable Block Size Motion Estimation.",
                    "Instrumented Multi-Stage Word-Length Optimization.",
                    "A Domain Specific Language for Reconfigurable Path-based Monte Carlo Simulations.",
                    "Fused-Arithmetic Unit Generation for Reconfigurable Devices using Common Subgraph Extraction.",
                    "Unifying FPGA Hardware Development.",
                    "Applying Cuckoo Hashing for FPGA-based Pattern Matching in NIDS/NIPS.",
                    "High Performance Hardware Implementation of SpikeProp Learning: Potential and Tradeoffs.",
                    "The Image Forest Transform Architecture.",
                    "A Highly Parallel FPGA based IEEE-754 Compliant Double-Precision Binary Floating-Point Multiplication Algorithm.",
                    "TAS-MRAM based Non-volatile FPGA logic circuit.",
                    "Bitstream Decompression for High Speed FPGA Configuration from Slow Memories.",
                    "Dynamic Intellectual Property Protection for Reconfigurable Devices.",
                    "Hardware/Software Co-design of a General-Purpose Computation Platform in Particle Physics.",
                    "Efficient and High-Throughput Implementations of AES-GCM on FPGAs.",
                    "A Framework for Implementing a Network-Based Stochastic Biochemical Simulator on an FPGA.",
                    "An Approach for Applying Large Filters on Large Images using FPGA.",
                    "Run-Time Management of Reconfigurable Hardware Tasks Using Embedded Linux.",
                    "Implementations of Reconfigurable Logic Arrays on FPGAs.",
                    "Net Length based Routability Driven Packing.",
                    "FPGA-based Streaming Computation for Lattice Boltzmann Method.",
                    "Reconfigurable Hardware Module Sequencer - A Tradeoff Between Networked and Data Flow Architectures.",
                    "An Embedded Reconfigurable Logic Core based on Variable Grain Logic Cell Architecture.",
                    "Improving Bounds for FPGA Logic Minimization.",
                    "Floating-Point Matrix Multiplication in a Polymorphic Processor.",
                    "A Secure Digital Content Delivery System Based on Partially Reconfigurable Hardware.",
                    "Productivity of High-Level Languages on Reconfigurable Computers: An HPC Perspective.",
                    "A Systolic Algorithm for the Quadratic Assignment Problem and its FPGA Implementation.",
                    "Reconfiguration performance analysis of a dynamic optically reconfigurable gate array architecture.",
                    "Efficient Mesh of Tree Interconnect for FPGA Architecture.",
                    "Overwrite Configuration Technique in Multicast Configuration Scheme for Dynamically Reconfigurable Processor Arrays.",
                    "An FPGA Based Travelling-Wave Fault Location System.",
                    "NICFlex: A Functional Verification Accelerator for An RTL NIC Design.",
                    "A Power Configurable Block Array Connected in Series as First Prototype Flex Power FPGA Chip.",
                    "Optimal Buffering of FPGA Interconnect for Expected Delay Optimization.",
                    "FPGA-Based 3-D engine for high-speed 3-D measurement based on light-section method.",
                    "A 62.5 ns holographic reconfiguration of an optically differential reconfigurable gate array.",
                    "Recursive Variable Expansion: A Loop Transformation for Reconfigurable Systems.",
                    "A Rapid Prototyping of Real-Time Pattern Generator for Step-and-Scan Lithography Using Digital Micromirror Device.",
                    "High Performance Software-Hardware Network Intrusion Detection System.",
                    "A Domain-Specific Dynamically Reconfigurable Hardware Platform for Wireless Sensor Networks.",
                    "FPGA Implementation of a Statically Reconfigurable Java Environment for Embedded Systems.",
                    "A Dynamically Reconfigurable Architecture Combining Pixel-Level SIMD and Operation-Pipeline Modes for High Frame Rate Visual Processing.",
                    "A Balanced Vector-Quantization Processor Eliminating Redundant Calculation for Real-Time Motion Picture Compression.",
                    "Real-Time Segmentation of Color Images based on the K-means Clustering on FPGA.",
                    "A Portable Memory Access Framework on Reconfigurable Computers.",
                    "The Spiral Search: A Linear Complexity Algorithm for the Generation of Convex MIMO Instruction-Set Extensions.",
                    "A Case for Soft Vector Processors in FPGAs.",
                    "A Portable Co-Verification System Which Generates Testbench Automatically.",
                    "Multiply Accumulate Unit Optimised for Fast Dot-Product Evaluation.",
                    "A Novel Network Architecture Support for Fast Reconfiguration.",
                    "A Mapping Method for Multi-Process Execution on Dynamically Reconfigurable Processors.",
                    "A Programmable Load/Store Unit on C-based Hardware Design for FPGA.",
                    "An efficient FPGA-based implementation of Pollard's (ρ - 1) factorization algorithm.",
                    "A Novel Asynchronous e-FPGA Architecture for Security Applications.",
                    "A Multiprocessor System-on-Chip Implementation of a Laser-based Transparency Meter on an FPGA.",
                    "Compound Uniform Random Number Generators with On-Chhip Correlation and Distribution Measurements.",
                    "Exploiting Slack Time in Dynamically Reconfigurable Processor Architectures."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "FPT 2006",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2006",
                "sub_name": "2006 IEEE International Conference on Field Programmable Technology, FPT 2006, Bangkok, Thailand, December 13-15, 2006.",
                "count": 70,
                "papers": [
                    "Invited Keynote 1: Closing the gap between FPGAs and ASICs.",
                    "Invited Keynote 2: Applications of programmable logic in modern particle physics experiments.",
                    "Enhancing the area-efficiency of FPGAs with hard circuits using shadow clusters.",
                    "Granularity aspects for the design of multi-level reconfigurable architectures.",
                    "Evaluation of granularity on threshold voltage control in flex power FPGA.",
                    "Robust and real-time automatic target recognition using partial hausdorff distance measure on reconfigurable hardware.",
                    "Inversion-based hardware gaussian random number generator: A case study of function evaluation via hierarchical segmentation.",
                    "Seed-based genomic sequence comparison using a FPGA/FLASH accelerator.",
                    "An FPGA implementation of the simplex algorithm.",
                    "On-line scheduling of real-time tasks for reconfigurable computing system.",
                    "Efficient algorithm for functional scheduling in hardware/software co-design.",
                    "Generating hardware from OpenMP programs.",
                    "Reconfigurable FLUX networks.",
                    "Interconnect driver design for long wires in field-programmable gate arrays.",
                    "Within-die delay variability in 90nm FPGAs and beyond.",
                    "A highly parameterizable parallel processor array architecture.",
                    "Optimizing the critical loop in the H.264/AVC CABAC decoder.",
                    "Regular expression matching for reconfigurable packet inspection.",
                    "Automated design space exploration of FPGA-based FFT architectures based on area and power estimation.",
                    "Sigma-delta based clock recovery using on-chip PLL in FPGA.",
                    "A hardware cache memcpy accelerator.",
                    "A novel memory architecture for elliptic curve cryptography with parallel modular multipliers.",
                    "Memory support design for LU decomposition on the starbridge hyper-computer.",
                    "FPGA-based MSB-first bit-serial variable block size motion estimation processor.",
                    "FPGA accelerated tate pairing based cryptosystems over binary fields.",
                    "A comparison of 2-D discrete wavelet transform computation schedules on FPGAs.",
                    "Perturber: semi-synthetic circuit generation using ancestor control for testing incremental place and route.",
                    "Multithreaded virtual-memory-enabled reconfigurable hardware accelerators.",
                    "FPGA core watermarking based on power signature analysis.",
                    "FPGA acceleration of the tate pairing in characteristic 2.",
                    "FADES: a fault emulation tool for fast dependability assessment.",
                    "An adaptive frequency control method using thermal feedback for reconfigurable hardware applications.",
                    "FPGA implementation of a fuzzy controller for automobile DC-DC converters.",
                    "An adaptive and predictive architecture for parameterised PIV algorithms.",
                    "A real time programmable encoder for low density parity check code targeting a reconfigurable instruction cell architecture.",
                    "Summarizing a time-sensitive control-flow checking monitoring for multitask systems-on-chip.",
                    "Activity-based power estimation and characterization of DSP and multiplier blocks in FPGAs.",
                    "Implementation of a real-time multiple input multiple output channel estimator on the smart antenna software radio test system platform using the Xilinx Virtex 2 Pro Field Programmable Gate Array.",
                    "Efficient management of custom instructions for run-time reconfigurable instruction set processors.",
                    "FPGA implementation for an iris biometric processor.",
                    "FPGA implementation of tabu search for the quadratic assignment problem.",
                    "Minimizing peak power for application chains on architectures with partial dynamic reconfiguration.",
                    "Hardware join Java: a unified hardware/software language for dynamic partial runtime reconfigurable computing applications.",
                    "An FPGA based generic prototyping platform employed in a CMOS laser Doppler blood flow camera.",
                    "An adaptive Viterbi decoder on the dynamically reconfigurable processor.",
                    "PowerBit - power aware arithmetic bit-width optimization.",
                    "Combining hardware reconfiguration and adaptive computation for a novel SoC design methodology.",
                    "Hardware channel model for ultra wideband systems.",
                    "A leakage aware design methodology for power-gated programmable architectures.",
                    "A C compiler for implementing FPGA based bit-serial DSP systems.",
                    "Performance evaluations of ReconfigME.",
                    "Power estimation of a LUT-based MPGA.",
                    "An FPGA-based floating-point processor array supporting a high-precision dot product.",
                    "Communications infrastructure generation for modular FPGA reconfiguration.",
                    "Fuzzy modular multiplication architecture and low complexity IPR-protection for FPGA technology.",
                    "Optimal set of body bias voltages for an FPGA with field-programmable Vth components.",
                    "The cost of data dependence in motion vector estimation for reconfigurable platforms.",
                    "Comparing floating-point and logarithmic number representations for reconfigurable acceleration.",
                    "Dynamically reconfigurable protocol transducer.",
                    "Optimal temporal partitioning based on slowdown and retiming.",
                    "Modeling of glitch effects in FPGA based arithmetic circuits.",
                    "Design and validation of execution schemes for dynamically reconfigurable architectures.",
                    "Periodic licensing of FPGA based intellectual property.",
                    "A performance-driven circuit bipartitioning algorithm for multi-FPGA implementation with time-multiplexed I/Os.",
                    "A statistical framework for dimensionality reduction implementation in FPGAs.",
                    "Hardalign: a parallel pairwise alignment hardware application.",
                    "Decoy circuits for FPGA design protection.",
                    "Hardware architectures for Monte-Carlo based financial simulations.",
                    "Customizable FPGA-based architecture for video applications in real time.",
                    "Super fast hardware string matching."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "FPT 2005",
        "info": "Singagore",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2005",
                "sub_name": "Proceedings of the 2005 IEEE International Conference on Field-Programmable Technology, FPT 2005, 11-14 December 2005, Singapore.",
                "count": 62,
                "papers": [
                    "A custom instruction approach for hardware and software implementations of finite field arithmetic over F263 using Gaussian normal bases.",
                    "High-Radix Systolic Modular Multiplication on Reconfigurable Hardware.",
                    "Pipelining Saturated Accumulation.",
                    "A Parameterized Floating-Point Exponential Function for FPGAs.",
                    "The Erlangen Slot Machine: Increasing Flexibility in FPGA-Based Reconfigurable Platforms.",
                    "Task Placement for Heterogeneous Reconfigurable Architectures.",
                    "A Framework for Dynamic Resource Assignment and Scheduling on Reconfigurable Mixed-Mode On-Chip Multiprocessors.",
                    "High Quality Uniform Random Number Generation Through LUT Optimised Linear Recurrences.",
                    "Solving the Minimum Dominating Set Problem with Instance-Specific Hardware on FPGAs.",
                    "Custom Hardware Architectures for Posture Analysis.",
                    "Correlation-Based Fingerprint Matching Using FPGAs.",
                    "A Single-Chip FPGA Implementation of Real-Time Adaptive Background Model.",
                    "FPGA-Based Hardware for Physical Modelling Sound Synthesis by Finite Difference Schemes.",
                    "Have GPUs Made FPGAs Redundant in the Field of Video Processing?",
                    "S5: The Architecture and Development Flow of a Software Configurable Processor.",
                    "RoMultiC: Fast and Simple Configuration Data Multicasting Scheme for Coarse Grain Reconfigurable Devices.",
                    "Pipeline Scheduling for Array Based Reconfigurable Architectures Considering Interconnect Delays.",
                    "High-Speed Hardware Architectures of the Whirlpool Hash Function.",
                    "Secure Partial Reconfiguration of FPGAs.",
                    "An Adaptive Cryptographic Accelerator for IPsec on Dynamically Reconfigurable Processor.",
                    "Dynamic Voltage Scaling for Commercial FPGAs.",
                    "FPGA Architecture for Standby Power Management.",
                    "FPGA Defect Tolerance: Impact of Granularity.",
                    "A Dynamically Reconfigured UMTS Multi-Channel Complex Code Matched Filter.",
                    "Prototyping Automatic Cloud Cover Assessment (ACCA) Algorithm for Remote Sensing On-Board Processing on a Reconfigurable Computer.",
                    "Reconfigurable Acceleration for Monte Carlo Based Financial Simulation.",
                    "Accelerating FPGA Routing Using Architecture-Adaptive A* Techniques.",
                    "Compiler-Directed Design Space Exploration for Caching and Prefetching Data in High-Level Synthesis.",
                    "Post-Silicon Debug Using Programmable Logic Cores.",
                    "FPGA Organization for the Fast Path-Based Neural Branch Predictor.",
                    "FPGA Implementation of an Excitatory and Inhibitory Connectionist Model for Motion Perception.",
                    "Spatiotemporal Simulation of a Single Living Cell.",
                    "Dynamic Loading of Peripherals on Reconfigurable System-on-Chip.",
                    "An FPGA Model for Developing Dynamic Circuit Computing.",
                    "ADH: An Aspect Described Hardware Programming Language.",
                    "From TLM to FPGA: Rapid Prototyping with SystemC and Transaction Level Modeling.",
                    "Rapid Reconfiguration of an Optically Differential Reconfigurable Gate Array with Pulse Lasers.",
                    "Hardware-Accelerated SSH on Self-Reconfigurable Systems.",
                    "A Fast and Efficient FPGA-Based Implementation for Solving a System of Linear Interval Equations.",
                    "Heuristics for Context-Caches in 2-Level Reconfigurable Architectures.",
                    "Performance of Sorting Algorithms on the SRC 6 Reconfigurable Computer.",
                    "A Zero-Overhead Dynamic Optically Reconfigurable Gate Array.",
                    "The Transmogrifier-4: An FPGA-Based Hardware Development System with Multi-Gigabyte Memory Capacity and High Host and Memory Bandwidth.",
                    "High Performance Channel Model Hardware Emulator for 802.11n.",
                    "HW/SW Interface Synthesis Based on Avalon Bus Specification for Nios-Oriented SoC Design.",
                    "A Reconfigurable Architecture for Implementing Multiple Cipher Algorithms.",
                    "Low Latency Elliptic Curve Cryptography Accelerators for NIST Curves Over Binary Fields.",
                    "A System-Level Design Methodology for Reconfigurable Computing Applications.",
                    "Optimal FFT Architecture Selection for OFDM Receivers on FPGA.",
                    "An FPGA-Based Infant Monitoring System.",
                    "FPGA-Based Conformance Testing and System Prototyping of an MPEG-4 SA-DCT Hardware Accelerator.",
                    "FPGA Core Network Implementation and Optimization: A Case Study.",
                    "A State-Serial Viterbi Decoder Architecture for Digital Radio on FPGA.",
                    "A Design Methodology to Generate Dynamically Self-Reconfigurable SoCs for Virtex-II Pro FPGAs.",
                    "Implementation of Gabor-Type Filters on Field Programmable Gate Arrays.",
                    "A Scaleable FFT/IFFT Kernel for Communication Systems Using Codesign Approach.",
                    "FPGA Based Router for Cognitive Packet Networks.",
                    "An Overview of High-Level Synthesis of Multiprocessors for Logic Programming.",
                    "Implementation of EAX Mode of Operation for FPGA Bitstream Encryption and Authentication.",
                    "Net Power Directed Clustering Algorithm for Low Net-Power Implementation of FPGAs.",
                    "The Design of Scalable Stochastic Biochemical Simulator on FPGA.",
                    "Designing an FPGA SoC Using a Standardized IP Block Interface."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "FPT 2004",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2004",
                "sub_name": "Proceedings of the 2004 IEEE International Conference on Field-Programmable Technology, Brisbane, Australia, December 6-8, 2004.",
                "count": 81,
                "papers": [
                    "Programming a hyper-programmable architecture for networked systems.",
                    "Self-recovery experiments in extreme environments using a field programmable transistor array.",
                    "Field programmable gate array implementation of a generalized decoder for structured low-density parity check codes.",
                    "Partial character decoding for improved regular expression matching in FPGAs.",
                    "Interconnect architectures for modulo-scheduled coarse-grained reconfigurable arrays.",
                    "Directional and single-driver wires in FPGA interconnect.",
                    "A greedy algorithm for tolerating defective crosspoints in nanoPLA design.",
                    "SHAPER: synthesis for hybrid FPGAs containing PLAs using reconvergence analysis.",
                    "Placement and routing for non-rectangular embedded programmable logic cores in SoC design.",
                    "QuickRoute: a fast routing algorithm for pipelined architectures.",
                    "An FPGA-based Othello endgame solver.",
                    "Real-time detection of line segments using the line Hough transform.",
                    "gNBX - reconfigurable hardware acceleration of self-organizing maps.",
                    "Evolvability and reconfigurability.",
                    "A gate-level model for morphogenetic evolvable hardware.",
                    "A novel CLB architecture to detect and correct SEU in LUTs of SRAM-based FPGAs.",
                    "Using multi-bit logic blocks and automated packing to improve field-programmable gate array density for implementing datapath circuits.",
                    "Stream applications on the dynamically reconfigurable processor.",
                    "Compiler reuse analysis for the mapping of data in FPGAs with RAM blocks.",
                    "Memory optimisations for high-resolution imaging.",
                    "On the placement and granularity of FPGA configurations.",
                    "Adaptive range reduction for hardware function evaluation.",
                    "A scalable hardware architecture for prime number validation.",
                    "Coarsely integrated operand scanning (CIOS) architecture for high-speed Montgomery modular multiplication.",
                    "Programmable parallel coprocessor architectures for reconfigurable system-on-chip.",
                    "Windows CE for a reconfigurable system-on-a-chip processor.",
                    "EXPRESS-1: a dynamically reconfigurable platform using embedded processor FPGA.",
                    "Migrating software to hardware on FPGAs.",
                    "The Quartus University Interface Program: enabling advanced FPGA research.",
                    "Maximizing system performance: using reconfigurability to monitor system communications.",
                    "Using function folding to improve silicon efficiency of reconfigurable arithmetic arrays.",
                    "Low FPGA area multiplier blocks for full parallel FIR filters.",
                    "Pipelining designs with loop-carried dependencies.",
                    "Reconfigurable hardware implementation of mesh routing in number field sieve factorization.",
                    "Fast architectures for FPGA-based implementation of RSA encryption algorithm.",
                    "Single-chip FPGA implementation of a cryptographic co-processor.",
                    "Reconfigurable implementation of bit-parallel multipliers over GF(2m) for two classes of finite fields.",
                    "Extended genetic algorithm for codesign optimization of DSP systems in FPGAs.",
                    "FPGA implementation of hierarchical memory architecture for network processors.",
                    "Evaluating software and hardware implementations of signal-processing tasks in an FPGA.",
                    "A scalable architecture for elliptic curve point multiplication.",
                    "An FPGA based prototyping platform for imager-on-chip applications.",
                    "Compact iterative FPGA Camellia algorithm implementations.",
                    "An adaptive Viterbi decoder based on FPGA dynamic reconfiguration technology.",
                    "Single bit error correction implementation in CRC-16 on FPGA.",
                    "Pre-silicon prototyping of a unified hardware architecture for cryptographic manipulation detection codes.",
                    "FPGA-acceleration of cone-beam reconstruction for the X-ray CT.",
                    "Interface adaptor logic - a new model for interfacing peripherals in IP based designs.",
                    "FPGA implementation of digital upconversion using distributed arithmetic FIR filters.",
                    "FPGA implementation of a phased array DBF using polyphase filters.",
                    "FPGA design of HECC coprocessors.",
                    "A tsume-shogi processor based on reconfigurable hardware.",
                    "An approach to realize time-sharing of flip-flops in time-multiplexed FPGAs.",
                    "A parameterizable HandelC divider generator for FPGAs with embedded hardware multipliers.",
                    "Reconfigurable I/O interface for mobile equipments.",
                    "Domain specific reconfigurable fabric targeting Viterbi algorithm.",
                    "A new architecture of field programmable analog arrays for reconfigurable instantiation of continuous-time filters.",
                    "RTOS acceleration on soft-core processors using instruction set customization.",
                    "A rapid prototyping framework for audio signal processing algorithms.",
                    "Cyclic reconfiguration for pipelined applications on coarse-grain reconfigurable circuits.",
                    "Achieving wide frequency range in an analog FPGA.",
                    "3D graphics accelerator platform for mobile devices.",
                    "Retiming aware clustering for sequential circuits.",
                    "A scalable and pipelined FPGA implementation of an OC192 WF scheduler.",
                    "Wavelet spectral dimension reduction of hyperspectral imagery on a reconfigurable computer.",
                    "Architectures for ICT on FPGA.",
                    "Design of an imaging system based on FPGA technology and CMOS imager.",
                    "Study on column wise design compaction for reconfigurable systems.",
                    "Memory specification for reconfigurable computing synthesis tools.",
                    "Run-time mapping of applications to a heterogeneous reconfigurable tiled system on chip architecture.",
                    "An FPGA implementation of a modified version of RED algorithm.",
                    "A new reconfigurable architecture with smart data-transfer subsystems for the intelligent image processing.",
                    "FPGA architecture extensions for preemptive multitasking and hardware defragmentation.",
                    "Implementation of a flexible RAKE receiver in heterogeneous reconfigurable hardware.",
                    "An improved Montgomery modular inversion targeted for efficient implementation on FPGA.",
                    "Hardware/software co-simulation environment for CSoC with soft processors.",
                    "FPGA implementation of spiking neural networks - an initial step towards building tangible collaborative autonomous agents.",
                    "Effective system and performance benchmarking for reconfigurable computers.",
                    "Scalable structured data access by combining autonomous memory blocks.",
                    "An investigation into the design of high-performance shared buffer architectures based on FPGA technology with embedded memory.",
                    "Switch-box design for synthesizable coarse-grain arrays for system-on-chip applications."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "FPT 2003",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2003",
                "sub_name": "Proceedings of the 2003 IEEE International Conference on Field-Programmable Technology, Tokyo, Japan, FPT 2003, December 15-17, 2003.",
                "count": 76,
                "papers": [
                    "A reconfigurable future.",
                    "Seamless top-down flow for quick trial of HW/SW co-design.",
                    "Networking on chip with platform FPGAs.",
                    "FPGA-based high-speed emulator of quantum computing.",
                    "High resolution ADPLL frequency synthesizer for FPGA-and ASIC-based applications.",
                    "Improved SVD systolic array and implementation on FPGA.",
                    "An implementation of the Rijndael on Async-WASMII.",
                    "Modular exponentiation using parallel multipliers.",
                    "Implementation of Elliptic Curve Cryptosystems on a reconfigurable computer.",
                    "A pattern-matching co-processor for network intrusion detection systems.",
                    "A parallel look-up logarithmic number system addition/subtraction scheme for FPGA.",
                    "Arbitrary function approximation in HDLs with application to the N-body problem.",
                    "Hierarchical segmentation schemes for function evaluation.",
                    "FPGA implementations of fast fourier transforms for real-time signal and image processing.",
                    "An FPGA-based re-configurable 24-bit 96kHz sigma-delta audio DAC.",
                    "Reconfiguration requirements for high speed wireless communication systems.",
                    "An FPGA implementation of Kak's instantaneously-trained, Fast-Classification neural networks.",
                    "Concept and implementation of run-time resource management system operating on autonomously reconfigurable architecture.",
                    "High-level language extensions for run-time reconfigurable systems.",
                    "Placement and routing for FPGA architectures supporting wide shallow memories.",
                    "Product-term based synthesizable embedded programmable logic cores.",
                    "An architecture for asynchronous FPGAs.",
                    "Evaluation of network topologies for a run time re-routable network on a programmable chip.",
                    "A high-speed ray tracing engine built on a field-programmable system.",
                    "Reconfigurable real-time address trace compressor for embedded microprocessors.",
                    "Customising parallelism and caching for machine learning.",
                    "A low cost FPGA system for high speed face detection and tracking.",
                    "An autonomous flying object navigated by real-time optical flow and visual target detection.",
                    "FPGA based EBCOT architecture for JPEG 2000.",
                    "FPGA-based computation of free-form deformations in medical image registration.",
                    "DIMES: an iterative emulation platform for Multiprocessor-System-On-Chip designs.",
                    "TKDM - a reconfigurable co-processor in a PC's memory slot.",
                    "Performance-driven recursive multi-level clustering.",
                    "Design space exploration with A Stream Compiler.",
                    "Source-directed transformations for hardware compilation.",
                    "An FPGA based coprocessor for 3D affine transformations.",
                    "An FPGA based coprocessor for large matrix product implementation.",
                    "Using FPGA to implement a n-channel arbitrary waveform generator with various add-on functions.",
                    "Design of FPGA-based adaptive remote calibration control system.",
                    "Performance optimization of an FPGA-based configurable multiprocessor for matrix operations.",
                    "Bayesian digital terrain model reconstruction on Virtex-II FPGA.",
                    "A coarse-grained reconfigurable architecture with low cost configuration data compression mechanism.",
                    "An embedded in-circuit emulator generator for SOC platform.",
                    "A crystal-based digital ring oscillator.",
                    "A parameterized automatic cache generator for FPGAs.",
                    "A field-customizable and runtime-adaptable microarchitecture.",
                    "On-chip communication architectures for reconfigurable System-on-Chip.",
                    "Three video applications using an FPGA based pyramid implementation: Tracking, Mosaics and Stabilization.",
                    "The Egret platform for reconfigurable system on chip.",
                    "A temporal partitioning approach based on reconfiguration granularity estimation for dynamically reconfigurable systems.",
                    "Beyond performance: secure and fair memory management for multiple systems on a chip.",
                    "Double precision floating-point arithmetic on FPGAs.",
                    "Temporal task clustering for online placement on reconfigurable hardware.",
                    "Reconfigurable parallel comparation architecture and its application to IP packet filters.",
                    "Reconfigurable architecture for probabilistic neural network system.",
                    "Parallel image processing field programmable gate array for real time image processing system.",
                    "Artificial neural networks as building blocks of mixed signal FPGA.",
                    "Specification and integration of software and reconfigurable hardware using Hardware Join Java.",
                    "Architecture template with dynamic buffering for runtime reconfiguration of adaptive embedded communication systems.",
                    "Accelerating signal processing algorithms in digital holography using an FPGA platform.",
                    "A new approach for reconfigurable massively parallel computers.",
                    "An FPGA implementation of a special purpose processor for steganography.",
                    "Comparing the bitstreams of applications specified in Hardware Join Java and HandelC.",
                    "Abstractions and primitives enabling runtime resource allocation for dynamic IP cores using virtual platform FPGAs.",
                    "Combined run-time area allocation and long line re-routing for reconfigurable computing.",
                    "A concurrent multi-bank memory arbiter for dynamic IP cores using idle skip round robin.",
                    "Augmenting general purpose processors for network processing.",
                    "Design of low cost FPGA based PCI Bus Sniffer.",
                    "FPGA implementation of real-time image convolutions with three level of memory hierarchy.",
                    "Fault injection into SRAM-based FPGAs for the analysis of SEU effects.",
                    "Compiling to FPGAs via an EPIC compiler's intermediate representation.",
                    "Mapping computation kernels to clustered programmable-reconfigurable processors.",
                    "Multisensor inversion with high-performance FPGA computation.",
                    "Exploiting system-level parallelism in the application development on a reconfigurable computer.",
                    "The Multiplier Tree FIR filter architecture.",
                    "FPGA implementable architecture for geometric global positioning."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "FPT 2002",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/fpt/2002",
                "sub_name": "Proceedings of the 2002 IEEE International Conference on Field-Programmable Technology, FPT 2002, Hong Kong, China, December 16-18, 2002.",
                "count": 79,
                "papers": [
                    "Technology research and development in Hong Kong: hype or reality.",
                    "The hot decade of field programmable technologies.",
                    "FPGAs as meta-platforms for embedded systems.",
                    "Programmed solutions: the step beyond programmed logic [computer architecture].",
                    "The next big leap in reconfigurable systems.",
                    "Real-time packet editing using reconfigurable hardware for active networking.",
                    "Implementation of an FPGA based accelerator for virtual private networks.",
                    "Compiling run-time parametrisable designs.",
                    "Adaptive FIR filter architectures for run-time reconfigurable FPGAs.",
                    "A methodology for design of run-time reconfigurable systems.",
                    "Resource-aware run-time elaboration of behavioural FPGA specifications.",
                    "Multiplier-less FIR digital filters using programmable sum-of-power-of-two (SOPOT) coefficients.",
                    "FPGA-based system-level design framework based on the IRIS synthesis tool and System Generator.",
                    "Area and time efficient implementations of matrix multiplication on FPGAs.",
                    "A system level implementation of Rijndael on a memory-slot based FPGA card.",
                    "FPGA-based cloud detection for real-time onboard remote sensing.",
                    "An FPGA-based processor for shogi mating problems.",
                    "Population based ant colony optimization on FPGA.",
                    "Clustered programmable-reconfigurable processors.",
                    "Implementing logic in FPGA memory arrays: heterogeneous memory architectures.",
                    "Optimising and adapting high-level hardware designs.",
                    "Floating-point bitwidth analysis via automatic differentiation.",
                    "DRESC: a retargetable compiler for coarse-grained reconfigurable architectures.",
                    "HIDE: a logic based hardware intelligent description environment.",
                    "Gigahertz SiGe BiCMOS FPGAs with new architectures and novel power management schemes.",
                    "Evolutionary analog circuit design on a programmable analog multiplexer array.",
                    "An optically differential reconfigurable gate array and its power consumption estimation.",
                    "A technology mapping algorithm for CPLD architectures.",
                    "Power-aware technology mapping for LUT-based FPGAs.",
                    "Synthesizing datapath circuits for FPGAs with emphasis on area minimization.",
                    "The effect of cluster packing and node duplication control in delay driven clustering.",
                    "Debug methodology for arithmetic circuits on FPGAs.",
                    "Debug methods for hybrid CPU/FPGA systems.",
                    "Scalable acceleration of inductive logic programs.",
                    "A fine-grained reconfigurable logic array based on double gate transistors.",
                    "A co-simulation study of adaptive EPIC computing.",
                    "System on programmable chip for real-time control implementations.",
                    "A reconfigurable vision system for real-time applications.",
                    "Lossless data compression programmable hardware for high-speed data networks.",
                    "A multiplier-less FPGA core for image algebra neighbourhood operations.",
                    "Multi-hop routing of multi-terminal nets for evaluation of hybrid multi-FPGA boards.",
                    "Serial-parallel tradeoff analysis of all-pairs shortest path algorithms in reconfigurable computing.",
                    "On-board satellite image compression using reconfigurable FPGAs.",
                    "Efficient single-chip implementation of SHA-384 and SHA-512.",
                    "An optimal PCM codec soft IP generator and its application.",
                    "Efficient 4-input LUTs FPGA implementation of combinatorial multiplier over canonical base GF(16).",
                    "FPGA based real-time adaptive filtering for space applications.",
                    "Diagnosis of open defects in FPGA interconnect.",
                    "Testing for resistive open defects in FPGAs.",
                    "A novel three phase parallel genetic approach to routing for field programmable gate arrays.",
                    "Reconfigurable implementation of radiosity distribution computation.",
                    "Hardware Join Java: a high level language for reconfigurable hardware development.",
                    "Image fusion for uninhabited airborne vehicles.",
                    "Development framework for firewall processors.",
                    "Design and implementation of a novel architecture for symmetric FIR filters with boundary handling on Xilinx Virtex FPGAs.",
                    "Enabling technologies for reconfigurable system-on-chip.",
                    "FPGA implementation of MFNN for image registration.",
                    "An efficient architecture for an improved watershed algorithm and its FPGA implementation.",
                    "The hardware implementation of a genetic algorithm model with FPGA.",
                    "Dynamic reconfiguration for the common key encryption using FPGA.",
                    "Field modifiable architecture with FPGAs and its design methodology.",
                    "The feasibility study of designing a FPGA multiplier-core on finite field.",
                    "The diversity study of AES on FPGA application.",
                    "Speedup analysis in simulation-emulation co-operation.",
                    "Performing speech recognition on multiple parallel files using continuous hidden Markov models on an FPGA.",
                    "Evolution-based automated reconfiguration of field programmable analog devices.",
                    "FPGA-based computation of free-form deformations.",
                    "Incremental programming for reconfigurable engines.",
                    "Delivering error detection capabilities into a field programmable device: the HORUS processor case study.",
                    "Energy efficiency of FPGAs and programmable processors for matrix multiplication.",
                    "Reconfigurable hardware control software using anonymous libraries.",
                    "Logic synthesis of multi-output functions for PAL-based CPLDs.",
                    "A method of implementing bit-serial LDI ladder filters in FPGAs using JBits.",
                    "PD-XML: extensible markup language for processor description.",
                    "Sensitivity of FPGA power evaluation.",
                    "Pattern recognition in the HADES spectrometer: an application of FPGA technology in nuclear and particle physics.",
                    "FPGA education and research activities in Taiwan.",
                    "Alternatives in FPGA-based SAD implementations.",
                    "Strassen's matrix multiplication for customisable processors."
                ]
            }
        ]
    }
]