[
    {
        "year": "2021",
        "name": "31st ACM Great Lakes Symposium on VLSI 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2021",
                "sub_name": "GLSVLSI '21: Great Lakes Symposium on VLSI 2021, Virtual Event, USA, June 22-25, 2021.",
                "count": 80,
                "papers": [
                    "MT-DLA: An Efficient Multi-Task Deep Learning Accelerator Design.",
                    "Bitwise Neural Network Acceleration Using Silicon Photonics.",
                    "Re2PIM: A Reconfigurable ReRAM-Based PIM Design for Variable-Sized Vector-Matrix Multiplication.",
                    "Tenet: A Neural Network Model Extraction Attack in Multi-core Architecture.",
                    "LDAX: A Learning-based Fast Design Space Exploration Framework for Approximate Circuit Synthesis.",
                    "EPEX: Processor Verification by Equivalent Program Execution.",
                    "IRONMAN: GNN-assisted Design Space Exploration in High-Level Synthesis via Reinforcement Learning.",
                    "SFP: Smart File-Aware Prefetching for Flash based Storage Systems.",
                    "Equivalence Checking for Superconducting RSFQ Logic Circuits.",
                    "CAMeleon: Reconfigurable B(T)CAM in Computational RAM.",
                    "A Logarithmic Floating-Point Multiplier for the Efficient Training of Neural Networks.",
                    "Eliminating Iterations of Iterative Methods: Solving Large-Scale Sparse Linear System in O(1) with RRAM-based In-Memory Accelerator.",
                    "On the Vulnerability of Hardware Masking in Practical Implementations.",
                    "The Modeling Attack and Security Enhancement of the XbarPUF with Both Column Swapping and XORing.",
                    "APUF-BNN: An Automated Framework for Efficient Combinational Logic Based Implementation of Arbiter PUF through Binarized Neural Network.",
                    "Organizing The World's Largest Hardware Security Competition: Challenges, Opportunities, and Lessons Learned.",
                    "Characterization and Mitigation of Electromigration Effects in TSV-Based Power Delivery Network Enabled 3D-Stacked DRAMs.",
                    "Design of a Low-Overhead Random Number Generator Using CMOS-based Cascaded Chaotic Maps.",
                    "CNN-DMA: A Predictable and Scalable Direct Memory Access Engine for Convolutional Neural Network with Sliding-window Filtering.",
                    "Improving Lifetime of Non-Volatile Memory Caches by Logical Partitioning.",
                    "Relaxed Placement: Minimizing Shift Operations for Racetrack Memory in Hybrid SPM.",
                    "Cross-Boundary Inductive Timing Optimization for 2.5D Chiplet-Package Co-Design.",
                    "Concentration Gradients Enhancement of Christmas-Tree Structure Based on a Look-Up Table.",
                    "A Composable Glitch-Aware Delay Model.",
                    "Evolving Trust for High Consequence Microelectronics.",
                    "3U-EdgeAI: Ultra-Low Memory Training, Ultra-Low Bitwidth Quantization, and Ultra-Low Latency Acceleration.",
                    "Accommodating Transformer onto FPGA: Coupling the Balanced Model Compression and FPGA-Implementation Optimization.",
                    "HMC-TRAN: A Tensor-core Inspired Hierarchical Model Compression for Transformer-based DNNs on GPU.",
                    "Co-Exploration of Graph Neural Network and Network-on-Chip Design Using AutoML.",
                    "A Reinforced Learning Solution for Clock Skew Engineering to Reduce Peak Current and IR Drop.",
                    "On the Adversarial Robustness of Quantized Neural Networks.",
                    "Energy-Efficient and Adversarially Robust Machine Learning with Selective Dynamic Band Filtering.",
                    "Adversarial Attack Mitigation Approaches Using RRAM-Neuromorphic Architectures.",
                    "The Curious Case of Trusted IC Provisioning in Untrusted Testing Facilities.",
                    "SAT-attack Resilience Measure for Access Restricted Circuits.",
                    "RANE: An Open-Source Formal De-obfuscation Attack for Reverse Engineering of Logic Encrypted Circuits.",
                    "Side-channel Resistant Implementations of a Novel Lightweight Authenticated Cipher with Application to Hardware Security.",
                    "RECOIN: A Low-Power Processing-in-ReRAM Architecture for Deformable Convolution.",
                    "Computing Utilization Enhancement for Chiplet-based Homogeneous Processing-in-Memory Deep Learning Processors.",
                    "DeepDive: An Integrative Algorithm/Architecture Co-Design for Deep Separable Convolutional Neural Networks.",
                    "IM3A: Boosting Deep Neural Network Efficiency via In-Memory Addressing-Assisted Acceleration.",
                    "qMC: A Formal Model Checking Verification Framework For Superconducting Logic.",
                    "Processing-in-Memory Acceleration of MAC-based Applications Using Residue Number System: A Comparative Study.",
                    "A Hybrid Optical-Electrical Analog Deep Learning Accelerator Using Incoherent Optical Signals.",
                    "MEDASec: Logic Encryption Scheme for Micro-electrode-dot-array Biochips IP Protection.",
                    "Domain Isolation in FPGA-Accelerated Cloud and Data Center Applications.",
                    "Parallel Multipath Transmission for Burst Traffic Optimization in Point-to-Point NoCs.",
                    "Predictive Warp Scheduling for Efficient Execution in GPGPU.",
                    "A 4NU-Recoverable and HIS-Insensitive Latch Design for Highly Robust Computing in Harsh Radiation Environments.",
                    "Voltage Bootstrapped Schmitt Trigger based Radiation Hardened Latch Design for Reliable Circuits.",
                    "Tolerating Stuck-at Fault and Variation in Resistive Edge Inference Engine via Weight Mapping.",
                    "An Air Force Perspective on the Application of Machine Learning for Microelectronics Design and Security.",
                    "Minimally Invasive HW/SW Co-debug Live Visualization on Architecture Level.",
                    "PALBBD: A Parallel ArcLength Method Using Bordered Block Diagonal Form for DC Analysis.",
                    "ALPINE: An Agile Processing-in-Memory Macro Compilation Framework.",
                    "MemOReL: A Memory-oriented Optimization Approach to Reinforcement Learning on FPGA-based Embedded Systems.",
                    "Energy-Efficient Hybrid-RAM with Hybrid Bit-Serial based VMM Support.",
                    "Systolic-Array Deep-Learning Acceleration Exploring Pattern-Indexed Coordinate-Assisted Sparsity for Real-Time On-Device Speech Processing.",
                    "Unlocking Approximations through Selective Source Code Transformations.",
                    "Machine Learning Based Acceleration Method for Ordered Escape Routing.",
                    "Novel Approximate Multiplier Designs for Edge Detection Application.",
                    "Accelerating AI Applications using Analog In-Memory Computing: Challenges and Opportunities.",
                    "A Comprehensive Analysis of Low-Impact Computations in Deep Learning Workloads.",
                    "An Efficient Video Prediction Recurrent Network using Focal Loss and Decomposed Tensor Train for Imbalance Dataset.",
                    "Real-Time and Robust Hyperdimensional Classification.",
                    "IVcache: Defending Cache Side Channel Attacks via Invisible Accesses.",
                    "Hardware Secure Execution and Simulation Model Correlation using IFT on RISC-V.",
                    "Assessing Correlation Power Analysis (CPA) Attack Resilience of Transistor-Level Logic Locking.",
                    "Tuning Memory Fault Tolerance on the Edge.",
                    "Socially-Distant Hands-On Labs for a Real-time Digital Signal Processing Course.",
                    "ASIC Design Principle Course with Combination of Online-MOOC and Offline-Inexpensive FPGA Board.",
                    "Experiences with Remote Teaching an Embedded Systems Course.",
                    "Provably Accurate Memory Fault Detection Method for Deep Neural Networks.",
                    "Unpaired Image-to-Image Translation Network for Semantic-based Face Adversarial Examples Generation.",
                    "DNN Intellectual Property Protection: Taxonomy, Attacks and Evaluations (Invited Paper).",
                    "Security Enhancements for Approximate Machine Learning.",
                    "Monte Carlo Variation Analysis of NCFET-based 6-T SRAM: Design Opportunities and Trade-offs.",
                    "Overview of Ferroelectric Memory Devices and Reliability Aware Design Optimization.",
                    "Capacitive Content-Addressable Memory: A Highly Reliable and Scalable Approach to Energy-Efficient Parallel Pattern Matching Applications.",
                    "Ferroelectric-based Accelerators for Computationally Hard Problems."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "30th ACM Great Lakes Symposium on VLSI 2020",
        "info": "Virtual Event, China",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2020",
                "sub_name": "GLSVLSI '20: Great Lakes Symposium on VLSI 2020, Virtual Event, China, September 7-9, 2020.",
                "count": 97,
                "papers": [
                    "Deep Learning Processors for On-Device Intelligence.",
                    "SNEAP: A Fast and Efficient Toolchain for Mapping Large-Scale Spiking Neural Network onto NoC-based Neuromorphic Platform.",
                    "SIP: Boosting Up Graph Computing by Separating the Irregular Property Data.",
                    "On-chip Memory Optimized CNN Accelerator with Efficient Partial-sum Accumulation.",
                    "BPhoton-CNN: An Ultrafast Photonic Backpropagation Accelerator for Deep Learning.",
                    "Reliable and Robust RRAM-based Neuromorphic Computing.",
                    "Modeling and Benchmarking Computing-in-Memory for Design Space Exploration.",
                    "IMC-Sort: In-Memory Parallel Sorting Architecture using Hybrid Memory Cube.",
                    "Deep Neural Network accelerator with Spintronic Memory.",
                    "Towards Programmable All-Digital True Random Number Generator.",
                    "Boosting Entropy Extraction of PDL-based RO PUF by High-order Difference Method.",
                    "A Modeling Attack Resilient Physical Unclonable Function Based on STT-MRAM.",
                    "Reliability-Enhanced Circuit Design Flow Based on Approximate Logic Synthesis.",
                    "Energy-Efficient Machine Learning Accelerator for Binary Neural Networks.",
                    "MNSIM 2.0: A Behavior-Level Modeling Tool for Memristor-based Neuromorphic Computing Systems.",
                    "A Review of In-Memory Computing Architectures for Machine Learning Applications.",
                    "Exploiting Disturbance-Aware Read Redirection for Performance Improvement in 3D Flash Memory.",
                    "Verification of Embedded Binaries using Coverage-guided Fuzzing with SystemC-based Virtual Prototypes.",
                    "MSFRoute: Multi-Stage FPGA Routing for Timing Division Multiplexing Technique.",
                    "A Tile-based Interconnect Model for FPGA Architecture Exploration.",
                    "A Privacy-Preserving-Oriented DNN Pruning and Mobile Acceleration Framework.",
                    "Robust Sparse Regularization: Defending Adversarial Attacks Via Regularized Sparse Network.",
                    "Energy-Efficient Hardware for Language Guided Reinforcement Learning.",
                    "Towards Self-Aware Systems-on-Chip Through Intelligent Cross-Layer Coordination.",
                    "An Approximate Carry Estimating Simultaneous Adder with Rectification.",
                    "Design Automation Methodology from RTL to Gate-level Netlist and Schematic for RSFQ Logic Circuits.",
                    "SIMDive: Approximate SIMD Soft Multiplier-Divider for FPGAs with Tunable Accuracy.",
                    "Accelerating Deterministic Stochastic Computing with Context-Aware Bit-stream Generator.",
                    "The Evolution of Transient-Execution Attacks.",
                    "Evolution of Defenses against Transient-Execution Attacks.",
                    "StealthMiner: Specialized Time Series Machine Learning for Run-Time Stealthy Malware Detection based on Microarchitectural Features.",
                    "Comprehensive Evaluation of Machine Learning Countermeasures for Detecting Microarchitectural Side-Channel Attacks.",
                    "Fast ECO Leakage Optimization Using Graph Convolutional Network.",
                    "An Ultra-low Power Keyword-Spotting Accelerator Using Circuit-Architecture-System Co-design and Self-adaptive Approximate Computing Based BWN.",
                    "TUPIM: A Transparent and Universal Processing-in-Memory Architecture for Unmodified Binaries.",
                    "Power-Efficient Approximate Multiplier Using Adaptive Error Compensation.",
                    "Trust Issues in COTS: The Challenges and Emerging Solution.",
                    "On Designing Secure and Robust Scan Chain for Protecting Obfuscated Logic.",
                    "A New Aging Sensor for the Detection of Recycled ICs.",
                    "Security Challenges of Processing-In-Memory Systems.",
                    "LORAX: Loss-Aware Approximations for Energy-Efficient Silicon Photonic Networks-on-Chip.",
                    "Energy-Efficient On-Chip Networks through Profiled Hybrid Switching.",
                    "Redesigning Photonic Interconnects with Silicon-on-Sapphire Device Platform for Ultra-Low-Energy On-Chip Communication.",
                    "COCOA: Content-Oriented Configurable Architecture Based on Highly-Adaptive Data Transmission Networks.",
                    "An In-memory Highly Reconfigurable Logic Circuit Based on Diode-assisted Enhanced Magnetoresistance Device.",
                    "In-Memory Computing: The Next-Generation AI Computing Paradigm.",
                    "A Background Noise Self-adaptive VAD Using SNR Prediction Based Precision Dynamic Reconfigurable Approximate Computing.",
                    "Exploring DNA Alignment-in-Memory Leveraging Emerging SOT-MRAM.",
                    "Effective Algorithm-Accelerator Co-design for AI Solutions on Edge Devices.",
                    "ESNreram: An Energy-Efficient Sparse Neural Network Based on Resistive Random-Access Memory.",
                    "Early Verification of ISA Extension Specifications using Deep Reinforcement Learning.",
                    "Synthesizing A Generalized Brain-inspired Interconnection Network for Large-scale Network-on-chip Systems.",
                    "A Learning-Based Timing Prediction Framework for Wide Supply Voltage Design.",
                    "Security Analysis of Hardware Trojans on Approximate Circuits.",
                    "Side Channel Attacks vs Approximate Computing.",
                    "Blurring Boundaries: A New Way to Secure Approximate Computing Systems.",
                    "Is It Approximate Computing or Malicious Computing?",
                    "Redundant Neurons and Shared Redundant Synapses for Robust Memristor-based DNNs with Reduced Overhead.",
                    "Enabling Resistive-RAM-based Activation Functions for Deep Neural Network Acceleration.",
                    "A Novel In-memory Computing Scheme Based on Toggle Spin Torque MRAM.",
                    "An Order Sampling Processing-in-Memory Architecture for Approximate Graph Pattern Mining.",
                    "AxR-NN: Approximate Computation Reuse for Energy-Efficient Convolutional Neural Networks.",
                    "Design Insights of Non-volatile Processors and Accelerators in Energy Harvesting Systems.",
                    "Dual-Plane Switch Architecture for Time-Triggered Ethernet.",
                    "Fast Consistency Auditing for Massive Industrial Data in Untrusted Cloud Services.",
                    "Litho-NeuralODE: Improving Hotspot Detection Accuracy with Advanced Data Augmentation and Neural Ordinary Differential Equations.",
                    "A Constraint-Driven Compact Model with Partition Strategy for Ordered Escape Routing.",
                    "Zero-skew Clock Network Synthesis for Monolithic 3D ICs with Minimum Wirelength.",
                    "Cost Estimation for Configurable Model-Driven SoC Designs Using Machine Learning.",
                    "Latency Variation Aware Read Performance Optimization on 3D High Density NAND Flash Memory.",
                    "HTcatcher: Finite State Machine and Feature Verifcation for Large-scale Neuromorphic Computing Systems.",
                    "A Hybrid Synthesis Methodology for Approximate Circuits.",
                    "Architecture-Accuracy Co-optimization of ReRAM-based Low-cost Neural Network Processor.",
                    "Efficient and Trusted Detection of Rootkit in IoT Devices via Offline Profiling and Online Monitoring.",
                    "Quantitatively Assessing the Cyber-to-Physical Risk of Industrial Cyber-Physical Systems.",
                    "SERN: Modeling and Analyzing the Soft Error Reliability of Convolutional Neural Networks.",
                    "Defect-Tolerant Mapping of CMOL Circuits with Delay Optimization.",
                    "Multi-task Scheduling for PIM-based Heterogeneous Computing System.",
                    "An ASIP Approach to Path Allocation in TDM NoCs using Adaptive Search Region.",
                    "Analog Circuit Implementation of LIF and STDP Models for Spiking Neural Networks.",
                    "DA-GC: A Dynamic Adjustment Garbage Collection Method Considering Wear-leveling for SSD.",
                    "Accelerating RRT Motion Planning Using TCAM.",
                    "Dimming Hybrid Caches to Assist in Temperature Control of Chip MultiProcessors.",
                    "Analog Circuit Implementation of Neurons with Multiply-Accumulate and ReLU Functions.",
                    "Securing Machine Learning Architectures and Systems.",
                    "Gate-Level Models for Fast Cross-Level Power Density Estimation.",
                    "Towards Deeply Scaled 3D MPSoCs with Integrated Flow Cell Array Technology.",
                    "Cost Modeling and Analysis of TSV and Contactless 3D-ICs.",
                    "A 53%-PTE and 4-Mbps Power and Data Telemetry Circuit based on Adaptive Duty-cycling BPSK Modulated Class-E Amplifier.",
                    "Privacy Threats and Protection in Machine Learning.",
                    "Prediction Stability: A New Metric for Quantitatively Evaluating DNN Outputs.",
                    "On Configurable Defense against Adversarial Example Attacks.",
                    "Adversarial Perturbation with ResNet.",
                    "A Simplified Arm Processor for VLSI Education.",
                    "A Board and Projects for an FPGA/Microcontroller-Based Embedded Systems Lab.",
                    "Towards Systems Education for Artificial Intelligence: A Course Practice in Intelligent Computing Architectures.",
                    "A New Silicon-aware Big Data SoC Timing Analysis Solution: A Case Study of Empyrean University Program."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "29th ACM Great Lakes Symposium on VLSI 2019",
        "info": "Tysons Corner, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2019",
                "sub_name": "Proceedings of the 2019 on Great Lakes Symposium on VLSI, GLSVLSI 2019, Tysons Corner, VA, USA, May 9-11, 2019.",
                "count": 105,
                "papers": [
                    "Thoughts on Edge Intelligence.",
                    "Automatic Implementation of Secure Silicon.",
                    "Processing Data Where It Makes Sense in Modern Computing Systems: Enabling In-Memory Computation.",
                    "Innovations in IoT for a Safe, Secure, and Sustainable Future.",
                    "LPN-based Device Authentication Using Resistive Memory.",
                    "Leveraging On-Chip Voltage Regulators Against Fault Injection Attacks.",
                    "On the Theoretical Analysis of Memristor based True Random Number Generator.",
                    "Control-Lock: Securing Processor Cores Against Software-Controlled Hardware Trojans.",
                    "Lightweight Authenticated Encryption for Network-on-Chip Communications.",
                    "Design of a Low-power and Small-area Approximate Multiplier using First the Approximate and then the Accurate Compression Method.",
                    "GraphiDe: A Graph Processing Accelerator leveraging In-DRAM-Computing.",
                    "An Efficient Time-based Stochastic Computing Circuitry Employing Neuron-MOS.",
                    "Monolithic 8x8 SiPM with 4-bit Current-Mode Flash ADC with Tunable Dynamic Range.",
                    "A Systolic SNN Inference Accelerator and its Co-optimized Software Framework.",
                    "Dynamic Beam Width Tuning for Energy-Efficient Recurrent Neural Networks.",
                    "Efficient Softmax Hardware Architecture for Deep Neural Networks.",
                    "HSIM-DNN: Hardware Simulator for Computation-, Storage- and Power-Efficient Deep Neural Networks.",
                    "An Area-Efficient Iterative Single-Precision Floating-Point Multiplier Architecture for FPGA.",
                    "An Automatic Transistor-Level Tool for GRM FPGA Interconnect Circuits Optimization.",
                    "Low Voltage Clock Tree Synthesis with Local Gate Clusters.",
                    "TOIC: Timing Obfuscated Integrated Circuits.",
                    "Design for Eliminating Operation Specific Power Signatures from Digital Logic.",
                    "Non-Uniform Temperature Distribution in Interconnects and Its Impact on Electromigration.",
                    "Fault Classification and Coverage of Analog Circuits using DC Operating Point and Frequency Response Analysis.",
                    "Crash Skipping: A Minimal-Cost Framework for Efficient Error Recovery in Approximate Computing Environments.",
                    "Voltage-Controlled Magnetoelectric Memory Bit-cell Design With Assisted Body-bias in FD-SOI.",
                    "Low Cost Hybrid Spin-CMOS Compressor for Stochastic Neural Networks.",
                    "Functionally Complete Boolean Logic and Adder Design Based on 2T2R RRAMs for Post-CMOS In-Memory Computing.",
                    "Jump Search: A Fast Technique for the Synthesis of Approximate Circuits.",
                    "SAT-Based Placement Adjustment of FinFETs inside Unroutable Standard Cells Targeting Feasible DRC-Clean Routing.",
                    "A Scalable and Process Variation Aware NVM-FPGA Placement Algorithm.",
                    "Functional Obfuscation of Hardware Accelerators through Selective Partial Design Extraction onto an Embedded FPGA.",
                    "HydraRoute: A Novel Approach to Circuit Routing.",
                    "Balanced Factorization and Rewriting Algorithms for Synthesizing Single Flux Quantum Logic Circuits.",
                    "A Majority Logic Synthesis Framework for Adiabatic Quantum-Flux-Parametron Superconducting Circuits.",
                    "A Processing-In-Memory Implementation of SHA-3 Using a Voltage-Gated Spin Hall-Effect Driven MTJ-based Crossbar.",
                    "Exploring Processing In-Memory for Different Technologies.",
                    "BLADE: A BitLine Accelerator for Devices on the Edge.",
                    "Enhancing the Lifetime of Non-Volatile Caches by Exploiting Module-Wise Write Restriction.",
                    "Mitigating the Performance and Quality of Parallelized Compressive Sensing Reconstruction Using Image Stitching.",
                    "Towards Optimizing Refresh Energy in embedded-DRAM Caches using Private Blocks.",
                    "Extending Student Labs with SMT Circuit Implementation.",
                    "Teaching the Next Generation of Cryptographic Hardware Design to the Next Generation of Engineers.",
                    "A Web-based Remote FPGA Laboratory for Computer Organization Course.",
                    "System-on-a-Chip Design as a Platform for Teaching Design and Design Flow Integration.",
                    "UPIM: Unipolar Switching Logic for High Density Processing-in-Memory Applications.",
                    "Fence-Region-Aware Mixed-Height Standard Cell Legalization.",
                    "A Case for Heterogeneous Network-on-Chip Based H.264 Video Decoders.",
                    "A 16b Clockless Digital-to-Analog Converter with Ultra-Low-Cost Poly Resistors Supporting Wide-Temperature Range from -40°C to 85°C.",
                    "A Skyrmion Racetrack Memory based Computing In-memory Architecture for Binary Neural Convolutional Network.",
                    "TASecure: Temperature-Aware Secure Deletion Scheme for Solid State Drives.",
                    "An Asymmetric Dual Output On-Chip DC-DC Converter for Dynamic Workloads.",
                    "CNNWire: Boosting Convolutional Neural Network with Winograd on ReRAM based Accelerators.",
                    "Feed-Forward XOR PUFs: Reliability and Attack-Resistance Analysis.",
                    "Exploring Design Trade-offs in Fault-Tolerant Behavioral Hardware Accelerators.",
                    "Automatic Extraction of Requirements from State-based Hardware Designs for Runtime Verification.",
                    "MirrorCache: An Energy-Efficient Relaxed Retention L1 STTRAM Cache.",
                    "Design and Evaluation of DNU-Tolerant Registers for Resilient Architectural State Storage.",
                    "Automated Analysis of Virtual Prototypes at Electronic System Level.",
                    "Dynamic Physically Unclonable Functions.",
                    "RDTA: An Efficient Routability-Driven Track Assignment Algorithm.",
                    "EraseMe: A Defense Mechanism against Information Leakage exploiting GPU Memory.",
                    "A Statistical Current and Delay Model Based on Log-Skew-Normal Distribution for Low Voltage Region.",
                    "Enabling Approximate Storage through Lossy Media Data Compression.",
                    "Thermal Fingerprinting of FPGA Designs through High-Level Synthesis.",
                    "Deep RNN-Oriented Paradigm Shift through BOCANet: Broken Obfuscated Circuit Attack.",
                    "STAT: Mean and Variance Characterization for Robust Inference of DNNs on Memristor-based Platforms.",
                    "LSM: Novel Low-Complexity Unified Systolic Multiplier over Binary Extension Field.",
                    "Binarized Depthwise Separable Neural Network for Object Tracking in FPGA.",
                    "An Analytical-based Hybrid Algorithm for FPGA Placement.",
                    "Approximate Memory with Approximate DCT.",
                    "AQuRate: MRAM-based Stochastic Oscillator for Adaptive Quantization Rate Sampling of Sparse Signals.",
                    "Clockless Spin-based Look-Up Tables with Wide Read Margin.",
                    "A Hybrid Framework for Functional Verification using Reinforcement Learning and Deep Learning.",
                    "Digital and Analog-Mixed-Signal In-Memory Processing in CMOS SRAM.",
                    "Ferroelectric FET Based In-Memory Computing for Few-Shot Learning.",
                    "True In-memory Computing with the CRAM: From Technology to Applications.",
                    "An Overview of In-memory Processing with Emerging Non-volatile Memory for Data-intensive Applications.",
                    "Security Threats in Approximate Computing Systems.",
                    "Characterizing Approximate Adders and Multipliers Optimized under Different Design Constraints.",
                    "Approximate Communication Strategies for Energy-Efficient and High Performance NoC: Opportunities and Challenges.",
                    "Information Hiding behind Approximate Computation.",
                    "MLPrivacyGuard: Defeating Confidence Information based Model Inversion Attacks on Machine Learning Systems.",
                    "XNOR-SRAM: In-Bitcell Computing SRAM Macro based on Resistive Computing Mechanism.",
                    "Efficient Process-in-Memory Architecture Design for Unsupervised GAN-based Deep Learning using ReRAM.",
                    "DigitalPIM: Digital-based Processing In-Memory for Big Data Acceleration.",
                    "In-memory Processing based on Time-domain Circuit.",
                    "An Overview of Thermal Challenges and Opportunities for Monolithic 3D ICs.",
                    "Logic Monolithic 3D ICs: PPA Benefits and EDA Tools Necessary.",
                    "Investigation and Trade-offs in 3DIC Partitioning Methodologies: N/A.",
                    "Test and Design-for-Testability Solutions for Monolithic 3D Integrated Circuits.",
                    "N3XT Monolithic 3D Energy-Efficient Computing Systems.",
                    "How to Generate Robust Keys from Noisy DRAMs?",
                    "Threats on Logic Locking: A Decade Later.",
                    "On Custom LUT-based Obfuscation.",
                    "Securing Analog Mixed-Signal Integrated Circuits Through Shared Dependencies.",
                    "Design Methodology for Embedded Approximate Artificial Neural Networks.",
                    "Exploration of Segmented Bus As Scalable Global Interconnect for Neuromorphic Computing.",
                    "ADMM-based Weight Pruning for Real-Time Deep Learning Acceleration on Mobile Devices.",
                    "On the use of Deep Autoencoders for Efficient Embedded Reinforcement Learning.",
                    "Tuning Track-based NVM Caches for Low-Power IoT Devices.",
                    "Dynamic Computation Migration at the Edge: Is There an Optimal Choice?",
                    "Solving Energy and Cybersecurity Constraints in IoT Devices Using Energy Recovery Computing.",
                    "Right-Provisioned IoT Edge Computing: An Overview.",
                    "Secure Computing Systems Design Through Formal Micro-Contracts."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "28th ACM Great Lakes Symposium on VLSI 2018",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2018",
                "sub_name": "Proceedings of the 2018 on Great Lakes Symposium on VLSI, GLSVLSI 2018, Chicago, IL, USA, May 23-25, 2018.",
                "count": 101,
                "papers": [
                    "DARPA's Data Driven Discovery of Models (D3M) and Software Defined Hardware (SDH) Programs.",
                    "Self-Awareness for Heterogeneous MPSoCs: A Case Study using Adaptive, Reflective Middleware.",
                    "Hardware Assurance: Trojans, Counterfeits, and Security in an Interconnected World.",
                    "A Cross-Layer Perspective for Energy Efficient Processing: - From beyond-CMOS Devices to Deep Learning.",
                    "Logic-Encrypted Synthesis for Energy-Harvesting-Powered Spintronic-Embedded Datapath Design.",
                    "Low-Energy Deep Belief Networks Using Intrinsic Sigmoidal Spintronic-based Probabilistic Neurons.",
                    "Maxflow: Minimizing Latency in Hybrid Stochastic-Binary Systems.",
                    "Methodology to Capture Statistical Effect of Process Imperfections on Glitch Suppression in CNFET Circuits and to Improve by Using Approximate Circuits.",
                    "Performance and Energy Enhancement through an Online Single/Multi Level Mode Switching Cache Architecture.",
                    "SEPUFSoC: Using PUFs for Memory Integrity and Authentication in Multi-Processors System-on-Chip.",
                    "Protecting Communication in Many-Core Systems against Active Attackers.",
                    "A Homomorphic Encryption Scheme Based on Affine Transforms.",
                    "Resilient AES Against Side-Channel Attack Using All-Spin Logic.",
                    "DeEPeR: Enhancing Performance and Reliability in Chip-Scale Optical Interconnection Networks.",
                    "A 0.24pJ/bit, 16Gbps OOK Transmitter Circuit in 45-nm CMOS for Inter and Intra-Chip Wireless Interconnects.",
                    "TaSaT: Thermal-Aware Scheduling and Tuning Algorithm for Heterogeneous and Configurable Embedded Systems.",
                    "Interfacing 3D-stacked Electronic and Optical NoCs with Mixed CMOS-ECL Bridges: a Realistic Preliminary Assessment.",
                    "A Framework Exploiting Process Variability to Improve Energy Efficiency in FPGA Applications.",
                    "Assessing the Impact of Temperature and Supply Voltage Variations in Near-threshold Circuits using an Analytical Model.",
                    "Impolite High Speed Interfaces with Asynchronous Pulse Logic.",
                    "Short-path Padding Method for Timing Error Resilient Circuits based on Transmission Gates Insertion.",
                    "Energy and Performance Efficient Computation Offloading for Deep Neural Networks in a Mobile Cloud Computing Environment.",
                    "Adapting Convolutional Neural Networks for Indoor Localization with Smart Mobile Devices.",
                    "Face Recognition with Hybrid Efficient Convolution Algorithms on FPGAs.",
                    "SCALENet: A SCalable Low power AccELerator for Real-time Embedded Deep Neural Networks.",
                    "Improving the Security of Split Manufacturing Using a Novel BEOL Signal Selection Method.",
                    "A Novel Polymorphic Gate Based Circuit Fingerprinting Technique.",
                    "Cross-Lock: Dense Layout-Level Interconnect Locking using Cross-bar Architectures.",
                    "SRCLock: SAT-Resistant Cyclic Logic Locking for Protecting the Hardware.",
                    "Scalable Hardware Accelerator for Mini-Batch Gradient Descent.",
                    "MC3A: Markov Chain Monte Carlo ManyCore Accelerator.",
                    "AEAS - Towards High Energy-efficiency Design for OpenSSL Encryption Acceleration through HW/SW Co-design.",
                    "A Machine Learning Attack Resistant Dual-mode PUF.",
                    "A Distributed Power Grid Analysis Framework from Sequential Stream Graph.",
                    "A Distributed Parallel Random Walk Algorithm for Large-Scale Capacitance Extraction and Simulation.",
                    "A Fast and Fuzzy Functional Simulator of Inexact Arithmetic Operators for Approximate Computing Systems.",
                    "Battery-aware Design Exploration of Scheduling Policies for Multi-sensor Devices.",
                    "Accelerating Coverage Directed Test Generation for Functional Verification: A Neural Network-based Framework.",
                    "Effective In-Situ Chip Health Monitoring with Selective Monitor Insertion Along Timing Paths.",
                    "Low Complexity Burst Error Correcting Codes to Correct MBUs in SRAMs.",
                    "Loss is Gain: Shortening Data for Lifetime Improvement on Low-Cost ECC Enabled Consumer-Level Flash Memory.",
                    "A Novel Fault-Tolerant Last-Level Cache to Improve Reliability at Near-Threshold Voltage.",
                    "AB-Aware: Application Behavior Aware Management of Shared Last Level Caches.",
                    "Towards Near-Data Processing of Compare Operations in 3D-Stacked Memory.",
                    "Utility Aware Snoozy Caches for Energy Efficient Chip Multi-Processors.",
                    "SARO: A State-Aware Reliability Optimization Technique for High Density NAND Flash Memory.",
                    "Simultaneous Timing Driven Tree Surgery in Routing with Machine Learning-based Acceleration.",
                    "Electromigration Design Rule aware Global and Detailed Routing Algorithm.",
                    "A Comparative Study of Local Net Modeling Using Machine Learning.",
                    "Fast Timing Analysis of Non-Tree Clock Network with Shorted Wires.",
                    "Reliable On-Chip Voltage Regulation for Sustainable and Compact IoT and Heterogeneous Computing Systems.",
                    "Low-Energy Architectures of Linear Classifiers for IoT Applications using Incremental Precision and Multi-Level Classification.",
                    "Towards A Universal Power Manager for Multi-Source Energy Scavenging and Storage.",
                    "Efficient Wireless Power Transfer for Heterogeneous Adaptive IoT Systems.",
                    "Low-Power Optical Interconnects based on Resonant Silicon Photonic Devices: Recent Advances and Challenges.",
                    "Wavelength-Routed Optical Networks-on-Chip: Design Methods and Tools to Bridge the Gap Between Logic Topologies and Physical Ones in 3D Architectures.",
                    "Cross-Layer Thermal Reliability Management in Silicon Photonic Networks-on-Chip.",
                    "Silicon Photonic Interconnects: Minimizing the Controller Latency.",
                    "Leveraging RF Power for Intelligent Tag Networks.",
                    "Quasi-self-powered Infrastructural Internet of Things: The Mackinac Bridge Case Study.",
                    "New GPR System Integration with Augmented Reality Based Positioning.",
                    "MTJ Magnetization Switching Mechanisms for IoT Applications.",
                    "Structured Weight Matrices-Based Hardware Accelerators in Deep Neural Networks: FPGAs and ASICs.",
                    "Challenges and Rewards of Implementing and Benchmarking Post-Quantum Cryptography in Hardware.",
                    "Physical Protection of Lattice-Based Cryptography: Challenges and Solutions.",
                    "Post-Quantum Cryptography on FPGAs: The Niederreiter Cryptosystem: Extended Abstract.",
                    "Going Small: Using the Insect Brain as a Model System for Edge Processing Applications.",
                    "Energy and Area Efficiency in Neuromorphic Computing for Resource Constrained Devices.",
                    "Gate-Controlled Memristors and their Applications in Neuromorphic Architectures.",
                    "Design Exploration of IoT centric Neural Inference Accelerators.",
                    "Leveraging Spintronic Devices for Efficient Approximate Logic and Stochastic Neural Networks.",
                    "Design Space Exploration of Magnetic Tunnel Junction based Stochastic Computing in Deep Learning.",
                    "Bit-Wise Iterative Decoding of Polar Codes using Stochastic Computing.",
                    "Comparative Study of Approximate Multipliers.",
                    "Dataflow-Based Mapping of Spiking Neural Networks on Neuromorphic Hardware.",
                    "Design of Dynamic Range Approximate Logarithmic Multipliers.",
                    "Investigation and Optimization of Pin Multiplexing in High-Level Synthesis.",
                    "Energy Consumption and Lifetime Improvement of Coarse-Grained Reconfigurable Architectures Targeting Low-Power Error-Tolerant Applications.",
                    "MuDBN: An Energy-Efficient and High-Performance Multi-FPGA Accelerator for Deep Belief Networks.",
                    "Performance Impact of Emerging Memory Technologies on Big Data Applications: A Latency-Programmable System Emulation Approach.",
                    "BiNMAC: Binarized neural Network Manycore ACcelerator.",
                    "A Hybrid Approach to Equivalent Fault Identification for Verification Environment Qualification.",
                    "Memristive Crossbar Mapping for Neuromorphic Computing Systems on 3D IC.",
                    "Impact of Aging on Template Attacks.",
                    "MUCH-SWIFT: A High-Throughput Multi-Core HW/SW Co-design K-means Clustering Architecture.",
                    "An Efficient Cache Management Scheme for Capacitor Equipped Solid State Drives.",
                    "Evaluation of the Complexity of Automated Trace Alignment using Novel Power Obfuscation Methods.",
                    "A CMOS Low Power 4th-Order Delta-Sigma Modulator with One Reconfigurable Amplifier.",
                    "On the Design of Reliable Heterogeneous Systems via Checkpoint Placement and Core Assignment.",
                    "SAT-Lancer: A Hardware SAT-Solver for Self-Verification.",
                    "FLexiTASK: A Flexible FPGA Overlay for Efficient Multitasking.",
                    "An Architectural Support for Reduction of In-rush Current in Systems with Instruction Controlled Power Gating.",
                    "Optimal Topology-Aware PV Panel Floorplanning with Hybrid Orientation.",
                    "ADDHard: Arrhythmia Detection with Digital Hardware by Learning ECG Signal.",
                    "Hardening AES Hardware Implementations Against Fault and Error Inject Attacks.",
                    "SimTRaX: Simulation Infrastructure for Exploring Thousands of Cores.",
                    "Static Design of Spin Transfer Torques Magnetic Look Up Tables for ASIC Designs.",
                    "Innovating at Cloud Speed for IoT, AI, and Semiconductor Design.",
                    "Mixed-Signal POp/J Computing with Nonvolatile Memories.",
                    "Low Power and Trusted Machine Learning.",
                    "Securing the Systems of the Future - Techniques for a Shifting Attack Space."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "27th ACM Great Lakes Symposium on VLSI 2017",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2017",
                "sub_name": "Proceedings of the on Great Lakes Symposium on VLSI 2017, Banff, AB, Canada, May 10-12, 2017.",
                "count": 94,
                "papers": [
                    "Cognitive Data-Centric Systems.",
                    "Green Computing: New Challenges and Opportunities.",
                    "FPGAs in the Datacenter: Combining the Worlds of Hardware and Software Development.",
                    "Internet-of-Medical-Things.",
                    "Designing Really Big Value Ideas.",
                    "Design of a Low-Power Non-Volatile Programmable Inverter Cell for COGRE-based Circuits.",
                    "VaLHALLA: Variable Latency History Aware Local-carry Lazy Adder.",
                    "Energy Efficient Magnetic Tunnel Junction Based Hybrid LSI Using Multi-Threshold UTBB-FD-SOI Device.",
                    "A Mixed-Size Monolithic 3D Placer with 2D Layout Inheritance.",
                    "LightNN: Filling the Gap between Conventional Deep Neural Networks and Binarized Networks.",
                    "Design of a Flash-based Circuit for Multi-valued Logic.",
                    "Design of Approximate Logarithmic Multipliers.",
                    "Mitigating the Effect of Reliability Soft-errors of RRAM Devices on the Performance of RRAM-based Neuromorphic Systems.",
                    "A Spin-Orbit Torque based Cellular Neural Network (CNN) Architecture.",
                    "PreNoc: Neural Network based Predictive Routing for Network-on-Chip Architectures.",
                    "A Domain-Specific Language and Compiler for Computation-in-Memory Skeletons.",
                    "Energy Efficient In-Memory Computing Platform Based on 4-Terminal Spin Hall Effect-Driven Domain Wall Motion Devices.",
                    "Leveraging Dual-Mode Magnetic Crossbar for Ultra-low Energy In-memory Data Encryption.",
                    "Evaluating Data Resilience in CNNs from an Approximate Memory Perspective.",
                    "A Robust C-element Design with Enhanced Metastability Performance.",
                    "Circuit Level Design of a Hardware Hash Unit for use in Modern Microprocessors.",
                    "DELCA: DVFS Efficient Low Cost Multicore Architecture.",
                    "EEAL: Processors' Performance Enhancement Through Early Execution of Aliased Loads.",
                    "Performance-Aware Resource Management of Multi-Threaded Applications on Many-Core Systems.",
                    "Under-the-Cell Routing to Improve Manufacturability.",
                    "Improving Circuit Mapping Performance Through MIG-based Synthesis for Carry Chains.",
                    "Redundant Via Insertion with Cut Optimization for Self-Aligned Double Patterning.",
                    "Boolean Decomposition for AIG Optimization.",
                    "Mixed-Cell-Height Standard Cell Placement Legalization.",
                    "Covert Timing Channels Exploiting Non-Uniform Memory Access based Architectures.",
                    "A Low-Cost GPS Spoofing Detector Design for Internet of Things (IoT) Applications.",
                    "A Novel Side-Channel Timing Attack on GPUs.",
                    "Cyclic Obfuscation for Creating SAT-Unresolvable Circuits.",
                    "Double DIP: Re-Evaluating Security of Logic Encryption Algorithms.",
                    "Efficient Critical Path Selection Under a Probabilistic Delay Model.",
                    "Combining Restorability and Error Detection Ability for Effective Trace Signal Selection.",
                    "Radiation-Hardened Designs for Soft-Error-Rate Reduction by Delay-Adjustable D-Flip-Flops.",
                    "Effective Mitigation of Radiation-induced Single Event Transient on Flash-based FPGAs.",
                    "Energy Efficient Adaptive Approach for Dependable Performance in the presence of Timing Interference.",
                    "Design Automation for Paper Microfluidics with Passive Flow Substrates.",
                    "Neuromorphic 3D Integrated Circuit: A Hybrid, Reliable and Energy Efficient Approach for Next Generation Computing.",
                    "A Method for Phase Noise Analysis of RF Circuits.",
                    "Revealing On-chip Proprietary Security Functions with Scan Side Channel Based Reverse Engineering.",
                    "Analysis of SEU Propagation in Combinational Circuits at RTL Based on Satisfiability Modulo Theories.",
                    "Fine-Grain Program Snippets Generator for Mobile Core Design.",
                    "Coupling-Aware Functional Timing Analysis for Tighter Bounds: How Much Margin Can We Relax?",
                    "A Thermal-Balanced Variable-Sized-Bin-Packing Approach for Energy Efficient Multi-Core Real-Time Scheduling.",
                    "Quantitative Modeling of Thermo-Optic Effects in Optical Networks-on-Chip.",
                    "A Reconfigurable Replica Bitline to Determine Optimum SRAM Sense Amplifier Set Time.",
                    "Building a Fast and Power Efficient Inductive Charge Pump System for 3D Stacked Phase Change Memories.",
                    "Design Space Exploration of TAGE Branch Predictor with Ultra-Small RAM.",
                    "A Power Efficient Architecture with Optimized Parallel Memory Accessing for Feature Generation.",
                    "Design of Approximate High-Radix Dividers by Inexact Binary Signed-Digit Addition.",
                    "Advanced Low Power Spintronic Memories beyond STT-MRAM.",
                    "Exploiting Non-Volatility for Information Processing.",
                    "Neuromorphic Computing based on Resistive RAM.",
                    "Implications of the Use of Magnetic Tunnel Junctions as Synapses in Neuromorphic Systems.",
                    "Security Threats and Countermeasures in Three-Dimensional Integrated Circuits.",
                    "Impact of Power Distribution Network on Power Analysis Attacks in Three-Dimensional Integrated Circuits.",
                    "The Need for Declarative Properties in Digital IC Security.",
                    "Securing Split Manufactured ICs with Wire Lifting Obfuscated Built-In Self-Authentication.",
                    "An Empirical Study on Gate Camouflaging Methods Against Circuit Partition Attack.",
                    "What to Lock?: Functional and Parametric Locking.",
                    "Circuit Obfuscation and Oracle-guided Attacks: Who can Prevail?",
                    "Comparative Analysis of Hardware Obfuscation for IP Protection.",
                    "Efficient and Secure On-Chip Reconfigurable Voltage Regulation for IoT Devices.",
                    "Design Space Modeling and Simulation for Physically Constrained 3D CPUs.",
                    "Automated Design of Stable Power Delivery Systems for Heterogeneous IoT Systems.",
                    "Work Load Scheduling For Multi Core Systems With Under-Provisioned Power Delivery.",
                    "Bioinspired Programming of Resistive Memory Devices for Implementing Spiking Neural Networks.",
                    "A Maze Routing-Based Algorithm for ML-OARST with Pre-Selecting and Re-Building Steiner Points.",
                    "An Integrated Optimization Framework for Partitioning, Scheduling and Floorplanning on Partially Dynamically Reconfigurable FPGAs.",
                    "Communication-aware Partitioning for Energy Optimization of Large FPGA Designs.",
                    "Combined Centralized and Distributed Connection Allocation in Large TDM Circuit Switching NoCs.",
                    "Random Forest Architectures on FPGA for Multiple Applications.",
                    "Exploring Heterogeneous-ISA Core Architectures for High-Performance and Energy-Efficient Mobile SoCs.",
                    "An FPGA Coarse Grained Intermediate Fabric for Regular Expression Search.",
                    "Deadline-Aware Joint Optimization of Sleep Transistor and Supply Voltage for FinFET Based Embedded Systems.",
                    "Energy Savings and Performance Improvement in Subthreshold Using Adaptive Body Bias.",
                    "Low Voltage Stochastic Flash ADC with Front-end of Inverter-based Comparative Unit.",
                    "Switched Capacitor and Infinite Impulse Response Summation for a Quarter-Rate DFE with 4Gb/s Data Rate.",
                    "An Energy Combiner Design for Multiple Microbial Energy Harvesting Sources.",
                    "LUTOSAP: Lookup Table Based Online Sample Preparation in Microfluidic Biochips.",
                    "Throughput Optimization for Lifetime Budgeting in Many-Core Systems.",
                    "A Test Pattern Quality Metric for Diagnosis of Multiple Stuck-at and Transition faults.",
                    "Reducing Microfluidic Very Large Scale Integration (mVLSI) Chip Area by Seam Carving.",
                    "ProACt: A Processor for High Performance On-demand Approximate Computing.",
                    "Softmax Regression Design for Stochastic Computing Based Deep Convolutional Neural Networks.",
                    "Computing Polynomials with Positive Coefficients using Stochastic Logic by Double-NAND Expansion.",
                    "On the Role of Sequential Circuits in Stochastic Computing.",
                    "Circuit Techniques for Online Learning of Memristive Synapses in CMOS-Memristor Neuromorphic Systems.",
                    "Mitigating Control Flow Attacks in Embedded Systems with Novel Built-in Secure Register Bank.",
                    "Using Security Invariant To Verify Confidentiality in Hardware Design.",
                    "Leveraging All-Spin Logic to Improve Hardware Security."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "26th ACM Great Lakes Symposium on VLSI 2016",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2016",
                "sub_name": "Proceedings of the 26th edition on Great Lakes Symposium on VLSI, GLVLSI 2016, Boston, MA, USA, May 18-20, 2016.",
                "count": 84,
                "papers": [
                    "Why Is It So Hard to Make Secure Chips?",
                    "Design and Implementation of Real-Time Multi-sensor Vision Systems.",
                    "Medical Device Security: The First 165 Years.",
                    "VLSI Design Methods for Low Power Embedded Encryption.",
                    "High-Speed Polynomial Multiplier Architecture for Ring-LWE Based Public Key Cryptosystems.",
                    "Reduced Overhead Gate Level Logic Encryption.",
                    "A Design of a Non-Volatile PMC-Based (Programmable Metallization Cell) Register File.",
                    "A Clockless Sequential PUF with Autonomous Majority Voting.",
                    "Area-Efficient Error-Resilient Discrete Fourier Transformation Design using Stochastic Computing.",
                    "Concurrent Error Detection for Reliable SHA-3 Design.",
                    "Secure Model Checkers for Network-on-Chip (NoC) Architectures.",
                    "Parameter-importance based Monte-Carlo Technique for Variation-aware Analog Yield Optimization.",
                    "Low Energy Sketching Engines on Many-Core Platform for Big Data Acceleration.",
                    "Low-Power Manycore Accelerator for Personalized Biomedical Applications.",
                    "Hardware Security Threats and Potential Countermeasures in Emerging 3D ICs.",
                    "Real-Time Analysis for Wormhole NoC: Revisited and Revised.",
                    "A New Methodology for Noise Sensor Placement Based on Association Rule Mining.",
                    "MCFRoute 2.0: A Redundant Via Insertion Enhanced Concurrent Detailed Router.",
                    "Modular Placement for Interposer based Multi-FPGA Systems.",
                    "A Parallel Random Walk Solver for the Capacitance Calculation Problem in Touchscreen Design.",
                    "Real-Time Hardware Stereo Matching Using Guided Image Filter.",
                    "Computing Complex Functions using Factorization in Unipolar Stochastic Logic.",
                    "DCC: Double Capacity Cache Architecture for Narrow-Width Values.",
                    "Static Noise Margin based Yield Modelling of 6T SRAM for Area and Minimum Operating Voltage Improvement using Recovery Techniques.",
                    "Asynchronous High Speed Serial Links Analysis using Integrated Charge for Event Detection.",
                    "Design and Comparative Evaluation of a Hybrid Cache Memory at Architectural Level.",
                    "A Sampling Clock Skew Correction Technique for Time-Interleaved SAR ADCs.",
                    "Secure and Low-Overhead Circuit Obfuscation Technique with Multiplexers.",
                    "Task-Resource Co-Allocation for Hotspot Minimization in Heterogeneous Many-Core NoCs.",
                    "Guiding Power/Quality Exploration for Communication-Intense Stream Processing.",
                    "Graphene-PLA (GPLA): a Compact and Ultra-Low Power Logic Array Architecture.",
                    "A Metastability Immune Timing Error Masking Flip-Flop for Dynamic Variation Tolerance.",
                    "Exploring Configurable Non-Volatile Memory-based Caches for Energy-Efficient Embedded Systems.",
                    "Multiple Attempt Write Strategy for Low Energy STT-RAM.",
                    "Secret Sharing and Multi-user Authentication: From Visual Cryptography to RRAM Circuits.",
                    "Defense Systems and IoT: Security Issues in an Era of Distributed Command and Control.",
                    "Security Meets Nanoelectronics for Internet of Things Applications.",
                    "Tracking Data Flow at Gate-Level through Structural Checking.",
                    "Design of Error-Resilient Logic Gates with Reinforcement Using Implications.",
                    "Reducing Soft-error Vulnerability of Caches using Data Compression.",
                    "Workload-Aware Worst Path Analysis of Processor-Scale NBTI Degradation.",
                    "Enhancing Fault Emulation of Transient Faults by Separating Combinational and Sequential Fault Propagation.",
                    "A Novel On-Chip Impedance Calibration Method for LPDDR4 Interface between DRAM and AP/SoC.",
                    "A General Sign Bit Error Correction Scheme for Approximate Adders.",
                    "RRAM Refresh Circuit: A Proposed Solution To Resolve The Soft-Error Failures For HfO2/Hf 1T1R RRAM Memory Cell.",
                    "Exploratory Power Noise Models of Standard Cell 14, 10, and 7 nm FinFET ICs.",
                    "8T1R: A Novel Low-power High-speed RRAM-based Non-volatile SRAM Design.",
                    "Polynomial Arithmetic Using Sequential Stochastic Logic.",
                    "Ultra-Robust Null Convention Logic Circuit with Emerging Domain Wall Devices.",
                    "Inter-Tier Crosstalk Noise On Power Delivery Networks For 3-D ICs With Inductively-Coupled Interconnects.",
                    "Delay Estimates for Graphene Nanoribbons: A Novel Measure of Fidelity and Experiments with Global Routing Trees.",
                    "VarDroid: Online Variability Emulation in Android/Linux Platforms.",
                    "Neural Network-based Prediction Algorithms for In-Door Multi-Source Energy Harvesting System for Non-Volatile Processors.",
                    "A Unified Model of Power Sources for the Simulation of Electrical Energy Systems.",
                    "Hardware-Accelerated Software Library Drivers Generation for IP-Centric SoC Designs.",
                    "Extracting Designs of Secure IPs Using FPGA CAD Tools.",
                    "Security Primitive Design with Nanoscale Devices: A Case Study with Resistive RAM.",
                    "Enhancing Hardware Security with Emerging Transistor Technologies.",
                    "The Applications of NVM Technology in Hardware Security.",
                    "Survey of Emerging Technology Based Physical Unclonable Funtions.",
                    "Trellis-search based Dynamic Multi-Path Connection Allocation for TDM-NoCs.",
                    "Prolonging Lifetime of Non-volatile Last Level Caches with Cluster Mapping.",
                    "A Low-Power Network-on-Chip Architecture for Tile-based Chip Multi-Processors.",
                    "Dynamic Real-Time Scheduler for Large-Scale MPSoCs.",
                    "Leveraging 3D Technologies for Hardware Security: Opportunities and Challenges.",
                    "FCM: Towards Fine-Grained GPU Power Management for Closed Source Mobile Games.",
                    "Quality of Service-Aware, Scalable Cache Tuning Algorithm in Consumer-based Embedded Devices.",
                    "Temperature-aware Dynamic Voltage Scaling for Near-Threshold Computing.",
                    "Leakage Power Minimization in Deep Sub-Micron Technology by Exploiting Positive Slacks of Dependent Paths.",
                    "An Enhanced Analytical Electrical Masking Model for Multiple Event Transients.",
                    "Capturing True Workload Dependency of BTI-induced Degradation in CPU Components.",
                    "Performance Constraint-Aware Task Mapping to Optimize Lifetime Reliability of Manycore Systems.",
                    "ASIC Implementation of An All-digital Self-adaptive PVTA Variation-aware Clock Generation System.",
                    "Ultra-Low Energy Reconfigurable Spintronic Threshold Logic Gate.",
                    "Red-Shield: Shielding Read Disturbance for STT-RAM Based Register Files on GPUs.",
                    "Modeling and Study of Two-BDT-Nanostructure based Sequential Logic Circuits.",
                    "Exploring Main Memory Design Based on Racetrack Memory Technology.",
                    "An Offline Frequent Value Encoding for Energy-Efficient MLC/TLC Non-volatile Memories.",
                    "Low-Power Multi-Port Memory Architecture based on Spin Orbit Torque Magnetic Devices.",
                    "Optimizing the Operating Voltage of Tunnel FET-Based SRAM Arrays Equipped with Read/Write Assist Circuitry.",
                    "Approximate Differential Encoding for Energy-Efficient Serial Communication.",
                    "Fast Thermal Simulation using SystemC-AMS.",
                    "Learning-Based Near-Optimal Area-Power Trade-offs in Hardware Design for Neural Signal Acquisition.",
                    "Load Balanced On-Chip Power Delivery for Average Current Demand."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "25th ACM Great Lakes Symposium on VLSI 2015",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2015",
                "sub_name": "Proceedings of the 25th edition on Great Lakes Symposium on VLSI, GLVLSI 2015, Pittsburgh, PA, USA, May 20 - 22, 2015.",
                "count": 78,
                "papers": [
                    "Digital Microfluidic Biochips: Towards Functional Diversity, More than Moore, and Cyberphysical Integration.",
                    "Efficient Test Application for Rapid Multi-Temperature Testing.",
                    "Playing with Fire: Transactional Memory Revisited for Error-Resilient and Energy-Efficient MPSoC Execution.",
                    "DRAM based Intrinsic Physical Unclonable Functions for System Level Security.",
                    "An Effective TSV Self-Repair Scheme for 3D-Stacked ICs.",
                    "Electromigration-aware Clock Tree Synthesis for TSV-based 3D-ICs.",
                    "Layout Characterization and Power Density Analysis for Shorted-Gate and Independent-Gate 7nm FinFET Standard Cells.",
                    "Exploiting the Expressive Power of Graphene Reconfigurable Gates via Post-Synthesis Optimization.",
                    "A Simulation Framework for Analyzing Transient Effects Due to Thermal Noise in Sub-Threshold Circuits.",
                    "Design of Approximate Unsigned Integer Non-restoring Divider for Inexact Computing.",
                    "Efficient Reliability Analysis of Processor Datapath using Atomistic BTI Variability Models.",
                    "Reconfigurable Silicon-Photonic Network with Improved Channel Sharing for Multicore Architectures.",
                    "A High-Speed Robust NVM-TCAM Design Using Body Bias Feedback.",
                    "Characterizing the Activity Factor in NBTI Aging Models for Embedded Cores.",
                    "Improving Lifetime of Multicore Soft Real-Time Systems through Global Utilization Control.",
                    "Directed Self-Assembly Based Cut Mask Optimization for Unidirectional Design.",
                    "Skew Bounded Buffer Tree Resynthesis For Clock Power Optimization.",
                    "Novel Designs of Embedded Hybrid Cells for High Performance Memory Circuits.",
                    "Dataline Isolated Differential Current Feed/Mode Sense Amplifier for Small Icell SRAM Using FinFET.",
                    "Statistically Validating the Impact of Process Variations on Analog and Mixed Signal Designs.",
                    "The Bit-Nibble-Byte MicroEngine (BnB) for Efficient Computing on Short Data.",
                    "Reduced-latency LLR-based SC List Decoder for Polar Codes.",
                    "Delay, Power and Energy Tradeoffs in Deep Voltage-scaled FPGAs.",
                    "Phase-based Cache Locking for Embedded Systems.",
                    "A Multilayered Design Approach for Efficient Hybrid 3D Photonics Network-on-chip.",
                    "Analyzing the Dark Silicon Phenomenon in a Many-Core Chip Multi-Processor under Deeply-Scaled Process Technologies.",
                    "Small-World Network Enabled Energy Efficient and Robust 3D NoC Architectures.",
                    "A Dynamically Reconfigurable RF NoC for Many-Core.",
                    "Computational Thinking Meets Design Thinking: Technology and Arts Collaborations.",
                    "Graphene Neural Sensors for Next Generation In Vivo Imaging and Optogenetics.",
                    "Online and Operand-Aware Detection of Failures Utilizing False Alarm Vectors.",
                    "Speed Binning Using Machine Learning And On-chip Slack Sensors.",
                    "Reconfigurable: Self Adaptive Fault Tolerant Cache Memory for DVS enabled Systems.",
                    "Untrusted Third Party Digital IP Cores: Power-Delay Trade-off Driven Exploration of Hardware Trojan Secured Datapath during High Level Synthesis.",
                    "Multi Replica Bitline Delay Technique for Variation Tolerant Timing of SRAM Sense Amplifiers.",
                    "MSCS: Multi-hop Segmented Circuit Switching.",
                    "EDA Challenges for Memristor-Crossbar based Neuromorphic Computing.",
                    "Energy Efficient RRAM Spiking Neural Network for Real Time Classification.",
                    "On-chip Sparse Learning with Resistive Cross-point Array Architecture.",
                    "Origami: A Convolutional Network Accelerator.",
                    "Restricted Clustered Neural Network for Storing Real Data.",
                    "NeuroDSP Accelerator for Face Detection Application.",
                    "Space Oblivious Compression: Power Reduction for Non-Volatile Main Memories.",
                    "Flip-Mirror-Rotate: An Architecture for Bit-write Reduction and Wear Leveling in Non-volatile Memories.",
                    "Fine-Grained Voltage Boosting for Improving Yield in Near-Threshold Many-Core Processors.",
                    "Approximate Multiplier Architectures Through Partial Product Perforation: Power-Area Tradeoffs Analysis.",
                    "A SystemC Platform for Signal Transduction Modelling and Simulation in Systems Biology.",
                    "Yield-aware Performance-Cost Characterization for Multi-Core SIMT.",
                    "An Efficient Approach to Sample On-Chip Power Supplies.",
                    "Dynamic Bitstream Length Scaling Energy Effective Stochastic LDPC Decoding.",
                    "Dynamic Power Reduction Techniques in On-Chip Photonic Interconnects.",
                    "Design and Characterization of Analog-to-Digital Converters using Graphene P-N Junctions.",
                    "A Ternary Content Addressable Cell Using a Single Phase Change Memory (PCM).",
                    "Characterization of SWCNT Bundle Based VLSI Interconnect with Self-heating Induced Scatterings.",
                    "A Novel True Random Number Generator Design Leveraging Emerging Memristor Technology.",
                    "TFET-based Operational Transconductance Amplifier Design for CNN Systems.",
                    "Clock Skew Scheduling in the Presence of Heavily Gated Clock Networks.",
                    "Standard Cell Layout Regularity and Pin Access Optimization Considering Middle-of-Line.",
                    "Inevitability of Phase-locking in a Charge Pump Phase Lock Loop using Deductive Verification.",
                    "A Novel Static D-Flip-Flop Topology for Low Swing Clocking.",
                    "Voltage-Boosted Synchronizers.",
                    "Recent Advances in Brain-controlled Prosthetics for Paralysis: Friday Keynote.",
                    "Formal Analysis Provides Parameters for Guiding Hyperoxidation in Bacteria using Phototoxic Proteins.",
                    "Design Automation for Biological Models: A Pipeline that Incorporates Spatial and Molecular Complexity.",
                    "Mammalian Synthetic Gene Networks.",
                    "Automation of Biological Model Learning, Design and Analysis.",
                    "On the Functions Realized by Stochastic Computing Circuits.",
                    "ApproxMA: Approximate Memory Access for Dynamic Precision Scaling.",
                    "A Comparative Review and Evaluation of Approximate Adders.",
                    "Minimizing Error of Stochastic Computation through Linear Transformation.",
                    "Experimental Validation of a Faithful Binary Circuit Model.",
                    "Lookup Table Based Discrete Gate Sizing for Delay Minimization with Modified Elmore Delay Model.",
                    "A Novel Framework for Temperature Dependence Aware Clock Skew Scheduling.",
                    "Dynamic Task Priority Scaling for Thermal Management of Multi-core Processors with Heavy Workload.",
                    "Reinforcement Learning for Thermal-aware Many-core Task Allocation.",
                    "Revisiting Dynamic Thermal Management Exploiting Inverse Thermal Dependence.",
                    "Adaptive Bandwidth Management for Performance-Temperature Trade-offs in Heterogeneous HMC+DDRx Memory.",
                    "Optimizing VMIN of ROM Arrays Without Loss of Noise Margin."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "24th ACM Great Lakes Symposium on VLSI 2014",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2014",
                "sub_name": "Great Lakes Symposium on VLSI 2014, GLSVLSI '14, Houston, TX, USA - May 21 - 23, 2014.",
                "count": 80,
                "papers": [
                    "VLSI systems for neurocomputing and health informatics.",
                    "Hardening QDI circuits against transient faults using delay-insensitive maxterm synthesis.",
                    "System-level reliability exploration framework for heterogeneous MPSoC.",
                    "A TSV-cross-link-based approach to 3D-clock network synthesis for improved robustness.",
                    "A feasibility study on robust programmable delay element design based on neuron-MOS mechanism.",
                    "Horizontal benchmark extension for improved assessment of physical CAD research.",
                    "OCV-aware top-level clock tree optimization.",
                    "Modeling of the charging behavior of li-ion batteries based on manufacturer's data.",
                    "High level energy modeling of controller logic in data caches.",
                    "3D-SWIFT: a high-performance 3D-stacked wide IO DRAM.",
                    "Minimum implant area-aware gate sizing and placement.",
                    "A multi-stage leakage aware resource management technique for reconfigurable architectures.",
                    "A performance enhancing hybrid locally mesh globally star NoC topology.",
                    "VLSI implementation of linear MIMO detection with boosted communications performance: extended abstract.",
                    "Energy optimal sizing of FinFET standard cells operating in multiple voltage regimes using adaptive independent gate control.",
                    "A low power high resolution digital PWM with process and temperature calibrations for digital controlled DC-DC converters.",
                    "WeDBless: weighted deflection bufferless router for mesh NoCs.",
                    "Trade-off between energy and quality of service through dynamic operand truncation and fusion.",
                    "A novel low-power and in-place split-radix FFT processor.",
                    "H.264 8x8 inverse transform architecture optimization.",
                    "Energy-efficient wireless network-on-chip architecture with log-periodic on-chip antennas.",
                    "Customizing an open source processor to fit in an ultra-low power cluster with a shared L1 memory.",
                    "Performance modeling of virtualized custom logic computations.",
                    "Scheduling of PDE setting and timing tests for post-silicon skew tuning with timing margin: [extended abstract].",
                    "An area efficient low power high speed S-Box implementation using power-gated PLA.",
                    "FPGA based implementation of a genetic algorithm for ARMA model parameters identification.",
                    "Highly adaptive and congestion-aware routing for 3D NoCs.",
                    "Adaptive compressive sensing for low power wireless sensors.",
                    "Regulator-gating: adaptive management of on-chip voltage regulators.",
                    "Logic block and design methodology for via-configurable structured ASIC using dual supply voltages.",
                    "Squash: a scalable quantum mapper considering ancilla sharing.",
                    "Design and analysis of robust and wide operating low-power level-shifter for embedded dynamic random access memory.",
                    "A study on the use of parallel wiring techniques for sub-20nm designs.",
                    "Create, then innovate.",
                    "Smart nodes of internet of things (IoT): a hardware perspective view & implementation.",
                    "WriteSmoothing: improving lifetime of non-volatile caches using intra-set wear-leveling.",
                    "Reliability-aware cross-point resistive memory design.",
                    "Using adaptive read voltage thresholds to enhance the reliability of MLC NAND flash memory systems.",
                    "A new methodology for reduced cost of resilience.",
                    "A hybrid framework for application allocation and scheduling in multicore systems with energy harvesting.",
                    "Neural network-based accelerators for transcendental function approximation.",
                    "Efficient parallel beamforming for 3D ultrasound imaging.",
                    "A task-oriented vision system.",
                    "A new DRAM architecture and its control method for the system power consumption.",
                    "A memory mapping approach based on network customization to design conflict-free parallel hardware architectures.",
                    "New 4T-based DRAM cell designs.",
                    "MB-FICA: multi-bit fault injection and coverage analysis.",
                    "On-line detection of the deadlocks caused by permanently faulty links in quasi-delay insensitive networks on chip.",
                    "A novel parallel adaptation of an implicit path delay grading method.",
                    "Simscape design flow for memristor based programmable oscillators.",
                    "Securely outsourcing power grid simulation on cloud.",
                    "An automated design approach to map applications on CGRAs.",
                    "He-P2012: architectural heterogeneity exploration on a scalable many-core platform.",
                    "On macro-fault: a new fault model, its implications on fault tolerance and manufacturing yield.",
                    "Transient analysis of gate inside junctionless transistor (GI-JLT).",
                    "Built-in generation of functional broadside tests considering primary input constraints.",
                    "TSV power supply array electromigration lifetime analysis in 3D ICS.",
                    "A current-mode CMOS/memristor hybrid implementation of an extreme learning machine.",
                    "Modelling and mitigation of time-zero variability in sub-16nm finfet-based STT-MRAM memories.",
                    "A design flow for physical synthesis of digital cells with ASTRAN.",
                    "A semi-formal approach for analog circuits behavioral properties verification.",
                    "Reconfigurable STT-NV LUT-based functional units to improve performance in general-purpose processors.",
                    "A generic implementation of a quantified predictor on FPGAs.",
                    "A dual-rail LUT for reconfigurable logic using null convention logic.",
                    "A complete electronic network interface architecture for global contention-free communication over emerging optical networks-on-chip.",
                    "A design approach to automatically generate on-chip monitors during high-level synthesis of hardware accelerator.",
                    "Thermal-aware phase-based tuning of embedded systems.",
                    "EDA for extreme scale systems: design abstractions, metrics, and benchmarks.",
                    "Hardware trojan attacks in FPGA devices: threat analysis and effective counter measures.",
                    "Forward-scaling, serially equivalent parallelism for FPGA placement.",
                    "A parallel and reconfigurable architecture for efficient OMP compressive sensing reconstruction.",
                    "Generation of reduced analog circuit models using transient simulation traces.",
                    "A novel mixed-signal self-calibration technique for baseband filters in systems-on-chip mobile transceivers.",
                    "A qualitative simulation approach for verifying PLL locking property.",
                    "Optimal power switch design methodology for ultra dynamic voltage scaling with a limited number of power rails.",
                    "Level shifter planning for timing constrained multi-voltage SoC floorplanning.",
                    "Exploiting heterogeneity in MPSoCs to prevent potential trojan propagation across malicious IPs.",
                    "Optically reconfigurable gate array with an angle-multiplexed holographic memory.",
                    "Variability-aware design of double gate FinFET-based current mirrors.",
                    "A comparison of FinFET based FPGA LUT designs."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "23rd ACM Great Lakes Symposium on VLSI 2013",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2013",
                "sub_name": "Great Lakes Symposium on VLSI 2013 (part of ECRC), GLSVLSI'13, Paris, France, May 2-4, 2013.",
                "count": 73,
                "papers": [
                    "A novel statistical and circuit-based technique for counterfeit detection in existing ICs.",
                    "Unexcitability analysis of SEus affecting the routing structure of SRAM-based FPGAs.",
                    "A novel intermittent fault Markov model for deep sub-micron processors.",
                    "High-endurance hybrid cache design in CMP architecture with cache partitioning and access-aware policy.",
                    "Harvesting-aware energy management for multicore platforms with hybrid energy storage.",
                    "Early stage power management for 3D FPGAs considering hierarchical routing resources.",
                    "A low power 6t-SRAM using negative bit-line for variability tolerance beyond 22nm node.",
                    "Virtual register renaming: energy efficient substrate for continual flow pipelines.",
                    "Skew-bounded low swing clock tree optimization.",
                    "Coordinating prefetching and STT-RAM based last-level cache management for multicore systems.",
                    "Variability-aware design of energy-delay optimal linear pipelines operating in the near-threshold regime and above.",
                    "An energy-efficient truly all-digital temperature sensor for SoC applications.",
                    "Efficient characterization of TSV-to-transistor noise coupling in 3D ICs.",
                    "A portable high-frequency digitally controlled oscillator (DCO).",
                    "A 250mV sub-threshold asynchronous 8051microcontroller with a novel 16T SRAM cell for improved reliability in 40nm CMOS.",
                    "GPU implementation of a scalable non-linear congruential generator for cryptography applications.",
                    "Fast and memory-efficient GPU implementations of krylov subspace methods for efficient power grid analysis.",
                    "Translation validation of scheduling in high level synthesis.",
                    "LASER: layout-aware analog synthesis environment on laker.",
                    "Hardware acceleration of retinal blood vasculature segmentation.",
                    "A 191μW BPSK demodulator for data and power telemetry in biomedical implants.",
                    "Custom memory architecture for multi-core implementation of face detection algorithm.",
                    "A novel and improved design of a ternary CNTFET-based cell.",
                    "Variability evaluation of feedback circuits used in nanoelectronic Memristive/CMOS circuits.",
                    "Asymmetric-access aware optimization for STT-RAM caches with process variations.",
                    "A new extension method of retention time for memory cell on dynamic random access memory.",
                    "A hardware-oriented dynamically adaptive disparity estimation algorithm and its real-time hardware.",
                    "A source-synchronous Htree-based network-on-chip.",
                    "A parallel VLSI architecture for Markov chain Monte Carlo based MIMO detection.",
                    "Scaling RTL property checking using feasible path analysisand decomposition.",
                    "SIREN: a depth-first search algorithm for the filter design optimization problem.",
                    "Generating concise assertions with complete coverage.",
                    "Efficient transistor-level design of CMOS gates.",
                    "Electronics for a greener planet.",
                    "Assignment of adjustable delay buffers for clock skew minimization in multi-voltage mode designs.",
                    "Multi-corner multi-voltage domain clock mesh design.",
                    "Combating NBTI-induced aging in data caches.",
                    "Performance/reliability trade-off in superscalar processors for aggressive NBTI restoration of functional units.",
                    "Delay model for reconfigurable logic gates based on graphene PN-junctions.",
                    "Analysis of the area-delay performance of hybrid nanoelectronic memory cores used in field programmable gate arrays.",
                    "DRMA: dynamically reconfigurable MPSoC architecture.",
                    "A compact FPGA-based montgomery multiplier over prime fields.",
                    "On the design of modulo 2n-1 cubing units.",
                    "An error tolerant CAM with nand match-line organization.",
                    "Efficient modulo 2n+1 multiplication for the idea block cipher.",
                    "An asymmetric adaptive-precision energy-efficient 3DIC multiplier.",
                    "Geometric approach to chip-scale TSV shield placement for the reduction of TSV coupling in 3D-ICs.",
                    "Thermal stress aware 3D-IC statistical static timing analysis.",
                    "Effect of TSV fabrication technology on power distribution in 3D ICs.",
                    "Multi-port FinFET SRAM design.",
                    "Modeling symmetrical independent gate FinFET using predictive technology model.",
                    "A self-tuning multi-objective optimization framework for geometric programming with gate sizing applications.",
                    "Low power 3-D stacking multimedia platform with reconfigurable memory architecture.",
                    "High frame-rate low-power compressive sampling CMOS image sensor architecture: [extended abstract].",
                    "A 9-bit 50msps SAR ADC with pre-charge VCM -based double input range algorithm.",
                    "An evaluation of an AES implementation protected against EM analysis.",
                    "PBD: packet buffer DVFs.",
                    "A memory mapping approach for network and controller optimization in parallel interleaver architectures.",
                    "Post-route refinement for high-frequency PCBs considering meander segment alleviation.",
                    "On-chip area-efficient binary sequence storage.",
                    "Power gating topologies in TSV based 3D integrated circuits.",
                    "Architecture and 3D device simulation of a PIN diode-based Gamma radiation detector.",
                    "Set-cover-based critical implications selection to improvesat-based bounded model checking: extended abstract.",
                    "Circuit design of a novel adaptable and reliable L1 data cache.",
                    "Physical design exploration of 3D tree-based FPGA architecture.",
                    "Co-optimization of TSV assignment and micro-channel placement for 3D-ICs.",
                    "Lifetime reliability assessment with aging information from low-level sensors.",
                    "A hardware-efficient architecture for embedded real-time cascaded support vector machines classification.",
                    "Pipeline template and scheduling algorithm for mapping multiple loop nests on FPGA with limited resources.",
                    "Study of ASIC technology impact factors on performance evaluation of SHA-3 candidates.",
                    "Timing-constrained replacement using spare cells for design changes.",
                    "Rotary traveling wave oscillator frequency division at nanoscale technologies.",
                    "Reversible synthesis of symmetric boolean functions based on unate decomposition."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "22nd ACM Great Lakes Symposium on VLSI 2012",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2012",
                "sub_name": "Great Lakes Symposium on VLSI 2012, GLSVLSI'12, Salt Lake City, UT, USA, May 3-4, 2012.",
                "count": 73,
                "papers": [
                    "The role of photonics in future data centers.",
                    "Ambipolar double-gate FETs for the design of compact logic structures.",
                    "Performance and energy models for memristor-based 1T1R RRAM cell.",
                    "Accelerating thermal simulations of 3D ICs with liquid cooling using neural networks.",
                    "Efficient CMOL nanoscale hybrid circuit cell assignment using simulated evolution heuristic.",
                    "SNR analysis approach for hardware/software partitioning using dynamically adaptable fixed point representation.",
                    "NBTI mitigation in microprocessor designs.",
                    "A noise-immune sub-threshold circuit design based on selective use of Schmitt-trigger logic.",
                    "Efficient selection and analysis of critical-reliability paths and gates.",
                    "Breaking the power delivery wall using voltage stacking.",
                    "An efficient CPI stack counter architecture for superscalar processors.",
                    "An optimized multicore cache coherence design for exploiting communication locality.",
                    "Parallel pipelined FFT architectures with reduced number of delays.",
                    "Design of an RNS reverse converter for a new five-moduli special set.",
                    "On the automatic synthesis of parallel SW from RTL models of hardware IPs.",
                    "Top-down-based symmetrical buffered clock routing.",
                    "Optimal register-type selection during resource binding in flip-flop/latch-based high-level synthesis.",
                    "A fully integrated switched-capacitor DC-DC converter with dual output for low power application.",
                    "High-level modeling of power consumption in active linear analog circuits.",
                    "A novel power-gating scheme utilizing data retentiveness on caches.",
                    "A zero-overhead IC identification technique using clock sweeping and path delay analysis.",
                    "RAPA: reliability-aware priority arbitration strategy for network on chip.",
                    "A high-performance online assay interpreter for digital microfluidic biochips.",
                    "Reliable logic mapping on Nano-PLA architectures.",
                    "Self adaptive body biasing scheme for leakage power reduction in nanoscale CMOS circuit.",
                    "Synchronization scheme for brick-based rotary oscillator arrays.",
                    "A low-power all-digital GFSK demodulator with robust clock data recovery.",
                    "Link breaking methodology: mitigating noise within power networks.",
                    "Unifying functional and parametric timing verification.",
                    "New & improved models for SAT-based bi-decomposition.",
                    "Lithography-aware layout compaction.",
                    "A design approach dedicated to network-based and conflict-free parallel interleavers.",
                    "Distributed sensor data processing for many-cores.",
                    "CMOS compatible many-core noc architectures with multi-channel millimeter-wave wireless links.",
                    "Voltage island-driven power optimization for application specific network-on-chip design.",
                    "Design-time performance evaluation of thermal management policies for SRAM and RRAM based 3D MPSoCs.",
                    "TSUNAMI: a light-weight on-chip structure for measuring timing uncertainty induced by noise during functional and test operations.",
                    "Lazy suspect-set computation: fault diagnosis for deep electrical bugs.",
                    "Influence of different layout styles on the performance of the calibration of an on-chip programmable voltage reference.",
                    "Input and transistor reordering for NBTI and HCI reduction in complex CMOS gates.",
                    "Memristor: the illusive device.",
                    "InMnAs magnetoresistive spin-diode logic.",
                    "An efficient approach for designing and minimizing reversible programmable logic arrays.",
                    "Modeling a single electron turnstile in HSPICE.",
                    "Limits of writing multivalued resistances in passive nanoelectronic crossbars used in neuromorphic circuits.",
                    "Stepwise sleep depth control for run-time leakage power saving.",
                    "An efficient power estimation methodology for complex RISC processor-based platforms.",
                    "ADAM: an efficient data management mechanism for hybrid high and ultra-low voltage operation caches.",
                    "A low stand-by power start-up circuit for SMPS PWM controller.",
                    "Particle swarm optimization over non-polynomial metamodels for fast process variation resilient design of Nano-CMOS PLL.",
                    "A denial-of-service resilient wireless NoC architecture.",
                    "Sustainable multi-core architecture with on-chip wireless links.",
                    "SRAM leakage in CMOS, FinFET and CNTFET technologies: leakage in 8t and 6t sram cells.",
                    "A novel hybrid FIFO asynchronous clock domain crossing interfacing method.",
                    "Density-reduction-oriented layer assignment for rectangle escape routing.",
                    "NBTI effects on tree-like clock distribution networks.",
                    "A framework for high-level synthesis of heterogeneous MP-SoC.",
                    "Memory-based computing for performance and energy improvement in multicore architectures.",
                    "Share memory aware scheduler: balancing performance and fairness.",
                    "Alleviating NBTI-induced failure in off-chip output drivers.",
                    "Mitigating electromigration of power supply networks using bidirectional current stress.",
                    "Multiplexed switch box architecture in three-dimensional FPGAs to reduce silicon area and improve TSV usage.",
                    "A scalable threshold logic synthesis method using ZBDDs.",
                    "A memristor-based TCAM (ternary content addressable memory) cell: design and evaluation.",
                    "Extending symmetric variable-pair transitivities using state-space transformations.",
                    "Crosslink insertion for variation-driven clock network construction.",
                    "WRIP: logic restructuring techniques for wirelength-driven incremental placement.",
                    "STEP: a unified design methodology for secure test and IP core protection.",
                    "Towards systolic hardware acceleration for local complexity analysis of massive genomic data.",
                    "A dual-phase compression mechanism for hybrid DRAM/PCM main memory architectures.",
                    "Verilog-AMS-PAM: verilog-AMS integrated with parasitic-aware metamodels for ultra-fast and layout-accurate mixed-signal design exploration.",
                    "Efficient folded VLSI architectures for linear prediction error filters.",
                    "Synergistic integration of code encryption and compression in embedded systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "21st ACM Great Lakes Symposium on VLSI 2011",
        "info": "Lausanne, Switzerland",
        "venues": []
    },
    {
        "year": "2010",
        "name": "20th ACM Great Lakes Symposium on VLSI 2010",
        "info": "Providence, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2011",
                "sub_name": "Proceedings of the 21st ACM Great Lakes Symposium on VLSI 2010, Lausanne, Switzerland, May 2-6, 2011.",
                "count": 92,
                "papers": [
                    "An arbiter based on-chip droop detector system.",
                    "A programmable and scalable technique to design spintronic logic circuits based on magnetic tunnel junctions.",
                    "Logic synthesis for integrated optics.",
                    "Fine-grain reconfigurable logic cells based on double-gate CNTFETs.",
                    "RAMA: a self-assembled multiferroic magnetic QCA for low power systems.",
                    "VISION: a framework for voltage island aware synthesis of interconnection networks-on-chip.",
                    "Rover: routing on via-configurable fabrics for standard-cell-like structured ASICs.",
                    "Run-time energy management of manycore systems through reconfigurable interconnects.",
                    "Congestion and track usage improvement of large FPGAs using metro-on-FPGA methodology.",
                    "Multi-objective topology synthesis and FPGA prototyping framework of application specific network-on-chip.",
                    "Efficient shift-adds design of digit-serial multiple constant multiplications.",
                    "Accelerating Itoh-Tsujii multiplicative inversion algorithm for FPGAs.",
                    "FPGA implementation of binary edwards curve usingternary representation.",
                    "Design of low-power multiple constant multiplications using low-complexity minimum depth operations.",
                    "High performance technique for database applicationsusing a hybrid GPU/CPU platform.",
                    "Design and management of 3D-stacked NUCA cache for chip multiprocessors.",
                    "Design techniques to improve the device write margin for MRAM-based cache memory.",
                    "DRAM energy reduction by prefetching-based memory traffic clustering.",
                    "A low-power TCAM design using mask-aware match-line (MAML) technique.",
                    "Hardware-assisted dynamic power and thermal management in multi-core SoCs.",
                    "A 7T SRAM bit-cell for low-power embedded memories.",
                    "A static-switching pulse domino technique for statistical power reduction of wide fan-in dynamic gates.",
                    "A 45.6μ2 13.4μw 7.1v/v resolution sub-threshold based digital process-sensing circuit in 45nm CMOS.",
                    "A new balanced 4-moduli set {2k, 2n - 1, 2n + 1, 2n+1-1} and its reverse converter design for efficient fir filter implementation.",
                    "Towards robust nano-CMOS sense amplifier design: a dual-threshold versus dual-oxide perspective.",
                    "A design methodology for the automatic sizing of standard-cell libraries.",
                    "Integration of behavioral synthesis and floorplanning for asynchronous circuits with bundled-data implementation.",
                    "Coupling latency-insensitivity with variable-latency for better than worst case design: a RISC case study.",
                    "Reconfigurable controllers for synchronization via wagging.",
                    "Variation-immune quasi delay-insensitive implementation on nano-crossbar arrays.",
                    "An efficient algorithm for custom instruction enumeration.",
                    "An approximation algorithm for cofactoring-based synthesis.",
                    "Obstacle-avoiding and slew-constrained buffered clock tree synthesis for skew optimization.",
                    "New optimal layer assignment for bus-oriented escape routing.",
                    "Acceleration of random-walk-based linear circuit analysis using importance sampling.",
                    "A 65 nm CMOS low power RF front-end for L1/E1 GPS/Galileo signals.",
                    "Simulation-based equivalence checking between SystemC models at different levels of abstraction.",
                    "Fast high-performance algorithms for multi-pin droplet routing in digital microfluidic biochips.",
                    "A countermeasure against power analysis attacks for FSR-based stream ciphers.",
                    "Low jitter audio range PLL with ultra low power dissipation.",
                    "Layout-aware variation evaluation of analog circuits and its validity on op-amp designs.",
                    "A linear programming approach for minimum NBTI vector selection.",
                    "Fitting standard cell performance to generalized Lambda distributions.",
                    "Stress aware switching activity driven low power design of critical paths in nanoscale CMOS circuits.",
                    "Simultaneous variation-aware architecture exploration and task scheduling for MPSoC energy minimization.",
                    "Impact of positive bias temperature instability (PBTI) on 3T1D-DRAM cells.",
                    "Redundancy in SAR ADCs.",
                    "A high sensitivity and process tolerant digital thermal sensing scheme for 3-D Ics.",
                    "Buffering of frequent accesses for reduced cache aging.",
                    "Combined architecture and hardening techniques exploration for reliable embedded system design.",
                    "Ordered coloring-based resource binding for datapaths with improved skew-adjustability.",
                    "Power estimation of dividers implemented in FPGAs.",
                    "Nanometer-scale standard cell library for enhanced redundant via1 insertion rate.",
                    "Circuit design of a dual-versioning L1 data cache for optimistic concurrency.",
                    "Real-time address trace compression for emulated and real system-on-chip processor core debugging.",
                    "Investigating modern layout representations for improved 3d design automation.",
                    "Design and failure analysis of logic-compatible multilevel gain-cell-based dram for fault-tolerant VLSI systems.",
                    "Power efficient partial product compression.",
                    "Evaluation of FPGA routing architectures under process variation.",
                    "High resolution MASH 2-2 Sigma Delta interface for capacitive accelerometers.",
                    "Influence of metallic tubes on the reliability of CNTFET SRAMs: error mechanisms and countermeasures.",
                    "A new low power and area efficient semi-digital PLL architecture for low bandwidth applications.",
                    "SIAR: splitting-graph-based interactive analog router.",
                    "A comparative study of state-of-the-art low-power CAM match-line sense amplifier designs.",
                    "Sensitivity of neuromorphic circuits using nanoelectronic resistive switches to pulse synchronization.",
                    "A dual-core system solution for wearable health monitors.",
                    "Robust signaling techniques for through silicon via bundles.",
                    "Efficient realization of RTD-CMOS logic gates.",
                    "On residue removal in digital microfluidic biochips.",
                    "Repeater insertion in power-managed VLSI systems.",
                    "Experimental demonstration of standby power reduction using voltage stacking in an 8Kb embedded FDSOI SRAM.",
                    "Handling intra-die variations in PSTA.",
                    "Integrated logic synthesis using simulated annealing.",
                    "A geometric programming aided knowledge based approach for analog circuit synthesis and sizing.",
                    "Analyzing throughput of power and thermal-constraint multicore processor under NBTI effect.",
                    "Efficient method to compute minimum decision chains of Boolean functions.",
                    "Time-mode reconstruction iir filters for ΣΔ phase modulation applications.",
                    "SMECY: smart multi-core embedded systems.",
                    "Magnetic memory (MRAM), a new area for 2D and 3D SoC/SiP design.",
                    "Design of MRAM based logic circuits and its applications.",
                    "Instant power-on nonvolatile FPGA based on MTJ/MOS-hybrid circuitry.",
                    "Enabling architectural innovations using non-volatile memory.",
                    "Challenges for non-volatile memory & logic manufacturing utilizing magnetic tunnel junction on 300 mm wafer.",
                    "Hardware security in VLSI.",
                    "Integrated circuits metering for piracy protection and digital rights management: an overview.",
                    "Physically unclonable functions: manufacturing variability as an unclonable device identifier.",
                    "The future of high-speed cryptography: new computing platforms and new ciphers.",
                    "Quantum devices and optical computing: introduction.",
                    "Optically leviting dielectrics in the quantum regime.",
                    "Quantum information processing beyond polarization encoding.",
                    "Solid state optical quantum memories.",
                    "Deeply-scaled CMOS-integrated nanophotonic devices for next generation supercomputers."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "19th ACM Great Lakes Symposium on VLSI 2009",
        "info": "Boston Area, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2010",
                "sub_name": "Proceedings of the 20th ACM Great Lakes Symposium on VLSI 2009, Providence, Rhode Island, USA, May 16-18 2010.",
                "count": 93,
                "papers": [
                    "A novel design framework for the design of reconfigurable systems based on NoCs.",
                    "A new physical routing approach for robust bundled signaling on NoC links.",
                    "Bus via reduction based on floorplan revising.",
                    "Timing-driven variation-aware nonuniform clock mesh synthesis.",
                    "Scaling power/ground solvers on multi-core with memory bandwidth awareness.",
                    "Bus-pin-aware bus-driven floorplanning.",
                    "8Gb/s capacitive low power and high speed 4-PWAM transceiver design.",
                    "A low power, variable resolution two-step flash ADC.",
                    "A low-offset high-speed double-tail dual-rail dynamic latched comparator.",
                    "Via configurable three-input lookup-tables for structured ASICs.",
                    "Variation tolerant 9T SRAM cell design.",
                    "Stochastic computational models for accurate reliability evaluation of logic circuits.",
                    "A multi-level approach to reduce the impact of NBTI on processor functional units.",
                    "Graph theoretic approach for scan cell reordering to minimize peak shift power.",
                    "Gating internal nodes to reduce power during scan shift.",
                    "Software adaptation in quality sensitive applications to deal with hardware variability.",
                    "Write activity reduction on flash main memory via smart victim cache.",
                    "Aging effects of leakage optimizations for caches.",
                    "Thermal-aware floorplanning exploration for 3D multi-core architectures.",
                    "A mask double patterning technique using litho simulation by wavelet transform.",
                    "An effective approach for large scale floorplanning.",
                    "A novel resource sharing model and high-level synthesis for delay variability-tolerant datapaths.",
                    "A revisit to voltage partitioning problem.",
                    "Resource-constrained timing-driven link insertion for critical delay reduction.",
                    "Boolean satisfiability on a graphics processor.",
                    "Pattern grading for testing critical paths considering power supply noise and crosstalk using a layout-aware quality metric.",
                    "Improving the testability and reliability of sequential circuits with invariant logic.",
                    "Deterministic broadside test generation for transition path delay faults.",
                    "A delay measurement method using a shrinking clock signal.",
                    "Energy-efficient redundant execution for chip multiprocessors.",
                    "On-die sensors for measuring process and environmental variations in integrated circuits.",
                    "Cost aware fault tolerant logic synthesis in presence of soft errors.",
                    "Design of embedded MRAM macros for memory-in-logic applications.",
                    "Topology impact on the room temperature performance of THz-range ballistic deflection transistors.",
                    "Performance assessment of analog circuits with carbon nanotube FET (CNFET).",
                    "Read-out schemes for a CNTFET-based crossbar memory.",
                    "Synthetic biology: from modules to systems.",
                    "Dominant critical gate identification for power and yield optimization in logic circuits.",
                    "Logic synthesis for low power using clock gating and rewiring.",
                    "Dynamically resizable binary decision diagrams.",
                    "Fast instruction cache modeling for approximate timed HW/SW co-simulation.",
                    "Clock skew reduction by self-compensating manufacturing variability with on-chip sensors.",
                    "Online convex optimization-based algorithm for thermal management of MPSoCs.",
                    "Overscaling-friendly timing speculation architectures.",
                    "A model to exploit power-performance efficiency in superscalar processors via structure resizing.",
                    "Thermal-aware compilation for system-on-chip processing architectures.",
                    "A linear statistical analysis for full-chip leakage power with spatial correlation.",
                    "Semi-analytical model for schottky-barrier carbon nanotube and graphene nanoribbon transistors.",
                    "Lightweight runtime control flow analysis for adaptive loop caching.",
                    "Low power nanoscale buffer management for network on chip routers.",
                    "TURBONFS: turbo nand flash search.",
                    "Write buffer-oriented energy reduction in the L1 data cache of two-level caches for the embedded system.",
                    "Graphene tunneling FET and its applications in low-power circuit design.",
                    "Scalable identification of threshold logic functions.",
                    "Manufacturing yield of QCA circuits by synthesized DNA self-assembled templates.",
                    "Numerical queue solution of thermal noise-induced soft errors in subthreshold CMOS devices.",
                    "Design considerations for variation tolerant multilevel CMOS/Nano memristor memory.",
                    "An integrated thermal estimation framework for industrial embedded platforms.",
                    "Power-efficient, reliable microprocessor architectures: modeling and design methods.",
                    "Performance and energy trade-offs analysis of L2 on-chip cache architectures for embedded MPSoCs.",
                    "A virtual platform environment for exploring power, thermal and reliability management control strategies in high-performance multicores.",
                    "Challenges and methodologies for efficient power budgeting across the die.",
                    "A DOE-ILP assisted conjugate-gradient based power and stability optimization in High-K Nano-CMOS SRAM.",
                    "Line width optimization for interdigitated power/ground networks.",
                    "Thermal-aware voltage droop compensation for multi-core architectures.",
                    "Analysis and mitigation of NBTI-impact on PVT variability in repeated global interconnect performance.",
                    "Collaborative voltage scaling with online STA and variable-latency datapath.",
                    "AOP-based high-level power estimation in SystemC.",
                    "A novel crosstalk quantitative approach for simultaneously reducing power, noise, and delay based on bus-invert encoding schemes.",
                    "The challenges of implementing fine-grained power gating.",
                    "Performance and energy efficient cache migrationapproach for thermal management in embedded systems.",
                    "Performance enhancement of subthreshold circuits using substrate biasing and charge-boosting buffers.",
                    "Reliability analysis of power gated SRAM under combined effects of NBTI and PBTI in nano-scale CMOS.",
                    "On-chip point-of-load voltage regulator for distributed power supplies.",
                    "VLSI implementation of a non-linear feedback shift register for high-speed cryptography applications.",
                    "Out-of-order issue logic using sorting networks.",
                    "On-chip power supply noise and its implications on timing.",
                    "Characteristics of MS-CMOS logic in sub-32nm technologies.",
                    "A self-adaptive scheduler for asymmetric multi-cores.",
                    "Context-aware TLB preloading for interference reduction in embedded multi-tasked systems.",
                    "Design of self correcting radiation hardened digital circuits using decoupled ground bus.",
                    "A novel multi-objective instruction synthesis flow for application-specific instruction set processors.",
                    "Electromagnetic interaction of on-chip antennas and CMOS metal layers for wireless IC interconnects.",
                    "Ordered escape routing via routability-driven pin assignment.",
                    "Temperature-constrained fixed-outline floorplanning for die-stacking system-in-package design.",
                    "Performance-constrained template-driven retargeting for analog and RF layouts.",
                    "Wirelength-driven force-directed 3D FPGA placement.",
                    "A novel droplet routing algorithm for digital microfluidic biochips.",
                    "Methodology to achieve higher tolerance to delay variations in synchronous circuits.",
                    "Circuit-level NBTI macro-models for collaborative reliability monitoring.",
                    "Low-power side-channel attack-resistant asynchronous S-box design for AES cryptosystems.",
                    "Enhancing debugging of multiple missing control errors in reversible logic.",
                    "Algorithm and hardware complexity reduction techniques for k-best sphere decoders."
                ]
            },
            {
                "sub_name_abbr": "conf/glvlsi/2009",
                "sub_name": "Proceedings of the 19th ACM Great Lakes Symposium on VLSI 2009, Boston Area, MA, USA, May 10-12 2009.",
                "count": 108,
                "papers": [
                    "Green computing: reducing energy cost and carbon footprint of information processing systems.",
                    "Exploration of memory hierarchy configurations for efficient garbage collection on high-performance embedded systems.",
                    "Contact merging algorithm for efficient substrate noise analysis in large scale circuits.",
                    "Simultaneous shield and repeater insertion.",
                    "Task graph scheduling for reconfigurable architectures driven by reconfigurations hiding and resources reuse.",
                    "Safe clocking for the setup and hold timing constraints in datapath synthesis.",
                    "Dynamic context management for low power coarse-grained reconfigurable architecture.",
                    "VIFI-CMP: variability-tolerant chip-multiprocessors for throughput and power.",
                    "An interconnect-aware delay model for dynamic voltage scaling in NM technologies.",
                    "Voltage-island driven floorplanning considering level-shifter positions.",
                    "Design of novel CAM core cell structures for an efficient implementation of low power BCAM system.",
                    "Reducing temperature variability by routing heat pipes.",
                    "Polynomial coefficient based DC testing of non-linear analog circuits.",
                    "MYGEN: automata-based on-line test generator for assertion-based verification.",
                    "An on-chip solution for static ADC test and measurement.",
                    "Multi-level fault modeling for transaction-level specifications.",
                    "Partitioned n-detection test generation.",
                    "Design tools for emerging technologies.",
                    "Soft error rate computation in early design stages using boolean satisfiability.",
                    "Definition and application of approximate necessary assignments.",
                    "Reducing parity generation latency through input value aware circuits.",
                    "Multicast routing with dynamic packet fragmentation.",
                    "Energy efficient architecture of sensor network node based on compression accelerator.",
                    "Towards embedded runtime system level optimization for MPSoCs: on-chip task allocation.",
                    "Capturing topology-level implications of link synthesis techniques for nanoscale networks-on-chip.",
                    "On the design of reconfigurable crossbar switch for adaptable on-chip topologies in programmable NoC routers.",
                    "Hierarchical state machine architecture for regular expression pattern matching.",
                    "Central vs. distributed dynamic thermal management for multi-core processors: which one is better?",
                    "Energy-optimal synchronization primitives for single-chip multi-processors.",
                    "Low-power, process-variation tolerant on-chip thermal monitoring using track and hold based thermal sensors.",
                    "A methodology for application-specific NoC architecture generation in a dynamic task structure environment.",
                    "BISM: built-in self map for hybrid crossbar nano-architectures.",
                    "The effects of logic partitioning in a majority logic based CMOS-NANO FPGA.",
                    "A process variation tolerant self-compensating FinFET based sense amplifier design.",
                    "Study of leakage current mechanisms in ballistic deflection transistors.",
                    "Using soft-edge flip-flops to compensate NBTI-induced delay degradation.",
                    "Contradictory antecedent debugging in bounded model checking.",
                    "Moebius circuit: dual-rail dynamic logic for logic gate level pipeline with error gate search feature.",
                    "A dual-MOSFET equivalent resistor thermal sensor.",
                    "Improved performance and yield with chip master planning design methodology.",
                    "Octilinear redistributive routing in bump arrays.",
                    "A stochastic-based efficient critical area extractor on OpenAccess platform.",
                    "A taylor series methodology for analyzing the effects of process variation on circuit operation.",
                    "STI stress aware placement optimization based on geometric programming.",
                    "Glitch-free design for multi-threshold CMOS NCL circuits.",
                    "Online circuit reliability monitoring.",
                    "Process variation mitigation via post silicon clock tuning.",
                    "The effect of design parameters on single-event upset sensitivity of MOS current mode logic.",
                    "Varicap threshold logic.",
                    "Efficient implementation of decoupling capacitors in 3D processor-dram integrated computing systems.",
                    "High-performance, cost-effective heterogeneous 3D FPGA architectures.",
                    "On the complexity of graph cuboidal dual problems for 3-D floorplanning of integrated circuit design.",
                    "Power distribution paths in 3-D ICS.",
                    "A nine-context programmable optically reconfigurable gate array with semiconductor lasers.",
                    "Analysis of challenges for on-chip optical interconnects.",
                    "Design challenges in high performance three-dimensional circuits.",
                    "Disruptive technologies and neurally-inspired architectures.",
                    "Power efficient tree-based crosslinks for skew reduction.",
                    "Dual-threshold pass-transistor logic design.",
                    "A low-power CMOS thyristor based delay element with programmability extensions.",
                    "Unified P4 (power-performance-process-parasitic) fast optimization of a Nano-CMOS VCO.",
                    "Complementary nano-electromechanical switches for ultra-low power embedded processors.",
                    "A reconfigurable stochastic architecture for highly reliable computing.",
                    "Bitmask-based control word compression for NISC architectures.",
                    "Better than optimum?: register reduction using idle pipelined functional units.",
                    "NBTI-aware sleep transistor design for reliable power-gating.",
                    "Accelerating multi-party scheduling for transaction-level modeling.",
                    "Spatial and temporal design debug using partial MaxSAT.",
                    "An efficient cut enumeration for depth-optimum technology mapping for LUT-based FPGAs.",
                    "Robust window-based multi-node technology-independent logic minimization.",
                    "Timing-driven N-way decomposition.",
                    "Deflecting crosstalk by routing reconsideration through refined signal correlation estimation.",
                    "Computing with field-coupled nanomagnets.",
                    "Buffer design and optimization for lut-based structured ASIC design styles.",
                    "A ubiquitous processor embedded with progressive cipher pipelines.",
                    "Impact of lithography-friendly circuit layout.",
                    "A process variation tolerant, high-speed and low-power current mode signaling scheme for on-chip interconnects.",
                    "Dynamic thermal-aware scheduling on chip multiprocessor for soft real-time system.",
                    "Enhancing SAT-based sequential depth computation by pruning search space.",
                    "RDL pre-assignment routing for flip-chip designs.",
                    "A novel mechanism to dynamically switch speed and accuracy in systemC based transaction level models.",
                    "Redundant wire insertion for yield improvement.",
                    "Incremental buffer insertion and module resizing algorithm using geometric programming.",
                    "Enhancing bug hunting using high-level symbolic simulation.",
                    "Reconfigurable NoC design flow for multiple applications run-time mapping on FPGA devices.",
                    "Physical unclonable function and true random number generator: a compact and scalable implementation.",
                    "Design of a maximum-likelihood detector for cooperative communications in intersymbol interference channels.",
                    "A 1.2v, 1.02 ghz 8 bit SIMD compatible highly parallel arithmetic data path for multi-precision arithmetic.",
                    "A picosecond TDC architecture for multiphase PLLs.",
                    "Low power and high performance sram design using bank-based selective forward body bias.",
                    "High throughput VLSI architecture for soft-output mimo detection based on a greedy graph algorithm.",
                    "High-throughput low-complexity MIMO detector based on K-best algorithm.",
                    "Hardware-accelerated gradient noise for graphics.",
                    "Reconfigurable SAD tree architecture based on adaptive sub-sampling in HDTV application.",
                    "Router with centralized buffer for network-on-chip.",
                    "Dynamic reconfiguration approach for high speed turbo decoding using circular rings.",
                    "A switchable PLL frequency synthesizer and hot carrier effects.",
                    "On process variation tolerant low cost thermal sensor design in 32nm CMOS technology.",
                    "New performance/power/area efficient, reliable full adder design.",
                    "Improving multi-level NAND flash memory storage reliability using concatenated TCM-BCH coding.",
                    "DX-compactor: distributed X-compaction for SoCs.",
                    "Reliability aware NoC router architecture using input channel buffer sharing.",
                    "A power-effective scan architecture using scan flip-flops clustering and post-generation filling.",
                    "State persistence: a property for guiding test generation.",
                    "A study on impact of aggressor de-rating in the context of multiple crosstalk effects in circuits.",
                    "Intracortical wireless microsystems for biosensing and neurostimulation.",
                    "Terahertz sensing technology.",
                    "Circuits with light at the nanoscale: meta-nanocircuits and metactronics."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "18th ACM Great Lakes Symposium on VLSI 2008",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2008",
                "sub_name": "Proceedings of the 18th ACM Great Lakes Symposium on VLSI 2008, Orlando, Florida, USA, May 4-6, 2008.",
                "count": 91,
                "papers": [
                    "Technology, CAD tools, and designs for emerging 3D integration technology.",
                    "GLSVLSI 2008 invited/keynote talk.",
                    "Temperature-insensitive synthesis using multi-vt libraries.",
                    "A formula of STI cmp design rule.",
                    "Considering possible opens in non-tree topology wire delay calculation.",
                    "Variational capacitance modeling using orthogonal polynomial method.",
                    "NBTI-aware flip-flop characterization and design.",
                    "On-die CMOS voltage droop detection and dynamiccompensation.",
                    "Collaborative sensing of on-chip wire temperatures using interconnect based ring oscillators.",
                    "A process and supply variation tolerant nano-CMOS low voltage, high speed, a/d converter for system-on-chip.",
                    "A GF(p) elliptic curve group operator resistant against side channel attacks.",
                    "Reconfigurable solutions for very-long arithmetic with applications in cryptography.",
                    "Fast composite field S-box architectures for advanced encryption standard.",
                    "A table-based method for single-pass cache optimization.",
                    "Using unsatisfiable cores to debug multiple design errors.",
                    "A novel test-data compression technique using application-aware bitmask and dictionary selection methods.",
                    "HyMacs: hybrid memory access optimization based on custom-instruction scheduling.",
                    "Automated formal verification of scheduling with speculative code motions.",
                    "Statistical timing analysis of flip-flops considering codependent setup and hold times.",
                    "Compressor trees for decimal partial product reduction.",
                    "Generic sub-space algorithm for generating reduced order models of linear time varying vlsi circuits.",
                    "A high-speed radix-4 multiplexer-based array multiplier.",
                    "A robust, fast pulsed flip-flop design.",
                    "A low leakage 9t sram cell for ultra-low power operation.",
                    "New technique in design of active rf cmos mixers for low flicker noise and high conversion gain.",
                    "Recursion flattening.",
                    "Quick supply current waveform estimation at gate level using existed cell library information.",
                    "Coverage-driven automatic test generation for uml activity diagrams.",
                    "Hardware/software partitioning with multi-version implementation exploration.",
                    "Improving FPGA routability using network coding.",
                    "Impact of dummy filling techniques on interconnect capacitance and planarization in nano-scale process technology.",
                    "Energy saving for memory with loop scheduling and prefetching.",
                    "A layout-aware analog synthesis procedure inclusive of dynamic module geometry selection.",
                    "Delay driven AIG restructuring using slack budget management.",
                    "An analytical approach to placement legalization.",
                    "Simultaneous optimization of total power, crosstalk noise, and delay under uncertainty.",
                    "Optimal sleep transistor synthesis under timing and area constraints.",
                    "Energy efficiency bounds of pulse-encoded buses.",
                    "Implementation of asynchronous pipeline circuits in multi-threshold CMOS technologies.",
                    "On the design of customizable low-voltage common-gate LNA-mixer pair using current and charge reusing techniques.",
                    "Verifying start-up conditions for a ring oscillator.",
                    "A cost-efficient partially-parallel irregular LDPC decoder based on sum-delta message passing algorithm.",
                    "Pipelined network of PLA based circuit design.",
                    "A low-power 12-bit 80MHz CMOS DAC using pseudo-segmentation.",
                    "GLSVLSI 2008 invited/keynote talk.",
                    "SAT-based equivalence checking of threshold logic designs for nanotechnologies.",
                    "Pairwise decomposition of toffoli gates in a quantum circuit.",
                    "Design of defect tolerant tile-based QCA circuits.",
                    "A layout-aware physical design method for constructing feasible QCA circuits.",
                    "A hybrid cmos/nano fpga architecture built fromprogrammable majority logic arrays.",
                    "A novel performance driven power gating based on distributed sleep transistor network.",
                    "A practical repeater insertion flow.",
                    "Criticality history guided FPGA placement algorithm for timing optimization.",
                    "A linear programming formulation for security-aware gate sizing.",
                    "On efficient generation of instruction sequences to test for delay defects in a processor.",
                    "NBTI resilient circuits using adaptive body biasing.",
                    "A tool flow for predicting system level timing failures due to interconnect reliability degradation.",
                    "Statistically translating low-level error probabilities to increase the accuracy and efficiency of reliability simulations in hardware description languages.",
                    "Improved ber performance in intra-chip rf/wireless interconnect systems.",
                    "Scalable and fault-tolerant network-on-chip design usingthe quartered recursive diagonal torus topology.",
                    "A lithography-friendly structured ASIC design approach.",
                    "Efficient tree topology for FPGA interconnect network.",
                    "Assumers for high-speed single and multi-cycle on-chip interconnect with low repeater count.",
                    "Mlp neural network and on-line backpropagation learning implementation in a low-cost fpga.",
                    "Fast bus waveform estimation at the presence of coupling noise.",
                    "Mesh-of-tree deterministic routing for network-on-chip architecture.",
                    "Fpga-based hardware/software co-design for chirplet signal decomposition.",
                    "Trends in energy-efficiency and robustness using stochastic sensor network-on-a-chip.",
                    "Using reiterative LFSR based X-masking to increase output compression in presence of unknowns.",
                    "Efficient and optimal post-layout double-cut via insertion by network relaxation and min-cost maximum flow.",
                    "Guided test generation for isolation and detection of embedded trojans in ics.",
                    "Electrical models for vertical carbon nanotube capacitors.",
                    "In-order pulsed charge recycling in off-chip data buses.",
                    "An energy-aware co-simulation framework for the design of wireless sensor networks.",
                    "Phase-based cache reconfiguration for a highly-configurable two-level cache hierarchy.",
                    "Instruction cache leakage reduction by changing register operands and using asymmetric sram cells.",
                    "Experimental study on body-biasing layout style-- negligible area overhead enables sufficient speed controllability --.",
                    "Full-chip leakage current estimation based on statistical sampling techniques.",
                    "A low-power phase change memory based hybrid cache architecture.",
                    "Exploiting frequent opcode locality for power efficient instruction cache.",
                    "Simultaneous optimization of memory configuration and code allocation for low power embedded systems.",
                    "Simple and accurate method for fast static currentestimation in cmos complex gates with interaction ofleakage mechanisms.",
                    "FEKIS: a fast architecture-level thermal analyzer for online thermal regulation.",
                    "An analytical model for the upper bound on temperature differences on a chip.",
                    "Power management of variation aware chip multiprocessors.",
                    "Low-power clock distribution in a multilayer core 3d microprocessor.",
                    "Energy efficient synchronization techniques for embedded architectures.",
                    "12bits 40mhz pipelined ADC with duty-correction circuit.",
                    "Comparison of redundant architectures for two-step ADCs.",
                    "Nonuniformly quantized min-sum decoder architecture for low-density parity-check codes.",
                    "Extended layered decoding of LDPC codes."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "17th ACM Great Lakes Symposium on VLSI 2007",
        "info": "Stresa, Lago Maggiore, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2007",
                "sub_name": "Proceedings of the 17th ACM Great Lakes Symposium on VLSI 2007, Stresa, Lago Maggiore, Italy, March 11-13, 2007.",
                "count": 119,
                "papers": [
                    "Design challenges in 45nm and below: DFM, low-power and design for reliability.",
                    "Improving performance and energy consumption in embedded microprocessor platforms with a flexible custom coprocessor data-path.",
                    "An optimized linear skewing interleave scheme for on-chip multi-access memory systems.",
                    "I-cache multi-banking and vertical interleaving.",
                    "A VLSI architecture design of an edge based fast intra prediction mode decision algorithm for H.264/avc.",
                    "NostraXtalk: a predictive framework for accurate static timing analysis in udsm vlsi circuits.",
                    "Dummy fill aware buffer insertion during routing.",
                    "Probabilistic gate-level power estimation using a novel waveform set method.",
                    "Robust wiring networks for DfY considering timing constraints.",
                    "Simultaneous reduction in test data volume and test time for TRC-reseeding.",
                    "SEU mitigation for sram-based fpgas through dynamic partial reconfiguration.",
                    "Estimating path delay distribution considering coupling noise.",
                    "Co-evolutionary high-level test synthesis.",
                    "Optimizing finfet technology for high-speed and low-power design.",
                    "Analysis of data dependence of leakage current in CMOS cryptographic hardware.",
                    "Temperature-aware circuit design using adaptive body biasing.",
                    "A buffered crossbar-based chip interconnection framework supporting quality of service.",
                    "Exact sat-based toffoli network synthesis.",
                    "Combinational equivalence checking for threshold logic circuits.",
                    "On-chip characterization of molecular electronic devices using CMOS: the design and simulation of a hybrid circuit based on experimental molecular electronic device results.",
                    "Operation limits in RTD-based ternary quantizers.",
                    "Transition-activity aware design of reduction-stages for parallel multipliers.",
                    "Reducing snoop-energy in shared bus-based mpsocs by filtering useless broadcasts.",
                    "GALS SoC interconnect bus for wireless sensor network processor platforms.",
                    "Sensitive registers: a technique for reducing the fetch bandwidth in low-power microprocessors.",
                    "Side-channel resistant system-level design flow for public-key cryptography.",
                    "Area efficient loop filter design for charge pump phase locked loop.",
                    "A new approach to logic synthesis of multi-output boolean functions on pal-based CPLDS.",
                    "A novel charge recycler for TFT-LCD source driver IC.",
                    "Hardware-efficient propagate partial sad architecture for variable block size motion estimation in H.264/AVC.",
                    "Compiler assisted architectural exploration for coarse grained reconfigurable arrays.",
                    "Self-biased charge sampling amplifier in 90nm CMOS for medical ultrasound imaging.",
                    "RT level reliability enhancement by constructing dynamic TMRS.",
                    "An asynchronous fpga logic cell implementation.",
                    "Real-time implementation of a time-frequency analysis scheme.",
                    "Flexible blocks for high throughput serially concatenated convolutional codes.",
                    "Novel architectures for efficient (m, n) parallel counters.",
                    "High CMRR current mode operational amplifier with a novel class AB input stage.",
                    "Hardware architecture for matrix factorization in mimo receivers.",
                    "Reduced-complexity mimo detector with close-to ml error rate performance.",
                    "Design and realization of a fault-tolerant 90nm CMOS cryptographic engine capable of performing under massive defect density.",
                    "Exploring subsets of standard cell libraries to exploit natural fault masking capabilities for reliable logic.",
                    "A symmetric mos current-mode logic universal gate for high speed applications.",
                    "An automated unique tagging system using CMOS process variation.",
                    "A design kit for a fully working shared memory multiprocessor on FPGA.",
                    "Probabilistic maximum error modeling for unreliable logic circuits.",
                    "Critical charge and set pulse widths for combinational logic in commercial 90nm cmos technology.",
                    "Active bank switching for temperature control of the register file in a microprocessor.",
                    "Sleep transistor distribution in row-based MTCMOS designs.",
                    "A new decompression system for the configuration process of SRAM-based FPGAS.",
                    "Minimizing peak power in synchronous logic circuits.",
                    "Linearized CMOS active resistor independent on the bulk effect.",
                    "Structured and tuned array generation (STAG) for high-performance random logic.",
                    "Design of mixed gates for leakage reduction.",
                    "Modeling and estimating leakage current in series-parallel CMOS networks.",
                    "Analyzing and modeling process balance for sub-threshold circuit design.",
                    "Viewing direction-aware backlight scaling.",
                    "Synthesis of irregular combinational functions with large don't care sets.",
                    "DAG based library-free technology mapping.",
                    "Using standard asic back-end for qdi asynchronous circuits: dealing with isochronic fork constraint.",
                    "An evolutionary approach for standard-cell library reduction.",
                    "Multi-processor operating system emulation framework with thermal feedback for systems-on-chip.",
                    "Computer-aided design of 3d integrated circuits.",
                    "DFM issues for 65nm and beyond.",
                    "Utilizing custom registers in application-specific instruction set processors for register spills elimination.",
                    "Implementation of a jpeg object-oriented ASIP: a case study on a system-level design methodology.",
                    "Beyond 3G wireless communication system prototype.",
                    "A new hardware architecture for performing the gridding of DNA microarray images.",
                    "A design methodology for space-time adapter.",
                    "A synchronization algorithm for local temporal refinements in perfectly synchronous models with nested feedback loops.",
                    "HW/SW partitioning using discrete particle swarm.",
                    "Complexity-constrainted partitioning of sequential programs for efficient behavioral synthesis.",
                    "Bus-encoding technique to reduce delay, power and simultaneous switching noise (SSN) in RLC interconnects.",
                    "A 5 GHz wide band input and output matched low noise amplifier.",
                    "A 900 MHz ISM band mash-12 fractional-n frequency synthesizer for 5-Mbps data transmission.",
                    "Design of an UHF RFID transponder for secure authentication.",
                    "Effective heuristics for counterexample-guided abstraction refinement.",
                    "Reducing verification overhead with RTL slicing.",
                    "Optimization techniques for BDD-based bisimulation computation.",
                    "Hardware-accelerated path-delay fault grading of functional test programs for processor-based systems.",
                    "An approximation algorithm for fully testable kEP-SOP networks.",
                    "A coefficient optimization and architecture selection tool for SD modulators considering component non-idealities.",
                    "Hand-in-hand verification of high-level synthesis.",
                    "Area minimization algorithm for parallel prefix adders under bitwise delay constraints.",
                    "A new algorithm for the largest compositionally progressive solution of synchronous language equations.",
                    "An efficient cost-based canonical form for Boolean matching.",
                    "Evaluation of using active circuitry for substrate noise suppression.",
                    "The effect of temperature on cache size tuning for low energy embedded systems.",
                    "Efficient space-time noc path allocation based on mutual exclusion and pre-reservation.",
                    "Skew spreading for peak current reduction.",
                    "Block placement to ensure channel routability.",
                    "GA-SVM feasibility model and optimization kernel applied to analog IC design automation.",
                    "Physical aware clock skew rescheduling.",
                    "A low-power 333Mbps mobile-double data rate output driver with adaptive feedback to minimize overshoots and undershoots.",
                    "Extended register-sharing in the synthesis of dual-rail two-phase asynchronous datapath.",
                    "Three-valued automated reasoning on analog properties.",
                    "On the energy efficiency of synchronization primitives for shared-memory single-chip multiprocessors.",
                    "Improvements for constraint solving in the systemc verification library.",
                    "Systematic design of two-stage operational amplifiers based on settling time and open-loop constraints.",
                    "Design of a family of sleep transistor cells for a clustered power-gating flow in 65nm technology.",
                    "StateCharts to systemc: a high level hardware simulation approach.",
                    "A lightweight parallel java execution environment for embedded multiprocessor systems-on-chip.",
                    "Improvement of power distribution network using correlation-based regression analysis.",
                    "A high-level register optimization technique for minimizing leakage and dynamic power.",
                    "An efficient net ordering algorithm for buffer insertion.",
                    "Address generation for nanowire decoders.",
                    "Low-voltage limitations of deep-sub-100-nm CMOS LSIs: view of memory designers.",
                    "Efficient pipelining for modular multiplication architectures in prime fields.",
                    "Design of a versatile and cost-effective hybrid floating-point/LNS arithmetic processor.",
                    "Multi-segment GF(2m) multiplication and its application to elliptic curve cryptography.",
                    "Floorplan repair using dynamic whitespace management.",
                    "Improved timing closure by early buffer planning in floor-placement design flow.",
                    "An effective buffer planning algorithm for IP based fixed-outline SOC placement.",
                    "New timing and routability driven placement algorithms for FPGA synthesis.",
                    "RT-level vector selection for realistic peak power simulation.",
                    "A fast clock scheduling for peak power reduction in LSI.",
                    "A path based modeling approach for dynamic power estimation.",
                    "Software power estimation using IPI(inter-prefetch interval) power model for advanced off-the-shelf processor.",
                    "Future trends for wireless communication frontends in nanometer CMOS."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "16th ACM Great Lakes Symposium on VLSI 2006",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2006",
                "sub_name": "Proceedings of the 16th ACM Great Lakes Symposium on VLSI 2006, Philadelphia, PA, USA, April 30 - May 1, 2006.",
                "count": 83,
                "papers": [
                    "DFM: swimming upstream.",
                    "Design approaches for hybrid CMOS/molecular memory based on experimental device data.",
                    "Threshold/majority logic synthesis and concurrent error detection targeting nanoelectronic implementations.",
                    "Measurement and characterization of pattern dependent process variations of interconnect resistance, capacitance and inductance in nanometer technologies.",
                    "Thermal analysis of a 3D die-stacked high-performance microprocessor.",
                    "HW/SW partitioning techniques for multi-mode multi-task embedded applications.",
                    "ISS-centric modular HW/SW co-simulation.",
                    "An ILP based approach to address code generation for digital signal processors.",
                    "HW/SW co-verification of embedded systems using bounded model checking.",
                    "PWAM signalling scheme for high speed serial link transceiver design.",
                    "High speed differential pulse-width control loop based on frequency-to-voltage converters.",
                    "Synthesis of a wideband low noise amplifier.",
                    "A 0.13µm CMOS 10 Gb/s current-mode class AB serial link transmitter with low supply voltage sensitivity.",
                    "Dominator-based partitioning for delay optimization.",
                    "How does partitioning matter for 3D floorplanning?",
                    "Low-power clustering with minimum logic replication for coarse-grained, antifuse based FPGAs.",
                    "Shuttle mask floorplanning with modified alpha-restricted grid.",
                    "Delay and Power Estimation Models of Low-Swing Interconnects for Design Planning.",
                    "A simulation methodology for reliability analysis in multi-core SoCs.",
                    "Power density minimization for highly-associative caches in embedded processors.",
                    "An evaluation of the impact of gate oxide tunneling on dual-Vt-based leakage reduction techniques.",
                    "Efficient encoding for address buses with temporal redundancy for simultaneous area and energy reduction.",
                    "General transistor-level methodology on VLSI low-power design.",
                    "Delay and peak power minimization for on-chip buses using temporal redundancy.",
                    "Low-noise high-precision operational amplifier using vertical NPN transistor in CMOS technology.",
                    "A new power-area efficient 4-PAM full-clock CMOS pre-emphasis transmitter for 10Gb/s serial links.",
                    "A low-power and high-linear double-balanced switching mixer.",
                    "Nonlinearity Analysis in ISD CMOS LNA's Using Volterra Series.",
                    "On-chip 3.3V-to-1.8V voltage down converter for low-power VLSI chips.",
                    "A SiGe BiCMOS linear regulator with wideband, high power supply rejection.",
                    "Optimizing noise-immune nanoscale circuits using principles of Markov random fields.",
                    "Dynamic instruction schedulers in a 3-dimensional integration technology.",
                    "Yield enhancement of asynchronous logic circuits through 3-dimensional integration technology.",
                    "Effects of process and environmental variations on timing characteristics of clocked registers.",
                    "On finding the minimum test set of a BDD-based circuit.",
                    "Maximum effective distance of on-chip decoupling capacitors in power distribution grids.",
                    "Implementation of MOSFET based capacitors for digital applications.",
                    "Efficient modeling of integrated narrow-band low noise amplifiers for design space exploration.",
                    "Sensitivity evaluation of global resonant H-tree clock distribution networks.",
                    "2 Gbps SerDes design based on IBM Cu-11 (130nm) standard cell technology.",
                    "Implementation analysis of NoC: a MPSoC trace-driven approach.",
                    "From single core to multi-core to many core: are we ready for a new exponential?",
                    "Techniques for improved placement-coupled logic replication.",
                    "A design flow to optimize circuit delay by using standard cells and PLAs.",
                    "Statistical gate delay calculation with crosstalk alignment consideration.",
                    "Towards formal probabilistic power-performance design space exploration.",
                    "An indirect current sensing technique for IDDQ and IDDT tests.",
                    "SACI: statistical static timing analysis of coupled interconnects.",
                    "Performance verification of high-performance ASICs using at-speed structural test.",
                    "Crosstalk analysis in nanometer technologies.",
                    "Using Lin-Kernighan algorithm for look-up table compression to improve code density.",
                    "FPGA implementation of a parallel EBCOT tier-1 encoder that preserves coding efficiency.",
                    "Partial parallel factorization in soft-decision Reed-Solomon decoding.",
                    "Monotonic static CMOS tradeoffs in sub-100nm technologies.",
                    "A power optimized design methodology for low-distortion sigma-delta-pipeline ADCs.",
                    "Perception-guided power minimization for color sequential displays.",
                    "Evaluation of on-chip networks using deflection routing.",
                    "A digit serial algorithm for the integer power operation.",
                    "Resource and delay efficient matrix multiplication using newer FPGA devices.",
                    "Parallel turbo-sum-product decoder architecture for quasi-cyclic LDPC codes.",
                    "Energy-delay minimization in nanoscale domino logic.",
                    "High throughput architecture for H.264/AVC forward transforms block.",
                    "Hardware/software partitioning of operating systems: a behavioral synthesis approach.",
                    "A practical approach for monitoring analog circuits.",
                    "A non-orthogonal clock distribution network and its performance evaluation in presence of process variations and inductive effects.",
                    "A Transaction-Level NoC Simulation Platform with Architecture-Level Dynamic and Leakage Energy Models.",
                    "A formal approach for high level synthesis of linear analog systems.",
                    "Transformation synthesis for data intensive applications to FPGAs.",
                    "An integrated circuit/behavioral simulation framework for continuous-time sigma-delta ADCs.",
                    "A heuristic algorithm to minimize ESOPs for multiple-output incompletely specified functions.",
                    "Test generation using SAT-based bounded model checking for validation of pipelined processors.",
                    "An efficient algorithm for partitioning parameterized polygons into rectangles.",
                    "Application of fast SOCP based statistical sizing in the microprocessor design flow.",
                    "Block alignment in 3D floorplan using layered TCG.",
                    "Rapid intermodulation distortion estimation in fully balanced weakly nonlinear Gm-C filters using state-space modeling.",
                    "Selective code/data migration for reducing communication energy in embedded MpSoC architectures.",
                    "Dynamic voltage scaling for multitasking real-time systems with uncertain execution time.",
                    "Low-power cache organization through selective tag translation for embedded processors with virtual memory support.",
                    "STV-Cache: a leakage energy-efficient architecture for data caches.",
                    "A design methodology for temperature variation insensitive low power circuits.",
                    "Circuit architecture for low-power race-free programmable logic arrays.",
                    "An energy-efficient temporal encoding circuit technique for on-chip high performance buses.",
                    "Leakage current starved domino logic."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "15th ACM Great Lakes Symposium on VLSI 2005",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2005",
                "sub_name": "Proceedings of the 15th ACM Great Lakes Symposium on VLSI 2005, Chicago, Illinois, USA, April 17-19, 2005.",
                "count": 104,
                "papers": [
                    "Variability modeling and variability-aware design in deep submicron integrated circuits.",
                    "On-chip power distribution grids with multiple supply voltages for high performance integrated circuits.",
                    "Low power test generation for path delay faults using stability functions.",
                    "Physical limitations on the bit-rate of on-chip interconnects.",
                    "Interconnect delay minimization through interlayer via placement in 3-D ICs.",
                    "Thermal aware cell-based full-chip electromigration reliability analysis.",
                    "Accounting for the skin effect during repeater insertion.",
                    "Characterization of the impact of interconnect design on the capacitive load driven by a global clock distribution.",
                    "Instruction scheduling using MAX-MIN ant system optimization.",
                    "A unified processor architecture for RISC & VLIW DSP.",
                    "Zero clustering: an approach to extend zero compression to instruction caches.",
                    "A 3.84 gbits/s AES crypto coprocessor with modes of operation in a 0.18-µm CMOS technology.",
                    "PIM lite: a multithreaded processor-in-memory prototype.",
                    "Characterizing the VCO jitter due to the digital simultaneous switching noise.",
                    "Exact minimum-width transistor placement without dual constraint for CMOS cells.",
                    "High-diagnosability online built-in self-test of FPGAs via iterative bootstrapping.",
                    "An improved direct boundary element method for substrate coupling resistance extraction.",
                    "Generating decision regions in analog measurement spaces.",
                    "Integer linear programming based energy optimization for banked DRAMs.",
                    "Slack borrowing in flip-flop based sequential circuits.",
                    "On equivalence checking and logic synthesis of circuits with a common specification.",
                    "Quantum-dot cellular automata SPICE macro model.",
                    "Causal probabilistic input dependency learning for switching model in VLSI circuits.",
                    "Area-efficient two-dimensional architectures for finite field inversion and division.",
                    "2.5GHz PLL with current matching charge-pump for 10Gbps transmitter design.",
                    "The oct-touched tile: a new architecture for shape-based routing.",
                    "System level design language extensions for timed/untimed digital-analog combined system design.",
                    "Noise-tolerant high fan-in dynamic CMOS circuit design.",
                    "Noise aware behavioral modeling of the E-Delta fractional-N frequency synthesizer.",
                    "Improved multilevel routing with redundant via placement for yield and reliability.",
                    "An FPGA design of AES encryption circuit with 128-bit keys.",
                    "High performance asynchronous on-chip bus with multiple issue and out-of-order/in-order completion.",
                    "Fixed-outline floorplanning based on common subsequence.",
                    "Interconnect capacitance extraction for system LCD circuits.",
                    "Two-prime RSA immune cryptosystem and its FPGA implementation.",
                    "A simple wide-band compact model and parameter extraction using particle swarm optimization of on-chip spiral inductors for silicon RFICs.",
                    "Digital cell macro-model with regular substrate template and EKV based MOSFET model.",
                    "Untestable fault identification through enhanced necessary value assignments.",
                    "Test set enhancement for quality transition faults using function-based methods.",
                    "Two dimensional reordering of functional test data for compression by ATE.",
                    "Diagnosing multiple transition faults in the absence of timing information.",
                    "An EFSM-based approach for functional ATPG.",
                    "Tile-based design of a serial memory in QCA.",
                    "Multi-GHz SiGe design methodologies for reconfigurable computing.",
                    "Low-power circuits using dynamic threshold devices.",
                    "QCA channel routing with wire crossing minimization.",
                    "A new algorithm for layout of dark field alternating phase shifting masks.",
                    "Research and development for seamless mobility.",
                    "DIP: a double-interval-based dynamic voltage scaling scheme for dynamic priority-based task scheduling systems.",
                    "Energy optimization in memory address bus structure for application-specific systems.",
                    "Fine-grain leakage optimization in SRAM based FPGAs.",
                    "A sensitivity analysis of low-power repeater insertion.",
                    "An effective and efficient ATPG-based combinational equivalence checker.",
                    "Forward image computation with backtracing ATPG and incremental state-set construction.",
                    "Verification of behavioral descriptions by combining symbolic simulation and automatic reasoning.",
                    "Utilizing don't care states in SAT-based bounded sequential problems.",
                    "Energy management in software-controlled multi-level memory hierarchies.",
                    "Exploring the energy efficiency of cache coherence protocols in single-chip multi-processors.",
                    "Load elimination for low-power embedded processors.",
                    "An efficient bottom-up extraction approach to build accurate PLL behavioral models for SOC designs.",
                    "A VLSI array processing oriented fast fourier transform algorithm and hardware implementation.",
                    "A novel clock generation scheme for globally asynchronous locally synchronous systems: an FPGA-validated approach.",
                    "A complete methodology for an accurate static noise analysis.",
                    "A new approach to the use of satisfiability in false path detection.",
                    "Optimization objectives and models of variation for statistical gate sizing.",
                    "An empirical study of crosstalk in VDSM technologies.",
                    "A hardware/software codesign approach for programmable IO devices.",
                    "Analysis and design of soft-error hardened latches.",
                    "Clock skew bounds estimation under power supply and process variations.",
                    "Tool integration using the web-services approach.",
                    "VLSI CAD tool protection by birthmarking design solutions.",
                    "A continuous time markov decision process based on-chip buffer allocation methodology.",
                    "The G4-FET: a universal and programmable logic gate.",
                    "Using data compression in an MPSoC architecture for improving performance.",
                    "Dual-transition glitch filtering in probabilistic waveform power estimation.",
                    "SOFTENIT: a methodology for boosting the software content of system-on-chip designs.",
                    "Low-overhead state-retaining elements for low-leakage MTCMOS design.",
                    "Enhancing error resilience for reliable compression of VLSI test data.",
                    "Exploring the impact of architectural parameters on energy efficiency of application-specific block-enabled SRAMs.",
                    "Total leakage optimization strategies for multi-level caches.",
                    "Design of a cell library for asynchronous microengines.",
                    "Moment-driven coupling-aware routing methodology.",
                    "New algorithms for carry propagation.",
                    "Exploiting PSL standard assertions in a theorem-proving-based verification environment.",
                    "Increasing design space of the instruction queue with tag coding.",
                    "Characterization of monotonic static CMOS gates in a 65nm technology.",
                    "An analysis of the robustness of CMOS delay elements.",
                    "A first look at the interplay of code reordering and configurable caches.",
                    "FPGA implementation of a modular and pipelined WF scheduler for high speed OC192 networks.",
                    "VITA: variation-aware interconnect timing analysis for symmetric and skewed sources of variation considering variational ramp input.",
                    "1-V 7-mW dual-band fast-locked frequency synthesizer.",
                    "Increasing the energy efficiency of pipelined circuits via slack redistribution.",
                    "Adaptive digital techniques to suppress quantization noise of Sigma Delta analog to digital converters.",
                    "Wave-pipelined 2-slot time division multiplexed (WP/2-TDM) routing.",
                    "LiPaR: A light-weight parallel router for FPGA-based networks-on-chip.",
                    "3D module placement for congestion and power noise reduction.",
                    "A novel buffer circuit for energy efficient signaling in dual-VDD systems.",
                    "Energy recovery clocked dynamic logic.",
                    "Adaptive gate biasing: a new solution for body-driven current mirrors.",
                    "A high speed and leakage-tolerant domino logic for high fan-in gates.",
                    "Accuracy driven performance macromodeling of feasible regions during synthesis of analog circuits.",
                    "A congestion-driven placement framework with local congestion prediction.",
                    "Reticle floorplanning of flexible chips for multi-project wafers.",
                    "A study of tighter lower bounds in LP relaxation based placement."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "14th ACM Great Lakes Symposium on VLSI 2004",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2004",
                "sub_name": "Proceedings of the 14th ACM Great Lakes Symposium on VLSI 2004, Boston, MA, USA, April 26-28, 2004.",
                "count": 95,
                "papers": [
                    "High-speed architectures for parallel long BCH encoders.",
                    "Optimal partitioning of globally asychronous locally synchronous processor arrays.",
                    "High level techniques for power-grid noise immunity.",
                    "TFA: a threshold-based filtering algorithm for propagation delay and slew calculation of high-speed VLSI interconnects.",
                    "Modeling of transmission lines with EM wave coupling by the finite difference quadrature method.",
                    "Simplified delay design guidelines for on-chip global interconnects.",
                    "Design and optimization of MOS current mode logic for parameter variations.",
                    "A 2 Gb/s balanced AES crypto-chip implementation.",
                    "Quality-of-service and error control techniques for network-on-chip architectures.",
                    "Universal Reed-Solomon decoders based on the Berlekamp-Massey algorithm.",
                    "A compact DSP core with static floating-point unit & its microcode generation.",
                    "An efficient architecture for lifting-based two-dimensional discrete wavelet transforms.",
                    "A graph based simplex method for the integer minimum perturbation problem with sum and difference constraints.",
                    "ARCS: an architectural level communication driven simulator.",
                    "A fast and efficient heuristic ESOP minimization algorithm.",
                    "A memory aware behavioral synthesis tool for real-time VLSI circuits.",
                    "Low-power weighted pseudo-random BIST using special scan cells.",
                    "Efficient formal verification of pipelined processors with instruction queues.",
                    "Evaluation of heuristic techniques for test vector ordering.",
                    "Logic-level analysis of high-level faults.",
                    "A stacked antenna broad-band RFID front-end for UHF and microwave bands.",
                    "NANOPRISM: a tool for evaluating granularity vs. reliability trade-offs in nano architectures.",
                    "Constructive benchmarking for placement.",
                    "Design of superbuffers in sub-100nm CMOS technologies with significant gate leakage.",
                    "Improving FSM evolution with progressive fitness functions.",
                    "Fault simulation and random test generation for speed-independent circuits.",
                    "Minimal period retiming under process variations.",
                    "Simulation of reconfigurable memory core yield.",
                    "The 10GHz 4: 1 MUX and 1: 4 DEMUX implemented via the gigahertz SiGe FPGA.",
                    "On-chip delay measurement for silicon debug.",
                    "Modeling of polysilicide gate resistance effect on inverter delay and power consumption using distributed RC method and branching technique.",
                    "A simple DDS architecture with highly efficient sine function lookup table.",
                    "Leakage current reduction by new technique in standby mode.",
                    "Macro-models for high level area and power estimation on FPGAs.",
                    "Leakage power minimization for the synthesis of parallel multiplier circuits.",
                    "Tuning data replication for improving behavior of MPSoC applications.",
                    "Self-resetting stage logic pipelines.",
                    "A noise optimization technique for codesign of CMOS radio-frequency low noise amplifiers and low-quality spiral inductors.",
                    "A CMOS elliptic low-pass switched capacitor ladder filter for video communication using bilinear implementation.",
                    "FIFO power optimization for on-chip networks.",
                    "Structured interconnect architecture: a solution for the non-scalability of bus-based SoCs.",
                    "A device-level placement with multi-directional convex clustering.",
                    "A new paradigm for general architecture routing.",
                    "An effective hop-based detailed router for FPGAs for optimizing track usage and circuit performance.",
                    "On legalization of row-based placements.",
                    "Equidistance routing in high-speed VLSI layout design.",
                    "Mitigating static power in current-sensed interconnects.",
                    "Characterization of logic circuit techniques for high leakage CMOS technologies.",
                    "Energy-efficient bus encoding for LCD displays.",
                    "Power macromodeling of global interconnects considering practical repeater insertion.",
                    "Towards a heterogeneous simulation kernel for system level models: a SystemC kernel for synchronous data flow models.",
                    "Estimating detection probability of interconnect opens using stuck-at tests.",
                    "VLSI implementation of an automatic Q tuning system.",
                    "A practical approach to modeling skin effect in on-chip interconnects.",
                    "A high level language for pre-layout extraction in parasite-aware analog circuit synthesis.",
                    "Power-efficient ASIC synthesis of cryptographic sboxes.",
                    "Practical slicing and non-slicing block-packing without simulated annealing.",
                    "Assertion-based automated functional vectors generation using constraint logic programming.",
                    "Design and optimization of board-level optical clock distribution network for high-performance optoelectronic system-on-a-packages.",
                    "Design of a nanosensor array architecture.",
                    "A binary--search switched--current sensing scheme for 4-state MRAM.",
                    "Design of a 5-Gb/s PRBS generator in 0.18µm CMOS process.",
                    "Analysis and verification of interconnected rings as clock distribution networks.",
                    "LFSR-based BIST for analog circuits using slope detection.",
                    "Hierarchical extreme-voltage stress test of analog CMOS ICs for gate-oxide reliability enhancement.",
                    "An efficient linearity test for on-chip high speed ADC and DAC using loop-back.",
                    "Automatic cell placement for quantum-dot cellular automata.",
                    "Timing, energy, and thermal performance of three-dimensional integrated circuits.",
                    "SET-based nano-circuit simulation and design method using HSPICE.",
                    "SPFD-based effective one-to-many rewiring (OMR) for delay reduction of LUT-based FPGA circuits.",
                    "CESC: a visual formalism for specification and verification of SoCs.",
                    "Cluster miss prediction for instruction caches in embedded networking applications.",
                    "The design of the fixed point unit for the z990 microprocessor.",
                    "How to reduce aliasing in linear analog testing.",
                    "A keyword match processor architecture using content addressable memory.",
                    "A high performance CMOS direct down conversion mixer for UWB system.",
                    "Multi-peak bandwidth enhancement technique for multistage amplifiers.",
                    "Orthogonal hypergraph routing for improved visibility.",
                    "Low power ATPG for path delay faults.",
                    "Low energy FPGA interconnect design.",
                    "Evaluation of scheduling and allocation algorithms while mapping assembly code onto FPGAs.",
                    "RESTA: a robust and extendable symbolic timing analysis tool.",
                    "Cycle-accurate power analysis for multiprocessor systems-on-a-chip.",
                    "Performance enhancement in phased logic circuits using automatic slack-matching buffer insertion.",
                    "A new test pattern generator for high defect coverage in a BIST environment.",
                    "An ASIC design for a high speed implementation of the hash function SHA-256 (384, 512).",
                    "Design and characterization of an and-or-inverter (AOI) gate for QCA implementation.",
                    "Energy estimation of peripheral devices in embedded systems.",
                    "A comparison between mask- and field-programmable routing structures on industrial FPGA architectures.",
                    "Power-aware branch prediction techniques: a compiler-hints based approach for VLIW processors.",
                    "Modified booth truncated multipliers.",
                    "Design methodology for semi custom processor cores.",
                    "An FPGA implementation of an elliptic curve processor GF(2m).",
                    "Hardware architecture and FPGA implementation of a type-2 fuzzy system.",
                    "High-speed systolic architectures for finite field inversion and division."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "13th ACM Great Lakes Symposium on VLSI 2003",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2003",
                "sub_name": "Proceedings of the 13th ACM Great Lakes Symposium on VLSI 2003, Washington, DC, USA, April 28-29, 2003.",
                "count": 69,
                "papers": [
                    "Constructing exact octagonal steiner minimal trees.",
                    "Bounding the efforts on congestion optimization for physical synthesis.",
                    "A comprehensive high-level synthesis system for control-flow intensive behaviors.",
                    "Iterative decoding in analog CMOS.",
                    "Design issues in low-voltage high-speed current-mode logic buffers.",
                    "Optimum wire sizing of RLC interconnect with repeaters.",
                    "Reduced dynamic swing domino logic.",
                    "A 5-20 GHz, low power FPGA implemented by SiGe HBT BiCMOS technology.",
                    "Interconnected rings and oscillators as gigahertz clock distribution nets.",
                    "Information storage capacity of crossbar switching networks.",
                    "Exploiting multiple functionality for nano-scale reconfigurable systems.",
                    "CMOS flash analog-to-digital converter for high speed and low voltage applications.",
                    "Modeling QCA for area minimization in logic synthesis.",
                    "Power-aware pipelined multiplier design based on 2-dimensional pipeline gating.",
                    "Low power VLSI sequential circuit architecture using critical race control.",
                    "A hybrid adiabatic content addressable memory for ultra low-power applications.",
                    "TEM-cell and surface scan to identify the electromagnetic emission of integrated circuits.",
                    "MuTaTe: an efficient design for testability technique for multiplexor based circuits.",
                    "Cooling of integrated circuits using droplet-based microfluidics.",
                    "Language emptiness checking using MDGs.",
                    "A system-level methodology for fast multi-objective design space exploration.",
                    "A practical CAD technique for reducing power/ground noise in DSM circuits.",
                    "RF CMOS circuit optimizing procedure and synthesis tool.",
                    "Wirelength reduction by using diagonal wire.",
                    "A fast simulation approach for inductive effects of VLSI interconnects.",
                    "Buffer sizing for minimum energy-delay product by using an approximating polynomial.",
                    "FORCE: a fast and easy-to-implement variable-ordering heuristic.",
                    "Routing methodology for minimizing 1nterconnect energy dissipation.",
                    "Circuit design of a wide tuning range CMOS VCO with automatic amplitude control.",
                    "A decoupling technique for CMOS strong-coupled structures.",
                    "A custom FPGA for the simulation of gene regulatory networks.",
                    "A novel architecture for power maskable arithmetic units.",
                    "3D direct vertical interconnect microprocessors test vehicle.",
                    "Zero overhead watermarking technique for FPGA designs.",
                    "Matrix datapath architecture for an iterative 4x4 MIMO noise whitening algorithm.",
                    "System level design of real time face recognition architecture based on composite PCA.",
                    "Design and modeling of a 16-bit 1.5MSPS successive approximation ADC with non-binary capacitor array.",
                    "Shielding effect of on-chip interconnect inductance.",
                    "A pipelined clock-delayed domino carry-lookahead adder.",
                    "A globally asynchronous locally dynamic system for ASICs and SoCs.",
                    "40 MHz 0.25 um CMOS embedded 1T bit-line decoupled DRAM FIFO for mixed-signal applications.",
                    "Design topology aware physical metrics for placement analysis.",
                    "A novel ultra-fast heuristic for VLSI CAD steiner trees.",
                    "Combining wire swapping and spacing for low-power deep-submicron buses.",
                    "Clustering based acyclic multi-way partitioning.",
                    "Synthesis of continuous-time filters and analog to digital converters by integrated constraint transformation, floorplanning and routing.",
                    "Congestion reduction in traditional and new routing architectures.",
                    "Simultaneous peak and average power minimization during datapath scheduling for DSP processors.",
                    "Unification of basic retiming and supply voltage scaling to minimize dynamic power consumption for synchronous digital designs.",
                    "Branch prediction techniques for low-power VLIW processors.",
                    "Orthogonal code generator for 3G wireless transceivers.",
                    "54x54-bit radix-4 multiplier based on modified booth algorithm.",
                    "Power-time flexible architecture for GF(2k) elliptic curve cryptosystem computation.",
                    "A novel 32-bit scalable multiplier architecture.",
                    "High throughput overlapped message passing for low density parity check codes.",
                    "Exponential split accumulator for high-speed reduced area low-power direct digital frequency synthesizers.",
                    "Using dynamic domino circuits in self-timed systems.",
                    "Dynamic single-rail self-timed logic structures for power efficient synchronous pipelined designs.",
                    "Comparison of noise tolerant precharge (NTP) to conventional feedback keepers for dynamic logic.",
                    "Variable gain amplifier with offset cancellation.",
                    "Repeater and current-sensing hybrid circuits for on-chip interconnects.",
                    "A slew rate enhancement technique for operational amplifiers based on a tunable active Gm-based capacitance multiplication circuit.",
                    "A dual band CMOS VCO with a balanced duty cycle buffer.",
                    "New approach to CMOS current reference with very low temperature coefficient.",
                    "Noise tolerant low voltage XOR-XNOR for fast arithmetic.",
                    "On automatic generation of RTL validation test benches using circuit testing techniques.",
                    "A highly regular multi-phase reseeding technique for scan-based BIST.",
                    "Coefficient-based parametric faults detection in analog circuits.",
                    "Mixing ATPG and property checking for testing HW/SW interfaces."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "12th ACM Great Lakes Symposium on VLSI 2002",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2002",
                "sub_name": "Proceedings of the 12th ACM Great Lakes Symposium on VLSI 2002, New York, NY, USA, April 18-19, 2002.",
                "count": 31,
                "papers": [
                    "Power and CAD considerations for the 1.75mbyte, 1.2ghz L2 cache on the alpha 21364 CPU.",
                    "Multi-voltage low power convolvers using the polynomial residue number system.",
                    "Properties of on-chip inductive current loops.",
                    "Enhanced clustered voltage scaling for low power.",
                    "Unified architecture level energy-efficiency metric.",
                    "Fast and accurate wire delay estimation for physical synthesis of large ASICs.",
                    "A compact delay model for series-connected MOSFETs.",
                    "A decoupling method for analysis of coupled RLC interconnects.",
                    "Low swing dual threshold voltage domino logic.",
                    "An error simulation based approach to measure error coverage of formal properties.",
                    "Protected IP-core test generation.",
                    "Test generation for resistive opens in CMOS.",
                    "Self-checking sequential circuits with self-healing ability.",
                    "Minimizing concurrent test time in SoC's by balancing resource usage.",
                    "Efficient implementation of a complex ±1 multiplier.",
                    "On the high-speed VLSI implementation of errors-and-erasures correcting reed-solomon decoders.",
                    "Design limitations in deep sub-0.1µm CMOS SRAM.",
                    "Reconfigurable repetitive padding unit.",
                    "Energy-delay efficiency of VLSI computations.",
                    "Active shields: a new approach to shielding global wires.",
                    "Variable-segment & variable-driver parallel regeneration techniques for RLC VLSI interconnects.",
                    "Selective-run built-in self-test using an embedded processor.",
                    "Board-level multiterminal net assignment.",
                    "Minimizing resources in a repeating schedule for a split-node data-flow graph.",
                    "A new look at hardware maze routing.",
                    "Novel interconnect modeling by using high-order compact finite difference methods.",
                    "AQUASUN: adaptive window query processing in CAD applications for physical design and verification.",
                    "Term ordering problem on MDG.",
                    "A low power direct digital frequency synthesizer with 60 dBc spectral purity.",
                    "Novel design and verification of a 16 x 16-b self-repairable reconfigurable inner product processor.",
                    "Computing walsh, arithmetic, and reed-muller spectral decision diagrams using graph transformations."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "11th ACM Great Lakes Symposium on VLSI 2001",
        "info": "West Lafayette, Indiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2001",
                "sub_name": "Proceedings of the 11th ACM Great Lakes Symposium on VLSI 2001, West Lafayette, Indiana, USA, 2001.",
                "count": 30,
                "papers": [
                    "Practical approaches to the verification of a telecom megacell using FormalCheck.",
                    "A novel reseeding technique for accumulator-based test pattern generation.",
                    "ITEM: an iterative improvement test generation procedure for synchronous sequential circuits.",
                    "Solving large scale assignment problems in high-level synthesis by approximative quadratic programming.",
                    "Layout aware retiming.",
                    "Optimal partitioning and balanced scheduling with the maximal overlap of data footprints.",
                    "SOI for asynchronous dynamic circuits.",
                    "Leakage control and tolerance challenges for sub-0.1µm microprocessor circuits.",
                    "Challenges in integrated CMOS transceivers for short distance wireless.",
                    "An accurate evaluation of routing density for symmetrical FPGAs.",
                    "Preferred direction Steiner trees.",
                    "Faster and more accurate wiring evaluation in interconnect-centric floorplanning.",
                    "Global objectives for standard cell placement.",
                    "A circuit level implementation of an adaptive issue queue for power-aware microprocessors.",
                    "A CORDIC based array architecture for complex discrete wavelet transform.",
                    "A VLSI wrapped wave front arbiter for crossbar switches.",
                    "Effective algorithms for cache-level compression.",
                    "2-level LFSR scheme with asynchronous test pattern transfer for low cost and high efficiency build-in-self-test.",
                    "Rarity based guided state space search.",
                    "Who are the alternative wires in your neighborhood? (alternative wires identification without search).",
                    "Hierarchical model order reduction for signal-integrity interconnect synthesis.",
                    "An efficient model for frequency-dependent on-chip inductance.",
                    "Models for power consumption and power grid noise due to datapath transition activity.",
                    "Electronic devices, structures and transport in carbon based materials: molecular electronics and quantum computing.",
                    "Single molecule electronics.",
                    "Vertical integration of submicron MOSFETs in two separate layers of SOI islands formed by silicon epitaxial lateral overgrowth.",
                    "Transistor sizing for reliable domino logic design in dual threshold voltage technologies.",
                    "Practical low-cost CPL implementations threshold logic functions.",
                    "A high performance RNS multiply-accumulate unit.",
                    "A fast hybrid carry-lookahead/carry-select adder design."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "10th ACM Great Lakes Symposium on VLSI 2000",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/2000",
                "sub_name": "Proceedings of the 10th ACM Great Lakes Symposium on VLSI 2000, Chicago, Illinois, USA, March 2-4, 2000.",
                "count": 38,
                "papers": [
                    "Low power and high performance design challenges in future technologies.",
                    "CMOS system-on-a-chip voltage scaling beyond 50nm.",
                    "Reducing bus transition activity by limited weight coding with codeword slimming.",
                    "Supporting system-level power exploration for DSP applications.",
                    "Formal hardware verification by integrating HOL and MDG.",
                    "Towards design and validation of mixed-technology SOCs.",
                    "Candidate subcircuits for functional module identification in logic circuits.",
                    "Speeding up symbolic model checking by accelerating dynamic variable reordering.",
                    "Prove that a faulty multiplier is faulty!?",
                    "Manhattan or non-Manhattan?: a study of alternative VLSI routing architectures.",
                    "High-performance bidirectional repeaters.",
                    "Measuring routing congestion for multi-layer global routing.",
                    "Transparent repeaters.",
                    "A wave-pipelined router architecture using ternary associative memory.",
                    "A novel technique for sea of gates global routing.",
                    "On-chip inductance modeling.",
                    "An evolutionary approach to timing driven FPGA placement.",
                    "Parallel algorithms for FPGA placement.",
                    "Fast and accurate estimation of floorplans in logic/high-level synthesis.",
                    "A comparison of dual-rail pass transistor logic families in 1.5V, 0.18µm CMOS technology for low power applications.",
                    "Digital CMOS logic operation in the sub-threshold region.",
                    "Low power high speed analog-to-digital converter for wireless communications.",
                    "A comparative study of power efficient SRAM designs.",
                    "Design and analysis of efficient application-specific on-line page replacement techniques.",
                    "A new technique for estimating lower bounds on latency for high level synthesis.",
                    "Maximizing memory data reuse for lower power motion estimation.",
                    "Efficient algorithms for acceptable design exploration.",
                    "Technology independent arbitrary device extractor.",
                    "Regression-based RTL power models for controllers.",
                    "A low-power correlator.",
                    "Behavioral-level partitioning for low power design in control-dominated application.",
                    "Power estimation for a submicron CMOS inverter driving a CRC interconnect load.",
                    "Accuracy management for mixed-mode digital VLSI simulation.",
                    "Noise estimation due to signal activity for capacitively coupled CMOS logic gates.",
                    "SPARTA: Simulation of Physics on a Real-Time Architecture.",
                    "Efficient algorithms for polygon to trapezoid decomposition and trapezoid corner stitching.",
                    "MCM placement using a realistic thermal model.",
                    "A sensitivity based placer for standard cells."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "9th Great Lakes Symposium on VLSI 1999",
        "info": "Ann Arbor, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1999",
                "sub_name": "9th Great Lakes Symposium on VLSI (GLS-VLSI '99), 4-6 March 1999, Ann Arbor, MI, USA.",
                "count": 103,
                "papers": [
                    "PASTA: Partial Scan to Enhance Test Compaction.",
                    "On Applying Set Covering Models to Test Set Compaction.",
                    "On Test Generation with A Limited Number of Tests.",
                    "Functional ATPG for Delay Faults.",
                    "On Path Delay Fault Testing of Multiplexer - Based Shifters.",
                    "A Test Vector Ordering Technique for Switching Activity Reduction During Test Operation.",
                    "VLSI Implementation of Early Branch Prediction Circuits for High Performance Computing.",
                    "The Design of a Register Renaming Unit.",
                    "Efficient and Safe Asynchronous Wave-Pipeline Architectures for Datapath and Control Unit Applications.",
                    "Memory Organization of a Single-Chip Video Signal Processing System with Embedded DRAM.",
                    "Theoretical Analysis of Word-Level Switching Activity in the Presence of Glitching and Correlation.",
                    "Adaptive Hard Disk Power Management on Personal Computers.",
                    "Inductance Effects in RLC Trees.",
                    "S2P: A Stable 2-Pole RC Delay and Coupling Noise Metric.",
                    "ICE: Incremental 3-Dimensional Capacitance and Resistance Extraction for an Iterative Design Environment.",
                    "An Exact Analytical Time-Domain Model Of Distributed RC Interconnects for High Speed Nonlinear Circuit Applications.",
                    "A Radix-16 SRT Division Unit with Speculation of the Quotient Digits.",
                    "Area-Efficient Area Pad Design for High Pin-Count Chips.",
                    "New 2 Gbit/s CMOS I/O pads.",
                    "A Methodology for Minimizing Power Dissipation of Embedded Systems through Hardware/Software Partitioning.",
                    "On Optimizing Test Strategies for Analog Cells.",
                    "Novel Design for Testability of a Mixed-Signal VLSI IC.",
                    "The Development of Analog SPICE Behavioral Model Based on IBIS Model.",
                    "Transistor Stuck-Open Fault Detection in Multilevel CMOS Circuits.",
                    "Fault Coverage Estimation for Early Stage of VLSI Design.",
                    "Pseudo-Exhaustive Testing of Sequential Circuits.",
                    "Advances Toward Molecular-Scale Electronic Digital Logic Circuits: A Review and Prospectus.",
                    "Self-Assembly Based Approaches for Metal/Molecule/Semiconductor Nanoelectronic Circuits.",
                    "Logic in Wire: Using Quantum Dots to Implement a Microprocessor.",
                    "Why is Time-Varying Control Necessary for Signal Processing with Locally-Connected Quantum-Dot Arrays?",
                    "Transport in Split Gate MOS Quantum Dot Structures.",
                    "Resonant Tunneling Technology for Mixed Signal and Digital Circuits in the 10-100 GHz Domain.",
                    "Efficient Algorithms for Finding Highly Acceptable Designs Based on Module-Utility Selections.",
                    "Reducing BDD Size by Exploiting Structural Connectivity.",
                    "An Integrated Approach for Synthesizing LUT Networks.",
                    "Hierarchical Scheduling in High Level Synthesis Using Resource Sharing Across Nested Loops.",
                    "Design Issues in Synthesis of Reusable Cores.",
                    "Ultrahigh-Speed Circuits Using Resonant Tunneling Devices.",
                    "A Novel High-Speed Flip-Flop Circuit Using RTDs and HEMTs.",
                    "Design and Analysis of a Novel Quantum-MOS Sense Amplifier Circuit.",
                    "Integration of InAs/AlSb/GaSb Resonant Interband Tunneling Diodes with Heterostructure Field-Effect Transistors for Ultra-High-Speed Digital Circuit Applications.",
                    "A Memory Design in QCAs using the SQUARES Formalism.",
                    "Transistor Level Synthesis for Static CMOS Combinational Circuits.",
                    "SINMEF - A Decomposition Based Synthesis Tool for Large FSMs.",
                    "An Approach for Testing Safety-Critical Software.",
                    "Design Recovery for Incomplete Combinational Logic.",
                    "Regression-Based Macromodeling for Delay Estimation of Behavioral Components.",
                    "Efficiently Searching the Optimal Design Space.",
                    "A Bandpass Sigma-Delta for Software Low-Power and Low-Voltage Radio by Using PATH Technique.",
                    "No-Race Charge-Recycling Differential Logic (NCDL).",
                    "Linear Transconductors Using Low Voltage Low Power Square-Law Cmos Cells.",
                    "Current Sensor on the Base of Permanent Pre-chargeable Amplifier.",
                    "Parallel Saturating Fractional Arithmetic Units.",
                    "Residue Arithmetic Circuits Based on Signed-Digit Number Representation and the VHDL Implementation.",
                    "Modell Evaluation Using Genetic Manipulation Techniques.",
                    "A Genetic Algorithm for Register Allocation.",
                    "Congestion Mitigation During Placement.",
                    "A Spiffy Tool for the Simultaneous Placement and Global Routing for Three-Dimensional Field-Programmable Gate Arrays.",
                    "Formal Verification of Tree-Structured Carry-Lookahead Adders.",
                    "Bounding Algorithms for Design Space Exploration.",
                    "Digital Neural Processing Unit for Electronic Nose.",
                    "A Low Power Charge-Recycling CMOS Clock Buffer.",
                    "A Multiple-Input Single-Phase Clock Flip-Flop Family.",
                    "Methodology of Logic Synthesis for Implementation Using Heterogeneous LUT FPGAs.",
                    "VHDL Design of a Test Processor Based on Mixed-Mode Test Generation.",
                    "An Incremental Floorplanner.",
                    "A Greedy Router with Technology Targetable Output.",
                    "Routability Prediction for Hierarchical FPGAs.",
                    "Memory Unit Design for Real Time DSP Applications.",
                    "Design Automation of MEMS Systems Using Behavioral Modeling.",
                    "Blending Symbolic Matrix and Dimensional Numerical Simulation Methodology for Mechatronics Systems.",
                    "Numerical Tools for Fracture of MEMS Devices.",
                    "Formal Checking of Properties in Complex Systems Using Abstractions.",
                    "A Hierarchical Approach to the Formal Verification of Embedded Systems Using MDGs.",
                    "Symbolic Multi-Level Verification of Refinement.",
                    "Self-Checking of FPGA-Based Control Units.",
                    "A Software Acceptance Testing Technique Based on Knowledge Accumulation.",
                    "A Correlation Matrix Method of Clock Partitioning for Sequential Circuit Testability.",
                    "A Novel Low Power Low Phase-Noise PLL Architecture for Wireless Transceivers.",
                    "NMOS Energy Recovery Logic.",
                    "Noise Immunity of Digital Circuits in Mixed-Signal Smart Power Systems.",
                    "An all Digital BiCMOS Phase Lock Loop for VLSI Processors.",
                    "Low Power Techniques for Digital GaAs VLSI.",
                    "A VLSI Architecture for ATM Algorithm-Agile Encryption.",
                    "On an Efficient Method for Estimating the Interconnection Complexity of Designs and on the Existence of Region III in Rent's Rule.",
                    "Monolithic Microprocessor and RF Transceiver in 0.25-micron FDSOI CMOS.",
                    "Low Power Design of an Acoustic Echo Canceller Gmdf a Algorithm on Dedicated VLSI Architectures.",
                    "A Fully Pipelined, 700MBytes/s DES Encryption Core.",
                    "Proposal of Data-Driven Processor Architecture Qv-K1.",
                    "Accurate Resource Estimation Algorithms for Behavioral Synthesis.",
                    "Assessing Defect Coverage of Memory Testing Algorithms.",
                    "Memory Chip BIST Architecture.",
                    "Exploiting Test Resource Optimization in Data Path Synthesis for BIST.",
                    "Resonant Tunneling Transistors for Threshold Logic Circuit Applications.",
                    "A Multilevel Cache Memory Architecture for Nanoelectronics.",
                    "ALPS: A Peak Power Estimation Tool for Sequential Circuits.",
                    "Clustered Table-Based Macromodels for RTL Power Estimation.",
                    "The Design of Cmos Gigahertz-Band Continuous-Time Active Lowpass Filters with Q-Enhancement Circuits.",
                    "A New Algorithm for RNS Magnitude Comparison Based on New Chinese Remainder Theorem II.",
                    "Low Power Chip Interface Based on Bus Data Encoding with Adaptive Code-Book Method.",
                    "A 1.8V High Dynamic-Range CMOS High-Speed Four Quadrant Multiplier.",
                    "A Second-Order Sigma-Delta Modulator with Built-in VGA to Improve SNR and Harmonic Distortion.",
                    "A Novel Low Power Energy Recovery Full Adder Cell."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "8th Great Lakes Symposium on VLSI 1998",
        "info": "Lafayette, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1998",
                "sub_name": "8th Great Lakes Symposium on VLSI (GLS-VLSI '98), 19-21 February 1998, Lafayette, LA, USA.",
                "count": 75,
                "papers": [
                    "Low Power Memory Architectures for Video Applications.",
                    "Reducing Power Consumption of Dedicated Processors Through Instruction Set Encoding.",
                    "A Low-Power High-Performance Embedded SRAM Macrocell.",
                    "Low-Power Design of Finite Field Multipliers for Wireless Applications.",
                    "Guidelines for Use of Registers and Multiplexers in Low Power Low Voltage DSP Systems.",
                    "A Bootstrapped NMOS Charge Recovery Logic.",
                    "Power Reducing Techniques for Clocked CMOS PLAs.",
                    "Dynamic and Short-Circuit Power of CMOS Gates Driving Lossless Transmission Lines.",
                    "A New Full Adder Cell for Low-Power Applications.",
                    "beta-Driven Threshold Elements.",
                    "A VLSI High-Performance Encoder with Priority Lookahead.",
                    "Noise Margins of Threshold Logic Gates containing Resonant Tunneling Diodes.",
                    "600 MHz Digitally Controlled BiCMOS Oscillator (DCO) for VLSI Signal Processing & Communication Applications.",
                    "Stability of a Continuous-Time State Variable Filter with OP-AMP and OTA-C Integrators.",
                    "Multiple-Valued Logic Voltage-Mode Storage Circuits Based On True-Single-Phase Clocked Logic.",
                    "CMOS Tapered Buffer Design for Small Width Clock/Data Signal Propagation.",
                    "Design of Clock Distribution Networks in Presence of Process Variations.",
                    "Design of an 8: 1 MUX at 1.7Gbit/s in 0.8µm CMOS Technology.",
                    "Issues in the Design of Domino Logic Circuits.",
                    "A Novel 1.5-V Cmos Mixer.",
                    "Analysis of Adaptive CMOS Down Conversion Mixers.",
                    "Artificial Neural Network Electronic Nose for Volatile Organic Compounds.",
                    "A VLSI Self-Compacting Buffer for DAMQ Communication Switches.",
                    "A Dictionary Machine Emulation on a VLSI Computing Tree System.",
                    "Modeling and Analysis of The Difference-Bit Cache.",
                    "Modeling of Shift Register-based ATM Switch.",
                    "An Architecture of Full-Search Block Matching for Minimum Memory Bandwidth Requirement.",
                    "MPEG-2 Video Decoder for DVD.",
                    "A Self Timed Asynchronous Router for an Heterogeneous Parallel Machine.",
                    "Non-Refreshing Analog Neural Storage Tailored for On-Chip Learning.",
                    "Residue to Binary Number Converters for (2n-1, 2n, 2n+1).",
                    "The Design of Residue Number System Arithmetic Units for A VLSI Adaptive Equalizer.",
                    "An Efficient Residue to Weighted Converter for a New Residue Number System.",
                    "The Chinese Abacus Method: Can We Use It for Digital Arithmetic?",
                    "Merged Arithmetic for Computing Wavelet Transforms.",
                    "Digital Arithmetic Using Analog Arrays.",
                    "A Combined Interval and Floating Point Multiplier.",
                    "Test Compaction for Synchronous Sequential Circuits by Test Sequence Recycling.",
                    "Random Self-Test Method - Applications on PowerPC (tm) Microprocessor Caches.",
                    "A Unified Approach for a Time-Domain Built-In Self-Test Technique and Fault Detection.",
                    "VHDL Testability Analysis Based on Fault Clustering and Implicit Fault Injection.",
                    "IDD Waveforms Analysis for Testing of Domino and Low Voltage Static CMOS Circuits.",
                    "A Design-for-Testability Technique for Detecting Delay Faults in Logic Circuits.",
                    "Development of a CMOS Cell Library for RF Wireless and Telecommunications Applications.",
                    "Design Issues of LC Tuned Oscillators for Integrated Transceivers.",
                    "Novel Simple Models Of Cml Propagation Delay.",
                    "Next-Generation Narrowband RF Front-Ends in Silicon IC Technology.",
                    "Low Voltage Low power CMOS AGC circuit for wireless communication.",
                    "A Continuous-Time Switched-Current Sigma-Delta Modulator with Reduced Loop Delay.",
                    "An Exact Input Encoding Algorithm for BDDs Representing FSMs.",
                    "Maximum Current Estimation in Programmable Logic Arrays.",
                    "Mutually Disjoint Signals and Probability Calculation in Digital Circuits.",
                    "Identifying High-Level Components in Combinational Circuits.",
                    "Local Optimality Theory in VLSI Channel Routing: Composite Cyclic Vertical Constraints.",
                    "Linear Transformations and Exact Minimization of BDDs.",
                    "Timed Supersetting and the Synthesis of Telescopic Units.",
                    "Tabu Search Based Circuit Optimization.",
                    "On the Characterization of Multi-Point Nets in Electronic Designs.",
                    "HOOVER: Hardware Object-Oriented Verification.",
                    "MDG-based Verification by Retiming and Combinational Transformations.",
                    "Practical Considerations in Formal Equivalence Checking of PowerPC(tm) Microprocessors.",
                    "Practical Approaches to the Automatic Verification of an ATM Switch Fabric Using VIS.",
                    "Performance Optimization of Self-Timed Circuits.",
                    "Stochastic Evolution Algorithm For Technology Mapping.",
                    "RCRS: A Framework for Loop Scheduling with Limited Number of Registers.",
                    "A Quantitative Study of the Benefits of Area-I/O in FPGAs.",
                    "Top-Down Design Using Cycle Based Simulation: an MPEG A/V Decoder Example.",
                    "Low Power Driven Scheduling and Binding.",
                    "Effective Capacitance Macro-Modelling for Architectural-Level Power Estimation.",
                    "A Methodology for High Level Power Estimation and Exploration.",
                    "How to Transform an Architectural Synthesis Tool for Low Power VLSI Designs.",
                    "Sharing Electronic Design Data Via Semantic Spaces.",
                    "VHDL-based EDA Tool Implementation with Java.",
                    "Standard Data Representations for VLSI Algorithm Development.",
                    "A Storage Structure for Graph-Oriented Databases Using an Array of Element Types."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "7th Great Lakes Symposium on VLSI 1997",
        "info": "Urbana, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1997",
                "sub_name": "7th Great Lakes Symposium on VLSI (GLS-VLSI '97), 13-15 March 1997, Urbana, IL, USA.",
                "count": 30,
                "papers": [
                    "An Efficient Paired-net Routing Algorithm for High-speed Bipolar LSIs.",
                    "A Full-Swing Bootstrapped BiCMOS Buffer.",
                    "A 1.4 Gbit/s CMOS driver for 50 Ω ECL systems.",
                    "On Generating Test Sets that Remain Valid in the Presence of Undetected Faults.",
                    "A New Heuristic Algorithm for Estimating Signal and Detection Probabilities.",
                    "Parity Bit Code: Achieving a Complete Fault Coverage in the Design of TSC Combinational Networks.",
                    "Restricted Simple Disjunctive Decompositions Based on Grouping Symmetric Variables.",
                    "A Fast Algorithm for Locating and Correcting Simple Design Errors in VLSI Digital Circuits.",
                    "OLIVIA: Objectoriented Logicsimulation Implementing the VITAL Standard.",
                    "Hardware interface design for real time embedded systems.",
                    "A System Design Methodology for Telecommunication Network Applications.",
                    "Accurate Entropy Calculation for Large Logic Circuits Based on Output Clustering.",
                    "Asymptotic Zero-Transition Activity Encoding for Address Busses in Low-Power Microprocessor-Based Systems.",
                    "Power Reduction in Large Fan-in CMOS Gates in Logic Arrays Using Selective Precharge.",
                    "A New Low-Voltage Full Adder Circuit.",
                    "VLSI Architectures for Programmable Sorting of Analog Quantities with Multiple-Chip Support.",
                    "A new method for asynchronous pipeline control.",
                    "The MGAP Family of Processor Arrays.",
                    "An Efficient Dynamic Parallel Approach to Automatic Test Pattern Generation.",
                    "Use of Statecharts-Related Description to Achieve Testable Design of Control Subsystems.",
                    "How an \"Evolving\" Fault Model Improves the Behavioral Test Generation.",
                    "A prototype chipset for a large scaleable ATM switching node.",
                    "Analog Circuit Model of Lamprey Unit Pattern Generator.",
                    "A New CMOS Tunable Transconductor Dedicated to VHF Continuous-Time Filters.",
                    "Scheduling with Confidence for Probabilistic Data-flow Graphs.",
                    "A low power based system partitioning and binding technique for multi-chip module architectures.",
                    "Algorithm and Hardware Support for Branch Anticipation.",
                    "Modular Design of Communication Node Prototypes.",
                    "Parallel VLSI Architectures for Cryptographic Systems.",
                    "A Clocked, Static Circuit Technique for Building Efficient High Frequency Pipelines."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "6th Great Lakes Symposium on VLSI 1996",
        "info": "Ames, IA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1996",
                "sub_name": "6th Great Lakes Symposium on VLSI (GLS-VLSI '96), March 22-23, 1996, Ames, IA, USA.",
                "count": 54,
                "papers": [
                    "Loop-List Scheduling for Heterogeneous Functional Units.",
                    "Synthesis of Real-Time Recursive DSP Algorithms Using Multiple Chips.",
                    "Resource-Constrained Algebraic Transformation for Loop Pipelining.",
                    "A Global Mode Instruction Minimization Technique for Embedded DSPs.",
                    "A 1.0ns 64-bits GaAs Adder using Quad tree algorithm.",
                    "FPGA-based high performance page layout segmentation.",
                    "A Reprogrammable FPGA-Based ATM Traffic Generator.",
                    "Software Fault Tolerance Using Dynamically Reconfigurable FPGAs.",
                    "A New Faster Algorithm for Iterative Placement Improvement.",
                    "An Accurate Interconnection Length Estimation for Computer Logic.",
                    "A Minimum-Area Floorplanning Algorithm for MBC Designs.",
                    "A New Model for General Connectivity and its Application to Placement.",
                    "A Parameterized Index-Generator for the Multi-Dimensional Interleaving Optimization.",
                    "A High Speed VLSI Architecture for Scaleable ATM Switches.",
                    "A Design Exploration Environment.",
                    "A Parametrical Architecture for Reed-Solomon Decoders.",
                    "A Provably Good Moat Routing Algorithm.",
                    "On Locally Optimal Breaking of Complex Cyclic Vertical Constraints in VLSI Channel Routing.",
                    "Chip Pad Migration is a Key Component to High Performance MCM Design.",
                    "An Optimal ILP Formulation for Minimixing the Number of Feedthrough Cells in Standard Cell Placement.",
                    "Formal Verification of an ATM Switch Fabric using Multiway Decision Graphs.",
                    "Boolean Function Representation Using Parallel-Access Diagrams.",
                    "Logic Synthesis for Testability.",
                    "Self-Timed Mesochronous Interconnection for High-Speed VLSI Systems.",
                    "Least Upper Bounds on the Sizes of Symmetric Variable Order based OBDDs.",
                    "Performance-Driven Interconnect Global Routing.",
                    "Recent Developments in Performance Driven Steiner Routing: An Overview.",
                    "Clock Buffer Placement Algorithm for Wire-Delay-Dominated Timing Model.",
                    "Simultaneous Routing and Buffer Insertion for High Performance Interconnect.",
                    "Timing and Power Optimization by Gate Sizing Considering False Paths.",
                    "Exact Computation of the Entropy of a Logic Circuit.",
                    "CMOS Transistor Sizing for Minimization of Energy-Delay Product.",
                    "Low-Power Implementation of Discrete Cosine Transform.",
                    "Some Issues in Gray Code Addressing.",
                    "A Hierarchal Approach for Power Reduction in VLSI Chips.",
                    "TROY: A Tree-Based Approach to Logic Synthesis and Technology Mapping.",
                    "Transistor Chaining in CMOS Leaf Cells of Planar Topology.",
                    "Partitioning Algorithms for Corner Stitching.",
                    "Test Generation for Networks of Interacting FSMs Using Symbolic Techniques.",
                    "Input Pattern Classification for Transistor Level Testing of Bridging Faults in BiCMOS Circuits.",
                    "Efficient Delay Test Generation for Modular Circuits.",
                    "Design and VLSI Implementation of a Unified Synapse-Neuron Architecture.",
                    "Rapid Prototyping for Fuzzy Systems.",
                    "A Modular Architecture for Real Time HDTV Motion Estimation with Large Search Range.",
                    "A VLSI Interconnection Network Router Using a D-CAM with Hidden Refresh.",
                    "A High-Speed, Real-to-Quadrature Converter with Filtering and Decimation.",
                    "A CMOS VLSI Implementation of an NxN Multiplexing Circuitry for ATM Applications.",
                    "A 3V-50MHz Analog CMOS Current-Mode High Frequency Filter with a Negative Resistance Load.",
                    "Delay Hazards in Complex Gate Based Speed Independent VLSI Circuits.",
                    "Macromodeling C- and RC-loaded CMOS inverters for timing analysis.",
                    "On Verifying the Correctness of Retimed Circuits.",
                    "On Double Transition Faults as a Delay Fault Model.",
                    "Improving Circuit Testability by Clock Control.",
                    "An Efficient Multiple Scan Chain Testing Scheme."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th Great Lakes Symposium on VLSI 1995",
        "info": "Buffalo, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1995",
                "sub_name": "5th Great Lakes Symposium on VLSI (GLS-VLSI '95), March 16-18, 1995, The State University of New York at Buffalo, USA.",
                "count": 51,
                "papers": [
                    "Uniform area timing-driven circuit implementation.",
                    "Optimization using implicit techniques for industrial designs.",
                    "Optimal technology mapping for single output cells.",
                    "A Differential Model Approach To Analog Design Automation.",
                    "A new approach for modeling and optimization of analog systems.",
                    "A scalable analog architecture for neural networks with on-chip learning and refreshing.",
                    "Bus minimization and scheduling of multi-chip systems.",
                    "Thumbnail rectilinear Steiner trees.",
                    "A two-stage simulated annealing methodology.",
                    "Optimizing wiring space in slicing floorplans.",
                    "Estimating worst-case power consumption of CMOS circuits modeled as symbolic neural networks.",
                    "Design and analysis of a low-power energy-recovery adder.",
                    "Coding a terminated bus for low power.",
                    "Circuit/architecture for low-power high-performance 32-bit adder.",
                    "Symbolic execution of data paths.",
                    "Specification and synthesis of bounded indirection.",
                    "Synthesis of SEU-tolerant ASICs using concurrent error correction.",
                    "Scheduling conditional data-flow graphs with resource sharing.",
                    "Automated verification of temporal properties specified as state machines in VHDL.",
                    "Partitioning transition relations efficiently and automatically.",
                    "Using symbolic Rademacher-Walsh spectral transforms to evaluate the correlation between Boolean functions.",
                    "An efficient building block layout methodology for compact placement.",
                    "Performance driven standard-cell placement using the genetic algorithm.",
                    "An Efficient Heuristic Approach on Minimizing the Number of Feedthrough Cells in Standard Cell Placement.",
                    "Priority driven channel pin assignment.",
                    "A systolic algorithm and architecture for image thinning.",
                    "Analyzing and verifying locally clocked circuits with the concurrency workbench.",
                    "Automatic rapid prototyping of semi-custom VLSI circuits using Actel FPGAs.",
                    "A local clocking approach for self-timed datapath designs.",
                    "A soft computing approach to hardware software codesign.",
                    "Technology mapping algorithms for sequential circuits using look-up table based FPGAS.",
                    "Modeling of communication protocols in VHDL.",
                    "Using EDIF for software generation.",
                    "A protocol extraction strategy for control point insertion in design for test of transition signaling circuits.",
                    "Statistical estimation of delay fault detectabilities and fault grading.",
                    "Test application time reduction for scan based sequential circuits.",
                    "Pseudo-random behavioral ATPG.",
                    "Fast algorithm for performance-oriented Steiner routing.",
                    "On locally optimal breaking of nondisjoint cyclic vertical constraints in VLSI channel routing.",
                    "OPRON: a new approach to planar OTC routing.",
                    "Parallel hierarchical global routing for general cell layout.",
                    "Improving self-timed pipeline ring performance through the addition of buffer loops.",
                    "Scan testing of asynchronous sequential circuits.",
                    "A new look at the conditions for the synthesis of speed-independent circuits.",
                    "Design and manufacture of a 2K transistor p-well CMOS gate array in a student run factory at RIT.",
                    "Using a reconfigurable field programmable gate array to demonstrate boundary scan with built in self test.",
                    "Linking fabrication and parametric testing to VLSI design courses.",
                    "A personal computer based VLSI design curriculum.",
                    "A scalable shared buffer ATM switch architecture.",
                    "ATM burst traffic generator.",
                    "A universal formalization of the effects of threshold voltages for discrete switch-level circuit models."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "4th Great Lakes Symposium on VLSI 1994",
        "info": "Notre Dame, IN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1994",
                "sub_name": "Fourth Great Lakes Symposium on Design Automation of High Performance VLSI Systems, GLSV '94, Notre Dame, IN, USA, March 4-5, 1994.",
                "count": 48,
                "papers": [
                    "A distributed controller for system level integration.",
                    "Optimizing cyclic data-flow graphs via associativity.",
                    "Abstraction of data path registers for multilevel verification of large circuits.",
                    "Automated system partitioning for synthesis of multi-chip modules.",
                    "Floorplan area optimization using genetic algorithms.",
                    "Floorplanning for mixed macro block and standard cell designs.",
                    "Convergence analyses of simulated evolution algorithms.",
                    "Estimating the storage requirements of the rectangular and L-shaped corner stitching data structures.",
                    "A new systolic architecture for pipeline prime factor DFT-algorithm.",
                    "The design of a fault tolerant GEQRNS processing element for linear systolic array DSP applications.",
                    "Structural fault tolerance in VLSI-based systems.",
                    "An algorithm-base fault tolerance (more than one error) using concurrent error detection for FFT processors.",
                    "Generalized segmented channel routing.",
                    "On computational complexity of a detailed routing problem in two dimensional FPGAs.",
                    "Mathematical model for routability analysis of FPGAs.",
                    "An optimal algorithm for maximum two planar subset problem [VLSI layout].",
                    "A performance driven logic synthesis system using delay estimator.",
                    "Symbolic traversals of data paths with auxiliary variables.",
                    "FPGA-based synthesis of FSMs through decomposition.",
                    "Communication based multilevel synthesis for multi-output Boolean functions.",
                    "A new scheme to compute variable orders for binary decision diagrams.",
                    "Design of a package for a high-speed processor made with yield-limited technology.",
                    "A flow based approach to the pin redistribution problem for multi-chip modules.",
                    "Wiring pitch integrates MCM design domains.",
                    "A VLSI CAM-based flexible oblivious router for multiprocessor interconnection networks.",
                    "Design of transport triggered architectures.",
                    "ASIC design for robust signal and image processing.",
                    "VLSI implementation of CORDIC angle units.",
                    "Mapping tensor products onto VLSI networks with reduced I/O.",
                    "A gridless multi-layer area router.",
                    "Routability crossing distribution and floating terminal assignment of T-type junction region.",
                    "Simulated annealing based yield enhancement of layouts.",
                    "An efficient algorithm for the realizability analysis of signal transition graphs.",
                    "Distributed data-path synthesis on a network of workstations.",
                    "Basic building blocks for asynchronous packet routers.",
                    "An efficient multiprocessor implementation scheme for real-time DSP algorithms.",
                    "An energy-efficient CMOS line driver using adiabatic switching.",
                    "Scaling of serially-connected MOSFET chains.",
                    "Design of a 54-bit adder using a modified Manchester carry chain.",
                    "Low-power differential CML and ECL BiCMOS circuit techniques.",
                    "Retiming algorithms with application to VLSI testability.",
                    "Area, performance, and sensitizable paths [logic design].",
                    "Delay independent initialization of sequential circuits.",
                    "Efficient simulation of switch-level circuits in a hierarchical simulation environment.",
                    "A faster dynamic programming algorithm for exact rectilinear Steiner minimal trees.",
                    "An improved algorithm for the generalized min-cut partitioning problem.",
                    "An ADD-based algorithm for shortest path back-tracing of large graphs.",
                    "Generation of color-constrained spanning trees with application in symbolic circuit analysis."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "3rd Great Lakes Symposium on VLSI 1993",
        "info": "Kalamazoo, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1993",
                "sub_name": "Third Great Lakes Symposium on Design Automation of High Performance VLSI Systems, Kalamazoo, MI, USA, March 5-6, 1993.",
                "count": 32,
                "papers": [
                    "Minimizing channel density with movable terminals.",
                    "VICTOR: A three-layer over-the-cell router.",
                    "Modeling the vertical constraints in VLSI channel routing.",
                    "Modeling stuck-open faults in CMOS iterative circuits.",
                    "Delay fault testability evaluation through timing simulation.",
                    "C-testable systolic arrays.",
                    "A VLSI-based digital multilayer neural network architecture.",
                    "Neural system design with the integrated neurocomputing architecture.",
                    "A parallel VLSI implementation of Viterbi algorithm for accelerated word recognition.",
                    "Clock partitioning for testability.",
                    "Locally clocked microprocessor.",
                    "A simple method for noise tolerance characterization of digital circuits.",
                    "Switchbox routing with movable terminals.",
                    "Mixed spanning trees: a technique for performance-driven routing.",
                    "Corner stitching for L-shaped tiles.",
                    "Parallel genetic algorithm for channel routing.",
                    "Optimal register allocation in high level synthesis.",
                    "Efficient minimization algorithms for fixed polarity AND/XOR canonical networks.",
                    "Rate-optimal static scheduling for DSP data-flow programs.",
                    "Rapid-prototyping of high-assurance systems.",
                    "Toward a Steiner engine: enhanced serial and parallel implementations of the iterated 1-Steiner MRST algorithm.",
                    "A potential-driven approach to constructing rectilinear Steiner trees.",
                    "Minmax-cut graph partitioning problems.",
                    "Local improvement in Steiner trees.",
                    "Δ-trees of a graph: introduction and formal definition.",
                    "Automating the packaging selection of VLSI systems.",
                    "Adaptive bounded time windows in an optimistically synchronized simulator.",
                    "Optimizing carry lookahead adders for semicustom CMOS.",
                    "A logic synthesis system based on global dynamic extraction and flexible cost.",
                    "VLSI synthesis of a programmable DWT chip for the optimal choice of a prototype wavelet.",
                    "MinMux: a new approach for global minimization of multiplexers in interconnect synthesis.",
                    "A new state assignment technique for asynchronous finite state machines."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "2nd Great Lakes Symposium on VLSI 1992",
        "info": "Kalamazoo, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1992",
                "sub_name": "Proceedings of the Second Great Lakes Symposium on VLSI, Kalamazoo, MI, USA, February 28-29, 1992.",
                "count": 30,
                "papers": [
                    "On the use of hierarchy in timing verification with statically sensitizable paths.",
                    "A design for concurrent error detections in FPLAs.",
                    "A chip solution to hierarchical and boundary-scan compatible board level BIST.",
                    "Examining routing solutions.",
                    "The parallel complexity of minimizing column conflicts.",
                    "Performance driven placement with global routing for macro cells.",
                    "A heuristic for data path synthesis using multiport memories.",
                    "Models for bit-true simulation and high-level synthesis of DSP applications.",
                    "High performance data-path synthesis via communication metrics.",
                    "Cutwidth approximation in linear time.",
                    "Quadtree interconnection network layout.",
                    "Interactive optimal channel router for critical nets.",
                    "Two-layer via-free routing in channels and switchboxes.",
                    "A new conflict resolving switchbox router.",
                    "An asynchronous multiplier.",
                    "Self-timed pipeline with adder.",
                    "VLSI implementation of controllers for communication protocols from their Petri net models.",
                    "An alternative algorithm for high speed multiplication and addition using growing technique.",
                    "A systematic approach for designing systolic arrays.",
                    "A new algorithm for signal flow determination in CMOS VLSI.",
                    "Routing in a rectangle with k-ary overlap.",
                    "An algorithm for embedding a class of non-even routing problems in even routing problems.",
                    "A signed hypergraph model of constrained via minimization.",
                    "Interface constrained processor specification and scheduling.",
                    "On the detection and elimination of superfluous level-sensitive latches.",
                    "Axiomatic semantics of a hardware specification language.",
                    "T-algorithm-based logic simulation on distributed systems.",
                    "Clock tree regeneration.",
                    "The Steiner tree problem with minimum number of vertices in graphs.",
                    "Optimum Steiner tree generation."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "1st Great Lakes Symposium on VLSI 1991",
        "info": "Kalamazoo, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/glvlsi/1991",
                "sub_name": "First Great Lakes Symposium on VLSI, 1991, Kalamazoo, MI, USA, March 1-2, 1991.",
                "count": 63,
                "papers": [
                    "Design and evaluation of fault tolerance techniques for highly parallel architectures.",
                    "Interlocked test generation and digital hardware synthesis.",
                    "VLSI routing on the pipelined hypercube and related networks.",
                    "Dense layouts for series-parallel circuits.",
                    "Area efficient binary tree layout.",
                    "On wiring overlap layouts.",
                    "I/O bound binary tree layout.",
                    "A test controller board for TSS.",
                    "General and efficient multiple list traversal for concurrent fault simulation.",
                    "An innovative user interface for fault simulation systems.",
                    "A hierarchical multi-level test generation system.",
                    "On the complexity of a fault-tolerance model for multicomputer systems.",
                    "Algorithm independent data flow mapping on a unified VLSI architecture.",
                    "A massively parallel and versatile architecture for computer vision.",
                    "Transforming disfigured and disoriented areas into routable switchboxes.",
                    "On the generalized channel definition problem.",
                    "An efficient tabu search algorithm for graph bisectioning.",
                    "A new approach to timing driven partitioning of combinational logic.",
                    "Optimal test set for stuck-at faults in VLSI.",
                    "Transition count testing of CMOS combinational circuits.",
                    "An algebraic approach to test generation for sequential circuits.",
                    "A low power CMOS correlator.",
                    "Implementation of fault-tolerant sequential circuits using programmable logic arrays.",
                    "A CAD tool for designing large, fault-tolerant VLSI arrays.",
                    "A VLSI implementation of a state variable filter algorithm.",
                    "A framework for 1-D compaction with forbidden region avoidance [VLSI layout].",
                    "A linear-time heuristic for rectilinear Steiner trees.",
                    "Routing non-convex grids without holes.",
                    "Four layer wiring using adjacent-layer vias.",
                    "A VLSI peripheral system for monitoring and stimulating action potentials of cultured neurons.",
                    "An architecture design using VLSI building blocks for dynamic programming neural networks.",
                    "Applying Hopfield network to find the minimum cost coverage of a Boolean function.",
                    "Two-dimensional multirate systolic array design for artificial neural networks.",
                    "High frequency analog circuit design using QuickChip.",
                    "A high resolution current stimulating probe for use in neural prostheses.",
                    "Designing VLSI systolic arrays with complex processing elements.",
                    "The 60° grid: routing channels in width d/√3.",
                    "Topological via minimization and routing.",
                    "An experimental environment for design and analysis of global routing heuristics.",
                    "Building block layout based on block compaction and two-adjacent-side channel router.",
                    "Testability profile estimation of VLSI circuits from fault coverage.",
                    "Test plan generation and concurrent scheduling of tests in the presence of conflicts.",
                    "A parallel algorithm for logic simulation on transputer networks.",
                    "Proving finite state machines correct with an automaton-based method.",
                    "Discrete Fourier transform processors using CORDIC.",
                    "Uni-directional cube-connected cycles.",
                    "A poly to active region VLSI mask alignment test structure.",
                    "An approach for multilevel logic cell optimization in module generators.",
                    "Gate matrix layout based on hierarchical net-list representations.",
                    "GALSY, an automatic layout generator of symbolic layouts from MOS circuit schematics.",
                    "Schematic driven layout for the custom VLSI design environment.",
                    "A reconstructive approach to automated design synthesis.",
                    "Genetic synthesis: performance-driven logic synthesis using genetic evolution.",
                    "Sequence invariant state machine compiler.",
                    "CMOS output buffer waveshaping.",
                    "Modeling of the transverse delays in modulation-doped heterojunction field-effect transistors.",
                    "Gate level representation of ECL circuits for fault modeling.",
                    "'NCHIPSIM'-a microcomputer simulator of NMOS chip performance indicators.",
                    "Evaluation of silicon-on-sapphire enhancement JFETs for digital applications.",
                    "Study of quaternary logic versus binary logic.",
                    "Design of fail-safe CMOS logic circuits.",
                    "Integrated approach to area-time tradeoff for built-in-self-test in VLSI circuits.",
                    "HADES-high-level architecture development and exploration system."
                ]
            }
        ]
    }
]