[
    {
        "year": "2021",
        "name": "28th HiPC 2021",
        "info": "Bengaluru, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2021",
                "sub_name": "28th IEEE International Conference on High Performance Computing, Data, and Analytics, HiPC 2021, Bengaluru, India, December 17-20, 2021.",
                "count": 54,
                "papers": [
                    "Improving Efficiency and Performance Through Faster Scheduling Mechanisms.",
                    "Towards an Integral System for Processing Big Graphs at Scale.",
                    "Parallel Actors and Learners: A Framework for Generating Scalable RL Implementations.",
                    "AI4IO: A Suite of Ai-Based Tools for IO-Aware HPC Resource Management.",
                    "DEISA: Dask-Enabled In Situ Analytics.",
                    "A Model of Graph Transactional Coverage Patterns with Applications to Drug Discovery.",
                    "Faster Parallel Training of Word Embeddings.",
                    "CMAP-LAP: Configurable Massively Parallel Solver for Lattice Problems.",
                    "MulConn: User-Transparent I/O Subsystem for High-Performance Parallel File Systems.",
                    "Monte Carlo Tree Search for Task Mapping onto Heterogeneous Platforms.",
                    "Shared-memory implementation of the Karp-Sipser kernelization process.",
                    "How to Avoid Zero-Spacing in Fractionally-Strided Convolution? A Hardware-Algorithm Co-Design Methodology.",
                    "PPBT: A High Performance Parallel Search Tree.",
                    "Deciding Non-Compressible Blocks in Sparse Direct Solvers using Incomplete Factorization.",
                    "Efficient Parallel Algorithms for Computing Percolation Centrality.",
                    "Accelerating JPEG Decompression on GPUs.",
                    "Towards Zero-Waste Recovery and Zero-Overhead Checkpointing in Ensemble Data Assimilation.",
                    "Predictive Analysis of Large-Scale Coupled CFD Simulations with the CPX Mini-App.",
                    "The 16, 384-node Parallelism of 3D-CNN Training on An Arm CPU based Supercomputer.",
                    "iPUG for Multiple Graphcore IPUs: Optimizing Performance and Scalability of Parallel Breadth-First Search.",
                    "Empirical Analysis of Architectural Primitives for NVRAM Consistency.",
                    "JACC: An OpenACC Runtime Framework with Kernel-Level and Multi-GPU Parallelization.",
                    "Anti-Section Transitive Closure.",
                    "Column-Segmented Sparse Matrix-Matrix Multiplication on Multicore CPUs.",
                    "Multi-Stage Memory Efficient Strassen's Matrix Multiplication on GPU.",
                    "Optimizing k-path selection for randomized interconnection networks.",
                    "Dynamic Voltage and Frequency Scaling to Improve Energy-Efficiency of Hardware Accelerators.",
                    "Adaptive Placement of Data Analysis Tasks For Staging Based In-Situ Processing.",
                    "HEALS: A Parallel eALS Recommendation System on CPU/GPU Heterogeneous Platforms.",
                    "Shrinking Sample Search Algorithm for Automatic Tuning of GPU Kernels.",
                    "Towards Architecture-aware Hierarchical Communication Trees on Modern HPC Systems.",
                    "DistMILE: A Distributed Multi-Level Framework for Scalable Graph Embedding.",
                    "Model-based Reinforcement Learning for Elastic Stream Processing in Edge Computing.",
                    "Layout-aware Hardware-assisted Designs for Derived Data Types in MPI.",
                    "Parallel Algorithms for Efficient Computation of High-Order Line Graphs of Hypergraphs.",
                    "Asynchronous I/O Strategy for Large-Scale Deep Learning Applications.",
                    "SYMBIOMON: A High-Performance, Composable Monitoring Service.",
                    "Load-balancing Parallel I/O of Compressed Hierarchical Layouts.",
                    "CUDA-DClust+: Revisiting Early GPU-Accelerated DBSCAN Clustering Designs.",
                    "Static Graphs for Coding Productivity in OpenACC.",
                    "Performance of Local Push Algorithms for Personalized PageRank on Multi-core Platforms.",
                    "BEE Orchestrator: Running Complex Scientific Workflows on Multiple Systems.",
                    "OpenACC Multi-GPU Approach for WSM6 Microphysics.",
                    "Large-Message Nonblocking MPI_Iallgather and MPI Ibcast Offload via BlueField-2 DPU.",
                    "Optimizing Multi-Range based Error-Bounded Lossy Compression for Scientific Datasets.",
                    "An In-Depth I/O Pattern Analysis in HPC Systems.",
                    "FaaSter: Accelerated Functions-as-a-Service with Heterogeneous GPUs.",
                    "RSP-Hist: Approximate Histograms for Big Data Exploration on Hadoop Clusters.",
                    "A Programming API Implementation for Secure Data Analytics Applications with Homomorphic Encryption on GPUs.",
                    "A Fused Inference Design for Pattern-Based Sparse CNN on Edge Devices.",
                    "Cloud-Based Urgent Computing for Forest Fire Spread Prediction under Data Uncertainties.",
                    "Exploring Thread Coarsening on FPGA.",
                    "PILOT: a Runtime System to Manage Multi-tenant GPU Unified Memory Footprint.",
                    "A computational technique for parallel solution of diagonally dominant banded linear systems."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2021w",
                "sub_name": "28th IEEE International Conference on High Performance Computing, Data and Analytics Workshops, HiPCW 2021, Bengaluru, India, December 17-20, 2021.",
                "count": 9,
                "papers": [
                    "3rd Workshop on Education for High Performance Computing (EduHiPC - 2021).",
                    "EduHiPC 2021 Keynote Talk: Early Parallel and Distributed Computing Education: Canary in the Coal Mine.",
                    "Teaching Parallel and Distributed Computing Concepts Using OpenMPI and Java.",
                    "Broad Awareness of Unseen Work on a Concurrency-Based Assignment.",
                    "Teaching High Productivity and High Performance in an Introductory Parallel Programming Course.",
                    "HPC@SCALE: A Hands-on Approach for Training Next-Gen HPC Software Architects.",
                    "Online Learning Platform for Application-Inspired Cloud and DevOps Curriculum.",
                    "We Need Community Effort to Achieve PDC Adoption!",
                    "HiPC 2021 Workshop on Parallel Programming in the Exascale Era (PPEE 2021)."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "27th HiPC 2020",
        "info": "Virtual Event / Pune, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2020",
                "sub_name": "27th IEEE International Conference on High Performance Computing, Data, and Analytics, HiPC 2020, Pune, India, December 16-19, 2020.",
                "count": 36,
                "papers": [
                    "Computing and Data Challenges in Climate Change.",
                    "Breaking the Scalability Wall.",
                    "Role of HPC in next-generation AI.",
                    "SimGQ: Simultaneously Evaluating Iterative Graph Queries.",
                    "WarpCore: A Library for fast Hash Tables on GPUs.",
                    "Towards High Performance, Portability, and Productivity: Lightweight Augmented Neural Networks for Performance Prediction.",
                    "Performance Optimization and Scalability Analysis of the MGB Hydrological Model.",
                    "Exploring Task Parallelism for the Multilevel Fast Multipole Algorithm.",
                    "SparsePipe: Parallel Deep Learning for 3D Point Clouds.",
                    "HyPR: Hybrid Page Ranking on Evolving Graphs.",
                    "Distributing Sparse Matrix/Graph Applications in Heterogeneous Clusters - an Experimental Study.",
                    "Processor Pipelining Method for Efficient Deep Neural Network Inference on Embedded Devices.",
                    "Avoiding Communication in Logistic Regression.",
                    "A Parallel and Scalable Framework for Insider Threat Detection.",
                    "Blink: Towards Efficient RDMA-based Communication Coroutines for Parallel Python Applications.",
                    "Content-defined Merkle Trees for Efficient Container Delivery.",
                    "Model Checking as a Service using Dynamic Resource Scaling.",
                    "Parallel Hierarchical Clustering using Rank-Two Nonnegative Matrix Factorization.",
                    "Pipelined Preconditioned Conjugate Gradient Methods for Distributed Memory Systems.",
                    "Fair Allocation of Asymmetric Operations in Storage Systems.",
                    "A GPU Algorithm for Earliest Arrival Time Problem in Public Transport Networks.",
                    "2D Static Resource Allocation for Compressed Linear Algebra and Communication Constraints.",
                    "Algorithms for Preemptive Co-scheduling of Kernels on GPUs.",
                    "Understanding HPC Application I/O Behavior Using System Level Statistics.",
                    "AMCilk: A Framework for Multiprogrammed Parallel Workloads.",
                    "Extending SLURM for Dynamic Resource-Aware Adaptive Batch Scheduling.",
                    "On the Marriage of Asynchronous Many Task Runtimes and Big Data: A Glance.",
                    "Exposing data locality in HPC-based systems by using the HDFS backend.",
                    "PufferFish: NUMA-Aware Work-stealing Library using Elastic Tasks.",
                    "Design and Study of Elastic Recovery in HPC Applications.",
                    "Accelerating Force-directed Graph Layout with Processing-in-Memory Architecture.",
                    "Nonblocking Persistent Software Transactional Memory.",
                    "GPU-FPtuner: Mixed-precision Auto-tuning for Floating-point Applications on GPU.",
                    "Batched Small Tensor-Matrix Multiplications on GPUs.",
                    "Temporal Based Intelligent LRU Cache Construction.",
                    "Boosting LSTM Performance Through Dynamic Precision Selection."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "26th HiPC 2019",
        "info": "Hyderabad, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2019",
                "sub_name": "26th IEEE International Conference on High Performance Computing, Data, and Analytics, HiPC 2019, Hyderabad, India, December 17-20, 2019.",
                "count": 43,
                "papers": [
                    "Data Flow Execution Models - A Third Opinion.",
                    "HyDetect: A Hybrid CPU-GPU Algorithm for Community Detection.",
                    "Distributed Relational Algebra at Scale.",
                    "Optimizing Breadth-First Search at Scale Using Hardware-Accelerated Space Consistency.",
                    "Shared-Memory Parallel Maximal Biclique Enumeration.",
                    "A Deterministic Multi-layered Partitioning Tool for Wire-Length Reduction of Monolithic 3D-IC.",
                    "Mapping Arbitrarily Sparse Two-Body Interactions on One-Dimensional Quantum Circuits.",
                    "k-NN Sampling for Visualization of Dynamic Data Using LION-tSNE.",
                    "Analysis in the Data Path of an Object-Centric Data Management System.",
                    "Exploring Metadata Search Essentials for Scientific Data Management.",
                    "Designing a Profiling and Visualization Tool for Scalable and In-depth Analysis of High-Performance GPU Clusters.",
                    "Tuning Object-Centric Data Management Systems for Large Scale Scientific Applications.",
                    "Replaceability Based Web Service Selection Approach.",
                    "Efficient Parallel Multi-bunch Beam-Beam Simulation in Particle Colliders.",
                    "Bit-Wise and Multi-GPU Implementations of the DNA Recombination Algorithm.",
                    "Hierarchical Filter and Refinement System Over Large Polygonal Datasets on CPU-GPU.",
                    "Geostatistical Modeling and Prediction Using Mixed Precision Tile Cholesky Factorization.",
                    "Acceleration of Sparse Vector Autoregressive Modeling Using GPUs.",
                    "Fast and Accurate Learning of Knowledge Graph Embeddings at Scale.",
                    "Genome Sequencing for Disease Diagnosis: The Confluence of Biology and Computing.",
                    "On Linear Learning with Manycore Processors.",
                    "SPEC2: SPECtral SParsE CNN Accelerator on FPGAs.",
                    "Architecture-Centric Bottleneck Analysis for Deep Neural Network Applications.",
                    "Efficient Sparse Neural Networks Using Regularized Multi Block Sparsity Pattern on a GPU.",
                    "Memory and Interconnect Optimizations for Peta-Scale Deep Learning Systems.",
                    "Accelerating Data Loading in Deep Neural Network Training.",
                    "Delivering the Future of High-Performance Computing.",
                    "IsoKV: An Isolation Scheme for Key-Value Stores by Exploiting Internal Parallelism in SSD.",
                    "SCOR-KV: SIMD-Aware Client-Centric and Optimistic RDMA-Based Key-Value Store for Emerging CPU Architectures.",
                    "High-Performance Adaptive MPI Derived Datatype Communication for Modern Multi-GPU Systems.",
                    "Online Management of Hybrid DRAM-NVMM Memory for HPC.",
                    "User-Level Scheduled Communications for MPI.",
                    "Evaluating the Impact of Energy Efficient Networks on HPC Workloads.",
                    "The New World of Heterogeneous AI/ML High Performance Computing with Intel FPGAs Mark.",
                    "MLBS: Transparent Data Caching in Hierarchical Storage for Out-of-Core HPC Applications.",
                    "Reducing False Node Failure Predictions in HPC.",
                    "Ground-Truth Prediction to Accelerate Soft-Error Impact Analysis for Iterative Methods.",
                    "Efficient Memory Pool Allocation Algorithm for CNN Inference.",
                    "A Linux Kernel Scheduler Extension for Multi-core Systems.",
                    "uMMAP-IO: User-Level Memory-Mapped I/O for HPC.",
                    "DeepSparse: A Task-Parallel Framework for SparseSolvers on Deep Memory Architectures.",
                    "Worksharing Tasks: An Efficient Way to Exploit Irregular and Fine-Grained Loop Parallelism.",
                    "Empirical Analysis of Hardware-Assisted GPU Virtualization."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2019w",
                "sub_name": "26th International Conference on High Performance Computing, Data and Analytics Workshop, HiPCW 2019, Hyderabad, India, December 17-20, 2019.",
                "count": 24,
                "papers": [
                    "Future Energy Systems Introduction.",
                    "On Using Graph Signal Processing for Electrical Load Disaggregation.",
                    "Variations in Residential Electricity Demand Across Income Categories in Urban Bangalore: Results from Primary Survey.",
                    "Multi-tier Big Data Introduction.",
                    "Intelligent Deep Reinforcement Learning Based Resource Allocation in Fog Network.",
                    "Wireless Water Quality Monitoring and Quality Deterioration Prediction System.",
                    "Improving Throughput of BigData Applications.",
                    "EduHiPC Introduction.",
                    "Keynote Talk: Getting Ready for the Emerging Challenge of Massively Parallel Programming Paradigm.",
                    "Invited Talk 1: The Future of Parallel Computing.",
                    "Invited Talk 2: Techniques for Automating Assessment of Parallel Programming Assignments.",
                    "Invited Talk 3: Reskilling to Match the Needs of Exascale Architectures.",
                    "Experiences of Teaching Parallel Computing to Undergraduates and Post-Graduates.",
                    "Theoretical and Practical Approaches for Teaching Parallel Code Correctness.",
                    "Visually Introducing Freshmen to Low-Level Java Abstractions for Creating, Synchronizing and Coordinating Threads.",
                    "HPC Education for Domain Scientists: An Indian Experience and Perspective.",
                    "Measuring Peer Mentoring Effectiveness in Computing Courses: A Case Study in Data Analytics for Cybersecurity.",
                    "HIPC 2019 Women in Computing Workshop.",
                    "Keynote Talk 1: Internet of Things - Reshaping our Future.",
                    "Keynote Talk 2: Technology Innovation for Social Good.",
                    "Keynote Talk 3: Technology for Meeting the SDGs by 2030.",
                    "Real Time Twitter Based Disaster Response System for Indian Scenarios.",
                    "An Empirical Study on Efficient Storage of Human Genome Data.",
                    "Anomaly Detection in Surveillance Videos."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "25th HiPC 2018",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2018",
                "sub_name": "25th IEEE International Conference on High Performance Computing, HiPC 2018, Bengaluru, India, December 17-20, 2018.",
                "count": 36,
                "papers": [
                    "Looking Under the Hood of Deep Neural Networks.",
                    "Accelerating TensorFlow with Adaptive RDMA-Based gRPC.",
                    "Balancing Stragglers Against Staleness in Distributed Deep Learning.",
                    "Parallel Nonnegative CP Decomposition of Dense Tensors.",
                    "Sampled Dense Matrix Multiplication for High-Performance Machine Learning.",
                    "DeepHyper: Asynchronous Hyperparameter Search for Deep Neural Networks.",
                    "Synchronization-Avoiding Graph Algorithms.",
                    "Shared-Memory Parallel Maximal Clique Enumeration.",
                    "Expediting Parallel Graph Connectivity Algorithms.",
                    "Adaptive Runtime Features for Distributed Graph Algorithms.",
                    "Adaptive Pattern Matching with Reinforcement Learning for Dynamic Graphs.",
                    "Probabilistic Sequential Consistency in Social Networks.",
                    "Improving Provisioned Power Efficiency in HPC Systems with GPU-CAPP.",
                    "Compiling SIMT Programs on Multi- and Many-Core Processors with Wide Vector Units: A Case Study with CUDA.",
                    "Lossless Parallel Implementation of a Turbo Decoder on GPU.",
                    "OC-DNN: Exploiting Advanced Unified Memory Capabilities in CUDA 9 and Volta GPUs for Out-of-Core DNN Training.",
                    "Acceleration of an Adaptive Cartesian Mesh CFD Solver in the Current Generation Processor Architectures.",
                    "Data-Parallel Training of Generative Adversarial Networks on HPC Systems for HEP Simulations.",
                    "The Future of Supercomputing.",
                    "Making Strassen Matrix Multiplication Safe.",
                    "Quantification, Trade-off Analysis, and Optimal Checkpoint Placement for Reliability and Availability.",
                    "A Novel Approach for Handling Soft Error in Conjugate Gradients.",
                    "Characterization of the Impact of Soft Errors on Iterative Methods.",
                    "Workflow Simulation Aware and Multi-threading Effective Task Scheduling for Heterogeneous Computing.",
                    "Dynamic Count-Min Sketch for Analytical Queries Over Continuous Data Streams.",
                    "Scalable Proximity-Based Methods for Large-Scale Analysis of Atom Probe Data.",
                    "A Shared-Memory Parallel Algorithm for Updating Single-Source Shortest Paths in Large Dynamic Networks.",
                    "Vidya: Performing Code-Block I/O Characterization for Data Access Optimization.",
                    "Decentralized Privacy-Preserving Timed Execution in Blockchain-Based Smart Contract Platforms.",
                    "Secure High-Performance Computer Architectures: Challenges and Opportunities.",
                    "Why do Users Kill HPC Jobs?",
                    "Code and Data Transformations to Address Garbage Collector Performance in Big Data Processing.",
                    "Share-a-GPU: Providing Simple and Effective Time-Sharing on GPUs.",
                    "A Performance Prediction Framework for Irregular Applications.",
                    "Achieving Performance and Programmability for MapReduce(-Like) Frameworks.",
                    "Parallel Read Partitioning for Concurrent Assembly of Metagenomic Data."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2018w",
                "sub_name": "25th IEEE International Conference on High Performance Computing Workshops, HiPCW 2018, Bengaluru, India, December 17-20, 2018.",
                "count": 18,
                "papers": [
                    "Optimizing the Fast Fourier Transform Using Mixed Precision on Tensor Core Hardware.",
                    "Performance Optimization of Multithreaded 2D FFT on Multicore Processors: Challenges and Solution Approaches.",
                    "FFTX and SpectralPack: A First Look.",
                    "Perforated Bluff-Body Wake Simulations: Influence of Aspect Ratio.",
                    "A Comparative Study of Turbulence Models for Two-Phase Coaxial Swirling Jet Flows.",
                    "Effective Mapping of an SPH Algorithm on Massively Parallel GPU Architecture.",
                    "Three Dimensional Pseudo-Spectral Compressible Magnetohydrodynamic GPU Code for Astrophysical Plasma Simulation.",
                    "Acceleration of a 3D Immersed Boundary Solver Using OpenACC.",
                    "Blended Learning-Assimilating Authentic Data Into Deep Learning Models.",
                    "Privacy Preserving in Blockchain Based on Partial Homomorphic Encryption System for Ai Applications.",
                    "Smart Contracts for Multiagent Plan Execution in Untrusted Cyber-Physical Systems.",
                    "DInEMMo: Decentralized Incentivization for Enterprise Marketplace Models.",
                    "Health Management of a Typical Small Aircraft Fuel System Using an Adaptive Technique.",
                    "Framework for Automatic Parallelization.",
                    "Data Science Techniques to Improve Accuracy of Provider Network Directory.",
                    "Performance Analysis of Deep Learning Architectures for Recommendation Systems.",
                    "Experimental Survey of Geospatial Big Data Platforms.",
                    "Computational Fluid Modeling to Understand the Role of Anatomy in Bifurcation Lesion Disease."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "24th HiPC 2017",
        "info": "Jaipur, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2017",
                "sub_name": "24th IEEE International Conference on High Performance Computing, HiPC 2017, Jaipur, India, December 18-21, 2017.",
                "count": 44,
                "papers": [
                    "End of Moore's Law: Or, a Computer Architect's Mid-life Crisis?",
                    "Exact and Parallel Triangle Counting in Dynamic Graphs.",
                    "Shared-Memory Graph Truss Decomposition.",
                    "Approximate Computing Techniques for Iterative Graph Algorithms.",
                    "Scalable Exact Parent Sets Identification in Bayesian Networks Learning with Apache Spark.",
                    "Parallel Exact Dynamic Bayesian Network Structure Learning with Application to Gene Networks.",
                    "Parallel Asynchronous Distributed-Memory Maximal Independent Set Algorithm with Work Ordering.",
                    "Designing Registration Caching Free High-Performance MPI Library with Implicit On-Demand Paging (ODP) of InfiniBand.",
                    "Last Level Collective Hardware Prefetching For Data-Parallel Applications.",
                    "Kernel-Assisted Communication Engine for MPI on Emerging Manycore Processors.",
                    "Support for Power Efficient Proactive Cooling Mechanisms.",
                    "Redundant Arithmetic Based High Speed Carry Free Hybrid Adders with Built-In Scan Chain on FPGAs.",
                    "ConvLight: A Convolutional Accelerator with Memristor Integrated Photonic Computing.",
                    "Provably Efficient Scheduling of Dynamically Allocating Programs on Parallel Cache Hierarchies.",
                    "Further Explorations in State-Space Search for Optimal Task Scheduling.",
                    "A Novel Approach for Job Scheduling Optimizations Under Power Cap for ARM and Intel HPC Systems.",
                    "A Memory Congestion-Aware MPI Process Placement for Modern NUMA Systems.",
                    "Expander: Lock-Free Cache for a Concurrent Data Structure.",
                    "Adaptive Code Refinement: A Compiler Technique and Extensions to Generate Self-Tuning Applications.",
                    "Machine Learning @ Amazon.",
                    "Parallel Deep Convolutional Neural Network Training by Exploiting the Overlapping of Computation and Communication.",
                    "Parallel Dynamic Data Driven Approaches for Synthetic Aperture Radar.",
                    "ARM Wrestling with Big Data: A Study of Commodity ARM64 Server for Big Data Workloads.",
                    "MPI-LiFE: Designing High-Performance Linear Fascicle Evaluation of Brain Connectome with MPI.",
                    "Reducing Network Congestion and Synchronization Overhead During Aggregation of Hierarchical Data.",
                    "Fast Parallel Randomized QR with Column Pivoting Algorithms for Reliable Low-Rank Matrix Approximations.",
                    "An X10-Based Distributed Streaming Graph Database Engine.",
                    "GPU-Centric Communication on NVIDIA GPU Clusters with InfiniBand: A Case Study with OpenSHMEM.",
                    "Distributed Algorithm for High-Utility Subgraph Pattern Mining Over Big Data Platforms.",
                    "ReCALL: Reordered Cache Aware Locality Based Graph Processing.",
                    "Characterization of Data Movement Requirements for Sparse Matrix Computations on GPUs.",
                    "Applying Graph Analytics to Understand Compute Core Usage and Publication Trends in a Petascale Supercomputing Facility.",
                    "Computing Just What You Need: Online Data Analysis and Reduction at Extreme Scales.",
                    "Integrating External Resources with a Task-Based Programming Model.",
                    "Enabling Dependability-Driven Resource Use and Message Log-Analysis for Cluster System Diagnosis.",
                    "Context-Aware Memory Profiling for Speculative Parallelism.",
                    "Lifting Barriers Using Parallel Polyhedral Regions.",
                    "Exploiting Common Neighborhoods to Optimize MPI Neighborhood Collectives.",
                    "Efficient Fork-Join on GPUs Through Warp Specialization.",
                    "Thrust++: Extending Thrust Framework for Better Abstraction and Performance.",
                    "A Novel Implementation of 2D3V Particle-in-Cell (PIC) Algorithm for Kepler GPU Architecture.",
                    "Parallelizing Hines Matrix Solver in Neuron Simulations on GPU.",
                    "Building Halo Merger Trees from the Q Continuum Simulation.",
                    "A Memory-Efficient GPU Method for Hamming and Levenshtein Distance Similarity."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2017w",
                "sub_name": "24th IEEE International Conference on High Performance Computing Workshops, HiPCW 2017, Jaipur, India, December 18-21, 2017.",
                "count": 12,
                "papers": [
                    "BigDF Introduction.",
                    "BigDF Keynote: Smart Intersection Control Algorithms for Automated and Connected Vehicles.",
                    "Software Troubleshooting Using Machine Learning.",
                    "The Effect of Non Volatile Memory on a Distributed Storage System.",
                    "Thermal Profiling and Modeling of Hadoop Clusters Using BigData Applications.",
                    "Parallel LDA with Over-Decomposition.",
                    "Characterization of Vertex-Centric Breadth First Search for Lattice Graphs.",
                    "CFD Introduction.",
                    "CFD Keynote Talk: A Perspective on the Future of CFD and Analysis.",
                    "CFD Invited Speakers [3 abstracts].",
                    "Numerical Simulation of Aerospace Applications Using Overset Mesh.",
                    "Performance Optimization of OpenFOAM* on Clusters of Intel® Xeon Phi (TM) Processors."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "23rd HiPC 2016",
        "info": "Hyderabad, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2016",
                "sub_name": "23rd IEEE International Conference on High Performance Computing, HiPC 2016, Hyderabad, India, December 19-22, 2016.",
                "count": 43,
                "papers": [
                    "Genomes Galore: Big Data Challenges in the Life Sciences.",
                    "Soft Error Detection for Iterative Applications Using Offline Training.",
                    "Fault Tolerant Frequent Pattern Mining.",
                    "Parallel Performance-Energy Predictive Modeling of Browsers: Case Study of Servo.",
                    "Optimization of Brain Mobile Interface Applications Using IoT.",
                    "Mizan-RMA: Accelerating Mizan Graph Processing Framework with MPI RMA.",
                    "CUDA M3: Designing Efficient CUDA Managed Memory-Aware MPI by Exploiting GDR and IPC.",
                    "Parallel Implementation of Lossy Data Compression for Temporal Data Sets.",
                    "Scalable Parallel Algorithms for Shared Nearest Neighbor Clustering.",
                    "DCRoute: Speeding up Inter-Datacenter Traffic Allocation while Guaranteeing Deadlines.",
                    "Efficient Data Redistribution to Speedup Big Data Analytics in Large Systems.",
                    "Load Balancing for Molecular Dynamics Simulations on Heterogeneous Architectures.",
                    "MEC: The Memory Elasticity Controller.",
                    "Phoenix: Memory Speed HPC I/O with NVM.",
                    "Dynamic Data Layout Optimization for High Performance Parallel I/O.",
                    "Read Consistency in Distributed Database Based on DMVCC.",
                    "Data Elevator: Low-Contention Data Movement in Hierarchical Storage System.",
                    "Telescoping Architectures: Evaluating Next-Generation Heterogeneous Computing.",
                    "China's HPC Development in the Next 5 Years.",
                    "CMT-Bone - A Proxy Application for Compressible Multiphase Turbulent Flows.",
                    "Balancing Locality and Concurrency: Solving Sparse Triangular Systems on GPUs.",
                    "Tensor Contractions with Extended BLAS Kernels on CPU and GPU.",
                    "High Performance Horizontal Diffusion Calculations in Ocean Models on Intel® Xeon Phi™ Coprocessor Systems.",
                    "Memory-Efficient Parallel Simulation of Electron Beam Dynamics Using GPUs.",
                    "Cache-Friendly Design for Complex Spatially-Variable Coefficient Stencils on Many-Core Architectures.",
                    "Using Message Logs and Resource Use Data for Cluster Failure Diagnosis.",
                    "A Low-Cost Multi-failure Resilient Replication Scheme for High Data Availability in Cloud Storage.",
                    "PRESAGE: Protecting Structured Address Generation against Soft Errors.",
                    "MP-Index: A Multi-predicate Publish/Subscribe Mechanism for Internet of Things.",
                    "Phase Directed Compiler Optimizations.",
                    "Automatic Code Generation for Iterative Multi-dimensional Stencil Computations.",
                    "Toward Extreme-Scale Processor Chips.",
                    "Fast Parallel Operations on Search Trees.",
                    "Efficient Parallel Ear Decomposition of Graphs with Application to Betweenness-Centrality.",
                    "Parallelization of Bin Packing on Multicore Systems.",
                    "Scheduling of Linear Algebra Kernels on Multiple Heterogeneous Resources.",
                    "An Alternative Approach of the SPIKE Preconditioner for Finite Element Analysis.",
                    "Compiler Support for Software Cache Coherence.",
                    "Predictive Evaluation of Partitioning Algorithms through Runtime Modelling.",
                    "Performance Prediction of Parallel Applications Based on Small-Scale Executions.",
                    "ERICO: Effective Removal of Inline Caching Overhead in Dynamic Typed Languages.",
                    "A Directory Cache with Dynamic Private-Shared Partitioning.",
                    "Steal-A-GC: Framework to Trigger GC during Idle Periods in Distributed Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2016w",
                "sub_name": "23rd IEEE International Conference on High Performance Computing Workshops, HiPCW 2016, Hyderabad, India, December 19-22, 2016.",
                "count": 23,
                "papers": [
                    "HiPC 2016 Workshop 1: International Workshop on Foundations of Big Data Computing (BigDF).",
                    "QoS Aware Resource Management for Apache Cassandra.",
                    "A High Performance Computing Framework for Data Mining.",
                    "Application of an Asset Bubble Model to Microblog Data Analytics.",
                    "A Hybrid Recommender System Using Weighted Ensemble Similarity Metrics and Digital Filters.",
                    "High Frequency Trading with Complex Event Processing.",
                    "Big Data Analytics Architecture for Agro Advisory System.",
                    "#ChennaiFloods: Leveraging Human and Machine Learning for Crisis Mapping during Disasters Using Social Media.",
                    "Multi-dimensional Predictive Analytics for Risk Estimation of Extreme Events.",
                    "Compression Acceleration Using GPGPU.",
                    "HiPC 2016 Workshop 2: Second Workshop on Computational Fluid Dynamics (CFD).",
                    "An Efficient GPU Parallelization for Arbitrary Collocated Polyhedral Finite Volume Grids and Its Application to Incompressible Fluid Flows.",
                    "Sub Cooled Boiling: Validation by Using Different CFD Models.",
                    "Improvements in Free Surface Flow Numerics Using Coupled VOF and Pseudo Transient Solver.",
                    "An Object Oriented Parallel Finite Element Scheme for Computations of PDEs: Design and Implementation.",
                    "Influence of Bubble Size Distribution in Gas-Liquid Flows.",
                    "A Numerical Investigation on Bubble Formation in Coolant Channel with Various Ethylene Glycol and Water Compositions and Change in Contact Angle.",
                    "HiPC 2016 Workshop 3: Workshop on High Performance Computing and Big Data in Molecular Engineering (HBME).",
                    "Towards Understanding Optimal Load-Balancing of Heterogeneous Short-Range Molecular Dynamics.",
                    "Molecular Dynamics Simulation of Nanoscopic Couette Flow and Lubricated Nanoindentation.",
                    "Round Robin Study of Molecular Simulation Programs.",
                    "In-silico Skin Model: A Tool for Virtual Testing of Formulations.",
                    "Insight into the Nature of Evaporation Processes Enabled by Massively Parallel Molecular Dynamics Simulations."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "22nd HiPC 2015",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2015",
                "sub_name": "22nd IEEE International Conference on High Performance Computing, HiPC 2015, Bengaluru, India, December 16-19, 2015.",
                "count": 51,
                "papers": [
                    "Scale-out Beyond Map-Reduce.",
                    "Which Verification for Soft Error Detection?",
                    "Throughput Regulation in Shared Memory Multicore Processors.",
                    "Application Taxonomy via Algorithmic Commonality for Domain-Specific Architecture Desgin.",
                    "FlexCore: A Reconfigurable Processor Supporting Flexible, Dynamic Morphing.",
                    "High Efficiency Generalized Parallel Counters for Xilinx FPGAs.",
                    "2QW-Clock: An Efficient SSD Buffer Management Algorithm.",
                    "Task-Based Multifrontal QR Solver for GPU-Accelerated Multicore Architectures.",
                    "Structural Agnostic SpMV: Adapting CSR-Adaptive for Irregular Matrices.",
                    "On the Resilience of Parallel Sparse Hybrid Solvers.",
                    "New Tridiagonal Systems Solvers on GPU Architectures.",
                    "A Stable Parallel Algorithm for Diagonally Dominant Tridiagonal Linear Systems.",
                    "Optimizing Approximate Weighted Matching on Nvidia Kepler K40.",
                    "Improving Communication Throughput by Multipath Load Balancing on Blue Gene/Q.",
                    "Dynamic Adaptation for Elastic System Services Using Virtual Servers.",
                    "Understanding the Performance Benefit of Asynchronous Data Transfers in OpenCL Programs Executing on Media Processors.",
                    "Hardware-Transactional-Memory Based Speculative Parallel Discrete Event Simulation of Very Fine Grain Models.",
                    "Towards Practical Page Placement for a Green Memory Manager.",
                    "Efficient Barrier Implementation on the POWER8 Processor.",
                    "Compilers and the Furture of High Performance Computing.",
                    "On Accelerating Concurrent PCA Computations for Financial Risk Applications.",
                    "A Performance Model for GPU-Accelerated FDTD Applications.",
                    "Vectorized Big Integer Operations for Cryptosystems on the Intel MIC Architecture.",
                    "Characterizing Large Dataset GPU Compute Workloads Targeting Systems with Die-Stacked Memory.",
                    "A GPU-Based MIS Aggregation Strategy: Algorithms, Comparisons, and Applications within AMG.",
                    "High Throughput Hierarchical Heavy Hitter Detection in Data Streams.",
                    "Offloaded GPU Collectives Using CORE-Direct and CUDA Capabilities on InfiniBand Clusters.",
                    "High Performance OpenSHMEM Strided Communication Support with InfiniBand UMR.",
                    "On the Use of Commodity Ethernet Technology in Exascale HPC Systems.",
                    "Trigeneous Platforms for Energy Efficient Computing of HPC Applications.",
                    "ColdBus: A Near-Optimal Power Efficient Optical Bus.",
                    "A Simple BSP-based Model to Predict Execution Time in GPU Applications.",
                    "Partition with Side Effects.",
                    "Geographically Distributed Load Balancing with (Almost) Arbitrary Load Functions.",
                    "Memory-Efficient Parallelization of 3D Lattice Boltzmann Flow Solver on a GPU.",
                    "Accelerating Complex Event Processing through GPUs.",
                    "Efficient Batched Predecessor Search in Shared Memory on GPUs.",
                    "Strategies of SIMD Computing for Image Coding in GPU.",
                    "The Architecture of Smart Phones.",
                    "IC-Data: Improving Compressed Data Processing in Hadoop.",
                    "Dominoes: Speculative Repair in Erasure-Coded Hadoop System.",
                    "Collective Offload for Heterogeneous Clusters.",
                    "Metascheduling of HPC Jobs in Day-Ahead Electricity Markets.",
                    "Load Balancing and Accelerating Parallel Spatial Join Operations Using Bitmap Indexing.",
                    "Algorithm Level Fault Tolerance for Molecular Dynamic Applications.",
                    "V-PFORDelta: Data Compression for Energy Efficient Computation of Time Series.",
                    "Holistic Management of Sustainable Geo-Distributed Data Centers.",
                    "Parallel Megabase DNA Sequence Comparison with OpenCL.",
                    "Parallel Read Error Correction for Big Genomic Datasets.",
                    "High Performance Front Camera ADAS Applications on TI's TDA3X Platform.",
                    "Information Theory Based Genome-Scale Gene Networks Construction Using MapReduce."
                ]
            },
            {
                "sub_name_abbr": "conf/hipc/2015w",
                "sub_name": "22nd IEEE International Conference on High Performance Computing Workshops, HiPCW 2015, Bengaluru, India, December 16-19, 2015.",
                "count": 12,
                "papers": [
                    "Introduction to HiPC Workshop 1.",
                    "On the Navier-Slip Boundary Condition for Computations of Impinging Droplets.",
                    "Development and Application of Interfacial Anti-Diffusion and Poor Mesh Numerics Treatments for Free Surface Flows.",
                    "Integrated Moisture Separator Design Using CFD.",
                    "Introduction to HiPC Workshop 2.",
                    "Big data in life sciences and public health.",
                    "Performance Assurance Model for HiveQL on Large Data Volume.",
                    "Scaling Computation on GPUs Using Powerlists.",
                    "JL Lemma Based Dimensionality Reduction: On Using CDS Based Partial Fourier Matrices.",
                    "Sequential Multilinear Subspace Based Event Detection in Large Video Data Sequences.",
                    "Introduction to HiPC Workshops 3 and 4.",
                    "InfoSymbioticSystems/DDDAS - Large-scale dynamic data and large-scale big computing for smart systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "21st HiPC 2014",
        "info": "Goa, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2014",
                "sub_name": "21st International Conference on High Performance Computing, HiPC 2014, Goa, India, December 17-20, 2014.",
                "count": 49,
                "papers": [
                    "Optimizing the performance of parallel applications on a 5D torus via task mapping.",
                    "Balancing context switch penalty and response time with elastic time slicing.",
                    "Scaling graph community detection on the Tilera many-core architecture.",
                    "Matrix-matrix multiplication on a large register file architecture with indirection.",
                    "TriKon: A hypervisor aware manycore processor.",
                    "Optical overlay NUCA: A high speed substrate for shared L2 caches.",
                    "On the suitability of MPI as a PGAS runtime.",
                    "Designing efficient small message transfer mechanism for inter-node MPI communication on InfiniBand GPU clusters.",
                    "Combining HoL-blocking avoidance and differentiated services in high-speed interconnects.",
                    "A high performance broadcast design with hardware multicast and GPUDirect RDMA for streaming applications on Infiniband clusters.",
                    "High performance MPI library over SR-IOV enabled infiniband clusters.",
                    "DRIVE: Using implicit caching hints to achieve disk I/O reduction in virtualized environments.",
                    "An improved recursive graph bipartitioning algorithm for well balanced domain decomposition.",
                    "Coupling-aware graph partitioning algorithms: Preliminary study.",
                    "Reducing elimination tree height for parallel LU factorization of sparse unsymmetric matrices.",
                    "Analysis and tuning of libtensor framework on multicore architectures.",
                    "A multilevel compressed sparse row format for efficient sparse computations on multicore processors.",
                    "Optimization of scan algorithms on multi- and many-core processors.",
                    "Performance evaluation of multi core systems for high throughput medical applications involving model predictive control.",
                    "Interface for heterogeneous kernels: A framework to enable hybrid OS designs targeting high performance computing on manycore architectures.",
                    "Premonition of storage response class using Skyline ranked Ensemble method.",
                    "Queueing-based storage performance modeling and placement in OpenStack environments.",
                    "A fast implementation of MLR-MCL algorithm on multi-core processors.",
                    "Optimizing shared data accesses in distributed-memory X10 systems.",
                    "A proactive approach for coping with uncertain resource availabilities on desktop grids.",
                    "Algorithms for power-aware resource activation.",
                    "A flexible scheduling framework for heterogeneous CPU-GPU clusters.",
                    "Cache-conscious scheduling of streaming pipelines on parallel machines with private caches.",
                    "Efficient and robust allocation algorithms in clouds under memory constraints.",
                    "Saving energy by exploiting residual imbalances on iterative applications.",
                    "GPU parallelization of the stochastic on-time arrival problem.",
                    "GpuTejas: A parallel simulator for GPU architectures.",
                    "Mixed-precision models for calculation of high-order virial coefficients on GPUs.",
                    "Parallel AMG solver for three dimensional unstructured grids using GPU.",
                    "Particle advection performance over varied architectures and workloads.",
                    "Relax-Miracle: GPU parallelization of semi-analytic fourier-domain solvers for earthquake modeling.",
                    "Xevolver: An XML-based code translation framework for supporting HPC application migration.",
                    "Online failure prediction for HPC resources using decentralized clustering.",
                    "CQA: A code quality analyzer tool at binary level.",
                    "Towards realizing the potential of malleable jobs.",
                    "Improving Multi-dimensional query processing with data migration in distributed cache infrastructure.",
                    "An early experience of regional ocean modelling on intel many integrated core architecture.",
                    "RADIR: Lock-free and wait-free bandwidth allocation models for solid state drives.",
                    "Design and evaluation of parallel hashing over large-scale data.",
                    "Smart multi-task scheduling for OpenCL programs on CPU/GPU heterogeneous platforms.",
                    "Software based ultrasound B-mode/beamforming optimization on GPU and its performance prediction.",
                    "Fine-grained GPU parallelization of pairwise local sequence alignment.",
                    "Distance threshold similarity searches on spatiotemporal trajectories using GPGPU.",
                    "Simple parallel biconnectivity algorithms for multicore platforms."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "20th HiPC 2013",
        "info": "Bengaluru (Bangalore), Karnataka, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2013",
                "sub_name": "20th Annual International Conference on High Performance Computing, HiPC 2013, Bengaluru (Bangalore), Karnataka, India, December 18-21, 2013.",
                "count": 49,
                "papers": [
                    "Analyzing the performance impact of authorization constraints and optimizing the authorization methods for workflows.",
                    "iFlatLFS: Performance optimization for accessing massive small files.",
                    "Adding data parallelism to streaming pipelines for throughput optimization.",
                    "Algorithms for the relaxed Multiple-Organization Multiple-Machine Scheduling Problem.",
                    "Loop level speculation in a task based programming model.",
                    "LiPS: A cost-efficient data and task co-scheduler for MapReduce.",
                    "Share-o-meter: An empirical analysis of KSM based memory sharing in virtualized systems.",
                    "Minimization of cloud task execution length with workload prediction errors.",
                    "Speculative dynamic vectorization to assist static vectorization in a HW/SW co-designed environment.",
                    "A self-tuning system based on application Profiling and Performance Analysis for optimizing Hadoop MapReduce cluster configuration.",
                    "Web-scale entity annotation using MapReduce.",
                    "X10-based distributed and parallel betweenness centrality and its application to social analytics.",
                    "Scheduling associative reductions with homogeneous costs when overlapping communications and computations.",
                    "A Branch-and-Bound algorithm using multiple GPU-based LP solvers.",
                    "Accelerating Strassen-Winograd's matrix multiplication algorithm on GPUs.",
                    "Accelerating inclusion-based pointer analysis on heterogeneous CPU-GPU systems.",
                    "Solving tridiagonal systems on a GPU.",
                    "A memory efficient algorithm for adaptive multidimensional integration with multiple GPUs.",
                    "GAGM: Genome assembly on GPU using mate pairs.",
                    "MaSiF: Machine learning guided auto-tuning of parallel skeletons.",
                    "HARP: Adaptive abort recurrence prediction for Hardware Transactional Memory.",
                    "MIL: A language to build program analysis tools through static binary instrumentation.",
                    "Cache-based cross-iteration coherence for speculative parallelization.",
                    "Exploring energy and performance behaviors of data-intensive scientific workflows on systems with deep memory hierarchies.",
                    "Transaction scheduling using conflict avoidance and Contention Intensity.",
                    "A new parallel algorithm for connected components in dynamic graphs.",
                    "The super warp architecture with random address shift.",
                    "Parallel branch-and-bound for two-stage stochastic integer optimization.",
                    "A dynamic schema to increase performance in many-core architectures through percolation operations.",
                    "Efficient sparse matrix multiple-vector multiplication using a bitmapped format.",
                    "Approximation algorithms for energy minimization in Cloud service allocation under reliability constraints.",
                    "Can GPUs sort strings efficiently?",
                    "Parallel distributed breadth first search on GPU.",
                    "Evaluation and enhancement of weather application performance on Blue Gene/Q.",
                    "Efficient homology computations on multicore and manycore systems.",
                    "A hybrid shared memory heterogeneous execution platform for PCIe-based GPGPUs.",
                    "GPU-enabled efficient executions of radiation calculations in climate modeling.",
                    "Revisiting the space-filling curves for storage, reordering and partitioning mesh based data in scientific computing.",
                    "Multi-tier energy buffering management for IDCs with heterogeneous energy storage devices.",
                    "Benchmarking MIC architectures with Monte Carlo simulations of spin glass systems.",
                    "Performance and energy consumption analysis of a seismic application for three different architectures intended for oil and gas industry.",
                    "Performance evaluation of medical imaging algorithms on Intel® MIC platform.",
                    "A hybrid parallelization approach for high resolution operational flood forecasting.",
                    "Effects of phase imbalance on data center energy management.",
                    "Conflict-free data access for multi-bank memory architectures using padding.",
                    "Work efficient parallel algorithms for large graph exploration.",
                    "SCORPIO: A scalable two-phase parallel I/O library with application to a large scale subsurface simulator.",
                    "Compiler generation and autotuning of communication-avoiding operators for geometric multigrid.",
                    "SymSig: A low latency interconnection topology for HPC clusters."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "19th HiPC 2012",
        "info": "Pune, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2012",
                "sub_name": "19th International Conference on High Performance Computing, HiPC 2012, Pune, India, December 18-22, 2012.",
                "count": 55,
                "papers": [
                    "Energy-aware scheduling under reliability and makespan constraints.",
                    "Visualization of network data provenance.",
                    "Shared memory parallelization of fully-adaptive simulations using a dynamic tree-split and -join approach.",
                    "A new method for face recognition with fewer features under illumination and expression variations.",
                    "Shared disk big data analytics with Apache Hadoop.",
                    "Profiling and scalability of the high resolution NCEP model for weather and climate simulations.",
                    "A global address space approach to automated data management for parallel Quantum Monte Carlo applications.",
                    "A theory and methodology for combining data centre networks.",
                    "Efficient cache exploration method for a tiled chip multiprocessor.",
                    "Energy aware colocation of workload in data centers.",
                    "GPU task parallelism for scalable anomaly detection.",
                    "Optimizing resource utilization with software-based temporal multi-threading (stmt).",
                    "Modern HPC cluster virtualization using KVM and palacios.",
                    "Design and implementation of a parallel priority queue on many-core architectures.",
                    "Framework and user migration strategy of cloud-based video conference multi-gateway system.",
                    "Optimization of the hop-byte metric for effective topology aware mapping.",
                    "Tool for performance tuning and regression analyses of HPC systems and applications.",
                    "I/O performance characterization of Lustre and NASA applications on Pleiades.",
                    "Intrusion detection techniques for virtual domains.",
                    "Efficient update of ghost regions using active messages.",
                    "Campaign scheduling.",
                    "A scalable messaging system for accelerating discovery from large scale scientific simulations.",
                    "Automatic efficient data layout for multithreaded stencil codes on CPU sand GPUs.",
                    "CU2rCU: Towards the complete rCUDA remote GPU virtualization and sharing solution.",
                    "A fault-tolerant environment for large-scale query processing.",
                    "Sparse matrix-matrix multiplication on modern architectures.",
                    "Distributed hierarchical co-clustering and collaborative filtering algorithm.",
                    "Fault tolerant parallel data-intensive algorithms.",
                    "Moving to the cloud: Workload migration techniques and approaches.",
                    "A hybrid parallel algorithm for computing and tracking level set topology.",
                    "Parallel hierarchical clustering on shared memory platforms.",
                    "A distributed abnormal packet generation engine based on MapReduce.",
                    "Workload dependent IO scheduling for fairness and efficiency in shared storage systems.",
                    "Elasticat: A load rebalancing framework for cloud-based key-value stores.",
                    "Towards highly scalable X10 based spectral clustering.",
                    "Scalable performance of ScaleGraph for large scale graph analysis.",
                    "GMProf: A low-overhead, fine-grained profiling approach for GPU programs.",
                    "Designing scalable PGAS communication subsystems on cray gemini interconnect.",
                    "Eiger: A framework for the automated synthesis of statistical performance models.",
                    "The design and implementation of a multi-level content-addressable checkpoint file system.",
                    "Grabfast: A CUDA based GPU accelerated fast short sequence alignment algorithm.",
                    "An automatic machine scaling solution for cloud systems.",
                    "VMAP: Proactive thermal-aware virtual machine allocation in HPC cloud datacenters.",
                    "OSQR: A framework for ontology-based semantic query routing in unstructured P2P networks.",
                    "Mapping strategies for the PERCS architecture.",
                    "Parallelization of Faugere's improved F4 algorithm.",
                    "I/O efficient QR and QZ algorithms.",
                    "A fault tolerant self-scheduling scheme for parallel loops on shared memory systems.",
                    "Massively parallel landscape-evolution modelling using general purpose graphical processing units.",
                    "Dynamic load-balancing with variable number of processors based on graph repartitioning.",
                    "Task-based parallel breadth-first search in heterogeneous environments.",
                    "A load-sharing architecture for high performance optimistic simulations on multi-core machines.",
                    "Towards scalable optimal sequence homology detection.",
                    "Executing a biological sequence comparison application on a federated cloud environment.",
                    "Password recovery using MPI and CUDA."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "18th HiPC 2011",
        "info": "Bengaluru, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2011",
                "sub_name": "18th International Conference on High Performance Computing, HiPC 2011, Bengaluru, India, December 18-21, 2011.",
                "count": 40,
                "papers": [
                    "A multi-GPU algorithm for communication in neuronal network simulations.",
                    "Parallel implementation of MOPSO on GPU using OpenCL and CUDA.",
                    "Spectral evolution simulation on leading multi-socket, multicore platforms.",
                    "Compute & memory optimizations for high-quality speech recognition on low-end GPU processors.",
                    "The impact of hyper-threading on processor resource utilization in production applications.",
                    "Optimizing multicore performance with message driven execution: A case study.",
                    "Reliable and randomized data distribution strategies for large scale storage systems.",
                    "Supporting computational data model representation with high-performance I/O in parallel netCDF.",
                    "A multiresolution data model for improving simulation I/O performance.",
                    "Comparing archival policies for Blue Waters.",
                    "STEAMEngine: Driving MapReduce provisioning in the cloud.",
                    "Hybrid algorithms for list ranking and graph connected components.",
                    "Parallel multiple precision division by a single precision divisor.",
                    "Scalable clustering using multiple GPUs.",
                    "Hybrid implementation of error diffusion dithering.",
                    "Porting irregular reductions on heterogeneous CPU-GPU configurations.",
                    "Building algorithmically nonstop fault tolerant MPI programs.",
                    "High-level template for the task-based parallel wavefront pattern.",
                    "Enabling CUDA acceleration within virtual machines using rCUDA.",
                    "Coordination mechanisms for selfish multi-organization scheduling.",
                    "Maximizing throughput of jobs with multiple resource requirements.",
                    "Weighted locality-sensitive scheduling for mitigating noise on multi-core clusters.",
                    "Scheduling diverse high performance computing systems with the goal of maximizing utilization.",
                    "A dynamic scheduling framework for emerging heterogeneous systems.",
                    "GVT algorithms and discrete event dynamics on 129K+ processor cores.",
                    "Improving graph coloring on distributed-memory parallel computers.",
                    "Modelling and analyzing the authorization and execution of video workflows.",
                    "Multi-model prediction for enhancing content locality in elastic server infrastructures.",
                    "Highly scalable barriers for future high-performance computing clusters.",
                    "Dynamic hosting management of web based applications over clouds.",
                    "A fast centralized computation routing algorithm for self-configuring NoC systems.",
                    "Partial globalization of partitioned address spaces for zero-copy communication with shared memory.",
                    "Multi-threaded UPC runtime with network endpoints: Design alternatives and evaluation on multi-core architectures.",
                    "Increasing the energy efficiency of TLS systems using intermediate checkpointing.",
                    "A machine learning-based approach for thread mapping on transactional memory applications.",
                    "Robust thread-level speculation.",
                    "Implementing a hybrid SRAM / eDRAM NUCA architecture.",
                    "High performance cache block replication using re-reference probability in CMPs.",
                    "Adaptive memory power management techniques for HPC workloads.",
                    "Dynamic selection of tile sizes."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "17th HiPC 2010",
        "info": "Dona Paula, Goa, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2010",
                "sub_name": "2010 International Conference on High Performance Computing, HiPC 2010, Dona Paula, Goa, India, December 19-22, 2010.",
                "count": 40,
                "papers": [
                    "Link-heterogeneity vs. node-heterogeneity in clusters.",
                    "Automated mapping of regular communication graphs on mesh interconnects.",
                    "A study of memory-aware scheduling in message driven parallel programs.",
                    "Balanced stream assignment for service facility.",
                    "Approaches for parallelizing reductions on modern GPUs.",
                    "Performance evaluation and optimization of random memory access on multicores with high productivity.",
                    "Anomaly detection in large-scale coalition clusters for dependability assurance.",
                    "Diagnosing the root-causes of failures from cluster log files.",
                    "A log-based redundant architecture for reliable parallel computation.",
                    "Low-overhead diskless checkpoint for hybrid computing systems.",
                    "Fault-tolerant communication runtime support for data-centric programming models.",
                    "Trends and effects of energy proportionality on server provisioning in data centers.",
                    "Reducing data center power with server consolidation: Approximation and evaluation.",
                    "Power-efficient workload distribution for virtualized server clusters.",
                    "Investigating the potential of application-centric aggressive power management for HPC workloads.",
                    "GRS - GPU radix sort for multifield records.",
                    "A CG-based Poisson solver on a GPU-cluster.",
                    "Efficient Discrete Range Searching primitives on the GPU with applications.",
                    "CUDACL: A tool for CUDA and OpenCL programmers.",
                    "An integer programming framework for optimizing shared memory use on GPUs.",
                    "Automatic dataflow application tuning for heterogeneous systems.",
                    "A reliable data transport protocol for partitioned actors in Wireless Sensor and Actor Networks.",
                    "Optimizing data acquisition by sensor-channel co-allocation in wireless sensor networks.",
                    "Impact of colinearity of sensors selected for location estimation.",
                    "iWARP redefined: Scalable connectionless communication over high-speed Ethernet.",
                    "An SOA approach to high performance scientific computing: Early experiences.",
                    "Reducing network load in large-scale, Peer-to-Peer Virtual Environments with 3D Voronoi Diagrams.",
                    "Okeanos: Reconfigurable fault-tolerant transactional storage supporting object deletions.",
                    "Dynamic social grouping based routing in a Mobile Ad-Hoc network.",
                    "Efficient algorithms to compute sleep schedules resulting in minimum delay routes in sensor networks.",
                    "Fair bandwidth allocation in wireless mobile environment using max-flow.",
                    "Optimizing an MPI weather forecasting model via processor virtualization.",
                    "A space-efficient parallel algorithm for computing betweenness centrality in distributed memory.",
                    "Parallel Sparse Matrix Vector Multiplication using greedy extraction of boxes.",
                    "Highly scalable parallel collaborative filtering algorithm.",
                    "VCTlite: Towards an efficient implementation of virtual cut-through switching in on-chip networks.",
                    "Reducing capacity and conflict misses using Set Saturation Levels.",
                    "EMC2: Extending Magny-Cours coherence for large-scale servers.",
                    "vNUMA-mgr: Managing VM memory on NUMA platforms.",
                    "Avoiding performance fluctuation in cloud storage."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16th HiPC 2009",
        "info": "Kochi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2009",
                "sub_name": "16th International Conference on High Performance Computing, HiPC 2009, December 16-19, 2009, Kochi, India, Proceedings.",
                "count": 49,
                "papers": [
                    "ERfair Scheduler with Processor Shutdown.",
                    "Service Oriented Architecture for job submission and management on grid computing resources.",
                    "Improved opportunistic scheduling algorithms for WiMAX Mobile Multihop Relay networks.",
                    "Automatic data placement and replication in grids.",
                    "An effective scheduling algorithm for Linear Makespan Minimization on Unrelated Parallel Machines.",
                    "Spanning tree routing strategies for divisible load scheduling on arbitrary graphs - A comparative performance analysis.",
                    "Non-uniform power access in large caches with low-swing wires.",
                    "Group file operations for scalable tools and middleware.",
                    "Distance-aware round-robin mapping for large NUCA caches.",
                    "Three scalable approaches to improving many-core throughput for a given peak power budget.",
                    "Fast checkpointing by Write Aggregation with Dynamic Buffer and Interleaving on multicore architecture.",
                    "HiPPAI: High Performance Portable Accelerator Interface for SoCs.",
                    "P-slice based efficient speculative multithreading.",
                    "A framework for routing and resource allocation in network virtualization.",
                    "Cache streamization for high performance stream processor.",
                    "Terascale chip multiprocessor memory hierarchy and programming model.",
                    "On providing event reliability and maximizing network lifetime using mobile Data-Collectors in Wireless Sensor Networks.",
                    "Taming the exponential state space of the maximum lifetime sensor cover problem.",
                    "A comparison of secure data aggregation schemes for wireless sensor networks.",
                    "An energy efficient deterministic key establishment scheme for clustered Wireless Sensor Networks.",
                    "Enhancing bandwidth reservation guarantees for QoS routing in mobile ad hoc networks.",
                    "Integrating traffic estimation and dynamic channel reconfiguration in Wireless Mesh Networks.",
                    "Integrating and optimizing transactional memory in a data mining middleware.",
                    "Impact of early abort mechanisms on lock-based software transactional memory.",
                    "Supporting load balancing for distributed data-intensive applications.",
                    "CellMT: A cooperative multithreading library for the Cell/B.E.",
                    "Extracting the textual and temporal structure of supercomputing logs.",
                    "Compile-time disambiguation of MATLAB types through concrete interpretation with automatic run-time fallback.",
                    "Statistical workload shaping for storage systems.",
                    "Demand-driven execution of static directed acyclic graphs using task parallelism.",
                    "A throughput fairness injection protocol for mesh and torus networks.",
                    "Multiple Virtual Lanes-aware MPI collective communication in multi-core clusters.",
                    "High search performance, small document index: P2P search can have both.",
                    "CORP: A COoperative file Replication Protocol for structured P2P networks.",
                    "Highly scalable algorithm for distributed real-time text indexing.",
                    "A parallel algorithm for exact Bayesian network inference.",
                    "An efficient parallel algorithm for evaluating join queries on heterogeneous distributed systems.",
                    "A fast algorithm for energy-aware mapping of cores onto WK-recursive NoC under performance constraints.",
                    "Towards a robust, real-time face processing system using CUDA-enabled GPUs.",
                    "Comparing the performance of clusters, Hadoop, and Active Disks on microarray correlation computations.",
                    "Speculative p-DFAs for parallel XML parsing.",
                    "Performance optimizations for distributed real-time text indexing.",
                    "Optimizing the use of GPU memory in applications with large data sets.",
                    "Detailed analysis of I/O traces for large scale applications.",
                    "Designing systems for large-scale, discrete-event simulations: Experiences with the FastTrans parallel microsimulator.",
                    "Acceleration of conjugate gradient method for circuit simulation using CUDA.",
                    "Continuous performance monitoring for large-scale parallel applications.",
                    "Evaluating implications of Virtual Worlds on server architecture using Second Life.",
                    "A performance prediction model for the CUDA GPGPU platform."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15th HiPC 2008",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2008",
                "sub_name": "High Performance Computing - HiPC 2008, 15th International Conference, Bangalore, India, December 17-20, 2008. Proceedings.",
                "count": 50,
                "papers": [
                    "Extreme Computing on the Distributed European Infrastructure for Supercomputing Applications - DEISA.",
                    "Towards Networked Computers: What Can Be Learned from Distributed Computing?.",
                    "Computational Environments for Coupling Multiphase Flow, Transport, and Mechanics in Porous Media.",
                    "The Excitement in Parallel Computing.",
                    "Improving Performance of Digest Caches in Network Processors.",
                    "Optimization of BLAS on the Cell Processor.",
                    "Fine Tuning Matrix Multiplications on Multicore.",
                    "The Design and Architecture of MAQAOAdvisor: A Live Tuning Guide.",
                    "A Load Balancing Framework for Clustered Storage Systems.",
                    "Construction and Evaluation of Coordinated Performance Skeletons.",
                    "Data Sharing Analysis of Emerging Parallel Media Mining Workloads.",
                    "Efficient PDM Sorting Algorithms.",
                    "Accelerating Cone Beam Reconstruction Using the CUDA-Enabled GPU.",
                    "Improving the Performance of Tensor Matrix Vector Multiplication in Cumulative Reaction Probability Based Quantum Chemistry Codes.",
                    "Experimental Evaluation of Molecular Dynamics Simulations on Multi-core Systems.",
                    "Parsing XML Using Parallel Traversal of Streaming Trees.",
                    "Performance Analysis of Multiple Site Resource Provisioning: Effects of the Precision of Availability Information.",
                    "An Open Computing Resource Management Framework for Real-Time Computing.",
                    "A Load Aware Channel Assignment and Link Scheduling Algorithm for Multi-channel Multi-radio Wireless Mesh Networks.",
                    "Multi-round Real-Time Divisible Load Scheduling for Clusters.",
                    "Energy-Efficient Dynamic Scheduling on Parallel Machines.",
                    "A Service-Oriented Priority-Based Resource Scheduling Scheme for Virtualized Utility Computing.",
                    "Scalable Processing of Spatial Alarms.",
                    "Coverage Based Expanding Ring Search for Dense Wireless Sensor Networks.",
                    "An Energy-Balanced Task Scheduling Heuristic for Heterogeneous Wireless Sensor Networks.",
                    "Energy Efficient Distributed Algorithms for Sensor Target Coverage Based on Properties of an Optimal Schedule.",
                    "In-Network Data Estimation for Sensor-Driven Scientific Applications.",
                    "Localization in Ad Hoc and Sensor Wireless Networks with Bounded Errors.",
                    "Optimization of Fast Fourier Transforms on the Blue Gene/L Supercomputer.",
                    "ScELA: Scalable and Extensible Launching Architecture for Clusters.",
                    "Parallel Information Theory Based Construction of Gene Regulatory Networks.",
                    "Communication Analysis of Parallel 3D FFT for Flat Cartesian Meshes on Large Blue Gene Systems.",
                    "Scalable Multi-cores with Improved Per-core Performance Using Off-the-critical Path Reconfigurable Hardware.",
                    "TrustCode: P2P Reputation-Based Trust Management Using Network Coding.",
                    "Design, Analysis, and Performance Evaluation of an Efficient Resource Unaware Scheduling Strategy for Processing Divisible Loads on Distributed Linear Daisy Chain Networks.",
                    "A Novel Learning Based Solution for Efficient Data Transport in Heterogeneous Wireless Networks.",
                    "Scalable Data Collection in Sensor Networks.",
                    "Task Scheduling on Heterogeneous Devices in Parallel Pervasive Systems (P2S).",
                    "A Performance Guaranteed Distributed Multicast Algorithm for Long-Lived Directional Communications in WANETs.",
                    "Maintaining Quality of Service with Dynamic Fault Tolerance in Fat-Trees.",
                    "Designing a High-Performance Clustered NAS: A Case Study with pNFS over RDMA on InfiniBand.",
                    "Sockets Direct Protocol for Hybrid Network Stacks: A Case Study with iWARP over 10G Ethernet.",
                    "Making a Case for Proactive Flow Control in Optical Circuit-Switched Networks.",
                    "FBICM: Efficient Congestion Management for High-Performance Networks Using Distributed Deterministic Routing.",
                    "Achieving 10Gbps Network Processing: Are We There Yet?.",
                    "SAIL: Self-Adaptive File Reallocation on Hybrid Disk Arrays.",
                    "Directory-Based Conflict Detection in Hardware Transactional Memory.",
                    "Fault-Tolerant Cache Coherence Protocols for CMPs: Evaluation and Trade-Offs.",
                    "SDRM: Simultaneous Determination of Regions and Function-to-Region Mapping for Scratchpad Memories.",
                    "An Utilization Driven Framework for Energy Efficient Caches."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14th HiPC 2007",
        "info": "Goa, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2007",
                "sub_name": "High Performance Computing - HiPC 2007, 14th International Conference, Goa, India, December 18-21, 2007, Proceedings.",
                "count": 58,
                "papers": [
                    "The Future Is Parallel But It May Not Be Easy.",
                    "Petaflop/s, Seriously.",
                    "High Performance Data Mining - Application for Discovery of Patterns in the Global Climate System.",
                    "The Transformation Hierarchy in the Era of Multi-core.",
                    "Web Search: Bridging Information Retrieval and Microeconomic Modeling.",
                    "Distributed Ranked Search.",
                    "ROW-FS: A User-Level Virtualized Redirect-on-Write Distributed File System for Wide Area Applications.",
                    "No More Energy-Performance Trade-Off: A New Data Placement Strategy for RAID-Structured Storage Systems.",
                    "Reducing the I/O Volume in an Out-of-Core Sparse Multifrontal Solver.",
                    "Experiments with a Parallel External Memory System.",
                    "An FPGA-Based Accelerator for Multiple Biological Sequence Alignment with DIALIGN.",
                    "A Speed-Area Optimization of Full Search Block Matching Hardware with Applications in High-Definition TVs (HDTV).",
                    "Evaluating ISA Support and Hardware Support for Recursive Data Layouts.",
                    "qTLB: Looking Inside the Look-Aside Buffer.",
                    "Analysis of x86 ISA Condition Codes Influence on Superscalar Execution.",
                    "Efficient Message Management in Tiled CMP Architectures Using a Heterogeneous Interconnection Network.",
                    "Direct Coherence: Bringing Together Performance and Scalability in Shared-Memory Multiprocessors.",
                    "Constraint-Aware Large-Scale CMP Cache Design.",
                    "FFTC: Fastest Fourier Transform for the IBM Cell Broadband Engine.",
                    "Molecular Dynamics Simulations on Commodity GPUs with CUDA.",
                    "Accelerating Large Graph Algorithms on the GPU Using CUDA.",
                    "FT64: Scientific Computing with Streams.",
                    "Implementation and Evaluation of Jacobi Iteration on the Imagine Stream Processor.",
                    "Compiler-Directed Dynamic Voltage Scaling Using Program Phases.",
                    "Partial Flow Sensitivity.",
                    "A Scalable Asynchronous Replication-Based Strategy for Fault Tolerant MPI Applications.",
                    "Towards a Transparent Data Access Model for the GridRPCParadigm.",
                    "A Proxy-Based Self-tuned Overload Control for Multi-tiered Server Systems.",
                    "Approximation Algorithms for Scheduling with Reservations.",
                    "Enhanced Real-Time Divisible Load Scheduling with Different Processor Available Times.",
                    "A General Distributed Scalable Peer to Peer Scheduler for Mixed Tasks in Grids.",
                    "An Energy-Aware Gradient-Based Scheduling Heuristic for Heterogeneous Multiprocessor Embedded Systems.",
                    "On Temperature-Aware Scheduling for Single-Processor Systems.",
                    "Reuse Distance Based Cache Leakage Control.",
                    "Self-optimization of Performance-per-Watt for Interleaved Memory Systems.",
                    "Distributed Algorithms for Lifetime of Wireless Sensor Networks Based on Dependencies Among Cover Sets.",
                    "DPS-MAC: An Asynchronous MAC Protocol for Wireless Sensor Networks.",
                    "Compiler-Assisted Instruction Decoder Energy Optimization for Clustered VLIW Architectures.",
                    "P2P Document Tree Management in a Real-Time Collaborative Editing System.",
                    "Structuring Unstructured Peer-to-Peer Networks.",
                    "Multi-objective Peer-to-Peer Neighbor-Selection Strategy Using Genetic Algorithm.",
                    "Effect of Dynamicity on Peer to Peer Networks.",
                    "Hierarchical Multicast Routing Scheme for Mobile Ad Hoc Network.",
                    "The Impact of Noise on the Scaling of Collectives: The Nearest Neighbor Model [Extended Abstract].",
                    "Optimization of Collective Communication in Intra-cell MPI.",
                    "Routing-Contained Virtualization Based on Up*/Down* Forwarding.",
                    "A Routing Methodology for Dynamic Fault Tolerance in Meshes and Tori.",
                    "Fault-Tolerant Topology Adaptation by Localized Distributed Protocol Switching.",
                    "Accomplishing Approximate FCFS Fairness Without Queues.",
                    "A Novel Force Matrix Transformation with Optimal Load-Balance for 3-Body Potential Based Parallel Molecular Dynamics Using Atom-Decomposition in a Heterogeneous Cluster Environment.",
                    "Grid'BnB : A Parallel Branch and Bound Framework for Grids.",
                    "The CMS Remote Analysis Builder (CRAB).",
                    "Applying Internet Random Early Detection Strategies to Scheduling in Grid Environments.",
                    "A Consistent Checkpointing-Recovery Protocol for Minimal Number of Nodes in Mobile Computing System.",
                    "MASD: Mobile Agent Based Service Discovery in Ad Hoc Networks.",
                    "Channel Adaptive Real-Time MAC Protocols for a Two-Level Heterogeneous Wireless Network.",
                    "Modeling Hierarchical Mobile Agent Security Protocol Using CP Nets.",
                    "Single Lock Manager Approach for Achieving Concurrency Control in Mobile Environments."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13th HiPC 2006",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2006",
                "sub_name": "High Performance Computing - HiPC 2006, 13th International Conference, Bangalore, India, December 18-21, 2006, Proceedings.",
                "count": 59,
                "papers": [
                    "Navigability of Small World Networks.",
                    "Opportunities and Challenges for Future Generation Grid Research.",
                    "Software Challenges for Multicore Computing.",
                    "Imaging-Based Systems Biology.",
                    "Advanced Scientific Computing: An Extraordinary Tool for Extraordinary Science.",
                    "High-Performance Computing for the Masses.",
                    "Conquering Complexity in Information Systems.",
                    "Algorithmic Ramifications of Prefetching in Memory Hierarchy.",
                    "A Cache-Partitioning Aware Replacement Policy for Chip Multiprocessors.",
                    "A Security-Oriented Task Scheduler for Heterogeneous Distributed Systems.",
                    "Minimizing Average Response Time for Scheduling Stochastic Workload in Heterogeneous Computational Grids.",
                    "Advanced Reservation-Based Scheduling of Task Graphs on Clusters.",
                    "Estimation Based Load Balancing Algorithm for Data-Intensive Heterogeneous Grid Environments.",
                    "Improving the Flexibility of the Deficit Table Scheduler.",
                    "A Cache-Pinning Strategy for Improving Generational Garbage Collection.",
                    "A Realizable Distributed Ion-Trap Quantum Computer.",
                    "Segmented Bitline Cache: Exploiting Non-uniform Memory Access Patterns.",
                    "Trade-Offs in Transient Fault Recovery Schemes for Redundant Multithreaded Processors.",
                    "Supporting Speculative Multithreading on Simultaneous Multithreaded Processors.",
                    "Dynamic Internet Congestion with Bursts.",
                    "A Repair Mechanism for Fault-Tolerance for Tree-Structured Peer-to-Peer Systems.",
                    "Utility-Based Adaptation of RED Parameters.",
                    "Capturing an Intruder in Product Networks.",
                    "Efficient In-Network Evaluation of Multiple Queries.",
                    "Island Model Parallel Genetic Algorithm for Optimization of Symmetric FRP Laminated Composites.",
                    "Experiments with Wide Area Data Coupling Using the Seine Coupling Framework.",
                    "HeteroMPI+ScaLAPACK: Towards a ScaLAPACK (Dense Linear Solvers) on Heterogeneous Networks of Computers.",
                    "Parallel Implementation of a Spline Based Computational Approach for Singular Perturbation Problems.",
                    "Collaborative Grid Process Creation Support in an Engineering Domain.",
                    "A Multi-attribute Data Structure with Parallel Bloom Filters for Network Services.",
                    "Receive Side Coalescing for Accelerating TCP/IP Processing.",
                    "Minimizing Metadata Access Latency in Wide Area Networked File Systems.",
                    "Connecting Pervasive Frameworks Through Mediation.",
                    "Error Resilient Video Streaming for Heterogeneous Networks.",
                    "Exploring Thread and Memory Placement on NUMA Architectures: Solaris and Linux, UltraSPARC/FirePlane and Opteron/HyperTransport.",
                    "Low Power Scheduling of DAGs to Minimize Finish Times.",
                    "GPU-ClustalW: Using Graphics Hardware to Accelerate Multiple Sequence Alignment.",
                    "Load Balanced Block Lanczos Algorithm over GF(2) for Factorization of Large Keys.",
                    "Parallel Support Graph Preconditioners.",
                    "Group Based Routing in Disconnected Ad Hoc Networks.",
                    "A Hybrid Routing Scheme for Mobile Ad Hoc Networks with Mobile Backbones.",
                    "K-Tree: A Multiple Tree Video Multicast Protocol for Ad Hoc Wireless Networks.",
                    "Towards Estimating Lifetime of Ad Hoc Wireless Networks.",
                    "A Proxy Based Efficient Checkpointing Scheme for Fault Recovery in Mobile Grid System.",
                    "Impact of Noise on Scaling of Collectives: An Empirical Evaluation.",
                    "DDSS: A Low-Overhead Distributed Data Sharing Substrate for Cluster-Based Data-Centers over Modern Interconnects.",
                    "Proactive Fault Tolerance in MPI Applications Via Task Migration.",
                    "Exploring Energy-Performance Trade-Offs for Heterogeneous Interconnect Clustered VLIW Processors.",
                    "Distributed Anemone: Transparent Low-Latency Access to Remote Memory.",
                    "Scalable Localization in Wireless Sensor Networks.",
                    "A Novel Real-Time MAC Protocol Exploiting Spatial and Temporal Channel Diversity in Wireless Industrial Networks.",
                    "Collective Communication Costs Analysis over Gigabit Ethernet and InfiniBand.",
                    "An Efficient MAP Classifier for Sensornets.",
                    "Performance Evaluation of a Chip-MultiThreading Server for High Performance Computing Applications.",
                    "A Study on the Locality Behavior of Minimum Spanning Tree Algorithms.",
                    "A Precomputation-Based Scheme for QoS Routing and Fair Bandwidth Allocation.",
                    "Heuristics for Flash-Dissemination in Heterogenous Networks.",
                    "B-PIC: A Novel Caching Scheme for Multimedia Streaming Servers.",
                    "Gvu: A View-Oriented Framework for Data Management in Grid Environments."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12th HiPC 2005",
        "info": "Goa, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2005",
                "sub_name": "High Performance Computing - HiPC 2005, 12th International Conference, Goa, India, December 18-21, 2005, Proceedings.",
                "count": 55,
                "papers": [
                    "Data Confidentiality in Collaborative Computing.",
                    "Productivity in High Performance Computing.",
                    "A New Approach to Programming and Prototyping Parallel Systems.",
                    "The Changing Challenges of Collaborative Algorithmics.",
                    "Quantum Physics and the Nature of Computation.",
                    "Preemption Adaptivity in Time-Published Queue-Based Spin Locks.",
                    "Criticality Driven Energy Aware Speculation for Speculative Multithreaded Processors.",
                    "Search-Optimized Suffix-Tree Storage for Biological Applications.",
                    "Cost-Optimal Job Allocation Schemes for Bandwidth-Constrained Distributed Computing Systems.",
                    "A Fault Recovery Scheme for P2P Metacomputers.",
                    "A Distributed Location Identification Algorithm for Ad hoc Networks Using Computational Geometric Methods.",
                    "A Symmetric Localization Algorithm for MANETs Based on Collapsing Coordinate Systems.",
                    "Performance Study of LU Decomposition on the Programmable GPU.",
                    "PENCAPS: A Parallel Application for Electrode Encased Grounding Systems Project.",
                    "Application of Reduce Order Modeling to Time Parallelization.",
                    "Orthogonal Decision Trees for Resource-Constrained Physiological Data Stream Monitoring Using Mobile Devices.",
                    "Throughput Computing with Chip MultiThreading and Clusters.",
                    "Supporting MPI-2 One Sided Communication on Multi-rail InfiniBand Clusters: Design Challenges and Performance Benefits.",
                    "High Performance RDMA Based All-to-All Broadcast for InfiniBand Clusters.",
                    "Providing Full QoS Support in Clusters Using Only Two VCs at the Switches.",
                    "Offloading Bloom Filter Operations to Network Processor for Parallel Query Processing in Cluster of Workstations.",
                    "A High-Speed VLSI Array Architecture for Euclidean Metric-Based Hausdorff Distance Measures Between Images.",
                    "Sensor Selection Heuristic in Sensor Networks.",
                    "Mobile Pipelines: Parallelizing Left-Looking Algorithms Using Navigational Programming.",
                    "Distributed Point Rendering.",
                    "An Intra-task DVS Algorithm Exploiting Program Path Locality for Real-Time Embedded Systems.",
                    "Advanced Resource Management and Scheduling of Workflow Applications in JavaSymphony.",
                    "Using Clustering to Address Heterogeneity and Dynamism in Parallel Scientific Applications.",
                    "Data and Computation Abstractions for Dynamic and Irregular Computations.",
                    "XCAT-C++: Design and Performance of a Distributed CCA Framework.",
                    "The Impact of Noise on the Scaling of Collectives: A Theoretical Approach.",
                    "Extensible Parallel Architectural Skeletons.",
                    "An Efficient Distributed Algorithm for Finding Virtual Backbones in Wireless Ad-Hoc Networks.",
                    "A Novel Battery Aware MAC Protocol for Minimizing Energy × Latency in Wireless Sensor Networks.",
                    "On the Power Optimization and Throughput Performance of Multihop Wireless Network Architectures.",
                    "A Novel Solution for Time Synchronization in Wireless Ad Hoc and Sensor Networks.",
                    "An Algorithm for Boundary Discovery in Wireless Sensor Networks.",
                    "A Low-Complexity Issue Queue Design with Speculative Pre-execution.",
                    "Performance and Power Evaluation of an Intelligently Adaptive Data Cache.",
                    "Neural Confidence Estimation for More Accurate Value Prediction.",
                    "The Potential of On-Chip Multiprocessing for QCD Machines.",
                    "Low-Power 32bit×32bit Multiplier Design with Pipelined Block-Wise Shutdown.",
                    "Performance Analysis of User-Level PIM Communication in the Data IntensiVe Architecture (DIVA) System.",
                    "Improved Point-to-Point and Collective Communication Performance with Output-Queued High-Radix Routers.",
                    "A Clustering and Traffic-Redistribution Scheme for High-Performance IPsec VPNs.",
                    "WDM Multistage Interconnection Networks Architectures for Enhancing Supernetworks Switching Infrastructure.",
                    "Learning-TCP: A Novel Learning Automata Based Congestion Window Updating Mechanism for Ad hoc Wireless Networks.",
                    "Design and Implementation of the HPCS Graph Analysis Benchmark on Symmetric Multiprocessors.",
                    "Scheduling Multiple Flows on Parallel Disks.",
                    "Snap-Stabilizing Detection of Cutsets.",
                    "Scheduling Divisible Loads with Return Messages on Heterogeneous Master-Worker Platforms.",
                    "A Grid Authentication System with Revocation Guarantees.",
                    "Integrating a New Cluster Assignment and Scheduling Algorithm into an Experimental Retargetable Code Generation Framework.",
                    "Cooperative Instruction Scheduling with Linear Scan Register Allocation.",
                    "iSCSI Analysis System and Performance Improvement of iSCSI Sequential Access in High Latency Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11th HiPC 2004",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2004",
                "sub_name": "High Performance Computing - HiPC 2004, 11th International Conference, Bangalore, India, December 19-22, 2004, Proceedings.",
                "count": 54,
                "papers": [
                    "Rethinking Computer Architecture Research.",
                    "Event Servers for Crisis Management.",
                    "DIET: Building Problem Solving Environments for the Grid.",
                    "The Future Evolution of High-Performance Microprocessors.",
                    "Low Power Robust Computing.",
                    "Networks and Games.",
                    "An Incentive Driven Lookup Protocol for Chord-Based Peer-to-Peer (P2P) Networks.",
                    "A Novel Battery Aware MAC Protocol for Ad HocWireless Networks.",
                    "Dynamic Topology Construction in Bluetooth Scatternets.",
                    "Efficient Secure Aggregation in Sensor Networks.",
                    "Optimal Access Control for an Integrated Voice/Data CDMA System.",
                    "Adaptive Load Balancing of a Cellular CDMA Systems Considering Non-uniform Traffic Distributions.",
                    "An Active Framework for a WLAN Access Point Using Intel's IXP1200 Network Processor.",
                    "MuSeQoR: Multi-path Failure-Tolerant Security-Aware QoS Routing in Ad HocWireless Networks.",
                    "A Tunable Coarse-Grained Parallel Algorithm for Irregular Dynamic Programming Applications.",
                    "A Feedback-Based Adaptive Algorithm for Combined Scheduling with Fault-Tolerance in Real-Time Systems.",
                    "A Shared Memory Dispatching Approach for Partially Clairvoyant Schedulers.",
                    "Data Redistribution Algorithms for Homogeneous and Heterogeneous Processor Rings.",
                    "Effect of Optimizations on Performance of OpenMP Programs.",
                    "Sparse Matrices in Matlab*P: Design and Implementation.",
                    "Architecture and Early Performance of the New IBM HPS Fabric and Adapter.",
                    "Scheduling Many-Body Short Range MD Simulations on a Cluster of Workstations and Custom VLSI Hardware.",
                    "Performance Characteristics of a Cosmology Package on Leading HPC Architectures.",
                    "A Dynamic Geometry-Based Shared Space Interaction Framework for Parallel Scientific Applications.",
                    "Earthquake Engineering Problems in Parallel Neuro Environment.",
                    "Parallel Simulation of Carbon Nanotube Based Composites.",
                    "Design of a Robust Search Algorithm for P2P Networks.",
                    "Efficient Immunization Algorithm for Peer-to-Peer Networks.",
                    "Leveraging Public Resource Pools to Improve the Service Compliances of Computing Utilities.",
                    "Plethora: An EfficientWide-Area Storage System.",
                    "iSAN - An Intelligent Storage Area Network Architecture.",
                    "Static Techniques to Improve Power Efficiency of Branch Predictors.",
                    "Realistic Workload Scheduling Policies for Taming the Memory Bandwidth Bottleneck of SMPs.",
                    "A Parallel State Assignment Algorithm for Finite State Machines.",
                    "A Novel Scheme to Reduce Burst-Loss and Provide QoS in Optical Burst Switching Networks.",
                    "Single FU Bypass Networks for High Clock Rate Superscalar Processors.",
                    "DSP Implementation of Real-time JPEG2000 Encoder Using Overlapped Block Transferring and Pipelined Processing.",
                    "Dynamic Load Balancing for a Grid Application.",
                    "Load Balancing for Hierarchical Grid Computing: A Case Study.",
                    "A-FAST: Autonomous Flow Approach to Scheduling Tasks.",
                    "Integration of Scheduling and Replication in Data Grids.",
                    "Efficient Layout Transformation for Disk-Based Multidimensional Arrays.",
                    "Autonomic Storage System Based on Automatic Learning.",
                    "Broadcast Based Cache Invalidation and Prefetching in Mobile Environment.",
                    "Efficient Algorithm for Energy Efficient Broadcasting in Linear Radio Networks.",
                    "Characterization of OpenMP Applications on the InfiniBand-Based Distributed Virtual Shared Memory System.",
                    "Fast and Scalable Startup of MPI Programs in InfiniBand Clusters.",
                    "Parallel Performance of Hierarchical Multipole Algorithms for Inductance Extraction.",
                    "A New Adaptive Fault-Tolerant Routing Methodology for Direct Networks.",
                    "Fast and Efficient Submesh Determination in Faulty Tori.",
                    "High Performance Cycle Detection Scheme for Multiprocessing Systems.",
                    "Improved Quality of Solutions for Multiobjective Spanning Tree Problem Using Distributed Evolutionary Algorithm.",
                    "Simple Deadlock-Free Dynamic Network Reconfiguration.",
                    "Lock-Free Parallel Algorithms: An Experimental Study."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10th HiPC 2003",
        "info": "Hyderabad, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2003",
                "sub_name": "High Performance Computing - HiPC 2003, 10th International Conference, Hyderabad, India, December 17-20, 2003, Proceedings.",
                "count": 53,
                "papers": [
                    "Life's Duplicities: Sex, Death, and Valis.",
                    "Performance Analysis of Blue Gene/L Using Parallel Discrete Event Simulation.",
                    "An Efficient Web Cache Replacement Policy.",
                    "Timing Issues of Operating Mode Switch in High Performance Reconfigurable Architectures.",
                    "Power-Aware Adaptive Issue Queue and Register File.",
                    "FV-MSB: A Scheme for Reducing Transition Activity on Data Buses.",
                    "A Parallel Iterative Improvement Stable Matching Algorithm.",
                    "Self-Stabilizing Distributed Algorithm for Strong Matching in a System Graph.",
                    "Parallel Data Cube Construction: Algorithms, Theoretical Analysis, and Experimental Evaluation.",
                    "Efficient Algorithm for Embedding Hypergraphs in a Cycle.",
                    "Mapping Hypercube Computations onto Partitioned Optical Passive Star Networks.",
                    "The High Performance Microprocessor in the Year 2013: What Will It Look Like? What It Won't Look Like?",
                    "FROOTS - Fault Handling in Up*/Down* Routed Networks with Multiple Roots.",
                    "Admission Control for DiffServ Based Quality of Service in Cut-Through Networks.",
                    "On Shortest Path Routing Schemes for Wireless Ad Hoc Networks.",
                    "A Hierarchical Routing Method for Load-Balancing.",
                    "Ring Based Routing Schemes for Load Distribution and Throughput Improvement in Multihop Cellular, Ad hoc, and Mesh Networks.",
                    "A High Performance Computing System for Medical Imaging in the Remote Operating Room.",
                    "Parallel Partitioning Techniques for Logic Minimization Using Redundancy Identification.",
                    "Parallel and Distributed Frequent Itemset Mining on Dynamic Datasets.",
                    "A Volumetric FFT for BlueGene/L.",
                    "A Nearly Linear-Time General Algorithm for Genome-Wide Bi-allele Haplotype Phasing.",
                    "Energy Aware Algorithm Design via Probabilistic Computing: From Algorithms and Models to Moore?s Law and Novel (Semiconductor) Devices.",
                    "Designing SANs to Support Low-Fanout Multicasts.",
                    "POMA: Prioritized Overlay Multicast in Ad Hoc Environments.",
                    "Supporting Mobile Multimedia Services with Intermittently Available Grid Resources.",
                    "Exploiting Non-blocking Remote Memory Access Communication in Scientific Benchmarks.",
                    "Scheduling Directed A-Cyclic Task Graphs on Heterogeneous Processors Using Task Duplication.",
                    "Double-Loop Feedback-Based Scheduling Approach for Distributed Real-Time Systems.",
                    "Combined Scheduling of Hard and Soft Real-Time Tasks in Multiprocessor Systems.",
                    "An Efficient Algorithm to Compute Delay Set in SPMD Programs.",
                    "Dynamic Load Balancing for I/O-Intensive Tasks on Heterogeneous Clusters.",
                    "Standards Based High Performance Computing.",
                    "Delay and Jitter Minimization in High Performance Internet Computing.",
                    "An Efficient Heuristic Search for Optimal Wavelength Requirement in Static WDM Optical Networks.",
                    "Slot Allocation Schemes for Delay Sensitive Traffic Support in Asynchronous Wireless Mesh Networks.",
                    "Multicriteria Network Design Using Distributed Evolutionary Algorithm.",
                    "GridOS: Operating System Services for Grid Architectures.",
                    "Hierarchical and Declarative Security for Grid Applications.",
                    "A Middleware Substrate for Integrating Services on the Grid.",
                    "Performance Analysis of a Hybrid Overset Multi-block Application on Multiple Architectures.",
                    "Complexity Analysis of a Cache Controller for Speculative Multithreading Chip Multiprocessors.",
                    "One Chip, One Server: How Do We Exploit Its Power?",
                    "Data Locality Optimization for Synthesis of Efficient Out-of-Core Algorithms.",
                    "Performance Evaluation of Working Set Scheme for Location Management in PCS Networks.",
                    "Parallel Performance of the Interpolation Supplemented Lattice Boltzmann Method.",
                    "Crafting Data Structures: A Study of Reference Locality in Refinement-Based Pathfinding.",
                    "Improving Performance Analysis Using Resource Management Information.",
                    "Optimizing Dynamic Dispatches through Type Invariant Region Analysis.",
                    "Thread Migration/Checkpointing for Type-Unsafe C Programs.",
                    "Web Page Characteristics-Based Scheduling.",
                    "Controlling Kernel Scheduling from User Space: An Approach to Enhancing Applications' Reactivity to I/O Events.",
                    "High-Speed Migration by Anticipative Mobility."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th HiPC 2002",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2002",
                "sub_name": "High Performance Computing - HiPC 2002, 9th International Conference, Bangalore, India, December 18-21, 2002, Proceedings.",
                "count": 70,
                "papers": [
                    "Info-Bio-Nano Interface: High-Performance Computing & Visualization.",
                    "-D Wavelet Transform Enhancement on General-Purpose Microprocessors: Memory Hierarchy and SIMD Parallelism Exploitation.",
                    "A General Data Layout for Distributed Consistency in Data Parallel Applications.",
                    "A Parallel DFA Minimization Algorithm.",
                    "Accelerating the CKY Parsing Using FPGAs.",
                    "Duplication-Based Scheduling Algorithm for Interconnection-Constrained Distributed Memory Machines.",
                    "Evaluating Arithmetic Expressions Using Tree Contraction: A Fast and Scalable Parallel Implementation for Symmetric Multiprocessors (SMPs) (Extended Abstract).",
                    "Dead-Block Elimination in Cache: A Mechanism to Reduce I-cache Power Consumption in High Performance Microprocessors.",
                    "Exploiting Web Document Structure to Improve Storage Management in Proxy Caches.",
                    "High Performance Multiprocessor Architecture Design Methodology for Application-Specific Embedded Systems.",
                    "LLM: A Low Latency Messaging Infrastructure for Linux Clusters.",
                    "Low-Power High-Performance Adaptive Computing Architectures for Multimedia Processing.",
                    "Field Programmable Systems.",
                    "CORBA-as-Needed: A Technique to Construct High Performance CORBA Applications.",
                    "Automatic Search for Performance Problems in Parallel and Distributed Programs by Using Multi-experiment Analysis.",
                    "An Adaptive Value-Based Scheduler andIts RT-Linux Implementation.",
                    "Effective Selection of Partition Sizes for Moldable Scheduling of Parallel Jobs.",
                    "Runtime Support for Multigrain and Multiparadigm Parallelism.",
                    "A Fully Compliant OpenMP Implementationon Software Distributed Shared Memory.",
                    "A Fast Connection-Time Redirection Mechanism for Internet Application Scalability.",
                    "Algorithms for Switch-Scheduling in the Multimedia Router for LANs.",
                    "An Efficient Resource Sharing Scheme for Dependable Real-Time Communication in Multihop Networks.",
                    "Improving Web Server Performance by Network Aware Data Buffering and Caching.",
                    "WRAPS Scheduling and Its Efficient Implementation on Network Processors.",
                    "Performance Comparison of Pipelined Hash Joins on Workstation Clusters.",
                    "Computational Science and Engineering - Past, Present, and Future.",
                    "Iterative Algorithms on Heterogeneous Network Computing: Parallel Polynomial Root Extracting.",
                    "Efficient Tree-Based Multicast in Wormhole-Routed Networks.",
                    "Parallel Algorithms for Identification of Basis Polygons in an Image.",
                    "Range Image Segmentation on a Cluster.",
                    "Detection of Orthogonal Interval Relations.",
                    "An Efficient Parallel Algorithm for Computing Bicompatible Elimination Ordering (BCO) of Proper Interval Graphs.",
                    "Router Handoff: An Approach for Preemptive Route Repair in Mobile Ad Hoc Networks.",
                    "A 2-D Random Walk Based Mobility Model for Location Tracking.",
                    "Data Placement in Intermittently Available Environments.",
                    "RT-MuPAC: Multi-power Architecture for Voice Cellular Networks.",
                    "Asynchronous Transaction Processing for Updates by Client: With Elimination of Wait-for State.",
                    "Active File Systems for Data Mining and Multimedia.",
                    "Simulating DNA Computing.",
                    "Parallel Syntenic Alignments.",
                    "XS-systems: eXtended S-Systems and Algebraic Differential Automata for Modeling Cellular Behavior.",
                    "A High Performance Scheme for EEG Compression Using a Multichannel Model.",
                    "Scalability and Performance of Multi-threaded Algorithms for International Fare Construction on High-Performance Machines.",
                    "A Resource Brokering Infrastructure for Computational Grids.",
                    "On Improving Thread Migration: Safety and Performance.",
                    "Improved Preprocessing Methods for Modulo Scheduling Algorithms.",
                    "Dynamic Path Profile Aided Recompilation in a JAVA Just-In-Time Compiler.",
                    "Exploiting Data Value Prediction in Compiler Based Thread Formation.",
                    "High Performance Computing of Fluid-Structure Interactions in Hydrodynamics Applications Using Unstructured Meshes with More than One Billion Elements.",
                    "An Efficient and Exponentially Accurate Parallel h-p Spectral Element Method for Elliptic Problems on Polygonal Domains - The Dirichlet Case.",
                    "Fast Stable Solver for Sequentially Semi-separable Linear Systems of Equations.",
                    "Dynamic Network Information Collectionfor Distributed Scientific Application Adaptation.",
                    "Adaptive Runtime Managementof SAMR Applications.",
                    "Mobile Agents - The Right Vehicle for Distributed Sequential Computing.",
                    "Using Dataflow Based Contextfor Accurate Branch Prediction.",
                    "Rehashable BTB: An Adaptive Branch Target Buffer to Improve the Target Predictability of Java Code.",
                    "Return-Address Prediction in Speculative Multithreaded Environments.",
                    "HLSpower: Hybrid Statistical Modeling of the Superscalar Power-Performance Design Space.",
                    "Efficient Decomposition Techniques for FPGAs.",
                    "Protocols for Bandwidth Management in Third Generation Optical Networks.",
                    "Memory Architectures for Embedded Systems-On-Chip.",
                    "Structured Component Composition Frameworks for Embedded System Design.",
                    "Low Power Distributed Embedded Systems: Dynamic Voltage Scaling and Synthesis.",
                    "The Customization Landscape for Embedded Systems.",
                    "Parallel Computations of Electron-Molecule Collisions in Processing Plasmas.",
                    "Computing Challenges and Systems Biology.",
                    "Visual Programming for Modeling and Simulation of Biomolecular Regulatory Networks.",
                    "Framework for Open Source Software Development for Organ Simulation in the Digital Human.",
                    "Reachability Analysis of Delta-NotchLateral Inhibition Using Predicate Abstraction.",
                    "A Symbolic Approachto Modeling Cellular Behavior."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th HiPC 2001",
        "info": "Hyderabad, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2001",
                "sub_name": "High Performance Computing - HiPC 2001, 8th International Conference, Hyderabad, India, December, 17-20, 2001, Proceedings.",
                "count": 37,
                "papers": [
                    "Stability Issues in Heterogeneous and FIFO Networks under the Adversarial Queueing Model.",
                    "Mesh Algorithms for Multiplication and Division.",
                    "Compact Routing in Directed Networks with Stretch Factor of Two.",
                    "Parametric Scheduling - Algorithms and Complexity.",
                    "An Efficient Algorithm for Computing Lower Bounds on Time and Processors for Scheduling Precedence Graphs on Multicomputer Systems.",
                    "On Job Scheduling for HPC-Clusters and the dynP Scheduler.",
                    "An Adaptive Scheme for Fault-Tolerant Scheduling of Soft Real-Time Tasks in Multiprocessor Systems.",
                    "Learning from the Success of MPI.",
                    "Gyrokinetic Simulations of Plasma Turbulence on Massively Parallel Computers.",
                    "A Parallel Krylov-Type Method for Nonsymmetric Linear Systems.",
                    "Evolving Cellular Automata Based Associative Memory for Pattern Recognition.",
                    "Efficient Parallel Algorithms and Software for Compressed Octrees with Applications to Hierarchical Methods.",
                    "A Case Study of Improving Memory Locality in Polygonal Model Simplification: Metrics and Performance.",
                    "High-Performance Scalable Java Virtual Machines.",
                    "Shared Virtual Memory Clusters with Next-Generation Interconnection Networks and Wide Compute Nodes.",
                    "Stream-Packing: Resource Allocation in Web Server Farms with a QoS Guarantee.",
                    "Weld: A Multithreading Technique Towards Latency-Tolerant VLIW Processors.",
                    "Putting Data Value Predictors to Work in Fine-Grain Parallel Processors.",
                    "Confidence Estimation for Branch Prediction Reversal.",
                    "Retargetable Program Profiling Using High Level Processor Models.",
                    "Towards Automatic Synthesis of High-Performance Codes for Electronic Structure Calculations: Data Locality Optimization.",
                    "Block Asynchronous I/O: A Flexible Infrastructure for User-Level Filesystems.",
                    "TWLinuX : Operating System Support for Optimistic Parallel Discrete Event Simulation.",
                    "Low-Cost Garbage Collection for Causal Message Logging.",
                    "Improving the Precise Interrupt Mechanism of Software-Managed TLB Miss Handlers.",
                    "Hidden Costs in Avoiding False Sharing in Software DSMs.",
                    "Heterogeneous Computing: Goals, Methods, and Open Problems.",
                    "Maximum Achievable Capacity Gain through Traffic Load Balancing in Cellular Radio Networks: A Practical Perspective.",
                    "Performance Evaluation of Mobile Agents for E-commerce Applications.",
                    "Performance Evaluation of Real-Time Communication Services on High-Speed LANs under Topology Changes.",
                    "Wavelength Conversion Placement and Wavelength Assignment in WDM Optical Networks.",
                    "Identifying Long-Term High-Bandwidth Flows at a Router.",
                    "Variable Length Packet Switches: Input Queued Fabrics with Finite Buffers, Speedup, and Parallelism.",
                    "Web Mining Is Parallel.",
                    "An Optical Booster for Internet Routers.",
                    "Intelligent Traffic Engineering of Internets: Towards a Model-Based Approach.",
                    "Performance Analysis of Data Services over GPRS."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th HiPC 2000",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/2000",
                "sub_name": "High Performance Computing - HiPC 2000, 7th International Conference, Bangalore, India, December 17-20, 2000, Proceedings.",
                "count": 51,
                "papers": [
                    "Charon Message-Passing Toolkit for Scientific Computations.",
                    "Dynamic Slicing of Concurrent Programs.",
                    "An Efficient Run-Time Scheme for Exploiting Parallelism on Multiprocessor Systems.",
                    "Characterization and enhancement of Static Mapping Heuristics for Heterogeneous Systems.",
                    "Optimal Segmented Scan and Simulation of Reconfigurable Architectures on Fixed Connection Networks.",
                    "Reducing False Causality in Causal Message Ordering.",
                    "The Working-Set Based Adaptive Protocol for Software Distributed Shared Memory.",
                    "Evaluation of the Optimal Causal Message Ordering Algorithm.",
                    "Register Efficient Mergesorting.",
                    "Applying Patterns to Improve the Performance of Fault Tolerant CORBA.",
                    "Design, Implementation and Performance Evaluation of a High Performance CORBA Group Membership Protocol.",
                    "Analyzing the Behavior of Event Dispatching Systems through Simulation.",
                    "ParAgent: A Domain-Specific Semi-automatic Parallelization Tool.",
                    "Practical Experiences with Java Compilation.",
                    "Performance Prediction and Analysis of Parallel Out-Of-Core Matrix Factorization.",
                    "Integration of Task and Data Parallelism: A Coordination-Based Approach.",
                    "Parallel and Distributed Computational Fluid Dynamics: Experimental Results and Challenges.",
                    "Parallel Congruent Regions on a Mesh-Connected Computer.",
                    "Can Scatter Communication Take Advantage of Multidestination Message Passing?",
                    "Power: A First Class Design Constraint for Future Architecture and Automation.",
                    "Embedded Computing: New Directions in Architecture and Automation.",
                    "Instruction Level Distributed Processing.",
                    "Amir Roth: Speculative Multithreaded Processors.",
                    "A Fast Tree-Based Barrier Synchroization on Switch-Based Irregular Networks.",
                    "Experiments with the CHIME Parallel Processing System.",
                    "Meta-data Management System for High-Performance Large-Scale Scientific Data Access.",
                    "Parallel Sorting Algorithms with Sampling Techniques on Clusters with Processors Running at Different Speeds.",
                    "Evaluation of an Adaptive Scheduling Strategy for Master-Worker Applications on Clusters of Workstations.",
                    "Multi-dimensional Selection Techniques for Minimizing Memory Bandwidth in High-Throughput Embedded Systems.",
                    "Energy-Aware Instruction Scheduling.",
                    "On Message.Dependent Deadlocks in Multiprocessor/Multicomputer Systems.",
                    "Memory Consistency and Process Coordination for SPARC Multiprocessors.",
                    "Improving Offset Assignment on Embedded Processors Using Transformations.",
                    "Improving Parallelism in Asynchronous Reading of an Entire Database.",
                    "A Parallel Framework for Explicit FEM.",
                    "Analyzing the Parallel Scalability of an Implicit Unstructured Mesh CFD Code.",
                    "Process Interconnection Structures in Dynamically Changing Topologies.",
                    "Conservative Circuit Simulation on Multiprocessor Machines.",
                    "Exact Evaluation of Multi-traffic for Wireless PCS Networks with Multi.channel.",
                    "Distributed Quality of Service Routing.",
                    "Partitioning PCS Networks for Distributed Simulation.",
                    "Providing Differentiated Reliable Connections for Real Time Communication in Multihop Networks.",
                    "A Multicast Synchronization Protocol for Multiple Distributed Multimedia Streams.",
                    "Improving Mobile Computing Performance by Using an Adaptive Distribution Framework.",
                    "Optimal Algorithms for Routing in LEO Satellite Networks with ISL.",
                    "Data Organization and Retrieval on Parallel Air Channels.",
                    "A Weight Based Distributed Clustering Algorithm for Mobile ad hoc Networks.",
                    "A Scalable Approach to Balanced, High-Dimensional Clustering of Market-Baskets.",
                    "Dynamic Integration of Decision Committees.",
                    "Incremental Mining of Constrained Associations.",
                    "Scalable, Distributed and Dynamic Mining of Association Rules."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6th HiPC 1999",
        "info": "Calcutta, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/1999",
                "sub_name": "High Performance Computing - HiPC'99, 6th International Conference, Calcutta, India, December 17-20, 1999, Proceedings.",
                "count": 60,
                "papers": [
                    "Efficient Technique for Overcoming Data Migration in Dynamic Disk Arrays.",
                    "Combining Conditional Constant Propagation and Interprocedural Alias Analysis.",
                    "Microcaches.",
                    "Improving Data Value Prediction Accuracy Using Path Correlation.",
                    "Performance Benefits of Exploiting Control Independence.",
                    "Fast Slicing of Concurrent Programs.",
                    "VME Bus-Based Memory Channel Architecture for High Performance Computing.",
                    "Evaluation of Data and Request Distribution Policies in Clustered Servers.",
                    "Thunderbolt: A Consensus-Based Infrastructure for Loosely-Coupled Cluster Computing.",
                    "Harnessing Windows NT for High Performance Computing.",
                    "Performance Evaluation of a Load Sharing System on a Cluster of Workstations.",
                    "Modeling Cone-Beam Tomographic Reconstruction Using LogSMP: An Extenced LogP Model for Clusters of SMPs.",
                    "A Fission Technique Enabling Parallelization of Imperfectly Nested Loops.",
                    "A Novel Bi-directional Execution Approach to Debugging Distributed Programs.",
                    "Memory-Optimal Evaluation of Expression Trees Involving Large Objects.",
                    "Resource Usage Modelling for Software Pipelining.",
                    "An Interprocedural Framework for the Data and Loops Partitioning in the SIMD Machines.",
                    "Tiling and Processors Allocation for Three Dimensional Iteration Space.",
                    "Process Migration Effects on Memory Performance of Multiprocessor.",
                    "Adaptive Algorithms for Scheduling Static Task Graphs in Dynamic Distributed Systems.",
                    "Scheduling Strategies for Controlling Resource Contention on Multiprocessor Systems.",
                    "Deadline Assignment in Multiprocessor-Based Fault-Tolerant Systems.",
                    "Affinity-Based Self Scheduing for Software Shared Memory Systems.",
                    "Efficient Algorithms for Delay Bounded Multicast Tree Generation for Multimedia Applications.",
                    "Whither Indian Computer Science R & D?",
                    "High Performance Data Mining.",
                    "Self-Stabilizing Network Decomposition.",
                    "Performance Analysis of a Parallel PCS Network Simulation.",
                    "Ultimate Parallel List Ranking?",
                    "A Parallel 3-D Capacitance Extraction Program.",
                    "Parallel Algorithms for Queries with Aggregate Functions in the Presence of Data Skew.",
                    "A Deterministic On-Line Algorithm for the List-Update Problem.",
                    "Link-State Aware Traffic Scheduling for Providing Predictive QoS in Wireless Mobile Multimedia Networks.",
                    "Enhancing Mobile IP Routing Using Active Routers.",
                    "Adaptive Scheduling at Mobiles for Wireless Networks with Multiple Priority Traffic and Multiple Transmission Channels.",
                    "An Analysis of Routing Techniques for Mobile and Ad Hoc Networks.",
                    "MobiDAT: Mobile Data Access and Transactions.",
                    "Optimal k-ary Divide and Conquer Computations on Wormhole 2-D and 3-D Meshes.",
                    "Parallel Real Root Isolation Using the Descartes Method.",
                    "Cellular Automata Based Transform Coding for Image Compression.",
                    "A Parallel Branch-and-Bound Algorithm for the Classification Problem.",
                    "Parallel Implementation of Tomographic Reconstruction Algorithms on Bus-Based Extended Hypercube.",
                    "An Optimal Hardware-Algorithm for Selection Using a Fixed-Size Parallel Classifier Device.",
                    "A Novel Frame Structure and Call Admission Control for Efficient Resource Management in Next Generation Wireless Networks.",
                    "Harmony - A Framework for Providing Quality of Service in Wireless Mobile Computing Environment.",
                    "Stochastic Modeling of TCP/IP over Random Loss Channels.",
                    "Accurate Approximate Analysis of Dual-Band GSM Networks with Multimedia Services and Different User Mobility Patterns.",
                    "Paging Strategies for Future Personal Communication Services Network.",
                    "A Framework for Matching Applications with Parallel Machines.",
                    "A Parallel Monte Carlo Algorithm for Protein Accessible Surface Area Computation.",
                    "Parallelisation of a Navier-Stokes Code on a Cluster of Workstations.",
                    "I/O Implementation and Evaluation of Parallel Pipelined STAP on High Performance Computers.",
                    "Efficient Parallel Adaptive Finite Element Methods Using Self-Scheduling Data and Computations.",
                    "Avoiding Conventional Overheads in Parallel Logic Simulation: A New Architecture.",
                    "Isomorphic Allocation in k-ary n-cube Systems.",
                    "Unit-Oriented Communication in Real-Time Multihop Networks.",
                    "Counter-Based Routing Policies.",
                    "Minimizing Lightpath Set-up Times in Wavelength Routed All-Optical Networks.",
                    "Design of WDM Networks for Delay-Bound Multicasting.",
                    "Generalized Approach towards the Fault Diagnosis in Any Arbitrarily Connected Networks."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th HiPC 1998",
        "info": "Madras, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/1998",
                "sub_name": "5th International Conference On High Performance Computing, HiPC 1998, Madras, India, 20-20 December, 1998.",
                "count": 61,
                "papers": [
                    "New number representation and conversion techniques on reconfigurable mesh.",
                    "Precise control of instruction caches.",
                    "More on arbitrary boundary packed arithmetic.",
                    "Data prefetching with co-operative caching.",
                    "PERL-a registerless architecture.",
                    "Design alternatives for shared memory multiprocessors.",
                    "Implementing a parallel list on the SB-PRAM.",
                    "A simple optimal list ranking algorithm.",
                    "A parallel skeletonization algorithm and its VLSI architecture.",
                    "Improving error bounds for multipole-based treecodes.",
                    "Computation of penetration measures for convex polygons and polyhedra for graphics applications.",
                    "Extrapolation in distributed adaptive integration.",
                    "Data structure distribution and multi-threading of Linux file system for multiprocessors.",
                    "Mapping instruction sequences onto EPOM-processor arrays: a framework for parallel data processing.",
                    "Java data parallel extensions with runtime system support.",
                    "A general distributed event model.",
                    "Apportioning: a technique for efficient reachability analysis of concurrent object-oriented programs.",
                    "Efficient address sequence generation for two-level mappings in High Performance Fortran.",
                    "Efficient algorithms for delay-bounded minimum cost path problem in communication networks.",
                    "Virtual channel multiplexing in networks of workstations with irregular topology.",
                    "One to all broadcast in hyper butterfly networks.",
                    "Broadcasting on a budget in the multi-service communication model.",
                    "Parallel algorithms for vehicle routing problems.",
                    "Global reactive congestion control in multicomputer networks.",
                    "A simple mechanism to deal with sequential code in dataflow architectures.",
                    "Available parallelism with data value prediction.",
                    "Execution characteristics of object oriented programs on the UltraSPARC-II.",
                    "Memory bank disambiguation using modulo unrolling for Raw machines.",
                    "Control flow prediction with unbalanced tree-like subgraphs.",
                    "Message passing support on StarT-Voyager.",
                    "Performance analysis of wavelength converters in WDM wavelength routed optical networks.",
                    "On-line diagnosibility of baseline interconnection network.",
                    "Distributed routing balancing for interconnection network communication.",
                    "On topology and bisection bandwidth of hierarchical-ring networks for shared-memory multiprocessors.",
                    "Permutation admissibility in shuffle-exchange networks with arbitrary number of stages.",
                    "A clustering approach in characterizing interconnection networks.",
                    "The Augmented Composite Banyan Network.",
                    "GLB: a low-cost scheduling algorithm for distributed-memory architectures.",
                    "Processor allocation using user directives in mesh-connected multicomputer systems.",
                    "Near optimal algorithms for scheduling independent chains in BSP.",
                    "How to improve local load balancing policies by distorting load information.",
                    "Dynamic load balancing schemes for computing accessible surface area of protein molecules.",
                    "Modulo-variable expansion sensitive scheduling.",
                    "Selection algorithms for parallel disk systems.",
                    "Hierarchical architecture for parallel query processing on networks of workstations.",
                    "Extended collective I/O for efficient retrieval of large objects.",
                    "Skew-insensitive parallel algorithms for relational join.",
                    "Efficient retrieval of multidimensional datasets through parallel I/O.",
                    "An improved parallel disk scheduling algorithm.",
                    "Measurement-based modeling and analysis methodology for characterizing parallel I/O performance.",
                    "Multiple token distributed loop local area networks: analysis.",
                    "Executing serializable transactions within a hard real-time database system.",
                    "Performance-driven design and redesign of high-speed local area networks.",
                    "Testing concurrency and communication in distributed objects.",
                    "A conservative parallel simulation algorithm for entity-oriented modeling.",
                    "A comparative study of some network subsystem organizations.",
                    "An efficient implementation of a progressive image transmission system using successive pruning algorithm on a parallel architecture.",
                    "Strategies for parallel implementation of a global spectral atmospheric general circulation model.",
                    "Piecewise fixed-rate retrieval scheme for variable bit rate video.",
                    "Exploiting image processing locality in cache pre-fetching.",
                    "WADE: a Web-based automated parallel CAD environment."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th HiPC 1997",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/1997",
                "sub_name": "Proceedings of the Fourth International on High-Performance Computing, HiPC 1997, Bangalore, India, 18-21 December, 1997.",
                "count": 80,
                "papers": [
                    "A study of tree-based control flow prediction schemes.",
                    "Concurrency control of nested cooperative transactions in active DBMS.",
                    "Parallel data cube construction for high performance on-line analytical processing.",
                    "A comparison of two context allocation approaches for fast protected calls.",
                    "A different approach to high performance computing.",
                    "Classification and performance evaluation of simultaneous multithreaded architectures.",
                    "Mapping of neural network models onto massively parallel hierarchical computer systems.",
                    "Interconnection network behavior on a multicomputer in the parallelization of the MPEG coding algorithm. Worm-hole vs. packet-switching routing.",
                    "Parallel interactive virtual machining on shared memory multiprocessors.",
                    "A memory-optimized visualization system for limited-bandwidth multiprocessing environments.",
                    "On improving the performance of sparse matrix-vector multiplication.",
                    "Parallelization of finite volume computations for heat transfer application using unstructured mesh partitioning algorithms.",
                    "A new consistency protocol implemented in the CAliF system.",
                    "A floating-point validation suite for high-performance shared and distributed memory computing systems.",
                    "Effectiveness of caching policies for a Web server.",
                    "A new voting based hardware data prefetch scheme.",
                    "Lazy home migration for distributed shared memory systems.",
                    "A cost model for distributed shared memory using competitive update.",
                    "Parallel algorithms for the longest common subsequence problem.",
                    "Applications of BSR model of computation for subsegment problems.",
                    "An optimal parallel algorithm for the all-nearest-foreign-neighbors problem in arbitrary dimensions.",
                    "A high performance two dimensional scalable parallel algorithm for solving sparse triangular systems.",
                    "Parallel algorithms for vehicle routing problems.",
                    "Adaptive multivariate integration using MPI.",
                    "Integer sorting algorithms for coarse-grained parallel machines.",
                    "Supporting unbounded process parallelism in the SPC programming model.",
                    "Design of a parallel C language for distributed systems.",
                    "ELMO: extending (sequential) languages with migratable objects-compiler support.",
                    "Parallel real-time systems: formal specification.",
                    "An object oriented system for developing distributed applications.",
                    "Parallel program design in visual environment.",
                    "Dynamic scheduling of parallelizable tasks and resource reclaiming in real-time multiprocessor systems.",
                    "Load balancing sequences of unstructured adaptive grids.",
                    "A hierarchical processor scheduling policy for distributed-memory multicomputer systems.",
                    "Sparse matrix decomposition with optimal load balancing.",
                    "Parallel domain decomposition and load balancing using space-filling curves.",
                    "Characterizing vulnerability of parallelism to resource constraints.",
                    "Load balancing using symmetric broadcast networks: a PVM-based comparative performance study.",
                    "Reconfigurable custom computing as a supercomputer replacement.",
                    "Gradient method based design methodology for time and area optimization of a pipelined attached processor architecture.",
                    "PiSMA: an upgradable fault tolerant approach to parallel processing.",
                    "Single step undirected reconfigurable networks.",
                    "Applying Time Warp to CPU design.",
                    "Compact and flexible linear-array-based implementations of a pipeline of multiprocessor modules (PMMLA) for high throughput applications.",
                    "Fast multiplier schemes using large parallel counters and shift switches.",
                    "Probabilistic routing in wavelength-routed multistage, hypercube, and Debruijn networks.",
                    "LIFE: a limited injection, fully adaptive, recovery-based routing algorithm.",
                    "A flow control mechanism to avoid message deadlock in k-ary n-cube networks.",
                    "Improving the efficiency of adaptive routing in networks with irregular topology.",
                    "On measuring the performance of adaptive wormhole routing.",
                    "Adaptive multimodule routers.",
                    "Simultaneous multithreaded vector architecture: merging ILP and DLP for high performance.",
                    "Highly accurate data value prediction.",
                    "Virtual registers.",
                    "Code optimization as a side effect of instruction scheduling.",
                    "Building reliable distributed programs with file operations.",
                    "Predicting the speedup of multithreaded Solaris programs.",
                    "Evaluating the performance implications of binding threads to processors.",
                    "Global I/O optimizations for out-of-core computations.",
                    "Modeling multi-threaded architectures in PAMELA for real-time high performance applications.",
                    "FP-map-an approach to the functional pipelining of embedded programs.",
                    "A tight layout of the cube-connected cycles.",
                    "Mixed-autonomy local interconnect for reconfigurable SIMD arrays.",
                    "Wormhole routing for complete exchange in multi-mesh.",
                    "Distributed delay constrained multicast path setup algorithm for high speed networks.",
                    "Virtual control channel and its application to the massively parallel computer RWC-1.",
                    "Prioritized demand multiplexing (PDM): a low-latency virtual channel flow control framework for prioritized traffic.",
                    "Independent global snapshots in large distributed systems.",
                    "Fast reductions on a network of workstations.",
                    "Modelling of generalised distributed systems using extended colored net.",
                    "Communication cost estimation and global data partitioning for distributed memory machines.",
                    "HOLMES: a tool for monitoring heterogeneous architectures.",
                    "System resource accounting in a heterogeneous distributed computing environment.",
                    "On unsupervised segmentation of color texture images.",
                    "Recursive Gabor transform for images of very large size and design of massively parallel architecture.",
                    "A new orthogonal multiprocessor and its application to image processing.",
                    "Custom virtual memory policies for an image reconstruction application.",
                    "A computer aided architecture design tool aimed at image processing applications.",
                    "A document image analysis system on parallel processors.",
                    "Efficient algorithm for feature extraction from oceanographic images."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3rd HiPC 1996",
        "info": "Trivandrum, India",
        "venues": [
            {
                "sub_name_abbr": "conf/hipc/1996",
                "sub_name": "3rd International Conference on High Performance Computing, HIPC 1996, Proceedings, Trivandrum, India, 19-22 December, 1996.",
                "count": 74,
                "papers": [
                    "A genetic algorithm for assembling optical computers using faulty optical arrays.",
                    "Comparison of parallelization strategies for simulation of aerodynamics problem.",
                    "File allocation for a parallel Webserver.",
                    "Parallel genetic algorithms on PARAM for conformation of biopolymers.",
                    "Parallel SOLVE for direct circuit simulation on a transputer array.",
                    "Monte Carlo device simulation on PARAM.",
                    "Classification of handwritten alphanumeric characters: a fuzzy neural approach.",
                    "Techniques for increasing the stream capacity of a multimedia server.",
                    "Compiling object-oriented programs for distributed execution.",
                    "The RAID configuration tool.",
                    "Efficient compilation of concurrent call/return communication in actor-based programming languages.",
                    "Integrating concurrency and object-orientation using boolean, access and path guards.",
                    "Compilation to parallel programs from constraints.",
                    "Finite element calculations at the parallel computers Intel/Paragon, IBM SP-2, and a cluster of DEC-ALPHA workstations.",
                    "Program-level control of network delay for parallel asynchronous iterative applications.",
                    "Adaptive integration using evolutionary strategies.",
                    "Finite element applications of parallel adaptive integration strategies.",
                    "Distributed computation of inverse dynamics of robots.",
                    "DiET: a distributed extended transaction processing framework.",
                    "BAG real-time distributed operating system.",
                    "Bounded dynamic data allocation in distributed systems.",
                    "Transparent parallel replication of logically partitioned databases.",
                    "A distributed directory scheme for information access in mobile computers.",
                    "Novel parallel join algorithms for grid files.",
                    "Congestion-free dilation-2 embedding of full binary trees on star graphs.",
                    "Evaluation of a Mesh of Clos wormhole network.",
                    "An efficient scheme for embedding a ring into an injured hypercube with both faulty links and faulty nodes.",
                    "Embedding arbitrary trees in the hypercube and the q-dimensional mesh.",
                    "GSE: a generalized full-access multistage interconnection network with minimum cost.",
                    "The generalized hypercube-connected-cycle: an efficient network topology.",
                    "Program analysis for page size selection.",
                    "Incremental data dependence analysis.",
                    "A communication placement framework with unified dependence and data-flow analysis.",
                    "Implementation of a pattern-matching approach for identifying algorithmic concepts in scientific FORTRAN programs.",
                    "Run-time versus compile-time instruction scheduling in superscalar (RISC) processors: performance and tradeoffs.",
                    "Two-dimensional orthogonal tiling: from theory to practice.",
                    "Efficient edge extraction of images by directional tracing.",
                    "An efficient encoding algorithm for image compression hardware based on cellular automata.",
                    "A comparison of bit-serial and multi-bit processor elements in a real-time signal processing SIMD architecture.",
                    "A parallel algorithm for stereo vision based on correlation.",
                    "Spatial frequency based motion estimation for image sequence compression.",
                    "Load balancing strategies for symbolic vision computations.",
                    "Fault tolerant networks of workstations.",
                    "A protocol for lossy transmission of digital video.",
                    "Independent node and process recovery in message passing distributed systems.",
                    "A new study for fault-tolerant real-time dynamic scheduling algorithms.",
                    "An efficient distributed single-phase protocol for total and causal ordering of group operations.",
                    "Incorporating fault tolerance in superscalar processors.",
                    "Analysis of piggybacked token-passing MAC protocol with variable buffer size for WDM star coupled photonic network.",
                    "Efficient parallel prefix algorithms on fully connected message-passing computers.",
                    "Multicast communication algorithm on a wormhole-routed star graph interconnection network.",
                    "Implementing string-to-string correction and longest common subsequence problems on the Sequent Symmetry multiprocessor.",
                    "Multithreading implementation of a distributed shortest path algorithm on EARTH multiprocessor.",
                    "A multithreaded architecture for the efficient execution of vector computations within a loop using status field.",
                    "Performance evaluation of a RISC neuro-processor for neural networks.",
                    "Order-configurable programmable power-efficient FIR filters.",
                    "Quantitive studies of data-locality sensitivity on the EARTH multithreaded architecture: preliminary results.",
                    "A distributed barrier synchronization solution in hardware for 2D-mesh multicomputers.",
                    "Connection caching technique with host grouping.",
                    "A linear systolic algorithm and architecture for convex bipartite matching.",
                    "Evaluation of static scheduling algorithms improved with partial strict triggering of program graph nodes.",
                    "On-line scheduling of hard real-time tasks on multiprocessors.",
                    "Exploiting parallelism in high performance embedded system scheduling.",
                    "A robust and flexible microeconomic scheduler for parallel computers.",
                    "A study of dynamic scheduling techniques for multiscalar processors.",
                    "Buffer allocation in regular dataflow networks: an approach based on coloring circular-arc graphs.",
                    "Adaptive resource allocation for embedded parallel applications.",
                    "Communicating data-parallel tasks: an MPI library for HPF.",
                    "Cidre: programming with distributed shared arrays.",
                    "PMDOS: a testbed for distributed and parallel algorithms utilizing idle machines in a network.",
                    "PARDISC: a cost effective model for parallel and distributed computing.",
                    "A co-operative application management platform based on shared virtual memory.",
                    "An MPI implementation of the BLACS.",
                    "A DSM-Based Structural Programming Environment for Distributed and Parallel Processing."
                ]
            }
        ]
    }
]