[
    {
        "year": "2015",
        "name": "3. HPCA 2015",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cnhpca/2015",
                "sub_name": "High Performance Computing and Applications - Third International Conference, HPCA 2015, Shanghai, China, July 26-30, 2015, Revised Selected Papers.",
                "count": 24,
                "papers": [
                    "Evidences that Software Based on Non-overlapping Discretization Is Most Efficient for Applying Highly Parallelized Supercomputers to Solving Partial Differential Equations.",
                    "Large-Scale Reservoir Simulations on IBM Blue Gene/Q.",
                    "A TS-PSO Based Artificial Neural Network for Short-Term Load Forecast.",
                    "An Improved Differential Evolution Algorithm for Solving Absolute Value Equations.",
                    "Tea Category Classification Based on Feed-Forward Neural Network and Two-Dimensional Wavelet Entropy.",
                    "Development of Krylov and AMG Linear Solvers for Large-Scale Sparse Matrices on GPUs.",
                    "A Study on Anonymous Communication Technology in MANET.",
                    "Parallel Computing of the Adaptive N-Body Treecode Algorithm for Solving Boundary Integral Poisson-Boltzmann Equation.",
                    "Towards the High Performance Method for Large-Scale Electronic Structure Calculations.",
                    "A Dispersion-Relation-Preserving Upwind Combined Compact Scheme for Convection-diffusion Equations with Variable Coefficients.",
                    "Performance Optimization of a DEM Simulation Framework on GPU Using a Stencil Model.",
                    "Large-Scale Log-Determinant Computation via Weighted L_2 Polynomial Approximation with Prior Distribution of Eigenvalues.",
                    "Solar Radio Astronomical Big Data Classification.",
                    "Performance Analysis of Mobile Smart UE-Gateway Assisted Transmission Algorithm for Wireless Sensor Networks.",
                    "A Platform for Routine Development of Ternary Optical Computers.",
                    "Principle of a Computing Request File of Ternary Optical Computers.",
                    "High-Efficiency Realization of SRT Division on Ternary Optical Computers.",
                    "A Limited Incremental Clustering Algorithm with Respect to Cluster Stability.",
                    "Prediction on Performance of Age Group Swimming Using Machine Learning.",
                    "Predicting Abstract Keywords by Word Vectors.",
                    "Parallel Overlapping Mechanism Between Communication and Computation of the Lattice Boltzmann Method.",
                    "A New Equilibrium Distribution Function of the Lattice Boltzmann Method.",
                    "A Fast Training Method for Transductive Support Vector Machine in Semi-supervised Learning.",
                    "Parameter Identification Inverse Problems of Partial Differential Equations Based on the Improved Gene Expression Programming."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "2. HPCA 2009",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cnhpca/2009",
                "sub_name": "High Performance Computing and Applications, Second International Conference, HPCA 2009, Shanghai, China, August 10-12, 2009, Revised Selected Papers.",
                "count": 80,
                "papers": [
                    "Half-Duplex Dynamic Data Driven Application System for Forest Fire Spread Prediction.",
                    "Advantages of Multiscale Detection of Defective Pills during Manufacturing.",
                    "Compressible Lattice Boltzmann Method and Applications.",
                    "Studies on the Performance of a Heuristic Algorithm for Static and Transportation Facility Location Allocation Problem.",
                    "A Parallel Algebraic Multigrid Solver on Graphics Processing Units.",
                    "Recent Advances in Time-Domain Maxwell's Equations in Metamaterials.",
                    "Research on FPGA Based Evolvable Hardware Chips for Solving Super-High Dimensional Equations Group.",
                    "An Efficient Splitting Domain Decomposition Approach for Parabolic-Type Time-Dependent Problems in Porous Media.",
                    "New Shock Detector for Shock-Boundary Layer Interaction.",
                    "Performance of Local Gauss Integration in Finite Element and Finite Volume Methods for the Navier-Stokes Equations.",
                    "Performance Combinative Evaluation of Typical Virtual Machine Monitors.",
                    "Lunar Crater Rims Detection from Chang's Orbiter Data Based on a Grid Environment.",
                    "Study on Parallel System Performance Modeling Based on TCPN.",
                    "A 3D Geological Modeling and Numerical Simulations of Near-Fault Endangered Field.",
                    "Fast ARFTIS Reconstruction Algorithms Using CUDA.",
                    "Numerical Methods for Nonequilibrium Solute Transport with First-Order Decay and Zero-Order Production.",
                    "Parallel Computing of Catchment Basins in Large Digital Elevation Model.",
                    "A Hybrid Parallel Evolutionary Algorithm Based on Elite-Subspace Strategy and Space Transformation Search.",
                    "Surface Reconstruction Technology from Dense Scattered Points Based on Grid.",
                    "Parallel Branch Prediction on GPU Platform.",
                    "Calculation of TNT Equivalence of Composite Propellant and Visualized Software Development.",
                    "The High Performance Computing on the Crash-Safety Analysis.",
                    "A Heuristic Rule of Partitioning Irregular Loop for Parallelizing Compilers.",
                    "Numerical Simulation of Dimension Effect to Deformation in the Cataclastic Medium Goafs Using UDEC.",
                    "A Parallel Implementation of the Hybrid Algorithm for Electromagnetic Scattering by Arbitrary Shaped Cavities.",
                    "A Fair Concurrent Signature Scheme Based on Identity.",
                    "Numerical Simulation of Rotating-Cage Bio-reactor Based on Dynamic Mesh Coupled Two-Phase Flow.",
                    "Energy-Efficient Intrusion Detection System for Wireless Sensor Network Based on MUSK Architecture.",
                    "A Novel Parallel Interval Exclusion Algorithm.",
                    "Parallel Numerical Solution of the Time-Harmonic Maxwell Equations.",
                    "The Semi-convergence of Generalized SSOR Method for Singular Augmented Systems.",
                    "A Scientific Workflow System Based on GOS.",
                    "Performance Optimization of Small File I/O with Adaptive Migration Strategy in Cluster File System.",
                    "Efficiently Packing Circles into a Larger Containing Circle.",
                    "Heterogeneous Database Integration of EPR System Based on OGSA-DAI.",
                    "RTTM: A New Hierarchical Interconnection Network for Massively Parallel Computing.",
                    "Benchmarking Parallel I/O Performance for a Large Scale Scientific Application on the TeraGrid.",
                    "Reliability and Parametric Sensitivity Analysis of Railway Vehicle Bogie Frame Based on Monte-Carlo Numerical Simulation.",
                    "SVG-Based Interactive Visualization of PSE-Bio.",
                    "A Modification of Regularized Newton-Type Method for Nonlinear Ill-Posed Problems.",
                    "An Improved Technique for Program Remodularization.",
                    "Task Merging for Better Scheduling.",
                    "The Closure Temperature Fields and Shape Optimization of Arch Dam Based on Genetic Algorithms.",
                    "Parallel Computing for Option Pricing Based on the Backward Stochastic Differential Equation.",
                    "Dynamic Turbulence Simulation of Ceramic Roller Kiln Based on Particle Systems.",
                    "Rate Allocation in Overlay Networks Based on Theory of Firm Consumer.",
                    "A Dynamic Update Framework for OSGi Applications.",
                    "Multiscale Stochastic Finite Element Method on Random Boundary Value Problems.",
                    "The BRI Algorithm for Double-Sides QBD Process.",
                    "The Multi-dimensional QoS Resources Optimization Based on the Grid Banking Model.",
                    "A Cellular Automata Calculation Model Based on Ternary Optical Computers.",
                    "Performance Evaluation of Authentication Certificate Based Seamless Vertical Handoff in GPRS-WLAN.",
                    "Design and Implementation of Parallelized Cholesky Factorization.",
                    "Network Coding for Creating Replica in Grid Environments.",
                    "A Binary Method of License Plate Character Based on Object Space Distribution Feature.",
                    "The Load Balancing Algorithm Based on the Parallel Implementation of IPO and FMM.",
                    "Sparse Matrix and Solver Objects for Parallel Finite Element Simulation of Multi-field Problems.",
                    "Vector-Matrix Multiplication Based on a Ternary Optical Computer.",
                    "Ultra High Throughput Implementations for MD5 Hash Algorithm on FPGA.",
                    "Stability Analysis and Numerical Simulation for a Class of Multi-variable Networked Control Systems.",
                    "The Oblique Water Entry Impact of a Torpedo and Its Ballistic Trajectory Simulation.",
                    "Intelligent Traffic Simulation Grid Based on the HLA and JADE.",
                    "The Research and Emulation on PIM-SM Protocol.",
                    "A Method for Querying Conserved Subnetwork in a Large-Scale Biomolecular Network.",
                    "Conflict Analysis of Multi-source SST Distribution.",
                    "Scientific Application Based Performance on Magic Cube.",
                    "Computation of Bounds for Exact Quantities of Interest in Elasticity Based on FEM and SFEM.",
                    "Development of a Scalable Solver for the Earth's Core Convection.",
                    "A Virtualized HPC Cluster Computing Environment on Xen with Web-Based User Interface.",
                    "Performance-Based Parallel Loop Self-scheduling on Heterogeneous Multicore PC Clusters.",
                    "Sharing University Resources Based on Grid Portlet.",
                    "A Hybrid Particle Swarm Optimization Algorithm Based on Space Transformation Search and a Modified Velocity Model.",
                    "Adaptive Control in Grid Computing Resource Scheduling.",
                    "Study on Synchronously Driving Control System of Linear Move Irrigator.",
                    "A Fast Morphological Reconstruction Algorithm for MRI Brain Image Simplification.",
                    "On Chip Cache Quantitative Optimization Approach: Study in Chip Multi-processor Design.",
                    "A Novel CT Image Dynamic Fuzzy Retrieval Method Using Curvelet Transform.",
                    "An Implementation Method of Parallel Finite Element Computation Based on Overlapping Domain Decomposition.",
                    "Numerical Simulation of Unsteady Flow in Centrifugal Pump Impeller at Off-Design Condition by Hybrid RANS/LES Approaches.",
                    "A Two-Level Stabilized Nonconforming Finite Element Method for the Stationary Navier-Stokes Equations."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1. HPCA 2004",
        "info": "Shanghai, China",
        "venues": []
    }
]