[
    {
        "year": "2021",
        "name": "30th HPDC 2021",
        "info": "Virtual Event, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2021",
                "sub_name": "HPDC '21: The 30th International Symposium on High-Performance Parallel and Distributed Computing, Virtual Event, Sweden, June 21-25, 2021.",
                "count": 28,
                "papers": [
                    "Hardware Specialization for Distributed Computing.",
                    "Computing Challenges for High Energy Physics.",
                    "Superscalar Programming Models: A Perspective from Barcelona.",
                    "A Serverless Framework for Distributed Bulk Metadata Extraction.",
                    "File System Semantics Requirements of HPC Applications.",
                    "DStore: A Fast, Tailless, and Quiescent-Free Object Store for PMEM.",
                    "Adaptive Configuration of In Situ Lossy Compression for Cosmology Simulations via Fine-Grained Rate-Quality Modeling.",
                    "ARC: An Automated Approach to Resiliency for Lossy Compressed Data via Error Correcting Codes.",
                    "MPI-CorrBench: Towards an MPI Correctness Benchmark Suite.",
                    "Cache-aware Sparse Patterns for the Factorized Sparse Approximate Inverse Preconditioner.",
                    "TEMPI: An Interposed MPI Library with a Canonical Representation of CUDA-aware Datatypes.",
                    "SnuRHAC: A Runtime for Heterogeneous Accelerator Clusters with CUDA Unified Memory.",
                    "Scalable All-pairs Shortest Paths for Huge Graphs on Multi-GPU Clusters.",
                    "AITurbo: Unified Compute Allocation for Partial Predictable Training in Commodity Clusters.",
                    "Apollo: : An ML-assisted Real-Time Storage Resource Observer.",
                    "An Oracle for Guiding Large-Scale Model/Hybrid Parallel Training of Convolutional Neural Networks.",
                    "DRLPart: A Deep Reinforcement Learning Framework for Optimally Efficient and Robust Resource Partitioning on Commodity Servers.",
                    "Q-adaptive: A Multi-Agent Reinforcement Learning Based Routing on Dragonfly Network.",
                    "Jigsaw: A High-Utilization, Interference-Free Job Scheduler for Fat-Tree Clusters.",
                    "Towards Exploiting CPU Elasticity via Efficient Thread Oversubscription.",
                    "DLion: Decentralized Distributed Deep Learning in Micro-Clouds.",
                    "LaSS: Running Latency Sensitive Serverless Computations at the Edge.",
                    "Machine Learning Augmented Hybrid Memory Management.",
                    "Using Pilot Jobs and CernVM File System for Simplified Use of Containers and Software Distribution.",
                    "Achieving Scalable Consensus by Being Less Writey.",
                    "Parallel Program Scaling Analysis using Hardware Counters.",
                    "CharminG: A Scalable GPU-resident Runtime System.",
                    "Productive Programming of Distributed Systems with the SHAD C++ Library."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2021frame",
                "sub_name": "FRAME@HPDC 2021: Proceedings of the 1st Workshop on Flexible Resource and Application Management on the Edge, Virtual Event, Sweden, 25 June, 2021.",
                "count": 10,
                "papers": [
                    "Filling the Gap between Scientific Research on Artificial Intelligence and Industry 4.0 Need.",
                    "Latency Preserving Self-optimizing Placement at the Edge.",
                    "Inter-operability and Orchestration in Heterogeneous Cloud/Edge Resources: The ACCORDION Vision.",
                    "AI-Based Container Orchestration for Federated Cloud Environments.",
                    "Towards a Federated Learning Approach for Privacy-aware Analysis of Semantically Enriched Mobility Data.",
                    "A Methodological Perspective on Lawful Internet Surveillance.",
                    "An Osmotic Ecosystem for Data Streaming Applications in Smart Cities.",
                    "Collaborative Visual Environments for Evidence Taking in Digital Justice: A Design Concept.",
                    "Cloud and Data Federation in MobiDataLab.",
                    "Data Science Workflows for the Cloud/Edge Computing Continuum."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2021hips",
                "sub_name": "HiPS@HPDC 2021: Proceedings of the 1st Workshop on High Performance Serverless Computing, Virtual Event, Sweden, 25 June, 2021.",
                "count": 7,
                "papers": [
                    "SLA-aware Workload Scheduling Using Hybrid Cloud Services.",
                    "Apollo: Modular and Distributed Runtime System for Serverless Function Compositions on Cloud, Edge, and IoT Resources.",
                    "Expanding Cost-Aware Function Execution with Multidimensional Notions of Cost.",
                    "Distributed Parallel Analysis Engine for High Energy Physics Using AWS Lambda.",
                    "Efficient GPU Sharing for Serverless Workflows.",
                    "Motivating High Performance Serverless Workloads.",
                    "Towards a Serverless Bioinformatics Cyberinfrastructure Pipeline."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2021snta",
                "sub_name": "SNTA@HPDC 2021: Proceedings of the 2021 on Systems and Network Telemetry and Analytics, Virtual Event, Sweden, 21 June, 2021.",
                "count": 9,
                "papers": [
                    "INODE - Intelligence Open Data Exploration.",
                    "Evaluations of Network Performance Enhancement on Cloud-native Network Function.",
                    "Analyzing Scientific Data Sharing Patterns for In-network Data Caching.",
                    "A Hybrid Virtual Network Function Placement Strategy for Maximizing the Profit of Network Service Deployment over Dynamic Workload.",
                    "Characterizing Resource Heterogeneity in Edge Devices for Deep Learning Inferences.",
                    "Recent Advances and Future Challenges for Network Function Virtualization Infrastructure.",
                    "GPU-based Classification for Wireless Intrusion Detection.",
                    "Programmable Per-Packet Network Telemetry: From Wire to Kafka at Scale.",
                    "Access Patterns to Disk Cache for Large Scientific Archive."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "29th HPDC 2020",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2020",
                "sub_name": "HPDC '20: The 29th International Symposium on High-Performance Parallel and Distributed Computing, Stockholm, Sweden, June 23-26, 2020.",
                "count": 24,
                "papers": [
                    "Cognitive Discovery: Accelerating Technical R&D with AI.",
                    "High Performance is All about Minimizing Data Movement.",
                    "Spying on the Floating Point Behavior of Existing, Unmodified Scientific Applications.",
                    "High Accuracy Matrix Computations on Neural Engines: A Study of QR Factorization and its Applications.",
                    "Space-Efficient k-d Tree-Based Storage Format for Sparse Tensors.",
                    "Practical Distributed Programming in C++.",
                    "Modeling The Temporally Constrained Preemptions of Transient Cloud VMs.",
                    "Cloud-scale VM-deflation for Running Interactive Applications On Transient Servers.",
                    "funcX: A Federated Function Serving Fabric for Science.",
                    "Towards HPC I/O Performance Prediction through Large-scale Log Analysis.",
                    "Significantly Improving Lossy Compression for HPC Datasets with Second-Order Prediction and Parameter Optimization.",
                    "DCDB Wintermute: Enabling Online and Holistic Operational Data Analytics on HPC Systems.",
                    "FFT-based Gradient Sparsification for the Distributed Training of Deep Neural Networks.",
                    "TiFL: A Tier-based Federated Learning System.",
                    "PAC: Paged Adaptive Coalescer for 3D-Stacked Memory.",
                    "Aquila: Adaptive Parallel Computation of Graph Connectivity Queries.",
                    "ASA - The Adaptive Scheduling Architecture.",
                    "Orchestrating Fault Prediction with Live Migration and Checkpointing.",
                    "KubeShare: A Framework to Manage GPUs as First-Class and Shared Resources in Container Cloud.",
                    "Efficient GPU Memory Management for Nonlinear DNNs.",
                    "gRemote: API-Forwarding Powered Cloud Rendering.",
                    "An Efficient Technique for Large Mini-batch Challenge of DNNs Training on Large Scale Cluster.",
                    "RECANS: Low-Latency Network Function Chains with Hierarchical State Sharing.",
                    "Boosting FIB Caching Performance with Aggregation."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2020precs",
                "sub_name": "Proceedings of the 3rd International Workshop on Practical Reproducible Evaluation of Computer Systems, P-RECS@HPDC 2020, Stockholm, Sweden, June 23, 2020.",
                "count": 6,
                "papers": [
                    "Learning Networking by Reproducing Research Results.",
                    "Stimulating Reproducible Software Artifacts.",
                    "Beyond Open Data: A Model for Linking Digital Artifacts to Enable Reproducibility of Scientific Claims.",
                    "Advancing Computational Reproducibility in the Dataverse Data Repository Platform.",
                    "MiDas: Containerizing Data-Intensive Applications with I/O Specialization.",
                    "Xanthus: Push-button Orchestration of Host Provenance Data Collection."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2020snta",
                "sub_name": "Proceedings of the 3rd International Workshop on Systems and Network Telemetry and Analytics, SNTA@HPDC 2020, Stockholm, Sweden, June 23, 2020.",
                "count": 10,
                "papers": [
                    "Analytics-Driven Networking: When the Computer becomes the Network.",
                    "KDetect: Unsupervised Anomaly Detection for Cloud Systems Based on Time Series Clustering.",
                    "Data-driven Learning to Predict WAN Network Traffic.",
                    "Feature Selection Improves Tree-based Classification for Wireless Intrusion Detection.",
                    "Using Machine Learning for Intent-based provisioning in High-Speed Science Networks.",
                    "2020 Vision for Web Privacy.",
                    "HPC Workload Characterization Using Feature Selection and Clustering.",
                    "Transfer Learning Approach for Botnet Detection Based on Recurrent Variational Autoencoder.",
                    "Finding the Optimal Reconfiguration for Network Function Virtualization Orchestration with Time-varied Workload.",
                    "Evaluation of Deep Learning Models for Network Performance Prediction for Scientific Facilities."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "28th HPDC 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2019",
                "sub_name": "Proceedings of the 28th International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2019, Phoenix, AZ, USA, June 22-29, 2019.",
                "count": 30,
                "papers": [
                    "Session details: High Performance Distributed Systems (Best Paper Nominees).",
                    "SpotWeb: Running Latency-sensitive Distributed Web Services on Transient Cloud Servers.",
                    "LABIOS: A Distributed Label-Based I/O System.",
                    "Parsl: Pervasive Parallel Programming in Python.",
                    "Kleio: A Hybrid Memory Page Scheduler with Machine Intelligence.",
                    "Session details: Reliability and Variability.",
                    "MANA for MPI: MPI-Agnostic Network-Agnostic Transparent Checkpointing.",
                    "Multi-Level Analysis of Compiler-Induced Variability and Performance Tradeoffs.",
                    "Making Root Cause Analysis Feasible for Large Code Bases: A Solution Approach for a Climate Model.",
                    "Session details: Hybrid Systems.",
                    "HEXO: Offloading HPC Compute-Intensive Workloads on Low-Cost, Low-Power Embedded Systems.",
                    "Scheduling Beyond CPUs for HPC.",
                    "Paths to Fast Barrier Synchronization on the Node.",
                    "Session details: Scalable Graph Processing.",
                    "XBFS: eXploring Runtime Optimizations for Breadth-First Search on GPUs.",
                    "Combining Data Duplication and Graph Reordering to Accelerate Parallel Graph Processing.",
                    "Session details: HPDC Achievement Award Talk.",
                    "Perspectives on High-Performance Computing in a Big Data World.",
                    "Session details: Fairness and Performance.",
                    "Preemptive Multi-Queue Fair Queuing.",
                    "DeepSZ: A Novel Framework to Compress Deep Neural Networks by Using Error-Bounded Lossy Compression.",
                    "PERQ: Fair and Efficient Power Management of Power-Constrained Large-Scale Computing Systems.",
                    "Suffix Array Construction on Multi-GPU Systems.",
                    "CuLDA: Solving Large-scale LDA Problems on GPUs.",
                    "Better Late Than Never: An n-Variant Framework of Verification for Java Source Code on CPU x GPU Hybrid Platform.",
                    "Session details: Cloud Systems.",
                    "UMR-EC: A Unified and Multi-Rail Erasure Coding Library for High-Performance Distributed Storage Systems.",
                    "GAugur: Quantifying Performance Interference of Colocated Games for Improving Resource Utilization in Cloud Gaming.",
                    "Adaptive Resource Views for Containers.",
                    "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2019precs",
                "sub_name": "Proceedings of the 2nd International Workshop on Practical Reproducible Evaluation of Computer Systems, P-RECS@HPDC 2019, Phoenix, AZ, USA, June 24, 2019.",
                "count": 6,
                "papers": [
                    "Applicability Study of the PRIMAD Model to LIGO Gravitational Wave Search Workflows.",
                    "Provenance and Reproducibility in the Automation of a Standard Computational Neuroscience Pipeline.",
                    "Initial Thoughts on Cybersecurity And Reproducibility.",
                    "Implementing Computational Reproducibility in the Whole Tale Environment.",
                    "Scientific Tests and Continuous Integration Strategies to Enhance Reproducibility in the Scientific Software Context.",
                    "Reproducible Computer Network Experiments: A Case Study Using Popper."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2019snta",
                "sub_name": "Proceedings of the ACM Workshop on Systems and Network Telemetry and Analytics, SNTA@HPDC 2019, Phoenix, AZ, USA, June 25, 2019.",
                "count": 12,
                "papers": [
                    "Session details: Keynote Speech.",
                    "Performance and Security Challenges in Science Workflows.",
                    "Session details: Technical Session I.",
                    "Automatic Detection of Network Traffic Anomalies and Changes.",
                    "Time Series Analysis for Efficient Sample Transfers.",
                    "Similarity-based Compression with Multidimensional Pattern Matching.",
                    "A Software Defined Network Design for Analyzing Streaming Data in Transit.",
                    "Session details: Technical Session II.",
                    "Understanding Parallel I/O Performance Trends Under Various HPC Configurations.",
                    "Performance Prediction for Data Transfers in LCLS Workflow.",
                    "Generating Labeled Flow Data from MAWILab Traces for Network Intrusion Detection.",
                    "Real-time Multi-process Tracing Decoder Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2019sciencecloud",
                "sub_name": "Proceedings of the 10th Workshop on Scientific Cloud Computing, ScienceCloud@HPDC 2019, Phoenix, AZ, USA, June 25, 2019.",
                "count": 6,
                "papers": [
                    "Session details: Session 1: Converged Computing Infrastructures.",
                    "Horizontal or Vertical?: A Hybrid Approach to Large-Scale Distributed Machine Learning.",
                    "Session details: Session 2: Scientific Computing Based on Cloud.",
                    "ElasticPipe: An Efficient and Dynamic Model-Parallel Solution to DNN Training.",
                    "Towards a Smart, Internet-Scale Cache Service for Data Intensive Scientific Applications.",
                    "Deconstructing the 2017 Changes to AWS Spot Market Pricing."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "27th HPDC 2018",
        "info": "Tempe, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2018",
                "sub_name": "Proceedings of the 27th International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2018, Tempe, AZ, USA, June 11-15, 2018.",
                "count": 25,
                "papers": [
                    "Reproducibility in computational and data-enabled science.",
                    "PicoDriver: fast-path device drivers for multi-kernel operating systems.",
                    "Hard real-time scheduling for parallel run-time systems.",
                    "ABFR: convenient management of latent error resilience using application knowledge.",
                    "Desh: deep learning for system health prediction of lead times to failure in HPC.",
                    "Improving performance of iterative methods by lossy checkponting.",
                    "Efficient sparse-matrix multi-vector product on GPUs.",
                    "CommAnalyzer: automated estimation of communication cost and scalability on HPC clusters from sequential code.",
                    "A high-performance connected components implementation for GPUs.",
                    "Cambrian explosion of computing and big data in the post-moore era.",
                    "PShifter: feedback-based dynamic power shifting within HPC jobs for performance.",
                    "ADAPT: an event-based adaptive collective communication framework.",
                    "Process-in-process: techniques for practical address-space sharing.",
                    "Thread-local concurrency: a technique to handle data race detection at programming model abstraction.",
                    "LADR: low-cost application-level detector for reducing silent output corruptions.",
                    "Profiling distributed systems in lightweight virtualized environments with logs and resource metrics.",
                    "Tuyere: enabling scalable memory workloads for system exploration.",
                    "Performance analysis and optimization of in-situ integration of simulation with data analysis: zipping applications up.",
                    "ForkTail: a black-box fork-join tail latency prediction model for user-facing datacenter workloads.",
                    "The biology of software.",
                    "Hermes: a heterogeneous-aware multi-tiered distributed I/O buffering system.",
                    "NVStream: accelerating HPC workflows with NVRAM-based transport for streaming objects.",
                    "Parallelizing garbage collection with I/O to improve flash resource utilization.",
                    "Transparent speculation in geo-replicated transactional data stores.",
                    "Cross-geography scientific data transferring trends and behavior."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2018p",
                "sub_name": "Poster Proceedings of the 27th International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2018, Tempe, AZ, USA, June 11-15, 2018.",
                "count": 10,
                "papers": [
                    "POSTER: An Intelligent Framework to Parallelize Hadoop Phases.",
                    "ATF: A Generic Auto-Tuning Framework.",
                    "Performance Evaluation of a Toolkit for Sparse Tensor Decomposition.",
                    "Hermes: A Heterogeneous-Aware Multi-Tiered Distributed I/O Buffering System.",
                    "Profiling Distributed Systems in Lightweight Virtualized Environments with Logs and Resource Metrics.",
                    "Making Profit with ALBATROSS: A Runtime System for Heterogeneous High-Performance-Computing Clusters.",
                    "Lightweight Authentication for Fault-Tolerant Topic-Channels in Ad Hoc Distributed Systems.",
                    "Are Existing Knowledge Transfer Techniques Effective For Deep Learning on Edge Devices?",
                    "Exploring the Capabilities of Mobile Devices Supporting Deep Learning.",
                    "Locality-driven MRC Construction and Cache Allocation."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2018aiscience",
                "sub_name": "Proceedings of the 1st International Workshop on Autonomous Infrastructure for Science, AI-Science@HPDC 2018, Tempe, AZ, USA, June 11, 2018.",
                "count": 7,
                "papers": [
                    "High-Throughput Neuroanatomy and Trigger-Action Programming: A Case Study in Research Automation.",
                    "Towards Autonomic Science Infrastructure: Architecture, Limitations, and Open Issues.",
                    "Virtual Environment for Testing Software-Defined Networking Solutions for Scientific Workflows.",
                    "Towards a control-theory approach for minimizing unused grid resources.",
                    "A Model Driven Intelligent Orchestration Approach to Service Automation in Large Distributed Infrastructures.",
                    "In-Operando Tracking and Prediction of Transition in Material System using LSTM.",
                    "Identifying Anomalous File Transfer Events in LCLS Workflow."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2018sciencecloud",
                "sub_name": "Proceedings of the 9th Workshop on Scientific Cloud Computing, ScienceCloud@HPDC 2018, Tempe, AZ, USA, June 11, 2018.",
                "count": 8,
                "papers": [
                    "Predicting Amazon Spot Prices with LSTM Networks.",
                    "Libra: Improved Partitioning Strategies for Massive Comparative Metagenomics Analysis.",
                    "Batch and online anomaly detection for scientific applications in a Kubernetes environment.",
                    "High Availability on Jetstream: Practices and Lessons Learned.",
                    "Early Experience Using Amazon Batch for Scientific Workflows.",
                    "Partitioning SKA Dataflows for Optimal Graph Execution.",
                    "Efficient Integration of Containers into Scientific Workflows.",
                    "Faodel: Data Management for Next-Generation Application Workflows."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2018ross",
                "sub_name": "Proceedings of the 8th International Workshop on Runtime and Operating Systems for Supercomputers, ROSS@HPDC 2018, Tempe, AZ, USA, June 12, 2018.",
                "count": 6,
                "papers": [
                    "Data Management, In-Situ Workflows and Extreme Scales.",
                    "rmalloc() and rpipe(): a uGNI-based Distributed Remote Memory Allocator and Access Library for One-sided Messaging.",
                    "An Implementation of Fast memset() Using Hardware Accelerators.",
                    "How to Make Profit: Exploiting Fluctuating Electricity Prices with Albatross, A Runtime System for Heterogeneous HPC Clusters.",
                    "Is the Heap Manager Important to Many Cores?",
                    "Direct-FUSE: Removing the Middleman for High-Performance FUSE File System Support."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "26th HPDC 2017",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2017",
                "sub_name": "Proceedings of the 26th International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2017, Washington, DC, USA, June 26-30, 2017.",
                "count": 23,
                "papers": [
                    "Building Secure Platforms for Research on Human Subjects: The Importance of Computer Scientists.",
                    "Enabling Workflow-Aware Scheduling on HPC Systems.",
                    "Parallel Stream Processing Against Workload Skewness and Variance.",
                    "Caches All the Way Down: Infrastructure for Data Intensive Science.",
                    "NICE: Network-Integrated Cluster-Efficient Storage.",
                    "MaDaTS: Managing Data on Tiered Storage for Scientific Workflows.",
                    "ArrayUDF: User-Defined Scientific Data Analysis on Arrays.",
                    "Deep Learning in Cancer and Infectious Disease: Novel Driver Problems for Future HPC Architecture.",
                    "knor: A NUMA-Optimized In-Memory, Distributed and Semi-External-Memory k-means Library.",
                    "CuMF_SGD: Parallelized Stochastic Gradient Descent for Matrix Factorization on GPUs.",
                    "To Push or To Pull: On Reducing Communication and Synchronization in Graph Computations.",
                    "Better Safe than Sorry: Grappling with Failures of In-Memory Data Analytics Frameworks.",
                    "LetGo: A Lightweight Continuous Framework for HPC Applications Under Failures.",
                    "Towards a More Complete Understanding of SDC Propagation.",
                    "Diagnosing Machine Learning Pipelines with Fine-grained Lineage.",
                    "COS: A Parallel Performance Model for Dynamic Variations in Processor Speed, Memory Speed, and Thread Concurrency.",
                    "Explaining Wide Area Data Transfer Performance.",
                    "Using Scientific Computing to Advance Wildland Fire Monitoring and Prediction.",
                    "Predicting Output Performance of a Petascale Supercomputer.",
                    "TCP Throughput Profiles Using Measurements over Dedicated Connections.",
                    "AllConcur: Leaderless Concurrent Atomic Broadcast.",
                    "IOGP: An Incremental Online Graph Partitioning Algorithm for Distributed Graph Databases.",
                    "Machine and Application Aware Partitioning for Adaptive Mesh Refinement Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2017sem4hpc",
                "sub_name": "Proceedings of the 2017 Workshop on Software Engineering Methods for Parallel and High Performance Applications, SEM4HPC@HPDC 2017, Washington, DC, USA, June 26-30, 2017.",
                "count": 5,
                "papers": [
                    "MPI Acceleration of Image Classification: Are We Seeing the Resurgence of MPI in Solving Big Data Problems?",
                    "How Effective is Design Abstraction in Thrust?: An Empirical Evaluation.",
                    "READEX Tool Suite for Energy-efficiency Tuning of HPC Applications.",
                    "PRESGen: A Fully Automatic Equivalence Checker for Validating Optimizing and Parallelizing Transformations.",
                    "Using High Level GPU Tasks to Explore Memory and Communications Options on Heterogeneous Platforms."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2017ftxs",
                "sub_name": "Proceedings of the ACM Workshop on Fault-Tolerance for HPC at Extreme Scale, FTXS@HPDC 2017, Washington, DC, USA, June, 2017.",
                "count": 5,
                "papers": [
                    "A Non-Invasive Approach for Realizing Resilience in MPI.",
                    "Optimal Checkpointing Period with Replicated Execution on Heterogeneous Platforms.",
                    "Understanding the Spatial Characteristics of DRAM Errors in HPC Clusters.",
                    "Towards New Metrics for High-Performance Computing Resilience.",
                    "Identifying the Right Replication Level to Detect and Correct Silent Errors at Scale."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2017ross",
                "sub_name": "Proceedings of the 7th International Workshop on Runtime and Operating Systems for Supercomputers, ROSS@HPDC 2017, Washingon, DC, DC, USA, June 27 - 27, 2017.",
                "count": 8,
                "papers": [
                    "Operating and Runtime Systems Challenges for HPC Systems.",
                    "Jitter-Trace: a low-overhead OS noise tracing tool based on Linux Perf.",
                    "Quantitative Evaluation of Intel PEBS Overhead for Online System-Noise Analysis.",
                    "Scheduling Chapel Tasks with Qthreads on Manycore: A Tale of Two Schedulers.",
                    "Seastar: A Comprehensive Framework for Telemetry Data in HPC Environments.",
                    "UNITY: Unified Memory and File Space.",
                    "Toward Full Specialization of the HPC Software Stack: Reconciling Application Containers and Lightweight Multi-kernels.",
                    "The Effect of Asymmetric Performance on Asynchronous Task Based Runtimes."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "25th HPDC 2016",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2016",
                "sub_name": "Proceedings of the 25th ACM International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2016, Kyoto, Japan, May 31 - June 04, 2016.",
                "count": 31,
                "papers": [
                    "Preparing for Supercomputing's Sixth Wave.",
                    "Routing on the Dependency Graph: A New Approach to Deadlock-Free High-Performance Routing.",
                    "Network-Managed Virtual Global Address Space for Message-driven Runtimes.",
                    "High-Performance Distributed RMA Locks.",
                    "Towards Practical Algorithm Based Fault Tolerance in Dense Linear Algebra.",
                    "New-Sum: A Novel Online ABFT Scheme For General Iterative Methods.",
                    "SDS-Sort: Scalable Dynamic Skew-aware Parallel Sorting.",
                    "Scalable I/O-Aware Job Scheduling for Burst Buffer Enabled HPC Clusters.",
                    "SWAT: A Programmable, In-Memory, Distributed, High-Performance Computing Platform.",
                    "Consecutive Job Submission Behavior at Mira Supercomputer.",
                    "Scaling Spark on HPC Systems.",
                    "IBIS: Interposed Big-data I/O Scheduler.",
                    "With Extreme Scale Computing the Rules Have Changed.",
                    "NVL-C: Static Analysis Techniques for Efficient, Correct Programming of Non-Volatile Main Memory Systems.",
                    "Automatic Hybridization of Runtime Systems.",
                    "Algorithm-Directed Data Placement in Explicitly Managed Non-Volatile Memory.",
                    "Self-configuring Software-defined Overlay Bypass for Seamless Inter- and Intra-cloud Virtual Networking.",
                    "Wiera: Towards Flexible Multi-Tiered Geo-Distributed Cloud Storage Instances.",
                    "MOS: Workload-aware Elasticity for Cloud Object Stores.",
                    "IMPACC: A Tightly Integrated MPI+OpenACC Framework Exploiting Shared Memory Parallelism.",
                    "Improving GPU Performance Through Resource Sharing.",
                    "Parallel Execution Profiles.",
                    "Faster and Cheaper: Parallelizing Large-Scale Matrix Factorization on GPUs.",
                    "GPU-Aware Non-contiguous Data Movement In Open MPI.",
                    "Implications of Heterogeneous Memories in Next Generation Server Systems.",
                    "Efficient Processing of Large Graphs via Input Reduction.",
                    "DD-Graph: A Highly Cost-Effective Distributed Disk-based Graph-Processing Framework.",
                    "Evaluation of Pattern Matching Workloads in Graph Analysis Systems.",
                    "SMT-Aware Instantaneous Footprint Optimization.",
                    "BAShuffler: Maximizing Network Bandwidth Utilization in the Shuffle of YARN.",
                    "Master of Puppets: Cooperative Multitasking for In Situ Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2016ftxs",
                "sub_name": "Proceedings of the ACM Workshop on Fault-Tolerance for HPC at Extreme Scale, FTXS@HPDC 2016, Kyoto, Japan, May 31, 2016.",
                "count": 7,
                "papers": [
                    "Fault Tolerance in the Parareal Method.",
                    "A Self-Correcting Connected Components Algorithm.",
                    "The K computer and its failures.",
                    "ULFM-MPI Implementation of a Resilient Task-Based Partial Differential Equations Preconditioner.",
                    "Adding Fault Tolerance to NPB Benchmarks Using ULFM.",
                    "An Examination of the Impact of Failure Distribution on Coordinated Checkpoint/Restart.",
                    "In-Situ Mitigation of Silent Data Corruption in PDE Solvers."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2016sciencecloud",
                "sub_name": "Proceedings of the ACM 7th Workshop on Scientific Cloud Computing, ScienceCloud@HPDC 2016, Kyoto, Japan, June 1, 2016.",
                "count": 5,
                "papers": [
                    "Who is Afraid of I/O?: Exploring I/O Challenges and Opportunities at the Exascale.",
                    "Towards Efficient Location and Placement of Dynamic Replicas for Geo-Distributed Data Stores.",
                    "Managing Object Versioning in Geo-Distributed Object Storage Systems.",
                    "Value-Based Resource Management in High-Performance Computing Systems.",
                    "A Workload Aware Storage Platform for Large Scale Computing Environments: Challenges and Proposed Directions."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2016sem4hpc",
                "sub_name": "Proceedings of the ACM Workshop on Software Engineering Methods for Parallel and High Performance Applications, Kyoto, Japan, May 31 - June 04, 2016.",
                "count": 8,
                "papers": [
                    "Challenges in Transition.",
                    "Implementing an Efficient Path Based Equivalence Checker for Parallel Programs.",
                    "The READEX Project for Dynamic Energy Efficiency Tuning.",
                    "LUT Optimization In Implementation Of Combinational Karatsuba Ofman On Virtex-6 FPGA.",
                    "Adaptive GPU Array Layout Auto-Tuning.",
                    "Developer Productivity in HPC Application Development: An Overview of Recent Techniques.",
                    "Autotuning of MPI Applications Using PTF.",
                    "A Performance Optimization Framework for the Simultaneous Heterogeneous Computing Platforms."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2016hpgp",
                "sub_name": "Proceedings of the ACM Workshop on High Performance Graph Processing, HPGP@HPDC 2016, Kyoto, Japan, May 31, 2016.",
                "count": 8,
                "papers": [
                    "A Comparative Study on Exact Triangle Counting Algorithms on the GPU.",
                    "Parallel Shortest-Path Queries in Planar Graphs.",
                    "Towards Next-Generation Graph Processing and Management Platform.",
                    "NUMA-aware Scalable Graph Traversal on SGI UV Systems.",
                    "Graph Topology Abstraction for Distributed Path Queries.",
                    "Betweenness Centrality in an HSA-enabled System.",
                    "BLADYG: A Novel Block-Centric Framework for the Analysis of Large Dynamic Graphs.",
                    "Distributed Incremental Pattern Matching on Streaming Graphs."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2016ross",
                "sub_name": "Proceedings of the 6th International Workshop on Runtime and Operating Systems for Supercomputers, Kyoto, Japan, June 1, 2016.",
                "count": 7,
                "papers": [
                    "A Quest for Unified, Global View Parallel Programming Models for Our Future.",
                    "Decoupled: Low-Effort Noise-Free Execution on Commodity Systems.",
                    "A Cross-Enclave Composition Mechanism for Exascale System Software.",
                    "HermitCore: A Unikernel for Extreme Scale Computing.",
                    "A Multi-Kernel Survey for High-Performance Computing.",
                    "GPUrdma: GPU-side library for high performance networking from GPU kernels.",
                    "A Scalable Runtime for the ECOSCALE Heterogeneous Exascale Hardware Platform."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "24th HPDC 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2015",
                "sub_name": "Proceedings of the 24th International Symposium on High-Performance Parallel and Distributed Computing, HPDC 2015, Portland, OR, USA, June 15-19, 2015.",
                "count": 32,
                "papers": [
                    "Through the Looking-Glass: From Performance Observation to Dynamic Adaptation.",
                    "Turning Centralized Coherence and Distributed Critical-Section Execution on their Head: A New Approach for Scalable Distributed Shared Memory.",
                    "Uni-Address Threads: Scalable Thread Management for RDMA-Based Work Stealing.",
                    "A Case for Transforming Parallel Runtimes Into Operating System Kernels.",
                    "A Multiplatform Study of I/O Behavior on Petascale Supercomputers.",
                    "CAST: Tiering Storage for Data Analytics in the Cloud.",
                    "HPC System Lifetime Story: Workload Characterization and Evolutionary Analyses on NERSC Systems.",
                    "In-Situ Bitmaps Generation and Efficient Data Analysis based on Bitmaps.",
                    "Automated Characterization of Parallel Application Communication Patterns.",
                    "Cache Line Aware Optimizations for ccNUMA Systems.",
                    "XEMEM: Efficient Shared Memory for Composed Applications on Multi-OS/R Exascale Systems.",
                    "Transit: A Visual Analytical Model for Multithreaded Machines.",
                    "DARE: High-Performance State Machine Replication on RDMA Networks.",
                    "High Impact Computing: Computing for Science and the Science of Computing.",
                    "Practical Resource Management in Power-Constrained, High Performance Computing.",
                    "Optimizing Grouped Aggregation in Geo-Distributed Streaming Analytics.",
                    "POW: System-wide Dynamic Reallocation of Limited Power in HPC.",
                    "Achieving Performance Isolation with Lightweight Co-Kernels.",
                    "Accelerating Irregular Computations with Hardware Transactional Memory and Active Messages.",
                    "Understanding Graph Computation Behavior to Enable Robust Benchmarking.",
                    "Fast Iterative Graph Computation with Resource Aware Graph Parallel Abstractions.",
                    "Bidding for Highly Available Services with Low Price in Spot Instance Market.",
                    "Planning and Optimization in TORQUE Resource Manager.",
                    "Cutting the Cost of Hosting Online Services Using Cloud Spot Markets.",
                    "Towards Scalable Distributed Workload Manager with Monitoring-Based Weakly Consistent Resource Stealing.",
                    "A Declarative Optimization Engine for Resource Provisioning of Scientific Workflows in IaaS Clouds.",
                    "HeteroDoop: A MapReduce Programming System for Accelerator Clusters.",
                    "Monte Carlo Based Ray Tracing in CPU-GPU Heterogeneous Systems and Applications in Radiation Therapy.",
                    "Automated GPU Kernel Transformations in Large-Scale Production Stencil Applications.",
                    "A Numerical Soft Fault Model for Iterative Linear Solvers.",
                    "Lightweight Silent Data Corruption Detection Based on Runtime Data Analysis for HPC Applications.",
                    "Exploring Failure Recovery for Stencil-based Applications at Extreme Scales."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015bigsystem",
                "sub_name": "Proceedings of the 2nd International Workshop on Software-Defined Ecosystems, BigSystem 2015, Portland, Oregon, USA, June 16, 2015.",
                "count": 6,
                "papers": [
                    "Feeding the Beast: Getting Data into Big Systems.",
                    "Continuous Delivery of Composite Solutions: A Case for Collaborative Software Defined PaaS Environments.",
                    "A Framework for Realizing Software-Defined Federations for Scientific Workflows.",
                    "Redefining Data Locality for Cross-Data Center Storage.",
                    "XoS: An Extensible Cloud Operating System.",
                    "Virtual Fabric-based Approach for Virtual Data Center Network."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015ftxs",
                "sub_name": "Proceedings of the 5th Workshop on Fault Tolerance for HPC at eXtreme Scale, FTXS 2015, Portland, Oregon, USA, June 15, 2015.",
                "count": 10,
                "papers": [
                    "Failures in Large-Scale Systems: Insights from the Field.",
                    "A Principled Approach to HPC Event Monitoring.",
                    "LogDiver: A Tool for Measuring Resilience of Extreme-Scale Systems and Applications.",
                    "Resilient Matrix Multiplication of Hierarchical Semi-Separable Matrices.",
                    "Voltage Overscaling Algorithms for Energy-Efficient Workflow Computations With Timing Errors.",
                    "Empirical Studies of the Soft Error Susceptibility ofSorting Algorithms to Statistical Fault Injection.",
                    "Evolving the Message Passing Programming Model via a Fault-Tolerant, Object-oriented Transport Layer.",
                    "How Much SSD Is Useful for Resilience in Supercomputers.",
                    "The Path to Exascale: Code Optimizations and Hardening Solutions Reliability.",
                    "Transient Fault Resilient QR Factorization on GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015sciencecloud",
                "sub_name": "Proceedings of the 6th Workshop on Scientific Cloud Computing, ScienceCloud 2015, Portland, Oregon, USA, June 16, 2015.",
                "count": 7,
                "papers": [
                    "Challenges of Running Scientific Workflows in Cloud Environments.",
                    "Scaling VM Deployment in an Open Source Cloud Stack.",
                    "Architecting a Persistent and Reliable Configuration Management System.",
                    "On Performance Resilient Scheduling for Scientific Workflows in HPC Systems with Constrained Storage Resources.",
                    "A Dynamically Scalable Cloud Data Infrastructure for Sensor Networks.",
                    "Achieving Performance Isolation on Multi-Tenant Networked Clouds Using Advanced Block Storage Mechanisms.",
                    "High-Performance Storage Support for Scientific Applications on the Cloud."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015ross",
                "sub_name": "Proceedings of the 5th International Workshop on Runtime and Operating Systems for Supercomputers, ROSS 2015, Portland, OR, USA, June 16, 2015.",
                "count": 9,
                "papers": [
                    "The Machine: An Architecture for Memory-centric Computing.",
                    "LIRA: Adaptive Contention-Aware Thread Placement for Parallel Runtime Systems.",
                    "Application Runtime Variability and Power Optimization for Exascale Computers.",
                    "ANGEL: A Hierarchical Approach to Multi-Objective Online Auto-Tuning.",
                    "Exploring the Design Space of Combining Linux with Lightweight Kernels for Extreme Scale Computing.",
                    "Analyzing System Calls in Multi-OS Hierarchical Environments.",
                    "System-Level Support for Composition of Applications.",
                    "Quantifying Scheduling Challenges for Exascale System Software.",
                    "What is a Lightweight Kernel?"
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015scream",
                "sub_name": "Proceedings of the 1st Workshop on The Science of Cyberinfrastructure - Research, Experience, Applications and Models, SCREAM@HPDC 2015, Portland, Oregon, USA, June 16, 2015.",
                "count": 10,
                "papers": [
                    "Lessons from Industry for Science Cyberinfrastructure: Simplicity, Scale, and Sustainability via SaaS/PaaS.",
                    "Dynamic Provisioning of Data Intensive Computing Middleware Frameworks: A Case Study.",
                    "Achieving Formal Parallel Program Debugging by Incentivizing CS/HPC Collaborative Tool Development.",
                    "Apache Airavata as a Laboratory: Architecture and Case Study for Component-Based Gateway Middleware.",
                    "A Revisiting of the Anatomy and Physiology of the Grid.",
                    "Authentication and Authorization Considerations for a Multi-tenant Service.",
                    "Data Centric Discovery with a Data-Oriented Architecture.",
                    "Science Gateway Canvas: A business reference model for Science Gateways.",
                    "Jetstream: A Distributed Cloud Infrastructure for Underresourced higher education communities.",
                    "Sustained Software for Cyberinfrastructure: Analyses of Successful Efforts with a Focus on NSF-funded Software."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2015clhs",
                "sub_name": "Proceedings of the 2015 Workshop on Changing Landscapes in HPC Security, CLHS@HPDC 2015, Portland, Oregon, USA, June 16, 2015.",
                "count": 4,
                "papers": [
                    "An Autonomic Cloud Management System for Enforcing Security and Assurance Properties.",
                    "Toward a Data Spillage Prevention Process in Hadoop using Data Provenance.",
                    "Facilitating Scientific Collaborations by Delegating Identity Management: Reducing Barriers & Roadmap for Incremental Implementation.",
                    "Recent Non-technical Forces in Security at the National Center for Atmospheric Research."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "23rd HPDC 2014",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2014",
                "sub_name": "The 23rd International Symposium on High-Performance Parallel and Distributed Computing, HPDC'14, Vancouver, BC, Canada - June 23 - 27, 2014.",
                "count": 34,
                "papers": [
                    "Snapify: capturing snapshots of offload applications on xeon phi manycore processors.",
                    "Transparent checkpoint-restart over infiniband.",
                    "ConCORD: easily exploiting memory content redundancy through the content-aware service command.",
                    "Fault tolerance for remote memory access programming models.",
                    "FT-ScaLAPACK: correcting soft errors on-line for ScaLAPACK cholesky, QR, and LU factorization routines.",
                    "When paxos meets erasure code: reduce network and storage cost in state machine replication.",
                    "CMCP: a novel page replacement policy for system level hierarchical memory management on many-cores.",
                    "TOP-PIM: throughput-oriented programmable processing in memory.",
                    "Improving energy efficiency of embedded DRAM caches for high-end computing systems.",
                    "Next generation job management systems for extreme-scale ensemble computing.",
                    "OpenARC: open accelerator research compiler for directive-based, efficient heterogeneous computing.",
                    "MIC-Check: a distributed check pointing framework for the intel many integrated cores architecture.",
                    "Communication-driven scheduling for virtual clusters in cloud.",
                    "Efficient task placement and routing of nearest neighbor exchanges in dragonfly networks.",
                    "Analysis of dynamic scheduling strategies for matrix multiplication on heterogeneous platforms.",
                    "Design and evaluation of the gemtc framework for GPU-enabled many-task computing.",
                    "MRONLINE: MapReduce online performance tuning.",
                    "Scalable matrix inversion using MapReduce.",
                    "Supporting correlation analysis on scientific datasets in parallel and distributed settings.",
                    "A methodology for evaluating the impact of data compression on climate simulation data.",
                    "Computation and communication efficient graph processing with distributed immutable view.",
                    "Seraph: an efficient, low-cost system for concurrent graph processing.",
                    "CuSha: vertex-centric graph processing on GPUs.",
                    "Improving parallel I/O autotuning with performance modeling.",
                    "SLAM: scalable locality-aware middleware for I/O in scientific analysis and visualization.",
                    "SOR-HDFS: a SEDA-based approach to maximize overlapping in RDMA-enhanced HDFS.",
                    "Squirrel: scatter hoarding VM image contents on IaaS compute nodes.",
                    "Exploiting redundancy for cost-effective, time-constrained execution of HPC applications on amazon EC2.",
                    "Domino: an incremental computing framework in cloud with eventual synchronization.",
                    "Glasswing: accelerating mapreduce on multi-core and many-core clusters.",
                    "CBL: exploiting community based locality for efficient content search in online social networks.",
                    "Data filtering for scalable high-dimensional k-NN search on multicore systems.",
                    "Bobolang: a language for parallel streaming applications.",
                    "A scalable distributed skip list for range queries."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2014psfw",
                "sub_name": "PFSW'14, Proceedings of the 2014 ACM HPDC International Workshop on Programmable File Systems, Vancouver, BC, Canada, June 23-27, 2014.",
                "count": 4,
                "papers": [
                    "Rethinking the application-database interface.",
                    "Creating a programmable object storage stack.",
                    "Building an extensible file system via policy-based data management.",
                    "QoS-aware storage virtualization for cloud file systems."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2014bigsystem",
                "sub_name": "BigSystem'14, Proceedings of the 2014 ACM HPDC International Workshop on Software-Defined Ecosystems, Vancouver, BC, Canada, June 23-27, 2014.",
                "count": 6,
                "papers": [
                    "Syndicate: virtual cloud storage through provider composition.",
                    "Software defined federated cyber-infrastructure for science and engineering.",
                    "GatorCloud: a fine-grained and dynamic resourcesharing architecture for multiple cloud services.",
                    "Accessing multiple clouds with cloudmesh.",
                    "Turning the tortoise to the hare: an alternative perspective on event handling in SDN.",
                    "Proposed metrics on ecosystem health."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2014sciencecloud",
                "sub_name": "ScienceCloud'14, Proceedings of the 2014 ACM HPDC International Workshop on Scientific Cloud Computing, Vancouver, BC, Canada, June 23-27, 2014.",
                "count": 8,
                "papers": [
                    "Science in the cloud: lessons from three years of research projects on microsoft azure.",
                    "Cloud computing data capsules for non-consumptiveuse of texts.",
                    "A cloud computing approach to on-demand and scalable cybergis analytics.",
                    "Mux-Kmeans: multiplex kmeans for clustering large-scale data set.",
                    "Evaluating storage systems for scientific data in the cloud.",
                    "HEP computing in a context-aware cloud environment.",
                    "Auto-scaling of virtual resources for scientific workflows on hybrid clouds.",
                    "A distributed architecture for intra- and inter-cloud data management."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "22nd HPDC 2013",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2013",
                "sub_name": "The 22nd International Symposium on High-Performance Parallel and Distributed Computing, HPDC'13, New York, NY, USA - June 17 - 21, 2013.",
                "count": 31,
                "papers": [
                    "Scalable in situ scientific data encoding for analytical query processing.",
                    "Taming massive distributed datasets: data sampling using bitmap indices.",
                    "I/O acceleration with pattern detection.",
                    "MTC envelope: defining the capability of large scale computers in the context of parallel scripting applications.",
                    "Virtual TCP offload: optimizing ethernet overlay performance on advanced interconnects.",
                    "Scalanytics: a declarative multi-core platform for scalable composable traffic analytics.",
                    "CamCubeOS: a key-based network stack for 3D torus cluster topologies.",
                    "NUMA-aware shared-memory collective communication for MPI.",
                    "Modeling communication in cache-coherent SMP systems: a case-study with Xeon Phi.",
                    "IBIS: interposed big-data I/O scheduler.",
                    "ACIC: automatic cloud I/O configurator for parallel applications.",
                    "Orthrus: a framework for implementing high-performance collective I/O in the multicore clusters.",
                    "ElastMan: autonomic elasticity manager for cloud-based key-value stores.",
                    "Supporting parallel soft real-time applications in virtualized environment.",
                    "Building and scaling virtual clusters with residual resources from interactive clouds.",
                    "SCDA: SLA-aware cloud datacenter architecture for efficient content storage and retrieval.",
                    "Load balancing in large-scale epidemiological simulations.",
                    "Efficient analytics on ordered datasets using MapReduce.",
                    "A framework for auto-tuning HDF5 applications.",
                    "Anton: a special-purpose machine that achieves a hundred-fold speedup in biomolecular simulations.",
                    "WuKong: automatically detecting and localizing bugs that manifest at large system scales.",
                    "A 1 PB/s file system to checkpoint three million MPI tasks.",
                    "AI-Ckpt: leveraging memory access patterns for adaptive asynchronous incremental checkpointing.",
                    "Correcting soft errors online in LU factorization.",
                    "A preemption-based runtime to efficiently schedule multi-process applications on heterogeneous clusters with GPUs.",
                    "On the efficacy of GPU-integrated MPI for scientific applications.",
                    "VGRIS: virtualized GPU resource isolation and scheduling in cloud gaming.",
                    "COSMIC: middleware for high performance and reliable multiprocessing on xeon phi coprocessors.",
                    "Interference and locality-aware task scheduling for MapReduce applications in virtual clusters.",
                    "A comparative study of high-performance computing on the cloud.",
                    "kMemvisor: flexible system wide memory mirroring in virtual environments."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2013ftxs",
                "sub_name": "Proceedings of the 3rd Workshop on Fault-tolerance for HPC at extreme scale, jointly held with the 22nd International Symposium on High-Performance Parallel and Distributed Computing, HPDC'13, New York, NY, USA, June 18, 2013.",
                "count": 9,
                "papers": [
                    "Toward resilient algorithms and applications.",
                    "Fault tolerance using lower fidelity data in adaptive mesh applications.",
                    "Circuits for resilient systems.",
                    "Neutron sensitivity and software hardening strategies for matrix multiplication and FFT on graphics processing units.",
                    "Using unreliable virtual hardware to inject errors in extreme-scale systems.",
                    "Fault detection in multi-core processors using chaotic maps.",
                    "Replication for send-deterministic MPI HPC applications.",
                    "Energy-aware I/O optimization for checkpoint and restart on a NAND flash memory system.",
                    "When is multi-version checkpointing needed?"
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2013ormacloud",
                "sub_name": "First ACM workshop on Optimization techniques for resources management in clouds - ORMaCloud '13, co-located with ACM HPDC 2013, New York, NY, USA, June 17, 2013. Proceedings.",
                "count": 5,
                "papers": [
                    "Meryn: open, SLA-driven, cloud bursting PaaS.",
                    "Smart cloud federation simulations with CloudSim.",
                    "Integrating acceleration devices using CometCloud.",
                    "Fast (re-)configuration of mixed on-demand and spot instance pools for high-throughput computing.",
                    "Analysis of control-theoretic predictive strategies for the adaptation of distributed parallel computations."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2013sciencecloud",
                "sub_name": "ScienceCloud'13, Proceedings of the 4th ACM HPDC Workshop on Scientific Cloud Computing, New York, NY, USA, June 17, 2013.",
                "count": 9,
                "papers": [
                    "Science as a service: how on-demand computing can accelerate discovery.",
                    "To cloud my big data or not to?: musings at the intersection of big data, intense computing and clouds.",
                    "Dimensioning the virtual cluster for parallel scientific workflows in clouds.",
                    "Performance evaluation of a MongoDB and hadoop platform for scientific data analysis.",
                    "Rebalancing in a multi-cloud environment.",
                    "StorkCloud: data transfer scheduling and optimization as a service.",
                    "VIDAS: object-based virtualized data sharing for high performance storage I/O.",
                    "HTC scientific computing in a distributed cloud environment.",
                    "High performance risk aggregation: addressing the data processing challenge the hadoop mapreduce way."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2013hppn",
                "sub_name": "Proceedings of the first edition workshop on High performance and programmable networking, HPPN@HPDC 2013, New York, New York, USA, June 18, 2013.",
                "count": 8,
                "papers": [
                    "Design and test of a software defined hybrid network architecture.",
                    "Optimal packet classification applicable tothe OpenFlow context.",
                    "Implementation of TCP large receive offload on open hardware platform.",
                    "Flexible, extensible, open-source and affordable FPGA-based traffic generator.",
                    "From 1G to 10G: code reuse in action.",
                    "Multi-gigabit traffic identification on GPU.",
                    "Evaluating MapReduce for profiling application traffic.",
                    "A supervised machine learning approach to classify host roles on line using sFlow."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "21st HPDC 2012",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2012",
                "sub_name": "The 21st International Symposium on High-Performance Parallel and Distributed Computing, HPDC'12, Delft, Netherlands - June 18 - 22, 2012.",
                "count": 32,
                "papers": [
                    "Putting a \"big-data\" platform to good use: training kinect.",
                    "vSlicer: latency-aware virtual machine scheduling via differentiated-frequency CPU slicing.",
                    "Singleton: system-wide page deduplication in virtual environments.",
                    "Locality-aware dynamic VM reconfiguration on MapReduce clouds.",
                    "Achieving application-centric performance targets via consolidation on multicores: myth or reality?",
                    "Enabling event tracing at leadership-class scale through I/O forwarding middleware.",
                    "ISOBAR hybrid compression-I/O interleaving for large-scale parallel I/O optimization.",
                    "QBox: guaranteeing I/O performance on black box storage systems.",
                    "A hybrid local storage transfer scheme for live migration of I/O intensive workloads.",
                    "A virtual memory based runtime to support multi-tenancy in clusters with GPUs.",
                    "Interference-driven resource management for GPU-based heterogeneous clusters.",
                    "Exploring the performance and mapping of HPC applications to platforms in the cloud.",
                    "Towards a common model for pilot-jobs.",
                    "A system-aware optimized data organization for efficient scientific analytics.",
                    "Dynamic binary rewriting and migration for shared-ISA asymmetric, multicore processors: summary.",
                    "Coupling scheduler for MapReduce/Hadoop.",
                    "Performance evaluation of interthread communicationmechanisms on multicore/multithreaded architectures.",
                    "Fault tolerant parallel data-intensive algorithms.",
                    "Leveraging renewable energy in data centers: present and future.",
                    "Work stealing and persistence-based load balancers for iterative overdecomposed applications.",
                    "Highly scalable graph search for the Graph500 benchmark.",
                    "PonD: dynamic creation of HTC pool on demand using a decentralized resource discovery system.",
                    "SpeQuloS: a QoS service for BoT applications using best effort distributed computing infrastructures.",
                    "Understanding the effects and implications of compute node related failures in hadoop.",
                    "Optimizing MapReduce for GPUs with effective shared memory usage.",
                    "CAM: a topology aware minimum cost flow based resource manager for MapReduce applications in the cloud.",
                    "Distributed approximate spectral clustering for large-scale datasets.",
                    "Exploring cross-layer power management for PGAS applications on the SCC platform.",
                    "Dynamic adaptive virtual core mapping to improve power, energy, and performance in multi-socket multicores.",
                    "VNET/P: bridging the cloud and high performance computing through fast overlay networking.",
                    "Massively-parallel stream processing under QoS constraints with Nephele.",
                    "A resiliency model for high performance infrastructure based on logical encapsulation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "20th HPDC 2011",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2011",
                "sub_name": "Proceedings of the 20th ACM International Symposium on High Performance Distributed Computing, HPDC 2011, San Jose, CA, USA, June 8-11, 2011.",
                "count": 34,
                "papers": [
                    "Exascale opportunities and challenges.",
                    "Juggle: proactive load balancing on multicore computers.",
                    "Cache injection for parallel applications.",
                    "Just in time: adding value to the IO pipelines of high performance applications with JITStaging.",
                    "A cost-intelligent application-specific data layout scheme for parallel file systems.",
                    "Six degrees of scientific data: reading patterns for extreme scale science IO.",
                    "Introspective end-system modeling to optimize the transfer time of rate based protocols.",
                    "Algorithm-based recovery for iterative methods without checkpointing.",
                    "Vrisha: using scaling properties of parallel programs for bug detection and localization.",
                    "InContext: simple parallelism for distributed applications.",
                    "Energy-efficient E-puting everywhere.",
                    "Towards a profound analysis of bags-of-tasks in parallel systems and their performance impact.",
                    "Incremental placement of interactive perception applications.",
                    "Live gang migration of virtual machines.",
                    "Going back and forth: efficient multideployment and multisnapshotting on clouds.",
                    "VMFlock: virtual machine co-migration for the cloud.",
                    "Performance and energy modeling for live migration of virtual machines.",
                    "Experiences with self-organizing, decentralized grids using the grid appliance.",
                    "Experience of parallelizing cryo-EM 3D reconstruction on a CPU-GPU heterogeneous system.",
                    "Experiences using smaash to manage data-intensive simulations.",
                    "Supporting GPU sharing in cloud environments with a transparent runtime consolidation framework.",
                    "Tradeoffs Between Profit and Customer Satisfaction for Service Provisioning in the Cloud.",
                    "Dynamic adaptive scheduling for virtual machines.",
                    "Enhancement of Xen's scheduler for MapReduce workloads.",
                    "Adapting MapReduce for HPC environments.",
                    "HyFlow: a high performance distributed software transactional memory framework.",
                    "ClusterSs: a task-based programming model for clusters.",
                    "Design space exploration for aggressive core replication schemes in CMPs.",
                    "Capping the electricity cost of cloud-scale data centers with impacts on power markets.",
                    "Interactivity on the grid: limitations and opportunities.",
                    "Exclusive squashing for thread-level speculation.",
                    "Wrangler: virtual cluster provisioning for the cloud.",
                    "A distributed look-up architecture for text mining applications using mapreduce.",
                    "Software-directed data access scheduling for reducing disk energy consumption."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "19th HPDC 2010",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2010",
                "sub_name": "Proceedings of the 19th ACM International Symposium on High Performance Distributed Computing, HPDC 2010, Chicago, Illinois, USA, June 21-25, 2010.",
                "count": 106,
                "papers": [
                    "Horizon: efficient deadline-driven disk I/O management for distributed storage systems.",
                    "Run-time optimizations for replicated dataflows on heterogeneous environments.",
                    "DataSpaces: an interaction and coordination framework for coupled simulation workflows.",
                    "ParaTrac: a fine-grained profiler for data-intensive workflows.",
                    "Performance analysis of dynamic workflow scheduling in multicluster grids.",
                    "Software architecture definition for on-demand cloud provisioning.",
                    "High occupancy resource allocation for grid and cloud systems, a study with DRIVE.",
                    "Highly available component sharing in large-scale multi-tenant cloud systems.",
                    "MOON: MapReduce On Opportunistic eNvironments.",
                    "MRAP: a novel MapReduce-based framework to support HPC analytics applications with access patterns.",
                    "Data centric highly parallel debugging.",
                    "Thermal aware server provisioning and workload distribution for internet data centers.",
                    "I/O scheduling model of virtual machine based on multi-core dynamic partitioning.",
                    "A practical way to extend shared memory support beyond a motherboard at low cost.",
                    "A GPU accelerated storage system.",
                    "Computation mapping for multi-level storage cache hierarchies.",
                    "Cashing in on hints for better prefetching and caching in PVFS and MPI-IO.",
                    "Dimension reduction and visualization of large high-dimensional data via interpolation.",
                    "New caching techniques for web search engines.",
                    "Mendel: efficiently verifying the lineage of data modified in multiple trust domains.",
                    "PV-EASY: a strict fairness guaranteed and prediction enabled scheduler in parallel job scheduling.",
                    "XCo: explicit coordination to prevent network fabric congestion in cloud computing cluster platforms.",
                    "Scalability of communicators and groups in MPI.",
                    "Impact of sub-optimal checkpoint intervals on application efficiency in computational clusters.",
                    "OpenGL application live migration with GPU acceleration in personal cloud.",
                    "A service composition framework for market-oriented high performance computing cloud.",
                    "GPU-based parallel householder bidiagonalization.",
                    "Authorization within grid-computing using certificateless identity-based proxy signature.",
                    "A global address space framework for irregular applications.",
                    "Improving host swapping using adaptive prefetching and paging notifier.",
                    "Resource provisioning with budget constraints for adaptive applications in cloud environments.",
                    "SoftPower: fine-grain power estimations using performance counters.",
                    "Simultaneous performance exploration and optimized search with volunteer computing.",
                    "Lessons learned from moving earth system grid data sets over a 20 Gbps wide-area network.",
                    "Towards energy-aware autonomic provisioning for virtualized environments.",
                    "Distributing the power of OLAP.",
                    "Morco: middleware framework for long-running multi-component applications on batch grids.",
                    "Lightning: self-adaptive, energy-conserving, multi-zoned, commodity green cloud storage system.",
                    "Early defense: enabling attribute-based authorization in Grid firewalls.",
                    "Design and evaluation of a self-healing Kepler for scientific workflows.",
                    "ParaText: scalable text modeling and analysis.",
                    "DiscFinder: a data-intensive scalable cluster finder for astrophysics.",
                    "Improving MPI communication via data type fission.",
                    "Pwrake: a parallel and distributed flexible workflow management tool for wide-area data intensive computing.",
                    "A layout-aware optimization strategy for collective I/O.",
                    "Early observations on the performance of Windows Azure.",
                    "An overview of the Open Science Data Cloud.",
                    "Providing a cloud network infrastructure on a supercomputer.",
                    "Case study for running HPC applications in public clouds.",
                    "Exploring application and infrastructure adaptation on hybrid grid-cloud infrastructure.",
                    "AzureBlast: a case study of developing science applications on the cloud.",
                    "Seeking supernovae in the clouds: a performance study.",
                    "Migrating a (large) science database to the cloud.",
                    "Reshaping text data for efficient processing on Amazon EC2.",
                    "Comparison of resource platform selection approaches for scientific workflows.",
                    "A perspective on scientific cloud computing.",
                    "Cloud computing paradigms for pleasingly parallel biomedical applications.",
                    "MPIPairwiseStatSig: parallel pairwise statistical significance estimation of local sequence alignment.",
                    "Exploring the RNA folding energy landscape using scalable distributed cyberinfrastructure.",
                    "Biocompute: towards a collaborative workspace for data intensive bio-science.",
                    "Modeling sequence and function similarity between proteins for protein functional annotation.",
                    "Browsing large scale cheminformatics data with dimension reduction.",
                    "Data parallelism in bioinformatics workflows using Hydra.",
                    "Optimization of a parallel permutation testing function for the SPRINT R package.",
                    "Text mining for bone biology.",
                    "CUDA-based triangulations of convolution molecular surfaces.",
                    "Optimal enterprise data architecture using publish and subscribe.",
                    "The development of QC standards for ARM data products.",
                    "A quality screening service for remote sensing data.",
                    "Monitoring data quality in Kepler.",
                    "Towards long term data quality in a large scale biometrics experiment.",
                    "Netlag: a performance evaluation tool for massively multi-user networked applications.",
                    "BTWorld: towards observing the global BitTorrent file-sharing network.",
                    "A hybrid Markov chain model for workload on parallel computers.",
                    "LogGOPSim: simulating large-scale applications in the LogGOPS model.",
                    "Fast and scalable simulation of volunteer computing systems using SimGrid.",
                    "Efficient querying of distributed provenance stores.",
                    "SAGA-based file access application over multi-filesystem middleware.",
                    "Toward high performance computing in unconventional computing environments.",
                    "Weaver: integrating distributed computing abstractions into scientific workflows using Python.",
                    "A distributed workflow for an astrophysical OpenMP application: using the data capacitor over WAN to enhance productivity.",
                    "Design, implementation and use of a simulation data archive for coastal science.",
                    "Cluster-wide context switch of virtualized jobs.",
                    "Pools of virtual boxes: building campus grids with virtual machines.",
                    "Janus: a cross-layer soft real-time architecture for virtualization.",
                    "DistriBit: a distributed dynamic binary translator system for thin client computing.",
                    "Scaling virtual organization clusters over a wide area network using the Kestrel workload management system.",
                    "Storage deduplication for Virtual Ad Hoc Network testbed by File-level Block Sharing.",
                    "Characterising a grid site's traffic.",
                    "A data transfer framework for large-scale science experiments.",
                    "Towards optimising distributed data streaming graphs using parallel streams.",
                    "Detouring and replication for fast and reliable internet-scale stream processing.",
                    "File-access patterns of data-intensive workflow applications and their implications to distributed filesystems.",
                    "Versioning for workflow evolution.",
                    "ROARS: a scalable repository for data intensive scientific computing.",
                    "GatorShare: a file system framework for high-throughput data management.",
                    "Parallel processing of data from very large-scale wireless sensor networks.",
                    "Massive Semantic Web data compression with MapReduce.",
                    "Very large pattern databases for heuristic search.",
                    "Twister: a runtime for iterative MapReduce.",
                    "Pydoop: a Python MapReduce and HDFS API for Hadoop.",
                    "Pairwise Element Computation with MapReduce.",
                    "Improving the Hadoop map/reduce framework to support concurrent appends through the BlobSeer BLOB management system.",
                    "Multi-GPU volume rendering using MapReduce.",
                    "MR-scope: a real-time tracing tool for MapReduce.",
                    "Parallelizing multiple group-by query in share-nothing environment: a MapReduce study case."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "18th HPDC 2009",
        "info": "Garching, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2009",
                "sub_name": "Proceedings of the 18th ACM International Symposium on High Performance Distributed Computing, HPDC 2009, Garching, Germany, June 11-13, 2009.",
                "count": 27,
                "papers": [
                    "Harnessing parallelism in multicore clusters with the all-pairs and wavefront abstractions.",
                    "Pluggable parallelisation.",
                    "Performance enhancement with speculative execution based parallelism for processing large-scale xml-based application data.",
                    "Y-lib: a user level library to increase the performance of MPI-IO in a lustre file system environment.",
                    "DataStager: scalable data staging services for petascale applications.",
                    "Interconnect agnostic checkpoint/restart in open MPI.",
                    "Maintaining reference graphs of globally accessible objects in fully decentralized distributed systems.",
                    "Adaptive run-time prediction in heterogeneous environments.",
                    "Performance prediction based on hierarchy parallel features captured in multi-processing system.",
                    "CLOUDLET: towards mapreduce implementation on virtual machines.",
                    "Investigating transactional memory performance on ccNUMA machines.",
                    "Sustainable HPC infrastructures - supercomputers, grids, and clouds: the DEISA experience.",
                    "An adaptive online system for efficient processing of hierarchical data.",
                    "High performance wide-area overlay using deadlock-free routing.",
                    "TakTuk, adaptive deployment of remote executions.",
                    "Live migration of virtual machine based on full system trace and replay.",
                    "Trace-based evaluation of job runtime and queue wait time predictions in grids.",
                    "Modeling user submission strategies on production grids.",
                    "Resource co-allocation for large-scale distributed environments.",
                    "Evaluating the cost-benefit of using cloud computing to extend the capacity of clusters.",
                    "Model-guided autotuning of high-productivity languages for petascale computing.",
                    "A novel graph based approach for automatic composition of high quality grid workflows.",
                    "An integrated framework for performance-based optimization of scientific workflows.",
                    "Maestro: a self-organizing peer-to-peer dataflow framework using reinforcement learning.",
                    "Collaborative query coordination in community-driven data grids.",
                    "The quest for scalable support of data-intensive workloads in distributed systems.",
                    "Exploring data reliability tradeoffs in replicated storage systems."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2009upgrade",
                "sub_name": "Proceedings of the 4th Workshop on the Use of P2P, GRID and Agents for the Development of Content Networks, UPGRADE-CN'09, jointly held with the 18th International Symposium on High-Performance Distributed Computing (HPDC-18 2009), 10 June 2009, Garching near Munich, Germany.",
                "count": 8,
                "papers": [
                    "The role of virtual organizations in grids: impacts and challenges.",
                    "Distributed architectures for surrogate clustering in CDNs: a simulation-based analysis.",
                    "Evaluating the utility of content delivery networks.",
                    "Automatic titling for international sporting events.",
                    "Multicast congestion control for content distribution.",
                    "IPTV distribution network access system using WiMAX and WLAN technologies.",
                    "Disaster recovery mechanism using widely distributed networking and secure metadata handling technology.",
                    "Next generation content networks: trends and challenges."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "17th HPDC 2008",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2008",
                "sub_name": "Proceedings of the 17th International Symposium on High-Performance Distributed Computing (HPDC-17 2008), 23-27 June 2008, Boston, MA, USA.",
                "count": 35,
                "papers": [
                    "FaTLease: scalable fault-tolerant lease negotiation with paxos.",
                    "Securing stateful grid servers through virtual server rotation.",
                    "Performability modeling for scheduling and fault tolerance strategies for scientific workflows.",
                    "Evaluating the usefulness of content addressable storage for high-performance data intensive applications.",
                    "File grouping for scientific data management: lessons from experimenting with real traces.",
                    "Eliminating the middleman: peer-to-peer dataflow.",
                    "Scheduling mixed-parallel applications with advance reservations.",
                    "VARQ: virtual advance reservations for queues.",
                    "Combining batch execution and leasing using virtual machines.",
                    "The performance of bags-of-tasks in large-scale distributed systems.",
                    "XenLoop: a transparent high performance inter-vm network loopback.",
                    "Vpm tokens: virtual machine-aware power budgeting in datacenters.",
                    "Improving peer connectivity in wide-area overlays of virtual workstations.",
                    "The impact of paravirtualized memory hierarchy on linear algebra computational kernels and software.",
                    "Toward automatic parallelization of spatial computation for computing clusters.",
                    "StoreGPU: exploiting graphics processing units to accelerate distributed storage systems.",
                    "Semantic-based distributed i/o with the paramedic framework.",
                    "FARMER: a novel approach to file access correlation mining and evaluation reference model for optimizing peta-scale file system performance.",
                    "Harmony: an execution model and runtime for heterogeneous many core systems.",
                    "Facilitating the deployment of ad-hoc virtual organizations with integrated social and overlay networks.",
                    "Ontological framework for a free-form query based grid search engine.",
                    "An unstructured peer-to-peer approach to aggregate node selection.",
                    "enabling cross-layer optimizations in storage systems with custom metadata.",
                    "Managing SLAs of heterogeneous workloads using dynamic application placement.",
                    "DART: a substrate for high speed asynchronous data IO.",
                    "Resource tracking in parallel and distributed applications.",
                    "Code coverage, performance approximation and automatic recognition of idioms in scientific applications.",
                    "Multi-hop path splitting and multi-pathing optimizations for data transfers over shared wide-area networks using gridFTP.",
                    "Collaborative ranking of grid-enabled workflow service providers.",
                    "Distributed mpi cross-site run performance using mpig.",
                    "A two-level scheduler to dynamically schedule a stream of batch jobs in large-scale grids.",
                    "DataLab: transactional data-parallel computing on an active storage cloud.",
                    "Key-based consistency and availability in structured overlay networks.",
                    "Dynasa: adapting grid applications to safety using fault-tolerant methods.",
                    "Issues in applying data mining to grid job failure detection and diagnosis."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2008upgrade",
                "sub_name": "Proceedings of the 3rd Workshop on the Use of P2P, GRID and Agents for the Development of Content Networks, UPGRADE-CN'08, jointly held with the 17th International Symposium on High-Performance Distributed Computing (HPDC-17 2008), 23 June 2008, Boston, MA, USA.",
                "count": 11,
                "papers": [
                    "Autonomics for grid systems and applications.",
                    "GRIDSAN: an available dynamic grid system for ad hoc networks.",
                    "A grid-based architecture for nearest neighbor based condensation of huge datasets.",
                    "A globus toolkit 4 based instrument service for environmental data acquisition and distribution.",
                    "A social framework for content distribution in mobile transient networks.",
                    "A group-based content delivery network.",
                    "Self-organized customized content delivery architecture for ambient assisted environments.",
                    "A content distribution network deployment over WLANs for fire detection in rural environments.",
                    "Distributing and managing data on desktop grids with BitDew.",
                    "Advanced semantic search and retrieval in a collaborative peer-to-peer system.",
                    "Synchronization of CDN-based collaborative playbacks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "16th HPDC 2007",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2007",
                "sub_name": "Proceedings of the 16th International Symposium on High-Performance Distributed Computing (HPDC-16 2007), 25-29 June 2007, Monterey, California, USA.",
                "count": 38,
                "papers": [
                    "Smartsockets: solving the connectivity problems in grid computing.",
                    "A fast topology inference: a building block for network-aware parallel processing.",
                    "Transparent network services via a virtual traffic layer for virtual machines.",
                    "Failure-aware checkpointing in fine-grained cycle sharing systems.",
                    "Using queue structures to improve job reliability.",
                    "Ridge: combining reliability and performance in open grid platforms.",
                    "Cooperative secondary authorization recycling.",
                    "Charisma: orchestrating migratable parallel objects.",
                    "A statistical approach to risk mitigation in computational markets.",
                    "Feedback-directed thread scheduling with memory considerations.",
                    "Precise and realistic utility functions for user-centric performance analysis of schedulers.",
                    "A provisioning model and its comparison with best-effort for performance-cost optimization in grids.",
                    "Data driven workflow planning in cluster management systems.",
                    "Partial content distribution on high performance networks.",
                    "ARRG: real-world gossiping.",
                    "MOB: zero-configuration high-throughput multicasting for grid applications.",
                    "An efficient MPI_allgather for grids.",
                    "High performance and scalable I/O virtualization via self-virtualized devices.",
                    "Using content-addressable networks for load balancing in desktop grids.",
                    "Direct-pNFS: scalable, transparent, and versatile access to parallel file systems.",
                    "Environmentally responsible middleware: : an altruistic behavior model for distributed middleware components.",
                    "Peer-to-peer checkpointing arrangement for mobile grid computing systems.",
                    "CCALoop: scalable design of a distributed component framework.",
                    "Evaluating the impacts of network information models on applications and network service providers.",
                    "Towards adaptive, scalable, and reliable resource provisioning for wsrf-compliant applications.",
                    "Scaling multiplayer online games using proxy-server replication: a case study of Quake 2.",
                    "PeerStripe: a p2p-based large-file storage for desktop grids.",
                    "IDEA: : an infrastructure for detection-based adaptive consistency control in replicated services.",
                    "Concepts and components of full-system simulation of distributed memory parallel computers.",
                    "LIVE: : a light-weight data workspace for computational science.",
                    "A computational infrastructure for grid-based asynchronous parallel applications.",
                    "Security and dynamics in customer controlled virtual workspace organisation.",
                    "Generating grid resource requirement specifications.",
                    "Scalable, fault-tolerant management in a service oriented architecture.",
                    "A proxy-based uncoordinated checkpointing scheme with pessimistic message logging for mobile grid systems.",
                    "Fault-tolerant scheduling for differentiated classes of tasks with low replication cost in computational grids.",
                    "Measurement of a large-scale overlay for multimedia streaming.",
                    "Task-specific restricted delegation."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2007upgrade",
                "sub_name": "Proceedings of the 2nd Workshop on the Use of P2P, GRID and Agents for the Development of Content Networks, UPGRADE-CN'07, jointly held with the 16th International Symposium on High-Performance Distributed Computing (HPDC-16 2007), 26 June 2007, Monterey, California, USA.",
                "count": 12,
                "papers": [
                    "Multiple co-existing grouping overlays.",
                    "A topology-aware hierarchical structured overlay network based on locality sensitive hashing scheme.",
                    "Efficient simulation of large-scale p2p networks: packet-level vs. flow-level simulations.",
                    "Data consistency in a p2p knowledge management platform.",
                    "How CN and P2P technologies may help build next-generation grids.",
                    "An architecture for virtual organization (VO)-based effective peering of content delivery networks.",
                    "Scheduling data-intensive bags of tasks in P2P grids with bittorrent-enabled data distribution.",
                    "Semantic extraction and adaptive delivery of multimedia contents for the cultural assets.",
                    "A grid-based infrastructure to support multimedia content distribution.",
                    "Content-based mining for solving geoprocessing problems on grids.",
                    "Towards an agent-based grid platform 1st episode: the meta-grid.",
                    "Using grid computing based components in on demand environmental data delivery."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2007gmw",
                "sub_name": "Proceedings of the 2007 workshop on Grid monitoring, GMW@HPDC 2007, Monterey, California, USA, June 25, 2007.",
                "count": 7,
                "papers": [
                    "Recent evolutions of GridICE: a monitoring tool for grid systems.",
                    "Global grid monitoring: the EGEE/WLCG case.",
                    "A uniform job monitoring service in multiple job universes.",
                    "Grid infrastructure monitoring system based on Nagios.",
                    "User-level grid monitoring with Inca 2.",
                    "Monitoring, accounting and automated decision support for the alice experiment based on the MonALISA framework.",
                    "Experiment Dashboard: the monitoring system for the LHC experiments."
                ]
            },
            {
                "sub_name_abbr": "conf/hpdc/2007socp",
                "sub_name": "Proceedings of the 2007 workshop on Service-oriented computing performance: aspects, issues, and approaches, SOCP@HPDC 2007, Monterey, California, USA, June 25, 2007.",
                "count": 10,
                "papers": [
                    "A QoS-based selection approach of autonomic grid services.",
                    "McGrid: framework for optimizing grid middleware on multi-core processors.",
                    "Approaching a parallelized XML parser optimized for multi-coreprocessors.",
                    "Benefits of alternate XML serialization formats in scientific computing.",
                    "Parallel XML processing by work stealing.",
                    "Comparing semantic registries: OWLJessKB and InstanceStore.",
                    "SISC: providing efficient XML-based service-orientation for core OS functionality.",
                    "Empowering distributed workflow with the data capacitor: maximizing lustre performance across the wide area network.",
                    "Data transfer performance issues for a web services interface to synchrotron experiments.",
                    "Comparing the use of bayesian networks and neural networks in response time modeling for service-oriented systems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "15th HPDC 2006",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2006",
                "sub_name": "Proceedings of the 15th IEEE International Symposium on High Performance Distributed Computing, HPDC-15, Paris, France, June 19-23, 2006.",
                "count": 59,
                "papers": [
                    "Keynote The Renaissance of Decentralized Systems.",
                    "Peer to peer size estimation in large and dynamic networks: A comparative study.",
                    "IQ-Paths: Predictably High Performance Data Streams across Dynamic Network Overlays.",
                    "WOW: Self-Organizing Wide Area Overlay Networks of Virtual Workstations.",
                    "A Case Study Using Automatic Performance Tuning for Large-Scale Scientific Programs.",
                    "Path Grammar Guided Trace Compression and Trace Approximation.",
                    "Filecules in High-Energy Physics: Characteristics and Impact on Resource Management.",
                    "Fault Tolerance of Tornado Codes for Archival Storage.",
                    "Resource Availability Prediction in Fine-Grained Cycle Sharing Systems.",
                    "Replicating Nondeterministic Services on Grid Environments.",
                    "Service contracts and aggregate utility functions.",
                    "Market-Based Resource Allocation using Price Prediction in a High Performance Computing Grid for Scientific Applications.",
                    "Optimal Bandwidth Sharing in Grid Environments.",
                    "A Tool for Prioritizing DAGMan Jobs and Its Evaluation.",
                    "Motor: A Virtual Machine for High Performance Computing.",
                    "Runtime Support for Memory Adaptation in Scientific Applications via Local Disk and Remote Memory.",
                    "Building a Generic SOAP Framework over Binary XML.",
                    "Improving I/O Performance of Clustered Storage Systems by Adaptive Request Distribution.",
                    "Improving the Performance of Remote I/O Using Asynchronous Primitives.",
                    "Exploring I/O Strategies for Parallel Sequence-Search Tools with S3aSim.",
                    "Task Scheduling and File Replication for Data-Intensive Jobs with Batch-shared I/O.",
                    "On the Harmfulness of Redundant Batch Requests.",
                    "How to avoid herd: a novel stochastic algorithm in grid scheduling.",
                    "ALPS: An Application-Level Proportional-Share Scheduler.",
                    "Scheduling Mixed Workloads in Multi-grids: The Grid Execution Hierarchy.",
                    "Data Mining-based Fault Prediction and Detection on the Grid.",
                    "Troubleshooting Distributed Systems via Data Mining.",
                    "Policy Driven Virtual Machine Monitor for Protected Grids.",
                    "Autonomic Adaptation of Virtual Distributed Environments in a Multi-Domain Infrastructure.",
                    "Materializing Highly Available Grids.",
                    "Toward Self Organizing Grids.",
                    "Performance and Practicability of Dynamic Adaptation for Parallel Computing.",
                    "Efficient services composition for grid-enabled data-intensive applications.",
                    "Ensuring numerical quality in grid computing.",
                    "Summary: Integration of Legacy Grid Systems with Emerging Grid Standards.",
                    "How should you structure your hierarchical scheduler?",
                    "Robust Resource Allocation for Large-scale Distributed Shared Resource Environments.",
                    "Adaptive I/O Scheduling for Distributed Multi-applications Environments.",
                    "Short Paper : Dynamic Optimization of Communications over High Speed Networks.",
                    "Cooperative Caching in the pCFS parallel Cluster File System.",
                    "PetaCache: A memory-Based Data-Server System.",
                    "A High Throughput Approach to Combinatorial Search on Grids.",
                    "Is Unmetered, Scalable Computation Worth the Price?",
                    "Geometrical Interpretation for Data partitioning on a Grid Architecture.",
                    "XtremLab: A System for Characterizing Internet Desktop Grids.",
                    "Effective Prediction of Job Processing Times in a Large-Scale Grid Environment.",
                    "When Jobs Play Nice: The Case For Symbiotic Space-Sharing.",
                    "PARM: Physics Aware Runtime Manager for Large-scale Scientific and Engineering Applications.",
                    "Using File Grouping to Improve the Disk Performance (Extended Abstract).",
                    "Improving Resource Matching Through Estimation of Actual Job Requirements.",
                    "Bob++: Framework for Solving Optimization Problems with Branch-and-Bound methods.",
                    "An Implementation of the Message Passing Interface over an Adaptive Peer-to-Peer Network.",
                    "Multidimensional Replica Selection in the Data Grid.",
                    "Short Paper: Asynchronous programming with Tarragon.",
                    "Toward a New Direction on Data Management in Grids.",
                    "PROOF - The Parallel ROOT Facility.",
                    "Dynamic Programming Based Approach for Bi-criteria Workflow Scheduling on the Grid.",
                    "RENATER dark fibre project architecture.",
                    "The SIMGRID Project Simulation and Deployment of Distributed Applications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "14th HPDC 2005",
        "info": "Research Triangle Park, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2005",
                "sub_name": "Proceedings of the 14th IEEE International Symposium on High Performance Distributed Computing, HPDC-14, Research Triangle Park, North Carolina, USA, 24-27 July 2005.",
                "count": 46,
                "papers": [
                    "State and events for Web services: a comparison of five WS-resource framework and WS-notification implementations.",
                    "The impact of Web service integration on grid performance.",
                    "Supporting application-tailored grid file system sessions with WSRF-based services.",
                    "Building self-adapting services using service-specific knowledge.",
                    "Increasing application performance in virtual environments through run-time inference and adaptation.",
                    "Enabling self-management of component-based high-performance scientific applications.",
                    "Autonomic runtime manager for adaptive distributed applications.",
                    "Collective caching: application-aware client-side file caching.",
                    "Performance analysis of a file catalog for the LHC computing grid.",
                    "Cluster delegation: high-performance, fault-tolerant data sharing in NFS.",
                    "Design and implementation tradeoffs for wide-area resource discovery.",
                    "Scheduling strategies for mapping application workflows onto the grid.",
                    "A new metric for robustness with application to job scheduling.",
                    "Assessment and enhancement of meta-schedulers for multi-site job sharing.",
                    "Dynamic load balancing for distributed search.",
                    "Interest-aware information dissemination in small-world communities.",
                    "Lerna: an active storage framework for flexible data access and management.",
                    "Generosity and gluttony in GEMS: grid enabled molecular simulations.",
                    "Recording and using provenance in a protein compressibility experiment.",
                    "411 on scalable password service.",
                    "GWiQ-P: an efficient decentralized grid-wide quota enforcement protocol.",
                    "CODO: firewall traversal by cooperative on-demand opening.",
                    "A streaming validation model for SOAP digital signature.",
                    "Automatic dynamic run-time optical network reservations.",
                    "Adaptive data block scheduling for parallel TCP streams.",
                    "Calana: a general-purpose agent-based grid scheduler.",
                    "Distributed application management using Plush.",
                    "Calder: enabling grid access to data streams.",
                    "Design and evaluation of a new and effective fairness scheme for multicasting in Internet-scale distributed systems.",
                    "The MarineGrid project in Ireland.",
                    "Genetic algorithm based automatic data partitioning scheme for HPF.",
                    "GRIDL: high-performance and distributed interactive data language.",
                    "Towards P2P-routed IF overlay networks for grid virtual machines.",
                    "A model for cooperative federation of distributed clusters.",
                    "DHT overlay schemes for scalable p-range resource discovery.",
                    "Identity boxing: secure user-level containment for the grid.",
                    "A case study of instant workbench for InterProScan by Knoppix high throughput computing edition.",
                    "Techniques for tuning workflows in cluster environments.",
                    "HMPI - hybrid MPI.",
                    "The resource oriented authorization manager (ROAM).",
                    "Cost-based scheduling for data-intensive applications on global grids.",
                    "In-VIGO virtual networks and virtual application services: automated grid-enabling and deployment of applications.",
                    "Towards a workflow-aware distributed versioning file system for metacomputing systems.",
                    "Distributed streaming query planner in Calder system.",
                    "A framework for efficient inconsistency detection in a grid and Internet-scale distributed environment.",
                    "The University of Bristol grid, a production campus grid."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "13th HPDC 2004",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2004",
                "sub_name": "13th International Symposium on High-Performance Distributed Computing (HPDC-13 2004), 4-6 June 2004, Honolulu, Hawaii, USA.",
                "count": 36,
                "papers": [
                    "Strategies for Using Additional Resources in Parallel Hash-Based Join Algorithms.",
                    "Distributed Hybrid Earthquake Engineering Experiments: Experiences with a Ground-Shaking Grid Application.",
                    "An Approach for Automatic Data Virtualization.",
                    "Automated Cluster-Based Web Service Performance Tuning.",
                    "Building Self-Configuring Services Using Service-Specific Knowledge.",
                    "Differential Serialization for Optimized SOAP Performance.",
                    "An Empirical Study of the Multiscale Predictability of Network Traffic.",
                    "Using Passive Traces of Application Traffic in a Network Monitoring System.",
                    "Evaluation of Rate-Based Transport Protocols for Lambda-Grids.",
                    "Wide-Area Communication for Grids: An Integrated Solution to Connectivity, Performance and Security Problems.",
                    "SpiderNet: An Integrated Peer-to-Peer Service Composition Framework.",
                    "FPN: A Distributed Hash Table for Commercial Applications.",
                    "Discouraging Free Riding in a Peer-to-Peer CPU-Sharing Grid.",
                    "Achieving Performance Consistency in Heterogeneous Clusters.",
                    "Optimal Resource-Aware Deployment Planning for Component-Based Distributed Applications.",
                    "Balancing Risk and Reward in a Market-Based Task Service.",
                    "Evaluation of Distributed Recovery in Large-Scale Storage Systems.",
                    "Performance and Scalability of a Replica Location Service.",
                    "GATES: A Grid-Based Middleware for Processing Distributed Data Streams.",
                    "Distributed File System Support for Virtual Machines in Grid Computing.",
                    "Measuring and Understanding User Comfort With Resource Borrowing.",
                    "Privacy-Preserving Data Mining on Data Grids in the Presence of Malicious Participants.",
                    "The Grid2003 Production Grid: Principles and Practice.",
                    "Globus and PlanetLab Resource Management Solutions Compared.",
                    "WS-ResourceFramework on .NET.",
                    "Performance Evaluation of Rate-Based Join Window Sizing for Asynchronous Data Streams.",
                    "Gridflow Description, Query, and Execution at SCEC using the SDSC Matrix.",
                    "Utilization of a Local Grid of Mac OS X-Based Computers using Xgrid.",
                    "SPURport.",
                    "Showcasing the Features and Capabilities of NEESgrid: A Grid Based System for the Earthquake Engineering Domain.",
                    "Orchestrating and Coordinating Scientific/Engineering Workflows using GridShell.",
                    "Grid Portal Toolkit 3.0 (GridPort).",
                    "UT Grid: A Comprehensive Campus Cyberinfrastructure.",
                    "GAIS: Grid Advanced Information Service based on P2P Mechanism.",
                    "GRASP: A Grid Resource Allocation System based on OGSA.",
                    "MPI Ruby with Remote Memory Access."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "12th HPDC 2003",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2003",
                "sub_name": "12th International Symposium on High-Performance Distributed Computing (HPDC-12 2003), 22-24 June 2003, Seattle, WA, USA.",
                "count": 25,
                "papers": [
                    "Zero-Copy for CORBA - Efficient Communication for Distributed Object Middleware.",
                    "Optimizing GridFTP through Dynamic Right-Sizing.",
                    "Impact of High Performance Sockets on Data Intensive Applications.",
                    "Performance Analysis of Scheduling and Replication Algorithms on Grid Datafarm Architecture for High-Energy Physics Applications.",
                    "Security for Grid Services.",
                    "Distributed Pagerank for P2P Systems.",
                    "Trace-Based Simulations of Processor Co-Allocation Policies in Multiclusters.",
                    "Policy Driven Heterogeneous Resource Co-Allocation with Gangmatching.",
                    "Dynamic Virtual Clusters in a Grid Site Manager.",
                    "Policies for Swapping MPI Processes.",
                    "RUMR: Robust Scheduling for Divisible Workloads.",
                    "GridWorkflow: A Flexible Failure Handling Framework for the Grid.",
                    "The Ethernet Approach to Grid Computing.",
                    "Pipeline and Batch Sharing in Grid Workloads.",
                    "Quelling Queue Storms.",
                    "SODA: A Service-On-Demand Architecture for Application Service Hosting Utility Platforms.",
                    "An Environment for Enabling Interactive Grids.",
                    "Using Views for Customizing Reusable Components in Component-Based Frameworks.",
                    "QoS-Aware Middleware for Cluster-Based Servers to support Interactive and Resource-Adaptive Applications.",
                    "XenoSearch: Distributed Resource Discovery in the XenoServer Open Platform.",
                    "Flexible Information Discovery in Decentralized Distributed Systems.",
                    "PlanetP: Using Gossiping to Build Content Addressable Peer-to-Peer Information Sharing Communities.",
                    "Resource-Aware Stream Management with the Customizable dproc Distributed Monitoring Mechanisms.",
                    "Adaptive Polling of Grid Resource Monitors Using a Slacker Coherence Model.",
                    "A Performance Study of Monitoring and Information Services for Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "11th HPDC 2002",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2002",
                "sub_name": "11th IEEE International Symposium on High Performance Distributed Computing (HPDC-11 2002), 23-26 July 2002, Edinburgh, Scotland, UK.",
                "count": 55,
                "papers": [
                    "Flexibility, Manageability, and Performance in a Grid Storage Appliance.",
                    "Distributed Computing with Load-Managed Active Storage.",
                    "A Decentralized, Adaptive Replica Location Mechanism.",
                    "Adaptive Timeout Discovery Using the Network Weather Service.",
                    "Dynamic Right-Sizing in FTP (drsFTP): Enhancing Grid Performance in User-Space.",
                    "QoS-Based Resource Discovery in Intermittently Available Environments.",
                    "Design and Evaluation of a Resource Selection Framework for Grid Applications.",
                    "A Scalable QoS-Aware Service Aggregation Model for Peer-to-Peer Computing Grids.",
                    "An Enterprise-Based Grid Resource Management System.",
                    "Interactive and Descriptor-Based Deployment of Object-Oriented Grid Applications.",
                    "Partitionable Services: A Framework for Seamlessly Adapting Distributed Applications to Heterogeneous Environments.",
                    "Lightweight Self-Organizing Frameworks for Metacomputing.",
                    "Using Kernel Couplings to Predict Parallel Application Performance.",
                    "Using Semantic Information to Guide Efficient Parallel I/O on Clusters.",
                    "Multigrain Parallelism for Eigenvalue Computations on Networks of Clusters.",
                    "Backtracking and Re-Execution in the Automatic Debugging of Parallelized Programs.",
                    "Dynamic Monitoring of High-Performance Distributed Applications.",
                    "Leveraging Run Time Knowledge about Event Rates to Improve Memory Utilization in Wide Area Data Stream Filtering.",
                    "GridMapper: A Tool for Visualizing the Behavior of Large-Scale Distributed Systems.",
                    "Predicting Sporadic Grid Data Transfers.",
                    "Error Scope on a Computational Grid: Theory and Practice.",
                    "Design and Implementation of Secured Information Services for the ASCI Grid.",
                    "Architecture Requirements for Commercializing Grid Resources.",
                    "GriPhyN and LIGO, Building a Virtual Data Grid for Gravitational Wave Scientists.",
                    "Evaluating Web Services Based Implementations of GridRPC.",
                    "Investigating the Limits of SOAP Performance for Scientific Computing.",
                    "An Evaluation of Object-Based Data Transfers on High Performance Networks.",
                    "A Comparison of TCP Automatic Tuning Techniques for Distributed Computing.",
                    "On the Viability of Component Frameworks for High Performance Distributed Computing: A Case Study.",
                    "Distributed Model Coupling Framework.",
                    "Coven - A Framework for High Performance Problem Solving Environments.",
                    "MySRB & SRB: Components of a Data Grid.",
                    "A High-Performance Cluster Storage Server.",
                    "A Secure Distributed Search System.",
                    "InfoGram: A Grid Service that Supports Both Information Queries and Job Execution.",
                    "A Metascheduler For The Grid.",
                    "Decoupling Computation and Data Scheduling in Distributed Data-Intensive Applications.",
                    "Distributed Job Scheduling on Computational Grids Using Multiple Simultaneous Requests.",
                    "IQ-RUDP: Coordinating Application Adaptation with Network Transport.",
                    "Adaptive Online Data Compression.",
                    "Software Architecture-Based Adaptation for Grid Computing.",
                    "Local Discovery of System Architecture - Application Parameter Sensitivity: An Empirical Technique for Adaptive Grid Applications.",
                    "The GridLab Grid Application Toolkit.",
                    "BioGRID - An European Grid for Molecular Biology.",
                    "Grid Services in Action: Grid Enabled Optimisation and Design Search.",
                    "The Performance of Processor Co-Allocation in Multicluster Systems.",
                    "A Case for Proactivity in Directory Services.",
                    "Grid-Based Knowledge Discovery Services for High Throughput Informatics.",
                    "Bringing the Grid to the Biomedical Workbench.",
                    "Location-Transparent Naming in Grid Computing Using Legion-G.",
                    "A Peer-to-Peer Approach to Resource Location in Grid Environments.",
                    "Virtual Services in Data Grids.",
                    "A Batch Script Generator Web Service for Computational Portals.",
                    "UNICORE - Globus Interoperability: Getting the Best of Both Worlds.",
                    "Scalability of a Distributed Neural Information Retrieval System."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "10th HPDC 2001",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2001",
                "sub_name": "10th IEEE International Symposium on High Performance Distributed Computing (HPDC-10 2001), 7-9 August 2001, San Francisco, CA, USA.",
                "count": 48,
                "papers": [
                    "Adaptable Mirroring in Cluster Servers.",
                    "Studying Protein Folding on the Grid: Experiences Using CHARMM on NPACI Resources under Legion.",
                    "A CORBA-Based Development Environment for Wrapping and Coupling Legacy Scientific Codes.",
                    "Middleware Support for Global Access to Integrated Computational Collaboratories.",
                    "PAWS: Collective Interactions and Data Transfers.",
                    "Condor-G: A Computation Management Agent for Multi-Institutional Grids.",
                    "Models for Replica Synchronisation and Consistency in a Data Grid.",
                    "File and Object Replication in Data Grids.",
                    "Distributed Data Access and Resource Management in the D0 SAM System.",
                    "Security Implications of Typical Grid Computing Usage Scenarios.",
                    "An Online Credential Repository for the Grid: MyProxy.",
                    "End-to-End Provision of Policy Information for Network QoS.",
                    "QoS-Aware Dependency Management for Component-Based Systems.",
                    "Livelock Avoidance for Meta-Schedulers.",
                    "Active Yellow Pages: A Pipelined Resource Management Architecture for Wide-Area Network Computing.",
                    "A Case for TCP Vegas in High-Performance Computational Grids.",
                    "Evaluation of a Resource Selection Mechanism for Complex Network Services.",
                    "Grid Information Services for Distributed Resource Sharing.",
                    "Location Selection for Active Services.",
                    "The Astrophysics Simulation Collaboratory Portal: A Science Portal Enabling Community Software Development.",
                    "The GridPort Toolkit: A System for Building Grid Portals.",
                    "Open Data Management Solutions for Problem Solving Environments: Application of Distributed Authoring and Versioning to the Extensible Computational Chemistry Environment.",
                    "Bandwidth Monitoring for Network-Aware Applications.",
                    "The Architecture of the Remos System.",
                    "Reducing Delay with Dynamic Selection of Compression Formats.",
                    "Enabling Network-Aware Applications.",
                    "Network Characterization Service (NCS).",
                    "Cooperative Caching Middleware for Cluster-Based Servers.",
                    "NAS Grid Benchmarks: A Tool for Grid Space Exploration.",
                    "The Kangaroo Approach to Data Movement on the Grid.",
                    "The PUNCH Virtual File System: Seamless Access to Decentralized Storage Services in a Computational Grid.",
                    "Wide-Area Transposition-Driven Scheduling.",
                    "Parallel Retrograde Analysis on Different Architecture.",
                    "Massively Parallel Distributed Feature Extraction in Textual Data Mining Using HDDI(tm).",
                    "Open Metadata Formats: Efficient XML-Based Communication for High Performance Computing.",
                    "Online Prediction of the Running Time of Tasks.",
                    "Multi-Resolution Resource Behaviour Queries Using Wavelets.",
                    "A Study of Deadline Scheduling for Client-Server Systems on the Computational Grid.",
                    "Practical Resource Management for Grid-Based Visual Exploration.",
                    "A Metadebugger Prototype for the HARNESS Metacomputing Framework.",
                    "Nomadic Migration: A New Tool for Dynamic Grid Computing.",
                    "Interfacing Parallel Jobs to Process Managers.",
                    "Dynamic Replica Management in the Service Grid.",
                    "Efficient Techniques for Distributed Computing.",
                    "The Active Streams Approach to Adaptive Distrubuted Systems.",
                    "Overview of Security Considerations for Computational and Data Grids.",
                    "Applying Grid Technologies to Bioinformatics.",
                    "The Logistical Session Layer."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "9th HPDC 2000",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/2000",
                "sub_name": "Proceedings of the Ninth IEEE International Symposium on High Performance Distributed Computing, HPDC'00, Pittsburgh, Pennsylvania, USA, August 1-4, 2000.",
                "count": 45,
                "papers": [
                    "QoS and Contention-Aware Multi-Resource Reservation.",
                    "Automatic Configuration and Run-time Adaptation of Distributed Applications.",
                    "A Distributed Multi-Storage Resource Architecture and I/O Performance Prediction for Scientific Computing.",
                    "Uintah: A Massively Parallel Problem Solving Environment.",
                    "An Enabling Framework for Master-Worker Applications on the Computational Grid.",
                    "A Component based Services Architecture for Building Distributed Applications.",
                    "Evaluating Cluster-based Network Servers.",
                    "Incorporating Job Migration and Network RAM to Share Cluster Memory Resources.",
                    "Bypass: A Tool for Building Split Execution Systems.",
                    "Using Idle Workstations to Implement Predictive Prefetching.",
                    "A Monitoring Sensor Management System for Grid Environments.",
                    "Robust Resource Management for Metacomputers.",
                    "Event Services for High Performance Computing.",
                    "Performance Evaluation of a Firewall-Compliant Globus-based Wide-Area Cluster System.",
                    "Speculative Defragmentation - A Technique to Improve the Communication Software Efficiency for Gigabit Ethernet.",
                    "High Performance Communication using a Commodity Network for Cluster Systems.",
                    "Synchronizing Network Probes to Avoid Measurement Intrusiveness with the Network Weather Service.",
                    "Failure-Atomic File Access in an Interposed Network Storage System.",
                    "Grid-based File Access: The Legion I/O Model.",
                    "Flexible High-Performance Access to Distributed Storage Resources.",
                    "An Evaluation of Alternative Designs for a Grid Information Service.",
                    "Constructing the ASCI Computational Grid.",
                    "2K: A Distributed Operating System for Dynamic Heterogeneous Environments.",
                    "Evaluation of Task Assignment Policies for Supercomputing Servers: The Case for Load Unbalancing and Fairness.",
                    "A Comparative Evaluation of Implicit Coscheduling Strategies for Networks of Workstations.",
                    "Application Placement using Performance Surfaces.",
                    "CAVEStudy: An Infrastructure for Computational Steering in Virtual Reality Environments.",
                    "Parallel Matching and Sorting with TACO's Distributed Collections - A Case Study from Molecular Biology Research.",
                    "The Cactus Code: A Problem Solving Environment for the Grid.",
                    "dQUOB: Managing Large Data Flows using Dynamic Embedded Queries.",
                    "Creating Large Scale Database Servers.",
                    "RAID-x: A New Distributed Disk Array for I/O-Centric Cluster Computing.",
                    "Distributed Processor Allocation in Large PC Clusters.",
                    "Resource Management through Multilateral Matchmaking.",
                    "Data Mining on NASA's Information Power Grid.",
                    "Probe - A Distributed Storage Testbed.",
                    "A Local Area System Network RHinet-1: A Network for High Performance Parallel Computing.",
                    "Managing Network Resources in Condor.",
                    "The Modeler's Workbench: A System for Dynamically Distributed Simulation and Data Collection.",
                    "Prophesy: An Infrastructure for Analyzing and Modeling the Performance of Parallel and Distributed Applications.",
                    "An Object Infrastructure for Computational Steering of Distributed Simulations.",
                    "Interfacing Wide-Area Network Computing and Cluster Management Software: Condor, DQS and PBS via PUNCH.",
                    "Development of Web Toolkits for Computational Science Portals: The NPACI HotPage.",
                    "Distributed Data Access in the Sequential Access Model in the D0 Experiment at Fermilab.",
                    "Coupling of Industrial Simulation Codes using CORBA."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "8th HPDC 1999",
        "info": "Redondo Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1999",
                "sub_name": "Proceedings of the Eighth IEEE International Symposium on High Performance Distributed Computing, HPDC'99, Redondo Beach, California, USA, August 3-6, 1999.",
                "count": 48,
                "papers": [
                    "MPI Code Encapsulating using Parallel CORBA Object.",
                    "CrispORB: High Performance CORBA for System Area Network.",
                    "A Performance Broker for CORBA.",
                    "Accurately Measuring MPI Broadcasts in a Computational Grid.",
                    "Direct Queries for Discovering Network Resource Properties in a Distributed Environment.",
                    "Predictive Application-Performance Modeling in a Computational Grid Environment.",
                    "The Cactus Computational Toolkit and using Distributed Computing to Collide Neutron Stars.",
                    "A Methodology for Supporting Collaborative Exploratory Analysis of Massive Data Sets in Tele-Immersive Environments.",
                    "Portable Petaflop/s Programming: Applying Distributed Computing Methodology to the Grid within a Single Machine Room.",
                    "An Evaluation of Linear Models for Host Load Prediction.",
                    "Overview of a Performance Evaluation System for Global Computing Scheduling Algorithms.",
                    "Predicting the CPU Availability of Time-shared Unix Systems on the Computational Grid.",
                    "Toward a Common Component Architecture for High-Performance Scientific Computing.",
                    "CAT: A High Performance Distributed Component Architecture Toolkit for the Grid.",
                    "PARED: A Framework for the Adaptive Solution of PDEs.",
                    "Steering Data Streams in Distributed Computational Laboratories.",
                    "An Approach for MPI based Metacomputing.",
                    "High Performance Phylogenetic Inference.",
                    "Passive, Domain-Independent, End-to-End Message Passing Performance Monitoring to Support Adaptive Applications in MSHN.",
                    "Dynamic Task Migration in Home-based Software DSM Systems.",
                    "MATmarks: A Shared Memory Environment for MATLAB Programming.",
                    "Distributed Processing for Cinematic Holographic Particle Image Velocimetry.",
                    "QoS as Middleware: Bandwidth Reservation System Design.",
                    "Proteus: A Runtime Reconfigurable Distributed Shared Memory System.",
                    "Remote Application Scheduling on Metacomputing Systems.",
                    "Fault Tolerant Computing on the Grid: What are My Options?",
                    "Adaptive Write Detection in Home-based Software DSMs.",
                    "Distributed Applications in a German Gigabit WAN.",
                    "Spatially Decomposed Multigrain MOM Problems on NOWs.",
                    "Techniques for Automating Distributed Real-Time Applications Design.",
                    "Starfish: Fault-Tolerant Dynamic MPI Programs on Clusters of Workstations.",
                    "Process Hijacking.",
                    "A Network-Aware Distributed Storage Cache for Data Intensive Environments.",
                    "Grids as Production Computing Environments: The Engineering Aspects of NASA's Information Power Grid.",
                    "To Overprovision or To Share via QoS-aware Resource Management?",
                    "Six Misconceptions about Reliable Distributed Computing.",
                    "Resource Co-Allocation in Computational Grids.",
                    "Baglets: Adding Hierarchical Scheduling to Aglets.",
                    "Job-Length Estimation and Performance in Backfilling Schedulers.",
                    "An Approach to Immersive Performance Visualization of Parallel and Wide-Area Distributed Applications.",
                    "Reducing Data Distribution Bottlenecks by Employing Data Visualization Filters.",
                    "Data Management for Large-Scale Scientific Computations in High Performance Distributed Systems.",
                    "A Resource Description Environment for Distributed Computing Systems.",
                    "The UNICORE Architecture Seamless Access to Distributed Resources.",
                    "Using Gateway System to Provide a Desktop Access to High Performance Computational Resources.",
                    "Dodo: A User-level System for Exploiting Idle Memory in Workstation Clusters.",
                    "DUNES: A Performance-Oriented System Support Environment for Dependency Maintenance in Workstation Networks.",
                    "Using Embedded Network Processors to Implement Global Memory Management in a Workstation Cluster."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "7th HPDC 1998",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1998",
                "sub_name": "Proceedings of the Seventh IEEE International Symposium on High Performance Distributed Computing, HPDC '98, Chicago, Illinois, USA, July 28-31, 1998.",
                "count": 53,
                "papers": [
                    "Adaptive Utilization of Communication and Computational Resources in High-Performance Distribution Systems: The EMOP Approach.",
                    "Efficient Layering for High Speed Communication: Fast Messages 2.x.",
                    "The Software Architecture of a Distributed Quality of Session Control Layer.",
                    "TeleMed: Wide-Area, Secure, Collaborative Object Computing with Java and CORBA for Healthcare.",
                    "Optimizing Protocol Parameters to Large Scale PC Cluster and Evaluation of its Effectiveness with Parallel Data Mining.",
                    "Computing Twin Primes and Brun's Constant: A Distributed Approach.",
                    "WebOS: Operating System Services for Wide Area Applications.",
                    "The DOGMA Approach to High-Utilization Supercomputing.",
                    "On the Design of a Demand-Based Network-Computing System: The Purdue University Network-Computing Hub.",
                    "Application Experiences with the Globus Toolkit.",
                    "Strings: A High-Performance Distributed Shared Memory for Symmetrical Multiprocessor Clusters.",
                    "Two-Stage Transaction Processing in Client-Server DBMSs.",
                    "Hectiling: An Integration of Fine and Coarse-Grained Load-Balancing Strategies.",
                    "Otter: Bridging the Gap between MATLAB and ScaLAPACK.",
                    "On the Effectiveness of Distributed Checkpoint Algorithms for Domino-Free Recovery.",
                    "Authorization for Metacomputing Applications.",
                    "Matchmaking: Distributed Resource Management for High Throughput Computing.",
                    "Distant I/O: One-Sided Access to Secondary Storage on Remote Processors.",
                    "Automatic Parallel I/O Performance Optimization Using Genetic Algorithms.",
                    "Parallel I/O Performance of Fine Grained Data Distributions.",
                    "Autopilot: Adaptive Control of Distributed Applications.",
                    "Prediction and Adaptation in Active Harmony.",
                    "A Resource Query Interface for Network-Aware Applications.",
                    "Personal Tele-Immersion Devices.",
                    "A Framework for Interacting with Distributed Programs and Data.",
                    "Efficient Coupling of Parallel Applications Using PAWS.",
                    "High-Performance Distributed Digital Libraries: Building the Interspace on the Grid.",
                    "Adaptive Load Sharing for Clustered Digital Library Servers.",
                    "Cooperative Caching of Dynamic Content on a Distributed Web Server.",
                    "Global High Performance Networking: Connecting the vNBS and the Asia-Pacific Advanced Network for Research and Education Applications.",
                    "The NetLogger Methodology for High Performance Distributed Systems Performance Analysis.",
                    "A Fault Detection Service for Wide Area Distributed Computations.",
                    "High-Speed, Wide Area, Data Intensive Computing: A Ten Year Retrospective.",
                    "Mesh Partitioning for Distributed Systems.",
                    "Towards a Hierarchical Scheduling System for Distributed WWW Server Clusters.",
                    "Adaptive Communication Algorithms for Distributed Heterogeneous Systems.",
                    "Sender Coordination in the Distributed Virtual Communication Machine.",
                    "A Software Architecture for Global Address Space Communication on Clusters: Put/Get on Fast Messages.",
                    "Dynamically Instrumenting Message-Passing Programs Using Virtual Clocks.",
                    "Improving Replication Protocols through Priorities.",
                    "Flexible Protocol Stacks by In-Kernel Composition.",
                    "Extending Metasystem Functionality Using Reflection.",
                    "Metascheduling: A Scheduling Model for Metacomputing Systems.",
                    "NETMAN: An Object-Oriented Environment for Experimenting Distributed Algorithms on a Network of Workstations.",
                    "A Performance Evaluation Model for Effective Job Scheduling in Global Computing Systems.",
                    "The Effect of Clustering in Client-Caching Architectures.",
                    "ToolSpace: A Next Generation Computing Environment.",
                    "HARNESS: Heterogeneous Adaptable Reconfigurable NEtworked SystemS.",
                    "Lilith: A Software Framework for the Rapid Development of Scalable Tools for Distributed Computing.",
                    "Implementation and Utilization of a Heterogeneous Multicomputer Cluster for the Study of Load Balancing Strategies.",
                    "Simulation Steering with SCIRun in a Distributed Environment.",
                    "LogGP Quantified: The Case for MPI.",
                    "Scaling of Beowulf-Class Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th HPDC 1997",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1997",
                "sub_name": "Proceedings of the 6th International Symposium on High Performance Distributed Computing, HPDC '97, Portland, OR, USA, August 5-8, 1997.",
                "count": 37,
                "papers": [
                    "Parallel FFT on ATM-based Networks of Workstations.",
                    "Parallel Hierarchical Global Illumination.",
                    "Distributed Polyphonic Music Synthesis.",
                    "PARDIS: A Parallel Approach to CORBA.",
                    "The Software Architecture of a Virtual Distributed Computing Environment.",
                    "Frame-Based Components for Generalized Particle Methods.",
                    "InVerse: Designing an Interactive Universe Architecture for Scalability and Extensibility.",
                    "The Argonne Voyager Multimedia Server.",
                    "Load-balanced Routing for Collaborative Multimedia Communication.",
                    "Predicting Slowdown for Networked Workstations.",
                    "Speed Up Your Database Client with Adaptable Multithreaded Prefetching.",
                    "A Parallel Workload Model and its Implications for Processor Allocation.",
                    "A Secure Communications Infrastructure for High-Performance Distributed Computing.",
                    "Replaying Distributed Programs without Message Logging.",
                    "Collective Buffering: Improving Parallel I/O Performance.",
                    "Supporting Parallel Applications on Clusters of Workstations: The Intelligent Network Interface Approach.",
                    "Optimizing Layered Communication Protocols.",
                    "ASCI Applications.",
                    "Kaleido: An Environment for Composing Networked Multimedia Applications.",
                    "Distributed Service Paradigm for Remote Video Retrieval Request.",
                    "Flexible General Purpose Communication Primitives for Distributed Systems.",
                    "A Bus-Efficient Low-Latency Network Interface for the PDSS Multicomputer.",
                    "Performance Aspects of Switched SCI Systems.",
                    "Packing Messages as a Tool for Boosting the Performance of Total Ordering Protocols.",
                    "Cut-Through Delivery in Trapeze: An Exercise in Low-Latency Messaging.",
                    "Cellular Mobile Networks.",
                    "Adaptive Cache Invalidation Methods in Mobile Environments.",
                    "Channel Allocation Methods for Data Dissemination in Mobile Computing Environments.",
                    "Design Issues in Building Web-Based Programming Environments.",
                    "Design Patterns for Parallel Computing using a Network of Processors.",
                    "Lilith: Scalable Execution of User Code for Distributed Computing.",
                    "Forecasting Network Performance to Support Dynamic Scheduling using the Network Weather Service.",
                    "Parallel Programming in Multi-Paradigm Clusters.",
                    "Utilizing Heterogeneous Networks in Distributed Parallel Computing Systems.",
                    "Run-time Support for Scheduling Parallel Applications in Heterogeneous NOWs.",
                    "Distributed-Thread Scheduling Methods for Reducing Page-Thrashing.",
                    "A Directory Service for Configuring High-Performance Distributed Computations."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5th HPDC 1996",
        "info": "Syracuse, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1996",
                "sub_name": "Proceedings of the 5th International Symposium on High Performance Distributed Computing (HPDC '96), Syracuse, NY, USA, August 6-9, 1996.",
                "count": 37,
                "papers": [
                    "Parallel FFT on ATM-based Networks of Workstations.",
                    "Parallel Hierarchical Global Illumination.",
                    "Distributed Polyphonic Music Synthesis.",
                    "PARDIS: A Parallel Approach to CORBA.",
                    "The Software Architecture of a Virtual Distributed Computing Environment.",
                    "Frame-Based Components for Generalized Particle Methods.",
                    "InVerse: Designing an Interactive Universe Architecture for Scalability and Extensibility.",
                    "The Argonne Voyager Multimedia Server.",
                    "Load-balanced Routing for Collaborative Multimedia Communication.",
                    "Predicting Slowdown for Networked Workstations.",
                    "Speed Up Your Database Client with Adaptable Multithreaded Prefetching.",
                    "A Parallel Workload Model and its Implications for Processor Allocation.",
                    "A Secure Communications Infrastructure for High-Performance Distributed Computing.",
                    "Replaying Distributed Programs without Message Logging.",
                    "Collective Buffering: Improving Parallel I/O Performance.",
                    "Supporting Parallel Applications on Clusters of Workstations: The Intelligent Network Interface Approach.",
                    "Optimizing Layered Communication Protocols.",
                    "ASCI Applications.",
                    "Kaleido: An Environment for Composing Networked Multimedia Applications.",
                    "Distributed Service Paradigm for Remote Video Retrieval Request.",
                    "Flexible General Purpose Communication Primitives for Distributed Systems.",
                    "A Bus-Efficient Low-Latency Network Interface for the PDSS Multicomputer.",
                    "Performance Aspects of Switched SCI Systems.",
                    "Packing Messages as a Tool for Boosting the Performance of Total Ordering Protocols.",
                    "Cut-Through Delivery in Trapeze: An Exercise in Low-Latency Messaging.",
                    "Cellular Mobile Networks.",
                    "Adaptive Cache Invalidation Methods in Mobile Environments.",
                    "Channel Allocation Methods for Data Dissemination in Mobile Computing Environments.",
                    "Design Issues in Building Web-Based Programming Environments.",
                    "Design Patterns for Parallel Computing using a Network of Processors.",
                    "Lilith: Scalable Execution of User Code for Distributed Computing.",
                    "Forecasting Network Performance to Support Dynamic Scheduling using the Network Weather Service.",
                    "Parallel Programming in Multi-Paradigm Clusters.",
                    "Utilizing Heterogeneous Networks in Distributed Parallel Computing Systems.",
                    "Run-time Support for Scheduling Parallel Applications in Heterogeneous NOWs.",
                    "Distributed-Thread Scheduling Methods for Reducing Page-Thrashing.",
                    "A Directory Service for Configuring High-Performance Distributed Computations."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4th HPDC 1995",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1995",
                "sub_name": "Proceedings of the 4th International Symposium on High Performance Distributed Computing (HPDC '95), Washington, DC, USA, August 2-4, 1995.",
                "count": 30,
                "papers": [
                    "NOWs, MMPs, and Scalable Parallel Systems.",
                    "Distributed Computing on Clusters of Share' d-Memory Multiprocessors to Simulate Unsteady Turbulent Flows.",
                    "Parallel Simulation of Subsonic Fluid Dynamics on a Cluster of Workstations.",
                    "A Portable Distributed Implementation of the Parallel Multipole Tree Algorithm.",
                    "Communication Overhead for Space Science Applications on the Beowulf Parallel Workstation.",
                    "A Proposal for a DSM Architecture Suitable for a Widely Distributed Environment and its Evaluation.",
                    "Hybrid Media Access Protocols for a DSM System Based on Optical WDM Networks.",
                    "Network Shared Memory: A New Approach for Clustering Workstations for Parallel Processing.",
                    "A Spanning Tree Based Recursive Refinement Algorithm for Fast Task Mapping.",
                    "The Performance Impact of Scheduling for Cache Affinity in Parallel Network Processing.",
                    "Loop Scheduling for Heterogeneity.",
                    "TCP/ATM Experiences in the MAGIC Testbed.",
                    "A High Speed Implementation of Adaptive Shaping for Dynamic Bandwidth Allocation.",
                    "The Limited Applicability of Block Decomposition in Cluster Computing.",
                    "Nimrod: A Tool for Performing Parameterised Simulations Using Distributed Workstations.",
                    "CALYPSO: A Novel Software System for Fault-Tolerant Parallel Processing on Distributed Platforms.",
                    "Indigo: User-Level Support for Building Distributed Shared Abstractions.",
                    "Invited Paper: Overview of the MAGIC Project - Challenges and Accomplishments.",
                    "Efficient Causally Ordered Communications for Multimedia Real-Time Applications.",
                    "A Versatile Packet Multiplexer for Quality-of-Service Networks.",
                    "Disk-Directed I/O for an Out-of-Core Computation.",
                    "A Performance Comparison of RAID-5 and Log-Structured Arrays.",
                    "Multimedia Intra-Group Communication Protocol.",
                    "Portable Checkpointing and Recovery.",
                    "Performance Benefits of Optimistic Programming: A Measure of HOPE.",
                    "Network-Specific Performance Enhancements for PVM.",
                    "TPVM: Distributed Concurrent Computing with Lighweight Processes.",
                    "LIGHTNING: A Scalable Dynamically Reconfigurable Hierarchical WDM Network for High-Performance Clustering.",
                    "An ATM-Based Multimedia Integrated Manufacturing System .",
                    "A Multithreaded Message Passing Environment for ATM LAN/WAN ."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "3rd HPDC 1994",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1994",
                "sub_name": "Proceedings of the Third International Symposium on High Performance Distributed Computing, HPDC '94, San Francisco, CA, USA, April 2-5, 1994.",
                "count": 37,
                "papers": [
                    "Multimedia Supercomputing: The Use of Supercomputers to Drive High-Performance Multimedia Systems and Virtual Environments.",
                    "Constructing Numerical Software Libraries for HPCC Environments.",
                    "Overview of RWC Massively Parallel Computer Project.",
                    "The Virtual Computing Environment.",
                    "The Use of Frameworks for Scientific Computation in a Parallel Distributed Environment.",
                    "Falcon - Toward Interactive Parallel Programs: The On-line Steering of a Molecular Dynamics Application.",
                    "High-Performance TCP/IP and UDP/IP Networking in DEC OSF/1 for Alpha AXP.",
                    "Design and Implementation of Global Reduction Operations Across ATM Networks.",
                    "Performance Analysis of a New Implementation Efficient Capacity Allocation Protocol for Multimedia Traffic in ATM Networks.",
                    "WAVE Processing of Networks and Distributed Simulation.",
                    "Providing High Performance Distributed Computing Through Scalable Computation Servers.",
                    "Running a Climate Model in a Heterogeneous, Distributed Computer Environment.",
                    "Distributed Computation of Electromagnetic Scattering Problems Using Finite-Difference Time-Domain Decompositions.",
                    "Scheduling Large-Scale Parallel Computations on Networks of Workstations.",
                    "Scheduling a Metacomputer by an Implicit Voting System.",
                    "A Decomposition Advisory System for Heterogeneous Data-Parallel Processing.",
                    "Investigating Weak Memories Using Maya.",
                    "Program Analysis and Transformations for Fast Data Sharing.",
                    "An Experimental Active-Memory-Based Network Environment.",
                    "Network Partitioning of Data Parallel Computations.",
                    "Exploiting Inter-Task Dependencies for Dynamic Load Balancing.",
                    "Automatic Generation of Parallel Programs with Dynamic Load Balancing.",
                    "Distributed Solutions to the Delay Fault Test Quality Evaluation Problem.",
                    "Design and Implementation of Parallel Algorithms for Gene-Finding.",
                    "Solving Partial Differential Equations on a Network of Workstations.",
                    "Parallel Computations on the CHARM Heterogeneous Workstation Cluster.",
                    "Mapping Parallel Interactive Algorithms onto Workstation Networks.",
                    "A Task Graph Centroid.",
                    "Data Reshuffling in Support of Fast I/O for Distributed-Memory Machines.",
                    "Process-Replication Technique for Fault Tolerance and Performance Improvement in Distributed Computing Systems.",
                    "Performance Evaluation of a Partial Dynamic Declustering Disk Array System.",
                    "Large-Scale Group Communication Protocol on High-Speed Channel.",
                    "Deciding Boundedness for Systems of Two Communicating Finite State Machines.",
                    "Design of a Header Processor for the PSi Implementation of the Logical Link Control Protocol in LANs.",
                    "PMT: A Tool to Monitor Performances in Distributed Systems.",
                    "Reducing Variations in Parallel Efficiency for Unstructured Grid Computations.",
                    "Performance Prediction for Different Consistency Schemes in Distributed Shared Memory Systems."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "2nd HPDC 1993",
        "info": "Spokane, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1993",
                "sub_name": "Proceedings of the Second International Symposium on High Performance Distributed Computing, HPDC '93, Spokane, WA, USA, July 20-23, 1993.",
                "count": 42,
                "papers": [
                    "New Flow Control Methods for High-Speed Networks.",
                    "Programming a Distributed System Using Shared Objects.",
                    "Scalable Libraries in a Heterogeneous Environment.",
                    "Parallel Computing for Helicopter Rotor Design.",
                    "Panel - The Virtual Heterogeneous Supercomputer: Can It Be Built?",
                    "A Parallel Object-Oriented Framework for Stencil Algorithms.",
                    "Block Data Decomposition for Data-Parallel Programming on a Heterogeneous Workstation Network.",
                    "P4-Linda: A Portable Implementation of Linda.",
                    "Improving Performance by Use of Adaptive Objects: Experimentation with a Configurable Multiprocessor Thread Package.",
                    "DARTS - A Dynamically Adaptable Transport Service Suitable for High Speed Networks.",
                    "Implementation of a Parallel Transport Subsystem on a Multiprocessor Architecture.",
                    "A Message Passing Interface for Parallel and Distributed Computing.",
                    "DSMA: A Fair Capacity-1 Protocol for Gigabit Ring Networks.",
                    "Toward a High Performance Distributed Memory Climate Model.",
                    "Test Pattern Generation for Sequential Circuits on a Network of Workstations.",
                    "Star Modeling on IBM RS6000 Networks Using PVM.",
                    "A Fully Distributed Parallel Ray Tracing Scheme on the Delta Touchstone Machine.",
                    "An ATM WAN/LAN Gateway Architecture.",
                    "Performance Evaluation of a High-Speed Switching System Based on the Fibre Channel Standard.",
                    "MULTIPAR: An Output Queue ATM Modular Switch with Multiple Phases and Replicated Planes.",
                    "A Low-Latency Programming Interface and a Prototype Switch for Scalable High-Performance Distributed Computing.",
                    "Panel - Software Tools for High-Performance Distributed Computing.",
                    "Parallel and Distributed Systems for Constructive Neural Network Learning.",
                    "An Analysis of Distributed Computing Software and Hardware for Applications in Computational Physics.",
                    "Supporting Heterogeneity and Distribution in the Numerical Propulsion System.",
                    "Distributed Computing Solutions to the All-Pairs Shortest Path Problem.",
                    "Distributed Control Methods.",
                    "A Methodology for Evaluating Load Balancing Algorithms.",
                    "Distributed Computing Systems and Checkpointing.",
                    "Formal Method for Scheduling, Routing and Communication Protocol.",
                    "Accessing Remote Special Files in a Distributed Computing Envinronment.",
                    "Performance Analysis of Distributed File Systems with Non-Volatile Caches.",
                    "Trading Disk Capacity for Performance.",
                    "Partial Order Transport Service for Multimedia Applications: Reliable Service.",
                    "Starvation-Prevented Priority-Based Total Ordering Broadcast Protocol on High-Speed Single Channel Network.",
                    "Design and Analysis of a Hierarchical Scalable Photonic Architecture.",
                    "Reliable Management of Distributed Computations in Nexus.",
                    "Management of Broadband Networks Using a 3D Virtual World.",
                    "Resource Management for Distributed Parallel Systems.",
                    "Analytical Performance Evaluation of Data Replication Based Shared Memory Model.",
                    "Hierarchical Distributed System Network Design with Cost-Performance Tradeoffs.",
                    "High-Performance Distributed Shared Memory Substrate for Workstation Clusters."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "1st HPDC 1992",
        "info": "Syracuse, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hpdc/1992",
                "sub_name": "Proceedings of the First International Symposium on High Performance Distributed Computing, HPDC '92, Syracuse, NY, USA, September 9-11, 1992.",
                "count": 29,
                "papers": [
                    "Issues in Networking and Data Management of Distributed Multimedia Systems.",
                    "Distributing a Climate Model across Gigabit Networks.",
                    "Data-Parallel Programming on a Network of Heterogeneous Workstations.",
                    "MOVIE Model for Open Systems Based High Performance Distributed Computing.",
                    "No Pain and Gain - Experiences with Mentat on a Biological Application.",
                    "Experiences in High Performance Computing with Pleiades and ESP.",
                    "Parallel Networking and Visualization on the Connection Machine CM-5.",
                    "A Scalable Packet Switch for Distributed Computing.",
                    "Performance Comparison of Reservation and Preallocation Protocols for Star-Coupled WDM Photonic Networks.",
                    "Determining Update Latency Bounds in Galactica Net.",
                    "Harmonizing a Distributed Operating System with Parallel and Distributed Applications.",
                    "A Radiative Heat Transfer Simulation on a SPARCStation Farm.",
                    "Particle Simulation on Heterogeneous Distributed Supercomputers.",
                    "A Requirement Analysis for High Performance Distributed Computing over LANs.",
                    "High Performance Computing on a Cluster of Workstations.",
                    "High Performance PDU Processing for Application Layer.",
                    "ADAPTIVE: A Flexible and Adaptive Transport System Architecture to Support Lightweight Protocols for Multimedia Applications on High-Speed Networks.",
                    "FDDI Support for Multimedia Traffic.",
                    "On Flow Control in Multimedia Networks.",
                    "Physical-Level Synthetic Workload Generation for Load-Balancing Experiments.",
                    "Performance Comparison of Active-Sender and Active-Receiver Policies for Distributed Caching.",
                    "Allocation of Computations with Dynamic Structures on Hypercube Based Distributed Systems.",
                    "Lattice Boltzmann Method on a Cluster of IBM RISC System/6000 Workstations.",
                    "Computing Radiosity Solution on a High Performance Workstation LAN.",
                    "Maintaining Good Performance In Disk Arrays During Failure via Uniform Parity Group Distribution.",
                    "A Distributed Scheduling Simulation.",
                    "Tutorial I: Paradigms and Tools for Heterogeneous Network Computing.",
                    "Tutorial II: Multimedia Information Systems.",
                    "Tutorial III: Distributed Shared Memory Systems."
                ]
            }
        ]
    }
]