[
    {
        "year": "2021",
        "name": "21st ICA3PP 2021",
        "info": "[virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2021-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 21st International Conference, ICA3PP 2021, Virtual Event, December 3-5, 2021, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "CRFST-GCN: A Deeplearning Spatial-Temporal Frame to Predict Traffic Flow.",
                    "BFR-RetinaNet: An Improved RetinaNet Model for Vehicle Detection in Aerial Images.",
                    "Learning Knowledge Graph Embeddings by Multi-Attention Mechanism for Link Prediction.",
                    "GlowImp: Combining GLOW and GAN for Multivariate Time Series Imputation.",
                    "Accurate Indoor Localization Using Magnetic Sequence Fingerprints with Deep Learning.",
                    "Wasserstein Graph Auto-Encoder.",
                    "Fine-Grained Activity Recognition Based on Features of Action Subsegments and Incremental Broad Learning.",
                    "ADFA-LSTM: An Abnormal Trajectory Prediction Method Based on Bionic Neural Network.",
                    "Online Multiple Object Tracking Algorithm Based on Heat Map Propagation.",
                    "Spatio-Temporal Topology Routing Algorithm for Opportunistic Network Based on Self-attention Mechanism.",
                    "TSAEns: Ensemble Learning for KPI Anomaly Detection.",
                    "Towards Transferable Adversarial Examples Using Meta Learning.",
                    "Temporal Convolution Network Based on Attention for Intelligent Anomaly Detection of Wind Turbine Blades.",
                    "Error Serial Episodes Discovery from Mobile Payment Log in Distributed ETC.",
                    "Parallel Cache Prefetching for LSM-Tree Based Store: From Algorithm to Evaluation.",
                    "A Hybrid TLBO-TS Algorithm Based Mobile Service Selection for Composite Services.",
                    "UPM-DMA: An Efficient Userspace DMA-Pinned Memory Management Strategy for NVMe SSDs.",
                    "AHOA: Adaptively Hybrid Optimization Algorithm for Flexible Job-shop Scheduling Problem.",
                    "Trace-Navi: A High-Accuracy Indoor Navigation System Based on Real-Time Activity Recognition and Discrete Trajectory Calibration.",
                    "Iterative Filling Incomplete Fingerprint Map Based on Multi-directional Signal Propagation in Large-Scale Scene.",
                    "Dynamic Adjustment Policy of Search Driver Matching Distance via Markov Decision Process.",
                    "A Multi-precision Quantized Super-Resolution Model Framework.",
                    "An Optimized GPU Implementation of Weakly-Compressible SPH Using CUDA-Based Strategies.",
                    "A Heterogeneous Multi-core Network-on-Chip Mapping Optimization Algorithm.",
                    "A Novel 3D Intelligent Cluster Method for Malicious Traffic Fine-Grained Classification.",
                    "Predicting Students' Academic Performance Based on Improved PSO-Xgboost: A Campus Behavior Perspective.",
                    "Motion-Sequence Authentication System: Guard for Smart Phones.",
                    "Joint Optimization Scheme of Multi-service Replication and Request Offloading in Mobile Edge Computing.",
                    "Flying MEC: Online Task Offloading, Trajectory Planning and Charging Scheduling for UAV-Assisted MEC.",
                    "Multiple Workflows Offloading Based on Deep Reinforcement Learning in Mobile Edge Computing.",
                    "An Optimized Greedy-Based Task Offloading Method for Mobile Edge Computing.",
                    "Location Aware Workflow Migration Based on Deep Reinforcement Learning in Mobile Edge Computing.",
                    "Recode-Decode-and-Compare: An Efficient Verification Scheme for Coded Edge Computing Against Collusion Attack.",
                    "MGFL: Multi-granularity Federated Learning in Edge Computing Systems.",
                    "Energy Efficient Priority-Based Task Scheduling for Computation Offloading in Fog Computing.",
                    "Space-Heuristic Navigation and Occupancy Map Prediction for Robot Autonomous Exploration.",
                    "Edge DDoS Attack Detection Method Based on Software Defined Networks.",
                    "GradMFL: Gradient Memory-Based Federated Learning for Hierarchical Knowledge Transferring Over Non-IID Data.",
                    "Linear Coded Federated Learning.",
                    "Verifiable Dynamic Searchable Symmetric Encryption with Forward Privacy in Cloud-Assisted E-Healthcare Systems.",
                    "Security Analysis of Poisoning Attacks Against Multi-agent Reinforcement Learning.",
                    "A Blockchain-Based Proxy Oriented Cloud Storage Public Audit Scheme for Low-Performance Terminal Devices.",
                    "Sunspot: A Decentralized Framework Enabling Privacy for Authorizable Data Sharing on Transparent Public Blockchains.",
                    "A Novel Protection Method of Continuous Location Sharing Based on Local Differential Privacy and Conditional Random Field.",
                    "An Intelligent Allocation Mechanism Based on Ethereum Blockchain in Microgrid.",
                    "Multi-layer Adaptive Sampling for Per-Flow Spread Measurement.",
                    "Transformer-Based Rating-Aware Sequential Recommendation.",
                    "An Effective Single-Pass Approach for Estimating the Φ-quantile in Data Streams.",
                    "Fed-Tra: Improving Accuracy of Deep Learning Model on Non-iid in Federated Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2021-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 21st International Conference, ICA3PP 2021, Virtual Event, December 3-5, 2021, Proceedings, Part II.",
                "count": 48,
                "papers": [
                    "The Design and Realization of a Novel Intelligent Drying Rack System Based on STM32.",
                    "Efficient Estimation of Time-Dependent Shortest Paths Based on Shortcuts.",
                    "Multi-level PWB and PWC for Reducing TLB Miss Overheads on GPUs.",
                    "Hybrid GA-SVR: An Effective Way to Predict Short-Term Traffic Flow.",
                    "MobiTrack: Mobile Crowdsensing-Based Object Tracking with Min-Region and Max-Utility.",
                    "Faulty Processor Identification for a Multiprocessor System Under the PMC Model Using a Binary Grey Wolf Optimizer.",
                    "Fast On-Road Object Detector on ROS-Based Mobile Robot.",
                    "A Lightweight Asynchronous I/O System for Non-volatile Memory.",
                    "The Case for Disjoint Job Mapping on High-Radix Networked Parallel Computers.",
                    "FastCache: A Client-Side Cache with Variable-Position Merging Schema in Network Storage System.",
                    "An Efficient Parallelization Model for Sparse Non-negative Matrix Factorization Using cuSPARSE Library on Multi-GPU Platform.",
                    "HaDPA: A Data-Partition Algorithm for Data Parallel Applications on Heterogeneous HPC Platforms.",
                    "A NUMA-Aware Parallel Truss Decomposition Algorithm for Large Scale Graphs.",
                    "Large-Scale Parallel Alignment Algorithm for SMRT Reads.",
                    "Square Fractional Repetition Codes for Distributed Storage Systems.",
                    "An Anti-forensic Method Based on RS Coding and Distributed Storage.",
                    "Predicting Consumers' Coupon-usage in E-commerce with Capsule Network.",
                    "A High-Availability K-modes Clustering Method Based on Differential Privacy.",
                    "A Strategy-based Optimization Algorithm to Design Codes for DNA Data Storage System.",
                    "Multi-Relational Hierarchical Attention for Top-k Recommendation.",
                    "EdgeSP: Scalable Multi-device Parallel DNN Inference on Heterogeneous Edge Clusters.",
                    "An Efficient Computation Offloading Strategy in Wireless Powered Mobile-Edge Computing Networks.",
                    "WiRD: Real-Time and Cross Domain Detection System on Edge Device.",
                    "Deep Learning with Enhanced Convergence and Its Application in MEC Task Offloading.",
                    "Dynamic Offloading and Frequency Allocation for Internet of Vehicles with Energy Harvesting.",
                    "SPACE: Sparsity Propagation Based DCNN Training Accelerator on Edge.",
                    "Worker Recruitment Based on Edge-Cloud Collaboration in Mobile Crowdsensing System.",
                    "Energy Efficient Deployment and Task Offloading for UAV-Assisted Mobile Edge Computing.",
                    "Research on Authentication and Key Agreement Protocol of Smart Medical Systems Based on Blockchain Technology.",
                    "CRchain: An Efficient Certificate Revocation Scheme Based on Blockchain.",
                    "Anonymous Authentication Scheme Based on Trust and Blockchain in VANETs.",
                    "BIPP: Blockchain-Based Identity Privacy Protection Scheme in Internet of Vehicles for Remote Anonymous Communication.",
                    "Self-adapted Frame Selection Module: Refine the Input Strategy for Video Saliency Detection.",
                    "Evolving Deep Parallel Neural Networks for Multi-Task Learning.",
                    "An Embedding Carrier-Free Steganography Method Based on Wasserstein GAN.",
                    "Design of Face Detection Algorithm Accelerator Based on Vitis.",
                    "FSAFA-stacking2: An Effective Ensemble Learning Model for Intrusion Detection with Firefly Algorithm Based Feature Selection.",
                    "Attention-Based Cross-Domain Gesture Recognition Using WiFi Channel State Information.",
                    "Font Transfer Based on Parallel Auto-encoder for Glyph Perturbation via Strokes Moving.",
                    "A Novel GNN Model for Fraud Detection in Online Trading Activities.",
                    "Non-interactive Zero Knowledge Proof Based Access Control in Information-Centric Internet of Things.",
                    "Simultaneous Charger Placement and Power Scheduling for On-Demand Provisioning of RF Wireless Charging Service.",
                    "A Cross-domain Authentication Scheme Based on Zero-Knowledge Proof.",
                    "NBUFlow: A Dataflow Based Universal Task Orchestration and Offloading Platform for Low-Cost Development of IoT Systems with Cloud-Edge-Device Collaborative Computing.",
                    "IoT-GAN: Anomaly Detection for Time Series in IoT Based on Generative Adversarial Networks.",
                    "Freshness and Power Balancing Scheduling for Cooperative Vehicle-Infrastructure System.",
                    "A Low Energy Consumption and Low Delay MAC Protocol Based on Receiver Initiation and Capture Effect in 5G IoT.",
                    "Building Portable ECG Classification Model with Cross-Dimension Knowledge Distillation."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2021-3",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 21st International Conference, ICA3PP 2021, Virtual Event, December 3-5, 2021, Proceedings, Part III.",
                "count": 48,
                "papers": [
                    "StateSnap: A State-Aware P2P Storage Network for Blockchain NFT Content Data.",
                    "Towards Requester-Provider Bilateral Utility Maximization and Collision Resistance in Blockchain-Based Microgrid Energy Trading.",
                    "Evaluating the Parallel Execution Schemes of Smart Contract Transactions in Different Blockchains: An Empirical Study.",
                    "Misbehavior Detection in VANET Based on Federated Learning and Blockchain.",
                    "ABE-AC4DDS: An Access Control Scheme Based on Attribute-Based Encryption for Data Distribution Service.",
                    "An Interactive Visual System for Data Analytics of Social Media.",
                    "Auto-Recon: An Automated Network Reconnaissance System Based on Knowledge Graph.",
                    "INGCF: An Improved Recommendation Algorithm Based on NGCF.",
                    "AutoFlow: Hotspot-Aware, Dynamic Load Balancing for Distributed Stream Processing.",
                    "BMTP: Combining Backward Matching with Tree-Based Pruning for Large-Scale Content-Based Pub/Sub Systems.",
                    "AF-TCP: Traffic Congestion Prediction at Arbitrary Road Segment and Flexible Future Time.",
                    "Collaborative QoS Prediction via Context-Aware Factorization Machine.",
                    "TDCT: Target-Driven Concolic Testing Using Extended Units by Calculating Function Relevance.",
                    "Multi-task Allocation Based on Edge Interaction Assistance in Mobile Crowdsensing.",
                    "A Variable-Way Address Translation Cache for the Exascale Supercomputer.",
                    "PPCTS: Performance Prediction-Based Co-located Task Scheduling in Clouds.",
                    "Risk-Aware Optimization of Distribution-Based Resilient Task Assignment in Edge Computing.",
                    "Budget-Aware Scheduling for Hyperparameter Optimization Process in Cloud Environment.",
                    "Workload Prediction and VM Clustering Based Server Energy Optimization in Enterprise Cloud Data Center.",
                    "Soft Actor-Critic-Based DAG Tasks Offloading in Multi-access Edge Computing with Inter-user Cooperation.",
                    "Sensor Data Normalization Among Heterogeneous Smartphones for Implicit Authentication.",
                    "Privacy-Preserving and Reliable Federated Learning.",
                    "Security Authentication of Smart Grid Based on RFF.",
                    "SEPoW: Secure and Efficient Proof of Work Sidechains.",
                    "A Spectral Clustering Algorithm Based on Differential Privacy Preservation.",
                    "A Compact Secret Image Sharing Scheme Based on Flexible Secret Matrix Sharing Scheme.",
                    "Robust Multi-model Personalized Federated Learning via Model Distillation.",
                    "V-EPTD: A Verifiable and Efficient Scheme for Privacy-Preserving Truth Discovery.",
                    "FedSP: Federated Speaker Verification with Personal Privacy Preservation.",
                    "Security Performance Analysis for Cellular Mobile Communication System with Randomly-Located Eavesdroppers.",
                    "Short and Distort Manipulations in the Cryptocurrency Market: Case Study, Patterns and Detection.",
                    "Privacy-Preserving Swarm Learning Based on Homomorphic Encryption.",
                    "A Modeling and Verification Method of Modbus TCP/IP Protocol.",
                    "Completely Independent Spanning Trees in the Line Graphs of Torus Networks.",
                    "Adjusting OBSS/PD Based on Fuzzy Logic to Improve Throughput of IEEE 802.11ax Network.",
                    "Two-Stage Evolutionary Algorithm Using Clustering for Multimodal Multi-objective Optimization with Imbalance Convergence and Diversity.",
                    "SLA: A Cache Algorithm for SSD-SMR Storage System with Minimum RMWs.",
                    "Trajectory Similarity Search with Multi-level Semantics.",
                    "Nonnegative Matrix Factorization Framework for Disease-Related CircRNA Prediction.",
                    "A Fast Authentication and Key Agreement Protocol Based on Time-Sensitive Token for Mobile Edge Computing.",
                    "Ferproof: A Constant Cost Range Proof Suitable for Floating-Point Numbers.",
                    "NEPG: Partitioning Large-Scale Power-Law Graphs.",
                    "Accelerating DCNNs via Cooperative Weight/Activation Compression.",
                    "PFA: Performance and Fairness-Aware LLC Partitioning Method.",
                    "SGP: A Parallel Computing Framework for Supporting Distributed Structural Graph Clustering.",
                    "LIDUSA - A Learned Index Structure for Dynamical Uneven Spatial Data.",
                    "Why is Your Trojan NOT Responding? A Quantitative Analysis of Failures in Backdoor Attacks of Neural Networks.",
                    "OptCL: A Middleware to Optimise Performance for High Performance Domain-Specific Languages on Heterogeneous Platforms."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "20th ICA3PP 2020",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2020-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 20th International Conference, ICA3PP 2020, New York City, NY, USA, October 2-4, 2020, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "COMBS: First Open-Source Based Benchmark Suite for Multi-physics Simulation Relevant HPC Research.",
                    "Efficient Sorting and Join on NVM-Based Hybrid Memory.",
                    "Parallel SCC Detection Based on Reusing Warps and Coloring Partitions on GPUs.",
                    "Procedure and Loop Level Speculative Parallelism Analysis in HPEC.",
                    "CTA: A Critical Task Aware Scheduling Mechanism for Dataflow Architecture.",
                    "An Adaptive Thread Partitioning Approach in Speculative Multithreading.",
                    "PMC-Based Dynamic Adaptive CPU and DRAM Power Modeling.",
                    "ParaCA: A Speculative Parallel Crawling Approach on Apache Spark.",
                    "A Multi-threaded Algorithm for Capacity Constrained Assignment over Road Networks.",
                    "A Dynamic Scheduling Strategy of ADMM Sub-problem Optimization Algorithm Based on Hierarchical Structure.",
                    "An Improved Heterogeneous Dynamic List Schedule Algorithm.",
                    "FastThetaJoin: An Optimization on Multi-way Data Stream θ-join with Range Constraints.",
                    "A Distributed Framework for Online Stream Data Clustering.",
                    "End-System Aware Large File Transfer Solution for Rich Media Applications over 5G Mobile Networks.",
                    "Broad Learning System with Proportional-Integral-Differential Gradient Descent.",
                    "Accelerating De Novo Assembler WTDBG2 on Commodity Servers.",
                    "Typing Everywhere with an EMG Keyboard: A Novel Myo Armband-Based HCI Tool.",
                    "Accelerating Pattern Matching on Intel Xeon Phi Processors.",
                    "Redistributing and Optimizing High-Resolution Ocean Model POP2 to Million Sunway Cores.",
                    "Performance Optimization for Feature Extraction Section of DeepChem.",
                    "Principal Component Analysis for Fingerprint Positioning.",
                    "Priority Based Service Placement Strategy in Heterogeneous Mobile Edge Computing.",
                    "VTC: A Scheduling Framework Between Soft Real-Time and Hard Real-Time on Multimedia OS.",
                    "A BSP Based Approach for NFAs Intersection.",
                    "Tight Bound of Parallel Request Latency for Erasure-Coded Distributed Storage System.",
                    "High-Performance Simulations on GPUs Using Adaptive Time Steps.",
                    "Performance Modeling of Stencil Computation on SW26010 Processors.",
                    "Optimizing B+-Tree Searches on Coupled CPU-GPU Architectures.",
                    "OCVM: Optimizing the Isolation of Virtual Machines with Open-Channel SSDs.",
                    "CANRT: A Client-Active NVM-Based Radix Tree for Fast Remote Access.",
                    "Distributed and Parallel Ensemble Classification for Big Data Based on Kullback-Leibler Random Sample Partition.",
                    "SWAF: A Distributed Solar WSN Adaptive Framework.",
                    "Formalizing and Verifying Decentralized Systems with Extended Concurrent Separation Logic.",
                    "PRIAG: Proximal Reweighted Incremental Aggregated Gradient Algorithm for Distributed Optimizations.",
                    "Decentralized Expectation Maximization Algorithm.",
                    "Towards a Deep-Pipelined Architecture for Accelerating Deep GCN on a Multi-FPGA Platform.",
                    "Linear Scalability from Sharding and PoS.",
                    "Tree2tree Structural Language Modeling for Compiler Fuzzing.",
                    "Research and Design of Distribution Equipment Health Early Warning System.",
                    "Parallel Processing Algorithms for the Vehicle Routing Problem and Its Variants: A Literature Review with a Look into the Future.",
                    "Multi-scaled Non-local Means Parallel Filters for Medical Image Denoising.",
                    "Optimized HybridSketch: More Efficient with Analysis and Algorithm.",
                    "An Overlapping Community Detection Algorithm Based on Triangle Reduction Weighted for Large-Scale Complex Network.",
                    "Parallel Belief Propagation Optimized by Coloring on GPUs.",
                    "A Multiplatform Parallel Approach for Lattice Sieving Algorithms.",
                    "Effect of Evaporation on Aggregation Kinetics of Clusters: A Monte Carlo Simulation Study.",
                    "Processing in Memory Assisted MEC 3C Resource Allocation for Computation Offloading.",
                    "A Greedy Heuristic Based Beacons Selection for Localization.",
                    "A Periodic Variable Star Observation System with High Accuracy Based on Star Sensors."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2020-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 20th International Conference, ICA3PP 2020, New York City, NY, USA, October 2-4, 2020, Proceedings, Part II.",
                "count": 48,
                "papers": [
                    "Distributing Data in Real Time Spatial Data Warehouse.",
                    "Accelerating Sparse Convolutional Neural Networks Based on Dataflow Architecture.",
                    "DAFEE: A Scalable Distributed Automatic Feature Engineering Algorithm for Relational Datasets.",
                    "Embedding Augmented Cubes into Grid Networks for Minimum Wirelength.",
                    "ELVMC: A Predictive Energy-Aware Algorithm for Virtual Machine Consolidation in Cloud Computing.",
                    "Design of a Convolutional Neural Network Instruction Set Based on RISC-V and Its Microarchitecture Implementation.",
                    "Optimizing Accelerator on FPGA for Deep Convolutional Neural Networks.",
                    "HpQC: A New Efficient Quantum Computing Simulator.",
                    "Outsourced Privacy-Preserving Reduced SVM Among Multiple Institutions.",
                    "A Distributed Business-Aware Storage Execution Environment Towards Large-Scale Applications.",
                    "QoS-Aware and Fault-Tolerant Replica Placement.",
                    "Neural Network Compression and Acceleration by Federated Pruning.",
                    "Scalable Aggregation Service for Satellite Remote Sensing Data.",
                    "Edge-Assisted Federated Learning: An Empirical Study from Software Decomposition Perspective.",
                    "A Dynamic Partitioning Framework for Edge-Assisted Cloud Computing.",
                    "Deep Reinforcement Learning for Intelligent Migration of Fog Services in Smart Cities.",
                    "A Novel Clustering-Based Filter Pruning Method for Efficient Deep Neural Networks.",
                    "Fast Segmentation-Based Object Tracking Model for Autonomous Vehicles.",
                    "A Data Augmentation-Based Defense Method Against Adversarial Attacks in Neural Networks.",
                    "User Recruitment with Budget Redistribution in Edge-Aided Mobile Crowdsensing.",
                    "Multi-user Service Migration for Mobile Edge Computing Empowered Connected and Autonomous Vehicles.",
                    "A Precise Telecom Customer Tariff Promotion Method Based on Multi-route Radial Basis Kernel Fuzzy C-means Clustering.",
                    "Clustering by Unified Principal Component Analysis and Fuzzy C-Means with Sparsity Constraint.",
                    "A Hierarchical-Tree-Based Method for Generative Zero-Shot Learning.",
                    "Fast Computation of the Exact Number of Magic Series with an Improved Montgomery Multiplication Algorithm.",
                    "I am Smartglasses, and I Can Assist Your Reading.",
                    "CHEAPS2AGA: Bounding Space Usage in Variance-Reduced Stochastic Gradient Descent over Streaming Data and Its Asynchronous Parallel Variants.",
                    "A Quantum Computer Operating System.",
                    "Dynamic Knowledge Graph Completion with Jointly Structural and Textual Dependency.",
                    "MEFE: A Multi-fEature Knowledge Fusion and Evaluation Method Based on BERT.",
                    "Comparative Analysis of Three Kinds of Laser SLAM Algorithms.",
                    "Aspect-Level Sentiment Difference Feature Interaction Matching Model Based on Multi-round Decision Mechanism.",
                    "Horus: An Interference-Aware Resource Manager for Deep Learning Systems.",
                    "Attribute Bagging-Based Extreme Learning Machine.",
                    "A Semi-supervised Joint Entity and Relation Extraction Model Based on Tagging Scheme and Information Gain.",
                    "Research Progress of Zero-Shot Learning Beyond Computer Vision.",
                    "An Optimization of Deep Sensor Fusion Based on Generalized Intersection over Union.",
                    "A Hot/Cold Task Partition for Energy-Efficient Neural Network Deployment on Heterogeneous Edge Device.",
                    "Towards Energy Efficient Architecture for Spaceborne Neural Networks Computation.",
                    "Roda: A Flexible Framework for Real-Time On-demand Data Aggregation.",
                    "Structured Data Encoder for Neural Networks Based on Gradient Boosting Decision Tree.",
                    "Stochastic Model-Based Quantitative Analysis of Edge UPF Service Dependability.",
                    "QoE Estimation of DASH-Based Mobile Video Application Using Deep Reinforcement Learning.",
                    "Modeling and Analyzing for Data Durability Towards Cloud Storage Services.",
                    "CC-MOEA: A Parallel Multi-objective Evolutionary Algorithm for Recommendation Systems.",
                    "CS-Dict: Accurate Indoor Localization with CSI Selective Amplitude and Phase Based Regularized Dictionary Learning.",
                    "Recommendation with Temporal Dynamics Based on Sequence Similarity Search.",
                    "A Software Stack for Composable Cloud Robotics System."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2020-3",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 20th International Conference, ICA3PP 2020, New York City, NY, USA, October 2-4, 2020, Proceedings, Part III.",
                "count": 48,
                "papers": [
                    "Understanding Privacy-Preserving Techniques in Digital Cryptocurrencies.",
                    "LNBFSM: A Food Safety Management System Using Blockchain and Lightning Network.",
                    "Reputation-Based Trustworthy Supply Chain Management Using Smart Contract.",
                    "Content-Aware Anomaly Detection with Network Representation Learning.",
                    "Blockchain Based Data Integrity Verification for Cloud Storage with T-Merkle Tree.",
                    "IM-ACS: An Access Control Scheme Supporting Informal Non-malleable Security in Mobile Media Sharing System.",
                    "Blockchain-Based Secure and Privacy-Preserving Clinical Data Sharing and Integration.",
                    "Blockchain Meets DAG: A BlockDAG Consensus Mechanism.",
                    "Dynamic Co-located VM Detection and Membership Update for Residency Aware Inter-VM Communication in Virtualized Clouds.",
                    "An Attack-Immune Trusted Architecture for Supervisory Intelligent Terminal.",
                    "A Simulation Study on Block Generation Algorithm Based on TPS Model.",
                    "Improving iForest for Hydrological Time Series Anomaly Detection.",
                    "Machine Learning-Based Attack Detection Method in Hadoop.",
                    "Profiling-Based Big Data Workflow Optimization in a Cross-layer Coupled Design Framework.",
                    "Detection of Loose Tracking Behavior over Trajectory Data.",
                    "Behavioral Fault Modelling and Analysis with BIP: A Wheel Brake System Case Study.",
                    "H2P: A Novel Model to Study the Propagation of Modern Hybrid Worm in Hierarchical Networks.",
                    "Design of Six-Rotor Drone Based on Target Detection for Intelligent Agriculture.",
                    "Consensus in Lens of Consortium Blockchain: An Empirical Study.",
                    "Collaborative Design Service System Based on Ceramic Cloud Service Platform.",
                    "Towards NoC Protection of HT-Greyhole Attack.",
                    "Cross-shard Transaction Processing in Sharding Blockchains.",
                    "Lexicon-Enhanced Transformer with Pointing for Domains Specific Generative Question Answering.",
                    "Design of Smart Home System Based on Collaborative Edge Computing and Cloud Computing.",
                    "Classification of Depression Based on Local Binary Pattern and Singular Spectrum Analysis.",
                    "Cloud Allocation and Consolidation Based on a Scalability Metric.",
                    "Adversarial Attacks on Deep Learning Models of Computer Vision: A Survey.",
                    "FleetChain: A Secure Scalable and Responsive Blockchain Achieving Optimal Sharding.",
                    "DSBFT: A Delegation Based Scalable Byzantine False Tolerance Consensus Mechanism.",
                    "A Privacy-Preserving Approach for Continuous Data Publication.",
                    "Web Attack Detection Based on User Behaviour Semantics.",
                    "A Supervised Anonymous Issuance Scheme of Central Bank Digital Currency Based on Blockchain.",
                    "IncreAIBMF: Incremental Learning for Encrypted Mobile Application Identification.",
                    "A Multi-level Features Fusion Network for Detecting Obstructive Sleep Apnea Hypopnea Syndrome.",
                    "BIMP: Blockchain-Based Incentive Mechanism with Privacy Preserving in Location Proof.",
                    "Indoor Positioning and Prediction in Smart Elderly Care: Model, System and Applications.",
                    "Research on Stylization Algorithm of Ceramic Decorative Pattern Based on Ceramic Cloud Design Service Platform.",
                    "Blockchain Consensus Mechanisms and Their Applications in IoT: A Literature Survey.",
                    "Towards a Secure Communication of Data in IoT Networks: A Technical Research Report.",
                    "Efficient Thermography Guided Learning for Breast Cancer Detection.",
                    "PTangle: A Parallel Detector for Unverified Blockchain Transactions.",
                    "DOS-GAN: A Distributed Over-Sampling Method Based on Generative Adversarial Networks for Distributed Class-Imbalance Learning.",
                    "Effective Sentiment Analysis for Multimodal Review Data on the Web.",
                    "An Energy-Efficient AES Encryption Algorithm Based on Memristor Switch.",
                    "Digital Currency Investment Strategy Framework Based on Ranking.",
                    "Authentication Study for Brain-Based Computer Interfaces Using Music Stimulations.",
                    "An Ensemble Learning Approach to Detect Malwares Based on Static Information.",
                    "Automatic Medical Image Report Generation with Multi-view and Multi-modal Attention Mechanism."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "19th ICA3PP 2019",
        "info": "Melbourne, VIC, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2019-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 19th International Conference, ICA3PP 2019, Melbourne, VIC, Australia, December 9-11, 2019, Proceedings, Part I.",
                "count": 45,
                "papers": [
                    "PPS: A Low-Latency and Low-Complexity Switching Architecture Based on Packet Prefetch and Arbitration Prediction.",
                    "SWR: Using Windowed Reordering to Achieve Fast and Balanced Heuristic for Streaming Vertex-Cut Graph Partitioning.",
                    "Flexible Data Flow Architecture for Embedded Hardware Accelerators.",
                    "HBL-Sketch: A New Three-Tier Sketch for Accurate Network Measurement.",
                    "Accelerating Large Integer Multiplication Using Intel AVX-512IFMA.",
                    "A Communication-Avoiding Algorithm for Molecular Dynamics Simulation.",
                    "Out-of-Core GPU-Accelerated Causal Structure Learning.",
                    "Accelerating Lattice Boltzmann Method by Fully Exposing Vectorizable Loops.",
                    "A Solution for High Availability Memory Access.",
                    "Verification of Microservices Using Metamorphic Testing.",
                    "A New Robust and Reversible Watermarking Technique Based on Erasure Code.",
                    "Exit-Less Hypercall: Asynchronous System Calls in Virtualized Processes.",
                    "Automatic Optimization of Python Skeletal Parallel Programs.",
                    "Impromptu Rendezvous Based Multi-threaded Algorithm for Shortest Lagrangian Path Problem on Road Networks.",
                    "FANG: Fast and Efficient Successor-State Generation for Heuristic Optimization on GPUs.",
                    "DETER: Streaming Graph Partitioning via Combined Degree and Cluster Information.",
                    "Which Node Properties Identify the Propagation Source in Networks?",
                    "t/t-Diagnosability of BCube Network.",
                    "Strark-H: A Strategy for Spatial Data Storage to Improve Query Efficiency Based on Spark.",
                    "Multitask Assignment Algorithm Based on Decision Tree in Spatial Crowdsourcing Environment.",
                    "TIMOM: A Novel Time Influence Multi-objective Optimization Cloud Data Storage Model for Business Process Management.",
                    "RTEF-PP: A Robust Trust Evaluation Framework with Privacy Protection for Cloud Services Providers.",
                    "A Privacy-Preserving Access Control Scheme with Verifiable and Outsourcing Capabilities in Fog-Cloud Computing.",
                    "Utility-Aware Edge Server Deployment in Mobile Edge Computing.",
                    "Predicting Hard Drive Failures for Cloud Storage Systems.",
                    "Efficient Pattern Matching on CPU-GPU Heterogeneous Systems.",
                    "Improving Performance of Batch Point-to-Point Communications by Active Contention Reduction Through Congestion-Avoiding Message Scheduling.",
                    "An Open Identity Authentication Scheme Based on Blockchain.",
                    "RBAC-GL: A Role-Based Access Control Gasless Architecture of Consortium Blockchain.",
                    "Developing Patrol Strategies for the Cooperative Opportunistic Criminals.",
                    "Deep Learning vs. Traditional Probabilistic Models: Case Study on Short Inputs for Password Guessing.",
                    "A Fully Anonymous Authentication Scheme Based on Medical Environment.",
                    "RaNetMalDozer: A Novel NN-Based Model for Android Malware Detection Over Task Kernel Structures.",
                    "Moving Target Defense Against Injection Attacks.",
                    "Tiger Tally: Cross-Domain Scheme for Different Authentication Mechanism.",
                    "Simultaneously Advising via Differential Privacy in Cloud Servers Environment.",
                    "Feature Generation: A Novel Intrusion Detection Model Based on Prototypical Network.",
                    "Topic Reconstruction: A Novel Method Based on LDA Oriented to Intrusion Detection.",
                    "PDGAN: A Novel Poisoning Defense Method in Federated Learning Using Generative Adversarial Network.",
                    "A Geo-indistinguishable Location Privacy Preservation Scheme for Location-Based Services in Vehicular Networks.",
                    "A Behavior-Based Method for Distinguishing the Type of C&C Channel.",
                    "Sparse Representation for Device-Free Human Detection and Localization with COTS RFID.",
                    "A Novel Approach to Cost-Efficient Scheduling of Multi-workflows in the Edge Computing Environment with the Proximity Constraint.",
                    "Differential Privacy Preservation for Smart Meter Systems.",
                    "Secure Multi-receiver Communications: Models, Proofs, and Implementation."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2019-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 19th International Conference, ICA3PP 2019, Melbourne, VIC, Australia, December 9-11, 2019, Proceedings, Part II.",
                "count": 57,
                "papers": [
                    "SPM: Modeling Spark Task Execution Time from the Sub-stage Perspective.",
                    "Improving the Parallelism of CESM on GPU.",
                    "Parallel Approach to Sliding Window Sums.",
                    "Rise the Momentum: A Method for Reducing the Training Error on Multiple GPUs.",
                    "Pimiento: A Vertex-Centric Graph-Processing Framework on a Single Machine.",
                    "Parallel Software Testing Sequence Generation Method Target at Full Covering Tested Behaviors.",
                    "Accurate Network Flow Measurement with Deterministic Admission Policy.",
                    "A Comparison Study of VAE and GAN for Software Fault Prediction.",
                    "A Framework for Designing Autonomous Parallel Data Warehouses.",
                    "Stable Clustering Algorithm for Routing Establishment in Vehicular Ad-Hoc Networks.",
                    "Utility-Based Location Distribution Reverse Auction Incentive Mechanism for Mobile Crowd Sensing Network.",
                    "Safeguarding Against Active Routing Attack via Online Learning.",
                    "Reliability Aware Cost Optimization for Memory Constrained Cloud Workflows.",
                    "Null Model and Community Structure in Heterogeneous Networks.",
                    "An Asynchronous Algorithm to Reduce the Number of Data Exchanges.",
                    "Two-Stage Clustering Hot Event Detection Model for Micro-blog on Spark.",
                    "Mobility-Aware Workflow Offloading and Scheduling Strategy for Mobile Edge Computing.",
                    "HSPP: Load-Balanced and Low-Latency File Partition and Placement Strategy on Distributed Heterogeneous Storage with Erasure Coding.",
                    "Adaptive Clustering for Outlier Identification in High-Dimensional Data.",
                    "Penguin Search Aware Proactive Application Placement.",
                    "A Data Uploading Strategy in Vehicular Ad-hoc Networks Targeted on Dynamic Topology: Clustering and Cooperation.",
                    "Cloud Server Load Turning Point Prediction Based on Feature Enhanced Multi-task LSTM.",
                    "Neuron Fault Tolerance Capability Based Computation Reuse in DNNs.",
                    "Reliability Enhancement of Neural Networks via Neuron-Level Vulnerability Quantization.",
                    "A Fault Detection Algorithm for Cloud Computing Using QPSO-Based Weighted One-Class Support Vector Machine.",
                    "ParaMoC: A Parallel Model Checker for Pushdown Systems.",
                    "FastDRC: Fast and Scalable Genome Compression Based on Distributed and Parallel Processing.",
                    "A Parallel Approach to Advantage Actor Critic in Deep Reinforcement Learning.",
                    "Blockchain-PUF-Based Secure Authentication Protocol for Internet of Things.",
                    "Selective Velocity Distributed Indexing for Continuously Moving Objects Model.",
                    "A New Bitcoin Address Association Method Using a Two-Level Learner Model.",
                    "Fog Computing Based Traffic and Car Parking Intelligent System.",
                    "Semi-supervised Deep Learning for Network Anomaly Detection.",
                    "A Vulnerability Assessment Method for Network System Based on Cooperative Game Theory.",
                    "Enhancing Model Performance for Fraud Detection by Feature Engineering and Compact Unified Expressions.",
                    "Network Intrusion Detection Framework Based on Embedded Tree Model.",
                    "Generative Adversarial Nets Enhanced Continual Data Release Using Differential Privacy.",
                    "Data Poisoning Attacks on Graph Convolutional Matrix Completion.",
                    "Secure Data Deduplication with Resistance to Side-Channel Attacks via Fog Computing.",
                    "Practical IDS on In-vehicle Network Against Diversified Attack Models.",
                    "Ultragloves: Lowcost Finger-Level Interaction System for VR-Applications Based on Ultrasonic Movement Tracking.",
                    "Adaptive Detection Method for Packet-In Message Injection Attack in SDN.",
                    "PMRS: A Privacy-Preserving Multi-keyword Ranked Search over Encrypted Cloud Data.",
                    "Privacy-Preserving Fine-Grained Outsourcing PHR with Efficient Policy Updating.",
                    "Lightweight Outsourced Privacy-Preserving Heart Failure Prediction Based on GRU.",
                    "DAPS: A Decentralized Anonymous Payment Scheme with Supervision.",
                    "An Approach of Secure Two-Way-Pegged Multi-sidechain.",
                    "DCRRDT: A Method for Deployment and Control of RFID Sensors Under Digital Twin-Driven for Indoor Supervision.",
                    "A Binary Code Sequence Based Tracking Algorithm in Wireless Sensor Networks.",
                    "Sampling Based Katz Centrality Estimation for Large-Scale Social Networks.",
                    "Location Prediction for Social Media Users Based on Information Fusion.",
                    "Concurrent Software Fine-Coarse-Grained Automatic Modeling Method for Algorithm Error Detection.",
                    "EC-ARR: Using Active Reconstruction to Optimize SSD Read Performance.",
                    "Research of Benchmarking and Selection for TSDB.",
                    "HDF5-Based I/O Optimization for Extragalactic HI Data Pipeline of FAST.",
                    "Understanding the Resource Demand Differences of Deep Neural Network Training.",
                    "Twitter Event Detection Under Spatio-Temporal Constraints."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "18th ICA3PP 2018",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2018-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings, Part I.",
                "count": 45,
                "papers": [
                    "Network-Aware Grouping in Distributed Stream Processing Systems.",
                    "vPlacer: A Co-scheduler for Optimizing the Performance of Parallel Jobs in Xen.",
                    "Document Nearest Neighbors Query Based on Pairwise Similarity with MapReduce.",
                    "Accurate Identification of Internet Video Traffic Using Byte Code Distribution Features.",
                    "RISC: Risk Assessment of Instance Selection in Cloud Markets.",
                    "Real-Time Data Stream Partitioning over a Sliding Window in Real-Time Spatial Big Data.",
                    "A Priority and Fairness Mixed Compaction Scheduling Mechanism for LSM-tree Based KV-Stores.",
                    "PruX: Communication Pruning of Parallel BFS in the Graph 500 Benchmark.",
                    "Comparative Study of Distributed Deep Learning Tools on Supercomputers.",
                    "Noncooperative Optimization of Multi-user Request Strategy in Cloud Service Composition Reservation.",
                    "Most Memory Efficient Distributed Super Points Detection on Core Networks.",
                    "Parallel Implementation and Optimizations of Visibility Computing of 3D Scene on Tianhe-2 Supercomputer.",
                    "Efficient Algorithms of Parallel Skyline Join over Data Streams.",
                    "Air Flow Based Failure Model for Data Centers.",
                    "Adaptive Load Balancing on Multi-core IPsec Gateway.",
                    "An Active Learning Based on Uncertainty and Density Method for Positive and Unlabeled Data.",
                    "TAMM: A New Topology-Aware Mapping Method for Parallel Applications on the Tianhe-2A Supercomputer.",
                    "Adaptive Data Sampling Mechanism for Process Object.",
                    "MedusaVM: Decentralizing Virtual Memory System for Multithreaded Applications on Many-core.",
                    "An Efficient Retrieval Method for Astronomical Catalog Time Series Data.",
                    "Correction to: An Efficient Retrieval Method for Astronomical Catalog Time Series Data.",
                    "Maintaining Root via Custom Android Kernel Across Over-The-Air Upgrade.",
                    "Accelerating Pattern Matching with CPU-GPU Collaborative Computing.",
                    "An Incremental Map Matching Algorithm Based on Weighted Shortest Path.",
                    "Asynchronous Parallel Dijkstra's Algorithm on Intel Xeon Phi Processor - How to Accelerate Irregular Memory Access Algorithm.",
                    "DA Placement: A Dual-Aware Data Placement in a Deduplicated and Erasure-Coded Storage System.",
                    "Improving Restore Performance of Deduplication Systems by Leveraging the Chunk Sequence in Backup Stream.",
                    "Blockchain-Based Secure and Reliable Distributed Deduplication Scheme.",
                    "Controlled Channel Attack Detection Based on Hardware Virtualization.",
                    "CuAPSS: A Hybrid CUDA Solution for AllPairs Similarity Search.",
                    "A Parallel Branch and Bound Algorithm for the Probabilistic TSP.",
                    "Accelerating Artificial Bee Colony Algorithm with Elite Neighborhood Learning.",
                    "Distributed Parallel Simulation of Primary Sample Space Metropolis Light Transport.",
                    "Parallel Statistical and Machine Learning Methods for Estimation of Physical Load.",
                    "Parallel Communication Mechanisms in Solving Integral Equations for Electromagnetic Scattering Based on the Method of Moments.",
                    "POWER: A Parallel-Optimization-Based Framework Towards Edge Intelligent Image Recognition and a Case Study.",
                    "SP-TSRM: A Data Grouping Strategy in Distributed Storage System.",
                    "Abstract Parallel Array Types and Ghost Cell Update Implementation.",
                    "Accelerating Low-End Edge Computing with Cross-Kernel Functionality Abstraction.",
                    "A High-Performance and High-Reliability RAIS5 Storage Architecture with Adaptive Stripe.",
                    "ADAM: An Adaptive Directory Accelerating Mechanism for NVM-Based File Systems.",
                    "A Parallel Method for All-Pair SimRank Similarity Computation.",
                    "CLDM: A Cache Cleaning Algorithm for Host Aware SMR Drives.",
                    "HyGrid: A CPU-GPU Hybrid Convolution-Based Gridding Algorithm in Radio Astronomy.",
                    "COUSTIC: Combinatorial Double Auction for Crowd Sensing Task Assignment in Device-to-Device Clouds."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2018-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings, Part II.",
                "count": 47,
                "papers": [
                    "Embedding Exchanged Hypercubes into Rings and Ladders.",
                    "Rim Chain: Bridge the Provision and Demand Among the Crowd.",
                    "Optimal Schedule of Mobile Edge Computing Under Imperfect CSI.",
                    "ST-LDA: High Quality Similar Words Augmented LDA for Service Clustering.",
                    "LMCC: Lazy Message and Centralized Cache for Asynchronous Graph Computing.",
                    "Differential Evolution with Proximity-Based Replacement Strategy and Elite Archive Mechanism for Global Optimization.",
                    "NESTLE: Incentive Mechanism Specialized for Computation Offloading in Local Edge Community.",
                    "A Study on Emotion Recognition Based on Hierarchical Adaboost Multi-class Algorithm.",
                    "A Low Communication Overhead Breadth-First Search Based on Global Bitmap.",
                    "Improve Heteroscedastic Discriminant Analysis by Using CBP Algorithm.",
                    "Fault Diagnosis Algorithm for WSN Based on Clustering and Credibility.",
                    "Generating Misleading Labels in Machine Learning Models.",
                    "An Energy-Efficient DV-Hop Localization Algorithm.",
                    "ASA-routing: A-Star Adaptive Routing Algorithm for Network-on-Chips.",
                    "Trajectory Data-Driven Pattern Recognition of Congestion Propagation in Road Networks.",
                    "Cooperative Preprocessing at Petabytes on High Performance Computing System.",
                    "Sibyl: Host Load Prediction with an Efficient Deep Learning Model in Cloud Computing.",
                    "An Energy-Efficient Objective Optimization Model for Dynamic Management of Reliability and Delay in WSNs.",
                    "An Improvement of PAA on Trend-Based Approximation for Time Series.",
                    "Research on Data Recovery Technology Based on Flash Memory Device.",
                    "Scheduling DAG Applications for Time Sharing Systems.",
                    "Job Scheduling with Adaptable Computing Levels for Edge Computing.",
                    "A Clustering Algorithm of High-Dimensional Data Based on Sequential Psim Matrix and Differential Truncation.",
                    "Enhanced Differential Evolution with Self-organizing Map for Numerical Optimization.",
                    "Similarity Measure for Patients via A Siamese CNN Network.",
                    "A New Artificial Bee Colony Algorithm for Solving Large-Scale Optimization Problems.",
                    "Implementation and Optimization of Multi-dimensional Real FFT on ARMv8 Platform.",
                    "SPMP: A JavaScript Support for Shared Persistent Memory on Node.js.",
                    "Dynamic Obstacle Avoidance Planning Algorithm for UAV Based on Dubins Path.",
                    "An Energy Efficient and Lifetime Aware Routing Protocol in Ad Hoc Networks.",
                    "On Optimization of Energy Consumption in a Volunteer Cloud - Strategy of Placement and Migration of Dynamic Services.",
                    "More Effective Distributed Deep Learning Using Staleness Based Parameter Updating.",
                    "A Game Theoretic D2D Local Caching System under Heterogeneous Video Preferences and Social Reciprocity.",
                    "SMIM: Superpixel Mutual Information Measurement for Image Quality Assessment.",
                    "DARM: A Deduplication-Aware Redundancy Management Approach for Reliable-Enhanced Storage Systems.",
                    "K-Anonymity Algorithm Based on Improved Clustering.",
                    "Adaptive DAG Tasks Scheduling with Deep Reinforcement Learning.",
                    "RFGRU: A Novel Approach for Mobile Application Traffic Identification.",
                    "Energy-Efficient Data Temporal Consistency Maintenance for IoT Systems.",
                    "GpDL: A Spatially Aggregated Data Layout for Long-Term Astronomical Observation Archive.",
                    "A Virtual Machine Dynamic Adjustment Strategy Based on Load Forecasting.",
                    "A Data-Aware Energy-Saving Storage Management Strategy for On-Site Astronomical Observation at Dome A.",
                    "Distancer: A Host-Based Distributed Adaptive Load Balancer for Datacenter Traffic.",
                    "MoSa: A Modeling and Sentiment Analysis System for Mobile Application Big Data.",
                    "SDVRP-Based Reposition Routing in Bike-Sharing System.",
                    "GAI: A Centralized Tree-Based Scheduler for Machine Learning Workload in Large Shared Clusters.",
                    "Data-Centric Task Scheduling Algorithm for Hybrid Tasks in Cloud Data Centers."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2018-3",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings, Part III.",
                "count": 50,
                "papers": [
                    "TAMSA: Two-Stage Auction Mechanism for Spectrum Allocation in Cooperative Cognitive Radio Networks.",
                    "QoS-Driven Service Matching Algorithm Based on User Requirements.",
                    "Research on Overload Classification Method for Bus Images Based on Image Processing and SVM.",
                    "Accurate Acoustic Based Gesture Classification with Zero Start-Up Cost.",
                    "An Approach of Collecting Performance Anomaly Dataset for NFV Infrastructure.",
                    "An Axiomatization for BSP Algorithms.",
                    "Efficient and Secure Outsourced Linear Regression.",
                    "New Multi-objectives Scheduling Strategies in Docker SwarmKit.",
                    "Internet Performance Prediction Framework Based on PingER Dataset.",
                    "MS-RAID: An Energy-Saving Data Layout for CDP.",
                    "Incentivizing Multimedia Data Acquisition for Machine Learning System.",
                    "Toward Performance Prediction for Multi-BSP Programs in ML.",
                    "Exploiting the Table of Energy and Power Leverages.",
                    "A Semantic Web Based Intelligent IoT Model.",
                    "Accelerating CNNs Using Optimized Scheduling Strategy.",
                    "Data Analysis of Blended Learning in Python Programming.",
                    "APs Deployment Optimization for Indoor Fingerprint Positioning with Adaptive Particle Swarm Algorithm.",
                    "Deployment Optimization of Indoor Positioning Signal Sources with Fireworks Algorithm.",
                    "A Study of Sleep Stages Threshold Based on Multiscale Fuzzy Entropy.",
                    "Blind Estimation Algorithm Over Fast-Fading Multipath OFDM Channels.",
                    "Facial Shape and Expression Transfer via Non-rigid Image Deformation.",
                    "P-Schedule: Erasure Coding Schedule Strategy in Big Data Storage System.",
                    "Answer Aggregation of Crowdsourcing Employing an Improved EM-Based Approach.",
                    "A Parallel Fast Fourier Transform Algorithm for Large-Scale Signal Data Using Apache Spark in Cloud.",
                    "Task Offloading in Edge-Clouds with Budget Constraint.",
                    "Motion Trajectory Sequence-Based Map Matching Assisted Indoor Autonomous Mobile Robot Positioning.",
                    "Towards the Independent Spanning Trees in the Line Graphs of Interconnection Networks.",
                    "POEM: Pricing Longer for Edge Computing in the Device Cloud.",
                    "Mobility Analysis and Response for Software-Defined Internet of Things.",
                    "DStore: A Distributed Cloud Storage System Based on Smart Contracts and Blockchain.",
                    "Towards an Efficient and Real-Time Scheduling Platform for Mobile Charging Vehicles.",
                    "SoProtector: Securing Native C/C++ Libraries for Mobile Applications.",
                    "CloudPT: Performance Testing for Identifying and Detecting Bottlenecks in IaaS.",
                    "Smart Grid Power Trading Based on Consortium Blockchain in Internet of Things.",
                    "Energy-Efficient Offloading in Mobile Edge Computing with Edge-Cloud Collaboration.",
                    "Quantitatively Investigating Multihop Localization Errors in Regular 2-D Sensor Networks.",
                    "Optimizing WiFi AP Placement for Both Localization and Coverage.",
                    "PLZMA: A Parallel Data Compression Method for Cloud Computing.",
                    "A Caching-Based Parallel FP-Growth in Apache Spark.",
                    "Contextual-Field Supported Iterative Representation for Face Hallucination.",
                    "A Cancelable Multi-Biometric Template Generation Algorithm Based on Bloom Filter.",
                    "Streaming ETL in Polystore Era.",
                    "Communication-Aware Prediction-Based Online Scheduling in High-Performance Real-Time Embedded Systems.",
                    "Predicting SDC Vulnerability of Instructions Based on Random Forests Algorithm.",
                    "Hybrid Cloud Architecture for Cross-Platform Interoperability in Smart Homes.",
                    "Conflict-Free Block-with-Stride Access of 2D Storage Structure.",
                    "Graph-Based Indoor Localization with the Fusion of PDR and RFID Technologies.",
                    "UAV 3D Mobility Model Oriented to Dynamic and Uncertain Environment.",
                    "Acquiring Hidden Space via Modifying Block Bitmap for Android Devices.",
                    "Interest Relevance-Based Caching Design in Content-Centric Networking."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2018-4",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings, Part IV.",
                "count": 50,
                "papers": [
                    "Dynamic Task Scheduler for Real Time Requirement in Cloud Computing System.",
                    "CGAN Based Cloud Computing Server Power Curve Generating.",
                    "One-Sided Communication in Coarray Fortran: Performance Tests on TH-1A.",
                    "Reliable Content Delivery in Lossy Named Data Networks Based on Network Coding.",
                    "Verifying CTL with Unfoldings of Petri Nets.",
                    "Deep Q-Learning for Navigation of Robotic Arm for Tokamak Inspection.",
                    "The Design and Implementation of Random Linear Network Coding Based Distributed Storage System in Dynamic Networks.",
                    "Forward Secure Searchable Encryption Using Key-Based Blocks Chain Technique.",
                    "Harden Tamper-Proofing to Combat MATE Attack.",
                    "A Fast and Effective Detection of Mobile Malware Behavior Using Network Traffic.",
                    "A Scalable Pthreads-Compatible Thread Model for VM-Intensive Programs.",
                    "Efficient and Privacy-Preserving Query on Outsourced Spherical Data.",
                    "Detecting Advanced Persistent Threats Based on Entropy and Support Vector Machine.",
                    "MulAV: Multilevel and Explainable Detection of Android Malware with Data Fusion.",
                    "Identifying Bitcoin Users Using Deep Neural Network.",
                    "A Practical Privacy-Preserving Face Authentication Scheme with Revocability and Reusability.",
                    "Differentially Private Location Protection with Continuous Time Stamps for VANETs.",
                    "Fine-Grained Attribute-Based Encryption Scheme Supporting Equality Test.",
                    "Detecting Evil-Twin Attack with the Crowd Sensing of Landmark in Physical Layer.",
                    "Security Extension and Robust Upgrade of Smart-Watch Wi-Fi Controller Firmware.",
                    "A Java Code Protection Scheme via Dynamic Recovering Runtime Instructions.",
                    "Verifiable Outsourced Computation with Full Delegation.",
                    "Keyword Searchable Encryption with Fine-Grained Forward Secrecy for Internet of Thing Data.",
                    "IoT-SDNPP: A Method for Privacy-Preserving in Smart City with Software Defined Networking.",
                    "User Password Intelligence Enhancement by Dynamic Generation Based on Markov Model.",
                    "The BLE Fingerprint Map Fast Construction Method for Indoor Localization.",
                    "VISU: A Simple and Efficient Cache Coherence Protocol Based on Self-updating.",
                    "PPLDEM: A Fast Anomaly Detection Algorithm with Privacy Preserving.",
                    "Towards Secure Cloud Data Similarity Retrieval: Privacy Preserving Near-Duplicate Image Data Detection.",
                    "An Efficient Multi-keyword Searchable Encryption Supporting Multi-user Access Control.",
                    "Android Malware Detection Using Category-Based Permission Vectors.",
                    "Outsourced Privacy Preserving SVM with Multiple Keys.",
                    "Privacy-Preserving Task Allocation for Edge Computing Enhanced Mobile Crowdsensing.",
                    "Efficient Two-Party Privacy Preserving Collaborative k-means Clustering Protocol Supporting both Storage and Computation Outsourcing.",
                    "Identity-Based Proofs of Storage with Enhanced Privacy.",
                    "Evaluating the Impact of Intrusion Sensitivity on Securing Collaborative Intrusion Detection Networks Against SOOA.",
                    "Roundtable Gossip Algorithm: A Novel Sparse Trust Mining Method for Large-Scale Recommendation Systems.",
                    "An Associated Deletion Scheme for Multi-copy in Cloud Storage.",
                    "InterestFence: Countering Interest Flooding Attacks by Using Hash-Based Security Labels.",
                    "A Secure and Targeted Mobile Coupon Delivery Scheme Using Blockchain.",
                    "Access Delay Analysis in String Multi-hop Wireless Network Under Jamming Attack.",
                    "Anomaly Detection and Diagnosis for Container-Based Microservices with Performance Monitoring.",
                    "Integrated Prediction Method for Mental Illness with Multimodal Sleep Function Indicators.",
                    "Privacy-Aware Data Collection and Aggregation in IoT Enabled Fog Computing.",
                    "A Reputation Model for Third-Party Service Providers in Fog as a Service.",
                    "Attribute-Based VLR Group Signature Scheme from Lattices.",
                    "Construction of VMI Mode Supply Chain Management System Based on Block Chain.",
                    "H2-RAID: A Novel Hybrid RAID Architecture Towards High Reliability.",
                    "Sensitive Data Detection Using NN and KNN from Big Data.",
                    "Secure Biometric Authentication Scheme Based on Chaotic Map."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2018w",
                "sub_name": "Algorithms and Architectures for Parallel Processing - ICA3PP 2018 International Workshops, Guangzhou, China, November 15-17, 2018, Proceedings.",
                "count": 24,
                "papers": [
                    "An improved Grey Wolf Optimizer (iGWO) for Load Balancing in Cloud Computing Environment.",
                    "Indexed Coinduction in a Fibrational Setting.",
                    "Porting and Optimizing VASP on the SW26010.",
                    "A Data Reuse Method for Fast Search Motion Estimation.",
                    "I-Center Loss for Deep Neural Networks.",
                    "Nodes Deployment Optimization Algorithm of Underwater Wireless Sensor Networks.",
                    "A Novel Kernel Clustering Method for SVM Training Sample Reduction.",
                    "Implementation of Beamforming for Large-Scale Circular Array Sonar Based on Parallel FIR Filter Structure in FPGA.",
                    "A Practical and Aggressive Loop Fission Technique.",
                    "Super-Sampling by Learning-Based Super-Resolution.",
                    "Nodes Deployment Optimization Algorithm Based on Improved Evidence Theory.",
                    "The Research and Implementation of a Distributed Crawler System Based on Apache Flink.",
                    "A Security Reinforcement Technology of Telematics Box Based on Secure Element.",
                    "Detecting Fake Reviews Based on Review-Rating Consistency and Multi-dimensional Time Series.",
                    "Fake Comment Detection Based on Time Series and Density Peaks Clustering.",
                    "Towards Android Application Protection via Kernel Extension.",
                    "Threats and Coping Strategies Under the IOT.",
                    "Framework Design of Financial Service Platform for Tobacco Supply Chain Based on Blockchain.",
                    "Research on Application of Logistics Service Quality Management Based on Blockchain.",
                    "Research on the Application of RFID Technology in Logistics Warehousing Management System.",
                    "A DRDoS Detection and Defense Method Based on Deep Forest in the Big Data Environment.",
                    "An Improved Authentication Protocol in Telemedicine System.",
                    "Improving the Security of a Public Auditing Scheme for Multiple-Replica Dynamic Data.",
                    "Feature Extraction of Dichotomous Equipment Based on Non-intrusive Load Monitoring and Decomposition."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "17th ICA3PP 2017",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2017",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 17th International Conference, ICA3PP 2017, Helsinki, Finland, August 21-23, 2017, Proceedings.",
                "count": 66,
                "papers": [
                    "Workload Type-Aware Scheduling on big.LITTLE Platforms.",
                    "Pipelining Computation and Optimization Strategies for Scaling GROMACS on the Sunway Many-Core Processor.",
                    "Exploring FPGA-GPU Heterogeneous Architecture for ADAS: Towards Performance and Energy.",
                    "Hzmem: New Huge Page Allocator with Main Memory Compression.",
                    "An FPGA-Based Real-Time Moving Object Tracking Approach.",
                    "Automatic Acceleration of Stencil Codes in Android Devices.",
                    "Optimizing Concurrent Evacuation Transfers for Geo-Distributed Datacenters in SDN.",
                    "Energy-Balanced and Depth-Controlled Routing Protocol for Underwater Wireless Sensor Networks.",
                    "On the Energy Efficiency of Sleeping and Rate Adaptation for Network Devices.",
                    "Private and Efficient Set Intersection Protocol for Big Data Analytics.",
                    "A Topology-Aware Framework for Graph Traversals.",
                    "Adaptive Traffic Signal Control with Network-Wide Coordination.",
                    "A Novel Parallel Dual-Character String Matching Algorithm on Graphical Processing Units.",
                    "Distributed Nonnegative Matrix Factorization with HALS Algorithm on MapReduce.",
                    "GPU-Accelerated Block-Max Query Processing.",
                    "KD-Tree and HEALPix-Based Distributed Cone Search Indexing System for Multi-Band Astronomical Catalogs.",
                    "An Out-of-Core Branch and Bound Method for Solving the 0-1 Knapsack Problem on a GPU.",
                    "The Curve Boundary Design and Performance Analysis for DGM Based on OpenFOAM.",
                    "Leakage-Resilient Password-Based Authenticated Key Exchange.",
                    "Secure Encrypted Data Deduplication with Ownership Proof and User Revocation.",
                    "Optimally Selecting the Timing of Zero-Day Attack via Spatial Evolutionary Game.",
                    "Performance Analysis of a Ternary Optical Computer Based on M/M/1 Queueing System.",
                    "Efficient Computation Offloading for Various Tasks of Multiple Users in Mobile Edge Clouds.",
                    "A CNN-Based Supermarket Auto-Counting System.",
                    "Research and Implementation of Question Classification Model in Q&A System.",
                    "An Android Malware Detection System Based on Behavior Comparison Analysis.",
                    "Stream-Based Live Probabilistic Topic Computing and Matching.",
                    "Experiment for Analysing the Impact of Financial Events on Twitter.",
                    "APK-DFS: An Automatic Interaction System Based on Depth-First-Search for APK.",
                    "Optimized Data Layout for Spatio-temporal Data in Time Domain Astronomy.",
                    "Cloud Multimedia Files Assured Deletion Based on Bit Stream Transformation with Chaos Sequence.",
                    "Interval Merging Binary Tree.",
                    "Mining Suspicious Tax Evasion Groups in a Corporate Governance Network.",
                    "PerRec: A Permission Configuration Recommender System for Mobile Apps.",
                    "A Resource Manager for Maximizing the Performance of Bioinformatics Workflows in Shared Clusters.",
                    "Massively Parallel Sequence Alignment with BLAST Through Work Distribution Implemented Using PCJ Library.",
                    "On the Use of Binary Trees for DNA Hydroxymethylation Analysis.",
                    "Parallel Multi-objective Optimization for High-Order Epistasis Detection.",
                    "Configuring Concurrent Computation of Phylogenetic Partial Likelihoods: Accelerating Analyses Using the BEAGLE Library.",
                    "Accelerating FaST-LMM for Epistasis Tests.",
                    "Pipelined Multi-FPGA Genomic Data Clustering.",
                    "First Experiences Accelerating Smith-Waterman on Intel's Knights Landing Processor.",
                    "Power-Performance Evaluation of Parallel Multi-objective EEG Feature Selection on CPU-GPU Platforms.",
                    "Using Spark and GraphX to Parallelize Large-Scale Simulations of Bacterial Populations over Host Contact Networks.",
                    "PPCAS: Implementation of a Probabilistic Pairwise Model for Consistency-Based Multiple Alignment in Apache Spark.",
                    "Accelerating Exhaustive Pairwise Metagenomic Comparisons.",
                    "The Impact of International Inter-City Investment on Enterprises Performance: Pluralistic Interpretation of Geographical Death.",
                    "Energy Efficient Manycast Routing, Modulation Level and Spectrum Assignment in Elastic Optical Networks for Smart City Applications.",
                    "An Advanced Random Forest Algorithm Targeting the Big Data with Redundant Features.",
                    "En-Eye: A Cooperative Video Fusion Framework for Traffic Safety in Intelligent Transportation Systems.",
                    "Comparing Electricity Consumer Categories Based on Load Pattern Clustering with Their Natural Types.",
                    "When Clutter Reduction Meets Machine Learning for People Counting Using IR-UWB Radar.",
                    "Fine-Grained Infer PM_2.5 Using Images from Crowdsourcing.",
                    "Security/Reliability-Aware Relay Selection with Connection Duration Constraints for Vehicular Networks.",
                    "Smart City Environmental Perception from Ambient Cellular Signals.",
                    "A Multi-task Oriented Selection Strategy for Efficient Cooperation of Collocated Mobile Devices.",
                    "Research on Properties of Nodes Distribution on Internet of Vehicles.",
                    "Application of Batch and Stream Collaborative Computing in Urban Traffic Data Processing.",
                    "ESD-WSN: An Efficient SDN-Based Wireless Sensor Network Architecture for IoT Applications.",
                    "Probabilistic-Based Selection of Alternate Implementations for Heterogeneous Platforms.",
                    "Accelerating Processing of Scale-Free Graphs on Massively-Parallel Architectures.",
                    "A Hybrid Parallel Search Algorithm for Solving Combinatorial Optimization Problems on Multicore Clusters.",
                    "Concurrent Treaps.",
                    "Survey on Energy-Saving Technologies for Disk-Based Storage Systems.",
                    "The Open Community Runtime on the Intel Knights Landing Architecture.",
                    "High-Performance Graphics in Racket with DirectX."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "16th ICA3PP 2016",
        "info": "Granada, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2016",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 16th International Conference, ICA3PP 2016, Granada, Spain, December 14-16, 2016, Proceedings.",
                "count": 52,
                "papers": [
                    "Intelligent SPARQL Endpoints: Optimizing Execution Performance by Automatic Query Relaxation and Queue Scheduling.",
                    "Hardware-Based Sequential Consistency Violation Detection Made Simpler.",
                    "Optimized Mapping Spiking Neural Networks onto Network-on-Chip.",
                    "A Portable Lock-Free Bounded Queue.",
                    "A C++ Generic Parallel Pattern Interface for Stream Processing.",
                    "Creating Distributed Execution Plans with BobolangNG.",
                    "Deciding the Deadlock and Livelock in a Petri Net with a Target Marking Based on Its Basic Unfolding.",
                    "A New Scalable Approach for Distributed Metadata in HPC.",
                    "Enabling Android-Based Devices to High-End GPGPUs.",
                    "3-Additive Approximation Algorithm for Multicast Time in 2D Torus Networks.",
                    "Online Resource Coalition Reorganization for Efficient Scheduling on the Intercloud.",
                    "Graphein: A Novel Optical High-Radix Switch Architecture for 3D Integration.",
                    "Improving the Performance of Volunteer Computing with Data Volunteers: A Case Study with the ATLAS@home Project.",
                    "Microcities: A Platform Based on Microclouds for Neighborhood Services.",
                    "Impact of Shutdown Techniques for Energy-Efficient Cloud Data Centers.",
                    "Processing Partially Ordered Requests in Distributed Stream Processing Systems.",
                    "Implement and Optimization of Indoor Positioning System Based on Wi-Fi Signal.",
                    "Optimizing Inter-server Communications by Exploiting Overlapping Communities in Online Social Networks.",
                    "Road Segment Information Based Named Data Networking for Vehicular Environments.",
                    "Energy-Aware Query Processing on a Parallel Database Cluster Node.",
                    "Current Flow Betweenness Centrality with Apache Spark.",
                    "Light Loss-Less Data Compression, with GPU Implementation.",
                    "Deterministic Construction of Regular Geometric Graphs with Short Average Distance and Limited Edge Length.",
                    "A GPU-Based Backtracking Algorithm for Permutation Combinatorial Problems.",
                    "Buffer Minimization for Rate-Optimal Scheduling of Synchronous Dataflow Graphs on Multicore Systems.",
                    "Implementing Snapshot Objects on Top of Crash-Prone Asynchronous Message-Passing Systems.",
                    "Scaling DBSCAN-like Algorithms for Event Detection Systems in Twitter.",
                    "Towards Parallel CFD Computation for the ADAPT Framework.",
                    "Feedback Control Optimization for Performance and Energy Efficiency on CPU-GPU Heterogeneous Systems.",
                    "The Impact of Panel Factorization on the Gauss-Huard Algorithm for the Solution of Linear Systems on Modern Architectures.",
                    "Leveraging the Performance of LBM-HPC for Large Sizes on GPUs Using Ghost Cells.",
                    "Improving Hash Distributed A* for Shared Memory Architectures Using Abstraction.",
                    "On a Parallel Algorithm for the Determination of Multiple Optimal Solutions for the LCSS Problem.",
                    "Locality of Computation for Stencil Optimization.",
                    "GPU Computing to Speed-Up the Resolution of Microrheology Models.",
                    "Methodological Approach to Data-Centric Cloudification of Scientific Iterative Workflows.",
                    "Efficient Parallel Algorithm for Optimal DAG Structure Search on Parallel Computer with Torus Network.",
                    "Bin Recycling Strategy for an Accuracy-Aware Implementation of Two-Point Angular Correlation Function on GPU.",
                    "An Efficient Implementation of LZW Compression in the FPGA.",
                    "Shared Memory Tile-Based vs Hybrid Memory GOP-Based Parallel Algorithms for HEVC Encoder.",
                    "GPU-Based Heterogeneous Coding Architecture for HEVC.",
                    "Optimizing GPU Code for CPU Execution Using OpenCL and Vectorization: A Case Study on Image Coding.",
                    "Improving the Performance of Cardiac Simulations in a Multi-GPU Architecture Using a Coalesced Data and Kernel Scheme.",
                    "Dynamic Verifiable Search Over Encrypted Data in Untrusted Clouds.",
                    "Reducing TCB of Linux Kernel Using User-Space Device Driver.",
                    "OBC Based Optimization of Re-encryption for Cryptographic Cloud Storage.",
                    "Modeling Performance of Hadoop Applications: A Journey from Queueing Networks to Stochastic Well Formed Nets.",
                    "D-SPACE4Cloud: A Design Tool for Big Data Applications.",
                    "Porting Matlab Applications to High-Performance C++ Codes: CPU/GPU-Accelerated Spherical Deconvolution of Diffusion MRI Data.",
                    "On Stochastic Performance and Cost-Aware Optimal Capacity Planning of Unreliable Infrastructure-as-a-Service Cloud.",
                    "A Distributed Formal Model for the Analysis and Verification of Arbitration Protocols on MPSoCs Architecture.",
                    "Synthetic Traffic Model of the Graph500 Communications."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2016w",
                "sub_name": "Algorithms and Architectures for Parallel Processing - ICA3PP 2016 Collocated Workshops: SCDT, TAPEMS, BigTrust, UCER, DLMCS, Granada, Spain, December 14-16, 2016, Proceedings.",
                "count": 30,
                "papers": [
                    "OTFX: An In-memory Event Tracing Extension to the Open Trace Format 2.",
                    "Tuning the Blocksize for Dense Linear Algebra Factorization Routines with the Roofline Model.",
                    "Network-Aware Optimization of MPDATA on Homogeneous Multi-core Clusters with Heterogeneous Network.",
                    "Formalizing Data Locality in Task Parallel Applications.",
                    "Improving the Energy Efficiency of Evolutionary Multi-objective Algorithms.",
                    "A Parallel Model for Heterogeneous Cluster.",
                    "Comparative Analysis of OpenACC Compilers.",
                    "The Research of Recommendation System Based on User-Trust Mechanism and Matrix Decomposition.",
                    "Traffic Sign Recognition Based on Parameter-Free Detector and Multi-modal Representation.",
                    "Reversible Data Hiding Using Non-local Means Prediction.",
                    "Secure Data Access in Hadoop Using Elliptic Curve Cryptography.",
                    "Statistical Analysis of CCM.M-K1 International Comparison Based on Monte Carlo Method.",
                    "Redundancy Elimination in the ExaStencils Code Generator.",
                    "A Dataflow IR for Memory Efficient RIPL Compilation to FPGAs.",
                    "Exploring a Distributed Iterative Reconstructor Based on Split Bregman Using PETSc.",
                    "Implementation of the Beamformer Algorithm for the NVIDIA Jetson.",
                    "MARL-Ped+Hitmap: Towards Improving Agent-Based Simulations with Distributed Arrays.",
                    "Efficiency of GPUs for Relational Database Engine Processing.",
                    "Geocon: A Middleware for Location-Aware Ubiquitous Applications.",
                    "I/O-Focused Cost Model for the Exploitation of Public Cloud Resources in Data-Intensive Workflows.",
                    "Cellular ANTomata as Engines for Highly Parallel Pattern Processing.",
                    "Educational and Research Systems for Evaluating the Efficiency of Parallel Computations.",
                    "Generalized Approach to Scalability Analysis of Parallel Applications.",
                    "System Monitoring-Based Holistic Resource Utilization Analysis for Every User of a Large HPC Center.",
                    "Co-design of a Particle-in-Cell Plasma Simulation Code for Intel Xeon Phi: A First Look at Knights Landing.",
                    "Efficient Distributed Computations with DIRAC.",
                    "The Co-design of Astrophysical Code for Massively Parallel Supercomputers.",
                    "Hardware-Specific Selection the Most Fast-Running Software Components.",
                    "Automated Parallel Simulation of Heart Electrical Activity Using Finite Element Method.",
                    "Using hStreams Programming Library for Accelerating a Real-Life Application on Intel MIC."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15th ICA3PP 2015",
        "info": "Zhangjiajie, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2015-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 15th International Conference, ICA3PP 2015, Zhangjiajie, China, November 18-20, 2015, Proceedings, Part I.",
                "count": 55,
                "papers": [
                    "Parallelizing Block Cryptography Algorithms on Speculative Multicores.",
                    "Performance Characterization and Optimization for Intel Xeon Phi Coprocessor.",
                    "EH-Code: An Extended MDS Code to Improve Single Write Performance of Disk Arrays for Correcting Triple Disk Failures.",
                    "A Distributed Location-Based Service Discovery Protocol for Vehicular Ad-Hoc Networks.",
                    "Unified Virtual Memory Support for Deep CNN Accelerator on SoC FPGA.",
                    "DaSS: Dynamic Time Slice Scheduler for Virtual Machine Monitor.",
                    "Memory-Aware NoC Application Mapping Based on Adaptive Genetic Algorithm.",
                    "A Study on Non-volatile 3D Stacked Memory for Big Data Applications.",
                    "Parallel Implementation of Dense Optical Flow Computation on Many-Core Processor.",
                    "A Power-Conserving Online Scheduling Scheme for Video Streaming Services.",
                    "Prevent Deadlock and Remove Blocking for Self-Timed Systems.",
                    "Improving the Memory Efficiency of In-Memory MapReduce Based HPC Systems.",
                    "DBFS: Dual Best-First Search Mapping Algorithm for Shared-Cache Multicore Processors.",
                    "HVCRouter: Energy Efficient Network-on-Chip Router with Heterogeneous Virtual Channels.",
                    "Availability and Network-Aware MapReduce Task Scheduling over the Internet.",
                    "OptRS: An Optimized Algorithm Based on CRS Codes in Big Data Storage Systems.",
                    "Quantum Computer Simulation on Multi-GPU Incorporating Data Locality.",
                    "Query Execution Optimization Based on Incremental Update in Database Distributed Middleware.",
                    "Coding-Based Cooperative Caching in Data Broadcast Environments.",
                    "Usage History-Directed Power Management for Smartphones.",
                    "Application Streaming: A Mobile Application Distribution Method.",
                    "A Clustering Algorithm Based on Rough Sets for the Recommendation Domain in Trust-Based Access Control.",
                    "QoE Based Spectrum Allocation Optimization Using Bees Algorithm in Cognitive Radio Networks.",
                    "Dynamic Resource Provision for Cloud Broker with Multiple Reserved Instance Terms.",
                    "A Service Industry Perspective on Software Defined Radio Access Networks.",
                    "An Approach to Rapid Worker Discovery in Software Crowdsourcing.",
                    "STWM: A Solution to Self-adaptive Task-Worker Matching in Software Crowdsourcing.",
                    "GroupDRM: Group-Based Dynamic Resource Management Model in Wireless Network.",
                    "ESR: An Efficient, Scalable and Robust Overlay for Autonomic Communications.",
                    "Energy Efficient Sleep Scheduling for Wireless Sensor Networks.",
                    "QoS Prediction in Dynamic Web Services with Asymmetric Correlation.",
                    "A Personalized Recommendation Approach Based on Content Similarity Calculation in Large-Scale Data.",
                    "A General Methodology to Design Deadlock-Free Routing Algorithms for Mesh Networks.",
                    "Completion Time-Aware Flow Scheduling in Heterogenous Networks.",
                    "Towards VM Power Metering: A Decision Tree Method and Evaluations.",
                    "A Dynamic State Estimation of Power System Harmonics Using Distributed Related Kalman Filter.",
                    "An Efficient Cluster-Based Data Sharing Algorithm for Bidirectional Road Scenario in Vehicular Ad-hoc Networks.",
                    "A Distributed Joint Cooperative Routing and Channel Assignment in Multi-radio Wireless Mesh Network.",
                    "Improved Approximating Algorithms for Computing Energy Constrained Minimum Cost Steiner Trees.",
                    "A Hybrid Genetic Algorithm for Privacy and Cost Aware Scheduling of Data Intensive Workflow in Cloud.",
                    "A Metadata Management Strategy Based on Event- Classification in Intelligent Transportation System.",
                    "NRLoc: Neighbor Relative RSS-Based Indoor Localization System.",
                    "Social Attributes Based Cooperative Caching in Ad Hoc Networks.",
                    "Entropy-Based Social Influence Evaluation in Mobile Social Networks.",
                    "An Energy Efficient Multi-hop Charging Scheme with Mobile Charger for Wireless Rechargeable Sensor Network.",
                    "Distributed Compressive Sensing Based Data Gathering in Energy Harvesting Sensor Network.",
                    "Feedback Mechanism Based Dynamic Fingerprint Indoor Localization Algorithm in Wireless Sensor Networks.",
                    "A GPU Based Fast Community Detection Implementation for Social Network.",
                    "An Efficient Privacy-Preserving Compressive Data Gathering Scheme in WSNs.",
                    "A Group XOR-ing Coding Strategy Based on Wireless Network Overhearing.",
                    "An Energy-Balanced WSN Algorithm Based on Active Hibernation and Data Recovery.",
                    "MN-ALG: A Data Delivery Algorithm for Large Scale Wireless Electronic Shelf Label System.",
                    "The Optimization and Improvement of MapReduce in Web Data Mining.",
                    "An Intimacy-Based Algorithm for Social Network Community Detection.",
                    "A Method for Detection of Anomaly Node in IOT."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2015-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 15th International Conference, ICA3PP 2015, Zhangjiajie, China, November 18-20, 2015, Proceedings, Part II.",
                "count": 50,
                "papers": [
                    "PAHDFS: Preference-Aware HDFS for Hybrid Storage.",
                    "Urban Traffic Congestion Prediction Using Floating Car Trajectory Data.",
                    "A Metadata Cooperative Caching Architecture Based on SSD and DRAM for File Systems.",
                    "Parallel Training GBRT Based on KMeans Histogram Approximation for Big Data.",
                    "DBSCAN-M: An Intelligent Clustering Algorithm Based on Mutual Reinforcement.",
                    "An Effective Method for Gender Classification with Convolutional Neural Networks.",
                    "AQUAdex: A Highly Efficient Indexing and Retrieving Method for Astronomical Big Data of Time Series Images.",
                    "SAKMA: Specialized FPGA-Based Accelerator Architecture for Data-Intensive K-Means Algorithms.",
                    "HDCat: Effectively Identifying Hot Data in Large-Scale I/O Streams with Enhanced Temporal Locality.",
                    "LuBase: A Search-Efficient Hybrid Storage System for Massive Text Data.",
                    "Enhancing Parallel Data Loading for Large Scale Scientific Database.",
                    "Tradeoff Between the Price of Distributing a Database and Its Collusion Resistance Based on Concatenated Codes.",
                    "A MapReduce Reinforced Distributed Sequential Pattern Mining Algorithm.",
                    "SHDC: A Fast Documents Classification Method Based on Simhash.",
                    "Identification of Natural Images and Computer Generated Graphics Using Multi-fractal Differences of PRNU.",
                    "Feature Selection Method Based on Feature's Classification Bias and Performance.",
                    "Enriching Document Representation with the Deviations of Word Co-occurrence Frequencies.",
                    "Big Data Analytics and Visualization with Spatio-Temporal Correlations for Traffic Accidents.",
                    "A Novel APP Recommendation Method Based on SVD and Social Influence.",
                    "SHB + -Tree: A Segmentation Hybrid Index Structure for Temporal Data.",
                    "Fusion-Cache: A Refactored Content-Aware Host-Side SSD Cache.",
                    "A Novel Storing and Accessing Method of Traffic Incident Video Based on Spatial-Temporal Analysis.",
                    "Arbitrary-Length Jacket-Haar Transforms.",
                    "Circulant Euler-Jacket Transform and Its Applications Based on Fast Algorithm.",
                    "Deadline-Oriented Task Scheduling for MapReduce Environments.",
                    "Bitwise Data Parallelism with LLVM: The ICgrep Case Study.",
                    "Parallel Bloom Filter on Xeon Phi Many-Core Processors.",
                    "A List Scheduling Algorithm for DAG-Based Parallel Computing Models.",
                    "One-to-One Disjoint Path Covers on Mesh.",
                    "Parallel Computing Method for HRV Time-Domain Based on GPU.",
                    "Accelerated Steiner Tree Problem Solving on GPU with CUDA.",
                    "Self-Timed Periodic Scheduling of Data-Dependent Tasks in Embedded Streaming Applications.",
                    "A Novel Concurrent Generalized Deadlock Detection Algorithm in Distributed Systems.",
                    "BiTEM: A Two-Tier Energy Efficient Resource Management Framework for Real-Time Tasks in Clusters.",
                    "Multitask Oriented GPU Resource Sharing and Virtualization in Cloud Environment.",
                    "Solving Large Graph Problems in MapReduce-Like Frameworks via Optimized Parameter Configuration.",
                    "A Dynamic Extension and Data Migration Method Based on PVFS.",
                    "Fast 3-Point Correlation Function Approximation on GPU.",
                    "Efficient Scheduling with Intensive In-Memory File Accesses Considering Bandwidth Constraint on Memory Bus.",
                    "GPU-Accelerated Algorithm for Fast Computation of Biomolecular Isotopic Envelopes.",
                    "Cost-Efficient and Scalable Multicast Tree in Software Defined Networking.",
                    "Parallel Data Regeneration Based on Multiple Trees with Network Coding in Distributed Storage System.",
                    "Maximize Throughput Scheduling and Cost-Fairness Optimization for Multiple DAGs with Deadline Constraint.",
                    "Unified Multi-constraint and Multi-objective Workflow Scheduling for Cloud System.",
                    "Bi-objective Optimization Genetic Algorithm of the Energy Consumption and Reliability for Workflow Applications in Heterogeneous Computing Systems.",
                    "PE-TLD: Parallel Extended Tracking-Learning-Detection for Multi-target Tracking.",
                    "Partitioning of Hypergraph Modeled Complex Networks Based on Information Entropy.",
                    "Improving Performance of Floating Point Division on GPU and MIC.",
                    "UniDegree: A GPU-Based Graph Representation for SSSP.",
                    "MTTF-Aware Reliability Task Scheduling for Heterogeneous Multicore System."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2015-3",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 15th International Conference, ICA3PP 2015, Zhangjiajie, China, November 18-20, 2015. Proceedings, Part III.",
                "count": 57,
                "papers": [
                    "On Exploring a Virtual Agent Negotiation Inspired Approach for Route Guidance in Urban Traffic Networks.",
                    "Optimization of Binomial Option Pricing on Intel MIC Heterogeneous System.",
                    "Stencil Computations on HPC-oriented ARMv8 64-Bit Multi-Core Processor.",
                    "A Particle Swarm Optimization Algorithm for Controller Placement Problem in Software Defined Network.",
                    "A Streaming Execution Method for Multi-services in Mobile Cloud Computing.",
                    "Economy-Oriented Deadline Scheduling Policy for Render System Using IaaS Cloud.",
                    "Towards Detailed Tissue-Scale 3D Simulations of Electrical Activity and Calcium Handling in the Human Cardiac Ventricle.",
                    "Task Parallel Implementation of Matrix Multiplication on Multi-socket Multi-core Architectures.",
                    "Refactoring for Separation of Concurrent Concerns.",
                    "Exploiting Scalable Parallelism for Remote Sensing Analysis Models by Data Transformation Graph.",
                    "Resource-Efficient Vibration Data Collection in Cyber-Physical Systems.",
                    "A New Approach for Vehicle Recognition and Tracking in Multi-camera Traffic System.",
                    "DFIS: A Scalable Distributed Fingerprint Identification System.",
                    "Energy Saving and Load Balancing for SDN Based on Multi-objective Particle Swarm Optimization.",
                    "Pre-stack Kirchhoff Time Migration on Hadoop and Spark.",
                    "A Cyber Physical System with GPU for CNC Applications.",
                    "NCPSO: A Solution of the Controller Placement Problem in Software Defined Networks.",
                    "Parallel Column Subset Selection of Kernel Matrix for Scaling up Support Vector Machines.",
                    "Real-Time Deconvolution with GPU and Spark for Big Imaging Data Analysis.",
                    "Parallel Kirchhoff Pre-Stack Depth Migration on Large High Performance Clusters.",
                    "MrBayes for Phylogenetic Inference Using Protein Data on a GPU Cluster.",
                    "Paralleled Continuous Tabu Search Algorithm with Sine Maps and Staged Strategy for Solving CNOP.",
                    "VCLT: An Accurate Trajectory Tracking Attack Based on Crowdsourcing in VANETs.",
                    "A Novel Search Engine-Based Method for Discovering Command and Control Server.",
                    "Leveraging Behavior Diversity to Detect Spammers in Online Social Networks.",
                    "A Proactive Fault Tolerance Scheme for Large Scale Storage Systems.",
                    "When Software Defined Networks Meet Fault Tolerance: A Survey.",
                    "A Novel Signature Generation Approach for Polymorphic Worms.",
                    "Scalable Access Policy for Attribute Based Encryption in Cloud Storage.",
                    "Minimizing Resource Expenditure While Maximizing Destructiveness for Node Capture Attacks.",
                    "Deviation-Based Location Switching Protocol for Trajectory Privacy Protection.",
                    "Exploring Efficient and Robust Virtual Machine Introspection Techniques.",
                    "CRVad: Confidential Reasoning and Verification Towards Secure Routing in Ad Hoc Networks.",
                    "NMHP: A Privacy Preserving Profile Matching Protocol in Multi-hop Proximity Mobile Social Networks.",
                    "A New Data Replication Scheme for PVFS2.",
                    "Efficient Private Matching Scheme for Friend Information Exchange.",
                    "A Real-time Android Malware Detection System Based on Network Traffic Analysis.",
                    "Sky: Opinion Dynamics Based Consensus for P2P Network with Trust Relationships.",
                    "Adopting Multi-mode Access Control for Secure Data Sharing in Cloud.",
                    "A Scheme to Manage Encrypted Data Storage with Deduplication in Cloud.",
                    "HCBE: Achieving Fine-Grained Access Control in Cloud-Based PHR Systems.",
                    "Lightweight Virtual Machine Checkpoint and Rollback for Long-running Applications.",
                    "Fast and Scalable Regular Expressions Matching with Multi-Stride Index NFA.",
                    "A Robust and Efficient Detection Model of DDoS Attack for Cloud Services.",
                    "Secure Bisimulation for Interactive Systems.",
                    "Privacy Preserving for Network Coding in Smart Grid.",
                    "Verifiable Dynamic Fuzzy Search Over Encrypted Data in Cloud Computing.",
                    "A Secure and Fine-Grained Query Results Verification Scheme for Private Search Over Encrypted Cloud Data.",
                    "PEM4RFID: Privacy Enhancement Model for RFID Systems.",
                    "Improved WOW Adaptive Image Steganography Method.",
                    "CloudS: A Multi-cloud Storage System with Multi-level Security.",
                    "Crossing - A Highly Available Quorum Protocol for Arbitrary Planar Topologies.",
                    "Note on Fast Bridge Fault Test Generation Based on Critical Area.",
                    "Joint Redundancy and Inspection-Based Maintenance Optimization for Series-Parallel System.",
                    "Addressing NoC Reliability Through an Efficient Fibonacci-Based Crosstalk Avoidance Codec Design.",
                    "A Programming Framework for Implementing Fault-Tolerant Mechanism in IoT Applications.",
                    "An Agent-Based Framework for Simulating and Analysing Attacks on Cyber Physical Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2015-4",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 15th International Conference, ICA3PP 2015, Zhangjiajie, China, November 18-20, 2015. Proceedings, Part IV.",
                "count": 57,
                "papers": [
                    "FT-Offload: A Scalable Fault-Tolerance Programing Model on MIC Cluster.",
                    "MC-RAIS: Multi-chunk Redundant Array of Independent SSDs with Improved Performance.",
                    "An Energy Efficient Storage System for Astronomical Observation Data on Dome A.",
                    "Parallel Aware Hybrid Solid-State Storage.",
                    "Automatic Optimization of Software Transactional Memory Through Linear Regression and Decision Tree.",
                    "A Data-Centric Tool to Improve the Performance of Multithreaded Program on NUMA.",
                    "A Light-Weight Hot Data Identification Scheme via Grouping-based LRU Lists.",
                    "iPLAR: Towards Interactive Programming with Parallel Linear Algebra in R.",
                    "Enhancing I/O Scheduler Performance by Exploiting Internal Parallelism of SSDs.",
                    "A Performance and Scalability Analysis of the MPI Based Tools Utilized in a Large Ice Sheet Model Executing in a Multicore Environment.",
                    "An Efficient Algorithm for a Generalized LCS Problem.",
                    "On Exploring a Quantum Particle Swarm Optimization Method for Urban Traffic Light Scheduling.",
                    "Identifying Repeated Interleavings to Improve the Efficiency of Concurrency Bug Detection.",
                    "Global Reliability Evaluation for Cloud Storage Systems with Proactive Fault Tolerance.",
                    "Performance Evaluation and Optimization of Wi-Fi Display on Android.",
                    "A Novel Scheduling Algorithm for File Fetch in Transparent Computing.",
                    "Performance Evaluation of HPGMG on Tianhe-2: Early Experience.",
                    "Joint Power and Reduced Spectral Leakage-Based Resource Allocation for D2D Communications in 5G.",
                    "Performance Analysis for Job Scheduling in Hierarchical HPC Systems: A Coloured Petri Nets Method.",
                    "An Optimization Strategy of Energy Consumption for Data Transmission Based on Optimal Stopping Theory in Mobile Networks.",
                    "Exploration of the Relationship Between Just-in-Time Compilation Policy and Number of Cores.",
                    "CSAP: A Performance Predictor for Climate Simulation Applications on Intel CPUs.",
                    "On Routing Algorithms for the DPillar Data Centre Networks.",
                    "MR-COF: A Genetic MapReduce Configuration Optimization Framework.",
                    "Analysis of Repair Cost in Distributed Storage Systems with Fault-Tolerant Coding Strategies.",
                    "Design Efficient In-Database Video Storage Approach by Learning from Performance Evaluation of BLOB.",
                    "Skyline Query on Anti-correlated Distributions: From the Perspective of Spatial Index.",
                    "PNSICC: A Novel Parallel Network Security Inspection Mechanism Based on Cloud Computing.",
                    "Simulation Platform for X-Ray Computed Tomography Based on Low-Power Systems.",
                    "STRUCTURE: A Strategyproof Double Auction for Heterogeneous Secondary Spectrum Markets.",
                    "Reality Mining with Mobile Data: Understanding the Impact of Network Structure on Propagation Dynamics.",
                    "Reducing Journaling Overhead with Hybrid Buffer Cache.",
                    "A Green Scheduler for Cloud Data Centers Using Renewable Energy.",
                    "Fine-Grained Fault-Tolerant Adaptive Routing for Networks-on-Chip.",
                    "On the Optimal Provider Selection for Repair in Distributed Storage System with Network Coding.",
                    "Local State Reusing for Efficient Model Checking of Multithreaded Programs.",
                    "Intelligent Road Congestion Prediction Employing Queueing Based Model.",
                    "Evaluation and Analysis of Three Typical Resource Allocation Algorithms in Virtual Router Platform.",
                    "Beyond Data Parallelism: Identifying Parallel Tasks in Sequential Programs.",
                    "Fast Data-Dependence Profiling by Skipping Repeatedly Executed Memory Operations.",
                    "P-index: An Efficient Searchable Metadata Indexing Scheme Based on Data Provenance in Cold Storage.",
                    "Performance Optimization and Evaluation of Space Management in Cloud Storage Systems.",
                    "Performance Prediction for Concurrent Workloads in Distributed Database Systems.",
                    "An Energy-Aware File Relocation Strategy Based on File-Access Frequency and Correlations.",
                    "Projective Synchronization for Complex Dynamical Networks of Non-delayed and Delayed Coupling with Different Scale Factors via Impulsive Control.",
                    "Elastic Database Replication in the Cloud.",
                    "A Predetermined Deployment Technique for Lifetime Optimization in Clustered WSNs.",
                    "Traffic Replay in Virtual Network Based on IP-Mapping.",
                    "Optimizing the Overheads for Uncoordinated Proactive Checkpointing.",
                    "Tunneling-based Multi-path Routing Mechanism in Packet-Switched Non-Geostationary Satellite Networks.",
                    "Cost-Effective Scheduling Analysis Through Discrete Event Simulation for Distributed Systems.",
                    "Energy Consumption Prediction Based on Time-Series Models for CPU-Intensive Activities in the Cloud.",
                    "HYPAD: Hyper-Graph-Driven Approach for Parallel Data Warehouse Design.",
                    "Efficient Space Management and Wear Leveling for PCM-Based Storage Systems.",
                    "An Investigation of the Impact of Double Bit-Flip Error Variants on Program Execution.",
                    "An Efficient Dynamic Programming Algorithm for SEQ-IC-SEQ-EC-LCS Problem.",
                    "A Hybrid QoS Evaluation Tool Based on the Cloud Computing Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2015w",
                "sub_name": "Algorithms and Architectures for Parallel Processing - ICA3PP International Workshops and Symposiums, Zhangjiajie, China, November 18-20, 2015, Proceedings.",
                "count": 77,
                "papers": [
                    "Nth-Order Multifunction Filter Employing Current Differencing Transconductance Amplifiers.",
                    "An Efficient Spatial Query Processing Algorithm in Multi-sink Directional Sensor Network.",
                    "An Improved Method for Reversible Data Hiding in Encrypted Image.",
                    "Study on Personalized Location Privacy Preservation Algorithms Based on Road Networks.",
                    "A Hierarchical Identity-Based Signature from Composite Order Bilinear Groups.",
                    "STRATUS: Towards Returning Data Control to Cloud Users.",
                    "VSEP: A Distributed Algorithm for Graph Edge Partitioning.",
                    "Scheduling Stochastic Tasks with Precedence Constrain on Cluster Systems with Heterogenous Communication Architecture.",
                    "An Output-Oriented Approach of Test Data Generation Based on Genetic Algorithm.",
                    "An Efficient Pre-filter to Accelerate Regular Expression Matching.",
                    "A Hybrid Optimization Approach for Anonymizing Transactional Data.",
                    "Program Obfuscator for Privacy-Carrying Unidirectional One-hop Re-encryption.",
                    "Predicting Severity of Software Vulnerability Based on Grey System Theory.",
                    "Characterization of Android Applications with Root Exploit by Using Static Feature Analysis.",
                    "LIP3: A Lightweighted Fine-Grained Privacy-Preserving Profile Matching Mechanism for Mobile Social Networks in Proximity.",
                    "Context-Aware QoS Assurance for Smart Grid Big Data Processing with Elastic Cloud Resource Reconfiguration.",
                    "Continuous User Identity Verification for Trusted Operators in Control Rooms.",
                    "Leakage-Resilient Anonymous Identity-Based Broadcast Encryption in the Standard Model.",
                    "Scheduling Resource of IaaS Clouds for Energy Saving Based on Predicting the Overloading Status of Physical Machines.",
                    "Towards Mechanised Semantics of HPC: The BSP with Subgroup Synchronisation Case.",
                    "Cloud Computing Threats and Provider Security Assessment.",
                    "Collaborative Multiparty Association Rules Mining with Threshold Homomorphic Encryption.",
                    "An Illegal Indirect Access Prevention Method in Transparent Computing System.",
                    "EPAMP: An Anonymous Multicast Protocol in Mobile Ad Hoc Networks.",
                    "Energy Saving Mechanism Analysis Based on Dynamic Resource Scaling for Cloud Computing.",
                    "An Optimal Rate Adaptive Video Streaming Scheme to Improve QoE of Dash.",
                    "Community-Based Energy-Aware Routing Protocol in Mobile Social Networks.",
                    "Research of CMABC Algorithm in Intrusion Detection.",
                    "A Parallel Tabu Search Algorithm with Solution Space Partition for Cohesive Clustering Problems.",
                    "Symmetric Game for Distributed Estimation in Energy Harvesting Wireless Sensor Networks with Selfish Sensors.",
                    "File Creation Optimization for Metadata-Intensive Application in File Systems.",
                    "A Sharing-Memory Based Ring Framework.",
                    "Streaming Computing Technology for Android Applications: Design Model and Case Study.",
                    "An Energy-Efficient Aggregation and Collection Algorithm for Heterogeneous Wireless Sensor Network.",
                    "TDD-Based Massive MIMO Systems: Overview and Development.",
                    "A Hierarchical Shared Key Algorithm in Wireless Sensor Networks.",
                    "Evaluation Model of the Cloud Systems Based on Queuing Petri Net.",
                    "MTCPP: Multi-targets K-Coverage Preservation Protocol in Wireless Sensor Networks.",
                    "Design Flaws in a Secure Medical Data Exchange Protocol Based on Cloud Environments.",
                    "Privacy Preserving Personalization in Probabilistic Search.",
                    "A Security-Critical Task Management Method for Distributed Real-Time Systems.",
                    "A Model of Dynamic Malware Analysis Based on VMI.",
                    "Multiple Secret Sharing Using Natural Language Letter Based Visual Cryptography Scheme.",
                    "Reconstruction of Android Applications' Network Behavior Based on Application Layer Traffic.",
                    "Android Malware Network Behavior Analysis at HTTP Protocol Packet Level.",
                    "Energy Efficient Encryption Scheme for Network-Coded Mobile Ad Hoc Networks.",
                    "Attribute-Based Ring Signcryption Scheme and Its Application in Wireless Body Area Networks.",
                    "Dependable Cascading Target Tracking in Heterogeneous Mobile Camera Sensor Networks.",
                    "A Web-Based Resource Management Platform for Transparent Computing.",
                    "Architecture and Scheduling Method of Cloud Video Surveillance System Based on IoT.",
                    "HiTrans: An FPGA-Based Gateway Design and Implementation in HPC Environments.",
                    "Dealing with Reliable Event-Based Communications by Means of Layered Multicast.",
                    "Scalable Network Intrusion Detection and Countermeasure Selection in Virtual Network Systems.",
                    "Removing Key Escrow from the LW-HIBE Scheme.",
                    "FASTDB: An Array Database System for Efficient Storing and Analyzing Massive Scientific Data.",
                    "An Effective Correlation-Aware VM Placement Scheme for SLA Violation Reduction in Data Centers.",
                    "Reliability-Aware Distributed Computing Scheduling Policy.",
                    "An Escrow-Free Hierarchical Identity-Based Signature Model for Cloud Storage.",
                    "A Predictive Data Reliability Method for Wireless Sensor Network Applications.",
                    "A Cycle-Time-Analysis Model for Byzantine Fault Tolerance.",
                    "Resource Utilization Based Dynamic Pricing Approach on Cloud Computing Application.",
                    "Weight-Based Batch Rekeying Scheme for Dynamic Multi-privileged Group Communications.",
                    "Application-Assisted Dynamic Attestation for JVM-Based Cloud.",
                    "New Escrow-Free Scheme for Hierarchical Identity-Based Encryption.",
                    "Neural Networks in Petrol Station Objects Calibration.",
                    "A Dependable, Scalable, Distributed, Virtual Data Structure.",
                    "Effect of Bias Temperature Instability on Soft Error Rate.",
                    "Security Modeling and Analysis of a SDN Based Web Service.",
                    "Single Anchor Node Based Localization in Mobile Underwater Wireless Sensor Networks.",
                    "A Novel Bug Report Extraction Approach.",
                    "ABR-Tree: An Efficient Distributed Multidimensional Indexing Approach for Massive Data.",
                    "A Simple Local Search Algorithm for Minimizing Interference in Wireless Sensor Networks.",
                    "Unknown Bit Stream Protocol Message Discovery with Zero Knowledge.",
                    "Distributed Authentication in the Cloud Computing Environment.",
                    "Influential Nuisance Factors on a Decision of Sufficient Testing.",
                    "Research of Improved Particle Swarm Optimization Based on Genetic Algorithm for Hadoop Task Scheduling Problem.",
                    "Acceleration of CFD Engineering Software on GPU and MIC."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14th ICA3PP 2014",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2014-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 14th International Conference, ICA3PP 2014, Dalian, China, August 24-27, 2014. Proceedings, Part I.",
                "count": 66,
                "papers": [
                    "Porting the Princeton Ocean Model to GPUs.",
                    "Web Service Recommendation via Exploiting Temporal QoS Information.",
                    "Optimizing and Scaling HPCG on Tianhe-2: Early Experience.",
                    "Understanding the SIMD Efficiency of Graph Traversal on GPU.",
                    "A GPU Implementation of Clipping-Free Halftoning Using the Direct Binary Search.",
                    "A Reliable and Secure GPU-Assisted File System.",
                    "Efficient Detection of Cloned Attacks for Large-Scale RFID Systems.",
                    "Probability Based Algorithms for Guaranteeing the Stability of Rechargeable Wireless Sensor Networks.",
                    "PTAS for Minimum k-Path Connected Vertex Cover in Growth-Bounded Graphs.",
                    "A Simple and Effective Long Duration Contact-Based Utility Metric for Mobile Opportunistic Networking.",
                    "Adaptive QoS and Security for Video Transmission over Wireless Networks: A Cognitive-Based Approach.",
                    "Virtual Network Mapping Algorithm in Wireless Data Center Networks.",
                    "A Weighted Centroid Based Tracking System in Wireless Sensor Networks.",
                    "A Smartphone Location Independent Activity Recognition Method Based on the Angle Feature.",
                    "Reliable and Energy Efficient Routing Algorithm for WirelessHART.",
                    "A DSCP-Based Method of QoS Class Mapping between WLAN and EPS Network.",
                    "HostoSink: A Collaborative Scheduling in Heterogeneous Environment.",
                    "Load Balancing in MapReduce Based on Data Locality.",
                    "RD-PCA: A Traffic Condition Data Imputation Method Based on Robust Distance.",
                    "Network-Aware Re-Scheduling: Towards Improving Network Performance of Virtual Machines in a Data Center.",
                    "A Novel Petri-Net Based Resource Constrained Multi-project Scheduling Method.",
                    "Interconnection Network Reconstruction for Fault-Tolerance of Torus-Connected VLSI Array.",
                    "An Ant Colony Optimization Algorithm for Virtual Network Embedding.",
                    "Temperature-Aware Scheduling Based on Dynamic Time-Slice Scaling.",
                    "An Improved Energy-Efficient Scheduling for Precedence Constrained Tasks in Multiprocessor Clusters.",
                    "Hierarchical Eventual Leader Election for Dynamic Systems.",
                    "Efficient Resource Provisioning for Mobile Media Traffic Management in a Cloud Computing Environment.",
                    "A Community Cloud for a Real-Time Financial Application - Requirements, Architecture and Mechanisms.",
                    "Strategies for Evacuating from an Affected Area with One or Two Groups.",
                    "A Novel Adaptive Web Service Selection Algorithm Based on Ant Colony Optimization for Dynamic Web Service Composition.",
                    "An Optimization VM Deployment for Maximizing Energy Utility in Cloud Environment.",
                    "Performance Evaluation of Light-Weighted Virtualization for PaaS in Clouds.",
                    "An Access Control Scheme with Direct Cloud-Aided Attribute Revocation Using Version Key.",
                    "Full and Live Virtual Machine Migration over XIA.",
                    "A Near-Exact Defragmentation Scheme to Improve Restore Performance for Cloud Backup Systems.",
                    "A Music Recommendation Method for Large-Scale Music Library on a Heterogeneous Platform.",
                    "GPU-Accelerated Verification of the Collatz Conjecture.",
                    "Reducing the Interconnection Length for 3D Fault-Tolerant Processor Arrays.",
                    "Feature Evaluation for Early Stage Internet Traffic Identification.",
                    "Hyper-Star Graphs: Some Topological Properties and an Optimal Neighbourhood Broadcasting Algorithm.",
                    "Customized Network-on-Chip for Message Reduction.",
                    "Athena: A Fault-Tolerant, Efficient and Applicable Routing Mechanism for Data Centers.",
                    "Performance-Aware Data Placement in Hybrid Parallel File Systems.",
                    "Security Analysis and Protection Based on Smali Injection for Android Applications.",
                    "A Novel Key Management Scheme in VANETs.",
                    "Design and Implementation of Network Hard Disk.",
                    "Combining Supervised and Unsupervised Learning for Automatic Attack Signature Generation System.",
                    "The Study on the Increasing Strategy of Detecting Moving Target in Wireless Sensor Networks.",
                    "A CRC-Based Lightweight Authentication Protocol for EPCglobal Class-1 Gen-2 Tags.",
                    "Test Case Prioritization Based on Genetic Algorithm and Test-Points Coverage.",
                    "SAEP: Simulated Annealing Based Ensemble Projecting Method for Solving Conditional Nonlinear Optimal Perturbation.",
                    "Converting Ptolemy II Models to SpaceEx for Applied Verification.",
                    "Research on Interest Searching Mechanism in SNS Learning Community.",
                    "Improving the Frequency Adaptive Capability of Hybrid Immune Detector Maturation Algorithm.",
                    "Cluster-Based Time Synchronization Protocol for Wireless Sensor Networks.",
                    "A Fast CABAC Algorithm for Transform Coefficients in HEVC.",
                    "A Improved PageRank Algorithm Based on Page Link Weight.",
                    "Computation Offloading Management for Vehicular Ad Hoc Cloud.",
                    "An Approach to Model Complex Big Data Driven Cyber Physical Systems.",
                    "Reliable Transmission with Multipath and Redundancy for Wireless Mesh Networks.",
                    "Community Roamer: A Social-Based Routing Algorithm in Opportunistic Mobile Networks.",
                    "A Self-adaptive Reliable Packet Transmission Scheme for Wireless Mesh Networks.",
                    "Distributed Efficient Node Localization in Wireless Sensor Networks Using the Backtracking Search Algorithm.",
                    "User Specific QoS and Its Application in Resources Scheduling for Wireless System.",
                    "A Distributed Storage Model for Sensor Networks.",
                    "Relation between Irregular Sampling and Estimated Covariance for Closed-Loop Tracking Method."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2014-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 14th International Conference, ICA3PP 2014, Dalian, China, August 24-27, 2014. Proceedings, Part II.",
                "count": 59,
                "papers": [
                    "Parallel Data Processing in Dynamic Hybrid Computing Environment Using MapReduce.",
                    "Fast Scalable k-means++ Algorithm with MapReduce.",
                    "Acceleration of Solving Non-Equilibrium Ionization via Tracer Particles and MapReduce on Eulerian Mesh.",
                    "A Continuous Virtual Vector-Based Algorithm for Measuring Cardinality Distribution.",
                    "Hmfs: Efficient Support of Small Files Processing over HDFS.",
                    "Utilizing Multiple Xeon Phi Coprocessors on One Compute Node.",
                    "HPSO: Prefetching Based Scheduling to Improve Data Locality for MapReduce Clusters.",
                    "Service Scheduling Algorithm in Vehicle Embedded Middleware.",
                    "Similar Samples Cleaning in Speculative Multithreading.",
                    "Equi-join for Multiple Datasets Based on Time Cost Evaluation Model.",
                    "Identifying File Similarity in Large Data Sets by Modulo File Length.",
                    "Conpy: Concolic Execution Engine for Python Applications.",
                    "A Platform for Stock Market Simulation with Distributed Agent-Based Modeling.",
                    "C2CU : A CUDA C Program Generator for Bulk Execution of a Sequential Algorithm.",
                    "Dynamically Spawning Speculative Threads to Improve Speculative Path Execution.",
                    "A Parallel Algorithm of Kirchhoff Pre-stack Depth Migration Based on GPU.",
                    "An Algorithm to Embed a Family of Node-Disjoint 3D Meshes into Locally Twisted Cubes.",
                    "GPU Acceleration of Finding Maximum Eigenvalue of Positive Matrices.",
                    "Improving Speculation Accuracy with Inter-thread Fetching Value Prediction.",
                    "Towards Efficient Distributed SPARQL Queries on Linked Data.",
                    "MRFS: A Distributed Files System with Geo-replicated Metadata.",
                    "An Advanced Data Redistribution Approach to Accelerate the Scale-Down Process of RAID-6.",
                    "Thread Mapping and Parallel Optimization for MIC Heterogeneous Parallel Systems.",
                    "Efficient Storage Support for Real-Time Near-Duplicate Video Retrieval.",
                    "Repairing Multiple Data Losses by Parallel Max-min Trees Based on Regenerating Codes in Distributed Storage Systems.",
                    "Exploiting Content Locality to Improve the Performance and Reliability of Phase Change Memory.",
                    "Application of Support Vector Machine in the Decision-Making of Maneuvering.",
                    "Mobile Phone Data Reveal the Spatiotemporal Regularity of Human Mobility.",
                    "Research on Large-Scale Vessel Riding Tidal Current to Promote Efficiency of Fairway.",
                    "A Vertex-Clustering Algorithm Based on the Cluster-Clique.",
                    "Designed Slide Mode Controller for Ship Autopilot with Steering Gear Saturation.",
                    "Automatic Assessment Model for Sailing in Narrow Channel.",
                    "Bus Arrival Time Prediction and Release: System, Database and Android Application Design.",
                    "On Key Techniques of a Radar Remote Telemetry and Monitoring System.",
                    "PSC Ship-Selecting Model Based on Improved Particle Swarm Optimization and BP Neural Network Algorithm.",
                    "LRPON Based Infrastructure Layout Planning of Backbone Networks for Mobile Cloud Services in Transportation.",
                    "Infrastructure Deployment and Dimensioning of Relayed-Based Heterogeneous Wireless Access Networks for Green Intelligent Transportation.",
                    "Vessel Motion Pattern Recognition Based on One-Way Distance and Spectral Clustering Algorithm.",
                    "Navigation Safety Assessment of Ship in Rough Seas Based on Bayesian Network.",
                    "Optimization of Ship Scheduling Based on One-Way Fairway.",
                    "Research on Virtual Crew Path Planning Simulator Based on A* Algorithm.",
                    "Speech Recognition Applied in VHF Simulation System.",
                    "The Assessment of Risk of Collision between Two Ships Avoiding Collision by Altering Course.",
                    "The Merging Algorithm of Radar Simulation Data in Navigational Simulator.",
                    "Data Mining Research Based on College Forum.",
                    "Simulation of Maritime Joint Sea-Air Search Trend Using 3D GIS.",
                    "Quantitative Analysis for the Development of Maritime Transport Efficiency.",
                    "Image Compression Based on Time-Domain Lapped Transform and Quadtree Partition.",
                    "The Applicability and Security Analysis of IPv6 Tunnel Transition Mechanisms.",
                    "QOS Performance Analysis for Flexible Workflow Supporting Exception Handling.",
                    "Analysis of Propagation Characteristics of Variant Worms.",
                    "A Design of Network Behavior-Based Malware Detection System for Android.",
                    "Detection and Defense Technology of Blackhole Attacks in Wireless Sensor Network.",
                    "An Improved Remote Data Possession Checking Protocol in Cloud Storage.",
                    "Fault Localization of Concurrency Bugs and Its Application in Web Security.",
                    "Feature Selection Toward Optimizing Internet Traffic Behavior Identification.",
                    "ID-Based Anonymous Multi-receiver Key Encapsulation Mechanism with Sender Authentication.",
                    "Energy Efficient Routing with a Tree-Based Particle Swarm Optimization Approach.",
                    "A Context-Aware Framework for SaaS Service Dynamic Discovery in Clouds."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th ICA3PP 2013",
        "info": "Vietri sul Mare, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2013-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 13th International Conference, ICA3PP 2013, Vietri sul Mare, Italy, December 18-20, 2013, Proceedings, Part I.",
                "count": 41,
                "papers": [
                    "Clustering and Change Detection in Multiple Streaming Time Series.",
                    "Lightweight Identification of Captured Memory for Software Transactional Memory.",
                    "Layer-Based Scheduling of Parallel Tasks for Heterogeneous Cluster Platforms.",
                    "Deadline-Constrained Workflow Scheduling in Volunteer Computing Systems.",
                    "Is Sensor Deployment Using Gaussian Distribution Energy Balanced?",
                    "Shedder: A Metadata Sharing Management Method across Multi-clusters.",
                    "PDB: A Reliability-Driven Data Reconstruction Strategy Based on Popular Data Backup for RAID4 SSD Arrays.",
                    "Load and Thermal-Aware VM Scheduling on the Cloud.",
                    "Optimistic Concurrency Control for Energy Efficiency in the Wireless Environment.",
                    "POIGEM: A Programming-Oriented Instruction Level GPU Energy Model for CUDA Program.",
                    "PastryGridCP: A Decentralized Rollback-Recovery Protocol for Desktop Grid Systems.",
                    "Improving Continuation-Powered Method-Level Speculation for JVM Applications.",
                    "Applicability of the (m, k)-firm Approach for the QoS Enhancement in Distributed RTDBMS.",
                    "A Parallel Distributed System for Gene Expression Profiling Based on Clustering Ensemble and Distributed Optimization.",
                    "Unimodular Loop Transformations with Source-to-Source Translation for GPUs.",
                    "HMHS: Hybrid Multistage Heuristic Scheduling Algorithm for Heterogeneous MapReduce System.",
                    "Dynamic Resource Management in a HPC and Cloud Hybrid Environment.",
                    "Candidate Set Parallelization Strategies for Ant Colony Optimization on the GPU.",
                    "Synchronization-Reducing Variants of the Biconjugate Gradient and the Quasi-Minimal Residual Methods.",
                    "Memory Efficient Multi-Swarm PSO Algorithm in OpenCL on an APU.",
                    "Multi-objective Parallel Machines Scheduling for Fault-Tolerant Cloud Systems.",
                    "Exploring Irregular Reduction Support in Transactional Memory.",
                    "Coordinate Task and Memory Management for Improving Power Efficiency.",
                    "Deconvolution of Huge 3-D Images: Parallelization Strategies on a Multi-GPU System.",
                    "Hardware-Assisted Intrusion Detection by Preserving Reference Information Integrity.",
                    "A DNA Computing System of Modular-Multiplication over Finite Field GF(2n).",
                    "A Message Logging Protocol Based on User Level Failure Mitigation.",
                    "H-DB: Yet Another Big Data Hybrid System of Hadoop and DBMS.",
                    "Sequential and Parallelized FPGA Implementation of Spectrum Sensing Detector Based on Kolmogorov-Smirnov Test.",
                    "A Reconfigurable Ray-Tracing Multi-Processor SoC with Hardware Replication-Aware Instruction Set Extension.",
                    "Demand-Based Scheduling Priorities for Performance Optimisation of Stream Programs on Parallel Platforms.",
                    "A Novel Architecture for Financial Investment Services on a Private Cloud.",
                    "Building Platform as a Service for High Performance Computing over an Opportunistic Cloud Computing.",
                    "A Buffering Method for Parallelized Loop with Non-Uniform Dependencies in High-Level Synthesis.",
                    "Character of Graph Analysis Workloads and Recommended Solutions on Future Parallel Systems.",
                    "HySARC2: Hybrid Scheduling Algorithm Based on Resource Clustering in Cloud Environments.",
                    "M&C: A Software Solution to Reduce Errors Caused by Incoherent Caches on GPUs in Unstructured Graphic Algorithm.",
                    "Interference-Aware Program Scheduling for Multicore Processors.",
                    "WABRM: A Work-Load Aware Balancing and Resource Management Framework for Swift on Cloud.",
                    "Cache Optimizations of Distributed Storage for Software Streaming Services.",
                    "AzureITS: A New Cloud Computing Intelligent Transportation System."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2013-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 13th International Conference, ICA3PP 2013, Vietri sul Mare, Italy, December 18-20, 2013, Proceedings, Part II.",
                "count": 35,
                "papers": [
                    "On the Impact of Optimization on the Time-Power-Energy Balance of Dense Linear Algebra Factorizations.",
                    "Torus-Connected Cycles: An Implementation-Friendly Topology for Interconnection Networks of Massively Parallel Systems.",
                    "Optimization of Tasks Scheduling by an Efficacy Data Placement and Replication in Cloud Computing.",
                    "A Normalization Scheme for the Non-symmetric s-Step Lanczos Algorithm.",
                    "Efficient Hybrid Breadth-First Search on GPUs.",
                    "Adaptive Resource Allocation for Reliable Performance in Heterogeneous Distributed Systems.",
                    "Adaptive Task Size Control on High Level Programming for GPU/CPU Work Sharing.",
                    "Robust Scheduling of Dynamic Real-Time Tasks with Low Overhead for Multi-Core Systems.",
                    "A Routing Strategy for Inductive-Coupling Based Wireless 3-D NoCs by Maximizing Topological Regularity.",
                    "Semidistributed Virtual Network Mapping Algorithms Based on Minimum Node Stress Priority.",
                    "Scheduling Algorithm Based on Agreement Protocol for Cloud Systems.",
                    "Parallel Social Influence Model with Levy Flight Pattern Introduced for Large-Graph Mining on Weibo.com.",
                    "Quality Control of Massive Data for Crowdsourcing in Location-Based Services.",
                    "Towards Automatic Generation of Hardware Classifiers.",
                    "PSIS: Parallel Semantic Indexing System - Preliminary Experiments.",
                    "Network Traffic Analysis Using Android on a Hybrid Computing Architecture.",
                    "Online Data Analysis of Fetal Growth Curves.",
                    "A Practical Approach for Finding Small {Independent, Distance} Dominating Sets in Large-Scale Graphs.",
                    "Robust Fingerprinting Codes for Database.",
                    "Heterogeneous Computing vs. Big Data: The Case of Cryptanalytical Applications.",
                    "Trusted Information and Security in Smart Mobility Scenarios: The Case of S2-Move Project.",
                    "A Linguistic-Based Method for Automatically Extracting Spatial Relations from Large Non-Structured Data.",
                    "IDES Project: A New Effective Tool for Safety and Security in the Environment.",
                    "Impact of Biometric Data Quality on Rank-Level Fusion Schemes.",
                    "A Secure OsiriX Plug-In for Detecting Suspicious Lesions in Breast DCE-MRI.",
                    "A Patient Centric Approach for Modeling Access Control in EHR Systems.",
                    "A Privacy Preserving Matchmaking Scheme for Multiple Mobile Social Networks.",
                    "Measuring Trust in Big Data.",
                    "Agent-Based Decision Support for Smart Market Using Big Data.",
                    "Congestion Control for Vehicular Environments by Adjusting IEEE 802.11 Contention Window Size.",
                    "QL-MAC: A Q-Learning Based MAC for Wireless Sensor Networks.",
                    "Predicting Battery Depletion of Neighboring Wireless Sensor Nodes.",
                    "TuCSoN on Cloud: An Event-Driven Architecture for Embodied / Disembodied Coordination.",
                    "Integrating Cloud Services in Behaviour Programming for Autonomous Robots.",
                    "RFID Based Real-Time Manufacturing Information Perception and Processing."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th ICA3PP 2012",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2012-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 12th International Conference, ICA3PP 2012, Fukuoka, Japan, September 4-7, 2012, Proceedings, Part I.",
                "count": 39,
                "papers": [
                    "Accelerating the Dynamic Programming for the Optimal Polygon Triangulation on the GPU.",
                    "Security Computing for the Resiliency of Protecting from Internal Attacks in Distributed Wireless Sensor Networks.",
                    "Parallel Algorithm for Nonlinear Network Optimization Problems and Real-Time Applications.",
                    "Optimization of a Short-Range Proximity Effect Correction Algorithm in E-Beam Lithography Using GPGPUs.",
                    "Exploiting Multi-grain Parallelism for Efficient Selective Sweep Detection.",
                    "Vectorized Algorithms for Quadtree Construction and Descent.",
                    "A Multi-level Monitoring Framework for Stream-Based Coordination Programs.",
                    "An Optimal Parallel Prefix-Sums Algorithm on the Memory Machine Models for GPUs.",
                    "A Multi-GPU Programming Library for Real-Time Applications.",
                    "Optimal Linear Programming Solutions for Multiprocessor Scheduling with Communication Delays.",
                    "A Bitstream Relocation Technique to Improve Flexibility of Partial Reconfiguration.",
                    "A Hybrid Heuristic-Genetic Algorithm for Task Scheduling in Heterogeneous Multi-core System.",
                    "Efficient Task Assignment on Heterogeneous Multicore Systems Considering Communication Overhead.",
                    "Budget Constrained Resource Allocation for Non-deterministic Workflows on an IaaS Cloud.",
                    "On a Wideband Fast Fourier Transform Using Piecewise Linear Approximations: Application to a Radio Telescope Spectrometer.",
                    "A Verified Library of Algorithmic Skeletons on Evenly Distributed Arrays.",
                    "Performance Measurement of Parallel Vlasov Code for Space Plasma on Various Scalar-Type Supercomputer Systems.",
                    "Ultrasound Simulation on the Cell Broadband Engine Using the Westervelt Equation.",
                    "Study on the Data Flow Balance in NFS Server with iSCSI.",
                    "Performance, Scalability, and Semantics of Concurrent FIFO Queues.",
                    "Scalable Distributed Architecture for Media Transcoding.",
                    "GPU-Accelerated Restricted Boltzmann Machine for Collaborative Filtering.",
                    "STM Systems: Enforcing Strong Isolation between Transactions and Non-transactional Code.",
                    "A Dependency Aware Task Partitioning and Scheduling Algorithm for Hardware-Software Codesign on MPSoCs.",
                    "Power Efficiency Evaluation of Block Ciphers on GPU-Integrated Multicore Processor.",
                    "Experiments in Parallel Matrix Multiplication on Multi-core Systems.",
                    "Fault Tolerance Logical Network Properties of Irregular Graphs.",
                    "Fault Recovery Technique for TMR Softcore Processor System Using Partial Reconfiguration.",
                    "Non-Blocking Atomic Commitment in Asynchronous Distributed Systems with Faulty Processes.",
                    "On Modelling and Prediction of Total CPU Usage for Applications in MapReduce Environments.",
                    "The Impact of Global Communication Latency at Extreme Scales on Krylov Methods.",
                    "Fast Parallel Algorithms for Blocked Dense Matrix Multiplication on Shared Memory Architectures.",
                    "Kernel Support for Fine-Grained Load Balancing in a Web Cluster Providing Streaming Service.",
                    "Overcoming the Scalability Limitations of Parallel Star Schema Data Warehouses.",
                    "Enhancing Service-Oriented Computing with Software Mobility.",
                    "An Insightful Program Performance Tuning Chain for GPU Computing.",
                    "Multi-core Fixed Priority DVS Scheduling.",
                    "Comparing Checkpoint and Rollback Recovery Schemes in a Cluster System.",
                    "Causal Order Multicast Protocol Using Minimal Message History Information."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2012-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 12th International Conference, ICA3PP 2012, Fukuoka, Japan, September 4-7, 2012, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Analytical Modeling for Multi-transaction Bus on Distributed Systems.",
                    "Leveraging the Strengths of Transactional Memory While Maintaining System Performance for a Multiplayer Gaming Application.",
                    "Enhancing the Performance of a Distributed Mobile Computing Environment by Topology Construction.",
                    "Frame Error Rate Testing for High Speed Optical Interconnect.",
                    "Maintaining Consistency in Software Transactional Memory through Dynamic Versioning Tuning.",
                    "Solving a 2-Covered Path Problem with Variable Radii for Wireless Sensor Networks.",
                    "Design of an Application-Dependent Static-Based Shared Memory Network.",
                    "Determining Quality of S-Boxes Using Pseudo Random Sequences Generated from Stream Ciphers.",
                    "Exploring Object-Level Parallelism on Chip Multi-processors.",
                    "The Hamiltonicity of WK-Recursive Pyramid.",
                    "Towards Multi-level Adaptation for Distributed Operating Systems and Applications.",
                    "FIDs Classifier for Artificial Intelligence and Its Application.",
                    "On Affirmative Adaptive Failure Detection.",
                    "A New Low Latency Parallel Turbo Decoder Employing Parallel Phase Decoding Method.",
                    "A Regular Group Quorum System of Degree $\\lceil \\sqrt{n/2}\\rceil$.",
                    "A Note on Developing Optimal and Scalable Parallel Two-List Algorithms.",
                    "Small Business-Oriented Index Construction of Cloud Data.",
                    "High-Performance Matrix Multiply on a Massively Multithreaded Fiteng1000 Processor.",
                    "BIDE-Based Parallel Mining of Frequent Closed Sequences with MapReduce.",
                    "Efficient Task Scheduling for Hard Real-Time Tasks in Asymmetric Multicore Processors.",
                    "An Implementation of Parallel 2-D FFT Using Intel AVX Instructions on Multi-core Processors.",
                    "A Semantic Impact in Decentralized Resource Discovery Mechanism for Grid Computing Environments.",
                    "Design of n-Gram Based Dynamic Pre-fetching for DSM.",
                    "On Construction of Cloud IaaS for VM Live Migration Using KVM and OpenNebula.",
                    "Performance Evaluation of OpenMP and CUDA on Multicore Systems.",
                    "Complexity of the Resource Allocation/Matching Problem with Weight Based Ceilings.",
                    "Wireless Sensor Network Internal Attacker Identification with Multiple Evidence by Dempster-Shafer Theory.",
                    "A Novel Feature Selection Scheme for Energy Efficient Wireless Sensor Networks.",
                    "A Comprehensive Survey of the Feature Extraction Methods in the EEG Research.",
                    "Development of a Smart e-Health Portal for Chronic Disease Management.",
                    "A Novel Approach to Protein Structure Prediction Using PCA Based Extreme Learning Machines and Multiple Kernels.",
                    "A Novel Approach to Guarantee Causal Message Ordering in Pre-planned Wireless Sensor Networks.",
                    "People Identification with RMS-Based Spatial Pattern of EEG Signal.",
                    "Gait Based Human Identity Recognition from Multi-view Surveillance Videos."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11th ICA3PP 2011",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2011-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 11th International Conference, ICA3PP, Melbourne, Australia, October 24-26, 2011, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "Keynote: Assertion Based Parallel Debugging.",
                    "Secure and Energy-Efficient Data Aggregation with Malicious Aggregator Identification in Wireless Sensor Networks.",
                    "Dynamic Data Race Detection for Correlated Variables.",
                    "Improving the Parallel Schnorr-Euchner LLL Algorithm.",
                    "Distributed Mining of Constrained Frequent Sets from Uncertain Data.",
                    "Set-to-Set Disjoint-Paths Routing in Recursive Dual-Net.",
                    "Redflag: A Framework for Analysis of Kernel-Level Concurrency.",
                    "Exploiting Parallelism in the H.264 Deblocking Filter by Operation Reordering.",
                    "Compiler Support for Concurrency Synchronization.",
                    "Fault-Tolerant Routing Based on Approximate Directed Routable Probabilities for Hypercubes.",
                    "Finding a Hamiltonian Cycle in a Hierarchical Dual-Net with Base Network of p -Ary q -Cube.",
                    "Adaptive Resource Remapping through Live Migration of Virtual Machines.",
                    "LUTS: A Lightweight User-Level Transaction Scheduler.",
                    "Verification of Partitioning and Allocation Techniques on Teradata DBMS.",
                    "Memory Performance and SPEC OpenMP Scalability on Quad-Socket x86_64 Systems.",
                    "Anonymous Communication over Invisible Mix Rings.",
                    "Game-Based Distributed Resource Allocation in Horizontal Dynamic Cloud Federation Platform.",
                    "Stream Management within the CloudMiner.",
                    "Security Architecture for Virtual Machines.",
                    "Fast and Accurate Similarity Searching of Biopolymer Sequences with GPU and CUDA.",
                    "Read Invisibility, Virtual World Consistency and Probabilistic Permissiveness are Compatible.",
                    "Parallel Implementations of Gusfield's Cut Tree Algorithm.",
                    "Efficient Parallel Implementations of Controlled Optimization of Traffic Phases.",
                    "Scheduling Concurrent Workflows in HPC Cloud through Exploiting Schedule Gaps.",
                    "Efficient Decoding of QC-LDPC Codes Using GPUs.",
                    "A Combined Arithmetic Logic Unit and Memory Element for the Design of a Parallel Computer.",
                    "Parallel Implementation of External Sort and Join Operations on a Multi-core Network-Optimized System on a Chip.",
                    "STM with Transparent API Considered Harmful.",
                    "A Global Snapshot Collection Algorithm with Concurrent Initiators with Non-FIFO Channel.",
                    "An Approach for Code Compression in Run Time for Embedded Systems - A Preliminary Results.",
                    "Optimized Two Party Privacy Preserving Association Rule Mining Using Fully Homomorphic Encryption.",
                    "SLA-Based Resource Provisioning for Heterogeneous Workloads in a Virtualized Cloud Datacenter.",
                    "ΣC: A Programming Model and Language for Embedded Manycores.",
                    "Provisioning Spot Market Cloud Resources to Create Cost-Effective Virtual Clusters.",
                    "A Principled Approach to Grid Middleware - Status Report on the Minimum Intrusion Grid.",
                    "Performance Analysis of Preemption-Aware Scheduling in Multi-cluster Grid Environments.",
                    "Performance Evaluation of Open Source Seismic Data Processing Packages.",
                    "Reputation-Based Resource Allocation in Market-Oriented Distributed Systems.",
                    "Cooperation-Based Trust Model and Its Application in Network Security Management.",
                    "Performance Evaluation of the Three-Dimensional Finite-Difference Time-Domain(FDTD) Method on Fermi Architecture GPUs.",
                    "The Probability Model of Peer-to-Peer Botnet Propagation.",
                    "A Parallelism Extended Approach for the Enumeration of Orthogonal Arrays."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2011-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing - 11th International Conference, ICA3PP, Melbourne, Australia, October 24-26, 2011, Proceedings, Part II.",
                "count": 38,
                "papers": [
                    "Lightweight Transactional Arrays for Read-Dominated Workloads.",
                    "Massively Parallel Identification of Intersection Points for GPGPU Ray Tracing.",
                    "Cascading Multi-way Bounded Wait Timer Management for Moody and Autonomous Systems.",
                    "World-Wide Distributed Multiple Replications in Parallel for Quantitative Sequential Simulation.",
                    "Comparison of Three Parallel Point-Multiplication Algorithms on Conic Curves.",
                    "Extending Synchronization Constructs in OpenMP to Exploit Pipeline Parallelism on Heterogeneous Multi-core.",
                    "Generic Parallel Genetic Algorithm Framework for Protein Optimisation.",
                    "A Survey on Privacy Problems and Solutions for VANET Based on Network Model.",
                    "Scheduling Tasks and Communications on a Hierarchical System with Message Contention.",
                    "Spiking Neural P System Simulations on a High Performance GPU Platform.",
                    "SpotMPI: A Framework for Auction-Based HPC Computing Using Amazon Spot Instances.",
                    "Investigating the Scalability of OpenFOAM for the Solution of Transport Equations and Large Eddy Simulations.",
                    "Shibboleth and Community Authorization Services: Enabling Role-Based Grid Access.",
                    "A Secure Internet Voting Scheme.",
                    "A Hybrid Graphical Password Based System.",
                    "Privacy Threat Analysis of Social Network Data.",
                    "Distributed Mechanism for Protecting Resources in a Newly Emerged Digital Ecosystem Technology.",
                    "Reservation-Based Charging Service for Electric Vehicles.",
                    "Intelligent Ubiquitous Sensor Network for Agricultural and Livestock Farms.",
                    "Queue-Based Adaptive Duty Cycle Control for Wireless Sensor Networks.",
                    "Experimental Evaluation of a Failure Detection Service Based on a Gossip Strategy.",
                    "On the Performance of MPI-OpenMP on a 12 Nodes Multi-core Cluster.",
                    "A Protocol for Discovering Content Adaptation Services.",
                    "Securing RFID Systems from SQLIA.",
                    "Modeling QoS Parameters of VoIP Traffic with Multifractal and Markov Models.",
                    "Hybrid Feature Selection for Phishing Email Detection.",
                    "On the Use of Multiplanes on a 2D Mesh Network-on-Chip.",
                    "A Minimal Average Accessing Time Scheduler for Multicore Processors.",
                    "Fast Software Implementation of AES-CCM on Multiprocessors.",
                    "A TCM-Enabled Access Control Scheme.",
                    "Binary Addition Chain on EREW PRAM.",
                    "A Portable Infrastructure Supporting Global Scheduling of Embedded Real-Time Applications on Asymmetric MPSoCs.",
                    "Emotional Contribution Process Implementations on Parallel Processors.",
                    "A Cluster Computer Performance Predictor for Memory Scheduling.",
                    "Reconfigurable Hardware Computing for Accelerating Protein Folding Simulations Using the Harmony Search Algorithm and the 3D-HP-Side Chain Model.",
                    "Clustering Nodes in Large-Scale Biological Networks Using External Memory Algorithms.",
                    "Reconfigurable Hardware to Radionuclide Identification Using Subtractive Clustering.",
                    "A Parallel Architecture for DNA Matching."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10th ICA3PP 2010",
        "info": "Busan, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2010-1",
                "sub_name": "Algorithms and Architectures for Parallel Processing, 10th International Conference, ICA3PP 2010, Busan, Korea, May 21-23, 2010. Proceedings. Part I.",
                "count": 49,
                "papers": [
                    "Efficient Web Browsing with Perfect Anonymity Using Page Prefetching.",
                    "InterCloud: Utility-Oriented Federation of Cloud Computing Environments for Scaling of Application Services.",
                    "Scalable Co-clustering Algorithms.",
                    "Parallel Pattern Matching with Swaps on a Linear Array.",
                    "Parallel Prefix Computation in the Recursive Dual-Net.",
                    "A Two-Phase Differential Synchronization Algorithm for Remote Files.",
                    "A New Parallel Method of Smith-Waterman Algorithm on a Heterogeneous Platform.",
                    "Improved Genetic Algorithm for Minimizing Periodic Preventive Maintenance Costs in Series-Parallel Systems.",
                    "A New Hybrid Parallel Algorithm for MrBayes.",
                    "Research and Design of Deployment Framework for Blade-Based Data Center.",
                    "Query Optimization over Parallel Relational Data Warehouses in Distributed Environments by Simultaneous Fragmentation and Allocation.",
                    "Function Units Sharing between Neighbor Cores in CMP.",
                    "A High Efficient On-Chip Interconnection Network in SIMD CMPs.",
                    "Network-on-Chip Routing Algorithms by Breaking Cycles.",
                    "A Fair Thread-Aware Memory Scheduling Algorithm for Chip Multiprocessor.",
                    "Efficient Partitioning of Static Buses for Processor Arrays of Small Size.",
                    "Formal Proof for a General Architecture of Hybrid Prefix/Carry-Select Adders.",
                    "An Efficient Non-blocking Multithreaded Embedded System.",
                    "A Remote Mirroring Architecture with Adaptively Cooperative Pipelining.",
                    "SV: Enhancing SIMD Architectures via Combined SIMD-Vector Approach.",
                    "A Correlation-Aware Prefetching Strategy for Object-Based File System.",
                    "An Auxiliary Storage Subsystem to Distributed Computing Systems for External Storage Service.",
                    "Checkpointing and Migration of Communication Channels in Heterogeneous Grid Environments.",
                    "On-Line Task Granularity Adaptation for Dynamic Grid Applications.",
                    "Message Clustering Technique towards Efficient Irregular Data Redistribution in Clusters and Grids.",
                    "Multithreading of Kostka Numbers Computation for the BonjourGrid Meta-desktop Grid Middleware.",
                    "Adaptable Scheduling Algorithm for Grids with Resource Redeployment Capability.",
                    "Using MPI on PC Cluster to Compute Eigenvalues of Hermitian Toeplitz Matrices.",
                    "idsocket: API for Inter-domain Communications Base on Xen.",
                    "Strategy-Proof Dynamic Resource Pricing of Multiple Resource Types on Federated Clouds.",
                    "Adapting Market-Oriented Scheduling Policies for Cloud Computing.",
                    "A High Performance Inter-VM Network Communication Mechanism.",
                    "On the Effect of Using Third-Party Clouds for Maximizing Profit.",
                    "A Tracing Approach to Process Migration for Virtual Machine Based on Multicore Platform.",
                    "Accelerating Dock6's Amber Scoring with Graphic Processing Unit.",
                    "Optimizing Sweep3D for Graphic Processor Unit.",
                    "Modular Resultant Algorithm for Graphics Processors.",
                    "A Novel Scheme for High Performance Finite-Difference Time-Domain (FDTD) Computations Based on GPU.",
                    "A Proposed Asynchronous Object Load Balancing Method for Parallel 3D Image Reconstruction Applications.",
                    "A Step-by-Step Extending Parallelism Approach for Enumeration of Combinatorial Objects.",
                    "A Study of Performance Scalability by Parallelizing Loop Iterations on Multi-core SMPs.",
                    "Impact of Multimedia Extensions for Different Processing Element Granularities on an Embedded Imaging System.",
                    "Reducing False Aborts in STM Systems.",
                    "Fault-Tolerant Node-to-Set Disjoint-Path Routing in Hypercubes.",
                    "AirScope: A Micro-scale Urban Air Quality Management System.",
                    "Design of a Slot Assignment Scheme for Link Error Distribution on Wireless Grid Networks.",
                    "Wireless Bluetooth Communications Combine with Secure Data Transmission Using ECDH and Conference Key Agreements.",
                    "Robust Multicast Scheme for Wireless Process Control on Traffic Light Networks.",
                    "A Note-Based Randomized and Distributed Protocol for Detecting Node Replication Attacks in Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/ica3pp/2010-2",
                "sub_name": "Algorithms and Architectures for Parallel Processing, 10th International Conference, ICA3PP 2010, Busan, Korea, May 21-23, 2010. Proceedings. Part II.",
                "count": 46,
                "papers": [
                    "Efficient Grid on the OTIS-Arrangment Network.",
                    "Single Thread Program Parallelism with Dataflow Abstracting Thread.",
                    "Parallel Programming on a Soft-Core Based Multi-core System.",
                    "Dynamic Resource Tuning for Flexible Core Chip Multiprocessors.",
                    "Ensuring Confidentiality and Integrity of Multimedia Data on Multi-core Platforms.",
                    "A Paradigm for Processing Network Protocols in Parallel.",
                    "Real-Time Task Scheduling on Heterogeneous Two-Processor Systems.",
                    "A Grid Based System for Closure Computation and Online Service.",
                    "A Multiple Grid Resource Broker with Monitoring and Information Services.",
                    "Design Methodologies of Workload Management through Code Migration in Distributed Desktop Computing Grids.",
                    "Dynamic Dependent Tasks Assignment for Grid Computing.",
                    "Implementation of a Heuristic Network Bandwidth Measurement for Grid Computing Environments.",
                    "An Efficient Circuit-Switched Broadcasting in Star Graph.",
                    "Parallel Domain Decomposition Methods for High-Order Finite Element Solutions of the Helmholtz Problem.",
                    "Self-Organizing Neural Grove and Its Distributed Performance.",
                    "A Massively Parallel Hardware for Modular Exponentiations Using the m-ary Method.",
                    "Emulation of Object-Based Storage Devices by a Virtual Machine.",
                    "Balanced Multi-process Parallel Algorithm for Chemical Compound Inference with Given Path Frequencies.",
                    "Harnessing Clusters for High Performance Computation of Gene Expression Microarray Comparative Analysis.",
                    "Semantic Access Control for Corporate Mobile Devices.",
                    "A New Visual Simulation Tool for Performance Evaluation of MANET Routing Protocols.",
                    "A Web Service Composition Algorithm Based on Global QoS Optimizing with MOCACO.",
                    "Experiences Gained from Building a Services-Based Distributed Operating System.",
                    "Quick Forwarding of Queries to Relevant Peers in a Hierarchical P2P File Search System.",
                    "iCTPH: An Approach to Publish and Lookup CTPH Digests in Chord.",
                    "Toward a Framework for Cloud Security.",
                    "Cluster-Fault-Tolerant Routing in Burnt Pancake Graphs.",
                    "Edge-Bipancyclicity of All Conditionally Faulty Hypercubes.",
                    "Accelerating Euler Equations Numerical Solver on Graphics Processing Units.",
                    "An Improved Parallel MEMS Processing-Level Simulation Implementation Using Graphic Processing Unit.",
                    "Solving Burgers' Equation Using Multithreading and GPU.",
                    "Support for OpenMP Tasks on Cell Architecture.",
                    "A Novel Algorithm for Faults Acquiring and Locating on Fiber Optic Cable Line.",
                    "A Parallel Distributed Algorithm for the Permutation Flow Shop Scheduling Problem.",
                    "A Self-Adaptive Load Balancing Strategy for P2P Grids.",
                    "Embedding Algorithms for Star, Bubble-Sort, Rotator-Faber-Moore, and Pancake Graphs.",
                    "Performance Estimation of Generalized Statistical Smoothing to Inverse Halftoning Based on the MTF Function of Human Eyes.",
                    "Power Improvement Using Block-Based Loop Buffer with Innermost Loop Control.",
                    "An Efficient Pipelined Architecture for Fast Competitive Learning.",
                    "Merging Data Records on EREW PRAM.",
                    "Performance Modeling of Multishift QR Algorithms for the Parallel Solution of Symmetric Tridiagonal Eigenvalue Problems.",
                    "A Parallel Solution of Large-Scale Heat Equation Based on Distributed Memory Hierarchy System.",
                    "A New Metric for On-Line Scheduling and Placement in Reconfigurable Computing Systems.",
                    "Test Data Compression Using Four-Coded and Sparse Storage for Testing Embedded Core.",
                    "Extending a Multicore Multithread Simulator to Model Power-Aware Hard Real-Time Systems.",
                    "Real-Time Linux Framework for Designing Parallel Mobile Robotic Applications."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th ICA3PP 2009",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2009",
                "sub_name": "Algorithms and Architectures for Parallel Processing, 9th International Conference, ICA3PP 2009, Taipei, Taiwan, June 8-11, 2009. Proceedings.",
                "count": 81,
                "papers": [
                    "Length Encoded Secondary Structure Profile for Remote Homologous Protein Detection.",
                    "A Process Scheduling Analysis Model Based on Grid Environment.",
                    "A Resource Broker with Cross Grid Information Services on Computational Multi-grid Environments.",
                    "Fleet: An Effective System for Publish/Subscribe Service over P2P Networks.",
                    "Implementation of a Performance-Based Loop Scheduling on Heterogeneous Clusters.",
                    "The Hierarchical Path-Selection Scheme Based on Multihoming NEMO.",
                    "A Software Transactional Memory Service for Grids.",
                    "An Empirical Study on the Performance Issues on the Clustered Client-Server Computing Environment.",
                    "DR: Divided Ring Leader Election Algorithm.",
                    "Construct the Load-Balanced Topology in NEMO.",
                    "Energy-Efficient Clustering in Wireless Sensor Networks.",
                    "Maximally Local Connectivity on Augmented Cubes.",
                    "A Cluster-Based Data Routing for Wireless Sensor Networks.",
                    "A Energy Efficient Scheduling Base on Dynamic Voltage and Frequency Scaling for Multi-core Embedded Real-Time System.",
                    "Effect of Database Server Arrangement to the Performance of Load Balancing Systems.",
                    "A Block-Based Watermarking Method Using Wavelet Coefficient Quantization.",
                    "A Digital Watermarking Method Using Binary Cluster.",
                    "A Novel Blind Watermarking Using Hybrid Embedding Technique.",
                    "An Analysis of Fire Frame Processing and Video Dynamic Features.",
                    "Intelligent Laboratory Resource Supply Chain Conceptual Network Model with Process and Information Integration, Visibility and Flexibility.",
                    "A New Windows Driver-Hidden Rootkit Based on Direct Kernel Object Manipulation.",
                    "An Agent-Based English Auction Protocol Using Elliptic Curve Cryptosystem for Mobile Commerce.",
                    "Authenticated Key Exchange Protocol in One-Round.",
                    "Digital Image Watermarking for Malicious Attack.",
                    "Hierarchical Time-Bound Key Management for Mobile Agents.",
                    "Key Tree and Chinese Remainder Theorem Based Group Key Distribution Scheme.",
                    "Effective DDoS Attacks Detection Using Generalized Entropy Metric.",
                    "A Fast and Flexible Sorting Algorithm with CUDA.",
                    "A Parallel Simulated Annealing Approach for Floorplanning in VLSI.",
                    "VERTAF/Multi-Core: A SysML-Based Application Framework for Multi-Core Embedded Software Development.",
                    "The Impact of Resource Sharing Control on the Design of Multicore Processors.",
                    "Real-Time Ray Tracing with CUDA.",
                    "Concurrent Operations for Accessing an XML Document in a Multi-user Environment.",
                    "A Shape Recognition Scheme for Wireless Sensor Networks Based on a Distance Field Method.",
                    "A Low Communication Overhead and Load Balanced Parallel ATPG with Improved Static Fault Partition Method.",
                    "An Efficient Parallel Sorting Algorithm on Metacube Multiprocessors.",
                    "An On-Line Parallel Algorithm for Node Ranking of Trees.",
                    "An Overview of Prophet.",
                    "Fast License Plate Localization Using Discrete Wavelet Transform.",
                    "Fast Parallel Molecular Solution for DNA-Based Computing: The 0-1 Knapsack Problem.",
                    "Fast Parallel Montgomery Binary Exponentiation Algorithm Using Canonical- Signed-Digit Recoding Technique.",
                    "Fault-Free Cycles in Conditional Faulty Folded Hypercubes.",
                    "Research on Parallel HW/SW Partitioning Based on Hybrid PSO Algorithm.",
                    "Unfolding of Multirate Data-Flow Graph to Compute Iteration Bound.",
                    "Parallel Algorithms for Solving Markov Decision Process.",
                    "Parallel Algorithms for the Weighted Distance Transform on Linear Arrays with a Reconfigurable Pipelined Bus System.",
                    "Parallel Particle Swarm Optimization with Adaptive Asynchronous Migration Strategy.",
                    "MTCrossBit: A Dynamic Binary Translation System Using Multithreaded Optimization Framework.",
                    "VLSI Architecture for Fast Memetic Vector Quantizer Design on Reconfigurable Hardware.",
                    "SnapCDP : A CDP System Based on LVM.",
                    "A Divide-and-Conquer Strategy and PVM Computation Environment for the Matrix Multiplication.",
                    "A Sharable Storage Service for Distributed Computing Systems in Combination of Remote and Local Storage.",
                    "An Advanced NoP Selection Strategy for Odd-Even Routing Algorithm in Network-on-Chip.",
                    "An Implementation of a Framework for Open Distributed Computing.",
                    "Evaluating a Dependable Sharable Atomic Data Service on a Planetary-Scale Network.",
                    "A GPU-Based Simulation of Tsunami Propagation and Inundation.",
                    "A Paralleled Large-Scale Astronomical Cross-Matching Function.",
                    "A Power Peer-Based Reputation Scheme for Mobile P2P Systems.",
                    "An Algorithm Evaluating System Stability to Process.",
                    "An Efficient Algorithm for the Shortest Path Problem with Forbidden Paths.",
                    "Finding Object Depth Using Stereoscopic Photography.",
                    "A Lightweight Buffer Overflow Protection Mechanism with Failure-Oblivious Capability.",
                    "Fault-Tolerant Hamiltonicity of Augmented Cubes under the Conditional Fault Model.",
                    "The Design and Implementation of Z Language Editor.",
                    "A Semantic-Aware Attribute-Based Access Control Model for Web Services.",
                    "A P2P Service Management Model for Emergency Response Using Virtual Service Pool.",
                    "A Web 2.0 and Open Source Approach for Management and Sharing of Multimedia Data-Case of the Tzu Chi Foundation.",
                    "Adaptive Link Cost Reduction by Generic Topology Construction in Ad-Hoc Networks.",
                    "An Efficient Data Dissemination Scheme for Sensor Networks.",
                    "Dynamically Maintaining Duplicate-Insensitive and Time-Decayed Sum Using Time-Decaying Bloom Filter.",
                    "Lead Scoring Client's Web Service.",
                    "Minimizing the Limitations of GL Analyser of Fusion Based Email Classification.",
                    "A Medical Diagnosis Decision Support System Based on Bayesian Theorem and Web Services.",
                    "Analysis on an Energy Efficient Routing Algorithm for Wireless Sensor Networks.",
                    "Reliable Greedy Forwarding in Obstacle-Aware Wireless Sensor Networks.",
                    "Recursive Dual-Net: A New Universal Network for Supercomputers of the Next Generation.",
                    "Using XML for VLSI Physical Design Automation.",
                    "A New Constant Storage Self-healing Key Distribution with Revocation in Wireless Sensor Networks.",
                    "Design a Hardware Mechanism to Utilize Multiprocessors on a Uni-processor Operating System.",
                    "Refinement Proposal of the Goldberg's Theory.",
                    "Variable Dimension Space Audio Scrambling Algorithm Against MP3 Compression."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th ICA3PP 2008",
        "info": "Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2008",
                "sub_name": "Algorithms and Architectures for Parallel Processing, 8th International Conference, ICA3PP 2008, Cyprus, June 9-11, 2008, Proceedings.",
                "count": 34,
                "papers": [
                    "Smart Content Delivery on the Internet.",
                    "Parallel Query Processing in Databases on Multicore Architectures.",
                    "Evaluation of a Novel Load-Balancing Algorithm with Variable Granularity.",
                    "A Static Multiprocessor Scheduling Algorithm for Arbitrary Directed Task Graphs in Uncertain Environments.",
                    "An ACO Inspired Strategy to Improve Jobs Scheduling in a Grid Environment.",
                    "Architecture Aware Partitioning Algorithms.",
                    "A Simple and Efficient Fault-Tolerant Adaptive Routing Algorithm for Meshes.",
                    "Deadlock-Free Adaptive Routing in 2D Tori with a New Turn Model.",
                    "Neighbourhood Broadcasting and Broadcasting on the (n, k)-Star Graph.",
                    "Fault Tolerance in the Biswapped Network.",
                    "3D Block-Based Medial Axis Transform and Chessboard Distance Transform on the CREW PRAM.",
                    "A General Approach to Predict the Performance Order of TSP Family Problems.",
                    "Examining the Feasibility of Reconfigurable Models for Molecular Dynamics Simulation.",
                    "Parallel Simulated Annealing for Materialized View Selection in Data Warehousing Environments.",
                    "An Operational Approach to Validate the Path of BGP.",
                    "1-Persistent Collision-Free CSMA Protocols for Opportunistic Optical Hyperchannels.",
                    "An Optimization of Context Sharing for Self-adaptive Mobile Applications.",
                    "A Network Service for DSP Multicomputers.",
                    "A Non-blocking Multithreaded Architecture with Support for Speculative Threads.",
                    "Finding Synchronization-Free Parallelism Represented with Trees of Dependent Operations.",
                    "Lee-TM: A Non-trivial Benchmark Suite for Transactional Memory.",
                    "Performance of OpenMP Benchmarks on Multicore Processors.",
                    "Adaptive Loop Tiling for a Multi-cluster CMP.",
                    "Quasi-opportunistic Supercomputing in Grid Environments.",
                    "Explicit Control of Service Execution to Support QoS-Based Grid Scheduling.",
                    "Parallelization and Distribution Strategies of Large Bioinformatics Requests over the Grid.",
                    "Designing an Architecture for Distributed Shared Data on the Grid.",
                    "Grinda: A Tuple Space Service for the Globus Toolkit.",
                    "SuMo: A Framework for Prototyping Distributed and Mobile Software.",
                    "A Debugger for Parallel Haskell Dialects.",
                    "Introducing Aspects to the Implementation of a Java Fork/Join Framework.",
                    "Analyzing Software Component Graphs of Grid Middleware: Hint to Performance Improvement.",
                    "Using Multi-core to Support Security-Related Applications.",
                    "Symbolic Analysis for Increased Program Execution Performance."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7th ICA3PP 2007",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2007",
                "sub_name": "Algorithms and Architectures for Parallel Processing, 7th International Conference, ICA3PP 2007, Hangzhou, China, June 11-14, 2007, Proceedings.",
                "count": 44,
                "papers": [
                    "RSM-Based Gossip on P2P Network.",
                    "AnyServer: Ubiquitous Real-Time Multimedia Communication System.",
                    "Performance Analysis of Interconnection Networks Under Bursty and Batch Arrival Traffic.",
                    "Protocols for Traffic Safety Using Wireless Sensor Network.",
                    "A Lazy EDF Interrupt Scheduling Algorithm for Multiprocessor in Parallel Computing Environment.",
                    "Efficient Representations of Row-Sorted 1-Variant Matrices for Parallel String Applications.",
                    "PHC: A Rapid Parallel Hierarchical Cubing Algorithm on High Dimensional OLAP.",
                    "A Time and Interaction Model for Open Distributed Timing Computation.",
                    "Efficient Linkable Ring Signatures and Threshold Signatures from Linear Feedback Shift Register.",
                    "An Implementation of Parallel Eigenvalue Computation Using Dual-Level Hybrid Parallelism.",
                    "An Improved Algorithm for Alhusaini's Algorithm in Heterogeneous Distributed Systems.",
                    "Fuzzy-Grey Prediction Based Dynamic Failure Detector for Distributed Systems.",
                    "A Two-Level Directory Organization Solution for CC-NUMA Systems.",
                    "A Framework of Software Component Adaptation.",
                    "A Parallel Infrastructure on Dynamic EPIC SMT.",
                    "The Thread Migration Mechanism of DSM-PEPE.",
                    "EH*RS: A High-Availability Scalable Distributed Data Structure.",
                    "Optimizing Stream Organization to Improve the Performance of Scientific Computing Applications on the Stream Processor.",
                    "A Parallel Architecture for Motion Estimation and DCT Computation in MPEG-2 Encoder.",
                    "EOP: An Efficient Object Placement and Location Algorithm for OBS Cluster.",
                    "Data Interoperation Between ChinaGrid and SRB.",
                    "Redundant Parallel File Transfer with Anticipative Recursively-Adjusting Scheme in Data Grids.",
                    "A Strategy-Proof Combinatorial Auction-Based Grid Resource Allocation System.",
                    "Method for Computational Grids Resources Allocate Based on Auction and Utility Analyses.",
                    "Service Dependency Model for Dynamic and Stateful Grid Services.",
                    "Automatic Conceptual Indexing of Web Services and Its Application to Service Retrieval.",
                    "Design and Implementation of Computational Bioinformatics Grid Services on GT4 Platforms.",
                    "On-Demand Capacity Framework.",
                    "An Interest-Based Intelligent Link Selection Algorithm in Unstructured P2P Environment.",
                    "Keyword Search in DHT-Based Peer-to-Peer Networks.",
                    "Implementing Digital Right Management in P2P Content Sharing System.",
                    "IPBGA: A Hybrid P2P Based Grid Architecture by Using Information Pool Protocol.",
                    "Understanding Peer Behavior and Designing Incentive Mechanism in Peer-to-Peer Networks: An Analytical Model Based on Game Theory.",
                    "An Efficient Source Peer Selection Algorithm in Hybrid P2P File Sharing Systems.",
                    "A New k-Graph Partition Algorithm for Distributed P2P Simulation Systems.",
                    "A Dominant Input Stream for LUD Incremental Computing on a Contention Network.",
                    "A Double-Objective Genetic Algorithm for Parity Declustering Optimization in Networked RAID.",
                    "Hybrid Diffusion Schemes for Load Balancing on OTIS-Networks.",
                    "A Dynamic Localized Minimum-Energy Agent Tree-Based Data Dissemination Scheme for Wireless Sensor Networks.",
                    "THIN: A New Hierarchical Interconnection Network-on-Chip for SOC.",
                    "Architecture of Adaptive Spam Filtering Based on Machine Learning Algorithms.",
                    "On the Power-Law of the Internet and the Hierarchy of BGP Convergence.",
                    "GDED-X Schemes for Load Balancing on Heterogeneous OTIS-Networks.",
                    "A Generalized Critical Task Anticipation Technique for DAG Scheduling."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6th ICA3PP 2005",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ica3pp/2005",
                "sub_name": "Distributed and Parallel Computing, 6th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP, Melbourne, Australia, October 2-3, 2005, Proceedings.",
                "count": 52,
                "papers": [
                    "Improving Concurrent Write Scheme in File Server Group.",
                    "A Comparative Performance Study of Distributed Mutual Exclusion Algorithms with a Class of Extended Petri Nets.",
                    "A Practical Comparison of Cluster Operating Systems Implementing Sequential and Transactional Consistency.",
                    "Clock Synchronization State Graphs Based on Clock Precision Difference.",
                    "A Recursive-Adjustment Co-allocation Scheme in Data Grid Environments.",
                    "Reducing the Bandwidth Requirements of P2P Keyword Indexing.",
                    "A Deadline and Budget Constrained Scheduling Algorithm for eScience Applications on Data Grids.",
                    "A Survivability Model for Cluster System.",
                    "Localization Techniques for Cluster-Based Data Grid.",
                    "GridFTP and Parallel TCP Support in NaradaBrokering.",
                    "2-Layered Metadata Service Model in Grid Environment.",
                    "pKSS: An Efficient Keyword Search System in DHT Peer-to-Peer Network.",
                    "A Comparative Study at the Logical Level of Centralised and Distributed Recovery in Clusters.",
                    "Toward Self Discovery for an Autonomic Cluster.",
                    "Mining Traces of Large Scale Systems.",
                    "Setup Algorithm of Web Service Composition.",
                    "Self Healing and Self Configuration in a WSRF Grid Environment.",
                    "Study on Life Cycle Model of Dynamic Composed Web Services.",
                    "Fault-Tolerant Dynamic Job Scheduling Policy.",
                    "An Efficient Dynamic Load-Balancing Algorithm in a Large-Scale Cluster.",
                    "Job Scheduling Policy for High Throughput Grid Computing.",
                    "High Performance Task Scheduling Algorithm for Heterogeneous Computing System.",
                    "Execution Environments and Benchmarks for the Study of Applications' Scheduling on Clusters.",
                    "Data Distribution Strategies for Domain Decomposition Applications in Grid Environments.",
                    "Inter-round Scheduling for Divisible Workload Applications.",
                    "Scheduling Divisible Workloads Using the Adaptive Time Factoring Algorithm.",
                    "Adaptive Policy Triggering for Load Balancing.",
                    "Parallel Algorithms for Fault-Tolerant Mobile Agent Execution.",
                    "Design and Multithreading Implementation of the Wave-Front Algorithm for Constructing Voronoi Diagrams.",
                    "A Proposal of Parallel Strategy for Global Wavelet-Based Registration of Remote-Sensing Images.",
                    "Performance Analysis of a Parallel Sort Merge Join on Cluster Architectures.",
                    "Parallel Clustering on the Star Graph.",
                    "Hierarchical Parallel Simulated Annealing and Its Applications.",
                    "Multi-color Difference Schemes of Helmholtz Equation and Its Parallel Fast Solver over 3-D Dodecahedron Partitions.",
                    "GridMD: Program Architecture for Distributed Molecular Simulation.",
                    "Visuel: A Novel Performance Monitoring and Analysis Toolkit for Cluster and Grid Environments.",
                    "Introduction to a New Tariff Mechanism for Charging for Computer Power in the Grid.",
                    "Host Load Prediction for Grid Computing Using Free Load Profiles.",
                    "Active Link: Status Detection Mechanism for Distributed Service Based on Active Networks.",
                    "Performance Monitoring for Distributed Service Oriented Grid Architecture.",
                    "Distributed Defense Against Distributed Denial-of-Service Attacks.",
                    "Security and Safety Assurance Architecture: Model and Implementation (Supporting Multiple Levels of Criticality).",
                    "Modeling and Analysis of Worm and Killer-Worm Propagation Using the Divide-and-Conquer Strategy.",
                    "An Efficient Reliable Architecture for Application Layer Anycast Service.",
                    "A Distributed Approach to Estimate Link-Level Loss Rates.",
                    "Evaluation of Interconnection Network Performance Under Heavy Non-uniform Loads.",
                    "Analytical Models of Probability Distributions for MPI Point-to-Point Communication Times on Distributed Memory Parallel Computers.",
                    "Communication Data Multiplexing in Distributed Simulation.",
                    "Novel Adaptive Subcarrier Power and Bit Allocation Using Wavelet Packet Parallel Architecture.",
                    "A Low-Level Communication Library for Java HPC.",
                    "Object-Oriented Design and Implementations of 3G-324M Protocol Stack.",
                    "Efficient Techniques and Hardware Analysis for Mesh-Connected Processors."
                ]
            }
        ]
    }
]