[
    {
        "year": "2020",
        "name": "26th ICPADS 2020",
        "info": "Hong Kong, SAR, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2020",
                "sub_name": "26th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2020, Hong Kong, December 2-4, 2020.",
                "count": 91,
                "papers": [
                    "LTG-LSM: The Optimal Structure in LSM-tree Combined with Reading Hotness.",
                    "Improved MapReduce Load Balancing through Distribution-Dependent Hash Function Optimization.",
                    "Efficient Sparse-Dense Matrix-Matrix Multiplication on GPUs Using the Customized Sparse Storage Format.",
                    "Joint Service Placement and Request Scheduling for Multi-SP Mobile Edge Computing Network.",
                    "A similarity clustering-based deduplication strategy in cloud storage systems.",
                    "A Fair Task Assignment Strategy for Minimizing Cost in Mobile Crowdsensing.",
                    "Communication-Aware Load Balancing of the LU Factorization over Heterogeneous Clusters.",
                    "An Efficient Work-Stealing Scheduler for Task Dependency Graph.",
                    "LBNN: Perceiving the State Changes of a Core Telecommunications Network via Linear Bayesian Neural Network.",
                    "A Method to Detecting Artifact Anomalies in A Microservice Architecture.",
                    "Contention resolution on a restrained channel.",
                    "Real-Time Scheduling and Analysis of OpenMP Programs with Spin Locks.",
                    "Predicting Performance Degradation on Adaptive Cache Replacement Policy.",
                    "Making Inconsistent Components More Efficient For Hybrid B+Trees.",
                    "XOR-Net: An Efficient Computation Pipeline for Binary Neural Network Inference on Edge Devices.",
                    "Load Balance Awared Data Sharing Systems In Heterogeneous Edge Environment.",
                    "Themis: Malicious Wear Detection and Defense for Persistent Memory File Systems.",
                    "Incentive Mechanism Design for Federated Learning: A Two-stage Stackelberg Game Approach.",
                    "Time Efficient Federated Learning with Semi-asynchronous Communication.",
                    "Multi-agent Fault-tolerant Reinforcement Learning with Noisy Environments.",
                    "Decentralized Exploration of a Structured Environment Based on Multi-agent Deep Reinforcement Learning.",
                    "D2D-Enabled Reliable Data Collection for Mobile Crowd Sensing.",
                    "Improving the Applicability of Visual Peer-to-Peer Navigation with Crowdsourcing.",
                    "Massively Parallel Causal Inference of Whole Brain Dynamics at Single Neuron Resolution.",
                    "An Effective Design to Improve the Efficiency of DPUs on FPGA.",
                    "Lightweight Mobile Devices Indoor Location Based on Image Database.",
                    "A Dynamic Escape Route Planning Method for Indoor Multi-floor Buildings Based on Real-time Fire Situation Awareness.",
                    "Mitigating Cross-Technology Interference in Heterogeneous Wireless Networks based on Deep Learning.",
                    "Accelerating PageRank in Shared-Memory for Efficient Social Network Graph Analytics.",
                    "Using Configuration Semantic Features and Machine Learning Algorithms to Predict Build Result in Cloud-Based Container Environment.",
                    "Joint Service Placement and Computation Offloading in Mobile Edge Computing: An Auction-based Approach.",
                    "Multi-user Edge-assisted Video Analytics Task Offloading Game based on Deep Reinforcement Learning.",
                    "Accelerating Deep Learning Tasks with Optimized GPU-assisted Image Decoding.",
                    "Scheduling Rechargeable UAVs for Long Time Barrier Coverage.",
                    "Use of Genetic Programming Operators in Data Replication and Fault Tolerance.",
                    "Multiple Balance Subsets Stacking for Imbalanced Healthcare Datasets.",
                    "Securing App Behaviors in Smart Home: A Human-App Interaction Perspective.",
                    "Task Offloading in Trusted Execution Environment empowered Edge Computing.",
                    "Gecko: Guaranteeing Latency SLO on a Multi-Tenant Distributed Storage System.",
                    "A Learning-based Dynamic Load Balancing Approach for Microservice Systems in Multi-cloud Environment.",
                    "Enhancing Availability for the MEC Service: CVaR-based Computation Offloading.",
                    "Intermediate Value Size Aware Coded MapReduce.",
                    "A Customized Reinforcement Learning based Binary Offloading in Edge Cloud.",
                    "Optimal Use Of The TCP/IP Stack in User-space Storage Applications with ADQ feature in NIC.",
                    "SIC2: Securing Microcontroller Based IoT Devices with Low-cost Crypto Coprocessors.",
                    "Intelligent Detection Algorithm Against UAVs' GPS Spoofing Attack.",
                    "An Efficient and Scalable Sparse Polynomial Multiplication Accelerator for LAC on FPGA.",
                    "Secure and Verifiable Data Access Control Scheme With Policy Update and Computation Outsourcing for Edge Computing.",
                    "Secure Door on Cloud: A Secure Data Transmission Scheme to Protect Kafka's Data.",
                    "A Solution to Data Accessibility Across Heterogeneous Blockchains.",
                    "PrivAG: Analyzing Attributed Graph Data with Local Differential Privacy.",
                    "Exploring Data Correlation between Feature Pairs for Generating Constraint-based Adversarial Examples.",
                    "A Deep Learning Framework Supporting Model Ownership Protection and Traitor Tracing.",
                    "A social link based private storage cloud.",
                    "Enabling Generic Verifiable Aggregate Query on Blockchain Systems.",
                    "SrSpark: Skew-resilient Spark based on Adaptive Parallel Processing.",
                    "Optimizing Multi-way Theta Join for Data Skew in Sub-second Stream Computing.",
                    "OOOPS: An Innovative Tool for IO Workload Management on Supercomputers.",
                    "URFS: A User-space Raw File System based on NVMe SSD.",
                    "DyRAC: Cost-aware Resource Assignment and Provider Selection for Dynamic Cloud Workloads.",
                    "WMAlloc: A Wear-Leveling-Aware Multi-Grained Allocator for Persistent Memory File Systems.",
                    "Optimizing Complex OpenCL Code for FPGA: A Case Study on Finite Automata Traversal.",
                    "FastCredit: Expediting Credit-based Proactive Transports in Datacenters.",
                    "Proactive Failure Recovery for Stateful NFV.",
                    "TEEp: Supporting Secure Parallel Processing in ARM TrustZone.",
                    "Compressive Sensing based Predictive Online Scheduling with Task Colocation in Cloud Data Center.",
                    "Non-Technical Losses Detection in Smart Grids: An Ensemble Data-Driven Approach.",
                    "Virtual Machine Consolidation for NUMA Systems: A Hybrid Heuristic Grey Wolf Approach.",
                    "A Novel Classification Model to Predict Batch Job Failures in Co-located Cloud.",
                    "Robust Federated Learning Approach for Travel Mode Identification from Non-IID GPS Trajectories.",
                    "Deep Spatio-Temporal Attention Model for Grain Storage Temperature Forecasting.",
                    "Proactive Content Caching for Internet-of-Vehicles based on Peer-to-Peer Federated Learning.",
                    "ABC: An Auction-Based Blockchain Consensus-Incentive Mechanism.",
                    "A Trustworthy Blockchain-based Decentralised Resource Management System in the Cloud.",
                    "DCVP: Distributed Collaborative Video Stream Processing in Edge Computing.",
                    "Efficient Post-quantum Identity-based Encryption with Equality Test.",
                    "How Fast Can We Insert? An Empirical Performance Evaluation of Apache Kafka.",
                    "Graph-based Approaches for the Interval Scheduling Problem.",
                    "MPI Parallelization of NEUROiD Models Using Docker Swarm.",
                    "S-GAT: Accelerating Graph Attention Networks Inference on FPGA Platform with Shift Operation.",
                    "Explainable Congestion Attack Prediction and Software-level Reinforcement in Intelligent Traffic Signal System.",
                    "Dynamic-Static-based Spatiotemporal Multi-Graph Neural Networks for Passenger Flow Prediction.",
                    "Incentive-driven Data Offloading and Caching Replacement Scheme in Opportunistic Mobile Networks.",
                    "Adaptive DNN Partition in Edge Computing Environments.",
                    "Efficient Edge Service Migration in Mobile Edge Computing.",
                    "A protocol-independent container network observability analysis system based on eBPF.",
                    "Performance Guaranteed Single Link Failure Recovery in SDN Overlay Networks.",
                    "A Personal Distributed Real-time Collaborative System.",
                    "Cooperative Resource Sharing Strategy With eMBB Cellular and C-V2X Slices.",
                    "CP-BZD Repair Codes Design for Distributed Edge Computing.",
                    "Computation Task Scheduling and Offloading Optimization for Collaborative Mobile Edge Computing."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th ICPADS 2019",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2019",
                "sub_name": "25th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2019, Tianjin, China, December 4-6, 2019.",
                "count": 145,
                "papers": [
                    "DCSA: Using Density-Based Clustering and Sequential Association Analysis to Predict Alarms in Telecommunication Networks.",
                    "Adaptive Function Launching Acceleration in Serverless Computing Platforms.",
                    "An Active Method to Mitigate the Long Latencies for Host-Aware Shingle Magnetic Recording Drives.",
                    "Cloud Computing Task Scheduling Method Based on a Coral Reefs Optimization Algorithm.",
                    "An Efficient and Transparent Approach for Adaptive Intra-and Inter-Node Virtual Machine Communication in Virtualized Clouds.",
                    "Bridging Server and Cooling: Toward Effective Energy Management in Data Centers.",
                    "ADGS: Anomaly Detection and Localization Based on Graph Similarity in Container-Based Clouds.",
                    "Labeling Scheduler: A Flexible Labeling-Based Jointly Scheduling Approach for Big Data Analysis.",
                    "UR: A User-Based Collaborative Filtering Recommendation System Based on Trust Mechanism and Time Weighting.",
                    "IGATA: An Attraction-Based Online Task Recommendation Framework in Freemium-Crowdsourcing Platform.",
                    "Maximizing Profits of Allocating Limited Resources under Stochastic User Demands.",
                    "Accelerating Fine-Grained Spatial-Textual Trajectory Similarity Joins with GPGPUs.",
                    "Multi-Path Routing Oriented Flow Statistics Collection in Software Defined Networks.",
                    "Distributed Fuzzy Rough Set for Big Data Analysis in Cloud Computing.",
                    "Timed Data Plane Update in Data Center Network.",
                    "Leveraging Spatio-Temporal Patterns for Predicting Citywide Traffic Crowd Flows Using Deep Hybrid Neural Networks.",
                    "Push-Based Network-efficient Hadoop YARN Scheduling Mechanism for In-Memory Computing.",
                    "LADD: A Length-Adaptive Approach to Detecting Taxi Anomalous Detours.",
                    "Characterizing and Balancing the Workloads of Semi-Containerized Clouds.",
                    "Deep Tracking Students Identity and Motion in Classroom.",
                    "Resource Optimization and Traffic-Aware VNF Placement in NFV-Enabled Networks.",
                    "OctopusKing: A TCT-Aware Task Scheduling on Spark Platform.",
                    "A+ Tuning: Architecture+Application Auto-Tuning for In-Memory Data-Processing Frameworks.",
                    "A Novel Algorithm for Optimizing Selection of Cloud Instance Types in Multi-Cloud Environment.",
                    "Joint Correlation-Aware VNF Selection and Placement in Cloud Data Center Networks.",
                    "Effective Straggler Mitigation with Cross-Layer Interference-Aware Optimization.",
                    "Transaction Finality through Ledger Checkpoints.",
                    "Dynamically Adjusting Scale of a Kubernetes Cluster under QoS Guarantee.",
                    "Storage-Reliability-Repair Trade-Offs in Distributed Storage System.",
                    "EC4: ECN and Credit-Reservation Converged Congestion Control.",
                    "A Target Wake Time Based Power Conservation Scheme for Maximizing Throughput in IEEE 802.11ax WLANs.",
                    "Distributed Physical Layer Key Generation for Secure LPWAN Communication.",
                    "Understanding Distributed Poisoning Attack in Federated Learning.",
                    "CPU-GPU Collaborated Computation Models for Biological Sequence Alignment with Mirror-Based Work Load Balancing.",
                    "Diameter/ASPL-Based Mapping of Applications with Uncertain Communication over Random Interconnection Networks.",
                    "MTO: Multicast-Based Traffic Optimization for Information Centric Networks.",
                    "A Data-Sharing Aware and Scalable Cache Miss Rates Model for Multi-Core Processors with Multi-Level Cache Hierarchies.",
                    "T2HT : Traffic-Driven Machine Learning Based Hierarchical Topology Generation Model.",
                    "Revisiting Asynchronous Rumor Spreading in the Blockchain Era.",
                    "Distributed Triangle Counting Algorithms in Simple Graph Stream.",
                    "A Node Rating Based Sharding Scheme for Blockchain.",
                    "Make Page Coloring more Efficient on Slice-Based Three-Level Cache.",
                    "Comparing Busy Poll Socket and NAPI.",
                    "LHC: A Low-Power Heterogeneous Computing Method on Neural Network Accelerator.",
                    "CRState: In-Kernel Checkpoint/Restart of OpenCL Program Execution on GPU.",
                    "Efficient Management and Intelligent Fault Tolerance for HPC Interconnect Networks.",
                    "Active and Adaptive Application-Level Flow Control for Latency Sensitive RPC Applications.",
                    "An Empirical Study of HPC Workloads on Huawei Kunpeng 916 Processor.",
                    "Optimizing the Aggregated Throughput of GPUs in Public Clouds Based on Adaptive Kernel Reordering.",
                    "Latency-Minimized and Energy-Efficient Online Task Offloading for Mobile Edge Computing with Stochastic Heterogeneous Tasks.",
                    "FADBM: Frequency-Aware Dummy-Based Method in Long-Term Location Privacy Protection.",
                    "Deep-RL: Deep Reinforcement Learning for Marking-Aware via per-Port in Data Centers.",
                    "A Permissioned Distributed Ledger for Monitoring Web Content.",
                    "Implementation of Fluid Scheduling Using IPC Control Mechanism.",
                    "HMalloc: A Hybrid, Scalable, and Lock-Free Memory Allocator for Multi-Threaded Applications.",
                    "Enabling Energy-Efficient and Reliable Neural Network via Neuron-Level Voltage Scaling.",
                    "When Learning Joins Edge: Real-Time Proportional Computation Offloading via Deep Reinforcement Learning.",
                    "Cost-Efficient Resource Provision for Multiple Mobile Users in Fog Computing.",
                    "A Framework for Distributed Deep Neural Network Training with Heterogeneous Computing Platforms.",
                    "ADDA: Adaptive Distributed DNN Inference Acceleration in Edge Computing Environment.",
                    "Reliable Redundant Services Placement in Federated Micro-Clouds.",
                    "A Null-Space-Based Verification Scheme for Coded Edge Computing against Pollution Attacks.",
                    "An Edge-Assisted Vehicle Routing Method Based on Game-Theoretic Multiagent Learning.",
                    "MobileEdge: Enhancing On-Board Vehicle Computing Units Using Mobile Edges for CAVs.",
                    "LST-MAC: A Low-Latency Hybrid MAC Protocol for LEO Satellite Supported IoT.",
                    "Joint Heterogeneous Server Placement and Application Configuration in Edge Computing.",
                    "An Edge Computing Service Model Based on Information-Centric Networking.",
                    "Performance Analysis and Characterization of Training Deep Learning Models on Mobile Device.",
                    "ROS Task Scheduling Algorithm in Multi-Core System.",
                    "Contact Ratio Aware Mobile Edge Computing for Content Offloading.",
                    "Enabling Adaptive Deep Neural Networks for Video Surveillance in Distributed Edge Clouds.",
                    "HyPDS: Enabling a Hybrid File Transfer Protocol and Peer to Peer Content Distribution System for Remote Sensing Data.",
                    "Optimal Auction for Resource Allocation in Wireless Virtualization: A Deep Learning Approach.",
                    "Unknown Worker Recruitment with Budget and Covering Constraints for Mobile Crowdsensing.",
                    "Integration of UAV and Fog-Enabled Vehicle: Application in Post-Disaster Relief.",
                    "RFdesk: Record Your Objects on Desktop Using COTS RFID Devices Contactlessly.",
                    "A Location-Aware Duty Cycle Approach toward Energy-Efficient Mobile Crowdsensing.",
                    "Always Connected Things: Building Disaster Resilience IoT Communications.",
                    "FILM: Fine-Grained Book Localization with Mobile RFID Scanning.",
                    "An Effective Spatio-Temporal Query Framework for Massive Trajectory Data in Urban Computing.",
                    "Decentralized Algorithm for Repeating Pattern Formation by Multiple Robots.",
                    "Exploiting Q-Learning in Extending the Network Lifetime of Wireless Sensor Networks with Holes.",
                    "Dynamic Resource Optimization Based on Flexible Numerology and Markov Decision Process for Heterogeneous Services.",
                    "RF-ARP: RFID-Based Activity Recognition and Prediction in Smart Home.",
                    "Real-Time Resource Slicing for 5G RAN via Deep Reinforcement Learning.",
                    "Cost-Efficient Node Deployment for Intrusion Detection in Underwater Sensor Networks.",
                    "Deep and Efficient Impact Models for Edge Characterization and Control of Energy Events.",
                    "SEAD: Towards A Social-Media-Driven Energy-Aware Drone Sensing Framework.",
                    "iShake: Imitation-Resistant Secure Pairing of Smart Devices via Shaking.",
                    "A Hierarchical Futures Data Analysis Framework for Multiple Accounts Detection.",
                    "MoRa: A LoRa-Based System for Timely and Energy-Efficient e-Price Tag Update in Markets.",
                    "UAV-Net: Effective and Efficient UAV Network Deployment for Extending Cell Tower Coverage.",
                    "Ground-Station Based Software-Defined LEO Satellite Networks.",
                    "P3R: Realizing Robust Routing for VANET Using Trajectory Prediction and Crossroad Recognition.",
                    "Efficient Multi-Keyword Based Service Discovery Routing in Peer-to-Peer IoT Networks.",
                    "Path Planning Method Based on the Location Uncertainty of Water Surface Nodes in Underwater Sensor Network.",
                    "The Design and Implementation of Edge Computing-Based Intelligent Ashcan Management System for Smart Community.",
                    "Multi-Channel Physiological Signal Emotion Recognition Based on ReliefF Feature Selection.",
                    "A Subregional Monitoring-Oriented Topology Control Strategy in UWSNs.",
                    "VCEC: Velocity Control of Energy-Constrained RF-Based Wireless Charger in Sensor Networks with Multi-Depots Deployment.",
                    "Energy-Efficient Admission of Delay-Sensitive Tasks for Multi-Mobile Edge Computing Servers.",
                    "Information-Centric Local Resource Sharing System on Smart Phones.",
                    "Cost-Effective Signal Map Crowdsourcing with Auto-Encoder Based Active Matrix Completion.",
                    "Predictive Maintenance Using GPU-Accelerated Partially Observable Markov Decision Process.",
                    "The Automatic Text Classification Method Based on BERT and Feature Union.",
                    "Dynamic Query Tree Anti-Collision Protocol for RFID Systems.",
                    "DeepAoA: Online Vehicular Direction Finding Based on a Deep Learning Method.",
                    "Towards Efficient Parallel Multipathing: A Receiver-Centric Cross-Layer Solution to Aid Multipath TCP.",
                    "Location Familiarity Oriented Task Planning in Spatial Crowdsourcing.",
                    "Optimizing the Waiting Time of Sensors in a MANET to Strike a Balance between Energy Consumption and Data Timeliness.",
                    "MagWi: Practical Indoor Localization with Smartphone Magnetic and WiFi Sensors.",
                    "Unsupervised Classification for Social Networks with RS Matrix.",
                    "Deeplive: QoE Optimization for Live Video Streaming through Deep Reinforcement Learning.",
                    "Joint Spatial-Temporal Trajectory Clustering Method for Mobile Social Networks.",
                    "PADVA: A Blockchain-Based TLS Notary Service.",
                    "Non-Deterministic Behavior Analysis for Embedded Software Based on Probabilistic Model Checking.",
                    "Toward Secure, Privacy-Preserving, and Interoperable Medical Data Sharing via Blockchain.",
                    "Predicting the Silent Data Corruption Vulnerability of Instructions in Programs.",
                    "KerTSDroid: Detecting Android Malware at Scale through Kernel Task Structures.",
                    "Cache Side-Channel Attacks: Flush+Flush and the Countermeasures Time Gap.",
                    "Arithmetic Computation Using Self-Assembly of DNA Tiles: Point-Addition on Conic Curves over Finite Field GF(2n).",
                    "A Verifiable Dynamic Multi-user Searchable Encryption Scheme without Trusted Third Parties.",
                    "A Systematic Approach to Horizontal Clustering Analysis on Embedded RSA Implementation.",
                    "STNN: A Novel TLS/SSL Encrypted Traffic Classification System Based on Stereo Transform Neural Network.",
                    "A Survey on 5G Network Slicing Enabling the Smart Grid.",
                    "Electrical Sensing and Control Information Flows Optimization Algorithm in Cyber Power Physical System.",
                    "FStream: Flexible Stream Scheduling and Prioritizing in Multipath-QUIC.",
                    "An Adaptive Probability Prediction Routing Scheme in Urban DTNs.",
                    "Joint Uplink-Downlink Resource Allocation under Outage Case in Vehicular Communications.",
                    "Random Noise Redunction of Seismic Data in NSCT Domain.",
                    "Heading Judgment for the Waist-Mounted MIMU Using LSTM.",
                    "Capability Leakage Detection between Android Applications Based on Dynamic Feedback.",
                    "IDTree: Concise Hierarchical Data Representation for Resource-Constrained Smart Objects.",
                    "An Energy Efficiency Approach via Self-Adaptive Duty-Cycle in Social Contacts Scenario.",
                    "Edge-Cloud Collaborative Computation Offloading Model Based on Improved Partical Swarm Optimization in MEC.",
                    "Clustering-Based Algorithm for Services Deployment in Mobile Edge Computing Environment.",
                    "Spatio-Temporal Position Prediction Model for Mobile Users Based on LSTM.",
                    "An Efficient Mobile Server Task Scheduling Algorithm in D2D Environment.",
                    "Designing and Developing High-Confidence Petroleum Extraction Cyber-Physical System Using the Model-Driven Architecture.",
                    "EASVD: A Modified Method to Enhance the Authentication for SPICE Virtual Desktop.",
                    "PPGAN: Privacy-Preserving Generative Adversarial Network.",
                    "Multi-Platform Application Interaction Extraction for IoT Devices.",
                    "K-Bucket Based Raft-Like Consensus Algorithm for Permissioned Blockchain.",
                    "On the Design of Software-Defined Service-Centric Networking for Mobile Cloud Computing.",
                    "Efficient Multi-party Computation Algorithm Design for Real-World Applications."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th ICPADS 2018",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2018",
                "sub_name": "24th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2018, Singapore, December 11-13, 2018.",
                "count": 137,
                "papers": [
                    "A Light-Weight and Quality-Aware Online Adaptive Sampling Approach for Streaming Social Sensing in Cloud Computing.",
                    "H-Scheduler: Storage-Aware Task Scheduling for Heterogeneous-Storage Spark Clusters.",
                    "Mining Magnitude-Oblivious Periodical Patterns of Dockless Shared Bike Demands.",
                    "Statistical Monitoring for NVM Write.",
                    "ENSC: Multi-Resource Hybrid Scaling for Elastic Network Service Chain in Clouds.",
                    "Parallelizing Recursive Backtracking Based Subgraph Matching on a Single Machine.",
                    "Performance Analysis of 3D XPoint SSDs in Virtualized and Non-Virtualized Environments.",
                    "Co- Location Resistant Virtual Machine Placement in Cloud Data Centers.",
                    "Intelligent Large-Scale AP Control with Remarkable Energy Saving in Campus WiFi System.",
                    "Leveraging Inner-Connection of Message Sequence for Traffic Classification: A Deep Learning Approach.",
                    "Towards Personalized Learning Through Class Contextual Factors-Based Exercise Recommendation.",
                    "Energy-Efficient Core Allocation and Deployment for Container-Based Virtualization.",
                    "How Does the Workload Look Like in Production Cloud? Analysis and Clustering of Workloads on Alibaba Cluster Trace.",
                    "How to Buy Cloud Resource Better for IaaS User: from the Perspective of Cloud Elasticity Testing.",
                    "Seal: Efficient Training Large Scale Statistical Machine Translation Models on Spark.",
                    "Parallelizing Machine Learning Optimization Algorithms on Distributed Data-Parallel Platforms with Parameter Server.",
                    "A Heuristic Approach for Website Classification with Mixed Feature Extractors.",
                    "Partitioning and Bucketing Techniques to Speed up Query Processing in Spark-SQL.",
                    "Provably Efficient Algorithms for VNF Routing Optimization.",
                    "Concurrent Hybrid Breadth-First-Search on Distributed PowerGraph for Skewed Graphs.",
                    "Leveraging User Heterogeneities to Maximize Profits in the Cloud.",
                    "An Efficient Segment Grouping Approach for Active Disk-Based Storage Systems.",
                    "Phase Space Based Energy Consumption Model and Optimization Analysis in Clouds.",
                    "Server Consolidation in Cloud Computing.",
                    "mm- Humidity: Fine-Grained Humidity Sensing with Millimeter Wave Signals.",
                    "O- Recommend: An Optimized User-Based Collaborative Filtering Recommendation System.",
                    "WiFi and Multiple Interfaces: Adequate for Virtual Reality?",
                    "Stop Unauthorized Access to Your Smart Devices.",
                    "WiFi-Sensing Based Person-to-Person Distance Estimation Using Deep Learning.",
                    "VPad: Virtual Writing Tablet for Laptops Leveraging Acoustic Signals.",
                    "Research on Fast and Parallel Clustering Method for Trajectory Data.",
                    "When Packages Ride a Bus: Towards Efficient City-Wide Package Distribution.",
                    "ISAECC: An Improved Scheduling Approach for Energy Consumption Constrained Parallel Applications on Heterogeneous Distributed Systems.",
                    "NDN Producer Mobility Management Based on Echo State Network: A Lightweight Machine Learning Approach.",
                    "User Experience-Enhanced and Energy-Efficient Task Scheduling on Heterogeneous Multi-Core Mobile Systems.",
                    "SRVoice: A Robust Sparse Representation-Based Liveness Detection System.",
                    "Passive Acoustic Localization Based on COTS Mobile Devices.",
                    "Fine-Grained Task-Level Parallel and Low Power H.264 Decoding in Multi-Core Systems.",
                    "Design Issues of Novel Round Robin Scheduling Scheme to Improve Processing Performance in a 5G MMWave Network.",
                    "An Insurance-Based Framework Against Security Threat in Mobile Crowdsourcing Systems.",
                    "An Experimental Study on WeChat-Based Large Scale Indoor Localization System.",
                    "Energy-Efficient Min-Max Planning of Heterogeneous Tasks with Multiple UAVs.",
                    "Data Locality Exploitation in Cache Compression.",
                    "AGCM3D: A Highly Scalable Finite-Difference Dynamical Core of Atmospheric General Circulation Model Based on 3D Decomposition.",
                    "A Self-Stabilizing Algorithm for Two Disjoint Minimal Dominating Sets with Safe Convergence.",
                    "UpPreempt: A Fine-Grained Preemptive Scheduling Strategy for Container-Based Clusters.",
                    "REOH: Using Probabilistic Network for Runtime Energy Optimization of Heterogeneous Systems.",
                    "Effectiveness of Moldable and Malleable Scheduling in Deep Learning Tasks.",
                    "CACH-Dedup: Content Aware Clustered and Hierarchical Deduplication.",
                    "OCAL: An Abstraction for Host-Code Programming with OpenCL and CUDA.",
                    "GPGPU Performance Estimation with Core and Memory Frequency Scaling.",
                    "A DAG Model of Synchronous Stochastic Gradient Descent in Distributed Deep Learning.",
                    "Temperature and Power Aware Server Placement Optimization for Enterprise Data Center.",
                    "On the Power of Combiner Optimizations in MapReduce Over MPI Workflows.",
                    "Efficient Algorithms for Graph Coloring on GPU.",
                    "JSNVM: Supporting Data Persistence in JavaScript Using Non-Volatile Memory.",
                    "cuBool: Bit-Parallel Boolean Matrix Factorization on CUDA-Enabled Accelerators.",
                    "Optimizing Deep Learning Frameworks Incrementally to Get Linear Speedup: A Comparison Between IPoIB and RDMA Verbs.",
                    "Model-Based Proactive Read-Validation in Transaction Processing Systems.",
                    "A Dynamic Load Balancing Scheme for Distributed Formal Concept Analysis.",
                    "Memory Bandwidth Contention: Communication vs Computation Tradeoffs in Supercomputers with Multicore Architectures.",
                    "A Compiler Framework for Fixed-Topology Non-Deterministic Finite Automata on SIMD Platforms.",
                    "Explorations of Data Swapping on Burst Buffer.",
                    "Hardware Cost and Energy Consumption Optimization for Safety-Critical Applications on Heterogeneous Distributed Embedded Systems.",
                    "Filter Assignment Policy Against Distributed Denial-of-Service Attack.",
                    "Towards Privacy-Preserving Malware Detection Systems for Android.",
                    "An Efficient Fault Tolerance Framework for Distributed In-Memory Caching Systems.",
                    "Blockchain Based Data Integrity Verification in P2P Cloud Storage.",
                    "CoLoR: Co-Located Rescuers for Fault Tolerance in HPC Systems.",
                    "Reliability-Aware Energy Optimization for Throughput-Constrained Applications on MPSoC.",
                    "T-Tracker: Compressing System Audit Log by Taint Tracking.",
                    "Topology-Aware Efficient Storage Scheme for Fault-Tolerant Storage Systems in Data Centers.",
                    "Reputation-Based Byzantine Fault-Tolerance for Consortium Blockchain.",
                    "DoS Mitigation Mechanism Based on Non-Cooperative Repeated Game for SDN.",
                    "Exploiting Code Diversity to Enhance Code Virtualization Protection.",
                    "Virtualized Security Function Placement for Security Service Chaining in Cloud.",
                    "Userspace Hypervisor Data Characterization in Virtualized Environment.",
                    "Improved Differential Fault Analysis on LED with Constraint Equations: Towards Reaching Its Limit.",
                    "Optimized Lightweight Hardware Trojan-Based Fault Attack on DES.",
                    "Toward Fast Regex Pattern Matching Using Simple Patterns.",
                    "JALAD: Joint Accuracy-And Latency-Aware Deep Structure Decoupling for Edge-Cloud Execution.",
                    "TIMAO: Time-Sensitive Mobile Advertisement Offloading with Performance Guarantee.",
                    "Mobility-Aware Video Prefetch Caching and Replacement Strategies in Mobile-Edge Computing Networks.",
                    "RCANE: Semi-Centralized Network of Parallel Blockchain and APoS.",
                    "ETRA: Efficient Three-Stage Resource Allocation Auction for Mobile Blockchain in Edge Computing.",
                    "Cost-Efficient Resource Provisioning in Delay-Sensitive Cooperative Fog Computing.",
                    "A Non-Intrusive Multi-Parameter Fault Diagnosis System for Industrial Machineries.",
                    "Dewing in Fog: Incentive-Aware Micro Computing Cluster Formation for Fog Computing.",
                    "MCPC: Improving In-Network Caching with Network Partitions.",
                    "Communication Scheduling Optimization for Distributed Deep Learning Systems.",
                    "OptCaching: A Stackelberg Game and Belief Propagation Based Caching Scheme for Joint Utility Optimization in Fog Computing.",
                    "Privacy-Aware Edge Computing in Social Sensing Applications Using Ring Signatures.",
                    "Cost-Efficient and Latency-Aware Workflow Scheduling Policy for Container-Based Systems.",
                    "Full System Emulation of Embedded Heterogeneous Multicores Based on QEMU.",
                    "On the Tradeoff Between Data-Privacy and Utility for Data Publishing.",
                    "Edge Caching via Content Offloading in Heterogeneous Mobile Opportunistic Networks.",
                    "TLed: Time-Lived Based Congestion and Rate Control for Video in Named Data Networking.",
                    "Scalable Communication Endpoints for MPI+Threads Applications.",
                    "Co2-Robot: A Collaborative Communication Protocol for Swarm Robots.",
                    "A MDP-Based Network Selection Scheme in 5G Ultra-Dense Network.",
                    "Relaxed Collision Constraints Based on Interval Superposition Principle in a DMPC Scheme.",
                    "IDTable: Self-Describing Relational Data for Resource-Constraint Smart Objects.",
                    "Coalitional Game Based Carpooling Algorithms for Quality of Experience.",
                    "EdgeCNN: A Hybrid Architecture for Agile Learning of Healthcare Data from IoT Devices.",
                    "Online Drone-Based Moving Target Detection System in Dense-Obstructer Environment.",
                    "Packet-in-Packet: Concatenation with Concurrent Transmission for Data Collection in Low-Power Wireless Sensor Networks.",
                    "The Improved Fingerprint-Based Indoor Localization with RFID/PDR/MM Technologies.",
                    "Estimating the Extrema of Large-Scale RFID Systems.",
                    "Resilience Bounds of Sensing-Based Network Clock Synchronization.",
                    "GraphEL: A Graph-Based Ensemble Learning Method for Distributed Diagnostics and Prognostics in the Industrial Internet of Things.",
                    "Accurate Performance Modeling of Uplink Transmission in NB-IoT.",
                    "TRANSAX: A Blockchain-Based Decentralized Forward-Trading Energy Exchanged for Transactive Microgrids.",
                    "From Insight to Impact: Building a Sustainable Edge Computing Platform for Smart Homes.",
                    "Query Processing on OpenCL-Based FPGAs: Challenges and Opportunities.",
                    "Oinput: A Bone-Conductive QWERTY Keyboard Recognition for Wearable Device.",
                    "Measurement and QoE Modeling of Broadband Home Networks with Large-Scale Crowdsourcing.",
                    "Mobility-Driven BLE Transmit-Power Adaptation for Participatory Data Muling.",
                    "Multi-Tenant Cloud Service Composition Using Evolutionary Optimization.",
                    "Optimal Fee Structure for Efficient Lightning Networks.",
                    "Building an Ethereum and IPFS-Based Decentralized Social Network System.",
                    "MSig-BFT: A Witness-Based Consensus Algorithm for Private Blockchains.",
                    "EMRShare: A Cross-Organizational Medical Data Sharing and Management Framework Using Permissioned Blockchain.",
                    "Building an Ethereum-Based Decentralized Smart Home System.",
                    "A Survey of Consensus and Incentive Mechanism in Blockchain Derived from P2P.",
                    "A Topological Model for the Blockchain.",
                    "Blockchain and IoT Data Analytics for Fine-Grained Transportation Insurance.",
                    "The Case of a Novel Operational Distributed Storage Service for Big Data in a Semiconductor Wafer Fabrication Foundry.",
                    "Eunomia: a Performance-Variation-Aware Fair Job Scheduler with Placement Constraints for Heterogeneous Datacenters.",
                    "Fine-Grained Big Data Security Method Based on Zero Trust Model.",
                    "An Overview on the Convergence of High Performance Computing and Big Data Processing.",
                    "A Quick Survey on Large Scale Distributed Deep Learning Systems.",
                    "Modeling Application Performance in Docker Containers Using Machine Learning Techniques.",
                    "JCDTA: The Data Trading Archtecture Design in JointCloud Computing.",
                    "A Traffic Sign Text Detection System for Pratical Natural Scenes.",
                    "Scalability Analysis of Cloud-Based Distributed Simulations of IoT Systems Using HLA.",
                    "Rebalance Modern Bike Sharing System: Spatio-Temporal Data Prediction and Path Planning for Multiple Carriers.",
                    "Bus Bunching Identification Using Smart Card Data."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd ICPADS 2017",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2017",
                "sub_name": "23rd IEEE International Conference on Parallel and Distributed Systems, ICPADS 2017, Shenzhen, China, December 15-17, 2017.",
                "count": 103,
                "papers": [
                    "Event Description and Detection in Cyber-Physical Systems: An Ontology-Based Language and Approach.",
                    "BARTON: Low Power Tongue Movement Sensing with In-Ear Barometers.",
                    "A Time Series Classification Method for Battery Event Detection.",
                    "AppIS: Protect Android Apps Against Runtime Repackaging Attacks.",
                    "Charge-Depleting of the Batteries Makes Smartphones Recognizable.",
                    "Concatenating Road Take Me Home: Indoor Navigation Without Infrastructure Support.",
                    "Data Collection with Privacy Preserving in Participatory Sensing.",
                    "Hierarchical Resource Distribution Network Based on Mobile Edge Computing.",
                    "Machine Learning (ML)-Based Air Quality Monitoring Using Vehicular Sensor Networks.",
                    "ML-NA: A Machine Learning Based Node Performance Analyzer Utilizing Straggler Statistics.",
                    "MODE: A Context-Aware IoT Middleware Supporting On-Demand Deployment for Mobile Devices.",
                    "WiSH: The Design and Implementation of a Real-Time System for Whole-Day Human Detection.",
                    "When User Interest Meets Data Quality: A Novel User Filter Scheme for Mobile Crowd Sensing.",
                    "Toward Heterogeneity-Aware Device-to-Device Data Dissemination over Wi-Fi Networks.",
                    "SpeAR: A Fast AR System with High Accuracy Deployed on Mobile Devices.",
                    "SoundWrite II: Ambient Acoustic Sensing for Noise Tolerant Device-Free Gesture Recognition.",
                    "Online Auctions with Dynamic Costs for Ridesharing.",
                    "HartSift: A High-Accuracy and Real-Time SIFT Based on GPU.",
                    "High Resource Utilization Auto-Scaling Algorithms for Heterogeneous Container Configurations.",
                    "A Fast, General Storage Replication Protocol for Active-Active Virtual Machine Fault Tolerance.",
                    "AutoMJ: Towards Efficient Multi-way Join Query on Distributed Data-Parallel Platform.",
                    "Bloomfish: A Highly Scalable Distributed K-mer Counting Framework.",
                    "COSY: An Energy-Efficient Hardware Architecture for Deep Convolutional Neural Networks Based on Systolic Array.",
                    "D-Ary Cuckoo Filter: A Space Efficient Data Structure for Set Membership Lookup.",
                    "Distributed Set Intersection and Union with Local Differential Privacy.",
                    "Efficient Data Blocking and Skipping Framework Applying Heuristic Rules.",
                    "Efficient GPU-Based Query Processing with Pruned List Caching in Search Engines.",
                    "Exploiting RDMA for Distributed Low-Latency Key/Value Store on Non-volatile Main Memory.",
                    "Exploring Synchronization in Cache Coherent Manycore Systems: A Case Study with Xeon Phi.",
                    "Extending Blockchain Functionality with Statechain.",
                    "Fast Parallel Recovery of Many Small In-Memory Objects.",
                    "Feature Guided In-Situ Indices Generation and Data Placement on Distributed Deep Memory Hierarchies.",
                    "Fingerprinting Protocol at Bit-Level Granularity: A Graph-Based Approach Using Cell Embedding.",
                    "GraphMP: An Efficient Semi-External-Memory Big Graph Processing System on a Single Machine.",
                    "HARS: A Hybrid Adaptive Routing Scheme for Underwater Sensor Networks.",
                    "High Performance and Scalable Virtual Machine Storage I/O Stack for Multicore Systems.",
                    "iCAST: Accelerating High-Performance Data Center Applications by Hybrid Electrical and Optical Multicast.",
                    "Loc-K: A Spatial Locality-Based Memory Deduplication Scheme with Prediction on K-Step Locations.",
                    "Managing Persistent Objects with a Unified Access Framework in Persistent Memory.",
                    "Virtual Machine Placement for Hybrid Cloud Using Constraint Programming.",
                    "tScale: A Contention-Aware Multithreaded Framework for Multicore Multiprocessor Systems.",
                    "Supervised Learning Based Algorithm Selection for Deep Neural Networks.",
                    "Scalable Blockchain Based Smart Contract Execution.",
                    "Routing in IoT Network for Dynamic Service Discovery.",
                    "RING: NUMA-Aware Message-Batching Runtime for Data-Intensive Applications.",
                    "REMOLD: An Efficient Model-Based Clustering Algorithm for Large Datasets with Spark.",
                    "Practical Concurrent Self-Organizing Lists.",
                    "PBUF: Sharing Buffer to Mitigate Flooding Attacks.",
                    "Optimize the FP-Tree Based Graph Edge Weight Computation on Multi-core MapReduce Clusters.",
                    "CMIP: Data Transmission Latency Optimization for Cooperative Group in Multi-cloud by Adaptive Routing.",
                    "Scalable Hash Ripple Join on Spark.",
                    "Ambula: Build Communication Lifeline of Corporations During Emergency.",
                    "MCS: Memory Constraint Strategy for Unified Memory Manager in Spark.",
                    "A Virtual Middleboxes Network Placement Algorithm in Multi-tenant Datacenter Networks.",
                    "Accelerating Traditional File Systems on Non-volatile Main Memory.",
                    "Ada-copy: An Adaptive Memory Copy Strategy for Virtual Machine Live Migration.",
                    "An ARIMA Based Real-time Monitoring and Warning Algorithm for the Anomaly Detection.",
                    "CPU/GPU Collaboration Techniques for Transfer Learning on Mobile Devices.",
                    "D-Storm: Dynamic Resource-Efficient Scheduling of Stream Processing Applications.",
                    "Estimating Clustering Coefficient via Random Walk on MapReduce.",
                    "Kinetic Action: Performance Analysis of Integrated Key-Value Storage Devices vs. LevelDB Servers.",
                    "Maximizing the Profit of Cloud Broker with Priority Aware Pricing.",
                    "Multi-objective Optimizations in Geo-Distributed Data Analytics Systems.",
                    "WSWDC: VLC Enabled Wireless Small-World Data Centers.",
                    "User Perceived Value-Aware Cloud Pricing for Profit Maximization of Multiserver Systems.",
                    "Spark-Based Measurement and Analysis on Offline Mobile Application Market over Device-to-Device Sharing in Mobile Social Networks.",
                    "Shadow: Exploiting the Power of Choice for Efficient Shuffling in MapReduce.",
                    "Scheduling for Energy Efficiency and Throughput Maximization in a Faulty Cloud Environment.",
                    "Road Recognition Using Big Data of Coarse-Grained Vehicular Footprints.",
                    "Online Flow Scheduling with Deadline for Energy Conservation in Data Center Networks.",
                    "An Analytical Study of Recursive Tree Traversal Patterns on Multi- and Many-Core Platforms.",
                    "An Efficient Label Routing on High-Radix Interconnection Networks.",
                    "Automatic and Transparent Resource Contention Mitigation for Improving Large-Scale Parallel File System Performance.",
                    "Betweenness Centrality Revisited on Four Processors.",
                    "Delay-Guaranteed Minimum Cost Forest for Uncertain Multicast.",
                    "Drowsy Register Files for Reducing GPU Leakage Energy.",
                    "GPU-Based Parallel Genetic Algorithm for Increasing the Coverage of WSNs.",
                    "Green Energy Aware Scheduling Problem in Virtualized Datacenters.",
                    "Hexe: A Toolkit for Heterogeneous Memory Management.",
                    "HiRy: An Advanced Theory on Design of Deadlock-Free Adaptive Routing for Arbitrary Topologies.",
                    "vMCA: Memory Capacity Aggregation and Management in Cloud Environments.",
                    "SA-PFRS: Semantics-Aware Page Frame Reclamation System in Virtualized Environments.",
                    "Rethinking Multicore Application Scalability on Big Virtual Machines.",
                    "Regional Congestion Control in Datacenter Networks.",
                    "Portable Topology-Aware MPI-I/O.",
                    "Parallel I/O Optimizations for Scalable Deep Learning.",
                    "Pangu: Towards a Software-Defined Architecture for Multi-function Wireless Sensor Networks.",
                    "Agreement in Epidemic Data Aggregation.",
                    "Fine-Grained and Real-Time Gesture Recognition by Using IMU Sensors.",
                    "A FO-ADRC Based Neutral-Point Potential Balancing for Three-Level Inverter.",
                    "State Identification of Cabinets Based on Convolution Neural Network.",
                    "Using LSTM Networks to Identify False Data of Smart Terminals in the Smart Grid.",
                    "Vulnerability Detection in IoT Firmware: A Survey.",
                    "Exploring the Efficiency of Data Collection Schemes in Wireless Sensor Networks.",
                    "HomeSpy: Inferring User Presence via Encrypted Traffic of Home Surveillance Camera.",
                    "Location Prediction Based on User Mobile Behavior Similarity.",
                    "SOLO: 2D Localization with Single Sound Source and Single Microphone.",
                    "Using Positioning Priorities for Accurate Anchor-Based Node Location over Wireless Sensor Networks.",
                    "Multi-attribute Event Modeling and Prediction over Event Streams from Sensors.",
                    "Blockchain with Accountable CP-ABE: How to Effectively Protect the Electronic Documents.",
                    "Blockchain-Based Government Information Resource Sharing.",
                    "M2M Blockchain: The Case of Demand Side Management of Smart Grid.",
                    "Education Application of Blockchain Technology: Learning Outcome and Meta-Diploma."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd ICPADS 2016",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2016",
                "sub_name": "22nd IEEE International Conference on Parallel and Distributed Systems, ICPADS 2016, Wuhan, China, December 13-16, 2016.",
                "count": 160,
                "papers": [
                    "A Distributed Auction Approach to Crowdsourced Sensing over Smartphones.",
                    "A Hybrid Approach Based on Collaborative Filtering to Recommending Mobile Apps.",
                    "Bat with Good Eyesight: Using Acoustic Signal and Image to Achieve Accurate Indoor Localization.",
                    "Delay Tolerant Routing for Cognitive Radio Vehicular Ad Hoc Networks.",
                    "Distributed Optimal Source Coding Rate Allocation for Data Aggregation in Wireless Sensor Networks.",
                    "Distributed Real-Time Pricing Scheme for Local Power Supplier in Smart Community.",
                    "Drone-Based Wireless Relay Using Online Tensor Update.",
                    "EHR: Routing Protocol for Energy Harvesting Wireless Sensor Networks.",
                    "Enabling Mobile Device Coordination over Distributed Shared Memory.",
                    "Identifying a New Non-Linear CSI Phase Measurement Error with Commodity WiFi Devices.",
                    "NoiseSense: A Crowd Sensing System for Urban Noise Mapping Service.",
                    "OR-Play: An Optimal Relay Placement Scheme for High-Quality Wireless Network Services.",
                    "Physical Object Model for Smart Environments with Temporal Capability.",
                    "ppNav: Peer-to-Peer Indoor Navigation for Smartphones.",
                    "PUZZLE: Enhancing Throughput by Covering Neighbor's Blanks.",
                    "QoE-Driven Cross-Layer Design for Device-to-Device Video Delivery.",
                    "Resource Scheduling Based on Improved FCM Algorithm for Mobile Cloud Computing.",
                    "Smart-DJ: Context-Aware Personalization for Music Recommendation on Smartphones.",
                    "Smartphone Virtualization.",
                    "TIP: Time-Efficient Identification Protocol for Unknown RFID Tags Using Bloom Filters.",
                    "A Peer-to-Peer File Sharing System over Named Data Networking.",
                    "A Potential Field Based Framework for Publish/Subscribe Service in P2P Cloud.",
                    "A Weighted Network Model Based on Node Fitness Dynamic Evolution.",
                    "An Efficient Parallel Approach of Parsing and Indexing for Large-Scale XML Datasets.",
                    "DMNS: A Framework to Dynamically Monitor Simulated Network.",
                    "DOCO: An Efficient Event Matching Algorithm in Content-Based Publish/Subscribe Systems.",
                    "DScheduler: Dynamic Network Scheduling Method for MapReduce in Distributed Controllers.",
                    "Garlic Cast: Lightweight and Decentralized Anonymous Content Sharing.",
                    "Modeling Traffic of Big Data Platform for Large Scale Datacenter Networks.",
                    "SHSA: A Method of Network Verification with Stateful Header Space Analysis.",
                    "Study of Intra- and Interjob Interference on Torus Networks.",
                    "Virtual Path Assignment Based on Load Balancing for SDNs.",
                    "A Comparison of Road-Network-Constrained Trajectory Compression Methods.",
                    "A Complicated Task Solution Scheme Based on Node Cooperation for Wireless Sensor Networks.",
                    "A Reliable Depth-Based Routing Protocol with Network Coding for Underwater Sensor Networks.",
                    "Accomplishing Information Consistency under OSPF in General Networks.",
                    "An Optimized RM Algorithm by Task Affinity on Multi-Core Processor.",
                    "An Optimized RPL Protocol for Wireless Sensor Networks.",
                    "FPGA-Based Parallel Implementation of SURF Algorithm.",
                    "Hierarchically Social-Aware Incentivized Caching for D2D Communications.",
                    "HMF: Heatmap and WiFi Fingerprint-Based Indoor Localization with Building Layout Consideration.",
                    "mtCloudSim: A Flow-Level Network Simulator for Multi-Tenant Cloud.",
                    "Optimized Virtual Network Functions Migration for NFV.",
                    "PROAR: A Weak Consistency Model for Ceph.",
                    "TaxiCast: Efficient Broadcasting of Multimedia Advertisements in Vehicular Ad-Hoc Networks.",
                    "Very Low-Resolution Face Recognition via Semi-Coupled Locality-Constrained Representation.",
                    "Watch Traffic in the Sky: A Method for Path Selection in Packet Transmission between V2V from Macro Perspective.",
                    "A Provably Secure Blind Signature Based on Coding Theory.",
                    "A Users Collaborative Scheme for Location and Query Privacy.",
                    "An Approach of Anti-Eavesdropping Linear Network Coding in Wireless Network.",
                    "Automatic Security Bug Classification: A Compile-Time Approach.",
                    "Baseline Is Fragile: On the Effectiveness of Stack Pivot Defense.",
                    "CC-Paxos: Integrating Consistency and Reliability in Wide-Area Storage Systems.",
                    "Multi-User Location Correlation Protection with Differential Privacy.",
                    "Opportunistic Probe: An Efficient Adaptive Detection Model for Collaborative Intrusion Detection.",
                    "Outsourcing Large-Scale Systems of Linear Matrix Equations in Cloud Computing.",
                    "RuleCache: A Mobility Pattern Based Multi-Level Cache Approach for Location Privacy Protection.",
                    "Towards a Framework to Facilitate the Mobile Advertising Ecosystem.",
                    "A Novel Method of Keyword Query for RDF Data Based on Bipartite Graph.",
                    "A Unified Access Manner for Storage-Class Memory.",
                    "Application-Aware and Software-Defined SSD Scheme for Tencent Large-Scale Storage System.",
                    "Catenae: Low Latency Transactions across Multiple Data Centers.",
                    "Checking the Inconsistent Data in Concurrent Systems by Petri Nets with Data Operations.",
                    "CloudBB: Scalable I/O Accelerator for Shared Cloud Storage.",
                    "DEC: An Efficient Deduplication-Enhanced Compression Approach.",
                    "Exploiting the Data Redundancy Locality to Improve the Performance of Deduplication-Based Storage Systems.",
                    "High Throughput Log-Based Replication for Many Small In-Memory Objects.",
                    "Improving MLC Flash Performance with Workload-Aware Differentiated ECC.",
                    "Improving Write Performance of LSMT-Based Key-Value Store.",
                    "Lifting Wavelet Compression Based Data Aggregation in Big Data Wireless Sensor Networks.",
                    "masFS: File System Based on Memory and SSD in Compute Nodes for High Performance Computers.",
                    "NVMCFS: Complex File System for Hybrid NVM.",
                    "Optimizing Data Placement of MapReduce on Ceph-Based Framework under Load-Balancing Constraint.",
                    "ScalaRDF: A Distributed, Elastic and Scalable In-Memory RDF Triple Store.",
                    "SLA-DO: A SLA-Based Data Distribution Strategy on Multiple Cloud Storage Systems.",
                    "The Implementation of Supporting Uniform Data Distribution with Software-Dened Storage Service on Heterogeneous Cloud Storage.",
                    "Utilizing SSD to Alleviate Chunk Fragmentation in De-Duplicated Backup Systems.",
                    "Wamalloc: An Efficient Wear-Aware Allocator for Non-Volatile Memory.",
                    "Zero-Chunk: An Efficient Cache Algorithm to Accelerate the I/O Processing of Data Deduplication.",
                    "A Field-Based Model for Representing Dynamic and Evolving Features of Cloud Services.",
                    "A Game-Theoretic Analysis of Pricing Strategies for Competing Cloud Platforms.",
                    "A Task Scheduling Method for Energy-Efficient Cloud Video Surveillance System Using a Time-Clustering-Based Genetic Algorithm.",
                    "An Energy-Aware Ant Colony Algorithm for Network-Aware Virtual Machine Placement in Cloud Computing.",
                    "An Online Auction for Deadline-Aware Dynamic Cloud Resource Provisioning.",
                    "Authenticated Spatio-Textual Similarity Joins in Untrusted Cloud Environments.",
                    "Benchmarking Sentiment Analysis Approaches on the Cloud.",
                    "Data Dissemination Protocols Based on Opportunistic Sharing for Data Offloading in Mobile Social Networks.",
                    "Efficient Snapshot KNN Join Processing for Large Data Using MapReduce.",
                    "Game Theoretic Energy Allocation for Renewable Powered In-Situ Server Systems.",
                    "GDSW: A General Framework for Distributed Sliding Window over Data Streams.",
                    "Implementation of an Energy Saving Cloud Infrastructure with Virtual Machine Power Usage Monitoring and Live Migration on OpenStack.",
                    "Improving the Performance of Data Sharing in Dynamic Peer-to-Peer Mobile Cloud.",
                    "On Autonomous Service Migrations in the Cloud for Mobile Accesses.",
                    "Secure Conjunctive Multi-Keyword Search for Multiple Data Owners in Cloud Computing.",
                    "VNF Placement in Hybrid NFV Environment: Modeling and Genetic Algorithms.",
                    "A Fine-Grained Parallel Intra Prediction for HEVC Based on GPU.",
                    "A Fine-Grained Parallel Power Flow Method for Large Scale Grid Based on Lightweight GPU Threads.",
                    "Accelerating Spark RDD Operations with Local and Remote GPU Devices.",
                    "Accelerating the Simulation of Thermal Convection in the Earth's Outer Core on Tianhe-2.",
                    "An Energy-Efficient Scheduler for Throughput Guaranteed Jobs on Asymmetric Multi-Core Platforms.",
                    "Balanced Parity Update Algorithm with Queueing Length Awareness for RAID Arrays.",
                    "Compile-Time Automatic Synchronization Insertion and Redundant Synchronization Elimination for GPU Kernels.",
                    "Efficient Distributed Data Structures for Future Many-Core Architectures.",
                    "Enabling Tissue-Scale Cardiac Simulations Using Heterogeneous Computing on Tianhe-2.",
                    "Exploiting Longer SIMD Lanes in Dynamic Binary Translation.",
                    "Increasing Lifetime and Security of Phase-Change Memory with Endurance Variation.",
                    "Joint Hybrid Frequent Value Cache and Multi-Coding for Data Bus Energy Saving.",
                    "Large Page Address Mapping in Massive Parallel Processor Systems.",
                    "Lightweight Dependency Checking for Parallelizing Loops with Non-Deterministic Dependency on GPU.",
                    "Machine Learning Approach for the Predicting Performance of SpMV on GPU.",
                    "Parallelizing Back Propagation Neural Network on Speculative Multicores.",
                    "Selectively GPU Cache Bypassing for Un-Coalesced Loads.",
                    "Speeding Up Virtualized Transaction Logging with vTrans.",
                    "Study of Neocortex Simulations with GENESIS on High Performance Computing Resources.",
                    "System-Level Scalable Checkpoint-Restart for Petascale Computing.",
                    "Using Supercomputer to Speed up Neural Network Training.",
                    "A C-SVM Based Anomaly Detection Method for Multi-Dimensional Sequence over Data Stream.",
                    "A Key Frame Selection Algorithm Based on Sliding Window and Image Features.",
                    "Accelerating Deep Learning with Shrinkage and Recall.",
                    "An Energy-Efficient Implementation of LU Factorization on Heterogeneous Systems.",
                    "Analysis, Modeling, and Simulation of Hadoop YARN MapReduce.",
                    "Application-Level Determinism in Distributed Systems.",
                    "Asynchronous Progress Design for a MPI-Based PGAS One-Sided Communication System.",
                    "CHIME: A Checkpoint-Based Approach to Improving the Performance of Shared Clusters.",
                    "CPU Frequency Tuning to Improve Energy Efficiency of MapReduce Systems.",
                    "Energy Proportionality in Heterogeneous Data Center Supporting Applications with Variable Load.",
                    "Evaluation of Flash-Based Out-of-Core Stencil Computation Algorithms for SSD-Equipped Clusters.",
                    "ICE: A General and Validated Energy Complexity Model for Multithreaded Algorithms.",
                    "Parallel Gene Upstream Comparison via Multi-Level Hash Tables on GPU.",
                    "PFrauDetector: A Parallelized Graph Mining Approach for Efficient Fraudulent Phone Call Detection.",
                    "PIE: A Pipeline Energy-Efficient Accelerator for Inference Process in Deep Neural Networks.",
                    "Reverse Engineering of Dynamic Parallel Program Behavior from Execution Traces.",
                    "Scalable Single-Source SimRank Computation for Large Graphs.",
                    "suCAQR: A Simplified Communication-Avoiding QR Factorization Solver Using the TBLAS Framework.",
                    "Tapas: An Implicitly Parallel Programming Framework for Hierarchical N-Body Algorithms.",
                    "Timed Dataflow: Reducing Communication Overhead for Distributed Machine Learning Systems.",
                    "Towards Scalable Subgraph Pattern Matching over Big Graphs on MapReduce.",
                    "Towards Seamless Resynchronization for Active-Active Database Clustering.",
                    "Understanding Software Platforms for In-Memory Scientific Data Analysis: A Case Study of the Spark System.",
                    "A Categorical Approach in Handling Event-Ordering in Distributed Systems.",
                    "A Molecular Computation Model to Compute Inversion over Finite Field GF(2n).",
                    "A Secure and Reliable Hybrid Model for Cloud-of-Clouds Storage Systems.",
                    "Coordinated Broadcast-Based Request-Reply and Group Management for Tightly-Coupled Wireless Systems.",
                    "Dual LWE-Based Fully Homomorphic Encryption with Errorless Key Switching.",
                    "IRMD: Malware Variant Detection Using Opcode Image Recognition.",
                    "MrBayes 3.2.6 on Tianhe-1A: A High Performance and Distributed Implementation of Phylogenetic Analysis.",
                    "Resources Renting with Reserved and On-Demand Instances for Cloud Workflow Applications.",
                    "RESS: A Reliable Energy-Efficient Storage System.",
                    "Accelerating Learning to Rank via SVM with OpenCL and OpenMP on Heterogeneous Platforms.",
                    "Context-Aware Video Object Proposals.",
                    "Convolutional Neural Network Simplification Based on Feature Maps Selection.",
                    "Image Enhancement Based on Bi-Histogram Equalization with Non-Parametric Modified Technology.",
                    "Multiple Cartesian K-Medoids for a Fine Quantization.",
                    "Online Object Tracking Based on Convex Hull Representation.",
                    "Research on Semi-Supervised Learning for Hyperspectral Remote Sensing Imaging Classification Base on Confidence Entropy.",
                    "Sparse Autoencoder Based Deep Neural Network for Voxelwise Detection of Cerebral Microbleed.",
                    "Steganalysis via Deep Residual Network.",
                    "Super Resolving of the Depth Map for 3D Reconstruction of Underwater Terrain Using Kinect.",
                    "A Secure Data Deduplication Scheme Based on Differential Privacy.",
                    "Design and Implementation of Mixed Extended-Precision Package in MATLAB."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st ICPADS 2015",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2015",
                "sub_name": "21st IEEE International Conference on Parallel and Distributed Systems, ICPADS 2015, Melbourne, Australia, December 14-17, 2015.",
                "count": 107,
                "papers": [
                    "A Collaborative Reputation System Based on Credibility Propagation in WSNs.",
                    "Fast Execution of Simultaneous Breadth-First Searches on Sparse Graphs.",
                    "MatrixMap: Programming Abstraction and Implementation of Matrix Computation for Big Data Applications.",
                    "Mosaic: Towards City Scale Sensing with Mobile Sensor Networks.",
                    "Jamming with Power Boost: Leaky Waveguide Vulnerability in Train Systems.",
                    "Low Cost IoT Software Development - Ingredient Transformation and Interconnection.",
                    "Relay and Power Splitting Ratio Selection for Cooperative Networks with Energy Harvesting.",
                    "A Memetic Algorithm for Dynamic Shortest Path Routing on Mobile Ad-hoc Networks.",
                    "FlashLite: A High Performance Machine for Data Intensive Science.",
                    "Big Data Analytics-Enhanced Cloud Computing: Challenges, Architectural Elements, and Future Directions.",
                    "iCal: Intervention-free Calibration for Measuring Noise with Smartphones.",
                    "OutSense: Out-of-Band Sensing with ZigBee Sensors for Channel Adaptation in Wireless LANs.",
                    "Learning Resource Management Specifications in Smartphones.",
                    "BEP: Bit Error Pattern Measurement and Analysis in IEEE 802.11.",
                    "Unobtrusive Posture Recognition via Online Learning of Multi-dimensional RFID Received Signal Strength.",
                    "A Service-Oriented Mobile Cloud Middleware Framework for Provisioning Mobile Sensing as a Service.",
                    "Adaptive Trust Update Frequency in MANETs.",
                    "Participant-Density-Aware Privacy-Preserving Aggregate Statistics for Mobile Crowd-Sensing.",
                    "EasiCrawl: A Sleep-Aware Schedule Method for Crawling IoT Sensors.",
                    "Crowdsourcing Based Mobile Location Recognition with Richer Fingerprints from Smartphone Sensors.",
                    "Adaptive Path Profiling Using Arithmetic Coding.",
                    "Fair Decentralized Congestion and Awareness Control for Vehicular Networks.",
                    "HePA: Hexagonal Platform Architecture for Smart Home Things.",
                    "An Estimation Maximization Based Approach for Finding Reliable Sensors in Environmental Sensing.",
                    "Coordination Strategies for Agent Migrations in Wireless Sensor Networks.",
                    "An Adaptive and Compressive Data Gathering Scheme in Vehicular Sensor Networks.",
                    "A Mixture Distribution Based System in BitTorrent-Like P2P Networks.",
                    "Detecting and Mitigating P2P Eclipse Attacks.",
                    "Interaction between Network Partitioning and Churn in a Self-Healing Structured Overlay Network.",
                    "Finding High-Level Topics and Tweet Labeling Using Topic Models.",
                    "Stethoscope: A Sustainable Runtime Debugger for Wireless Sensor Networks.",
                    "Decentralized Dynamic Participation in Participatory Sensing: A Correlated-Equilibrium Game Approach.",
                    "Context-Aware Recruitment Scheme for Opportunistic Mobile Crowdsensing.",
                    "Accelerating Crowdsourcing Based Indoor Localization Using CSI.",
                    "PEVTS: Privacy-Preserving Electric Vehicles Test-Bedding Scheme.",
                    "Differentially Private Wireless Data Publication in Large-Scale WLAN Networks.",
                    "Attribute-Based Keyword Search Efficiency Enhancement via an Online/Offline Approach.",
                    "STUMP - STalling offline password attacks Using pre-hash ManiPulations.",
                    "Execution Time Measurement of Virtual Machine Volatile Artifacts Analyzers.",
                    "Reliable Routing Protocol for Delay Tolerant Networks.",
                    "Robust Traffic Classification with Mislabelled Training Samples.",
                    "CER-IOS: Internal Resource Utilization Optimized I/O Scheduling for Solid State Drives.",
                    "RDMA-Based Cooperative Caching for a Distributed File System.",
                    "Accelerating Cloud Storage System with Byte-Addressable Non-Volatile Memory.",
                    "In-memory Query System for Scientific Dataseis.",
                    "A Genetic Programming Approach to Design Resource Allocation Policies for Heterogeneous Workflows in the Cloud.",
                    "MDCP: Measurement-Aware Distributed Controller Placement for Software Defined Networks.",
                    "Electricity Cost Minimization in Distributed Clouds by Exploring Heterogeneity of Cloud Resources and User Demands.",
                    "Scalable and Fault-Tolerant Cloud Computations: Modelling and Implementation.",
                    "Using Analytical Models to Bootstrap Machine Learning Performance Predictors.",
                    "Multi-objective Optimization Algorithm Based on BBO for Virtual Machine Consolidation Problem.",
                    "Resource Provision for Batch and Interactive Workloads in Data Centers.",
                    "Cost-Effective Resource Configuration for Cloud Video Streaming Services.",
                    "Service Level Agreement(SLA) Based SaaS Cloud Management System.",
                    "WattTime: Novel System Power Model and Completion Time Model for DVFS-Enabled Servers.",
                    "Thread Count Prediction Model: Dynamically Adjusting Threads for Heterogeneous Many-Core Systems.",
                    "PROP: Using PCIe-Based RDMA to Accelerate Rack-Scale Communications in Data Centers.",
                    "Energy-Aware Caching.",
                    "Fast and Accurate Simulation of Multithreaded Sparse Linear Algebra Solvers.",
                    "Implementation of an Accurate and Efficient Compensated DGEMM for 64-bit ARMv8 Multi-Core Processors.",
                    "Communication Models for Distributed Intel Xeon Phi Coprocessors.",
                    "SIMD Code Translation in an Enhanced HQEMU.",
                    "Versioning Architectures for Local and Global Memory.",
                    "Power Capping: What Works, What Does Not.",
                    "Improving Application Concurrency on GPUs by Managing Implicit and Explicit Synchronizations.",
                    "Parallel Simulated Annealing with MRAnneal.",
                    "PSO-SVR: A Hybrid Short-term Traffic Flow Forecasting Method.",
                    "A Power-Aware Symbiotic Scheduling Algorithm for Concurrent GPU Kernels.",
                    "High-Performance Parallel Location-Aware Algorithms for Approximate String Matching on GPUs.",
                    "GPU-Accelerated Nick Local Image Thresholding Algorithm.",
                    "CloudFreq: Elastic Energy-Efficient Bag-of-Tasks Scheduling in DVFS-Enabled Clouds.",
                    "Inline Data Deduplication for SSD-Based Distributed Storage.",
                    "FRAME: Fair Resource Allocation in Multi-process Environments.",
                    "sRSA: High Speed RSA on the Intel MIC Architecture.",
                    "Cross-Matching Large Astronomical Catalogs on Heterogeneous Clusters.",
                    "Realizing Extremely Large-Scale Stencil Applications on GPU Supercomputers.",
                    "Video Replication over a New Architecture DASH-DMS.",
                    "Optimizing Complex Spatially-Variant Coefficient Stencils for Seismic Modeling on GPU.",
                    "Self-Tuned Software-Managed Energy Reduction in InfiniBand Links.",
                    "VH-DSI: Speeding up Data Visualization via a Heterogeneous Distributed Storage Infrastructure.",
                    "Scaling Monte Carlo Tree Search on Intel Xeon Phi.",
                    "Comparison of Single Source Shortest Path Algorithms on Two Recent Asynchronous Many-task Runtime Systems.",
                    "Algorithmic Acceleration of Parallel ALS for Collaborative Filtering: Speeding up Distributed Big Data Recommendation in Spark.",
                    "Hardware-Centric Analysis of Network Performance for MPI Applications.",
                    "Building Blocks for a System-Wide Power and Thermal Management Framework.",
                    "DAG Scheduling for Heterogeneous Systems Using Biogeography-Based Optimization.",
                    "SHAFT: Supporting Transactions with Serializability and Fault-Tolerance in Highly-Available Datastores.",
                    "Efficient Algorithms for Scheduling XML Data in a Mobile Wireless Broadcast Environment.",
                    "LSRB-CSR: A Low Overhead Storage Format for SpMV on the GPU Systems.",
                    "Contention-Aware Scheduling for Asymmetric Multicore Processors.",
                    "Interactive Consistency in Practical, Mostly-Asynchronous Systems.",
                    "Fusion: Privacy-Preserving Distributed Protocol for High-Dimensional Data Mashup.",
                    "A Habit-Based SWRL Generation and Reasoning Approach in Smart Home.",
                    "A Framework for Modeling and Assessing Security of the Internet of Things.",
                    "Secrecy Outage Probability of Two-Path Successive Relaying in Physical Layer Security.",
                    "Implementation of Relay-Based Emergency Communication System on Software Defined Radio.",
                    "A Store-and-Delivery Based MAC Protocol for Air-Ground Collaborative Wireless Networks for Precision Agriculture.",
                    "Conceptual Survey on Data Stream Processing Systems.",
                    "Software Defined Networking for Communication and Control of Cyber-Physical Systems.",
                    "Traffic Offloading with Mobility in LTE HeNB Networks.",
                    "The Performance Survey of in Memory Database.",
                    "Dynamic Web Service Composition Based on State Space Searching.",
                    "Cloud Based Monitoring of Timed Events for Industrial Automation.",
                    "JellyFish: Online Performance Tuning with Adaptive Configuration and Elastic Container in Hadoop Yarn.",
                    "Cloud-Based Analysis and Control for Robots in Industrial Automation.",
                    "Online Replacement of Distributed Controllers in Software Defined Networks.",
                    "Towards a Human-Centred Approach in Modelling and Testing of Cyber-Physical Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th ICPADS 2014",
        "info": "Hsinchu, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2014",
                "sub_name": "20th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2014, Hsinchu, Taiwan, December 16-19, 2014.",
                "count": 145,
                "papers": [
                    "Message from the general co-chairs IEEE ICPADS 2014.",
                    "Message from the program co-chairs IEEE ICPADS 2014.",
                    "PADS: Passive detection of moving targets with dynamic speed using PHY layer information.",
                    "A distributed approach for top-k star queries on massive information networks.",
                    "Hierarchical prediction based task scheduling in hybrid data center.",
                    "Optimization of serial and parallel communications for parallel geometric multigrid method.",
                    "Topology shaping for time synchronization in wireless sensor networks.",
                    "Interference-aware channel allocation algorithm with game theoretic approach for cognitive radio networks.",
                    "F-Loc: Floor localization via crowdsourcing.",
                    "Energy-efficient mobile data collection in energy-harvesting wireless sensor networks.",
                    "fAHRW+: Fairness-aware and locality-enhanced scheduling for multi-server systems.",
                    "Don't be fat: Towards efficient online flow scheduling in data center networks.",
                    "esDMT: Efficient and scalable deterministic multithreading through memory isolation.",
                    "Traffic-aware frequency scaling for balanced on-chip networks on GPGPUs.",
                    "An improved simulated annealing heuristic for static partitioning of task graphs onto heterogeneous architectures.",
                    "Scaling and analyzing the stencil performance on multi-core and many-core architectures.",
                    "Directory Lookaside Table: Enabling scalable, low-conflict, many-core cache coherence directory.",
                    "dIRIEr: Distributed Influence Maximization in social network.",
                    "EasiMG: A method of maximizing lifetime for group request in web-based sensor network.",
                    "Intactness verification in anonymous RFID systems.",
                    "Leverage similarity and locality to enhance fingerprint prefetching of data deduplication.",
                    "Providing hybrid block storage for virtual machines using object-based storage.",
                    "Reducing lock contention on multi-core platforms.",
                    "NICE: Network-aware VM Consolidation scheme for Energy Conservation in Data Centers.",
                    "GRapid: A compilation and runtime framework for rapid prototyping of graph applications on many-core processors.",
                    "Rhymes: A shared virtual memory system for non-coherent tiled many-core architectures.",
                    "Heterogeneous CPU-GPU computing for the finite volume method on 3D unstructured meshes.",
                    "Peak Power Management for scheduling real-time tasks on heterogeneous many-core systems.",
                    "ADAS: Adjust directional antenna with sensor hints.",
                    "Time synchronization for underwater sensor networks based on multi-source beacon fusion.",
                    "Virtual keyboard for head mounted display-based wearable devices.",
                    "LDSN: Localization scheme for double-head maritime Sensor Networks.",
                    "Improving utilization through dynamic VM resource allocation in hybrid cloud environment.",
                    "FENet: An SDN-based scheme for virtual network management.",
                    "Be a good neighbour: Characterizing performance interference of virtual machines under xen virtualization environments.",
                    "Accelerating the iterative linear solver for reservoir simulation on multicore architectures.",
                    "A hybrid on-chip network with a low buffer requirement.",
                    "Cache-aware sparse matrix formats for Kepler GPU.",
                    "ACDT: Architected Composite Data Types trading-in unfettered data access for improved execution.",
                    "Combine thread with memory scheduling for maximizing performance in multi-core systems.",
                    "Sensor-free corner shape detection by wireless networks.",
                    "Hand-to-Hand instant message communication: Revisiting Morse code.",
                    "Towards social botnet behavior detecting in the end host.",
                    "EasiCAE: A runtime framework for efficient sensor sharing among concurrent IoT applications.",
                    "SLA-based energy aware scheduling of precedence-constrained applications on DVFS-enabled clusters.",
                    "Extending checksum-based ABFT to tolerate soft errors online in iterative methods.",
                    "MRTune: A simulator for performance tuning of MapReduce jobs with skewed data.",
                    "TSUBAME-KFC: A modern liquid submersion cooling prototype towards exascale becoming the greenest supercomputer in the world.",
                    "Building a large-scale direct network with low-radix routers.",
                    "HFA: A Hint Frequency-based approach to enhance the I/O performance of multi-level cache storage systems.",
                    "Where should the threads go? Leveraging hierarchical data locality to solve the thread affinity dilemma.",
                    "Enhancing application performance through OpenFlow enabled multi-homed devices.",
                    "Wireless transmission modeling for Vehicular Ad-hoc Networks.",
                    "Channel holding time of packet sessions in all-IP cellular networks.",
                    "Design and analysis of software defined Vehicular Cyber Physical Systems.",
                    "Performance analysis of HPC applications with irregular tree data structures.",
                    "Parallel exact spliced alignment on GPU.",
                    "A distributed real-time operating system built with aspect-oriented programming for distributed embedded control systems.",
                    "Physically based parallel ray tracer for the Metropolis light transport algorithm on the Tianhe-2 supercomputer.",
                    "An efficient implementation of PBKDF2 with RIPEMD-160 on multiple FPGAs.",
                    "Layout-aware expandable low-degree topology.",
                    "Achieving cost effective cloud video services via fine grained multicore scheduling.",
                    "pbitMCE: A bit-based approach for maximal clique enumeration on multicore processors.",
                    "Lightweight online power monitoring and control for mobile applications.",
                    "A fine-grained indoor localization using multidimensional Wi-Fi fingerprinting.",
                    "BusCast: Flexible and privacy preserving message delivery using urban buses.",
                    "A distributed spectrum sharing algorithm in cognitive radio networks.",
                    "Enhancing scalability in distributed storage systems with Cauchy Reed-Solomon codes.",
                    "Optimising memory management for Belief Propagation in Junction Trees using GPGPUs.",
                    "Toward multi-target autotuning for accelerators.",
                    "Accelerating HPCG on Tianhe-2: A hybrid CPU-MIC algorithm.",
                    "Continuous similarity join on data streams.",
                    "A fully generalized over operator with applications to image composition in parallel visualization for big data science.",
                    "Using surrogate-based modeling to predict optimal I/O parameters of applications at the extreme scale.",
                    "Simplifying index file structure to improve I/O performance of parallel indexing.",
                    "LEB-MAC: Load and energy balancing MAC protocol for energy harvesting powered wireless sensor networks.",
                    "Real-time and passive wormhole detection for wireless sensor networks.",
                    "Optimal bandwidth allocation with dynamic multi-path routing for non-critical traffic in AFDX networks.",
                    "Nowhere to hide: An empirical study on hidden UHF RFID tags.",
                    "Optimizing Seam Carving on multi-GPU systems for real-time image resizing.",
                    "A fast integral image generation algorithm on GPUs.",
                    "WorkQ: A many-core producer/consumer execution model applied to PGAS computations.",
                    "Hybrid-view programming of nuclear fusion simulation code in the PGAS parallel programming language XcalableMP.",
                    "GPU acceleration of finding frequent patterns over large biological sequence.",
                    "Improving large-scale storage system performance via topology-aware and balanced data placement.",
                    "MapReduce based parallel suffix tree construction for human genome.",
                    "Performance evaluation of OpenDaylight SDN controller.",
                    "ConSnap: Taking continuous snapshots for running state protection of virtual machines.",
                    "HARP: Towards enhancing data recency for eventually consistent data stores.",
                    "Combination feature for image retrieval in the distributed datacenter.",
                    "GlobLease: A globally consistent and elastic storage system using leases.",
                    "POPS: A popularity-aware live streaming service.",
                    "Fast GPU parallel N-Body tree traversal with Simulated Wide-Warp.",
                    "Session-based fault-tolerant design patterns.",
                    "Scheduling time-sensitive multi-tier services with probabilistic performance guarantee.",
                    "SmartQ: A question and answer system for supplying high-quality and trustworthy answers.",
                    "A privacy-aware cloud service selection method toward data life-cycle.",
                    "P2P email encryption by an identity-based one-way group key agreement protocol.",
                    "An efficient detection scheme for urban traffic condition using volunteer probes.",
                    "An access point to device association technique for optimized data transfer in mobile grids.",
                    "Enhanced HIP-based micro-mobility and macro-mobility management by proactive signaling scheme.",
                    "Extending access point service coverage area through opportunistic forwarding in multi-hop collaborative relay WLANs.",
                    "Improving smart grid authentication using Merkle Trees.",
                    "Smart MapReduce cloud: Applying extra processing to intermediate data on demand.",
                    "RWFS: Design and implementation of file system executing access control based on user's location.",
                    "A victim and rescuer communication model in collapsed buildings/structures.",
                    "On message reachability of gossip algorithms in degree-biased peer-to-peer networks.",
                    "P2P overlay for CDN-P2P being aware of the upload capacity of participants.",
                    "Energy-aware multipath routing for data aggregation in wireless sensor networks.",
                    "Fault-Tolerant bi-directional communications in web-based applications.",
                    "Routing table status influence of Monitoring Kad.",
                    "DASH: A duplication-aware flash cache architecture in virtualization environment.",
                    "Construct a simply and quickly platform to solving linear systems.",
                    "User behavior prediction: A combined model of topic level influence and contagion interaction.",
                    "DLBS: Decentralized load balancing scheme for event-driven cloud frameworks.",
                    "Model to estimate the size of a Hadoop cluster - HCEm.",
                    "Streaming in NoSQL.",
                    "Performance study of virtual fence unit using Wireless Sensor Network in IoT environment.",
                    "Distributed sensor device resource-object connection based on service delivery platform.",
                    "ArPat: Accurate RFID reader positioning with mere boundary tags.",
                    "M2M-enabled real-time Trip Planner.",
                    "Development of energy efficient ZigBee module.",
                    "A quorum-based channel hopping scheme for jamming resilience.",
                    "An improved realistic mobility model and mechanism for VANET based on SUMO and NS3 collaborative simulations.",
                    "A Decreasing k-means algorithm for the Disk Covering Tour Problem in wireless sensor networks.",
                    "Characteristics and perspectives of wearable smart devices and industrial ecosystem.",
                    "A wearable virtual coach for Marathon beginners.",
                    "Transmission characteristics of hybrid structure yarns for e-textiles.",
                    "An Efficient Query Tree protocol for RFID tag anti-collision.",
                    "Incenter-based nearest feature space method for hyperspectral image classification using GPU.",
                    "Fine-grained parallel implementation of edge-directed Image Interpolation on GPU.",
                    "Compression technique for DubaiSat-2 images based on the DCT blocks.",
                    "Budgeted mini-batch parallel gradient descent for support vector machines on Spark.",
                    "Sensor deployment by a robot in an unknown orthogonal region: Achieving full coverage.",
                    "The design of LLVM-based shader compiler for embedded architecture.",
                    "On the and-or-scheduling problems.",
                    "RHJoin: A fast and space-efficient join method for log processing in MapReduce.",
                    "Effective multi-GPU communication using multiple CUDA streams and threads.",
                    "Atomic reduction based sparse matrix-transpose vector multiplication on GPUs.",
                    "Efficient management of large DMA memory buffers in microdrivers.",
                    "RBPP: A row based DRAM page policy for the many-core era.",
                    "HIOPS-KV: Exploiting multiple flash solid-state drives for key value stores.",
                    "Paraio: A scalable network I/O framework for many-core systems.",
                    "Orchestrating safe streaming computations with precise control.",
                    "Accelerated variance reduction methods on GPU."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th ICPADS 2013",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2013",
                "sub_name": "19th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2013, Seoul, Korea, December 15-18, 2013.",
                "count": 110,
                "papers": [
                    "Detecting Correlation Violations and Data Races by Inferring Non-deterministic Reads.",
                    "Efficient Barrier Synchronization for OpenMP-Like Parallelism on the Intel SCC.",
                    "Mark-Sharing: A Parallel Garbage Collection Algorithm for Low Synchronization Overhead.",
                    "Adaptive Packet Resizing by Spatial Locality and Data Sharing for Energy-Efficient NOC.",
                    "File-Level, Host-Side Flash Caching with Loris.",
                    "AGIOS: Application-Guided I/O Scheduling for Parallel File Systems.",
                    "A Distributed Cache Framework for Metadata Service of Distributed File Systems.",
                    "Evaluating Optimization Strategies for HMMer Acceleration on GPU.",
                    "Achieving TeraCUPS on Longest Common Subsequence Problem Using GPGPUs.",
                    "On the GPU-CPU Performance Portability of OpenCL for 3D Stencil Computations.",
                    "Wideband Channelization for Software-Defined Radio via Mobile Graphics Processors.",
                    "Bi-direction Adjust Heuristic for Workflow Scheduling in Clouds.",
                    "Particle Swarm Optimization for Energy-Aware Virtual Machine Placement Optimization in Virtualized Data Centers.",
                    "An Efficient Power-Aware Resource Scheduling Strategy in Virtualized Datacenters.",
                    "Dynamic Virtual Resource Renting Method for Maximizing the Profits of a Cloud Service Provider in a Dynamic Pricing Model.",
                    "A Data-Aware Partitioning and Optimization Method for Large-Scale Workflows in Hybrid Computing Environments.",
                    "PipeFlow Engine: Pipeline Scheduling with Distributed Workflow Made Simple.",
                    "UserScope: A Fine-Grained Framework for Collecting Energy-Related Smartphone User Contexts.",
                    "Peer-to-Peer Group k-Nearest Neighbours in Mobile Ad-Hoc Networks.",
                    "Continuous Possible K-Nearest Skyline Query in Euclidean Spaces.",
                    "ConsumSense: A Framework for Physical Consuming Behavior Prediction on Smartphones.",
                    "NR-MPI: A Non-stop and Fault Resilient MPI.",
                    "MPI-Interoperable Generalized Active Messages.",
                    "Real Asynchronous MPI Communication in Hybrid Codes through OpenMP Communication Tasks.",
                    "OutFlank Routing: Increasing Throughput in Toroidal Interconnection Networks.",
                    "On the Programmability and Performance of Heterogeneous Platforms.",
                    "OpenCL-Based Remote Offloading Framework for Trusted Mobile Cloud Computing.",
                    "Adaptive Accurate Indoor-Localization Using Passive RFID.",
                    "A Better Understanding of Event-Triggered Control from a CPS Perspective.",
                    "Cost Minimization for Scheduling Parallel, Single-Threaded, Heterogeneous, Speed-Scalable Processors.",
                    "Data Transfer Matters for GPU Computing.",
                    "Online Performance Projection for Clusters with Heterogeneous GPUs.",
                    "Leveraging Hybrid Hardware in New Ways - The GPU Paging Cache.",
                    "Towards Improving MapReduce Task Scheduling Using Online Simulation Based Predictions.",
                    "Towards Multi-way Join Evaluating with Indexing Partition Support in Map-Reduce.",
                    "OPTAS: Optimal Data Placement in MapReduce.",
                    "Strong Dynamic Consensus in Byzantine Faulty Systems with Churn.",
                    "SimNUMA: Simulating NUMA-Architecture Multiprocessor Systems Efficiently.",
                    "Application Aware DRAM Bank Partitioning in CMP.",
                    "A Distributed Approach to Constructing k-Hop Connected Dominating Set in Ad Hoc Networks.",
                    "Development of Efficient Role-Based Sensor Network Applications with Excel Spreadsheets.",
                    "Trust-Based Multi-objective Optimization for Node-to-Task Assignment in Coalition Networks.",
                    "SAIL: A Strategy-Proof Auction Mechanism for Cooperative Communication.",
                    "Dual-Region Location Management for Mobile Ad Hoc Networks.",
                    "Application Layer Multicast in P2P Distributed Interactive Applications.",
                    "Policies for Efficient Data Replication in P2P Systems.",
                    "Predicting Popularity and Adapting Replication of Internet Videos for High-Quality Delivery.",
                    "Nuclear Fusion Simulation Code Optimization on GPU Clusters.",
                    "Subpopulation Diversity Based Accepting Immigrant in Distributed Evolutionary Algorithms.",
                    "Queue Reorganization for Subscription Congestion Avoidance in Publish/Subscribe Systems.",
                    "Accelerating De Bruijn Graph-Based Genome Assembly for High-Throughput Short Read Data.",
                    "Workload Estimation Algorithm in Parallel Traffic Simulation.",
                    "A Heuristic Strategy for Performance Optimisation of Stream Programs.",
                    "On the Portability of the OpenCL Dwarfs on Fixed and Reconfigurable Parallel Platforms.",
                    "Pangaea: A Single Key Space, Inter-datacenter Key-Value Store.",
                    "Adaptive Peer Selection Strategy in P2P-VoD Systems Based on Dynamic Metaheuristic.",
                    "A Rule Verification and Resolution Framework in Smart Building System.",
                    "System-Level Scheduling of Mixed-Criticality Traffics in Avionics Networks.",
                    "The Future of Accelerator Programming: Abstraction, Performance or Can We Have Both?",
                    "Semantic-Aware Hot Data Selection Policy for Flash File System in Android-Based Smartphones.",
                    "SHOE: A SPARQL Query Engine Using MapReduce.",
                    "MAP: Mobile Assistance Platform with a VM Type Selection Ability.",
                    "Using GPUs to Crack Android Pattern-Based Passwords.",
                    "Towards Model Checking of Simulation Models for Embedded System Development.",
                    "Privacy Vulnerability Analysis on Routing in Mobile Social Networks.",
                    "Lightweight Management of Authorization Update on Cloud Data.",
                    "Cloud Governance - The Relevance of Cloud Brokers.",
                    "Cloud Services Aided E-Tourism: In the Case of Low-Cost Airlines for Backpacking.",
                    "Reputation Measurement of Cloud Services Based on Unstable Feedback Ratings.",
                    "Efficient Bulk Loading to Accelerate Spatial Keyword Queries.",
                    "Spatial Data Mining in the Context of Big Data.",
                    "SNN Input Parameters: How Are They Related?",
                    "Linear Function Based Transformation Scheme for Preserving Database Privacy in Cloud Computing.",
                    "Quantitative Trust Management to Support QoS-Aware Service Selection in Service-Oriented Environments.",
                    "Estimating Web Service Reputation from Integrated Social Service Network Model.",
                    "A Service Path Selection and Adaptation Algorithm in Service-Oriented Network Virtualization Architecture.",
                    "Towards a Scalable PaaS for Service Oriented Software.",
                    "Tag Co-occurrence Relationship Prediction in Heterogeneous Information Networks.",
                    "SoMed: A Hybrid DHT Framework towards Scalable Decentralized Microblogging Services.",
                    "Ontology-Based TV Program Contents Retrieval and Recommendation.",
                    "Indoor Place Name Annotations with Mobile Crowd.",
                    "On Deploying IoT Indoor: An Incremental Approach.",
                    "A Feasibility Study on Developing IoT/M2M Applications over ETSI M2M Architecture.",
                    "Challenges of Using Edge Devices in IoT Computation Grids.",
                    "Social Web of Things: A Survey.",
                    "Coexistence of Heterogeneous and Homogeneous Wireless Technologies in Smart Grid-Home Area Network.",
                    "Overhead Reduction for Duplicate Address Detection in VANET.",
                    "LocalSense: An Infrastructure-Mediated Sensing Method for Locating Appliance Usage Events in Homes.",
                    "Virtual Coordinate Based Co-moving Detection in Wireless Sensor Networks.",
                    "Energy Saving Data Abstraction and Reformation Algorithms for Human Movement Monitoring.",
                    "Design and Implementation of Media Content Sharing Services in Home-Based IoT Networks.",
                    "RFID Vehicle Plate Number (E-Plate) for Tracking and Management System.",
                    "A Novel Query Tree Protocol Based on Partial Responses for RFID Tag Anti-collision.",
                    "Genetic Algorithm Based Weight Optimization for Minimizing Sidelobes in Distributed Random Array Beamforming.",
                    "Hardware Implementation of Math Module Based on CORDIC Algorithm Using FPGA.",
                    "Utilizing Human Intelligence in a Crowdsourcing Marketplace for Big Data Processing.",
                    "Feature Reduction for Anomaly Detection in Manufacturing with MapReduce GA/kNN.",
                    "Parallel molecular computation of modular-multiplication based on tile assembly model.",
                    "On the HDT with the Tree Representation for Large RDFs on GPU.",
                    "A Dynamic Hybrid Resource Provisioning Approach for Running Large-Scale Computational Applications on Cloud Spot and On-Demand Instances.",
                    "Cost Optimization for Scientific Workflow Execution on Cloud Computing.",
                    "Multi-resource Aware Congestion Control in Data Centers.",
                    "Availability Modeling and Evaluation of Cloud Virtual Data Centers.",
                    "Automatic Cloud Bursting under FermiCloud.",
                    "Optimizing Event Polling for Network-Intensive Applications: A Case Study on Redis.",
                    "Benchmarking Large Scale Cloud Computing in Asia Pacific.",
                    "Particle Swarm Optimization-Based Impurity Function Band Prioritization Using Weighted Majority Voting for Feature Extraction of High Dimensional Data Sets.",
                    "Accelerating the Calculation of Scattering of Complex Targets from Background Radiation with CUDA, OpenACC and OpenHMPP.",
                    "Further Improvement on GPU-Based Parallel Implementation of WRF 5-Layer Thermal Diffusion Scheme.",
                    "Edge Detection for Hyperspectral Images Using the Bhattacharyya Distance."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th ICPADS 2012",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2012",
                "sub_name": "18th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2012, Singapore, December 17-19, 2012.",
                "count": 148,
                "papers": [
                    "Keynote: Mobile cloud and crowd computing and sensing.",
                    "Reuse of GSM White Space Spectrum for Cognitive Femtocell Access.",
                    "A General Framework for Broadcasting in Static to Highly Mobile Wireless Ad hoc, Sensor, Robot and Vehicular Networks.",
                    "Achieving Private, Scalable, and Precise Data Collection in Wireless Sensor Networks.",
                    "Hybrid Mode Radio Link Control for Efficient Video Transmission over 4GLTE Network.",
                    "Auto-Tuning GEMV on Many-Core GPU.",
                    "Pipelined Parallel LZSS for Streaming Data Compression on GPGPUs.",
                    "Optimizing Dynamic Programming on Graphics Processing Units Via Data Reuse and Data Prefetch with Inter-Block Barrier Synchronization.",
                    "Performance Evaluation of Concurrent Lock-free Data Structures on GPUs.",
                    "An Optimal Fully Distributed Algorithm to Minimize the Resource Consumption of Cloud Applications.",
                    "Multi-tier Service Differentiation: Coordinated Resource Provisioning and Admission Control.",
                    "Reconciling Dynamic System Sizing and Content Locality through Hierarchical Workload Forecasting.",
                    "Free Elasticity and Free CPU Power for Scientific Workloads on IaaS Clouds.",
                    "Dictionary Attack on TrueCrypt with RIVYERA S3-5000.",
                    "A Lightweight Secure Provenance Scheme for Wireless Sensor Networks.",
                    "Accountable Anonymity: A Proxy Re-Encryption Based Anonymous Communication System.",
                    "Maximizing Availability of Consistent Data in Unreliable Networks.",
                    "Mobile Edutainment with Interactive Augmented Reality Using Adaptive Marker Tracking.",
                    "A Novel Multi-Channel Data Broadcast Scheme for Multimedia Database Systems.",
                    "MobUser: Publish-subscribe Communication for Mobile Nodes.",
                    "ESAMR: An Enhanced Self-Adaptive MapReduce Scheduling Algorithm.",
                    "Workload Characteristic Oriented Scheduler for MapReduce.",
                    "Parallel Processing of Massive EEG Data with MapReduce.",
                    "Smart Replication for In-memory Computations.",
                    "ESB: Ext2 Split Block Device.",
                    "AREN: A Popularity Aware Replication Scheme for Cloud Storage.",
                    "Ad-hoc Anonymity: Privacy Preservation for Location-based Services in Mobile Networks.",
                    "Complete Bipartite Anonymity: Confusing Anonymous Mobility Traces for Location Privacy.",
                    "Privacy Preserving for Continuous Query in Location Based Services.",
                    "Two-Level Result Caching for Web Search Queries on Structured P2P Networks.",
                    "FIMD: Fine-grained Device-free Motion Detection.",
                    "Asymptotically Optimal Load Balancing for Hierarchical Multi-Core Systems.",
                    "Efficient Multi-Keyword Ranked Query on Encrypted Data in the Cloud.",
                    "Privacy-Aware Multi-Keyword Top-k Search over Untrust Data Cloud.",
                    "An Efficient Geometry Data Allocation Algorithm in Cloud Computing Environments.",
                    "Elasticity Controller for Cloud-Based Key-Value Stores.",
                    "A Parallel H.264 Encoder with CUDA: Mapping and Evaluation.",
                    "CUDA Acceleration of 3D Dynamic Scene Reconstruction and 3D Motion Estimation for Motion Capture.",
                    "DirectedPush - A High Performance Peer-to-Peer Live Streaming System Using Network Coding.",
                    "CPDID: A Novel CDN-P2P Dynamic Interactive Delivery Scheme for Live Streaming.",
                    "EODS: An Energy-efficient Online Decision Scheme in Delay-sensitive Sensor Networks for Rare-event Detection.",
                    "LogA: Concurrent Medium Access Control through Time Log Analysis in Sensor Networks.",
                    "Efficient Cache Discovery for Cooperative Caching in Wireless Ad Hoc Networks.",
                    "SIEVE: A Distributed, Accurate, and Robust Technique to Identify Malicious Nodes in Data Dissemination on MANET.",
                    "A Memory Access Model for Highly-threaded Many-core Architectures.",
                    "An Improvement of OpenMP Pipeline Parallelism with the BatchQueue Algorithm.",
                    "Reconfiguration Algorithms for Degradable VLSI Arrays with Switch Faults.",
                    "Non-Backtracking Reconfiguration Algorithm for Three-dimensional VLSI Arrays.",
                    "LVMCI: Efficient and Effective VM Live Migration Selection Scheme in Virtualized Data Centers.",
                    "iROW: An Efficient Live Snapshot System for Virtual Machine Disk.",
                    "A Scalable Signalling Mechanism for VM Migration with SR-IOV over Infiniband.",
                    "AutoTunium: An Evolutionary Tuner for General-Purpose Multicore Applications.",
                    "Hardware-aware Thread Scheduling: The Case of Asymmetric Multicore Processors.",
                    "Topology Virtualization for Throughput Maximization on Many-Core Platforms.",
                    "Capturing Tag Dynamics by Prediction for Pervasive Internet-of-Things Applications.",
                    "BEST: A Bidirectional Efficiency-Privacy Transferable Authentication Protocol for RFID-Enabled Supply Chain.",
                    "Placement of Multiple RFID Reader Antennas to Alleviate the Negative Effect of Tag Orientation.",
                    "Leveraging Cloud Infrastructure for Troubleshooting Edge Computing Systems.",
                    "NOHAA: A NOvel Framework for HPC Analytics over Windows Azure.",
                    "WS-TaaS: A Testing as a Service Platform for Web Service Load Testing.",
                    "An Efficient MPI Message Queue Mechanism for Large-scale Jobs.",
                    "Accelerating Cost Aggregation for Real-Time Stereo Matching.",
                    "A Non-Intrusive Read-Copy-Update for UTS.",
                    "Neighbor Discovery in Low-Duty-Cycle Wireless Sensor Networks with Multipacket Reception.",
                    "A Reconfigurable Hardware Accelerated Platform for Clustered Wireless Sensor Networks.",
                    "Self-Stabilizing Micro Controller for Large-Scale Sensor Networks in Spite of Program Counter Corruptions Due to Soft Errors.",
                    "Behavior Aware Data Locality for Caches.",
                    "SeTM: Efficient Execution of Speculative Threads with Hardware Transactional Memory.",
                    "Optimizing Scheduling in Embedded CMP Systems with Phase Change Memory.",
                    "A Synchronization Aware Memory Race Recorder.",
                    "MSSM: An Efficient Scheduling Mechanism for CUDA Basing on Task Partition.",
                    "Comparing the Performance of Blue Gene/Q with Leading Cray XE6 and InfiniBand Systems.",
                    "Energy-Aware Communication and Remapping of Tasks for Reliable Multimedia Multiprocessor Systems.",
                    "Gargamel: Boosting DBMS Performance by Parallelising Write Transactions.",
                    "Effective Caching Schemes for Minimizing Inter-ISP Traffic in Named Data Networking.",
                    "The Freshman Handbook: A Hint for Server Placement in Online Social Network Services.",
                    "An Enhanced Genetic Algorithm for Server Placement in Distributed Interactive Applications.",
                    "Quality of Experience-Aware Event Synchronization for Distributed Virtual Worlds.",
                    "Page-Based Memory Allocation Policies of Local and Remote Memory in Cluster Computers.",
                    "OPAMP: Evaluation Framework for Optimal Page Allocation of Hybrid Main Memory Architecture.",
                    "CAR: Securing PCM Main Memory System with Cache Address Remapping.",
                    "An Efficient and Scalable Memory Allocator for Multithreaded Tabled Evaluation of Logic Programs.",
                    "Design of Energy-Efficient Video Sharing Servers with Delay Constraints.",
                    "Fine-Grained Energy-Efficient Sorting on a Many-Core Processor Array.",
                    "A Runtime Framework for Energy Efficient HPC Systems without a Priori Knowledge of Applications.",
                    "Convexity in Non-convex Optimizations of Streaming Applications.",
                    "Performance Optimization of a Parallel, Two Stage Stochastic Linear Program.",
                    "Model-driven Level 3 BLAS Performance Optimization on Loongson 3A Processor.",
                    "Obfuscated Counting in Single-Hop Radio Network.",
                    "GPU Accelerated Molecular Docking with Parallel Genetic Algorithm.",
                    "Supporting User-directed Fault Tolerance over Standard MPI.",
                    "Automatic Refactoring of Legacy Fortran Code to the Array Slicing Notation.",
                    "Simplifying Install-time Auto-Tuning for Cross-Compilation Environments by Program Execution Forwarding.",
                    "IODET: A HoL-blocking-aware Deterministic Routing Algorithm for Direct Topologies.",
                    "Measuring Distributed Applications through MapReduce and Traffic Analysis.",
                    "Time-Stamped Equal Size Segmentation and Chunk Scheduling Algorithms for SVC Based P2P Streaming Systems.",
                    "A Novel Cache Replacement Policy for ISP Merged CDN.",
                    "Modeling and Analysis of Large Scale Interconnected Unstructured P2P Networks.",
                    "Balancing Precision and Battery Drain in Activity Recognition on Mobile Phone.",
                    "Inner-Distance-Based Shape Recognition of Target Object Using Binary Sensors.",
                    "An Evaluation of Vehicular Networks with Real Traces.",
                    "Software Aging in Virtualized Environments: Detection and Prediction.",
                    "An Erasure Coded Archival Storage System.",
                    "R-Barrier: Rapid Barrier for Software RAID Cache Using Hints from Journaling Filesystem.",
                    "Automated Malware Analysis Framework with Honeynet Technology in Taiwan Campuses.",
                    "Multicast Congestion Control Using Communicating Realtime State Machines and Dynamical Systems for Distributed Iptv Scenarios.",
                    "A Distributed Sensor Data Stream Delivery System with Communication Loads Balancing for Heterogeneous Collection Cycle Requests.",
                    "Cyber Attacks Prediction Model Based on Bayesian Network.",
                    "iCirrus Wop: Workload Analysis for Virtual Machine Placements.",
                    "Parallel Secondo: Boosting Database Engines with Hadoop.",
                    "A Remote USB Architecture for Virtual Machine Oriented Device Sharing and Transparent Mgration.",
                    "Towards a Common Benchmark Framework for Cloud Brokers.",
                    "Enabling On-Demand Mashups of Open Data with Semantic Services.",
                    "Online Optimization of VM Deployment in IaaS Cloud.",
                    "Accelerating the Cloud Backup Using GPU Based Data Deduplication.",
                    "Improving Data Processing Time with Access Sequence Prediction.",
                    "Modeling Dwarfs for Workload Characterization.",
                    "A Distributed Fine-Grained Flow Control System for Scalable Aircraft Spares Management and Optimization in Clouds.",
                    "A VM-based Resource Management Method Using Statistics.",
                    "Failure Prediction of Data Centers Using Time Series and Fault Tree Analysis.",
                    "Enhancing Cloud Object Storage Performance Using Dynamic Replication Approach.",
                    "Data Value Chain as a Service Framework: For Enabling Data Handling, Data Security and Data Analysis in the Cloud.",
                    "Privacy Preservation in Streaming Data Collection.",
                    "Hidden Markov Models for Abnormal Event Processing in Transportation Data Streams.",
                    "Smart Traffic Cloud: An Infrastructure for Traffic Applications.",
                    "Automatic VM Allocation for Scientific Application.",
                    "ProDFA: Accelerating Domain Applications with a Coarse-Grained Runtime Reconfigurable Architecture.",
                    "Demonstration of Damson: Differential Privacy for Analysis of Large Data.",
                    "SWAT: Social Web Application for Team Recommendation.",
                    "A Demo Paper: An Analytic Workflow Framework for Green Campus.",
                    "PlugCloud - Scaling by Plugging a Personal Cloud Infrastructure.",
                    "Design and Development of an Adaptive Workflow-Enabled Spatial-Temporal Analytics Framework.",
                    "GPU-accelerated Computation of 3D Laser Radar Range Imaging of Arbitrary Coarse Targets.",
                    "Parallel and Distributed Processing of Remote Sensing Data on Large Displays.",
                    "A GPU-based Implementation of WRF PBL/MYNN Surface Layer Scheme.",
                    "GPU-based Calculation for Scattering Characteristics of Complex Targets from Background Radiance in Infrared Spectrum.",
                    "GPU Parallel Computing of Spherical Panorama Video Stitching.",
                    "Accelerating Volkov's Hybrid Implementation of Cholesky Factorization on a Fermi GPU.",
                    "Geographic Routing with Minimal Local Geometry.",
                    "Visualization for Anomaly Detection and Data Management by Leveraging Network, Sensor and GIS Techniques.",
                    "Power Control Algorithm Based on SNR Cost Function in Cognitive Radio System.",
                    "A Remote View System to Allow Real-Time Walkthrough.",
                    "Multicore Computing for SIFT Algorithm in MATLAB® Parallel Environment.",
                    "User Satisfaction-Based Scheduling Algorithm for Uplink Transmission in Long Term Evolution System.",
                    "A Design of Middleware Layer for QoS in Wireless Sensor Networks.",
                    "A Smart Home System Based on ZigBee and IOS Software.",
                    "GPGPU for Real-Time Data Analytics.",
                    "Intel Many Integrated Core (MIC) Architecture."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th ICPADS 2011",
        "info": "Tainan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2011",
                "sub_name": "17th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2011, Tainan, Taiwan, December 7-9, 2011.",
                "count": 153,
                "papers": [
                    "Extending Lifetime and Reducing Garbage Collection Overhead of Solid State Disks with Virtual Machine Aware Journaling.",
                    "Scheduling Mixed Real-Time and Non-real-Time Applications in MapReduce Environment.",
                    "An In-Memory Framework for Extended MapReduce.",
                    "Physical Machine State Migration.",
                    "Hypervisor Support for Efficient Memory De-duplication.",
                    "A Hierarchical Memory Service Mechanism in Server Consolidation Environment.",
                    "A Method for Improving Concurrent Write Performance by Dynamic Mapping Virtual Storage System Combined with Cache Management.",
                    "Source Code Partitioning in Program Optimization.",
                    "Fair and Efficient Online Adaptive Scheduling for Multiple Sets of Parallel Applications.",
                    "Combining Multiple Metrics to Control BSP Process Rescheduling in Response to Resource and Application Dynamics.",
                    "Roystonea: A Cloud Computing System with Pluggable Component Architecture.",
                    "A Static Task Scheduling Framework for Independent Tasks Accelerated Using a Shared Graphics Processing Unit.",
                    "Optimizing Dynamic Programming on Graphics Processing Units via Adaptive Thread-Level Parallelism.",
                    "SAW: Java Synchronization Selection from Lock or Software Transactional Memory.",
                    "Mercury: A Negotiation-Based Resource Management System for Grids.",
                    "Catwalk-ROMIO: A Cost-Effective MPI-IO.",
                    "An Efficient Video Adaptation Scheme for SVC Transport over LTE Networks.",
                    "Optimization of an Instrumentation Tool for Stripped Win32/X86 Binaries.",
                    "A Semantic Decentralized Chord-Based Resource Discovery Model for Grid Computing.",
                    "Sorting Large Multifield Records on a GPU.",
                    "Strassen's Matrix Multiplication on GPUs.",
                    "Optimization of Sparse Matrix-Vector Multiplication with Variant CSR on GPUs.",
                    "Broadcasting on Large Scale Heterogeneous Platforms with Connectivity Artifacts under the Bounded Multi-port Model.",
                    "Node-to-Node Disjoint Paths in k-ary n-cubes with Faulty Edges.",
                    "Building High-Performance Application Protocol Parsers on Multi-core Architectures.",
                    "Design and Implementation of MapReduce Using the PGAS Programming Model with UPC.",
                    "Reflex Barrier: A Scalable Network-Based Synchronization Barrier.",
                    "Is It Time to Rethink Distributed Shared Memory Systems?",
                    "Automatic Handling of Global Variables for Multi-threaded MPI Programs.",
                    "Automatic FFT Performance Tuning on OpenCL GPUs.",
                    "Mapping of BLASTP Algorithm onto GPU Clusters.",
                    "Hybrid CPU-GPU Solver for Gradient Domain Processing of Massive Images.",
                    "Fast Snippet Generation Based on CPU-GPU Hybrid System.",
                    "A Failure Detection Service for Internet-Based Multi-AS Distributed Systems.",
                    "Classifier Grouping to Enhance Data Locality for a Multi-threaded Object Detection Algorithm.",
                    "PQEMU: A Parallel System Emulator Based on QEMU.",
                    "Set Utilization Based Dynamic Shared Cache Partitioning.",
                    "TrC-MC: Decentralized Software Transactional Memory for Multi-multicore Computers.",
                    "CU2CL: A CUDA-to-OpenCL Translator for Multi- and Many-Core Architectures.",
                    "PADS: A Pattern-Driven Stencil Compiler-Based Tool for Reuse of Optimizations on GPGPUs.",
                    "Architecture-Aware Mapping and Optimization on a 1600-Core GPU.",
                    "An Optimal and Flexible TCAM Software Simulation Algorithm.",
                    "Trace Spectral Analysis toward Dynamic Levels of Detail.",
                    "Simulation-Based Performance Analysis and Tuning for a Two-Level Directly Connected System.",
                    "Power-Performance Comparison of Single-Task Driven Many-Cores.",
                    "Is Buffer Cache Still Effective for High Speed PCM (Phase Change Memory) Storage?",
                    "StreamMR: An Optimized MapReduce Framework for AMD GPUs.",
                    "ANEPROF: Energy Profiling for Android Java Virtual Machine and Applications.",
                    "Lonestar: An Energy-Aware Disk Based Long-Term Archival Storage System.",
                    "A Versatile Nodal Energy Consumption Monitoring Method for Wireless Sensor Network Testbed.",
                    "Heterogeneity-Aware Peak Power Management for Accelerator-Based Systems.",
                    "Using a Pheromone Mechanism to Estimate the Size of Unstructured Networks.",
                    "Building the Knowledge Base through Bayesian Network for Cognitive Wireless Networks.",
                    "Joint Bandwidth-Aware Relay Placement and Routing in Heterogeneous Wireless Networks.",
                    "A Distributed Routing Protocol and Handover Schemes in Hybrid Vehicular Ad Hoc Networks.",
                    "A Bandwidth Aggregation Scheme for Member-Based Cooperative Networking over the Hybrid VANET.",
                    "A Study of Video Frame Sharing in Sparse Vehicular Networks.",
                    "Minimizing Ceased Areas with Power Control for Spatial Reuse in IEEE 802.11 Ad Hoc Networks.",
                    "Efficient VANET Unicast Routing Using Historical and Real-Time Traffic Information.",
                    "Gossip-Based Cooperative Caching for Mobile Phone Games in IMANETs.",
                    "MR-DBSCAN: An Efficient Parallel Density-Based Clustering Algorithm Using MapReduce.",
                    "RDTS: A Reliable Erasure-Coding Based Data Transfer Scheme for Wireless Sensor Networks.",
                    "Data Collection with Multiple Controlled Mobile Nodes in Wireless Sensor Networks.",
                    "Rendezvous Enhancement in Arbitrary-Duty-Cycled Wireless Sensor Networks.",
                    "Dynamic Data Forwarding in Low-Duty-Cycle Sensor Networks.",
                    "A Cooperative Approach to Cache Consistency Maintenance in Wireless Mesh Networks.",
                    "Attachment Learning for Multi-channel Allocation in Distributed OFDMA Networks.",
                    "Dynamic Resource Allocation of IEEE 802.16j Networks with Directional Antenna.",
                    "Optimal Mobility-Aware Handoff in Mobile Environments.",
                    "Towards Service-Oriented Cognitive Networks over IP Multimedia Subsystems.",
                    "Efficient SINR Estimating with Accuracy Control in Large Scale Cognitive Radio Networks.",
                    "A Tabu Based Cache to Improve Latency and Load Balancing on Prefix Trees.",
                    "Optimal P2P Cache Sizing: A Monetary Cost Perspective on Capacity Design of Caches to Reduce P2P Traffic.",
                    "A New Auction Based Approach to Efficient P2P Live Streaming.",
                    "Scalable and Reliable Live Streaming Service through Coordinating CDN and P2P.",
                    "Robust Fault-Tolerant Majority-Based Key-Value Store Supporting Multiple Consistency Levels.",
                    "Scalable Distributed Processing of Spatial Point Data.",
                    "New RFID Authentication Protocol with DOS-attack Resistance.",
                    "BlockTapping: An Online Transparent Integrity Checker for Virtual Storage.",
                    "A Trustworthy Computing of ADAPT Principle Guaranteeing Genuine Medical Image.",
                    "A Study on Information Security Management with Personal Data Protection.",
                    "A System Call Analysis Method with MapReduce for Malware Detection.",
                    "Hybrid Provable Data Possession at Untrusted Stores in Cloud Computing.",
                    "A Modified Hopfield Neural Network for Diagnosing Comparison-Based Multiprocessor Systems Using Partial Syndromes.",
                    "Secure Communication Scheme of VANET with Privacy Preserving.",
                    "Detecting Chaff Perturbation on Stepping-Stone Connection.",
                    "Security Analysis of an eSeal Used in Taiwan Customs Officials.",
                    "Robust e-Voting Composition.",
                    "On Least Idle Slot First Co-scheduling of Update and Control Tasks in Real-Time Sensing and Control Systems.",
                    "Charge Scheduling of Electric Vehicles in Highways through Mobile Computing.",
                    "Automatic Extraction of Pipeline Parallelism for Embedded Software Using Linear Programming.",
                    "Distributed Multi-agent Schemes for Predictable QoS on Heterogenous Wireless Networks.",
                    "ERWF: Embedded Real-Time Workflow Engine for User-Centric Cyber-Physical Systems.",
                    "Browsing Architecture with Presentation Metadata for the Internet of Things.",
                    "An Optimal Topology for a Static P2P Live Streaming Network with Limited Resources.",
                    "Efficient Hybrid Push-Pull Based P2P Media Streaming System.",
                    "Service Availability for P2P On-Demand Streaming with Dynamic Buffering.",
                    "RELookup: Providing Resilient and Efficient Lookup Service for P2P-VoD Streaming.",
                    "Adaptive and Efficient Peer Selection in Peer-to-Peer Streaming Networks.",
                    "Peer-to-Peer Immersive Voice Communication for Massively Multiplayer Online Games.",
                    "Using P2P Networks to Repair Packet Losses in Digital Video Broadcasting Systems.",
                    "Spatial Queries Processing in Autonomous Mobile System Environment.",
                    "Peer Content Groups for Reliable and Transparent Content Access in P2P Networks.",
                    "SSNG: A Self-Similar Super-Peer Overlay Construction Scheme for Super Large-Scale P2P Systems.",
                    "On the Power Law Property of Latency-Reducing Relays.",
                    "SYMA: A Synchronous Multihop Architecture for Wireless Ad Hoc Multiplayer Games.",
                    "How Helpful Can Social Network Friends Be in Peer-to-Peer Video Distribution?",
                    "Participation and Departure Processes of Nodes in Connection Graph.",
                    "Social Trust and Reputation in Online Social Networks.",
                    "Towards a Common Architecture to Interconnect Heterogeneous Overlay Networks.",
                    "A Batch Join Scheme for Flash Crowd Reduction in IPTV Systems.",
                    "Catching Preference Drift with Initiators in Social Network.",
                    "Wisdom of the Crowd: Incorporating Social Influence in Recommendation Models.",
                    "Stochastic Load Rebalancing in Distributed Hash Tables.",
                    "Data Selection for User Topic Model in Twitter-Like Service.",
                    "Internet of Things Architecture Based on Integrated PLC and 3G Communication Networks.",
                    "On the Disruptive Potentials in Internet of Things.",
                    "A RESTful Architecture for Integrating Decomposable Delayed Services within the Web of Things.",
                    "Adaptive Traffic-Aware Power-Saving Protocol for IEEE 802.11 Ad Hoc Networks.",
                    "Passive Tag for Multi-carrier RFID Systems.",
                    "A Study of Comfort Measuring System Using Taxi Trajectories.",
                    "Efficient Identity-Based Key Management for Configurable Hierarchical Cloud Computing Environment.",
                    "Simulation of Anti-malware User Support System Using Queuing Network Model.",
                    "The Low-Cost Secure Sessions of Access Control Model for Distributed Applications by Public Personal Smart Cards.",
                    "Trust Issues that Create Threats for Cyber Attacks in Cloud Computing.",
                    "Reactor Containment Dependability Analysis in Safety Critical Nuclear Power Plants: Design, Implementation and Experience.",
                    "Malware Virtualization-Resistant Behavior Detection.",
                    "A Revised Ant Colony Optimization Scheme for Discovering Attack Paths of Botnet.",
                    "Secure Mechanism for Mobile Web Browsing.",
                    "Visualization System for Log Analysis with Probabilities of Incorrect Operation.",
                    "Transparent Communications for Applications behind NAT/Firewall over any Transport Protocol.",
                    "Characterizing Fine-Grain Parallelism on Modern Multicore Platform.",
                    "A Time-Series Based Precopy Approach for Live Migration of Virtual Machines.",
                    "Energy-Aware High Performance Computing: A Taxonomy Study.",
                    "Energy-Aware Depth Map Generation for 3D Portrait on Android Systems.",
                    "Towards Providing Cloud Functionalities for Grid Users.",
                    "A Hybrid Simulation of Large Crowd Evacuation.",
                    "Task Scheduling of Massive Spatial Data Processing across Distributed Data Centers: What's New?",
                    "Volunteer Sensing: The New Paradigm of Social Sensing.",
                    "The Implementation of Multilayer Virtual Network Management System on NetFPGA.",
                    "Creating Future Networks: Designing, Implementing and Operating Advanced Experimental Network Research Testbeds.",
                    "Network Virtualization with Cloud Virtual Switch.",
                    "Improving Speculative Execution Performance with Coworker for Cloud Computing.",
                    "FPGA Design of an Automatic Target Generation Process for Hyperspectral Image Analysis.",
                    "Accelerating the Kalman Filter on a GPU.",
                    "Parallel Processing with MPI for Inter-band Registration in Remote Sensing.",
                    "Volume Data Numerical Integration and Differentiation Using CUDA.",
                    "Parallel Computation of the Weather Research and Forecast (WRF) WDM5 Cloud Microphysics on a Many-Core GPU.",
                    "Commodity Cluster-Based Parallel Implementation of an Automatic Target Generation Process for Hyperspectral Image Analysis.",
                    "GPU Implementation of Orthogonal Matching Pursuit for Compressive Sensing.",
                    "Fast Band Selection for Hyperspectral Imagery.",
                    "Parallel Implementation of Edge-Directed Image Interpolation on a Graphics Processing Unit.",
                    "Single-Phase Wireless LAN Based Multi-floor Indoor Location Determination System."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th ICPADS 2010",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2010",
                "sub_name": "16th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2010, Shanghai, China, December 8-10, 2010.",
                "count": 121,
                "papers": [
                    "A Discrete Event Simulation Model for Understanding Kernel Lock Thrashing on Multi-core Architectures.",
                    "Privacy Protection in Participatory Sensing Applications Requiring Fine-Grained Locations.",
                    "A Scheduling Method for Avoiding Kernel Lock Thrashing on Multi-cores.",
                    "Towards a P2P Cloud: Reliable Resource Reservations in Unreliable P2P Systems.",
                    "GMH: A Message Passing Toolkit for GPU Clusters.",
                    "An Effective Framework of Light-Weight Handling for Three-Level Fine-Grained Recoverable Temporal Violations in Scientific Workflows.",
                    "Resilient Virtual Network Service Provision in Network Virtualization Environments.",
                    "Towards a Common Interface for Overlay Network Simulators.",
                    "VMGuard: An Integrity Monitoring System for Management Virtual Machines.",
                    "Detection of Behavioral Contextual Properties in Asynchronous Pervasive Computing Environments.",
                    "Utilizing RF Interference to Enable Private Estimation in RFID Systems.",
                    "Automatic Thread Decomposition for Pipelined Multithreading.",
                    "PicFS: The Privacy-Enhancing Image-Based Collaborative File System.",
                    "M-cube: A Duty Cycle Based Multi-channel MAC Protocol with Multiple Channel Reservation for WSNs.",
                    "Optimistic Localization: Avoiding Location Ambiguity in Wireless Ad-hoc Networks.",
                    "A Self-Stabilizing Locality-Aware Peer-to-Peer Network Combining Random Networks, Search Trees, and DHTs.",
                    "Mixed-Parallel Implementations of Extrapolation Methods with Reduced Synchronization Overhead for Large Shared-Memory Computers.",
                    "DSpam: Defending Against Spam in Tagging Systems via Users' Reliability.",
                    "VirtCFT: A Transparent VM-Level Fault-Tolerant System for Virtual Clusters.",
                    "Performance Data Extrapolation in Parallel Codes.",
                    "Approximate Data Collection for Wireless Sensor Networks.",
                    "Scalable Authentication and Key Management in SCADA.",
                    "Packet Content Matching with packetC Searchsets.",
                    "A Taxonomy of Autonomic Application Management in Grids.",
                    "ILGT: Group Reputation Aggregation Method for Unstructured Peer-to-Peer Networks.",
                    "TRIP: Temporal Redundancy Integrated Performance Booster for Parity-Based RAID Storage Systems.",
                    "Semantics-Aware, Timely Prefetching of Linked Data Structure.",
                    "Simulating Large Scale Parallel Applications Using Statistical Models for Sequential Execution Blocks.",
                    "Accelerating Spatial Data Processing with MapReduce.",
                    "Auto-tuning Dense Matrix Multiplication for GPGPU with Cache.",
                    "A New Structured Peer-to-Peer Architecture Based on Physical Distance.",
                    "Data Vitalization: A New Paradigm for Large-Scale Dataset Analysis.",
                    "Employing Multiple CUDA Devices to Accelerate LTL Model Checking.",
                    "Consensus Service to Solve Agreement Problems.",
                    "Enhanced Privilege Separation for Commodity Software on Virtualized Platform.",
                    "On Sweep Coverage with Minimum Mobile Sensors.",
                    "Data-Aware Task Scheduling on Multi-accelerator Based Platforms.",
                    "Broadcasting Algorithm Via Shortest Paths.",
                    "4Sensing -- Decentralized Processing for Participatory Sensing Data.",
                    "A Parallel XPath Engine Based on Concurrent NFA Execution.",
                    "Kumoi: A High-Level Scripting Environment for Collective Virtual Machines.",
                    "Unifying Buffer Replacement and Prefetching with Data Migration for Heterogeneous Storage Devices.",
                    "Detection of a Weak Conjunction of Unstable Predicates in Dynamic Systems.",
                    "Utility Accrual Object Distribution in Real-Time Systems.",
                    "Cost-Effective Congestion Management for Interconnection Networks Using Distributed Deterministic Routing.",
                    "Smart: Service Model for Integrating Wireless Sensor Networks and the Internet.",
                    "Effective Performance Measurement at Petascale Using IPM.",
                    "Achieving Predictable High Performance in Imbalanced Fat Trees.",
                    "Coordinated Selective Rejuvenation for Distributed Services.",
                    "Enhancing MapReduce via Asynchronous Data Processing.",
                    "Dynamic Graph Traversals for Concurrent Rewriting Using Work-Stealing Frameworks for Multicore Platforms.",
                    "Cloud Storage Design Based on Hybrid of Replication and Data Partitioning.",
                    "LADPM: Latency-Aware Dual-Partition Multicast Routing for Mesh-Based Network-on-Chips.",
                    "BLAST: Applying Streaming Ciphers Into Outsourced Cloud Storage.",
                    "Multi-mapping Meshes: A New Communicating Fabric for Networks-on-Chip.",
                    "Inter-Coding: An Interleaving and Erasure Coding Based Stable Routing Scheme in Multi-path DTN.",
                    "Automatically Tuned Dynamic Programming with an Algorithm-by-Blocks.",
                    "Acceleration of a High Order Accurate Method for Compressible Flows on SDSM Based GPU Clusters.",
                    "Gossiping Differential Evolution: A Decentralized Heuristic for Function Optimization in P2P Networks.",
                    "General vs. Interval Mappings for Streaming Applications.",
                    "Multi-task Downloading for P2P-VoD: An Empirical Perspective.",
                    "SCAS: Sensing Channel ASsignment for Spectrum Sensing Using Dedicated Wireless Sensor Networks.",
                    "PinComm: Characterizing Intra-application Communication for the Many-Core Era.",
                    "A Distributed Workflow Mapping Algorithm for Minimum End-to-End Delay under Fault-Tolerance Constraint.",
                    "Bandwidth Constrained Tree Construction for Live Streaming Systems in P2P Networks.",
                    "Hybrid Checkpointing for MPI Jobs in HPC Environments.",
                    "Optimizing Energy-Latency Trade-off in Wireless Sensor Networks with Mobile Element.",
                    "Fault Tolerant Network Routing through Software Overlays for Intelligent Power Grids.",
                    "Approximate Algorithms for Sensor Deployment with k-coverage in Constrained 3D Space.",
                    "Distributed Spatial Analysis in Wireless Sensor Networks.",
                    "Multi-consistency Data Replication.",
                    "Downlink Resource Auction in a Tree Topology Structured Wireless Mesh Network.",
                    "2F: A Special Cache for Mapping Table of Page-Level Flash Translation Layer.",
                    "Making Human Connectome Faster: GPU Acceleration of Brain Network Analysis.",
                    "Impacts of Asynchrony on Epidemic-Style Aggregation Protocols.",
                    "Adaptive Audio Synchronization Scheme Based on Feedback Loop with Local Clock in Wireless Audio Sensor Networks.",
                    "A Game-Theoretic Approach to Anti-jamming in Sensor Networks.",
                    "A Pervasive Simplified Method for Human Movement Pattern Assessing.",
                    "Power Aware Scheduling for Parallel Tasks via Task Clustering.",
                    "An Energy Efficient Clustering Scheme with Self-Organized ID Assignment for Wireless Sensor Networks.",
                    "Quantitative Evaluation of TBC Systems of Gas Turbine Blades Using TFEC.",
                    "Velocity Field Based Modelling and Simulation of Crowd in Confrontation Operations.",
                    "Motion Tracking Based on Boolean Compressive Infrared Sampling.",
                    "A Qualitative Analysis of Uncertainty and Correlation Computing for the Business Processes of Enterprise Interoperability.",
                    "A Novel Chaining Approach for Direct Control Transfer Instructions.",
                    "Vapor: Virtual Machine Based Parallel Program Profiling Framework.",
                    "Cooperative Work Systems for the Security of Digital Computing Infrastructure.",
                    "Space Speedup and Its Relationship with Time Speedup.",
                    "Building Similar Link Network in Large-Scale Web Resources.",
                    "A Policy-Based Framework for Automated SLA Negotiation for Internet-Based Virtual Computing Environment.",
                    "A Complex Network Based Virtual Computing Environment Topology Generating Method.",
                    "A VMM-Based System Call Interposition Framework for Program Monitoring.",
                    "A Prefetching Framework for the Streaming Loading of Virtual Software.",
                    "PGOS: An Architecture of a Personal Net Computing Platform.",
                    "PMSAI: A Novel Peer-to-Peer Multimedia Streaming Architecture over IMS.",
                    "A General Distributed Object Locating Architecture in the Internet of Things.",
                    "Towards the Efficiency of Ontology-Based Context Reasoning in Virtual Computing Environment.",
                    "Personalized Reputation Model in Cooperative Distributed Systems.",
                    "Design and Practice on iVCE for Memory System.",
                    "Efficient Virtual Machine Deployment in Large Scale Resource Environment.",
                    "CANSE: A Churn Adaptive Approach to Network Size Estimation.",
                    "Nexus: Speculative Execution for Event-Driven Networking Programs.",
                    "Small-World Social Relationship Awareness in Unstructured Peer-to-Peer Networks.",
                    "Decentralized Search in Scale-Free P2P Networks.",
                    "Characteristics of Random Walk Search on Embedded Tree Structure for Unstructured P2Ps.",
                    "A Hierarchical DHT for Fault Tolerant Management in P2P-SIP Networks.",
                    "Cooperative User Centric Information Dissemination in Human Content-Based Networks.",
                    "Cloud Assisted P2P Media Streaming for Bandwidth Constrained Mobile Subscribers.",
                    "Discovering Free-Riders Before Trading: A Simple Approach.",
                    "Multi-party Videoconferencing Based on Hybrid Multicast with Peer-Forwarding.",
                    "Optimal Data Scheduling for P2P VoD Streaming Systems.",
                    "A Two-Key Agreement Based Supervising Mechanism for Cluster-Based Peer-to-Peer Applications.",
                    "Bandwidth- and Latency-Aware Peer-to-Peer Instant Friendcast for Online Social Networks.",
                    "Dual-Path Peer-to-Peer Anonymous Approach.",
                    "Load-Balancing Properties of 3D Voronoi Diagrams in Peer-to-Peer Virtual Environments.",
                    "Avatar Path Clustering in Networked Virtual Environments.",
                    "Cross-Layer Design to Merge Structured P2P Networks over MANET.",
                    "Achieving Lower Delay with Energy Efficiency in Extremely Low-Duty-Cycle and Unreliable WSN.",
                    "Distributed Real-Time Data Traffic Statistics Assisted Routing Protocol for Vehicular Networks.",
                    "Load Aware Routing with Delay Threshold for Vehicular Ad Hoc Networks.",
                    "A Primal Dual Approach for Dynamic Bid Optimization."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "15th ICPADS 2009",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2009",
                "sub_name": "15th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2009, Shenzhen, China, December 8-11, 2009.",
                "count": 139,
                "papers": [
                    "Keynote.",
                    "Prediction-Based Prefetching to Support VCR-like Operations in Gossip-Based P2P VoD Systems.",
                    "Quality of Service in Peer-to-Peer IPTV Networks.",
                    "Decentralized Adaptive Routing for Reliability in Event Broker Networks.",
                    "On the Robust Mapping of Dynamic Programming onto a Graphics Processing Unit.",
                    "CUDA Accelerated LTL Model Checking.",
                    "Improving Performance of Matrix Multiplication and FFT on GPU.",
                    "Flexible Multi-link Ethernet Binding System for PC Clusters with Asymmetric Topology.",
                    "Evaluation of ConnectX Virtual Protocol Interconnect for Data Centers.",
                    "uStream: A User-Level Stream Protocol over Infiniband.",
                    "WormCircle: Connectivity-Based Wormhole Detection in Wireless Ad Hoc and Sensor Networks.",
                    "Broadcasting with Optimized Transmission Efficiency in 3-Dimensional Wireless Networks.",
                    "Contour-cast: Location-free Data Dissemination and Discovery for Wireless Sensor Networks.",
                    "Optimizing Base Station Deployment in Wireless Sensor Networks Under One-hop and Multi-hop Communication Models.",
                    "Minimizing Memory Access Schedule for Memories.",
                    "When Misses Differ: Investigating Impact of Cache Misses on Observed Performance.",
                    "A Light-weight Code Cache Design for Dynamic Binary Translation.",
                    "Snooping and Ordering Ring - An Efficient Cache Coherence Protocol for Ring Connected CMP.",
                    "Feedback-Control-Based Performance Regulation for Multi-Tenant Applications.",
                    "Allocation of Clients to Multiple Servers on Large Scale Heterogeneous Platforms.",
                    "Dynamic Load Balancing for Parallel Numerical Simulations Based on Repartitioning with Disturbed Diffusion.",
                    "Market-Based Load Balancing for Distributed Heterogeneous Multi-Resource Servers.",
                    "A Decentralized Storage Scheme for Multi-Dimensional Range Queries over Sensor Networks.",
                    "Polygon-Based Tracking Framework in Surveillance Wireless Sensor Networks.",
                    "Constructing Optimal Clustering Architecture for Maximizing Lifetime in Large Scale Wireless Sensor Networks.",
                    "CCQR: Constant Cost Quality-based Routing Protocol in Delay Tolerant Networks.",
                    "An Improved Parallel Access Technology on Routing Table for Threaded BGP.",
                    "Exploiting TLS Parallelism at Multiple Loop-Nest Levels.",
                    "Modeling Data Access Contention in Multicore Architectures.",
                    "Towards High-Performance Network Intrusion Prevention System on Multi-core Network Services Processor.",
                    "A Novel Optimization Method to Improve De-duplication Storage System Performance.",
                    "Scalability of Macroblock-level Parallelism for H.264 Decoding.",
                    "A Cache-Efficient Parallel Gauss-Seidel Solver with Alternating Tiling.",
                    "Optimizing End-to-end Performance of Distributed Applications with Linear Computing Pipelines.",
                    "DBS: A Bit-level Heuristic Packet Classification Algorithm for High Speed Network.",
                    "Network Interface Architecture for Scalable Message Queue Processing.",
                    "Field-Based Branch Prediction for Packet Processing Engines.",
                    "RankBoost Acceleration on both NVIDIA CUDA and ATI Stream Platforms.",
                    "Program Optimization of Array-Intensive SPEC2k Benchmarks on Multithreaded GPU Using CUDA and Brook+.",
                    "Optimal Data Distribution for Versatile Finite Impulse Response Filtering on Next-Generation Graphics Hardware Using CUDA.",
                    "Pancyclicity and Panconnectivity in Augmented k-ary n-cubes.",
                    "A Fault-Free Unicast Algorithm in Twisted Cubes with the Restricted Faulty Node Set.",
                    "Routing, Broadcasting, Prefix Sums, and Sorting Algorithms on the Arrangement Graph.",
                    "A Functional Classification Based Inter-VM Communication Mechanism with Multi-core Platform.",
                    "PaS: A Preemption-aware Scheduling Interface for Improving Interactive Performance in Consolidated Virtual Machine Environment.",
                    "CFS Optimizations to KVM Threads on Multi-Core Environment.",
                    "Optimizing Inter-Domain Communication.",
                    "ERN: Emergence Rescue Navigation with Wireless Sensor Networks.",
                    "Traffic-Known Urban Vehicular Route Prediction Based on Partial Mobility Patterns.",
                    "An Optimized String Transformation Algorithm for Real-Time Group Editors.",
                    "Modified Simultaneous Algebraic Reconstruction Technique and its Parallelization in Cryo-electron Tomography.",
                    "An Evaluation of Communication Factors on an Adaptive Control Strategy for Job Co-allocation in Multiple HPC Clusters.",
                    "Real-time Task Assignment with Replication on Multiprocessor Platforms.",
                    "A Heuristic Energy-aware Scheduling Algorithm for Heterogeneous Clusters.",
                    "Data-bandwidth-aware Job Scheduling in Grid and Cluster Environments.",
                    "Efficient Update Propagation by Speculating Replica Locations on Peer-to-Peer Networks.",
                    "A Study of Group Size Effects on a Hybrid P2P System.",
                    "Papnet: A Proximity-aware Alphanumeric Overlay Supporting Ganesan On-Line Load Balancing.",
                    "Towards Keyword Search over Relational Databases in DHT Networks.",
                    "Reliable Software Distributed Shared Memory Using Page Migration.",
                    "MPI-NeTSim: A Network Simulation Module for MPI.",
                    "Accelerating MapReduce with Distributed Memory Cache.",
                    "Quantification of Security for Compute Intensive Workloads in Clouds.",
                    "Energy-Efficient Sensor Data Acquisition Based on Periodic Patterns.",
                    "tk-coverage: Time-Based K-Coverage for Energy Efficient Monitoring.",
                    "Energy Minimization and Latency Hiding for Heterogeneous Parallel Memory.",
                    "A Power-Aware Routing Protocol with Signal Strength Variation in Mobile Ad Hoc Networks.",
                    "Multiprocessor System-on-Chip Profiling Architecture: Design and Implementation.",
                    "Exploiting Parallelism through High Level Optimization on a Heterogeneous Multicore SoC.",
                    "An Application Mapping Scheme over Distributed Reconfigurable System.",
                    "Speculation with Little Wasting: Saving Cost in Software Speculation through Transparent Learning.",
                    "Partitioned Computation to Accelerate Scalar Multiplication for Elliptic Curve Cryptosystems.",
                    "DVM-MAC: A Mandatory Access Control System in Distributed Virtual Computing Environment.",
                    "Is Straight-line Path Always the Best for Intrusion Detection in Wireless Sensor Networks.",
                    "Privacy Reference Monitor - A Computer Model for Law Compliant Privacy Protection.",
                    "Early Performance Evaluation of Dawning 5000A and DeepComp 7000.",
                    "Understanding Network Saturation Behavior on Large-Scale Blue Gene/P Systems.",
                    "Providing Responsiveness Requirement Based Consistency in DVE.",
                    "A Population Dynamics Model for Data Streaming over P2P Networks.",
                    "JOR: A Journal-guided Reconstruction Optimization for RAID-Structured Storage Systems.",
                    "A Parallel SystemC Environment: ArchSC.",
                    "A Hybrid Parallel Framework for the Cellular Potts Model Simulations.",
                    "E-TCP: Enhanced TCP for IEEE802.11e Mobile Ad Hoc Networks.",
                    "SCN4M-DL: An Adaptive Directory-Less Service Discovery System for MANETs.",
                    "Queuing Based Traffic Model for Wireless Mesh Networks.",
                    "Implementation of the AdaBoost Algorithm for Large Scale Distributed Environments: Comparing JavaSpace and MPJ.",
                    "A Tabu Search for the Heterogeneous DAG Scheduling Problem.",
                    "Double-layer Scheduling Strategy of Load Balancing in Scientific Workflow.",
                    "A Supply-and-Demand Model for On-Demand Streaming in Networked Virtual Environments.",
                    "Group-Based Peer-to-Peer 3D Streaming Authentication.",
                    "Evaluation of the HyperVerse Avatar Management Scheme Based on the Analysis of Second Life Traces.",
                    "A Service-oriented Programming Platform for Internet-Based Virtual Computing Environment.",
                    "Experiences Running OGSA-DQP Queries against a Heterogeneous Distributed Scientific Database.",
                    "Cyberinfrastructure on Tumor Gene Expresstion Data Processing.",
                    "Towards Hybrid Grid Infrastructure for Large Simulations.",
                    "Towards a Scalable Real-Time Cyberinfrastructure for Online Computer Games.",
                    "A Transmit Antenna Selection for MIMO Wireless Ad-Hoc Networks in Lossy Environment.",
                    "BER Performance Evaluation of Tail-Biting Convolution Coding Applied to Companded QPSK Mobile WiMax.",
                    "Broadcasting in Fully Connected Trees.",
                    "Optimizing Unstructured Peer-to-Peer Overlays with Topology Awareness.",
                    "Anadem: A Hybrid Overlay Network for Content-Based Data Distribution.",
                    "A Replica Placement Algorithm for Hybrid CDN-P2P Architecture.",
                    "Measuring the Influence of Active Measurement on Unstructured Peer-to-Peer Network.",
                    "Mobility of Internet-Based Virtual Computing Environment.",
                    "Performance under Failure of Multi-tier Web Services.",
                    "A Peer-to-Peer Media Streaming System Based on the iVCE Platform.",
                    "Measurement and Analysis of BitTorrent Availability.",
                    "Association Link Network: An Incremental Semantic Data Model on Organizing Web Resources.",
                    "A Case of Parallel EEG Data Processing upon a Beowulf Cluster.",
                    "A Fast and Intelligent Resource Allocation Service for Service-Oriented Grid.",
                    "A Symmetric Matchmaking Engine for Web Service Composition.",
                    "Evaluation of a Performance Prediction Tool for Peer-to-Peer Distributed Computing Applications.",
                    "Comparing Methods for the Efficient Analysis of PEPA Models of Non-repudiation Protocols.",
                    "Detection of Conjunctive Stable Predicates in Dynamic Systems.",
                    "iRank: Supporting Proximity Ranking for Peer-to-Peer Applications.",
                    "A Diffusive Load Balancing Scheme for Clustered Peer-to-Peer Systems.",
                    "Cowtra: A COntribution Willingness-Based Two-phase Bandwidth Resource Allocation Algorithm in P2P Network.",
                    "A Forwarding-Based Task Scheduling Algorithm for Distributed Web Crawling over DHTs.",
                    "A Steady Network Coordinate System for Network Distance Estimating.",
                    "HyperSpring: Accurate and Stable Latency Estimation in the Hyperbolic Space.",
                    "Using Grid Middleware to Query a Heterogeneous Distributed Version of the SDSS Database.",
                    "A User-Level Remote Paging System for Grid Computing.",
                    "Extending POP-C++ to Integrate Web Services into Parallel Objects.",
                    "Sequential Pattern Mining in Data Streams Using the Weighted Sliding Window Model.",
                    "SPBCA: Semantic Pattern-Based Context-Aware Middleware.",
                    "The Vulnerability Analysis Framework for Java Bytecode.",
                    "Research on Technologies of Building Experimental Environment for Network Worm Simulation.",
                    "Adaptive Multi-versioning for OpenMP Parallelization via Machine Learning.",
                    "Parallel Lexicographic Names Construction with CUDA.",
                    "Count Sort for GPU Computing.",
                    "Low Overhead Object Communication Scheme in CMP Implementation of Object-Oriented Programming.",
                    "A Virtual Machine Server Aggregation Algorithm Based on Hierarchical Clustering.",
                    "Enhancing Reliability for Virtual Machines via Continual Migration.",
                    "Creating Virtual Networks for Distributed Virtual Computing Environment.",
                    "A Runtime Reputation Based Grid Resource Selection Algorithm on the Open Science Grid.",
                    "GOS Security: Design and Implementation.",
                    "Solving 2D Nonlinear Unsteady Convection-Diffusion Equations on Heterogenous Platforms with Multiple GPUs.",
                    "A Process Fusion Approach for MPI Performance Enhancement on Multi-core Systems.",
                    "Domain-specific Pattern Matching Based Automatic Parallelization: Demonstrated by 2-D Prestack Migration."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th ICPADS 2008",
        "info": "Melbourne, Victoria, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2008",
                "sub_name": "14th International Conference on Parallel and Distributed Systems, ICPADS 2008, Melbourne, Victoria, Australia, December 8-10, 2008.",
                "count": 121,
                "papers": [
                    "Supporting Distributed Application Workflows in Heterogeneous Computing Environments.",
                    "MRBench: A Benchmark for MapReduce Framework.",
                    "Contention-Free Scheduling in a Dynamic Context.",
                    "Parallel Architecture Implementation of a Reliable (k, n) Image Sharing Scheme.",
                    "Distributed RankBoost Acceleration Using FPGA and MPI for Web Relevance Ranking.",
                    "An Efficient Disjoint Shortest Paths Routing Algorithm for the Hypercube.",
                    "Allocating Series of Workflows on Computing Grids.",
                    "Using Dedicated and Opportunistic Networks in Synergy for a Cost-Effective Distributed Stream Processing Platform.",
                    "Designing and Experimenting with a Distributed Tracking System.",
                    "Parallel Large Scale Inference of Protein Domain Families.",
                    "Scheduling Techniques for Effective System Reconfiguration in Distributed Storage Systems.",
                    "GiFT: Automating FTPA Implementation for MPI Programs.",
                    "Energy Efficient Register File with Reduced Window Partition.",
                    "A Novel Network RAID Architecture with Out-of-Band Virtualization and Redundant Management.",
                    "Object-Oriented Parallelisation: Improved and Extended Parallel Iterator.",
                    "Extending Inter-process Synchronization with Robust Mutex and Variants in Condition Wait.",
                    "Asymptotic Analysis of Load Distribution for Size-Interval Task Allocation with Bounded Pareto Job Sizes.",
                    "GMIP: A Novel Optical Interconnect Gridded Memory Service Protocol.",
                    "A Purpose-Based Synchronization Protocol of Multiple Transactions.",
                    "RUFT: Simplifying the Fat-Tree Topology.",
                    "Energy-Efficient Task Partition for Periodic Real-Time Tasks on Platforms with Dual Processing Elements.",
                    "Save Watts in Your Grid: Green Strategies for Energy-Aware Framework in Large Scale Distributed Systems.",
                    "Enhancement of Anticipative Recursively-Adjusting Mechanism for Redundant Parallel File Transfer in Data Grids.",
                    "A Meta-scheduler with Auction Based Resource Allocation for Global Grids.",
                    "Mapping Linear Workflows with Computation/Communication Overlap.",
                    "Dynamic Resource Allocation in Enterprise Systems.",
                    "A Cost-Aware Resource Exchange Mechanism for Load Management across Grids.",
                    "snapPVFS: Snapshot-Able Parallel Virtual File System.",
                    "Scheduling Mixed Tasks with Deadlines in Grids Using Bin Packing.",
                    "Orchestra: Extensible Block-Level Support for Resource and Data Sharing in Networked Storage Systems.",
                    "Optimal Placement of Pipeline Applications on Grid.",
                    "AHPIOS: An MPI-Based Ad Hoc Parallel I/O System.",
                    "A Backward Algorithm in a Distributed Agreement Computing.",
                    "Bootstrapping in Peer-to-Peer Systems.",
                    "SkyEye.KOM: An Information Management Over-Overlay for Getting the Oracle View on Structured P2P Systems.",
                    "Performance Analysis of Peer-to-Peer Video Streaming Systems with Tree and Forest Topology.",
                    "Locality-Aware Peer-to-Peer SIP.",
                    "Improving Web Server Performance Through Main Memory Compression.",
                    "OID: Optimized Information Discovery Using Space Filling Curves in P2P Overlay Networks.",
                    "Integrating Sensor Streams in pHealth Networks.",
                    "A Performance Study of Clustering Web Application Servers with Distributed JVM.",
                    "QoS-Aware Service Selection Using QDG for B2B Collaboration.",
                    "Maximizing Download Bandwidth for File Sharing in BitTorrent-like Peer-to-Peer Networks.",
                    "Mining Community Structures in Peer-to-Peer Environments.",
                    "Continuous Range Search Query Processing in Mobile Navigation.",
                    "Automatic Partitioning of Object-Oriented Programs for Resource-Constrained Mobile Devices with Multiple Distribution Objectives.",
                    "Virtual Ring-Based Hole Avoiding Routing in Mobile Ad Hoc Networks.",
                    "An Efficient Policy System for Body Sensor Networks.",
                    "Achieving Ubiquitous Network Connectivity Using an RFID Tag-Based Routing Protocol.",
                    "Sleeping Schedule Aware Minimum Transmission Broadcast in Wireless Ad Hoc Networks.",
                    "TCP Enhancement in IEEE 802.11e Wireless Networks.",
                    "A Novel Distributed Index Approach for Service Discovery in MANETs.",
                    "Link Availability Prediction in Ad Hoc Networks.",
                    "GWRR: Greedy Weighted Region Routing in Wireless Sensor Networks.",
                    "Optimal Updating Time Using Theory of Reliability.",
                    "Integrity-Preserving Replica Coordination for Byzantine Fault Tolerant Systems.",
                    "A Dynamic Load Balancing Mechanism for New ParaLEX.",
                    "Network Fault Diagnosis: An Artificial Immune System Approach.",
                    "Scheduling Peers Based on Credit Construction Period in Peer-to-Peer Networks.",
                    "Area Difference Based Recovery Information Placement for Mobile Computing Systems.",
                    "An Algorithm to Detect Stepping-Stones in the Presence of Chaff Packets.",
                    "An Online Model Checking Tool for Safety and Liveness Bugs.",
                    "Towards Effective Defense Against Insider Attacks: The Establishment of Defender's Reputation.",
                    "Tolerating Temporal Correlated Failures from Cyclic Dependency in High Performance Computing Systems.",
                    "The Feasibility of Launching Reduction of Quality (RoQ) Attacks in 802.11 Wireless Networks.",
                    "hFT-FW: Hybrid Fault-Tolerance for Cluster-Based Stateful Firewalls.",
                    "Constructing Double-Erasure HoVer Codes Using Latin Squares.",
                    "Transparent and Autonomic Rollback-Recovery in Cluster Systems.",
                    "UDB: Using Directional Beacons for Localization in Underwater Sensor Networks.",
                    "A Constant Factor Localized Algorithm for Computing Connected Dominating Sets in Wireless Sensor Networks.",
                    "A Simulation System for Routing Efficiency in Wireless Sensor-Actor Networks: A Case Study for Semi-automated Architecture.",
                    "Response Time Constrained Top-k Query Evaluation in Sensor Networks.",
                    "Secure RFID Identification and Authentication with Triggered Hash Chain Variants.",
                    "Bouncing Tracks in Sensor Networks.",
                    "Efficient Data Suppression for Wireless Sensor Networks.",
                    "Mobility-Assisted Position Estimation in Wireless Sensor Networks.",
                    "Time-Based Privacy Protection for Multi-attribute Data in WSNs.",
                    "Using Cable-Based Mobile Sensors to Assist Environment Surveillance.",
                    "Fault-Tolerant Algoritms for Detecting Event Regions in Wireless Sensor Networks Using Statistical Hypothesis Test.",
                    "Integrating RFID with Wireless Sensor Networks for Inhabitant, Environment and Health Monitoring.",
                    "A Distributed Area-Based Guiding Navigation Protocol for Wireless Sensor Networks.",
                    "CyclicMAC: A Cyclic MAC Scheduling Scheme for Gathering Data from Heterogeneous Sensors.",
                    "Pipelined Parallel AC-Based Approach for Multi-String Matching.",
                    "Automatic Implementation of Multi-partitioning Using Global Tiling.",
                    "Clustered Decoupled Software Pipelining on Commodity CMP.",
                    "A Quantitative Study of the On-Chip Network and Memory Hierarchy Design for Many-Core Processor.",
                    "Experimental Study of Thread Scheduling Libraries on Degraded CPU.",
                    "Quarc: A Novel Network-On-Chip Architecture.",
                    "An Efficient Switching Technique for NoCs with Reduced Buffer Requirements.",
                    "Processor, Assembler, and Compiler Design Education Using an FPGA.",
                    "Secure Embedded Systems: The Threat of Reverse Engineering.",
                    "Real-Time Enhancements for Embedded Linux.",
                    "A Short Course on Implementing FPGA Based Digital Systems.",
                    "An Intensive Curriculum on Embedded Software Design for Vocational-Purpose Training.",
                    "The Organization of Intel Cup Undergraduate Embedded System Electronic Design Contest.",
                    "VIP: A Flexible Virtual Integrated Platform for EVM Emulation.",
                    "Adapting Experiments of Embedded System Curriculum Designed Based on Embedded IA to Atom.",
                    "A Practical Implementation Course of Operating Systems: Curriculum Design and Teaching Experiences.",
                    "Project Based Learning Curriculum in Microelectronics Engineering.",
                    "Delaunay State Management for Large-Scale Networked Virtual Environments.",
                    "Plug: Virtual Worlds for Millions of People.",
                    "NL-DHT: A Non-uniform Locality Sensitive DHT Architecture for Massively Multi-user Virtual Environment Applications.",
                    "Towards Benchmarking of Structured Peer-to-Peer Overlays for Network Virtual Environments.",
                    "CSLive: A Live Streaming Overlay with Cooperative Swarming.",
                    "GP3 - A Distributed Grid-Based Spatial Index Infrastructure for Massive Multiuser Virtual Environments.",
                    "GROUP: Dual-Overlay State Management for P2P NVE.",
                    "Textures in Second Life: Measurement and Analysis.",
                    "Peer-to-Peer Based Version Control.",
                    "Query Management in a Sensor Environment.",
                    "Enhancing the Performance of Locating Data in Chord-Based P2P Systems.",
                    "Quality of Service for Peer-to-Peer Based Networked Virtual Environments.",
                    "A Framework for Scalable Virtual Worlds Using Spatially Organized P2P Networks.",
                    "Measures for Inconsistency in Distributed Virtual Environments.",
                    "DualCast: Protocol Design of Multiple Shared Trees Based Application Layer Multicast.",
                    "Performance of a Traffic-Based Handover Method in High-Mobility Scenarios.",
                    "Efficient Broadcasting in Networks with Weighted Nodes.",
                    "CLM-TCP: TCP Congestion Control Mechanism Using Cross Layer for Wireless Mesh Networks.",
                    "Bounding Communication Energy Overhead in Parallel Networks with Power-Delay Scalability.",
                    "The Application of Mu-Law Companding to the WiMax IEEE802.16e Down-Link PUSC.",
                    "Reducing the PAPR of OFDM Using a Simplified Scrambling SLM Technique with No Explicit Side Information.",
                    "A Performance Model of Communication in the Quarc NoC."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th ICPADS 2007",
        "info": "Hsinchu, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2007",
                "sub_name": "13th International Conference on Parallel and Distributed Systems, ICPADS 2007, Hsinchu, Taiwan, December 5-7, 2007.",
                "count": 130,
                "papers": [
                    "Message from the general chair.",
                    "Message from the honorary chair.",
                    "Message from the program chair.",
                    "Evaluation and modeling of power consumption of a heterogeneous dual-core processor.",
                    "Ksensor: Multithreaded kernel-level probe for passive QoS monitoring.",
                    "Loop recreation for thread-level speculation.",
                    "Toward ubiquitous searching.",
                    "Constructing double- and triple-erasure-correcting codes with high availability using mirroring and parity approaches.",
                    "Energy-efficient anonymous multicast in mobile ad-hoc networks.",
                    "Early containment of worms using dummy addresses and connection trace back.",
                    "A QoS-aware service selection algorithm for multimedia service overlay networks.",
                    "Diameter bounds of cubelike recursive networks.",
                    "Sharing information of three-dimensional geographic locations through mobile devices.",
                    "A scalable parallelization of all-pairs shortest path algorithm for a high performance cluster environment.",
                    "Speculative and distributed simulation of many-particle collision systems.",
                    "Computation and communication schedule optimization for jobs with shared data.",
                    "Adaptive computation offloading for energy conservation on battery-powered systems.",
                    "Mining temporal mobile sequential patterns in location-based service environments.",
                    "Parallel Minimum Spanning Tree Heuristic for the steiner problem in graphs.",
                    "Improving quality-of-service of file migration policies in high-performance servers.",
                    "RAASP: Resource allocation analysis service and portal.",
                    "An FPGA implementation of a snoop cache with synchronization for a multiprocessor system-on-chip.",
                    "Optimizing Katsevich image reconstruction algorithm on multicore processors.",
                    "Communication performance of a modular high-bandwidth multiprocessor system.",
                    "Prohibition-based MAC protocols for QoS-enhanced mesh networks and high-throughput WLANs.",
                    "FairTrust: Toward secure and high performance P2P networks.",
                    "Persistence and communication state transfer in an asynchronous pipe mechanism.",
                    "Extended Prefix Hash Trees for a distributed phone book application.",
                    "Statistical trust establishment in wireless sensor networks.",
                    "Finding candidate spots for replica servers based on demand fluctuation.",
                    "On incorporating an on-line strip packing algorithm into elastic Grid reservation-based systems.",
                    "Virtual Exclusion: An architectural approach to reducing leakage energy in caches for multiprocessor systems.",
                    "Performance study of data stream approximation algorithms in wireless sensor networks.",
                    "ADENS: Efficient address determination for mobile grids.",
                    "Efficient search in file-sharing networks.",
                    "Parallel association rule mining based on FI-growth algorithm.",
                    "Data representations for mobile devices.",
                    "Network energy consumption in ad-hoc networks under different radio models.",
                    "Access point selection algorithms for maximizing throughputs in wireless LAN environment.",
                    "Using synchronized atoms to check distributed programs.",
                    "Parallel algorithms for chains and anti-chains of points on a plane.",
                    "A group-based multi-channel MAC protocol for wireless ad hoc networks.",
                    "A cooperative game theoretical replica placement technique.",
                    "On the relative value of local scheduling versus routing in parallel server systems.",
                    "Minimum-delay energy-efficient source to multisink routing in wireless sensor networks.",
                    "Novel critical-path based low-energy scheduling algorithms for heterogeneous multiprocessor real-time embedded systems.",
                    "A two-tier semantic overlay network for P2P search.",
                    "A faster closure algorithm for pattern matching in partial-order event data.",
                    "Extending GridSim with an architecture for failure detection.",
                    "A semantic overlay network for unstructured peer-to-peer protocols.",
                    "Efficient generation of stream programs from loops.",
                    "Fault-free Hamiltonian cycles in locally twisted cubes under conditional edge faults.",
                    "A dual scale heterogeneous organizational network model.",
                    "Optimization on distributed user management in Wireless Sensor Networks.",
                    "A new MAC protocol design for long-term applications in wireless sensor networks.",
                    "RTMG: Scheduling real-time distributable threads in large-scale, unreliable networks with low message overhead.",
                    "Comparative evaluation of multi-core cache occupancy strategies.",
                    "Performance analysis on mobile agent-based parallel information retrieval approaches.",
                    "Effect of number of faults on NoC power and performance.",
                    "Ants vs. faults: A swarm intelligence approach for diagnosing distributed computing networks.",
                    "Scheduling multiple divisible loads on a linear processor network.",
                    "A weighted interference estimation scheme for interface switching wireless mesh networks.",
                    "A push-based prefetching for cooperative caching RAM Grid.",
                    "Subscription-aware publish/subscribe tree construction in mobile ad hoc networks.",
                    "Stepping-stone detection algorithm based on order preserving mapping.",
                    "Privacy-preserving logical vector clocks using secure computation techniques.",
                    "LORM: Supporting low-overhead P2P-based range-query and multi-attribute resource management in grids.",
                    "Embedding cycles and paths in a k-ary n-cube.",
                    "Conditional edge-fault-tolerant Hamiltonian cycle embedding of star graphs.",
                    "A Voronoi dEtection Range Adjustment (VERA) approach for energy saving of wireless sensor networks.",
                    "The design of effective low cost embedded processor development kits for supporting take-home self-practice pedagogies.",
                    "An Embedded Systems graduate education for Singapore.",
                    "On the teaching of embedded Linux system.",
                    "Design methodology and hands-on practices for Embedded Operating Systems.",
                    "Vision-based fuzzy 8051 surveillance systems design.",
                    "SSEST: Summer school on embedded system technologies.",
                    "A curriculum design on embedded system education for first-year graduate students.",
                    "Teaching embedded systems software: The HKUST experience.",
                    "An integration platform for developing digital life applications.",
                    "Embedded education for Computer Rank Examination.",
                    "Morphisms from IEEE 802.11 DCF specifications to its EDCA QoS practice with cross-layer interface.",
                    "Teaching complete embedded systems design process with graphical system design methodologies.",
                    "SWEVM: a software EVM for embedded system programming.",
                    "From ISA to application design via RTOS - a course design framework for embedded software.",
                    "Design and analysis of a low power wireless portable media player.",
                    "Design of a dynamic distributed mobile computing environment.",
                    "An MCU description methodology for initialization code generation software.",
                    "Linux as a teaching aid for embedded systems.",
                    "Issues and challenges of embedded processor education for working professionals.",
                    "Message from APESER organization committee.",
                    "Message from P2P-NVE Program Chair.",
                    "Message from PMAC-2WN Program Co-Chairs.",
                    "Message from SRMPDS Program Chair.",
                    "Scalable networked virtual environments using unstructured overlays.",
                    "S/Kademlia: A practicable approach towards secure key-based routing.",
                    "ECHoP2P: Emergency call handling over peer-to-peer overlays.",
                    "A clustering model for memory resource sharing in large scale distributed system.",
                    "Delay sensitive identity protection in peer-to-peer online gaming environments.",
                    "Effect of unstable routing in location-aware mobile ad hoc networks on a geographic DHT protocol.",
                    "Directions for Peer-to-Peer based mobile pervasive augmented reality gaming.",
                    "P2P-based geometric computation method for extracting ROI from ubiquitous video cameras.",
                    "A comparative study on Peer-to-Peer failure rate estimation.",
                    "Peer-to-Peer AOI voice chatting for massively multiplayer online games.",
                    "A fast joining operation for highly dynamic chord system.",
                    "A forwarding model for Voronoi-based Overlay Network.",
                    "A Peer-To-Peer platform for simulating distributed virtual environments.",
                    "Secure random number agreement for peer-to-peer applications.",
                    "CAVENET: Description and analysis of a toolbox for vehicular networks simulation.",
                    "Cost evaluation on secure routing over powerlines for WMNs.",
                    "Modeling and analysis of regional registration based mobile multicast service management.",
                    "New power aware routing algorithm for MANETs using gateway node.",
                    "Lifetime analysis of the logical topology constructed by homogeneous topology control in wireless mobile networks.",
                    "Analytical modelling of communication in the rectangular mesh NoC.",
                    "Accelerating 3-D capacitance extraction in deep sub-micron VLSI design using vector/parallel computing.",
                    "Mathematical performance analysis of product networks.",
                    "Performance evaluation of dynamic probabilistic flooding under different mobility models in MANETs.",
                    "A Legal Information flow (LIF) scheduler for distributed systems.",
                    "Federated clusters using the transparent remote Execution (TREx) environment.",
                    "Scheduling algorithm for multi-item requests with time constraints in mobile computing environments.",
                    "Resource reclamation using meta-events in a real time java system.",
                    "Enhanced resource management capabilities using standardized job management and data access interfaces within UNICORE Grids.",
                    "Grid scheduling simulations with GSSIM.",
                    "Supporting deadline monotonic policy over 802.11 average service time analysis.",
                    "Comparative evaluation of the non-contiguous processor allocation strategies based on a real workload and a stochastic workload on multicomputers.",
                    "Formal verification of concurrent scheduling strategies using TLA.",
                    "Optimizing resource allocation for multiple concurrent jobs in grid environment.",
                    "A scheduling algorithm for revenue maximisation for cluster-based Internet services.",
                    "A dual-time vector clock based synchronization mechanism for key-value data in the SILENUS file system.",
                    "CrossTree: A new HTC architecture with high reliability and scalability.",
                    "Virtualization aware job schedulers for checkpoint-restart."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "12th ICPADS 2006",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2006",
                "sub_name": "12th International Conference on Parallel and Distributed Systems, ICPADS 2006, Minneapolis, Minnesota, USA, July 12-15, 2006.",
                "count": 0,
                "papers": []
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th ICPADS 2005",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2005",
                "sub_name": "11th International Conference on Parallel and Distributed Systems, ICPADS 2005, Fuduoka, Japan, July 20-22, 2005.",
                "count": 0,
                "papers": []
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th ICPADS 2004",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2004",
                "sub_name": "10th International Conference on Parallel and Distributed Systems, ICPADS 2004, Newport Beach, CA, USA, July 7-9, 2004.",
                "count": 84,
                "papers": [
                    "Taming Lambda's for Applications: The OptIPuter System Software.",
                    "Consistency-Preserving Neighbor Table Optimization for P2P Networks.",
                    "Scaling Unstructured Peer-to-Peer Networks With Multi-Tier Capacity-Aware Overlay Topologies.",
                    "Enhancing Locality in Structured Peer-to-Peer Networks.",
                    "Improving Cache Performance in Mobile Computing Networks through Dynamic Object Relocation.",
                    "State-On-Demand Execution for Adaptive Component-based Mobile Agent Systems.",
                    "Decentralized Reactive Clustering for Collaborative Processing in Sensor Networks.",
                    "Routing Permutations on Optical Baseline Networks with Node-Disjoint Paths.",
                    "Wavelength Assignment on Bounded Degree Trees of Rings.",
                    "A Fundamental Problem in Computer and Communication.",
                    "Self-tuning Speculation for Maintaining the Consistency of Client-Cached Data.",
                    "Caching Support for Push-Pull Data Dissemination using Data-Snooping Routers.",
                    "Coordinated En-Route Transcoding Caching for Tree Networks.",
                    "Optimal Parallel Block Access for Range Queries.",
                    "Hash-based Placement and Processing for Efficient Node Partitioned Query-Intensive Databases.",
                    "Parallel Implementation of WAP-Tree Mining Algorithm.",
                    "Cegor: An Adaptive Distributed File System for Heterogeneous Network Environments.",
                    "The Impact of Failure Management on the Stability of Communication Networks.",
                    "Divisible Load Scheduling on Arbitrary Distributed Networks via Virtual Routing Approach.",
                    "Peer-to-Peer Web Caching: Hype or Reality?",
                    "Adaptive Cache-Driven Request Distribution in Clustered EJB Systems.",
                    "Scheduling Distributable Real-Time Threads in Tempus Middleware.",
                    "A Novel Packet Marking Scheme for IP Traceback.",
                    "Scaling All-to-All Multicast on Fat-tree Networks.",
                    "Efficient Secure Multicast with Well-Populated Multicast Key Trees.",
                    "Group Rekeying with a Customer Perspective.",
                    "An Efficient Distributed Group Key Management Algorithm.",
                    "A Parallel Algorithm Based on Search Space Partition for Generating Concepts.",
                    "An Efficient Parallel Collision Detection Algorithm for Virtual Prototype Environments.",
                    "Optimizing Parallel Multiplication Operation for Rectangular and Transposed Matrices.",
                    "Scalable Duplication Strategy with Bounded Availability of Processors.",
                    "The Intersection of Grids and Networks: Where the Rubber Hits the Road.",
                    "Using Structured P2P Overlay Networks to Build Content Sensitive Communities.",
                    "Exploiting Network Locality in a Decentralized Read-Write Peer-to-Peer File System.",
                    "BYPASS: Topology-Aware Lookup Overlay for DHT-based P2P File Locating Services.",
                    "Analysis of the Execution of a Next Generation Application on Superscalar and Grid Processors.",
                    "Parallelization of Bayesian Network based SNPs Pattern Analysis and Performance Characterization on SMP/HT.",
                    "Resource Estimation and Task Scheduling for Multithreaded Reconfigurable Architectures.",
                    "A New Look at Egocentric Algorithms.",
                    "A Quorum-Based Extended Group Mutual Exclusion Algorithm without Unnecessary Blocking.",
                    "Rate-Based and Queue-Based Dynamic Load Balancing Algorithms in Distributed Systems.",
                    "Eliminating Replica Selection - Using Multiple Replicas to Accelerate Data Transfer on Grids.",
                    "Scalable Cooperative Latency Estimation.",
                    "Distributed Algorithms for Balanced Zone Partitioning in Content-Addressable Networks.",
                    "The Net Worth of an Object-Oriented Pattern: Practical Implications of Java RMI.",
                    "A Map-growing Localization Algorithm for Ad-hoc Wireless Sensor Networks.",
                    "Energy-Efficient Communication in Multi-Channel Single-Hop Sensor Networks.",
                    "On Providing Anonymity in Wireless Sensor Networks.",
                    "Energy-Aware, Load Balanced Routing Schemes for Sensor Networks.",
                    "A Time Interval Based Consistency Control Algorithm for Interactive Groupware Applications.",
                    "Flexible Intrusion Tolerant Group Membership Protocol.",
                    "Evaluation of a Pre-Reckoning Algorithm for Distributed Virtual Environments.",
                    "Causally Ordered Delivery for a Hierarchical Group.",
                    "The Speed of Light Isn't What it Used to Be.",
                    "How to Observe Real-World Events through a Distributed World Model.",
                    "A Framework to Support Adaptation Decisions for Dynamic Distributed Systems.",
                    "Role Ordering Scheduler for Concurrency Control in Distributed Objects.",
                    "Admission Control Algorithms Integrated with Pricing for Revenue Optimization with QoS Guarantees in Mobile Wireless Networks.",
                    "Performance Analysis of Location-Based Data Consistency Algorithms in Mobile Ad Hoc Networks.",
                    "ABSTRACT: Many Applications of Mobile Ad Hoc.",
                    "Performance of Work Conserving Schedulers and Scheduling of Some Synchronous Dataflow Graphs.",
                    "A Framework for Profiling Multiprocessor Memory Performance.",
                    "An Adaptive Scheme for Vertical Handoff in Wireless Overlay Networks.",
                    "Distributed and Dynamic Voronoi Overlays for Coverage Detection and Distributed Hash Tables in Ad-Hoc Networks.",
                    "Analysis of an Energy Efficient Optimistic TMR Scheme.",
                    "One-Staged Wormhole Routing for Irregular Faulty Patterns in Meshes.",
                    "A Probabilistic Approach to Fault-Tolerant Routing Algorithm on Mesh Networks.",
                    "Load Balancing of DNS-Based Distributed Web Server Systems with Page Caching.",
                    "LASH-TOR: A Generic Transition-Oriented Routing Algorithm.",
                    "Performance Improvement of Congestion Avoidance Mechanism for TCP Vegas.",
                    "ICPADS 2004 QoS and Dynamic Systems Workshop.",
                    "Preface: ICPADS 2004 QoS and Dynamic Systems Workshop.",
                    "Efficient Scheduling Heuristics for GridRPC Systems.",
                    "Sporadic Communication Protocol between Clusters of Mobile Computers.",
                    "A Performance-Optimizing Scheduling Technique for Mesh-Connected Multicomputers Based on Real-Time Job Size Distribution.",
                    "Wireless Support for Telemedicine in Disaster Management.",
                    "Challenges: Wireless Web Services.",
                    "On Using Reputations in Ad hoc Networks to Counter Malicious Nodes.",
                    "Loosely-Coupled, Mobile Replication of Objects with Transactions.",
                    "An Application using Pinwheel Scheduling Model.",
                    "PSS: A Novel Statement Scheduling Mechanism for a High-Performance SoC Architecture.",
                    "Load-Balanced Anycast Routing.",
                    "Time-Optimal Network Queue Control: The Case of Multiple Congested Nodes.",
                    "A Congestion-Relieving Mechanism for Wormhole-Routed Networks with Real-Time Injection Control."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th ICPADS 2002",
        "info": "Taiwan, ROC",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2002",
                "sub_name": "9th International Conference on Parallel and Distributed Systems, ICPADS 2002, Taiwan, ROC, December 17-20, 2002.",
                "count": 98,
                "papers": [
                    "Cycle Embedding in a Faulty Hypercube.",
                    "TCN: Scalable Hierarchical Hypercubes.",
                    "Dual-Hamiltonian-Path-Based Multicasting on Wormhole-Routed Star Graph Interconnection Networks.",
                    "Hamiltonian laceability on edge fault star graph.",
                    "Fault-Tolerant Broadcasting in Hypercubes via Local Safety Information.",
                    "A Novel Neighbourhood Broadcasting Algorithm on Star Graphs.",
                    "Time-Optimal Parallel Algorithms for Constructing Optimal Virtual Cellular Networks.",
                    "A Scalable Core Migration Protocol for Dynamic Multicast Tree.",
                    "Scalability and Reliability in a Distributed Search Engine.",
                    "Coordinating Multi-Agents using JavaSpaces.",
                    "Editing Any Version at Any Time: a consistency maintenance mechanism in Internet-based collaborative environments.",
                    "Modeling for an Integration of Distributed Business Information Using EPEM.",
                    "Organization of Shared Memory with Synchronization for Multiprocessor-on-a-chip.",
                    "A Multi-locking Mechanism on Shared Object DSM.",
                    "Synchronous/Asynchronous Switch for a Dynamic Choice of Communication Model in Distributed Systems.",
                    "Analysis of System Performance by Changing the Ring Architecture on the Dual Ring CC-NUMA System.",
                    "Group Mutual Exclusion In Tree Networks.",
                    "Efficient Parallel Algorithms for the r-Dominating Set and p-Center Problems on Trees.",
                    "Parallel Algorithms for the Medial Axis Transform on Linear Arrays with a Reconfigurable Pipelined Bus System.",
                    "Adaptive Matrix Multiplication in Heterogeneous Environments.",
                    "A Strategy for Semantic Integrity Checking in Distributed Databases.",
                    "Distributed Heterogeneous Inspecting System and Its Middleware-based Solution.",
                    "Effective Skew Handling for Parallel Sorting in Multiprocessor Database Systems.",
                    "An Agent-Based Approach to Enforcing Fairness in Peer-to-Peer Distributed File Systems.",
                    "Holoparadigm: a Multiparadigm Model Oriented to Development of Distributed Systems.",
                    "Two-Layered Protocol for a Large-Scale Group of Processes.",
                    "Mobile Agents for Distributed Logic Programming.",
                    "Hardware-based IP Routing Lookup with Incremental Update.",
                    "Experiences in Building a Scalable Distributed Network Emulation System.",
                    "Normality versus system mobility.",
                    "A Scalable Broadcast Algorithm for Multiport Meshes with Minimum Communication Steps.",
                    "An Incremental Network Topology for Contention-free and Deadlock-free Routing.",
                    "Self-Organization for Cache Servers in Active Networks.",
                    "An Improved Algorithm for Finding k-centrums on Weighted Trees.",
                    "A Parallel Implementation of GESPP on a Cluster of Silicon Graphics Workstations.",
                    "Reach Reliable Decision by Using Secret Agreement Method.",
                    "Evaluating the Speedup of a MPI-based Distributed Dispersion Simulator for Ground Water Systems.",
                    "Accelerate the Calculation of NURBS curves and surfaces Based on Parallel Architecture.",
                    "Architectural Level support for Dynamic Reconfiguration and Fault Tolerance in Component-Based Distributed Software.",
                    "Distributed Parallel Metaheuristics based on GRASP and VNS for Solving the Traveling Purchaser Problem.",
                    "The Impact of RTS Threshold on IEEE 802.11 MAC Protocol.",
                    "Initialization Protocols for IEEE 802.11-Based Ad Hoc Networks.",
                    "A New Scheme for Improving Performance of TCP over Network including Wireless Links.",
                    "A Mobile Cache Consistency Protocol Using Shareable Read/Write Time Locks.",
                    "Approaches to Balancing Data Load of Shared-Nothing Clusters and Their Performance Comparison.",
                    "CoStore: A Storage Cluster Architecture Using Network Attached Storage Devices.",
                    "Performance Evaluation of Software RAID vs. Hardware RAID for Parallel Virtual File System.",
                    "Reliable Message Delivery for Mobile Agents: Push or Pull.",
                    "Evaluation of A Programmable Cluster-Based IP Router.",
                    "Performance Guarantee for Cluster-Based Internet Services.",
                    "An Efficient Real-time Scheduler for Nested Transaction Models.",
                    "Power-Aware Resource Allocation for Independent Tasks in Heterogeneous Real-Time Systems.",
                    "A General Resource Management Framework for Real-Time Operating Systems.",
                    "Distributed Real-Time System Design using CBS-based End-to-end Scheduling.",
                    "Scheduling Video Stream Transmissions for Distributed Playback over Mobile Cellular Networks.",
                    "A Data Broadcast Scheme Based on Prediction for The Wireless Environment.",
                    "Cell-Based Positioning Method for Wireless Networks.",
                    "Flexible Packet Scheduling for Quality of Service Provisioning in Wireless Networks.",
                    "Slice-and-Patch - An Algorithm to Support VBR Video Streaming in a Multicast-based Video-on-Demand System.",
                    "The MPEG-4 Streaming Player Using Adaptive Decoding Time Stamp Synchronization.",
                    "Cooperative Proxy Scheme for Large-Scale VoD Systems.",
                    "Adaptive Live Broadcasting for Highly-Demanded Videos.",
                    "An Efficient Optimization Technique for Task Matching and Scheduling in Heterogeneous Computing Systems.",
                    "Self-Stabilizing Wormhole Routing on Ring Networks.",
                    "A Mobile-Agent based Distributed Dynamic [mu]Firewall Architecture.",
                    "Toward an Improved RBAC Model for the Organic Organization.",
                    "An Energy-Efficient Diagonal-Based Directed Diffusion for Wireless Sensor Networks.",
                    "Performance Evaluation of Distributed Computing Paradigms in Mobile Ad Hoc Sensor Networks.",
                    "Cache Cooperation for Clustered Disconnected Computers.",
                    "A Channel Allocation Algorithm for large scale cellular networks.",
                    "Stability Aware Cluster Routing Protocol for mobile Ad-Hoc Networks.",
                    "On the Fault-Tolerant Pancyclicity of Crossed Cubes.",
                    "Design and Analysis of a Fault-Tolerant Mechanism for a Server-Less Video-On-Demand System.",
                    "Tensor Product Modeling of Fault Tolerant Multiprocessor Architectures.",
                    "Robust TCP Connections for Fault Tolerant Computing.",
                    "A New Probabilistic Approach for Fault-Tolerant Routing in k-Ary n-Cubes.",
                    "An Approach to Exploiting Skewed Associative Memories in Avionics Systems.",
                    "Gantt Chart Visualization for MPI and Apache Multi-Dimensional Trace Files.",
                    "Evaluating and Improving Performance of Multimedia Applications on Simultaneous Multi-Threading.",
                    "Communication Pattern Based Methodology for Performance Analysis of Termination Detection Schemes.",
                    "Performance Evaluation of Router Switching Fabrics.",
                    "Concurrency Control in XML Document Databases: XPath Locking Protocol.",
                    "Sago: A Network Resource Management System for Real-Time Content Distribution.",
                    "Dynamic Scheduling of Web Server Cluster.",
                    "A Parallel Divide-and-Conquer Scheme for Delaunay Triangulation.",
                    "Achieving High Efficient Byzantine Agreement with Dual Components Failure Mode on a Multicasting Network.",
                    "A Spread Neural Network with Fuzzy Clustering Technique Applied to Color Image Coding in the MDT Domain.",
                    "Pancyclicity of Möbius cubes.",
                    "A Speed-Adaptive Location Management Scheme.",
                    "Job Scheduling Policy for High Throughput Computing Environments.",
                    "A Fast Branch-and-Bound Algorithm with an Improved Lower Bound for Solving the Multiprocessor Scheduling Problem.",
                    "Three remedied algorithms for Advanced Waiting Time Scheduler.",
                    "An Efficient Load Balancing Strategy for Scalable WAP Gateways.",
                    "Providing Mobile LAN Access Capability for Bluetooth Devices.",
                    "Consistent LBS Solution in Next Generations of Mobile Internet.",
                    "Module Filtering Preprocessing for Module Assignment Problems in Pipelined Computing.",
                    "Safe and Complete Distributed Garbage Collection with The Train Algorithm.",
                    "The Analysis and Optimization of Collective Communications on a Beowulf Cluster."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th ICPADS 2001",
        "info": "KyongJu City, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2001",
                "sub_name": "Eigth International Conference on Parallel and Distributed Systems, ICPADS 2001, KyongJu City, Korea, June 26-29, 2001.",
                "count": 105,
                "papers": [
                    "Efficient Implementation of Edmond's Algorithm for Finding Optimum Branchings on Associative Parallel Processors.",
                    "An Optimal Scheduling Algorithm Based on Task Duplication.",
                    "Adaptive Parallel Distributive Join Algorithm for Skewed Data.",
                    "Parallel Skeletons for Tabu Search Method.",
                    "A Scalable yet Transparent Infrastructure for Distributed Applications: Core Design of Jasmine ii Framework.",
                    "Replication for a Distributed Multimedia System.",
                    "Network Membership: A Partition Model for Reliable Mobile Communication.",
                    "An Efficient Recovery Scheme for Mobile Computing Environments.",
                    "Optimistic Transaction Processing Algorithms in Pure-Push and Adaptive Broadcast Environments.",
                    "Improving the Performance of Broadcasting in Ad Hoc Wireless Networks.",
                    "A Dynamic Grouping Scheduling for Heterogeneous Internet-Centric Metacomputing System.",
                    "An Efficient Adaptive Broadcast Algorithm for the Mesh Network.",
                    "Optimal Parallel Algorithms for Cut Vertices, Bridges, and Hamiltonian Path in Bounded Interval Tolerance Graphs.",
                    "Ring Embedding in Faulty (n, k)-Star Graphs.",
                    "Optional Instant Locking in Distributed Collaborative Graphics Editing Systems.",
                    "Optimization of Nested Invocation on Replicas in Object-Based Systems.",
                    "A Distributed Consistent Global Checkpoint Algorithm for Distributed Mobile Systems.",
                    "A Fuzzy Multicast Method Providing Linguistic Guarantee of Disruption Free Service in Mobile Wireless Networks.",
                    "Mobile IP Network Supporting Private IP Addresses Utilizing Regional Registration and NAT Function.",
                    "Seamless Mobile Transaction Processing: Models, Protocols and Software Tools.",
                    "Performance of Parallel I/O Scheduling Strategies on a Network of Workstations.",
                    "Communication-Efficient Bitonic Sort on a Distributed Memory Parallel Computer.",
                    "Accelerating the Continuous Data in a SCI-Based Multimedia System.",
                    "Performance and Scalability Analysis on Client-Server Workflow Architecture.",
                    "A Comprehensive Investigation of Distribution in the Context of Workflow Management.",
                    "Development and Implementation of an Operation Efficiency Management System Using the UPH According to Operation Start Time.",
                    "A Secure Transaction Environment for Workflows in Distributed Systems.",
                    "Enhancement of the CBT Multicast Routing Protocol.",
                    "A Push-Based Key Distribution and Rekeying Protocol for Secure Multicasting.",
                    "SIMMT-II: Implementation of Network Simulator for IP Multicast Using Mutiple MCSs on the ATM Networks.",
                    "An Efficient Multicast Routing Protocol for Mobile Hosts.",
                    "A Scheduling Mechanism for Lock-Free Operation of a Lightweight Process Library for SMP Computers.",
                    "A Reliable Processor-Allocation Strategy for Mesh-Connected Parallel Systems.",
                    "Optimal Data Reduction on Reconfigurable Tori.",
                    "Geometric Scheduling of 2-D Uniform Dependence Loops.",
                    "Parallel Loop Transformation Technique for Efficient Rate Detection.",
                    "Improving Workload Balance and Code Optimization in Processor-in-Memory Systems.",
                    "Dynamic Load-Balancing in a Data Parallel Object-Oriented System.",
                    "An Efficient Cache Invalidation Scheme for Mobile Wireless Environments.",
                    "A Distributed Location Management Scheme for Mobile Hosts.",
                    "AMRB: Toward Location and Migration Transparency of Services.",
                    "Fault-Tolerant Routing and Disjoint Paths in Dual-Cube: A New Interconnection Network.",
                    "Multiphase Minimal Fault-Tolerant Wormhole Routing in 2D Meshes.",
                    "An Extended Fault-Tolerant Link-State Routing Protocol in the Internet.",
                    "Parallel Routing in Hypercube Networks with Faulty Nodes.",
                    "Fault Diameter and Fault Tolerance of HCN(n, n).",
                    "Causal Precedent Relations among Messages in Object-Based Systems.",
                    "Information Flow Control in Role-Based Model for Distributed Objects.",
                    "CORBA Wrapping of Legacy Scientific Applications Using Remote Variable Scheme.",
                    "Optimisation of the Performance of Neural Network Based Pattern Recognition Classifiers with Distributed Systems.",
                    "RSA-Based Partially Blind Signature with Low Computation.",
                    "Avoiding Faulty Privileges in Self-Stabilizing Depth-First Token Passing.",
                    "Path Selection Algorithms for Real-Time Communication.",
                    "Evaluation of Emerging High Speed Networks on Brazos Software DSM System.",
                    "An Active Scheduler: Autonomous Concurrency Control of Parallel Programs in a Distributed Environment.",
                    "Parallel and Distributed Mining with Ensemble Self-Generating Neural Networks.",
                    "Development of Artificial Life Based Optimization System.",
                    "Parallel and Distributed Multi-Agent Reinforcement Learning.",
                    "A Distributed Implementation of Structured Gamma.",
                    "Specializing the Java Object Serialization Using Partial Evaluation for a Faster RMI.",
                    "Alias Analysis for Java with Reference-Set Representation.",
                    "Jato: A Compact Binary File Format for Java Class.",
                    "Design and Implementation of a Fibre Channel Network Driver for SAN-Attached RAID Controllers.",
                    "On the Switch Architecture for Fibre Channel Storage Area Networks.",
                    "Metadata Management of the SANtopia File System.",
                    "Volume Management in SAN Environment.",
                    "Analysis of Deterministic Routing in k-Ary n-Cubes with Virtual Channels.",
                    "On Some Properties of k-Ary n-Cubes.",
                    "Combinatorial Properties of Hierarchical Cubic Networks.",
                    "Embedding amgong HCN(n, n), HFN(n, n) and Hypercube.",
                    "A Cost-Based Admission Control Algorithm for Handling Mixed Workloads in Multimedia Server Systems.",
                    "Schemes for Utilizing Efficiently Disk Bandwidth and Buffer in Video Server.",
                    "A Multicast Delivery Scheme for VCR Operations in a Large VOD System.",
                    "A Server Framework for Scheduling Multimedia Applications in Open System Environment.",
                    "Ethernet Wrapper: Extension of the TCP Wrapper.",
                    "Improving the Performance of TCP Vegas in a Heterogeneous Environment.",
                    "Tightening of Cell Discarding Method in RED for Improving TCP over ATM Network.",
                    "A Fast Table Update Scheme for High-Performance IP Forwarding.",
                    "Multicasts on WDM All-Optical Multistage Interconnection Networks.",
                    "An Alternate Dimension-Order Collective Communications Scheme on Packet-Switched 2D-Mesh Network.",
                    "Recursive Construction of Hierarchical Fibonacci Cubes and Hierarchical Extended Fibonacci Cubes.",
                    "Algebraic Expression for Extra Degree Added to Hypercube Interconnection Network in Case of Multiple Edge-Faults.",
                    "QoS-Based Method for Compensating Multimedia Objects.",
                    "Dynamic Voltage Scaling on MPEG Decoding.",
                    "FRD-FPRED: A Novel Re-Decode Based Error Compensation Method Using Fast Re-Decoding and Fast Prediction Algorithm.",
                    "Selecting an Audio Redundancy Codec Combination for Error Control in Internet Telephony.",
                    "Dynamic Update of Aggregated Routing Information for Hierarchical QoS Routing in ATM Networks.",
                    "QoS Streaming Based on Media Filtering System.",
                    "Unfairness of Measurement-Based Admission Controls in a Heterogeneous Environment.",
                    "An Efficient Buffer Control and Packet Scheduling for the Acces Point of IP Networks and ATM Network.",
                    "An Agent-Based Distributed Service Model for Nomadic Users.",
                    "Collaborative and Secure Resource Management with Distributed Agents.",
                    "I-DOCS: Distributed Agent-Assisted Knowledge Fusion for Disease Gene Discovery.",
                    "A Migration Strategy of Mobile Agent.",
                    "BClassifier: A Personal Agent for Bookmark Classification.",
                    "The Parallel Processing of Spatial Selection for Very Large Geo-Spatial Databases.",
                    "Cost-Based Transaction Coordinator Algorithm Implemented at Persistent Distributed Shared Virtual Memory.",
                    "Mapping Strategies for Switch-Based Cluster Systems of Irregular Topology.",
                    "An Efficient Implementation of Virtual Interface Architecture using Adaptive Transfer Mechanism on Myrinet.",
                    "Multicast-Based Distributed LVS (MD-LVS) for Improving Scalability and Availability.",
                    "A Proxy Server Management Scheme for Continuous Media Objects Based on Object Partitioning.",
                    "An Improved Packet Pair Method for Filtering Estimation Noise and Fast Convergence in Measuring Bottleneck Bandwidth.",
                    "Implementing Web Access Control System for the Multiple Web Servers in the Same Domain Using RBAC Concept.",
                    "An Adaptive and Dynamic Timer Design to Maintain Soft State in RSVP.",
                    "Least Popularity-per-Byte Replacement Algorithm for a Proxy Cache."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th ICPADS 2000",
        "info": "Iwate, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/2000",
                "sub_name": "Seventh International Conference on Parallel and Distributed Systems, ICPADS 2000, Iwate, Japan, July 4-7, 2000.",
                "count": 65,
                "papers": [
                    "Network Computing Technology and Information Society toward 21st Century.",
                    "Object-Oriented Real-Time Distributed Programming and Support Middleware.",
                    "A New Scheme for Sharing Secret Color Images in Computer Network.",
                    "Improved and Extended Scalable Image Coding by Spline Approximation for a Binary, Gray-Scale and Color Image.",
                    "A Synchronization and Flow Control Scheme for Interactive Multimedia-on-Demand (MOD) Systems.",
                    "An Efficient Strategy to Support Continuous Retrieval with Dynamic Bandwidths.",
                    "Group Protocol for Quorum-Based Replication.",
                    "Implementation Techniques and an Object Group Service for CORBA-Based Applications in the Field of Parallel Processing.",
                    "A Distributed Solution for Resources Allocation to Overlapping Groups.",
                    "An Estelle-Based Probabilistic Partial Timed Protocol Verification System.",
                    "System Requirements and Formal Specifications of Hierarchical Reactive Systems.",
                    "Load Balancing with Multiple Token Policy.",
                    "Environment for Performing Collaborative Distributed Virtual Environments with QoS.",
                    "Flexible Multimedia System Architecture with Adaptive QoS Guarantee Functions.",
                    "Dynamic Window-Based Traffic-Smoothing for Optimal Delivery of Online VBR Media Streams.",
                    "Checkpointing Protocol for Object-Based Systems.",
                    "A Communication-Induced Checkpointing Algorithm Using Virtual Checkpoint on Distributed Systems.",
                    "Formal Modeling and Analysis of Atomic Commitment Protocols.",
                    "Efficient Query Result Retrieval over the Web.",
                    "Reducing Cognitive Overheads in a Web Warehouse Using Reverse-Osmosis.",
                    "A Competence-Based Scheduling Method for Web Computing.",
                    "ORION: An Adaptive Home-Based Software Distributed Shared Memory System.",
                    "Reducing Cache Conflicts by Multi-Level Cache Partitioning and Array Elements Mapping.",
                    "Pilgrim Performance over a New CAliF Communication Layer.",
                    "Multi-Node Broadcasting in an Arrangement Graph Using Multiple Spanning Trees.",
                    "Does Multicast Communication Make Sense in Write Invalidation Traffic?",
                    "Optimal All-to-All Personalized Exchange in Multistage Networks.",
                    "Java 2 Distributed Object Models Performance Analysis, Comparison and Optimization.",
                    "Performance Analysis of k-Ary n-Cubes with Fully Adaptive Routing.",
                    "A Fault-Tolerant Adaptive and Minimal Routing Approach in 3-D Meshes.",
                    "Optimal Fault-Tolerant Routing in Hypercubes Using Extended Safety Vectors.",
                    "Recover-X: An Adaptive Router with Limited Escape Channels.",
                    "Circumventing/Identifying Faults Effects.",
                    "Reaching Fault Diagnosis Agreement on Dual Link Failure Mode.",
                    "An Algorithm for Distributed Hierarchical Diagnosis of Dynamic Fault and Repair Events.",
                    "Fault-Free Hamiltonian Cycles in Faulty Butterfly Graphs.",
                    "The Net Disk Architecture for Dynamic Load Balancing among Disk Arrays.",
                    "Multimedia Real-Time Disk Scheduling by Hybrid Local/Global Seek-Optimizing Approaches.",
                    "Improving Performance of Parallel Transaction Processing Systems by Balancing Data Load on Line.",
                    "An Efficient Algorithm for Processing Distributed Queries Using Partition Dependency.",
                    "Software Interoperability of Telemedicine Systems: A CSCW Perspective.",
                    "Awareness Modeling and Its Application in Cooperative Network Management.",
                    "An Optimized Dependence Convex Hull Partitioning Technique to Maximize Parallelism of Nested Loops with Non-Uniform Dependences.",
                    "Some Space Considerations of VLSI Systolic Array Mappings.",
                    "The Specification and Implementation of a Virtual University Software System.",
                    "A Stateless QoS Signaling Protocol for the Internet.",
                    "A New Paradigm of User Intention Preservation in Realtime Collaborative Editing Systems.",
                    "Cooperative Workflows to Coordinate Asynchronous Cooperative Applications in a Simple Way.",
                    "Projecting the Performance of Decision Support Workloads on Systems with Smart Storage (SmartSTOR).",
                    "Performance Evaluation of Location Information Distribution Strategies for Mobility Tracking.",
                    "Some Mechanisms to Improve TCP/IP Performance over Wireless and Mobile Computing Environment.",
                    "A Mobile Agent-Based Active Network Architecture.",
                    "An Associative Parallel Algorithm for Finding a Critical Cycle in Directed Graphs.",
                    "Electoral Voting Protocol - A Quorum-Based Approach for Replica Control.",
                    "A Practical Nonblocking Queue Algorithm Using Compare-and-Swap.",
                    "Management of Environments in 2K.",
                    "Frequency-Based Selective Caching Strategy in a Continuous Media Server.",
                    "Fast & Cost Effective Cache Invalidation in DSM.",
                    "Web Operation Recorder and Player.",
                    "The Design and Implementation of a WWW Traffic Generator.",
                    "eBroker: An Agent-Based Query Routing System for Distributed E-Commerce Databases.",
                    "Software Agent-Mediated Confidential Information Gathering System.",
                    "Parallel Spatial Joins Using Grid Files.",
                    "Performance Evaluation of Nested-Loop Join Processing on Networks of Workstations.",
                    "Dynamic Multicast Routing in Advance Resource Reservation Environment."
                ]
            },
            {
                "sub_name_abbr": "conf/icpads/2000w",
                "sub_name": "Seventh International Conference on Parallel and Distributed Systems Workshops, ICPADS 2000 Workshops, Iwate, Japan, July 4-7, 2000.",
                "count": 82,
                "papers": [
                    "A new list scheduling method based on structural properties of task graphs.",
                    "A new model of exploiting loop parallelization using knowledge-based techniques.",
                    "Network based genetic algorithm.",
                    "A memory management architecture for a mobile computing environment.",
                    "Domination in bounded interval tolerance graphs.",
                    "A constant queue partial permutation routing algorithm for cube-connected-cycles multicomputer systems.",
                    "QoS-based recovery of multimedia objects.",
                    "Packet loss detection scheme for retransmission-based real-time data transfer.",
                    "A totally ordered and secure multicast protocol for distributed virtual environment.",
                    "The performance comparison between TCP Reno and TCP Vegas.",
                    "Access control model in object-oriented systems.",
                    "Concurrent exception handling in a distributed object-oriented computing environment.",
                    "A generalized approach for transferring data-types with arbitrary communication libraries.",
                    "MEDEA-a model for the event-based data exchange architecture.",
                    "Performance analysis of two rate punctured convolutional code scheme for wireless ATM networks.",
                    "A hierarchical model of mobile agents and its multimedia applications.",
                    "A modeling method and evaluation of divided-loop networks.",
                    "An efficient color-spatial indexing and retrieval scheme for image database.",
                    "Computing watermarks from images using quadtrees.",
                    "A new method of facial action extraction and expression recognition of person without language.",
                    "A multimedia training environment that assists users to study jewel programs.",
                    "An idea of the agent-based information recommending system using the statistical information.",
                    "A case study on construction of groupware: Yuitori network for health, welfare and medical works on home care.",
                    "A speedup comparative study: three third generation DSM systems.",
                    "A case study on participatory redesign of web site with scenario-based techniques.",
                    "Natural language programming for multimedia information.",
                    "Determining WWW user agents from server access log.",
                    "Visual simulation of crack pattern based on 3D surface cellular automaton.",
                    "Visual simulation of snowfall, snow cover and snowmelt.",
                    "Error visualization of tetrahedral subdivision approach for trilinear interpolation.",
                    "Visualization of vortical flow using multiple slices.",
                    "Origami modeling method of leaves of plants and CG image generation of flower arrangement.",
                    "An application oriented humanoid animation system based on VRML.",
                    "Process division in haptic display system.",
                    "Traditional Japanese crafting presentation system based on VR and Kansei information processing techniques.",
                    "Guaranteeing multiple QoSs in differentiated services Internet.",
                    "Packet scheduling in a combined input and output queued switch using virtual time reference system.",
                    "Generalizing RSVP's traffic and policy control interface.",
                    "Pricing and fee sharing for point to multipoint and quality guaranteed multicast services.",
                    "Transparent management of replicated WWW document clusters.",
                    "A framework to support alternative paths to provide the better end-to-end performance on the Internet.",
                    "Theoretic framework of network feedback control with long delays.",
                    "LC-RTP (loss collection RTP): reliability for video caching in the Internet.",
                    "A world wide supermarket scheme using rights trading system.",
                    "An advanced Internet XML/EDI model based on secure XML documents.",
                    "Privacy enhanced access control by SPKI.",
                    "Distributed auction servers resolving winner and winning bid without revealing privacy of bids.",
                    "A proposal on FlexibleCUG service architecture.",
                    "Tracking frequent traversal areas in a Web site via log analysis.",
                    "\"Web-CALL\": a language learning support system using Internet.",
                    "An adaptive object storage system for mobile computers.",
                    "A study on a road-vehicle communication system for the future intelligent transport systems.",
                    "A presetting location strategy for personal communication using hierarchical location database.",
                    "A method of multi-PERT system for parallel jobshop management.",
                    "A new strategic enterprise information model based on super parallel evolution computing.",
                    "The effect of average parallelism and CPU-I/O overlap on application speedup.",
                    "ADDROL: a method for on-line reorganization in a multisystem DBMS with shared disks.",
                    "Metadata representation in XML for Internet-based electronic XML application from business to government.",
                    "Internet-Marks: the secure seal for WWW site authentication.",
                    "An agent-based system for electronic commerce using recipes.",
                    "A bulk scanning method for uncared-for processes on classroom UNIX workstations.",
                    "A hardware/software co-design method of ITS image processing development.",
                    "MAC level access protocol for continuous media applications on hybrid-fiber-coax (HFC) networks.",
                    "ISDN-based interactive distance learning between Japanese and German elementary schools.",
                    "KODAMA: as a distributed multi-agent system.",
                    "A platform for making network community support systems in a cooperative distributed architecture.",
                    "Reusable software components based on an agent model.",
                    "A minimal infrastructure shell for supporting cooperative agents in heterogeneous distributed environments.",
                    "Open distributed autonomous multi-agent coordination on the Web.",
                    "Communication mechanism of loose coupled agents in FAMES.",
                    "Flexible Network Layer in dynamic networking architecture.",
                    "Customizable software retrieval facility for mobile computers using agents.",
                    "Teleoperation system for real world robots-adaptive robot navigation based on sensor fusion.",
                    "Can industrial robots be connected with each other? Open and networked industrial robots.",
                    "Agent-based grocery shopping system based on user's preference.",
                    "Relational Petri nets with start/stop place.",
                    "Heuristic techniques: scheduling partially ordered tasks in a multi-processor environment with tabu search and genetic algorithms.",
                    "Fault tolerant shared-object management system with dynamic replication control strategy.",
                    "Influence of the dynamic page aggregation on the speedup of Nautilus DSM system.",
                    "Estimating the parallel performance of IQMR method for unsymmetric large and sparse linear systems.",
                    "An efficient parallel algorithm for high resolution color image reconstruction.",
                    "Proceedings 13th Brazilian Symposium on Computer Graphics and Image Processing (Cat. No.PR00878)."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "ICPADS 1998",
        "info": "Tainan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/1998",
                "sub_name": "International Conference on Parallel and Distributed Systems, ICPADS '98, Tainan, Taiwan, December 14-16, 1998.",
                "count": 100,
                "papers": [
                    "Self-Synchronized Vector Transfer for High Speed Parallel Systems.",
                    "PANDA: Ring-Based Multiprocessor System Using New Snooping Protocol.",
                    "A Programmable Digital Neuro-Processor Design with Dynamically Reconfigurable Pipeline/Parallel Architecture.",
                    "A Program-Driven Parallel Machine Simulation Environment.",
                    "Design and Performance Evaluation of an Adaptive Cache Coherence Protocol.",
                    "Design, Implementation, and Evaluation of a Parallel Index Server for Shape Image Database.",
                    "Data Duplication and Consistency in a Mobile, Multidatabase Environment.",
                    "On Reconfiguring Query Execution Plans in Distributed Object-Relational DBMS.",
                    "A Certification Protocol with Low Space Overhead.",
                    "Hierarchical Commitment Algorithm for Permanent Time Stamp Ordering.",
                    "Implementation and Evaluation of the Parallel Mesa Library.",
                    "Computing Multidimensional Aggregates in Parallel.",
                    "The Distributed Program Reliability Analysis on Star Topologies.",
                    "Parallel Neural Learning by Iteratively Adjusting Error Thresholds.",
                    "Real-Time Gang Schedulings with Workload Models for Parallel Computers.",
                    "An Efficient Incremental Algorithm for Identifying Consistent Checkpoints.",
                    "The XBW Model for Dependable Real-Time Systems.",
                    "A Causal Logging Scheme for Lazy Release Consistent Distributed Shared Memory Systems.",
                    "Object Replication Using Version Vector.",
                    "On Termination Detection Protocols in a Mobile Distributed Computing Environment.",
                    "A New Replication Strategy for Unforeseeable Disconnection under Agent-Based Mobile Computing System.",
                    "Design and Implementation of a Copy Update Mechanism on a Mobile Information Announcement System.",
                    "One-Phase Commit: Does it make Sense?",
                    "Shrinking Timestamp Sizes of Event Ordering Protocols.",
                    "Detecting the First Races in Parallel Programs with Ordered Synchronization.",
                    "A Scheme for High-Performance Data Delivery in the Web Environment.",
                    "Web-Enabling Legacy Applications.",
                    "Dynamic Management of URL Based on Object-Oriented Paradigm.",
                    "A Distributed Multicast Routing Algorithm for Delay-Sensitive Applications.",
                    "Fault Tolerant All-to-All Broadcast in General Interconnection Networks.",
                    "A General Broadcasting Scheme for Recursive Networks with Complete Connection.",
                    "Modeling the Static and Dynamic Guard Channel Schemes for Mobile Transactions.",
                    "Agent-Based Forwarding Strategies for Reducing Location Management Cost in Mobile Networks.",
                    "A Model of Mobile Agent Services Enhanced for Resource Restrictions and Security.",
                    "Significant Message Precedence in Object-Based Systems.",
                    "Fast Mutual Exclusion Algorithms Using Read-Modify-Write and Atomic Read/Write Registers.",
                    "A Comparison of Two Torus-Based K-Coteries.",
                    "Interval Algebra for Spatio-Temporal Composition of Distributed Multimedia Objects.",
                    "An Efficient Multi-Sampling Strategy for Interactive Display in a Video- on-Demand Server.",
                    "Flexible Distributed Systems for Multimedia Applications.",
                    "Broadcasting on Wormhole-Routed 2D Tori with Arbitrary Size.",
                    "An Optimal Routing Scheme for Multiple Broadcast.",
                    "Path-Based Multicast Communication in Wormhole-Routed Star Graph Multicomputers.",
                    "Congestion-Free Embedding of Multiple Spanning Trees in an Arrangement Graph.",
                    "Adaptive and Fault-Tolerant Routing with 100% Node Utilization for Mesh Multicomputer.",
                    "A Cost and Performance Comparison for Wormhole Routers based on HDL Designs.",
                    "Christmas Tree: A 1-Fault-Tolerant Network for Token Rings.",
                    "An Intelligent Policing-Routing Mechanism Based on Fuzzy Logic and Genetic Algorithms.",
                    "Traffic Management for Wireless ATM Networks.",
                    "Comparative Evaluation of Adaptive Stochastic and ERICA Switch Algorithms for ABR Traffic Management in ATM Networks.",
                    "Design of Reservation Mechanism Based on the Slotted Ring Network.",
                    "Cluster Queue Structure for Shared-Memory Multiprocessor Systems.",
                    "Symbolic Partitioning and Scheduling of Parameterized Task Graphs.",
                    "On the Stability of a Distributed Dynamic Load Balancing Algorithm.",
                    "Allocation Time-Based Processor Allocation Scheme for 2D Mesh Architecture.",
                    "Electronic Exchange Check System on the Internet.",
                    "Design of a System to Support Security Communication between a Web Proxy and a CGI Program Based on PKI.",
                    "A Share Assignment Method to Maximize the Probability of Secret Sharing Reconstruction under the Internet.",
                    "Secure and Scalable Inter-Domain Group Key Management for N-to-N Multicast.",
                    "Decoding Unit with High Issue Rate for X86 Superscalar Microprocessors.",
                    "An X86 Load/Store Unit with Aggressive Scheduling of Load/Store Operations.",
                    "Look-Ahead Memory Consistency Model.",
                    "Effective Mechanisms to Reduce the Overhead of Migratory Sharing for Linked-Based Cache Coherence Protocols in Clustering Multiprocessor Architecture.",
                    "Performance Evaluation of Cache Depot on CC-NUMA Multiprocessors.",
                    "A News on Demand Service System based on Robot Agent.",
                    "Distributed Inter-AS Route Monitor - Distributed Internet Route Eye (DIRE).",
                    "Hybrid Prefetching for WWW Proxy Servers.",
                    "An Effective Cache-Index Forwarding over Wireless Network for the World-Wide Web.",
                    "Adaptive Fault-Tolerant Wormhole Routing for Torus Networks.",
                    "Incrementally Extensible Folded Hypercube Graphs.",
                    "Two Problems on Butterfly Graphs.",
                    "Decompositions of de Bruijn Networks.",
                    "User-Defined Telecooperation Services.",
                    "The Adaptive Arena: Language Constructs and Architectural Abstractions for Concurrent Object-Oriented Systems.",
                    "Toward Supporting Data Parallel Programming on Clusters of Symmetric Multiprocessors.",
                    "Reusing MS-Windows Software Applications under CORBA Environment.",
                    "Object-Oriented Ease-Based Parallel Primitives in C++.",
                    "Automatically Partitioning Threads Based on Remote Paths.",
                    "A Generalized Basic Cycle Calculation Method for Efficient Array Redistribution.",
                    "Alignment and Distribution is NOT (Always) NP-Hard.",
                    "Contention-Free Communication Scheduling for Array Redistribution.",
                    "Probability Based Replacement Algorithm for WWW Server Arrays.",
                    "A Multicast Communication System over Internet and Its Application.",
                    "Design and Implementation of a Java Execution Environment.",
                    "A Dualthreaded Java Processor for Java Multithreading.",
                    "A New Representation of Graphs and Its Applications to Parallel Processing.",
                    "Synchronous Flow Control in Wormhole Routed Optical Networks.",
                    "Routing in Hypercubes with Large Number of Faulty Nodes.",
                    "Proposal and Verification of a Workflow Coordination Model for Core Business.",
                    "Design and Implementation of Agent-Based Flexible Asynchronous Messaging System.",
                    "Design and Implementation of Multi-Threaded Object Request Broker.",
                    "High-Performance External Stencil Computations Using User-Controllable I/O.",
                    "Efficient Address Generation for Affine Subscripts in Data-Parallel Programs.",
                    "Flat Indexing: A Compilation Technique to Enhance Parallelism of Logic Programs.",
                    "IPLS: An Intelligent Parallel Loop Scheduling for Multiprocessor Systems.",
                    "A Parallel Parsing VLSI Architecture for Arbitrary Context Free Grammars.",
                    "User-Controllable Parallel I/O for Scientific Applications.",
                    "Distributed Object Relocation Protocol for Wide Area Networks.",
                    "Supporting Small Accesses for the Parallel File Subsystem on Distributed Shared Memory Systems.",
                    "An Efficient Thread Architecture for a Distributed Shared Memory on Symmetric Multiprocessor Clusters."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "ICPADS 1997",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/1997",
                "sub_name": "1997 International Conference on Parallel and Distributed Systems (ICPADS '97), 11-13 December 1997, Seoul, Korea, Proceedings.",
                "count": 114,
                "papers": [
                    "Distributed Real-Time Systems: Issues, Solutions, and Applications.",
                    "Parallel Systems and Parallel I/O Technology.",
                    "Scalable Scheduling for Distributed Memory Machines: A Reality.",
                    "A Distributed Memory MIMD Multi-Computer with Reconfigurable Custom Computing Capabilities.",
                    "New architectures and I/O scheduling methods for scalable storage products.",
                    "A Hierarchical BSP Model Supporting Processor Locality.",
                    "The Design and Performance Evaluation of the RAID 5 Controller using the Load-Balanced Destage Algorithm.",
                    "Mapping nested loops onto distributed memory multiprocessors.",
                    "Efficient Algorithms for Prefix and General Prefix Computations on Distributed Shared Memory Systems with Applications.",
                    "A parallel Cholesky factorization routine with a new version of PB-BLAS.",
                    "I/O and memory-efficient matrix multiplication with user-controllable parallel I/O.",
                    "Parallel discrete event processing of sequential computations.",
                    "Techniques to provide Run-Time Support for solving Irregular Problems.",
                    "An Efficient Adaptive Routing Algorithm for the Faulty Star Graph.",
                    "A Deadlock-Free Routing Scheme for Interconnection Networks with Irregular Topologies.",
                    "Toward Optimal Complete Exchange on Wormhole-Routed Tori.",
                    "Performance of the r-truncated Benes networks under randomized routing algorithms.",
                    "Optimal broadcast in α-port wormhole-routed mesh networks.",
                    "Ultrafast compact CMOS dividers.",
                    "Configurable Hardware for Symbolic Search Operations.",
                    "SliM-II: A Linear Array SIMD Processor for Real-time Image Processing.",
                    "Instruction Folding in Java Processor.",
                    "Hardware Support for Release Consistency with Queue-based Synchronization.",
                    "Performance Analysis and Experiments of Sorts on a Parallel Computer with Parallel Computation Models.",
                    "An Algorithmic Framework for Parallelizing Vision Computations on Distributed-Memory Machines.",
                    "Minimizing communication in bitonic sorting software.",
                    "Constant Time Algorithms for Computing the Contour of Maximal Elements on the Reconfigurable Mesh.",
                    "Effective Computer Technology for Data Processing.",
                    "Design and Implementation of Software Simulation Platform for ATM Switching Systems.",
                    "Minimizing Broadcast Costs under Edge Reductions in Tree Networks.",
                    "Performance of Multiple Links Over Single Link in STC104 Networks.",
                    "A High-Performance ATM Switch with Completely and Fairly Shared Buffers.",
                    "Transaction-Based Causally Ordered Protocol for Distributed Replicated Objects.",
                    "A dynamic reconfiguration manager for graph-oriented distributed programs.",
                    "Client Location Tracking in Ubiquitous Information Service Network.",
                    "An equivalence algorithm to point out errors for basic LOTOS in a distributed system environment and its prototype.",
                    "Protocol Synthesis from Time Petri Net Based Service Specification.",
                    "Information Flow in a Purpose-Oriented Access Control Model.",
                    "Distributed network computing over wireless links.",
                    "Delta-Causality in Wide-Area Group Communications.",
                    "An Approach for Mobile Agent Security and Fault Tolerance using Distributed Transactions.",
                    "Multi-agent based decision mechanism for distributed meeting scheduling system.",
                    "Performance and Cost Analyses of Mobile Internet Multicast Protocols.",
                    "A Study of Train Communication System for Future Railways Using Millimeter-wave Radio.",
                    "Implementation of an Object-Oriented Functional Language on the Multithreaded Architecture.",
                    "Performance Predictor for HPF Compilers.",
                    "Run-time parallelization for partially parallel loops.",
                    "A Loop Parallelization Method for Nested Loops with Non-uniform Dependences.",
                    "Reordering the Statements with Dependence Cycles to Improve the Performance of Parallel Loops.",
                    "A Distribution Format for Communication-Free Reshape in Distributed Memory Computers.",
                    "Scalable Parallel and Cluster Computing.",
                    "Distributed Shared Memory on IBM SP2.",
                    "Evaluation of a memory hierarchy for the MTS multithreaded processor.",
                    "On the effectiveness of sectored caches in reducing false sharing misses.",
                    "Instruction Cache Prefetching with Extended BTB.",
                    "Dynamic Load Distribution on a Mesh with a Single Bus.",
                    "Load Balancing strategies for Parallel Forward Search Algorithm with Conflict Based Backjumping.",
                    "Competitive Execution: A Method to Exploit Idle Workstations.",
                    "Multiprocessor Scheduling Algorithm Utilizing Linear Clustering of Directed Acyclic Graphs.",
                    "A Multiprocessor Scheduling Heuristic for Functional Parallelism and its Performance Measure.",
                    "A Performance Modeling Technique for Mesh-Connected Multicomputers.",
                    "Synchronous Load Balancing in Hypercube Multicomputers with Faulty Nodes.",
                    "Design of an Augmented Generalized Cube Network.",
                    "Embeddings of cycles, meshes and tori in faulty k-ary n-cubes.",
                    "Optimal embeddings of multiple graphs into a hypermesh.",
                    "A multimedia programming toolkit/environment.",
                    "Efficient execution of parallel programs using partial strict triggering of program graph nodes.",
                    "A concurrent program debugging environment using real-time replay.",
                    "Detection of Summative Global Predicates.",
                    "The Parallel Approximability of a Subclass of Quadratic Programming.",
                    "Media allocation methods to improve multimedia query and access reliability.",
                    "Design and Evaluation of a Distributed Multimedia Synchronization Algorithm using Media Scalings and Variable Service Rates.",
                    "CrownFS: a clustered continuous media server.",
                    "A Data Placement Strategy on MZR for VOD Servers.",
                    "Performances of the PS2 Parallel Storage and Processing System for Tomographic Image.",
                    "Bottleneck-Free Interconnect and IO Subsystem in SPAX.",
                    "Are 2*-trees interesting topologies for the interconnection of a network?",
                    "A new interconnection network for parallel computer with low diameter.",
                    "Permutation Mapping for MIN Using High Level Net Models.",
                    "A Delivery Scheduling System by the Distributed Cooperative Multiple Agents.",
                    "Design, Implementation and Performance of a Mutex-Token based Fault-Tolerant Tuple Space Machine.",
                    "Potentials and limitations of parallel computing on a cluster of workstation.",
                    "Design and implementation of PVM-based portable distributed shared memory system on the workstation cluster environment.",
                    "Efficient Distributed Deadlock Detection and Resolution using Probes, Tokens, and Barriers.",
                    "A Provably Fastest Parallel Algorithm for the Recognition of the Consecutive Ones Property with Selected Applications.",
                    "Parallel Maximum Matching Algorithms in Interval Graphs.",
                    "Solution of Path Problems Using Associative Parallel Processors.",
                    "Optimal Computation of Shortest Paths on Doubly Convex Bipartite Graphs.",
                    "A Parellel Processing Method for Receding Horizon Tracking Control.",
                    "Parallel Clustering Algorithms on a Reconfigurable Array of Processors with Wider Bus Networks.",
                    "An Efficient and Authenticated Group-Oriented Cryptoscheme Based on a Geometric Method in Internet Environments.",
                    "ICOMA: An Open Infrastructure for Agent-based Intelligent Electronic Commerce on the Internet.",
                    "Query Expansion for Intelligent Information Retrieval on Internet.",
                    "Improve HTTP/TCP Performance over ATM Networks: New Schemes and Performance Comparisons.",
                    "An Overview of IP Switching and Tag Switching.",
                    "A simulation study of interoperative methods for congestion control over TCP/AT.",
                    "Post Modern Distributed Systems.",
                    "A formal versioning approach for distributed objectbase.",
                    "A unified approach to global concurrency control and global deadlocks in a multidatabase environment.",
                    "Attribute Partitioning Algorithm in DOODB.",
                    "A data allocation considering data availability in distributed database systems.",
                    "Performance Analysis of a Parallel Distributive Join Algorithm on the Intel Paragon.",
                    "Universally Fault-Tolerant Broadcasting in Trees.",
                    "A Fault Tolerant Protocol As an Extension to a Distributed Mutual Exclusion Algorithm.",
                    "A Fault-Tolerant Distributed Algorithm for Termination Detection Using Roughly Synchronized Clocks.",
                    "Fault-Tolerant Ring Embedding in Faulty Arrangement Graphs.",
                    "An parallel diagnosis method for an optimal fault-tolerant network.",
                    "Fault tolerant cluster computing through replication.",
                    "The Design and Evaluation of Policy-Controllable Buffer Cache.",
                    "Augmenting Work-Greedy Assignment Schemes With Task Duplication.",
                    "Extended Flexible Processor Allocation Strategy for Mesh-Connected Systems Using Shape Manipulations.",
                    "Hybrid checkpointing protocol based on selective-sender-based message logging.",
                    "Algorithmic Influences on I/O Access Patterns and Parallel File System Performance.",
                    "Control of parallel task granularity by throttling decomposition."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "ICPADS 1996",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/1996",
                "sub_name": "1996 International Conference on Parallel and Distributed Systems (ICPADS '96), June 3-6, 1996, Tokyo, Japan, Proceedings.",
                "count": 69,
                "papers": [
                    "A distributed connection manager interface for web services on IBM SP systems.",
                    "Info-Plaza: A social information filtering system for the World-Wide Web.",
                    "A unified media presentation method for multimedia information networks.",
                    "Support of cooperating and distributed business processes.",
                    "All-fault-tolerant embedding of a complete binary tree in a group of Cayley graphs.",
                    "Bubblesort star graphs: a new interconnection network.",
                    "Efficiency of the domain decomposition method for the parallelization of implicit finite element code.",
                    "State reduction in the exact analysis of fork/join queueing systems with homogeneous exponential servers.",
                    "Transactional programming for distributed agent systems.",
                    "Cost-balanced cooperation protocol in multi-agent robotic systems.",
                    "Agent-based approach for information gathering on highly distributed and heterogeneous environment.",
                    "A linear-time algorithm for computing the diameters of the incomplete WK-recursive networks.",
                    "An efficient algorithm for set-to-set node-disjoint paths problem in hypercubes.",
                    "What features really make distributed minimum spanning tree algorithms efficient?.",
                    "Implementation of MAP: A system for mobile assistant programming.",
                    "Synchronization model for multimedia communication and presentation in distributed systems.",
                    "Automatic modification of a protocol specification based on changes of a service specification.",
                    "Some sparse time-relaxed broadcast communication networks.",
                    "Studies for realizing soft TCCS residing on top of Ethernet LAN .",
                    "A study on call modelling for AIN/B-ISDN integration.",
                    "Distributed arithmetic-based architectures for high speed IIR filter design.",
                    "Performance evaluation of a WDMA OIDSM multiprocessors.",
                    "Double parity sparing for performance improvement in disk arrays.",
                    "An Optical Bus Computer Cluster with a deferred cache coherence protocol.",
                    "Fast sorting algorithms on reconfigurable array of processors with optical buses.",
                    "Programming concurrency and synchronisation in Actel.",
                    "Modeling and analysis of channel transferability in mobile computing environments.",
                    "A wireless multiple access control protocol for voice-data integration.",
                    "Connection rerouting strategy applicable to various connection-oriented mobile communication networks.",
                    "A new scheduling strategy for NUMA multiprocessor systems.",
                    "Swapped networks: unifying the architectures and algorithms of a wide class of hierarchical parallel processors.",
                    "An efficient asynchronous data transmission mechanism for data parallel languages.",
                    "An alternative addressing scheme for conventional CDMA fiber-optic networks allows interesting parallel processing capabilities.",
                    "Deadlock-free routing in an optical interconnect for high-speed wormhole routing networks.",
                    "Multimedia task reliability analysis based on token ring network.",
                    "PPD: A practical parallel loop detector for parallelizing compilers.",
                    "Program dependence analysis of concurrent logic programs and its applications.",
                    "Expressing concurrency in Griffin.",
                    "Fault-tolerant causal delivery in group communication.",
                    "Distributed fault detection in communication protocols using extended finite state machines.",
                    "A flexible protocol synthesis method for adopting requirement changes.",
                    "Soft resource reservation: A flexible guarantee of QoS.",
                    "Register renaming for x86 superscalar design.",
                    "Scheduling of conditional branches using SSA form for superscalar/VLIW processors.",
                    "Exploiting the locality of data structures in multithreaded architecture.",
                    "Efficient fault protection of block gradient-based adaptive filters.",
                    "Communication protocol for group of distributed objects.",
                    "A high performance reliable atomic group protocol.",
                    "Extended group communication algorithm for updating distributed programs.",
                    "Fault-tolerant routing strategy using routing capability in hypercube multicomputers.",
                    "Adaptive routing in k-ary n-cube multicomputers.",
                    "Roll-forward error recovery in embedded real-time systems.",
                    "Allowing cycle-stealing direct memory access I/O concurrent with hard-real-time programs.",
                    "Benchmarking IBM SP1 system for SPMD programming.",
                    "Distributed checkpointing based on influential messages.",
                    "Performance of scheduling strategies for client-server systems.",
                    "Mapping asynchronous parallel simulation on a network of workstations.",
                    "Two-level-hierarchies of objects: a unit of reference for distributed object-oriented databases.",
                    "A management information repository for distributed applications management.",
                    "Distribution transparent MIB based on MSA (Management System Agent) model.",
                    "Fast parallel chessboard distance transform algorithms.",
                    "On parallelism of hyper-linking theorem proving: a preliminary report.",
                    "Scalable routing schemes for massively parallel processing using reconfigurable optical interconnect.",
                    "RDB structure chart display using fuzzy rules.",
                    "An optimal deadlock resolution algorithm in multidatabase systems.",
                    "Relaxed consistency requirements for replicated objects.",
                    "Fault-tolerant distributed match-making with weights.",
                    "A distributed algorithm for implementation of first-order multiparty interactions.",
                    "A distributable algorithm for optimizing mesh partitions."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "ICPADS 1994",
        "info": "Hsinchu, Taiwan, ROC",
        "venues": [
            {
                "sub_name_abbr": "conf/icpads/1994",
                "sub_name": "Proceedings 1994 International Conference on Parallel and Distributed Systems, December 19-21, 1994, Hsinchu, Taiwan, Republic of China.",
                "count": 117,
                "papers": [
                    "The Prospects for Architecture-Independent Parallel Programming.",
                    "Towards Teraflop Computing.",
                    "Computing in the'90s, Microsoft, and Supercomputers.",
                    "Heterogeneous Parallel Computing.",
                    "Object Technology and Distributed Operating Systems.",
                    "Software Specification of Real-Time Systems.",
                    "Are We Providing the Right Education for Computer Science/Engineering Students?",
                    "Is It Possible to Fairly Compare Interconnection Networks?.",
                    "Taiwan's Information Superhighway: Technical Issues and Social Impacts.",
                    "What Types of Research Papers Should We Be Writing?",
                    "Parallel Processing: What Have We Done Wrong?",
                    "Parallel and Distributed Processing Research in Some Asian Countries.",
                    "Computing List Ranking on a RAP with Wider Bus Networks.",
                    "Semigroup Computation and Its Applications on Mesh-Connected Computers with Hyperbus Broadcasting.",
                    "Convexity Problems on Reconfigurable Meshes.",
                    "Causally Ordering Group Communication Protocol.",
                    "Group Communications Algorithm for Dynamically Updating in Distributed Systems.",
                    "Multicast Communication in 2-D Mesh Networks.",
                    "Experiments on High-Priority Cold Requests in the Presence of Tree Saturation.",
                    "Torus with Slotted Rings Architecture for a Cache-Coherent Multiprocessor.",
                    "A Fast Switching Double Processing Architecture for Multi-Tasking Real-Time Systems.",
                    "Simulation and Performance Evaluation of a Modularly Configurable Attached Processor.",
                    "Implementation of Fast Hartley Transform.",
                    "Efficient Implementation of Sorting Algorithms on Asynchronous Distributed-Memory Machines.",
                    "A New and Efficient FFT Algorithm for Distributed Memory Systems.",
                    "Communication-Efficient Implementation of Block Recursive Algorithms on Distributed-Memory Machines.",
                    "Broadcast in All-Port Wormhole-Routed 3D Mesh Networks Using Extended Dominating Sets.",
                    "Broadcasting on Faulty Hypercubes.",
                    "Broadcasting on Uni-Directional Hypercubes.",
                    "The Design and Implementation of the Pasda Parallel File System.",
                    "Storage Design and Retrieval of Continuous Multimedia Data Using Multi-Disks.",
                    "A Discrete-Event Simulation Model for Characterizing Parallel File Transfers.",
                    "On Evaluating Parallel Sparse Cholesky Factorizations.",
                    "A Mesh Partitioning Tool sand Its Applications to Parallel Processing.",
                    "Parallel Block Generalized WZ Factorization.",
                    "The Design and Performance Considerations for Multimedia Applications Using FDDI Synchronous Services.",
                    "FDDI-M: A Scheme to Double FDDI's Ability of Supporting Synchronous Traffic.",
                    "Full-Color Real-Time Video Broadcasting Over ATM LAN.",
                    "Using the Imprecise-Computation Technique for Congestion Control on a Real-Time Trafic Switching Element.",
                    "A Parallel Run-Time Iterative Load Balancing Algorithm for Solution-Adaptive Finite Element Meshes on Hypercubes.",
                    "Effective Load Balancing on Highly Parallel Multicomputers Based on Superconcentrators.",
                    "Dynamic Load Balancing in Parallel Simulation Using Time Warp Mechanism.",
                    "Parallel Design of Q-Coders for Bilevel Image Compression.",
                    "An Efficient Hough Transform Algorithm on SIMD Hypercube.",
                    "Implementation of a Tree-Structured Vector Quantizer for Image Compression on the MasPar MP-1 Parallel Machine.",
                    "A Distributed Memory Multiprocessor.",
                    "Extending Vienna Fortran with Task Parallelism.",
                    "Extracting the Parallelism in Program with Unstructured Control Statements.",
                    "Stochastic Modeling of Scaled Parallel Programs.",
                    "Use of Sequencing Constraints for Specifying, Testing, and Debugging Concurrent Programs.",
                    "Specification of Stochastic Properties with CSP.",
                    "Algorithms for Node Disjoint Paths in Incomplete Star Networks.",
                    "Parallel Execution of Nested Loops in Band Parallelism.",
                    "A Basis Approach to Loop Parallelization and Synchronisation.",
                    "Implementation of a Portable Parallelizing Compiler with Loop Partition.",
                    "Fault Tolerance in Hyperbus and Hypercube Multiprocessors Using Partitioning Scheme.",
                    "An Optimal Fault-Tolerant Design Approach for Array Processors.",
                    "Efficient Fault Tolerance: An Approach to Deal with Transient Faults in Multiprocessor Architectures.",
                    "Designing General-Purpose Fault-Tolerant Distributed Systems - A Layered Approach.",
                    "CGIN: A Modified Gamman Interconnection Network with Multiple Disjoint Paths.",
                    "Two Expansible Multistage Interconnection Networks.",
                    "Sorting Networks with Built-In Error Correction.",
                    "A New Approach for Finding Loop Transformation Matrices.",
                    "An Efficient Technique to Remove Transformations.",
                    "Generalizing the Unimodular Approach.",
                    "Practical Distributed Garbage Collection for Networks with Synchronous Clocks and Message Delay.",
                    "Techniques to Tackle State Explosion in global Predicate Detection.",
                    "An Object-Oriented Model for Distributed System Management.",
                    "A Flexible Service Development Support System for Communication Systems by Reuse Methodology.",
                    "Probabilistic Timed Protocol Verification for the Extended State Transition Model.",
                    "Experiences in Session Layer Conformance Testing.",
                    "Performances Modeling and Evaluation for the XMP Shared-Bus Multiprocessor Architecture.",
                    "A Heuristic Algorithm for the Reliability-Oriented File Assignment in a Distributed Computing System.",
                    "Optimal Information Dispersal for Reliable Communication in Computer Networks.",
                    "Extracting Multi-Thread with Data Localities for Vector Computers.",
                    "Evaluation of Relaxed Memory Consistency Models for Multithreaded Multiprocessors.",
                    "Integrated Support to Improve Inter-Thread Communication and Synchronization in a Multithreaded Processor.",
                    "On the Embedding of a Class of Regular Graphs in a Faulty Hypercube.",
                    "Mapping Pyramids into 3-D Meshes.",
                    "An Efficient Emulation for Tree-Connected Networks.",
                    "An Improved Characterization of 1-Step Recoverable Embeddings: Rings in Hypercubes.",
                    "A Graph Model for Investigating Memory Consistency.",
                    "Delayed Precise Invalidation - A Software Cache Coherence Scheme.",
                    "A Study of Cache Hashing Functions for Symbolic Applications in Micro-Parallel Processors.",
                    "Parallel Implementation of the Trie Structure.",
                    "Lock-Free Concurrent Tree Structures for Multiprocessor Systems.",
                    "Performance Analysis of Distributed Client-Server Message Queuing.",
                    "Grouping Array Layouts to Reduce Communication and Improve Locality of Parallel Programs.",
                    "Avoiding Data Link and Computational Conflicts in Mapping Nested Loop Algorithms to Lower-Dimensional Processor Arrays.",
                    "Efficient Algorithms for data Distribution on Distributed Memory Multicomputers.",
                    "Obtaining Nondominated K-Coteries for Fault-Tolerant Distributed K-Mutual Exclusion.",
                    "A New Approach of Constructing Information Structure for Mutual Exclusion in Distrbuted Systems.",
                    "A Tree-Based Distributed Algorithm for the K-Entry Critical Section Problem.",
                    "A Thory of Fault-Tolerant routing in Wormhole Networks.",
                    "Scouting: Fully Adaptive, Deadlock-Free Routing in Faulty Pipelined Networks.",
                    "Distirubted Routing Schemes for Strictly Nonblocking Networks.",
                    "Exploting communication Latency Hiding for Parallel Network.",
                    "Virtual Permanent Connection: Network Computing over Switch-Based High-Speed Networks.",
                    "Thread Migration on Heterogeneous Systems via Compile-Time Transformations.",
                    "A Kernel-Level DSVM Controller for the Diskless Cluster System.",
                    "Reducing Procedure Call Overhead: Optimizing Register Usage at Procedure Calls.",
                    "Achieving Dependability in Mission-Critical Operating Systems Through Adaptability and Large-Scale Functional Integration.",
                    "On Parallel Transaction Processing in a Coupled System.",
                    "Load Balancing in Pipelined Processing of Multi-Join Queries.",
                    "Optimizing Entity Join Queries by Extended Semijoins in a Wide Area Multidatabase Environment.",
                    "Load Balancing and Query Optimization in DataFlow Parallel Evaluation of Datalog Programs.",
                    "Pyramided Hypercube: An Extendable Cubic Network with Fixed Degree.",
                    "CCT: A New VLSI Architecture for Parallel Processing.",
                    "Varietal Hypercube - A New Interconnection Network Topology for Large-Scale Multicomputer.",
                    "A Linear Equation Model for Twisted Cube Networks.",
                    "Trace-Based Analysis and Tuning for Distributed Parallel Applications.",
                    "A Parallel Programming Environment Based on Message Passing.",
                    "Performance Tuning of Message Passing Programs Through Visual Analysis.",
                    "On the Development Paradigm of Distributed Applications.",
                    "Branch Prediction for Enhancing Fine-Grained Parallelism in Prolog.",
                    "Toward Semantic-Based Parallelism in Production Systems.",
                    "An Assertional Proof of a Lock Synchronization Algorithm Using Fetch and Store Atomic Instruction."
                ]
            }
        ]
    }
]