[
    {
        "year": "2021",
        "name": "35th ICS 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2021",
                "sub_name": "ICS '21: 2021 International Conference on Supercomputing, Virtual Event, USA, June 14-17, 2021.",
                "count": 39,
                "papers": [
                    "Inter-loop optimization in RAJA using loop chains.",
                    "Tile size selection of affine programs for GPGPUs using polyhedral cross-compilation.",
                    "A practical tile size selection model for affine loop nests.",
                    "Does it matter?: OMPSanitizer: an impact analyzer of reported data races in OpenMP programs.",
                    "NumaPerf: predictive NUMA profiling.",
                    "NPBench: a benchmarking suite for high-performance NumPy.",
                    "DSGEN: concolic testing GPU implementations of concurrent dynamic data structures.",
                    "Task-graph scheduling extensions for efficient synchronization and communication.",
                    "μSteal: a theory-backed framework for preemptive work and resource stealing in mixed-criticality microservices.",
                    "ThundeRiNG: generating multiple independent random number sequences on FPGAs.",
                    "FT-BLAS: a high performance BLAS implementation with online fault tolerance.",
                    "PSSM: achieving secure memory for GPUs with partitioned and sectored security metadata.",
                    "Omegaflow: a high-performance dependency-based architecture.",
                    "PLANAR: a programmable accelerator for near-memory data rearrangement.",
                    "Power and energy efficient routing for Mach-Zehnder interferometer based photonic switches.",
                    "Athena: high-performance sparse tensor contraction sequence on heterogeneous memory.",
                    "Optimizing large-scale plasma simulations on persistent memory-based heterogeneous memory with effective data placement across memory hierarchy.",
                    "MD-HM: memoization-based molecular dynamics simulations on big memory system.",
                    "Enabling energy-efficient DNN training on hybrid GPU-FPGA accelerators.",
                    "Proxima: accelerating the integration of machine learning in atomistic simulations.",
                    "Partitioning sparse deep neural networks for scalable training and inference.",
                    "ClickTrain: efficient and accurate end-to-end deep learning training via fine-grained architecture-preserving pruning.",
                    "SumMerge: an efficient algorithm and implementation for weight repetition-aware DNN inference.",
                    "Accelerating DNNs inference with predictive layer fusion.",
                    "AUTO-PRUNE: automated DNN pruning and mapping for ReRAM-based accelerator.",
                    "Performance portable back-projection algorithms on CPUs: agnostic data locality and vectorization optimizations.",
                    "A systematic approach to improving data locality across Fourier transforms and linear algebra operations.",
                    "Delay sensitivity-driven congestion mitigation for HPC systems.",
                    "Topology-aware optimizations for multi-GPU ptychographic image reconstruction.",
                    "Distributed merge forest: a new fast and scalable approach for topological analysis at scale.",
                    "Sandslash: a two-level framework for efficient graph pattern mining.",
                    "On the automatic parallelization of subscripted subscript patterns using array property analysis.",
                    "ALTO: adaptive linearized storage of sparse tensors.",
                    "An optimized tensor completion library for multiple GPUs.",
                    "Distributed-memory parallel algorithms for sparse times tall-skinny-dense matrix multiplication.",
                    "HyQuas: hybrid partitioner based quantum circuit simulation system on GPU.",
                    "FULL-W2V: fully exploiting data reuse for W2V on GPU-accelerated systems.",
                    "A performance portability framework for Python.",
                    "ProMT: optimizing integrity tree updates for write-intensive pages in secure NVMs."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "34th ICS 2020",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2020",
                "sub_name": "ICS '20: 2020 International Conference on Supercomputing, Barcelona Spain, June, 2020.",
                "count": 42,
                "papers": [
                    "A scalable framework for solving fractional diffusion equations.",
                    "CFDNet: a deep learning-based accelerator for fluid simulations.",
                    "Fast distributed bandits for online recommendation systems.",
                    "Wavefront parallelization of recurrent neural networks on multi-core architectures.",
                    "NV-group: link-efficient reduction for distributed deep learning on modern dense GPU systems.",
                    "TensorSVM: accelerating kernel machines with tensor engine.",
                    "A coordinate-oblivious index for high-dimensional distance similarity searches on the GPU.",
                    "V-Combiner: speeding-up iterative graph processing on a shared-memory platform with vertex merging.",
                    "Efficient parallel algorithms for betweenness- and closeness-centrality in dynamic graphs.",
                    "Parallelizing pruned landmark labeling: dealing with dependencies in graph algorithms.",
                    "cuRipples: influence maximization on multi-GPU systems.",
                    "Graptor: efficient pull and push style vectorized graph processing.",
                    "Post-moore server architecture.",
                    "SB-Fetch: synchronization aware hardware prefetching for chip multiprocessors.",
                    "RICH: implementing reductions in the cache hierarchy.",
                    "AMOEBA: a coarse grained reconfigurable architecture for dynamic GPU scaling.",
                    "Snug: architectural support for relaxed concurrent priority queueing in chip multiprocessors.",
                    "Sparse-TPU: adapting systolic arrays for sparse matrices.",
                    "Bundlefly: a low-diameter topology for multicore fiber.",
                    "Global link arrangement for practical Dragonfly.",
                    "Fuzzy fairness controller for NVMe SSDs.",
                    "Leveraging intra-page update diversity for mitigating write amplification in SSDs.",
                    "CSB-RNN: a faster-than-realtime RNN acceleration framework with compressed structured blocks.",
                    "BurstZ: a bandwidth-efficient scientific computing accelerator platform for large-scale data.",
                    "Tools for top-down performance analysis of GPU-accelerated applications.",
                    "Identifying and (automatically) remedying performance problems in CPU/GPU applications.",
                    "AutoParBench: a unified test framework for OpenMP-based parallelizers.",
                    "Characterization and identification of HPC applications at leadership computing facility.",
                    "End-to-end performance modeling of distributed GPU applications.",
                    "Fast, accurate, and scalable memory modeling of GPGPUs using reuse profiles.",
                    "Optimizing supercompilers for supercomputers.",
                    "Mapping and scheduling HPC applications for optimizing I/O.",
                    "Modeling and optimizing NUMA effects and prefetching with machine learning.",
                    "How I learned to stop worrying about user-visible endpoints and love MPI.",
                    "Accelerating relax-ordered task-parallel workloads using multi-level dependency checking.",
                    "Tuning applications for efficient GPU offloading to in-memory processing.",
                    "Ouroboros: virtualized queues for dynamic memory management on GPUs.",
                    "MKPipe: a compiler framework for optimizing multi-kernel workloads in OpenCL for FPGA.",
                    "Chunking loops with non-uniform workloads.",
                    "Compiler aided checkpointing using crash-consistent data structures in NVMM systems.",
                    "What every scientific programmer should know about compiler optimizations?",
                    "CodeSeer: input-dependent code variants selection via machine learning."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "33rd ICS 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2019",
                "sub_name": "Proceedings of the ACM International Conference on Supercomputing, ICS 2019, Phoenix, AZ, USA, June 26-28, 2019.",
                "count": 45,
                "papers": [
                    "A scalable framework for adaptive computational general relativity on heterogeneous clusters.",
                    "Parallelizing cryo-EM 3D reconstruction on GPU cluster with a partitioned and streamed model.",
                    "Efficient GPU tree walks for effective distributed n-body simulations.",
                    "Hybrid CPU/GPU clustering in shared memory on the billion point scale.",
                    "Accelerating reduction and scan using tensor core units.",
                    "Laius: Towards latency awareness and improved utilization of spatial multitasking accelerators in datacenters.",
                    "HYPHA: a framework based on separation of parallelisms to accelerate persistent homology matrix reduction.",
                    "SDC: a software defined cache for efficient data indexing.",
                    "IA-SpGEMM: an input-aware auto-tuning framework for parallel sparse matrix-matrix multiplication.",
                    "TSM2: optimizing tall-and-skinny matrix-matrix multiplication on GPUs.",
                    "Least squares solvers for distributed-memory machines with GPU accelerators.",
                    "A communication-avoiding 3D sparse triangular solver.",
                    "Using performance models to understand scalable Krylov solver performance at scale for structured grid problems.",
                    "Performance optimization of reactive molecular dynamics simulations with dynamic charge distribution models on distributed memory platforms.",
                    "AMPT-GA: automatic mixed precision floating point tuning for GPU applications.",
                    "GPU snapshot: checkpoint offloading for GPU-dense systems.",
                    "Address-stride assisted approximate load value prediction in GPUs.",
                    "Diligent TLBs: a mechanism for exploiting heterogeneity in TLB miss behavior.",
                    "QoSMT: supporting precise performance control for simultaneous multithreading architecture.",
                    "An online quality management framework for approximate communication in network-on-chips.",
                    "Efficient and effective sparse tensor reordering.",
                    "On optimizing distributed non-negative Tucker decomposition.",
                    "GPU road network graph contraction and SSSP query.",
                    "Multi-criteria partitioning of multi-block structured grids.",
                    "Avalon: towards QoS awareness and improved utilization through multi-resource management in datacenters.",
                    "Can we trust profiling results?: understanding and fixing the inaccuracy in modern profilers.",
                    "Power efficient job scheduling by predicting the impact of processor manufacturing variability.",
                    "GreenMM: energy efficient GPU matrix multiplication through undervolting.",
                    "WCCV: improving the vectorization of IF-statements with warp-coherent conditions.",
                    "Automatic construct selection and variable classification in OpenMP.",
                    "Efficient thread/page/parallelism autotuning for NUMA systems.",
                    "Efficient hierarchical online-autotuning: a case study on polyhedral accelerator mapping.",
                    "Software combining to mitigate multithreaded MPI contention.",
                    "Optimizing computation-communication overlap in asynchronous task-based programs.",
                    "Henosis: workload-driven small array consolidation and placement for HDF5 applications on heterogeneous data stores.",
                    "DeepHiR: improving high-radix router throughput with deep hybrid memory buffer microarchitecture.",
                    "The anatomy of efficient FFT and winograd convolutions on modern CPUs.",
                    "Optimizing the linear fascicle evaluation algorithm for many-core systems.",
                    "Deep reuse: streamline CNN inference on the fly via coarse-grained computation reuse.",
                    "Full-stack optimization for accelerating CNNs using powers-of-two weights with FPGA validation.",
                    "O3BNN: an out-of-order architecture for high-performance binarized neural network inference with fine-grained pruning.",
                    "RFAcc: a 3D ReRAM associative array based random forest accelerator.",
                    "BonVoision: leveraging spatial data smoothness for recovery from memory soft errors.",
                    "GPUGuard: mitigating contention based side and covert channel attacks on GPUs.",
                    "Dynamically linked MSHRs for adaptive miss handling in GPUs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "32nd ICS 2018",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2018",
                "sub_name": "Proceedings of the 32nd International Conference on Supercomputing, ICS 2018, Beijing, China, June 12-15, 2018.",
                "count": 36,
                "papers": [
                    "PFault: A General Framework for Analyzing the Reliability of High-Performance Parallel File Systems.",
                    "Rethinking Node Allocation Strategy for Data-intensive Applications in Consideration of Spatially Bursty I/O.",
                    "PA-SSD: A Page-Type Aware TLC SSD for Improved Write/Read Performance and Storage Efficiency.",
                    "IRIS: I/O Redirection via Integrated Storage.",
                    "GRU: Exploring Computation and Data Redundancy via Partial GPU Computing Result Reuse.",
                    "Warp-Consolidation: A Novel Execution Model for GPUs.",
                    "Classification-Driven Search for Effective SM Partitioning in Multitasking GPUs.",
                    "The Broker Queue: A Fast, Linearizable FIFO Queue for Fine-Granular Work Distribution on the GPU.",
                    "Analysis-driven Engineering of Comparison-based Sorting Algorithms on GPUs.",
                    "Optimizing Tensor Contractions in CCSD(T) for Efficient Execution on GPUs.",
                    "A two-phase recovery mechanism.",
                    "HALO: A Hierarchical Memory Access Locality Modeling Technique For Memory System Explorations.",
                    "High-Performance, Low-Complexity Deadlock Avoidance for Arbitrary Topologies/Routings.",
                    "ComPEND: Computation Pruning through Early Negative Detection for ReLU in a Deep Neural Network Accelerator.",
                    "CELIA: A Device and Architecture Co-Design Framework for STT-MRAM-Based Deep Learning Acceleration.",
                    "Directive-Based, High-Level Programming and Optimizations for High-Performance Computing with FPGAs.",
                    "ReGraph: A Graph Processing Framework that Alternately Shrinks and Repartitions the Graph.",
                    "cuMBIR: An Efficient Framework for Low-dose X-ray CT Image Reconstruction on GPUs.",
                    "Zwift: A Programming Framework for High Performance Text Analytics on Compressed Data.",
                    "Reducing Data Movement on Large Shared Memory Systems by Exploiting Computation Dependencies.",
                    "Runtime-Guided Management of Stacked DRAM Memories in Task Parallel Programs.",
                    "Optimizing Data Aggregation by Leveraging the Deep Memory Hierarchy on Large-scale Systems.",
                    "Automated Analysis of Time Series Data to Understand Parallel Program Behaviors.",
                    "ChplBlamer: A Data-centric and Code-centric Combined Profiler for Multi-locale Chapel Programs.",
                    "ProfDP: A Lightweight Profiler to Guide Data Placement in Heterogeneous Memory Systems.",
                    "Phase-Aware Web Browser Power Management on HMP Platforms.",
                    "Demystifying Cache Policies for Photo Stores at Scale: A Tencent Case Study.",
                    "Isometry: A Path-Based Distributed Data Transfer System.",
                    "Accurate, Fast and Scalable Kernel Ridge Regression on Parallel and Distributed Systems.",
                    "Dynamic Load Balancing for Compressible Multiphase Turbulence.",
                    "Revisiting Loop Tiling for Datacenters: Live and Let Live.",
                    "Sculptor: Flexible Approximation with Selective Dynamic Loop Perforation.",
                    "A Case for Granularity Aware Page Migration.",
                    "Towards Efficient SpMV on Sunway Manycore Architectures.",
                    "On Optimizing Distributed Tucker Decomposition for Sparse Tensors.",
                    "Bootstrapping Parameter Space Exploration for Fast Tuning."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "31st ICS 2017",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2017",
                "sub_name": "Proceedings of the International Conference on Supercomputing, ICS 2017, Chicago, IL, USA, June 14-16, 2017.",
                "count": 28,
                "papers": [
                    "Demystifying automata processing: GPUs, FPGAs or Micron's AP?",
                    "Enabling scalability-sensitive speculative parallelization for FSM computations.",
                    "SPIRIT: a framework for creating distributed recursive tree applications.",
                    "Frequent subtree mining on the automata processor: challenges and opportunities.",
                    "Novel HPC techniques to batch execution of many variable size BLAS computations on GPUs.",
                    "Packet coalescing exploiting data redundancy in GPGPU architectures.",
                    "Dynamic scheduling for efficient hierarchical sparse matrix operations on the GPU.",
                    "Compile-time optimized and statically scheduled N-D convnet primitives for multi-core and many-core (Xeon Phi) CPUs.",
                    "HPAT: high performance analytics with scripting ease-of-use.",
                    "Simplification and runtime resolution of data dependence constraints for loop transformations.",
                    "Optimizing recursive task parallel programs.",
                    "Fast segmented sort on GPUs.",
                    "Globally homogeneous, locally adaptive sparse matrix-vector multiplication on the GPU.",
                    "On improving performance of sparse matrix-matrix multiplication on GPUs.",
                    "A performance analysis framework for exploiting GPU microarchitectural capability.",
                    "GraphGrind: addressing load imbalance of graph partitioning.",
                    "Automatic topology mapping of diverse large-scale parallel applications.",
                    "Design and implementation of bandwidth-aware memory placement and migration policies for heterogeneous memory systems.",
                    "Carpool: a bufferless on-chip network supporting adaptive multicast and hotspot alleviation.",
                    "Way-combining directory: an adaptive and scalable low-cost coherence directory.",
                    "Iteration-fusing conjugate gradient.",
                    "Supporting automatic recovery in offloaded distributed programming models through MPI-3 techniques.",
                    "HiPA: history-based piecewise approximation for functions.",
                    "Efficient SIMD and MIMD parallelization of hash-based aggregation by conflict mitigation.",
                    "Revisiting phased transactional memory.",
                    "Hardware/software cooperative caching for hybrid DRAM/NVM memory architectures.",
                    "SSDUP: a traffic-aware ssd burst buffer for HPC systems.",
                    "libPRISM: an intelligent adaptation of prefetch and SMT levels."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "30th ICS 2016",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2016",
                "sub_name": "Proceedings of the 2016 International Conference on Supercomputing, ICS 2016, Istanbul, Turkey, June 1-3, 2016.",
                "count": 43,
                "papers": [
                    "Polly-ACC Transparent compilation to heterogeneous hardware.",
                    "Hybrid CPU-GPU scheduling and execution of tree traversals.",
                    "Exploiting Dynamic Reuse Probability to Manage Shared Last-level Caches in CPU-GPU Heterogeneous Processors.",
                    "AEQUITAS: Coordinated Energy Management Across Parallel Applications.",
                    "Runtime-Guided Mitigation of Manufacturing Variability in Power-Constrained Multi-Socket NUMA Nodes.",
                    "Variation Among Processors Under Turbo Boost in HPC Systems.",
                    "Mini-Ckpts: Surviving OS Failures in Persistent Memory.",
                    "High Performance Design for HDFS with Byte-Addressability of NVM and RDMA.",
                    "Write-Aware Management of NVM-based Memory Extensions.",
                    "HOPE: Enabling Efficient Service Orchestration in Software-Defined Data Centers.",
                    "Towards an Adaptive Multi-Power-Source Datacenter.",
                    "GreenGear: Leveraging and Managing Server Heterogeneity for Improving Energy Efficiency in Green Data Centers.",
                    "Noise Aware Scheduling in Data Centers.",
                    "Coherence-Free Multiview: Enabling Reference-Discerning Data Placement on GPU.",
                    "SFU-Driven Transparent Approximation Acceleration on GPUs.",
                    "Reusing Data Reorganization for Efficient SIMD Parallelization of Adaptive Irregular Applications.",
                    "SReplay: Deterministic Sub-Group Replay for One-Sided Communication.",
                    "Lynx: Using OS and Hardware Support for Fast Fine-Grained Inter-Core Communication.",
                    "Efficient Timestamp-Based Cache Coherence Protocol for Many-Core Architectures.",
                    "BLASX: A High Performance Level-3 BLAS Library for Heterogeneous Multi-GPU Computing.",
                    "Peruse and Profit: Estimating the Accelerability of Loops.",
                    "Simulation and Analysis Engine for Scale-Out Workloads.",
                    "Proteus: Exploiting Numerical Precision Variability in Deep Neural Networks.",
                    "Galaxyfly: A Novel Family of Flexible-Radix Low-Diameter Topologies for Large-Scales Interconnection Networks.",
                    "Replichard: Towards Tradeoff between Consistency and Performance for Metadata.",
                    "TokenTLB: A Token-Based Page Classification Approach.",
                    "Exploiting Private Local Memories to Reduce the Opportunity Cost of Accelerator Integration.",
                    "GCaR: Garbage Collection aware Cache Management with Improved Performance for Flash-based SSDs.",
                    "Fairness-oriented OS Scheduling Support for Multicore Systems.",
                    "Scheduling Tasks with Mixed Timing Constraints in GPU-Powered Real-Time Systems.",
                    "CuMAS: Data Transfer Aware Multi-Application Scheduling for Shared GPUs.",
                    "DSMR: A Parallel Algorithm for Single-Source Shortest Path Problem.",
                    "Parallel Transposition of Sparse Data Structures.",
                    "SARVAVID: A Domain Specific Language for Developing Scalable Computational Genomics Applications.",
                    "Fast Multiplication in Binary Fields on GPUs via Register Cache.",
                    "Balanced Hashing and Efficient GPU Sparse General Matrix-Matrix Multiplication.",
                    "Optimizing Sparse Matrix-Vector Multiplication for Large-Scale Data Analytics.",
                    "TurboTiling: Leveraging Prefetching to Boost Performance of Tiled Codes.",
                    "Graph Prefetching Using Data Structure Knowledge.",
                    "Prefetching Techniques for Near-memory Throughput Processors.",
                    "Origami: Folding Warps for Energy Efficient GPUs.",
                    "Barrier-Aware Warp Scheduling for Throughput Processors.",
                    "Tag-Split Cache for Efficient GPGPU Cache Utilization."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "29th ICS 2015",
        "info": "Newport Beach/Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2015",
                "sub_name": "Proceedings of the 29th ACM on International Conference on Supercomputing, ICS'15, Newport Beach/Irvine, CA, USA, June 08 - 11, 2015.",
                "count": 43,
                "papers": [
                    "Streaming Task Parallelism.",
                    "Automatic Parallelization of Kernels in Shared-Memory Multi-GPU Nodes.",
                    "A Stall-Aware Warp Scheduling for Dynamically Optimizing Thread-level Parallelism in GPGPUs.",
                    "PeerWave: Exploiting Wavefront Parallelism on GPUs with Peer-SM Synchronization.",
                    "PaCMap: Topology Mapping of Unstructured Communication Patterns onto Non-contiguous Allocations.",
                    "Unique Worker model for OpenMP.",
                    "Exploiting Process Imbalance to Improve MPI Collective Operations in Hierarchical Systems.",
                    "Locality-Driven Dynamic GPU Cache Bypassing.",
                    "SemCache++: Semantics-Aware Caching for Efficient Multi-GPU Offloading.",
                    "DaCache: Memory Divergence-Aware GPU Cache Management.",
                    "Automatic Selection of Sparse Matrix Representation on GPUs.",
                    "Fine-Grained Synchronizations and Dataflow Programming on GPUs.",
                    "Enabling and Exploiting Flexible Task Assignment on GPU through SM-Centric Program Transformations.",
                    "Datacenter Efficiency: What's Next?",
                    "Towards Lightweight and Swift Storage Resource Management in Big Data Cloud Era.",
                    "Hadoop+: Modeling and Evaluating the Heterogeneity for MapReduce Applications in Heterogeneous Clusters.",
                    "Active Access: A Mechanism for High-Performance Distributed Data-Centric Computations.",
                    "Exascaling Your Library: Will Your Implementation Meet Your Expectations?",
                    "MODESTO: Data-centric Analytic Optimization of Complex Stencil Programs on Heterogeneous Architectures.",
                    "FAST: A Fast Stencil Autotuning Framework Based On An Optimal-solution Space Model.",
                    "Parameterized Diamond Tiling for Stencil Computations with Chapel parallel iterators.",
                    "Quantifying Performance Bottlenecks of Stencil Computations Using the Execution-Cache-Memory Model.",
                    "GreenPar: Scheduling Parallel High Performance Applications in Green Datacenters.",
                    "Underprovisioning the Grid Power Infrastructure for Green Datacenters.",
                    "Building Fuel Powered Supercomputing Data Center at Low Cost.",
                    "History-Assisted Adaptive-Granularity Caches (HAAG$) for High Performance 3D DRAM Architectures.",
                    "Real-Time In-Memory Checkpointing for Future Hybrid Memory Systems.",
                    "Leveraging Silicon-Photonic NoC for Designing Scalable GPUs.",
                    "Automatically Scalable Computation.",
                    "Mower: A New Design for Non-blocking Misprediction Recovery.",
                    "zFENCE: Data-less Coherence for Efficient Fences.",
                    "PALMOS: A Transparent, Multi-tasking Acceleration Layer for Parallel Heterogeneous Systems.",
                    "A Nested Partitioning Algorithm for Adaptive Meshes on Heterogeneous Clusters.",
                    "Criticality-Aware Dynamic Task Scheduling for Heterogeneous Architectures.",
                    "CSR5: An Efficient Storage Format for Cross-Platform Sparse Matrix-Vector Multiplication.",
                    "Optimistic Delinearization of Parametrically Sized Arrays.",
                    "DASX: Hardware Accelerator for Software Data Structures.",
                    "Automatic Energy Efficient Parallelization of Uniform Dependence Computations.",
                    "ASPaS: A Framework for Automatic SIMDization of Parallel Sorting on x86-based Many-core Processors.",
                    "Optimizing Overlapped Memory Accesses in User-directed Vectorization.",
                    "COMPASS: A Framework for Automated Performance Modeling and Prediction.",
                    "Composing Algorithmic Skeletons to Express High-Performance Scientific Applications.",
                    "STAPL-RTS: An Application Driven Runtime System."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "28th ICS 2014",
        "info": "Muenchen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2014",
                "sub_name": "2014 International Conference on Supercomputing, ICS'14, Muenchen, Germany, June 10-13, 2014.",
                "count": 45,
                "papers": [
                    "HPC for the human brain project.",
                    "LAWS: locality-aware work-stealing for multi-socket multi-core architectures.",
                    "Effective automatic computation placement and dataallocation for parallelization of regular programs.",
                    "On the conditions for efficient interoperability with threads: an experience with PGAS languages using cray communication domains.",
                    "HOMR: a hybrid approach to exploit maximum overlapping in MapReduce over high performance interconnects.",
                    "DTail: a flexible approach to DRAM refresh management.",
                    "Last-level cache deduplication.",
                    "Block value based insertion policy for high performance last-level caches.",
                    "Multi-stage coordinated prefetching for present-day processors.",
                    "Evaluation of methods to integrate analysis into a large-scale shock shock physics code.",
                    "Input-adaptive parallel sparse fast fourier transform for stream processing.",
                    "Thread-cooperative, bit-parallel computation of levenshtein distance on GPU.",
                    "Load balancing n-body simulations with highly non-uniform density.",
                    "21st century computer architecture keynote at 2014 international conference on supercomputing (ICS).",
                    "MT-MPI: multithreaded MPI for many-core environments.",
                    "Implementing a classic: zero-copy all-to-all communication with mpi datatypes.",
                    "Value influence analysis for message passing applications.",
                    "Scalable performance analysis of exascale MPI programs through signature-based clustering algorithms.",
                    "An optimal distributed load balancing algorithm for homogeneous work units.",
                    "Addressing bandwidth contention in SMT multicores through scheduling.",
                    "An adaptive cross-architecture combination method for graph traversal.",
                    "Accelerating cache coherence mechanism with speculation.",
                    "Reducing energy consumption of NoC by router bypassing.",
                    "Hardware-assisted scalable flow control of shared receive queue.",
                    "Automating and optimizing data transfers for many-core coprocessors.",
                    "Parallelizing and optimizing sparse tensor computations.",
                    "Revealing applications' access pattern in collective I/O for cache management.",
                    "Supporting storage configuration for I/O intensive workflows.",
                    "Understanding the impact of threshold voltage on MLC flash memory performance and reliability.",
                    "DWC: dynamic write consolidation for phase change memory systems.",
                    "Palm: easing the burden of analytical performance modeling.",
                    "An end-to-end analysis of file system features on sparse virtual disks.",
                    "Improving performance by matching imbalanced workloads with heterogeneous platforms.",
                    "Long-term resource fairness: towards economic fairness on pay-as-you-use computing systems.",
                    "The future of supercomputing.",
                    "Acceleration of derivative calculations with application to radial basis function: finite-differences on the intel mic architecture.",
                    "An efficient two-dimensional blocking strategy for sparse matrix-vector multiplication on GPUs.",
                    "A programming system for xeon phis with runtime SIMD parallelization.",
                    "Unified on-chip memory allocation for SIMT architecture.",
                    "Galaxy: a high-performance energy-efficient multi-chip architecture using photonic interconnects.",
                    "A performance perspective on energy efficient HPC links.",
                    "Verifying micro-architecture simulators using event traces.",
                    "Scaling up matrix computations on shared-memory manycore systems with 1000 CPU cores.",
                    "Collective memory transfers for multi-core chips.",
                    "Scalable analysis of multicore data reuse and sharing."
                ]
            },
            {
                "sub_name_abbr": "conf/ics/2014ross",
                "sub_name": "Proceedings of the 4th International Workshop on Runtime and Operating Systems for Supercomputers, ROSS 2014, Munich, Germany, June 10, 2014.",
                "count": 10,
                "papers": [
                    "Building blocks for an exa-scale operating system.",
                    "mOS: an architecture for extreme-scale operating systems.",
                    "Revisiting virtual memory for high performance computing on manycore architectures: a hybrid segmentation kernel approach.",
                    "VMM emulation of Intel hardware transactional memory.",
                    "PICS: a performance-analysis-based introspective control system to steer parallel applications.",
                    "Hybrid MPI: a case study on the Xeon Phi platform.",
                    "Automatic SMT threading for OpenMP applications on the Intel Xeon Phi co-processor.",
                    "An evaluation of BitTorrent's performance in HPC environments.",
                    "Reduction of operating system jitter caused by page reclaim.",
                    "Overhead of a decentralized gossip algorithm on the performance of HPC applications."
                ]
            },
            {
                "sub_name_abbr": "conf/ics/25a",
                "sub_name": "ACM International Conference on Supercomputing 25th Anniversary Volume.",
                "count": 32,
                "papers": [
                    "Author retrospective for PTRAN's analysis and optimization techniques.",
                    "Author retrospective for code scheduling and register allocation in large basic blocks.",
                    "Author retrospective for array expansion, array shrinking, or there and back again.",
                    "Author retrospective for a global resource-constrained parallelization technique.",
                    "Author retrospective for compiler-directed data prefetching in multiprocessors with memory hierarchies.",
                    "Author retrospective for semantical interprocedural parallelization: an overview of the PIPS project.",
                    "Author retrospective for optimizing for parallelism and data locality.",
                    "Author retrospective for PYRROS: static task scheduling and code generation for message passing multiprocessors.",
                    "Author's retrospective for array privatization for parallel execution of loops.",
                    "Author retrospective for increasing the instruction fetch rate via multiple branch prediction and a branch address cache.",
                    "Author retrospective for anatomy of a message in the alewife multiprocessor.",
                    "Author retrospective: compilation techniques for block-cyclic distributions.",
                    "Author retrospective for the dual data cache.",
                    "Author retrospective for optimum modulo schedules for minimum register requirements.",
                    "Author retrospective for counting solutions to linear and nonlinear constraints through ehrhart polynomials: applications to analyze and transform scientific programs.",
                    "Author retrospective improving data cache performance by pre-executing instructions under a cache miss.",
                    "Author retrospective for optimizing matrix multiply using PHiPAC: a portable high-performance ANSI C coding methodology.",
                    "Author retrospective for software trace cache.",
                    "Author retrospective of Dynamic application scheduling using on-line analytics: then and now.",
                    "Author's retrospective for: improving the performance of speculatively parallel applications on the hydra CMP.",
                    "Author retrospective for characterizing processor architectures for programmable network interfaces.",
                    "Author retrospective for synthesizing transformations for locality enhancement of imperfectly-nested loop nests.",
                    "Author retrospective for adaptive reduction parallelization techniques.",
                    "Author retrospective for analytical cache models with applications to cache partitioning.",
                    "Author retrospective for search and replication in unstructured peer-to-peer networks.",
                    "Author retrospective for bloom filtering cache misses for accurate data speculation and prefetching.",
                    "Author retrospective AEGIS: architecture for tamper-evident and tamper-resistant processing.",
                    "Author retrospective on energy conservation techniques for disk array-based servers.",
                    "Author retrospective for a NUCA substrate for flexible CMP cache sharing.",
                    "Author retrospective for design tradeoffs for tiled CMP on-chip networks.",
                    "Author retrospective for cooperative cache partitioning for chip multiprocessors.",
                    "Author's retrospective for biomedical image analysis on a cooperative cluster of gpus and multicores."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "27th ICS 2013",
        "info": "Eugene, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2013",
                "sub_name": "International Conference on Supercomputing, ICS'13, Eugene, OR, USA - June 10 - 14, 2013.",
                "count": 66,
                "papers": [
                    "Business meets supercomputing: keynote talk.",
                    "Abstractions to separate concerns in semi-regular grids.",
                    "A stencil compiler for short-vector SIMD architectures.",
                    "Exploiting domain knowledge to optimize parallel computational mechanics codes.",
                    "TEAPOT: a toolset for evaluating performance, power and image quality on mobile graphics systems.",
                    "Scaling data race detection for partitioned global address space programs.",
                    "Elastic and scalable tracing and accurate replay of non-deterministic events.",
                    "A new approach for performance analysis of openMP programs.",
                    "Conservative row activation to improve memory power efficiency.",
                    "Active disk meets flash: a case for intelligent SSDs.",
                    "Design of a large-scale storage-class RRAM system.",
                    "Memorage: emerging persistent RAM based malleable main memory and storage architecture.",
                    "Function, latency, bandwidth, power: towards a better computer.",
                    "Improving communication in PGAS environments: static and dynamic coalescing in UPC.",
                    "Bandwidth-optimal all-to-all exchanges in fat tree networks.",
                    "An automatic input-sensitive approach for heterogeneous task partitioning.",
                    "LibWater: heterogeneous distributed computing made easy.",
                    "Exploring hardware overprovisioning in power-constrained, high performance computing.",
                    "The power 775 architecture at scale.",
                    "Bubble coloring: avoiding routing- and protocol-induced deadlocks with minimal virtual channel requirement.",
                    "Evaluating on-die interconnects for a 4 TB/s router.",
                    "Improving numerical accuracy for non-negative matrix multiplication on GPUs using recursive algorithms.",
                    "Toward a scalable multi-GPU eigensolver via compute-intensive kernels and efficient communication.",
                    "High quality real-time image-to-mesh conversion for finite element simulations.",
                    "Tuning the continual flow pipeline architecture.",
                    "Towards more efficient execution: a decoupled access-execute approach.",
                    "Quantifying performance bottleneck cost through differential analysis.",
                    "Efficient sparse matrix-vector multiplication on x86-based many-core processors.",
                    "Expressing graph algorithms using generalized active messages.",
                    "HykSort: a new variant of hypercube quicksort on distributed memory architectures.",
                    "Diagnosis and optimization of application prefetching performance.",
                    "Address-aware fences.",
                    "Prefetching and cache management using task lifetimes.",
                    "The role of computer designers in reverse-engineering the brain.",
                    "Holistic run-time parallelism management for time and energy efficiency.",
                    "G-Charm: an adaptive runtime system for message-driven parallel applications on hybrid systems.",
                    "Implementing OmpSs support for regions of data in architectures with multiple address spaces.",
                    "Automatically adapting programs for mixed-precision floating-point computation.",
                    "CMP off-chip bandwidth scheduling guided by instruction criticality.",
                    "Massively parallel loading.",
                    "MIC-RO: enabling efficient remote offload on heterogeneous many integrated core (MIC) clusters with InfiniBand.",
                    "Efficient scheduling of recursive control flow on GPUs.",
                    "SemCache: semantics-aware caching for efficient GPU offloading.",
                    "Exploiting uniform vector instructions for GPGPU performance, energy efficiency, and opportunistic reliability enhancement.",
                    "Scaling large-data computations on multi-GPU accelerators.",
                    "Hybrid approach for data-flow analysis of MPI programs.",
                    "Improving performance of all-to-all communication through loop scheduling in PGAS environments.",
                    "CUPL: a compile-time uncoalesced memory access pattern locator for CUDA.",
                    "Imbalance optimization in scientific workflows.",
                    "FASTER run-time reconfiguration management.",
                    "MAD7: a memory architecture simulator targeted at design space exploration.",
                    "A decomposition method with minimal communication volume for parallelization of multi-dimensional FFTs.",
                    "A massively parallel domain decomposition method for large-scale DFT electronic structure calculations.",
                    "Multi-layered unstructured mesh generation.",
                    "Network-on-chip for a partially reconfigurable FPGA system.",
                    "Exploiting data parallelism in the yConvex hypergraph algorithm for image representation using GPGPUs.",
                    "The ARMv8 simulator.",
                    "Imogen: a parallel 3D fluid and MHD code for GPUs.",
                    "SMIO: I/O similarity aware virtual machine management invirtual desktop environments.",
                    "Inspector/executor load balancing algorithms for block-sparse tensor contractions.",
                    "Improving performance of openSHMEM reference library by portable PE mapping technique.",
                    "Using platform-independent data locality analysis to predict cache performance on abstract hardware platforms.",
                    "Towards shared memory consistency models for GPUs.",
                    "Exploiting reuse information to reduce refresh energy in on-chip eDRAM caches.",
                    "V-OpenCL: a method to use remote GPGPU.",
                    "Power efficiency in a partially reconfigurable multiprocessor system."
                ]
            },
            {
                "sub_name_abbr": "conf/ics/2013ross",
                "sub_name": "Proceedings of the 3rd International Workshop on Runtime and Operating Systems for Supercomputers, ROSS 2013, Eugene, Oregon, USA, June 10, 2013.",
                "count": 10,
                "papers": [
                    "Characteristics of adaptive runtime systems in HPC.",
                    "Hobbes: composition and virtualization as the foundations of an extreme-scale OS/R.",
                    "A gossip-based approach to exascale system services.",
                    "Enabling accurate power profiling of HPC applications on exascale systems.",
                    "Memory-conscious collective I/O for extreme scale HPC systems.",
                    "Transparently consistent asynchronous shared memory.",
                    "Evaluating the feasibility of using memory content similarity to improve system resilience.",
                    "An early prototype of an autonomic performance environment for exascale.",
                    "Design and implementation of a customizable work stealing scheduler.",
                    "Data deduplication in a hybrid architecture for improving write performance."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "26th ICS 2012",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2012",
                "sub_name": "International Conference on Supercomputing, ICS'12, Venice, Italy, June 25-29, 2012.",
                "count": 38,
                "papers": [
                    "High performance supercomputers: should the individual processor be more than a brick?",
                    "Distributed replay protocol for distributed uniprocessors.",
                    "Characterizing and improving the use of demand-fetched caches in GPUs.",
                    "One stone two birds: synchronization relaxation and redundancy removal in GPU-CPU translation.",
                    "Fast loop-level data dependence profiling.",
                    "Apricot: an optimizing compiler and productivity tool for x86-compatible many-core coprocessors.",
                    "UniFI: leveraging non-volatile memories for a unified fault tolerance and idle power management technique.",
                    "Fault tolerant preconditioned conjugate gradient for sparse linear system solution.",
                    "Data-driven fault tolerance for work stealing computations.",
                    "Fault resilience of the algebraic multi-grid solver.",
                    "Overcoming single-thread performance hurdles in the core fusion reconfigurable multicore architecture.",
                    "CVP: an energy-efficient indirect branch prediction with compiler-guided value pattern.",
                    "Congestion avoidance on manycore high performance computing systems.",
                    "Channel borrowing: an energy-efficient nanophotonic crossbar architecture with light-weight arbitration.",
                    "HiRe: using hint & release to improve synchronization of speculative threads.",
                    "Enhancing the performance of assisted execution runtime systems through hardware/software techniques.",
                    "CATS: cache aware task-stealing based on online profiling in multi-socket multi-core architectures.",
                    "CRQ-based fair scheduling on composable multicore architectures.",
                    "Quantifying the effectiveness of load balance algorithms.",
                    "Sparse matrix-vector multiply on the HICAMP architecture.",
                    "On the communication complexity of 3D FFTs and its implications for Exascale.",
                    "Composable, non-blocking collective operations on power7 IH.",
                    "Collective algorithms for sub-communicators.",
                    "Space-round tradeoffs for MapReduce computations.",
                    "Blue Gene/Q: design for sustained multi-petaflop computing.",
                    "An analysis of computational workloads for the ORNL Jaguar system.",
                    "Multiple sub-row buffers in DRAM: unlocking performance and energy improvement opportunities.",
                    "Unified memory optimizing architecture: memory subsystem control with a unified predictor.",
                    "Locality & utility co-optimization for practical capacity management of shared last level caches.",
                    "Exploiting communication and packaging locality for cost-effective large scale networks.",
                    "Hardware support for enforcing isolation in lock-based parallel programs.",
                    "High-performance code generation for stencil computations on GPU architectures.",
                    "An efficient work-distribution strategy for gridding radio-telescope data on GPUs.",
                    "GPU merge path: a GPU merging algorithm.",
                    "SnuCL: an OpenCL framework for heterogeneous CPU/GPU clusters.",
                    "clSpMV: A Cross-Platform OpenCL SpMV Framework on GPUs.",
                    "Enabling and scaling matrix computations on heterogeneous multi-core and multi-GPU systems.",
                    "An optimized large-scale hybrid DGEMM design for CPUs and ATI GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/ics/2012futurehpc",
                "sub_name": "Proceedings of the Future HPC Systems - the Challenges of Power-Constrained Performance, FutureHPC@ICS 2012, Venezia, Italy, June 25, 2012.",
                "count": 3,
                "papers": [
                    "EURORA: a European architecture toward exascale.",
                    "Janus2: an FPGA-based supercomputer for spin glass simulations.",
                    "On the scalability of the clusters-booster concept: a critical assessment of the DEEP architecture."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "25th ICS 2011",
        "info": "Tucson, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2011",
                "sub_name": "Proceedings of the 25th International Conference on Supercomputing, 2011, Tucson, AZ, USA, May 31 - June 04, 2011.",
                "count": 52,
                "papers": [
                    "Rethinking shared-memory languages and hardware.",
                    "An execution strategy and optimized runtime support for parallelizing irregular reductions on modern GPUs.",
                    "Automatic generation of executable communication specifications from parallel applications.",
                    "Hystor: making the best use of solid state drives in high performance storage systems.",
                    "Transactional conflict decoupling and value prediction.",
                    "Multiset signatures for transactional memory.",
                    "ZEBRA: a data-centric, hybrid-policy hardware transactional memory design.",
                    "Scalable fine-grained call path tracing.",
                    "Generic topology mapping strategies for large-scale parallel architectures.",
                    "Page placement in hybrid memory systems.",
                    "Performance impact and interplay of SSD parallelism through advanced commands, allocation strategy and data granularity.",
                    "SecureME: a hardware-software approach to full system security.",
                    "Processing data streams with hard real-time constraints on heterogeneous systems.",
                    "Coordinating processor and main memory for efficientserver power control.",
                    "Optimizing throughput/power trade-offs in hardware transactional memory using DVFS and intelligent scheduling.",
                    "Challenges and opportunities in renewable energy and energy efficiency.",
                    "Characterizing the impact of soft errors on iterative methods in scientific computing.",
                    "High performance linpack benchmark: a fault tolerant implementation without checkpointing.",
                    "Modeling the performance of an algebraic multigrid cycle on HPC platforms.",
                    "Optimizing the datacenter for data-centric workloads.",
                    "Predictive coordination of multiple on-chip resources for chip multiprocessors.",
                    "An idiom-finding tool for increasing productivity of accelerators.",
                    "Performance modeling as the key to extreme scale computing.",
                    "Mint: realizing CUDA performance in 3D stencil methods with annotated C.",
                    "MDR: performance model driven runtime for heterogeneous parallel platforms.",
                    "Active pebbles: parallel programming for data-driven applications.",
                    "Automating GPU computing in MATLAB.",
                    "Using GPUs to compute large out-of-card FFTs.",
                    "Automatic SIMD vectorization of fast fourier transforms for the larrabee and AVX instruction sets.",
                    "Cost-effectively offering private buffers in SoCs and CMPs.",
                    "A composite and scalable cache coherence protocol for large scale CMPs.",
                    "Controlling cache utilization of HPC applications.",
                    "Cosmic microwave background map-making at the petascale and beyond.",
                    "A QHD-capable parallel H.264 decoder.",
                    "MP-PIPE: a massively parallel protein-protein interaction prediction engine.",
                    "The elephant and the mice: the role of non-strict fine-grain synchronization for modern many-core architectures.",
                    "F2BFLY: an on-chip free-space optical network with wavelength-switching.",
                    "Karma: scalable deterministic record-replay.",
                    "SRC: information retrieval as a persistent parallel service on supercomputer infrastructure.",
                    "SRC: Damaris - using dedicated i/o cores for scalable post-petascale HPC simulations.",
                    "SRC: FenixOS - a research operating system focused on high scalability and reliability.",
                    "SRC: soft error detection and recovery for high performance linpack.",
                    "Poster: DVFS management in real-processors.",
                    "SRC: OpenSHMEM library development.",
                    "SRC: enabling petascale data analysis for scientific applications through data reorganization.",
                    "SRC: virtual i/o caching: dynamic storage cache management for concurrent workloads.",
                    "SRC: an automatic code overlaying technique for multicores with explicitly-managed memory hierarchies.",
                    "Poster: programming clusters of GPUs with OMPSs.",
                    "Poster: revisiting virtual channel memory for performance and fairness on multi-core architecture.",
                    "Poster: implications of merging phases on scalability of multi-core architectures.",
                    "SRC: facilitating efficient parallelization of information storage and retrieval on large data sets.",
                    "SRC: automatic extraction of SST/macro skeleton models."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "24th ICS 2010",
        "info": "Tsukuba, Ibaraki, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2010",
                "sub_name": "Proceedings of the 24th International Conference on Supercomputing, 2010, Tsukuba, Ibaraki, Japan, June 2-4, 2010.",
                "count": 35,
                "papers": [
                    "Exascale science: the next frontier in high performance computing.",
                    "Throughput computing.",
                    "The next-generation supercomputer project and a plan for the advanced institute for computational science.",
                    "Overlapping communication and computation by using a hybrid MPI/SMPSs approach.",
                    "Quantifying performance benefits of overlap using MPI-2 in a seismic modeling application.",
                    "Optimal bucket algorithms for large MPI collectives on torus interconnects.",
                    "The auction: optimizing banks usage in Non-Uniform Cache Architectures.",
                    "Cache oblivious parallelograms in iterative stencil computations.",
                    "Making nested parallel transactions practical using lightweight hardware support.",
                    "Fast and accurate NCBI BLASTP: acceleration with multiphase FPGA-based prefiltering.",
                    "ParaLearn: a massively parallel, scalable system for learning interaction networks on FPGAs.",
                    "High-throughput Bayesian network learning using heterogeneous multicore computers.",
                    "Evaluation of parallel H.264 decoding strategies for the Cell Broadband Engine.",
                    "Streamlining GPU applications on the fly: thread divergence elimination through runtime thread-data remapping.",
                    "An experimental approach to performance measurement of heterogeneous parallel applications using CUDA.",
                    "Compiler and runtime support for enabling generalized reduction computations on heterogeneous parallel configurations.",
                    "Decomposable and responsive power models for multicore processors using performance counters.",
                    "Enigma: architectural and operating system support for reducing the impact of address translation.",
                    "Timing local streams: improving timeliness in data prefetching.",
                    "SAMS multi-layout memory: providing multiple views of data to boost SIMD performance.",
                    "An approach to resource-aware co-scheduling for CMPs.",
                    "A query language for understanding component interactions in production systems.",
                    "Adaptive multi-level cache allocation in distributed storage architectures.",
                    "InterferenceRemoval: removing interference of disk access for MPI programs through data replication.",
                    "Indemics: an interactive data intensive framework for high performance epidemic simulation.",
                    "Clustering performance data efficiently at massive scales.",
                    "Speeding up Nek5000 with autotuning and specialization.",
                    "Handling task dependencies under strided and aliased references.",
                    "How to unleash array optimizations on code using recursive data structures.",
                    "A compiler-automated array compression scheme for optimizing memory intensive programs.",
                    "Static reuse distances for locality-based optimizations in MATLAB.",
                    "An empirically tuned 2D and 3D FFT library on CUDA GPU.",
                    "Large-scale FFT on GPU clusters.",
                    "FPGA accelerating double/quad-double high precision floating-point applications for ExaScale computing.",
                    "Small-ruleset regular expression matching on GPGPUs: quantitative performance analysis and optimization."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "23rd ICS 2009",
        "info": "Yorktown Heights, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2009",
                "sub_name": "Proceedings of the 23rd international conference on Supercomputing, 2009, Yorktown Heights, NY, USA, June 8-12, 2009.",
                "count": 68,
                "papers": [
                    "A european perspective on supercomputing.",
                    "The roadrunner project and the importance of energy efficiency on the road to exascale computing.",
                    "Computing outside the box.",
                    "Implementation of a wide-angle lens distortion correction algorithm on the cell broadband engine.",
                    "High-performance regular expression scanning on the Cell/B.E. processor.",
                    "Computer generation of fast fourier transforms for the cell broadband engine.",
                    "DBDB: optimizing DMATransfer for the cell be architecture.",
                    "Zero-content augmented caches.",
                    "Dynamic cache clustering for chip multiprocessors.",
                    "Less reused filter: improving l2 cache performance via filtering less reused lines.",
                    "Divide-and-conquer: a bubble replacement for low level caches.",
                    "OhHelp: a scalable domain-decomposing dynamic load balancing for particle-in-cell simulations.",
                    "Pattern-based sparse matrix representation for memory-efficient SMVM kernels.",
                    "Dynamic topology aware load balancing algorithms for molecular dynamics applications.",
                    "Fast memory snapshot for concurrent programmingwithout synchronization.",
                    "QuakeTM: parallelizing a complex sequential application using transactional memory.",
                    "Refereeing conflicts in hardware transactional memory.",
                    "Parametric multi-level tiling of imperfectly nested loops.",
                    "Dynamic parallelization of single-threaded binary programs using speculative slicing.",
                    "Synchronization optimizations for efficient execution on multi-cores.",
                    "Chunking parallel loops in the presence of synchronization.",
                    "Efficient high performance collective communication for the cell blade.",
                    "Practice of parallelizing network applications on multi-core architectures.",
                    "Towards 100 gbit/s ethernet: multicore-based parallel communication protocol design.",
                    "Virtualization polling engine (VPE): using dedicated CPU cores to accelerate I/O virtualization.",
                    "Fast and scalable list ranking on the GPU.",
                    "Tuned and wildly asynchronous stencil kernels for hybrid CPU/GPU systems.",
                    "Performance modeling and automatic ghost zone optimization for iterative stencil loops on GPUs.",
                    "Creating artificial global history to improve branch prediction accuracy.",
                    "Exploring pattern-aware routing in generalized fat tree networks.",
                    "Understanding the interconnection network of SpiNNaker.",
                    "A graph based approach for MPI deadlock detection.",
                    "Maximizing MPI point-to-point communication performance on RDMA-enabled clusters with customized protocols.",
                    "MPI-aware compiler optimizations for improving communication-computation overlap.",
                    "Evaluating high performance communication: a power perspective.",
                    "FTL design exploration in reconfigurable high-performance SSD for server applications.",
                    "/scratch as a cache: rethinking HPC center scratch storage.",
                    "P-Code: a new RAID-6 code with optimal properties.",
                    "R-ADMAD: high reliability provision for large-scale de-duplication archival storage systems.",
                    "Single-particle 3d reconstruction from cryo-electron microscopy images on GPU.",
                    "How GPUs can outperform ASICs for fast LDPC decoding.",
                    "A translation system for enabling data mining applications on GPUs.",
                    "Combining thread level speculation helper threads and runahead execution.",
                    "Limited early value communication to improve performance of transactional memory.",
                    "EpiFast: a fast algorithm for large scale realistic epidemic simulations on distributed memory systems.",
                    "Using many-core hardware to correlate radio astronomy signals.",
                    "A parallel levenberg-marquardt algorithm.",
                    "Adagio: making DVS practical for complex HPC applications.",
                    "A comprehensive power-performance model for NoCs with multi-flit channel buffers.",
                    "Rate-based QoS techniques for cache/memory in CMP platforms.",
                    "MPI collective communications on the blue gene/p supercomputer: algorithms and optimizations.",
                    "TransMetric: architecture independent workload characterization for transactional memory benchmarks.",
                    "Cancellation of loads that return zero using zero-value caches.",
                    "Auto-vectorization through code generation for stream processing applications.",
                    "Subdomain communication to increase scalability in large-scale scientific applications.",
                    "Access map pattern matching for data cache prefetch.",
                    "Prediction-based power estimation and scheduling for CMPs.",
                    "Design of a novel SIMD architecture by fusing operations and registers.",
                    "Thrifty interconnection network for HPC systems.",
                    "Performance modeling for DFT algorithms in FFTW.",
                    "PARSEC: hardware profiling of emerging workloads for CMP design.",
                    "Approximate kernel matrix computation on GPUs forlarge scale learning applications.",
                    "Dynamic task set partitioning based on balancing memory requirements to reduce power consumption.",
                    "High-performance CUDA kernel execution on FPGAs.",
                    "Load balancing using work-stealing for pipeline parallelism in emerging applications.",
                    "Prefetch optimizations on large-scale applications via parameter value prediction.",
                    "Designing multi-socket systems using silicon photonics.",
                    "An infrastructure for scalable and portable parallel programs for computational chemistry."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "22nd ICS 2008",
        "info": "Island of Kos, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2008",
                "sub_name": "Proceedings of the 22nd Annual International Conference on Supercomputing, ICS 2008, Island of Kos, Greece, June 7-12, 2008.",
                "count": 40,
                "papers": [
                    "Many-core GPU computing with NVIDIA CUDA.",
                    "Challenges on the road to exascale computing.",
                    "Petaflop/s, seriously.",
                    "Implementing Wilson-Dirac operator on the cell broadband engine.",
                    "Biomedical image analysis on a cooperative cluster of GPUs and multicores.",
                    "Data mining on the cell broadband engine.",
                    "Accurate memory signatures and synthetic address traces for HPC applications.",
                    "Preserving time in large-scale communication traces.",
                    "A freespace crossbar for multi-core processors.",
                    "An approach for adaptive DRAM temperature and power management.",
                    "The shared-thread multiprocessor.",
                    "Advanced collective communication in aspen.",
                    "The deep computing messaging framework: generalized scalable message passing on the blue gene/P supercomputer.",
                    "A projection-based optimization framework for abstractions with application to the unstructured mesh domain.",
                    "CprFS: a user-level file system to support consistent file states for checkpoint and restart.",
                    "Timely offloading of result-data in HPC centers.",
                    "Shifted declustering: a placement-ideal layout scheme for multi-way replication storage architecture.",
                    "Can software reliability outperform hardware reliability on high performance interconnects?: a case study with MPI over infiniband.",
                    "Soft error vulnerability of iterative linear algebra methods.",
                    "Evaluating the effect of replacing CNK with linux on the compute-nodes of blue gene/l.",
                    "Power-aware dynamic placement of HPC applications.",
                    "Autonomous learning for efficient resource utilization of dynamic VM migration.",
                    "Adaptive runtime tuning of parallel sparse matrix-vector multiplication on distributed memory systems.",
                    "Fast scan algorithms on graphics processors.",
                    "Three-dimensional delaunay refinement for multi-core processors.",
                    "A compiler framework for optimization of affine loop nests for gpgpus.",
                    "Rotating register allocation with multiple rotating branches.",
                    "Automatic SIMD vectorization of chains of recurrences.",
                    "Optimizing irregular shared-memory applications for clusters.",
                    "Performance portable optimizations for loops containing communication operations.",
                    "Phasers: a unified deadlock-free construct for collective and point-to-point synchronization.",
                    "Orchestrating data transfer for the cell/B.E. processor.",
                    "CUBA: an architecture for efficient CPU/co-processor data communication.",
                    "Efficient computation of sum-products on GPUs through software-managed cache.",
                    "Exploiting idle register classes for fast spill destination.",
                    "Analysis of dynamic power management on multi-core processors.",
                    "Focused prefetching: performance oriented prefetching based on commit stalls.",
                    "Automatic analysis of speedup of MPI applications.",
                    "Analyzing memory access intensity in parallel programs on multicore.",
                    "A regression-based approach to scalability prediction."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "21st ICS 2007",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2007",
                "sub_name": "Proceedings of the 21th Annual International Conference on Supercomputing, ICS 2007, Seattle, Washington, USA, June 17-21, 2007.",
                "count": 31,
                "papers": [
                    "Current trends in computer architectures: multi-cores, many-cores and special-cores.",
                    "Harnessing massive parallelism in the era of parallelism for the masses.",
                    "Scalability of the Nutch search engine.",
                    "Scalability analysis of SPMD codes using expectations.",
                    "Proactive fault tolerance for HPC with Xen virtualization.",
                    "Optimization and bottleneck analysis of network block I/O in commodity storage systems.",
                    "GridRod: a dynamic runtime scheduler for grid workflows.",
                    "Locality of sampling and diversity in parallel system workloads.",
                    "Modeling correlated workloads by combining model based clustering and a localized sampling algorithm.",
                    "Characteristics of workloads used in high performance and technical computing.",
                    "An operation stacking framework for large ensemble computations.",
                    "Executing irregular scientific applications on stream architectures.",
                    "A symmetric transformation for 3-body potential molecular dynamics using force-decomposition in a heterogeneous distributed environment.",
                    "Representation-transparent matrix algorithms with scalable performance.",
                    "Tradeoff between data-, instruction-, and thread-level parallelism in stream processors.",
                    "An L2-miss-driven early register deallocation for SMT processors.",
                    "Sequencer virtualization.",
                    "Automatic nonblocking communication for partitioned global address space programs.",
                    "A study of process arrival patterns for MPI collective operations.",
                    "High performance MPI design using unreliable datagram for ultra-scale InfiniBand clusters.",
                    "Compression in cache design.",
                    "Performance driven data cache prefetching in a dynamic software optimization system.",
                    "Optimization of data prefetch helper threads with path-expression based statistical modeling.",
                    "Increasing cache capacity through word filtering.",
                    "Active memory operations.",
                    "Cooperative cache partitioning for chip multiprocessors.",
                    "A low-cost mixed-mode parallel processor architecture for embedded systems.",
                    "Sensitivity analysis for automatic parallelization on multi-cores.",
                    "Adaptive performance control for distributed scientific coupled models.",
                    "Adaptive Strassen's matrix multiplication.",
                    "Scheduling FFT computation on SMP and multicore systems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "20th ICS 2006",
        "info": "Cairns, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2006",
                "sub_name": "Proceedings of the 20th Annual International Conference on Supercomputing, ICS 2006, Cairns, Queensland, Australia, June 28 - July 01, 2006.",
                "count": 39,
                "papers": [
                    "A modern high-performance processor pipeline.",
                    "Experimental evaluation of application-level checkpointing for OpenMP programs.",
                    "Cooperative checkpointing: a robust approach to large-scale systems reliability.",
                    "On the performance potential of different types of speculative thread-level parallelism: The DL version of this paper includes corrections that were not made available in the printed proceedings.",
                    "BranchTap: improving performance with very few checkpoints through adaptive speculation control.",
                    "Selective predicate prediction for out-of-order processors.",
                    "Wide and efficient trace prediction using the local trace predictor.",
                    "Scientific applications vs. SPEC-FP: a comparison of program behavior.",
                    "The exigency of benchmark and compiler drift: designing tomorrow's processors with yesterday's tools.",
                    "Accurate memory data flow modeling in statistical simulation.",
                    "Efficient remote block-level I/O over an RDMA-capable NIC.",
                    "A scalable communication layer for multi-dimensional hyper crossbar network using multiple gigabit ethernet.",
                    "Large files, small writes, and pNFS.",
                    "A case for high performance computing with virtual machines.",
                    "Implementing virtual memory in a vector processor with software restart markers.",
                    "Multigrid and Gauss-Seidel smoothers revisited: parallelization on chip multiprocessors.",
                    "Quantum mechanical approaches to information processing.",
                    "Online power-performance adaptation of multithreaded programs using hardware event-based prediction.",
                    "A scalable low power issue queue for large instruction window processors.",
                    "Design space exploration for multicore architectures: a power/performance/thermal view.",
                    "Design tradeoffs for tiled CMP on-chip networks.",
                    "STAR-MPI: self tuned adaptive routines for MPI collective operations.",
                    "Scaling MPI to short-memory MPPs such as BG/L.",
                    "Scalable, fault tolerant membership for MPI tasks on HPC systems.",
                    "Coupling prefix caching and collective downloads for remote dataset access.",
                    "Heterogeneous way-size cache.",
                    "Profitable loop fusion and tiling using model-driven empirical search.",
                    "TMA: a trap-based memory architecture.",
                    "Scalable algorithms for global snapshots in distributed systems.",
                    "Feedback-directed memory disambiguation through store distance analysis.",
                    "Accelerator design for protein sequence HMM search.",
                    "A distributed system based on web services for computational science simulations.",
                    "Accelerating sparse matrix computations via data compression.",
                    "Sensitivity analysis of knapsack-based task scheduling on the grid.",
                    "Probabilistic accuracy bounds for fault-tolerant computations that discard tasks.",
                    "Violated dependence analysis.",
                    "User-guided symbiotic space-sharing of real workloads.",
                    "MPIPP: an automatic profile-guided parallel process placement toolset for SMP clusters and multiclusters.",
                    "Lightweight lock-free synchronization methods for multithreading."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "19th ICS 2005",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2005",
                "sub_name": "Proceedings of the 19th Annual International Conference on Supercomputing, ICS 2005, Cambridge, Massachusetts, USA, June 20-22, 2005.",
                "count": 42,
                "papers": [
                    "Reducing latencies of pipelined cache accesses through set prediction.",
                    "Characterization of L3 cache behavior of SPECjAppServer2002 and TPC-C.",
                    "A hybrid hardware/software approach to efficiently determine cache coherence Bottlenecks.",
                    "A NUCA substrate for flexible CMP cache sharing.",
                    "Fast branch misprediction recovery in out-of-order superscalar processors.",
                    "Tornado warning: the perils of selective replay in multithreaded processors.",
                    "An asymmetric clustered processor based on value content.",
                    "A heterogeneously segmented cache architecture for a packet forwarding engine.",
                    "Low-overhead call path profiling of unmodified, optimized code.",
                    "Design of a next generation sampling service for large scale data analysis applications.",
                    "Online performance analysis by statistical sampling of microprocessor performance counters.",
                    "Improved automatic testcase synthesis for performance model validation.",
                    "Automatic thread distribution for nested parallelism in OpenMP.",
                    "Lightweight reference affinity analysis.",
                    "Think globally, search locally.",
                    "Facilitating the search for compositions of program transformations.",
                    "Generating new general compiler optimization settings.",
                    "An integrated simdization framework using virtual vectors.",
                    "Tasking with out-of-order spawn in TLS chip multiprocessors: microarchitecture and compilation.",
                    "Towards automatic translation of OpenMP to MPI.",
                    "TAPE: a transactional application profiling environment.",
                    "Low-power, low-complexity instruction issue using compiler assistance.",
                    "Thread-Level Speculation on a CMP can be energy efficient.",
                    "Power-aware resource allocation in high-end systems via online simulation.",
                    "The architecture of the HP Superdome shared-memory multiprocessor.",
                    "Scaling physics and material science applications on a massively parallel Blue Gene/L system.",
                    "Optimization of MPI collective communication on BlueGene/L systems.",
                    "Transparent caching with strong consistency in dynamic content web sites.",
                    "Disk layout optimization for reducing energy consumption.",
                    "Continuous Replica Placement schemes in distributed systems.",
                    "A performance-conserving approach for reducing peak power consumption in server systems.",
                    "System noise, OS clock ticks, and fine-grained parallel applications.",
                    "Another approach to backfilled jobs: applying virtual malleability to expired windows.",
                    "High performance support of parallel virtual file system (PVFS2) over Quadrics.",
                    "The implications of working set analysis on supercomputing memory hierarchy design.",
                    "Improving the computational intensity of unstructured mesh applications.",
                    "Parallel sparse LU factorization on second-class message passing platforms.",
                    "Cache oblivious stencil computations.",
                    "Multigrain parallel Delaunay Mesh generation: challenges and opportunities for multithreaded architectures.",
                    "What is worth learning from parallel workloads?: a user and session based analysis.",
                    "affinity-on-next-touch: increasing the performance of an industrial PDE solver on a cc-NUMA system.",
                    "Automatic generation and tuning of MPI collective communication routines."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "18th ICS 2004",
        "info": "Saint Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2004",
                "sub_name": "Proceedings of the 18th Annual International Conference on Supercomputing, ICS 2004, Saint Malo, France, June 26 - July 01, 2004.",
                "count": 35,
                "papers": [
                    "Effective stream-based and execution-based data prefetching.",
                    "Enhancing data cache reliability by the addition of a small fully-associative replication cache.",
                    "Inter-reference gap distribution replacement: an improved replacement algorithm for set-associative caches.",
                    "Parallel algorithms for mining frequent structural motifs in scientific data.",
                    "Impact of far-field interactions on performance of multipole-based preconditioners for sparse linear systems.",
                    "Practical and efficient point insertion scheduling method for parallel guaranteed quality delaunay refinement.",
                    "Integrating collective I/O and cooperative caching into the \"clusterfile\" parallel file system.",
                    "Energy conservation techniques for disk array-based servers.",
                    "PB-LRU: a self-tuning power aware storage cache replacement algorithm for conserving disk energy.",
                    "Automatic re-scheduling of dependencies in a RPC-based grid.",
                    "Time and space optimization for processing groups of multi-dimensional scientific queries.",
                    "A unified framework for nonlinear dependence testing and symbolic analysis.",
                    "Design space exploration of caches using compressed traces.",
                    "EXPERT: expedited simulation exploiting program behavior repetition.",
                    "Multilevel hierarchical matrix multiplication on clusters.",
                    "A dynamic application-driven data communication strategy.",
                    "Implementation and performance evaluation of CONFLEX-G: grid-enabled molecular conformational space search program with OmniRPC.",
                    "Characterizing a new class of threads in scientific applications for high end supercomputers.",
                    "Performance characteristics of the Cray X1 and their implications for application performance tuning.",
                    "Evaluating support for global address space languages on the Cray X1.",
                    "The energy efficiency of CMP vs. SMT for multimedia workloads.",
                    "Data forwarding through in-memory precomputation threads.",
                    "Scaling the issue window with look-ahead latency prediction.",
                    "Implicit java array bounds checking on 64-bit architecture.",
                    "Adaptive Java optimisation using instance-based learning.",
                    "Applications of storage mapping optimization to register promotion.",
                    "CQoS: a framework for enabling QoS in shared caches of CMP platforms.",
                    "Adaptive paging for a multifrontal solver.",
                    "Adaptive incremental checkpointing for massively parallel systems.",
                    "Detailed cache coherence characterization for OpenMP benchmarks.",
                    "An analysis of the impact of MPI overlap and independent progress.",
                    "A comparison of sequential consistency with home-based lazy release consistency for software distributed shared memory.",
                    "Back-end assignment schemes for clustered multithreaded processors.",
                    "Cluster prefetch: tolerating on-chip wire delays in clustered microarchitectures.",
                    "Cluster scheduling for explicitly-speculative tasks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "17th ICS 2003",
        "info": "San Francisico, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2003",
                "sub_name": "Proceedings of the 17th Annual International Conference on Supercomputing, ICS 2003, San Francisco, CA, USA, June 23-26, 2003.",
                "count": 37,
                "papers": [
                    "Keynote: Wireless networks... what does the future have in store?",
                    "Selecting long atomic traces for high coverage.",
                    "Recycling waste: exploiting wrong-path execution to improve branch prediction.",
                    "Partitioned first-level cache design for clustered microarchitectures.",
                    "A fast approximate interprocedural analysis for speculative multithreading compilers.",
                    "Compiler support for efficient processing of XML datasets.",
                    "A framework for incremental extensible compiler construction.",
                    "A performance analysis of the Berkeley UPC compiler.",
                    "Keynote: Is there anything more to learn about high performance processors?",
                    "A compiler approach for reducing data cache energy.",
                    "Conserving disk energy in network servers.",
                    "PowerHerd: dynamic satisfaction of peak power constraints in interconnection networks.",
                    "Predictive dynamic thermal management for multimedia applications.",
                    "Evaluation of the memory page migration influence in the system performance: the case of the SGI O2000.",
                    "Modeling and optimization of non-blocking checkpointing for optimistic simulation on myrinet clusters.",
                    "Performance characteristics of openMP constructs, and application benchmarks on a large symmetric multiprocessor.",
                    "Estimating cache misses and locality using stack distances.",
                    "AEGIS: architecture for tamper-evident and tamper-resistant processing.",
                    "Reducing register ports using delayed write-back queues and operand pre-fetch.",
                    "Predicate prediction for efficient out-of-order execution.",
                    "A GSA-based compiler infrastructure to extract parallelism from complex loops.",
                    "The impact of data dependence analysis on compilation and program parallelization.",
                    "Inter-procedural stacked register allocation for itanium® like architecture.",
                    "Result checking in global computing systems.",
                    "Collective operations in application-level fault-tolerant MPI.",
                    "Placement of I/O servers to improve parallel I/O performance on switch-based clusters.",
                    "Profile-guided I/O partitioning.",
                    "miNI: reducing network interface memory requirements with dynamic handle lookup.",
                    "Inferential queueing and speculative push for reducing critical communication latencies.",
                    "Automatic fence insertion for shared memory multiprocessing.",
                    "High performance RDMA-based MPI implementation over InfiniBand.",
                    "A new speculation technique to optimize floating-point performance while preserving bit-by-bit reproducibility.",
                    "Dynamic memory instruction bypassing.",
                    "Enhancing memory level parallelism via recovery-free value prediction.",
                    "Enhancing scalability of parallel structured AMR calculations.",
                    "A high performance multi-perspective vision studio.",
                    "Roccom: an object-oriented, data-centric software integration framework for multiphysics simulations."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "16th ICS 2002",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2002",
                "sub_name": "Proceedings of the 16th international conference on Supercomputing, ICS 2002, New York City, NY, USA, June 22-26, 2002.",
                "count": 34,
                "papers": [
                    "Can the earth simulator change the way humans think?",
                    "Leveraging cache coherence in active memory systems.",
                    "The architecture of the DIVA processing-in-memory chip.",
                    "Heterogeneous multi-computer system: a new platform for multi-paradigm scientific simulation.",
                    "Critical power slope: understanding the runtime effects of frequency scaling.",
                    "Latency and energy aware value prediction for high-frequency processors.",
                    "Low-complexity reorder buffer architecture.",
                    "A deterministic fault-tolerant and deadlock-free routing protocol in 2-D meshes based on odd-even turn model.",
                    "A network-failure-tolerant message-passing system for terascale clusters.",
                    "Search and replication in unstructured peer-to-peer networks.",
                    "Challenges and opportunities in autonomic computing.",
                    "A comparative study of modulo scheduling techniques.",
                    "Affinity-based cluster assignment for unrolled loops.",
                    "Optimal software pipelining of loops with control flows.",
                    "BProc: the Beowulf distributed process space.",
                    "DualFS: a new journaling file system without meta-data duplication.",
                    "Markov model prediction of I/O requests for scientific applications.",
                    "Active buffering plus compressed migration: an integrated solution to parallel simulations' data transport needs.",
                    "Profile-guided post-link stride prefetching.",
                    "Boosting trace cache performance with nonhead miss speculation.",
                    "Bloom filtering cache misses for accurate data speculation and prefetching.",
                    "Execution history guided instruction prefetching.",
                    "Clustered approaches to HPC via commodity HW + highly evolved SW.",
                    "An interleaved cache clustered VLIW processor.",
                    "Dual path instruction processing.",
                    "Using predicate path information in hardware to determine true dependences.",
                    "Compiler supported high-level abstractions for sparse disk-resident datasets.",
                    "Computation regrouping: restructuring programs for temporal data cache locality.",
                    "Instance-wise points-to analysis for loop-based dependence testing.",
                    "Hybrid analysis: static & dynamic memory reference analysis.",
                    "A voxel-based parallel collision detection algorithm.",
                    "Parallelization and performance of 3D ultrasound imaging beamforming algorithms on modern clusters.",
                    "Experiences tuning SMG98: a semicoarsening multigrid benchmark based on the hypre library.",
                    "Near-optimal adaptive control of a large grid application."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "15th ICS 2001",
        "info": "Sorrento, Napoli, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2001",
                "sub_name": "Proceedings of the 15th international conference on Supercomputing, ICS 2001, Sorrento, Napoli, Italy, June 16-21, 2001.",
                "count": 45,
                "papers": [
                    "Analytical cache models with applications to cache partitioning.",
                    "A synthesis of memory mechanisms for distributed architectures.",
                    "The trade-off between implicit and explicit data distribution in shared-memory programming paradigms.",
                    "Fractal symbolic analysis.",
                    "Data locality enhancement by memory reduction.",
                    "Eliminating redundancies in sum-of-product array computations.",
                    "Monotonic evolution: an alternative to induction variable substitution for dependence analysis.",
                    "Optimizing strategies for telescoping languages: procedure strength reduction and procedure vectorization.",
                    "Loop optimization for a class of memory-constrained computations.",
                    "Fast parallel in-memory 64-bit sorting.",
                    "Optimizing locality for ODE solvers.",
                    "Array language support for parallel sparse computation.",
                    "A parallel algorithm for sparse symbolic LU factorization without pivoting on out-of-core matrices.",
                    "Tools for application-oriented performance tuning.",
                    "Global optimization techniques for automatic parallelization of hybrid applications.",
                    "Tuning high-performance scientific codes: the use of performance models to control resource usage during data migration and I/O.",
                    "Computer aided hand tuning (CAHT): \"applying case-based reasoning to performance tuning\".",
                    "Cache performance for multimedia applications.",
                    "On the potential of tolerant region reuse for multimedia applications.",
                    "Evaluation of processor code efficiency for embedded systems.",
                    "Improving 3D geometry transformations on a simultaneous multithreaded SIMD processor.",
                    "Bringing together automatic differentiation and OpenMP.",
                    "Automatic code generation for a turbulence scheme.",
                    "Towards the effective parallel computation of matrix pseudospectra.",
                    "A graphical tool for driving the parallel computation of pseudosprectra.",
                    "Register-sensitive selection, duplication, and sequencing of instructions.",
                    "Load and store reuse using register file contents.",
                    "Improving Gang Scheduling through job performance analysis and malleability.",
                    "Reducing the complexity of the issue logic.",
                    "Slice-processors: an implementation of operation-based prediction.",
                    "Building a high-performance communication layer over virtual interface architecture on Linux clusters.",
                    "Integrating superscalar processor components to implement register caching.",
                    "alpha-coral: a multigrain, multithreaded processor architecture.",
                    "Multiplex: unifying conventional and speculative thread-level parallelism on a chip multiprocessor.",
                    "Optimizing threaded MPI execution on SMP clusters.",
                    "Demonstrating the scalability of a molecular dynamics application on a Petaflop computer.",
                    "Computational challenges in large-scale air pollution modelling.",
                    "A network of cellular automata for a landslide simulation.",
                    "Improving Java performance using hardware translation.",
                    "A framework for efficient reuse of binary code in Java.",
                    "Algorithmic modifications to the Jacobi-Davidson parallel eigensolver to dynamically balance external CPU and memory load.",
                    "Workload decomposition for particle simulation applications on hierarchical distributed-shared memory parallel systems with integration of HPF and OpenMP.",
                    "ARIMA time series modeling and forecasting for adaptive I/O prefetching.",
                    "Evaluating the impact of memory system performance on software prefetching and locality optimizations.",
                    "A novel renaming mechanism that boosts software prefetching."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "14th ICS 2000",
        "info": "Santa Fe, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/2000",
                "sub_name": "Proceedings of the 14th international conference on Supercomputing, ICS 2000, Santa Fe, NM, USA, May 8-11, 2000.",
                "count": 33,
                "papers": [
                    "Automatic loop transformations and parallelization for Java.",
                    "Compiling object-oriented data intensive applications.",
                    "Using complete system simulation to characterize SPECjvm98 benchmarks.",
                    "Performance evaluation of a new routing strategy for irregular networks with source routing.",
                    "Improving parallel system performance by changing the arrangement of the network links.",
                    "Characterizing processor architectures for programmable network interfaces.",
                    "Adaptive reduction parallelization techniques.",
                    "A compiler method for the parallel execution of irregular reductions in scalable shared memory multiprocessors.",
                    "Next-generation generic programming and its application to sparse matrix computations.",
                    "A simulation-based study of scheduling mechanisms for a dynamic cluster environment.",
                    "Design of dynamic load-balancing tools for parallel applications.",
                    "A case for use-level dynamic page migration.",
                    "Fast greedy weighted fusion.",
                    "Synthesizing transformations for locality enhancement of imperfectly-nested loop nests.",
                    "Optimized unrolling of nested loops.",
                    "Hardware-only stream prefetching and dynamic access ordering.",
                    "Push vs. pull: data movement for linked data structures.",
                    "Boosting superpage utilization with the shadow memory and the partial-subblock TLB.",
                    "Table size reduction for data value predictors by exploiting narrow width values.",
                    "Using profiling to reduce branch misprediction costs on a dynamically scheduled processor.",
                    "An adaptive software library for fast Fourier transforms.",
                    "Using accurate arithmetics to improve numerical reproducibility and stability in parallel applications.",
                    "Performance evaluation of the IBM SP and the Compaq AlphaServer SC.",
                    "Performance analysis of distributed applications using automatic classification of communication inefficiencies.",
                    "A general performance model for parallel sweeps on orthogonal grids for particle transport calculations.",
                    "Hardware spatial forwarding for widely shared data.",
                    "A novel application development environment for large-scale scientific computations.",
                    "Comparative study of page-based and segment-based software DSM through compiler optimization.",
                    "Unroll-based register coalescing.",
                    "Automatic compiler techniques for thread coarsening for multithreaded architectures.",
                    "Automated cache optimizations using CME driven diagnosis.",
                    "A low-complexity issue logic.",
                    "Binary translation and architecture convergence issues for IBM system/390."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "13th ICS 1999",
        "info": "Rhodes, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1999",
                "sub_name": "Proceedings of the 13th international conference on Supercomputing, ICS 1999, Rhodes, Greece, June 20-25, 1999.",
                "count": 57,
                "papers": [
                    "Adding a vector unit to a superscalar processor.",
                    "Exploiting SIMD parallelism in DSP and multimedia algorithms using the AltiVec technology.",
                    "Improving the performance of speculatively parallel applications on the Hydra CMP.",
                    "The pool of subsectors cache design.",
                    "Symmetry and performance in consistency protocols.",
                    "A locality sensitive multi-module cache with explicit management.",
                    "A new \"quad-tree-based\" sub-system allocation technique for mesh-connected parallel machines.",
                    "On the complexity of list scheduling algorithms for distributed-memory systems.",
                    "Communication conscious radix sort.",
                    "Eliminating synchronization bottlenecks in object-based programs using adaptive replication.",
                    "Mechanisms and policies for supporting fine-grained cycle stealing.",
                    "Responsiveness without interrupts.",
                    "Reducing branch misprediction penalties via dynamic control independence detection.",
                    "Software trace cache.",
                    "Cyclic dependence based data reference prediction.",
                    "CACHET: an adaptive cache coherence protocol for distributed shared-memory systems.",
                    "Adapting cache line size to application behavior.",
                    "Reducing cache misses using hardware and software page placement.",
                    "Application scaling under shared virtual memory on a cluster of SMPs.",
                    "Shared virtual memory with automatic update support.",
                    "Realizing the performance potential of the virtual interface architecture.",
                    "Low-level router design and its impact on supercomputer system performance.",
                    "Improving the performance of bristled CC-NUMA systems using virtual channels and adaptivity.",
                    "A new method to make communication latency uniform: distributed routing balancing.",
                    "New shape analysis techniques for automatic parallelization of C codes.",
                    "An affine partitioning algorithm to maximize parallelism and minimize communication.",
                    "A graphic parallelizing environment for user-compiler interaction.",
                    "Dynamic remote memory acquisition for parallel data mining on ATM-connected PC cluster.",
                    "Parallel I/O for scientific applications on heterogeneous clusters: a resource-utilization approach.",
                    "The design and evaluation of high performance communication using a Gigabit Ethernet.",
                    "The scalability of multigrain systems.",
                    "A comparative analysis of four parallelisation schemes.",
                    "A design analysis of a hybrid technology multithreaded architecture for petaflops scale computation3.",
                    "Thread fork/join techniques for multi-level parallelism exploitation in NUMA multiprocessors.",
                    "SMARTS: exploiting temporal locality and parallelism through vertical execution.",
                    "Problem space promotion and its evaluation as a technique for efficient parallel computation.",
                    "A quantitative architectural evaluation of synchronization algorithms and disciplines on ccNUMA systems: the case of the SGI Origin2000.",
                    "A comparison of MPI, SHMEM and cache-coherent shared address space programming models on the SGI Origin2000.",
                    "Comparing the memory system performance of the HP V-class and SGI Origin 2000 multiprocessors using microbenchmarks and scientific applications.",
                    "Increasing effective IPC by exploiting distant parallelism.",
                    "Improving virtual function call target prediction via dependence-based pre-computation.",
                    "Clustered speculative multithreaded processors.",
                    "Fast cluster failover using virtual memory-mapped communication.",
                    "Performance impact of proxies in data intensive client-server applications.",
                    "A comparison of two approaches for independent scaling up of processing and communication capacities in multicomputer networks.",
                    "Classifying load and store instructions for memory renaming.",
                    "Reorganizing global schedules for register allocation.",
                    "Resource usage models for instruction scheduling: two new models and a classification.",
                    "Improving memory hierarchy performance for irregular applications.",
                    "High-level semantic optimization of numerical codes.",
                    "Nonlinear array layouts for hierarchical memory systems.",
                    "Microservers: a new memory semantics for massively parallel computing.",
                    "Efficient management of memory hierarchies in embedded DRAM systems.",
                    "Dynamic removal of redundant computations.",
                    "An experimental evaluation of tiling and shackling for memory hierarchy management.",
                    "A tile selection algorithm for data locality and cache interference.",
                    "An integer linear programming approach for optimizing cache locality."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "12th ICS 1998",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1998",
                "sub_name": "Proceedings of the 12th international conference on Supercomputing, ICS 1998, Melbourne, Australia, July 13-17, 1998.",
                "count": 59,
                "papers": [
                    "Algorithms for Block Bidiagonal Systems on Vector and Parallel Computers.",
                    "A Parallel Iterative Linear System Solver with Dynamic Load Balancing.",
                    "Development of a Mathematical Subroutine Library for Fujitsu Vector Parallel Processors.",
                    "The Potential of Data Value Speculation to Boost ILP.",
                    "Load Execution Latency Reduction.",
                    "A Performance Study of Out-of-order Vector Architectures and Short Registers.",
                    "Efficient Support of Parallel Sparse Computation for Array Intrinsic Functions of Fortran 90.",
                    "Comparing Data Forwarding and Prefetching for Communication-induced Misses in Shared-memory MPs.",
                    "An Efficient Uniform Run-time Scheme for Mixed Regular-irregular Applications.",
                    "A Hyperplane Based Approach for Optimizing Spatial Locality in Loop Nests.",
                    "Speculative Multithreaded Processors.",
                    "Hardware and Software Support for Speculative Execution of Sequential Binaries on a Chip-multiprocessor.",
                    "Coarse-grained Speculative Execution in Shared-memory Multiprocessors.",
                    "Multipath Execution: Opportunities and Limits.",
                    "High-level Management of Communication Schedules in HPF-like Languages.",
                    "Problem and Machine Sensitive Communication Optimization.",
                    "Loop Fusion in High Performance Fortran.",
                    "A General Algorithm for Tiling the Register Level.",
                    "Application Level Scheduling of Gene Sequence Comparison on Metacomputers.",
                    "Local Area Metacomputing for Multidisciplinary Problems: A Case Study for Fluid/Structure Coupled Simulation.",
                    "Exploiting Heterogeneous Parallelism in the Presence of Communication Delays.",
                    "Optimizing and Load Balancing Metacomputing Applications.",
                    "Predicting Parallel Applications Performance on Non-Dedicated Cluster Platforms.",
                    "A User Level Program Transformation Tool.",
                    "The Role of Associativity and Commutativity in the Detection and Transformation of Loop-level Parallelism.",
                    "The Infinity Lambda Test.",
                    "Predicated Array Data-flow Analysis for Run-time Parallelization.",
                    "Measuring the Effectiveness of Automatic Parallelization in SUIF.",
                    "PARADISE: An Advanced Featured Parallel File System.",
                    "Distributed Data Structure Design for Scientific Computation.",
                    "Bounding on the Gain of Optimizing Data Layout in Vector Processors.",
                    "The Design and Implementation of Zero Copy MPI Using Commodity Hardware with a High Performance Network.",
                    "Monitoring Shared Virtual Memory Performance on a Myrinet-based PC Cluster.",
                    "MBCF: A Protected and Virtualized High-Speed User-Level Memory-Based Communication Facility.",
                    "Highly Efficient Implementation of MPI Point-to-Point Communication Using Remote Memory Operations.",
                    "Evaluation of Hardware Write Propagation Support for Next-generation Shared Virtual Memory Clusters.",
                    "Techniques for Empirical Testing of Parallel Random Number Generators.",
                    "Evaluation of High Performance Multicache Parallel Texture Mapping.",
                    "Parallel Compiled Event Driven VHDL Simulation.",
                    "Load Balanced Parallel Radix Sort.",
                    "Integer Sorting on Shared-Memory Vector Parallel Computers.",
                    "Speculative Execution Model with Duplication.",
                    "Dependence Driven Execution for Multiprogrammed Multiprocessor.",
                    "Kernel-level Scheduling for the Nano-threads Programming Model.",
                    "Scalable On-the-fly Detection of the First Races in Parallel Programs.",
                    "Eliminating Conflict Misses for High Performance Architectures.",
                    "Prefetching on the Cray-T3E.",
                    "Characterization and Improvement of Load/Store Cache-based Prefetching.",
                    "Hardware-driven Prefetching for Pointer Data References.",
                    "Data Prefetching for Software DSMs.",
                    "Depth Contention-free Broadcasting on Torus Networks.",
                    "OPTNET: A Cost-effective Optical Network for Multiprocessors.",
                    "Applying Segment Routing to k-ary n-cube Networks.",
                    "Dynamic Load Balancing for Adaptive Meshes Using Symmetric Broadcast Networks.",
                    "Vector Architectures: Past, Present and Future.",
                    "Kin: A High Performance Asynchronous Processor Architecture.",
                    "Resource Widening Versus Replication: Limits and Performance-cost Trade-off.",
                    "Utilizing Reuse Information in Data Cache Management.",
                    "A Study of Three Dynamic Approaches to Handle Widely Shared Data in Shared-memory Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "11th ICS 1997",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1997",
                "sub_name": "Proceedings of the 11th international conference on Supercomputing, ICS 1997, Vienna, Austria, July 7-11, 1997.",
                "count": 43,
                "papers": [
                    "Scalable Instruction-Level Parallelism Through Tree-Instructions.",
                    "Increasing Memory Bandwidth with Wide Buses: Compiler, Hardware and Performance Trade-Offs.",
                    "Implementation of Collective I/O in the Intel Paragon Parallel File System: Initial Experiences.",
                    "Optimizing Collective I/O Performance on Parallel Computers: A Multisystem Study.",
                    "Performance Improvement through Overhead Analysis: A Case Study in Molecular Dynamics.",
                    "Generalized Cannon's Algorithm for Parallel Matrix Multiplication.",
                    "A Highly Accurate Fast Solver for Helmholtz Equations.",
                    "Data Caches for Superscalar Processors.",
                    "Improving Data Cache Performance by Pre-Executing Instructions Under a Cache Miss.",
                    "Eliminating Cache Conflict Misses through XOR-Based Placement Functions.",
                    "Performance Study on Optimal Processor Assignment in Parallel Relational Databases.",
                    "Multiprocessor Scheduling with Client Resources to Improve the Response Time of WWW Applications.",
                    "pSNOW: A Tool to Evaluate Architectural Issues for NOW Environments.",
                    "CP-PACS: A Massively Parallel Processor for Large Scale Scientific Calculations.",
                    "A Methodology for Specifying Data Distribution Using Only Standard Object-Oriented Features.",
                    "HPC++: Experiments with the Parallel Standard Template Library.",
                    "Impact of Selection Functions on Routing Algorithm Performance in Multicomputer Networks.",
                    "Performance Benefits of Virtual Channels and Adaptive Routing: An Application-Driven Study.",
                    "Distributed Shared Memory Systems with Improved Barrier Synchronization and Data Transfer.",
                    "A Graph Based Approach to Barrier Synchronisation Minimisation.",
                    "The Importance of Synchronization Structure in Parallel Program Optimization.",
                    "Performance Evaluation of Message-Driven Parallel VLSI CAD Applications on General Purpose Multiprocessors.",
                    "Incorporating Application Dependent Information in an Automatic Code Generating Environment.",
                    "Sparse Code Generation for Imperfectly Nested Loops with Dependences.",
                    "Speculative Execution via Address Prediction and Data Prefetching.",
                    "Adaptive Data Prefetching Using Cache Information.",
                    "Performance considerations in software multicasts.",
                    "Iteration Space Slicing and Its Application to Communication Optimization.",
                    "Compiler and Run-Time Support for Semi-Structured Applications.",
                    "Conflict-Free Template Access in k-ary and Binomial Trees.",
                    "Design and Performance of the Shasta Distributed Shared Memory Protocol.",
                    "An I/O Network Architecture of the Distributed Shared-Memory Massively Parallel Computer JUMP-1.",
                    "Symbolic Evaluation for Parallelizing Compilers.",
                    "A Compiler Algorithm for Optimizing Locality in Loop Nests.",
                    "Compile-Time Minimisation of Load Imbalance in Loop Nests.",
                    "Implementation and Analysis of Path History in Dynamic Branch Prediction Schemes.",
                    "A Victim Cache for Vector Registers.",
                    "Performance Analysis of Tree VLIW Architecture for Exploiting Branch ILP in Non-Numerical Code.",
                    "Non-Singular Data Transformations: Definition, Validity and Applications.",
                    "Cache Miss Equations: An Analytical Representation of Cache Misses.",
                    "Adaptive Migratory Scheme for Distributed Shared Memory.",
                    "Developing Architecture Adaptive Algorithms Using Simulation with MISS-PVM for Performance Prediction.",
                    "Optimizing Matrix Multiply Using PHiPAC: A Portable, High-Performance, ANSI C Coding Methodology."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "10th ICS 1996",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1996",
                "sub_name": "Proceedings of the 10th international conference on Supercomputing, ICS 1996, Philadelphia, PA, USA, May 25-28, 1996.",
                "count": 50,
                "papers": [
                    "Compiler Support for Hybrid Irregular Accesses on Multicomputers.",
                    "Analysis of Local Enumeration and Storage Schemes in HPF.",
                    "Detection and Global Optimization of Reduction Operations for Distributed Parallel Machines.",
                    "Memory Organization in Multi-Channel Optical Networks: NUMA and COMA Revisited.",
                    "The GLOW Cache Coherence Protocol Extensions for Widely Shared Data.",
                    "A Cost-Comparison Approach for Adaptive Distributed Shared Memory.",
                    "Minimizing Communication While Preserving Parallelism.",
                    "Data-Localization for Fortran Macro-Dataflow Computation Using Partial Static Task Assignment.",
                    "Mapping Performance Data for High-Level and Data Views of Parallel Program Performance.",
                    "Experimental Evaluation of Efficient Sparse Matrix Distributions.",
                    "CTADEL: A Generator of Multi-Platform High Performance Codes for PDE-Based Scientific Applications.",
                    "A Performance Study of Cosmological Simulations on Message-Passing and Shared-Memory Multiprocessors.",
                    "Parallel Additive Lagged Fibonacci Random Number Generators.",
                    "Data Prefetching and Multilevel Blocking for Linear Algebra Operations.",
                    "A Template for Non-Uniform Parallel Loops Based on Dynamic Scheduling and Prefetching Techniques.",
                    "Design and Evaluation of Dynamic Access Ordering Hardware.",
                    "Examination of a Memory Access Classification Scheme for Pointer-Intensive and Numeric Programs.",
                    "Optimizing Primary Data Caches for Parallel Scientific Applications: The Pool Buffer Approach.",
                    "ParInt: A Software Package for Parallel Integration.",
                    "Automatic Partitioning Techniques for Solving Partial Differential Equations on Irregular Adaptive Meshes.",
                    "Profile Driven Weighted Decomposition.",
                    "Evaluating the Limits of Message Passing via the Shared Attraction Memory on CC-COMA Machines: Experiences with TCGMSG and PVM.",
                    "Hybrid Algorithms for Complete Exchange in 2D Meshes.",
                    "The Effect of Interrupts on Software Pipeline Execution on Message-Passing Architectures.",
                    "Amon2: A Parallel Wire Routing Algorithm on a Torus Network Parallel Computer.",
                    "Parallel Construction of Multidimensional Binary Search Trees.",
                    "Satisfiability Test with Synchronous Simulated Annealing on the Fujitsu AP1000 Massively-Parallel Multiprocessor.",
                    "Automating Parallel Runtime Optimizations Using Post-Mortem Analysis.",
                    "Runtime Coupling of Data-Parallel Programs.",
                    "Run-Time Compilation for Parallel Sparse Matrix Computations.",
                    "Synchronization Hardware for Networks of Workstations: Performance vs. Cost.",
                    "Evaluating Virtual Channels for Cache-Coherent Shared-Memory Multiprocessors.",
                    "A New Guaranteed Heuristic for the Software Pipelining Problem.",
                    "A Register Allocation Technique Using Guarded PDG.",
                    "Counting Solutions to Linear and Nonlinear Constraints Through Ehrhart Polynomials: Applications to Analyze and Transform Scientific Programs.",
                    "An Efficient Steepest-Edge Simplex Algorithm for SIMD Computers.",
                    "Parallel Implementation of the Lanczos Method for Sparse Matrices: Analysis of Data Distributions.",
                    "Block Algorithms for Sparse Matrix Computations on High Performance Workstations.",
                    "A MATLAB to Fortran 90 Translator and Its Effectiveness.",
                    "Integrating Task and Data Parallelism Using Shared Objects.",
                    "Eliminating Redundant Barrier Synchronizations in Rule-Based Programs.",
                    "Benchmark Tests on the Digital Equipment Corporation Alpha AXP 21164-based AlphaServer 8400, Including a Comparison of Optimized Vector and Superscalar Processing.",
                    "Fine Grain Parallel Communication on General Purpose LANs.",
                    "Improving Single-Process Performance with Multithreaded Processors.",
                    "An Interprocedural Framework for Placement of Asynchronous I/O Operations.",
                    "Automatic Optimization of Communication in Compiling Out-of-Core Stencil Codes.",
                    "The Galley Parallel File System.",
                    "Reducing Inter-Vector-Conflicts in Complex Memory Systems.",
                    "Performance of the Vectorial Processor VEC-SM2 Using Serial Multiport Memory.",
                    "Are There Advantages to High-Dimension Architectures? Analysis of k-ary n-Cubes for the Class of Parallel Divide-and-Conquer Algorithms."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "9th ICS 1995",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1995",
                "sub_name": "Proceedings of the 9th international conference on Supercomputing, ICS 1995, Barcelona, Spain, July 3-7, 1995.",
                "count": 51,
                "papers": [
                    "Decoupling Synchronization and Data Transfer in Message Passing Systems of Parallel Computers.",
                    "Techniques for Reducing Overheads of Shared-Memory Multiprocessing.",
                    "Compiler Cache Optimizations for Banded Matrix Problems.",
                    "Optimum Modulo Schedules for Minimum Register Requirements.",
                    "Upper Time Bounds for Executing PRAM-Programs on the LogP-Machine.",
                    "On the Utility of Threads for Data Parallel Programming.",
                    "The DMBC: Architecture and Fundamental Operations.",
                    "Unified Compilation Techniques for Shared and Distributed Address Space Machines.",
                    "A Compiler-Directed Distributed Shared Memory System.",
                    "Reducing Communication by Honoring Multiple Alignments.",
                    "Multiprocessor Scalability Predictions Through Detailed Program Execution Analysis.",
                    "Petri Net Modeling of Interconnection Networks for Massively Parallel Architectures.",
                    "Efficient Resolution of Sparse Indirections in Data-Parallel Compilers.",
                    "Extending High Performance Fortran for the Support of Unstructured Computations.",
                    "Run-Time Methods for Parallelizing Partially Parallel Loops.",
                    "A Near-Optimal Broadcasting Algorithm in All-Port Wormhole-Routed Hypercubes.",
                    "A Comparative Study of Single Hop WDM Interconnections for Multiprocessors.",
                    "Dynamic Load Balancing for the Simulation of Granular Materials.",
                    "Dynamic Load Balancing of Data Parallel Applications on a Distributed Network.",
                    "Efficient Address Generation for Block-Cyclic Distributions.",
                    "Using Asynchronous and Bulk Communications to Construct an Optimizing Compiler for Distributed-Memory Machines with Consideration Given to Communications Costs.",
                    "HPF Compiler for the AP1000.",
                    "The Threaded Communication Library: Preliminary Experiences on a Multiprocessor with Dual-Processor Nodes.",
                    "Amon: A Parallel Slice Algorithm for Wire Routing.",
                    "Implementation of Sparta, a Highly Parallel Circuit Simulator by the Preconditioned Jacobi Method, on a Distributed Memory Machine.",
                    "Integral Knapsack Problems: Parallel Algorithms and Their Implementations on Distributed Systems.",
                    "Optimization and Parallelization of a Commodity Trade Model for the IBM SP1/2, using Parallel Programming Tools.",
                    "Deep Blue: Computer Chess and Massively Parallel Systems (extended abstract).",
                    "Deep Blue System Overview.",
                    "Hardware Implementation Issues of Data Prefetching.",
                    "Data Forwarding in Scalable Shared-Memory Multiprocessors.",
                    "Enhancing Array Dataflow Dependence Analysis with On-demand Global Value Propagation.",
                    "Optimal Tile Size Adjustment in Compiling General DOACROSS Loop Nests.",
                    "Efficient Embeddings into the Hypercube Using Matrix Transformations.",
                    "Architecture-independent Locality-improving Transformations of Computational Graphs Embedded in k-Dimensions.",
                    "Semi-linear and Bi-base Storage Schemes Classes: General Overview and Case Study.",
                    "A Dataflow Language with Object-based Extension and its Implementation on a Commercially Available Parallel Machine.",
                    "Compiler Reduction of Synchronisation in Shared Virtual Memory Systems.",
                    "A Macrotask-level Unlimited Speculative Execution on Multiprocessors.",
                    "A Data Cache with Multiple Caching Strategies Tuned to Different Types of Locality.",
                    "Scalar Processor of the VPP500 Parallel Supercomputer.",
                    "A Comparison of Parallel Programming Paradigms and Data Distributions for a Limited Area Numerical Weather Forecast Routine.",
                    "The Portable Parallel Implementation of Two Novel Mathematical Biology Algorithms in ZPL.",
                    "Performance Optimization for Parallel Tape Arrays.",
                    "PPFS: a High Performance Portable Parallel File System.",
                    "Communication Strategies for Out-of-Core Programs on Distributed Memory Machines.",
                    "Performance Evaluation of a Parallel I/O Architecture.",
                    "Gated SSA-based Demand-Driven Symbolic Analysis for Parallelizing Compilers.",
                    "Advanced Compilation Techniques in the PARADIGM Compiler for Distributed-memory Multicomputers.",
                    "Vectorization beyond Data Dependences.",
                    "Idiom Recognition in the Polaris Parallelizing Compiler."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "8th ICS 1994",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1994",
                "sub_name": "Proceedings of the 8th international conference on Supercomputing, ICS 1994, Manchester, UK, July 11-15, 1994.",
                "count": 45,
                "papers": [
                    "Distributed storage control unit for the Hitachi S-3800 multivector supercomputer.",
                    "A model for dataflow based vector execution.",
                    "Synchronized access to streams in SIMD vector multiprocessors.",
                    "The privatizing DOALL test: a run-time technique for DOALL loop identification and array privatization.",
                    "Reducing data communication overhead for DOACROSS loop nests.",
                    "Evaluating automatic parallelization for efficient execution on shared-memory multiprocessors.",
                    "An evaluation of directory protocols for medium-scale shared-memory multiprocessors.",
                    "An evaluation of a compiler optimization for improving the performance of a coherence directory.",
                    "Parallelisation of the SDEM distinct element stress analysis code on the KSR-1.",
                    "Ultrasonic wave propagation on parallel machines.",
                    "An efficient approach to computing fixpoints for complex program analysis.",
                    "Optimal local register allocation for a multiple-issue machine.",
                    "Scheduling reductions.",
                    "A dominating set model for broadcast in all-port wormhole-routed 2D mesh networks.",
                    "The interaction between virtual channel flow control and adaptive routing in wormhole networks.",
                    "Fault-tolerant wormhole routing in tori.",
                    "Performance of the CM-5 scalable file system.",
                    "Communication in the KSR1 MPP: performance evaluation using synthetic workload experiments.",
                    "Architecture implications of high-speed I/O for distributed-memory computers.",
                    "Combining static and dynamic scheduling on distributed-memory multiprocessors.",
                    "An optimal upper bound on the minimal completion time in distributed supercomputing.",
                    "Compiler techniques for maximizing fine-grain and coarse-grain parallelism in loops with uniform dependences.",
                    "Data and program restructuring of irregular applications for cache-coherent multiprocessor.",
                    "Nonzero structure analysis.",
                    "Techniques to overlap computation and communication in irregular iterative applications.",
                    "Performance analysis of a synchronous, circuit-switched interconnection cached network.",
                    "An analysis model on nonblocking multirate broadcast networks.",
                    "Exploiting cache affinity in software cache coherence.",
                    "Performance evaluation of hybrid hardware and software distributed shared memory protocols.",
                    "Limited area numerical weather forecasting on a massively parallel computer.",
                    "Fast phylogenetic analysis on a massively parallel machine.",
                    "Compiling performance models from parallel programs.",
                    "Queueing performance analysis of co-scheduling in a pool of processors environment.",
                    "Normalized performance indices for message passing parallel programs.",
                    "The effectiveness of caches for vector processors.",
                    "Using virtual lines to enhance locality exploitation.",
                    "MOB forms: a class of multilevel block algorithms for dense linear algebra operations.",
                    "An approach to communication-efficient data redistribution.",
                    "Twisted data layout.",
                    "Compiler and runtime support for out-of-core HPF programs.",
                    "Compilation techniques for block-cyclic distributions.",
                    "A generalized vision of some parallel bidiagonal systems solvers.",
                    "Analysis of non-strict functional implementations of the Dongarra-Sorensen eigensolver.",
                    "The parallel solution of nonsymmetric sparse linear systems using the H* reordering and an associated factorization.",
                    "On sparse matrix reordering for parallel factorization."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "7th ICS 1993",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1993",
                "sub_name": "Proceedings of the 7th international conference on Supercomputing, ICS 1993, Tokyo, Japan, July 20-22, 1993.",
                "count": 43,
                "papers": [
                    "Graph Contraction for Physical Optimization Methods: A Quality-Cost Tradeoff for Mapping Data on Parallel Computers.",
                    "Managing Pages in Shared Virtual Memory Systems: Getting the Compiler into the Game.",
                    "The EM-4 Under Implicit Parallelism.",
                    "Toward a Methodology of Optimizing Programs for High-Performance Computers.",
                    "Data Stream Control Optimization in Dataflow Architectures.",
                    "The Effectiveness of Decoupling.",
                    "Speculative Prefetching.",
                    "Increasing the Instruction Fetch Rate via Multiple Branch Prediction and a Branch Address Cache.",
                    "Speculative Execution and Branch Prediction on Parallel Machines.",
                    "PARADIGM: A Compiler for Automatic Data Distribution on Multicomputers.",
                    "A Massively Parallel Optimizer for Expression Evaluation.",
                    "Static and Dynamic Evaluation of Data Dependence Analysis.",
                    "Performance Analysis of Four SIMD Machines.",
                    "Processor Autonomy on SIMD Architectures.",
                    "Exact Side Effects for Interprocedural Dependence Analysis.",
                    "CMAX: A Fortran Translator for the Connection Machine System.",
                    "Scalable Parallel Memory Architecture with a Skew Scheme.",
                    "EMC-Y: Parallel Processing Element Optimizing Communication and Computation.",
                    "Toward Automatic Partitioning of Arrays on Distributed Memory Computers.",
                    "Dynamic Control of Performance Monitoring on Large Scale Parallel Systems.",
                    "Anatomy of a Message in the Alewife Multiprocessor.",
                    "A Static Parameter Based Performance Prediction Tool for Parallel Programs.",
                    "Empirical Study of Latency Hiding on a Fine-Grain Parallel Processor.",
                    "The NuMesh: A Modular, Scalable Communications Substrate.",
                    "Evaluating the Communication Performance of MPPs Using Synthetic Sparse Matrix Multiplication Workloads.",
                    "Super-Threading: Architectural and Software Mechanisms for Optimizing Parallel Computation.",
                    "Parallel Direct Solution of Large Sparse Systems in Finite Element Computations.",
                    "Parallel Triangular Decompositions of an Oil Refining Simulation.",
                    "Parallel Eigenanalysis for Nested Grids.",
                    "Parallel Processing Architecture for the Hitachi S-3800 Shared-Memory Vector Multiprocessor.",
                    "A Scalar Architecture for Pseudo Vector Processing Based on Slide-Windowed Registers.",
                    "A Micro-Vectorprocessor Architecture: Performance Modeling and Benchmarking.",
                    "Performance Prediction of Parallel Processing Systems: The PAMELA Methodology.",
                    "Dynamic Switching of Coherent Cache Protocols and its Effects on Doacross Loops.",
                    "Effects of Memory Latencies on Non-Blocking Processor/Cache Architectures.",
                    "A Cellular Automation Methodology for Solving the Wave Equation.",
                    "Parallel Two-Level Simulated Annealing.",
                    "An Experimental Performance Evaluation of Touchstone Delta Concurrent File System.",
                    "A High-Performance Parallel Database Architecture.",
                    "File Archive Activity in a Supercomputing Environment.",
                    "A Proposal of Level 3 Interface for Band and Skyline Matrix Factorization Subroutine.",
                    "Partitioning the Statement per Iteration Space Using Non-Singular Matrices.",
                    "Compilation Techniques for Sparse Matrix Computations."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "6th ICS 1992",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1992",
                "sub_name": "Proceedings of the 6th international conference on Supercomputing, ICS 1992, Washington, DC, USA, July 19-24, 1992.",
                "count": 46,
                "papers": [
                    "Evaluation of compiler optimizations for Fortran D on MIMD distributed memory machines.",
                    "Evaluation of compiler generated parallel programs on three multicomputers.",
                    "Automatic data mapping for distributed-memory parallel computers.",
                    "Characterizing memory performance in vector multiprocessors.",
                    "Performance analysis of the CM-2, a massively parallel SIMD computer.",
                    "Evaluation of the lock mechanism in a snooping cache.",
                    "Processor allocation and loop scheduling on multiprocessor computers.",
                    "Low level scheduling using the hierarchical task graph.",
                    "Deriving good transformations for mapping nested loops on hierarchical parallel machines in polynomial time.",
                    "ABCL/onEM-4: a new software/hardware architecture for object-oriented concurrent computing on an extended dataflow supercomputer.",
                    "Tolerating data access latency with register preloading.",
                    "Supercomputing and transputers.",
                    "Automatic software cache coherence through vectorization.",
                    "Life span strategy - a compiler-based approach to cache coherence.",
                    "Conflict-free access of vectors with power-of-two strides.",
                    "Parallel program visualization using SIEVE.1.",
                    "The CODE 2.0 graphical parallel programming language.",
                    "Paralex: an environment for parallel programming in distributed systems.",
                    "Exploiting heterogeneous parallelism on a multithreaded multiprocessor.",
                    "An architectural framework for migration from CISC to higher performance platforms.",
                    "Manchester data-flow: a progress report.",
                    "Array abstractions using semantic analysis of trapezoid congruences.",
                    "A comprehensive approach to parallel data flow analysis.",
                    "Compile-time analysis of communicating processes.",
                    "Register requirements of pipelined processors.",
                    "Benchmarking a vector-processor prototype based on multithreaded streaming/FIFO vector (MSFV) architecture.",
                    "On storage schemes for parallel array access.",
                    "A general algorithm for data dependence analysis.",
                    "On exact data dependence analysis.",
                    "Array privatization for parallel execution of loops.",
                    "Optimizing for parallelism and data locality.",
                    "A transformational approach to compiling Sisal for distributed memory architectures.",
                    "Automatic performance prediction to support parallelization of Fortran programs for massively parallel systems.",
                    "A methodology for high-level synthesis of communication on multicomputers.",
                    "A parallel execution environment for a sequential object oriented language.",
                    "Scheduling in parallel systems with a hierarchical organization of tasks.",
                    "A scalable, object-oriented finite element solver for partial differential equations on multicomputers.",
                    "Experiments with an ocean circulation model on CEDAR.",
                    "Minimizing the Lennard-Jones potential function on a massively parallel computer.",
                    "Supercomputing out of recycled garbage: preliminary experience with Piranha.",
                    "PYRROS: static task scheduling and code generation for message passing multiprocessors.",
                    "Compiler and runtime support for irregularly coupled regular meshes.",
                    "Parallel SAS multicluster algorithms for solving linear systems with reflexive coefficient matrices.",
                    "Orthogonal s-step methods for nonsymmetric linear systems of equations.",
                    "Speedup of band linear recurrences in the presence of resource constraints.",
                    "Preconditioning parallel multisplittings for solving linear systems of equations."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "5th ICS 1991",
        "info": "Cologne, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1991",
                "sub_name": "Proceedings of the 5th international conference on Supercomputing, ICS 1991, Cologne, Germany, June 17-21, 1991.",
                "count": 47,
                "papers": [
                    "Parallel computer ADENART - its architecture and application.",
                    "The HyperDynamic architecture (massively parallel message-passing machine) - architecture and performance.",
                    "High performance communication for MIMD supercomputers.",
                    "Behavioral characterization of decoupled access/execute architecture.",
                    "A space-efficient parallel garbage compaction algorithm.",
                    "Vectorization and parallelization of irregular problems via graph coloring.",
                    "Sequential description and parallel execution language DFCII dataflow supercomputers.",
                    "GRACIA: a software environment for graphical specification, automatic configuration and animation of parallel programs.",
                    "A scheme to extract run-time parallelism form sequential loops.",
                    "Compiler algorithms for event variable synchronization.",
                    "Work distribution in parallel programs for distributed memory multiprocessors.",
                    "Routing and processor allocation on a Hypercycle-based multiprocessor.",
                    "Geometry based mapping strategies for PDE computations.",
                    "Dynamic and static load scheduling performance on a NUMA shared memory multiprocessor.",
                    "An algorithm for the generalized singular value decomposition on massively parallel computers.",
                    "Exploiting parallelism in automatic differentiation.",
                    "Three-dimensional simulation of semiconductor devices on supercomputers.",
                    "Parallel conjugate gradient algorithms for solving the Neutron Diffusion Equation on SUPERNUM.",
                    "Beyond loop partitioning: data assignment and overlap to reduce communication overhead.",
                    "Automatic transformation of FORTRAN loops to reduce cache conflicts.",
                    "Optimization of array accesses by collective loop transformations.",
                    "Loop partitioning for distributed memory multiprocessors as unimodular transformations.",
                    "A systolic array processor for biological information signal processing.",
                    "Software and hardware parallelism on the iWarp multi-computer.",
                    "Strip mining on SIMD architectures.",
                    "Semantical interprocedural parallelization: an overview of the PIPS project.",
                    "The hierarchical task graph and its use in auto-scheduling.",
                    "Accurate modelling of interconnection networks in vector supercomputers.",
                    "Combining hardware and software cache coherence strategies.",
                    "A software coherence scheme with the assistance of directories.",
                    "Mesh and pyramid algorithms for iconic indexing.",
                    "Implementing partition on vector computers.",
                    "A parallel genetic algorithm for the graph partitioning problem.",
                    "Experiences with data dependence abstractions.",
                    "Extending the I test to direction vectors.",
                    "Uniform techniques for loop optimization.",
                    "Supercomputers: where are the lost cycles?",
                    "Parallel programs and background load: efficiency studies with the PAR-Bench system.",
                    "Analyzing the performance of message passing MIMD Hypercubes: a study with the Intel iPSC/860.",
                    "Parallel program behavioral study on a shared-memory multiprocessor.",
                    "Analysis of scalability of parallel algorithms and architectures: a survey.",
                    "Solving banded systems using a parallel programming language with hierarchically data descriptive features.",
                    "Programming data parallel algorithms on distributed memory using Kali.",
                    "PATCH - a new algorithm for rapid incremental dependence analysis.",
                    "Analysis and transformation in the ParaScope editor.",
                    "A performance bound analysis of multistage combining networks using a probabilistic model.",
                    "Supercomputer workload decomposition and analysis."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "4th ICS 1990",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1990",
                "sub_name": "Proceedings of the 4th international conference on Supercomputing, ICS 1990, Amsterdam, The Netherlands, June 11-15, 1990.",
                "count": 42,
                "papers": [
                    "The Tera computer system.",
                    "OMP: a RISC-based multiprocessor using orthogonal-access memories and multiple spanning buses.",
                    "A basic architecture supporting LGDG computation.",
                    "An efficient caching support for critical sections in large-scale shared-memory multiprocessors.",
                    "An improvement of I/O function for auxiliary storage: parallel I/O for a large scale supercomputing.",
                    "Analysis of a variant hypercube topology.",
                    "Parallel ODE solvers.",
                    "Use of parallel level 3 BLAS in LU factorization on three vector multiprocessors the ALLIANT FX/80, the CRAY-2, and the IBM 3090 VF.",
                    "PELLPACK: a numerical simulation programming environment for parallel MIMD machines.",
                    "Schur complement preconditioned conjugate gradient methods for spline collocation equations.",
                    "Cost-optimal parallel B-spline interpolations.",
                    "Solving general sparse linear systems using conjugate gradient-type methods.",
                    "Dataflow computer development in Japan.",
                    "POSC - a partitioning and optimizing SISAL compiler.",
                    "Loop optimization for horizontal microcoded machines.",
                    "Compiler techniques for data synchronization in nested parallel loops.",
                    "Compiler techniques for data partitioning of sequentially iterated parallel loops.",
                    "On the perfect accuracy of an approximate subscript analysis test.",
                    "A hardware-based performance monitor for the Intel iPSC/2 hypercube.",
                    "Performance degradation due to multiprogramming and system overheads in real workloads: case study on a shared memory multiprocessor.",
                    "SPARK: a benchmark package for sparse computations.",
                    "Supercomputer performance evaluation and the Perfect Benchmarks.",
                    "Strategies for large-scale structural problems on high-performance computers.",
                    "Elastodynamics on clustered vector multiprocessors.",
                    "Implementation of 5-point/9-point multi-level methods on hypercube architectures.",
                    "Supercomputer-based visualization systems used for analyzing output data of a numerical weather prediction model.",
                    "Parallel automated wire-routing with a number of competing processors.",
                    "Hierarchical algorithms and architectures for parallel scientific computing.",
                    "Incremental dependence analysis for interactive parallelization.",
                    "Parallelization of FORTRAN code on distributed-memory parallel processors.",
                    "Compiler-directed data prefetching in multiprocessors with memory hierarchies.",
                    "Towards efficient fine-grain software pipelining.",
                    "Pandore: a system to manage data distribution.",
                    "Vector performance analysis of the NEC SX-2.",
                    "Performance evaluation and prediction for parallel algorithms on the BBN GP1000.",
                    "Designing algorithms on hierarchical memory multiprocessors.",
                    "Access conflicts in multiprocessor memories queueing models and simulation studies.",
                    "Impact of task duplication on static-scheduling performance in multiprocessor systems with variable execution-time tasks.",
                    "Clustering task graphs for message passing architectures.",
                    "A method for parallel program generation with an application to the Booster language.",
                    "A run time support system for multiprocessor machines.",
                    "Supercomputing with transputers - past, present and future."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "3rd ICS 1989",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1989",
                "sub_name": "Proceedings of the 3rd international conference on Supercomputing, ICS 1989, Heraklion, Crete, Greece, June 5-9, 1989.",
                "count": 51,
                "papers": [
                    "Multicoloring with lots of colors.",
                    "A formal framework handling the description and implementation of multigrid algorithms.",
                    "On the parallel solution of parabolic equations.",
                    "The doconsider loop.",
                    "Implementing Linda for distributed and parallel processing.",
                    "An efficient message-passing scheduler based on guided self scheduling.",
                    "The composite binary cube - a family of interconnection networks for multiprocessors.",
                    "I/O issues for hypercubes.",
                    "Semi-iterative methods on distributed memory multiprocessor architectures.",
                    "One-to-one mapping of process graphs onto a hypercube.",
                    "Automatic load balanced paritioning strategies for PDE computations.",
                    "Multiprocessing algorithms for global spectral numerical weather prediction.",
                    "Parallel calculations on the wind-driven oceanic circulation using Fourier pseudospectral methods.",
                    "Simulations of three-dimensional flows with the lattice Boltzmann equation on the IBM 3090/VF.",
                    "Vectorized molecular dynamics algorithms for very large number of particles.",
                    "Control flow optimization for supercomputer scalar processing.",
                    "A global resource-constrained parallelization technique.",
                    "Array distribution in SUPERB.",
                    "Compile-time detection of race conditions in a parallel program.",
                    "A unified semantic approach for the vectorization and parallelization of generalized reductions.",
                    "Constraint based vectorization.",
                    "Intererence analysis tools for parallelizing programs with recursive data structures.",
                    "Data dependence analysis on multi-dimensional array references.",
                    "Interactive conversion of sequential to multitasking FORTRAN.",
                    "Alpha du centaur: a prototype environment for the design of parallel regular alorithms.",
                    "Parallelizing algorithms for MIMD architectures with shared memory.",
                    "Performance comparisons of Cholesky factorization algorithms using level-2 & 3 BLAS on the national advanced systems AS/XL Vector computer.",
                    "Portable and efficient factorization algorithms on the IBM 3090/VF.",
                    "A comparison of parallel processing on Cray X-MP AND IBM 3090 VF multiprocessors.",
                    "Data traffic reduction schemes for Cholesky factorization on asynchronous multiprocessor systems.",
                    "Rectangular spatial decomposition methods for parallel simulated annealing.",
                    "Parallel algorithms for solution of tridiagonal systems on multicomputers.",
                    "Very high-speed communication in large MIMD supercomputers.",
                    "A version control approach to Cache coherence.",
                    "A asynchronous buffering network for tightly coupled multiprocessors.",
                    "High-speed storage control schemes of HITACHI supercomputer S-820 system.",
                    "The Kyushu University reconfigurable parallel processor: design of memory and intercommunicaiton architectures.",
                    "FEM-TORUS: token driven processor torus array functional simulation and performance evaluation - for processing of finite-element-method matrices.",
                    "The specification of a new Manchester Dataflow machine.",
                    "The NOV-II super parallel computer for signal processing.",
                    "Supercomputer development in Europe.",
                    "Overview of a high-performance programmable pipeline structure.",
                    "Restricted Fetch&Phi operations for parallel processing.",
                    "Instruction fetch unit for parallel execution of branch instructions.",
                    "Performance benefits of large execution atomic units in dynamically scheduled machines.",
                    "Performance prediction of loop constructs on multiprocessor hierarchical-memory systems.",
                    "Influence of the stride on the cache utilization in the IBM 3090 VF.",
                    "Performance analysis of buffered banyan networks under nonuniform traffic.",
                    "Convergence rate and termination of asynchronous iterative algorithms.",
                    "Acceleration of the outer conjugate gradient by reorthogonalization for a domain decomposition method for structural analysis problems.",
                    "Vectorizing a robust inner product algorithm."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "2nd ICS 1988",
        "info": "Saint Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1988",
                "sub_name": "Proceedings of the 2nd international conference on Supercomputing, ICS 1988, Saint Malo, France, July 4-8, 1988.",
                "count": 67,
                "papers": [
                    "Page table management in local/remote architectures.",
                    "Measurements and prediction of contention in multiprocessor operating systems with scientific application workloads.",
                    "Optimul: An optional interconnect for multiprocessor systems.",
                    "Optical link and processor clustering in the Delft parallel processor.",
                    "A robust parallel solver for block tridiagonal systems.",
                    "Percola: a special purpose programmable 64-bit floating-point processor.",
                    "Multiple-transform pipelines for image coding.",
                    "System architecture of parallel processing system -Harry-.",
                    "DVPP: a VLSI dynamic-graph ensemble machine.",
                    "BVE: a wafer-scale engine for differential equation computation.",
                    "From mathematical specifications to parallel programs on a message-based system.",
                    "Interactive program improvement via EAVE: an expert adviser for vectorization.",
                    "Parasight: a high-level debugger/profiler architecture for shared-memory multiprocessor.",
                    "Principles of runtime support for parallel processors.",
                    "An integrated environment for development and execution of real-time programs.",
                    "The \"Bussing Freeway\" a technological breakthrough.",
                    "The Gould NP1 system interconnecting.",
                    "Cluster oriented architecture for the mapping of parallel processor networks to high performance applications.",
                    "Micro-analysis of the titans's operating pipe.",
                    "High-speed processing schemes for summation type and iteration type vector instructions on Hitachi supercomputer S-820 system.",
                    "A framework for determining useful parallelism.",
                    "Partitioning programs for parallel execution.",
                    "Requirements for optimal execution ofL oops with tests.",
                    "On the problem of optimizing data transfers for complex memory systems.",
                    "Parallelization and performance evaluation of circuit simulation on a shared-memory multiprocessor.",
                    "Three-dimensional numerical simulations of the czochralski bulk flow on a CRAY X-MP multiprocessor architecture.",
                    "Tests on parallel machines of a domain decomposition method for a composite three-dimensional structural analysis problem.",
                    "Block-iterative finite element computations for incompressible flow problems.",
                    "Performance evaluation for an ocean general circulation model: vectorization and multitasking.",
                    "Performance study of a clustered shared-memory multiprocessor.",
                    "Performance of a shared memory system for vector multiprocessors.",
                    "A two-tier memory architecture for high-performance multiprocessor systems.",
                    "A cache coherence approach for large multiprocessor systems.",
                    "Hierarchical registers for scientific computers.",
                    "A high-speed message-driven communication architecture.",
                    "Performance evaluation of a formally supercomputer-based Monte Carlo program on a T800 transputer network.",
                    "A parallel spline collocation-capacitance method for elliptic partial differential equations.",
                    "Pipelined data parallel algorithms - concept and modeling.",
                    "Introducing symbolic problem solving techniques in the dependence testing phases of a vectorizer.",
                    "The importance of direct dependences for automatic parallelization.",
                    "Dependence of multi-dimensional array references.",
                    "Array expansion.",
                    "Code scheduling and register allocation in large basic blocks.",
                    "Optimization of horizontal microcode generation for loop structures.",
                    "Optimizing horizontal microprograms for vectorial loops with timed petri nets.",
                    "Parallel and vector conjugate gradient-like algorithms for sparse nonsymmetric linear systems.",
                    "Boundary integral domain decomposition of hierarchical memory multiprocessors.",
                    "A benchmark package for sparse matrix computations.",
                    "An evaluation of Cray X-MP performance on vectorizable Livermore FORTRAN kernels.",
                    "Performance evaluation of static and dynamic memory systems on the Cray-2.",
                    "Future high performance computers.",
                    "Parcel: project for the automatic restructuring and concurrent evaluation of LISP.",
                    "Vectorization techniques for prolog.",
                    "A hybrid scheme for detecting AND-parallelism in prolog programs.",
                    "Lazy evaluation and the logic variable.",
                    "An approach to synchronization for parallel computing.",
                    "Generating sequential code from parallel code.",
                    "Impact of self-scheduling order on performance on multiprocessor systems.",
                    "Using silicon and gallium arsenide technologies for new supercomputer design.",
                    "Towards a large number of pipeline processors in a tightly coupled multiprocessor using no cache.",
                    "A simple solution to Lamport's concurrent programming problem with linear wait.",
                    "Synchronization using counting semaphores.",
                    "Givens elimination on systolic arrays.",
                    "The connection machines CM-1 and CM-2: solving nonlinear network problems.",
                    "Ray tracing on a connection machine.",
                    "Warp experience: we can map computations onto a parallel computer efficiently.",
                    "Arnoldi-Tchebychev for large scale matrices and its vectorization."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "1st ICS 1987",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ics/1987",
                "sub_name": "Supercomputing, 1st International Conference, Athens, Greece, June 8-12, 1987, Proceedings.",
                "count": 62,
                "papers": [
                    "A Supercomputing Performance Evaluation Plan.",
                    "A Perspective on Parallel Processing.",
                    "Parallel Multigrid Methods: Implementation on SUPRENUM-like Architectures and Applications.",
                    "Using Memory in the Cedar System.",
                    "Another Combining Scheme to Reduce Hot Spot Contention in Large Scale Shared Memory Parallel Computers.",
                    "Applications Environment for the IBM Research Parallel Processor Prototype (RP3).",
                    "High Speed Interconnection Using the Clos Network.",
                    "Multipath Hierarchies in Interconnection Networks.",
                    "Performance Analysis of Multi-Buffered Packet-Switching Networks in Multiprocessor Systems.",
                    "Analysis of Interprocedural Side Effects in a Parallel Programming Environment.",
                    "Design and Rationale for MUPPET: A Programming Environment for Message Based Multiprocessors.",
                    "An Overview of the PTRAN Analysis System for Multiprocessing.",
                    "Tools for Performance Evaluation of Parallel Machines.",
                    "Strategies for Cache and Local Memory Management by Global Program Transformation.",
                    "Advanced Loop Optimizations for Parallel Computers.",
                    "MIMD-Parallelization for SUPENUM.",
                    "Loop Quantization or Unwinding Done Right.",
                    "Vector Optimization vs. Vectorization.",
                    "The Performance of Software-managed Multiprocessor Caches on Parallel Numerical Programs.",
                    "Realization of a Knowledge-Based Parallelization Tool in a Programming Environment.",
                    "Incremental Performance Contributions of Hardware Concurrency Extraction Techniques.",
                    "Access Patterns: A Useful Concept in Vector Programming.",
                    "Scheduling Sequential Loops on Parallel Processors.",
                    "Management of PDE Software for Supercomputing.",
                    "Implementing Codes on a SIMD / SPMD Architecture: Application to a Subset of EISPACK.",
                    "Supercomputing about Physical Objects.",
                    "The LINPACK Benchmark: An Explanation.",
                    "Cluster-Partitioning Approaches to Mapping Parallel Programs onto a Hypercube.",
                    "A Parallel Graph Partitioning Algorithm for a Message-Passing Multiprocessor.",
                    "The Mapping of Applications to Multiple Bus and Banyan Interconnected Multiprocessor Systems: A Case Study.",
                    "Communication and Control Costs of Domain Decomposition on Loosely Coupled Multiprocessors.",
                    "Half-Dynamic Scheduling with Data-flow Control.",
                    "A Parallel Block Cyclic Reduction Algorithm for the Fast Solution of Elliptic Equations.",
                    "A Group Explicit Solution Scheme for Non-Linear Parabolic PDEs on MIMD Parallel Systems.",
                    "Gaussian Elimination on Message Passing Architecture.",
                    "Basic Linear Algebra Computations on the Sperry ISP.",
                    "Future Scientific Programming on Parallel Machines.",
                    "Design and Scheduling of Mesh Array of Hardware Unifiers for Large-Scale Unification.",
                    "A Systolic Array Structure for Matrix Multiplication in the Residue Number System.",
                    "VLSI Arrays with Reconfigurable Buses.",
                    "A Wavefront Array Processor Using Dataflow Processing Elements.",
                    "Finite Element Methods on Parallel and Vector Computers: Application in Fluid Dynamics.",
                    "LU Factorization with Maximum Performances on FPS Architectures 38/64 BIT.",
                    "MSC / NASTRAN on AMDAHL Vector Processors; Adaptation and Performance.",
                    "Parallel Systolic LU Factorization for Simplex Updates.",
                    "Solving Elliptic Problems by the Domain Decomposition Method Using Proconditioning Matrices Derived by Multilevel Splitting of the Finite Element Matrix.",
                    "Major Research Activities in Parallel Processing in Japan.",
                    "A High Resolution Parallel Legendre Transform Algorithm.",
                    "Parallelization of a Reservoir Simulator.",
                    "A Computer Graphics Rendering Algorithm for Use on a SIMD Machine.",
                    "Benchmark of the Extended Basic Linear Algebra Subprograms on the NEC SX-2 Supercomputer.",
                    "Least-Squares Iterative Solution on a Fixed-Size VLSI Architecture.",
                    "Parallel Matrix Factorizations on a Shared Memory MIMD Computer.",
                    "Fast Parallel Algorithms for Processing of Joins.",
                    "Performance Analysis for a Join Processor.",
                    "Parallel Algorithms for Parenthesis Matching and Generation of Random Balanced Sequences of Parentheses.",
                    "Superlinear Speedup for Parallel Backtracking.",
                    "On the Processing Time of a Parallel Linear System Solver.",
                    "A Risc-Type Structural Design of the Hermes Multiprocessor Kernel.",
                    "Supercomputing in Europe -1987.",
                    "Domain Decomposition in Distributed and Shared Memory Environments. I: A Uniform Decomposition and Performance Analysis for the NCUBE and JPL Mark IIIfp Hypercubes.",
                    "A Technique for Compiling Execution Graph Expressions for Restricted and Parallelism in Logic Programs."
                ]
            }
        ]
    }
]