[
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2022",
        "info": "Volume 10: 2022",
        "count": 55,
        "papers": [
            "Guest Editorial: Special Section on Demand Response Applications of Cloud Computing Technologies.",
            "Self-Sufficient Participation in Cloud-Based Demand Response.",
            "Optimal Energy Trading With Demand Responses in Cloud Computing Enabled Virtual Power Plant in Smart Grids.",
            "Optimal Incentive Strategy in Cloud-Edge Integrated Demand Response Framework for Residential Air Conditioning Loads.",
            "Demand Response Control of Smart Buildings Integrated With Security Interconnection.",
            "A Hybrid Cloud and Edge Control Strategy for Demand Responses Using Deep Reinforcement Learning and Transfer Learning.",
            "Cloud Computing Based Demand Response Management Using Deep Reinforcement Learning.",
            "Demand Response as a Service: Clearing Multiple Distribution-Level Markets.",
            "Evolutionary Game Based Demand Response Bidding Strategy for End-Users Using Q-Learning and Compound Differential Evolution.",
            "Dynamic Price-Enabled Strategic Energy Management Scheme in Cloud-Enabled Smart Grid.",
            "Cloud-Edge Interoperability for Demand Response-Enabled Fast Frequency Response Service Provision.",
            "A Docker Container Anomaly Monitoring System Based on Optimized Isolation Forest.",
            "A Learning-Based Data Placement Framework for Low Latency in Data Center Networks.",
            "A Many-to-Many Demand and Response Hybrid Game Method for Cloud Environments.",
            "A Multi-Objective Optimization Scheme for Job Scheduling in Sustainable Cloud Data Centers.",
            "A Multi-Task Oriented Framework for Mobile Computation Offloading.",
            "An Online Cost-Efficient Transmission Scheme for Information-Agnostic Traffic in Inter-Datacenter Networks.",
            "Authorized Keyword Search over Outsourced Encrypted Data in Cloud Environment.",
            "ClassyTune: A Performance Auto-Tuner for Systems in the Cloud.",
            "Cloud Computing Assisted Blockchain-Enabled Internet of Things.",
            "Cloud-Based Framework for Spatio-Temporal Trajectory Data Segmentation and Query.",
            "Context-Aware Policy Enforcement for PaaS-Enabled Access Control.",
            "Cutting the Unnecessary Long Tail: Cost-Effective Big Data Clustering in the Cloud.",
            "Deadline-Aware Fast One-to-Many Bulk Transfers over Inter-Datacenter Networks.",
            "Dual-Server Public-Key Authenticated Encryption with Keyword Search.",
            "Dynamic Pricing for Sensor-Cloud Platform in the Presence of Dumb Nodes.",
            "Efficiency Measurement of Cloud Service Providers Using Network Data Envelopment Analysis.",
            "Efficient Identity-Based Provable Multi-Copy Data Possession in Multi-Cloud Storage.",
            "Efficient Privacy-Preserving Outsourced Discrete Wavelet Transform in the Encrypted Domain.",
            "Efficient Provision of Service Function Chains in Overlay Networks Using Reinforcement Learning.",
            "Energy-Efficient Device Activation, Rule Installation and Data Transmission in Software Defined DCNs.",
            "Exploring Potential and Feasibility of Binary Code Sharing in Mobile Computing.",
            "Forward Secure Public Key Encryption with Keyword Search for Outsourced Cloud Storage.",
            "Improving Performance and Capacity Utilization in Cloud Storage for Content Delivery and Sharing Services.",
            "Joint Computation Offloading and Bandwidth Assignment in Cloud-Assisted Edge Computing.",
            "Joint Optimization of MapReduce Scheduling and Network Policy in Hierarchical Data Centers.",
            "Lightweight and Expressive Fine-Grained Access Control for Healthcare Internet-of-Things.",
            "Lyapunov Optimization-Based Trade-Off Policy for Mobile Cloud Offloading in Heterogeneous Wireless Networks.",
            "MarVeLScaler: A Multi-View Learning-Based Auto-Scaling System for MapReduce.",
            "MPEC: Distributed Matrix Multiplication Performance Modeling on a Scale-Out Cloud Environment for Data Mining Jobs.",
            "Multi-Access Filtering for Privacy-Preserving Fog Computing.",
            "Near-Optimal Energy-Efficient Algorithm for Virtual Network Function Placement.",
            "Optimizing Speculative Execution in Spark Heterogeneous Environments.",
            "Petascale Cloud Supercomputing for Terapixel Visualization of a Digital Twin.",
            "Predictive Auto-Scaling of Multi-Tier Applications Using Performance Varying Cloud Resources.",
            "Probability-Based Online Algorithm for Switch Operation of Energy Efficient Data Center.",
            "Quantifying the Influence of Intermittent Connectivity on Mobile Edge Computing.",
            "Redundancy Minimization and Cost Reduction for Workflows with Reliability Requirements in Cloud-Based Services.",
            "Resource Price-Aware Offloading for Edge-Cloud Collaboration: A Two-Timescale Online Control Approach.",
            "Scheduling Real-Time Parallel Applications in Cloud to Minimize Energy Consumption.",
            "SDN-Based Traffic Matrix Estimation in Data Center Networks through Large Size Flow Identification.",
            "SecEDMO: Enabling Efficient Data Mining with Strong Privacy Protection in Cloud Computing.",
            "Towards Dependency-Aware Cache Management for Data Analytics Applications.",
            "Two-Tier Sharing in Electric Vehicle Service Market.",
            "User-Centric Interference-Aware Load Balancing for Cloud-Deployed Applications."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2021",
        "info": "Volume 9: 2021",
        "count": 124,
        "papers": [
            "A Game Approach to Multi-Servers Load Balancing with Load-Dependent Server Availability Consideration.",
            "A New Service Mechanism for Profit Optimizations of a Cloud Provider and Its Users.",
            "Achieving Secure, Universal, and Fine-Grained Query Results Verification for Secure Search Scheme Over Encrypted Cloud Data.",
            "Adaptive Resource Management for Analyzing Video Streams from Globally Distributed Network Cameras.",
            "Applying Buffer to SDN Switches: Benefits Analysis and Mechanism Design.",
            "Aggregation-Based Colocation Datacenter Energy Management in Wholesale Markets.",
            "An Efficient and Secured Framework for Mobile Cloud Computing.",
            "An Empirical Study on Data Flow Bugs in Business Processes.",
            "Cooperative Set Homomorphic Proofs for Data Possession Checking in Clouds.",
            "Cost Optimal Data Center Servers: A Voltage Scaling Approach.",
            "Dynamic VM Scaling: Provisioning and Pricing through an Online Auction.",
            "Efficient Algorithm for Secure Outsourcing of Modular Exponentiation with Single Server.",
            "Efficient Replica Migration Scheme for Distributed Cloud Storage Systems.",
            "Enhancing Performance and Energy Efficiency for Hybrid Workloads in Virtualized Cloud Environment.",
            "Hedonic Pricing of Cloud Computing Services.",
            "Karma: Cost-Effective Geo-Replicated Cloud Storage with Dynamic Enforcement of Causal Consistency.",
            "Lightweight and Privacy-Preserving Delegatable Proofs of Storage with Data Dynamics in Cloud Storage.",
            "Live Migration in Bare-Metal Clouds.",
            "Multi-Cloud Performance and Security Driven Federated Workflow Management.",
            "Network and Application-Aware Cloud Service Selection in Peer-Assisted Environments.",
            "On the Efficiency of Cloud Providers: A DEA Approach Incorporating Categorical Variables.",
            "Outsourcing Proofs of Retrievability.",
            "Price-Based Resource Allocation for Edge Computing: A Market Equilibrium Approach.",
            "Provably Secure and Lightweight Identity-Based Authenticated Data Sharing Protocol for Cyber-Physical Cloud Environment.",
            "Risk-Averse Caching Policies for YouTube Content in Femtocell Networks using Density Forecasting.",
            "SeSPHR: A Methodology for Secure Sharing of Personal Health Records in the Cloud.",
            "Speeding Up VM Startup by Cooperative VM Image Caching.",
            "Trigger-Based Incremental Data Processing with Unified Sync and Async Model.",
            "Unequal Failure Protection Coding Technique for Distributed Cloud Storage Systems.",
            "Virtual Machine Extrospection: A Reverse Information Retrieval in Clouds.",
            "Editorial: State of the Transactions on Cloud Computing.",
            "A Hierarchical Receding Horizon Algorithm for QoS-Driven Control of Multi-IaaS Applications.",
            "A Robust Generic Multi-Authority Attributes Management System for Cloud Storage Services.",
            "A Robust Optimization Technique for Energy Cost Minimization of Cloud Data Centers.",
            "An Intermediate Data Partition Algorithm for Skew Mitigation in Spark Computing Environment.",
            "An SLA-Aware Cloud Coalition Formation Approach for Virtualized Networks.",
            "Characterization and Prediction of Performance Loss and MTTR During Fault Recovery on Scale-Out Storage Using DOE & RSM: A Case Study with Ceph.",
            "Cloud Resource Scaling for Time-Bounded and Unbounded Big Data Streaming Applications.",
            "Consolidating Policy Chains Using One Pass Packet Steering in Software Defined Data Centers.",
            "Demand-Aware Erasure Coding for Distributed Storage Systems.",
            "Dependable Data Outsourcing Scheme Based on Cloud-of-Clouds Approach with Fast Recovery.",
            "D-SRTF: Distributed Shortest Remaining Time First Scheduling for Data Center Networks.",
            "Efficient and Privacy-Preserving Online Fingerprint Authentication Scheme over Outsourced Data.",
            "Efficient and Secure Outsourcing of Large-Scale Linear System of Equations.",
            "Efficient Oblivious Data Structures for Database Services on the Cloud.",
            "FPGA Resource Pooling in Cloud Computing.",
            "Guaranteed Bang for the Buck: Modeling VDI Applications to Identify Storage Requirements.",
            "Hybrid Evolutionary Scheduling for Energy-Efficient Fog-Enhanced Internet of Things.",
            "Hypertracing: Tracing Through Virtualization Layers.",
            "KeyD: Secure Key-Deduplication with Identity-Based Broadcast Encryption.",
            "Maximizing Cloud Revenue using Dynamic Pricing of Multiple Class Virtual Machines.",
            "New YARN Non-Exclusive Resource Management Scheme through Opportunistic Idle Resource Assignment.",
            "On the Fly Orchestration of Unikernels: Tuning and Performance Evaluation of Virtual Infrastructure Managers.",
            "On the Planning and Design Problem of Fog Computing Networks.",
            "Optimizing Quality-Aware Big Data Applications in the Cloud.",
            "Privacy Preserving Searchable Encryption with Fine-Grained Access Control.",
            "Providing Bandwidth Guarantees, Work Conservation and Low Latency Simultaneously in the Cloud.",
            "QoS Promotion in Energy-Efficient Datacenters Through Peak Load Scheduling.",
            "Threat-Specific Security Risk Evaluation in the Cloud.",
            "Two-Aggregator Topology Optimization Using Single Paths in Data Center Networks.",
            "User Association in Cloud RANs with Massive MIMO.",
            "Virtual Network Recognition and Optimization in SDN-Enabled Cloud Environment.",
            "Correction to \"An Efficient and Secured Framework For Mobile Cloud Computing\".",
            "A Game-based Thermal-Aware Resource Allocation Strategy for Data Centers.",
            "A Game-Theoretic Framework for the Virtual Machines Migration Timing Problem.",
            "A Streaming Cloud Platform for Real-Time Video Processing on Embedded Devices.",
            "A Two-Stage Auction Mechanism for Cloud Resource Allocation.",
            "An Efficient Approach Based on Ant Colony Optimization and Tabu Search for a Resource Embedding Across Multiple Cloud Providers.",
            "Architectural Protection of Trusted System Services for SGX Enclaves in Cloud Computing.",
            "Blockchain-Based Public Integrity Verification for Cloud Storage against Procrastinating Auditors.",
            "CloudCFI: Context-Sensitive and Incremental CFI in the Cloud Environment.",
            "Computing-Aware Base Station Sleeping Mechanism in H-CRAN-Cloud-Edge Networks.",
            "Cost-Efficient Resource Provisioning for Dynamic Requests in Cloud Assisted Mobile Edge Computing.",
            "Dynamic Cloud Resource Allocation Considering Demand Uncertainty.",
            "Dynamic Resource Management to Defend Against Advanced Persistent Threats in Fog Computing: A Game Theoretic Approach.",
            "Efficient and Green Embedding of Virtual Data Centers with Mixture of Unicast and Multicast Services.",
            "Elephant Flow Detection and Load-Balanced Routing with Efficient Sampling and Classification.",
            "Empirical Investigation of Key Factors for SaaS Architecture.",
            "Energy Efficient Dynamic Offloading in Mobile Edge Computing for Internet of Things.",
            "Enhancing Reliability and Availability through Redundancy in Vehicular Clouds.",
            "Evaluating Distributed Computing Infrastructures: An Empirical Study Comparing Hadoop Deployments on Cloud and Local Systems.",
            "Hybrid Resource Provisioning for Cloud Workflows with Malleable and Rigid Tasks.",
            "Investigating Machine Learning Algorithms for Modeling SSD I/O Performance for Container-Based Virtualization.",
            "Key Management Scheme for Secure Channel Establishment in Fog Computing.",
            "Low Latency and High Throughput Write-Ahead Logging Using CAPI-Flash.",
            "Mobility and Dependence-Aware QoS Monitoring in Mobile Edge Computing.",
            "New Scheduling Algorithms for Improving Performance and Resource Utilization in Hadoop YARN Clusters.",
            "On Bayesian Epistemology of Myerson Auction.",
            "Online Multi-Workflow Scheduling under Uncertain Task Execution Time in IaaS Clouds.",
            "Outsourced Decentralized Multi-Authority Attribute Based Signature and Its Application in IoT.",
            "Quantitative Analysis of Opacity in Cloud Computing Systems.",
            "Scheduling of Low Latency Services in Softwarized Networks.",
            "SLA-Based Profit Optimization Resource Scheduling for Big Data Analytics-as-a-Service Platforms in Cloud Computing Environments.",
            "VFTree: A Versatile Network Architecture for Data Centers.",
            "A Power Consumption Model for Cloud Servers Based on Elman Neural Network.",
            "A Trust-Aware Mechanism for Cloud Federation Formation.",
            "A User-Centric Data Protection Method for Cloud Storage Based on Invertible DWT.",
            "An Energy and Performance Aware Consolidation Technique for Containerized Datacenters.",
            "Big-Sensor-Cloud Infrastructure: A Holistic Prototype for Provisioning Sensors-as-a-Service.",
            "Blockchain-Assisted Public-Key Encryption with Keyword Search Against Keyword Guessing Attacks for Cloud Storage.",
            "Charon: A Secure Cloud-of-Clouds System for Storing and Sharing Big Data.",
            "CIPPPA: Conditional Identity Privacy-Preserving Public Auditing for Cloud-Based WBANs Against Malicious Auditors.",
            "Classification-Based and Energy-Efficient Dynamic Task Scheduling Scheme for Virtualized Cloud Data Center.",
            "Cost-Effective Sharing of Streaming Dataflows for IoT Applications.",
            "Data Integrity Auditing without Private Key Storage for Secure Cloud Storage.",
            "Delay and Cost Optimization in Computational Offloading Systems with Unknown Task Processing Times.",
            "Dynamic Demand Prediction and Allocation in Cloud Service Brokerage.",
            "FastTrack: Minimizing Stalls for CDN-Based Over-the-Top Video Streaming Systems.",
            "FCTcon: Dynamic Control of Flow Completion Time in Data Center Networks for Power Efficiency.",
            "Impact of Processing-Resource Sharing on the Placement of Chained Virtual Network Functions.",
            "Incentive Facilitation for Peer Data Exchange in Crowdsensing.",
            "Joint Management of Wireless and Computing Resources for Computation Offloading in Mobile Edge Clouds.",
            "Low Latency Big Data Processing without Prior Information.",
            "Maximizing Throughput of Delay-Sensitive NFV-Enabled Request Admissions via Virtualized Network Function Placement.",
            "Model-Driven Elasticity Management with OCCI.",
            "Profit Maximization of Big Data Jobs in Cloud Using Stochastic Optimization.",
            "Repair Strategies for Mobile Storage Systems.",
            "Rerouting Strategies for Highly Available Virtual Network Functions.",
            "Secure Data Group Sharing and Conditional Dissemination with Multi-Owner in Cloud Computing.",
            "Survivable IaaS Management with SDN.",
            "TOFFEE: Task Offloading and Frequency Scaling for Energy Efficiency of Mobile Devices in Mobile Edge Computing.",
            "Two-Server Delegation of Computation on Label-Encrypted Data.",
            "ViePEP-C: A Container-Based Elastic Process Platform.",
            "Comment on \"Achieving Secure, Universal, and Fine-Grained Query Results Verification for Secure Search Scheme Over Encrypted Cloud Data\"."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2020",
        "info": "Volume 8: 2020",
        "count": 104,
        "papers": [
            "Farewell Editorial.",
            "A Carbon-Aware Incentive Mechanism for Greening Colocation Data Centers.",
            "A Resource Usage Intensity Aware Load Balancing Method for Virtual Machine Migration in Cloud Datacenters.",
            "A Scalable Attribute-Based Access Control Scheme with Flexible Delegation cum Sharing of Access Privileges for Cloud Storage.",
            "Achieving Multi-Hop PRE via Branching Program.",
            "Amazon EC2 Spot Price Prediction Using Regression Random Forests.",
            "Bulk Savings for Bulk Transfers: Minimizing the Energy-Cost for Geo-Distributed Data Centers.",
            "Delay-Sensitive Multicast in Inter-Datacenter WAN Using Compressive Latency Monitoring.",
            "Design and Implementation of an Overlay File System for Cloud-Assisted Mobile Apps.",
            "Disaster Recovery Layer for Distributed OpenStack Deployments.",
            "Efficient Decentralized Attribute Based Access Control for Mobile Clouds.",
            "Efficient Proofs of Retrievability with Public Verifiability for Dynamic Cloud Storage.",
            "Fair Online Power Capping for Emergency Handling in Multi-Tenant Cloud Data Centers.",
            "Google Users as Sequences: A Robust Hierarchical Cluster Analysis Study.",
            "Green Cloudlet Network: A Sustainable Platform for Mobile Cloud Computing.",
            "Heterogeneous Job Allocation Scheduler for Hadoop MapReduce Using Dynamic Grouping Integrated Neighboring Search.",
            "How to Extract Image Features Based on Co-Occurrence Matrix Securely and Efficiently in Cloud Computing.",
            "ODDS: Optimizing Data-Locality Access for Scientific Data Analysis.",
            "Optimizing Timeliness and Cost in Geo-Distributed Streaming Analytics.",
            "Predicted Affinity Based Virtual Machine Placement in Cloud Computing Environments.",
            "Predicting Workflow Task Execution Time in the Cloud Using A Two-Stage Machine Learning Approach.",
            "Providing Performance Guarantees for Cloud-Deployed Applications.",
            "Scheduling Live Migration of Virtual Machines.",
            "TIMER-Cloud: Time-Sensitive VM Provisioning in Resource-Constrained Clouds.",
            "Toward Practical Privacy-Preserving Frequent Itemset Mining on Encrypted Cloud Data.",
            "Editorial: A Message from the Incoming Editor-in-Chief.",
            "A 3D Image Quality Assessment Method Based on Vector Information and SVD of Quaternion Matrix under Cloud Computing Environment.",
            "A Context-Aware Service Evaluation Approach over Big Data for Cloud Applications.",
            "A Data and Task Co-Scheduling Algorithm for Scientific Cloud Workflows.",
            "An Integration Framework on Cloud for Cyber-Physical-Social Systems Big Data.",
            "Cross-Cloud MapReduce for Big Data.",
            "Crowdsourcing Based Description of Urban Emergency Events Using Social Media Big Data.",
            "Hybrid Consensus Pruning of Ensemble Classifiers for Big Data Malware Detection.",
            "Microaggregation Sorting Framework for K-Anonymity Statistical Disclosure Control in Cloud Computing.",
            "Phase-Reconfigurable Shuffle Optimization for Hadoop MapReduce.",
            "Segmented In-Advance Data Analytics for Fast Scientific Discovery.",
            "Statistical Model Checking-Based Evaluation and Optimization for Cloud Workflow Resource Allocation.",
            "Stochastic Load Balancing for Virtual Resource Management in Datacenters.",
            "A Clustering-Based Multi-Layer Distributed Ensemble for Neurological Diagnostics in Cloud Services.",
            "Achieving Secure and Efficient Dynamic Searchable Symmetric Encryption over Medical Cloud Data.",
            "Cloud Colonography: Distributed Medical Testbed over Cloud.",
            "Efficiently Translating Complex SQL Query to MapReduce Jobflow on Cloud.",
            "Splitting Large Medical Data Sets Based on Normal Distribution in Cloud Environment.",
            "Parallel RMCLP Classification Algorithm and Its Application on the Medical Data.",
            "Wisdom as a Service for Mental Health Care.",
            "A Dynamic and Failure-Aware Task Scheduling Framework for Hadoop.",
            "Energy-Efficient Decision Making for Mobile Cloud Offloading.",
            "Near-Optimal Deployment of Service Chains by Exploiting Correlations Between Network Functions.",
            "Privacy Aware Data Deduplication for Side Channel in Cloud Storage.",
            "Privacy-Preserving Outsourced Support Vector Machine Design for Secure Drug Discovery.",
            "QoS-Aware Cloudlet Load Balancing in Wireless Metropolitan Area Networks.",
            "Locality-Aware Scheduling for Containers in Cloud Computing.",
            "A Distributed Auction-based Framework for Scalable IaaS Provisioning in Geo-Data Centers.",
            "A Key-Policy Attribute-Based Temporary Keyword Search scheme for Secure Cloud Storage.",
            "A New Lightweight Symmetric Searchable Encryption Scheme for String Identification.",
            "A Planning Approach for Reassigning Virtual Machines in IaaS Clouds.",
            "A Power-of-Two Choices Based Algorithm for Fog Computing.",
            "A Robust Formulation for Efficient Application Offloading to Clouds.",
            "A Tight Estimate of Job Completion Time in Vehicular Clouds.",
            "A Truthful $(1-\\epsilon)$(1-ε)-Optimal Mechanism for On-Demand Cloud Resource Provisioning.",
            "Adjusting Packet Size to Mitigate TCP Incast in Data Center Networks with COTS Switches.",
            "Detecting Performance Anomalies in Cloud Platform Applications.",
            "Distributed Resource Allocation for Data Center Networks: A Hierarchical Game Approach.",
            "EDoS-ADS: An Enhanced Mitigation Technique Against Economic Denial of Sustainability (EDoS) Attacks.",
            "Efficient Regular Language Search for Secure Cloud Storage.",
            "Efficient Traceable Authorization Search System for Secure Cloud Storage.",
            "Energy Efficient Scheduling of Servers with Multi-Sleep Modes for Cloud Data Center.",
            "From Byzantine Fault-Tolerance to Fault-Avoidance: An Architectural Transformation to Attack and Failure Resiliency.",
            "Intelligent Health Vessel ABC-DE: An Electrocardiogram Cloud Computing Service.",
            "On the Feasibility of Using Current Data Centre Infrastructure for Latency-Sensitive Applications.",
            "Online VM Auto-Scaling Algorithms for Application Hosting in a Cloud.",
            "Revenue Maximization for Dynamic Expansion of Geo-Distributed Cloud Data Centers.",
            "RRect: A Novel Server-Centric Data Center Network with High Power Efficiency and Availability.",
            "Towards Security-Based Formation of Cloud Federations: A Game Theoretical Approach.",
            "virtFlow: Guest Independent Execution Flow Analysis Across Virtualized Environments.",
            "VMGuard: A VMI-Based Security Architecture for Intrusion Detection in Cloud Environment.",
            "Guest Editorial: Special Section on Advances of Utility and Cloud Computing Technologies and Services.",
            "Optimizing Information Leakage in Multicloud Storage Services.",
            "Link-Aware Virtual Machine Placement for Cloud Services based on Service-Oriented Architecture.",
            "Game Theoretical Analysis on Acceptance of a Cloud Data Access Control System Based on Reputation.",
            "Towards Pricing for Sensor-Cloud.",
            "A Reinforcement Learning-Based Mixed Job Scheduler Scheme for Grid or IaaS Cloud.",
            "STAR: SLA-aware Autonomic Management of Cloud Resources.",
            "Online Inter-Datacenter Service Migrations.",
            "DSARP: Dependable Scheduling with Active Replica Placement for Workflow Applications in Cloud Computing.",
            "Performance-Based Pricing in Multi-Core Geo-Distributed Cloud Computing.",
            "Dynamically Partitioning Workflow over Federated Clouds for Optimising the Monetary Cost and Handling Run-Time Failures.",
            "Trustworthy Enhancement for Cloud Proxy based on Autonomic Computing.",
            "Towards Network-Aware Service Composition in the Cloud.",
            "Quantitative Modeling and Analytical Calculation of Elasticity in Cloud Computing.",
            "A Data Skew Oriented Reduce Placement Algorithm Based on Sampling.",
            "Adaptive Computing-Plus-Communication Optimization Framework for Multimedia Processing in Cloud Systems.",
            "An Ancillary Services Model for Data Centers and Power Systems.",
            "Bandwidth On-Demand for Multimedia Big Data Transfer Across Geo-Distributed Cloud Data Centers.",
            "Boafft: Distributed Deduplication for Big Data Storage in the Cloud.",
            "Cost-Aware Multimedia Data Allocation for Heterogeneous Memory Using Genetic Algorithm in Cloud Computing.",
            "Quantitative Fault-Tolerance for Reliable Workflows on Heterogeneous IaaS Clouds.",
            "Hybrid Tree-Rule Firewall for High Speed Data Transmission.",
            "Integrating Mobile Display Energy Saving into Cloud-Based Video Streaming via Rate-Distortion-Display Energy Profiling.",
            "Multimedia Processing Pricing Strategy in GPU-Accelerated Cloud Computing.",
            "Privacy Protection and Intrusion Avoidance for Cloudlet-Based Medical Data Sharing.",
            "Stochastic Workload Scheduling for Uncoordinated Datacenter Clouds with Multiple QoS Constraints.",
            "On the Privacy of Matrix Masking-Based Verifiable (Outsourced) Computation.",
            "Comments on \"Secure Data Sharing in Cloud Computing Using Revocable-Storage Identity-Based Encryption\"."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2019",
        "info": "Volume 7: 2019",
        "count": 91,
        "papers": [
            "TCC: State of the Transactions.",
            "A Multi-Layered Scheme for Distributed Simulations on the Cloud Environment.",
            "Adaptive Network Coded Clouds: High Speed Downloads and Cost-Effective Version Control.",
            "Cost-aware Multi Data-Center Bulk Transfers in the Cloud from a Customer-Side Perspective.",
            "Cross-Layer Multi-Cloud Real-Time Application QoS Monitoring and Benchmarking As-a-Service Framework.",
            "Estimation of the Available Bandwidth in Inter-Cloud Links for Task Scheduling in Hybrid Clouds.",
            "Inter-Datacenter Scheduling of Large Data Flows.",
            "Optimal Data Center Scheduling for Quality of Service Management in Sensor-Cloud.",
            "Quality-Assured Secured Load Sharing in Mobile Cloud Networking Environment.",
            "SDN-Based Multi-Class QoS Guarantee in Inter-Data Center Communications.",
            "A Distributed Coalition Game Approach to Femto-Cloud Formation.",
            "A Power and Latency Aware Cloudlet Selection Strategy for Multi-Cloudlet Environment.",
            "An Efficient Strategy for Online Performance Monitoring of Datacenters via Adaptive Sampling.",
            "Cloud Benchmarking for Maximising Performance of Scientific Applications.",
            "Co-Operative Resource Allocation: Building an Open Cloud Market Using Shared Infrastructure.",
            "Energy-Efficient Adaptive Resource Management for Real-Time Vehicular Cloud Services.",
            "Gazing into the Crystal Ball: When the Future Internet Meets the Mobile Clouds.",
            "Hadoop MapReduce for Mobile Clouds.",
            "Live Placement of Interdependent Virtual Machines to Optimize Cloud Service Profits and Penalties on SLAs.",
            "Loop Parallelism Maximization for Multimedia Data Processing in Mobile Vehicular Clouds.",
            "Mobile Cloud Support for Semantic-Enriched Speech Recognition in Social Care.",
            "PISCES: Optimizing Multi-Job Application Execution in MapReduce.",
            "Prioritization of Overflow Tasks to Improve Performance of Mobile Cloud.",
            "Guest Editors' Introduction: Special Section on Mobile Cloud Computing.",
            "Optimal Joint Scheduling and Cloud Offloading for Mobile Applications.",
            "Selective Mobile Cloud Offloading to Augment Multi-Persona Performance and Viability.",
            "Computing with Nearby Mobile Devices: A Work Sharing Algorithm for Mobile Edge-Clouds.",
            "Using Crowdsourcing to Provide QoS for Mobile Cloud Computing.",
            "Coordinate Memory Deduplication and Partition for Improving Performance in Cloud Computing.",
            "Follow-Me Cloud: When Cloud Services Follow Mobile Users.",
            "A Modified Hierarchical Attribute-Based Encryption Access Control Method for Mobile Cloud Computing.",
            "Using Socio-Spatial Context in Mobile Cloud Process Offloading for Energy Conservation in Wireless Devices.",
            "Energy Efficiency Using Cloud Management of LTE Networks Employing Fronthaul and Virtualized Baseband Processing Pool.",
            "A Distributed Secure Outsourcing Scheme for Solving Linear Algebraic Equations in Ad Hoc Clouds.",
            "Adia: Achieving High Link Utilization with Coflow-Aware Scheduling in Data Center Networks.",
            "Agent-Based Approaches for Intelligent Intercloud Resource Allocation.",
            "Amazon Elastic Compute Cloud (EC2) versus In-House HPC Platform: A Cost Analysis.",
            "Cheating-Resilient Bandwidth Distribution in Mobile Cloud Computing.",
            "Cost-Minimizing Bandwidth Guarantee for Inter-Datacenter Traffic.",
            "Differentiated Latency in Data Center Networks with Erasure Coded Files Through Traffic Engineering.",
            "Dithen: A Computation-as-a-Service Cloud Platform for Large-Scale Multimedia Processing.",
            "Energy-Aware VM Consolidation in Cloud Data Centers Using Utilization Prediction Model.",
            "Multi-Objective Service Composition with QoS Dependencies.",
            "NetWatch: End-to-End Network Performance Measurement as a Service for Cloud.",
            "Practical Privacy-Preserving MapReduce Based K-Means Clustering Over Large-Scale Dataset.",
            "SNC: A Cloud Service Platform for Symbolic-Numeric Computation Using Just-In-Time Compilation.",
            "A Johnson's-Rule-Based Genetic Algorithm for Two-Stage-Task Scheduling Problem in Data-Centers of Cloud Computing.",
            "A Markov Random Field Based Approach for Analyzing Supercomputer System Logs.",
            "A Robust Reputation Management Mechanism in the Federated Cloud.",
            "Achieving Privacy-Friendly Storage and Secure Statistics for Smart Meter Data on Outsourced Clouds.",
            "AGATE: Adaptive Gray Area-Based TEchnique to Cluster Virtual Machines with Similar Behavior.",
            "Adaptive Avatar Handoff in the Cloudlet Network.",
            "Cloud Container Technologies: A State-of-the-Art Review.",
            "Correlation Modeling and Resource Optimization for Cloud Service With Fault Recovery.",
            "Cost Optimization for Dynamic Replication and Migration of Data in Cloud Data Centers.",
            "Cost-Efficient Tasks and Data Co-Scheduling with AffordHadoop.",
            "Dynamic Multi-Tenant Coordination for Sustainable Colocation Data Centers.",
            "Empirical Discovery of Power-Law Distribution in MapReduce Scalability.",
            "Faces in the Clouds: Long-Duration, Multi-User, Cloud-Assisted Video Conferencing.",
            "Faster MapReduce Computation on Clouds Through Better Performance Estimation.",
            "Practical Privacy-Preserving Content-Based Retrieval in Cloud Image Repositories.",
            "Publicly Verifiable Boolean Query Over Outsourced Encrypted Data.",
            "Resource Provisioning for Task-Batch Based Workflows with Deadlines in Public Clouds.",
            "Securing Aggregate Queries for DNA Databases.",
            "Securing Cloud Data Under Key Exposure.",
            "Speedy Cloud: Cloud Computing with Support for Hardware Acceleration Services.",
            "Stability of Cloud-Based UAV Systems Supporting Big Data Acquisition and Processing.",
            "Synergy: A Hypervisor Managed Holistic Caching System.",
            "Comment on \"Highly Efficient Linear Regression Outsourcing to a Cloud\".",
            "A Logic-Based Benders Decomposition Approach for the VNF Assignment Problem.",
            "An Adaptive and Fuzzy Resource Management Approach in Cloud Computing.",
            "Application-Aware Big Data Deduplication in Cloud Environment.",
            "Cloud Resource Management for Analyzing Big Real-Time Visual Data from Network Cameras.",
            "Cloudy Knapsack Algorithm for Offloading Tasks from Large Scale Distributed Applications.",
            "Dynamic Resource Provisioning for Energy Efficient Cloud Radio Access Networks.",
            "Error Concealment for Cloud-Based and Scalable Video Coding of HD Videos.",
            "Facilitating Secure and Efficient Spatial Query Processing on the Cloud.",
            "Fast Phrase Search for Encrypted Cloud Storage.",
            "Fault Tolerant Stencil Computation on Cloud-Based GPU Spot Instances.",
            "Game-Theory Based Power and Spectrum Virtualization for Optimizing Spectrum Efficiency in Mobile Cloud-Computing Wireless Networks.",
            "Hierarchical Stochastic Models for Performance, Availability, and Power Consumption Analysis of IaaS Clouds.",
            "Learn to Play Maximum Revenue Auction.",
            "Robust Performance-Based Resource Provisioning Using a Steady-State Model for Multi-Objective Stochastic Programming.",
            "Service Chaining for Hybrid Network Function.",
            "Shaving Data Center Power Demand Peaks Through Energy Storage and Workload Shifting Control.",
            "Stackelberg Game for Energy-Aware Resource Allocation to Sustain Data Centers Using RES.",
            "Towards Declarative and Data-Centric Virtual Machine Image Management in IaaS Clouds.",
            "Two-Aggregator Topology Optimization Using Multiple Paths in Data Center Networks.",
            "Video Stream Analysis in Clouds: An Object Detection and Classification Framework for High Performance Video Analytics.",
            "Virtual Machine Migration Planning in Software-Defined Networks.",
            "When I/O Interrupt Becomes System Bottleneck: Efficiency and Scalability Enhancement for SR-IOV Network Virtualization."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2018",
        "info": "Volume 6: 2018",
        "count": 92,
        "papers": [
            "TCC: State of the Transactions.",
            "A Cost-Effective Deadline-Constrained Dynamic Scheduling Algorithm for Scientific Workflows in a Cloud Environment.",
            "A Shapley-Value Mechanism for Bandwidth On Demand between Datacenters.",
            "Adaptive Dispatching of Tasks in the Cloud.",
            "Assessment of the Suitability of Fog Computing in the Context of Internet of Things.",
            "ATME: Accurate Traffic Matrix Estimation in Both Public and Private Datacenter Networks.",
            "Catch You if You Misbehave: Ranked Keyword Search Results Verification in Cloud Computing.",
            "Data Transfer Scheduling for Maximizing Throughput of Big-Data Computing in Cloud Systems.",
            "Economic and Energy Considerations for Resource Augmentation in Mobile Cloud Computing.",
            "Energy Efficient Cooperative Computing in Mobile Wireless Sensor Networks.",
            "MapReduce Scheduling for Deadline-Constrained Jobs in Heterogeneous Cloud Computing Systems.",
            "Modelling and Analysis of A Novel Deadline-Aware Scheduling Scheme for Cloud Computing Data Centers.",
            "Optimizing for Tail Sojourn Times of Cloud Clusters.",
            "Risk-Aware Management of Virtual Resources in Access Controlled Service-Oriented Cloud Datacenters.",
            "Scalable pCT Image Reconstruction Delivered as a Cloud Service.",
            "Scatter-Gather Live Migration of Virtual Machines.",
            "Shadow-Routing Based Dynamic Algorithms for Virtual Machine Placement in a Network Cloud.",
            "SimGrid VM: Virtual Machine Support for a Simulation Framework of Distributed Systems.",
            "StarCube: An On-Demand and Cost-Effective Framework for Cloud Data Center Networks with Performance Guarantee.",
            "Supporting Data-Intensive Workflows in Software-Defined Federated Multi-Clouds.",
            "Towards Efficient Resource Allocation for Heterogeneous Workloads in IaaS Clouds.",
            "Towards Privacy-Preserving Content-Based Image Retrieval in Cloud Computing.",
            "Translating Algorithms to Handle Fully Homomorphic Encrypted Data on the Cloud.",
            "Guest Editor's Introduction to the Special Issue on Security and Privacy on Clouds.",
            "DROPS: Division and Replication of Data in Cloud for Optimal Performance and Security.",
            "Towards Privacy Preserving Publishing of Set-Valued Data on Hybrid Cloud.",
            "Model-Based Thermal Anomaly Detection in Cloud Datacenters Using Thermal Imaging.",
            "A Lightweight Secure Data Sharing Scheme for Mobile Cloud Computing.",
            "A Classification and Comparison Framework for Cloud Service Brokerage Architectures.",
            "CypherDB: A Novel Architecture for Outsourcing Secure Database Processing.",
            "Assurance of Security and Privacy Requirements for Cloud Deployment Models.",
            "Statistical Learning for Anomaly Detection in Cloud Server Systems: A Multi-Order Markov Chain Framework.",
            "Audit-Free Cloud Storage via Deniable Attribute-Based Encryption.",
            "Probabilistic Optimization of Resource Distribution and Encryption for Data Storage in the Cloud.",
            "Chaotic Searchable Encryption for Mobile Cloud Storage.",
            "Space-Efficient Verifiable Secret Sharing Using Polynomial Interpolation.",
            "CSR: Classified Source Routing in Distributed Networks.",
            "Architectural Protection of Application Privacy against Software and Physical Attacks in Untrusted Cloud Environment.",
            "Three-Server Swapping for Access Confidentiality.",
            "A Holistic Approach for Distributed Dimensionality Reduction of Big Data.",
            "An Algorithm for Finding the Minimum Cost of Storing and Regenerating Datasets in Multiple Clouds.",
            "Cloud-Based Fine-Grained Health Information Access Control Framework for LightweightIoT Devices with Dynamic Auditing andAttribute Revocation.",
            "Converged Network-Cloud Service Composition with End-to-End Performance Guarantee.",
            "Efficient Skew Handling for Outer Joins in a Cloud Computing Environment.",
            "Fast and Reliable Restoration Method of Virtual Resources on OpenStack.",
            "RASP-Boost: Confidential Boosting-Model Learning with Perturbed Data in the Cloud.",
            "A Novel Statistical Cost Model and an Algorithm for Efficient Application Offloading to Clouds.",
            "Achieving Energy Efficiency in Data Centers Using an Artificial Intelligence Abstraction Model.",
            "Ad-Hoc Cloudlet Based Cooperative Cloud Gaming.",
            "ADON: Application-Driven Overlay Network-as-a-Service for Data-Intensive Science.",
            "Collective Energy-Efficiency Approach to Data Center Networks Planning.",
            "Dependency-Aware Data Locality for MapReduce.",
            "Dynamic and Public Auditing with Fair Arbitration for Cloud Data.",
            "Efficient Embedding of Virtual Networks to Distributed Clouds via Exploring Periodic Resource Demands.",
            "Energy-Efficient Task Execution for Application as a General Topology in Mobile Cloud Computing.",
            "EPAS: A Sampling Based Similarity Identification Algorithm for the Cloud.",
            "Exploiting Spatio-Temporal Diversity for Water Saving in Geo-Distributed Data Centers.",
            "Identity-Based Private Matching over Outsourced Encrypted Datasets.",
            "Joint Energy Minimization and Resource Allocation in C-RAN with Mobile Cloud.",
            "Model-Driven Development Patterns for Mobile Services in Cloud of Things.",
            "Modular AWG-based Interconnection for Large-Scale Data Center Networks.",
            "Monitoring Elastically Adaptive Multi-Cloud Services.",
            "On Optimal and Fair Service Allocation in Mobile Cloud Computing.",
            "On the Carbon Footprint Optimization in an InterCloud Environment.",
            "On the Performance Impact of Data Access Middleware for NoSQL Data Stores A Study of the Trade-Off between Performance and Migration Cost.",
            "Parallel Semi-Supervised Multi-Ant Colonies Clustering Ensemble Based on MapReduce Methodology.",
            "Secure Tensor Decomposition Using Fully Homomorphic Encryption Scheme.",
            "Theoretical Results of QoS-Guaranteed Resource Scaling for Cloud-Based MapReduce.",
            "Trust is Good, Control is Better: Creating Secure Clouds by Continuous Auditing.",
            "A Combinatorial Auction Mechanism for Multiple Resource Procurement in Cloud Computing.",
            "A Dynamical and Load-Balanced Flow Scheduling Approach for Big Data Centers in Clouds.",
            "A Forecasting Methodology for Workload Forecasting in Cloud Systems.",
            "A Protocol for Preventing Insider Attacks in Untrusted Infrastructure-as-a-Service Clouds.",
            "An Energy-Efficient VM Prediction and Migration Framework for Overcommitted Clouds.",
            "Bandwidth Provisioning for Virtual Machine Migration in Cloud: Strategy and Application.",
            "Business-Driven Service Placement for Highly Dynamic and Distributed Cloud Systems.",
            "Effective Modeling Approach for IaaS Data Center Performance Analysis under Heterogeneous Workload.",
            "Feedback Autonomic Provisioning for Guaranteeing Performance in MapReduce Systems.",
            "G-SD: Achieving Fast Reverse Lookup using Scalable Declustering Layout in Large-Scale File Systems.",
            "H2Hadoop: Improving Hadoop Performance Using the Metadata of Related Jobs.",
            "Identity-Based Encryption with Cloud Revocation Authority and Its Applications.",
            "Middleware-Oriented Deployment Automation for Cloud Applications.",
            "Modeling Service Applications for Optimal Parallel Embedding.",
            "Novel Scheduling Algorithms for Efficient Deployment of MapReduce Applications in Heterogeneous Computing Environments.",
            "Optimizing Live Migration of Multiple Virtual Machines.",
            "PHE: An Efficient Traitor Tracing and Revocation for Encrypted File Syncing-and-Sharing in Cloud.",
            "Price-Sensitivity Aware Load Balancing for Geographically Distributed Internet Data Centers in Smart Grid Environment.",
            "Secure Data Sharing in Cloud Computing Using Revocable-Storage Identity-Based Encryption.",
            "Securing Services in Networked Cloud Infrastructures.",
            "Stochastic Modeling and Optimization of Stragglers.",
            "SVDC: A Highly Scalable Isolation Architecture for Virtualized Layer-2 Data Center Networks.",
            "Using Proactive Fault-Tolerance Approach to Enhance Cloud Service Reliability."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2017",
        "info": "Volume 5: 2017",
        "count": 60,
        "papers": [
            "TCC: State of the Transactions.",
            "Automatic Memory Control of Multiple Virtual Machines on a Consolidated Server.",
            "Energy-Aware Load Balancing and Application Scaling for the Cloud Ecosystem.",
            "Fast, Ad Hoc Query Evaluations over Multidimensional Geospatial Datasets.",
            "HFSP: Bringing Size-Based Scheduling To Hadoop.",
            "Joint Pricing and Capacity Planning in the IaaS Cloud Market.",
            "Joint Resource Provisioning for Internet Datacenters with Diverse and Dynamic Traffic.",
            "kBF: Towards Approximate and Bloom Filter based Key-Value Storage for Cloud Computing Systems.",
            "Mathematical Programming Approach for Revenue Maximization in Cloud Federations.",
            "Orchestrating Bulk Data Transfers across Geo-Distributed Datacenters.",
            "TEES: An Efficient Search Scheme over Encrypted Data on Mobile Cloud.",
            "Guest Editors' Introduction: Special Issue on Green and Energy-Efficient Cloud Computing Part II.",
            "Off-Peak Energy Optimization for Links in Virtualized Network Environment.",
            "Towards Robust Green Virtual Cloud Data Center Provisioning.",
            "Tandem Equipment Arranged Architecture with Exhaust Heat Reuse System for Software-Defined Data Center Infrastructure.",
            "Optimize the Server Provisioning and Request Dispatching in Distributed Memory Cache Services.",
            "Water-Constrained Geographic Load Balancing in Data Centers.",
            "On the Latency and Energy Efficiency of Distributed Storage Systems.",
            "Proactive Thermal-Aware Resource Management in Virtualized HPC Cloud Datacenters.",
            "Exploiting Renewable Sources: When Green SLA Becomes a Possible Reality in Cloud Computing.",
            "An Energy-Efficient Java Virtual Machine.",
            "Adaptive Cloud Deployment Using Persistence Strategies and Application Awareness.",
            "Cloud-Based Utility Service Framework for Trust Negotiations Using Federated Identity Management.",
            "Designing Self-Tuning Split-Map-Merge Applications for High Cost-Efficiency in the Cloud.",
            "DyScale: A MapReduce Job Scheduler for Heterogeneous Multicore Processors.",
            "Joint Optimization of Bandwidth for Provider and Delay for User in Software Defined Data Centers.",
            "Self-Adjusting Slot Configurations for Homogeneous and Heterogeneous Hadoop Clusters.",
            "Understanding the Performance and Potential of Cloud Computing for Scientific Applications.",
            "Cloud Security Engineering: Theory, Practice and Future Research.",
            "On the Design and Implementation of an Integrated Security Architecture for Cloud with Improved Resilience.",
            "Secure Outsourcing of Virtual Appliance.",
            "Providing User Security Guarantees in Public Infrastructure Clouds.",
            "Evaluating the Probability of Malicious Co-Residency in Public Clouds.",
            "TruXy: Trusted Storage Cloud for Scientific Workflows.",
            "ForenVisor: A Tool for Acquiring and Preserving Reliable Data in Cloud Live Forensics.",
            "Quantitative Reasoning about Cloud Security Using Service Level Agreements.",
            "Camflow: Managed Data-Sharing for Cloud Services.",
            "Flexible Data Access Control Based on Trust and Reputation in Cloud Computing.",
            "Towards Privacy-Preserving Storage and Retrieval in Multiple Clouds.",
            "Fully Reversible Privacy Region Protection for Cloud Video Surveillance.",
            "Cloud-Trust - a Security Assessment Model for Infrastructure as a Service (IaaS) Clouds.",
            "Improving Flash Resource Utilization at Minimal Management Cost in Virtualized Flash-Based Storage Systems.",
            "Performing Initiative Data Prefetching in Distributed File Systems for Cloud Computing.",
            "SAE: Toward Efficient Cloud Data Analysis Service for Large-Scale Social Networks.",
            "Tier-Centric Resource Allocation in Multi-Tier Cloud Systems.",
            "A Study of the Performance of a Cloud Datacenter Server.",
            "Accurate CPU Proportional Share and Predictable I/O Responsiveness for Virtual Machine Monitor: A Case Study in Xen.",
            "Attribute-Based Access Control with Constant-Size Ciphertext in Cloud Computing.",
            "BDCaM: Big Data for Context-Aware Monitoring - A Personalized Knowledge Discovery Framework for Assisted Healthcare.",
            "DaSCE: Data Security for Cloud Environment with Semi-Trusted Third Party.",
            "Delay-Optimized File Retrieval under LT-Based Cloud Storage.",
            "Demystifying the Clouds: Harnessing Resource Utilization Models for Cost Effective Infrastructure Alternatives.",
            "Exact and Heuristic Resource Mapping Algorithms for Distributed and Hybrid Clouds.",
            "Joint Optimization of Operational Cost and Performance Interference in Cloud Data Centers.",
            "MobiContext: A Context-Aware Cloud-Based Venue Recommendation Framework.",
            "Optimal Cloudlet Placement and User to Cloudlet Allocation in Wireless Metropolitan Area Networks.",
            "Performance and Energy Efficiency Metrics for Communication Systems of Cloud Computing Data Centers.",
            "Personal Cloud Storage Benchmarks and Comparison.",
            "Semantic Representation of Cloud Patterns and Services with Automated Reasoning to Support Cloud Application Portability.",
            "The Value of Cooperation: Minimizing User Costs in Multi-Broker Mobile Cloud Computing Networks."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2016",
        "info": "Volume 4: 2016",
        "count": 39,
        "papers": [
            "IEEE Transactions on Cloud Computing: Entering Its Fourth Year with Confidence.",
            "A Message from the New Editor-in-Chief.",
            "Guest Editors Introduction: Special Issue on Scientific Cloud Computing.",
            "AutoElastic: Automatic Resource Elasticity for High Performance Applications in the Cloud.",
            "Ensemble: A Tool for Performance Modeling of Applications in Cloud Data Centers.",
            "Monetary Cost Optimizations for Hosting Workflow-as-a-Service in IaaS Clouds.",
            "Dynamic and Fault-Tolerant Clustering for Scientific Workflows.",
            "Application-Level Optimization of Big Data Transfers through Pipelining, Parallelism and Concurrency.",
            "OverFlow: Multi-Site Aware Big Data Management for Scientific Workflows on Clouds.",
            "To Cloudify or Not to Cloudify: The Question for a Scientific Data Center.",
            "Cloud Computing for Earth Surface Deformation Analysis via Spaceborne Radar Imaging: A Case Study.",
            "Guest Editors' Introduction: Special Issue on Green and Energy-Efficient Cloud Computing: Part I.",
            "Improving Multicore Server Performance and Reducing Energy Consumption by Workload Dependent Dynamic Power Management.",
            "On Achieving Energy Efficiency and Reducing CO2 Footprint in Cloud Computing.",
            "CO2-Aware Adaptation Strategies for Cloud Applications.",
            "EnReal: An Energy-Aware Resource Allocation Method for Scientific Workflow Executions in Cloud Environment.",
            "Pervasive Cloud Controller for Geotemporal Inputs.",
            "Decentralized and Energy-Efficient Workload Management in Enterprise Clouds.",
            "Energy-Efficient Virtual Machines Scheduling in Multi-Tenant Data Centers.",
            "Hierarchical SLA-Driven Resource Management for Peak Power-Aware and Energy-Efficient Operation of a Cloud Datacenter.",
            "eCope: Workload-Aware Elastic Customization for Power Efficiency of High-End Servers.",
            "A Reference Model for Virtual Machine Launching Overhead.",
            "A Risk Assessment Framework for Cloud Computing.",
            "Cloud-Assisted Computation Offloading to Support Mobile Services.",
            "End-to-End Optimization for Geo-Distributed MapReduce.",
            "Evaluating and Improving the Performance and Scheduling of HPC Applications in Cloud.",
            "Planning vs. Dynamic Control: Resource Allocation in Corporate Clouds.",
            "Run Time Application Repartitioning in Dynamic Mobile Cloud Environments.",
            "Securing Loosely-Coupled Collaboration in Cloud Environment through Dynamic Detection and Removal of Access Conflicts.",
            "Strategy-Proof Pricing for Cloud Service Composition.",
            "Efficient Modeling and Demand Allocation for Differentiated Cloud Virtual-Network as-a Service Offerings.",
            "Heuristic-Based Resource Reservation Strategies for Public Cloud.",
            "Inter-Data Center Network Dimensioning under Time-of-Use Pricing.",
            "M-Convex VM Consolidation: Towards a Better VM Workload Consolidation.",
            "Modeling and Placement of Cloud Services with Internal Structure.",
            "Moderating Effect of Compliance, Network, and Security on the Critical Success Factors in the Implementation of Cloud ERP.",
            "On Cloud Service Reliability Enhancement with Optimal Resource Usage.",
            "Partial Utility-Driven Scheduling for Flexible SLA and Pricing Arbitration in Clouds.",
            "Whither Tightness of Packing? The Case for Stable VM Placement."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2015",
        "info": "Volume 3: 2015",
        "count": 37,
        "papers": [
            "A Scalable and Reliable Matching Service for Content-Based Publish/Subscribe Systems.",
            "Cloud Federations in the Sky: Formation Game and Mechanism.",
            "Energy-Efficient Fault-Tolerant Data Storage and Processing in Mobile Cloud.",
            "Placing Virtual Machines to Optimize Cloud Gaming Experience.",
            "Resisting Skew-Accumulation for Time-Stepped Applications in the Cloud via Exploiting Parallelism.",
            "SelCSP: A Framework to Facilitate Selection of Cloud Service Providers.",
            "Stealthy Denial of Service Strategy in Cloud Computing.",
            "A status report on IEEE Transactions on Cloud Computing.",
            "Recent advances in autonomic provisioning of big data applications on clouds.",
            "Reactive Resource Provisioning Heuristics for Dynamic Dataflows on Cloud Infrastructure.",
            "Aggressive Resource Provisioning for Ensuring QoS in Virtualized Environments.",
            "Deploying Large-Scale Datasets on-Demand in the Cloud: Treats and Tricks on Data Distribution.",
            "An Efficient Green Control Algorithm in Cloud Computing for Cost Optimization.",
            "Adaptive Workflow Scheduling on Cloud Computing Platforms with IterativeOrdinal Optimization.",
            "End-to-End Delay Minimization for Scientific Workflows in Clouds under Budget Constraint.",
            "PRISM: Fine-Grained Resource-Aware Scheduling for MapReduce.",
            "OPoR: Enabling Proof of Retrievability in Cloud Computing with Resource-Constrained Devices.",
            "FastRAQ: A Fast Approach to Range-Aggregate Queries in Big Data Environments.",
            "CHive: Bandwidth Optimized Continuous Querying in Distributed Clouds.",
            "A Secure Cloud Computing Based Framework for Big Data Information Management of Smart Grid.",
            "Guest Editors' Introduction: Special Issue on Economics and Market Mechanisms for Cloud Computing.",
            "Physical Machine Resource Management in Clouds: A Mechanism Design Approach.",
            "Revenue Maximization with Optimal Capacity Control in Infrastructure as a Service Cloud Markets.",
            "An Intelligent Economic Approach for Dynamic Resource Allocation in Cloud Services.",
            "Business-Driven Long-Term Capacity Planning for SaaS Applications.",
            "Exploring Fine-Grained Resource Rental Planning in Cloud Computing.",
            "Implementing Design Diversity Using Portfolio Thinking to Dynamically and Adaptively Manage the Allocation of Web Services in the Cloud.",
            "Clabacus: A Risk-Adjusted Cloud Resources Pricing Model Using Financial Option Theory.",
            "A Procurement Auction Market to Trade Residual Cloud Computing Capacity.",
            "Agent-Based Interactions and Economic Encounters in an Intelligent InterCloud.",
            "CHARM: A Cost-Efficient Multi-Cloud Data Hosting Scheme with High Availability.",
            "Spatio-Temporal Load Balancing for Energy Cost Optimization in Distributed Internet Data Centers.",
            "Market Models for Federated Clouds.",
            "LsPS: A Job Size-Based Scheduler for Efficient Task Assignments in Hadoop.",
            "Privacy-Preserving Data Storage in CloudUsing Array BP-XOR Codes.",
            "Towards Optimized Fine-Grained Pricing of IaaS Cloud Platform.",
            "Workload Prediction Using ARIMA Model and Its Impact on Cloud Applications' QoS."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2014",
        "info": "Volume 2: 2014",
        "count": 39,
        "papers": [
            "Compatibility-Aware Cloud Service Composition under Fuzzy Preferences of Users.",
            "Dynamic Heterogeneity-Aware Resource Provisioning in the Cloud.",
            "Multi-Objective Game Theoretic Schedulingof Bag-of-Tasks Workflows on Hybrid Clouds.",
            "Oruta: Privacy-Preserving Public Auditingfor Shared Data in the Cloud.",
            "Scalable Analytics for IaaS Cloud Availability.",
            "Thermal-Aware Scheduling of Batch Jobs in Geographically Distributed Data Centers.",
            "Transformation-Based Monetary CostOptimizations for Workflows in the Cloud.",
            "Guest Editors' Introduction: Special Issue on Utility and Cloud Computing Science and Technology.",
            "Universal Cross-Cloud Communication.",
            "Virtualization Technology for TCP/IP Offload Engine.",
            "Workload-Aware Credit Scheduler for Improving Network I/O Performance in Virtualization Environment.",
            "Performance and Cost Evaluation of an Adaptive Encryption Architecture for Cloud Databases.",
            "Decreasing Impact of SLA Violations: A Proactive Resource Allocation Approachfor Cloud Computing Environments.",
            "Real-Time Tasks Oriented Energy-Aware Scheduling in Virtualized Clouds.",
            "QoS-Guaranteed Bandwidth Shifting and Redistribution in Mobile Cloud Environment.",
            "Adaptive Algorithm for Minimizing Cloud Task Length with Prediction Errors.",
            "Analysis, Modeling and Simulation of Workload Patterns in a Large-Scale Utility Cloud.",
            "Deadline Based Resource Provisioningand Scheduling Algorithm for Scientific Workflows on Clouds.",
            "A Hyper-Heuristic Scheduling Algorithm for Cloud.",
            "A Novel Model for Competition and Cooperation among Cloud Providers.",
            "A Scientometric Analysis of Cloud Computing Literature.",
            "A Self-Scalable and Auto-Regulated Request Injection Benchmarking Tool for Automatic Saturation Detection.",
            "An Autonomic Approach to Risk-Aware Data Center Overbooking.",
            "Budget-Driven Scheduling Algorithms for Batches of MapReduce Jobs in Heterogeneous Clouds.",
            "CIVSched: A Communication-Aware Inter-VM Scheduling Technique for Decreased Network Latency between Co-Located VMs.",
            "DynamicMR: A Dynamic Slot Allocation Optimization Framework for MapReduce Clusters.",
            "Elastic Admission Control for Federated Cloud Services.",
            "Extending MapReduce across Clouds with BStream.",
            "Highly Efficient Linear Regression Outsourcing to a Cloud.",
            "Multi-Aspect, Robust, and Memory Exclusive Guest OS Fingerprinting.",
            "Secure, Efficient and Fine-Grained Data Access Control Mechanism for P2P Storage Cloud.",
            "Preventing Cache-Based Side-Channel Attacks in a Cloud Environment.",
            "Scalable Architecture for Multi-User Encrypted SQL Operations on Cloud Database Services.",
            "Byzantine-Resilient Secure Software-Defined Networks with Multiple Controllers in Cloud.",
            "Guest Editorial: Cloud Security.",
            "A Dynamic Secure Group Sharing Framework in Public Cloud Computing.",
            "Fuzzy Authorization for Cloud Storage.",
            "A Secure Data Self-Destructing Scheme in Cloud Computing.",
            "Efficient Attribute-Based Signatures for Non-Monotone Predicates in the Standard Model."
        ]
    },
    {
        "name": "IEEE Transactions on Cloud Computing",
        "year": "2013",
        "info": "Volume 1: 2013",
        "count": 16,
        "papers": [
            "Introduction to the IEEE Transactions on Cloud Computing.",
            "A Tabu Search Algorithm for the Location of Data Centers and Software Components in Green Cloud Computing Networks.",
            "Greenhead: Virtual Data Center Embedding across Distributed Infrastructures.",
            "Modeling and Analysis of State-of-the-art VM-based Cloud Management Platforms.",
            "On the Characterization of the Structural Robustness of Data Center Networks.",
            "Outsourcing Large Matrix Inversion Computation to A Public Cloud.",
            "Practical Compute Capacity Management for Virtualized Datacenters.",
            "QoS-Aware Data Replication for Data-Intensive Applications in Cloud Computing Systems.",
            "Stratus: Load Balancing the Cloud for Carbon Emissions Control.",
            "A Combinatorial Auction-Based Mechanism for Dynamic VM Provisioning and Allocation in Clouds.",
            "Cloud Migration Research: A Systematic Review.",
            "Dynamic Cloud Pricing for Revenue Maximization.",
            "Hybrid Attribute- and Re-Encryption-Based Key Management for Secure and Scalable Mobile Applications in Clouds.",
            "Integrity for Join Queries in the Cloud.",
            "Is the Same Instance Type Created Equal? Exploiting Heterogeneity of Public Clouds.",
            "Probabilistic Consolidation of Virtual Machines in Self-Organizing Cloud Data Centers."
        ]
    }
]