[
    {
        "name": "Integration",
        "year": "2022",
        "info": "2022: Volumes\n82,\n83,\n84,",
        "count": 42,
        "papers": [
            "Valid test pattern identification for VLSI adaptive test.",
            "Convex optimization of random dynamic voltage and frequency scaling against power attacks.",
            "Self calibrated cooler-less microbolometer readout architecture.",
            "Switched pseudo-current mirror inverter for low-power, thermally stable and robust ring oscillator.",
            "High level synthesis strategies for ultra fast and low latency matrix inversion implementation for massive MIMO processing.",
            "A robust Euclidean metric based ID extraction method using RO-PUFs in FPGA.",
            "Design automation for continuous-flow microfluidic biochips: A comprehensive review.",
            "Hardware design for blind source separation using fast time-frequency mask technique.",
            "Hw/Sw Co-Design technique for 2D fast fourier transform algorithm on Zynq SoC.",
            "New approach for digital calibration of pipelined analog to digital converters based on secant method.",
            "An area and power efficient VLSI architecture for ECG feature extraction for wearable IoT healthcare applications.",
            "Speeding-up neuromorphic computation for neural networks: Structure optimization approach.",
            "Design and application of CMOS active inductor in bandpass filter and VCO for reconfigurable RF front-end.",
            "Reference-free power supply monitor with enhanced robustness against process and temperature variations.",
            "Efficient VLSI architecture of 3D discrete transformation.",
            "DP-Nets: Dynamic programming assisted quantization schemes for DNN compression and acceleration.",
            "Design and implementation of filterbank for MPEG-2/4 AAC system.",
            "Neural network ℒ1 adaptive control for a class of uncertain fractional order nonlinear systems.",
            "An effective watermarking technique using BTC and SVD for image authentication and quality recovery.",
            "Test and diagnosis pattern generation for distinguishing stuck-at faults and bridging faults.",
            "A fully integrated VLSI architecture using chaotic PWM for RF transmitter design with electromagnetic interference reduction.",
            "A new low-power Dynamic-GDI full adder in CNFET technology.",
            "Impact of various NBTI distributions on SRAM performance for FinFET technology.",
            "High quality hypergraph partitioning for logic emulation.",
            "A novel dual mode configurable and tunable high-gain, high-efficient CMOS power amplifier for 5G applications.",
            "A 2.0-2.9 GHz ring-based injection-locked clock multiplier using a self-alignment frequency-tracking loop for reference spur reduction.",
            "A novel filter-bank architecture of 2D-FIR symmetry filters using LUT based multipliers.",
            "Application driven routing for mesh based Network-on-Chip architectures.",
            "Low power, high speed approximate multiplier for error resilient applications.",
            "Low voltage fully differential OTA using DTMOS based self cascode transistor with slew-rate enhancement and its filter application.",
            "On circuit developments to enable large scale circuit design while computing with noise.",
            "Efficient FPGA implementation of RNS Montgomery multiplication using balanced RNS bases.",
            "Stochastic circuit synthesis via satisfiability.",
            "Multi-source data fusion technique for parametric fault diagnosis in analog circuits.",
            "An 8 bits, RF UHF-Band DAC based on interleaved bandpass delta sigma modulator assisted by background digital calibration.",
            "Second-order cascode-based filters.",
            "A PUS based nets weighting mechanism for power, hold, and setup timing optimization.",
            "OPCoSA: an Optimized Product Code for space applications.",
            "Very compact 3D-printed folded branch-line hybrid coupler based on loaded helical-microstrip transmission lines.",
            "Functional validation of highly synthesizable voltage comparator on FPGA.",
            "A 85dB-SNDR 50 kHz bootstrapping-free resistor-less SC Delta-Sigma modulator IP block for PVT-robust low-power ADCs.",
            "Edge computing design space exploration for heart rate monitoring."
        ]
    },
    {
        "name": "Integration",
        "year": "2021",
        "info": "2021: Volumes\n76,\n77,\n78,\n79,\n80,\n81",
        "count": 98,
        "papers": [
            "READ: A fixed restoring array based accuracy-configurable approximate divider for energy efficiency.",
            "Power-aware hold optimization for ASIC physical synthesis.",
            "MOS based pseudo-resistors exhibiting Tera Ohms of Incremental Resistance for biomedical applications: Analysis and proof of concept.",
            "An improved heuristic technique for nearest neighbor realization of quantum circuits in 2D architecture.",
            "Low delay non-binary error correction codes based on Orthogonal Latin Squares.",
            "2.3-21 GHz broadband and high linearity distributed low noise amplifier.",
            "A low latency modular-level deeply integrated MFCC feature extraction architecture for speech recognition.",
            "Custom NoC topology generation using Discrete Antlion Trapping Mechanism.",
            "The Involution Tool for Accurate Digital Timing and Power Analysis.",
            "Electronically tunable third-order dual-mode quadrature sinusoidal oscillators employing VDCCs and all grounded components.",
            "Accelerating Deep Convolutional Neural Network base on stochastic computing.",
            "Invasive weed optimization based scheduling for digital microfluidic biochip operations.",
            "Comments on \"Improved designs of digit-by-digit decimal multiplier\".",
            "A novel approach to fractional-N PLLs generating ultra-fast low-noise chirps for FMCW radar.",
            "COPRICSI: COnstraint-PRogrammed Initial Circuit SIzing.",
            "A PVT aware differential delay circuit and its performance variation due to power supply noise.",
            "Compact and efficient structure of 8-bit S-box for lightweight cryptography.",
            "Monolithic 3D stacked multiply-accumulate units.",
            "Refinement rules for the automatic TLM-to-RTL conversion of temporal assertions.",
            "A novel tunable gain CMOS buffer amplifier for large resistive loads.",
            "30 GHz SiGe active inductor with voltage controlled Q.",
            "High speed VLSI architecture for improved region based active contour segmentation technique.",
            "Robust power grid network design considering EM aging effects for multi-segment wires.",
            "An automated parallel simulation flow for cyber-physical system design.",
            "RESET: A real-time scheduler for energy and temperature aware heterogeneous multi-core systems.",
            "Fast algorithms for test optimization of core based 3D SoC.",
            "Low power time-domain rail-to-rail comparator with a new delay element for ADC applications.",
            "VLSI mask optimization: From shallow to deep learning.",
            "Multicast-enabled network-on-chip routers leveraging partitioned allocation and switching.",
            "Review: Machine learning techniques in analog/RF integrated circuit design, synthesis, layout, and test.",
            "A 25-Gb/s inductorless SiGe BiCMOS receiver for 100-Gb/s optical links.",
            "Orthogonal obfuscation based key management for multiple IP protection.",
            "Real-time automated register abstraction active power-aware electronic system level verification framework.",
            "Partial evaluation based triple modular redundancy for single event upset mitigation.",
            "Efficient hardware task migration for heterogeneous FPGA computing using HDL-based checkpointing.",
            "A Survey of FIR Filter Design Techniques: Low-complexity, Narrow Transition-band and Variable Bandwidth.",
            "Synthesis of representative critical path circuits considering BEOL variations for deep sub-micron circuits.",
            "An ant colony based mapping of quantum circuits to nearest neighbor architectures.",
            "High-performance area-efficient polynomial ring processor for CRYSTALS-Kyber on FPGAs.",
            "Vulnerable objects detection for autonomous driving: A review.",
            "Time redundancy and gate sizing soft error-tolerant based adder design.",
            "Design of novel SMS4-BSK encryption transmission system.",
            "Mixed-radix, virtually scaling-free CORDIC algorithm based rotator for DSP applications.",
            "Introduction of a new technique for simultaneous reduction of the delay and leakage current in digital circuits.",
            "Fluid-to-cell assignment and fluid loading on programmable microfluidic devices for bioprotocol execution.",
            "Novel low leakage and energy efficient dual-pullup/dual-pulldown repeater.",
            "Design and implementation of current mode circuit for digital modulation.",
            "Designing efficient FPGA tiles for power-constrained ultra-low-power applications.",
            "A 0.004% resolution & SAT.",
            "A new hardware Trojan detection technique using deep convolutional neural network.",
            "On malicious implants in PCBs throughout the supply chain.",
            "Standard-compliant parallel SystemC simulation of loosely-timed transaction level models: From baremetal to Linux-based applications support.",
            "Cryptanalysis of nonlinear confusion component based encryption algorithm.",
            "Sizing of multi-stage Op Amps by combining design equations with the gm/ID method.",
            "High-speed and low-cost carry select adders utilizing new optimized add-one circuit and multiplexer-based logic.",
            "Stumped nature hyperjerk system with fractional order and exponential nonlinearity: Analog simulation, bifurcation analysis and cryptographic applications.",
            "Efficient design of decimation filter using linear programming and its FPGA implementation.",
            "Design of FIR filter ISOTA with the aid of genetic algorithm.",
            "A C-band low-power sub-1volt current-reused multiphase oscillator.",
            "An improved algorithm for accelerating reconfiguration of VLSI array.",
            "A novel memristive chaotic system without any equilibrium point.",
            "A non-autonomous chaotic system with no equilibrium.",
            "Breaking LPA-resistant cryptographic circuits with principal component analysis.",
            "Realizations of fractional-order PID loop-shaping controller for mechatronic applications.",
            "Hyperchaotic fractional Grassi-Miller map and its hardware implementation.",
            "A novel current-controlled memristor-based chaotic circuit.",
            "Proposal and analysis of relative stability in mixed CNT bundle for sub-threshold interconnects.",
            "Synchronization of mutual coupled fractional order one-sided lipschitz systems.",
            "On-board processing for autonomous drone racing: An overview.",
            "An efficient NBTI-aware wake-up strategy: Concept, design, and manipulation.",
            "Development of micro computer based mobile random number generator with an encryption application.",
            "Approximate multipliers based on a novel unbiased approximate 4-2 compressor.",
            "Passivity-based non-fragile control of a class of uncertain fractional-order nonlinear systems.",
            "A two-directional grid multiscroll hidden attractor based on piecewise linear system and its application in pseudo-random bit generator.",
            "Coexistence of infinite attractors in a fractional-order chaotic system with two nonlinear functions and its DSP implementation.",
            "Experimental verification of the multi-scroll chaotic attractors synchronization in PWL arbitrary-order systems using direct coupling and passivity-based control.",
            "A new multi-scroll Chua's circuit with composite hyperbolic tangent-cubic nonlinearity: Complex dynamics, Hardware implementation and Image encryption application.",
            "A very low output resistance and wide-swing class-AB level-shifted folded flipped voltage follower cell.",
            "HashHeat: A hashing-based spatiotemporal filter for dynamic vision sensor.",
            "An efficient image encryption scheme based on double affine substitution box and chaotic system.",
            "Design and analysis of a flat gain and linear low noise amplifier using modified current reused structure with feedforward structure.",
            "Secure image encryption scheme using 4D-Hyperchaotic systems based reconfigurable pseudo-random number generator and S-Box.",
            "A 20-Gb/s wideband AGC amplifier with 26-dB dynamic range in 0.18-μm SiGe BiCMOS.",
            "A mathematical programming method for constructing the shortest interconnection VLSI arrays.",
            "FPGA-based Physical Unclonable Functions: A comprehensive overview of theory and architectures.",
            "mMIG: Inversion optimization in majority inverter graph with minority operations.",
            "A transformer with high coupling coefficient and small area based on TSV.",
            "A broadband MVDR beamforming core for ultrasound imaging.",
            "A novel low power hybrid cache using GC-EDRAM cells.",
            "Designs for efficient low power cardinality and similarity sketches by Two-Step Hashing (TSH).",
            "BDD-based synthesis approach for in-memory logic realization utilizing Memristor Aided loGIC (MAGIC).",
            "Quantization aware approximate multiplier and hardware accelerator for edge computing of deep learning applications.",
            "FPGA-based implementation of classification techniques: A survey.",
            "Calibration of optimized minimum inductor bandpass filter with controllable bandwidth and stopband rejection.",
            "Research progress of time-interleaved analog-to-digital converters.",
            "Deep learning aided efficient yield analysis for multi-objective analog integrated circuit synthesis.",
            "An energy efficient synthesis flow for application specific SoC design.",
            "Power density aware application mapping in mesh-based network-on-chip architecture: An evolutionary multi-objective approach."
        ]
    },
    {
        "name": "Integration",
        "year": "2020",
        "info": "2020: Volumes\n70,\n71,\n72,\n73,\n74,\n75",
        "count": 96,
        "papers": [
            "FPGA and GPU-based acceleration of ML workloads on Amazon cloud - A case study using gradient boosted decision tree library.",
            "Reducing idle time in event-triggered software execution via runnable migration and DPM-Aware scheduling.",
            "Towards an automated design flow for memristor based VLSI circuits.",
            "DSA guiding template assignment with multiple redundant via and dummy via insertion.",
            "Optimization of quantum circuit mapping using gate transformation and commutation.",
            "A 0.6V 1.07 μW/Channel neural interface IC using level-shifted feedback.",
            "A pre-silicon logic level security verification flow for higher-order masking schemes against glitches on FPGAs.",
            "Fault tolerance in memristive crossbar-based neuromorphic computing systems.",
            "A high-precision current-mode multifunction analog cell suitable for computational signal processing.",
            "Full-chip wire-oriented back-end-of-line TDDB hotspot detection and lifetime analysis.",
            "Systematic synthesis of approximate adders and multipliers with accurate error calculations.",
            "A folded-cascode mixer for mixing-spur suppressions in a 2.4-to-5.8 GHz transmitter.",
            "Design and performance analysis of wrap-gate CNTFET-based ring oscillators for IoT applications.",
            "Compiler compatible 5.66 Mb/mm2 8T 1R1W register file in 14 nm FinFET technology.",
            "A novel area efficient on-chip RO-Sensor for recycled IC detection.",
            "A precision low-power analog front end in 180 nm CMOS for wireless implantable capacitive pressure sensors.",
            "Corrigendum to\"Approximate error detection-correction for efficient adaptive voltage Over-Scaling\"[Integration 63 (2018) 220-231].",
            "Mixed-cell-height legalization considering complex minimum width constraints and half-row fragmentation effect.",
            "Verification of physical designs using an integrated reverse engineering flow for nanoscale technologies.",
            "Design and implementation of SVM OTPC searching based on Shared Dot Product Matrix.",
            "A new family of CMOS inverter-based OTAs for biomedical and healthcare applications.",
            "A Noise-Aware Real-Time Processing Approach for Electroencephalogram Signal Classification.",
            "Assessment of STT-MRAMs based on double-barrier MTJs for cache applications by means of a device-to-system level simulation framework.",
            "Digital predistorter with improving index accuracy of lookup table based on FPGA.",
            "PV-MAC: Multiply-and-accumulate unit structure exploiting precision variability in on-device convolutional neural networks.",
            "An optimal analytical solution for maximizing expected battery lifetime using the calculus of variations.",
            "Design of a low-power CMOS transceiver for semi-passive wireless sensor network application.",
            "A split-based fully digital feedforward background calibration technique for timing mismatch in TIADC.",
            "A Sub-1 V nanopower subthreshold current and voltage reference using current subtraction technique and cascoded active load.",
            "An efficient memristor crossbar architecture for mapping Boolean functions using Binary Decision Diagrams (BDD).",
            "A High Performance Early Acknowledged Asynchronous Pipeline using Hybrid-logic Encoding.",
            "Implementation of pseudo-linear feedback shift register-based physical unclonable functions on silicon and sufficient Challenge-Response pair acquisition using Built-In Self-Test before shipping.",
            "A survey on fault injection methods of digital integrated circuits.",
            "Efficient design of magnitude and 2's complement comparators.",
            "A high throughput pass parallel block decoder architecture for JPEG 2000 that prevents stalling in the decoding process.",
            "Machine learning and structural characteristics for reverse engineering.",
            "A robust and automated methodology for the analysis of Time-Dependent Variability at transistor level.",
            "Modeling and design of 3-D MPPT for ultra low power RF energy harvesters.",
            "Flipped voltage follower based fourth order filter and its application to portable ECG acquisition system.",
            "Defense-in-depth: A recipe for logic locking to prevail.",
            "Misalignment-aware energy modeling of narrow buses for data encoding schemes.",
            "Test patterns reordering method based on Gamma distribution.",
            "High two-signal dynamic range and accurate frequency measurement for close frequency separation wideband digital receiver using adaptive gain control and adaptive thresholding.",
            "RDMM: Runtime dynamic migration mechanism of distributed cache for reconfigurable array processor.",
            "TRACK: An algorithm for fault-tolerant, dynamic and scalable 2D mesh network-on-chip routing reconfiguration.",
            "A 0.6V 44.6 ppm/ºC subthreshold CMOS voltage reference with wide temperature range and inherent leakage compensation.",
            "A formal model for proving hardware timing properties and identifying timing channels.",
            "A survey on attack vectors in stack cache memory.",
            "Analysis of SRAM metrics for data dependent BTI degradation and process variability.",
            "FPGA implementation of a chaotic oscillator with odd/even symmetry and its application.",
            "Boundary scan based interconnect testing design for silicon interposer in 2.5D ICs.",
            "A comprehensive analysis on the resilience of adiabatic logic families against transient faults.",
            "Performance-aware predictive-model-based on-chip body-bias regulation strategy for an ULP multi-core cluster in 28 nm UTBB FD-SOI.",
            "Verification and revision of the power-down mode for hierarchical analog circuits.",
            "An adaptive simulation framework for AMS-RF test quality.",
            "Complex exponential functions: A high-precision hardware realization.",
            "Improving power analysis attack resistance using intrinsic noise in 3D ICs.",
            "In-sensor time-domain classifiers using pseudo sigmoid activation functions.",
            "Methods increasing inherent resistance of ECC designs against horizontal attacks.",
            "An innovative two-stage data compression scheme using adaptive block merging technique.",
            "An efficient and reliable MRF-based methodology for designing low-power VLSI circuits.",
            "FPGA implementation of high-performance, resource-efficient Radix-16 CORDIC rotator based FFT algorithm.",
            "Novel gate-overlap tunnel FET based innovative ultra-low-power ternary flash ADC.",
            "Design of a real-time face detection architecture for heterogeneous systems-on-chips.",
            "A 0.3nV/√Hz input-referred-noise analog front-end for radiation-induced thermo-acoustic pulses.",
            "Logarithm-approximate floating-point multiplier is applicable to power-efficient neural network training.",
            "On the superiority of modularity-based clustering for determining placement-relevant clusters.",
            "A bulk-driven quasi-floating gate FVF current mirror for low voltage, low power applications.",
            "Yield constrained automated design algorithm for power optimized pipeline ADC.",
            "An efficient background calibration technique for analog-to-digital converters based on neural network.",
            "PCoSA: A product error correction code for use in memory devices targeting space applications.",
            "SRAM on-chip monitoring methodology for high yield and energy efficient memory operation at near threshold voltage.",
            "A cellular automata guided two level obfuscation of Finite-State-Machine for IP protection.",
            "A fast approach for bitcoin blockchain cryptocurrency mining system.",
            "The synthesis method of logic circuits based on the iMemComp gates.",
            "Verification of a high precision CMOS sensor for angle-of-arrival (AOA) measurement of LED light in ultra-miniaturized applications.",
            "System-level evaluation of dynamic effects in a GaN-based class-E power amplifier.",
            "An ultra-wideband 6-14 GHz frequency modulated continuous wave primary radar with 3 cm range resolution.",
            "Sensor based adaptive voltage scaling on FPGAs: Calibration and parametrization.",
            "A passive and low-complexity Compressed Sensing architecture based on a charge-redistribution SAR ADC.",
            "Design space exploration of low-power flip-flops in FinFET technology.",
            "An efficient multiple shortest augmenting paths algorithm for constructing high performance VLSI subarray.",
            "Low-power content addressable memory design using two-layer P-N match-line control and sensing.",
            "A high-efficiency charge pump with charge recycling scheme and finger boost capacitor.",
            "Graph-based STA for asynchronous controllers.",
            "Area and power efficient hard multiple generator for radix-8 modulo 2n - 1 multiplier.",
            "High-throughput architecture for post-quantum DME cryptosystem.",
            "Harvester-aware transient computing: Utilizing the mechanical inertia of kinetic energy harvesters for a proactive frequency-based power loss detection.",
            "On the quadrature accuracy of in-phase coupled quadrature LC oscillator.",
            "Time-domain writing architecture for multilevel RRAM cells resilient to temperature and process variations.",
            "Investigating the influence of adiabatic load on the 4-phase adiabatic system design.",
            "On reverse converters for arbitrary multi-moduli RNS.",
            "Introduction to special issue of 2019 China Semiconductor Technology International Conference (CSTIC) Symposium on Design and Automation of Circuits and Systems.",
            "A new realization scheme for dynamic PFSCL style.",
            "New lightweight Anti-SAT block design and obfuscation technique to thwart removal attack.",
            "Avoidance vs. repair: New approaches to increasing electromigration robustness in VLSI routing."
        ]
    },
    {
        "name": "Integration",
        "year": "2019",
        "info": "2019: Volumes\n64,\n65,\n66,\n67,\n68,\n69",
        "count": 145,
        "papers": [
            "VeriIntel2C: Abstracting RTL to C to maximize High-Level Synthesis Design Space Exploration.",
            "Highly-parallel hardware implementation of optimal ate pairing over Barreto-Naehrig curves.",
            "A SPAD-based random number generator pixel based on the arrival time of photons.",
            "Hybrid asynchronous circuit generation amenable to conventional EDA flow.",
            "Flexible design and implementation of QC-Based LDPC decoder architecture for on-line user-defined matrix downloading and efficient decoding.",
            "An accurate classifier based on adaptive neuro-fuzzy and features selection techniques for fault classification in analog circuits.",
            "Optimal and heuristic algorithms to synthesize lattices of four-terminal switches.",
            "Double-precision Dual Mode Logic carry-save multiplier.",
            "Multi-level timing and fault simulation on GPUs.",
            "Fully integrated transceiver module with a temperature compensation for high bit rate contactless smart card.",
            "Yielding optimized dependability assurance through bit inversion.",
            "A study of analog decision feedback equalization for ADC-Based serial link receivers.",
            "Millimeter wave wireless interconnects in deep submicron chips: Challenges and opportunities.",
            "A low power passive-active ΔΣ modulator with high-resolution employing an integrator with open-loop unity-gain buffer.",
            "SoC interconnection protection through formal verification.",
            "Look-ahead mapping of Boolean functions in memristive crossbar array.",
            "SVM algorithm oriented for implementation in a low-cost Xilinx FPGA.",
            "PUFPass: A password management mechanism based on software/hardware codesign.",
            "Modeling triplet spike timing dependent plasticity using a hybrid TFT-memristor neuromorphic synapse.",
            "Safe and efficient power management of hard real-time networks-on-chip.",
            "A new current-mode computational analog block free from the body-effect.",
            "Optimization and CMOS design of chaotic oscillators robust to PVT variations: INVITED.",
            "A low power high speed MTJ based non-volatile SRAM cell for energy harvesting based IoT applications.",
            "A real-time pseudo-background gain calibration strategy for residue amplifiers of pipeline ADCs.",
            "All MOS noise-shaped time-mode temperature sensor.",
            "A tool for the automatic generation and analysis of regular analog layout modules.",
            "Data-path aware high-level ECO synthesis.",
            "FinFET CMOS logic gates with non-volatile states for reconfigurable computing systems.",
            "OP-Fibo: An efficient Forbidden Pattern Free CAC design.",
            "Low power & mobile hardware accelerators for deep convolutional neural networks.",
            "Highly stable, low power FinFET SRAM cells with exploiting dynamic back-gate biasing.",
            "Fast start crystal oscillator design with negative resistance control.",
            "An accurate model of domain-wall-based spintronic memristor.",
            "Design of quadruple precision multiplier architectures with SIMD single and double precision support.",
            "A constant loop bandwidth in delta sigma fractional-N PLL frequency synthesizer with phase noise cancellation.",
            "Low-complexity multi-mode multi-way split-row layered LDPC decoder for gigabit wireless communications.",
            "Area-efficient fully digital memory using minimum height standard cells for near-threshold voltage computing.",
            "Optimal asymmetrical back plane biasing for energy efficient digital circuits in 28 nm UTBB FD-SOI.",
            "Novel techniques for memristive multifunction logic design.",
            "Ultra-low power m-sequence code generator for body sensor node applications.",
            "Circuit power optimization using pipelining and dual-supply voltage assignment.",
            "Workload- and process-variation aware voltage/frequency tuning for energy efficient performance sustainability of NTC manycores.",
            "Reliable techniques for integrated circuit identification and true random number generation using 1.5-transistor flash memory.",
            "Monolithic 3D neuromorphic computing system with hybrid CMOS and memristor-based synapses and neurons.",
            "Analyzing power-thermal-performance trade-offs in a high-performance 3D NoC architecture.",
            "Self-Organized Sub-bank SHE-MRAM-based LLC: An energy-efficient and variation-immune read and write architecture.",
            "Integrating operation scheduling and binding for functional unit power-gating in high-level synthesis.",
            "Run-time demand estimation and modulation of on-chip decaps at system level for leakage power reduction in multicore chips.",
            "Reconfigurable topology synthesis for application-specific NoC on partially dynamically reconfigurable systems.",
            "An orchestrated NoC prioritization mechanism for heterogeneous CPU-GPU systems.",
            "Reliability- and performance-driven mapping for regular 3D NoCs using a novel latency model and Simulated Allocation.",
            "System-level design consideration and optimization of through-silicon-via inductor.",
            "A high-accuracy approximate adder with correct sign calculation.",
            "Exploiting distribution of unknown values in test responses to optimize test output compactors.",
            "Normalization and dropout for stochastic computing-based deep convolutional neural networks.",
            "Selective congestion control for mixed-critical networks-on-chip.",
            "High throughput hardware architecture for accurate semi-global matching.",
            "Scheduling algorithms for reservoir- and mixer-aware sample preparation with microfluidic biochips.",
            "Loop aware CFG matching strategy for accurate performance estimation in IR-level native simulation.",
            "Efficient IC hotspot thermal analysis via low-rank Model Order Reduction.",
            "Reliability based hardware Trojan design using physics-based electromigration models.",
            "A Pulse Compression procedure for power inductors modeling up to moderate non-linearity.",
            "In-memory designing of Delay and Toggle flip-flops utilizing Memristor Aided loGIC (MAGIC).",
            "Efficient automatic parallelization of a single GPU program for a multiple GPU system.",
            "Actors with stretchable access patterns.",
            "Fast locking, startup-circuit free, low area, 32-phase analog DLL.",
            "Kernel-based template attacks of cryptographic circuits using static power.",
            "Low-complex processing element architecture for successive cancellation decoder.",
            "A CMOS temperature-independent current reference optimized for mixed-signal applications.",
            "Enhancing sensitivity-based power reduction for an industry IC design context.",
            "A coin-battery-powered LDO-Free 2.4-GHz Bluetooth Low Energy/ZigBee receiver consuming 2 mA.",
            "High performance energy efficient radiation hardened latch for low voltage applications.",
            "Direct digital-to-RF converter employing semi-digital FIR voltage-mode RF DAC.",
            "Survey on recent counterfeit IC detection techniques and future research directions.",
            "Exploiting the Logic-In-Memory paradigm for speeding-up data-intensive algorithms.",
            "A reconfigurable 4-GS/s power-efficient floating-point FFT processor design and implementation based on single-sided binary-tree decomposition.",
            "Analysis, modeling and design of a CMOS Super-Regenerative Receiver for implanted medical devices under square and sinusoidal quench signals.",
            "A battery-less BLE smart sensor for room occupancy tracking supplied by 2.45-GHz wireless power transfer.",
            "Dimensional optimisation of a MEMS BPSK to ASK converter in SOIMUMPs.",
            "Energy and power awareness in hardware schedulers for energy harvesting IoT SoCs.",
            "Multi-channel lock-in based differential front-end for broadband Raman spectroscopy.",
            "Optimization of the dielectric layer for electrowetting on dielectric.",
            "Crosstalk optimization for through-silicon vias by exploiting temporal signal misalignment.",
            "A new CAD tool for Single Event Transient Analysis and mitigation on Flash-based FPGAs.",
            "Optimized mapping algorithm to extend lifetime of both NoC and cores in many-core system.",
            "Multi-objective design space exploration for system partitioning of FPGA-based Dynamic Partially Reconfigurable Systems.",
            "Parallelizing SAT-based de-camouflaging attacks by circuit partitioning and conflict avoiding.",
            "Architectures and algorithms for on-device user customization of CNNs.",
            "Testing aware dynamic mapping for path-centric network-on-chip test.",
            "Modelling, simulation and verification of 4-phase adiabatic logic design: A VHDL-Based approach.",
            "A low power RFID based energy harvesting temperature resilient CMOS-only reference voltage.",
            "A comprehensive analysis on differential cross-coupled CMOS LC oscillators via multi-objective optimization.",
            "Corrigendum to \"Scaling equations for the accurate prediction of CMOS device performance from 180 nm to 7 nm\" [Integr. VLSI J. 58. (2017) 74-81].",
            "Witelo: Automated generation and timing characterization of distributed-control macroblocks for high-performance FPGA designs.",
            "A reliable PUF in a dual function SRAM.",
            "A thermal-sensitive design of a 3D torus-based optical NoC architecture.",
            "Design and implementation of a digital down/up conversion directly from/to RF channels in HDL.",
            "Design of Narrow Transition Band Digital Filter: An Analytical Approach.",
            "Gain-controlled noise-reduction LNA design using source-bulk resistors and double common-source topology.",
            "Trade-offs among power consumption and other design parameters of two-stage recycling folded cascode OTA that using embedded cascode current buffer compensation technology.",
            "A security oriented transient-noise simulation methodology: Evaluation of intrinsic physical noise of cryptographic designs.",
            "A simulated approach to evaluate side-channel attack countermeasures for the Advanced Encryption Standard.",
            "CAPE: A cross-layer framework for accurate microprocessor power estimation.",
            "A 5.8 GHz digitally configurable DSRC RF-SoC transmitter for China ETC systems.",
            "FPGA implementation of dynamically reconfigurable IoT security module using algorithm hopping.",
            "Failure probability analysis and critical node determination for approximate circuits.",
            "Testing framework for on-board verification of HLS modules using grey-box technique and FPGA overlays.",
            "A MMIC power amplifier in GaN on Si technology for next generation Q band high throughput satellite systems.",
            "Simulation environment for link energy estimation in networks-on-chip with virtual channels.",
            "High-level hardware design of digital comparator with multiple inputs.",
            "A highly linear current-starved VCO based on a linearized current control mechanism.",
            "A closed-loop ASIC design approach based on logical effort theory and artificial neural networks.",
            "A low-power dynamic comparator for low-offset applications.",
            "Low discharge precharge free matchline structure for energy-efficient search using CAM.",
            "Multi-objective algebraic rewriting in XOR-majority graphs.",
            "Multi-objective optimisation of software application mappings on heterogeneous MPSoCs: TONPET versus R2-EMOA.",
            "Step-by-Step Design of memory hierarchy for heterogeneously-integrated SCM/NAND flash storage.",
            "CPCA: An efficient wireless routing algorithm in WiNoC for cross path congestion awareness.",
            "Low-memory and high-performance architectures for the CCSDS 122.0-B-1 compression standard.",
            "Edge effect aware low-power crosstalk avoidance technique for 3D integration.",
            "Failure probability of a FinFET-based SRAM cell utilizing the most probable failure point.",
            "FLINT+: A runtime-configurable emulation-based stochastic timing analysis framework.",
            "Self-timed, minimum latency circuits for the internet of things.",
            "A balanced power analysis attack resilient adiabatic logic using single charge sharing transistor.",
            "Characterizing SRAM and FF soft error rates with measurement and simulation.",
            "A new strategy to design low power translinear based CMOS analog multiplier.",
            "Low power active shunt feedback CMOS low noise amplifier for wideband wireless systems.",
            "Characterizing the Effectiveness of Hot Sparing on Cost and Performance-per-Watt in Application Specific SIMT.",
            "A GALS design based on multi-frequency clocking for digital switching noise reduction.",
            "Realizations of simple fractional-order capacitor emulators with electronically-tunable capacitance.",
            "Half-row modified two-extra-column trellis min-max decoder architecture for nonbinary LDPC codes.",
            "Performance enhancement of advanced recycling folded cascode operational transconductance amplifier using an unbalanced biased input stage.",
            "An improved KFDD based reversible circuit synthesis method.",
            "Hardware footprints of S-box in lightweight symmetric block ciphers for IoT and CPS information security systems.",
            "Dual split-three segment capacitor array Design Based Successive approximation ADC for Io-T ecosystem.",
            "Optimal design of a low-power, phase-switching modulator for implantable medical applications.",
            "An all-digital frequency tunable IR-UWB transmitter with an approximate 15th derivative Gaussian pulse generator.",
            "Computer vision algorithms and hardware implementations: A survey.",
            "A novel design of hybrid-time-interleaved current steering digital to analog converter and its behavioral simulation considering non-ideal effects.",
            "GPU-based Ising computing for solving max-cut combinatorial optimization problems.",
            "A large-scale in-memory computing for deep neural network with trained quantization.",
            "SubMac: Exploiting the subword-based computation in RRAM-based CNN accelerator for energy saving and speedup.",
            "Power-efficient ReRAM-aware CNN model generation.",
            "Improving the performance of transmission gate and hybrid CMOS Full Adders in chain and tree structure architectures.",
            "A high-level information flow tracking method for detecting information leakage."
        ]
    },
    {
        "name": "Integration",
        "year": "2018",
        "info": "2018: Volumes\n60,\n61,\n62,\n63",
        "count": 118,
        "papers": [
            "SERA: statistical error rate analysis for profit-oriented performance binning of resilient circuits.",
            "Register Pre-Allocation based Folded Discrete Tchebichef Transformation Technique for Image Compression.",
            "Optimum transistor sizing of CMOS logic circuits using logical effort theory and evolutionary algorithms.",
            "Module grouping to reduce the area of test wrappers in SoCs.",
            "SystemC-AMS modeling of photodiode based on PWL technique to be used in energy harvesting CMOS image sensor.",
            "Implementation of real-time image edge detector based on a bump circuit and active pixels in a CMOS image sensor.",
            "50-830 MHz noise and distortion canceling CMOS low noise amplifier.",
            "Homogeneous droplet routing in DMFB: An enhanced technique for high performance bioassay implementation.",
            "Several weaknesses of the implementation for the theoretically secure masking schemes under ISW framework.",
            "A novel single-ended 9T FinFET sub-threshold SRAM cell with high operating margins and low write power for low voltage operations.",
            "Toward automated reasoning for analog IC design by symbolic computation - A survey.",
            "Recent advances in EM and BTI induced reliability modeling, analysis and optimization (invited).",
            "High bandwidth transimpedance amplifier using FGMOS for low voltage operation.",
            "A novel design for ultra-low power pulse-triggered D-Flip-Flop with optimized leakage power.",
            "Area Constrained Performance Optimized ASNoC Synthesis with Thermal‐aware White Space Allocation and Redistribution.",
            "A fast symbolic SNR computation method and its Verilog-A implementation for Sigma-Delta modulator design optimization.",
            "Integrated circuit packaging review with an emphasis on 3D packaging.",
            "Customizable embedded processor array for multimedia applications.",
            "An energy and area efficient 4: 2 compressor based on FinFETs.",
            "Design of UWB low noise amplifier using noise-canceling and current-reused techniques.",
            "An improved communication scheme for non-HOL-blocking wireless NoC.",
            "Rapid and coding-efficient SPIHT algorithm for wavelet-based ECG data compression.",
            "A low-voltage low-power capacitive-feedback voltage controlled oscillator.",
            "A new low-power dynamic circuit for wide fan-in gates.",
            "Asymmetry dual-LFSR reseeding for low power BIST.",
            "Edge effects on the TSV array capacitances and their performance influence.",
            "Exploratory design of on-chip power delivery for 14, 10, and 7 nm and beyond FinFET ICs.",
            "Lagrangian relaxation-based routing path allocation for application-specific network-on-chips.",
            "Lifetime improvement by exploiting aggressive voltage scaling during runtime of error-resilient applications.",
            "Analog behavioral equivalence boundary computation under the effect of process variations.",
            "Neuromorphic computing's yesterday, today, and tomorrow - an evolutional view.",
            "Runtime hardware Trojan monitors through modeling burst mode communication using formal verification.",
            "Discrete relaxation method for contact layer decomposition of DSA with triple patterning.",
            "A foreground-liked continuous-time offset cancellation strategy for open-loop inter-stage amplifiers in high-resolution ADCs.",
            "Metastability immune and area efficient error masking flip-flop for timing error resilient designs.",
            "Mixed-criticality scheduling on heterogeneous multicore systems powered by energy harvesting.",
            "A near-threshold 10T differential SRAM cell with high read and write margins for tri-gated FinFET technology.",
            "A Fully RNS based ECC Processor.",
            "Improved designs of digit-by-digit decimal multiplier.",
            "A novel equivalent circuit model for split ring resonator with an application of low phase noise reference oscillator.",
            "Power-gating-aware scheduling with effective hardware resources optimization.",
            "A low-area, 43.5% PAE, 0.9 W, Class-E differential power amplifier in 2.4 GHz for IoT applications.",
            "Ultra low power-high stability, positive feedback controlled (PFC) 10T SRAM cell for look up table (LUT) design.",
            "ALAMO: FPGA acceleration of deep learning algorithms with a modularized RTL compiler.",
            "Contention free delayed keeper for high density large signal sensing memory compiler.",
            "MOSCAP compensation of three-stage operational amplifiers: Sensitivity and robustness, modeling and analysis.",
            "Offline Testing of Reversible Logic Circuits: An Analysis.",
            "Aging mitigation of L1 cache by exchanging instruction and data caches.",
            "Hardware-assisted Verilog simulation system using an application specific microprocessor.",
            "Reliability-aware application mapping onto mesh based Network-on-Chip.",
            "NV-TCAM: Alternative designs with NVM devices.",
            "An all-digital low ripples capacitive DC-DC converter with load tracking controller.",
            "Analysis of the impact of interferers on VCO-based continuous time delta-sigma modulators.",
            "Strategy of logic synthesis using MTBDD dedicated to FPGA.",
            "Diagnosis algorithms for a reconfigurable and defect tolerant JTAG scan chain in large area integrated circuits.",
            "Low power hardware implementations for network packet processing elements.",
            "Detailed placement for pulse quenching enhancement in anti-radiation combinational circuit design.",
            "Enhancement of fault collection for embedded RAM redundancy analysis considering intersection and orphan faults.",
            "Automatic generation of harmonious music using cellular automata based hardware design.",
            "A pattern-based routing algorithm for a novel electronic system prototyping platform.",
            "An ultra low-power current-mode clock and data recovery design with input bit-rate adaptability for biomedical applications in CMOS 90 nm.",
            "A 10-bit 50-MS/s SAR ADC with 1 fJ/Conversion in 14 nm SOI FinFET CMOS.",
            "Hybrid offset compensated latch-type sense amplifier for tri-gated FinFET technology.",
            "High-performance and energy-efficient 64-bit incrementer/decrementer using Multiple-Output Monotonic CMOS.",
            "Accelerating cycle-accurate system-level simulations through behavioral templates.",
            "VLSI design and implementation of a reconfigurable hardware-friendly Polar encoder architecture for emerging high-speed 5G system.",
            "Efficient parasitic-aware hybrid sizing methodology for analog and RF integrated circuits.",
            "A novel design methodology for the mixed-domain optimization of a MEMS accelerometer.",
            "Super current recycling folded cascode amplifier with ultra-high current efficiency.",
            "Contactless Heterogeneous 3-D ICs for Smart Sensing Systems.",
            "Energy efficient implementation of multi-phase quasi-adiabatic Cyclic Redundancy Check in near field communication.",
            "A novel design of a ternary coded decimal adder/subtractor using reversible ternary gates.",
            "Low overhead online periodic testing for GPGPUs.",
            "Improving performance of FPGA-based SR-latch PUF using Transient Effect Ring Oscillator and programmable delay lines.",
            "Adaptive prediction resolution video coding for reduced DRAM bandwidth.",
            "Exploring N3ASIC technology for microwave imaging architectures.",
            "An assertion graph based abstraction algorithm in GSTE and Its application.",
            "On-chip implementation of a low-latency bit-accurate reciprocal square root unit.",
            "Automated pre-placement phase as a part of robust analog-mixed signal physical design flow.",
            "Detection of counterfeited ICs via on-chip sensor and post-fabrication authentication policy.",
            "Ultra-low latency communication channels for FPGA-based HPC cluster.",
            "A loadless 6T SRAM cell for sub- & near- threshold operation implemented in 28 nm FD-SOI CMOS technology.",
            "Low-cost methodology for fault diagnosis and localization in pipelined ADCs.",
            "A 70 pJ/b configurable 64-QAM soft MIMO detector.",
            "A 2.4 mW 2.5 GHz multi-phase clock generator with duty cycle imbalance correction in 0.13 µm CMOS.",
            "Exact analyses for locking range in injection-locked frequency dividers.",
            "Simplifying low-power SoC top-down design using the system-level abstraction and the increased automation.",
            "Phase noise analysis of proposed PFD and CP switching circuit and its advantages over various PFD/CP switching circuits in phase-locked loops.",
            "A novel current-mode low-power adjustable wide input range four-quadrant analog multiplier.",
            "Optimizing FPGA-based hard networks-on-chip by minimizing and sharing resources.",
            "Transceiver design for LVSTL signal interface with a low power on-chip self calibration scheme.",
            "A physics-aware methodology for equivalent circuit model extraction of TSV-inductors.",
            "A 1.5 ∼ 5 GHz CMOS broadband low-power high-efficiency power amplifier for wireless communications.",
            "A new leakage-tolerant high speed comparator based domino gate for wide fan-in OR logic for low power VLSI circuits.",
            "An efficient hardware architecture for detection of vowel-like regions in speech signal.",
            "Super class AB-AB bulk-driven folded cascode OTA.",
            "NoC-DPR: A new simulation tool exploiting the Dynamic Partial Reconfiguration (DPR) on Network-on-Chip (NoC) based FPGA.",
            "Raspberry-Pi based system for propofol monitoring.",
            "Approximate Error Detection-Correction for efficient Adaptive Voltage Over-Scaling.",
            "Time-based calibration-less read-out circuit for interfacing wide range MOX gas sensors.",
            "Analog perceptron circuit with DAC-based multiplier.",
            "Quasi-exact logic functions through classification trees.",
            "Second-order compensation BGR with low TC and high performance for space applications.",
            "Experimental characterization of dedicated front-end electronics for piezoelectric tactile sensing arrays.",
            "Guest Editorial Special Issue on Selected Papers from PRIME 2017 and SMACD 2017.",
            "Architectural exploration of perpendicular Nano Magnetic Logic based circuits.",
            "A TVWS receiver with balanced output self-calibrated IIP2 LNTA employing a low-noise current multiplier.",
            "3-Path SiGe BiCMOS power amplifier on thinned substrate for IoT applications.",
            "A K-band low-noise bipolar class-C VCO for 5G backhaul systems in 55 nm BiCMOS technology.",
            "1GigaRad TID impact on 28 nm HEP analog circuits.",
            "CMOS event-driven tactile sensor circuit.",
            "Scalable lumped models of integrated transformers for galvanically isolated power transfer systems.",
            "Quasi-static PEEC planar solver using a weighted combination of 2D and 3D analytical Green's functions and a predictive meshing generator.",
            "Improving ICs reliability with high speed thermal mapping.",
            "Enhanced systematic design of a voltage controlled oscillator using a two-step optimization methodology.",
            "Full custom MEMS design: A new method for the analysis of motion-dependent parasitics.",
            "Real-time emulation of block-based analog circuits on an FPGA.",
            "There is a limit to everything: Automating AMS operating condition check generation on system-level."
        ]
    },
    {
        "name": "Integration",
        "year": "2017",
        "info": "2017: Volumes\n56,\n57,\n58,\n59",
        "count": 120,
        "papers": [
            "Reconfigurable very high throughput low latency VLSI (FPGA) design architecture of CRC 32.",
            "A hardened network-on-chip design using runtime hardware Trojan mitigation methods.",
            "A probabilistic pairwise swap search state assignment algorithm for sequential circuit optimization.",
            "Exclusive or Sum of Complex Terms expressions minimization.",
            "An inductorless wideband common-gate LNA with dual capacitor cross-coupled feedback and negative impedance techniques.",
            "Configurable memristive logic block for memristive-based FPGA architectures.",
            "A new CMOS pseudo approximation exponential function generator by modified particle swarm optimization algorithm.",
            "MASH ΣΔ modulators with a noise-shaped two-step ADC in the second stage.",
            "Boundary optimization of buffered clock trees for low power.",
            "iCETD: An improved tag generation design for memory data authentication in embedded processor systems.",
            "Why current secure scan designs fail and how to fix them?",
            "Fast clock scheduling and an application to clock tree synthesis.",
            "Automated topology synthesis of analog and RF integrated circuits: A survey.",
            "Hardness of crosstalk minimization in two-layer channel routing.",
            "A new hybrid algorithm for analog ICs optimization based on the shrinking circles technique.",
            "Implications of accelerated self-healing as a key design knob for cross-layer resilience.",
            "A robust 12T SRAM cell with improved write margin for ultra-low power applications in 40 nm CMOS.",
            "Hybrid TFET-MOSFET circuit: A solution to design soft-error resilient ultra-low power digital circuit.",
            "Temperature and data size trade-off in dictionary based test data compression.",
            "Run-time management of systems with partially reconfigurable FPGAs.",
            "All-digital background calibration technique for timing mismatch of time-interleaved ADCs.",
            "Clock buffer polarity assignment under useful skew constraints.",
            "CL-CPA: A hybrid carry-lookahead/carry-propagate adder for low-power or high-performance operation mode.",
            "Resonant amplifier-based sub-harmonic mixer for zero-IF transceiver applications.",
            "DVFS-aware motion estimation design scheme based on bandwidth-rate-distortion optimization in application processor systems.",
            "Performance evaluation metrics for ring-oscillator-based temperature sensors on FPGAs: A quality factor.",
            "Jitter tolerance calibration for high-speed serial interfaces.",
            "An integrated DFT solution for power reduction in scan test applications by low power gating scan cell.",
            "An area-efficient and low-power 64-point pipeline Fast Fourier Transform for OFDM applications.",
            "IPRM: IP core resource multiplexing of core wrapper design for reducing test application time in DVFS-based multicore SoCs.",
            "Fast Multiplier Generator for FPGAs with LUT based Partial Product Generation and Column/row Compression.",
            "A low-power 6-bit MOS CML flash ADC with a novel multi-segment encoder for UWB applications.",
            "Full-VDD and near-threshold performance of 8T FinFET SRAM cells.",
            "An adaptive digital predistortion for compensating nonlinear distortions in RF power amplifier with memory effects.",
            "A routing framework for technology migration with bump encroachment.",
            "PASSIOT: A Pareto-optimal multi-objective optimization approach for synthesis of analog circuits using Sobol' indices-based engine.",
            "Low-loss active inductor with independently adjustable self-resonance frequency and quality factor parameters.",
            "A 0.33 V 2.5 μW cross-point data-aware write structure, read-half-select disturb-free sub-threshold SRAM in 130 nm CMOS.",
            "An integrated fault tolerance technique for combinational circuits based on implications and transistor sizing.",
            "Stitch aware detailed placement for multiple E-beam lithography.",
            "Low space complexity CRT-based bit-parallel GF(2n) polynomial basis multipliers for irreducible trinomials.",
            "Cluster-based delta-QMC technique for fast yield analysis.",
            "Scaling equations for the accurate prediction of CMOS device performance from 180 nm to 7 nm.",
            "A mechanism for detecting on-chip radio frequency interference of field-programmable gate array.",
            "On supporting rapid prototyping of embedded systems with reconfigurable architectures.",
            "A fast temperature-aware fixed-outline floorplanning framework using convex optimization.",
            "CMOS Analog Rank Order Filters using positive feedback comparators.",
            "Self-triggering hardware trojan: Due to NBTI related aging in 3-D ICs.",
            "Loosely coupled multi-bit flip-flop allocation for power reduction.",
            "An efficient VLSI architecture design for logarithmic multiplication by using the improved operand decomposition.",
            "A standard cell phase locked loop design, analysis and high-level synthesis tool (CellPLL).",
            "Bio-inspired fault tolerant network on chip.",
            "Low Power Low Latency Floorplan‐aware Path Synthesis in Application-Specific Network-on-Chip Design.",
            "New advances of high-level synthesis for efficient and reliable hardware design.",
            "A quantitative design methodology for high-speed interpolation/averaging ADCs.",
            "Special issue on IEEE/ACM System Level Interconnect Prediction (SLIP) Workshop 2016.",
            "Revisiting 3DIC benefit with multiple tiers.",
            "Minimizing detection-to-boosting latency toward low-power error-resilient circuits.",
            "An adaptive hybrid memetic algorithm for thermal-aware non-slicing VLSI floorplanning.",
            "Giant Spin-Hall assisted STT-RAM and logic design.",
            "Guest editorial - Special issue on hardware assisted techniques for IoT and bigdata applications.",
            "Area, energy, and time assessment for a distributed TPM for distributed trust in IoT clusters.",
            "A framework for post-disaster communication using wireless ad hoc networks.",
            "A high precise E-nose for daily indoor air quality monitoring in living environment.",
            "Energy efficient EEG acquisition and reconstruction for a Wireless Body Area Network.",
            "Automated diagnostics for manufacturing machinery based on well-regularized deep neural networks.",
            "Shaping data for application performance and energy optimization in dynamic data view framework.",
            "Energy aware synthesis of application kernels through composition of data-paths on a CGRA.",
            "A novel switchable pin method for regulating power in chip-multiprocessor.",
            "AutoNFT: Architecture synthesis for hardware DFT of length-of-coprime-number products.",
            "Threshold adjustment of receiver chip to achieve a data rate >66 Gbit/sec in point to point interconnect.",
            "A mathematical formulation to design and implementation of a low voltage swing transceiver circuit.",
            "Design exploration of a Symmetric Pass Gate Adiabatic Logic for energy-efficient and secure hardware.",
            "Low cost optimized Trojan secured schedule at behavioral level for single & Nested loop control data flow graphs (Invited Paper).",
            "Secure split test techniques to prevent IC piracy for IoT devices.",
            "A novel current controlled configurable RO PUF with improved security metrics.",
            "Introduction to the special issue on PRIME 2016 and SMACD 2016.",
            "Design of low-power wideband frequency quadruplers based on transformer-coupled resonators for E-Band backhaul applications.",
            "Thermal aware design and comparative analysis of a high performance 64-bit adder in FD-SOI and bulk CMOS technologies.",
            "A 65 nm CMOS key establishment core based on tree parity machines.",
            "Arduino-controlled HP memristor emulator for memristor circuit applications.",
            "A computational design of a versatile microchamber for in vitro nanosecond pulsed electric fields experiments.",
            "A contribution towards model-based design of application-specific MEMS.",
            "An inductor modeling and optimization toolbox for RF circuit design.",
            "A generalized numerical method for ferrite inductors analysis in high current ripple operation.",
            "Stochastic-based placement template generator for analog IC layout-aware synthesis.",
            "Aging signature properties and an efficient signature determination tool for online monitoring.",
            "Path reuse-aware routing for non-volatile memory based FPGAs.",
            "Dynamic electromigration modeling for transient stress evolution and recovery under time-dependent current and temperature stressing.",
            "An optimal energy co-scheduling framework for smart buildings.",
            "A novel test compression algorithm for analog circuits to decrease production costs.",
            "Clustered checkpointing: Maximizing the level of confidence for non-equidistant checkpointing.",
            "IP protection through gate-level netlist security enhancement.",
            "Ensuring safety and efficiency in networks-on-chip.",
            "A high performance reliable NoC router.",
            "High-performance ternary operators for scrambling.",
            "Contemporary CMOS aging mitigation techniques: Survey, taxonomy, and methods.",
            "Dynamic data split: A crosstalk suppression scheme in TSV-based 3D IC.",
            "Simple method of asynchronous circuits implementation in commercial FPGAs.",
            "Synthesis of optical circuits using binary decision diagrams.",
            "High-throughput partial-parallel block-layered decoding architecture for nonbinary LDPC codes.",
            "Hardware trojans in 3-D ICs due to NBTI effects and countermeasure.",
            "High gain amplifier with feedforward compensation based on quasi-floating gate transistors.",
            "Hardware design of LIF with Latency neuron model with memristive STDP synapses.",
            "On advance towards sub-sampling technique in phase locked loops - A review.",
            "Optimizing scrubbing by netlist analysis for FPGA configuration bit classification and floorplanning.",
            "Flexible VLSI architectures for Galois field multipliers.",
            "Pareto optimization technique in actuation control for error minimization and reliability analysis in an operational pin-constrained digital microfluidic biochip.",
            "Exploiting bounds optimization for the semi-formal verification of analog circuits.",
            "Algorithm and hardware implementation for visual perception system in autonomous vehicle: A survey.",
            "Fast thermal analysis for fixed-outline 3D floorplanning.",
            "Refresh re-use based transparent test for detection of in-field permanent faults in DRAMs.",
            "A very stable diode-based physically unclonable constant.",
            "A 1.4×FO4 self-clocked asynchronous serial link in 0.18 µm for intrachip communication.",
            "Concurrent built-in self-testing under the constraint of shared test resources and its test time reduction.",
            "A 12-bit 4928 × 3264 pixel CMOS image signal processor for digital still cameras.",
            "Co-AGSA: An efficient self-adaptive approach for constrained optimization of analog IC based on the shrinking circles technique.",
            "Effective usage of redundancy to aid neutralization of hardware Trojans in Integrated Circuits.",
            "CMOS analogue current-mode multiplier/divider circuit operating in triode-saturation with bulk-driven techniques.",
            "Design of a high precision digital interface circuit for capacitive MEMS accelerometers with floating point ADC."
        ]
    },
    {
        "name": "Integration",
        "year": "2016",
        "info": "2016: Volumes\n52,\n53,\n54,\n55",
        "count": 108,
        "papers": [
            "Surrogating circuit design solutions with robustness metrics.",
            "Parallel GMRES solver for fast analysis of large linear dynamic systems on GPU platforms.",
            "A novel bus transfer mode (AS transfer) and a performance evaluation methodology.",
            "Comments on \"Dual-rail asynchronous logic multi-level implementation\".",
            "LOFT: A low-overhead fault-tolerant routing scheme for 3D NoCs.",
            "A new approach to analysis of residue probability density function in pipelined ADCs.",
            "A Fast FIR filtering technique for multirate filters.",
            "Effects of aging and compensation mechanisms in ordering based RO-PUFs.",
            "High performance parallel turbo decoder with configurable interleaving network for LTE application.",
            "Optimal utilization of adjustable delay clock buffers for timing correction in designs with multiple power modes.",
            "Design automation for application-specific on-chip interconnects: A survey.",
            "Substrate noise isolation improvement in a single-well standard CMOS process.",
            "A low-power fast tag comparator by modifying charging scheme of wide fan-in dynamic OR gates.",
            "New bit-parallel Montgomery multiplier for trinomials using squaring operation.",
            "Design of a hybrid non-volatile SRAM cell for concurrent SEU detection and correction.",
            "A novel high-throughput method for table look-up based analog design automation.",
            "Introduction to the special issue on Radio Frequency Integrated Circuits (RFIC) design techniques.",
            "A wideband RF receiver with extended statistical element selection based harmonic rejection calibration.",
            "Impact of technology scaling on the tuning range and phase noise of mm-wave CMOS LC-VCOs.",
            "Layout-aware design methodology for a 75 GHz power amplifier in a 55 nm SiGe technology.",
            "Post-process die-level electromagnetic field analysis on microwave CMOS low-noise amplifier for first-pass silicon fabrication success.",
            "Semi-empirical RF MOST model for CMOS 65 nm technologies: Theory, extraction method and validation.",
            "A hybrid approach for the sensitivity analysis of integrated inductors.",
            "Automatic synthesis of RF front-end blocks using multi-objective evolutionary techniques.",
            "Analysis of frequency and amplitude in CMOS differential ring oscillators.",
            "A quadrature RC-oscillator with capacitive coupling.",
            "K Band SiGe HBT single ended active inductors.",
            "A digital predistortion assisted hybrid supply modulator for envelope tracking power amplifiers.",
            "FPGA-based test bed for measurement of AM/AM and AM/PM distortion and modeling memory effects in RF PAs.",
            "Active inductor-based tunable impedance matching network for RF power amplifier application.",
            "Noise canceling LNA with gain enhancement by using double feedback.",
            "An Inductor-less Sub-mW Low Noise Amplifier for Wireless Sensor Network Applications.",
            "gm-boosted flat gain UWB low noise amplifier with active inductor-based input matching network.",
            "Corrigendum to \"High throughput asynchronous NoC design under high process variation\" [Integr. VLSI J. (2015) 1-13].",
            "Multi-supply voltage (MSV) driven SoC floorplanning for fast design convergence.",
            "Challenges of cell selection algorithms in industrial high performance microprocessor designs.",
            "An exact algorithm for wirelength optimal placements in VLSI design.",
            "Clock domain crossing (CDC) in 3D-SICs: Semi QDI asynchronous vs loosely synchronous.",
            "Design and implementation of multi-mode routers for large-scale inter-core networks.",
            "Fast and accurate FPGA-based framework for processor architecture vulnerability analysis.",
            "Explicit formulae for Mastrovito matrix and its corresponding Toeplitz matrix for all irreducible pentanomials using shifted polynomial basis.",
            "SyReC: A hardware description language for the specification and synthesis of reversible circuits.",
            "A comparative study on performance and reliability of 32-bit binary adders.",
            "Variability-aware 7T SRAM circuit with low leakage high data stability SLEEP mode.",
            "Adaptive power gating of 32-bit Kogge Stone adder.",
            "An efficient tool for the assisted design of SAR ADCs capacitive DACs.",
            "A dynamic specification to automatically debug and correct various divider circuits.",
            "A stochastic evolution algorithm based 2D VLSI global router.",
            "NBTI-aware adaptive minimum leakage vector selection using a linear programming approach.",
            "WHDVI: A wireless high definition video interface technique for digital home.",
            "Power-performance enhancement of two-dimensional RNS-based DWT image processor using static voltage scaling.",
            "Wakeup scheduling and its buffered tree synthesis for power gating circuits.",
            "A low-cost platform for the prototyping and characterization of digital circuit IPs.",
            "Frame buffer-less stream processor for accurate real-time interest point detection.",
            "Cross-matching caches: Dynamic timing calibration and bit-level timing-failure mask caches to reduce timing discrepancies with low voltage processors.",
            "A high-performance VLSI architecture for reconfigurable FIR using distributed arithmetic.",
            "Phase Change Memory lifetime enhancement via online data swapping.",
            "Read operation performance of large selectorless cross-point array with self-rectifying memristive device.",
            "Bio-inspired NoC fault tolerant techniques using guaranteed throughput and best effort services.",
            "Design and process variation analysis of CNTFET-based ternary memory cells.",
            "Digital implementation of a virtual insect trained by spike-timing dependent plasticity.",
            "Design of a memristor-based look-up table (LUT) for low-energy operation of FPGAs.",
            "A compact low-power 4-port register file with grounded write bitlines and single-ended read operations.",
            "Method for designing two levels RNS reverse converters for large dynamic ranges.",
            "BiLink: A high performance NoC router architecture using bi-directional link with double data rate.",
            "Multi-mode parallel and folded VLSI architectures for 1D-fast Fourier transform.",
            "A low-power wide tuning-range CMOS current-controlled oscillator.",
            "Γ (Gamma): A SaaS-enabled fast and accurate analog design System.",
            "UA2TPG: An untestability analyzer and test pattern generator for SEUs in the configuration memory of SRAM-based FPGAs.",
            "Statistical analysis of asynchronous pipelines in presence of process variation using formal models.",
            "Energy estimation in SystemC with Powersim.",
            "A novel spatially configurable differential interface for an electronic system prototyping platform.",
            "An efficient and high-speed VLSI implementation of optimal normal basis multiplication over GF(2m).",
            "Fast low energy RNS comparators for 4-moduli sets {2n±1, 2n, m} with m∈{2n+1±1, 2n-1-1}.",
            "A heuristic for constructing a rectilinear Steiner tree by reusing routing resources over obstacles.",
            "Energy efficient computing by multi-mode addition.",
            "Stochastic testing of processing cores in a many-core architecture.",
            "Design and simulation of an ultra-low power high performance CMOS logic: DMTGDI.",
            "A fast force-directed simulated annealing for 3D IC partitioning.",
            "An NTF-enhanced incremental ΣΔ modulator using a SAR quantizer.",
            "Sensitivity aware NSGA-II based Pareto front generation for the optimal sizing of analog circuits.",
            "Weighted median filters: An analog implementation.",
            "Row-structure stencil planning approaches for E-beam lithography with overlapped characters.",
            "Synthesis of Dual Mode Logic.",
            "Design, simulation, and implementation of an integrated, hybrid photocurrent-to-digital converter in CMOS technology.",
            "A mixed-signal pulse width modulator for portable SMPS applications.",
            "Improving linearity in MOS varactor based VCOs by means of the output quiescent bias point.",
            "Two-stage fuzzy inference system for symbolic simplification of analog circuits.",
            "Introduction to the special issue on SMACD 2015.",
            "Current-flow and current-density-aware multi-objective optimization of analog IC placement.",
            "Electromigration assessment for power grid networks considering temperature and thermal stress effects.",
            "AIDA: Layout-aware analog circuit-level sizing with in-loop layout generation.",
            "Design and application of a CMOS active inductor at Ku band based on a multi-objective optimizer.",
            "Reliability simulation for analog ICs: Goals, solutions, and challenges.",
            "A lifetime-aware analog circuit sizing tool.",
            "Comparison of QMC-based yield-aware pareto front techniques for multi-objective robust analog synthesis.",
            "An analog behavioral equivalence boundary search methodology for simulink models and circuit level designs utilizing evolutionary computation.",
            "Causal reasoning mining approach to analog circuit verification.",
            "Impact of losses and mismatches on power and efficiency of Wireless Power Transfer Systems with controlled secondary-side rectifier.",
            "Automatic generation of test infrastructures for analog integrated circuits by controllability and observability co-optimization.",
            "Brownian distance correlation-directed search: A fast feature selection technique for alternate test.",
            "Indirect test of M-S circuits using multiple specification band guarding.",
            "Editorial: Special Issue on The 14th International Conference on Computer-Aided Design and Computer Graphics (CAD/Graphics 2015).",
            "A survey of hardware Trojan threat and defense.",
            "VLSI supply chain security risks and mitigation techniques: A survey.",
            "An aggregating based model order reduction method for power grids.",
            "Efficient modeling and analysis of energy consumption for 3D graphics rendering.",
            "Selective body biasing for post-silicon tuning of sub-threshold designs: A semi-infinite programming approach with Incremental Hypercubic Sampling."
        ]
    },
    {
        "name": "Integration",
        "year": "2015",
        "info": "2015: Volumes\n48,\n49,\n50,\n51",
        "count": 69,
        "papers": [
            "Energy efficient adaptive clustering of on-chip power delivery systems.",
            "Hierarchical power management of a system with autonomously power-managed components using reinforcement learning.",
            "Critical path-aware voltage island partitioning and floorplanning for hard real-time embedded systems.",
            "On optimizing system energy of voltage-frequency island based 3-D multi-core SoCs under thermal constraints.",
            "Reducing random-dopant fluctuation impact using footer transistors in many-core systems.",
            "A highly dependable self-adaptive mixed-signal multi-core system-on-chip architecture.",
            "A synchronous latency-insensitive RISC for better than worst-case design.",
            "Variation-aware approaches with power improvement in digital circuits.",
            "Stochastic logical effort as a variation aware delay model to estimate timing yield.",
            "Energy efficient hybrid adder architecture.",
            "Timing-constrained power minimization in VLSI circuits by simultaneous multilayer wire spacing.",
            "Multi-parameter clock skew scheduling.",
            "ADPLL design parameters determinations through noise modeling.",
            "Crosstalk-aware multi-bit flip-flop generation for power optimization.",
            "Length-constrained escape routing of differential pairs.",
            "SIAR: Customized real-time interactive router for analog circuits.",
            "Floorplan-aware analog IC sizing and optimization based on topological constraints.",
            "Fast multidimensional optimization of analog circuits initiated by monodimensional global Peano explorations.",
            "Resource efficient LDPC decoders for multimedia communication.",
            "Log-hybrid architecture for tonal correction combined with modified un-sharp masking filter algorithm for colour image enhancement.",
            "An energy-efficient, high-precision SFP LPFIR filter engine for digital hearing aids.",
            "High Throughput Asynchronous NoC Design under High Process Variation.",
            "RF calibration of on-chip DfT chain by DC stimuli and statistical multivariate regression technique.",
            "Design of NBTI-resilient extensible processors.",
            "Temperature variation aware multi-scale delay, power and thermal analysis at RT and gate level.",
            "Modeling memory effects in RF power amplifiers applied to a digital pre-distortion algorithm and emulated on a DSP-FPGA board.",
            "A high performance 5 stage pipeline architecture for the H.264/AVC deblocking filter.",
            "Assignment of inter-die signals in a simplified wiring model for die-stacking SiP designs.",
            "An on-chip frequency programmable test clock generation and application method for small delay defect detection.",
            "Transconductance improvement method for low-voltage bulk-driven input stage.",
            "Finite-point method for efficient timing characterization of sequential elements.",
            "Hardware implementation of a spatio-temporal average filter for real-time denoising of fluoroscopic images.",
            "Synthesis-based design and implementation methodology of high-speed, high-performing unit: L2 cache unit design.",
            "Rapid estimation of the probability of SRAM failure via adaptive multi-level sliding-window statistical method.",
            "A new write assist technique for SRAM design in 65 nm CMOS technology.",
            "A 10-bit 50 MS/s SAR ADC in 65 nm CMOS with on-chip reference voltage buffer.",
            "Impact of scaling on the soft error sensitivity of bulk, FDSOI and FinFET technologies due to atmospheric radiation.",
            "A current monitoring technique for IDDQ testing in digital integrated circuits.",
            "Window-based peak power model and Particle Swarm Optimization guided 3-dimensional bin packing for SoC test scheduling.",
            "On the convex formulation of area for slicing floorplans.",
            "Three-dimensional switchbox multiplexing in emerging 3D-FPGAs to reduce chip footprint and improve TSV usage.",
            "A near-threshold 7T SRAM cell with high write and read margins and low write time for sub-20 nm FinFET technologies.",
            "A fast model for analysis and improvement of gate-level circuit reliability.",
            "Transaction-level power analysis of VLSI digital systems.",
            "Power supply noise in accurate delay model for the sub-threshold domain.",
            "On-chip parallel and network-based systems.",
            "Exploiting generalized de-Bruijn/Kautz topologies for flexible iterative channel code decoder architectures.",
            "An efficient runtime power allocation scheme for many-core systems inspired from auction theory.",
            "A design space exploration methodology for customizing on-chip communication architectures: Towards fractal NoCs.",
            "P2R2: Parallel Pseudo-Round-Robin arbiter for high performance NoCs.",
            "On the design of hybrid routing mechanism for mesh-based network-on-chip.",
            "Improving the performance of packet-switched networks-on-chip by SDM-based adaptive shortcut paths.",
            "Single-layer obstacle-aware routing for substrate interconnections.",
            "NBTI alleviation on FinFET-made GPUs by utilizing device heterogeneity.",
            "Efficient multi-Gb/s multi-mode LDPC decoder architecture for IEEE 802.11ad applications.",
            "A novel memristor based physically unclonable function.",
            "A nature-inspired firefly algorithm based approach for nanoscale leakage optimal RTL structure.",
            "A new leakage-tolerant domino circuit using voltage-comparison for wide fan-in gates in deep sub-micron technology.",
            "Memory customisations for image processing applications targeting MPSoCs.",
            "A new parallel hardware architecture for high-performance stereo matching calculation.",
            "Average latency and link utilization analysis of heterogeneous wormhole NoCs.",
            "An all-digital self-calibrated delay-line based temperature sensor for VLSI thermal sensing and management.",
            "System-level synthesis of multi-ASIP platforms using an uncertainty model.",
            "Scaling trends of power noise in 3-D ICs.",
            "A statistics-based digital background calibration technique for pipelined ADCs.",
            "Synthesis of biochemical applications on digital microfluidic biochips with operation execution time variability.",
            "An open-source compiler and PCB synthesis tool for digital microfluidic biochips.",
            "Waste-aware single-target dilution of a biochemical fluid using digital microfluidic biochips.",
            "A robust recognition error recovery for micro-flow cytometer by machine-learning enhanced single-frame super-resolution processing."
        ]
    },
    {
        "name": "Integration",
        "year": "2014",
        "info": "2014: Volume 47",
        "count": 51,
        "papers": [
            "Energy efficient computation: A silicon perspective.",
            "A survey on nonlinear analog-to-digital converters.",
            "A novel autozeroing technique for flash Analog-to-Digital converters.",
            "Untrimmed 6.2 ppm/°C bulk-isolated curvature-corrected bandgap voltage reference.",
            "A novel design method for discrete time chaos based true random number generators.",
            "Design of two Low-Power full adder cells using GDI structure and hybrid CMOS logic style.",
            "Full-Swing Gate Diffusion Input logic - Case-study of low-power CLA adder design.",
            "Compact thermal modeling for packaged microprocessor design with practical power maps.",
            "Regularity-constrained floorplanning for multi-core processors.",
            "Metro-on-FPGA: A feasible solution to improve the congestion and routing resource management in future FPGAs.",
            "Obstacle-avoiding rectilinear Steiner tree construction in sequential and parallel approach.",
            "Planar CMOS to multi-gate layout conversion for maximal fin utilization.",
            "Hardware implementation of tag-reader mutual authentication protocol for RFID systems.",
            "New efficient bit-parallel polynomial basis multiplier for special pentanomials.",
            "Efficient modulo 2n+1 multiply and multiply-add units based on modified Booth encoding.",
            "Dual-rail asynchronous logic multi-level implementation.",
            "Cell-based interconnect migration by hierarchical optimization.",
            "Fast and scalable parallel layout decomposition in double patterning lithography.",
            "Algorithms for TSV resource sharing and optimization in designing 3D stacked ICs.",
            "Nano-CMOS thermal sensor design optimization for efficient temperature measurement.",
            "High slew rate current mode transconductance error amplifier for low quiescent current output-capacitorless CMOS LDO regulator.",
            "Analog circuit design space description based on ordered clustering of feature uniqueness and similarity.",
            "Design of a coarse-grained reconfigurable architecture with floating-point support and comparative study.",
            "Simultaneous switching noise reduction by resonant clock distribution networks.",
            "StarSync: An extendable standard-cell mesochronous synchronizer.",
            "Analysis and comparison of Direct Digital Frequency Synthesizers implemented on FPGA.",
            "Low power wide gates for modern power efficient processors.",
            "Trading off circuit lines and gate costs in the synthesis of reversible logic.",
            "VLSI for the new era.",
            "Compact model to efficiently characterize TSV-to-transistor noise coupling in 3D ICs.",
            "A geometric approach to chip-scale TSV shield placement for the reduction of TSV coupling in 3D-ICs.",
            "Designing soft-edge flip-flop-based linear pipelines operating in multiple supply voltage regimes.",
            "A new extension method of retention time for memory cell on dynamic random access memory.",
            "A portable high-frequency digitally controlled oscillator (DCO).",
            "Optimal gate sizing using a self-tuning multi-objective framework.",
            "Iterative skew minimization for low swing clocks.",
            "Dynamically adaptive real-time disparity estimation hardware using iterative refinement.",
            "A high performance hardware architecture for portable, low-power retinal vessel segmentation.",
            "On the development of high-throughput and area-efficient multi-mode cryptographic hash designs in FPGAs.",
            "Efficient architecture and hardware implementation of hybrid fuzzy-Kalman filter for workload prediction.",
            "A digital array based bit serial processor for arbitrary window size kernel convolution in vision sensors.",
            "Hardware-efficient common-feedback Markov-random-field probabilistic-based noise-tolerant VLSI circuits.",
            "Low area/power decimal addition with carry-select correction and carry-select sum-digits.",
            "Fault-tolerant analysis of TMR design with noise-aware logic.",
            "High-level parameterizable area estimation modeling for ASIC designs.",
            "Edge layer embedding algorithm for mitigating on-package variation in 3D clock tree synthesis.",
            "Statistical timing and power analysis of VLSI considering non-linear dependence.",
            "Enhancement of test data compression with multistage encoding.",
            "ISGP: Iterative sequential geometric programming for precise and robust CMOS analog circuit sizing.",
            "Electromigration-aware analog Router with multilayer multiport terminal structures.",
            "Simulation and design of an UWB imaging system for breast cancer detection."
        ]
    },
    {
        "name": "Integration",
        "year": "2013",
        "info": "2013: Volume 46",
        "count": 42,
        "papers": [
            "Thermal-aware P/G TSV planning for IR drop reduction in 3D ICs.",
            "3D thermal-aware floorplanner using a MOEA approximation.",
            "SPECO: Stochastic Perturbation based Clock tree Optimization considering temperature uncertainty.",
            "A combined sensor placement and convex optimization approach for thermal management in 3D-MPSoC with liquid cooling.",
            "Architectural implications of spatial thermal filtering.",
            "An efficient channel clustering and flow rate allocation algorithm for non-uniform microfluidic cooling of 3D integrated circuits.",
            "Post-silicon power mapping techniques for integrated circuits.",
            "Statistical full-chip total power estimation considering spatially correlated process variations.",
            "Use of FPGA or GPU-based architectures for remotely sensed hyperspectral image processing.",
            "Exploring redundant arithmetics in computer-aided design of arithmetic datapaths.",
            "A fragmentation aware High-Level Synthesis flow for low power heterogenous datapaths.",
            "Bitmask aware compression of NISC control words.",
            "Multi-bend bus-driven floorplanning considering fixed-outline constraints.",
            "Post-routing layer assignment for double patterning with timing critical paths consideration.",
            "Fast transient current-steering CMOS LDO regulator based on current feedback amplifier.",
            "Hierarchical sizing and biasing of analog firm intellectual properties.",
            "Synthesis and optimization of multiple-valued combinational and sequential reversible circuits with don't cares.",
            "Low complexity bit-parallel polynomial basis multipliers over binary fields for special irreducible pentanomials.",
            "Low-power and high-speed design of a versatile bit-serial multiplier in finite fields GF(2m).",
            "Hardware for bioinformatics applications.",
            "Hardware implementation of subtractive clustering for radionuclide identification.",
            "FPGA-based hardware acceleration for local complexity analysis of massive genomic data.",
            "A scalable parallel reconfigurable hardware architecture for DNA matching.",
            "Domino logic designs for high-performance and leakage-tolerant applications.",
            "A formal framework for interfacing mixed-timing systems.",
            "A column parity based fault detection mechanism for FIFO buffers.",
            "Package routability- and IR-drop-aware finger/pad planning for single chip and stacking IC designs.",
            "Routability-constrained multi-bit flip-flop construction for clock power reduction.",
            "An efficient method for gradient-aware dummy fill synthesis.",
            "Post-silicon debugging of PMU integration errors using behavioral models.",
            "Fast, compact and symmetric modular exponentiation architecture by common-multiplicand Montgomery modular multiplications.",
            "Low-power compact composite field AES S-Box/Inv S-Box design in 65 nm CMOS using Novel XOR Gate.",
            "A gate-delay model focusing on current fluctuation over wide range of process-voltage-temperature variations.",
            "A memory efficient parallel layered QC-LDPC decoder for CMMB systems.",
            "Bus-driven floorplanning with thermal consideration.",
            "Timing-driven variation-aware synthesis of hybrid mesh/tree clock distribution networks.",
            "SmipRef: An efficient method for multi-domain clock skew scheduling.",
            "A low-power oriented architecture for H.264 variable block size motion estimation based on a resource sharing scheme.",
            "Low-leakage soft error tolerant port-less configuration memory cells for FPGAs.",
            "Solution of PDEs-electrically coupled systems with electrical analogy.",
            "Compact low-power implementation for continuous-time ΣΔ modulators.",
            "Modeling and design of CMOS analog circuits through hierarchical abstraction."
        ]
    },
    {
        "name": "Integration",
        "year": "2012",
        "info": "2012: Volume 45",
        "count": 41,
        "papers": [
            "VLSI design of memory-efficient, high-speed baseline MQ coder for JPEG 2000.",
            "Design of multi-mode application-specific cores based on high-level synthesis.",
            "Robust low leakage controlled keeper by current-comparison domino for wide fan-in gates.",
            "Statistical DOE-ILP based power-performance-process (P3) optimization of nano-CMOS SRAM.",
            "Towards accelerating irregular EDA applications with GPUs.",
            "A 32 GBit/s communication SoC for a waferscale neuromorphic system.",
            "Discharge-path-based antenna effect detection and fixing for X-architecture clock tree.",
            "A new scheme of test data compression based on equal-run-length coding (ERLC).",
            "Fully hardware based WFQ architecture for high-speed QoS packet scheduling.",
            "Performance analysis of radix-4 adders.",
            "A new clock network synthesizer for modern VLSI designs.",
            "Variable wordlength soft-decision Viterbi decoder for power-efficient wireless LAN.",
            "An area efficient LDPC decoder using a reduced complexity min-sum algorithm.",
            "Efficient algorithms for fast IR drop analysis exploiting locality.",
            "A dynamic jitter model to evaluate uncertainty trends with technology scaling.",
            "A complete dynamic power estimation model for data-paths in FPGA DSP designs.",
            "Ultra-low-power signaling challenges for subthreshold global interconnects.",
            "Exact ESOP expressions for incompletely specified functions.",
            "Explicit formulae of polynomial basis squarer for pentanomials using weakly dual basis.",
            "Customizing completely specified pattern set targeting dynamic and leakage power reduction during testing.",
            "An 8-bit 19 MS/s low-power 0.35 μm CMOS pipelined ADC for DVB-H.",
            "A read-decoupled gated-ground SRAM architecture for low-power embedded memories.",
            "Circuit design of a dual-versioning L1 data cache.",
            "Impact of positive bias temperature instability (PBTI) on 3T1D-DRAM cells.",
            "Static-switching pulse domino: A switching-aware design technique for wide fan-in dynamic multiplexers.",
            "Exact custom instruction enumeration for extensible processors.",
            "A framework for low power synthesis of interconnection networks-on-chip with multiple voltage islands.",
            "Synthesis of P-circuits for logic restructuring.",
            "High-level algorithms for the optimization of gate-level area in digit-serial multiple constant multiplications.",
            "Generalized high speed Itoh-Tsujii multiplicative inversion architecture for FPGAs.",
            "Two-level clustering-based techniques for intelligent droplet routing in digital microfluidic biochips.",
            "Design of a high performance Binary Edwards Curve based processor secured against side channel analysis.",
            "New optimal layer assignment for bus-oriented escape routing.",
            "Resource-constrained link insertion for delay reduction.",
            "SAT based timing analysis for fixed and rise/fall gate delay models.",
            "An accurate sparse-matrix based framework for statistical static timing analysis.",
            "Fast timing analysis of clock networks considering environmental uncertainty.",
            "Area-time efficient end-around inverted carry adders.",
            "Low power dynamic logic circuit design using a pseudo dynamic buffer.",
            "Bus-driven floorplanning with bus pin assignment and deviation minimization.",
            "Analysis and architecture design of scalable fractional motion estimation for H.264 encoding."
        ]
    },
    {
        "name": "Integration",
        "year": "2011",
        "info": "2011: Volume 44",
        "count": 28,
        "papers": [
            "Directly performance-constrained template-based layout retargeting and optimization for analog integrated circuits.",
            "Improving the energy efficiency of reversible logic circuits by the combined use of adiabatic styles.",
            "All digital skew tolerant synchronous interfacing methods for high-performance point-to-point communications in deep sub-micron SoCs.",
            "Measuring the uniqueness and variety of analog circuit design features.",
            "Debugging reversible circuits.",
            "Optimized design of parallel carry-select adders.",
            "Efficient RC low-power bus encoding methods for crosstalk reduction.",
            "Pattern-matching-based X-architecture zero-skew clock tree construction with X-Flip technique and via delay consideration.",
            "Test data compression using alternating variable run-length code.",
            "A pre-placement individual net length estimation model and an application for modern circuits.",
            "Improved predictability, timing yield and power consumption using hierarchical highways-on-chip planning methodology.",
            "A new CMOS wideband low noise amplifier with gain control.",
            "Simulation-based analog and RF circuit synthesis using a modified evolutionary strategies algorithm.",
            "High-speed full adder based on minority function and bridge style for nanoscale.",
            "Efficient modulo 2n±1 squarers.",
            "Low power finite state machine synthesis using power-gating.",
            "Statistical lifetime reliability optimization considering joint effect of process variation and aging.",
            "StarPlace: A new analytic method for FPGA placement.",
            "Capture-power-aware test data compression using selective encoding.",
            "Improved diagnosis using enhanced fault dominance.",
            "A nonlinearity error calibration technique for pipelined ADCs.",
            "Power efficient multi-stage CMOS rectifier design for UHF RFID tags.",
            "Hardware architectures for algebra, cryptology, and number theory.",
            "Tripartite modular multiplication.",
            "Optimized FPGA-based elliptic curve cryptography processor for high-speed applications.",
            "Design and design methods for unified multiplier and inverter and its application for HECC.",
            "Hardware SLE solvers: Efficient building blocks for cryptographic and cryptanalyticapplications.",
            "Efficient hardware implementation of a highly-parallel 3GPP LTE/LTE-advance turbo decoder."
        ]
    },
    {
        "name": "Integration",
        "year": "2010",
        "info": "2010: Volume 43",
        "count": 32,
        "papers": [
            "Modern development methods and tools for embedded reconfigurable systems: A survey.",
            "Fully redundant decimal addition and subtraction using stored-unibit encoding.",
            "Fast modulo 2n+1 multi-operand adders and residue generators.",
            "Reducing leakage power with BTB access prediction.",
            "A static verification approach for architectural integration of mixed-signal integrated circuits.",
            "A new methodology to implement the AES algorithm using partial and dynamic reconfiguration.",
            "A test set embedding approach based on twisted-ring counter with few seeds.",
            "Formal verification of high-level data-flow synthesis designs using relational modeling and symbolic computation.",
            "Concurrent error detection architectures for Gaussian normal basis multiplication over GF(2m).",
            "An improved common subexpression elimination method for reducing logic operators in FIR filter implementations without increasing logic depth.",
            "Analog circuits optimization based on evolutionary computation techniques.",
            "Statistical modeling and analysis of chip-level leakage power by spectral stochastic method.",
            "Erratum to the Special Section on DCIS 2006 [Integration, the VLSI Journal, Volume 42, Issue 3, June 2009].",
            "Statistical analysis of large on-chip power grid networks by variational reduction scheme.",
            "Design and analysis of a 32 nm PVT tolerant CMOS SRAM cell for low leakage and high stability.",
            "Wave-pipelined intra-chip signaling for on-FPGA communications.",
            "Rapid design space exploration using legacy design data and technology scaling trend.",
            "Statistical estimation and evaluation for communication mapping in Network-on-Chip.",
            "Low-power current-reused RF front-end based on optimized transformers topology.",
            "Reducing signal timing variations in inter-core busses.",
            "Single-pair bulk-driven CMOS input stage: A compact low-voltage analog cell for scaled technologies.",
            "Constant addition with flagged binary adder architectures.",
            "A low-overhead and reliable switch architecture for Network-on-Chips.",
            "Logical effort based dynamic power estimation and optimization of static CMOS circuits.",
            "An automated high-level topology generation procedure for continuous-time SigmaDelta modulator.",
            "A high performance MQ encoder architecture in JPEG2000.",
            "Optimization of via distribution and stacked via in multi-layered P/G networks.",
            "Thermal modeling and analysis of 3D multi-processor chips.",
            "Signal through-the-silicon via planning and pin assignment for thermal and wire length optimization in 3D ICs.",
            "Full-chip leakage analysis for 65 nm CMOS technology and beyond.",
            "Scaling of analog LDPC decoders in sub-100 nm CMOS processes.",
            "Multi-layer floorplanning for stacked ICs: Configuration number and fixed-outline constraints."
        ]
    },
    {
        "name": "Integration",
        "year": "2009",
        "info": "2009: Volume\n42",
        "count": 49,
        "papers": [
            "AMS/RF-CMOS circuit design for wireless transceivers.",
            "Input match and load tank digital calibration of an inductively degenerated CMOS LNA.",
            "ANTIGONE: Top-down creation of analog-to-digital converter architectures.",
            "A PLL-based synthesizer for tunable digital clock generation in a continuous-time SigmaDelta A/D converter.",
            "Reconfigurable multi-mode sigma-delta modulator for 4G mobile terminals.",
            "A mixed-signal demodulator for a low-complexity IR-UWB receiver: Methodology, simulation and design.",
            "Nyquist-criterion based design of a CT SigmaDelta-ADC with a reduced number of comparators.",
            "A low-power 2GHz data conversion using delta modulation for portable application.",
            "A fully integrated 23.2dBm P1dB CMOS power amplifier for the IEEE 802.11a with 29% PAE.",
            "A 1-V RF-CMOS LNA design utilizing the technique of capacitive feedback matching network.",
            "Third-order nonlinearity vs. load impedance for CMOS low-noise amplifiers.",
            "Predictive test strategy for CMOS RF mixers.",
            "QNoC asynchronous router.",
            "Reconfigurable DeltaSigma modulator topology design through hierarchical mapping and constraint extraction.",
            "Protection against soft errors in the space environment: A finite impulse response (FIR) filter case study.",
            "Analog circuit optimization system based on hybrid evolutionary algorithms.",
            "Efficient modulo 2n+1 adder architectures.",
            "Multiple block structure-preserving reduced order modeling of interconnect circuits.",
            "Fast-response low-ripple envelope follower.",
            "Thermal aware placement in 3D ICs using quadratic uniformity modeling approach.",
            "A Sigma-Delta ADC design automation tool with embedded performance estimator.",
            "Hierarchical Krylov subspace based reduction of large interconnects.",
            "Incremental analysis of large VLSI Layouts.",
            "Improved throughput bit-serial multiplier for GF(2m) fields.",
            "Simulink®-based heterogeneous multiprocessor SoC design flow for mixed hardware/software refinement and simulation.",
            "Block flipping and white space distribution for wirelength minimization.",
            "A low-power switched-current CDMA matched filter employing MOS linear matching cell with on-chip A/D converter.",
            "Solving modern mixed-size placement instances.",
            "A tunable highly linear CMOS transconductor with 80 dB of SFDR.",
            "Delay caused by resistive opens in interconnecting lines.",
            "Performance-driven scheduling of behavioural specifications.",
            "CMOS single-ended-to-differential low-noise amplifier.",
            "Timing analysis with compact variation-aware standard cell models.",
            "A dual front-end for the new GPS/GALILEO generation in a 0.35 µm SiGe process.",
            "A dual-function mixed-signal circuit for LDPC encoding/decoding.",
            "An MTCMOS technology for low-power physical design.",
            "An embedded, FPGA-based computer graphics coprocessor with native geometric algebra support.",
            "On chip novel video streaming system for bi-network multicasting protocols.",
            "Two-phase synchronization with sub-cycle latency.",
            "Genetic algorithm-based FSM synthesis with area-power trade-offs.",
            "Reducing test application time, test data volume and test power through Virtual Chain Partition.",
            "PIXAR: A performance-driven X-architecture router based on a novel multilevel framework.",
            "Statistical static timing analysis: A survey.",
            "Reducing process variation impact on replica-timed static random access memory sense timing.",
            "Handling routability in floorplan design with twin binary trees.",
            "A novel low-power full-adder cell for low voltage.",
            "Vulnerability modeling of cryptographic hardware to power analysis attacks.",
            "A variable frequency link for a power-aware network-on-chip (NoC).",
            "Designing coarse-grain reconfigurable architectures by inlining flexibility into custom arithmetic data-paths."
        ]
    },
    {
        "name": "Integration",
        "year": "2008",
        "info": "2008: Volume\n41",
        "count": 46,
        "papers": [
            "Editorial.",
            "Implementation of a thermal management unit for canceling temperature-dependent clock skew variations.",
            "Gate-level dual-threshold static power optimization methodology (GDSPOM) using path-based static timing analysis (STA) technique for SOC application.",
            "Two efficient synchronous <--> asynchronous converters well-suited for networks-on-chip in GALS architectures.",
            "Crosstalk fault modeling in defective pair of interconnects.",
            "Joint hardware-software leakage minimization approach for the register file of VLIW embedded architectures.",
            "Constant-time addition with hybrid-redundant numbers: Theory and implementations.",
            "An ASIC design and formal analysis of a novel pipelined and parallel sorting accelerator.",
            "Minimizing the dynamic and sub-threshold leakage power consumption using least leakage vector-assisted technology mapping.",
            "Exact ESCT minimization for functions of up to six input variables.",
            "Low-complexity bit-parallel systolic multipliers over GF(2m).",
            "Techniques for dual forms of Reed-Muller expansion conversion.",
            "Low-power state encoding for partitioned FSMs with mixed synchronous/asynchronous state memory.",
            "Customization of an embedded RISC CPU with SIMD extensions for video encoding: A case study.",
            "Large scale P/G grid transient simulation using hierarchical relaxed approach.",
            "A Viterbi decoder architecture for a standard-agile and reprogrammable transceiver.",
            "Buffering global interconnects in structured ASIC design.",
            "Design of high-speed two-stage cascode-compensated operational amplifiers based on settling time and open-loop parameters.",
            "On VLSI design of rank-order filtering using DCRAM architecture.",
            "An efficient terminal and model order reduction algorithm.",
            "A new approach to power estimation and reduction in CMOS digital circuits.",
            "Classification of analog synthesis tools based on their architecture selection mechanisms.",
            "On optimal ordering of signals in parallel wire bundles.",
            "Behavioral modeling, simulation and synthesis of multi-standard wireless receivers in MATLAB/SIMULINK.",
            "Allocation heuristics and defragmentation measures for reconfigurable systems management.",
            "A wide speed range and high precision position and velocity measurements chip with serial peripheral interface.",
            "Multi-bend bus driven floorplanning.",
            "Editorial.",
            "Variability in nanometer CMOS: Impact, analysis, and minimization.",
            "Network-on-Chip design and synthesis outlook.",
            "A fast congestion estimator for routing with bounded detours.",
            "Versatile multiplier architectures in GF(2k) fields using the Montgomery multiplication algorithm.",
            "A scalable LDPC decoder ASIC architecture with bit-serial message exchange.",
            "A probabilistic method to determine the minimum leakage vector for combinational designs in the presence of random PVT variations.",
            "A full-scale solution to the rectilinear obstacle-avoiding Steiner problem.",
            "Zero skew clock routing in X-architecture based on an improved greedy matching algorithm.",
            "AMOLED pixel driver circuits based on poly-Si TFTs: A comparison.",
            "Asynchronous control of modules activity in integrated systems for reducing peak temperatures.",
            "Low-power multi-core ATPG to target concurrency.",
            "Design of a systolic-pipelined architecture for real-time enhancement of color video stream based on an illuminance-reflectance model.",
            "Timing-driven via placement heuristics for three-dimensional ICs.",
            "High performance set associative translation lookaside buffers for low power microprocessors.",
            "Statistical power supply dynamic noise prediction in hierarchical power grid and package networks.",
            "A power efficient and simple scheme for dynamically biasing cascode amplifiers and telescopic op-amps.",
            "SafeResynth: A new technique for physical synthesis.",
            "Partial product reduction by using look-up tables for M×N multiplier."
        ]
    },
    {
        "name": "Integration",
        "year": "2007",
        "info": "2007: Volume\n40",
        "count": 50,
        "papers": [
            "Embedded cryptographic hardware.",
            "ASIC-hardware-focused comparison for hash functions MD5, RIPEMD-160, and SHS.",
            "Hashchip: A shared-resource multi-hash function processor architecture on FPGA.",
            "FPGA implementations of the ICEBERG block cipher.",
            "Versatile hardware architectures for GF(pm) arithmetic in public key cryptography.",
            "Efficient and secure cryptographic systems based on addition chains: Hardware design vs. software/hardware co-design.",
            "HW/SW co-design of a hyperelliptic curve cryptosystem using a microcode instruction set coprocessor.",
            "Power and electromagnetic analysis: Improved model, consequences and comparisons.",
            "Preface.",
            "Timing modeling of latch-controlled sub-systems.",
            "Architecture design of a coarse-grain reconfigurable multiply-accumulate unit for data-intensive applications.",
            "Constrained algorithmic IP design for system-on-chip.",
            "Compiling concurrent programs for embedded sequential execution.",
            "A new array architecture for signed multiplication using Gray encoded radix-2m operands.",
            "Towards generic charge-pump phase-locked loop, jitter estimation techniques using indirect on chip methods.",
            "Design and implementation of reconfigurable and flexible test access mechanism for system-on-chip.",
            "A floating gate design for electrostatic discharge protection circuits.",
            "An area-efficient timing closure technique for FPGAs using Shannon's expansion.",
            "Scheduling and optimal voltage selection with multiple supply voltages under resource constraints.",
            "Applying stochastic modeling to bus arbitration for systems-on-chip.",
            "Compiled code simulation of analog and mixed-signal systems using piecewise linear modeling of nonlinear parameters: A case study for DeltaSigma modulator simulation.",
            "Design of efficient architectures for 1-D and 2-D DLMS adaptive filters.",
            "Full-chip multilevel routing for power and signal integrity.",
            "Coprocessor design to support MPI primitives in configurable multiprocessors.",
            "An efficient quadratic placement based on search space traversing technology.",
            "VHDL-AMS based modeling and simulation of mixed-technology microsystems: a tutorial.",
            "A fast algorithm for rectilinear block packing based on selected sequence-pair.",
            "BUSpec: A framework for generation of verification aids for standard bus protocol specifications.",
            "New theoretical results on quadratic placement.",
            "On the identification of modular test requirements for low cost hierarchical test path construction.",
            "Integer linear programming and heuristic techniques for system-level low power scheduling on multiprocessor architectures under throughput constraints.",
            "Dynamic differential self-timed logic families for robust and low-power security ICs.",
            "Design of MOS transconductors with low noise and low harmonic distortion for minimum current consumption.",
            "Special issue on System-Level Interconnect Prediction.",
            "Predicting reconfigurable interconnect performance in distributed shared-memory systems.",
            "Waveform analysis and delay prediction for a CMOS gate driving RLC interconnect load.",
            "APWL-Y: An accurate and efficient wirelength estimation technique for hexagon/triangle placement.",
            "A novel net-degree distribution model and its application to floorplanning benchmark generation.",
            "Predictions of CMOS compatible on-chip optical interconnect.",
            "Substrate model extraction using finite differences and parallel multigrid.",
            "Wire shaping of RLC interconnects.",
            "LFSR multipliers over GF(2m) defined by all-one polynomial.",
            "A fast pipelined multi-mode DES architecture operating in IP representation.",
            "An efficient multiplier-less architecture for 2-D convolution with quadrant symmetric kernels.",
            "Analysis of missing and additional cell defects in sequential quantum-dot cellular automata.",
            "Partitioning-based decoupling capacitor budgeting via sequence of linear programming.",
            "Characterization, testing and reconfiguration of faults in mesh networks.",
            "Integrating firewire peripheral interface with an ethernet custom network processor.",
            "A novel IEEE rounding algorithm for high-speed floating-point multipliers.",
            "Active mode leakage reduction using fine-grained forward body biasing strategy."
        ]
    },
    {
        "name": "Integration",
        "year": "2006",
        "info": "2006: Volume\n39",
        "count": 26,
        "papers": [
            "A high-throughput, memory efficient architecture for computing the tile-based 2D discrete wavelet transform for the JPEG2000.",
            "Development of a large word-width high-speed asynchronous multiply and accumulate unit.",
            "Systolic product-sum circuit for GF((22)m) using neuron MOSFETs.",
            "A versatile Nyquist-rate A/D converter with 16-18 bit performance for sensor readout applications.",
            "Guest Editorial.",
            "Low-power design techniques for scaled technologies.",
            "Improving power-awareness of pipelined array multipliers using two-dimensional pipeline gating and its application on FIR design.",
            "Efficient system-level prototyping of power-aware dynamic memory managers for embedded systems.",
            "Low power synthesizable register files for processor and IP cores.",
            "ASLIC: A low power CMOS analog circuit design automation.",
            "A PN-based approach to the high-level synthesis of digital systems.",
            "Simulation for a novel vertical SOI configuration.",
            "An efficient estimation of the ROBDD's complexity.",
            "Systolic Galois field exponentiation in a multiple-valued logic technique.",
            "Design of a high-speed, low-noise CMOS data output buffer.",
            "Hierarchical constraint transformation based on genetic optimization for analog system synthesis.",
            "Hardware implementation of a sub-pixel algorithm for real-time saw blade deflection monitoring.",
            "FROSTY: A program for fast extraction of high-level structural representation from circuit description for industrial CMOS circuits.",
            "On whitespace and stability in physical synthesis.",
            "A parameterized graph-based framework for high-level test synthesis.",
            "Automatic generation of defect injectable VHDL fault models for ASIC standard cell libraries.",
            "Automation of clock distribution network design for digital integrated circuits using divide and conquer technique.",
            "Multilevel routing with jumper insertion for antenna avoidance.",
            "A comprehensive performance macro-modeling of on-chip RC interconnects considering line shielding effects.",
            "A coupling and crosstalk-considered timing-driven global routing algorithm for high-performance circuit design.",
            "Erratum to: \"High-speed systolic architectures for finite field inversion\" [Integration 38(3) (2005) 383-398]."
        ]
    },
    {
        "name": "Integration",
        "year": "2005",
        "info": "2005: Volumes\n38, 39",
        "count": 59,
        "papers": [
            "Guest Editorial.",
            "A study on the implementation of 2-D mesh-based networks-on-chip in the nanometre regime.",
            "Cost considerations in network on chip.",
            "Self-timed communication platform for implementing high-performance systems-on-chip.",
            "HERMES: an infrastructure for low area overhead packet-switching networks on chip.",
            "Issues in the development of a practical NoC: the Proteo concept.",
            "Run-time support for heterogeneous multitasking on reconfigurable SoCs.",
            "Methods for evaluating and covering the design space during early design development.",
            "New approach to design for reusability of arithmetic cores in systems-on-chip.",
            "Optimum wire sizing of RLC interconnect with repeaters .",
            "A programmable inductive position sensor interface circuit.",
            "A clustering- and probability-based approach for time-multiplexed FPGA partitioning.",
            "On characterization of catastrophic faults in two-dimensional VLSI arrays.",
            "Multithreshold voltage low-swing/low-voltage techniques in logic gates.",
            "A hardware version of the RSA using the Montgomery's algorithm with systolic arrays.",
            "Application of the object-oriented principles for hardware and embedded system design.",
            "An efficient architecture for lifting-based two-dimensional discrete wavelet transforms.",
            "Quality-of-service and error control techniques for mesh-based network-on-chip architectures.",
            "High-speed systolic architectures for finite field inversion.",
            "Complete automatic Q tuning system on a chip.",
            "Design and optimization of MOS current mode logic for parameter variations.",
            "Equidistance routing in high-speed VLSI layout design.",
            "Detection probabilities of interconnect breaks: an analysis.",
            "Logic-level mapping of high-level faults.",
            "Characterization of logic circuit techniques and optimization for high-leakage CMOS technologies.",
            "Optimization of the VT control method for low-power ultra-thin double-gate SOI logic circuits.",
            "Low-power branch prediction techniques for VLIW architectures: a compiler-hints based approach.",
            "A 10 GHz 4: 1 MUX and 1: 4 DEMUX implemented by a Gigahertz SiGe FPGA for fast ADC.",
            "Automatic cell placement for quantum-dot cellular automata.",
            "Novel state minimization and state assignment in finite state machine design for low-power portable devices.",
            "Ringed bit-parallel systolic multipliers over a class of fields GF(2m).",
            "A simple built-in current sensor for IDDQ testing of CMOS data converters.",
            "Multiplierless implementation of 2-D FIR filters.",
            "A high-throughput, memory efficient architecture for computing the tile-based 2D discrete wavelet transform for the JPEG2000.",
            "Development of a large word-width high-speed asynchronous multiply and accumulate unit.",
            "Systolic product-sum circuit for GF((22)m) using neuron MOSFETs.",
            "A versatile Nyquist-rate A/D converter with 16-18 bit performance for sensor readout applications.",
            "Guest Editorial.",
            "Low-power design techniques for scaled technologies.",
            "Improving power-awareness of pipelined array multipliers using two-dimensional pipeline gating and its application on FIR design.",
            "Efficient system-level prototyping of power-aware dynamic memory managers for embedded systems.",
            "Low power synthesizable register files for processor and IP cores.",
            "ASLIC: A low power CMOS analog circuit design automation.",
            "A PN-based approach to the high-level synthesis of digital systems.",
            "Simulation for a novel vertical SOI configuration.",
            "An efficient estimation of the ROBDD's complexity.",
            "Systolic Galois field exponentiation in a multiple-valued logic technique.",
            "Design of a high-speed, low-noise CMOS data output buffer.",
            "Hierarchical constraint transformation based on genetic optimization for analog system synthesis.",
            "Hardware implementation of a sub-pixel algorithm for real-time saw blade deflection monitoring.",
            "FROSTY: A program for fast extraction of high-level structural representation from circuit description for industrial CMOS circuits.",
            "On whitespace and stability in physical synthesis.",
            "A parameterized graph-based framework for high-level test synthesis.",
            "Automatic generation of defect injectable VHDL fault models for ASIC standard cell libraries.",
            "Automation of clock distribution network design for digital integrated circuits using divide and conquer technique.",
            "Multilevel routing with jumper insertion for antenna avoidance.",
            "A comprehensive performance macro-modeling of on-chip RC interconnects considering line shielding effects.",
            "A coupling and crosstalk-considered timing-driven global routing algorithm for high-performance circuit design.",
            "Erratum to: \"High-speed systolic architectures for finite field inversion\" [Integration 38(3) (2005) 383-398]."
        ]
    },
    {
        "name": "Integration",
        "year": "2004",
        "info": "2004: Volumes\n37, 38",
        "count": 49,
        "papers": [
            "Rail-to-rail constant-gm operational amplifier for video applications.",
            "Challenges and directions for testing IC.",
            "A methodology for low power scheduling with resources operating at multiple voltages.",
            "A TCAD system for VLSI implementation of the CVD process using VHDL.",
            "Direct connect device core: design and applications.",
            "Efficient scalable VLSI architecture for Montgomery inversion in GF( p).",
            "An evolutionary constraint satisfaction solution for over the cell channel routing.",
            "Optimization of NULL convention self-timed circuits.",
            "Low complexity bit-parallel systolic architecture for computing C+AB2 over a class of GF(2m).",
            "Joint channel estimation and data detection under fading on reconfigurable fabric.",
            "IP and design reuse.",
            "Safe integration of parameterized IP.",
            "Strategies for the integration of hardware and software IP components in embedded systems-on-chip.",
            "Intelligent IP retrieval driven by application requirements.",
            "Generic integration infrastructure for IP-based design processes and tools with a unified XML format.",
            "Automation of IP qualification and IP exchange.",
            "Guest Editorial.",
            "A study on the implementation of 2-D mesh-based networks-on-chip in the nanometre regime.",
            "Cost considerations in network on chip.",
            "Self-timed communication platform for implementing high-performance systems-on-chip.",
            "HERMES: an infrastructure for low area overhead packet-switching networks on chip.",
            "Issues in the development of a practical NoC: the Proteo concept.",
            "Run-time support for heterogeneous multitasking on reconfigurable SoCs.",
            "Methods for evaluating and covering the design space during early design development.",
            "New approach to design for reusability of arithmetic cores in systems-on-chip.",
            "Optimum wire sizing of RLC interconnect with repeaters .",
            "A programmable inductive position sensor interface circuit.",
            "A clustering- and probability-based approach for time-multiplexed FPGA partitioning.",
            "On characterization of catastrophic faults in two-dimensional VLSI arrays.",
            "Multithreshold voltage low-swing/low-voltage techniques in logic gates.",
            "A hardware version of the RSA using the Montgomery's algorithm with systolic arrays.",
            "Application of the object-oriented principles for hardware and embedded system design.",
            "An efficient architecture for lifting-based two-dimensional discrete wavelet transforms.",
            "Quality-of-service and error control techniques for mesh-based network-on-chip architectures.",
            "High-speed systolic architectures for finite field inversion.",
            "Complete automatic Q tuning system on a chip.",
            "Design and optimization of MOS current mode logic for parameter variations.",
            "Equidistance routing in high-speed VLSI layout design.",
            "Detection probabilities of interconnect breaks: an analysis.",
            "Logic-level mapping of high-level faults.",
            "Characterization of logic circuit techniques and optimization for high-leakage CMOS technologies.",
            "Optimization of the VT control method for low-power ultra-thin double-gate SOI logic circuits.",
            "Low-power branch prediction techniques for VLIW architectures: a compiler-hints based approach.",
            "A 10 GHz 4: 1 MUX and 1: 4 DEMUX implemented by a Gigahertz SiGe FPGA for fast ADC.",
            "Automatic cell placement for quantum-dot cellular automata.",
            "Novel state minimization and state assignment in finite state machine design for low-power portable devices.",
            "Ringed bit-parallel systolic multipliers over a class of fields GF(2m).",
            "A simple built-in current sensor for IDDQ testing of CMOS data converters.",
            "Multiplierless implementation of 2-D FIR filters."
        ]
    },
    {
        "name": "Integration",
        "year": "2003",
        "info": "2003: Volumes\n34, 35, 36",
        "count": 26,
        "papers": [
            "Hardware architectures for public key cryptography.",
            "Balanced multi-level multi-way partitioning of analog integrated circuits for hierarchical symbolic analysis.",
            "VLSI based fuzzy logic controller enabled adaptive interactive multiple model for target tracking.",
            "Systolic architectures for inversion/division using AB2 circuits in GF(2m).",
            "Pattern-based verification of connections to intellectual property cores.",
            "Variable radix-2 multibit coding for 400 Mpixel/s DCT/IDCT of HDTV video decoder.",
            "An efficient hierarchical timing-driven Steiner tree algorithm for global routing.",
            "Bit-serial architecture for rank order and stack filters.",
            "An arithmetic residue to binary conversion technique.",
            "On minimum delay clustering without replication.",
            "Low-power VLSI synthesis of DSP systems.",
            "An improved circuit-partitioning algorithm based on min-cut equivalence relation.",
            "Generation of representative input vectors for parametric designs: from low precision to high precision.",
            "Adaptable I/O pad circuit for multiple voltage units bus operation.",
            "Quaternary to binary bit conversion CMOS integrated circuit design using multiple-input floating gate MOSFETS.",
            "Synthesis of integer multipliers in sum of pseudoproducts form.",
            "FPGA implementation of a near computation free image compression scheme based on adaptive decimation.",
            "FPGA based multi-standard configurable FSK demodulator.",
            "Erratum to \"VLSI based fuzzy logic controller enabled adaptive interactive multiple model for target tracking\" [Integration 35 (2003) 1-10].",
            "Analog and mixed-signal IC design and design methodologies.",
            "1-V quasi constant-gm input/output rail-to-rail CMOS op-amp.",
            "Low-power design techniques for low-voltage fast-settling operational amplifiers in switched-capacitor applications.",
            "Performance evaluation of the low-voltage CML D-latch topology.",
            "Capacitor matching insensitive algorithmic ADC requiring no calibrations.",
            "A modem in CMOS technology for data communication on the low-voltage power line.",
            "IPRAIL - intellectual property reuse-based analog IC layout automation."
        ]
    },
    {
        "name": "Integration",
        "year": "2002",
        "info": "2002: Volumes\n31, 32, 33",
        "count": 22,
        "papers": [
            "A survey on multi-net global routing for integrated circuits.",
            "History-based dynamic BDD minimization.",
            "Floorplanning with abutment constraints based on corner block list.",
            "A parametric VLSI architecture for video motion estimation.",
            "A study about the efficiency of formal high-level synthesis applied to verification.",
            "Cell selection from technology libraries for minimizing power.",
            "Probability-driven routing in a datapath environment.",
            "A new technique for IDDQ testing in nanometer technologies.",
            "Shifts in INTEGRATION: 20 years of VLSI design.",
            "To Booth or not to Booth.",
            "Minimization of free BDDs.",
            "Verifying integrity of decision diagrams.",
            "Fault security analysis of CMOS VLSI circuits using defect-injectable VHDL models.",
            "Systolic multiplier for Montgomery's algorithm.",
            "Chip design of MFCC extraction for speech recognition.",
            "A fuzzy search block-matching chip for motion estimation.",
            "Editorial.",
            "Bit-level two's complement matrix multiplication.",
            "FAST: FFT ASIC automated synthesis.",
            "Minimization of Word-Level Decision Diagrams.",
            "A protocol converter for nonblocking protocols.",
            "A reversible carry-look-ahead adder using control gates."
        ]
    },
    {
        "name": "Integration",
        "year": "2001",
        "info": "2001: Volumes\n30, 31",
        "count": 19,
        "papers": [
            "A fast hypergraph min-cut algorithm for circuit partitioning.",
            "Redundant arithmetic, algorithms and implementations.",
            "Computation of capacitance matrix for integrated circuit interconnects using semi-analytic Green's function method.",
            "Test-set partitioning for multi-weighted random LFSRs.",
            "An FPGA systolic array using pseudo-random bit generators for computing Goldbach partitions.",
            "Management of charge pump circuits.",
            "Delay-insensitive gate-level pipelining.",
            "Frequency-dependent mutual resistance and inductance formulas for coupled IC interconnects on an Si-SiO2 substrate.",
            "Network flow based buffer planning.",
            "Enumerating catastrophic fault patterns in VLSI arrays with both uni- and bidirectional links.",
            "A bit-interleaved systolic architecture for a high-speed RSA system.",
            "A survey on multi-net global routing for integrated circuits.",
            "History-based dynamic BDD minimization.",
            "Floorplanning with abutment constraints based on corner block list.",
            "A parametric VLSI architecture for video motion estimation.",
            "A study about the efficiency of formal high-level synthesis applied to verification.",
            "Cell selection from technology libraries for minimizing power.",
            "Probability-driven routing in a datapath environment.",
            "A new technique for IDDQ testing in nanometer technologies."
        ]
    },
    {
        "name": "Integration",
        "year": "2000",
        "info": "2000: Volumes\n28, 29, 30",
        "count": 30,
        "papers": [
            "High-speed redundant reciprocal approximation.",
            "Synthesis of ASIPs for DSP algorithms.",
            "Retiming control logic.",
            "Unified data path allocation and BIST intrusion.",
            "New efficient totally self-checking Berger code checkers.",
            "OKFDD minimization by genetic algorithms with application to circuit design.",
            "Bounds, designs and layouts for multi-terminal FPIC architectures.",
            "A GA with heuristic-based decoder for IC floorplanning.",
            "A hardware implementation of realloc function.",
            "A parallel VLSI architecture of Kalman-filter-based algorithms for signal reconstruction.",
            "Performance planning.",
            "Integration of retiming with architectural floorplanning.",
            "Technology mapping for area and speed.",
            "Combinatorial cell design for CMOS libraries.",
            "Boolean function representation and spectral characterization using AND/OR graphs.",
            "An accurate model for the transient simulation of lossy interconnects based on a novel discretization formula.",
            "Delay and noise estimation of CMOS logic gates driving coupled resistive-capacitive interconnections.",
            "A dual precision IEEE floating-point multiplier.",
            "VLSI design of 1-D DWT architecture with parallel filters.",
            "A fast hypergraph min-cut algorithm for circuit partitioning.",
            "Redundant arithmetic, algorithms and implementations.",
            "Computation of capacitance matrix for integrated circuit interconnects using semi-analytic Green's function method.",
            "Test-set partitioning for multi-weighted random LFSRs.",
            "An FPGA systolic array using pseudo-random bit generators for computing Goldbach partitions.",
            "Management of charge pump circuits.",
            "Delay-insensitive gate-level pipelining.",
            "Frequency-dependent mutual resistance and inductance formulas for coupled IC interconnects on an Si-SiO2 substrate.",
            "Network flow based buffer planning.",
            "Enumerating catastrophic fault patterns in VLSI arrays with both uni- and bidirectional links.",
            "A bit-interleaved systolic architecture for a high-speed RSA system."
        ]
    },
    {
        "name": "Integration",
        "year": "1999",
        "info": "1999: Volumes\n27, 28",
        "count": 21,
        "papers": [
            "Low-power pipelined LMS adaptive filter architectures with minimal adaptation delay1.",
            "Establishing latch correspondence for sequential circuits using distinguishing signatures.",
            "Provably good moat routing.",
            "A timing-driven floorplanning algorithm with the Elmore delay model for building block layout.",
            "Maximum weighted independent sets on transitive graphs and applications1.",
            "Multi-schedule design space exploration: an alternative synthesis framework.",
            "Generating new benchmark designs using a multi-terminal net model.",
            "Timing driven cell replication during placement for cycle time optimization.",
            "Synthesis of low-power CMOS circuits using hybrid topologies.",
            "Shaping a VLSI wire to minimize Elmore delay with consideration of coupling capacitance.",
            "Assessing merged DRAM/Logic technology.",
            "High-speed redundant reciprocal approximation.",
            "Synthesis of ASIPs for DSP algorithms.",
            "Retiming control logic.",
            "Unified data path allocation and BIST intrusion.",
            "New efficient totally self-checking Berger code checkers.",
            "OKFDD minimization by genetic algorithms with application to circuit design.",
            "Bounds, designs and layouts for multi-terminal FPIC architectures.",
            "A GA with heuristic-based decoder for IC floorplanning.",
            "A hardware implementation of realloc function.",
            "A parallel VLSI architecture of Kalman-filter-based algorithms for signal reconstruction."
        ]
    },
    {
        "name": "Integration",
        "year": "1998",
        "info": "1998: Volumes\n25, 26",
        "count": 22,
        "papers": [
            "VLSI design in the 3rd dimension.",
            "Theoretical properties of LFSRs for built-in self test.",
            "Accurate and efficient power simulation strategy by compacting the input vector set.",
            "Systolic-based parallel architecture for the longest common subsequences problem.",
            "An algorithm for finding a non-trivial lower bound for channel routing1.",
            "An approximation algorithm for the register allocation problem.",
            "Comparison of the VLSI cost/performance properties of two Reed-Solomon decoding algorithms1.",
            "GreyHound: A methodology for utilizing datapath regularity in standard design flows.",
            "On the optimal four-way switch box routing structures of FPGA greedy routing architectures1.",
            "High-level synthesis techniques for functional test pattern execution1.",
            "Testing with decision diagrams.",
            "Delay fault models for VLSI circuits1.",
            "Sequential test generators: past, present and future.",
            "BIST for systems-on-a-chip.",
            "High-level test synthesis: a survey.",
            "An approach to test synthesis from higher level.",
            "FTROM: A Silicon Compiler for Fault-tolerant ROMs.",
            "Design of mixed-signal systems for testability.",
            "Mixed-signal on-chip timing measurements.",
            "IDDQ testing: state of the art and future trends.",
            "On-line testing for VLSI: state of the art and trends.",
            "A new approach in feature interaction testing."
        ]
    },
    {
        "name": "Integration",
        "year": "1997",
        "info": "1997: Volumes\n22, 23, 24",
        "count": 30,
        "papers": [
            "Retiming: Theory and practice.",
            "A real-time systolic integer multiplier.",
            "Implementing and clustering modules with complex delays.",
            "Fast analytical approximations of the transient response of coupled lossy interconnects in VLSI circuits with frequency-dependent parameters for higher hierarchical simulation levels.",
            "A new modeling technique for mixed-mode simulation of CMOS circuits.",
            "A modified noising algorithm for the graph partitioning problem.",
            "Signal compression through spatial frequency-based motion estimation.",
            "Constructing minimal spanning/Steiner trees with bounded path length.",
            "A note on architectures for large-capacity CAMs.",
            "Authors' reply to \"A note on architectures for large-capacity CAMs\".",
            "A unified approach for scheduling and allocation.",
            "Scheduling with multiple voltages.",
            "How good are slicing floorplans?",
            "A complete testing strategy based on interacting and hierarchical FSMs.",
            "An embedded CDMA-receiver A design example.",
            "Mirroring: a technique for pipelining semi-systolic and systolic arrays.",
            "A BDD-based verification method for large synthesized circuits.",
            "Accuracy and fidelity of fast net length estimates.",
            "Serial diagnostic fault simulation for synchronous sequential circuits.",
            "Content-addressable memory core cells A survey.",
            "A new approach for the design of linear systolic arrays for computing third-order cumulants.",
            "RTL verification of timed asynchronous and heterogeneous systems using symbolic model checking.",
            "A non-iterative gate resizing algorithm for high reduction in power consumption.",
            "A timing-driven placement algorithm with the Elmore delay model for row-based VLSIs.",
            "VLSI architecture and implementation for FS1016 CELP decoder with reduced power and memory requirements.",
            "State assignment based on two-dimensional placement and hypercube mapping.",
            "Overcoming chip-to-chip delays and clock skews.",
            "On retiming for FPGA logic module minimization.",
            "A graph theoretic approach to feed-through pin assignment.",
            "Modeling and designing silicon thin-film inductors and transformers using HSPICE for RFIC applications."
        ]
    },
    {
        "name": "Integration",
        "year": "1996",
        "info": "1996: Volumes\n20, 21",
        "count": 24,
        "papers": [
            "Algorithms and parallel VLSI architectures.",
            "Factored spherical subspace tracking.",
            "An algorithm and architecture based on orthonormal μ-rotations for computing the symmetric EVD.",
            "Scalable parallel processor array for Jacobi-type matrix computations.",
            "Communication code generation in systems of affine recurrence equations.",
            "A systolic algorithm for block-regularized RLS identification.",
            "The design of parallel square-root covariance Kalman filters using algorithm engineering.",
            "The Retiming Lemma: A simple proof and applications.",
            "Resource-constrained scheduling of partitioned algorithms on processor arrays.",
            "A discrete formalization of switch-level circuit behavior.",
            "An efficient lower bound algorithm for channel routing.",
            "A hybrid cellular automaton/neural network classifier for multi-valued patterns and its VLSI implementation.",
            "Technology mapping for low power in logic synthesis.",
            "An integral matrix-based technique for systematic systolic design.",
            "Simultaneous area and delay minimum K-LUT mapping for K-exact networks.",
            "FsmTest: Functional test generation for sequential circuits.",
            "On testing for catastrophic faults in reconfigurable arrays with arbitrary link redundancy.",
            "Performance optimization of VLSI interconnect layout.",
            "Built-in self-test for folded bit-line Mbit DRAMs.",
            "Synthesis of systems specified as interacting VHDL processes.",
            "Modelling, analysis and synthesis of asynchronous control circuits using Petri nets.",
            "A three-layer over-the-cell multi-channel router for a new cell model.",
            "Assignment and allocation of highly testable data paths under scan optimization.",
            "Testing CMOS combinational iterative logic arrays for realistic faults."
        ]
    },
    {
        "name": "Integration",
        "year": "1995",
        "info": "1995: Volumes\n18, 19, 20",
        "count": 33,
        "papers": [
            "Data path synthesis.",
            "On nominal delay minimization in LUT-based FPGA technology mapping.",
            "Scheduling with register constraints for DSP architectures.",
            "On the design of a high-performance, expandable, sorting engine.",
            "A dual basis bit-serial systolic multiplier for GF(2m).",
            "Architectures for large-capacity CAMs.",
            "Reliability and wirability optimizations for module placement on a convectively cooled printed wiring board.",
            "Fault tolerant arithmetic unit using duplication and residue codes.",
            "On the testability of iterative logic arrays.",
            "Recent directions in netlist partitioning: a survey.",
            "Systolic algorithms for solving a sparse system of linear equations in circuit simulation.",
            "Testing asynchronous circuits: A survey.",
            "A new approach to the multiport memory allocation problem in data path synthesis.",
            "Minimum crosstalk switchbox routing.",
            "Diagnosis of interconnects using a structured walking-1 approach.",
            "Delay fault diagnosis in sequential circuits based on path tracing.",
            "Algorithms and parallel VLSI architectures.",
            "Factored spherical subspace tracking.",
            "An algorithm and architecture based on orthonormal μ-rotations for computing the symmetric EVD.",
            "Scalable parallel processor array for Jacobi-type matrix computations.",
            "Communication code generation in systems of affine recurrence equations.",
            "A systolic algorithm for block-regularized RLS identification.",
            "The design of parallel square-root covariance Kalman filters using algorithm engineering.",
            "The Retiming Lemma: A simple proof and applications.",
            "Resource-constrained scheduling of partitioned algorithms on processor arrays.",
            "A discrete formalization of switch-level circuit behavior.",
            "An efficient lower bound algorithm for channel routing.",
            "A hybrid cellular automaton/neural network classifier for multi-valued patterns and its VLSI implementation.",
            "Technology mapping for low power in logic synthesis.",
            "An integral matrix-based technique for systematic systolic design.",
            "Simultaneous area and delay minimum K-LUT mapping for K-exact networks.",
            "FsmTest: Functional test generation for sequential circuits.",
            "On testing for catastrophic faults in reconfigurable arrays with arbitrary link redundancy."
        ]
    },
    {
        "name": "Integration",
        "year": "1994",
        "info": "1994: Volumes\n17, 18",
        "count": 23,
        "papers": [
            "Circuit delay calculation considering data dependent delays.",
            "An incremental algorithm for identification of longest (shortest) paths.",
            "(Pen)-ultimate tiling?",
            "Dingo-XT: A technology description language for analog and digital IC layout.",
            "On VLSI layouts of the star graph and related networks.",
            "Two-level logic minimization: an overview.",
            "Single phase three-layer channel routing algorithms.",
            "Genetic algorithm for test scheduling with different objectives.",
            "A computer-aided design framework for modeling and simulation of VLSI interconnections and packaging.",
            "A survey of DA techniques for PLD and FPGA based systems.",
            "On the complexity of allocation problems in high-level synthesis.",
            "Regular layouts of butterfly networks.",
            "An efficient technique for obtaining unate implementation of functions through input encoding.",
            "A backtracing-oriented procedure for the analysis of combinational gate-level designs.",
            "Data path synthesis.",
            "On nominal delay minimization in LUT-based FPGA technology mapping.",
            "Scheduling with register constraints for DSP architectures.",
            "On the design of a high-performance, expandable, sorting engine.",
            "A dual basis bit-serial systolic multiplier for GF(2m).",
            "Architectures for large-capacity CAMs.",
            "Reliability and wirability optimizations for module placement on a convectively cooled printed wiring board.",
            "Fault tolerant arithmetic unit using duplication and residue codes.",
            "On the testability of iterative logic arrays."
        ]
    },
    {
        "name": "Integration",
        "year": "1993",
        "info": "1993: Volumes\n15,\n16",
        "count": 32,
        "papers": [
            "Path-delay-fault testability properties of multiplexor-based networks.",
            "Assessing partitioning/ scheduling/storage trade-offs for regular iterative algorithms.",
            "Adaptable quad tree techniques.",
            "A hierarchy preserving hierarchical bottom-up 2-layer wiring algorithm with respect to via minimization.",
            "An integrated 2D systolic array for spelling correction.",
            "FSM decomposition for pipelined data.",
            "Efficient construction of catastrophic patterns for VLSI reconfigurable arrays.",
            "River routing and density minimization for channels with interchangeable terminals.",
            "Graph-based techniques to speed up floorplan area optimization.",
            "Fault detection in TFCMOS/DFCMOS combinational gates.",
            "Guest editors' introduction to the special issue on asynchronous systems.",
            "The design of a high-performance cache controller: a case study in asynchronous synthesis.",
            "CLASS: a CAD system for automatic synthesis and verification of asynchronous finite state machines.",
            "Design of a delay-insensitive multiply-accumulate unit.",
            "Delay-insensitive multi-ring structures.",
            "The Post Office experience: designing a large asynchronous chip.",
            "A language for designer controlled behavioral synthesis.",
            "Full-wave analysis and analytical formulas for the line parameters of transmission lines on semiconductor substrates.",
            "Necessary and sufficient conditions for the routability of classical channels.",
            "Linear test sequences for detecting functionally faulty RAM's.",
            "VLSI implementation of an M-array image filter based on shift register array.",
            "Permutation and phase independent Boolean comparison.",
            "The determination of the cycle length in high level synthesis.",
            "Insertion of jog series in layout compaction.",
            "2.0 V Bipolar/CMOS differential logic methodology for iterative network implementation.",
            "2-Dimensional minimum cost path planning using a cellular automaton architecture.",
            "Example of combined algorithm development and architecture design.",
            "Multiplication/ division/ square root module for massively parallel computers.",
            "Analysis of a linearly constrained least squares algorithm for adaptive beamforming.",
            "Parallel implementations of direction finding algorithms on networks of general purpose DSP processors.",
            "Modeling computational networks by time-varying systems.",
            "VLSI implementations of number theoretic techniques in signal processing."
        ]
    },
    {
        "name": "Integration",
        "year": "1992",
        "info": "1992: Volumes\n13,\n14",
        "count": 33,
        "papers": [
            "Boolean satisfiability and equivalence checking using general Binary Decision Diagrams.",
            "Performance of signature analysis: a survey of bounds, exact, and heuristic algorithms.",
            "Switch box routing: a retrospective.",
            "Ultrafast single phase dynamic CMOS PLA.",
            "Implementation of a fast maximum-likelihood decoding algorithm for the extended Nordstrom-Robinson code.",
            "Erratum to: Regular partitioning for synthesizing fixed-size systolic arrays.",
            "Beware the isochronic fork.",
            "An analytical investigation on the propagation delay in ring oscillators.",
            "Grid stretching algorithms for routing multiterminal nets through a rectangle.",
            "A simulated annealing multi-layer router.",
            "A fast VLSI solution for approximate string matching.",
            "Synthesis and self-test of random logic control units.",
            "Optimizing the control-unit through the resynchronization of operations.",
            "Automatic synthesis of large Moore sequencers.",
            "Allocation algorithms based on path analysis.",
            "Semi-modularity and testability of speed-independent circuits.",
            "The synthesis of control signals for one-dimensional systolic arrays.",
            "Peel-the-box: a concept of switch-box routing and tractable problems.",
            "A new algorithm for standard cell global routing.",
            "Flexible optimal channel routing for critical nets.",
            "Power/ground networks in VLSI: are general graphs better than trees?",
            "Minimizing total wire length during 1-dimensional compaction.",
            "Massive parallelism in multi-level simulation of VLSI circuits.",
            "Achieving optimality for gate matrix layout and PLA folding: a graph theoretic approach.",
            "A processor framework customized for navigation computations.",
            "Design and implementation of a totally self-checking 16 × 16 bit array multiplier.",
            "Introduction to the special issue on algorithms and architectures.",
            "Orthogonal lattice algorithms for adaptive filtering and beamforming.",
            "Refinement based techniques for mapping nested loop algorithms onto linear systolic arrays.",
            "An improved systolic algorithm for the algebraic path problem.",
            "Partitioning of processor arrays: a piecewise regular approach.",
            "Systematic serialisation of array-based architectures.",
            "Pipelined recursive filter architectures for subband image coding."
        ]
    },
    {
        "name": "Integration",
        "year": "1991",
        "info": "1991: Volumes\n10,\n11,\n12",
        "count": 57,
        "papers": [
            "Editorial.",
            "Universal syndrome-testable design of programmable logic arrays.",
            "Testable PLA design with minimal overheads.",
            "Planar subset of multi-terminal nets.",
            "A stepwise-overlapped parallel simulated annealing algorithm.",
            "A new control strategy for an artificial intelligence approach to VLSI layout compaction.",
            "A new wiring architectUre for parallel processing applications.",
            "Partitioning and floor-planning for data-path chip (microprocessor) layout.",
            "Partitioning and ordering of CMOS circuits for switch level analysis.",
            "Efficient fracturing of all angle shaped VLSI mask pattern data.",
            "Transistor sizing for large combinational digital CMOS circuits.",
            "Region definition and ordering for macrocells with unconstrained placement.",
            "iCOACH: A circuit optimization aid for CMOS high-performance circuits.",
            "Editorial.",
            "Design methodologies and CAD tools.",
            "An efficient heuristic for standard-cell placement.",
            "Optimal synthesis of control logic from behavioral specifications.",
            "An efficient macro-cell placement algorithm.",
            "A rapid turnaround design of a high speed VLSI search processor.",
            "Editorial.",
            "VLSI implementation of the capacitance matrix method.",
            "ASG: Automatic schematic generator.",
            "Sparse matrix superchip: A reconfigurable architecture for VLSI processing arrays.",
            "FLORA: A data path allocator based on branch-and-bound search.",
            "A VLSI architecture for RNS with MI adders.",
            "A new addition scheme and fast scaling factor compensation methods for CORDIC algorithms.",
            "Editorial.",
            "A 2d channel router for the diagonal model.",
            "Tree placement in Cascode-Switch macros.",
            "VYUHA: A detailed router for multiple routing models.",
            "Routing in and around a rectangle using the overlap model.",
            "VLSI implementation of a systolic database machine for relational algebra and hashing.",
            "An analytic algorithm for global circuit placement.",
            "Editorial.",
            "Minimum fault covering in reconfigurable arrays.",
            "Formally verified synthesis of combinational CMOS circuits.",
            "Testability conditions for two-dimensional bilateral arrays.",
            "Minimizing the cost of repairing WSI memories.",
            "Planar topological routing of pad nets.",
            "A logic minimization algorithm of functions with large DC-set.",
            "Scheduling under resource constraints and module assignment.",
            "A well conditioned checksum scheme for algorithmic fault tolerance.",
            "Sorting on defective VLSI-arrays.",
            "Macro-cell and module placement by genetic adaptive search with bitmap-represented chromosome.",
            "An area-efficient path memory structure for VLSI implementation of high speed Viterbi decoders.",
            "GaAs pipelined dynamic logic.",
            "An automata-theoretic approach to behavioral equivalence.",
            "Constrained resource sharing and conflict resolution in Hebe.",
            "On the analysis and optimization of selftimed processor arrays.",
            "Wiring in uniform grids and two-colorable maps.",
            "A flexible hierarchical piecewise linear simulator.",
            "On compiling behaviour to silicon: a formal language approach.",
            "New methods for coloring and clique partitioning in data path allocation.",
            "Regular partitioning for synthesizing fixed-size systolic arrays.",
            "Parallel algorithms for VLSI routing.",
            "Fast search algorithms for layout permutation problems.",
            "Minimal stretching of a layout to ensure 2-layer wirability."
        ]
    },
    {
        "name": "Integration",
        "year": "1990",
        "info": "1990: Volumes\n9,\n10",
        "count": 39,
        "papers": [
            "Editorial.",
            "Optimal gate-matrix layout of CMOS functional cells.",
            "A metal - metal matrix cell generator for multi-level metal MOS technology.",
            "Switch-level testability of the dynamic CMOS PLA.",
            "Cell matrix methodologies for integrated circuit design.",
            "Editorial.",
            "Testing of non-feedback bridging faults.",
            "A VLSI system for string matching.",
            "VLSI architectures to compute the Wigner Distribution.",
            "An optimum channel routing algorithm in the restricted wire overlap model.",
            "Compaction of CD(2k - D) control unit architectures.",
            "Generating more compactable channel routing solutions.",
            "Editorial.",
            "Automating the design of systolic arrays.",
            "PLA logic minimization by simulated annealing.",
            "A new algorithm for tile generation.",
            "An efficient algorithm for optimal PLA folding.",
            "The systolic control ring instruction processor (SCRIP).",
            "VLSI implementation of a 16-state coset code.",
            "Switch-level simulation based on local decisions.",
            "Editorial.",
            "Universal syndrome-testable design of programmable logic arrays.",
            "Testable PLA design with minimal overheads.",
            "Planar subset of multi-terminal nets.",
            "A stepwise-overlapped parallel simulated annealing algorithm.",
            "A new control strategy for an artificial intelligence approach to VLSI layout compaction.",
            "A new wiring architectUre for parallel processing applications.",
            "Partitioning and floor-planning for data-path chip (microprocessor) layout.",
            "Partitioning and ordering of CMOS circuits for switch level analysis.",
            "Efficient fracturing of all angle shaped VLSI mask pattern data.",
            "Transistor sizing for large combinational digital CMOS circuits.",
            "Region definition and ordering for macrocells with unconstrained placement.",
            "iCOACH: A circuit optimization aid for CMOS high-performance circuits.",
            "Editorial.",
            "Design methodologies and CAD tools.",
            "An efficient heuristic for standard-cell placement.",
            "Optimal synthesis of control logic from behavioral specifications.",
            "An efficient macro-cell placement algorithm.",
            "A rapid turnaround design of a high speed VLSI search processor."
        ]
    },
    {
        "name": "Integration",
        "year": "1989",
        "info": "1989: Volumes\n7,\n8",
        "count": 40,
        "papers": [
            "Editorial.",
            "A new 3-layer rectilinear area router with obstacle avoidance.",
            "Incremental algorithms for digital simulation.",
            "An algorithm for computing the signal propagation on lossy VLSI interconnect systems in the time domain.",
            "A new model for computation of probabilistic testability in combinational circuits.",
            "VLSI implementation of a digital image threshold selection architecture.",
            "Editorial.",
            "A VLSI router design for hypercube multiprocessors.",
            "A reconfigurable wiring algorithm for three-layer maze routing.",
            "SPYDER: a serial/parallel goal-directed router.",
            "An enhanced bottom-up algorithm for floorplan design.",
            "Editorial.",
            "A note on hierarchical layer-assignment.",
            "Fast algorithm for optimal layer assignment.",
            "Formal specification and verification of microprocessor systems.",
            "Selecting test methodologies for PLAs and random logic modules in VLSI circuits - an expert systems approach.",
            "A hardware accelerator for hierarchical VLSI routing.",
            "Test generation and fault detection for VLSI PPL circuits.",
            "A new model for computation of probabilistic testability in combinational circuits.",
            "Editorial.",
            "Architectural design and realization of a single-chip Viterbi decoder.",
            "Switchbox routing using score function.",
            "Feed-through river routing.",
            "CMOS VLSI circuits of pipeline sections for 32 and 64-point Fermat number transformers.",
            "Systolic block LU decompositions.",
            "Editorial.",
            "Operators allocation in the silicon compiler SCOOP.",
            "Stretching and three-layer wiring planar layouts.",
            "Channel routing for strictly multiterminal nets.",
            "VLSI computing architectures for Ising model simulation.",
            "Efficient false path elimination algorithms for timing verification by event graph preprocessing.",
            "A microprogrammable processor using single poly EPROM.",
            "Editorial.",
            "HOP: A process model for synchronous hardware; semantics and experiments in process composition.",
            "Power routing in channelless floorplan layouts.",
            "On a new class of C-testable systolic arrays.",
            "Bisection trees and half-quad trees: Memory and time efficient data structures for VLSI layout editors.",
            "VLSI design of an FFT processor network.",
            "Two terminal channel routing using at most density plus two tracks.",
            "Multi-dimensional parallel computing structures for regular iterative algorithms."
        ]
    },
    {
        "name": "Integration",
        "year": "1988",
        "info": "1988: Volume\n6",
        "count": 17,
        "papers": [
            "Editorial.",
            "Maximizing pin alignment in semi-custom chip circuit layout.",
            "Optimal two-terminal α-β wire routing.",
            "Implementing probabilistic algorithms on VLSI architectures.",
            "VLSI layout of binary tree structures.",
            "A 16-bit specialized processor design.",
            "ALSO: A system for chip floorplan design.",
            "SAMURAI: A general and efficient simulated-annealing schedule with fully adaptive annealing parameters.",
            "Rasterization theory, architectures, and implementations for a class of two-dimensional problems.",
            "On the bit complexity of parallel computations.",
            "A practical IC design system for VLSI technology.",
            "A corner-based hierarchical circuit extractor.",
            "Reconfiguration of hexagonal arrays by diagonal deletion.",
            "An algorithm for polygon conversion to boxes for VLSI layouts.",
            "A graph-based heuristic channel router.",
            "A hardware accelerator for two-dimensional image analysis.",
            "A closer look at VLSI multiplication."
        ]
    },
    {
        "name": "Integration",
        "year": "1987",
        "info": "1987: Volume\n5",
        "count": 23,
        "papers": [
            "Editorial.",
            "A global router based on a multicommodity flow model.",
            "Algorithms for permutation channel routing.",
            "Expandable arithmetic block macrocell.",
            "SYSIM: a simulation tool for systolic processors.",
            "A compact and modular VLSI design for the solution of general sparse linear systems.",
            "Editorial.",
            "Combinational static CMOS networks.",
            "Guest editorial.",
            "VLSI with a very low scale investment.",
            "Microprogramming implementation of timed Petri nets.",
            "Semantics of a hardware specification language and related transformation rules.",
            "A high speed 2-D discrete cosine transform chip.",
            "Integrated FIR median hybrid filter.",
            "Editorial.",
            "About folded-PLA area and folding evaluation.",
            "An effective algorithm for optimal PLA column folding.",
            "A bottom-up layout technique based on two-rectangle routing.",
            "VLSI computations: from physics to algorithms.",
            "Evaluation of a prototype VLSI tester.",
            "Design rule checking and VLSI.",
            "Applications of computational geometry to VLSI layout pattern design.",
            "New algorithms for increased efficiency in hierarchical design rule checking."
        ]
    },
    {
        "name": "Integration",
        "year": "1986",
        "info": "1986: Volume\n4",
        "count": 26,
        "papers": [
            "Editorial.",
            "MASHER: An automatic VLSI layout system.",
            "SPICE Rack - the newsletter of the SPICE users group : Volume 4, number 1, fall 1985.",
            "Yield optimization in wafer scale circuits with hierarchical redundancies.",
            "Automatic determination of signal flow through MOS transistor networks.",
            "The instruction systolic array - a parallel architecture for VLSI.",
            "Signal resynchronization in VLSI systems.",
            "Editorial.",
            "On the models for designing VLSI asynchronous digital systems.",
            "An automatic cell pattern generation system for CMOS transistor-pair array LSI.",
            "VLSI architecture for device simulation.",
            "On minimizing memory in systolic arrays for the dynamic time warping algorithm.",
            "Contributions to VLSI computational complexity theory from bounds on current density.",
            "Information flow in VLSI design.",
            "The SPIRIT of ESPRIT.",
            "\"X/OPEN Portability Guide\" by the X/OPEN Group, from: Elsevier SciencePublishers B.V., Book Order Department, P.O. Box 211, 1000 AE Amsterdam, The Netherlands.",
            "\"Introduction to nMOS and cMOS VLSI Systems Design\" by Amar Mukherjee, from: Prentice-Hall, Englewood Cliffs, NJ 07632, U.S.A..",
            "Parallel implementations of the statistical cooling algorithm.",
            "Fast execution for circuit consistency verification.",
            "Lower bounds for VLSI implementation of residue number system architectures.",
            "Computer algebra and logic programming.",
            "Editorial.",
            "Compacted channel routing with via placement restrictions.",
            "An analysis of ternary simulation as a tool for race detection in digital MOS circuits.",
            "PLA implementation of a differential predictive coder for digital television signals.",
            "An O(n) algorithm for width determination of power/ground routes for VLSI circuits."
        ]
    },
    {
        "name": "Integration",
        "year": "1985",
        "info": "1985: Volume\n3",
        "count": 23,
        "papers": [
            "Editorial.",
            "Test generation by activation and defect-drive (TEGAD).",
            "Formal semantics for a symbolic IC design technique: Examples and applications.",
            "Interval-graph-based PLA folding.",
            "A flexible bottom-up approach for layout generation.",
            "Editorial.",
            "Top-down design of a VLSI digital filter bank.",
            "Automatic design rule adaptation of leaf cell layouts.",
            "ACE: A congestion estimator for wiring custom chips.",
            "A greedy switch-box router.",
            "Editorial.",
            "The multiple-processor PPS chip of the NON-VON 3 supercomputer.",
            "Architectures for language recognition.",
            "Some results on the design of regular structured sequential circuits.",
            "VLSI implementation of iterative methods for the solution of linear systems.",
            "A router for channels of nonuniform width containing preplaced wiring and obstacles.",
            "FSPICE: a tool for fault modelling in MOS circuits.",
            "Editorial.",
            "Component placement in VLSI circuits using a constant pressure Monte Carlo method.",
            "Heuristic circuit simulation using PROLOG.",
            "A single-chip adaptive delta modulator with optimum performance.",
            "SPLASH: A framework for chip design and layout.",
            "Access to rows and columns of a rectangular array in a concentricloop bubble memory."
        ]
    },
    {
        "name": "Integration",
        "year": "1984",
        "info": "1984: Volume\n2",
        "count": 20,
        "papers": [
            "NORCHIP, a silicon brokers model.",
            "On programming VLSI concurrent array processors.",
            "PLMAP - A piecewise linear MOS circuit analysis program.",
            "Test generation through logic programming.",
            "Editorial.",
            "VLSI circuit reconstruction from mask topology.",
            "An heuristic SPICE2-based approach for 2D IIL device simulation.",
            "A fast near optimum VLSI implementation of FFT using residue number systems.",
            "Optimization of programmable logic arrays.",
            "AT2-optimal VLSI integer division and integer square rooting.",
            "Editorial.",
            "A VLSI model for residue number system architectures.",
            "A recursive design methodology for VLSI: Theory and example.",
            "DIF: A framework for VLSI multi-level representation.",
            "On a case of symbiosis between systolic arrays.",
            "Editorial.",
            "Maximizing pin alignment by pin permutations.",
            "Testable design of large random access memories.",
            "VLSI parallel shift sort algorithm and design.",
            "On improving the quality of simple graphics."
        ]
    },
    {
        "name": "Integration",
        "year": "1983",
        "info": "1983: Volume\n1",
        "count": 21,
        "papers": [
            "Editorial.",
            "VLSI physics.",
            "Hierarchical channel router.",
            "A very fast multiplication algorithm for VLSI implementation.",
            "lambda, an integrated master-slice LSI CAD system.",
            "A function-independent self-test for large programmable logic arrays.",
            "Logic gate characterization through ringoscillators.",
            "Editorial.",
            "An autolayout system for a hierarchical i.c. design environment.",
            "Circal: A calculus for circuit description.",
            "A proof rule for restoring logic circuits.",
            "An algorithm for optimal two-dimensional compaction of VLSI layouts.",
            "Detection and identification of input/output stuck-at and bridging faults in combinational and sequential VLSI networks by universal tests.",
            "VLSI systolic arrays for band matrix multiplication.",
            "Editorial.",
            "A systolic VLSI matrix for a family of fundamental searching problems.",
            "Microelectronic architectures and devices for signal and symbol processing.",
            "An architecture for a VLSI FFT processor.",
            "An area-time efficient NMOS adder.",
            "Design methodology for full custom CMOS microcomputers.",
            "Spice Rack."
        ]
    }
]