[
    {
        "year": "2021",
        "name": "48th ISCA 2021",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2021",
                "sub_name": "48th ACM/IEEE Annual International Symposium on Computer Architecture, ISCA 2021, Valencia, Spain, June 14-18, 2021.",
                "count": 81,
                "papers": [
                    "Ten Lessons From Three Generations Shaped Google's TPUv4i : Industrial Product.",
                    "Sparsity-Aware and Re-configurable NPU Architecture for Samsung Flagship Mobile SoC.",
                    "Energy Efficiency Boost in the AI-Infused POWER10 Processor.",
                    "Hardware Architecture and Software Stack for PIM Based on Commercial DRAM Technology : Industrial Product.",
                    "Pioneering Chiplet Technology and Design for the AMD EPYC™ and Ryzen™ Processor Families : Industrial Product.",
                    "Zero Inclusion Victim: Isolating Core Caches from Inclusive Last-level Cache Evictions.",
                    "Exploiting Page Table Locality for Agile TLB Prefetching.",
                    "A Cost-Effective Entangling Prefetcher for Instructions.",
                    "Don't Forget the I/O When Allocating Your LLC.",
                    "PF-DRAM: A Precharge-Free DRAM Structure.",
                    "Efficient Multi-GPU Shared Memory via Automatic Optimization of Fine-Grained Transfers.",
                    "RaPiD: AI Accelerator for Ultra-low Precision Training and Inference.",
                    "REDUCT: Keep it Close, Keep it Cool! : Efficient Scaling of DNN Inference on Multi-core CPUs with Near-Cache Compute.",
                    "Communication Algorithm-Architecture Co-Design for Distributed Deep Learning.",
                    "Vector Runahead.",
                    "Unlimited Vector Extension with Data Streaming Support.",
                    "Speculative Vectorisation with Selective Replay.",
                    "ABC-DIMM: Alleviating the Bottleneck of Communication in DIMM-based Near-Memory Processing with Inter-DIMM Broadcast.",
                    "Sieve: Scalable In-situ DRAM-based Accelerator Designs for Massively Parallel k-mer Matching.",
                    "FORMS: Fine-grained Polarized ReRAM-based In-situ Computation for Mixed-signal DNN Accelerator.",
                    "BOSS: Bandwidth-Optimized Search Accelerator for Storage-Class Memory.",
                    "SATORI: Efficient and Fair Resource Partitioning by Sacrificing Short-Term Benefits for Long-Term Gains*.",
                    "Confidential Serverless Made Efficient with Plug-In Enclaves.",
                    "Flex: High-Availability Datacenters With Zero Reserved Power.",
                    "BlockMaestro: Enabling Programmer-Transparent Task-based Execution in GPU Systems.",
                    "Opening Pandora's Box: A Systematic Study of New Ways Microarchitecture Can Leak Private Data.",
                    "I See Dead µops: Leaking Secrets via Intel/AMD Micro-Op Caches.",
                    "TimeCache: Using Time to Eliminate Cache Side Channels when Sharing Software.",
                    "Accelerated Seeding for Genome Sequence Alignment with Enumerated Radix Trees.",
                    "Aurochs: An Architecture for Dataflow Threads.",
                    "PipeZK: Accelerating Zero-Knowledge Proof with a Pipelined Architecture.",
                    "Taming the Zoo: The Unified GraphIt Compiler Framework for Novel Architectures.",
                    "Supporting Legacy Libraries on Non-Volatile Memory: A User-Transparent Approach.",
                    "Execution Dependence Extension (EDE): ISA Support for Eliminating Fences.",
                    "Hetero-ViTAL: A Virtualization Stack for Heterogeneous FPGA Clusters.",
                    "CODIC: A Low-Cost Substrate for Enabling Custom In-DRAM Functionalities and Optimizations.",
                    "NVOverlay: Enabling Efficient and Scalable High-Frequency Snapshotting to NVM.",
                    "Rebooting Virtual Memory with Midgard.",
                    "Dvé: Improving DRAM Reliability and Performance On-Demand via Coherent Replication.",
                    "Enabling Compute-Communication Overlap in Distributed Deep Learning Training Platforms.",
                    "CoSA: Scheduling by Constrained Optimization for Spatial Accelerators.",
                    "η-LSTM: Co-Designing Highly-Efficient Large LSTM Training via Exploiting Memory-Saving and Architectural Design Opportunities.",
                    "FlexMiner: A Pattern-Aware Accelerator for Graph Pattern Mining.",
                    "PolyGraph: Exposing the Value of Flexibility for Graph Processing Accelerators.",
                    "Large-Scale Graph Processing on FPGAs with Caches for Thousands of Simultaneous Misses.",
                    "Cost-Efficient Overclocking in Immersion-Cooled Datacenters.",
                    "CryoGuard: A Near Refresh-Free Robust DRAM Design for Cryogenic Computing.",
                    "Superconducting Computing with Alternating Logic Elements.",
                    "Failure Sentinels: Ubiquitous Just-in-time Intermittent Computation via Low-cost Hardware Support for Voltage Monitoring.",
                    "SPACE: Locality-Aware Processing in Heterogeneous Memory for Personalized Recommendations.",
                    "ELSA: Hardware-Software Co-design for Efficient, Lightweight Self-Attention Mechanism in Neural Networks.",
                    "Cambricon-Q: A Hybrid Architecture for Efficient Training.",
                    "TENET: A Framework for Modeling Tensor Dataflow Based on Relation-centric Notation.",
                    "Ripple: Profile-Guided Instruction Cache Replacement for Data Center Applications.",
                    "Quantifying Server Memory Frequency Margin and Using It to Improve Performance in HPC Systems.",
                    "Revamping Storage Class Memory With Hardware Automated Memory-Over-Storage Solution.",
                    "NASGuard: A Novel Accelerator Architecture for Robust Neural Architecture Search (NAS) Networks.",
                    "NASA: Accelerating Neural Network Design with a NAS Processor.",
                    "PMNet: In-Network Data Persistence.",
                    "Exploiting Long-Distance Interactions and Tolerating Atom Loss in Neutral Atom Quantum Architectures.",
                    "Software-Hardware Co-Optimization for Computational Chemistry on Superconducting Quantum Processors.",
                    "Designing Calibration and Expressivity-Efficient Instruction Sets for Quantum Computing.",
                    "Albireo: Energy-Efficient Acceleration of Convolutional Neural Networks via Silicon Photonics.",
                    "INTROSPECTRE: A Pre-Silicon Framework for Discovery and Analysis of Transient Execution Vulnerabilities.",
                    "Maya: Using Formal Control to Obfuscate Power Side Channels.",
                    "Demystifying the System Vulnerability Stack: Transient Fault Effects Across the Layers.",
                    "No-FAT: Architectural Support for Low Overhead Memory Safety Checks.",
                    "Ghost Routing to Enable Oblivious Computation on Memory-centric Networks.",
                    "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips.",
                    "A RISC-V in-network accelerator for flexible high-performance low-power packet processing.",
                    "Leaky Buddies: Cross-Component Covert Channels on Integrated CPU-GPU Systems.",
                    "IChannels: Exploiting Current Management Mechanisms to Create Covert Channels in Modern Processors.",
                    "ZeRØ: Zero-Overhead Resilient Operation Under Pointer Integrity Attacks.",
                    "NN-Baton: DNN Workload Orchestration and Chiplet Granularity Exploration for Multichip Accelerators.",
                    "Snafu: An Ultra-Low-Power, Energy-Minimal CGRA-Generation Framework and Architecture.",
                    "SARA: Scaling a Reconfigurable Dataflow Accelerator.",
                    "HASCO: Towards Agile HArdware and Software CO-design for Tensor Computation.",
                    "SpZip: Architectural Support for Effective Data Compression In Irregular Applications.",
                    "Dual-side Sparse Tensor Core.",
                    "RingCNN: Exploiting Algebraically-Sparse Ring Tensors for Energy-Efficient CNN-Based Computational Imaging.",
                    "GoSPA: An Energy-efficient High-performance Globally Optimized SParse Convolutional Neural Network Accelerator."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "47th ISCA 2020",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2020",
                "sub_name": "47th ACM/IEEE Annual International Symposium on Computer Architecture, ISCA 2020, Valencia, Spain, May 30 - June 3, 2020.",
                "count": 82,
                "papers": [
                    "Data Compression Accelerator on IBM POWER9 and z15 Processors : Industrial Product.",
                    "High-Performance Deep-Learning Coprocessor Integrated into x86 SoC with Server-Class CPUs Industrial Product.",
                    "The IBM z15 High Frequency Mainframe Branch Predictor Industrial Product.",
                    "Evolution of the Samsung Exynos CPU Microarchitecture.",
                    "Xuantie-910: A Commercial Multi-Core 12-Stage Pipeline Out-of-Order 64-bit High Performance RISC-V Processor with Vector Extension : Industrial Product.",
                    "Divide and Conquer Frontend Bottleneck.",
                    "Focused Value Prediction* : Concepts, techniques and implementations presented in this paper are subject matter of pending patent applications, which have been filed by Intel Corporation.",
                    "Auto-Predication of Critical Branches.",
                    "Slipstream Processors Revisited: Exploiting Branch Sets.",
                    "Bouquet of Instruction Pointers: Instruction Pointer Classifier-based Spatial Hardware Prefetching.",
                    "MuonTrap: Preventing Cross-Domain Spectre-Like Attacks by Capturing Speculative State.",
                    "Think Fast: A Tensor Streaming Processor (TSP) for Accelerating Deep Learning Workloads.",
                    "T4: Compiling Sequential Code for Effective Speculative Parallelization in Hardware.",
                    "Efficiently Supporting Dynamic Task Parallelism on Heterogeneous Cache-Coherent Systems.",
                    "Flick: Fast and Lightweight ISA-Crossing Call for Heterogeneous-ISA Environments.",
                    "The NEBULA RPC-Optimized Architecture.",
                    "Printed Microprocessors.",
                    "SysScale: Exploiting Multi-domain Dynamic Voltage and Frequency Scaling for Energy Efficient Mobile Processors.",
                    "Déjà View: Spatio-Temporal Compute Reuse for' Energy-Efficient 360° VR Video Streaming.",
                    "Genesis: A Hardware Acceleration Framework for Genomic Data Analysis.",
                    "DSAGEN: Synthesizing Programmable Spatial Accelerators.",
                    "Bonsai: High-Performance Adaptive Merge Tree Sorting.",
                    "SOFF: An OpenCL High-Level Synthesis Framework for FPGAs.",
                    "Gorgon: Accelerating Machine Learning from Relational Data.",
                    "A Specialized Architecture for Object Serialization with Applications to Big Data Analytics.",
                    "CryoCore: A Fast and Dense Processor Architecture for Cryogenic Computing.",
                    "SpinalFlow: An Architecture and Dataflow Tailored for Spiking Neural Networks.",
                    "NEBULA: A Neuromorphic Spin-Based Ultra-Low Power Architecture for SNNs and ANNs.",
                    "UGEMM: Unary Computing Architecture for GEMM Applications.",
                    "Hardware-Software Co-Design for Brain-Computer Interfaces.",
                    "Heat to Power: Thermal Energy Harvesting and Recycling for Warm Water-Cooled Datacenters.",
                    "GraphABCD: Scaling Out Graph Analytics with Asynchronous Block Coordinate Descent.",
                    "GaaS-X: Graph Analytics Accelerator Supporting Sparse Data Representation using Crossbar Architectures.",
                    "MLPerf Inference Benchmark.",
                    "Mocktails: Capturing the Memory Behaviour of Proprietary Mobile Architectures.",
                    "Accel-Sim: An Extensible Simulation Framework for Validated GPU Modeling.",
                    "HyperTRIO: Hyper-Tenant Translation of I/O Addresses.",
                    "BabelFish: Fusing Address Translations for Containers.",
                    "Enhancing and Exploiting Contiguity for Fast Memory Virtualization.",
                    "Architecting Noisy Intermediate-Scale Trapped Ion Quantum Computers.",
                    "AccQOC: Accelerating Quantum Optimal Control Based Pulse Generation.",
                    "NISQ+: Boosting quantum computing power by approximating quantum error correction.",
                    "SQUARE: Strategic Quantum Ancilla Reuse for Modular Quantum Programs via Cost-Effective Uncomputation.",
                    "HOOP: Efficient Hardware-Assisted Out-of-Place Update for Non-Volatile Memory.",
                    "Lelantus: Fine-Granularity Copy-On-Write Operations for Secure Non-Volatile Memories.",
                    "MorLog: Morphable Hardware Logging for Atomic Persistence in Non-Volatile Main Memory.",
                    "TVARAK: Software-Managed Hardware Offload for Redundancy in Direct-Access NVM Storage.",
                    "Revisiting RowHammer: An Experimental Analysis of Modern DRAM Devices and Mitigation Techniques.",
                    "Relaxed Persist Ordering Using Strand Persistency.",
                    "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off.",
                    "Hardware-Based Domain Virtualization for Intra-Process Isolation of Persistent Memory Objects.",
                    "Check-In: In-Storage Checkpointing for Key-Value Store System Leveraging Flash-Based SSDs.",
                    "Speculative Data-Oblivious Execution: Mobilizing Safe Prediction For Safe and Efficient Speculative Execution.",
                    "Packet Chasing: Spying on Network Packets over a Cache Side-Channel.",
                    "Compact Leakage-Free Support for Integrity and Reliability.",
                    "A Bus Authentication and Anti-Probing Architecture Extending Hardware Trusted Computing Base Off CPU Chips and Beyond.",
                    "CHEx86: Context-Sensitive Enforcement of Memory Safety via Microcode-Enabled Capabilities.",
                    "Nested Enclave: Supporting Fine-grained Hierarchical Isolation with SGX.",
                    "RecNMP: Accelerating Personalized Recommendation with Near-Memory Processing.",
                    "iPIM: Programmable In-Memory Image Processing Accelerator Using Near-Bank Architecture.",
                    "Near Data Acceleration with Concurrent Host Access.",
                    "Timely: Pushing Data Movements And Interfaces In Pim Accelerators Towards Local And In Time Domain.",
                    "Hyper-Ap: Enhancing Associative Processing Through A Full-Stack Optimization.",
                    "JPEG-ACT: Accelerating Deep Learning via Transform-based Lossy Compression.",
                    "TransForm: Formally Specifying Transistency Models and Synthesizing Enhanced Litmus Tests.",
                    "HieraGen: Automated Generation of Concurrent, Hierarchical Cache Coherence Protocols.",
                    "Tailored Page Sizes.",
                    "Perforated Page: Supporting Fragmented Memory Allocation for Large Pages.",
                    "Buddy Compression: Enabling Larger Memory for Deep Learning and HPC Workloads on GPUs.",
                    "A Multi-Neural Network Acceleration Architecture.",
                    "SmartExchange: Trading Higher-cost Memory Storage/Access for Lower-cost Computation.",
                    "Centaur: A Chiplet-based, Hybrid Sparse-Dense Accelerator for Personalized Recommendations.",
                    "DeepRecSys: A System for Optimizing End-To-End At-Scale Neural Recommendation Inference.",
                    "An In-Network Architecture for Accelerating Shared-Memory Multiprocessor Collectives.",
                    "DRQ: Dynamic Region-based Quantization for Deep Neural Network Acceleration.",
                    "Independent Forward Progress of Work-groups.",
                    "ScoRD: A Scoped Race Detector for GPUs.",
                    "The Virtual Block Interface: A Flexible Alternative to the Conventional Virtual Memory Framework.",
                    "ZnG: Architecting GPU Multi-Processors with New Flash for Scalable Data Analysis.",
                    "Commutative Data Reordering: A New Technique to Reduce Data Movement Energy on Sparse Inference Workloads.",
                    "Echo: Compiler-based GPU Memory Footprint Reduction for LSTM RNN Training.",
                    "A Case for Hardware-Based Demand Paging."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "46th ISCA 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2019",
                "sub_name": "Proceedings of the 46th International Symposium on Computer Architecture, ISCA 2019, Phoenix, AZ, USA, June 22-26, 2019.",
                "count": 61,
                "papers": [
                    "Perceptron-based prefetch filtering.",
                    "Post-silicon CPU adaptation made practical using machine learning.",
                    "Bit-level perceptron prediction for indirect branches.",
                    "Generative and multi-phase learning for computer systems optimization.",
                    "OO-VR: NUMA friendly object-oriented VR rendering framework for future NUMA-based multi-GPU systems.",
                    "PES: proactive event scheduling for responsive and energy-efficient mobile web computing.",
                    "Energy-efficient video processing for virtual reality.",
                    "Triad-NVM: persistency for integrity-protected and encrypted non-volatile memories.",
                    "GraphSSD: graph semantics aware SSD.",
                    "CROW: a low-cost substrate for improving DRAM performance, energy efficiency, and reliability.",
                    "Janus: optimizing memory and storage support for non-volatile memory systems.",
                    "Anubis: ultra-low overhead and recovery time for secure non-volatile memories.",
                    "Emerald: graphics modeling for SoC systems.",
                    "Linebacker: preserving victim cache lines in idle register files of GPUs.",
                    "MGPUSim: enabling multi-GPU performance modeling and optimization.",
                    "Opportunistic computing in GPU architectures.",
                    "Interplay between hardware prefetcher and page eviction policy in CPU-GPU unified virtual memory.",
                    "Sparse ReRAM engine: joint exploration of activation and weight sparsity in compressed neural networks.",
                    "MnnFast: a fast and scalable system architecture for memory-augmented neural networks.",
                    "TIE: energy-efficient tensor train-based inference engine for deep neural network.",
                    "Accelerating distributed reinforcement learning with in-switch computing.",
                    "Eager pruning: algorithm and architecture support for fast training of deep neural networks.",
                    "Laconic deep learning inference acceleration.",
                    "MicroScope: enabling microarchitectural replay attacks.",
                    "SecDir: a secure directory to defeat directory side-channel attacks.",
                    "Secure TLBs.",
                    "New attacks and defense for encrypted-address cache.",
                    "InvisiPage: oblivious demand paging for secure enclaves.",
                    "TWiCe: preventing row-hammering by exploiting time window counters.",
                    "Duality cache for data parallel acceleration.",
                    "Adaptive memory-side last-level GPU caching.",
                    "SCU: a GPU stream compaction unit for graph processing.",
                    "Filter caching for free: the untapped potential of the store-buffer.",
                    "Efficient metadata management for irregular data prefetching.",
                    "AsmDB: understanding and mitigating front-end stalls in warehouse-scale computers.",
                    "Fine-grained warm water cooling for improving datacenter economy.",
                    "DeepAttest: an end-to-end attestation framework for deep neural networks.",
                    "TPShare: a time-space sharing scheduling abstraction for shared cloud via vertical labels.",
                    "SoftSKU: optimizing server architectures for microservice diversity @scale.",
                    "Full-stack, real-system quantum computer studies: architectural comparisons and design insights.",
                    "Statistical assertions for validating patterns and finding bugs in quantum programs.",
                    "Asymptotic improvements to quantum circuits via qutrits.",
                    "A stochastic-computing based deep learning framework using adiabatic quantum-flux-parametron superconducting technology.",
                    "A quantum computational compiler and design tool for technology-specific targets.",
                    "IntelliNoC: a holistic design framework for energy-efficient and reliable on-chip communication for manycores.",
                    "HALO: accelerating flow classification for scalable packet processing in NFV.",
                    "Scalable interconnects for reconfigurable spatial architectures.",
                    "CoNDA: efficient cache coherence support for near-data accelerators.",
                    "Designing vertical processors in monolithic 3D.",
                    "Time squeezing for tiny devices.",
                    "XPC: architectural support for secure and efficient cross process call.",
                    "AxMemo: hardware-compiler co-design for approximate code memoization.",
                    "Translation ranger: operating system support for contiguity-aware TLBs.",
                    "Bouncer: static program analysis in hardware.",
                    "Efficient invisible speculative execution through selective delay and value prediction.",
                    "Stream-based memory access specialization for general purpose processors.",
                    "Using SMT to accelerate nested virtualization.",
                    "Master of none acceleration: a comparison of accelerator architectures for analytical query processing.",
                    "Cryogenic computer architecture modeling with memory-side case studies.",
                    "Cambricon-F: machine learning computers with fractal von neumann architecture.",
                    "FloatPIM: in-memory acceleration of deep neural network training with high precision."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2019",
                "sub_name": "Proceedings of the Workshop on Computer Architecture Education, WCAE@ISCA 2019, Phoenix, AZ, USA, June 22, 2019.",
                "count": 9,
                "papers": [
                    "The BRISC-V Platform: A Practical Teaching Approach for Computer Architecture.",
                    "The Davis In-Order (DINO) CPU: A Teaching-focused RISC-V CPU Design.",
                    "WebRISC-V: a Web-Based Education-Oriented RISC-V Pipeline Simulation Environment.",
                    "Teaching Heterogeneous Computing with System-Level Design Methods.",
                    "Exposing Abstraction-Level Interactions with a Parallel Ray Tracer.",
                    "PyRTL in Early Undergraduate Research.",
                    "gemOS: Bridging the Gap between Architecture and Operating System in Computer System Education.",
                    "An Emphasis on Memory and Processor Interactions in Undergraduate Computer Architecture Education.",
                    "Parallel Computing At The Undergraduate Level: Lessons Learned and Insights."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2019hasp",
                "sub_name": "Proceedings of the 8th International Workshop on Hardware and Architectural Support for Security and Privacy, HASP@ISCA 2019, June 23, 2019.",
                "count": 8,
                "papers": [
                    "Detecting Non-Control-Flow Hijacking Attacks Using Contextual Execution Information.",
                    "Cracking Randomized Coalescing Techniques with An Efficient Profiling-Based Side-Channel Attack to GPU.",
                    "CoWLight: Hardware Assisted Copy-on-Write Fault Handling for Secure Deduplication.",
                    "Position Paper: Progressive Memory Safety for WebAssembly.",
                    "EA-PLRU: Enclave-Aware Cache Replacement.",
                    "Scaling Intel® Software Guard Extensions Applications with Intel® SGX Card.",
                    "SecChisel Framework for Security Verification of Secure Processor Architectures.",
                    "Security Analysis of Processor Instruction Set Architecture for Enforcing Control-Flow Integrity."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "45th ISCA 2018",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2018",
                "sub_name": "45th ACM/IEEE Annual International Symposium on Computer Architecture, ISCA 2018, Los Angeles, CA, USA, June 1-6, 2018.",
                "count": 64,
                "papers": [
                    "A Configurable Cloud-Scale DNN Processor for Real-Time AI.",
                    "Virtual Melting Temperature: Managing Server Load to Minimize Cooling Overhead with Phase Change Materials.",
                    "FireSim: FPGA-Accelerated Cycle-Exact Scale-Out System Simulation in the Public Cloud.",
                    "PROMISE: An End-to-End Design of a Programmable Mixed-Signal Accelerator for Machine-Learning Algorithms.",
                    "Computation Reuse in DNNs by Exploiting Input Similarity.",
                    "GenAx: A Genome Sequencing Accelerator.",
                    "Division of Labor: A More Effective Approach to Prefetching.",
                    "Criticality Aware Tiered Cache Hierarchy: A Fundamental Relook at Multi-Level Cache Hierarchies.",
                    "Rethinking Belady's Algorithm to Accommodate Prefetching.",
                    "Constructing a Weak Memory Model.",
                    "A Hardware Accelerator for Tracing Garbage Collection.",
                    "Charm: A Language for Closed-Form High-Level Architecture Modeling.",
                    "Get Out of the Valley: Power-Efficient Address Mapping for GPUs.",
                    "Scheduling Page Table Walks for Irregular GPU Applications.",
                    "SEESAW: Using Superpages to Improve VIPT Caches.",
                    "A Case for Richer Cross-Layer Abstractions: Bridging the Semantic Gap with Expressive Memory.",
                    "Non-Speculative Store Coalescing in Total Store Order.",
                    "Dynamic Memory Dependence Predication.",
                    "ProtoGen: Automatically Generating Directory Cache Coherence Protocols from Atomic Specifications.",
                    "Spandex: A Flexible Interface for Efficient Heterogeneous Coherence.",
                    "Flexon: A Flexible Digital Neuron for Efficient Spiking Neural Network Simulations.",
                    "Space-Time Algebra: A Model for Neocortical Computation.",
                    "Architecting a Stochastic Computing Unit with Molecular Optical Devices.",
                    "Density Tradeoffs of Non-Volatile Memory as a Replacement for SRAM Based Last Level Cache.",
                    "ACCORD: Enabling Associativity for Gigascale DRAM Caches by Coordinating Way-Install and Way-Prediction.",
                    "RANA: Towards Efficient Neural Acceleration with Refresh-Optimized Embedded DRAM.",
                    "Scaling Datacenter Accelerators with Compute-Reuse Architectures.",
                    "Enabling Scientific Computing on Memristive Accelerators.",
                    "Neural Cache: Bit-Serial In-Cache Acceleration of Deep Neural Networks.",
                    "FLIN: Enabling Fairness and Enhancing Performance in Modern NVMe Solid State Drives.",
                    "GraFBoost: Using Accelerated Flash Storage for External Graph Analytics.",
                    "2B-SSD: The Case for Dual, Byte- and Block-Addressable Solid-State Drives.",
                    "Lazy Persistency: A High-Performing and Write-Efficient Software Persistency Technique.",
                    "DHTM: Durable Hardware Transactional Memory.",
                    "Hardware Supported Permission Checks on Persistent Objects for Performance and Programmability.",
                    "RoboX: An End-to-End Solution to Accelerate Autonomous Control in Robotics.",
                    "DCS-ctrl: A Fast and Flexible Device-Control Mechanism for Device-Centric Server Architecture.",
                    "Yukta: Multilayer Resource Controllers to Maximize Efficiency.",
                    "Exploring Predictive Replacement Policies for Instruction Cache and Branch Target Buffer.",
                    "EVA2: Exploiting Temporal Redundancy in Live Computer Vision.",
                    "Euphrates: Algorithm-SoC Co-Design for Low-Power Mobile Continuous Vision.",
                    "Guaranteeing Local Differential Privacy on Ultra-Low-Power Systems.",
                    "Stitch: Fusible Heterogeneous Accelerators Enmeshed with Many-Core Architecture for Wearables.",
                    "Nonblocking Memory Refresh.",
                    "Practical Memory Safety with REST.",
                    "Mitigating Wordline Crosstalk Using Adaptive Trees of Counters.",
                    "Mobilizing the Micro-Ops: Exploiting Context Sensitive Decoding for Security and Energy Efficiency.",
                    "Hiding Intermittent Information Leakage with Architectural Support for Blinking.",
                    "GANAX: A Unified MIMD-SIMD Acceleration for Generative Adversarial Networks.",
                    "SnaPEA: Predictive Early Activation for Reducing Computation in Deep Convolutional Neural Networks.",
                    "UCNN: Exploiting Computational Reuse in Deep Neural Networks via Weight Repetition.",
                    "Energy-Efficient Neural Network Accelerator Based on Outlier-Aware Low-Precision Computation.",
                    "Synchronized Progress in Interconnection Networks (SPIN): A New Theory for Deadlock Freedom.",
                    "TCEP: Traffic Consolidation for Energy-Proportional High-Radix Networks.",
                    "Modular Routing Design for Chiplet-Based Systems.",
                    "FastTrack: Leveraging Heterogeneous FPGA Wires to Design Low-Cost High-Performance Soft NoCs.",
                    "Prediction Based Execution on Deep Neural Networks.",
                    "Bit Fusion: Bit-Level Dynamically Composable Architecture for Accelerating Deep Neural Network.",
                    "Gist: Efficient Data Encoding for Deep Neural Network Training.",
                    "The Dark Side of DNN Pruning.",
                    "HetCore: TFET-CMOS Hetero-Device Architecture for CPUs and GPUs.",
                    "RegMutex: Inter-Warp GPU Register Time-Sharing.",
                    "The Locality Descriptor: A Holistic Cross-Layer Abstraction to Express Data Locality In GPUs.",
                    "Generic System Calls for GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2018hasp",
                "sub_name": "Proceedings of the 7th International Workshop on Hardware and Architectural Support for Security and Privacy, HASP@ISCA 2018, Los Angeles, CA, USA, June 02-02, 2018.",
                "count": 10,
                "papers": [
                    "NIGHTs-WATCH: a cache-based side-channel intrusion detector using hardware performance counters.",
                    "Cache timing side-channel vulnerability checking with computation tree logic.",
                    "BASTION-SGX: bluetooth and architectural support for trusted I/O on SGX.",
                    "An MLP-aware leakage-free memory controller.",
                    "Spectres, virtual ghosts, and hardware support.",
                    "SMARTS: secure memory assurance of RISC-V trusted SoC.",
                    "Rapid detection of rowhammer attacks using dynamic skewed hash tree.",
                    "A case for exposing extra-architectural state in the ISA: position paper.",
                    "A comparison study of intel SGX and AMD memory encryption technology.",
                    "Fault injection attacks on emerging non-volatile memory and countermeasures."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "44th ISCA 2017",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2017",
                "sub_name": "Proceedings of the 44th Annual International Symposium on Computer Architecture, ISCA 2017, Toronto, ON, Canada, June 24-28, 2017.",
                "count": 54,
                "papers": [
                    "In-Datacenter Performance Analysis of a Tensor Processing Unit.",
                    "ScaleDeep: A Scalable Compute Architecture for Learning and Evaluating Deep Networks.",
                    "SCNN: An Accelerator for Compressed-sparse Convolutional Neural Networks.",
                    "Bespoke Processors for Applications with Ultra-low Area and Power Constraints.",
                    "A Programmable Galois Field Processor for the Internet of Things.",
                    "XPro: A Cross-End Processing Architecture for Data Analytics in Wearables.",
                    "Regaining Lost Cycles with HotCalls: A Fast Interface for SGX Secure Enclaves.",
                    "InvisiMem: Smart Memory Defenses for Memory Bus Side Channel.",
                    "ObfusMem: A Low-Overhead Access Obfuscation for Trusted Memories.",
                    "ThermoGater: Thermally-Aware On-Chip Voltage Regulation.",
                    "PowerChief: Intelligent Power Allocation for Multi-Stage Applications to Improve Responsiveness on Power Constrained CMP.",
                    "CHARSTAR: Clock Hierarchy Aware Resource Scaling in Tiled ARchitectures.",
                    "Chasing Away RAts: Semantics and Evaluation for Relaxed Atomics on Heterogeneous Systems.",
                    "Hiding the Long Latency of Persist Barriers Using Speculative Execution.",
                    "Non-Speculative Load-Load Reordering in TSO.",
                    "MTraceCheck: Validating Non-Deterministic Behavior of Memory Consistency Models in Post-Silicon Validation.",
                    "Redundant Memory Array Architecture for Efficient Selective Protection.",
                    "Clank: Architectural Support for Intermittent Computation.",
                    "MeRLiN: Exploiting Dynamic Instruction Behavior for Fast and Accurate Microarchitecture Level Reliability Assessment.",
                    "The Reach Profiler (REAPER): Enabling the Mitigation of DRAM Retention Failures via Profiling at Aggressive Conditions.",
                    "Quality of Service Support for Fine-Grained Sharing on GPUs.",
                    "Accelerating GPU Hardware Transactional Memory with Snapshot Isolation.",
                    "Decoupled Affine Computation for SIMT GPUs.",
                    "Access Pattern-Aware Cache Management for Improving Data Utilization in GPU.",
                    "MCM-GPU: Multi-Chip-Module GPUs for Continued Performance Scalability.",
                    "EDDIE: EM-Based Detection of Deviations in Program Execution.",
                    "Secure Hierarchy-Aware Cache Replacement Policy (SHARP): Defending Against Cache-Based Side Channel Attacks.",
                    "Lemonade from Lemons: Harnessing Device Wearout to Create Limited-Use Security Architectures.",
                    "LogCA: A High-Level Performance Model for Hardware Accelerators.",
                    "Plasticine: A Reconfigurable Architecture For Parallel Paterns.",
                    "A Programmable Hardware Accelerator for Simulating Dynamical Systems.",
                    "Stream-Dataflow Acceleration.",
                    "Hardware Translation Coherence for Virtualized Systems.",
                    "Hybrid TLB Coalescing: Improving TLB Translation Coverage under Diverse Fragmented Memory Allocations.",
                    "Do-It-Yourself Virtual Memory Translation.",
                    "Rethinking TLB Designs in Virtualized Environments: A Very Large Part-of-Memory TLB.",
                    "Language-level persistency.",
                    "ShortCut: Architectural Support for Fast Object Access in Scripting Languages.",
                    "Architectural Support for Server-Side PHP Processing.",
                    "HeteroOS: OS Design for Heterogeneous Memory Management in Datacenter.",
                    "Maximizing CNN Accelerator Efficiency Through Resource Partitioning.",
                    "Scalpel: Customizing DNN Pruning to the Underlying Hardware Parallelism.",
                    "Understanding and Optimizing Asynchronous Low-Precision Stochastic Gradient Descent.",
                    "Aggressive Pipelining of Irregular Applications on Reconfigurable Hardware.",
                    "Fractal: An Execution Model for Fine-Grain Nested Speculative Parallelism.",
                    "Parallel Automata Processor.",
                    "Viyojit: Decoupling Battery and DRAM Capacities for Battery-Backed DRAM.",
                    "DICE: Compressing DRAM Caches for Bandwidth and Capacity.",
                    "The Mondrian Data Engine.",
                    "Jenga: Software-Defined Cache Hierarchies.",
                    "APPROX-NoC: A Data Approximation Framework for Network-On-Chip Architectures.",
                    "There and Back Again: Optimizing the Interconnect in Networks of Memory Cubes.",
                    "Footprint: Regulating Routing Adaptiveness in Networks-on-Chip.",
                    "EbDa: A New Theory on Design and Verification of Deadlock-free Interconnection Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2017hasp",
                "sub_name": "Proceedings of the Hardware and Architectural Support for Security and Privacy, HASP@ISCA 2017, Toronto, ON, Canada, June 25, 2017.",
                "count": 8,
                "papers": [
                    "A Lightweight AES Implementation Against Bivariate First-Order DPA Attacks.",
                    "Shakti-T: A RISC-V Processor with Light Weight Security Extensions.",
                    "Host-Based Dos Attacks and Defense in the Cloud.",
                    "SeM: A CPU Architecture Extension for Secure Remote Computing.",
                    "Lightweight Block Cipher Circuits for Automotive and IoT Sensor Devices.",
                    "Position Paper: Challenges Towards Securing Hardware-assisted Execution Environments.",
                    "Intel® Software Guard Extensions (Intel® SGX) Architecture for Oversubscription of Secure Memory in a Virtualized Environment.",
                    "HA2lloc: Hardware-Assisted Secure Allocator."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2017timl",
                "sub_name": "Proceedings of the Workshop on Trends in Machine-Learning (and impact on computer architecture), TIML@ISCA 2017, Toronto, ON, Canada, June 25, 2017.",
                "count": 13,
                "papers": [
                    "Introduction to the workshop on trends in machine learning.",
                    "Efficient methods and hardware for deep learning.",
                    "Enhancing human capabilities.",
                    "Machine learning on the edge.",
                    "Towards more hardware-friendly deep learning.",
                    "All I want for Christmas... is a CUDA ASIC.",
                    "Toward visual intelligence.",
                    "An end to end IR stack for deep learning systems.",
                    "Learning to co-design.",
                    "Memory bandwidth in deep learning hardware.",
                    "ML computation patterns in production systems.",
                    "Snowflake: deep neural network accelerator.",
                    "The road to exascale AI."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "43rd ISCA 2016",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2016",
                "sub_name": "43rd ACM/IEEE Annual International Symposium on Computer Architecture, ISCA 2016, Seoul, South Korea, June 18-22, 2016.",
                "count": 57,
                "papers": [
                    "Cnvlutin: Ineffectual-Neuron-Free Deep Neural Network Computing.",
                    "ISAAC: A Convolutional Neural Network Accelerator with In-Situ Analog Arithmetic in Crossbars.",
                    "PRIME: A Novel Processing-in-Memory Architecture for Neural Network Computation in ReRAM-Based Main Memory.",
                    "Asymmetry-Aware Work-Stealing Runtimes.",
                    "Morpheus: Creating Application Objects Efficiently for Heterogeneous Computing.",
                    "Towards Statistical Guarantees in Controlling Quality Tradeoffs for Approximate Acceleration.",
                    "Back to the Future: Leveraging Belady's Algorithm for Improved Cache Replacement.",
                    "Efficient Synonym Filtering and Scalable Delayed Translation for Hybrid Virtual Caching.",
                    "LAP: Loop-Block Aware Inclusion Properties for Energy-Efficient Asymmetric Last Level Caches.",
                    "Automatic Generation of Efficient Accelerators for Reconfigurable Hardware.",
                    "Strober: Fast and Accurate Sample-Based Energy Simulation for Arbitrary RTL.",
                    "PowerChop: Identifying and Managing Non-critical Units in Hybrid Processor Architectures.",
                    "Biscuit: A Framework for Near-Data Processing of Big Data Workloads.",
                    "Energy Efficient Architecture for Graph Analytics Accelerators.",
                    "ASIC Clouds: Specializing the Datacenter.",
                    "APRES: Improving Cache Efficiency by Exploiting Load Characteristics on GPUs.",
                    "Transparent Offloading and Mapping (TOM): Enabling Programmer-Transparent Near-Data Processing in GPU Systems.",
                    "Warped-Slicer: Efficient Intra-SM Slicing through Dynamic Resource Partitioning for GPU Multiprogramming.",
                    "EIE: Efficient Inference Engine on Compressed Deep Neural Network.",
                    "RedEye: Analog ConvNet Image Sensor Architecture for Continuous Mobile Vision.",
                    "Minerva: Enabling Low-Power, Highly-Accurate Deep Neural Network Accelerators.",
                    "Opportunistic Competition Overhead Reduction for Expediting Critical Section in NoC Based CMPs.",
                    "Short-Circuit Dispatch: Accelerating Virtual Machine Interpreters on Embedded Processors.",
                    "ARM Virtualization: Performance and Architectural Implications.",
                    "Base-Victim Compression: An Opportunistic Cache Compression Architecture.",
                    "Bit-Plane Compression: Transforming Data for Better Compression in Many-Core Architectures.",
                    "XED: Exposing On-Die Error Detection Information for Strong Memory Reliability.",
                    "Production-Run Software Failure Diagnosis via Adaptive Communication Tracking.",
                    "Eyeriss: A Spatial Architecture for Energy-Efficient Dataflow for Convolutional Neural Networks.",
                    "Neurocube: A Programmable Digital Neuromorphic Architecture with High-Density 3D Memory.",
                    "Cambricon: An Instruction Set Architecture for Neural Networks.",
                    "Decoupling Loads for Nano-Instruction Set Computers.",
                    "Future Vector Microprocessor Extensions for Data Aggregations.",
                    "Efficiently Scaling Out-of-Order Cores for Simultaneous Multithreading.",
                    "Accelerating Dependent Cache Misses with an Enhanced Memory Controller.",
                    "Treadmill: Attributing the Source of Tail Latency through Precise Load Testing and Statistical Inference.",
                    "Dynamo: Facebook's Data Center-Wide Power Management System.",
                    "Peak Efficiency Aware Scheduling for Highly Energy Proportional Servers.",
                    "Power Attack Defense: Securing Battery-Backed Data Centers.",
                    "DRAF: A Low-Power DRAM-Based Reconfigurable Acceleration Fabric.",
                    "Mellow Writes: Extending Lifetime in Resistive Memories through Selective Slow Write Backs.",
                    "MITTS: Memory Inter-arrival Time Traffic Shaping.",
                    "The Anytime Automaton.",
                    "Accelerating Markov Random Field Inference Using Molecular Optical Gibbs Sampling Units.",
                    "Evaluation of an Analog Accelerator for Linear Algebra.",
                    "LaPerm: Locality Aware Scheduler for Dynamic Parallelism on GPUs.",
                    "ActivePointers: A Case for Software Address Translation on GPUs.",
                    "Virtual Thread: Maximizing Thread-Level Parallelism beyond GPU Scheduling Limit.",
                    "All-Inclusive ECC: Thorough End-to-End Protection for Reliable Computer Memory.",
                    "Rescuing Uncorrectable Fault Patterns in On-Chip Memories through Error Pattern Transformation.",
                    "RelaxFault Memory Repair.",
                    "Using Multiple Input, Multiple Output Formal Control to Maximize Resource Efficiency in Architectures.",
                    "Exploiting Dynamic Timing Slack for Energy Efficiency in Ultra-Low-Power Embedded Systems.",
                    "CASH: Supporting IaaS Customers with a Sub-core Configurable Architecture.",
                    "Boosting Access Parallelism to PCM-Based Main Memory.",
                    "Agile Paging: Exceeding the Best of Nested and Shadow Paging.",
                    "Energy Efficient Data Encoding in DRAM Channels Exploiting Data Value Similarity."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2016hasp",
                "sub_name": "Proceedings of the Hardware and Architectural Support for Security and Privacy 2016, HASP@ICSA 2016, Seoul, Republic of Korea, June 18, 2016.",
                "count": 11,
                "papers": [
                    "Using Scan Side Channel for Detecting IP Theft.",
                    "Can Data-Only Exploits be Detected at Runtime Using Hardware Events?: A Case Study of the Heartbleed Vulnerability.",
                    "SoK: A Study of Using Hardware-assisted Isolated Execution Environments for Security.",
                    "SIMD Instruction Set Extensions for Keccak with Applications to SHA-3, Keyak and Ketje.",
                    "Architectural Supports to Protect OS Kernels from Code-Injection Attacks.",
                    "A Formal Security Analysis of Even-Odd Sequential Prefetching in Profiled Cache-Timing Attacks.",
                    "Template Attacks with Partial Profiles and Dirichlet Priors: Application to Timing Attacks.",
                    "FAME: Fault-attack Aware Microprocessor Extensions for Hardware Fault Detection and Software Fault Response.",
                    "Implicit Sensor-based Authentication of Smartphone Users with Smartwatch.",
                    "Intel® Software Guard Extensions (Intel® SGX) Support for Dynamic Memory Management Inside an Enclave.",
                    "Intel® Software Guard Extensions (Intel® SGX) Software Support for Dynamic Memory Allocation inside an Enclave."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2016mes",
                "sub_name": "Proceedings of the Fourth ACM International Workshop on Many-core Embedded Systems, MES@ISCA 2016, Seoul, Republic of Korea, June 19, 2016.",
                "count": 5,
                "papers": [
                    "The SiLago Method: Next Generation VLSI Architectures and Design Methods.",
                    "Highly Concurrent Stream Synchronization in Many-core Embedded Systems.",
                    "Vector Processors for Energy-Efficient Embedded Systems.",
                    "VisualNoC: A Visualization and Evaluation Environment for Simulation and Mapping.",
                    "Dataflow Implementation of QR Decomposition on a Manycore."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "42nd ISCA 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2015",
                "sub_name": "Proceedings of the 42nd Annual International Symposium on Computer Architecture, Portland, OR, USA, June 13-17, 2015.",
                "count": 58,
                "papers": [
                    "BlueDBM: an appliance for big data analytics.",
                    "Towards sustainable in-situ server systems in the big data era.",
                    "DjiNN and Tonic: DNN as a service and its implications for future warehouse scale computers.",
                    "A case for core-assisted bottleneck acceleration in GPUs: enabling flexible data compression with assist warps.",
                    "Harmonia: balancing compute and memory power in high-performance GPUs.",
                    "Redundant memory mappings for fast access to large memories.",
                    "Page overlays: an enhanced virtual memory framework to enable fine-grained memory management.",
                    "ShiDianNao: shifting vision processing closer to the sensor.",
                    "A scalable processing-in-memory accelerator for parallel graph processing.",
                    "Efficient execution of memory access phases using dataflow specialization.",
                    "Data reorganization in memory using 3D-stacked DRAM.",
                    "Quantitative comparison of hardware transactional memory for Blue Gene/Q, zEnterprise EC12, Intel Core, and POWER8.",
                    "Profiling a warehouse-scale computer.",
                    "Computer performance microscopy with Shim.",
                    "Flexible software profiling of GPU architectures.",
                    "BEAR: techniques for mitigating bandwidth bloat in gigascale DRAM caches.",
                    "A fully associative, tagless DRAM cache.",
                    "Multiple clone row DRAM: a low latency and area optimized DRAM.",
                    "Flexible auto-refresh: enabling scalable and energy-efficient DRAM refresh reductions.",
                    "Cost-effective speculative scheduling in high performance processors.",
                    "LaZy superscalar.",
                    "The load slice core microarchitecture.",
                    "Semantic locality and context-based prefetching using reinforcement learning.",
                    "Exploring the potential of heterogeneous von neumann/dataflow execution models.",
                    "SHRINK: reducing the ISA complexity via instruction recycling.",
                    "Branch vanguard: decomposing branch functionality into prediction and resolution instructions.",
                    "PIM-enabled instructions: a low-overhead, locality-aware processing-in-memory architecture.",
                    "SLIP: reducing wire energy in the memory hierarchy.",
                    "CloudMonatt: an architecture for security health monitoring and attestation of virtual machines in cloud computing.",
                    "Reducing world switches in virtualized environment with flexible cross-world calls.",
                    "ArMOR: defending against memory consistency model mismatches in heterogeneous architectures.",
                    "Clean: a race detector with cleaner semantics.",
                    "MiSAR: minimalistic synchronization accelerator with resource overflow management.",
                    "Callback: efficient synchronization without invalidation with a directory just for spin-waiting.",
                    "Thermal time shifting: leveraging phase change materials to reduce cooling costs in warehouse-scale computers.",
                    "Heracles: improving resource efficiency at scale.",
                    "HEB: deploying and managing hybrid energy buffers for improving datacenter efficiency and economy.",
                    "Architecting to achieve a billion requests per second throughput on a single key-value store server platform.",
                    "A variable warp size architecture.",
                    "Warped-compression: enabling power efficient GPUs through register compression.",
                    "CAWA: coordinated warp scheduling and cache prioritization for critical warp acceleration of GPGPU workloads.",
                    "Dynamic thread block launch: a lightweight execution mechanism to support irregular applications on GPUs.",
                    "DynaSpAM: dynamic spatial architecture mapping using out of order instruction schedules.",
                    "Rumba: an online quality management system for approximate computing.",
                    "Manycore network interfaces for in-memory rack-scale computing.",
                    "Unified address translation for memory-mapped SSDs with FlashMap.",
                    "FASE: finding amplitude-modulated side-channel emanations.",
                    "Probable cause: the deanonymizing effects of approximate DRAM.",
                    "PrORAM: dynamic prefetcher for oblivious RAM.",
                    "MBus: an ultra-low power interconnect bus for next generation nanopower systems.",
                    "Accelerating asynchronous programs through event sneak peek.",
                    "VIP: virtualizing IP chains on handheld platforms.",
                    "FaultHound: value-locality-based soft-fault tolerance.",
                    "COP: to compress and protect main memory.",
                    "Hi-fi playback: tolerating position errors in shift operations of racetrack memory.",
                    "Stash: have your scratchpad and cache it too.",
                    "Coherence protocol for transparent management of scratchpad memories in shared memory manycore architectures.",
                    "Fusion: design tradeoffs in coherent cache hierarchies for accelerators."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2015mes",
                "sub_name": "Proceedings of the 3rd International Workshop on Many-core Embedded Systems (MES'2015) held on June 13, 2015 in conjunction with the 42nd International Symposium on Computer Architecture (ISCA'2015), Portland, OR, USA.",
                "count": 8,
                "papers": [
                    "On the Feasibility of Advanced Cache Indexing for High-Performance and Energy-Efficient GPGPU Computing.",
                    "A Design Methodology for Performance Maintenance of 3D Network-on-Chip with Multiplexed Through-Silicon Vias.",
                    "SoPHy: A Software Platform for Hybrid Resource Management of Homogeneous Many-core Accelerators.",
                    "FOLCS: A Lightweight Implementation of a Cycle-accurate NoC Simulator on FPGAs.",
                    "Improved Route Selection Approaches using Q-learning framework for 2D NoCs.",
                    "Parallel Programming Model for the Epiphany Many-Core Coprocessor Using Threaded MPI.",
                    "Hardware Scheduler Performance on the Plural Many-Core Architecture.",
                    "Investigating the Viability of Maximum Flexibility Selection Function in Bufferless 2D Meshes."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2015hasp",
                "sub_name": "Proceedings of the Fourth Workshop on Hardware and Architectural Support for Security and Privacy, HASP@ISCA 2015, Portland, OR, USA, June 14, 2015.",
                "count": 10,
                "papers": [
                    "Side-channel analysis of MAC-Keccak hardware implementations.",
                    "Support vector regression: exploiting machine learning techniques for leakage modeling.",
                    "Towards a practical solution to detect code reuse attacks on ARM mobile devices.",
                    "Can randomized mapping secure instruction caches from side-channel attacks?",
                    "Covert channels through branch predictors: a feasibility study.",
                    "Exploring the performance implications of memory safety primitives in many-core processors executing multi-threaded workloads.",
                    "Exploiting small leakages in masks to turn a second-order attack into a first-order attack.",
                    "Hardware overhead analysis of programmability in ARX crypto processing.",
                    "Predicting program phases and defending against side-channel attacks using hardware performance counters.",
                    "Performance optimizations of integrity checking based on Merkle trees."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2015",
                "sub_name": "Proceedings of the Workshop on Computer Architecture Education, WCAE@ISCA 2015, Portland, Oregon, USA, June 13, 2015.",
                "count": 10,
                "papers": [
                    "Tareador: a tool to unveil parallelization strategies at undergraduate level.",
                    "An extensible simulator for bus- and directory-based cache coherence.",
                    "Visualization of OpenCL application execution on CPU-GPU systems.",
                    "PyCompArch: python-based modules for exploring computer architecture concepts.",
                    "Keeping old computers alive for deeper understanding of computer architecture.",
                    "Adopting new learning strategies for computer architecture in higher education: case study: building the S3 microprocessor in 24 hours.",
                    "Using surface-mount components in an embedded systems lab.",
                    "Towards teaching embedded parallel computing: an analytical approach.",
                    "Engaging sophomores in embedded design using robotics.",
                    "Constructive computer architecture."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "41st ISCA 2014",
        "info": "Minneapolis, MN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2014",
                "sub_name": "ACM/IEEE 41st International Symposium on Computer Architecture, ISCA 2014, Minneapolis, MN, USA, June 14-18, 2014.",
                "count": 46,
                "papers": [
                    "Unifying on-chip and inter-node switching within the Anton 2 network.",
                    "A reconfigurable fabric for accelerating large-scale datacenter services.",
                    "SCORPIO: A 36-core research chip demonstrating snoopy coherence on a scalable mesh NoC with in-network ordering.",
                    "Avoiding core's DUE & SDC via acoustic wave detectors and tailored error containment and recovery.",
                    "MemGuard: A low cost and energy efficient design to support and enhance memory system reliability.",
                    "GangES: Gang error simulation for hardware resiliency evaluation.",
                    "Real-world design and evaluation of compiler-managed GPU redundant multithreading.",
                    "ArchRanker: A ranking approach to design space exploration.",
                    "Aladdin: A pre-RTL, power-performance accelerator simulator enabling large design space exploration of customized architectures.",
                    "SynFull: Synthetic traffic models capturing cache coherent behaviour.",
                    "Harnessing ISA diversity: Design of a heterogeneous-ISA chip multiprocessor.",
                    "Navigating the cache hierarchy with a single lookup.",
                    "SC2: A statistical compression cache scheme.",
                    "The Dirty-Block Index.",
                    "Going vertical in memory management: Handling multiplicity by multi-policy.",
                    "Fine-grain task aggregation and coordination on GPUs.",
                    "Enabling preemptive multiprogramming on GPUs.",
                    "Single-graph multiple flows: Energy efficient design alternative for GPGPUs.",
                    "HELIX-RC: An architecture-compiler co-design for automatic parallelization of irregular programs.",
                    "Efficient digital neurons for large scale cortical architectures.",
                    "An examination of the architecture and system-level tradeoffs of employing steep slope devices in 3D CMPs.",
                    "STAG: Spintronic-Tape Architecture for GPGPU cache hierarchies.",
                    "Memory persistency.",
                    "Reducing access latency of MLC PCMs through line striping.",
                    "HIOS: A host interface I/O scheduler for Solid State Disks.",
                    "Towards energy proportionality for large-scale latency-critical workloads.",
                    "SleepScale: Runtime joint speed scaling and sleep states management for power efficient data centers.",
                    "Optimizing virtual machine consolidation performance on NUMA server architecture for cloud workloads.",
                    "Row-buffer decoupling: A case for low-latency DRAM microarchitecture.",
                    "Half-DRAM: A high-bandwidth and low-power DRAM architecture from the rethinking of fine-grained activation.",
                    "Flipping bits in memory without accessing them: An experimental study of DRAM disturbance errors.",
                    "Architecture implications of pads as a scarce resource.",
                    "Increasing off-chip bandwidth in multi-core processors with switchable pins.",
                    "A low power and reliable charge pump design for Phase Change Memories.",
                    "Fractal++: Closing the performance gap between fractal and conventional coherence.",
                    "OmniOrder: Directory-based conflict serialization of transactions.",
                    "Pacifier: Record and replay for relaxed-consistency multiprocessors with distributed directory protocol.",
                    "Replay debugging: Leveraging record and replay for program debugging.",
                    "The CHERI capability model: Revisiting RISC in an age of risk.",
                    "CODOMs: Protecting software with Code-centric memory Domains.",
                    "EOLE: Paving the way for an effective implementation of value prediction.",
                    "Improving the energy efficiency of Big Cores.",
                    "General-purpose code acceleration with limited-precision analog computation.",
                    "Race Logic: A hardware acceleration for dynamic programming algorithms.",
                    "Eliminating redundant fragment shader executions on a mobile GPU via hardware memoization.",
                    "WebCore: Architectural support for mobile Web browsing."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2014mes",
                "sub_name": "Proceedings of the 2nd International Workshop on Many-core Embedded Systems, MES'2014, in conjunction with the 41st International Symposium on Computer Architecture, ISCA'2014, Minneapolis, MN, USA, June 15, 2014.",
                "count": 11,
                "papers": [
                    "Adaptive Cache Bypass and Insertion for Many-core Accelerators.",
                    "On the Relevance of Architectural Awareness for Efficient Fork/Join Support on Cluster-Based Manycores.",
                    "A Low-resource and Scalable Strategy for Segment Partitioning of Many-core Nano Networks.",
                    "A Stream Buffer Mechanism for Pervasive Splitting Transformations on Polyhedral Process Networks.",
                    "A Virtualization Framework for IOMMU-less Many-Core Accelerators.",
                    "Acceleration of Software Transactional Memory through Hardware Clock.",
                    "Adaptive Compute-phase Prediction and Thread Prioritization to Mitigate Memory Access Latency.",
                    "A GALS Router for Asynchronous Network-on-Chip.",
                    "Hardware Threading Techniques for Multi-Threaded MPSoCs.",
                    "A Closed Loop Control based Power Manager for WiNoC Architectures.",
                    "Exploring Spiking Neural Network on Coarse-Grain Reconfigurable Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2014hasp",
                "sub_name": "HASP 2014, Hardware and Architectural Support for Security and Privacy, Minneapolis, MN, USA, June 15, 2014.",
                "count": 11,
                "papers": [
                    "An algorithm for detecting contention-based covert timing channels on shared hardware.",
                    "Constructing timing-based covert channels in mobile networks by adjusting CPU frequency.",
                    "Morpheus: benchmarking computational diversity in mobile malware.",
                    "The role of the fault model in DFA against AES.",
                    "Seasoning effect based side channel attacks to AES implementation with phase change memory.",
                    "Side channel analysis on an embedded hardware fingerprint biometric comparator & low cost countermeasures.",
                    "Side-channel leakage and trace compression using normalized inter-class variance.",
                    "PUMP: a programmable unit for metadata processing.",
                    "Towards fast hardware memory integrity checking with skewed Merkle trees.",
                    "Scalable and efficient implementation of correlation power analysis using graphics processing units (GPUs).",
                    "Memory bandwidth reservation in the cloud to avoid information leakage in the memory controller."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "40th ISCA 2013",
        "info": "Tel-Aviv, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2013",
                "sub_name": "The 40th Annual International Symposium on Computer Architecture, ISCA'13, Tel-Aviv, Israel, June 23-27, 2013.",
                "count": 56,
                "papers": [
                    "Continuous real-world inputs can open up alternative accelerator designs.",
                    "Flicker: a dynamically adaptive architecture for power limited multicore systems.",
                    "Convolution engine: balancing efficiency & flexibility in specialized computing.",
                    "Thin servers with smart pipes: designing SoC accelerators for memcached.",
                    "Understanding and mitigating refresh overheads in high-density DDR4 DRAM systems.",
                    "An experimental study of data retention behavior in modern DRAM devices: implications for retention time profiling mechanisms.",
                    "ArchShield: architectural framework for assisting DRAM scaling by tolerating high error rates.",
                    "Improving memory scheduling via processor-side load criticality information.",
                    "Agile, efficient virtualization power management with low-latency server power states.",
                    "Secure I/O device sharing among virtual machines on multiple hosts.",
                    "Improving virtualization in the presence of software managed translation lookaside buffers.",
                    "Microarchitectural mechanisms to exploit value structure in SIMT architectures.",
                    "Triggered instructions: a control paradigm for spatially-programmed architectures.",
                    "Utility-based acceleration of multithreaded applications on asymmetric CMPs.",
                    "Quantum rotations: a case study in static and dynamic machine-code generation for quantum computers.",
                    "DNA-based molecular architecture with spatially localized components.",
                    "AC-DIMM: associative computing with STT-MRAM.",
                    "Exploring memory consistency for massively-threaded throughput-oriented processors.",
                    "WeeFence: toward making fences free in TSO.",
                    "Robust architectural support for transactional memory in the power architecture.",
                    "Efficient virtual memory for big memory servers.",
                    "Navigating big data with high-throughput, energy-efficient data partitioning.",
                    "LINQits: big data on little clients.",
                    "STREX: boosting instruction cache reuse in OLTP workloads through stratified transaction execution.",
                    "Cooperative boosting: needy versus greedy power management.",
                    "Dynamic reduction of voltage margins by leveraging on-chip ECC in Itanium II processors.",
                    "A hardware evaluation of cache partitioning to improve utilization and energy-efficiency while preserving responsiveness.",
                    "Catnap: energy proportional multiple network-on-chip.",
                    "Orchestrated scheduling and prefetching for GPGPUs.",
                    "An energy-efficient and scalable eDRAM-based register file architecture for GPGPU.",
                    "Maximizing SIMD resource utilization in GPGPUs with SIMD lane permutation.",
                    "SIMD divergence optimization through intra-warp compaction.",
                    "Reducing memory access latency with asymmetric DRAM bank organizations.",
                    "CPU transparent protection of OS kernel and hypervisor integrity with programmable DRAM.",
                    "Die-stacked DRAM caches for servers: hit ratio, latency, or bandwidth? have it all with footprint cache.",
                    "Resilient die-stacked DRAM caches.",
                    "Bit mapping for balanced PCM cell programming.",
                    "Tri-level-cell phase change memory: toward an efficient and reliable memory system.",
                    "Zombie memory: extending memory lifetime by reviving dead blocks.",
                    "QuickSAN: a storage area network for fast, distributed, solid state disks.",
                    "ZSim: fast and accurate microarchitectural simulation of thousand-core systems.",
                    "GPUWattch: enabling energy optimizations in GPGPUs.",
                    "Studying multicore processor scaling via reuse distance analysis.",
                    "Criticality stacks: identifying critical threads in parallel programs using synchronization behavior.",
                    "The locality-aware adaptive cache coherence protocol.",
                    "A new perspective for efficient virtual-cache coherence.",
                    "Protozoa: adaptive granularity cache coherence.",
                    "On the feasibility of online malware detection with performance counters.",
                    "Design space exploration and optimization of path oblivious RAM in secure processors.",
                    "SurfNoC: a low latency and provably non-interfering approach to secure networks-on-chip.",
                    "Virtualizing power distribution in datacenters.",
                    "Bubble-flux: precise online QoS management for increased utilization in warehouse scale computers.",
                    "Whare-map: heterogeneity in \"homogeneous\" warehouse-scale computers.",
                    "Deconfigurable microprocessor architectures for silicon debug acceleration.",
                    "QuickRec: prototyping an intel architecture extension for record and replay of multithreaded programs.",
                    "Non-race concurrency bug detection through order-sensitive critical sections."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2013mes",
                "sub_name": "Proceedings of the 1st International Workshop on Many-core Embedded Systems 2013, MES'2013, Held in conjunction with the 40th Annual IEEE/ACM International Symposium on Computer Architecture, ISCA 2013, June 24, 2013.",
                "count": 11,
                "papers": [
                    "Improving the programmability of STHORM-based heterogeneous systems with offload-enabled OpenMP.",
                    "Co-tuning of a hybrid electronic-optical network for reducing energy consumption in embedded CMPs.",
                    "Many-core acceleration for model predictive control systems.",
                    "A code generation method for system-level synthesis on ASIC, FPGA and manycore CGRA.",
                    "Directory based cache coherence verification logic in CMPs cache system.",
                    "Design of high-throughput Inter-PE communication with application-level flow control protocol for many-core architectures.",
                    "Proposing a new task model towards many-core architecture.",
                    "Performance analysis of multi-threaded multi-core CPUs.",
                    "Extending dataflow programs with throughput properties.",
                    "Transparent and energy-efficient speculation on NUMA architectures for embedded MPSoCs.",
                    "AutoPilot: message passing parallel programming for a cache incoherent embedded manycore processor."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2013hasp",
                "sub_name": "HASP 2013, The Second Workshop on Hardware and Architectural Support for Security and Privacy, Tel-Aviv, Israel, June 23-24, 2013.",
                "count": 11,
                "papers": [
                    "Red team vs. blue team hardware trojan analysis: detection of a hardware trojan on an actual ASIC.",
                    "Side channel vulnerability metrics: the promise and the pitfalls.",
                    "Security testing of a secure cache design.",
                    "Evaluation of delay PUFs on CMOS 65 nm technology: ASIC vs FPGA.",
                    "Secure memories resistant to both random errors and fault injection attacks using nonlinear error correction codes.",
                    "Micro-architectural support for metadata coherence in multi-core dynamic information flow tracking.",
                    "Practical template-algebraic side channel attacks with extremely low data complexity.",
                    "Unraveling timewarp: what all the fuzz is about?",
                    "Side-channel indistinguishability.",
                    "Innovative instructions and software model for isolated execution.",
                    "Using innovative instructions to create trustworthy software solutions."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "39th ISCA 2012",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2012",
                "sub_name": "39th International Symposium on Computer Architecture (ISCA 2012), June 9-13, 2012, Portland, OR, USA.",
                "count": 47,
                "papers": [
                    "RAIDR: Retention-aware intelligent DRAM refresh.",
                    "PARDIS: A programmable memory controller for the DDRx interfacing standards.",
                    "BOOM: Enabling mobile memory based low-power server DIMMs.",
                    "Towards energy-proportional datacenter memory with mobile DRAM.",
                    "Simultaneous branch and warp interweaving for sustained GPU performance.",
                    "CAPRI: Prediction of compaction-adequacy for handling control-divergence in GPGPU architectures.",
                    "iGPU: Exception support and speculative execution on GPUs.",
                    "Boosting mobile GPU performance with a decoupled access/execute fragment processor.",
                    "Branch regulation: Low-overhead protection from code reuse attacks.",
                    "Side-channel vulnerability factor: A metric for measuring information leakage.",
                    "TimeWarp: Rethinking timekeeping and performance monitoring mechanisms to mitigate side-channel attacks.",
                    "Inspection resistant memory: Architectural support for security from physical examination.",
                    "Tolerating process variations in nanophotonic on-chip networks.",
                    "A micro-architectural analysis of switched photonic multi-chip interconnects.",
                    "Enhancing effective throughput for transmission line-based bus.",
                    "A case for random shortcut topologies for HPC interconnects.",
                    "Watchdog: Hardware for safe and secure manual memory management and full memory safety.",
                    "RADISH: Always-on sound and complete race detection in software and hardware.",
                    "Scheduling heterogeneous multi-cores through performance impact estimation (PIE).",
                    "The Yin and Yang of power and performance for asymmetric hardware and managed software.",
                    "Lane decoupling for improving the timing-error resiliency of wide-SIMD architectures.",
                    "VRSync: Characterizing and eliminating synchronization-induced voltage emergencies in many-core processors.",
                    "Euripus: A flexible unified hardware memory checkpointing accelerator for bidirectional-debugging and reliability.",
                    "A first-order mechanistic model for architectural vulnerability factor.",
                    "LOT-ECC: Localized and tiered reliability mechanisms for commodity memory systems.",
                    "Reducing memory reference energy with opportunistic virtual caching.",
                    "Improving writeback efficiency with decoupled last-write prediction.",
                    "FLEXclusion: Balancing cache capacity and on-chip bandwidth via Flexible Exclusion.",
                    "Setting an error detection infrastructure with low cost acoustic wave detectors.",
                    "Viper: Virtual pipelines for enhanced reliability.",
                    "A defect-tolerant accelerator for emerging high-performance applications.",
                    "A case for exploiting subarray-level parallelism (SALP) in DRAM.",
                    "PreSET: Improving performance of phase change memories by exploiting asymmetry in write times.",
                    "Buffer-on-board memory systems.",
                    "Physically Addressed Queueing (PAQ): Improving parallelism in Solid State Disks.",
                    "Staged memory scheduling: Achieving high performance and scalability in heterogeneous systems.",
                    "Probabilistic Shared Cache Management (PriSM).",
                    "Can traditional programming bridge the Ninja performance gap for parallel computing applications?",
                    "Harmony: Collection and analysis of parallel block vectors.",
                    "Configurable fine-grain protection for multicore processor virtualization.",
                    "Revisiting hardware-assisted page walks for virtualized systems.",
                    "Managing distributed UPS energy for effective power capping in data centers.",
                    "Scale-out processors.",
                    "iSwitch: Coordinating and optimizing renewable energy powered server clusters.",
                    "End-to-end sequential consistency.",
                    "BlockChop: Dynamic squash elimination for hybrid processor architecture.",
                    "The dynamic granularity memory system."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "38th ISCA 2011",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2011",
                "sub_name": "38th International Symposium on Computer Architecture (ISCA 2011), June 4-8, 2011, San Jose, CA, USA.",
                "count": 40,
                "papers": [
                    "Automatic abstraction and fault tolerance in cortical microachitectures.",
                    "FabScalar: composing synthesizable RTL designs of arbitrary cores within a canonical superscalar template.",
                    "CRIB: consolidated rename, issue, and bypass.",
                    "FlexBulk: intelligently forming atomic blocks in blocked-execution multiprocessors to minimize squashes.",
                    "Virtualizing performance asymmetric multi-core systems.",
                    "Vantage: scalable and efficient fine-grain cache partitioning.",
                    "Architecting on-chip interconnects for stacked 3D STT-RAM caches in CMPs.",
                    "Bypass and insertion algorithms for exclusive last-level caches.",
                    "Increasing the effectiveness of directory caches by deactivating coherence for private memory blocks.",
                    "TLSync: support for multiple fast barriers using on-chip transmission lines.",
                    "OUTRIDER: efficient memory latency tolerance with decoupled strands.",
                    "Exploring the tradeoffs between programmability and efficiency in data-parallel accelerators.",
                    "Prefetch-aware shared resource management for multi-core systems.",
                    "Rebound: scalable checkpointing for coherent shared memory.",
                    "Demand-driven software race detection using hardware performance counters.",
                    "i-NVMM: a secure non-volatile main memory system with incremental encryption.",
                    "Crafting a usable microkernel, processor, and I/O system with strict and provable information flow security.",
                    "Sampling + DMR: practical and low-overhead permanent fault detection.",
                    "Releasing efficient beta cores to market early.",
                    "CPPC: correctable parity protected cache.",
                    "Energy-efficient mechanisms for managing thread context in throughput processors.",
                    "SRAM-DRAM hybrid memory with applications to efficient register files in fine-grained multi-threading.",
                    "An abacus turn model for time/space-efficient reconfigurable routing.",
                    "A case for globally shared-medium on-chip interconnect.",
                    "The impact of memory subsystem resource sharing on datacenter applications.",
                    "Adaptive granularity memory systems: a tradeoff between storage efficiency and throughput.",
                    "SpecTLB: a mechanism for speculative address translation.",
                    "Power management of online data-intensive services.",
                    "Fighting fire with fire: modeling the datacenter-scale effects of targeted superlattice thermal management.",
                    "Benefits and limitations of tapping into stored energy for datacenters.",
                    "Rapid identification of architectural bottlenecks via precise event counting.",
                    "Dark silicon and the end of multicore scaling.",
                    "Moguls: a model to explore the memory hierarchy for bandwidth improvements.",
                    "A case for heterogeneous on-chip interconnects for CMPs.",
                    "Kilo-NOC: a heterogeneous network-on-chip architecture for scalability and service guarantees.",
                    "DBAR: an efficient routing algorithm to support multiple concurrent applications in networks-on-chip.",
                    "Combining memory and a controller with photonics through 3D-stacking to enable scalable and energy-efficient systems.",
                    "The role of optics in future high radix switch design.",
                    "Scalable power control for many-core architectures running multi-threaded applications.",
                    "Energy-efficient cache design using variable-strength error-correcting codes."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "37th ISCA 2010",
        "info": "Saint-Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2010",
                "sub_name": "37th International Symposium on Computer Architecture (ISCA 2010), June 19-23, 2010, Saint-Malo, France.",
                "count": 48,
                "papers": [
                    "Moving the needle, computer architecture research in academe and industry.",
                    "WiDGET: Wisconsin decoupled grid execution tiles.",
                    "Forwardflow: a scalable core for power-constrained CMPs.",
                    "Energy-performance tradeoffs in processor architecture and circuit design: a marginal cost analysis.",
                    "Understanding sources of inefficiency in general-purpose chips.",
                    "Translation caching: skip, don't walk (the page table).",
                    "High performance cache replacement using re-reference interval prediction (RRIP).",
                    "The virtual write queue: coordinating DRAM and last-level cache policies.",
                    "Reducing cache power with low-cost, multi-bit error-correcting codes.",
                    "An intra-chip free-space optical interconnect.",
                    "Aérgia: exploiting packet latency slack in on-chip networks.",
                    "Silicon-photonic network architectures for scalable, power-efficient multi-chip systems.",
                    "Re-architecting DRAM memory systems with monolithically integrated silicon photonics.",
                    "Use ECP, not ECC, for hard failures in resistive memories.",
                    "Morphable memory system: a robust architecture for exploiting multi-level phase change memories.",
                    "SieveStore: a highly-selective, ensemble-level disk cache for cost-performance.",
                    "Rethinking DRAM design and organization for energy-constrained multi-cores.",
                    "LReplay: a pending period based deterministic replay scheme.",
                    "Timetraveler: exploiting acyclic races for optimizing memory race recording.",
                    "Conflict exceptions: simplifying concurrent language semantics with precise hardware exceptions for data-races.",
                    "ColorSafe: architectural support for debugging and dynamically avoiding multi-variable atomicity violations.",
                    "Shared caches in multicores: the good, the bad, and the ugly.",
                    "Dynamic warp subdivision for integrated branch and memory divergence tolerance.",
                    "A dynamically configurable coprocessor for convolutional neural networks.",
                    "RETCON: transactional repair without replay.",
                    "Thread tailor: dynamically weaving threads together for efficient, adaptive parallel applications.",
                    "An integrated GPU power and performance model.",
                    "A case for FAME: FPGA architecture model execution.",
                    "Evolution of thread-level parallelism in desktop applications.",
                    "Web search using mobile cores: quantifying and mitigating the price of efficiency.",
                    "The impact of management operations on the virtualized datacenter.",
                    "Energy proportional datacenter networks.",
                    "Improving the future by examining the past.",
                    "The rebirth of neural networks.",
                    "NoHype: virtualized cloud infrastructure without the virtualization.",
                    "Modeling critical sections in Amdahl's law and its implications for multicore design.",
                    "Resistive computation: avoiding the power wall with low-leakage, STT-MRAM based computing.",
                    "Security refresh: prevent malicious wear-out and increase durability for phase-change memory with dynamically randomized address mapping.",
                    "IVEC: off-chip memory integrity protection for both security and reliability.",
                    "Sentry: light-weight auxiliary memory access control.",
                    "Elastic cooperative caching: an autonomous dynamically adaptive memory hierarchy for chip multiprocessors.",
                    "Cohesion: a hybrid memory model for accelerators.",
                    "Data marshaling for multi-core architectures.",
                    "Debunking the 100X GPU vs. CPU myth: an evaluation of throughput computing on CPU and GPU.",
                    "Using hardware vulnerability factors to enhance AVF analysis.",
                    "Necromancer: enhancing system throughput by animating dead cores.",
                    "Leveraging the core-level complementary effects of PVT variations to reduce timing emergencies in multi-core processors.",
                    "Relax: an architectural framework for software recovery of hardware faults."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/2010w",
                "sub_name": "Computer Architecture - ISCA 2010 International Workshops A4MMC, AMAS-BT, EAMA, WEED, WIOSCA, Saint-Malo, France, June 19-23, 2010, Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Accelerating Agent-Based Ecosystem Models Using the Cell Broadband Engine.",
                    "Performance Impact of Task Mapping on the Cell BE Multicore Processor.",
                    "Parallelization Strategy for CELL TV.",
                    "Towards User Transparent Parallel Multimedia Computing on GPU-Clusters.",
                    "Implementing a GPU Programming Model on a Non-GPU Accelerator Architecture.",
                    "On the Use of Small 2D Convolutions on GPUs.",
                    "Can Manycores Support the Memory Requirements of Scientific Applications?",
                    "Parallelizing an Index Generator for Desktop Search.",
                    "Computation vs. Memory Systems: Pinning Down Accelerator Bottlenecks.",
                    "Trace Execution Automata in Dynamic Binary Translation.",
                    "ISAMAP: Instruction Mapping Driven by Dynamic Binary Translation.",
                    "Parallelization of Particle Filter Algorithms.",
                    "What Kinds of Applications Can Benefit from Transactional Memory?",
                    "Characteristics of Workloads Using the Pipeline Programming Model.",
                    "The Search for Energy-Efficient Building Blocks for the Data Center.",
                    "KnightShift: Shifting the I/O Burden in Datacenters to Management Processor for Energy Efficiency.",
                    "Guarded Power Gating in a Multi-core Setting.",
                    "Using Partial Tag Comparison in Low-Power Snoop-Based Chip Multiprocessors.",
                    "Achieving Power-Efficiency in Clusters without Distributed File System Complexity.",
                    "What Computer Architects Need to Know about Memory Throttling.",
                    "Predictive Power Management for Multi-core Processors.",
                    "IOMMU: Strategies for Mitigating the IOTLB Bottleneck.",
                    "Improving Server Performance on Multi-cores via Selective Off-Loading of OS Functionality.",
                    "Performance Characteristics of Explicit Superpage Support.",
                    "Interfacing Operating Systems and Polymorphic Computing Platforms Based on the MOLEN Programming Paradigm.",
                    "Extrinsic and Intrinsic Text Cloning.",
                    "A Case for Coordinated Resource Management in Heterogeneous Multicore Platforms.",
                    "Topology-Aware Quality-of-Service Support in Highly Integrated Chip Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "36th ISCA 2009",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2009",
                "sub_name": "36th International Symposium on Computer Architecture (ISCA 2009), June 20-24, 2009, Austin, TX, USA.",
                "count": 45,
                "papers": [
                    "Ten ways to waste a parallel computer.",
                    "Architecting phase change memory as a scalable dram alternative.",
                    "A durable and energy efficient main memory using phase change memory technology.",
                    "Scalable high performance main memory system using phase-change memory technology.",
                    "Hybrid cache architecture with disparate memory technologies.",
                    "Dynamic MIPS rate stabilization in out-of-order processors.",
                    "Hardware support for WCET analysis of hard real-time multicore systems.",
                    "Spatio-temporal memory streaming.",
                    "Stream chaining: exploiting multiple levels of correlation in data prefetching.",
                    "Architectural core salvaging in a multi-core processor for hard-error tolerance.",
                    "End-to-end register data-flow continuous self-test.",
                    "Memory mapped ECC: low-cost error protection for last level caches.",
                    "AnySP: anytime anywhere anyway signal processing.",
                    "Rigel: an architecture and scalable programming interface for a 1000-core accelerator.",
                    "An analytical model for a GPU architecture with memory-level and thread-level parallelism awareness.",
                    "Multi-execution: multicore caching for data-similar executions.",
                    "PIPP: promotion/insertion pseudo-partitioning of multi-core shared caches.",
                    "Reactive NUCA: near-optimal block placement and replication in distributed caches.",
                    "A case for bufferless routing in on-chip networks.",
                    "Application-aware deadlock-free oblivious routing.",
                    "Indirect adaptive routing on large scale interconnection networks.",
                    "Internet-scale service infrastructure efficiency.",
                    "InvisiFence: performance-transparent memory ordering in conventional multiprocessors.",
                    "Decoupled store completion/silent deterministic replay: enabling scalable data memory for CPR/CFP processors.",
                    "Decoupled DIMM: building high-bandwidth memory system using low-speed DRAM devices.",
                    "Disaggregated memory for expansion and sharing in blade servers.",
                    "The performance of PC solid-state disks (SSDs) as a function of bandwidth, concurrency, device architecture, and system organization.",
                    "Thread criticality predictors for dynamic performance, power, and resource management in chip multiprocessors.",
                    "Thread motion: fine-grained power management for multi-core systems.",
                    "Temperature-constrained power control for chip multiprocessors with online model estimation.",
                    "A case for an interleaving constrained shared-memory multi-processor.",
                    "SigRace: signature-based data race detection.",
                    "ECMon: exposing cache events for monitoring.",
                    "End-to-end performance forecasting: finding bottlenecks before they happen.",
                    "Scaling the bandwidth wall: challenges in and avenues for CMP scaling.",
                    "A fault tolerant, area efficient architecture for Shor's factoring algorithm.",
                    "Performance and power of cache-based reconfigurable computing.",
                    "A memory system design framework: creating smart memories.",
                    "Flexible reference-counting-based hardware acceleration for garbage collection.",
                    "Firefly: illuminating future network-on-chip with nanophotonics.",
                    "Phastlane: a rapid transit optical routing network.",
                    "Achieving predictable performance through better memory controller placement in many-core CMPs.",
                    "Dynamic performance tuning for speculative threads.",
                    "Boosting single-thread performance in multi-core systems through fine-grain multi-threading.",
                    "Simultaneous speculative threading: a novel pipeline architecture implemented in sun's rock processor."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "35th ISCA 2008",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2008",
                "sub_name": "35th International Symposium on Computer Architecture (ISCA 2008), June 21-25, 2008, Beijing, China.",
                "count": 37,
                "papers": [
                    "Achieving Out-of-Order Performance with Almost In-Order Complexity.",
                    "Fetch-Criticality Reduction through Control Independence.",
                    "A Two-Level Load/Store Queue Based on Execution Locality.",
                    "Self-Optimizing Memory Controllers: A Reinforcement Learning Approach.",
                    "A Comprehensive Memory Modeling Tool and Its Application to the Design and Analysis of Future Memory Hierarchies.",
                    "Parallelism-Aware Batch Scheduling: Enhancing both Performance and Fairness of Shared DRAM Systems.",
                    "Technology-Driven, Highly-Scalable Dragonfly Topology.",
                    "Globally-Synchronized Frames for Guaranteed Quality-of-Service in On-Chip Networks.",
                    "Polymorphic On-Chip Networks.",
                    "Using Hardware Memory Protection to Build a High-Performance, Strongly-Atomic Hybrid Transactional Memory.",
                    "TokenTM: Efficient Execution of Large Transactions with Hardware Transactional Memory.",
                    "Flexible Decoupled Transactional Memory Support.",
                    "Corona: System Implications of Emerging Nanophotonic Technology.",
                    "Microcoded Architectures for Ion-Tap Quantum Computers.",
                    "Running a Quantum Circuit at the Speed of Data.",
                    "ReVIVaL: A Variation-Tolerant Architecture Using Voltage Interpolation and Variable Latency.",
                    "Trading off Cache Capacity for Reliability to Enable Low Voltage Operation.",
                    "Counting Dependence Predictors.",
                    "Virtual Circuit Tree Multicasting: A Case for On-Chip Hardware Multicast Support.",
                    "iDEAL: Inter-router Dual-Function Energy and Area-Efficient Links for Network-on-Chip (NoC) Architectures.",
                    "MIRA: A Multi-layered On-Chip Interconnect Router Architecture.",
                    "Rerun: Exploiting Episodes for Lightweight Memory Race Recording.",
                    "Atom-Aid: Detecting and Surviving Atomicity Violations.",
                    "DeLorean: Recording and Deterministically Replaying Shared-Memory Multiprocessor Execution Effciently.",
                    "Intra-disk Parallelism: An Idea Whose Time Has Come.",
                    "Understanding and Designing New Server Architectures for Emerging Warehouse-Computing Environments.",
                    "Improving NAND Flash Based Disk Caches.",
                    "Online Estimation of Architectural Vulnerability Factor for Soft Errors.",
                    "A Proactive Wearout Recovery Approach for Exploiting Microarchitectural Redundancy to Extend Cache SRAM Lifetime.",
                    "Variation-Aware Application Scheduling and Power Management for Chip Multiprocessors.",
                    "Flexible Hardware Acceleration for Instruction-Grain Program Monitoring.",
                    "VEAL: Virtualized Execution Accelerator for Loops.",
                    "From Speculation to Security: Practical and Efficient Information Flow Tracking Using Speculative Hardware.",
                    "Software-Controlled Priority Characterization of POWER5 Processor.",
                    "Learning and Leveraging the Relationship between Architecture-Level Measurements and Individual User Satisfaction.",
                    "Atomic Vector Operations on Chip Multiprocessors.",
                    "3D-Stacked Memory Architectures for Multi-core Processors."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "34th ISCA 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2007",
                "sub_name": "34th International Symposium on Computer Architecture (ISCA 2007), June 9-13, 2007, San Diego, California, USA.",
                "count": 46,
                "papers": [
                    "Anton, a special-purpose machine for molecular dynamics simulation.",
                    "Power provisioning for a warehouse-sized computer.",
                    "Making the fast case common and the uncommon case simple in unbounded transactional memory.",
                    "Synchronization state buffer: supporting efficient fine-grain synchronization on many-core architectures.",
                    "Virtual hierarchies to support server consolidation.",
                    "Virtual private caches.",
                    "An effective hybrid transactional memory system with strong isolation guarantees.",
                    "Performance pathologies in hardware transactional memory.",
                    "MetaTM//TxLinux: transactional memory for an operating system.",
                    "An integrated hardware-software approach to flexible transactional memory.",
                    "Rotary router: an efficient architecture for CMP interconnection networks.",
                    "Flattened butterfly: a cost-efficient topology for high-radix networks.",
                    "A novel dimensionally-decomposed router for on-chip communication in 3D architectures.",
                    "Express virtual channels: towards the ideal interconnection fabric.",
                    "Carbon: architectural support for fine-grained parallelism on chip multiprocessors.",
                    "Hardware atomicity for reliable software speculation.",
                    "Core fusion: accommodating software diversity in chip multiprocessors.",
                    "Tailoring quantum architectures to implementation style: a quantum computer for mobile and persistent qubits.",
                    "A 64-bit stream processor architecture for scientific applications.",
                    "Physical simulation for animation and visual effects: parallelization and characterization for chip multiprocessors.",
                    "ParallAX: an architecture for real-time physics.",
                    "Architectural implications of brick and mortar silicon manufacturing.",
                    "Aquacore: a programmable architecture for microfluidics.",
                    "Mechanisms for store-wait-free multiprocessors.",
                    "BulkSC: bulk enforcement of sequential consistency.",
                    "Limiting the power consumption of main memory.",
                    "Power model validation through thermal measurements.",
                    "Thermal modeling and management of DRAM memory systems.",
                    "ReCycle: : pipeline adaptation to tolerate process variation.",
                    "Matrix scheduler reloaded.",
                    "Late-binding: enabling unordered load-store queues.",
                    "Comparing memory systems for chip multiprocessors.",
                    "Interconnect design considerations for large NUCA caches.",
                    "Adaptive insertion policies for high performance caching.",
                    "Performance and security lessons learned from virtualizing the alpha processor.",
                    "Automated design of application specific superscalar processors: an analytical approach.",
                    "Analysis of redundancy and application balance in the SPEC CPU2006 benchmark suite.",
                    "VPC prediction: reducing the cost of indirect branches via hardware-based dynamic devirtualization.",
                    "Ginger: control independence using tag rewriting.",
                    "Transparent control independence (TCI).",
                    "Examining ACE analysis reliability estimates using fault-injection.",
                    "Configurable isolation: building high availability systems with commodity multi-core processors.",
                    "Raksha: a flexible information flow architecture for software security.",
                    "New cache designs for thwarting software cache-based side channel attacks.",
                    "Mechanisms for bounding vulnerabilities of processor structures.",
                    "Dynamic prediction of architectural vulnerability from microarchitectural state."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2007",
                "sub_name": "Proceedings of the 2007 Workshop on Computer Architecture Education, WCAE 2007, San Diego, California, USA, Saturday, June 9, 2007.",
                "count": 12,
                "papers": [
                    "A pedagogically targeted logic design and simulation tool.",
                    "VLIW-DLX simulator for educational purposes.",
                    "From classroom to research: providing different services for computer architecture education.",
                    "Animations of important concepts in parallel computer architecture.",
                    "Understanding cache hierarchy interactions with a program-driven simulator.",
                    "An integrated approach to teaching computer systems architecture.",
                    "An experimental laboratory environment for teaching embedded hardware systems.",
                    "A proposal to introduce power and energy notions in computer architecture laboratories.",
                    "ChipDesign: from theory to real world.",
                    "Industry perspective on chip multi-threading, bridging the gap with academia using OpenSPARC.",
                    "Pedagogic value in understanding computer architecture of implementing the marie computer from null and lobur in the logic emulation software, multimedia logic.",
                    "Teaching computer organization/architecture by building a computer."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "33rd ISCA 2006",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2006",
                "sub_name": "33rd International Symposium on Computer Architecture (ISCA 2006), June 17-21, 2006, Boston, MA, USA.",
                "count": 38,
                "papers": [
                    "Message from the General Chair.",
                    "Message from the Program Chair.",
                    "Reviewers.",
                    "SIGARCH Guidelines.",
                    "Computer Architecture Research and Future Microprocessors: Where Do We Go from Here?",
                    "A Gracefully Degrading and Energy-Efficient Modular Router Architecture for On-Chip Networks.",
                    "The BlackWidow High-Radix Clos Network.",
                    "Memory Model = Instruction Reordering + Store Atomicity.",
                    "Conditional Memory Ordering.",
                    "Architectural Semantics for Practical Transactional Memory.",
                    "Ensemble-level Power Management for Dense Blade Servers.",
                    "Techniques for Multicore Thermal Management: Classification and New Exploration.",
                    "SODA: A Low-power Architecture For Software Radio.",
                    "An Integrated Framework for Dependable and Revivable Architectures Using Multicore Processors.",
                    "Multiple Instruction Stream Processor.",
                    "The End of Scaling? Revolutions in Technology and Microarchitecture as We Pass the 90 Nanometer Node.",
                    "Design and Management of 3D Chip Multiprocessors Using Network-in-Memory.",
                    "Slackened Memory Dependence Enforcement: Combining Opportunistic Forwarding with Decoupled Verification.",
                    "Balanced Cache: Reducing Conflict Misses of Direct-Mapped Caches.",
                    "A Case for MLP-Aware Cache Replacement.",
                    "Improving Cost, Performance, and Security of Memory Encryption and Authentication.",
                    "A Scalable Architecture For High-Throughput Regular-Expression Pattern Matching.",
                    "Chisel: A Storage-efficient, Collision-free Hash-based Network Processing Architecture.",
                    "Tolerating Dependences Between Large Speculative Threads Via Sub-Threads.",
                    "Bulk Disambiguation of Speculative Threads in Multiprocessors.",
                    "Learning-Based SMT Processor Resource Distribution via Hill-Climbing.",
                    "Spatial Memory Streaming.",
                    "Cooperative Caching for Chip Multiprocessors.",
                    "Reducing Startup Time in Co-Designed Virtual Machines.",
                    "TRAP-Array: A Disk Array Architecture Providing Timely Recovery to Any Point-in-time.",
                    "Program Demultiplexing: Data-flow based Speculative Parallelization of Methods in Sequential Programs.",
                    "Area-Performance Trade-offs in Tiled Dataflow Architectures.",
                    "Flexible Snooping: Adaptive Forwarding and Filtering of Snoops in Embedded-Ring Multiprocessors.",
                    "Interconnect-Aware Coherence Protocols for Chip Multiprocessors.",
                    "The Future of Virtualization Technology.",
                    "Distributed Arithmetic on a Quantum Multicomputer.",
                    "Interconnection Networks for Scalable Quantum Computers.",
                    "Quantum Memory Hierarchies: Efficient Designs to Match Available Parallelism in Quantum Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2006",
                "sub_name": "Proceedings of the 2006 Workshop on Computer Architecture Education, WCAE 2006, Boston, Massachusetts, USA, Saturday, June 17, 2006.",
                "count": 8,
                "papers": [
                    "A systems approach to teaching computer systems.",
                    "Welcome.",
                    "Experiences with the Blackfin architecture in an embedded systems lab.",
                    "PSATSim: an interactive graphical superscalar architecture simulator for power and performance analysis.",
                    "An execution-driven simulation tool for teaching cache memories in introductory computer organization courses.",
                    "Web memory hierarchy learning and research environment.",
                    "Remote operation and control of computer engineering laboratory experiments.",
                    "Students' experimental processor: a processor integrated with different types of architectures for educational purposes."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "32nd ISCA 2005",
        "info": "Madison, Wisconsin, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2005",
                "sub_name": "32st International Symposium on Computer Architecture (ISCA 2005), 4-8 June 2005, Madison, Wisconsin, USA.",
                "count": 45,
                "papers": [
                    "Architecture for Protecting Critical Secrets in Microprocessors.",
                    "High Efficiency Counter Mode Security Architecture via Prediction and Precomputation.",
                    "Design and Implementation of the AEGIS Single-Chip Secure Processor Using Physical Random Functions.",
                    "Disk Drive Roadmap from the Thermal Perspective: A Case for Dynamic Thermal Management.",
                    "Direct Cache Access for High Bandwidth Network I/O.",
                    "Deconstructing Commodity Storage Clusters.",
                    "A Robust Main-Memory Compression Scheme.",
                    "Continuous Optimization.",
                    "RENO - A Rename-Based Instruction Optimizer.",
                    "A High Throughput String Matching Architecture for Intrusion Detection and Prevention.",
                    "A Tree Based Router Search Engine Architecture with Single Port Memories.",
                    "An Integrated Memory Array Processor Architecture for Embedded Image Recognition Systems.",
                    "Design and Evaluation of Hybrid Fault-Detection Systems.",
                    "Rescue: A Microarchitecture for Testability and Defect Tolerance.",
                    "Opportunistic Transient-Fault Detection.",
                    "An Evaluation Framework and Instruction Set Architecture for Ion-Trap Based Quantum Micro-Architectures.",
                    "Energy Optimization of Subthreshold-Voltage Sensor Network Processors.",
                    "An Ultra Low Power System Architecture for Sensor Network Applications.",
                    "Temporal Streaming of Shared Memory.",
                    "RegionScout: Exploiting Coarse Grain Sharing in Snoop-Based Coherence.",
                    "Improving Multiprocessor Performance with Coarse-Grain Coherence Tracking.",
                    "Improving Program Efficiency by Packing Instructions into Registers.",
                    "An Architecture Framework for Transparent Instruction Set Customization in Embedded Processors.",
                    "BugNet: Continuously Recording Program Execution for Deterministic Replay Debugging.",
                    "Mitigating Amdahl's Law through EPI Throttling.",
                    "Increased Scalability and Power Efficiency by Using Multiple Speed Pipelines.",
                    "Energy-Effectiveness of Pre-Execution and Energy-Aware P-Thread Selection.",
                    "Victim Replication: Maximizing Capacity while Hiding Wire Delay in Tiled Chip Multiprocessors.",
                    "Adaptive Mechanisms and Policies for Managing Cache Hierarchies in Chip Multiprocessors.",
                    "Optimizing Replication, Communication, and Capacity Allocation in CMPs.",
                    "Techniques for Efficient Processing in Runahead Execution Engines.",
                    "Piecewise Linear Branch Prediction.",
                    "Analysis of the O-GEometric History Length Branch Predictor.",
                    "Interconnections in Multi-Core Architectures: Understanding Mechanisms, Overheads and Scaling.",
                    "Microarchitecture of a High-Radix Router.",
                    "Near-Optimal Worst-Case Throughput Routing for Two-Dimensional Mesh Networks.",
                    "Scalable Load and Store Processing in Latency Tolerant Processors.",
                    "Store Vulnerability Window (SVW): Re-Execution Filtering for Enhanced Load Optimization.",
                    "Store Buffer Design in First-Level Multibanked Data Caches.",
                    "Dynamic Verification of Sequential Consistency.",
                    "Virtualizing Transactional Memory.",
                    "The Impact of Performance Asymmetry in Emerging Multicore Architectures.",
                    "Exploiting Structural Duplication for Lifetime Reliability Enhancement.",
                    "Computing Architectural Vulnerability Factors for Address-Based Structures.",
                    "The V-Way Cache: Demand Based Associativity via Global Replacement."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2005",
                "sub_name": "Proceedings of the 2005 workshop on Computer architecture education - held in conjunction with the 32nd International Symposium on Computer Architecture, WCAE@ISCA 2005, Madison, Wisconsin, USA, June 5, 2005.",
                "count": 11,
                "papers": [
                    "Embedded computer architectures in the MPSoC age.",
                    "Welcome.",
                    "Embedded systems courses at RIT.",
                    "Experiences with the Blackfin architecture for embedded systems education.",
                    "SPIMbot: an engaging, problem-based approach to teaching assembly language programming.",
                    "QUILT: a GUI-based integrated circuit floorplanning environment for computer architecture research and education.",
                    "The 'Little Man Storage' model.",
                    "An emulated computer with assembler for teaching undergraduate computer architecture.",
                    "An embedded systems course and course sequence.",
                    "Hardware/software co-design of embedded real-time systems from an undergraduate perspective.",
                    "Teaching microprocessor systems design using a SoC and Embedded Linux platform."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "31st ISCA 2004",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2004",
                "sub_name": "31st International Symposium on Computer Architecture (ISCA 2004), 19-23 June 2004, Munich, Germany.",
                "count": 31,
                "papers": [
                    "Evaluation of the Raw Microprocessor: An Exposed-Wire-Delay Architecture for ILP and Streams.",
                    "Evaluating the Imagine Stream Architecture.",
                    "Field-testing IMPACT EPIC research results in Itanium 2.",
                    "Wire Delay is Not a Problem for SMT (In the Near Future).",
                    "The Vector-Thread Architecture.",
                    "Single-ISA Heterogeneous Multi-Core Architectures for Multithreaded Workload Performance.",
                    "Microarchitecture Optimizations for Exploiting Memory-Level Parallelism.",
                    "Memory Ordering: A Value-Based Approach.",
                    "Transactional Memory Coherence and Consistency.",
                    "TSOtool: A Program for Verifying Memory Systems Using the Memory Consistency Model.",
                    "SMTp: An Architecture for Next-generation Scalable Multi-threading.",
                    "A Formal Approach to Frequent Energy Adaptations for Multimedia Applications.",
                    "Synchroscalar: A Multiple Clock Domain, Power-Aware, Tile-Based Embedded Processor.",
                    "Power Awareness through Selective Dynamically Optimized Traces.",
                    "X-RAY: A Non-Invasive Exclusive Caching Mechanism for RAIDs.",
                    "Low-Latency Virtual-Channel Routers for On-Chip Networks.",
                    "Immunet: A Cheap and Robust Fault-Tolerant Packet Routing Mechanism.",
                    "Adaptive Cache Compression for High-Performance Processors.",
                    "iWatcher: Efficient Architectural Support for Software Debugging.",
                    "From Sequences of Dependent Instructions to Functions: An Approach for Improving Performance without ILP or Speculation.",
                    "Prophet/Critic Hybrid Branch Prediction.",
                    "Techniques to Reduce the Soft Error Rate of a High-Performance Microprocessor.",
                    "The Case for Lifetime Reliability-Aware Microprocessors.",
                    "Exploiting Resonant Behavior to Reduce Inductive Noise.",
                    "Use-Based Register Caching with Decoupled Indexing.",
                    "A Content Aware Integer Register File Organization.",
                    "Physical Register Inlining.",
                    "A First-Order Superscalar Processor Model.",
                    "Control Flow Modeling in Statistical Simulation for Accurate and Efficient Processor Design Studies.",
                    "Extended Split-Issue: Enabling Flexibility in the Hardware Implementation of NUAL VLIW DSPs.",
                    "A Complexity-Effective Approach to ALU Bandwidth Enhancement for Instruction-Level Temporal Redundancy."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2004",
                "sub_name": "Proceedings of the 2004 workshop on Computer architecture education - Held in conjunction with the 31st International Symposium on Computer Architecture, WCAE@ISCA 2004, Munich, Germany, June 19, 2004.",
                "count": 25,
                "papers": [
                    "Welcome.",
                    "The changing role of computer architecture education within CS curricula: invited presentation.",
                    "A computer architecture education curriculum through the design and implementation of original processors using FPGAs.",
                    "Teaching embedded systems with FPGAs throughout a computer science course.",
                    "Extending FPGA based teaching boards into the area of distributed memory multiprocessors.",
                    "Teaching computer architecture using an architecture description language.",
                    "RTeasy: an algorithmic design environment on register transfer level.",
                    "Creating sharable learning objects from existing digital course content.",
                    "Introduction to formal processor verification at logic level: a case study.",
                    "The case for broader computer architecture education: keynote address.",
                    "Visualizing the MMIX superscalar pipeline: not only for teaching purposes.",
                    "Bridges to computer architecture education.",
                    "Improving Instruction Set Architecture learning results.",
                    "Integrating research and e-learning in advanced computer architecture courses.",
                    "Bridging undergraduate learning and research in software and hardware.",
                    "Teaching basics of instruction pipelining with HDLDLX.",
                    "Software implementations of division and square root operations for Intel® Itanium® processors.",
                    "Visual simulator for ILP dynamic OOO processor.",
                    "WebMIPS: a new web-based MIPS simulation environment for computer architecture education.",
                    "DARC2: 2nd generation DLX architecture simulator.",
                    "MKit simulator for introduction of computer architecture.",
                    "PIN: a binary instrumentation tool for computer architecture research and education.",
                    "A simulation applet for microcoding exercises.",
                    "The SimCore/Alpha Functional Simulator.",
                    "A combined virtual and remotely accessible microprocessor laboratory."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "30th ISCA 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2003",
                "sub_name": "30th International Symposium on Computer Architecture (ISCA 2003), 9-11 June 2003, San Diego, California, USA.",
                "count": 37,
                "papers": [
                    "Temperature-Aware Microarchitecture.",
                    "Profile-Based Dynamic Voltage and Frequency Scaling for a Multiple Clock Domain Microprocessor.",
                    "Half-Price Architecture.",
                    "Iimplicitly-Multithreaded Processors.",
                    "MisSPECulation: Partial and Misleading Use of SPEC CPU2000 in Computer Architecture Conferences.",
                    "Banked Multiported Register Files for High-Frequency Superscalar Microprocessors.",
                    "Pipeline Damping: A Microarchitectural Technique to Reduce Inductive Noise in Supply Voltage.",
                    "SMARTS: Accelerating Microarchitecture Simulation via Rigorous Statistical Sampling.",
                    "Transient-Fault Recovery for Chip Multiprocessors.",
                    "ReEnact: Using Thread-Level Speculation Mechanisms to Debug Data Races in Multithreaded Codes.",
                    "A \"Flight Data Recorder\" for Enabling Full-System Multiprocessor Deterministic Replay.",
                    "A Highly-Configurable Cache Architecture for Embedded Systems.",
                    "Energy Efficient Co-Adaptive Instruction Fetch and Issue.",
                    "Positional Adaptation of Processors: Application to Energy Reduction.",
                    "DRPM: Dynamic Speed Control for Power Mangagement in Server Class Disks.",
                    "Token Coherence: Decoupling Performance and Correctness.",
                    "GOAL: A Load-Balanced Adaptive Routing Algorithm for Torus Networks.",
                    "Using Destination-Set Prediction to Improve the Latency/Bandwidth Tradeoff in Shared-Memory Multiprocessors.",
                    "Performance Analysis of the Alpha 21364-BAsed HP GS1280 Multiprocessor.",
                    "Parallelism in the Front-End.",
                    "Effective ahead Pipelining of Instruction Block Address Generation.",
                    "Cyclone: A Broadcast-Free Dynamic Instruction Scheduler with Selective Replay.",
                    "Improving Dynamic Cluster Assignment for Clustered Trace Cache Processors.",
                    "Dynamically Managing the Communication-Parallelism Trade-off in Future Clustered Processors.",
                    "A Pipelined Memory Architecture for High Throughput Network Processors.",
                    "Efficient Use of Memory Bandwidth to Improve Network Processor Throughput.",
                    "Improving Branch Prediction by Dynamic Dataflow-Based Identification of Correlated Branches from a Large Global History.",
                    "Detecting Global Stride Locality in Value Streams.",
                    "Phase Tracking and Prediction.",
                    "Virtual Simple Architecture (VISA): Exceeding the Complexity Limit in Safe Real-Time Systems.",
                    "DISE: A Programmable Macro Engine for Customizing Applications.",
                    "Building Quantum Wires: The Long and the Short of It.",
                    "Guided Region Prefetching: A Cooperative Hardware/Software Approach.",
                    "Overcoming the Limitations of Conventional Vector Processors.",
                    "A Performance Analysis of PIM, Stream Processing, and Tiled Processing on Memory-Intensive Signal Processing Kernels.",
                    "Exploiting ILP, TLP and DLP with the Polymorphous TRIPS Architecture.",
                    "The Jrpm System for Dynamically Parallelizing Java Programs."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2003",
                "sub_name": "Proceedings of the 2003 workshop on Computer architecture education - Held in conjunction with the 30th International Symposium on Computer Architecture, WCAE@ISCA 2003, San Diego, California, USA, June 8, 2003.",
                "count": 16,
                "papers": [
                    "Welcome.",
                    "Teaching and teaching computer architecture: two very different topics: (some opinions about each).",
                    "Intel® Itanium® floating-point architecture.",
                    "DOP: a CPU core for teaching basics of computer architecture.",
                    "Superscalar out-of-order demystified in four instructions.",
                    "Bridging the gap between the undergraduate and graduate experience in computer systems studies.",
                    "Integration of computer security laboratories into computer architecture courses to enhance undergraduate education.",
                    "Combining learning strategies and tools in a first course in computer architecture.",
                    "Building resources for teaching computer architecture through electronic peer review.",
                    "Laboratory options for the computer science major.",
                    "Activating computer architecture with classroom presenter.",
                    "The liberty simulation environment as a pedagogical tool.",
                    "Multimedia components for the visualization of dynamic behavior in computer architectures.",
                    "Didactic architectures and simulator for network processor learning.",
                    "On the introduction of reconfigurable hardware into computer architecture education.",
                    "Use of HDLs in teaching of computer hardware courses."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "29th ISCA 2002",
        "info": "Anchorage, Alaska, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2002",
                "sub_name": "29th International Symposium on Computer Architecture (ISCA 2002), 25-29 May 2002, Anchorage, AK, USA.",
                "count": 27,
                "papers": [
                    "The Optimum Pipeline Depth for a Microprocessor.",
                    "The Optimal Logic Depth Per Pipeline Stage is 6 to 8 FO4 Inverter Delays.",
                    "Increasing Processor Performance by Implementing Deeper Pipelines.",
                    "Efficient Dynamic Scheduling Through Tag Elimination.",
                    "Slack: Maximizing Performance Under Technological Constraints.",
                    "A Large, Fast Instruction Window for Tolerating Cache Misses.",
                    "An Instruction Set and Microarchitecture for Instruction Level Distributed Processing.",
                    "Transient-Fault Recovery Using Simultaneous Multithreading.",
                    "Detailed Design and Evaluation of Redundant Multithreading Alternatives.",
                    "ReVive: Cost-Effective Architectural Support for Rollback Recovery in Shared-Memory Multiprocessors.",
                    "SafetyNet: Improving the Availability of Shared Memory Multiprocessors with Global Checkpoint/Recovery.",
                    "Dynamic Fine-Grain Leakage Reduction Using Leakage-Biased Bitlines.",
                    "Drowsy Caches: Simple Techniques for Reducing Leakage Power.",
                    "Power and Performance Evaluation of Globally Asynchronous Locally Synchronous Processors.",
                    "Using a User-Level Memory Thread for Correlation Prefetching.",
                    "Avoiding Initialization Misses to the Heap.",
                    "Going the Distance for TLB Prefetching: An Application-Driven Study.",
                    "Timekeeping in the Memory System: Predicting and Optimizing Memory Behavior.",
                    "Implementing Optimizations at Decode Time.",
                    "Managing Multi-Configuration Hardware via Dynamic Working Set Analysis.",
                    "Queue Pair IP: A Hybrid Architecture for System Area Networks.",
                    "Experiences with VI Communication for Database Storage.",
                    "Speculative Dynamic Vectorization.",
                    "Tarantula: A Vector Extension to the Alpha Architecture.",
                    "Design Tradeoffs for the Alpha EV8 Conditional Branch Predictor.",
                    "Difficult-Path Branch Prediction Using Subordinate Microthreads.",
                    "A Scalable Instruction Queue Design Using Dependence Chains."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2002",
                "sub_name": "Proceedings of the 2002 workshop on Computer architecture education - Held in conjunction with the 29th International Symposium on Computer Architecture, WCAE@ISCA 2002, Anchorage, Alaska, USA, May 26, 2002.",
                "count": 23,
                "papers": [
                    "Welcome.",
                    "Introducing new variables and constraints into computer architecture education: keynote address.",
                    "Teaching processor architecture with a VLSI perspective.",
                    "Teaching students computer architecture for new, nanotechnologies.",
                    "Using custom hardware and simulation to support computer systems teaching.",
                    "On the design of a new CPU architecture for pedagogical purposes.",
                    "Improving computer architecture education through the use of questioning.",
                    "An active learning environment for intermediate computer architecture courses.",
                    "Effective support of simulation in computer architecture instruction.",
                    "Web-based training on computer architecture: the case for JCachesim.",
                    "Digital LC-2: from bits & gates to a little computer.",
                    "MipsIt: a simulation and development environment using animation for computer architecture education.",
                    "CoDeNios: a function level co-design tool.",
                    "How computers really work: a children's guide.",
                    "Update plans: pointers in teaching computer architecture.",
                    "CASTLE: computer architecture self-testing and learning system.",
                    "Development of a digital instrument as a motivational component in teaching embedded computers.",
                    "ILP in the undergraduate curriculum.",
                    "PECTOPAH: promoting education in computer technology using an open-ended pedagogically adaptable hierarchy.",
                    "Read, use, simulate, experiment and build: an integrated approach for teaching computer architecture.",
                    "An integrated laboratory for computer architecture and networking.",
                    "A lab course of computer organization.",
                    "A survey of web resources for teaching computer architecture."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "28th ISCA 2001",
        "info": "Göteborg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2001",
                "sub_name": "Proceedings of the 28th Annual International Symposium on Computer Architecture, ISCA 2001, Göteborg, Sweden, June 30-July 4, 2001.",
                "count": 24,
                "papers": [
                    "Execution-based prediction using speculative slices.",
                    "Speculative precomputation: long-range prefetching of delinquent loads.",
                    "Dynamically allocating processor resources between nearby and distant ILP.",
                    "Tolerating memory latency through software-controlled pre-execution in simultaneous multithreading processors.",
                    "Data prefetching by dependence graph precomputation.",
                    "Concurrency, latency, or system overhead: which has the largest impact on uniprocessor DRAM-system performance?.",
                    "Focusing processor policies via critical-path prediction.",
                    "Automated design of finite state machine predictors for customized processors.",
                    "Better exploration of region-level value locality with integrated computation reuse and value prediction.",
                    "CryptoManiac: a fast flexible architecture for secure communication.",
                    "QoS provisioning in clusters: an investigation of Router and NIC design.",
                    "Locality vs. criticality.",
                    "Dead-block prediction & dead-block correlating prefetchers.",
                    "Code layout optimizations for transaction processing workloads.",
                    "Exploring and exploiting wire-level pipelining in emerging technologies.",
                    "NanoFabrics: spatial computing using molecular electronics.",
                    "A simple method for extracting models for protocol code.",
                    "Removing architectural bottlenecks to the scalability of speculative parallelization.",
                    "Power and energy reduction via pipeline balancing.",
                    "Energy-effective issue logic.",
                    "Cache decay: exploiting generational behavior to reduce cache leakage power.",
                    "Variability in the execution of multimedia applications and implications for architecture.",
                    "Measuring Experimental Error in Microprocessor Simulation.",
                    "Rapid profiling via stratified sampling."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "27th ISCA 2000",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/2000",
                "sub_name": "27th International Symposium on Computer Architecture (ISCA 2000), June 10-14, 2000, Vancouver, BC, Canada.",
                "count": 29,
                "papers": [
                    "A scalable approach to thread-level speculation.",
                    "Architectural support for scalable speculative parallelization in shared-memory multiprocessors.",
                    "Transient fault detection via simultaneous multithreading.",
                    "Trace preconstruction.",
                    "Completion time multiple branch prediction for enhancing trace cache performance.",
                    "A hardware mechanism for dynamic extraction and relayout of program hot spots.",
                    "HLS: combining statistical and symbolic simulation to guide microprocessor designs.",
                    "Wattch: a framework for architectural-level power analysis and optimizations.",
                    "Energy-driven integrated hardware-software optimizations using SimplePower.",
                    "A fully associative software-managed cache design.",
                    "Recency-based TLB preloading.",
                    "Memory access scheduling.",
                    "Selective, accurate, and timely self-invalidation using last-touch prediction.",
                    "An embedded DRAM architecture for large-scale spatial-lattice computations.",
                    "Smart Memories: a modular reconfigurable architecture.",
                    "Understanding the backward slices of performance degrading instructions.",
                    "On the value locality of store instructions.",
                    "Performance analysis of the Alpha 21264-based Compaq ES40 system.",
                    "Lx: a technology platform for customizable VLIW embedded processing.",
                    "Reconfigurable caches and their application to media processing.",
                    "CHIMAERA: a high-performance architecture with a tightly-coupled reconfigurable functional unit.",
                    "Circuits for wide-window superscalar processors.",
                    "Clock rate versus IPC: the end of the road for conventional microarchitectures.",
                    "Vector instruction set support for conditional operations.",
                    "Instruction path coprocessors.",
                    "Piranha: a scalable architecture based on single-chip multiprocessing.",
                    "Allowing for ILP in an embedded Java processor.",
                    "Early load address resolution via register tracking.",
                    "Multiple-banked register file architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/2000",
                "sub_name": "Proceedings of the 2000 workshop on Computer architecture education, WCAE@ISCA 2000, Vancouver, BC, Canada, June 10, 2000.",
                "count": 18,
                "papers": [
                    "Welcome.",
                    "What and why about architecture for embedded systems.",
                    "A microprocessor survey course: exploring advanced computer architecture in practice.",
                    "A first year computer organization course on the web: make the magic disappear.",
                    "Experiences integrating research tools and projects into computer architecture courses.",
                    "SATSim: a superscalar architecture trace simulator using interactive animation.",
                    "Simulation and analysis in the small: the case for simple models, metrics and microbenchmarks in computer architecture teaching and research.",
                    "Enhancements and applications of the SimpleScalar simulator for undergraduate and graduate computer architecture education.",
                    "esim: a structural design language and simulator for computer architecture education.",
                    "Integrating hardware and software concepts in a microprocessor-based system design lab.",
                    "Structured embedded systems design.",
                    "Active and group learning in the computer architecture classroom.",
                    "Learning outside of the classroom: the Northeastern University research co-op fellowship program.",
                    "Virtual machines as an aid in teaching computer concepts.",
                    "In-lecture hardware demonstrations with a logic analyzer to illustrate pipelined execution and cache/memory behavior.",
                    "Using the computer architecture course database.",
                    "Hands-on computer architecture: teaching processor and integrated systems design with FPGAs.",
                    "A network-computing infrastructure for tool experimentation applied to computer architecture education."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "26th ISCA 1999",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1999",
                "sub_name": "Proceedings of the 26th Annual International Symposium on Computer Architecture, ISCA 1999, Atlanta, Georgia, USA, May 2-4, 1999.",
                "count": 26,
                "papers": [
                    "Maps: A Compiler-Managed Memory System for Raw Machines.",
                    "Dynamic Vectorization: A Mechanism for Exploiting Far-Flung ILP in Ordinary Programs.",
                    "PipeRench: A Coprocessor for Streaming multimedia Acceleration.",
                    "Speculation Techniques for Improving Load Related Instruction Scheduling.",
                    "Correlated Load-Address Predictors.",
                    "Selective Value Prediction.",
                    "Tolerating Late Memory Traps in ILP Processors.",
                    "Memory Forwarding: Enabling Aggressive Layout Optimizations by Guaranteeing the Safety of Data Relocation.",
                    "Decoupling Local Variable Accesses in a Wide-Issue Superscalar Processor.",
                    "Effective Jump-Pointer Prefetching for Linked Data Structures.",
                    "Performance of Image and Video Processing with General-Purpose Processors and Media ISA Extensions.",
                    "A Hardware-Driven Profiling Scheme for Identifying Program Hot Spots to Support Runtime Optimization.",
                    "Commit-Reconcile & Fences (CRF): A New Memory Model for Architects and Compiler Writers.",
                    "Is SC + ILP=RC?",
                    "Memory Sharing Predictor: The Key to a Speculative Coherent DSM.",
                    "Simultaneous Subordinate Microthreading (SSMT).",
                    "The Block-Based Trace Cache.",
                    "The Program Decision Logic Approach to Predicated Execution.",
                    "A Performance Comparison of Contemporary DRAM Architectures.",
                    "A Scalable Front-End Architecture for Fast Instruction Delivery.",
                    "Area Efficient Architectures for Information Integrity in Cache Memories.",
                    "Value Prediction in VLIW Machines.",
                    "Storageless Value Prediction Using Prior Register Values.",
                    "Using Network Interface Support to Avoid Asynchronous Protocol Processing in Shared Virtual Memory Systems.",
                    "Multicast Snooping: A New Coherence Method Using a Multicast Address Network.",
                    "Scaling Application Performance on a Cache-Coherent Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "25th ISCA 1998",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1998",
                "sub_name": "Proceedings of the 25th Annual International Symposium on Computer Architecture, ISCA 1998, Barcelona, Spain, June 27 - July 1, 1998.",
                "count": 33,
                "papers": [
                    "Memory System Characterization of Commercial Workloads.",
                    "Performance Characterization of a Quad Pentium Pro SMP using OLTP Workloads.",
                    "Execution Characteristics of Desktop Applications on Windows NT.",
                    "An Analysis of Database Workload Performance on Simultaneous Multithreaded Processors.",
                    "An Analysis of Correlation and Predictability: What Makes Two-Level Branch Predictors Work.",
                    "Branch Prediction Based on Universal Data Compression Algorithms.",
                    "Modeling Program Predictability.",
                    "Multi-Level Texture Caching for 3D Graphics Hardware.",
                    "Switcherland: A QoS Communication Architecture for Workstation Clusters.",
                    "Declustered Disk Array Architectures with Optimal and Near-Optimal Parallelism.",
                    "Confidence Estimation for Speculation Control.",
                    "Pipeline Gating: Speculation Control for Energy Reduction.",
                    "Memory Dependence Prediction Using Store Sets.",
                    "Dynamic History-length Fitting: A Third Level of Adaptivity for Branch Prediction.",
                    "Accurate Indirect Branch Prediction.",
                    "Using Prediction to Accelerate Coherence Protocols.",
                    "Active Pages: A Computation Model for Intelligent Memory.",
                    "Increasing TLB Reach Using Superpages Backed by Shadow Memory.",
                    "Options for Dynamic Address Translation in COMAs.",
                    "Integrated Predicated and Speculative Execution in the IMPACT EPIC Architecture.",
                    "Threaded Multiple Path Execution.",
                    "Selective Eager Execution on the PolyPath Architecture.",
                    "Improving Trace Cache Effectiveness with Branch Promotion and Trace Packing.",
                    "The Effect of Instruction Fetch Bandwidth on Value Prediction.",
                    "Dynamic IPC/Clock Rate Optimization.",
                    "Performance Modeling and Code Partitioning for the DS Architecture.",
                    "Exploiting Fine-grain Thread Level Parallelism on the MIT Multi-ALU Processor.",
                    "Effects of Architectural and Technological Advances on the HP/Convex Exemplar's Memory and Communication Performance.",
                    "Design Choices in the SHRIMP System: An Empirical Study.",
                    "Flexible Use of Memory for Replication/Migration in Cache-Coherent DSM Multiprocessors.",
                    "Exploiting Spatial Locality in Data Caches Using Spatial Footprints.",
                    "Low Load Latency Through Sum-Addressed Memory (SAM).",
                    "Analytic Evaluation of Shared-memory Systems with ILP Processors."
                ]
            },
            {
                "sub_name_abbr": "conf/isca/1998reprints",
                "sub_name": "25 Years of the International Symposia on Computer Architecture (Selected Papers).",
                "count": 82,
                "papers": [
                    "Retrospective: Banyan Networks for Partitioning Multiprocessor Systems.",
                    "Retrospective: A Preliminary Architecture for a Basic Data Flow Processor.",
                    "Retrospective: Improving the Throughput of a Pipeline by Insertion of Delays.",
                    "Retrospective: What Have We Learned from the PDP-11 - What We Have Learned from VAX and Alpha.",
                    "Retrospective: An Instruction Timing Model of CPU Performance.",
                    "Retrospective: A Retrospective on High-Level Language Computer Architecture.",
                    "Retrospective: Architecture of a Massively Parallel Processor.",
                    "Retrospective: A Processor for a High-Performance Personal Computer.",
                    "Retrospective: Lockup-Free Instruction Fetch/Prefetch Cache Organization.",
                    "Retrospective: A Study of Branch Prediction Strategies.",
                    "Retrospective: RISC I: A Reduced Instruction Set Computer.",
                    "Retrospective: Decoupled Access/Execute Architectures.",
                    "Retrospective: A Personal Retrospective on the NYU Ultracomputer.",
                    "Retrospective: Using Cache Memory to Reduce Processor-Memory Traffic.",
                    "Retrospective: Very Long Instruction Word Architectures and the ELI-512.",
                    "Retrospective: Characterization of Processor Performance in the VAX-11/780.",
                    "Retrospective: A Low-Overhead Coherence Solution for Multiprocessors with Private Cache Memories.",
                    "Retrospective: Implementing Precise Interrupts in Pipelined Processors.",
                    "Retrospective: HPSm, a High Performance Restricted Data Flow Architecture Having Minimal Functionality.",
                    "Retrospective: A Retrospective on the Warp Machines.",
                    "Retrospective: Memory Access Buffering in Multiprocessors.",
                    "Retrospective: Instruction Issue Logic for High-Performance, Interruptable Pipelined Processors.",
                    "Retrospective: the J-machine.",
                    "Retrospective: On the Inclusion Properties for Multi-Level Cache Hierarchies.",
                    "Retrospective: Evaluation of Directory Dchemes for Cache Coherence.",
                    "Retrospective: Weak Ordering - A New Definition.",
                    "Retrospective: Memory Consistency and Event Ordering in Scalable Shared-Memory Multiprocessors.",
                    "Retrospective: Improving Direct-Mapped Cache Performance by the Addition of a Small Fully-Associative Cache and Prefetch Buffers.",
                    "Retrospective: Monsoon: An Explicit Token-Store Architecture.",
                    "Retrospective: IMPACT: An Architectural Framework for Multiple-Instruction Issue.",
                    "Retrospective: The DASH Prototype: Implementation and Performance.",
                    "Retrospective: Active Messages: A Mechanism for Integrating Computation and Communication.",
                    "Retrospective: The Turn Model for Adaptive Routing.",
                    "Retrospective: Alternative Implementations of Two-Level Adaptive Training Branch Prediction.",
                    "Retrospective: The Cedar System.",
                    "Retrospective: Virtual Memory Mapped Network Interface for the SHRIMP Multicomputer.",
                    "Retrospective: The Stanford FLASH Multiprocessor.",
                    "Retrospective: Tempest and Typhoon: User-Level Shared Memory.",
                    "Retrospective: The MIT Alewife Machine: Architecture and Performance.",
                    "Retrospective: Multiscalar Processors.",
                    "Retrospective: Simultaneous Multithreading: Maximizing On-Chip Parallelism.",
                    "Banyan Networks for Partitioning Multiprocessor Systems.",
                    "A Primlinary Architecture for a Basic Data-Flow Processor.",
                    "Improving the Throughput of a Pipeline by Insertion of Delays.",
                    "Computer Structures: What Have We Learned from the PDP-11?",
                    "An Instruction Timing Model of CPU Performance.",
                    "Retrospective on High-Level Language Computer Architecture.",
                    "Architecture of a Massively Parallel Processor.",
                    "A Processor for a High-Performance Personal Computer.",
                    "Lockup-Free Instruction Fetch/Prefetch Cache Organization.",
                    "A Study of Branch Prediction Strategies.",
                    "RISC I: A Reduced Instruction Set VLSI Computer.",
                    "Decoupled Access/Execute Computer Architectures.",
                    "The NYU Ultracomputer - Designing a MIMD, Shared-Memory Parallel Machine.",
                    "Using Cache Memory to Reduce Processor-Memory Traffic.",
                    "Very Long Instruction Word Architectures and the ELI-512.",
                    "A Characterization of Processor Performance in the VAX-11/780.",
                    "A Low-Overhead Coherence Solution for Multiprocessors with Private Cache Memories.",
                    "Implementation of Precise Interupts in Pipelined Processors.",
                    "HPSm, a High Performance Restricted Data Flow Architecture Having Minimal Functionality.",
                    "Warp Architecture and Implementation.",
                    "Memory Access Buffering in Multiprocessors.",
                    "Instruction Issue Logic for High-Performance, Interruptable Pipelined Processors.",
                    "Architecture of a Message-Driven Processor.",
                    "On the Inclusion Properties for Multi-Level Cache Hierarchies.",
                    "An Evaluation of Directory Schemes for Cache Coherence.",
                    "Weak Ordering - A New Definition.",
                    "Memory Consistency and Event Ordering in Scalable Shared-Memory Multiprocessors.",
                    "Improving Direct-Mapped Cache Performance by the Addition of a Small Fully-Associative Cache Prefetch Buffers.",
                    "Monsoon: An Explicit Token-Store Architecture.",
                    "IMPACT: An Architectural Framework for Multiple-Instruction-Issue Processors.",
                    "The DASH Prototype: Implementation and Performance.",
                    "Active Messages: A Mechanism for Integrated Communication and Computation.",
                    "The Turn Model for Adaptive Routing.",
                    "Alternative Implementations of Two-Level Adaptive Branch Prediction.",
                    "The Cedar System and an Initial Performance Study.",
                    "Virtual Memory Mapped Network Interface for the SHRIMP Multicomputer.",
                    "The Stanford FLASH Multiprocessor.",
                    "Tempest and Typhoon: User-Level Shared Memory.",
                    "The MIT Alewife Machine: Architecture and Performance.",
                    "Multiscalar Processors.",
                    "Simultaneous Multithreading: Maximizing On-Chip Parallelism."
                ]
            },
            {
                "sub_name_abbr": "conf/wcae/1998",
                "sub_name": "Proceedings of the 1998 workshop on Computer architecture education, WCAE@ISCA 1998, Barcelona, Spain, June 1998.",
                "count": 32,
                "papers": [
                    "Computer architecture education at the University of Illinois.",
                    "Computer architecture instruction at the University of Michigan.",
                    "Research presentation methodology taught at the University of Belgrade.",
                    "The integrated computer engineering design (ICED) curriculum.",
                    "Teaching computer systems to majors: a MIPS based solution.",
                    "The computer architecture sequence at Michigan State University.",
                    "A rudimentary machine: experiences in the design of a pedagogic computer.",
                    "The training environment for the course on microprocessor systems at the Politecnico di Torino.",
                    "ESCAPE: environment for the simulation of computer architectures for the purpose of education.",
                    "Using verilog HDL to teach computer architecture concepts.",
                    "A lab course on computer architecture.",
                    "Authoring a multimedia book: design and implementation considerations.",
                    "A holistic approach to computer system design education based on system simulation techniques.",
                    "A proposal of computer architecture courses for the computer engineering curricula of the Polytechnic University of Cataluyna.",
                    "Experiencing quantitative computer architecture.",
                    "Teaching methodology at the EUI-FI.",
                    "Performance monitoring in advanced computer architecture.",
                    "ASF: a teaching and rsearch object-oriented simulation tool for computer architecture design and performance evaluation.",
                    "Introducing computer architecture education in the first course of computer science career.",
                    "Petri nets as a tool for teaching operating systems.",
                    "Integration of CAD tools and structured design principles in an undergraduate computer engineering curriculum.",
                    "SENS, design, development and evaluation of a digital course on signal processing.",
                    "A hierarchical memory system environment.",
                    "Computer organization and architecture teaching in the University School of Computer Science and in the computer science faculty of the University of Polytechnic University of Valencia.",
                    "The architecture curriculum at UC-Davis.",
                    "The undergraduate curriculum in the electrical and computer engineering department at the University of Texas at Austin.",
                    "Computer engineering using innovative instructional technologies at the University of Southern California.",
                    "Computer architecture course database: implementation and status report.",
                    "An educational environment for designing and performance tuning of embedded systems.",
                    "Learning the relationship between computer architecture and technology by reconfiguring.",
                    "Reconfigurable hardware devices evoluation: an important opportunity for full span computer architecture education.",
                    "Interface issues in running computer architecture tools via the www."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "24th ISCA 1997",
        "info": "Boulder, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1997",
                "sub_name": "Proceedings of the 24th International Symposium on Computer Architecture, Denver, Colorado, USA, June 2-4, 1997.",
                "count": 30,
                "papers": [
                    "Improving Superscalar Instruction Dispatch and Issue by Exploiting Dynamic Code Sequences.",
                    "Exploiting Instruction Level Parallelism in Processors by Caching Scheduled Groups.",
                    "DAISY: Dynamic Compilation for 100% Architectural Compatibility.",
                    "On Deadlocks in Interconnection Networks.",
                    "Implementing Multidestination Worms in Switch-Based Parallel Systems: Architectural Alternatives and their Impact.",
                    "Tolerating Multiple Failures in RAID Architectures with Optimal Storage and Uniform Declustering.",
                    "Hardware Fault Containment in Scalable Shared-Memory Multiprocessors.",
                    "Effects of Communication Latency, Overhead, and Bandwidth in a Cluster Architecture.",
                    "The Mercury Interconnect Architecture: A Cost-effective Infrastructure for High-performance Servers.",
                    "The Design and Analysis of a Cache Architecture for Texture Mapping.",
                    "Designing High Bandwidth On-Chip Caches.",
                    "Memory-System Design Considerations for Dynamically-Scheduled Processors.",
                    "The Interaction of Software Prefetching with ILP Processors in Shared-Memory Systems.",
                    "VM-Based Shared Memory on Low-Latency, Remote-Memory-Access Networks.",
                    "Efficient Synchronization: Let Them Eat QOLB.",
                    "Dynamic Speculation and Synchronization of Data Dependences.",
                    "Dynamic Instruction Reuse.",
                    "Complexity-Effective Superscalar Processors.",
                    "Coherence Controller Architectures for SMP-Based CC-NUMA Multiprocessors.",
                    "Reactive NUMA: A Design for Unifying S-COMA and CC-NUMA.",
                    "The SGI Origin: A ccNUMA Highly Scalable Server.",
                    "Prefetching Using Markov Predictors.",
                    "Data Prefetching on the HP PA-8000.",
                    "Target Prediction for Indirect Jumps.",
                    "The Agree Predictor: A Mechanism for Reducing Negative Branch History Interference.",
                    "Trading Conflict and Capacity Aliasing in Conditional Branch Predictors.",
                    "A Language for Describing Predictors and Its Application to Automatic Synthesis.",
                    "Run-Time Adaptive Cache Hierarchy Management via Reference Analysis.",
                    "The Energy Efficiency of IRAM Architectures.",
                    "DataScalar Architectures."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "23rd ISCA 1996",
        "info": "Philadephia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1996",
                "sub_name": "Proceedings of the 23rd Annual International Symposium on Computer Architecture, Philadelphia, PA, USA, May 22-24, 1996.",
                "count": 28,
                "papers": [
                    "Using Hybrid Branch Predictors to Improve Branch Prediction Accuracy in the Presence of Context Switches.",
                    "An Analysis of Dynamic Branch Prediction Schemes on System Workloads.",
                    "Correlation and Aliasing in Dynamic Branch Predictors.",
                    "Decoupled Hardware Support for Distributed Shared Memory.",
                    "MGS: A Multigrain Shared Memory System.",
                    "COMA: An Opportunity for Building Fault-Tolerant Scalable Shared Memory Multiprocessors.",
                    "Evaluation of Design Alternatives for a Multiprocessor Microprocessor.",
                    "Memory Bandwidth Limitations of Future Microprocessors.",
                    "Missing the Memory Wall: The Case for Processor/Memory Integration.",
                    "Don't Use the Page Number, But a Pointer To It.",
                    "The Difference-bit Cache.",
                    "Understanding Application Performance on Shared Virtual Memory Systems.",
                    "Application and Architectural Bottlenecks in Large Scale Distributed Shared Memory Machines.",
                    "Increasing Cache Port Efficiency for Dynamic Superscalar Microprocessors.",
                    "High-Bandwidth Address Translation for Multiple-Issue Processors.",
                    "DCD - Disk Caching Disk: A New Approach for Boosting I/O Performance.",
                    "Polling Watchdog: Combining Polling and Interrupts for Efficient Message Handling.",
                    "Exploiting Choice: Instruction Fetch and Issue on an Implementable Simultaneous Multithreading Processor.",
                    "Evaluation of Multithreaded Uniprocessors for Commercial Application Environments.",
                    "Performance Comparison of ILP Machines with Cycle Time Evaluation.",
                    "Rotating Combined Queueing (RCQ): Bandwidth and Latency Guarantees in Low-Cost, High-Performance Networks.",
                    "A Router Architecture for Real-Time Point-to-Point Networks.",
                    "Coherent Network Interfaces for Fine-Grain Communication.",
                    "Informing Memory Operations: Providing Memory Performance Feedback in Modern Processors.",
                    "Instruction Prefetching of Systems Codes with Layout Optimized for Reduced Cache Misses.",
                    "Compiler and Hardware Support for Cache Coherence in Large-Scale Multiprocessors: Design Considerations and Performance Study.",
                    "Early Experience with Message-Passing on the SHRIMP Multicomputer.",
                    "STiNG: A CC-NUMA Computer System for the Commercial Marketplace."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "22nd ISCA 1995",
        "info": "Santa Margherita Ligure, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1995",
                "sub_name": "Proceedings of the 22nd Annual International Symposium on Computer Architecture, ISCA '95, Santa Margherita Ligure, Italy, June 22-24, 1995.",
                "count": 37,
                "papers": [
                    "The MIT Alewife Machine: Architecture and Performance.",
                    "The EM-X Parallel Computer: Architecture and Basic Performance.",
                    "The SPLASH-2 Programs: Characterization and Methodological Considerations.",
                    "Efficient Strategies for Software-Only Protocols in Shared-Memory Multiprocessors.",
                    "Dynamic Self-Invalidation: Reducing Coherence Overhead in Shared-Memory Multiprocessors.",
                    "Boosting the Performance of Hybrid Snooping Cache Protocols.",
                    "S-Connect: From Networks of Workstations to Supercomputer Performance.",
                    "Destage Algorithms for Disk Arrays with Non-Volatile Caches.",
                    "Evaluating Multi-Port Frame Buffer Designs for a Mesh-Connected Multicomputer.",
                    "Are Crossbars Really Dead? The Case for Optical Multiprocessor Interconnect Systems.",
                    "Exploring Configurations of Functional Units in an Out-of-Order Superscalar Processor.",
                    "Unconstrained Speculative Execution with Predicated State Buffering.",
                    "A Comparison of Full and Partial Predicated Execution Support for ILP Processors.",
                    "Implementation Trade-Offs in Using a Restricted Data Flow Architecture in a High Performance RISC Microprocessor.",
                    "Performance Evaluation of the PowerPC 620 Microarchitecture.",
                    "Reducing TLB and Memory Overhead Using Online Superpage Promotion.",
                    "Speeding Up Irregular Applications in Shared-Memory Multiprocessors: Memory Binding and Group Prefetching.",
                    "An Efficient, Fully Adaptive Deadlock Recovery Scheme: DISHA.",
                    "Analysis and implementation of hybrid switching.",
                    "Configurable Flow Control Mechanisms for Fault-Tolerant Routing.",
                    "NIFDY: A Low Overhead, High Throughput Network Interface.",
                    "Vector Multiprocessors with Arbitrated Memory Access.",
                    "Design of Cache Memories for Multi-Threaded Dataflow Architecture.",
                    "Skewed Associativity Enhances Performance Predictability.",
                    "A Comparative Analysis of Schemes for Correlated Branch Prediction.",
                    "Next Cache Line and Set Prediction.",
                    "A Comparison of Architectural Support for Messaging in the TMC CM-5 and the Cray T3D.",
                    "Optimizing Memory System Performance for Communication in Parallel Computers.",
                    "Empirical Evaluation of the CRAY-T3D: A Compiler Perspective.",
                    "Optimization of Instruction Fetch Mechanisms for High Issue Rates.",
                    "Instruction Fetching: Coping with Code Bloat.",
                    "Instruction Cache Fetch Policies for Speculative Execution.",
                    "Streamlining Data Cache Access with Fast Address Calculation.",
                    "CAT - Caching Address Tags: A Technique for Reducing Area Cost of On-Chip Caches.",
                    "Simultaneous Multithreading: Maximizing On-Chip Parallelism.",
                    "Architecture Validation for Processors.",
                    "Multiscalar Processors."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "21st ISCA 1994",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1994",
                "sub_name": "Proceedings of the 21st Annual International Symposium on Computer Architecture. Chicago, IL, USA, April 1994.",
                "count": 34,
                "papers": [
                    "Fast and Accurate Instruction Fetch and Branch Prediction.",
                    "The Impact of Unresolved Branches on Branch Prediction Scheme Performance.",
                    "Evaluating Stream Buffers as a Secondary Cache Replacement.",
                    "Tradeoffs in Two-Level On-Chip Caching.",
                    "Architectural Support for Performance Tuning: A Case Study on the SPARCcenter2000.",
                    "Characterization of Alpha AXP Performance Using TP and SPEC Workloads.",
                    "Measurement-Based Characterization of Global Memory and Network Contention, Operating System and Parallelization Overheads: A Case Study on Shared-Memory Multiprocessor.",
                    "Evaluating the Memory Overhead Required for COMA Architectures.",
                    "A Comparison of Message Passing and Shared Memory Architectures for Data Parallel Programs.",
                    "Software Versus Hardware Shared-Memory Implementation: A Case Study.",
                    "Guarded Executing and Branch Prediction in Dynamic ILP Processors.",
                    "Branch with Masked Squashing in Superpipelined Processors.",
                    "Virtual Memory Mapped Network Interface for the SHRIMP Multicomputer.",
                    "Architecture and Evaluation of High-Speed Networking Subsystem for Distributed-Memory Systems.",
                    "Exploring the Design Space for a Shared-Cache Multiprocessor.",
                    "Impact of Sharing-Based Thread Placement on Multithreaded Architectures.",
                    "Combined Performance Gains of Simple Cache Protocol Extensions.",
                    "Speculative Disambiguation: A Compilation Technique for Dynamic Memory Disambiguation.",
                    "Complexity/Performance Tradeoffs with Non-Blocking Loads.",
                    "A Performance Study of Software and Hardware Data Prefetching Schemes.",
                    "RAID-II: A High-Bandwidth Network File Server.",
                    "EVENODD: An Optimal Scheme for Tolerating Double Disk Failures in RAID Architectures.",
                    "Crosshatch Disk Array for Improved Reliability and Performance.",
                    "METRO: A Router Architecture for High-Performance, Short-Haul Routing Networks.",
                    "Ariadne - An Adaptive Router for Fault-Tolerant Multicomputers.",
                    "Compressionless Routing: A Framework for Adaptive and Fault-Tolerant Routing.",
                    "The Stanford FLASH Multiprocessor.",
                    "Software-Extended Coherent Shared Memory: Performance and Cost.",
                    "Tempest and Typhoon: User-Level Shared Memory.",
                    "A Study of Single-Chip Processor/Cache Organizations for Large Numbers of Transistors.",
                    "A Unified Architectural Tradeoff Methodology.",
                    "Optimal Allocation of On-Chip Memory for Multiple-API Operating Systems.",
                    "Expected I-Cache Miss Rates via the Gap Model.",
                    "Decoupled Sectored Caches: Conciliating Low Tag Implementation Cost and Low Miss Ratio."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "20th ISCA 1993",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1993",
                "sub_name": "Proceedings of the 20th Annual International Symposium on Computer Architecture, San Diego, CA, USA, May 1993.",
                "count": 32,
                "papers": [
                    "Architectural Requirements of Parallel Scientific Applications with Explicit Communication.",
                    "Working Sets, Cache Sizes, and Node Granularity Issues for Large-Scale Multiprocessors.",
                    "Design Tradeoffs for Software-Managed TLBs.",
                    "Architectural Support for Translation Table Management in Large Address Space Machines.",
                    "The TickerTAIP Parallel RAID Architecture.",
                    "Parity Logging Overcoming the Small Write Problem in Redundant Disk Arrays.",
                    "The Architecture of a Fault-Tolerant Cached RAID Controller.",
                    "The Detection and Elimination of Useless Misses in Multiprocessors.",
                    "Adaptive Cache Coherency for Detecting Migratory Shared Data.",
                    "An Adaptive Cache Coherence Protocol Optimized for Migratory Sharing.",
                    "Register Relocation: Flexible Contexts for Multithreading.",
                    "Multiple Threads in Cyclic Register Windows.",
                    "Evaluation of Release Consistent Software Distributed Shared Memory on Emerging Network Technology.",
                    "Mechanisms for Cooperative Shared Memory.",
                    "A Case for Two-Way Skewed-Associative Caches.",
                    "Column-Associative Caches: A Technique for Reducing the Miss Rate of Direct-Mapped Caches.",
                    "Cache Write Policies and Performance.",
                    "Hierarchical Performance Modeling with MACS: A Case Study of the Convex C-240.",
                    "The Cedar System and an Initial Performance Study.",
                    "The J-Machine Multicomputer: An Architectural Evaluation.",
                    "16-Bit vs. 32-Bit Instructions for Pipelined Microprocessors.",
                    "Register Connection: A New Approach to Adding Registers into Instruction Set Architectures.",
                    "A Comparison of Dynamic Branch Predictors that Use Two Levels of Branch History.",
                    "The Performance of Cache-Coherent Ring-based Multiprocessors.",
                    "Limitations of Cache Prefetching on a Bus-Based Multiprocessor.",
                    "Transactional Memory: Architectural Support for Lock-Free Data Structures.",
                    "Evaluation of Mechanisms for Fine-Grained Parallel Programs in the J-Machine and the CM-5.",
                    "Improving AP1000 Parallel Computer Performance with Message Communication.",
                    "Performance of Cached DRAM Organizations in Vector Supercomputers.",
                    "The Chinese Remainder Theorem and the Prime Memory System.",
                    "Odd Memory Systems May be Quite Interesting.",
                    "A Comparison of Adaptive Wormhole Routing Algorithms."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "19th ISCA 1992",
        "info": "Gold Coast, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1992",
                "sub_name": "Proceedings of the 19th Annual International Symposium on Computer Architecture. Gold Coast, Australia, May 1992.",
                "count": 64,
                "papers": [
                    "A Performance Study of Memory Consistency Models.",
                    "Lazy Release Consistency for Software Distributed Shared Memory.",
                    "Hiding Memory Latency using Dynamic Scheduling in Shared-Memory Multiprocessors.",
                    "Effects of Building Blocks on the Performance of Super-Scalar Architectures.",
                    "Limits of Control Flow on Parallelism.",
                    "The Expandable Split Window Paradigm for Exploiting Fine-Grain Parallelism.",
                    "Towards a Shared-Memory Massively Parallel Multiprocessor.",
                    "Comparative Performance Evaluation of Cache-Coherent NUMA and COMA Architectures.",
                    "The DASH Prototype: Implementation and Performance.",
                    "Performance Evaluation of a Decoded Instruction Cache for Variable Instruction-Length Computers.",
                    "A Simulation Based Study of TLB Performance.",
                    "Alternative Implementations of Two-Level Adaptive Branch Prediction.",
                    "An Elementary Processor Architecture with Simultaneous Instruction Issuing from Multiple Threads.",
                    "Thread-based Programming for the EM-4 Hybrid Dataflow Machine.",
                    "*T: A Multithreaded Massively Parallel Architecture.",
                    "Adjustable Block Size Coherent Caches.",
                    "Performance Optimization of Pipelined Primary Caches.",
                    "Cache Replacement with Dynamic Exclusion.",
                    "Processor Coupling: Integrating Compile Time and Runtime Scheduling for Parallelism.",
                    "Improved Multithreading Techniques for Hiding Communication Latency in Multiprocessors.",
                    "Instruction-level Parallelism in Prolog: Analysis and Architectural Support.",
                    "Memory Latency Effects in Decoupled Architectures With a Single Data Memory Module.",
                    "Interleaved Parallel Schemes: Improving Memory Throughput on Supercomputers.",
                    "Active Messages: A Mechanism for Integrated Communication and Computation.",
                    "Planar-Adaptive Routing: Low-cost Adaptive Networks for Multiprocessors.",
                    "The Turn Model for Adaptive Routing.",
                    "Low-Latency Message Communication Support for the AP1000.",
                    "Futurebus+ as an I/O Bus: Profile B.",
                    "A Study of I/O System Organizations.",
                    "Comparison of Sparing Alternatives for Disk Arrays.",
                    "Monitoring Program Behaviour on SUPRENUM.",
                    "Dynamic Dependency Analysis of Ordinary Programs.",
                    "An Analysis of Loop Latency in Dataflow Execution.",
                    "A Novel Cache Design for Vector Processing.",
                    "Increasing the Number of Strides for Conflict-Free Vector Access.",
                    "Evaluation of the WM Architecture.",
                    "The Impact of Communication Locality on Large-Scale Multiprocessor Performance.",
                    "Performance of the SCI Ring.",
                    "Tradeoffs in Supporting Two Page Sizes.",
                    "OPAC: A floating-point coprocessor dedicated to compute-bound kernels.",
                    "Parallel electro-optical rule-based system for fast execution of expert systems.",
                    "A new compiler-directed cache coherence scheme for shared memory multiprocessors with fast and parallel explicit invalidation.",
                    "The time-constrained barrier synchronizer and its applications in parallel systems.",
                    "Performance evaluation of disk subsystems.",
                    "Architecture of a graphics processor.",
                    "Enhancing boosting with semantic register in a superscalar processor.",
                    "Prefetch unit for vector operations on scalar computers.",
                    "Memory management support for tiled array organization.",
                    "Data path issues in a highly concurrent machine.",
                    "Seamless - a latency-tolerant RISC-based multiprocessor architecture.",
                    "Performance of multiple-bus multiprocssor under non-uniform memory reference model.",
                    "A class of prefetch schemes for on-chip data caches.",
                    "Performance improvement for vector pipeline multiprocessor systems using a disordered execution model.",
                    "Pipelining and bypassing in a VLIW processor.",
                    "Synthesis of application-specific heterogeneous multiprocessor systems.",
                    "A partitioned translation lookaside buffer approach to reducing address bandwith.",
                    "Architectural and implementation tradeoffs in the design of multiple-context processors.",
                    "Implications of hierarchical N-body methods for multiprocessor architecture.",
                    "Expanded delta networks for very large parallel computers.",
                    "Revisit the case for direct-mapped chaches: a case for two-way set-associative level-two caches.",
                    "Directory-based cache coherency protocol for a ring-connected multiprocessor-array.",
                    "Cache write generate for high performance parallel processing.",
                    "Analysis of multithreaded microprocessors under multiprogramming.",
                    "Integrated computer architecture development system."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "18th ISCA 1991",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1991",
                "sub_name": "Proceedings of the 18th Annual International Symposium on Computer Architecture. Toronto, Canada, May, 27-30 1991.",
                "count": 38,
                "papers": [
                    "The SNAP-1 Parallel AI Prototype.",
                    "GT-EP: A Novel High-Performance Real-Time Architecture.",
                    "IXM2: A Parallel Associative Processor.",
                    "Branch History Table Prediction of Moving Target Branches due to Subroutine Returns.",
                    "An Architecture for Software-Controlled Data Prefetching.",
                    "Data Prefetching in Multiprocessor Vector Cache Memories.",
                    "Reducing Memory Contention in Shared Memory Multiprocessors.",
                    "Pseudo-Randomly Interleaved Memory.",
                    "Evaluation of Memory System Extensions.",
                    "High Performance Interprocessor Communication through Optical Wavelength Division Multiple Access Channels.",
                    "Race-Free Interconnection Networks and Multiprocessor Consistency.",
                    "Deadlock-Free Multicast Wormhole Routing in Multicomputer Networks.",
                    "Dynamic Base Register Caching: A Technique for Reducing Address Bus Width.",
                    "Implementing a Cache for a High-Performance GaAs Microprocessor.",
                    "Classification and Performance Evaluation of Instruction Buffering Techniques.",
                    "OHMEGA: A VLSI Superscalar Processor Architecture for Numerical Applications.",
                    "An Empirical Study of the CRAY Y-MP Processor Using the Perfect Club Benchmarks.",
                    "Instruction Level Profiling and Evaluation of the IBM/6000.",
                    "Performance Prediction and Tuning on a Multiprocessor.",
                    "Performance Evaluation of a Communication System for Transputer-Networks Based on Monitored Event Traces.",
                    "Chaos Router: Architecture and Performance.",
                    "Scheduling Pipelined Communication in Distributed Memory Multiprocessors for Real-Time Applications.",
                    "Detecting Data Races on Weak Memory Systems.",
                    "On the Validity of Trace-Driven Simulation for Multiprocessors.",
                    "Comparative Evaluation of Latency Reducing and Tolerating Techniques.",
                    "IMPACT: An Architectural Framework for Multiple-Instruction-Issue Processors.",
                    "Single Instruction Stream Parallelism is Greater Than Two.",
                    "Exploiting Fine-Grained Parallelism Through a Combination of Hardware and Software Techniques.",
                    "Comparison of Hardware and Software Cache Coherence Schemes.",
                    "Modeling the Performance of Limited Pointers Directories for Cache Coherence.",
                    "Flexible Register Management for Sequential Programs.",
                    "The Effect on RISC Performance of Register Set Size and Structure Versus Code Generation Strategy.",
                    "Multithreading: A Revisionist View of Dataflow Architectures.",
                    "Multi-Threaded Vectorization.",
                    "Strategies for Achieving Improved Processor Throughput.",
                    "Adaptive Storage Management for Very Large Virtual/Real Storage Systems.",
                    "Virtualizing the VAX Architecture.",
                    "Modeling and Measurement of the Impact of Input/Output on System Performance."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "17th ISCA 1990",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1990",
                "sub_name": "Proceedings of the 17th Annual International Symposium on Computer Architecture, Seattle, WA, USA, June 1990.",
                "count": 34,
                "papers": [
                    "Weak Ordering - A New Definition.",
                    "Memory Consistency and Event Ordering in Scalable Shared-Memory Multiprocessors.",
                    "Synchronization with Multiprocessor Caches.",
                    "Dynamic Processor Allocation in Hypercube Computers.",
                    "A New Approach to Fast Control of r2 x r2 3-Stage Benes Networks of r x r Crossbar Switches.",
                    "Virtual-Channel Flow Control.",
                    "Supporting Systolic and Memory Communciation in iWarp.",
                    "Monsoon: An Explicit Token-Store Architecture.",
                    "The K2 Parallel Processor: Architecture and Hardware Implementation.",
                    "APRIL: A Processor Architecture for Multiprocessing.",
                    "PLUS: A Distributed Shared-Memory System.",
                    "Adaptive Software Cache Management for Distributed Shared Memory Architectures.",
                    "An Empirical Evaluation of Two Memory-Efficient Directory Methods.",
                    "The Directory-Based Cache Coherence Protocol for the DASH Multiprocessor.",
                    "The Performance Impact of Block Sizes and Fetch Strategies.",
                    "Performance Comparison of Load/Store and Symmetric Instruction Set Architectures.",
                    "Reducing the Cost of Branches by Using Registers.",
                    "An Investigation of Static Versus Dynamic Scheduling.",
                    "VAX Vector Architecture.",
                    "Multiple Instruction Issue in the NonStop Cyclone Processor.",
                    "Performance of an OLTP Application on Symmetry Multiprocessor System.",
                    "The Impact of Synchronization and Granularity on Parallel Systems.",
                    "Trace-Driven Simulations for a Two-Level Cache Design in Open Bus Systems.",
                    "Performance Measurement and Trace Driven Simulation of Parallel CAD and Numeric Applications on a Hypercube Multicomputer.",
                    "Generation and Analysis of Very Long Address Traces.",
                    "Fast Prolog with an Extended General Purpose Architecture.",
                    "Architectural Support for the Management of Tightly-Coupled Fine-Grain Goals in Flat Concurrent Prolog.",
                    "Balance in Architectural Design.",
                    "A Study of I/O Behavior of Perfect Benchmarks on a Multiprocessor.",
                    "Maximizing Performance in a Striped Disk Array.",
                    "A Distributed I/O Architecture for HARTS.",
                    "Boosting Beyond Static Scheduling in a Superscalar Processor.",
                    "The TLB Slice - A Low-Cost High-Speed Address Translation Mechanism.",
                    "Improving Direct-Mapped Cache Performance by the Addition of a Small Fully-Associative Cache and Prefetch Buffers."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "16th ISCA 1989",
        "info": "Jerusalem, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1989",
                "sub_name": "Proceedings of the 16th Annual International Symposium on Computer Architecture. Jerusalem, Israel, June 1989.",
                "count": 46,
                "papers": [
                    "Evaluating the Performance of Four Snooping Cache Coherency Protocols.",
                    "Multi-level Shared Caching Techniques for Scalability in VMP-M/C.",
                    "Design and Performance of a Coherent Cache for Parallel Logic Programming Architectures.",
                    "The Epsilon Dataflow Processor.",
                    "An Architecture of a Dataflow Single Chip Processor.",
                    "Exploiting Data Parallelism in Signal Processing on a Data Flow Machine.",
                    "Architectural Mechanisms to Support Sparse Vector Processing.",
                    "A Dynamic Storage Scheme for Conflict-Free Vector Access.",
                    "SIMP (Single Instruction stream/Multiple Instruction Pipelining): A Novel High-Speed Single-Processor Architecture.",
                    "2-D SIMD Algorithms in the Perfect Shuffle Networks.",
                    "Systematic Hardware Adaptation of Systolic Algorithms.",
                    "Task Migration in Hypercube Multiprocessors.",
                    "Characteristics of Performance-Optimal Multi-Level Cache Hierarchies.",
                    "Supporting Reference and Dirty Bits in SPUR's Virtual Address Cache.",
                    "Inexpensive Implementations of Set-Associativity.",
                    "Organization and Performance of a Two-Level Virtual-Real Cache Hierarchy.",
                    "High Performance Communications in Processor Networks.",
                    "Introducing Memory into Switch Elements of Multiprocessor Interconnection Networks.",
                    "Using Feedback to Control Tree Saturation in Multistage Interconnection Networks.",
                    "Constructing Replicated Systems Using Processors with Point-to-Point Communication Links.",
                    "KCM: A Knowledge Crunching Machine.",
                    "A High Performance Prolog Processor with Multiple Function Units.",
                    "S. Yamaguchi, T. Bandoh: Evaluation of Memory System for Integrated Prolog Processor IPP.",
                    "A Type Driven Hardware Engine for Prolog Clause Retrieval over a Large Knowledge Base.",
                    "Comparing Software and Hardware Schemes For Reducing the Cost of Branches.",
                    "Improving Performance of Small On-Chip Instruction Caches.",
                    "Achieving High Instruction Cache Performance with an Optimizing Compiler.",
                    "The Impact of Code Density on Instruction Cache Performance.",
                    "Can Dataflow Subsume von Neumann Computing?",
                    "Exploring the Benefits of Multiple Hardware Contexts in a Multiprocessor Architecture: Preliminary Results.",
                    "Architectural and Organizational Tradeoffs in the Design of the MultiTitan CPU.",
                    "Run-Time Checking in Lisp by Integrating Memory Addressing and Range Checking.",
                    "Multiple vs. Wide Shared Bus Multiprocessors.",
                    "Performance Measurements on a Commercial Multiprocessor Running Parallel Code.",
                    "Interprocessor Communication Speed and Performance in Distributed-memory Parallel Processors.",
                    "Analysis of Computation-Communication Issues in Dynamic Dataflow Architectures.",
                    "Logic Simulation on Massively Parallel Architectures.",
                    "R256: A Research Parallel Processor for Scientific Computation.",
                    "A Three-Port/Three-Access Register File for Concurrent Processing and I/O Communication in a RISC-Like Graphics Engine.",
                    "An Architecture Framework for Application-Specific and Scalable Architectures.",
                    "Perfect Latin Squares and Parallel Array Access.",
                    "An Aperiodic Storage Scheme to Reduce Memory Conflicts in Vector Processors.",
                    "Analysis of Vector Access Performance on Skewed Interleaved Memory.",
                    "Adaptive Backoff Synchronization Techniques.",
                    "A Cache Consistency Protocol for Multiprocessors with Multistage Networks.",
                    "On Data Synchronization for Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "15th ISCA 1988",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1988",
                "sub_name": "Proceedings of the 15th Annual International Symposium on Computer Architecture, Honolulu, Hawaii, USA, May-June 1988.",
                "count": 50,
                "papers": [
                    "Critical Issues in Mapping Neural Networks on Message-Passing Multicomputers.",
                    "Multinomial Conjunctoid Statistical Learning Machines.",
                    "A Bit-Plane Architecture for Optical Computing with Two-Dimensional Symbolic Substitution.",
                    "The Reconfigurable Arithmetic Processor.",
                    "The Performance Potential of Multiple Functional Unit Processors.",
                    "Exploiting Parallel Microprocessor Microarchitectures With a Compiler Code Generator.",
                    "Analysis of Memory Referencing Behavior For Design of Local Memories.",
                    "Performance Evaluation of On-Chip Register and Cache Organizations.",
                    "On the Inclusion Properties for Multi-Level Cache Hierarchies.",
                    "A Simulation Study of Two-Level Caches.",
                    "Hyperswitch Network for the Hypercube Computer.",
                    "Analysis of Bus Hierarchies for Multiprocessors.",
                    "Extra Group Network: A Cost-Effective Fault-Tolerant Multistage Interconnection Network.",
                    "A Partial-Multiple-Bus Computer Structure with Improved Cost-Effectiveness.",
                    "Flagship: A Parallel Architecture for Declarative Programming.",
                    "Toward a Dataflow/von Neumann Hybrid Architecture.",
                    "Resource Requirements of Dataflow Programs.",
                    "Priority-Driven, Preemptive I/O Controllers for Real-Time Systems.",
                    "A Kernel-independent, Pipelined Architecture for Real-Time 2-D Convolution.",
                    "Exploiting Bit Level Concurrency in Real-Time Geometric Feature Extractions.",
                    "Measuring VAX 8800 Performance with a Histogram Hardware Monitor.",
                    "Multiprocessor Cache Analysis Using ATUM.",
                    "Trade-offs Between Devices and Paths in Achieving Disk Interleaving.",
                    "Design of a Concurrent Computer for Solving Systems of Linear Equations.",
                    "The White Dwarf: A High-Performance Application-Specific Processor.",
                    "Solving Partial Differential Equations in a Data-Driven Multiprocessor Environment.",
                    "Scrambled Storage for Parallel Memory Systems.",
                    "The Architecture of a Linda Coprocessor.",
                    "Deadlock Avoidance for Systolic Communication.",
                    "Cache Performance of Vector Processors.",
                    "Distributed Round-Robin and First-Come First-Serve Protocols and Their Application to Multiprocessor Bus Arbitration.",
                    "An Evaluation of Directory Schemes for Cache Coherence.",
                    "Performance Tradeoffs in Cache Design.",
                    "A Cache Coherence Scheme With Fast Selective Invalidation.",
                    "An Accurate and Efficient Performance Analysis Technique for Multiprocessor Snooping Cache-Consistency Protocols.",
                    "Destination Tag Routing Techniques Based on a State Model for the IADM Network.",
                    "Regular CC-Banyan Networks.",
                    "Traffic Analysis of Rectangular SW-Banyan Networks.",
                    "High-Performance Multi-Queue Buffers for VLSI Communication Switches.",
                    "A Cache-based Message Passing Scheme for a Shared-bus Multiprocessor.",
                    "IMPULSE: A High Performance Processing Unit for Multiprocessors for Scientific Calculation.",
                    "A Characterization of Sharing in Parallel Programs and Its Application to Coherency Protocol Evaluation.",
                    "A Fetch-And-Op Implementation for Parallel Computers.",
                    "Synchronizing Processors Through Memory Requests in a Tightly Coupled Multiprocessor.",
                    "Design and Performance of Special Purpose Hardware for Time Warp.",
                    "The VMP Multiprocessor: Initial Experience, Refinements and Performance Evlauation.",
                    "The Wisconsin Multicube: A New Large-Scale Cache-Coherent Multiprocessor.",
                    "Data Buffer Performance for Sequential Prolog Architectures.",
                    "MASA: A Multithreaded Processor Architecture for Parallel Symbolic Computing.",
                    "Parallel Architecture for OPS5."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "14th ISCA 1987",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1987",
                "sub_name": "Proceedings of the 14th Annual International Symposium on Computer Architecture. Pittsburgh, PA, USA, June 1987.",
                "count": 35,
                "papers": [
                    "Branch Folding in the CRISP Microprocessor: Reducing Branch Delay to Zero.",
                    "An Evaluation of Branch Architectures.",
                    "Checkpoint Repair for Out-of-order Execution Machines.",
                    "Instruction Issue Logic for High-Performance, Interruptable Pipelined Processors.",
                    "Fast Temporary Storage for Serial and Parallel Execution.",
                    "Performance Analysis and Design of a Logic Simulation Machine.",
                    "A Modular Systolic Architecture for Image Convolutions.",
                    "A Template Matching Algorithm Using Optically-Connected 3-D VLSI Architecture.",
                    "Mapping Data Flow Programs on a VLSI Array of Processors.",
                    "Analytical Modeling and Architectural Modifications of a Dataflow Computer.",
                    "A Unified Resource Management and Execution Control Mechanism for Data Flow Machines.",
                    "High Performance Integrated Prolog Processor IPP.",
                    "Performance Studies of a Parallel Prolog Architecture.",
                    "An Experimental VLSI Prolog Interpreter: Preliminary Measurements and Results.",
                    "Deterministic and Stochastic Modeling of Parallel Garbage Collection - Towards Real-Time Criteria.",
                    "The Sharing of Environment in AND-OR-Parallel Execution of Logic Programs.",
                    "Architectural Issues in Designing Symbolic Processors in Optics.",
                    "Rearrangeability of Multistage Shuffle/Exchange Networks.",
                    "Optimized Mesh-Connected Networks for SIMD and MIMD Architectures.",
                    "Performance Evaluation of Reduced Bandwidth Multistage Interconnection Networks.",
                    "Hardware Support for Interprocess Communication.",
                    "Architecture of a Message-Driven Processor.",
                    "Effect of Storage Allocation/Reclamation Methods on Parallelism and Storage Requirements.",
                    "Cache Design of a Sub-Micron CMOS System/370.",
                    "An Architectural Perspective on a Memory Access Controller.",
                    "Organization and Analysis of a Gracefully-Degrading Interleaved Memory System.",
                    "Correct Memory Operation of Cache-Based Multiprocessors.",
                    "Hierarchical Cache/Bus Architecture for Shared Memory Multiprocessors.",
                    "Multiprocessor Cache Design Considerations.",
                    "Performance Evaluation of Multiple Register Sets.",
                    "A Performance Analysis of Automatically Managed Top of Stack Buffers.",
                    "Concepts of the System/370 Vector Architecture.",
                    "WISQ: A Restartable Architecture Using Queues.",
                    "Architectural Tradeoffs in the Design of MIPS-X.",
                    "The Hardware Architecture of the CRISP Microprocessor."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "13th ISCA 1986",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1986",
                "sub_name": "Proceedings of the 13th Annual Symposium on Computer Architecture, Tokyo, Japan, June 1986.",
                "count": 50,
                "papers": [
                    "A Model and an Architecture for a Relational Knowledge Base.",
                    "Implementation and Evaluation of a List-Processing-Oriented Data Flow Machine.",
                    "A New String Search Hardware Architecture for VLSI.",
                    "Parallel Algorithms and Architectures for Rule-Based Systems.",
                    "Concert: Design of a Multiprocessor Development System.",
                    "Memory Requirements for Balanced Computer Architectures.",
                    "Graph Allocation in Static Dataflow Systems.",
                    "Software Implementation of a Recursive Fault Tolerance Algorithm on a Network of Computers.",
                    "Microprogrammable Processor for Object-Oriented Architecture.",
                    "An Instruction Fetch Unit for a Graph Reduction Machine.",
                    "Fast Object-Oriented Procedure Calls: Lessons from the Intel 432.",
                    "On Coupling Many Small Systems for Transaction Processing.",
                    "Performance Measurement of Paging Behavior in Multiprogramming Systems.",
                    "ATUM: A New Technique for Capturing Address Traces Using Microcode.",
                    "Experimenting With EPILOG: Some Results and Preliminary Conclusions.",
                    "A Unification Processor Based on a Uniformly Structured Cellular Hardware.",
                    "The Architecture and Preliminary Evaluation Results of the Experimental Parallel Inference Machine PIM-D.",
                    "An Efficient Routing Control Unit for the SIGMA Network E(4).",
                    "REYSM, A High Performance, Low Power Multi-Microprocessor Bus.",
                    "The Extra Stage Gamma Network.",
                    "Evaluation of the FACOM ALPHA Lisp Machine.",
                    "An Architecture for Efficient Lisp List Access.",
                    "A Functional Level Simulation Engine of MAN-YO: A Special Purpose Parallel Machine for Logic Design Automation.",
                    "Exploiting Parallelism in a Switch-Level Simulation Machine.",
                    "A Hardware Accelerator for Speech Recognition Algorithms.",
                    "Evaluation of a Prototype Data Flow Processor of the SIGMA-1 for Scientific Computations.",
                    "Stored Data Structures on the Manchester Dataflow Machine.",
                    "A Salable Dataflow Structure Store.",
                    "AT2=O(N log4 N), T=O(log N) Fast Fourier Transform in a Light Connected 3-Dimensional VLSI.",
                    "Modular Architecture for High Performance Implementation of FFT Algorithm.",
                    "Computing Size-Independent Matrix Problems on Systolic Array Processors.",
                    "A Computer with Low-Level Parallelism QA-2: Its Applications to 3-D Graphics and Prolog/Lisp Machines.",
                    "VLSI Oriented Asynchronous Architecture.",
                    "HPSm, a High Performance Restricted Data Flow Architecture Having Minimal Functionality.",
                    "On Design of Rotary Array Communication and Wavefront-Driven Algorithms for Solving Large-Scale Band-Limited Matrix Equations.",
                    "A Computer Architecture for Dynamic Finite Element Analysis.",
                    "Performance Evaluation of Vector Accesses in Parallel Memories Using a Skewed Storage Scheme.",
                    "Pseudo MIMD Array Processor - AAP2.",
                    "Scan Line Array Processors for Image Computation.",
                    "Warp Architecture and Implementation.",
                    "An In-Cache Address Translation Mechanism.",
                    "Software-Controlled Caches in the VMP Multiprocessor.",
                    "On the Use of Registers vs. Cache to Minimize Memory Traffic.",
                    "Highly Concurrent Scalar Processing.",
                    "Reducing the Cost of Branches.",
                    "Optimal Pipelining in Supercomputers.",
                    "A Class of Compatible Cache Consistency Protocols and their Support by the IEEE Futurebus.",
                    "Multiprocessor Cache Synchronization: Issues, Innovations, Evolution.",
                    "Memory Access Buffering in Multiprocessors.",
                    "Evaluation of the SPUR Lisp Architecture."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "12th ISCA 1985",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1985",
                "sub_name": "Proceedings of the 12th Annual Symposium on Computer Architecture, Boston, MA, USA, June 1985.",
                "count": 51,
                "papers": [
                    "Array Processor with Multiple Broadcasting.",
                    "Matrix Multiplication in an Interleaved Array Processing Architecture.",
                    "PIPE: A VLSI Decoupled Architecture.",
                    "TIDBITS: Speedup Via Time-Delay Bit-Slicing in ALU Design for VLSI Technology.",
                    "Implementation of Precise Interrupts in Pipelined Processors.",
                    "High-Speed Top-of-Stack Scheme for VLSI Processor: a Management Algorithm and Its Analysis.",
                    "Analyzing Multiple Register Sets.",
                    "Cache Evaluation and the Impact of Workload Choice.",
                    "Architecture of the Symbolics 3600.",
                    "Parallel Garbage Collection Without Synchronization Overhead.",
                    "An Efficient LISP-Execution Architecture with a New Representation for List Structures.",
                    "(SM)²-II: A New Version of the Sparse Matrix Solving Machine.",
                    "The GF11 Supercomputer.",
                    "Models for Use in the Design of Macro-Pipelined Parallel Processors.",
                    "Issues Related to MIMD Shared-memory Computers: The NYU Ultracomputer Approach.",
                    "MU6V: A Parallel Vector Processing System.",
                    "A Decentralized Control, Highly Concurrent Multiprocessor.",
                    "An Object Oriented Architecture.",
                    "Tagged Architecture: How Compelling Are its Advantages?",
                    "VM/4: ACOS-4 Virtual Machine Architecture.",
                    "Performance Studies of a Prolog Machine Architecture.",
                    "Design of a High-speed Prolog Machine (HPM).",
                    "A Hardware Unification Unit: Design and Analysis.",
                    "The FLEX/32 Multicomputer.",
                    "Closely Coupled Asynchronous Hierarchical and Parallel Processing in an Open Architecture.",
                    "Parallel Processing as a Language Design Problem.",
                    "Improvements in Multiprocessor System Design.",
                    "The Sequoia Computer: A Fault-Tolerant Tightly-Coupled Multiprocessor Architecture.",
                    "The Synapse N+1 System: Architectural Characteristics and Performance Data of a Tightly-Coupled Multiprocessor System.",
                    "An Architecture for High Volume Transaction Processing.",
                    "A Hardware Pipeline Algorithm for Relational Database Operation and Its Implementation Using Dedicated Hardware.",
                    "A Distributed Multiple-Response Resolver for Value-Ordered Retrieval.",
                    "Dynamic, Distributed Resource Configuration on SW-Banyans.",
                    "Implementing A Cache Consistency Protocol.",
                    "A Technique for Reducing Synchronization Overhead in Large Scale Multiprocessors.",
                    "The Transputer.",
                    "A Systolic Multiplier Unit and Its VLSI Design.",
                    "A Language for the Simulation of Systolic Architectures.",
                    "A Versatile Systolic Array for Matrix Computations.",
                    "The Hughes Data Flow Multiprocessor: Architecture for Efficient Signal and Data Processing.",
                    "An Abstract Parallel Graph Reduction Machine.",
                    "Data Flow on a Queue Machine.",
                    "Methods for Handling Structures in Data-Flow Systems.",
                    "The de Bruijn Multiprocessor Network: A Versatile Sorting Network.",
                    "Fault-Tolerant Scheme for Multistage Interconnection Networks.",
                    "Design and Analysis of Fault-Tolerant Multistage Interconnection Networks With Low Link Complexity.",
                    "The Performance Analysis of Partitioned Circuit Switched Multistage Interconnection Networks.",
                    "The Influence of Parallel Decomposition Strategies on the Performance of Multiprocessor Systems.",
                    "Performance Prediction Tools for Cedar: A Multiprocessor Supercomputer.",
                    "Analysis and Simulation of Multiplexed Single-Bus Networks With and Without Buffering.",
                    "Performance of a Message-Based Multiprocessor."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "11th ISCA 1984",
        "info": "Ann Arbor, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1984",
                "sub_name": "Proceedings of the 11th Annual Symposium on Computer Architecture, Ann Arbor, USA, June 1984.",
                "count": 46,
                "papers": [
                    "A Vector and Array Multiprocessor Extension of the Sylvan Architecture.",
                    "The Pringle Parallel Computer.",
                    "A State-of-the-Art SIMD Two-Dimensional FFT Array Processor.",
                    "The Architecture of REPLICA-A Special-Purpose Computer System for Active Multi-Sensory Perception of 3-Dimensional Objects.",
                    "A Generalized Object Display Processor Architecture.",
                    "A Special Purpose LSI Processor Using the DDA Algorithm for Image Transformation.",
                    "The Status of MANIP-A Multicomputer Architecture for Solving Combinatorial Extremum-Search Problems.",
                    "The Schuss Filter: A Processor for Non-Numerical Data Processing.",
                    "The Design and Implementation of a VLSI Chess Move Generator.",
                    "Performance Analysis of Circuit Switching Baseline Interconnection Networks.",
                    "The Importance of Being Square.",
                    "Connection Principles for Multipath Packet Switching Networks.",
                    "Instruction Issue Logic for Pipelined Supercomputers.",
                    "The Reduction of Branch Instruction Execution Overhead Using Structured Control Flow.",
                    "Fast Execution of Loops With IF Statements.",
                    "A Parallel Pipelined Relational Query Processor: An Architectural Overview.",
                    "An Efficient VLSI Dictionary Machine.",
                    "Dictionary Machines With a Small Number of Processors.",
                    "Experimental Evaluation of On-Chip Microprocessor Cache Memories.",
                    "The Use of Static Column RAM as a Memory Hierarchy.",
                    "The Design of an Object Oriented Architecture.",
                    "Architecture of SOAR: Smalltalk on a RISC.",
                    "Design of Instruction Set Architectures for Support of High-Level Languages .",
                    "Automatic Synthesis of Systolic Arrays from Uniform Recurrent Equations.",
                    "Multi-Dimensional Systolic Networks for Discrete Fourier Transform.",
                    "Data Broadcasting in Linearly Scheduled Array Processors.",
                    "Modular Matrix Multiplication on a Linear Array.",
                    "Joint Encryption and Error Correction Schemes.",
                    "Unidirectional Error Correction/Detection for VLSI Memory.",
                    "Error-Correcting Codes for Semiconductor Memories.",
                    "Soft Error Correction for Increased Densities in VLSI Memories.",
                    "Combining Speed with Alpha-Particle Induced Memory Error Tolerance in a Large Boolean Vector Machine (Extended Abstract).",
                    "On the Performance of Loosely Coupled Multiprocessors.",
                    "Scheduling of Tasks for Distributed Processors.",
                    "Message Repository Definitional Facility: An Architectural Model for Interprocess Communication.",
                    "Fault-Secure Algorithms for Multiple-Processor Systems.",
                    "Execution of Logic Programs on a Dataflow Architecture.",
                    "A High Performance Factoring Machine.",
                    "A Characterization of Processor Performance in the VAX-11/780.",
                    "The Peripheral Processor PP4 - A Highly Regular VLSI Processor.",
                    "VLSI Based Design Principles for MIMD Multiprocessor Computers with Distributed Memory Management.",
                    "A Multiprocessor Network Suitable for Single-Chip VLSI Implementation.",
                    "Dynamic Decentralized Cache Schemes for MIMD Parallel Processors.",
                    "A Low-Overhead Coherence Solution for Multiprocessors with Private Cache Memories.",
                    "An Economical Solution to the Cache Coherence Problem.",
                    "Cache Hit Ratios With Geometric Task Switch Intervals."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "10th ISCA 1983",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/83",
                "sub_name": "Proceedings of the 10th Annual Symposium on Computer Architecture, 1983.",
                "count": 54,
                "papers": [
                    "Size, Power, and Speed.",
                    "Towards a Taxonomy of Computer Architecture Based on the Machine Data Type View.",
                    "Frameworks for a Taxonomy of Fault-Tolerance Attributes in Computer Systems.",
                    "Caddie - An Interactive Design Environment.",
                    "On the Verification of Computer Architectures Using an Architecture Description Language.",
                    "Research on Synthesis of Concurrent Computing Systems.",
                    "Architecture of the PSC: A Programmable Systolic Chip.",
                    "Synchronizing Large VLSI Processor Arrays.",
                    "The Boolean Vector Machine [BVM].",
                    "A VLSI Tree Machine for Relational Data Bases.",
                    "Implementing Streams on a Data Flow Computer System With Paged Memory.",
                    "The Piecewise Data Flow Architecture Control Flow and Register Management.",
                    "On the Working Set Concept for Data-Flow Machines.",
                    "A Data Driven System Based on a Microprogrammed Processor Module.",
                    "Architecture of a VLSI Instruction Cache for a RISC.",
                    "Performance of Shared Cache for Parallel-Pipelined Computer Systems.",
                    "Using Cache Memory to Reduce Processor-Memory Traffic.",
                    "A Study of Instruction Cache Organizations and Replacement Policies.",
                    "Very Long Instruction Word Architectures and the ELI-512.",
                    "A User-Microprogrammable, Local Host Computer With Low-Level Parallelism.",
                    "Combining Tags With Error Codes.",
                    "Fault Diagnosis of Bit-Slice Processor.",
                    "Line Digraph Iterations and the (d,k) Problem for Directed Graphs.",
                    "Resource Allocation in Rectangular CC-Banyans.",
                    "Uniform Theory of the Shuffle-Exchange Type Permutation Networks.",
                    "Analysis of Cray-1S Architecture.",
                    "Performance Measurements on HEP - A Pipelined MIMD Computer.",
                    "(SM)2: Sparse Matrix Solving Machine.",
                    "An Experimental System for Computer Science Instruction.",
                    "Execution Control and Memory Management of a Data Flow Signal Processor.",
                    "DDDP: A Distributed Data Driven Processor.",
                    "A Data Flow Processor Array System: Design and Analysis.",
                    "A Retrospective on the Dorado, A High-Performance Personal Computer.",
                    "System/370 Extended Architecture: A Program View of the Channel Subsystem.",
                    "Adaptive Interpretation as a Means of Exploiting Complex Instruction Sets.",
                    "Switching Strategies in a Class of Packet Switching Networks.",
                    "A Comparative Study of Distributed Resource Sharing on Multiprocessors.",
                    "Concurrent Error Detection in VLSI Interconnection Networks.",
                    "Hierarchical Function Distribution - A Design Principle for Advanced Multicomputer Architectures.",
                    "EMMA: An Industrial Experience on Large Multiprocessing Architectures.",
                    "A Communication Structure for a Multiprocessor Computer with Distributed Global Memory.",
                    "ALPHA: A High-Performance LISP Machine Equipped with a New Stack Structure and Garbage Collection System.",
                    "A Parallel Execution Model of Logic Programs.",
                    "A System Architecture for the Concurrent Evaluation of Applicative Program Expressions.",
                    "A Performance Evaluation of a Lisp-Based Data-Driven Machine (EM-3).",
                    "A Pyramidal Approach to Parallel Processing.",
                    "The Design of a Parallel Processor for Image Processing On-Board Satellites: An Application Oriented Approach.",
                    "LINKS-1: A Parallel Pipelined Multimicrocomputer System for Image Creation.",
                    "LIPP-A SIMD Multiprocessor Architecture for Image Processing.",
                    "The New Generation of Computer Architecture.",
                    "Inference Machine: From Sequential to Paralle.",
                    "Overview to the Fifth Generation Computer System Project.",
                    "A Relational Data Base Machine: First Step to Knowledge Base Machine.",
                    "A Critique of Multiprocessing von Neumann Style."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "9th ISCA 1982",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1982",
                "sub_name": "9th International Symposium on Computer Architecture (ISCA 1982), Austin, TX, USA, April 26-29, 1982.",
                "count": 34,
                "papers": [
                    "RISC assessment: A high-level language experiment.",
                    "Measurement and analysis of instruction use in the VAX-11/780.",
                    "HLL architectures: Pitfalls and predilections.",
                    "The NYU Ultracomputer-designing a MIMD, shared-memory parallel machine (Extended Abstract).",
                    "VLSI architectures for high speed recognition of context-free languages and finite-state languages.",
                    "Asynchronous and clocked control structures for VLSI based interconnection networks.",
                    "Performance and fault tolerance improvements in the Inverse Augmented Data Manipulator network.",
                    "The Gamma network: A multiprocessor interconnection network with redundant paths.",
                    "A control processor for a reconfigurable array computer.",
                    "A general class of processor interconnection strategies.",
                    "Instruction set design issues relating to a static dataflow computer.",
                    "Decoupled access/execute computer architectures.",
                    "A data flow architecture with a paged memory system.",
                    "Efficient code generation for horizontal architectures: Compiler techniques and architectural support.",
                    "Sentry: A novel hardware implementation of classic operating system mechanisms.",
                    "A logic simulation machine.",
                    "Towards a family of languages for the design and implementation of machine architectures.",
                    "Design of a 2 × 2 fault-tolerant switching element.",
                    "Fault-tolerant wafer-scale architectures for VLSI.",
                    "Database filters.",
                    "On the semantic structure of information - A proposal of the abstract storage architecture.",
                    "Hardware sorter and its application to data base machine.",
                    "A recursive computer architecture for VLSI.",
                    "µ3L: An HLL-RISC processor for parallel execution of FP-language programs.",
                    "The heap/substitution concept - an implementation of functional operations on data structures for a reduction machine.",
                    "A shared resource algorithm for distributed simulation.",
                    "Duplication of packets and their detection in X.25 communication protocols.",
                    "A multiple processor system for real time control tasks.",
                    "A heterogeneous multiprocessor design and the distributed scheduling of its task group workload.",
                    "A dual processor VAX 11/780.",
                    "Effects of cache coherency in multiprocessors.",
                    "Probabilistic analysis of a crossbar switch.",
                    "Finding an extremum in a network.",
                    "Resource allocation in rectangular SW banyans."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "8th ISCA 1981",
        "info": "Minneapolis, MN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1981",
                "sub_name": "Proceedings of the 8th Annual Symposium on Computer Architecture, Minneapolis, MN, USA, May 1981.",
                "count": 41,
                "papers": [
                    "Data Flow Languages and Architecture.",
                    "A Pragmatic View of Distributed Processing Systems.",
                    "MP/C: A Multiprocessor/Computer Architecture.",
                    "A Pipelined Pseudoparallel System Architecture for Motion Analysis.",
                    "Structured Machine Design: An Ongoing Experiement.",
                    "A Hardware Support Mechanism for Scheduling Resources in a Parallel Machine Environment.",
                    "Throughout Analysis and Configuration Design of a Shared-Resource Multiprocessor System: PUMPS.",
                    "Lockup-Free Instruction Fetch/Prefetch Cache Organization.",
                    "Analysis of Multiprocessor Cache Organizations with Alternative Main Memory Update Policies.",
                    "Performance Analysis of High-Speed Digital Buses for Multiprocessing Systems.",
                    "A Study of Branch Prediction Strategies.",
                    "Performance Measurement of Data Communication Systems with Emphasis on Open System Interconnections (OSI).",
                    "BFS-Realization of a Fault-Tolerant Architecuture.",
                    "Optimal Processor Interconnection Topologies.",
                    "Efficient Interprocessor Communications for MIMD Multiprocessor Systems.",
                    "An Integrated Multiprocessing Array for Time Warp Pattern Matching.",
                    "Jericho: A Professional's Personal Computer System.",
                    "A Single-Relation Module for a Data Base Machine.",
                    "MANIP - A Parallel Computer System for Implementing Branch and Bound Algorithms.",
                    "Towards a Parallel SIMULA Machine.",
                    "Decentralized Computation.",
                    "A Multiprocessor Data Flow Machine that Supports Generalized Procedures.",
                    "An Architecture for Extended Abstract Data Flow.",
                    "A Multi-User Data Flow Architecture.",
                    "IBM System/38 Support for Capability-Based Addressing.",
                    "An Array Processor for Petroleum Exploration.",
                    "On Refuting the Creation Theory of Computer Architecture.",
                    "Heterogeneous Computer Architecture.",
                    "Impact of Hardware Interconnection Structures on the Performance of Decentralized Software.",
                    "Distributed Communicating Media-A Multitrack Bus-Capable of Concurrent Data Exchanging.",
                    "WCRC: An ANSI SPARC Machine Architecture for Data Base Management.",
                    "A Look-Ahead Data Staging Architecture for Relational Data Base Machines.",
                    "Design and Evaluation of a Relational Data Base Machine Employing Advanced Data Structures and Algorithms.",
                    "A Reconfigurable and Fault-Tolerant VLSI Multiprocessor Array.",
                    "RISC I: A Reduced Instruction Set VLSI Computer.",
                    "An Architecture for a VHSIC Computer.",
                    "Doubly Twisted Torus Networks for VLSI Processing Arrays.",
                    "An IPC Protocol and Its Hardware Realization for a High-Speed Distributed Multicomputer System.",
                    "Alignment Network Used for Connecting a Prime Number of Memory Blocks with a Power of 2 of Processing Elements.",
                    "Design Considerations for a Processing Server.",
                    "Dynamic Rerouting Tag Schemes for the Augmented Data Manipulator Network."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "7th ISCA 1980",
        "info": "La Baule, France",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1980",
                "sub_name": "Proceedings of the 7th Annual Symposium on Computer Architecture, La Baule, France, May 6-8, 1980.",
                "count": 40,
                "papers": [
                    "Building Blocks for Data Flow Prototypes.",
                    "A Multiple Stream Microprocessor Prototype System: AMP-1.",
                    "Kensur: An Architecture Oriented Towards Programming Languages Translation.",
                    "Distributed Fault-Tolerance For Large Multiprocessor Systems.",
                    "A Comparison Connection Assignment for Diagnosis of Multiprocessor Systems.",
                    "A Concept for Test and Reconfiguration of a Fault-Tolerant VLSI Processor System.",
                    "Path Building in Cellular Partitioning Networks.",
                    "MIMD Machine Communication Using the Augmented Data Manipulator Network.",
                    "Fault Tolerance of a Class of Connecting Networks.",
                    "On the Comparison Between Single and Multiple Processor Systems.",
                    "Performance of a Collision-Free Local Bus Network Having Asynchronous Distributed Control.",
                    "Timed Petri Nets and Preliminary Performance Evaluation.",
                    "Retrospective on High-Level Language Computer Architecture.",
                    "M3L: A List-Directed Architecture.",
                    "A Practical Parallel Garbage Collection Algorithm and Its Implementation.",
                    "A Multi-Processor Reduction Machine for User-Defined Reduction Languages.",
                    "A Single User Multiprocessor Incorporating Processor Manipulation Facilities.",
                    "The Munet: A Scalable Decentralized Architecture For Parallel Computers.",
                    "A Processor for a High-Performance Personal Computer.",
                    "MU6-G: A New Design to Achieve Mainframe Performance from a Mini-Sized Computer.",
                    "Architecture of a Massively Parallel Processor.",
                    "The Intel 8087 Numeric Data Processor.",
                    "Efficient Mapping of Algorthims To Single-Stage Interconnections.",
                    "A Self-Routing Benes Network.",
                    "An Adaptable Network for Functional Distributed Systems.",
                    "A Combination of Field and Current Access Techniques for Effiecient and Cost-Effective Bubble Memories.",
                    "Designing Linear Storage Hierarchies so as to Maximize Reliability Subject to Cost and Performance Constraints.",
                    "An Associative/Parallel Processor for Partial Match Retrieval Using Superimposed Codes.",
                    "A Microprocessor-Based Virtual Memory System.",
                    "A Technique for the Architectural Implementation of Software Subsystems.",
                    "Security and Protection of Data in the IBM System/38.",
                    "Hardware Implementation of Communication Protocols: A Formal Approach.",
                    "An Architecture with Comprehensive Facilities of Inter-Process Synchronization and Communication.",
                    "The Cytocomputer: A Practical Pipelined Image Processor.",
                    "Architectural Considerations for a Microprogrammable Emulating Engine Using Bitslices.",
                    "Online Pipeline Systems for Recursive Numeric Computations.",
                    "Design of Special-Purpose VLSI Chips: Example and Opinions.",
                    "A Structured Language for CAD of Digital Systems.",
                    "Hardware-Measurements of Storage Access Conflicts in the Processor Array EGPA.",
                    "A High-Level Multi-Lingual Multiprocessor KMP."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "6th ISCA 1979",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1979",
                "sub_name": "Proceedings of the 6th Annual Symposium on Computer Architecture, Philadelphia, PA, USA, April 1979.",
                "count": 27,
                "papers": [
                    "A Concurrent Computer Architecture and a Ring Based Implementation.",
                    "On-Line Algorithms for the Design of Pipeline Architectures.",
                    "Architectural Implementations of Abstract Data Type Implementation.",
                    "A New Approach to an Adaptive Computer - An Automatic Recovery Mechanism to Prevent the Occurance of Subtract Errors.",
                    "Overview of the ARCADE System.",
                    "An Architecture with Many Operand Registers to Efficiently Execute Block-Structured Languages.",
                    "An Expanded Multiprocessor Architecture for Video Graphics.",
                    "An Adaptive Multimicroprocessor Array Computing Structure for Radar Signal Processing Applications.",
                    "A Bit-Slice Cache Controller.",
                    "Simulation Experiments on a Tree Organized Minicomputer.",
                    "Design Considerations for the VLSI Processor of X-tree.",
                    "FLATS, a Machine for Numerical, Symbolic and Associative Computing.",
                    "Some Simplified Performance Modeling Techniques with Applications to a New Ring-Structured Microcomputer Network.",
                    "A Performance Comparison of Optimally Designed Computer Systems with and without Virtual Memory.",
                    "A Modeling Approach and Design Tool for Pipelined Central Processors.",
                    "Dynamic Function Exchanging Mechanism in Poly-Processor System.",
                    "The Architecture of Sperry Univac 1100 Series Systems.",
                    "An Efficient Time-Shared Link Processor for Supporting Communication in Parallel Systems with Dynamic Structure.",
                    "Packet Switching in Banyan Networks.",
                    "Processor-Memory Interconnections for Multiprocessors.",
                    "Proof of the Equivalent Realizability of a Time-Bound Arbiter and a Runt-Free Inertail Delay.",
                    "Design Issues in the Development of a Modular Mutliprocessor Communications Network.",
                    "Experimental Polyprocessor System (EPOS) - Architecture.",
                    "Experimental Polyprocessor System (EPOS) - Operating System.",
                    "A Microprocessor-Controlled Asynchronous Circuit Switching Network.",
                    "Performance Enhancement of SISD Processors.",
                    "An Emulator Network for SIMD Machine Interconnection Networks."
                ]
            }
        ]
    },
    {
        "year": "1978",
        "name": "5th ISCA 1978",
        "info": "Palo Alto, CA, USA",
        "venues": []
    },
    {
        "year": "1977",
        "name": "4th ISCA 1977",
        "info": "College Park, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1977",
                "sub_name": "Proceedings of the 4th Annual Symposium on Computer Architecture, College Park, MD, USA, March 1977.",
                "count": 27,
                "papers": [
                    "Architecture of a Hardware Data Interpreter.",
                    "The Design of Some Language Constructs for Horizontal Microprogramming.",
                    "The Honeywell Modular Microprogram Machine: M3.",
                    "A Multi-Microprocessor Implementation of a General Purpose Pipelined CPU.",
                    "A Hierarchical Microcomputer System for Hardware and Software Development.",
                    "Hierarchical Multiprocessor Organizations.",
                    "Poly-Processor System Analysis and Design.",
                    "A Few Examples of How to Use a Symmetrical Multi-Micro-Processor.",
                    "The Microprogramming of Pipelined Processors.",
                    "The Universality of Various Types of SIMD Machine Interconnection Networks.",
                    "The Effect of Instruction Fetch Strategies upon the Performance of Pipelined Instruction Units.",
                    "A Modular Memory Scheme for Array Processing.",
                    "The Architecture of an ALGOL 60 Computer Implemented with Distributed Processors.",
                    "A Large Scale, Homogeneous, Fully Distributed Parallel Machine, I.",
                    "A Large Scale, Homogeneous, Fully Distributed Parallel Machine, II.",
                    "On Virtual Memories and Micronetworks.",
                    "Considerations for New Tactical Computer Systems.",
                    "An Advanced Tactical Computer Concept.",
                    "Microprocessor Implementation of a Parallel Processor.",
                    "The Design and Implementation of a Real-Time Sound Generation System.",
                    "Hardware/Software Tradeoffs in A Variable Word Width, Variable Queue Length Buffer Memory.",
                    "An Instruction Timing Model of CPU Performance.",
                    "Reduction of Memory Interference in Multiprocessor Systems.",
                    "Information Content of CPU Memory Referencing Behavior.",
                    "Message Communication Protocol and Operation System Design for the Distributed Loop Computer Network (DLCN).",
                    "Architecture of the Corail Building Block System.",
                    "High-Speed Buffering for Variable Length Operands."
                ]
            }
        ]
    },
    {
        "year": "1976",
        "name": "3rd ISCA 1976",
        "info": "Clearwater, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1976",
                "sub_name": "Proceedings of the 3rd Annual Symposium on Computer Architecture, Clearwater, FL, USA, January 1976.",
                "count": 40,
                "papers": [
                    "Computer Structures: What Have We Learned from the PDP-11?",
                    "A PMS Level Language for Performance Evaluation Modelling (V-PMS).",
                    "A Design Tool for the Multilevel Description and Simulation of Systems of Interconnected Modules.",
                    "A Course in Computer Structures.",
                    "The IEEE Computer Society Task Force on Computer Architecture.",
                    "The Minerva Multi-Micropocessor.",
                    "A Hierarchical, Restructurable Multi-Microprocessor Architecture.",
                    "A Multimicroprocessor Approach to Numerical Analysis: An Application to Gaming Problems.",
                    "A Model of Interference in a Shared Resource Multiprocessor.",
                    "A Computer Simulation Facility for Packet Communication Architecture.",
                    "Cost, Performance and Size Tradeoffs for Different Levels in a Memory Hierarchy.",
                    "An Input Interface for Real-Time Digital Sound Generation System.",
                    "A Microprocessor Oriented Data Acquisition and Control System for Power System Control.",
                    "Multiprogramming for Real-Time Applications.",
                    "Basil Architecture - An HLL Minicomputer.",
                    "Function Distribution in Computer System Architectures.",
                    "Interface, A Dispersed Architecture.",
                    "A Design Study of a Shared Resource Computing System.",
                    "Hardware Support for Inter-Process Communication and Processor Sharing.",
                    "A Taxonomy of Display Processors.",
                    "Traversing Binary Tree Structures with Shift Register Memories.",
                    "Architecture Support for System Protection.",
                    "The Design of a User-Programmable Digital Interface.",
                    "Selection Schemes for Dynamically Microcoding Fortran Programs.",
                    "System Design of a Grammar-Programmable High-Level Language Machine.",
                    "SMS 101 - A Structured Multimicroprocessor System with Deadlock-Free Operation Scheme.",
                    "The Design of a Multi-Micro-Computer System.",
                    "Design and Simulation of the Distributed Loop Computer Network (DLCN).",
                    "Distribution of Functions and Control in RPCNET.",
                    "Efficient Message Routing in Mega-Micro-Computer Networks.",
                    "An Investigation of Descriptor Oriented Architecture.",
                    "Tagged Architecture and the Semantics of Programming Languages: Extensible Types.",
                    "Design Data for Algol-60 Machines.",
                    "Cache Memories for PDP-11 Family Computers.",
                    "Improving the Throughput of a Pipeline by Insertion of Delays.",
                    "On-Line Architecture Tuning Using Microcapture.",
                    "A Character-Oriented Context-Addressed Segment Sequential Storage.",
                    "Some Implementations of Segment Sequential Functions.",
                    "A Self-Managing Secondary Memory System.",
                    "Price/Performance Comparison of C.mmp and the PDP-10."
                ]
            }
        ]
    },
    {
        "year": "1974",
        "name": "2nd ISCA 1974",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1974",
                "sub_name": "Proceedings of the 2nd Annual Symposium on Computer Architecture, Houston, TX, USA, December 1974.",
                "count": 38,
                "papers": [
                    "Decentralized Priority Control in Data Communication.",
                    "A Loop Network for Simultaneous Transmission of Variable-Length Messages.",
                    "The Architecture of the Picture System.",
                    "A Fast Display-Oriented Processor.",
                    "Computer Display of Colored Three-Dimensional Objects.",
                    "A Microprogrammed Processor For Interactive Computer Graphics.",
                    "Functional Memory Techniques Applied To The Microprogrammed Control Of An Associative Processor.",
                    "Instruction Design To Minimize Program Size.",
                    "HMO, A Hardware Microcode Optimizer.",
                    "The Computer Aided Design of Processor Architectures.",
                    "Intermodule Protocol For Register Transfer Level Modules: Representation and Analytic Tools.",
                    "Picture Systems, PS, and The Design of a Channel-To-Channel Computer Interface.",
                    "Reference Concepts in a Tree Structured Address Space.",
                    "A Virtual Memory for Microprocessors.",
                    "The Performance Enhancement of Descriptor-Based Virtual Memory Systems Through The Use of Associative Registers.",
                    "SPEAC-Special Purpose Electronic Area Correlator.",
                    "Architecture Advances of the Space Shuttle Orbiter Avionics Computer System.",
                    "Design Study of an Avionics Navigation Microcomputer.",
                    "An Iteratively Structured Information Processor.",
                    "Hardware-Software Interactions in SYMBOS-2R's Operating System.",
                    "The Design and Evaluation of the Array Machine: A High-Level Language Processor.",
                    "A Preliminary Architecture for a Basic Data Flow Processor.",
                    "Reduction Languages for Reduction Machines.",
                    "Output Devices Sharing by Minicomputers.",
                    "On Relating Small Computer Performance to Design Parameters.",
                    "Advantages of Structured Hardware.",
                    "Concepts of the MATHILDA System.",
                    "Socrates.",
                    "Conjoined Computer Systems: An Architecture for Laboratory Data Processing and Instrument Control.",
                    "A Distributed Function Computer for Real-Time Control.",
                    "Switched Multiple Instruction, Multiple Data Stream Processing.",
                    "Sequentially Encoded Data Structures that Support Bidirectional Scanning.",
                    "An Instruction Class for an Extensible Interpreter.",
                    "STARLET - A Computer Concept Based on Ordered Sets as Primitive Data Types.",
                    "A Cellular General Purpose Computer.",
                    "A Machine-Oriented Resource Management Architecture.",
                    "A Design-Oriented Computer Engineering Program.",
                    "An Educational Laboratory in Contemporary Digital Design."
                ]
            }
        ]
    },
    {
        "year": "1973",
        "name": "1st ISCA 1973",
        "info": "Gainesville, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isca/1973",
                "sub_name": "Proceedings of the 1st Annual Symposium on Computer Architecture, Gainesville, FL, USA, December 1973.",
                "count": 28,
                "papers": [
                    "Markov Chain Models for Analyzing Memory Interference in Multiprocessor Computer Systems.",
                    "Interconnecting A Distibuted Processor System for Avionics.",
                    "Banyan Networks for Partitioning Multiprocessor Systems.",
                    "Structure of Digital System Description Languages.",
                    "VDL - A Definitional System for All Levels.",
                    "A Methodology for Parallel Processing Design Tradeoffs.",
                    "DAP - A Distributed Array Processor.",
                    "Maximal Rate Pipelined Solutions to Recurrance Problems.",
                    "Comments on Capabilities, Limitations and Correctness of Petri Nets.",
                    "Flowware - A Flow Charting Procedure to Describe Digital Networks.",
                    "Automated Exploration of the Design Space for Register Transfer (RT) Systems.",
                    "Implementation Aspects of the Symbol Hardware Compiler.",
                    "The Architecture of CASSM: A Cellular System for Non-numeric Processing.",
                    "Deriving Design Guidelines for Diagnosable Computer Systems.",
                    "Design of Fault-Tolerant Associative Processors.",
                    "A Fault Tolerant Multiprocessor Architecture for Real Time Control Applications.",
                    "A Varistructured Fail-Soft Cellular Computer.",
                    "A Hardware Laboratory for Computer Architecture Research.",
                    "Simulation Exercises for Computer Architecture Education.",
                    "Computer Architecture Courses in Electrical Engineering Departments.",
                    "Increasing Hardware Complexity - A Challenge to Computer Architecture Education.",
                    "Review of the Workshop on Computer Architecture Education.",
                    "Micromodules: Microprogrammable Building Blocks for Hardware Development.",
                    "Computer Modules: An Architecture for Large Digital Modules.",
                    "Microprogrammed Architecture for Front End Processing.",
                    "Design of a Fully Variable - Length Structured Minicomputer.",
                    "HAPPE Honeywell Associative Parallel Processing Ensemble.",
                    "A Computer Architecture and its Programming Language."
                ]
            }
        ]
    }
]