[
    {
        "year": "2021",
        "name": "ISPD 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2021",
                "sub_name": "ISPD '21: International Symposium on Physical Design, Virtual Event, USA, March 22-24, 2021.",
                "count": 26,
                "papers": [
                    "Physical Design for 3D Chiplets and System Integration.",
                    "Reinforcement Learning for Electronic Design Automation: Successes and Opportunities.",
                    "Reinforcement Learning for Placement Optimization.",
                    "The Law of Attraction: Affinity-Aware Placement Optimization using Graph Neural Networks.",
                    "Advancing Placement.",
                    "A Fast Optimal Double Row Legalization Algorithm.",
                    "Multiple-Layer Multiple-Patterning Aware Placement Refinement for Mixed-Cell-Height Designs.",
                    "Snap-3D: A Constrained Placement-Driven Physical Design Methodology for Face-to-Face-Bonded 3D ICs.",
                    "Still Benchmarking After All These Years.",
                    "Scalable System and Silicon Architectures to Handle the Workloads of the Post-Moore Era.",
                    "Learning Point Clouds in EDA.",
                    "Building up End-to-end Mask Optimization Framework with Self-training.",
                    "Machine Learning Techniques in Analog Layout Automation.",
                    "Advances in Carbon Nanotube Technologies: From Transistors to a RISC-V Microprocessor.",
                    "ML-Based Wire RC Prediction in Monolithic 3D ICs with an Application to Full-Chip Optimization.",
                    "Machine Learning-Enabled High-Frequency Low-Power Digital Design Implementation At Advanced Process Nodes.",
                    "A Fast Power Network Optimization Algorithm for Improving Dynamic IR-drop.",
                    "A Lifetime of ICs, and Cross-field Exploration: ISPD 2021 Lifetime Achievement Award Bio.",
                    "The Physical Design of Biological Systems - Insights from the Fly Brain.",
                    "Of Brains and Computers.",
                    "EDA and Quantum Computing: The key role of Quantum Circuits.",
                    "Physical Verification at Advanced Technology Nodes and the Road Ahead.",
                    "Hardware Security for and beyond CMOS Technology.",
                    "Physical Design Challenges and Solutions for Emerging Heterogeneous 3D Integration Technologies.",
                    "A Scalable and Robust Hierarchical Floorplanning to Enable 24-hour Prototyping for 100k-LUT FPGAs.",
                    "ISPD 2021 Wafer-Scale Physics Modeling Contest: A New Frontier for Partitioning, Placement and Routing."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ISPD 2020",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2020",
                "sub_name": "ISPD 2020: International Symposium on Physical Design, Taipei, Taiwan, March 29 - April 1, 2020, delayed to September 20-23, 2020.",
                "count": 22,
                "papers": [
                    "Scalable System and Silicon Architectures to Handle the Workloads of the Post-Moore Era.",
                    "Placement Optimization with Deep Reinforcement Learning.",
                    "Hill Climbing with Trees: Detail Placement for Large Windows.",
                    "Via Pillar-aware Detailed Placement.",
                    "Soft-Clustering Driven Flip-flop Placement Targeting Clock-induced OCV.",
                    "Advances in Carbon Nanotube Technologies: From Transistors to a RISC-V Microprocessor.",
                    "Full-Chip Electro-Thermal Coupling Extraction and Analysis for Face-to-Face Bonded 3D ICs.",
                    "Pseudo-3D Approaches for Commercial-Grade RTL-to-GDS Tool Flow Targeting Monolithic 3D ICs.",
                    "Learning from Experience: Applying ML to Analog Circuit Design.",
                    "Transforming Global Routing Report into DRC Violation Map with Convolutional Neural Network.",
                    "Lookahead Placement Optimization with Cell Library-based Pin Accessibility Prediction via Active Learning.",
                    "Physical Design for 3D Chiplets and System Integration.",
                    "Hardware Security For and Beyond CMOS Technology: An Overview on Fundamentals, Applications, and Challenges.",
                    "Design Optimization by Fine-grained Interleaving of Local Netlist Transformations in Lagrangian Relaxation.",
                    "Selective Sensor Placement for Cost-Effective Online Aging Monitoring and Resilience.",
                    "Synthesis of Clock Networks with a Mode Reconfigurable Topology and No Short Circuit Current.",
                    "Timing Driven Partition for Multi-FPGA Systems with TDM Awareness.",
                    "Understanding Graphs in EDA: From Shallow to Deep Learning.",
                    "TEMPO: Fast Mask Topography Effect Modeling with Deep Learning.",
                    "DRC Hotspot Prediction at Sub-10nm Process Nodes Using Customized Convolutional Network.",
                    "Physical Verification at Advanced Technology Nodes and the Road Ahead.",
                    "ISPD 2020 Physical Mapping of Neural Networks on a Wafer-Scale Deep Learning Accelerator."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ISPD 2019",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2019",
                "sub_name": "Proceedings of the 2019 International Symposium on Physical Design, ISPD 2019, San Francisco, CA, USA, April 14-17, 2019.",
                "count": 39,
                "papers": [
                    "Session details: Keynote.",
                    "Fusion: The Dawn of the Hyperconvergence Era in EDA.",
                    "Session details: New Advances in Placement.",
                    "How Deep Learning Can Drive Physical Synthesis Towards More Predictable Legalization.",
                    "Graceful Register Clustering by Effective Mean Shift Algorithm for Power and Timing Balancing.",
                    "Device Layer-Aware Analytical Placement for Analog Circuits.",
                    "Analytical Mixed-Cell-Height Legalization Considering Average and Maximum Movement Minimization.",
                    "Session details: FPGA Special Session: Advances in Adaptable Heterogeneous Computing and Acceleration for Big Data.",
                    "FPGA-based Computing in the Era of AI and Big Data.",
                    "Advances in Adaptable Computing.",
                    "Improving Programmability and Efficiency of Large-Scale Graph Analytics for FPGA Platforms.",
                    "Session details: Routing in All Forms.",
                    "Pin Access-Driven Design Rule Clean and DFM Optimized Routing of Standard Cells under Boolean Constraints.",
                    "PSION: Combining Logical Topology and Physical Layout Optimization for Wavelength-Routed ONoCs.",
                    "Construction of All Multilayer Monolithic Rectilinear Steiner Minimum Trees on the 3D Hanan Grid for Monolithic 3D IC Routing.",
                    "ROAD: Routability Analysis and Diagnosis Framework Based on SAT Techniques.",
                    "Session details: Keynote.",
                    "A Perspective on Security and Trust Requirements for the Future.",
                    "Session details: Patterning and Machine Learning.",
                    "Declarative Language for Geometric Pattern Matching in VLSI Process Rule Modeling.",
                    "Electromigration-Aware Interconnect Design.",
                    "Toward Intelligent Physical Design: Deep Learning and GPU Acceleration.",
                    "Multiple Patterning Layout Compliance with Minimizing Topology Disturbance and Polygon Displacement.",
                    "Session details: Cyber-Physical Systems.",
                    "From Electronic Design Automation to Automotive Design Automation.",
                    "Enterprise-wide AI-enabled Digital Transformation.",
                    "Secure and Trustworthy Cyber-Physical System Design: A Cross-Layer Perspective.",
                    "Session details: Lifetime Achievement Award Tribute to Professor Alberto Sangiovanni-Vicentelli.",
                    "The Slow Start of Fast Spice: A Brief History of Timing.",
                    "Basic and Advanced Researches in Logic Synthesis and their Industrial Contributions.",
                    "From Electronic Design Automation to Cyber-Physical System Design Automation: A Tale of Platforms and Contracts.",
                    "My 50-Year Journey from Punched Cards to Swarm Systems.",
                    "Freedom From Choice and the Power of Models: in Honor of Alberto Sangiovanni-Vincentelli.",
                    "Session details: Physical Design - Where are we going?",
                    "Analog Layout Synthesis: Are We There Yet?",
                    "Lagrangian Relaxation Based Gate Sizing With Clock Skew Scheduling - A Fast and Effective Approach.",
                    "Adaptive Clustering and Sampling for High-Dimensional and Multi-Failure-Region SRAM Yield Analysis.",
                    "Session details: Detailed Routing Contest Results.",
                    "ISPD 2019 Initial Detailed Routing Contest and Benchmark with Advanced Routing Rules."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ISPD 2018",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2018",
                "sub_name": "Proceedings of the 2018 International Symposium on Physical Design, ISPD 2018, Monterey, CA, USA, March 25-28, 2018.",
                "count": 27,
                "papers": [
                    "Challenges and Opportunities in Automotive, Industrial, and IoT Physical Design.",
                    "Wot the L: Analysis of Real versus Random Placed Nets, and Implications for Steiner Tree Heuristics.",
                    "Prim-Dijkstra Revisited: Achieving Superior Timing-driven Routing Trees.",
                    "Construction of All Rectilinear Steiner Minimum Trees on the Hanan Grid.",
                    "Challenges in Large FPGA-based Logic Emulation Systems.",
                    "Flexibility: FPGAs and CAD in Deep Learning Acceleration.",
                    "Exploration and Tradeoffs of different Kernels in FPGA Deep Learning Applications.",
                    "Architecture Exploration of Standard-Cell and FPGA-Overlay CGRAs Using the Open-Source CGRA-ME Framework.",
                    "Concurrent High Performance Processor Design: From Logic to PD in Parallel.",
                    "Towards a VLSI Design Flow Based on Logic Computation and Signal Distribution.",
                    "Power Grid Reduction by Sparse Convex Optimization.",
                    "Machine Learning Applications in Physical Design: Recent Results and Directions.",
                    "Machine Learning for Feature-Based Analytics.",
                    "Data Efficient Lithography Modeling with Residual Neural Networks and Transfer Learning.",
                    "Compact-2D: A Physical Design Methodology to Build Commercial-Quality Face-to-Face-Bonded 3D ICs.",
                    "Analog Placement Constraint Extraction and Exploration with the Application to Layout Retargeting.",
                    "Pin Assignment Optimization for Multi-2.5D FPGA-based Systems.",
                    "Influence of Professor T. C. Hu's Works on Fundamental Approaches in Layout.",
                    "Tree Structures and Algorithms for Physical Design.",
                    "Pioneer Research on Mathematical Models and Methods for Physical Design.",
                    "Theory and Algorithms of Physical Design.",
                    "Interconnect Optimization Considering Multiple Critical Paths.",
                    "Interconnect Physical Optimization.",
                    "ISPD 2018 Initial Detailed Routing Contest and Benchmarks.",
                    "The Pressing Need for Electromigration-Aware Physical Design.",
                    "On Coloring and Colorability Analysis of Integrated Circuits with Triple and Quadruple Patterning Techniques.",
                    "Standard CAD Tool-Based Method for Simulation of Laser-Induced Faults in Large-Scale Circuits."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ISPD 2017",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2017",
                "sub_name": "Proceedings of the 2017 ACM on International Symposium on Physical Design, ISDP 2017, Portland, OR, USA, March 19-22, 2017.",
                "count": 31,
                "papers": [
                    "Technology Options for Beyond-CMOS.",
                    "The Quest for The Ultimate Learning Machine.",
                    "Deep Learning in the Enhanced Cloud.",
                    "Bilinear Lithography Hotspot Detection.",
                    "Routability Optimization for Industrial Designs at Sub-14nm Process Nodes Using Machine Learning.",
                    "Pushing the boundaries of Moore's Law to transition from FPGA to All Programmable Platform.",
                    "How Game Engines Can Inspire EDA Tools Development: A use case for an open-source physical design library.",
                    "Rsyn: An Extensible Physical Synthesis Framework.",
                    "Research Challenges in Security-Aware Physical Design.",
                    "Challenges and Opportunities: From Near-memory Computing to In-memory Computing.",
                    "Physical Design Considerations of One-level RRAM-based Routing Multiplexers.",
                    "Hierarchical and Analytical Placement Techniques for High-Performance Analog Circuits.",
                    "Physical Design Challenges and Innovations to Meet Power, Speed, and Area Scaling Trend.",
                    "Modern Challenges in Constructing Clocks.",
                    "Clock Tree Construction based on Arrival Time Constraints.",
                    "A Fast Incremental Cycle Ratio Algorithm.",
                    "iTimerM: Compact and Accurate Timing Macro Modeling for Efficient Hierarchical Timing Analysis.",
                    "DSAR: DSA aware Routing with Simultaneous DSA Guiding Pattern and Double Patterning Assignment.",
                    "Automatic Cell Layout in the 7nm Era.",
                    "Improving Detailed Routability and Pin Access with 3D Monolithic Standard Cells.",
                    "The Spirit of in-house CAD Achieved by the Legend of Master \"Prof. Goto\" and his Apprentices.",
                    "Generalized Force Directed Relaxation with Optimal Regions and Its Applications to Circuit Placement.",
                    "100x Evolution of Video Codec Chips.",
                    "Physical Layout after Half a Century: From Back-Board Ordering to Multi-Dimensional Placement and Beyond.",
                    "Past, Present and Future of the Research.",
                    "Interesting Problems in Physical Synthesis.",
                    "Pin Accessibility-Driven Detailed Placement Refinement.",
                    "A Fast, Robust Network Flow-based Standard-Cell Legalization Method for Minimizing Maximum Movement.",
                    "CAD Opportunities with Hyper-Pipelining.",
                    "An Effective Timing-Driven Detailed Placement Algorithm for FPGAs.",
                    "Clock-Aware FPGA Placement Contest."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ISPD 2016",
        "info": "Santa Rosa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2016",
                "sub_name": "Proceedings of the 2016 on International Symposium on Physical Design, ISPD 2016, Santa Rosa, CA, USA, April 3-6, 2016.",
                "count": 31,
                "papers": [
                    "Circuit Design in Nano-Scale CMOS Technologies.",
                    "Physical Design Automation for 3D Chip Stacks: Challenges and Solutions.",
                    "ePlace-3D: Electrostatics based Placement for 3D-ICs.",
                    "A Compressive-sensing based Testing Vehicle for 3D TSV Pre-bond and Post-bond Testing Data.",
                    "PLATON: A Force-Directed Placement Algorithm for 3D Optical Networks-on-Chip.",
                    "Optimizing for Power, Speed, Cost and Emissions in Automotive Drivetrains.",
                    "Cell-Based Design Methods for Directed Self-Assembly.",
                    "Concurrent Guiding Template Assignment and Redundant via Insertion for DSA-MP Hybrid Lithography.",
                    "Double-Patterning Aware DSA Template Guided Cut Redistribution for Advanced 1-D Gridded Designs.",
                    "Technology Inflection Points.",
                    "Challenges and Opportunities with Place and Route of Modern FPGA Designs.",
                    "Design and Tool Flow of IBM's TrueNorth: an Ultra-Low Power Programmable Neurosynaptic Chip with 1 Million Neurons.",
                    "Some Observations on the Physical Design of the Next Decade.",
                    "A Designer's Perspective on Timing Closure.",
                    "Cell Selection for High-Performance Designs in an Industrial Design Flow.",
                    "Drive Strength Aware Cell Movement Techniques for Timing Driven Placement.",
                    "Construction of Latency-Bounded Clock Trees.",
                    "Scaling Beyond 7nm: Design-Technology Co-optimization at the Rescue.",
                    "Proximity Optimization for Adaptive Circuit Design.",
                    "Load-Aware Redundant Via Insertion for Electromigration Avoidance.",
                    "Early Days of Automatic Floorplan Design.",
                    "The Annealing Algorithm revisted.",
                    "Trailblazing Physical Design Flows: Ralph Otten's Impact on Design Automation.",
                    "Complexity and Diversity in IC Layout Design.",
                    "An Interactive Physical Synthesis Methodology for High-Frequency FPGA Designs.",
                    "Power Optimization of FPGA Interconnect Via Circuit and CAD Techniques.",
                    "Scaling Up Physical Design: Challenges and Opportunities.",
                    "Routability-Driven FPGA Placement Contest.",
                    "Generating Routing-Driven Power Distribution Networks with Machine-Learning Technique.",
                    "Hyperspherical Clustering and Sampling for Rare Event Analysis with Multiple Failure Region Coverage.",
                    "A Machine Learning Based Framework for Sub-Resolution Assist Feature Generation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ISPD 2015",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2015",
                "sub_name": "Proceedings of the 2015 Symposium on International Symposium on Physical Design, ISPD 2015, Monterey, CA, USA, March 29 - April 1, 2015.",
                "count": 30,
                "papers": [
                    "3D VLSI: A Scalable Integration Beyond 2D.",
                    "BonnPlace: A Self-Stabilizing Placement Framework.",
                    "Coarse-grained Structural Placement for a Synthesized Parallel Multiplier.",
                    "Common-Centroid FinFET Placement Considering the Impact of Gate Misalignment.",
                    "Automation of Analog IC Layout: Challenges and Solutions.",
                    "Q-Learning Based Dynamic Voltage Scaling for Designs with Graceful Degradation.",
                    "SVM-Based Routability-Driven Chip-Level Design for Voltage-Aware Pin-Constrained EWOD Chips.",
                    "Machine Learning in Simulation-Based Analysis.",
                    "Physical Layout Design of Directed Self-Assembly Guiding Alphabet for IC Contact Hole/via Patterning.",
                    "A Cell-Based Row-Structure Layout Decomposer for Triple Patterning Lithography.",
                    "TPL-Aware Displacement-driven Detailed Placement Refinement with Coloring Constraints.",
                    "Concept & Research to Revenue: An Entrepreneurial Story.",
                    "Analog Circuit and Layout Synthesis Revisited.",
                    "A Useful Skew Tree Framework for Inserting Large Safety Margins.",
                    "Analytical Clustering Score with Application to Post-Placement Multi-Bit Flip-Flop Merging.",
                    "Physical Design Challenges in the Chip Power Distribution Network.",
                    "Accelerated Path-Based Timing Analysis with MapReduce.",
                    "Blech Effect in Interconnects: Applications and Design Guidelines.",
                    "On Resilient System Performance Binning.",
                    "From 2D to Monolithic 3D: Design Possibilities, Expectations and Challenges.",
                    "Early Days of Circuit Placement.",
                    "Force-Directed Placement of VLSI Circuits.",
                    "Beyond GORDIAN and Kraftwerk: EDA Research at TUM.",
                    "Timing-Driven Placement Based on Dynamic Net-Weighting for Efficient Slack Histogram Compression.",
                    "Closing the Gap between Global and Detailed Placement: Techniques for Improving Routability.",
                    "ISPD 2015 Benchmarks with Fence Regions and Routing Blockages for Detailed-Routing-Driven Placement.",
                    "FreePDK15: An Open-Source Predictive Process Design Kit for 15nm FinFET Technology.",
                    "Open Cell Library in 15nm FreePDK Technology.",
                    "Design Rule Management and its Applications in 15nm FreePDK Technology.",
                    "A Benchmark Suite to Jointly Consider Logic Synthesis and Physical Design."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ISPD 2014",
        "info": "Petaluma, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2014",
                "sub_name": "International Symposium on Physical Design, ISPD'14, Petaluma, CA, USA, March 30 - April 02, 2014.",
                "count": 30,
                "papers": [
                    "Hardware cyber security.",
                    "Cell density-driven detailed placement with displacement constraint.",
                    "MIP-based detailed placer for mixed-size circuits.",
                    "A study on unroutable placement recognition.",
                    "Integrated structured placement design methodology in place and route flow.",
                    "Timing-driven, over-the-block rectilinear steiner tree construction with pre-buffering and slew constraints.",
                    "A fast algorithm for rectilinear steiner trees with length restrictions on obstacles.",
                    "FPGA place & route challenges.",
                    "Placement-driven partitioning for congestion mitigation in monolithic 3D IC designs.",
                    "Coupling-aware force driven placement of TSVs and shields in 3D-IC layouts.",
                    "3DIC system design impact, challenge and solutions.",
                    "Physical design and FinFETs.",
                    "Clock tree resynthesis for multi-corner multi-mode timing closure.",
                    "Power optimization for clock network with clock gate cloning and flip-flop merging.",
                    "Current density aware power switch placement algorithm for power gating designs.",
                    "Incremental transient simulation of power grid.",
                    "Self-aligned double patterning aware pin access and standard cell layout co-optimization.",
                    "A highly-efficient row-structure stencil planning approach for e-beam lithography with overlapped characters.",
                    "Carbon nanotube computer: transforming scientific discoveries into working systems.",
                    "Making a difference in EDA: a thank you to Bryan Preas for his contributions to the profession.",
                    "From design to design automation.",
                    "Interconnect length estimation in VLSI designs: a retrospective.",
                    "Bryan Preas: broad contributions to system engineering in the 2000's.",
                    "Smart matter systems, an introduction through examples.",
                    "Reliability-driven chip-level design for high-frequency digital microfluidic biochips.",
                    "Design synthesis and optimization for automotive embedded systems.",
                    "Opportunities in power distribution network system optimization: from EDA perspective.",
                    "Indoor localization technology and algorithm issues.",
                    "TAU 2014 contest on removing common path pessimism during timing analysis.",
                    "ISPD 2014 benchmarks with sub-45nm technology rules for detailed-routing-driven placement."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ISPD 2013",
        "info": "Stateline, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2013",
                "sub_name": "International Symposium on Physical Design, ISPD'13, Stateline, NV, USA, March 24-27, 2013.",
                "count": 38,
                "papers": [
                    "Heterogeneous 3-d stacking, can we have the best of both (technology) worlds?",
                    "Physical-aware system-level design for tiled hierarchical chip multiprocessors.",
                    "Utilizing 2D and 3D rectilinear blocks for efficient IP reuse and floorplanning of 3D-integrated systems.",
                    "Benchmarking for research in power delivery networks of three-dimensional integrated circuits.",
                    "High performance and low power design techniques for ASIC and custom in nanometer technologies.",
                    "Electromigration and its impact on physical design in future technologies.",
                    "Data mining in design and test processes: basic principles and promises.",
                    "SRAM dynamic stability verification by reachability analysis with consideration of threshold voltage variation.",
                    "PushPull: short path padding for timing error resilient circuits.",
                    "Dawn of computer-aided design: from graph-theory to place and route.",
                    "Practicality on placement given by optimality of packing.",
                    "On the way to practical tools for beyond die codesign and integration.",
                    "Coding the objects in place and route CAD.",
                    "Circuit and PD challenges at the 14nm technology node.",
                    "Optical lithography extension with double patterning.",
                    "A structured routing architecture and its design methodology suitable for high-throughput electron beam direct writing with character projection.",
                    "Simultaneous OPC- and CMP-aware routing based on accurate closed-form modeling.",
                    "Planning for local net congestion in global routing.",
                    "Escape routing of mixed-pattern signals based on staggered-pin-array PCBs.",
                    "Delay-driven layer assignment in global routing under multi-tier interconnect structure.",
                    "SRP: simultaneous routing and placement for congestion refinement.",
                    "Case study for placement solutions in ispd11 and dac12 routability-driven placement contests.",
                    "A compiler for scalable placement and routing of brain-like architectures.",
                    "Physical design for debug: insurance policy for IC's.",
                    "A top-down synthesis methodology for flow-based microfluidic biochips considering valve-switching minimization.",
                    "Designing VeSFET-based ICs with CMOS-oriented EDA infrastructure.",
                    "ISPD 2013 expert designer/user session (eds).",
                    "Relative timing driven multi-synchronous design: enabling order-of-magnitude energy reduction.",
                    "Network flow based datapath bit slicing.",
                    "FF-bond: multi-bit flip-flop bonding at placement.",
                    "Buffer sizing for clock networks using robust geometric programming considering variations in buffer sizes.",
                    "Local merges for effective redundancy in clock networks.",
                    "An improved benchmark suite for the ISPD-2013 discrete cell sizing contest.",
                    "TAU 2013 variation aware timing analysis contest.",
                    "Opportunities and challenges for high performance microprocessor designs and design automation.",
                    "To do or not to do hierarchical timing?",
                    "Variability aware hierarchical implementation of big chips.",
                    "Challenges in managing timing and wiring contracts during hierarchical floorplanning and design closure."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ISPD 2012",
        "info": "Napa, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2012",
                "sub_name": "International Symposium on Physical Design, ISPD'12, Napa, CA, USA, March 25-28, 2012.",
                "count": 33,
                "papers": [
                    "Lithography till the end of Moore's law.",
                    "Design-aware lithography.",
                    "Graph-based subfield scheduling for electron-beam photomask fabrication.",
                    "A polynomial time exact algorithm for self-aligned double patterning layout decomposition.",
                    "Flexible self-aligned double patterning aware detailed routing with prescribed layout planning.",
                    "3D CMOS-memristor hybrid circuits: devices, integration, architecture, and applications.",
                    "A fast estimation of SRAM failure rate using probability collectives.",
                    "Integrated fluidic-chip co-design methodology for digital microfluidic biochips.",
                    "Transformation from ad hoc EDA to algorithmic EDA.",
                    "On simulated annealing in EDA.",
                    "On pioneering nanometer-era routing problems.",
                    "I attended the nineteenth design automation conference.",
                    "Routability-driven placement algorithm for analog integrated circuits.",
                    "Keep it straight: teaching placement how to better handle designs with datapaths.",
                    "Mixed integer programming models for detailed placement.",
                    "Power-grid (PG) analysis challenges for large microprocessor designs: (our experience with oracle sparc processor designs).",
                    "Efficient on-line module-level wake-up scheduling for high performance multi-module designs.",
                    "Low-power gated bus synthesis for 3d ic via rectilinear shortest-path steiner graph.",
                    "TSV-constrained micro-channel infrastructure design for cooling stacked 3D-ICs.",
                    "Construction of minimal functional skew clock trees.",
                    "Novel pulsed-latch replacement based on time borrowing and spiral clustering.",
                    "On construction low power and robust clock tree via slew budgeting.",
                    "Optimizing the antenna area and separators in layer assignment of multi-layer global routing.",
                    "Simultaneous clock and data gate sizing algorithm with common global objective.",
                    "Construction of realistic gate sizing benchmarks with known optimal solutions.",
                    "The ISPD-2012 discrete cell sizing contest and benchmark suite.",
                    "Towards layout-friendly high-level synthesis.",
                    "Synthesis for advanced nodes: an industry perspective.",
                    "Reality-driven physical synthesis.",
                    "Optimal slack-driven block shaping algorithm in fixed-outline floorplanning.",
                    "Scalable hierarchical floorplanning for fast physical prototyping of systems-on-chip.",
                    "MAPLE: multilevel adaptive placement for mixed-size designs.",
                    "A size scaling approach for mixed-size placement."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ISPD 2011",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2011",
                "sub_name": "Proceedings of the 2011 International Symposium on Physical Design, ISPD 2011, Santa Barbara, California, USA, March 27-30, 2011.",
                "count": 30,
                "papers": [
                    "Robust design of power-efficient VLSI circuits.",
                    "Professor Ernest Kuh's talk.",
                    "Placement and beyond in honor of Ernest S. Kuh.",
                    "From academic ideas to practical physical design tools.",
                    "On old and new routing problems.",
                    "Grid-to-ports clock routing for high performance microprocessor designs.",
                    "Cross link insertion for improving tolerance to variations in clock network synthesis.",
                    "Synthesis of low power clock trees for handling power-supply variations.",
                    "RegularRoute: an efficient detailed router with regular routing patterns.",
                    "An enhanced global router with consideration of general layer directives.",
                    "Obstacle-aware length-matching bus routing.",
                    "Co-optimization of droplet routing and pin assignment in disposable digital microfluidic biochips.",
                    "3DICs for tera-scale computing: a case study.",
                    "Advances in 3D integrated circuits.",
                    "Assembling 2D blocks into 3D chips.",
                    "Automated placement for custom digital designs.",
                    "Quantifying academic placer performance on custom designs.",
                    "Regularity-constrained floorplanning for multi-core processors.",
                    "Power-driven flip-flop merging and relocation.",
                    "INTEGRA: fast multi-bit flip-flop clustering for clock power saving based on interval graphs.",
                    "Obstacle-aware clock-tree shaping during placement.",
                    "Timing slack aware incremental register placement with non-uniform grid generation for clock mesh synthesis.",
                    "Impact of manufacturing on routing methodology at 32/22 nm.",
                    "The ISPD-2011 routability-driven placement contest and benchmark suite.",
                    "Vertical slit transistor based integrated circuits (veSTICs): feasibility study.",
                    "Litho and design: moore close than ever.",
                    "E-beam lithography stencil planning and optimization with overlapped characters.",
                    "More realistic power grid verification based on hierarchical current and power constraints.",
                    "Lagrangian relaxation for gate implementation selection.",
                    "Stochastic analog circuit behavior modeling by point estimation method."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ISPD 2010",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2010",
                "sub_name": "Proceedings of the 2010 International Symposium on Physical Design, ISPD 2010, San Francisco, California, USA, March 14-17, 2010.",
                "count": 36,
                "papers": [
                    "Physical design of biological systems.",
                    "Going with the flow: bridging the gap between theory and practice in physical design.",
                    "Design planning trends and challenges.",
                    "What makes a design difficult to route.",
                    "Physical design challenges beyond the 22nm node.",
                    "Challenges and opportunities in optimization of automotive electronics.",
                    "Thinking outside of the chip.",
                    "B-escape: a simultaneous escape routing algorithm based on boundary routing.",
                    "FOARS: FLUTE based obstacle-avoiding rectilinear steiner tree construction.",
                    "Completing high-quality global routes.",
                    "Analog layout synthesis: what's missing?",
                    "Design platform for electrical and physical co-design of analog circuits.",
                    "Automatic generation of hierarchical placement rules for analog integrated circuits.",
                    "Adding a new dimension to physical design.",
                    "Physical design implementation for 3D IC: methodology and tools.",
                    "Efficient design practices for thermal management of a TSV based 3D IC system.",
                    "An analytical placer for mixed-size 3D placement.",
                    "Logical and physical restructuring of fan-in trees.",
                    "Ultra-fast interconnect driven cell cloning for minimizing critical path delay.",
                    "ITOP: integrating timing optimization within placement.",
                    "Physical synthesis of bus matrix for high bandwidth low power on-chip communications.",
                    "Dummy fill optimization for enhanced manufacturability.",
                    "Density gradient minimization with coupling-constrained dummy fill for CMP control.",
                    "Total sensitivity based dfm optimization of standard library cells.",
                    "A matching based decomposer for double patterning lithography.",
                    "Skew management of NBTI impacted gated clock trees.",
                    "Accurate clock mesh sizing via sequential quadraticprogramming.",
                    "ISPD 2010 high performance clock network synthesis contest: benchmark suite and results.",
                    "Impact of local interconnects on timing and power in a high performance microprocessor.",
                    "Interconnect power and delay optimization by dynamic programming in gridded design rules.",
                    "Performance study of VeSFET-based, high-density regular circuits.",
                    "A statistical framework for designing on-chip thermal sensing infrastructure in nano-scale systems.",
                    "Optimal wiring topology for electromigration avoidance considering multiple layers and obstacles.",
                    "SafeChoice: a novel clustering algorithm for wirelength-driven placement.",
                    "Droplet-routing-aware module placement for cross-referencing biochips.",
                    "A two-stage ILP-based droplet routing algorithm for pin-constrained digital microfluidic biochips."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ISPD 2009",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2009",
                "sub_name": "Proceedings of the 2009 International Symposium on Physical Design, ISPD 2009, San Diego, California, USA, March 29 - April 1, 2009.",
                "count": 33,
                "papers": [
                    "One look into the future of CMOS chip design.",
                    "Early analysis for power distribution networks.",
                    "Post-floorplanning power/ground ring synthesis for multiple-supply-voltage designs.",
                    "Multi-voltage floorplan design with optimal voltage assignment.",
                    "Robust interconnect communication capacity algorithm by geometric programming.",
                    "A new algorithm for simultaneous gate sizing and threshold voltage assignment.",
                    "On stress aware active area sizing, gate sizing, and repeater insertion.",
                    "Fast buffering for optimizing worst slack and resource consumption in repeater trees.",
                    "On improving optimization effectiveness in interconnect-driven physical synthesis.",
                    "Will 22nm be our catch 22!: design and cad challenges.",
                    "New strategies for gridded physical design for 32nm technologies and beyond.",
                    "Vertical slit transistor based integrated circuits (VeSTICs) paradigm.",
                    "Graphene based transistors: physics, status and future perspectives.",
                    "Accelerated design of analog, mixed-signal circuits in Titan.",
                    "Physical design methodology for analog circuitsin a system-on-a-chip environment.",
                    "Constraint-driven design: the next step towards analog design automation.",
                    "Transistor-level layout of high-density regular circuits.",
                    "Physical optimization for FPGAs using post-placement topology rewriting.",
                    "A routing approach to reduce glitches in low power FPGAs.",
                    "Double patterning layout decomposition for simultaneous conflict and stitch minimization.",
                    "An automatic optical-simulation-based lithography hotspot fix flow for post-route optimization.",
                    "Redundant via insertion with wire bending.",
                    "Wire shaping is practical.",
                    "Industrial clock design.",
                    "An algorithm for routing with capacitance/distance constraints for clock distribution in microprocessors.",
                    "Ispd2009 clock network synthesis contest.",
                    "Critical-trunk based obstacle-avoiding rectilinear steiner tree routings for delay and slack optimization.",
                    "Robust layer assignment for via optimization in multi-layer global routing.",
                    "A faster approximation scheme for timing driven minimum cost layer assignment.",
                    "Diffusion-driven congestion reduction for substrate topological routing.",
                    "The challenges of correlating silicon and models in high variability CMOS processes.",
                    "Synthesizing a representative critical path for post-silicon delay prediction.",
                    "A metal-only-ECO solver for input-slew and output-loading violations."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ISPD 2008",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2008",
                "sub_name": "Proceedings of the 2008 International Symposium on Physical Design, ISPD 2008, Portland, Oregon, USA, April 13-16, 2008.",
                "count": 33,
                "papers": [
                    "Design or manufacturing: which will be best for the future of the semiconductor roadmap?",
                    "RUMBLE: an incremental, timing-driven, physical-synthesis optimization algorithm.",
                    "Robust gate sizing via mean excess delay minimization.",
                    "Multi-scenario buffer insertion in multi-core processor designs.",
                    "Blockage and voltage island-aware dual-vdd buffered tree construction under fixed buffer locations.",
                    "Metal-density driven placement for cmp variation and routability.",
                    "Highly efficient gradient computation for density-constrained analytical placement methods.",
                    "Abacus: fast legalization of standard cell circuits with minimal movement.",
                    "3-D floorplanning using labeled tree and dual sequences.",
                    "Variations, margins, and statistics.",
                    "Implications of device timing variability on full chip timing.",
                    "How to get real mad.",
                    "A robust approach to lithography friendly design implementation.",
                    "Fast interconnect synthesis with layer assignment.",
                    "RF interconnects for communications on-chip.",
                    "Placement challenges for structured ASICs.",
                    "A framework for layout-level logic restructuring.",
                    "Optimizing non-monotonic interconnect using functional simulation and logic restructuring.",
                    "Reap what you sow: spare cells for post-silicon metal fix.",
                    "Optimal post-routing redundant via insertion.",
                    "Efficient multilayer routing based on obstacle-avoiding preferred direction steiner tree.",
                    "An O(nlogn) edge-based algorithm for obstacle-avoiding rectilinear steiner tree construction.",
                    "Non-slicing floorplanning-based crosstalk reduction on gridless track assignment for a gridless routing system with fast pseudo-tile extraction.",
                    "Issues in global routing.",
                    "The coming of age of (academic) global routing.",
                    "The ISPD global routing benchmark suite.",
                    "Statistical timing analysis considering spatially and temporally correlated dynamic power supply noise.",
                    "Stress aware layout optimization.",
                    "Discrete buffer and wire sizing for link-based non-tree clock networks.",
                    "Activity and register placement aware gated clock network design.",
                    "Automated design of digital microfluidic lab-on-chip under pin-count constraints.",
                    "Physical design issues in biofluidic microchips.",
                    "A high-performance droplet router for digital microfluidic biochips."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ISPD 2007",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2007",
                "sub_name": "Proceedings of the 2007 International Symposium on Physical Design, ISPD 2007, Austin, Texas, USA, March 18-21, 2007.",
                "count": 32,
                "papers": [
                    "Cell architecture: key physical design features and methodology.",
                    "An 8-core, 64-thread, 64-bit power efficient sparc soc (niagara2).",
                    "Dummy fill density analysis with coupling constraints.",
                    "Variability-driven formulation for simultaneous gate sizing and post-silicon tunability allocation.",
                    "Is your layout density verification exact?: a fast exact algorithm for density calculation.",
                    "Pattern sensitive placement for manufacturability.",
                    "Worst-case delay analysis considering the variability of transistors and interconnects.",
                    "Accurate power grid analysis with behavioral transistor network modeling.",
                    "Empire: an efficient and compact multiple-parameterized model order reduction method.",
                    "Repeater insertion for concurrent setup and hold time violations with power-delay trade-off.",
                    "Circuit optimization for leakage power reduction using multi-threshold voltages for high performance microprocessors.",
                    "Rules vs tools: what's the right way to address IC manufacturing complexity?",
                    "Carbon nanotube interconnects.",
                    "Optical interconnects: a viable solution for interconnection beyond 10 gbit/sec.",
                    "X-architecture placement based on effective wire models.",
                    "A morphing approach to address placement stability.",
                    "Mixed-size placement with fixed macrocells using grid-warping.",
                    "An effective clustering algorithm for mixed-size placement.",
                    "A stable fixed-outline floorplanning method.",
                    "Efficient obstacle-avoiding rectilinear steiner tree construction.",
                    "Maze routing steiner trees with effective critical sink optimization.",
                    "Semi-detailed bus routing with variation reduction.",
                    "Solving hard instances of FPGA routing with a congestion-optimal restrained-norm path search space.",
                    "Algorithms for automatic length compensation of busses in analog integrated circuits.",
                    "ISPD placement contest updates and ISPD 2007 global routing contest.",
                    "The good, the bad, and the statistical.",
                    "Fear, uncertainty and statistics.",
                    "Variation and litho driven physical implementation system.",
                    "A DFM aware, space based router.",
                    "Minimal skew clock embedding considering time variant temperature gradient.",
                    "An efficent clustering algorithm for low power clock tree synthesis.",
                    "A methodology for interconnect dimension determination."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ISPD 2006",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2006",
                "sub_name": "Proceedings of the 2006 International Symposium on Physical Design, ISPD 2006, San Jose, California, USA, April 9-12, 2006.",
                "count": 39,
                "papers": [
                    "Commercial CAD: challenges and opportunities.",
                    "Robust extraction of spatial correlation.",
                    "Timing analysis in presence of supply voltage and temperature variations.",
                    "Probabilistic evaluation of solutions in variability-driven optimization.",
                    "SAMSON: a generalized second-order arnoldi method for reducing multiple source linear network with susceptance.",
                    "Non-gaussian statistical parameter modeling for SSTA with confidence interval analysis.",
                    "introduction to electromigration-aware physical design.",
                    "IC failure mechanisms yesterday, today, tomorrow: implications from test to DFM.",
                    "An O(nlogn) algorithm for obstacle-avoiding routing tree construction in the lambda-geometry plane.",
                    "An optimal jumper insertion algorithm for antenna avoidance/fixing on general routing trees with obstacles.",
                    "NEMO: a new implicit connection graph-based gridless router with multi-layer planes and pseudo-tile propagation.",
                    "Prediction and reduction of routing congestion.",
                    "Seeing the forest and the trees: Steiner wirelength optimization in placemen.",
                    "Floorplan and power/ground network co-synthesis for fast design convergence.",
                    "Noise driven in-package decoupling capacitor optimization for power integrity.",
                    "Efficient decoupling capacitor planning via convex programming methods.",
                    "High accurate pattern based precondition method for extremely large power/ground grid analysis.",
                    "Optimal partitioned fault-tolerant bus layout for reducing power in nanometer designs.",
                    "Efficient generation of short and fast repeater tree topologies.",
                    "Fast buffer insertion considering process variations.",
                    "Placement and routing optimization in the brain.",
                    "Integrated retiming and simultaneous Vdd/Vth scaling for total power minimization.",
                    "Statistical clock tree routing for robustness to process variations.",
                    "Variation tolerant buffered clock network synthesis with cross links.",
                    "Chip assembly: a new paradigm in hierarchical physical design.",
                    "Physical design challenges for multi-million gate SoC's: an STMicroelectronics perspective.",
                    "ISPD 2006 Placement Contest: Benchmark Suite and Results.",
                    "Clock tree design challenges for robust and low power design.",
                    "Clockless IC design using handshake technology.",
                    "Solving hard instances of floorplacement.",
                    "Integrating dynamic thermal via planning with 3D floorplanning algorithm.",
                    "Effective linear programming based placement methods.",
                    "Improved method of cell placement with symmetry constraints for analog IC layout design.",
                    "Net cluster: a net-reduction based clustering preprocessing algorithm.",
                    "Satisfying whitespace requirements in top-down placement.",
                    "Dragon2006: blockage-aware congestion-controlling mixed-size placer.",
                    "mPL6: enhanced multilevel mixed-size placement.",
                    "NTUplace2: a hybrid placer using partitioning and analytical techniques.",
                    "A faster implementation of APlace."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ISPD 2005",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2005",
                "sub_name": "Proceedings of the 2005 International Symposium on Physical Design, ISPD 2005, San Francisco, California, USA, April 3-6, 2005.",
                "count": 44,
                "papers": [
                    "The death of logic synthesis.",
                    "A diagnostic method for detecting and assessing the impact of physical design optimizations on routing.",
                    "An efficient tile-based ECO router with routing graph reduction and enhanced global routing flow.",
                    "Routing of analog busses with parasitic symmetry.",
                    "Coupling aware timing optimization and antenna avoidance in layer assignment.",
                    "Fast and accurate rectilinear steiner minimal tree algorithm for VLSI design.",
                    "A global routing method for 2-layer ball grid array packages.",
                    "Geometric programming for circuit optimization.",
                    "Delay insertion method in clock skew scheduling.",
                    "Improved algorithms for link-based non-tree clock networks for skew variability reduction.",
                    "Effects of on-chip inductance on power distribution grid.",
                    "A fast algorithm for power grid design.",
                    "Simultaneous buffer insertion and wire sizing considering systematic CMP variation and random leff variation.",
                    "An efficient surface-based low-power buffer insertion algorithm.",
                    "Early research experience with OpenAccess gear: an open source development environment for physical design.",
                    "A new era for CAD.",
                    "Challenges of analog/mixed-signal SoC design and verification.",
                    "Tutorial on DFM for physical design.",
                    "Modern floorplanning based on fast simulated annealing.",
                    "Multi-bend bus driven floorplanning.",
                    "Floorplan assisted data rate enhancement through wire pipelining: a real assessment.",
                    "Are floorplan representations important in digital design?",
                    "An efficient technology mapping algorithm targeting routing congestion under delay constraints.",
                    "Wire length prediction-based technology mapping and fanout optimization.",
                    "Mapping algorithm for large-scale field programmable analog array.",
                    "Fast interval-valued statistical interconnect modeling and reduction.",
                    "Thermal via placement in 3D ICs.",
                    "Technology migration technique for designs with strong RET-driven layout restrictions.",
                    "Insights and perspectives on physical synthesis.",
                    "Physical design tools for hierarchy.",
                    "Multilevel generalized force-directed method for circuit placement.",
                    "Unified quadratic programming approach for mixed mode placement.",
                    "A semi-persistent clustering technique for VLSI circuit placement.",
                    "Evaluation of placer suboptimality via zero-change netlist transformations.",
                    "The ISPD2005 placement contest and benchmark suite.",
                    "FastPlace: an analytical placer for mixed-mode designs.",
                    "Capo: robust and scalable open-source min-cut floorplacer.",
                    "mPL6: a robust multilevel mixed-size placement engine.",
                    "Recursive bisection placement: feng shui 5.0 implementation details.",
                    "APlace: a general analytic placement framework.",
                    "NTUplace: a ratio partitioning based placement algorithm for large-scale mixed-size designs.",
                    "mFAR: fixed-points-addition-based VLSI placement algorithm.",
                    "Kraftwerk: a versatile placement approach.",
                    "Dragon2005: large-scale mixed-size placement tool."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ISPD 2004",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2004",
                "sub_name": "Proceedings of the 2004 International Symposium on Physical Design, ISPD 2004, Phoenix, Arizona, USA, April 18-21, 2004.",
                "count": 33,
                "papers": [
                    "The four degrees of 3D.",
                    "Almost optimum placement legalization by minimum cost flow and dynamic programming.",
                    "Sensitivity guided net weighting for placement driven synthesis.",
                    "Implementation and extensibility of an analytic placer.",
                    "FastPlace: efficient analytical placement using cell shifting, iterative local refinement and a hybrid net model.",
                    "Multilevel routing with antenna avoidance.",
                    "An ECO algorithm for eliminating crosstalk violations.",
                    "A fast algorithm for identifying good buffer insertion candidate locations.",
                    "Performance-driven register insertion in placement.",
                    "The great interconnect buffering debate: are you a chicken or an ostrich?",
                    "Floorplanning for throughput.",
                    "Multi-project reticle floorplanning and wafer dicing.",
                    "An area-optimality study of floorplanning.",
                    "Recursive bisection based mixed block placement.",
                    "Design methodology and tools for NEC electronics' structured ASIC ISSP.",
                    "Design considerations for regular fabrics.",
                    "Structured ASIC, evolution or revolution?",
                    "The four degrees of 3D.",
                    "Technology, performance, and computer-aided design of three-dimensional integrated circuits.",
                    "Topology optimization of structured power/ground networks.",
                    "Sensitivity guided net weighting for placement driven synthesis.",
                    "Early-stage power grid analysis for uncertain working modes.",
                    "Power-aware clock tree planning.",
                    "Innovate or perish: FPGA physical design.",
                    "On optimal physical synthesis of sleep transistors.",
                    "Mutual inductance extraction and the dipole approximation.",
                    "A new multi-ramp driver model with RLC interconnect load.",
                    "Optimal gate sizing for coupling-noise reduction.",
                    "Clock network sizing via sequential linear programming with time-domain analysis.",
                    "Placement driven synthesis case studies on two sets of two chips: hierarchical and flat.",
                    "A study of netlist structure and placement efficiency.",
                    "Probabilistic congestion prediction.",
                    "A predictive distributed congestion metric and its application to technology mapping."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "ISPD 2003",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2003",
                "sub_name": "Proceedings of the 2003 International Symposium on Physical Design, ISPD 2003, Monterey, CA, USA, April 6-9, 2003.",
                "count": 31,
                "papers": [
                    "Keynote Speaker.",
                    "Important placement considerations for modern VLSI chips.",
                    "Convergence of placement technology in physical synthesis: is placement really a point tool?",
                    "3D thermal-ADI: an efficient chip-level transient thermal simulator.",
                    "Capturing crosstalk-induced waveform for accurate static timing analysis.",
                    "Closed form expressions for extending step delay and slew metrics to ramp inputs.",
                    "Explicit gate delay model for timing evaluation.",
                    "Signal integrity management in an SoC physical design flow.",
                    "There is life left in ASICs.",
                    "The scaling challenge: can correct-by-construction design help?",
                    "Timing driven force directed placement with physical net constraints.",
                    "Fine granularity clustering for large scale placement problems.",
                    "Partition-driven standard cell thermal placement.",
                    "Local unidirectional bias for smooth cutsize-delay tradeoff in performance-driven bipartitioning.",
                    "Optimality, scalability and stability study of partitioning and placement algorithms.",
                    "Benchmarking for large-scale placement and beyond.",
                    "A complete design for power methodology and flow for large ASICs.",
                    "Layout impact of resolution enhancement techniques: impediment or opportunity?",
                    "Advanced routing in changing technology landscape.",
                    "Research directions for coevolution of rules and routers.",
                    "Constrained \"Modern\" Floorplanning.",
                    "An integrated floorplanning with an efficient buffer planning algorithm.",
                    "Floorplanning of pipelined array modules using sequence pairs.",
                    "Efficient Steiner tree construction based on spanning graphs.",
                    "Porosity aware buffered steiner tree construction.",
                    "Optimal minimum-delay/area zero-skew clock tree wire-sizing in pseudo-polynomial time.",
                    "Process variation aware clock tree routing.",
                    "An architectural exploration of via patterned gate arrays.",
                    "Architecture and synthesis for multi-cycle communication.",
                    "Synthesis and placement flow for gain-based programmable regular fabrics.",
                    "Fishbone: a block-level placement and routing scheme."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "ISPD 2002",
        "info": "Del Mar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2002",
                "sub_name": "Proceedings of 2002 International Symposium on Physical Design, ISPD 2002, Del Mar, CA, USA, April 7-10, 2002.",
                "count": 34,
                "papers": [
                    "Challenges and principles of physical design.",
                    "An effective congestion driven placement framework.",
                    "Consistent placement of macro-blocks using floorplanning and standard-cell placement.",
                    "Leakage current in low standby power and high performance devices: trends and challenges.",
                    "Leakage-tolerant design techniques for high performance processors.",
                    "Design hierarchy guided multilevel circuit partitioning.",
                    "Physical hierarchy generation with routing congestion control.",
                    "Routability driven white space allocation for fixed-die standard-cell placement.",
                    "Routability driven floorplanner with buffer block planning.",
                    "Integrated floorplanning with buffer/channel insertion for bus-based microprocessor designs.",
                    "TEG: a new post-layout optimization method.",
                    "An algorithm for optimal decoupling capacitor sizing and placement for standard cell layouts.",
                    "On-chip thermal engineering for peta-scale integration.",
                    "Shield count minimization in congested regions.",
                    "On convergence of switching windows computation in presence of crosstalk noise.",
                    "Buffer insertion with adaptive blockage avoidance.",
                    "Buffer tree synthesis with consideration of temporal locality, sink polarity requirements, solution cost and blockages.",
                    "Simultaneous driver sizing and buffer insertion using a delay penalty estimation technique.",
                    "A roadmap and vision for physical design.",
                    "Physical design with multiple on-chip voltages.",
                    "Incremental delay change due to crosstalk noise.",
                    "Crosstalk noise optimization by post-layout transistor sizing.",
                    "Understanding and addressing the impact of wiring congestion during technology mapping.",
                    "Closing the smoothness and uniformity gap in area fill synthesis.",
                    "Min-max placement for large-scale timing optimization.",
                    "Global clustering-based performance-driven circuit partitioning.",
                    "Net criticality revisited: an effective method to improve timing in physical design.",
                    "FAR: fixed-points addition & relaxation based placement.",
                    "Timing closure based on physical hierarchy.",
                    "Timing-driven routing for FPGAs based on Lagrangian relaxation.",
                    "sub-SAT: a formulation for relaxed boolean satisfiability with applications in routing.",
                    "Temporal logic replication for dynamically reconfigurable FPGA partitioning.",
                    "Twin binary sequences: a non-redundant representation for general non-slicing floorplan.",
                    "Geometrically parameterized interconnect performance models for interconnect synthesis."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "ISPD 2001",
        "info": "Sonoma County, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2001",
                "sub_name": "Proceedings of the 2001 International Symposium on Physical Design, ISPD 2001, Sonoma County, CA, USA, April 1-4, 2001.",
                "count": 35,
                "papers": [
                    "Differences in ASIC, COT and processor design (panel).",
                    "Buffered Steiner trees for difficult instances.",
                    "An exact algorithm for coupling-free routing.",
                    "RC(L) interconnect sizing with second order considerations via posynomial programming.",
                    "A performance-driven standard-cell placer based on a modified force-directed algorithm.",
                    "Reporting of standard cell placement results.",
                    "Application of automated design migration to alternating phase shift mask design.",
                    "Reticle enhancement technology trends: resource and manufacturability implications for the implementation of physical designs.",
                    "Impact of RET on physical layouts.",
                    "Design of robust global power and ground networks.",
                    "Decoupling capacitance allocation for power supply noise suppression.",
                    "Overview of continuous optimization advances and applications to circuit tuning.",
                    "Design and analysis of physical design algorithms.",
                    "Multi-GHz interconnect effects in microprocessors.",
                    "Min-cut partitioning with functional replication for technology mapped circuits using minimum area overhead.",
                    "Maximum current estimation considering power gating.",
                    "Estimating routing congestion using probabilistic analysis.",
                    "Dummy feature placement for chemical-mechanical polishing uniformity in a shallow trench isolation process.",
                    "Slicing floorplan design with boundary-constrained modules.",
                    "A regularity-driven fast gridless detailed router for high frequency datapath designs.",
                    "Revisiting floorplan representations.",
                    "Consistent floorplanning with super hierarchical constraints.",
                    "ECBL: an extended corner block list with solution space including optimum placement.",
                    "Rectilinear block packing using O-tree representation.",
                    "Congestion estimation during top-down placement.",
                    "Interconnect characteristics of 2.5-D system integration scheme.",
                    "Hierarchical physical design methodology for multi-million gate chips.",
                    "Overcoming wireload model uncertainty during physical design.",
                    "A minimum cost path search algorithm through tile obstacles.",
                    "An exact algorithm for solving difficult detailed routing problems.",
                    "Boosters for driving long on-chip interconnects: design issues, interconnect synthesis and comparison with repeaters.",
                    "Physical design for FPGAs.",
                    "A comparative study of two Boolean formulations of FPGA detailed routing constraints.",
                    "Analysis and optimization of thermal issues in high-performance VLSI.",
                    "Thermal-ADI: a linear-time chip-level dynamic thermal simulation algorithm based on alternating-direction-implicit (ADI) method."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "ISPD 2000",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/2000",
                "sub_name": "Proceedings of the 2000 International Symposium on Physical Design, ISPD 2000, San Diego, CA, USA, April 9-12, 2000.",
                "count": 34,
                "papers": [
                    "Requirements for models of achievable routing.",
                    "DUNE: a multi-layer gridless routing system with wire planning.",
                    "Provably good global routing by a new approximation algorithm for multicommodity flow.",
                    "Exact switchbox routing with search space reduction.",
                    "Zero-skew clock tree construction by simultaneous routing, wire sizing and buffer insertion.",
                    "The bottom-10 problems in EDA (panel session (title only)).",
                    "Pseudo pin assignment with crosstalk noise control.",
                    "Aggressor alignment for worst-case coupling noise.",
                    "Simultaneous shield insertion and net ordering for capacitive and inductive coupling minimization.",
                    "Wire packing: a strong formulation of crosstalk-aware chip-level track/layer assignment with an efficient integer programming solution.",
                    "A two moment RC delay metric for performance optimization.",
                    "Layout tools for analog ICs and mixed-signal SoCs: a survey.",
                    "Incremental physical design.",
                    "Itanium processor clock design.",
                    "Methodology for repeater insertion management in the RTL, layout, floorplan and fullchip timing databases of the Itanium microprocessor.",
                    "Buffer minimization in pass transistor logic.",
                    "A performance optimization method by gate sizing using statistical static timing analysis.",
                    "Simulating frequency-dependent current distribution for inductance modeling of on-chip copper interconnects.",
                    "Datapath routing based on a decongestion metric.",
                    "Optimal reliable crosstalk-driven interconnect optimization.",
                    "A hybrid dynamic/quadratic programming algorithm for interconnect tree optimization.",
                    "Critical area computation for missing material defects in VLSI circuits.",
                    "Multi-center congestion estimation and minimization during placement.",
                    "A snap-on placement tool.",
                    "A practical clock tree synthesis for semi-synchronous circuits.",
                    "EDA and the Internet (panel session - title only).",
                    "An enhanced perturbing algorithm for floorplan design using the O-tree representation.",
                    "Floorplan area minimization using Lagrangian relaxation.",
                    "Planning buffer locations by network flows.",
                    "Routability-driven repeater block planning for interconnect-centric floorplanning.",
                    "Multilevel cooperative search: application to the circuit/hypergraph partitioning problem.",
                    "What is a floorplan?.",
                    "Classical floorplanning harmful?",
                    "The right floorplanning formulations for future chip implementation methodologies (panel discussion - title only)."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "ISPD 1999",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/1999",
                "sub_name": "Proceedings of the 1999 International Symposium on Physical Design, ISPD 1999, Monterey, CA, USA, April 12-14, 1999.",
                "count": 32,
                "papers": [
                    "The deep sub-micron signal integrity challenge.",
                    "A methodology to analyze power, voltage drop and their effects on clock skew/delay in early stages of design.",
                    "EMI-noise analysis under ASIC design environment.",
                    "An efficient sequential quadratic programming formulation of optimal wire spacing for cross-talk noise avoidance routing.",
                    "Post-routing timing optimization with routing characterization.",
                    "Buffer insertion for clock delay and skew minimization.",
                    "Incremental capacitance extraction and its application to iterative timing-driven detailed routing.",
                    "Interconnect coupling noise in CMOS VLSI circuits.",
                    "SRC physical design top ten problem.",
                    "Towards synthetic benchmark circuits for evaluating timing-driven CAD tools.",
                    "Generation of very large circuits to benchmark the partitioning of FPGA.",
                    "Transistor level micro-placement and routing for two-dimensional digital VLSI cell synthesis.",
                    "Partitioning by iterative deletion.",
                    "Optimal partitioners and end-case placers for standard-cell layout.",
                    "Slicing floorplans with range constraint.",
                    "Arbitrary convex and concave rectilinear block packing using sequence-pair.",
                    "Subwavelength optical lithography: challenges and impact on physical design.",
                    "Optimal phase conflict removal for layout of dark field alternating phase shifting masks.",
                    "Gate sizing with controlled displacement.",
                    "Simultaneous buffer insertion and non-Hanan optimization for VLSI interconnect under a higher order AWE model.",
                    "Efficient solution of systems of orientation constraints.",
                    "On the behavior of congestion minimization during placement.",
                    "Partitioning with terminals: a \"new\" problem and new benchmarks.",
                    "Transistor level placement for full custom datapath cell design.",
                    "Circuit clustering using graph coloring.",
                    "Interconnect thermal modeling for determining design limits on current density.",
                    "Standard cell placement for even on-chip thermal distribution.",
                    "A method of measuring nets routability for MCM's general area routing problems.",
                    "Getting to the bottom of deep submicron II: a global wiring paradigm.",
                    "Crosstalk constrained global route embedding.",
                    "Timing driven maze routing.",
                    "VIA design rule consideration in multi-layer maze routing algorithms."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "ISPD 1998",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/1998",
                "sub_name": "Proceedings of the 1998 International Symposium on Physical Design, ISPD 1998, Monterey, CA, USA, April 6-8, 1998.",
                "count": 31,
                "papers": [
                    "On wirelength estimations for row-based placement.",
                    "Performance-driven soft-macro clustering and placement by preserving HDL design hierarchy.",
                    "Nostradamus: a floorplanner of uncertain design.",
                    "Timing metrics for physical design of deep submicron technologies.",
                    "Moore's law and physical design of ICs.",
                    "Greedy wire-sizing is linear time.",
                    "An efficient technique for device and interconnect optimization in deep submicron designs.",
                    "Device-level early floorplanning algorithms for RF circuits.",
                    "A layout approach to monolithic microwave IC.",
                    "CHDStd - application support for reusable hierarchical interconnect timing views.",
                    "The ISPD98 circuit benchmark suite.",
                    "Panel: Given that SEMATECH is levelling the semiconductor technology playing field, will corporate CAD (in particular, PD) tools continue to serve as enablers/differentiators of technology in the future? (panel).",
                    "Critical area computation - a new approach.",
                    "Filling and slotting: analysis and algorithms.",
                    "Global wires: harmful?.",
                    "Partitioning using second-order information and stochastic-gain functions.",
                    "A parallel algorithm for zero skew clock tree routing.",
                    "On convex formulation of the floorplan area minimization problem.",
                    "A pattern matching algorithm for verification and analysis of very large IC layouts.",
                    "LIBRA - a library-independent framework for post-layout performance optimization.",
                    "Estimation of maximum current envelope for power bus analysis and design.",
                    "New efficient algorithms for computing effective capacitance.",
                    "Calculation of ramp response of lossy transmission lines using two-port network functions.",
                    "Switch-matrix architecture and routing for FPDs.",
                    "Sequence-pair based placement method for hard/soft/pre-placed modules.",
                    "Rectilinear block placement using sequence-pair.",
                    "Topology constrained rectilinear block packing for layout reuse.",
                    "Futures for partitioning in physical design (tutorial).",
                    "Chip-level area routing.",
                    "Routing tree topology construction to meet interconnect timing constraints.",
                    "Analysis, reduction and avoidance of crosstalk on VLSI chips."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "ISPD 1997",
        "info": "Napa Valley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispd/1997",
                "sub_name": "Proceedings of the 1997 International Symposium on Physical Design, ISPD 1997, Napa Valley, California, USA, April 14-16, 1997.",
                "count": 33,
                "papers": [
                    "Faster minimization of linear wirelength for global placement.",
                    "Network flow based multi-way partitioning with area and pin constraints.",
                    "Partitioning-based standard-cell global placement with an exact objective.",
                    "VLSI/PCB placement with obstacles based on sequence-pair.",
                    "Timing driven placement in interaction with netlist transformations.",
                    "Regular layout generation of logically optimized datapaths.",
                    "Minimizing interconnect energy through integrated low-power placement and combinational logic synthesis.",
                    "On two-step routing for FPGAS.",
                    "A simple and effective greedy multilayer router for MCMs.",
                    "Performance driven global routing for standard cell design.",
                    "A min-cost flow based min-cost rectilinear Steiner distance-preserving tree construction.",
                    "Efficient heuristics for the minimum shortest path Steiner arborescence problem with applications to VLSI physical design.",
                    "Provably good routing tree construction with multi-port terminals.",
                    "A roadmap of CAD tool changes for sub-micron interconnect problems.",
                    "C5M - a control logic layout synthesis system for high-performance microprocessors.",
                    "A VLSI artwork legalization technique based on a new criterion of minimum layout perturbation.",
                    "A pseudo-hierarchical methodology for high performance microprocessor design.",
                    "Concurrent transistor sizing and buffer insertion by considering cost-delay tradeoffs.",
                    "Towards a new benchmarking paradigm in EDA: analysis of equivalence class mutant circuit distributions.",
                    "How good are slicing floorplans?.",
                    "Slicibility of rectangular graphs and floorplan optimization.",
                    "Power optimization for FPGA look-up tables.",
                    "A matrix synthesis approach to thermal placement.",
                    "Preserving HDL synthesis hierarchy for cell placement.",
                    "EWA: exact wiring-sizing algorithm.",
                    "Minimization of chip size and power consumption of high-speed VLSI buffers.",
                    "Closed form solution to simultaneous buffer insertion/sizing and wire sizing.",
                    "Physical design: reminiscing and looking ahead.",
                    "Physical design: mathematical models and methods.",
                    "The quarter micron challenge: intergrating physical and logic design.",
                    "Chip hierarchical design system (CHDS): a foundation for timing-driven physical design into the 21st century.",
                    "The future of logic synthesis and physical design in deep-submicron process geometries.",
                    "Physical design challenges for performance."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5. ACM/SIGDA Physical Design Workshop 1996",
        "info": "Reston, Virginia, USA",
        "venues": []
    }
]