[
    {
        "name": "JETC",
        "year": "2022",
        "info": "Volume 18, 2022",
        "count": 23,
        "papers": [
            "Introduction to the Special Issue on Hardware-Assisted Security for Emerging Internet of Things.",
            "SCALPEL: Exploring the Limits of Tag-enforced Compartmentalization.",
            "A Modular End-to-End Framework for Secure Firmware Updates on Embedded Systems.",
            "EM-X-DL: Efficient Cross-device Deep Learning Side-channel Attack With Noisy EM Signatures.",
            "Integrated Power Signature Generation Circuit for IoT Abnormality Detection.",
            "Low-overhead Hardware Supervision for Securing an IoT Bluetooth-enabled Device: Monitoring Radio Frequency and Supply Voltage.",
            "Enhancing Privacy in PUF-Cash through Multiple Trusted Third Parties and Reinforcement Learning.",
            "Fortifying Vehicular Security through Low Overhead Physically Unclonable Functions.",
            "PUF based Secure and Lightweight Authentication and Key-Sharing Scheme for Wireless Sensor Network.",
            "Introduction to the Special Issue on Design Automation for Quantum Computing.",
            "Towards Compact Modeling of Noisy Quantum Computers: A Molecular-Spin-Qubit Case of Study.",
            "Ket Quantum Programming.",
            "OpenQL: A Portable Quantum Programming Framework for Quantum Accelerators.",
            "Test Points for Online Monitoring of Quantum Circuits.",
            "Polyhedral-Based Compilation Framework for In-Memory Neural Network Accelerators.",
            "Towards All-optical Stochastic Computing Using Photonic Crystal Nanocavities.",
            "Hardware Implementation of Hierarchical Temporal Memory Algorithm.",
            "High-Performance and Energy-Efficient 3D Manycore GPU Architecture for Accelerating Graph Analytics.",
            "Introduction to the Special Issue on Monolithic 3D: Technology, Design and Computing Systems Applications Perspectives.",
            "A ReRAM Memory Compiler for Monolithic 3D Integrated Circuits in a Carbon Nanotube Process.",
            "Design Automation and Test Solutions for Monolithic 3D ICs.",
            "Built-in Self-Test and Fault Localization for Inter-Layer Vias in Monolithic 3D ICs.",
            "A Holistic Solution for Reliability of 3D Parallel Systems."
        ]
    },
    {
        "name": "JETC",
        "year": "2021",
        "info": "Volume 17, 2021",
        "count": 61,
        "papers": [
            "PEAL: Probabilistic Error Analysis Methodology for Low-power Approximate Adders.",
            "Depth-bounded Graph Partitioning Algorithm and Dual Clocking Method for Realization of Superconducting SFQ Circuits.",
            "Neural Network-based Inherently Fault-tolerant Hardware Cryptographic Primitives without Explicit Redundancy Checks.",
            "Network-on-Chip Intellectual Property Protection Using Circular Path-based Fingerprinting.",
            "DeepPeep: Exploiting Design Ramifications to Decipher the Architecture of Compact DNNs.",
            "Lotus: A New Topology for Large-scale Distributed Machine Learning.",
            "GPUOPT: Power-efficient Photonic Network-on-Chip for a Scalable GPU.",
            "A Side-Channel-Resistant Implementation of SABER.",
            "Resilient and Secure Hardware Devices Using ASL.",
            "Power-efficient Spike Sorting Scheme Using Analog Spiking Neural Network Classifier.",
            "Power Management of Monolithic 3D Manycore Chips with Inter-tier Process Variations.",
            "Victims Can Be Saviors: A Machine Learning-based Detection for Micro-Architectural Side-Channel Attacks.",
            "Diagnosis for Reconfigurable Single-Electron Transistor Arrays with a More Generalized Defect Model.",
            "Dynamically Adapting Page Migration Policies Based on Applications' Memory Access Behaviors.",
            "Computational Capacity of Complex Memcapacitive Networks.",
            "Introduction of Special Issue on Hardware and Algorithms for Efficient Machine Learning-Part 1.",
            "Binary Precision Neural Network Manycore Accelerator.",
            "Fast Linear Interpolation.",
            "Accelerating Deep Neuroevolution on Distributed FPGAs for Reinforcement Learning Problems.",
            "CLU: A Near-Memory Accelerator Exploiting the Parallelism in Convolutional Neural Networks.",
            "A Flexible Multichannel EEG Artifact Identification Processor using Depthwise-Separable Convolutional Neural Networks.",
            "multiPULPly: A Multiplication Engine for Accelerating Neural Networks on Ultra-low-power Architectures.",
            "Toward Multi-FPGA Acceleration of the Neural Networks.",
            "Architecting for Artificial Intelligence with Emerging Nanotechnology.",
            "A Survey Describing Beyond Si Transistors and Exploring Their Implications for Future Processors.",
            "Temporal State Machines: Using Temporal Memory to Stitch Time-based Graph Computations.",
            "Introduction to the Special Issue on Emerging Challenges and Solutions in Hardware Security.",
            "Challenging the Security of Logic Locking Schemes in the Era of Deep Learning: A Neuroevolutionary Approach.",
            "Attack Mitigation of Hardware Trojans for Thermal Sensing via Micro-ring Resonator in Optical NoCs.",
            "DTA-PUF: Dynamic Timing-aware Physical Unclonable Function for Resource-constrained Devices.",
            "Hardware Trojan Horse Detection through Improved Switching of Dormant Nets.",
            "Improving the Quality of FPGA RO-PUF by Principal Component Analysis (PCA).",
            "Timing-Optimized Hardware Implementation to Accelerate Polynomial Multiplication in the NTRU Algorithm.",
            "Machine Learning Vulnerability Analysis of FPGA-based Ring Oscillator PUFs and Counter Measures.",
            "Robust and Attack Resilient Logic Locking with a High Application-Level Impact.",
            "Bridging the Gap between RTL and Software Fault Injection.",
            "CONCEALING-Gate: Optical Contactless Probing Resilient Design.",
            "The Uncertainty of Side-channel Analysis: A Way to Leverage from Heuristics.",
            "Improving Deep Learning Networks for Profiled Side-channel Analysis Using Performance Improvement Techniques.",
            "Software-driven Security Attacks: From Vulnerability Sources to Durable Hardware Defenses.",
            "A Lightweight Architecture for Hardware-Based Security in the Emerging Era of Systems of Systems.",
            "SILVerIn: Systematic Integrity Verification of Printed Circuit Board Using JTAG Infrastructure.",
            "Introduction to the Special Issue on Hardware and Algorithms for Efficient Machine Learning - Part 2.",
            "Compressing RNNs to Kilobyte Budget for IoT Devices Using Kronecker Products.",
            "A Cost-Efficient Digital ESN Architecture on FPGA for OFDM Symbol Detection.",
            "A Reconfigurable Multiplier for Signed Multiplications with Asymmetric Bit-Widths.",
            "BPLight-CNN: A Photonics-Based Backpropagation Accelerator for Deep Learning.",
            "Graphene-Based Artificial Synapses with Tunable Plasticity.",
            "Dynamic Regularization on Activation Sparsity for Neural Network Efficiency Improvement.",
            "A Scalable Cluster-based Hierarchical Hardware Accelerator for a Cortically Inspired Algorithm.",
            "Improving Barnes-Hut t-SNE Algorithm in Modern GPU Architectures with Random Forest KNN and Simulated Wide-Warp.",
            "Quantization of Deep Neural Networks for Accurate Edge Computing.",
            "Quit When You Can: Efficient Evaluation of Ensembles by Optimized Ordering.",
            "Design of a Robust Memristive Spiking Neuromorphic System with Unsupervised Learning in Hardware.",
            "A Quality-assured Approximate Hardware Accelerators-based on Machine Learning and Dynamic Partial Reconfiguration.",
            "Multi-Cycle-Consistent Adversarial Networks for Edge Denoising of Computed Tomography Images.",
            "ShuntFlowPlus: An Efficient and Scalable Dataflow Accelerator Architecture for Stream Applications.",
            "Artificial Intelligence-based Computed Tomography Processing Framework for Surgical Telementoring of Congenital Heart Disease.",
            "A Survey on Silicon Photonics for Deep Learning.",
            "Hardware Trust and Assurance through Reverse Engineering: A Tutorial and Outlook from Image Analysis and Machine Learning Perspectives.",
            "Dynamic Reliability Management in Neuromorphic Computing."
        ]
    },
    {
        "name": "JETC",
        "year": "2020",
        "info": "Volume 16, 2020",
        "count": 44,
        "papers": [
            "Editorial.",
            "A Comparative Cross-layer Study on Racetrack Memories: Domain Wall vs Skyrmion.",
            "Higher Dimension Quantum Entanglement Generators.",
            "Predict, Share, and Recycle Your Way to Low-power Nanophotonic Networks.",
            "Evaluating the Potential Applications of Quaternary Logic for Approximate Computing.",
            "Leveraging Side-Channel Information for Disassembly and Security.",
            "Energy-efficient Design of MTJ-based Neural Networks with Stochastic Computing.",
            "A Resource-Efficient Embedded Iris Recognition System Using Fully Convolutional Networks.",
            "Language Support for Navigating Architecture Design in Closed Form.",
            "On-the-fly Page Migration and Address Reconciliation for Heterogeneous Memory Systems.",
            "Near Zero-Energy Computation Using Quantum-Dot Cellular Automata.",
            "A Memristor-Based Compressive Sampling Encoder with Dynamic Rate Control for Low-Power Video Streaming.",
            "A Classification of Memory-Centric Computing.",
            "Directed Placement for mVLSI Devices.",
            "Sparse BD-Net: A Multiplication-less DNN with Sparse Binarized Depth-wise Separable Convolution.",
            "CSMO-DSE: Fast and Precise Application-driven DSE Guided by Criticality and Sensitivity Analysis.",
            "Permutation Network De-obfuscation: A Delay-based Attack and Countermeasure Investigation.",
            "Approximate Memristive In-Memory Hamming Distance Circuit.",
            "Crossover-aware Placement and Routing for Inkjet Printed Circuits.",
            "3D-ReG: A 3D ReRAM-based Heterogeneous Architecture for Training Deep Neural Networks.",
            "Exploiting Data Resilience in Wireless Network-on-chip Architectures.",
            "QCOR: A Language Extension Specification for the Heterogeneous Quantum-Classical Model of Computation.",
            "Towards Synaptic Behavior of Nanoscale ReRAM Devices for Neuromorphic Computing Applications.",
            "Introduction to the Special Issue on New Trends in Nanoelectronic Device, Circuit, and Architecture Design, Part 1.",
            "Mitigate Parasitic Resistance in Resistive Crossbar-based Convolutional Neural Networks.",
            "Low Overhead Online Data Flow Tracking for Intermittently Powered Non-Volatile FPGAs.",
            "LosPem: A Novel Log-Structured Framework for Persistent Memory.",
            "Device-aware Circuit Design for Robust Memristive Neuromorphic Systems with STDP-based Learning.",
            "Write Back Energy Optimization for STT-MRAM-based Last-level Cache with Data Pattern Characterization.",
            "Projection of Dual-Rail DPA Countermeasures in Future FinFET and Emerging TFET Technologies.",
            "A Global Routing Method for Graphene Nanoribbons Based Circuits and Interconnects.",
            "Extracting Success from IBM's 20-Qubit Machines Using Error-Aware Compilation.",
            "On Providing OS Support to Allow Transparent Use of Traditional Programming Models for Persistent Memory.",
            "Design of Adiabatic Logic-Based Energy-Efficient and Reliable PUF for IoT Devices.",
            "Guest Editorial: ACM JETC Special Issue on New Trends in Nanolectronic Device, Circuit, and Architecture Design: Part 2.",
            "Hardware and Software Co-optimization for the Initialization Failure of the ReRAM-based Cross-bar Array.",
            "Hardware Security in Spin-based Computing-in-memory: Analysis, Exploits, and Mitigation Techniques.",
            "RNNFast: An Accelerator for Recurrent Neural Networks Using Domain-Wall Memory.",
            "ASIE: An Asynchronous SNN Inference Engine for AER Events Processing.",
            "Cryptography with Analog Scheme Using Memristors.",
            "Approximate Spintronic Memories.",
            "Making a Case for Partially Connected 3D NoC: NFIC versus TSV.",
            "The Big Hack Explained: Detection and Prevention of PCB Supply Chain Implants.",
            "Towards on-node Machine Learning for Ultra-low-power Sensors Using Asynchronous Σ Δ Streams."
        ]
    },
    {
        "name": "JETC",
        "year": "2019",
        "info": "Volume 15, 2019",
        "count": 39,
        "papers": [
            "Guest Editors' Introduction: Emerging Networks-on-Chip Designs, Technologies, and Applications.",
            "Design and Multi-Abstraction-Level Evaluation of a NoC Router for Mixed-Criticality Real-Time Systems.",
            "Time-Randomized Wormhole NoCs for Critical Applications.",
            "Limit of Hardware Solutions for Self-Protecting Fault-Tolerant NoCs.",
            "Fault-Tolerant Network-on-Chip Design with Flexible Spare Core Placement.",
            "Thermal-aware Test Scheduling Strategy for Network-on-Chip based Systems.",
            "PANE: Pluggable Asynchronous Network-on-Chip Simulator.",
            "BigBus: A Scalable Optical Interconnect.",
            "GARDENIA: A Graph Processing Benchmark Suite for Next-Generation Accelerators.",
            "Self-learnable Cluster-based Prefetching Method for DRAM-Flash Hybrid Main Memory Architecture.",
            "Split Manufacturing-Based Register Transfer-Level Obfuscation.",
            "Neural Network Classifiers Using a Hardware-Based Approximate Activation Function with a Hybrid Stochastic Multiplier.",
            "Long Short-Term Memory Network Design for Analog Computing.",
            "Guest Editors' Introduction to the Special Section on Hardware and Algorithms for Energy-Constrained On-chip Machine Learning.",
            "Trained Biased Number Representation for ReRAM-Based Neural Network Accelerators.",
            "In Situ Stochastic Training of MTJ Crossbars With Machine Learning Algorithms.",
            "Composable Probabilistic Inference Networks Using MRAM-based Stochastic Neurons.",
            "Low-Cost Stochastic Hybrid Multiplier for Quantized Neural Networks.",
            "A Mixed Signal Architecture for Convolutional Neural Networks.",
            "Hypercolumn Sparsification for Low-Power Convolutional Neural Networks.",
            "Hardware-Software Co-design to Accelerate Neural Network Applications.",
            "Spiking Neural Networks Hardware Implementations and Challenges: A Survey.",
            "Identification of Synthesis Approaches for IP/IC Piracy of Reversible Circuits.",
            "Neuromemrisitive Architecture of HTM with On-Device Learning and Neurogenesis.",
            "MiC: Multi-level Characterization and Optimization of GPGPU Kernels.",
            "Advanced Simulation of Droplet Microfluidics.",
            "Energy-efficient FPGA Spiking Neural Accelerators with Supervised and Unsupervised Spike-timing-dependent-Plasticity.",
            "SSS: Self-aware System-on-chip Using a Static-dynamic Hybrid Method.",
            "Placement and Routing for Tile-based Field-coupled Nanocomputing Circuits Is NP-complete (Research Note).",
            "LiwePMS: A Lightweight Persistent Memory with Wear-aware Memory Management.",
            "Guest Editors' Introduction: Hardware and Algorithms for Energy-Constrained On-Chip Machine Learning (Part 2).",
            "Hardware Optimizations of Dense Binary Hyperdimensional Computing: Rematerialization of Hypervectors, Binarized Bundling, and Combinational Associative Memory.",
            "Application and Thermal-reliability-aware Reinforcement Learning Based Multi-core Power Management.",
            "Comprehensive Analytic Performance Assessment and K-means based Multicast Routing Algorithm and Architecture for 3D-NoC of Spiking Neurons.",
            "MV-Net: Toward Real-Time Deep Learning on Mobile GPGPU Systems.",
            "Heterogeneous Scheduling of Deep Neural Networks for Low-power Real-time Designs.",
            "QuTiBench: Benchmarking Neural Networks on Heterogeneous Hardware.",
            "A High-performance Homogeneous Droplet Routing Technique for MEDA-based Biochips.",
            "Thread Batching for High-performance Energy-efficient GPU Memory Design."
        ]
    },
    {
        "name": "JETC",
        "year": "2018",
        "info": "Volume 14, 2018",
        "count": 48,
        "papers": [
            "An Accuracy Tunable Non-Boolean Co-Processor Using Coupled Nano-Oscillators.",
            "Design Considerations for Memristive Crossbar Physical Unclonable Functions.",
            "Statistical Optimization of FinFET Processor Architectures under PVT Variations Using Dual Device-Type Assignment.",
            "Heterogeneous HMC+DDRx Memory Management for Performance-Temperature Tradeoffs.",
            "Robust In-Field Testing of Digital Microfluidic Biochips.",
            "Improving AES Core Performance via an Advanced ASBUS Protocol.",
            "Resource-Constrained Scheduling for Digital Microfluidic Biochips.",
            "Impact of Process Variation on Self-Reference Sensing Scheme and Adaptive Current Modulation for Robust STTRAM Sensing.",
            "Improving Energy Efficiency in Wireless Network-on-Chip Architectures.",
            "Efficient LDPC Code Design for Combating Asymmetric Errors in STT-RAM.",
            "Online Adaptation and Energy Minimization for Hardware Recurrent Spiking Neural Networks.",
            "Scalable Path-Setup Scheme for All-Optical Dynamic Circuit Switched NoCs in Cache Coherent CMPs.",
            "A Quantum Computing Performance Simulator Based on Circuit Failure Probability and Fault Path Counting.",
            "Guest Editors' Introduction: Frontiers of Hardware and Algorithms for On-chip Learning.",
            "Deep Neural Network Optimized to Resistive Memory with Nonlinear Current-Voltage Characteristics.",
            "Energy-Efficient Neural Computing with Approximate Multipliers.",
            "Real-Time and Low-Power Streaming Source Separation Using Markov Random Field.",
            "A GPU-Outperforming FPGA Accelerator Architecture for Binary Convolutional Neural Networks.",
            "A Study of Complex Deep Learning Networks on High-Performance, Neuromorphic, and Quantum Computers.",
            "Silicon Photonics for Computing Systems.",
            "A Learning-Based Thermal-Sensitive Power Optimization Approach for Optical NoCs.",
            "A Process-Variation-Tolerant Method for Nanophotonic On-Chip Network.",
            "Reducing Power Consumption of Lasers in Photonic NoCs through Application-Specific Mapping.",
            "Offline Optimization of Wavelength Allocation and Laser Power in Nanophotonic Interconnects.",
            "SHARP: Shared Heterogeneous Architecture with Reconfigurable Photonic Network-on-Chip.",
            "An Integrated Nanophotonic Parallel Adder.",
            "Integrated High-Speed Optical SerDes over 100GBd Based on Optical Time Division Multiplexing.",
            "MFNW: An MLC/TLC Flip-N-Write Architecture.",
            "A Chip-Level Anti-Reverse Engineering Technique.",
            "Kogge-Stone Adder Realization using 1S1R Resistive Switching Crossbar Arrays.",
            "Framework for Quantifying and Managing Accuracy in Stochastic Circuit Design.",
            "Design Space Exploration of 3D Network-on-Chip: A Sensitivity-based Optimization Approach.",
            "Hardware Trojan Detection Using the Order of Path Delay.",
            "Reliability Hardening Mechanisms in Cyber-Physical Digital-Microfluidic Biochips.",
            "IMFlexCom: Energy Efficient In-Memory Flexible Computing Using Dual-Mode SOT-MRAM.",
            "T-count and Qubit Optimized Quantum Circuit Design of the Non-Restoring Square Root Algorithm.",
            "System-Level Analysis of 3D ICs with Thermal TSVs.",
            "Memristor-CMOS Analog Coprocessor for Acceleration of High-Performance Computing Applications.",
            "Guest Editor Introduction: Neuromorphic Computing.",
            "Sparse Hardware Embedding of Spiking Neuron Systems for Community Detection.",
            "Efficient Memristor-Based Architecture for Intrusion Detection and High-Speed Packet Classification.",
            "Power, Performance, and Area Benefit of Monolithic 3D ICs for On-Chip Deep Neural Networks Targeting Speech Recognition.",
            "Semi-Trained Memristive Crossbar Computing Engine with In Situ Learning Accelerator.",
            "STDP-based Unsupervised Feature Learning using Convolution-over-time in Spiking Neural Networks for Energy-Efficient Neuromorphic Computing.",
            "DFR: An Energy-efficient Analog Delay Feedback Reservoir Computing System for Brain-inspired Computing.",
            "An FPGA Implementation of a Time Delay Reservoir Using Stochastic Logic.",
            "A Multi-Level-Optimization Framework for FPGA-Based Cellular Neural Network Implementation.",
            "Efficient Hardware Implementation of Cellular Neural Networks with Incremental Quantization and Early Exit."
        ]
    },
    {
        "name": "JETC",
        "year": "2016",
        "info": "Volume 13, 2016/2017",
        "count": 61,
        "papers": [
            "Guest Editorial Special Issue on Secure and Trustworthy Computing.",
            "MRAM PUF: Using Geometric and Resistive Variations in MRAM Cells.",
            "Emerging Technology-Based Design of Primitives for Hardware Security.",
            "Spintronic PUFs for Security, Trust, and Authentication.",
            "STT-MRAM-Based PUF Architecture Exploiting Magnetic Tunnel Junction Fabrication-Induced Variability.",
            "A Survey on Chip to System Reverse Engineering.",
            "Frontside Versus Backside Laser Injection: A Comparative Study.",
            "A Fault-Based Secret Key Retrieval Method for ECDSA: Analysis and Countermeasure.",
            "Beat Frequency Detector-Based High-Speed True Random Number Generators: Statistical Modeling and Analysis.",
            "Real-Time Anomaly Detection Framework for Many-Core Router through Machine-Learning Techniques.",
            "Gates vs. Splitters: Contradictory Optimization Objectives in the Synthesis of Optical Circuits.",
            "Guest Editorial Special Issue on Nanoelectronic Circuit and System Design Methods for the Mobile Computing Era.",
            "A Simplified Phase Model for Simulation of Oscillator-Based Computing Systems.",
            "A Fine-Grain, Uniform, Energy-Efficient Delay Element for 2-Phase Bundled-Data Circuits.",
            "A Fault-Tolerant Ripple-Carry Adder with Controllable-Polarity Transistors.",
            "Non-Volatile Processor Based on MRAM for Ultra-Low-Power IoT Devices.",
            "Yield, Area, and Energy Optimization in STT-MRAMs Using Failure-Aware ECC.",
            "Optimized Standard Cells for All-Spin Logic.",
            "System-Level Design to Detect Fault Injection Attacks on Embedded Real-Time Applications.",
            "Asymmetric Underlapped FinFETs for Near- and Super-Threshold Logic at Sub-10nm Technology Nodes.",
            "Electro-Photonic NoC Designs for Kilocore Systems.",
            "Ultra-low-leakage, Robust FinFET SRAM Design Using Multiparameter Asymmetric FinFETs.",
            "Shielding STT-RAM Based Register Files on GPUs against Read Disturbance.",
            "Source Authentication Techniques for Network-on-Chip Router Configuration Packets.",
            "A Survey of Techniques for Architecting Processor Components Using Domain-Wall Memory.",
            "Exploiting Idle Hardware to Provide Low Overhead Fault Tolerance for VLIW Processors.",
            "Monolayer Transistor SRAMs: Toward Low-Power, Denser Memory Systems.",
            "Alleviate Chip Pin Constraint for Multicore Processor by On/Off-Chip Power Delivery System Codesign.",
            "One-Step Sneak-Path Free Read Scheme for Resistive Crossbar Memory.",
            "Guest Editors' Introduction: Hardware and Algorithms for On-Chip Learning.",
            "SPARCNet: A Hardware Accelerator for Efficient Deployment of Sparse Convolutional Networks.",
            "Structured Pruning of Deep Convolutional Neural Networks.",
            "Energy-Efficient and Improved Image Recognition with Conditional Deep Learning.",
            "Memory-Centric Reconfigurable Accelerator for Classification and Machine Learning Applications.",
            "VLSI Architectures for the Restricted Boltzmann Machine.",
            "Distributed In-Memory Computing on Binary RRAM Crossbar.",
            "Stochastic CBRAM-Based Neuromorphic Time Series Prediction System.",
            "Editorial for JETC Special Issue on Alternative Computing Systems.",
            "High-Performance Computing with Quantum Processing Units.",
            "Mobile Unified Memory-Storage Structure Based on Hybrid Non-Volatile Memories.",
            "Real-Time SoC Security against Passive Threats Using Crypsis Behavior of Geckos.",
            "Computing Polynomials Using Unipolar Stochastic Logic.",
            "PPU: A Control Error-Tolerant Processor for Streaming Applications with Formal Guarantees.",
            "Design of Approximate Compressors for Multiplication.",
            "Toward Human-Scale Brain Computing Using 3D Wafer Scale Integration.",
            "Sketching Computation with Stochastic Processing Engines.",
            "Trading Accuracy for Energy in Stochastic Circuit Design.",
            "Survey of STT-MRAM Cell Design Strategies: Taxonomy and Sense Amplifier Tradeoffs for Resiliency.",
            "Redesign the Memory Allocator for Non-Volatile Main Memory.",
            "Power-Utility-Driven Write Management for MLC PCM.",
            "Automated Quantum Circuit Synthesis and Cost Estimation for the Binary Welded Tree Oracle.",
            "Design and Analysis of STTRAM-Based Ternary Content Addressable Memory Cell.",
            "Optical Overlay NUCA: A High-Speed Substrate for Shared L2 Caches.",
            "Impact of Electrostatic Coupling and Wafer-Bonding Defects on Delay Testing of Monolithic 3D Integrated Circuits.",
            "Quantum Circuit Synthesis Targeting to Improve One-Way Quantum Computation Pattern Cost Metrics.",
            "Coupled Spin-Torque Nano-Oscillator-Based Computation: A Simulation Study.",
            "A Reconfigurable Architecture with Sequential Logic-Based Stochastic Computing.",
            "SWIFTNoC: A Reconfigurable Silicon-Photonic Network with Multicast-Enabled Channel Sharing for Multicore Architectures.",
            "Improving Performance under Process and Voltage Variations in Near-Threshold Computing Using 3D ICs.",
            "A Review, Classification, and Comparative Evaluation of Approximate Arithmetic Circuits.",
            "Energy-Efficiency Comparison of Multi-Layer Deposited Nanophotonic Crossbar Interconnects."
        ]
    },
    {
        "name": "JETC",
        "year": "2015",
        "info": "Volume 12, 2015",
        "count": 46,
        "papers": [
            "mNoC: Large Nanophotonic Network-on-Chip Crossbars with Molecular Scale Devices.",
            "Multilayer Graphene Nanoribbon and Carbon Nanotube Based Floating Gate Transistor for Nonvolatile Flash Memory.",
            "A Low-Power Variation-Aware Adaptive Write Scheme for Access-Transistor-Free Memristive Memory.",
            "Energy-Efficient All-Spin Cache Hierarchy Using Shift-Based Writes and Multilevel Storage.",
            "MN-MATE: Elastic Resource Management of Manycores and a Hybrid Memory Hierarchy for a Cloud Node.",
            "A Write-Aware STTRAM-Based Register File Architecture for GPGPU.",
            "A Sub-μ A Stand-By Current Synchronous Electric Charge Extractor for Piezoelectric Energy Harvesting.",
            "QuickRecall: A HW/SW Approach for Computing across Power Cycles in Transiently Powered Computers.",
            "Fault-Tolerant Operations for Universal Blind Quantum Computation.",
            "SCKVdd: A Scalable Clock-Controlled Self-Stabilized Voltage Technique for Low Power CMOS Digital Circuits.",
            "Guest Editorial: Special Issue on Advances in Design of Ultra-Low Power Circuits and Systems in Emerging Technologies.",
            "A Survey on Low-Power Techniques with Emerging Technologies: From Devices to Systems.",
            "FinFET-Based Low-Swing Clocking.",
            "Dynamic Cache Pooling in 3D Multicore Processors.",
            "Low-Power Heterogeneous Graphene Nanoribbon-CMOS Multistate Volatile Memory Circuit.",
            "Spintronics: Emerging Ultra-Low-Power Circuits and Systems beyond MOS Technology.",
            "Programmable Spike-Timing-Dependent Plasticity Learning Circuits in Neuromorphic VLSI Architectures.",
            "Process Variability and Electrostatic Analysis of Molecular QCA.",
            "Energy-Neutral Design Framework for Supercapacitor-Based Autonomous Wireless Sensor Networks.",
            "Introduction to: Special Issue on Cross-Layer System Design.",
            "Application-Specific Cross-Layer Optimization Based on Predictive Variable-Latency VLSI Design.",
            "ProWATCh: A Proactive Cross-Layer Workload-Aware Temperature Management Framework for Low-Power Chip Multi-Processors.",
            "Spike-Time-Dependent Encoding for Neuromorphic Processors.",
            "A Cross-Layer Approach to Measure the Robustness of Integrated Circuits.",
            "A Cross-Layer Approach for Early-Stage Power Grid Design and Optimization.",
            "REDELF: An Energy-Efficient Deadlock-Free Routing for 3D NoCs with Partial Vertical Connections.",
            "Modeling DVFS and Power-Gating Actuators for Cycle-Accurate NoC-Based Simulators.",
            "gem5-PVT: A Framework for FinFET System Simulation under PVT Variations.",
            "An MINLP Model for Scheduling and Placement of Quantum Circuits with a Heuristic Solution Approach.",
            "Nanowire Volatile RAM as an Alternative to SRAM.",
            "Fully Exploiting PCM Write Capacity Within Near Zero Cost Through Segment-Based Page Allocation.",
            "Reducing System Power Consumption Using Check-Pointing on Nonvolatile Embedded Magnetic Random Access Memories.",
            "Rethinking Computer Architectures and Software Systems for Phase-Change Memory.",
            "Reversible Synthesis of Symmetric Functions with a Simple Regular Structure and Easy Testability.",
            "Neuromorphic Processors with Memristive Synapses: Synaptic Interface and Architectural Exploration.",
            "Impact of Fin Width Scaling on RF/Analog Performance of Junctionless Accumulation-Mode Bulk FinFET.",
            "Area Minimization Synthesis for Reconfigurable Single-Electron Transistor Arrays with Fabrication Constraints.",
            "Comparative Area and Parasitics Analysis in FinFET and Heterojunction Vertical TFET Standard Cells.",
            "Designing a Million-Qubit Quantum Computer Using a Resource Performance Simulator.",
            "Quantum-Logic Synthesis of Hermitian Gates.",
            "Embedding of Large Boolean Functions for Reversible Logic.",
            "Delay/Power Modeling and Optimization of FinFET Circuit Modules under PVT Variations: Observing the Trends between the 22nm and 14nm Technology Nodes.",
            "Ultra-Low-Leakage and High-Performance Logic Circuit Design Using Multiparameter Asymmetric FinFETs.",
            "PROTON+: A Placement and Routing Tool for 3D Optical Networks-on-Chip with a Single Optical Layer.",
            "A Novel Approach to Optimize Fault-Tolerant Hybrid Wireless Network-on-Chip Architectures.",
            "A Survey of Architectural Techniques for Near-Threshold Computing."
        ]
    },
    {
        "name": "JETC",
        "year": "2014",
        "info": "Volume 11, 2014/2015",
        "count": 43,
        "papers": [
            "Placement optimization of flexible TFT circuits with mechanical strain and temperature consideration.",
            "Theory and analysis of generalized mixing and dilution of biochemical fluids using digital microfluidic biochips.",
            "Ultra-low-leakage chip multiprocessor design with hybrid FinFET logic styles.",
            "NBTI tolerance and leakage reduction using gate sizing.",
            "Testable cross-power domain interface (CPDI) circuit design in monolithic 3D technology.",
            "Probabilistic modeling and analysis of molecular memory.",
            "QLib: Quantum module library.",
            "Introduction to the Special Issue on Reversible Computation.",
            "Matrix Calculus for Classical and Quantum Circuits.",
            "Quantifying Irreversible Information Loss in Digital Circuits.",
            "Designing Garbage-Free Reversible Implementations of the Integer Cosine Transform.",
            "Garbage-Free Reversible Multipliers for Arbitrary Constants.",
            "A Resource-Efficient Design for a Reversible Floating Point Adder in Quantum Computing.",
            "Cofactor Sharing for Reversible Logic Synthesis.",
            "An Improved Reversible Circuit Synthesis Approach using Clustering of ESOP Cubes.",
            "Novel Through-Silicon-Via Inductor-Based On-Chip DC-DC Converter Designs in 3D ICs.",
            "Performance Evaluation of Congestion-Aware Routing with DVFS on a Millimeter-Wave Small-World Wireless NoC.",
            "Scalable Offline Searches in DNA Sequences.",
            "Accurate Leakage/Delay Estimation for FinFET Standard Cells under PVT Variations using the Response Surface Methodology.",
            "Introduction to the Special Issue on Computational Synthetic Biology.",
            "Parallel Networks: Synthetic Biology and Artificial Intelligence.",
            "Composable Modular Models for Synthetic Biology.",
            "Stochastic Model Checking of Genetic Circuits.",
            "Formalizing Modularization and Data Hiding in Synthetic Biology.",
            "A Rule-Based Design Specification Language for Synthetic Biology.",
            "Fluigi: Microfluidic Device Synthesis for Synthetic Biology.",
            "RIMEP2: Evolutionary Design of Reversible Digital Circuits.",
            "Decomposition of Diagonal Hermitian Quantum Gates Using Multiple-Controlled Pauli Z Gates.",
            "A Synthesis Algorithm for 4-Bit Reversible Logic Circuits with Minimum Quantum Cost.",
            "Realizing Reversible Computing in QCA Framework Resulting in Efficient Design of Testable ALU.",
            "An Algorithm for Quantum Template Matching.",
            "Introduction to Special Issue on Neuromorphic Computing.",
            "Toward a Sparse Self-Organizing Map for Neuromorphic Architectures.",
            "On-Chip Universal Supervised Learning Methods for Neuro-Inspired Block of Memristive Nanodevices.",
            "Fully Binary Neural Network Model and Optimized Hardware Architectures for Associative Memories.",
            "Large-Scale Spiking Neural Networks using Neuromorphic Hardware Compatible Models.",
            "Randomly Spiking Dynamic Neural Fields.",
            "A Reconfigurable Digital Neuromorphic Processor with Memristive Synaptic Crossbar for Cognitive Computing.",
            "Special Issue on Emerging Many-Core Systems for Exascale Computing.",
            "Architecture and Implementation of Dynamic Parallelism, Voltage and Frequency Scaling (PVFS) on CGRAs.",
            "Improving Performance in Sub-Block Caches with Optimized Replacement Policies.",
            "iConn: A Communication Infrastructure for Heterogeneous Computing Architectures.",
            "Analytical Reliability Analysis of 3D NoC under TSV Failure."
        ]
    },
    {
        "name": "JETC",
        "year": "2014",
        "info": "Volume 10, 2014",
        "count": 33,
        "papers": [
            "Introduction to special issue on reliability and device degradation in emerging technologies.",
            "Recovery modeling of negative bias temperature instability (NBTI) for SPICE-compatible circuit aging simulators.",
            "Reliability improvement of logic and clock paths in power-efficient designs.",
            "Workload assignment considering NBTI degradation in multicore systems.",
            "Robust learning approach for neuro-inspired nanoscale crossbar architecture.",
            "Nanoarray architectures multilevel simulation.",
            "Introduction to special issue on WoSAR 2011.",
            "A survey of software aging and rejuvenation studies.",
            "Software rejuvenation scheduling using accelerated life testing.",
            "Job completion time on a virtualized server with software rejuvenation.",
            "Software aging in the eucalyptus cloud computing infrastructure: Characterization and rejuvenation.",
            "Critical-reliability path identification and delay analysis.",
            "Delay-based processing-in-wire for design of QCA serial decimal arithmetic units.",
            "RMDDS: Reed-muller decision diagram synthesis of reversible logic circuits.",
            "On-chip sensor networks for soft-error tolerant real-time multiprocessor systems-on-chip.",
            "Inexact computing using probabilistic circuits: Ultra low-power digital processing.",
            "Nanopipelined threshold network synthesis.",
            "A thermal-driven test application scheme for pre-bond and post-bond scan testing of three-dimensional ICs.",
            "Impact of Process Variations on Speedup and Maximum Achievable Frequency of Extensible Processors.",
            "Design and Evaluation of Technology-Agnostic Heterogeneous Networks-on-Chip.",
            "Improved Threshold Logic Synthesis Using Implicant-Implicit Algorithms.",
            "Clock-Tree Synthesis with Methodology of Reuse in 3D-IC.",
            "On-Chip Hybrid Power Supply System for Wireless Sensor Nodes.",
            "Interpreting Assays with Control Flow on Digital Microfluidic Biochips.",
            "A Fast Extraction Algorithm for Defect-Free Subcrossbar in Nanoelectronic Crossbar.",
            "3D vs. 2D Device Simulation of FinFET Logic Gates under PVT Variations.",
            "Dual-Level DVFS-Enabled Millimeter-Wave Wireless NoC Architectures.",
            "CDMA Enabled Wireless Network-on-Chip.",
            "SUOR: Sectioned Undirectional Optical Ring for Chip Multiprocessor.",
            "Design Options for Optical Ring Interconnect in Future Client Devices.",
            "Exploring Dynamic Redundancy to Resuscitate Faulty PCM Blocks.",
            "Effect of the Active Layer on Carbon Nanotube-Based Cells for Yield Analysis.",
            "System Level Benchmarking with Yield-Enhanced Standard Cell Library for Carbon Nanotube VLSI Circuits."
        ]
    },
    {
        "name": "JETC",
        "year": "2013",
        "info": "Volume 9, 2013",
        "count": 30,
        "papers": [
            "A Novel Algorithm for Fast Synthesis of DNA Probes on Microarrays.",
            "Module-Based Synthesis of Digital Microfluidic Biochips with Droplet-Aware Operation Execution.",
            "Brownian Circuits: Fundamentals.",
            "Design and Analysis of a Robust Carbon Nanotube-Based Asynchronous Primitive Circuit.",
            "A Synthesis Algorithm for Reconfigurable Single-Electron Transistor Arrays.",
            "Thermal Characterization of Test Techniques for FinFET and 3D Integrated Circuits.",
            "Hybrid Redundancy for Defect Tolerance in Molecular Crossbar Memory.",
            "Variability in Nanoscale Fabrics: Bottom-up Integrated Analysis and Mitigation.",
            "Effect of Wordline/Bitline Scaling on the Performance, Energy Consumption, and Reliability of Cross-Point Memory Array.",
            "Introduction to the special issue on memory technologies.",
            "Memristive devices in computing system: Promises and challenges.",
            "Nanoscale electronic synapses using phase change devices.",
            "Spin-transfer torque magnetic random access memory (STT-MRAM).",
            "Dual pillar spin-transfer torque MRAMs for low power applications.",
            "Electrothermal analysis of spin-transfer-torque random access memory arrays.",
            "On-chip caches built on multilevel spin-transfer torque RAM cells and its optimizations.",
            "Design of efficient reversible logic-based binary and BCD adder circuits.",
            "Color image processing with multi-peak resonant tunneling diodes.",
            "Cell transformations and physical design techniques for 3D monolithic integrated circuits.",
            "Design space exploration of FinFET cache.",
            "ILP formulations for variation/defect-tolerant logic mapping on crossbar nano-architectures.",
            "Exploring the vulnerability of CMPs to soft errors with 3D stacked nonvolatile memory.",
            "NBTI-aware circuit node criticality computation.",
            "Complex network-enabled robust wireless network-on-chip architectures.",
            "Detection of trojans using a combined ring oscillator network and off-chip transient power analysis.",
            "Introduction to Special Issue on Bioinformatics.",
            "Extended and Robust Protein Sequence Annotation over Conservative Nonhierarchical Clusters: The Case Study of the ABC Transporters.",
            "Integration of Literature with Heterogeneous Information for Genes Correlation Scoring.",
            "A Hardware Viewpoint on Biosequence Analysis: What's Next?",
            "Synthetic Biology and Microdevices: A Powerful Combination."
        ]
    },
    {
        "name": "JETC",
        "year": "2012",
        "info": "Volume 8, 2012",
        "count": 34,
        "papers": [
            "A Reconfigurable PLA Architecture for Nanomagnet Logic.",
            "From Transistors to NEMS: Highly Efficient Power-Gating of CMOS Circuits.",
            "Modeling and Designing for Accuracy and Energy Efficiency in Wireless Electroencephalography Systems.",
            "Skew Dependence of Nanophotonic Devices Based on Optical Near-Field Interactions.",
            "A Torus-Based Hierarchical Optical-Electronic Network-on-Chip for Multiprocessor System-on-Chip.",
            "Design Considerations for Multilevel CMOS/Nano Memristive Memory.",
            "Introduction to Special Issue on Implantable Electronics.",
            "Early History and Challenges of Implantable Electronics.",
            "Implantable Closed-Loop Epilepsy Prosthesis: Modeling, Implementation and Validation.",
            "Low-Power Architecture for Epileptic Seizure Detection Based on Reduced Complexity DWT.",
            "Wireless, Ultra-Low-Power Implantable Sensor for Chronic Bladder Pressure Monitoring.",
            "An Implantable Release-on-Demand CMOS Drug Delivery SoC Using Electrothermal Activation Technique.",
            "Nonvolatile Memories as the Data Storage System for Implantable ECG Recorder.",
            "Special section on new circuit and architecture-level solutions for multidiscipline systems.",
            "CMOS LC voltage controlled oscillator design using multiwalled and single-walled carbon nanotube wire inductors.",
            "Dynamic clock stretching for variation compensation in VLSI circuit design.",
            "Congestion-aware layout design for high-throughput digital microfluidic biochips.",
            "Retail beamed power using millimeter waves: Survey.",
            "An efficient heuristic to identify threshold logic functions.",
            "Effect of process variations in 3D global clock distribution networks.",
            "Spatial and temporal thermal characterization of stacked multicore architectures.",
            "Resilient and adaptive performance logic.",
            "Performance evaluation and design trade-offs for wireless network-on-chip architectures.",
            "A Θ( √ n)-depth quantum adder on the 2D NTC quantum computer architecture.",
            "A physical design tool for carbon nanotube field-effect transistor circuits.",
            "Introduction to the special issue on sustainable and green computing systems.",
            "Towards a net-zero data center.",
            "Technology-driven limits on runtime power management algorithms for multiprocessor systems-on-chip.",
            "Energy-efficient markov chain-based duty cycling schemes for greener wireless sensor networks.",
            "Implementing the data center energy productivity metric.",
            "Barely alive memory servers: Keeping data active in a low-power state.",
            "Energy- and performance-aware scheduling of tasks on parallel and distributed systems.",
            "Enhancing data center sustainability through energy-adaptive computing.",
            "DAHM: A green and dynamic web application hosting manager across geographically distributed data centers."
        ]
    },
    {
        "name": "JETC",
        "year": "2011",
        "info": "Volume 7, 2011",
        "count": 20,
        "papers": [
            "Introduction to Special Issue: Highlights of NANOARCH'09.",
            "Performance and Energy Impact of Locally Controlled NML Circuits.",
            "Matrix Nanodevice-Based Logic Architectures and Associated Functional Mapping Method.",
            "Redundant Residue Number System Code for Fault-Tolerant Hybrid Memories.",
            "Introduction to nanophotonic communication technology integration.",
            "Large-scale integrated photonics for high-performance interconnects.",
            "Photonic network-on-chip architectures using multilayer deposited silicon materials for high-performance chip multiprocessors.",
            "Iris: A hybrid nanophotonic network design for high-performance and low-power on-chip communication.",
            "A low-latency, high-throughput on-chip optical router architecture for future chip multiprocessors.",
            "FinFET-Based Power Management for Improved DPA Resistance with Low Overhead.",
            "On the Effect of Quantum Interaction Distance on Quantum Addition Circuits.",
            "Defect-Aware Nanocrossbar Logic Mapping through Matrix Canonization Using Two-Dimensional Radix Sort.",
            "p-QCA: A Tiled Programmable Fabric Architecture Using Molecular Quantum-Dot Cellular Automata.",
            "Introduction to Special Issue: Asynchrony in System Design.",
            "Asynchronous Solutions for Nanomagnetic Logic Circuits.",
            "A Novel Power Delivery Method for Asynchronous Loads in Energy Harvesting Systems.",
            "SpiNNaker: Design and Implementation of a GALS Multicore System-on-Chip.",
            "Microarchitectural Transformations Using Elasticity.",
            "Energy-Efficient Pipeline Templates for High-Performance Asynchronous Circuits.",
            "Relativistic Causality and Clockless Circuits."
        ]
    },
    {
        "name": "JETC",
        "year": "2010",
        "info": "Volume 6, 2010",
        "count": 14,
        "papers": [
            "Editorial.",
            "FinFET-based power simulator for interconnection networks.",
            "Routing in self-organizing nano-scale irregular networks.",
            "Introduction to design techniques for energy harvesting.",
            "Scaling self-timed systems powered by mechanical vibration energy harvesting.",
            "Design considerations of sub-mW indoor light energy harvesting for wireless sensor systems.",
            "An energy management framework for energy harvesting embedded systems.",
            "ULS: A dual-Vth/high-kappa nano-CMOS universal level shifter for system-level power management.",
            "An information-theoretic analysis of quantum-dot cellular automata for defect tolerance.",
            "Low-power 3D nano/CMOS hybrid dynamically reconfigurable architecture.",
            "Integrated control-path design and error recovery in the synthesis of digital microfluidic lab-on-chip.",
            "Gated-diode FinFET DRAMs: Device and circuit design-considerations.",
            "Reversible circuit synthesis using a cycle-based approach.",
            "Design of reversible sequential circuits optimizing quantum cost, delay, and garbage outputs."
        ]
    },
    {
        "name": "JETC",
        "year": "2009",
        "info": "Volume 5, 2009",
        "count": 19,
        "papers": [
            "Guest editorial: IEEE/ACM symposium on nanoscale architectures (NANOARCH07).",
            "Towards achieving reliable and high-performance nanocomputing via dynamic redundancy allocation.",
            "Emerging nanodevice paradigm: Graphene-based electronics for nanoscale computing.",
            "A shift-register-based QCA memory architecture.",
            "A simulator for ballistic nanostructures in a 2-D electron gas.",
            "Introduction to special section: Best of NANOARCH 2008.",
            "Low-power FinFET circuit synthesis using multiple supply and threshold voltages.",
            "Defects and faults in QCA-based PLAs.",
            "Scan-chain design and optimization for three-dimensional integrated circuits.",
            "Efficient parallel testing and diagnosis of digital microfluidic biochips.",
            "Low-overhead defect tolerance in crossbar nanoarchitectures.",
            "A study of asynchronous design methodology for robust CMOS-nano hybrid system design.",
            "A hybrid Nano/CMOS dynamically reconfigurable system - Part II: Design optimization flow.",
            "A hybrid nano-CMOS architecture for defect and fault tolerance.",
            "Utilizing quantum dot transistors with programmable threshold voltages for low-power mobile computing.",
            "A hybrid nano/CMOS dynamically reconfigurable system - Part I: Architecture.",
            "Design space exploration and data memory architecture design for a hybrid nano/CMOS dynamically reconfigurable architecture.",
            "A defect/error-tolerant nanosystem architecture for DSP.",
            "Organizing wires for reliability in magnetic QCA."
        ]
    },
    {
        "name": "JETC",
        "year": "2008",
        "info": "Volume 4, 2008",
        "count": 20,
        "papers": [
            "High-level interconnect model for the quantum logic array architecture.",
            "Reversible logic synthesis with Fredkin and Peres gates.",
            "High parallelism, portability, and broad accessibility: Technologies for genomics.",
            "Editorial.",
            "Introduction to joint ACM JETC/TODAES special issue on new, emerging, and specialized technologies.",
            "A meshless, spectrally accurate, integral equation solver for molecular surface electrostatics.",
            "Carbon nanotube transistor compact model for circuit design and performance optimization.",
            "Formal methods for the analysis and synthesis of nanometer-scale cellular arrays.",
            "Molecular QCA design with chemically reasonable constraints.",
            "Introduction to DAC 2007 special section.",
            "Integrated droplet routing and defect tolerance in the synthesis of digital microfluidic biochips.",
            "Reliability analysis for flexible electronics: Case study of integrated a-Si: H TFT scan driver.",
            "An alternate design paradigm for low-power, low-cost, testable hybrid systems using scaled LTPS TFTs.",
            "SCT: A novel approach for testing and configuring nanoscale devices.",
            "Editorial: Special issue on 3D integrated circuits and microarchitectures.",
            "PicoServer: Using 3D stacking technology to build energy efficient servers.",
            "Investigating the effects of fine-grain three-dimensional integration on microarchitecture design.",
            "Automated module assignment in stacked-Vdd designs for high-efficiency power delivery.",
            "Parametric yield management for 3D ICs: Models and strategies for improvement.",
            "Multilayer stacking technology using wafer-to-wafer stacked method."
        ]
    },
    {
        "name": "JETC",
        "year": "2007",
        "info": "Volume 3, 2007/2008",
        "count": 19,
        "papers": [
            "Predictive technology model for nano-CMOS design exploration.",
            "Simulation of random cell displacements in QCA.",
            "Designing CMOS/molecular memories while considering device parameter variations.",
            "Editorial to special issue on reliable computing.",
            "The spin-wave nanoscale reconfigurable mesh and the labeling problem.",
            "Design for dependability in emerging technologies.",
            "Evolving dependability.",
            "Evolutionary functional recovery in virtual reconfigurable circuits.",
            "Self-replicating hardware for reliability: The embryonics project.",
            "A self-organizing defect tolerant SIMD architecture.",
            "Editorial to special issue DAC 2006.",
            "Prospect of ballistic CNFET in high performance applications: Modeling and analysis.",
            "Placement of defect-tolerant digital microfluidic biochips using the T-tree formulation.",
            "Automated design of pin-constrained digital microfluidic biochips under droplet-interference constraints.",
            "Evaluating area and performance of hybrid FPGAs with nanoscale clusters and CMOS routing.",
            "High-level synthesis of digital microfluidic biochips.",
            "Arithmetic on a distributed-memory quantum multicomputer.",
            "A model for computing and energy dissipation of molecular QCA devices and circuits.",
            "Synthesis of reversible sequential elements."
        ]
    },
    {
        "name": "JETC",
        "year": "2006",
        "info": "Volume 2, 2006",
        "count": 11,
        "papers": [
            "NANA: A nano-scale active network architecture.",
            "Architectural implications of quantum computing technologies.",
            "Design space exploration for 3D architectures.",
            "Yield enhancement of reconfigurable microfluidics-based biochips using interstitial redundancy.",
            "Radial addressing of nanowires.",
            "Modeling and design challenges and solutions for carbon nanotube-based interconnect in future high performance integrated circuits.",
            "Application-independent defect tolerance of reconfigurable nanoarchitectures.",
            "Automated design flow for diode-based nanofabrics.",
            "HDLQ: A HDL environment for QCA design.",
            "Multiple fault diagnosis in digital microfluidic biochips.",
            "Data structures and algorithms for simplifying reversible circuits."
        ]
    },
    {
        "name": "JETC",
        "year": "2005",
        "info": "Volume 1, 2005",
        "count": 7,
        "papers": [
            "Editorial.",
            "Challenges and design choices in nanoscale CMOS.",
            "Partitioning and placement for buildable QCA circuits.",
            "Evaluation of design strategies for stochastically assembled nanoarray memories.",
            "Nanowire-based programmable architectures.",
            "Tile-based QCA design using majority-like logic primitives.",
            "Design automation for microfluidics-based biochips."
        ]
    }
]