[
    {
        "name": "JSA",
        "year": "2022",
        "info": "2022: Volumes\n122,\n123,\n124,",
        "count": 49,
        "papers": [
            "HEA-PAS: A hybrid energy allocation strategy for parallel applications scheduling on heterogeneous computing systems.",
            "SSD internal cache management policies: A survey.",
            "DNN pruning with principal component analysis and connection importance estimation.",
            "Efficient hybrid polling for ultra-low latency storage devices.",
            "Priority assignment in hierarchically scheduled time-partitioned distributed real-time systems with multipath flows.",
            "Tightening the CRPD bound for multilevel non-inclusive caches.",
            "Teegraph: A Blockchain consensus algorithm based on TEE and DAG for data sharing in IoT.",
            "Bus-contention aware WCRT analysis for the 3-phase task model considering a work-conserving bus arbitration scheme.",
            "Hardware and software co-verification from security perspective in SoC platforms.",
            "A faster outsourced medical image retrieval scheme with privacy preservation.",
            "Multi-processor scheduling of elastic applications in compositional real-time systems.",
            "FastHand: Fast monocular hand pose estimation on embedded systems.",
            "Resource provisioning in edge/fog computing: A Comprehensive and Systematic Review.",
            "Autoware_Perf: A tracing and performance analysis framework for ROS 2 applications.",
            "Complex event models for automotive embedded systems.",
            "Response time analysis of memory-bandwidth-regulated multiframe mixed-criticality systems.",
            "MACFI: A multi-authority access control scheme with efficient ciphertext and secret key size for fog-enhanced IoT.",
            "Process variation aware DRAM-Cache resizing.",
            "Efficient stereo matching on embedded GPUs with zero-means cross correlation.",
            "PSpSys: A time-predictable mixed-criticality system architecture based on ARM TrustZone.",
            "BUAKA-CS: Blockchain-enabled user authentication and key agreement scheme for crowdsourcing system.",
            "A cross-platform OpenVX library for FPGA accelerators.",
            "Special issue on Reliable Software Technologies (AEiC2021).",
            "Optimizing the EDP of OpenMP applications via concurrency throttling and frequency boosting.",
            "Efficient Reservation-based Fault-Tolerant Scheduling for IEEE 802.1Qbv Time-Sensitive Networking.",
            "ID-CEPPA: Identity-based Computationally Efficient Privacy-Preserving Authentication scheme for vehicle-to-vehicle communications.",
            "TS-ABOS-CMS: time-bounded secure attribute-based online/offline signature with constant message size for IoT systems.",
            "Graph reductions and partitioning heuristics for multicore DAG scheduling.",
            "Improved analysis and optimal priority assignment for communicating threads on uni-processor.",
            "Schedulability analysis and stack size minimization for adaptive mixed criticality scheduling with semi-Clairvoyance and preemption thresholds.",
            "Computing exact WCRT for typed DAG tasks on heterogeneous multi-core processors.",
            "Pairing-free certificateless authenticated encryption with keyword search.",
            "Fine-grained parallelism framework with predictable work-stealing for real-time multiprocessor systems.",
            "Efficient and accurate identification of missing tags for large-scale dynamic RFID systems.",
            "A survey on Attribute-Based Signatures.",
            "Lightweight asynchronous scheduling in heterogeneous reconfigurable systems.",
            "Adaptive weight-bit inversion for state error reduction for robust and efficient deep neural network inference using MLC NAND Flash.",
            "Key lengths revisited: GPU-based brute force cryptanalysis of DES, 3DES, and PRESENT.",
            "Structured precision skipping: Accelerating convolutional neural networks with budget-aware dynamic precision selection.",
            "Low-latency service function chain migration in edge-core networks based on open Jackson networks.",
            "A federated deep learning framework for privacy preservation and communication efficiency.",
            "Optimized partitioning and priority assignment of real-time applications on heterogeneous platforms with hardware acceleration.",
            "Blockchain-assisted searchable attribute-based encryption for e-health systems.",
            "Hybrid differential privacy based federated learning for Internet of Things.",
            "Hardware-aware liquid state machine generation for 2D/3D Network-on-Chip platforms.",
            "Optimizing deep neural networks on intelligent edge accelerators via flexible-rate filter pruning.",
            "CBFF: A cloud-blockchain fusion framework ensuring data accountability for multi-cloud environments.",
            "Guest editorial: Special issue on the 2020 IEEE symposium on real-time distributed computing (ISORC).",
            "Special issue on Reliable Software Technologies (AEiC2021)."
        ]
    },
    {
        "name": "JSA",
        "year": "2021",
        "info": "2021: Volumes\n112,\n113,\n114,\n115,\n116,\n117,\n118,\n119,\n120,\n121",
        "count": 214,
        "papers": [
            "Domain-specific scenarios for refinement-based methods.",
            "Cost and makespan scheduling of workflows in clouds using list multiobjective optimization technique.",
            "How to secure autonomous mobile robots? An approach with fuzzing, detection and mitigation.",
            "A survey On hardware accelerators and optimization techniques for RNNs.",
            "Jellyfish dynamic routing protocol with mobile sink for location privacy and congestion avoidance in wireless sensor networks.",
            "Performance optimization for parallel systems with shared DWM via retiming, loop scheduling, and data placement.",
            "Towards channel state information based coding to enhance security in satellite communication.",
            "TARTS: A Temperature-Aware Real-Time Deadline-Partitioned Fair Scheduler.",
            "Task migration optimization for guaranteeing delay deadline with mobility consideration in mobile edge computing.",
            "Formal analysis of the continuous dynamics of cyber-physical systems using theorem proving.",
            "Comments on an identity-based signature scheme for VANETs.",
            "A Blockchain-based access control scheme with multiple attribute authorities for secure cloud data sharing.",
            "Generalized and Scalable Offset-Based Response Time Analysis of Fixed Priority Systems.",
            "Identity authentication based on trajectory characteristics of mobile devices.",
            "A survey of techniques for intermittent computing.",
            "A survey on machine learning-based malware detection in executable files.",
            "Federated scheduling for Typed DAG tasks scheduling analysis on heterogeneous multi-cores.",
            "A comprehensive test framework for cryptographic accelerators in the cloud.",
            "Palisade: A framework for anomaly detection in embedded systems.",
            "Blockchain-based batch authentication protocol for Internet of Vehicles.",
            "A genetic algorithm based energy efficient group paging approach for IoT over 5G.",
            "Video action recognition with visual privacy protection based on compressed sensing.",
            "A survey on security and authentication in wireless body area networks.",
            "An efficient signcryption of heterogeneous systems for Internet of Vehicles.",
            "Efficient Cache Resizing policy for DRAM-based LLCs in ChipMultiprocessors.",
            "Accelerating CNN Inference on ASICs: A Survey.",
            "Benchmarking vision kernels and neural network inference accelerators on embedded platforms.",
            "HOSVD prototype based on modular SW libraries running on a high-performance CPU+GPU platform.",
            "A lightweight online backup manager for energy harvesting powered nonvolatile processor systems.",
            "Energy efficient backup overloading schemes for fault tolerant scheduling of real-time tasks.",
            "ADAPT: An auxiliary storage data path toolkit.",
            "Online user allocation in mobile edge computing environments: A decentralized reactive approach.",
            "Distributed task allocation in Mobile Device Cloud exploiting federated learning and subjective logic.",
            "Accelerating data filtering for database using FPGA.",
            "ConGradetect: Blockchain-based detection of code and identity privacy vulnerabilities in crowdsourcing.",
            "Formal modeling and verification of UML Activity Diagrams (UAD) with FoCaLiZe.",
            "ArchNet: A data hiding design for distributed machine learning systems.",
            "Towards dynamic safety assurance for Industry 4.0.",
            "TOPSIS inspired Budget and Deadline Aware Multi-Workflow Scheduling for Cloud computing.",
            "Distributed learning dynamics of Multi-Armed Bandits for edge intelligence.",
            "Reliability-oriented design of on-board satellite boot software against single event effects.",
            "ECTM: A network-on-chip communication model to combine task and message schedulability analysis.",
            "Privacy-preserving incentive mechanism for multi-leader multi-follower IoT-edge computing market: A reinforcement learning approach.",
            "Light-weight AI and IoT collaboration for surveillance video pre-processing.",
            "Efficient algorithms for task mapping on heterogeneous CPU/GPU platforms for fast completion time.",
            "Guest editorial: Special issue on next generation AI approaches for intelligent internet of things.",
            "A secure and privacy preserving lightweight authentication scheme for smart-grid communication using elliptic curve cryptography.",
            "Privacy attacks against deep learning models and their countermeasures.",
            "SEAMERS: A Semi-partitioned Energy-Aware scheduler for heterogeneous MulticorEReal-time Systems.",
            "Low learning-cost offline strategies for EDP optimization of parallel applications.",
            "Software-defined vehicular network (SDVN): A survey on architecture and routing.",
            "Scheduling and analysis of real-time task graph models with nested locks.",
            "Task scheduling with precedence and placement constraints for resource utilization improvement in multi-user MEC environment.",
            "Edge-based auditing method for data security in resource-constrained Internet of Things.",
            "Guest editorial: Special issue on modeling, verification and testing of dependable critical systems.",
            "TP2SF: A Trustworthy Privacy-Preserving Secured Framework for sustainable smart cities by leveraging blockchain and machine learning.",
            "A provably secure and lightweight authentication scheme for Internet of Drones for smart city surveillance.",
            "SparkNoC: An energy-efficiency FPGA-based accelerator using optimized lightweight CNN for edge computing.",
            "Improving in-memory file system reading performance by fine-grained user-space cache mechanisms.",
            "A priority, power and traffic-aware virtual machine placement of IoT applications in cloud data centers.",
            "Crown-scheduling of sets of parallelizable tasks for robustness and energy-elasticity on many-core systems with discrete dynamic voltage and frequency scaling.",
            "Wireless edge caching based on content similarity in dynamic environments.",
            "Interactive and targeted runtime verification using a debugger-based architecture.",
            "HEVC hardware vs software decoding: An objective energy consumption analysis and comparison.",
            "A secure index resisting keyword privacy leakage from access and search patterns in searchable encryption.",
            "Feasibility interval and sustainable scheduling simulation with CRPD on uniprocessor platform.",
            "On blockchain integration into mobile crowdsensing via smart embedded devices: A comprehensive survey.",
            "A survey on program-state retention for transiently-powered systems.",
            "SimEdgeIntel: A open-source simulation platform for resource management in edge intelligence.",
            "Online cycle detection for models with mode-dependent input and output dependencies.",
            "Guest editorial: Special issue on design architecture and applications of smart embedded devices in internet of things.",
            "Dynamic task allocation and scheduling with contention-awareness for Network-on-Chip based multicore systems.",
            "Blockchain-assisted handover authentication for intelligent telehealth in multi-server edge computing environment.",
            "Mitigating service-oriented attacks using context-based trust for smart cities in IoT networks.",
            "A survey of accelerator architectures for 3D convolution neural networks.",
            "Public-key authenticated encryption with keyword search achieving both multi-ciphertext and multi-trapdoor indistinguishability.",
            "IoTSim-Osmosis: A framework for modeling and simulating IoT applications over an edge-cloud continuum.",
            "Cross-domain access control based on trusted third-party and attribute mapping center.",
            "Special issue on design of embedded software and systems (SI: ICESS19).",
            "Adaptive subflow allocation for multipath data transmission in mobile edge networks.",
            "Fault-Tolerant Application Mapping on Mesh-of-Tree based Network-on-Chip.",
            "Implementing synchronous reactive components upon multiprocessor platforms.",
            "Digital signature with cryptographic reverse firewalls.",
            "CURATING: A multi-objective based pruning technique for CNNs.",
            "Storage as a service in Fog computing : A systematic review.",
            "0-1 ILP-based run-time hierarchical energy optimization for heterogeneous cluster-based multi/many-core systems.",
            "A novel frame preemption model in TSN networks.",
            "Exploring the boundaries of Ada syntax with functional-style iterators.",
            "Secure content based image retrieval for mobile users with deep neural networks in the cloud.",
            "Towards Linux based safety systems - A statistical approach for software execution path coverage.",
            "A global-energy-aware virtual machine placement strategy for cloud data centers.",
            "A two-layer optimal scheduling framework for energy savings in a data center for Cyber-Physical-Social Systems.",
            "An HMAC-based authentication scheme for network coding with support for error correction and rogue node identification.",
            "LAKAF: Lightweight authentication and key agreement framework for smart grid network.",
            "gRemote: Cloud rendering on GPU resource pool based on API-forwarding.",
            "A cross-layer fault propagation analysis method for edge intelligence systems deployed with DNNs.",
            "Bus network assisted drone scheduling for sustainable charging of wireless rechargeable sensor network.",
            "Rahasak - Scalable blockchain architecture for enterprise applications.",
            "Energy-efficient neural networks with near-threshold processors and hardware accelerators.",
            "ML-driven classification scheme for dynamic interference-aware resource scheduling in cloud infrastructures.",
            "Worst-case traversal time analysis of TSN with multi-level preemption.",
            "Commercial hypervisor-based task sandboxing mechanisms are unsecured? But we can fix it!",
            "Learning based compilation of embedded applications targeting minimal energy consumption.",
            "S-CNN-ESystem: An end-to-end embedded CNN inference system with low hardware cost and hardware-software time-balancing.",
            "Adaptive simulation with Virtual Prototypes in an open-source RISC-V evaluation platform.",
            "Tracking and analysing social interactions in dairy cattle with real-time locating system and machine learning.",
            "Queue assignment for fixed-priority real-time flows in time-sensitive networks: Hardness and algorithm.",
            "The evolution of IoT Malwares, from 2008 to 2019: Survey, taxonomy, process simulator and perspectives.",
            "C2QoS: Network QoS guarantee in vSwitch through CPU-cycle management.",
            "A multi-objective LSM/NoC architecture co-design framework.",
            "Thermal-aware adaptive VM allocation considering server locations in heterogeneous data centers.",
            "Specification, detection, and treatment of STRIDE threats for software components: Modeling, formal methods, and tool support.",
            "ICAS: Two-factor identity-concealed authentication scheme for remote-servers.",
            "A systematic methodology to migrate complex real-time software systems to multi-core platforms.",
            "RoBMEX: ROS-based modelling framework for end-users and experts.",
            "REALISM: Reliability-aware energy management in multi-level mixed-criticality systems with service level degradation.",
            "An enhanced planned obsolescence attack by aging networks-on-chip.",
            "Balancing memory-accessing and computing over sparse DNN accelerator via efficient data packaging.",
            "The effects of audiovisual landmarks on spatial learning and recalling for image browsing interface in virtual environments.",
            "Middleware for the Internet of Things: A survey on requirements, enabling technologies, and solutions.",
            "Hybrid short-term traffic forecasting architecture and mechanisms for reservation-based Cooperative ITS.",
            "AucSwap: A Vickrey auction modeled decentralized cross-blockchain asset transfer protocol.",
            "A privacy-preserving resource trading scheme for Cloud Manufacturing with edge-PLCs in IIoT.",
            "Blocking analysis of suspension-based protocols for parallel real-time tasks under global fixed-priority scheduling.",
            "A lightweight key management scheme for key-escrow-free ECC-based CP-ABE for IoT healthcare systems.",
            "Hardware accelerator for an accurate local stereo matching algorithm using binary neural network.",
            "A secure and efficient authentication and data sharing scheme for Internet of Things based on blockchain.",
            "Corrigendum to \"Reliability and Test Effort Analysis of Multi-Sensor Driver Assistance Systems\" [Journal of Systems Architecture 85-86 (2018) 1-13].",
            "Efficient runtime slack management for EDF-VD-based mixed-criticality scheduling.",
            "An efficient highly parallelized ReRAM-based architecture for motion estimation of HEVC.",
            "Fast-convergent federated learning with class-weighted aggregation.",
            "Dynamic resource allocation for jointing vehicle-edge deep neural network inference.",
            "Time-Sensitive Networking in automotive embedded systems: State of the art and research opportunities.",
            "Optimizing the data placement and scheduling on multi-port DWM in multi-core embedded system.",
            "Global emergency-based job-level scheduling for weakly-hard real-time systems.",
            "A survey of deep learning techniques for vehicle detection from UAV images.",
            "An efficient GPU-accelerated inference engine for binary neural network on mobile phones.",
            "An Efficient Privacy-preserving Authentication Model based on blockchain for VANETs.",
            "Guest Editorial: Special issue on parallel, distributed, and network-based processing in next-generation embedded systems.",
            "EC-BAAS: Elliptic curve-based batch anonymous authentication scheme for Internet of Vehicles.",
            "A survey on hardware security of DNN models and accelerators.",
            "A public key encryption scheme based on a new variant of LWE with small cipher size.",
            "A genetic simulation strategy: Application to single-fault analysis of TTEthernet synchronization protocol.",
            "A generalized approach to real-time, non-intrusive instrumentation and monitoring of standards-based distributed middleware.",
            "Efficient DPA side channel countermeasure with MIM capacitors-based current equalizer.",
            "Cooperative computation offloading and resource allocation for delay minimization in mobile edge computing.",
            "Resilient monitoring in self-adaptive systems through behavioral parameter estimation.",
            "An Analyzable Inter-core Communication Framework for High-Performance Multicore Embedded Systems.",
            "A perspective on 6G: Requirement, technology, enablers, challenges and future road map.",
            "Memory-efficient deep learning inference with incremental weight loading and data layout reorganization on edge systems.",
            "A QoS-guaranteed online user data deployment method in edge cloud computing environment.",
            "Editorial to special issue on resource management for edge intelligence.",
            "NUMA-aware memory coloring for multicore real-time systems.",
            "EXPPO: EXecution Performance Profiling and Optimization for CPS Co-simulation-as-a-Service.",
            "In-circuit tuning of deep learning designs.",
            "A multi-model based microservices identification approach.",
            "C2AADL_Reverse: A model-driven reverse engineering approach to development and verification of safety-critical software.",
            "Democratic learning: hardware/software co-design for lightweight blockchain-secured on-device machine learning.",
            "Understanding security failures of anonymous authentication schemes for cloud environments.",
            "Achieving safety and performance with reconfiguration protocol for ethernet TSN in automotive systems.",
            "ReTiF: A declarative real-time scheduling framework for POSIX systems.",
            "Intrusion detection based on improved density peak clustering for imbalanced data on sensor-cloud systems.",
            "An open source framework based on Kafka-ML for Distributed DNN inference over the Cloud-to-Things continuum.",
            "Computation-transferable authenticated key agreement protocol for smart healthcare.",
            "MobileRE: A replicas prioritized hybrid fault tolerance strategy for mobile distributed system.",
            "Litmus-RT plugins for global static scheduling of mixed criticality systems.",
            "Hardware resources contention-aware scheduling of hard real-time multiprocessor systems.",
            "A Survey on Task Offloading in Multi-access Edge Computing.",
            "A survey of hardware architectures for generative adversarial networks.",
            "Compiling for time-predictability with dual-issue single-path code.",
            "A lightweight verifiable trust based data collection approach for sensor-cloud systems.",
            "Combining admission tests for heuristic partitioning of real-time tasks on ARM big.LITTLE multi-processor architectures.",
            "Improving Efficiency and Lifetime of Logic-in-Memory by Combining IMPLY and MAGIC Families.",
            "QBLKe: Host-side flash translation layer management for Open-Channel SSDs.",
            "A flexible attribute based data access management scheme for sensor-cloud system.",
            "Removing bias from the judgment day: A Ravenscar-based toolbox for quantitative comparison of EDF-to-RM uniprocessor scheduling.",
            "Self-secured devices: High performance and secure I/O access in TrustZone-based systems.",
            "Secure boot, trusted boot and remote attestation for ARM TrustZone-based IoT Nodes.",
            "Edge based authentication protocol for vehicular communications without trusted party communication.",
            "Secure Top-k query in edge-computing-assisted sensor-cloud systems.",
            "Energy efficient EDF-VD-based mixed-criticality scheduling with shared resources.",
            "Security analysis of Pan et al.'s \"Public-key authenticated encryption with keyword search achieving both multi-ciphertext and multi-trapdoor indistinguishability\".",
            "A case study for risk assessment in AR-equipped socio-technical systems.",
            "FreqCounter: Efficient Cacheability of Encryption and Integrity Tree Counters in Secure Processors.",
            "A survey on data center cooling systems: Technology, power consumption modeling and control strategy optimization.",
            "DMSE: Dynamic Multi-keyword Search Encryption based on inverted index.",
            "Accelerating DNNs from local to virtualized FPGA in the Cloud: A survey of trends.",
            "A security policy hardening framework for Socio-Cyber-Physical Systems.",
            "Corrigendum to Intrusion detection based on improved density peak clustering for imbalanced data on sensor-cloud systems Journal of Systems Architecture volume 118 (2021) 102212.",
            "Special issue on advances in reliable software technologies (AdaEurope20).",
            "An efficient and secure certificateless searchable encryption scheme against keyword guessing attacks.",
            "Fair and size-scalable participant selection framework for large-scale mobile crowdsensing.",
            "Decentralized and expressive data publish-subscribe scheme in cloud based on attribute-based keyword search.",
            "A survey of SRAM-based in-memory computing techniques and applications.",
            "A scalable factory backbone for multiple independent time-sensitive networks.",
            "PMSort: An adaptive sorting engine for persistent memory.",
            "A survey on FANET routing from a cross-layer design perspective.",
            "The price of schedulability in cyclic workloads: The history-vs.-response-time-vs.-accuracy trade-off.",
            "A machine learning assisted data placement mechanism for hybrid storage systems.",
            "Secure user authentication mechanism for IoT-enabled Wireless Sensor Networks based on multiple Bloom filters.",
            "SecVKQ: Secure and verifiable kNN queries in sensor-cloud systems.",
            "A generic framework to integrate data caches in the WCET analysis of real-time systems.",
            "PUA-KE: Practical User Authentication with Key Establishment and its Application in Implantable Medical Devices.",
            "Towards functional safety compliance of matrix-matrix multiplication for machine learning-based autonomous systems.",
            "Multi-grain reconfigurable and scalable overlays for hardware accelerator composition.",
            "Special Issue on Smart Applications and Data Analysis for Smart Cyber-Physical Systems.",
            "Safe and secure platooning of Automated Guided Vehicles in Industry 4.0.",
            "Are task mappings with the highest frequency of servers so good? A case study on Heterogeneous Earliest Finish Time (HEFT) algorithm.",
            "An exact comparison of global, partitioned, and semi-partitioned fixed-priority real-time multiprocessor schedulers.",
            "THAMON: Thermal-aware High-performance Application Mapping onto Opto-electrical network-on-chip.",
            "EBIAC: Efficient biometric identity-based access control for wireless body area networks.",
            "A survey on vision-based driver distraction analysis.",
            "Optimal computational resource pricing in vehicular edge computing: A Stackelberg game approach.",
            "An identity-based proxy re-encryption for data deduplication in cloud."
        ]
    },
    {
        "name": "JSA",
        "year": "2020",
        "info": "2020: Volumes\n102,\n103,\n104,\n105,\n106,\n107,\n108,\n109,\n110,\n111",
        "count": 107,
        "papers": [
            "Autonomous temperature sensing for optical network-on-chip.",
            "Quail: Using NVM write monitor to enable transparent wear-leveling.",
            "TrCMP: A dependable app usage inference design for user behavior analysis through cyber-physical parameters.",
            "A cloud data deduplication scheme based on certificateless proxy re-encryption.",
            "A blockchain-based attribute-based signcryption scheme to secure data sharing in the cloud.",
            "Deep neural networks compiler for a trace-based accelerator.",
            "A local external coupling matrix solution and dynamic processing in medical cyber-physical cloud systems.",
            "Fault-tolerant real-time tasks scheduling with dynamic fault handling.",
            "Leveraging partial-refresh for performance and lifetime improvement of 3D NAND flash memory in cyber-physical systems.",
            "Stochastic multi-objective Pareto-optimization framework for fully automated ab initio network-on-chip design.",
            "Asynchronous vs. synchronous interfacing to time-triggered communication systems.",
            "Period adaptation of real-time control tasks with fixed-priority scheduling in cyber-physical systems.",
            "An efficient identity-based signature scheme without bilinear pairing for vehicle-to-vehicle communication in VANETs.",
            "Efficient drone hijacking detection using two-step GA-XGBoost.",
            "Multi-teacher knowledge distillation for compressed video action recognition based on deep learning.",
            "Genetic algorithm based estimation of non-functional properties for GPGPU programs.",
            "ECG heartbeat classification in compressive domain for wearable devices.",
            "A survey on modeling and improving reliability of DNN algorithms and accelerators.",
            "A framework for supporting the development of verifiably safe medical best practice guideline systems.",
            "An inaudible voice attack to context-based device authentication in smart IoT systems.",
            "FLUSH + PREFETCH: A countermeasure against access-driven cache-based side-channel attacks.",
            "Adapting the concept of artificial DNA and hormone system to AUTOSAR environments.",
            "STC: Sub-packetization tunable codes for fast recovery.",
            "A survey on intrusion detection and prevention in wireless ad-hoc networks.",
            "Enabling Ada and OpenMP runtimes interoperability through template-based execution.",
            "Real-Time scheduling and analysis of parallel tasks on heterogeneous multi-cores.",
            "Developing graphical detection techniques for maintaining state estimation integrity against false data injection attack in integrated electric cyber-physical system.",
            "Contention-aware optimal scheduling of real-time precedence-constrained task graphs on heterogeneous distributed systems.",
            "Towards fault adaptive routing in metasurface controller networks.",
            "Formalization of continuous Fourier transform in verifying applications for dependable cyber-physical systems.",
            "Using Xen and KVM as real-time hypervisors.",
            "Reconfigurable on-chip interconnection networks for high performance embedded SoC design.",
            "A framework for scheduling dependent programs on GPU architectures.",
            "MMDA: Multidimensional and multidirectional data aggregation for edge computing-enhanced IoT.",
            "Efficient location privacy-preserving range query scheme for vehicle sensing systems.",
            "L-Heron: An open-source load-aware online scheduler for Apache Heron.",
            "Packet priority assignment for wireless control systems of multiple physical systems.",
            "URMILA: Dynamically trading-off fog and edge resources for performance and mobility-aware IoT services.",
            "Group system: An efficient dynamic memory management scheme for real-time systems.",
            "A semi-autonomous distributed blockchain-based framework for UAVs system.",
            "A thread synchronization model for the PREEMPT_RT Linux kernel.",
            "Evaluation of the dependability of an artificial DNA in a dynamic automotive environment.",
            "Design optimization of confidentiality-critical cyber physical systems with fault detection.",
            "Build real-time communication for hybrid dual-OS system.",
            "A Scalable Virtual memory system based on decentralization for many-cores.",
            "GPU Energy optimization based on task balance scheduling.",
            "A low latency energy efficient BFT based 3D NoC design with zone based routing strategy.",
            "HDA: Hierarchical and dependency-aware task mapping for network-on-chip based embedded systems.",
            "VPAMS: Verifiable and practical attribute-based multi-keyword search over encrypted cloud data.",
            "Real-time scheduling of parallel tasks with tight deadlines.",
            "Energy-cognizant scheduling for preference-oriented fixed-priority real-time tasks.",
            "A time-predictable open-source TTEthernet end-system.",
            "Fast modeling L2 cache reuse distance histograms using combined locality information from software traces.",
            "Introduction to the special issue on dependable cyber physical systems.",
            "Makespan-minimization workflow scheduling for complex networks with social groups in edge computing.",
            "A Hidden Markov Model based smartphone heterogeneity resilient portable indoor localization framework.",
            "A survey and taxonomy of congestion control mechanisms in wireless network on chip.",
            "Algorithm-based fault tolerance for discrete wavelet transform implemented on GPUs.",
            "A Survey on Deep Transfer Learning to Edge Computing for Mitigating the COVID-19 Pandemic.",
            "Efficient bypass in mesh and torus NoCs.",
            "Certificateless public key encryption with cryptographic reverse firewalls.",
            "Expressing survivability considerations in mixed-criticality scheduling theory.",
            "RISC-V based virtual prototype: An extensible and configurable platform for the system-level.",
            "On hardware-trojan-assisted power budgeting system attack targeting many core systems.",
            "Command queue-aware host I/O stack for mobile flash storage.",
            "Designing a decentralized fault-tolerant software framework for smart grids and its applications.",
            "Towards holistic secure networking in connected vehicles through securing CAN-bus communication and firmware-over-the-air updating.",
            "Binary convolutional neural network acceleration framework for rapid system prototyping.",
            "Introduction to the special issues on embedded systems in applied computing.",
            "An efficient certificateless public key encryption scheme with authorized equality test in healthcare environments.",
            "Branch-aware data variable allocation for energy optimization of hybrid SRAM+NVM SPM☆.",
            "BZIP: A compact data memory system for UTXO-based blockchains.",
            "PHDFS: Optimizing I/O performance of HDFS in deep learning cloud computing platform.",
            "Special issue on energy-efficient many-core embedded systems and architectures (SI: NoCArc18).",
            "Latency upper bound for data chains of real-time periodic tasks.",
            "IoT Device security through dynamic hardware isolation with cloud-Based update.",
            "SSW: A strictly sequential writing method for open-channel SSD.",
            "MBBNet: An edge IoT computing-based traffic light detection solution for autonomous bus.",
            "Design-space evaluation for non-blocking synchronization in Ada: lock elision of protected objects, concurrent objects, and low-level atomics.",
            "Guiding assurance of architectural design patterns for critical applications.",
            "Attacking vision-based perception in end-to-end autonomous driving models.",
            "Optimized co-scheduling of mixed-precision neural network accelerator for real-time multitasking applications.",
            "Certificateless authenticated key agreement for blockchain-based WBANs.",
            "Task allocation algorithm and optimization model on edge collaboration.",
            "Enhancing Internet of Things Security using Software-Defined Networking.",
            "Reactive programming in Ada 2012 with RxAda.",
            "Run-time adaptive data page mapping: A Comparison with 3D-stacked DRAM cache.",
            "Efficient mapping of runnables to tasks for embedded AUTOSAR applications.",
            "Efficient SAT encoding scheme for schedulability analysis of non-preemptive tasks on multiple computational resources.",
            "A Maude-Based rewriting approach to model and verify Cloud/Fog self-adaptation and orchestration.",
            "Perceptron based filtering of futile prefetches in embedded VLIW DSPs.",
            "Anomaly detection in bitcoin information networks with multi-constrained meta path.",
            "Exact response time analysis of fixed priority systems based on sporadic servers.",
            "Dynamic-weighted simplex strategy for learning enabled cyber physical systems.",
            "A survey and taxonomy on energy management schemes in wireless sensor networks.",
            "Experiment and enabled flow for GPGPU-Sim simulators with fixed-point instructions.",
            "IntMA: Dynamic Interaction-aware resource allocation for containerized microservices in cloud environments.",
            "PRO: A periodical reset optimized page migration scheme for hybrid memory system.",
            "On-demand deployment for IoT applications.",
            "A holistic cross-layer optimization approach for mitigating stragglers in in-memory data processing.",
            "A smart cyber physical multi-source energy system for an electric vehicle prototype.",
            "Power profiling and monitoring in embedded systems: A comparative study and a novel methodology based on NARX neural networks.",
            "Bridging the gap between formal verification and schedulability analysis: The case of robotics.",
            "OpenCL implementation of a SLAM system on an SoC-FPGA.",
            "ESSA: An energy-Aware bit-Serial streaming deep convolutional neural network accelerator.",
            "ADHD fMRI short-time analysis method for edge computing based on multi-instance learning.",
            "A new start: Introducing the journal-track proceedings of the 24th Ada-Europe conference on reliable software technologies."
        ]
    },
    {
        "name": "JSA",
        "year": "2019",
        "info": "2019: Volumes\n92,\n93,\n94,\n95,\n96,\n97,\n98,\n99,\n100,\n101",
        "count": 120,
        "papers": [
            "Building real-time parallel task systems on multi-cores: A hierarchical scheduling approach.",
            "Grouping and time-series notifying of periodic data in a real-time streaming system for smart toy claw machine.",
            "Early prediction of reliability and availability of combined hardware-software systems based on functional failures.",
            "A survey on fault-tolerant application mapping techniques for Network-on-Chip.",
            "A High-Speed Integrated building emulation engine based on discrete event simulation.",
            "An integrated hardware/software design methodology for signal processing systems.",
            "Workload-aware harmonic partitioned scheduling for fixed-priority probabilistic real-time tasks on multiprocessors.",
            "FPGA based acceleration of game theory algorithm in edge computing for autonomous driving.",
            "Gait recognition with cross-domain transfer networks.",
            "Locality-aware cache random replacement policies.",
            "An offloading method using decentralized P2P-enabled mobile edge servers in edge computing.",
            "A scheduling algorithm for autonomous driving tasks on mobile edge computing servers.",
            "Bio-inspired cryptosystem with DNA cryptography and neural networks.",
            "Leveraging real-time and multitasking Ada capabilities to small microcontrollers.",
            "Controller and architecture co-design of wireless cyber-physical systems.",
            "Lane scheduling around crossroads for edge computing based autonomous driving.",
            "Filter-based deep-compression with global average pooling for convolutional networks.",
            "Managing safety and mission completion via collective run-time adaptation.",
            "Infracomposer: Policy-driven adaptive and reflective middleware for the cloudification of simulation & optimization workflows.",
            "Run-time timing prediction for system reconfiguration on many-core embedded systems.",
            "Scheduling multiple agile earth observation satellites with an edge computing framework and a constructive heuristic algorithm.",
            "Anomaly detection based on random matrix theory for industrial power systems.",
            "An improved mechanism for flow rule installation in-band SDN.",
            "Decomposition of distributed edge systems based on the Petri nets and linear algebra technique.",
            "Special Issue on Emerging Trend and Techniques of Cyber Physical Systems.",
            "Electromagnetic radiation based continuous authentication in edge computing enabled internet of things.",
            "Fuzzy pattern tree for edge malware detection and categorization in IoT.",
            "Introduction to the special issue of the 16th ACM workshop on Adaptive and Reflective Middleware (ARM).",
            "A distributed node deployment algorithm for underwater wireless sensor networks based on virtual forces.",
            "PB-NVM: A high performance partitioned buffer on NVDIMM.",
            "QoE-driven computation offloading for Edge Computing.",
            "Computing in smart toys and the related Internet of Things (IoT) applications.",
            "The power impact of hardware and software actuators on self-adaptable many-core systems.",
            "Lightweight formalisation of adaptive middleware.",
            "An adaptive IoT platform on budgeted 3G data plans.",
            "Toy user interfaces: Systematic and industrial mapping.",
            "Leaf: An open-source cybersecurity training platform for realistic edge-IoT scenarios.",
            "P2TA: Privacy-preserving task allocation for edge computing enhanced mobile crowdsensing.",
            "Pessimism in multicore global schedulability analysis.",
            "Model-based documentation of dynamicity constraints for collaborative cyber-physical system architectures: Findings from an industrial case study.",
            "Design optimization of WirelessHART networks in Cyber-Physical Systems.",
            "Authentication in cloud-driven IoT-based big data environment: Survey and outlook.",
            "Efficient sizing and placement of distributed generators in cyber-physical power systems.",
            "An active scheduling policy for automotive cyber-physical systems.",
            "Random test program generation for verification and validation of the Samsung Reconfigurable Processor.",
            "A memory-bounded, deterministic and terminating semantics for the synchronous programming language Céu.",
            "ECASS: Edge computing based auxiliary sensing system for self-driving vehicles.",
            "An efficient convolutional neural network for small traffic sign detection.",
            "Designing efficient accelerator of depthwise separable convolutional neural network on FPGA.",
            "A permanent fault tolerant dynamic task allocation approach for Network-on-Chip based multicore systems.",
            "GPUart - An application-based limited preemptive GPU real-time scheduler for embedded systems.",
            "ENOrMOUS: ENergy Optimization for MObile plateform using User needS.",
            "Online stereo camera calibration for automotive vision based on HW-accelerated A-KAZE-feature extraction.",
            "A survey of spintronic architectures for processing-in-memory and neural networks.",
            "A survey of encoding techniques for reducing data-movement energy.",
            "A survey of optimization techniques for thermal-aware 3D processors.",
            "Hierarchical adaptive Multi-objective resource management for many-core systems.",
            "A Survey on optimized implementation of deep learning models on the NVIDIA Jetson platform.",
            "A new approach to the Population-Based Incremental Learning algorithm using virtual regions for task mapping on NoCs.",
            "Leaking your engine speed by spectrum analysis of real-Time scheduling sequences.",
            "Hardlock: Real-time multicore locking.",
            "Event-based application modeling for analysis of asymmetric multicore-based mobile systems.",
            "Optimized implementation of OpenCL kernels on FPGAs.",
            "Empirical model-based performance prediction for application mapping on multicore architectures.",
            "Task allocation, migration and scheduling for energy-efficient real-time multiprocessor architectures.",
            "Exploring heterogeneous scheduling for edge computing with CPU and FPGA MPSoCs.",
            "Data dependency reduction for high-performance FPGA implementation of DEFLATE compression algorithm.",
            "CLPKM: A checkpoint-based preemptive multitasking framework for OpenCL kernels.",
            "Allocation and scheduling of SystemJ programs on chip multiprocessors with weighted TDMA scheduling.",
            "Minimizing temperature and energy of real-time applications with precedence constraints on heterogeneous MPSoC systems.",
            "Co-synthesis of contention-free energy-efficient NOC-based real time embedded systems.",
            "CLBM: Controlled load-balancing mechanism for congestion management in silicon interposer NoC architecture.",
            "LG-RAM: Load-aware global resource affinity management for virtualized multicore systems.",
            "Improving energy efficiency of mobile devices by characterizing and exploring user behaviors.",
            "A survey on applications and architectural-optimizations of Micron's Automata Processor.",
            "An efficient attribute-based online/offline searchable encryption and its application in cloud-based reliable smart grid.",
            "Optimizing data permutations in structured loads/stores translation and SIMD register mapping for a cross-ISA dynamic binary translator.",
            "Scheduling optimization with partitioning for mixed-criticality systems.",
            "Predicting performance in multi-core systems with shared reconfigurable accelerators.",
            "FC: Built-in flash cache with fast cleaning for SMR storage systems.",
            "Offloading and system resource allocation optimization in TDMA based wireless powered mobile edge computing.",
            "A scala based framework for developing acceleration systems with FPGAs.",
            "Scheduling and power management in energy harvesting computing systems with real-time constraints.",
            "Automotive decentralized diagnosis based on CAN real-time analysis.",
            "Vehicle data management with specific wear-levelling and fault tolerance for hybrid DRAM-NVM memory.",
            "Dynamic Task Mapping and Scheduling with Temperature-Awareness on Network-on-Chip based Multicore Systems.",
            "All one needs to know about fog computing and related edge computing paradigms: A complete survey.",
            "A Survey and Taxonomy of FPGA-based Deep Learning Accelerators.",
            "Efficient large-scale heterogeneous debugging using dynamic tracing.",
            "vSimilar: A high-adaptive VM scheduler based on the CPU pool mechanism.",
            "Reinforcement learning-driven address mapping and caching for flash-based remote sensing image processing.",
            "Evaluation framework for energy-aware multiprocessor scheduling in real-Time systems.",
            "On evaluating the resource usage effectiveness of multi-tenant cloud storage.",
            "IoT Manager: An open-source IoT framework for smart cities.",
            "Partially shared cache and adaptive replacement algorithm for NoC-based many-core systems.",
            "Delay-based I/O request scheduling in SSDs.",
            "Scope-aware data cache analysis for OpenMP programs on multi-core processors.",
            "Ker-ONE: A new hypervisor managing FPGA reconfigurable accelerators.",
            "MakeCode and CODAL: Intuitive and efficient embedded systems programming for education.",
            "Automated negotiation for ensuring composite service requirements in cloud computing.",
            "A blockchain-based certificateless public key signature scheme for vehicle-to-infrastructure communication in VANETs.",
            "Dynamic capping of rename registers for SMT processors.",
            "A survey of techniques for optimizing deep learning on GPUs.",
            "RedScarf: an open-source multi-platform simulation environment for performance evaluation of Networks-on-Chip.",
            "Mitigating write amplification issue of SMR drives via the design of sequential-write-constrained cache.",
            "CASS: Criticality-Aware Standby-Sparing for real-time systems.",
            "Cost and makespan-aware workflow scheduling in hybrid clouds.",
            "Comparing vertical and horizontal SIMD vector processor architectures for accelerated image feature extraction.",
            "A novel reconfigurable router for QoS guarantees in real-time NoC-based MPSoCs.",
            "Dynamic reconfiguration of embedded-DRAM caches employing zero data detection based refresh optimisation.",
            "Corrigendum: Correction of Acknowledgment: An improved mechanism for flow rule installation in In-band SDN [Journal of Systems Architecture 96 (2019) 1-19].",
            "SLO-aware colocation: Harvesting transient resources from latency-critical services.",
            "MULTS: A multi-cloud fault-tolerant architecture to manage transient servers in cloud computing.",
            "Scheduling bag-of-tasks applications on hybrid clouds under due date constraints.",
            "JDap: Supporting in-memory data persistence in javascript using Intel's PMDK.",
            "Proactive coordination for low-congestion multi-path datacenter networks.",
            "Authentication Techniques and Methodologies used in Wireless Body Area Networks.",
            "Verifying parallel dataflow transformations with model checking and its application to FPGAs.",
            "Rethinking compact abating probability modeling for open set recognition problem in Cyber-physical systems.",
            "A hierarchical architecture for time- and event-triggered real-time systems."
        ]
    },
    {
        "name": "JSA",
        "year": "2018",
        "info": "2018: Volumes\n82,\n83,\n84,\n85-86,\n87,\n88,\n89,\n90,\n91",
        "count": 61,
        "papers": [
            "Thermal-aware correlated two-level scheduling of real-time tasks with reduced processor energy on heterogeneous MPSoCs.",
            "A model-based framework for software portability and verification in embedded power management systems.",
            "Fuzzy logic based objective image quality assessment with FPGA implementation.",
            "Hypervisor for consolidating real-time automotive control units: Its procedure, implications and hidden pitfalls.",
            "A distributed multi-level model with dynamic replacement for the storage of smart edge computing.",
            "Energy aware fixed priority scheduling for real time sporadic task with task synchronization.",
            "Integration of Data Distribution Service and distributed partitioned systems.",
            "Introduction to the special section on Real time computing and distributed systems.",
            "Task mapping and scheduling for network-on-chip based multi-core platform with transient faults.",
            "Schedulability analysis and stack size minimization with preemption thresholds and mixed-criticality scheduling.",
            "Introduction to the special issue on \"Embedded Artificial Intelligence and Smart Computing\".",
            "Increasing resource utilization in mixed-criticality systems using a polymorphic VLIW processor.",
            "Soft error-aware energy-efficient task scheduling for workflow applications in DVFS-enabled cloud.",
            "Container-based architecture for flexible industrial control applications.",
            "Reliability and test effort analysis of multi-sensor driver assistance systems.",
            "Job-shifting: An algorithm for online admission of non-preemptive aperiodic tasks in safety critical systems.",
            "Comprehensible and dependable self-learning self-adaptive systems.",
            "Fault and timing analysis in critical multi-core systems: A survey with an avionics perspective.",
            "EMVS: Embedded Multi Vector-core System.",
            "Efficient energy management by exploiting retention state for self-powered nonvolatile processors.",
            "Smart-toy-edge-computing-oriented data exchange based on blockchain.",
            "Last level cache layout remapping for heterogeneous systems.",
            "Efficient flash-aware page-mapping cache management for on-board remote sensing image processing.",
            "Toy-IoT-Oriented data-driven CDN performance evaluation model with deep learning.",
            "Verification of network end-to-end latencies for adaptive ethernet-based cyber-physical systems.",
            "A reliability enhanced video storage architecture in hybrid SLC/MLC NAND flash memory.",
            "A robust multispectral palmprint matching algorithm and its evaluation for FPGA applications.",
            "Efficient FPGA-based architecture of an automatic wheeze detector using a combination of MFCC and SVM algorithms.",
            "WaaS (Wireless-as-a-Sensor): Conception, design and implementation on mobile platforms.",
            "AdapTracer: Adaptive path profiling using arithmetic coding.",
            "An integrated autonomous control mechanism to optimize sharing of multiple resources in Simultaneous Multi-Threading processors.",
            "A server-based approach for predictable GPU access with improved analysis.",
            "False history filtering for reducing hardware overhead of FPGA-based LZ77 compressor.",
            "Model checking of MARTE/CCSL time behaviors using timed I/O automata.",
            "Model checking of reconfigurable FPGA modules specified by Petri nets.",
            "Storage capacity for EDF-ASAP algorithm in energy-harvesting systems with periodic implicit deadline hard real-time tasks.",
            "UMFS: An efficient user-space file system for non-volatile memory.",
            "A multiplayer online car racing virtual-reality game based on internet of brains.",
            "Effectiveness of smart toy applications in teaching children with intellectual disability.",
            "Scalable in-memory mapping of Boolean functions in memristive crossbar array using simulated annealing.",
            "Energy-aware page replacement and consistency guarantee for hybrid NVM-DRAM memory systems.",
            "Application aware Scalable Architecture for GPGPU.",
            "Effectiveness of HT-assisted sinkhole and blackhole denial of service attacks targeting mesh networks-on-chip.",
            "Usability study of a smart toy on students with intellectual disabilities.",
            "Energy and performance-aware application mapping for inhomogeneous 3D networks-on-chip.",
            "Minimizing energy by thermal-aware task assignment and speed scaling in heterogeneous MPSoC systems.",
            "Spatial skyline queries over incomplete data for smart cities.",
            "Methodology for the model-driven development of service oriented IoT applications.",
            "Task scheduling with fault-tolerance in real-time heterogeneous systems.",
            "Bounding carry-in interference for synchronous parallel tasks under global fixed-priority scheduling.",
            "Power optimization techniques for associative processors.",
            "Scheduling computation and communication on a software-defined photonic Network-on-Chip architecture for high-performance real-time systems.",
            "Scheduling non-preemptive tasks with strict periods in multi-core real-time systems.",
            "Detecting the phase behavior on cache performance using the reuse distance vectors.",
            "Architectural design of a Safe Mission Manager for Unmanned Aircraft Systems.",
            "Run-time mapping algorithm for dynamic workloads using association rule mining.",
            "A survey of techniques for improving error-resilience of DRAM.",
            "SLOPE: Secure and load optimized packet scheduling model in a grid environment.",
            "A decomposition-based approach to optimization of TTP-based distributed embedded systems.",
            "A survey on modeling and model-driven engineering practices in the embedded software industry.",
            "Introducing the new paradigm of Social Dispersed Computing: Applications, Technologies and Challenges."
        ]
    },
    {
        "name": "JSA",
        "year": "2017",
        "info": "2017: Volumes\n72,\n73,\n74,\n75,\n76,\n77,\n78,\n79,\n80,\n81",
        "count": 92,
        "papers": [
            "Special Issue on: Design Automation for Embedded Ubiquitous Computing Systems (DAEUCS).",
            "Prenaut: Design space exploration for embedded symmetric multiprocessing with various on-chip architectures.",
            "Highly-Efficient Bulk Data Transfer for Structured Dissemination in Wireless Embedded Network Systems.",
            "Emotional robot control architecture implementation using FPGAs.",
            "Precise contention-aware performance prediction on virtualized multicore system.",
            "Parallel compressive sampling matching pursuit algorithm for compressed sensing signal reconstruction with OpenCL.",
            "Design optimization for AUTOSAR models with preemption thresholds and mixed-criticality scheduling.",
            "Enabling real-time information service on telehealth system over cloud-based big data platform.",
            "Fine grained, direct access file system support for storage class memory.",
            "IOTSim: A simulator for analysing IoT applications.",
            "Interest spaces: A unified interest-based dissemination framework for opportunistic networks.",
            "A few open problems and solutions for software technologies for dependable distributed systems.",
            "Architecting resilient computing systems: A component-based approach for adaptive fault tolerance.",
            "Evolutionary planning of virtualized cyber-physical compute and control clusters.",
            "Kassandra: A framework for distributed simulation of heterogeneous cooperating objects.",
            "Hardware transactional memory architecture with adaptive version management for multi-processor FPGA platforms.",
            "State machine replication in containers managed by Kubernetes.",
            "A resource-efficient network interface supporting low latency reconfiguration of virtual circuits in time-division multiplexing networks-on-chip.",
            "Reservation based protocol for resolving priority inversions in composable conveyor systems.",
            "Using design space exploration for finding schedules with guaranteed reaction times of synchronous programs on multi-core architecture.",
            "Energy-efficient scheduling for moldable real-time tasks on heterogeneous computing platforms.",
            "Deadline and energy aware dynamic task mapping and scheduling for Network-on-Chip based multi-core platform.",
            "Exploiting vectorization in high level synthesis of nested irregular loops.",
            "An efficient data structure for dynamic two-dimensional reconfiguration.",
            "Trustworthy self-optimization for organic computing environments using multiple simultaneous requests.",
            "IRPL: An energy efficient routing protocol for wireless sensor networks.",
            "Access control based privacy preserving secure data sharing with hidden access policies in cloud.",
            "Exploring the Processing-in-Memory design space.",
            "Identification and classification of agent behaviour at runtime in open, trust-based organic computing systems.",
            "Interpolation in the eXtended Classifier System: An architectural perspective.",
            "Evaluation of transient errors in GPGPUs for safety critical applications: An effective simulation-based fault injection environment.",
            "Increasing the efficiency and feasibility of configurable computing units.",
            "DiaSys: Improving SoC insight through on-chip diagnosis.",
            "A selective protection scheme of applications using asymmetrically reliable caches.",
            "TwoPhases: A transmission scheme to reduce the link width at deflection routing based Network-on-Chips.",
            "A systematic approach and tool support for GSN-based safety case assessment.",
            "Priority-driven spatial resource sharing scheduling for embedded graphics processing units.",
            "Small footprint synthesizable temperature sensor for FPGA devices.",
            "3D network-on-chip design for embedded ubiquitous computing systems.",
            "An energy-efficient encryption mechanism for NVM-based main memory in mobile systems.",
            "Scheduling analysis of tasks constrained by TDMA: Application to software radio protocols.",
            "Fast heterogeneous computing architectures for smart antennas.",
            "Real-Time neural signal decoding on heterogeneous MPSocs based on VLIW ASIPs.",
            "FPGA Implementation Issues of a Flexible Synchronizer Suitable for NC-OFDM-Based Cognitive Radios.",
            "An energy-efficient system on a programmable chip platform for cloud applications.",
            "Trade-offs of certified fixed-point code synthesis for linear algebra basic blocks.",
            "Parallel custom instruction identification for extensible processors.",
            "Introduction to the special issue on architecture of computing systems.",
            "Data re-allocation enabled cache locking for embedded systems.",
            "FPGA emulation methodology for fast and accurate power estimation of embedded processors.",
            "Simulation-based HW/SW co-exploration of the concurrent execution of HEVC intra encoding algorithms for heterogeneous multi-core architectures.",
            "Darwin: A neuromorphic hardware co-processor based on spiking neural networks.",
            "UDPF: A unified data provision framework for developing dynamic resource-oriented embedded applications.",
            "Adaptive power management scheme using many-core for maximizing network topology lifetime based on ubiquitous computing.",
            "Efficient task spawning for shared memory and message passing in many-core architectures.",
            "Automotive Architecture Framework: The experience of Volvo Cars.",
            "Porting a PCA-based hyperspectral image dimensionality reduction algorithm for brain cancer detection on a manycore architecture.",
            "Bit-accurate energy estimation for Networks-on-Chip.",
            "Extended overlay architectures for heterogeneous FPGA cluster management.",
            "Hardware design methodology using lightweight dataflow and its integration with low power techniques.",
            "Reliability-aware scheduling for reducing system-wide energy consumption for weakly hard real-time systems.",
            "Energy-aware run-time task partition and allocation in dynamic partial reconfigurable systems.",
            "Exploiting primary/backup mechanism for energy efficiency in dependable real-time systems.",
            "Cholesky factorization on SIMD multi-core architectures.",
            "Special issue on design of algorithms and architectures for signal and image processing.",
            "2nd International Workshop on Automotive Systems and Software Architectures (WASA) - Introduction to special section.",
            "Reduction of task migrations and preemptions in optimal real-time scheduling for multiprocessors by using dynamic T-L plane.",
            "An efficient approach for the multiprocessor non-preemptive strictly periodic task scheduling problem.",
            "Cluster-based multicore real-time mixed-criticality scheduling.",
            "Dynamic application allocation with resource balancing on NoC based many-core embedded systems.",
            "InSTechAH: Cost-effectively autoscaling smart computing hadoop cluster in private cloud.",
            "Multi-policy-aware MapReduce resource allocation and scheduling for smart computing cluster.",
            "SVM-based real-time hyperspectral image classifier on a manycore architecture.",
            "Towards decentralized system-level security for MPSoC-based embedded applications.",
            "Smart search space reduction for approximate computing: A low energy HEVC encoder case study.",
            "Feedback for increased robustness of forwarding graphs in the cloud.",
            "FLOPSYNC-QACS: Quantization-aware clock synchronization for wireless sensor networks.",
            "Using data visualization technique to detect sensitive information re-identification problem of real open dataset.",
            "An automatized method to parameterize embedded stereo matching algorithms.",
            "End-to-end timing analysis of cause-effect chains in automotive embedded systems.",
            "Enhanced Gaussian mixture model of RSSI purification for indoor positioning.",
            "Verifying cooperative software: A SMT-based bounded model checking approach for deterministic scheduler.",
            "Accurate power modeling of modern mobile application processors.",
            "FPGA based real-time on-road stereo vision system.",
            "Automatic machine status prediction in the era of Industry 4.0: Case study of machines in a spring factory.",
            "A profile-guided synergistic computation framework for Halide.",
            "Synergistic design of an application-oriented sparse directory on many-core embedded systems.",
            "Enabling PoCL-based runtime frameworks on the HSA for OpenCL 2.0 support.",
            "Fast profiling framework and race detection for heterogeneous system.",
            "Multi-Task Learning for Intrusion Detection on web logs.",
            "An optimized design of CAN FD for automotive cyber-physical systems.",
            "A novel tool-flow for zero-overhead cross-domain error resilient partially reconfigurable X-TMR for SRAM-based FPGAs."
        ]
    },
    {
        "name": "JSA",
        "year": "2016",
        "info": "2016: Volumes\n62,\n63,\n64,\n65,\n66-67,\n68,\n69,\n70,\n71",
        "count": 67,
        "papers": [
            "SIMD architecture on FPGA for scientific computing aboard a space instrument.",
            "Scenario-based run-time adaptive MPSoC systems.",
            "Buffer allocation for real-time streaming applications running on heterogeneous multi-processors without back-pressure.",
            "Introduction to the special issue on reconfigurable cyber-physical and embedded system design.",
            "Auto-tuning for GPGPU applications using performance and energy model.",
            "A thermal-aware scheduling for multicore architectures.",
            "A Distributed PTX Virtual Machine on Hybrid CPU/GPU Clusters.",
            "A framework for mastering heterogeneity in multi-layer security information and event correlation.",
            "Online slack consolidation in global-EDF for energy consumption minimisation.",
            "A safe-by-design programming language for wireless sensor networks.",
            "Comparative performance evaluation of latency and link dynamic power consumption modelling algorithms in wormhole switching networks on chip.",
            "Definitions of predictability for Cyber Physical Systems.",
            "Memory protection in embedded systems.",
            "Data aggregation framework for energy-efficient WirelessHART networks.",
            "Hierarchical energy monitoring for task mapping in many-core systems.",
            "Real-time signal processing in embedded systems.",
            "3D sparse signal recovery via 3D orthogonal matching pursuit.",
            "Fast multisensor infrared image super-resolution scheme with multiple regression models.",
            "Embedded multi-spectral image processing for real-time medical application.",
            "Subscription-free Pay-TV over IPTV.",
            "Multiple-path testing for cross site scripting using genetic algorithms.",
            "A new framework for remote sensing image super-resolution: Sparse representation-based method by processing dictionaries with multi-type features.",
            "On using multivariate polynomial regression model with spectral difference for statistical model-based speech enhancement.",
            "A narrow band interval type-2 fuzzy approach for image segmentation.",
            "Faces detection method based on skin color modeling.",
            "Real-time panorama video system using networked multiple cameras.",
            "Real-time continuous feature extraction in large size satellite images.",
            "Fully pipelined real time hardware solution for High Efficiency Video Coding (HEVC) intra prediction.",
            "SEtSim: A modular simulation tool for switched Ethernet networks.",
            "Response modeling runtime schedulers for timing analysis of self-timed dataflow graphs.",
            "Evaluation of dynamic binary translation techniques for full system virtualisation on ARMv7-A.",
            "Massively parallel GPU computing for fast stereo correspondence algorithms.",
            "New response time analysis for global EDF on a multiprocessor platform.",
            "A review of priority assignment in real-time systems.",
            "A MAC protocol for reliable communication in low power body area networks.",
            "NoC routing protocols - objective-based classification.",
            "TQSIM: A fast cycle-approximate processor simulator based on QEMU.",
            "Customization methodology for implementation of streaming aggregation in embedded systems.",
            "Start time configuration for strictly periodic real-time task systems.",
            "An optimal allocation of memory buffers for complex multicore platforms.",
            "HLC-PCP: A resource synchronization protocol for certifiable mixed criticality scheduling.",
            "An efficient static gesture recognizer embedded system based on ELM pattern recognition algorithm.",
            "An OpenCL software compilation framework targeting an SoC-FPGA VLIW chip multiprocessor.",
            "Runtime observation of functional safety properties in an automotive control network.",
            "A unified framework for designing high performance in-memory and hybrid memory file systems.",
            "Preference-oriented fixed-priority scheduling for periodic real-time tasks.",
            "A transmission window technique for CAN networks.",
            "Dynamic many-process applications on many-tile embedded systems and HPC clusters: The EURETILE programming environment and execution platforms.",
            "Special Issue on High Performance Computing, Communication and Embedded Software/Systems.",
            "High performance real-time scheduling of multiple mixed-criticality functions in heterogeneous distributed embedded systems.",
            "MTU configuration for real-time switched Ethernet networks.",
            "TADP: Enabling temporal and distantial priority scheduling for on-demand charging architecture in wireless rechargeable sensor Networks.",
            "Research on processing strategy for CPU-intensive application.",
            "An efficient task mapping algorithm with power-aware optimization for network on chip.",
            "A comprehensive reconfigurable computing approach to memory wall problem of large graph computation.",
            "Explore prediction for instruction level redundant execution in fault tolerant microprocessors.",
            "RICO: A low power repetitive iteration CORDIC for DSP applications in portable devices.",
            "Non-Volatile memory (NVM) technologies.",
            "Read disturbance issue and design techniques for nanoscale STT-MRAM.",
            "Energy efficient task allocation for hybrid main memory architecture.",
            "Exploration of trade-offs in the design of volatile STT-RAM cache.",
            "A compiler assisted wear leveling for morphable PCM in embedded systems.",
            "A user-visible solid-state storage system with software-defined fusion methods for PCM and NAND flash.",
            "Write reconstruction for write throughput improvement on MLC PCM based main memory.",
            "Systematic detection of memory related performance bottlenecks in GPGPU programs.",
            "Provisioning of power event APIs as a mobile OS facility.",
            "Synthesis of dependency-aware traffic generators from NoC simulation traces."
        ]
    },
    {
        "name": "JSA",
        "year": "2015",
        "info": "Volume 61: 2015",
        "count": 54,
        "papers": [
            "Area-performance trade-off in floorplan generation of Application-Specific Network-on-Chip with soft cores.",
            "Data loss recovery for power failure in flash memory storage systems.",
            "Using Chaos Theory based workload analysis to perform Dynamic Frequency Scaling on MPSoCs.",
            "Optimization of a Time-to-Digital Converter and a coincidence map algorithm for TOF-PET applications.",
            "A methodology for performance/energy consumption characterization and modeling of video decoding on heterogeneous SoC and its applications.",
            "Energy minimization for reliability-guaranteed real-time applications using DVFS and checkpointing techniques.",
            "FASA: A software architecture and runtime framework for flexible distributed automation systems.",
            "Minimizing write operation for multi-dimensional DSP applications via a two-level partition technique with complete memory latency hiding.",
            "Preference-oriented real-time scheduling and its application in fault-tolerant systems.",
            "Exploring AADL verification tool through model transformation.",
            "MaCACH: An adaptive cache-aware hybrid FTL mapping scheme using feedback control for efficient page-mapped space management.",
            "High-level design space exploration for adaptive applications on multiprocessor systems-on-chip.",
            "FPGA acceleration of semantic tree reasoning algorithms.",
            "A control-based methodology for power-performance optimization in NoCs exploiting DVFS.",
            "Improving schedulability and energy efficiency for window-constrained real-time systems with reliability requirement.",
            "A predictable hardware to exploit temporal reuse in real-time and embedded systems.",
            "A library for developing real-time and embedded applications in C.",
            "Distributed storage protection in wireless sensor networks.",
            "Real-time and distributed computing in emerging applications. Foreword by the general chairs of Reaction 2012.",
            "Compositional power-aware real-time scheduling with discrete frequency levels.",
            "Energy Optimization of Security-Critical Real-Time Applications with Guaranteed Security Protection.",
            "Dynamic task mapping for Network-on-Chip based systems.",
            "A dynamic binary translation system in a client/server environment.",
            "Intra-task device scheduling for real-time embedded systems.",
            "Automatic synthesis of communication and concurrency for exploring component-based system implementations considering UML channel semantics.",
            "LASER: Latency-Aware Segment Relocation for non-volatile memory.",
            "Message scheduling for real-time interprocessor communication.",
            "Linked Block-based Multiversion B-Tree index for PCM-based embedded databases.",
            "On the convergence of the holistic analysis for EDF distributed systems.",
            "Integrated core selection and mapping for mesh based Network-on-Chip design with irregular core sizes.",
            "MultiCS: Circuit switched NoC with multiple sub-networks and sub-channels.",
            "Dataflow formalisation of real-time streaming applications on a Composable and Predictable Multi-Processor SOC.",
            "T-CREST: Time-predictable multi-core architecture for embedded systems.",
            "A composable real-time architecture for replicated railway applications.",
            "State-based real-time analysis of SDF applications on MPSoCs with shared communication resources.",
            "A trustworthy, fault-tolerant and scalable self-configuration algorithm for Organic Computing systems.",
            "Self-adaptive corner detection on MPSoC through resource-aware programming.",
            "Interfacing the hardware API with a feature-based operating system family.",
            "Memory organizations for 3D-DRAMs and PCMs in processor memory hierarchy.",
            "Non-preemptive and SRP-based fully-preemptive scheduling of real-time Software Transactional Memory.",
            "Exploring ICMetrics to detect abnormal program behaviour on embedded devices.",
            "A two-tier design space exploration algorithm to construct GPU performance model.",
            "Tuning the victim selection policy of Intel TBB.",
            "Denial-of-Service attacks on PCI passthrough devices: Demonstrating the impact on network- and storage-I/O performance.",
            "Introduction to the Special Issue on Testing, prototyping, and debugging of multi-core architectures.",
            "mcfTRaptor: Toward unobtrusive on-the-fly control-flow tracing in multicores.",
            "Techniques for on-demand structural redundancy for massively parallel processor arrays.",
            "Automatic task mapping and heterogeneity-aware fault tolerance: The benefits for runtime optimization and application development.",
            "A high performance hardware accelerator for dynamic texture segmentation.",
            "Synthesis and optimization of image processing accelerators using domain knowledge.",
            "Calculation of dense trajectory descriptors on a heterogeneous embedded architecture.",
            "Resource-awareness on heterogeneous MPSoCs for image processing.",
            "Automatically controlled pan-tilt smart camera with FPGA based image analysis system dedicated to real-time tracking of a moving object.",
            "An embedded system for handwritten digit recognition."
        ]
    },
    {
        "name": "JSA",
        "year": "2014",
        "info": "Volume 60: 2014",
        "count": 67,
        "papers": [
            "Efficient decomposition of strongly connected components on GPUs.",
            "Hardware security platform for multicast communications.",
            "Evaluation of stereo correspondence algorithms and their implementation on FPGA.",
            "A novel 3-D FPGA architecture targeting communication intensive applications.",
            "MobileFBP: Designing portable reconfigurable applications for heterogeneous systems.",
            "Methodologies and tools for the design space exploration of embedded systems.",
            "The COMPLEX methodology for UML/MARTE Modeling and design space exploration of embedded systems.",
            "Fast and standalone Design Space Exploration for High-Level Synthesis under resource constraints.",
            "On the design space exploration through the Hellfire Framework.",
            "ASP-based optimized mapping in a simulink-to-MPSoC design flow.",
            "Multi-objective module partitioning design for dynamic and partial reconfigurable system-on-chip using genetic algorithm.",
            "MPSoC based on Transport Triggered Architecture for baseband processing of an LTE receiver.",
            "Design and optimization for embedded and real-time computing systems and applications.",
            "Supporting soft real-time parallel applications on multiprocessors.",
            "Memory reservation and shared page management for real-time systems.",
            "Studying the code compression design space - A synthesis approach.",
            "DTS: Dynamic TDMA scheduling for Networked Control Systems.",
            "Communications-oriented development of component-based vehicular distributed real-time embedded systems.",
            "Comparative analysis of two different middleware approaches for reconfiguration of distributed real-time systems.",
            "MORM: A Multi-objective Optimized Replication Management strategy for cloud storage cluster.",
            "Real-time embedded software for multi-core platforms.",
            "Deadline and activation time assignment for partitioned real-time application on multiprocessor reservations.",
            "Exploring the design space of multiprocessor synchronization protocols for real-time systems.",
            "A parallel Bees Algorithm implementation on GPU.",
            "CuSora: Real-time software radio using multi-core graphics processing unit.",
            "Colored Petri Net model with automatic parallelization on real-time multicore architectures.",
            "An efficient and comprehensive scheduler on Asymmetric Multicore Architecture systems.",
            "Optimized implementation of synchronous models on industrial LTTA systems.",
            "Integrated write buffer management for solid state drives.",
            "Reducing SSD access latency via NAND flash program and erase suspension.",
            "Memory efficient and scalable address mapping for flash storage devices.",
            "CaRINA Intelligent Robotic Car: Architectural design and applications.",
            "The use of unmanned aerial vehicles and wireless sensor networks for spraying pesticides.",
            "In-vehicle monitoring and management for military vehicles' integrated vetronics architectures.",
            "Introduction to special issue on embedded systems architecture and applications.",
            "Improving branch divergence performance on GPGPU with a new PDOM stack and multi-level warp scheduling.",
            "An efficient parallel-network packet pattern-matching approach using GPUs.",
            "Improving the computational efficiency of modular operations for embedded systems.",
            "A comparison of instruction memories from the WCET perspective.",
            "Applying link stability estimation mechanism to multicast routing in MANETs.",
            "FPGA prototyping of emerging manycore architectures for parallel programming research using Formic boards.",
            "Analysis of worst-case backlog bounds for Networks-on-Chip.",
            "Resolving priority inversions in composable conveyor systems.",
            "DreamCam: A modular FPGA-based smart camera architecture.",
            "Cache-based high-level simulation of microthreaded many-core architectures.",
            "End-to-end schedulability tests for multiprocessor embedded systems based on networks-on-chip with priority-preemptive arbitration.",
            "Extending Kernighan-Lin partitioning heuristic for application mapping onto Network-on-Chip.",
            "Memory optimization in FPGA-accelerated scientific codes based on unstructured meshes.",
            "A framework for post-silicon realization of arbitrary instruction extensions on reconfigurable data-paths.",
            "Sensor virtualization for underwater event detection.",
            "Garbage collection of multi-version indexed data on flash memory.",
            "A reconfigurable point target detection system based on morphological clutter elimination.",
            "A space allocation and reuse strategy for PCM-based embedded systems.",
            "Smart devices and spaces for pervasive computing.",
            "A remote control and media-sharing system using smart devices.",
            "Journaling deduplication with invalidation scheme for flash storage-based smart systems.",
            "Design and implementation of the WIPI-to-Android automatic mobile game converter for the contents compatibility in the heterogeneous mobile OS.",
            "A prediction and auto-execution system of smartphone application services based on user context-awareness.",
            "Radio propagation modeling and real test of ZigBee based indoor wireless sensor networks.",
            "Challenges in real-time virtualization and predictable cloud computing.",
            "Remote service discovery and binding architecture for soft real-time QoS in indoor location-based service.",
            "A cloud middleware for assuring performance and high availability of soft real-time applications.",
            "An architectural approach with separation of concerns to address extra-functional requirements in the development of embedded real-time software systems.",
            "MoNoC: A monitored network on chip with path adaptation mechanism.",
            "Race-to-halt energy saving strategies.",
            "A metaprogrammed C++ framework for hardware/software component integration and communication.",
            "MPS-CAN analyzer: Integrated implementation of response-time analyses for Controller Area Network."
        ]
    },
    {
        "name": "JSA",
        "year": "2013",
        "info": "Volume 59: 2013",
        "count": 129,
        "papers": [
            "Dynamic objects: Supporting fast and easy run-time reconfiguration in FPGAs.",
            "A real-time embedded architecture for SIFT.",
            "Embedded system for contrast enhancement in low-vision.",
            "NP-SARC: Scalable network processing in the SARC multi-core FPGA platform.",
            "Hierarchical neural networks based prediction and control of dynamic reconfiguration for multilevel embedded systems.",
            "A survey on application mapping strategies for Network-on-Chip design.",
            "Guest editorial: Workshop on Reconfigurable Computing.",
            "On supporting rapid exploration of memory hierarchies onto FPGAs.",
            "A template system for the efficient compilation of domain abstractions onto reconfigurable computers.",
            "Towards a multiple-ISA embedded system.",
            "Resource management for multimedia applications, distributed in open and heterogeneous home networks.",
            "FPGA acceleration using high-level languages of a Monte-Carlo method for pricing complex options.",
            "Formal virtualization requirements for the ARM architecture.",
            "K-means clustering algorithm for multimedia applications with flexible HW/SW co-design.",
            "Editorial Embedded Software Design for 3D Graphics Visualization.",
            "gkDtree: A group-based parallel update kd-tree for interactive ray tracing.",
            "Efficient hardware implementation of Ray Tracing based on an embedded software for intersection computation.",
            "Energy-efficient stream task scheduling scheme for embedded multimedia applications on multi-issued stream architectures.",
            "ENREM: An efficient NFA-based regular expression matching engine on reconfigurable hardware for NIDS.",
            "A systematic reordering mechanism for on-chip networks using efficient congestion-aware method.",
            "Preface for the Special Issue of GreenCOM 2011.",
            "Static worst-case lifetime estimation of wireless sensor networks: A case study on VigilNet.",
            "On-line energy-efficient real-time task scheduling for a heterogeneous dual-core system-on-a-chip.",
            "Quality of service aware power management for virtualized data centers.",
            "Informer homed routing fault tolerance mechanism for wireless sensor networks.",
            "An effective cache scheduling scheme for improving the performance in multi-threaded processors.",
            "Reducing cache and TLB power by exploiting memory region and privilege level semantics.",
            "JSA WATERS 2011.",
            "SimTrOS: A heterogenous abstraction level simulator for multicore synchronization in real-time systems.",
            "Grasp: Visualizing the behavior of hierarchical multiprocessor real-time systems.",
            "Modelling real-time applications based on resource reservations.",
            "Modeling distributed real-time systems with MAST 2.",
            "On the gap between schedulability tests and an automotive task model.",
            "Exploiting domain knowledge in system-level MPSoC design space exploration.",
            "Application-Specific Network-on-Chip synthesis with flexible router Placement.",
            "Limited carry-in technique for real-time multi-core scheduling.",
            "Remotely reconfigurable hardware-software platform with web service interface for automated video surveillance.",
            "Minimizing accumulative memory load cost on multi-core DSPs with multi-level memory.",
            "TSV: A novel energy efficient Memory Integrity Verification scheme for embedded systems.",
            "Enriching MATLAB with aspect-oriented features for developing embedded systems.",
            "From UML specifications to mapping and scheduling of tasks into a NoC, with reliability considerations.",
            "Optimal placement of vertical connections in 3D Network-on-Chip.",
            "Space optimal solution for data reordering in streaming applications on NoC based MPSoC.",
            "Using task migration to improve non-contiguous processor allocation in NoC-based CMPs.",
            "A fault tolerant NoC architecture using quad-spare mesh topology and dynamic reconfiguration.",
            "A unified link-layer fault-tolerant architecture for network-based many-core embedded systems.",
            "Silicon-aware distributed switch architecture for on-chip networks.",
            "Fuzzy-based Adaptive Routing Algorithm for Networks-on-Chip.",
            "Deadlock-free generic routing algorithms for 3-dimensional Networks-on-Chip with reduced vertical link density topologies.",
            "Distributed fair DRAM scheduling in network-on-chips architecture.",
            "NISHA: A fault-tolerant NoC router enabling deadlock-free Interconnection of Subnets in Hierarchical Architectures.",
            "Design space exploration for partially reconfigurable architectures in real-time systems.",
            "A new self-diagnosing approach based on petri nets and correlation graphs for fault management in wireless sensor networks.",
            "Energy-aware design space exploration of embedded systems.",
            "An automatic energy consumption characterization of processors using ArchC.",
            "Compiling for power with ScalaPipe.",
            "PASES: An energy-aware design space exploration framework for wireless sensor networks.",
            "MELOADES: Methodology for long-term online adaptation of embedded software for heterogeneous devices.",
            "Two-level caches tuning technique for energy consumption in reconfigurable embedded MPSoC.",
            "Optimizing a combined WCET-WCEC problem in instruction fetching for real-time systems.",
            "Dependable and predictable time-triggered Ethernet networks with COTS components.",
            "Special issue on network-based many-core embedded systems.",
            "Efficient multicast schemes for 3-D Networks-on-Chip.",
            "Formal approach to agent-based dynamic reconfiguration in Networks-On-Chip.",
            "Advanced technologies and theories for highly-reliable cyber physical system.",
            "Service vulnerability scanning based on service-oriented architecture in Web service environments.",
            "Applications IO profiling and analysis for smart devices.",
            "Evaluating the impact of proactivity in the user experience of a context-aware restaurant recommender for Android smartphones.",
            "JCOOLS: A toolkit for generating context-aware applications with JCAF and DROOLS.",
            "A stability-considered density-adaptive routing protocol in MANETs.",
            "Context-aware service roaming for heterogeneous embedded devices over cloud.",
            "Parallelized sub-resource loading for web rendering engine.",
            "Virtual Battery: A testing tool for power-aware software.",
            "Large scale wireless sensor networks with multi-level dynamic key management scheme.",
            "Automatic elimination of unnecessary packets for smart terminals in Wireless LAN environments.",
            "Smart camera architecture.",
            "Contribution to the design of a CMOS image sensor with low-complexity video compression for wireless sensor networks.",
            "Use of wavelet for image processing in smart cameras with low hardware resources.",
            "Scene-based non-uniformity correction: From algorithm to implementation on a smart camera.",
            "Towards commoditized smart-camera design.",
            "Video streaming applications in wireless camera networks: A change detection based approach targeted to 6LoWPAN.",
            "Efficient smart-camera accelerator: A configurable motion estimator dedicated to video codec.",
            "Efficient communication support in predictable heterogeneous MPSoC designs for streaming applications.",
            "Low power high-performance smart camera system based on SCAMP vision sensor.",
            "Single-lens low-disparity stereo using microlenses.",
            "A hierarchical vision processing architecture oriented to 3D integration of smart camera chips.",
            "Advanced smart vehicular communication system and applications.",
            "Design and implementation of a P2P communication infrastructure for WSN-based vehicular traffic control applications.",
            "A-GR: A novel geographical routing protocol for AANETs.",
            "File downloading oriented Roadside Units deployment for vehicular networks.",
            "Energy efficient path selection scheme for OFDMA-based two-hop cellular systems.",
            "HyBR: A Hybrid Bio-inspired Bee swarm Routing protocol for safety applications in Vehicular Ad hoc NETworks (VANETs).",
            "Learning automata-based virtual backoff algorithm for efficient medium access in vehicular ad hoc networks.",
            "Towards a content-centric approach to crowd-sensing in vehicular clouds.",
            "WEVAN - A mechanism for evidence creation and verification in VANETs.",
            "How to build vehicular ad-hoc networks on smartphones.",
            "An in-depth analysis on traffic flooding attacks detection and system using data mining techniques.",
            "Embedded Systems Software Architecture.",
            "A development and verification framework for the SegBus platform.",
            "A unified execution model for multiple computation models of streaming applications on a composable MPSoC.",
            "Dynamic distribution of robot control components under hard realtime constraints - Modeling, experimental results and practical considerations.",
            "Modeling and efficient solving of extra-functional properties for adaptation in networked embedded real-time systems.",
            "Multi-objective exploitation of pipeline parallelism using clustering, replication and duplication in embedded multi-core systems.",
            "A reference architecture for cooperative driving.",
            "Design space exploration of embedded systems: A view from diverse domains.",
            "Optimizing the implementation of real-time Simulink models onto distributed automotive architectures.",
            "Early-phase performance exploration of embedded systems with ABSOLUT framework.",
            "High-level power and performance estimation of FPGA-based soft processors and its application to design space exploration.",
            "Polychronous modeling, analysis, verification and simulation for timed software architectures.",
            "Design space exploration for high-level synthesis of multi-threaded applications.",
            "Exploring the design space of programmable regular expression matching accelerators.",
            "Design space exploration of thermal-aware many-core systems.",
            "Multi-layered scheduling of mixed-criticality cyber-physical systems.",
            "Adaptive GTS allocation in IEEE 802.15.4 for real-time wireless sensor networks.",
            "GABES: A genetic algorithm based environment for SEU testing in SRAM-FPGAs.",
            "A low-cost fault tolerant solution targeting commercial FPGA devices.",
            "Virtualizing ARM VFP (Vector Floating-Point) with Xen-ARM.",
            "System performance evaluation by combining RTC and VHDL simulation: A case study on NICs.",
            "Mode switch timing analysis for component-based multi-mode systems.",
            "Intelligent Adjustment Forwarding: A compromise between end-to-end and hop-by-hop transmissions in VANET environments.",
            "A shortest path adaptive routing technique for minimizing path collisions in hybrid optical network-on-chip.",
            "High performance NoC synthesis using analytical modeling and simulation with optimal power and minimal IC area.",
            "Energy and buffer aware application mapping for networks-on-chip with self similar traffic.",
            "Energy analysis and prediction for applications on smartphones.",
            "Epipe: A low-cost fault-tolerance technique considering WCET constraints.",
            "Measurement-based research on cryptographic algorithms for embedded real-time systems.",
            "Cache isolation for virtualization of mixed general-purpose and real-time systems.",
            "A real-time perspective of service composition: Key concepts and some contributions.",
            "Clustering scheduling for hardware tasks in reconfigurable computing systems."
        ]
    },
    {
        "name": "JSA",
        "year": "2012",
        "info": "Volume 58: 2012",
        "count": 34,
        "papers": [
            "Tokenisation and compression of Java class files.",
            "Register allocation for write activity minimization on non-volatile main memory for embedded systems.",
            "Run-time generation of partial FPGA configurations.",
            "Analysis and redesign of the 'TTC' and 'TTH' schedulers.",
            "Memory access schedule minimization for embedded systems.",
            "Memory power optimization of Java-based embedded systems exploiting garbage collection information.",
            "Hardware-assisted energy monitoring architecture for micro sensor nodes.",
            "ARC-H: Adaptive replacement cache management for heterogeneous storage devices.",
            "On the interfacing between QEMU and SystemC for virtual platform construction: Using DMA as a case.",
            "Instruction set architectural guidelines for embedded packet-processing engines.",
            "Network-on-Chip virtualization in Chip-Multiprocessor Systems.",
            "A dynamically reconfigurable communication architecture for multicore embedded systems.",
            "Reliability-aware core partitioning in chip multiprocessors.",
            "Special issue on Model Based Engineering for Embedded Systems Design.",
            "Expressing embedded systems configurations at high abstraction levels with UML MARTE profile: Advantages, limitations and alternatives.",
            "An aspect-oriented, model-driven approach to functional hardware verification.",
            "MARTE profile extension for modeling dynamic power management of embedded systems.",
            "An efficient method for record management in flash memory environment.",
            "Power- and time-aware buffer cache management for real-time embedded databases.",
            "Virtualization of reconfigurable coprocessors in HPRC systems with multicore architecture.",
            "Compositional real-time models.",
            "FPGA-based architecture for the real-time computation of 2-D convolution with large kernel size.",
            "An efficient model-based methodology for developing device-independent mobile applications.",
            "SINOF: A dynamic-static combined framework for dynamic binary translation.",
            "Harmless, a hardware architecture description language dedicated to real-time embedded system simulation.",
            "Retraction notice to ''Specification and Verification of Dynamic Evolution of Software Architectures\" [SYSARC 56 (10) (2010) 523-533].",
            "Exploring parallelization techniques based on OpenMP in H.264/AVC encoder for embedded multi-core processor.",
            "k-Nearest neighbor query processing algorithm for cloaking regions towards user privacy protection in location-based services.",
            "Tracing and recording interrupts in embedded software.",
            "On the fundamentals of leakage aware real-time DVS scheduling for peak temperature minimization.",
            "Perceptual control architecture for cyber-physical systems in traffic incident management.",
            "Adaptive response time control for metadata matching in information dissemination systems.",
            "Randomized execution algorithms for smart cards to resist power analysis attacks.",
            "Three-phase time-aware energy minimization with DVFS and unrolling for Chip Multiprocessors."
        ]
    },
    {
        "name": "JSA",
        "year": "2011",
        "info": "Volume 57: 2011",
        "count": 77,
        "papers": [
            "Special issue on: On-chip parallel and network-based systems.",
            "Hierarchical opto-electrical on-chip network for future multiprocessor architectures.",
            "Area and power-efficient innovative congestion-aware Network-on-Chip architecture.",
            "Modeling and evaluation of ring-based interconnects for Network-on-Chip.",
            "Investigation of transient fault effects in synchronous and asynchronous Network on Chip router.",
            "New heuristic algorithms for energy aware application mapping and routing on mesh-based NoCs.",
            "Customized computer-aided application mapping on NoC infrastructure using multi-objective optimization.",
            "Network-on-Chip interconnect for pairing-based cryptographic IP cores.",
            "A generic adaptive path-based routing method for MPSoCs.",
            "Efficient dynamic program monitoring on multi-core systems.",
            "Compiler-directed memory management for heterogeneous MPSoCs.",
            "An analytical network performance model for SIMD processor CSX600 interconnects.",
            "Transactional memories for multi-processor FPGA platforms.",
            "A design scheme for a reconfigurable accelerator implemented by single-flux quantum circuits.",
            "Dynamic and adaptive SPM management for a multi-task environment.",
            "A portable, efficient inter-core communication scheme for embedded multicore platforms.",
            "I2CSec: A secure serial Chip-to-Chip communication protocol.",
            "Architectures and optimization methods of flash memory based storage systems.",
            "Editorial.",
            "Secure service orchestration in open networks.",
            "Security services architecture for Secure Mobile Grid Systems.",
            "Efficient file fuzz testing using automated analysis of binary file format.",
            "Verifying security properties of internet protocol stacks: The split verification approach.",
            "Component-oriented verification of noninterference.",
            "Using complexity, coupling, and cohesion metrics as early indicators of vulnerabilities.",
            "Towards accuracy of role-based access control configurations in component-based systems.",
            "Saving register-file static power by monitoring instruction sequence in ROB.",
            "Real-time scheduling on heterogeneous system-on-chip architectures using an optimised artificial neural network.",
            "A comprehensive study of energy efficiency and performance of flash-based SSD.",
            "Modular software architecture for flexible reservation mechanisms on heterogeneous resources.",
            "Rapid functional modelling and simulation of coarse grained reconfigurable array architectures.",
            "P2PVR: A playback offset aware multicast tree for on-demand video streaming with VCR functions.",
            "An ASIC implementation of a low power robust invisible watermarking processor.",
            "The Policy Machine: A novel architecture and framework for access control policy specification and enforcement.",
            "Provenance security guarantee from origin up to now in the e-Science environment.",
            "Intrusion-tolerant fine-grained authorization for Internet applications.",
            "Dynamic cohesion measures for object-oriented software.",
            "Attestation of integrity of overlay networks.",
            "A study on the uncertainty inherent in class cohesion measurements.",
            "Multiprocessor real-time scheduling.",
            "Tests for global EDF schedulability analysis.",
            "Global EDF-based scheduling with laxity-driven priority promotion.",
            "Job vs. portioned partitioning for the earliest deadline first semi-partitioned scheduling.",
            "Schedulability analysis for non-preemptive fixed-priority multiprocessor scheduling.",
            "Thermal-aware global real-time scheduling and analysis on multicore systems.",
            "Exact schedulability tests for real-time scheduling of periodic tasks on unrelated multiprocessor platforms.",
            "Special issue: Design and optimization for embedded and real-time computing systems and applications.",
            "Platform synthesis and partitioning of real-time tasks for energy efficiency.",
            "Simultaneous thermal and timeliness guarantees in distributed real-time embedded systems.",
            "Supporting component-based failover units in middleware for distributed real-time and embedded systems.",
            "An efficient algorithm for parametric WCET calculation.",
            "Branch target buffers: WCET analysis framework and timing predictability.",
            "An overview of interrupt accounting techniques for multiprocessor real-time systems.",
            "A co-commitment based secure data collection scheme for tiered wireless sensor networks.",
            "Energy reduction for scheduling a set of multiple feasible interval jobs.",
            "Preface to the special issue on worst-case execution-time analysis.",
            "WCET analysis of instruction cache hierarchies.",
            "Improving the WCET computation in the presence of a lockable instruction cache in multitasking real-time systems.",
            "Cache-related preemption delay via useful cache blocks: Survey and redefinition.",
            "Identifying irreducible loops in the Instrumentation Point Graph.",
            "A three-tier middleware architecture supporting bidirectional location tracking of numerous mobile nodes under legacy WSN environment.",
            "A new approach to evaluating internal Xilinx FPGA resources.",
            "Fast placement and routing by extending coarse-grained reconfigurable arrays with Omega Networks.",
            "Fast and efficient FPGA implementation of connected operators.",
            "Temporal partitioning of data flow graph for dynamically reconfigurable architecture.",
            "Dynamic hinting: Collaborative real-time resource management for reactive embedded systems.",
            "Repetitive model refactoring strategy for the design space exploration of intensive signal processing applications.",
            "An efficient diversity-driven selective forwarding approach for replicated data queries in wireless sensor networks.",
            "Resource allocation robustness in multi-core embedded systems with inaccurate information.",
            "Slack computation for DVS algorithms in fixed-priority real-time systems using fluid slack analysis.",
            "Preface to the special issue on: Emerging Applications of Embedded Systems Research.",
            "Weapon classification and shooter localization using distributed multichannel acoustic sensors.",
            "Soft core based embedded systems in critical aerospace applications.",
            "Reliable and energy optimized WSN design for a train application.",
            "Wagyromag: Wireless sensor network for monitoring and processing human body movement in healthcare applications.",
            "Bringing pervasive embedded networks to the service cloud: A lightweight middleware approach.",
            "An energy-efficient delay reduction technique for supporting WLAN-based VoIP in SmartPhone."
        ]
    },
    {
        "name": "JSA",
        "year": "2010",
        "info": "Volume 56: 2010",
        "count": 59,
        "papers": [
            "On reducing load/store latencies of cache accesses.",
            "An analytical performance model for the Spidergon NoC with virtual channels.",
            "An architecture of a high-speed digital hologram generator based on FPGA.",
            "A coarse-grain reconfigurable architecture for multimedia applications supporting subword and floating-point calculations.",
            "A soft multi-core architecture for edge detection and data analysis of microarray images.",
            "Experimental evaluation of slack management in real-time control systems: Coordinated vs. self-triggered approach.",
            "Erratum to \"Access region cache with register guided memory reference partitioning\" [Journal of Systems Architecture 55 (2009) 434-445].",
            "A scalable organization for distributed directories.",
            "UML-based hardware/software co-design platform for dynamically partially reconfigurable network security systems.",
            "Multi-level reconfigurable architectures in the switch model.",
            "FPGA schemes for minimizing the power-throughput trade-off in executing the Advanced Encryption Standard algorithm.",
            "A Force-Directed Scheduling based architecture generation algorithm and design tool for FPGAs.",
            "Composition-based Cache simulation for structure reorganization.",
            "Improving cache locking performance of modern embedded systems via the addition of a miss table at the L2 cache level.",
            "A capacity sharing and stealing strategy for open real-time systems.",
            "Shifted gray encoding to reduce instruction memory address bus switching for low-power embedded systems.",
            "A reconfigurable platform for evaluating the performance of QoS networks.",
            "Buffer flush and address mapping scheme for flash memory solid-state disk.",
            "From systems to networks on chip: A promising research area in the Hardware/Software co-design.",
            "Combining mapping and partitioning exploration for NoC-based embedded systems.",
            "Communication-aware task assignment algorithm for MPSoC using shared memory.",
            "Communication-aware heuristics for run-time task mapping on NoC-based MPSoC platforms.",
            "EDXY - A low cost congestion-aware routing algorithm for network-on-chips.",
            "CA-MPSoC: An automated design flow for predictable multi-processor architectures for multiple applications.",
            "Scalable mpNoC for massively parallel systems - Design and implementation on FPGA.",
            "Reconfigurable Networks on Chip: DRNoC architecture.",
            "Recent advances in Hardware/Software co-design.",
            "Efficient architectures for 3D HWT using dynamic partial reconfiguration.",
            "Hardware/software co-design of a real-time kernel based tracking system.",
            "Towards real time implementation of reconstructive signal processing algorithms using systolic arrays coprocessors.",
            "Selecting profitable custom instructions for reconfigurable processors.",
            "Transition-aware DVS algorithm for real-time systems using tree structure analysis.",
            "Two versions of architectures for dynamic implied addressing mode.",
            "Hardware transactional memory: A high performance parallel programming model.",
            "Hardware/software support for adaptive work-stealing in on-chip multiprocessor.",
            "Open-architecture system based on a reconfigurable hardware-software multi-agent platform for CNC machines.",
            "Compressed tag architecture for low-power embedded cache systems.",
            "Exploiting address compression and heterogeneous interconnects for efficient message management in tiled CMPs.",
            "Multi-port abstraction layer for FPGA intensive memory exploitation applications.",
            "Quarter Load Threshold (QLT) flow control for wormhole switching in mesh-based Network-on-Chip.",
            "Online adaptive utilization control for real-time embedded multiprocessor systems.",
            "Finding the best compromise in compiling compound loops to Verilog.",
            "Embedded software debugging using virtual filesystem abstractions.",
            "CoDBT: A multi-source dynamic binary translator using hardware-software collaborative techniques.",
            "Implementing the new Ada 2005 timing event and execution time control features on the AVR32 architecture.",
            "Performance-asymmetry-aware scheduling for Chip Multiprocessors with static core coupling.",
            "Design flows and system architectures for adaptive computing on reconfigurable platforms.",
            "Model-based platform-specific co-design methodology for dynamically partially reconfigurable systems with hardware virtualization and preemption.",
            "Dynamically reconfigurable dataflow architecture for high-performance digital signal processing.",
            "Fine grain pipeline architecture for high performance phase-based optical flow computation.",
            "FPGA-implementation of atan(Y/X) based on logarithmic transformation and LUT-based techniques.",
            "High level modeling and automated generation of heterogeneous SoC architectures with optimized custom reconfigurable cores and on-chip communication media.",
            "NDE system for railway wheel inspection in a standard FPGA.",
            "Efficient task scheduling for runtime reconfigurable systems.",
            "Content-based image retrieval algorithm acceleration in a low-cost reconfigurable FPGA cluster.",
            "ComboFTL: Improving performance and lifespan of MLC flash memory using SLC flash buffer.",
            "Computing the correct Increment of Induction Pointers with application to loop unrolling.",
            "Gather/scatter hardware support for accelerating Fast Fourier Transform.",
            "Stack filter: Reducing L1 data cache power consumption."
        ]
    },
    {
        "name": "JSA",
        "year": "2009",
        "info": "Volume 55: 2009",
        "count": 45,
        "papers": [
            "Rapid design of area-efficient custom instructions for reconfigurable embedded processing.",
            "Improving energy efficiency for flash memory based embedded applications.",
            "Protocol offload analysis by simulation.",
            "A comparative evaluation of hybrid distributed shared-memory systems.",
            "Exploiting an abstract-machine-based framework in the design of a Java ILP processor.",
            "IP Routing table compaction and sampling schemes to enhance TCAM cache performance.",
            "Multicast communication in wormhole-routed 2D torus networks with hamiltonian cycle model.",
            "Using age registers for a simple load-store queue filtering.",
            "Power saving and fault-tolerance in real-time critical embedded systems.",
            "Dependability assessment of by-wire control systems using fault injection.",
            "An embedded implementation of the Common Language Infrastructure.",
            "A framework for low energy data management in reconfigurable multi-context architectures.",
            "Conditional diagnosability of hypercubes under the comparison diagnosis model.",
            "Guest Editor's introduction.",
            "Implementation and evaluation of a microthread architecture.",
            "An implementation of the SANE Virtual Processor using POSIX threads.",
            "Coordinated management of hardware and software self-adaptivity.",
            "Applying inherent capabilities of quantum-dot cellular automata to design: D flip-flop case study.",
            "Exploiting selective instruction reuse and value prediction in a superscalar architecture.",
            "Broadcast filtering: Snoop energy reduction in shared bus-based low-power MPSoCs.",
            "Editorial.",
            "Model-driven business process security requirement specification.",
            "Security architecture for virtual organizations of business web services.",
            "Secure web services using two-way authentication and three-party key establishment for service delivery.",
            "Landscape-aware location-privacy protection in location-based services.",
            "Qualitative trust modeling in SOA.",
            "Enforcing role based access control model with multimedia signatures.",
            "A security policy framework for context-aware and user preferences in e-services.",
            "Towards the homogeneous access and use of PKI solutions: Design and implementation of a WS-XKMS server.",
            "An architectural co-synthesis algorithm for energy-aware Network-on-Chip design.",
            "FPGA/DSP-based implementation of a high-performance multi-channel counter.",
            "Dual-Mode Execution Environment for active network.",
            "A survey of Flash Translation Layer.",
            "Reducing message-length variations in resource-constrained embedded systems implemented using the Controller Area Network (CAN) protocol.",
            "An efficient signed digit montgomery multiplication for RSA.",
            "Computation and communication schedule optimization for data-sharing tasks on uniprocessor.",
            "Quantitative analysis of packet-processing applications regarding architectural guidelines for network-processing-engine development.",
            "Evaluating the energy consumption and the silicon area of on-chip interconnect architectures.",
            "Maintaining constraints of UML models in distributed collaborative environments.",
            "A platform-based design framework for joint SW/HW multiprocessor systems design.",
            "Analysis of network processing workloads.",
            "Access region cache with register guided memory reference partitioning.",
            "Reusability-aware cache memory sharing for chip multiprocessors with private L2 caches.",
            "Accurate and efficient processor performance prediction via regression tree based modeling.",
            "A secure digital camera architecture for integrated real-time digital rights management."
        ]
    },
    {
        "name": "JSA",
        "year": "2008",
        "info": "Volume 54: 2008",
        "count": 93,
        "papers": [
            "TSB: A DVS algorithm with quick response for general purpose operating systems.",
            "Formal verification of ASMs using MDGs.",
            "Processor array architectures for flexible approximate string matching.",
            "A novel caching mechanism for peer-to-peer based media-on-demand streaming.",
            "RISC: A resilient interconnection network for scalable cluster storage systems.",
            "Nash equilibria in bandwidth allocation for non-cooperative peer-to-peer networks.",
            "Pipelined circuit switching: Analysis for the torus with non-uniform traffic.",
            "Optimal load distribution in nondedicated heterogeneous cluster and grid computing environments.",
            "Analyzing concurrency in streaming applications.",
            "A new architecture for efficient hybrid representation of terrains.",
            "A small data cache for multimedia-oriented embedded systems.",
            "Configurable folded array for FIR filtering.",
            "Architectural designs for a scalable reconfigurable IP router.",
            "Applying neural networks to performance estimation of embedded software.",
            "Combinatorial performance modelling of toroidal cubes.",
            "Design of a hardware accelerator for path planning on the Euclidean distance transform.",
            "A Java processor architecture for embedded real-time systems.",
            "System level design of telecom systems using formal model refinement: Applying the B method/language in practice.",
            "Improving stability for peer-to-peer multicast overlays by active measurements.",
            "DS2IS: Dictionary-based segmented inversion scheme for low power dynamic bus design.",
            "A request distribution method for clustered VOD servers considering buffer sharing effects.",
            "Editorial.",
            "Quality-driven model-based architecture synthesis for real-time embedded SoCs.",
            "Analyzing composability of applications on MPSoC platforms.",
            "Designing efficient irregular networks for heterogeneous systems-on-chip.",
            "A monitoring-aware network-on-chip design flow.",
            "Resource-efficient routing and scheduling of time-constrained streaming communication on networks-on-chip.",
            "Deadlock free routing algorithms for irregular mesh topology NoC systems with rectangular regions.",
            "Energy reduction through crosstalk avoidance coding in networks on chip.",
            "Dependable design technique for system-on-chip.",
            "Mixed hierarchical-functional fault models for targeting sequential cores.",
            "Speedups from extending embedded processors with a high-performance coarse-grained reconfigurable data-path.",
            "A versatile timing unit for traffic shaping, policing and charging in packet-switched networks.",
            "Using supplier locality in power-aware interconnects and caches in chip multiprocessors.",
            "Task scheduling in multiprocessing systems using duplication.",
            "A multilevel partitioning approach for efficient tasks allocation in heterogeneous distributed systems.",
            "Editorial.",
            "Model-typed component interfaces.",
            "Architecting reconfigurable component-based operating systems.",
            "A product management challenge: Creating software product value through requirements selection.",
            "A model for service-oriented communication systems.",
            "Authentication in stealth distributed hash tables.",
            "A methodology to design arbitrary failure detectors for distributed protocols.",
            "High-performance computing of I for a vector of inputs x.",
            "Evaluation and optimization of a peer-to-peer video-on-demand system.",
            "A proposal for managing ASI fabrics.",
            "A quantitative analysis of the .NET common language runtime.",
            "Optimized reversible binary-coded decimal adders.",
            "A predecoding technique for ILP exploitation in Java processors.",
            "Cost-driven repair optimization of reconfigurable nanowire crossbar systems with clustered defects.",
            "Enhanced-functionality multipliers.",
            "A unified fault-tolerant routing scheme for a class of cluster networks.",
            "A software defined approach for common baseband processing.",
            "Exploring the performance impact of stripe size on network attached storage systems.",
            "On the effectiveness of phase based regression models to trade power and performance using dynamic processor adaptation.",
            "Memory hierarchy performance measurement of commercial dual-core desktop processors.",
            "A BCD-based architecture for fast coordinate rotation.",
            "Parallel, distributed and network-based processing.",
            "A business process monitor for a mobile phone recharging system.",
            "Simulation-based development of Peer-to-Peer systems with the RealPeer methodology and framework.",
            "Failure-tolerant distributed storage with compressed (1 out-of N.",
            "Securing skeletal systems with limited performance penalty: The muskel.",
            "An agent based platform for task distribution in virtual environments.",
            "Activity pre-scheduling for run-time optimization of grid workflows.",
            "FPGA implementation of high performance elliptic curve cryptographic processor over GF.",
            "Design and implementation of a vehicle interface protocol using an IEEE 1394 network.",
            "Optimum RNS sign detection algorithm using MRC-II with special moduli set.",
            "TTPM - An efficient deadlock-free algorithm for multicast communication in 2D torus networks.",
            "An efficient architecture for designing reverse converters based on a general three-moduli set.",
            "PORCE: An efficient power off recovery scheme for flash memory.",
            "Execution coordination in mobile agent-based distributed job workflow execution.",
            "Modular array structure for non-restoring square root circuit.",
            "Some topological and combinatorial properties of WK-recursive mesh and WK-pyramid interconnection networks.",
            "Synthesis of quaternary reversible/quantum comparators.",
            "A novel hardware-oriented Kohonen SOM image compression algorithm and its FPGA implementation.",
            "COMPASS - A tool for evaluation of compression strategies for embedded processors.",
            "A unified architecture for a public key cryptographic coprocessor.",
            "Editorial.",
            "OpenMP-based parallelization on an MPCore multiprocessor platform - A performance and power analysis.",
            "Exploration methodology of dynamic data structures in multimedia and network applications for embedded platforms.",
            "Efficiency measures for SOC concepts.",
            "Improving evolutionary exploration to area-time optimization of FPGA designs.",
            "Resource conflict detection in simulation of function unit pipelines.",
            "Secure communication in microcomputer bus systems for embedded devices.",
            "FPGA implementations of elliptic curve cryptography and Tate pairing over a binary field.",
            "DLL-conscious instruction fetch optimization for SMT processors.",
            "A low-complexity microprocessor design with speculative pre-execution.",
            "A recursive method for synthesizing quantum/reversible quaternary parallel adder/subtractor with look-ahead carry.",
            "An area-efficient VLSI implementation for programmable FIR filters based on a parameterized divide and conquer approach.",
            "Dual-mode floating-point adder architectures.",
            "Design space exploration of an open-source, IP-reusable, scalable floating-point engine for embedded applications.",
            "Optimizing CAM-based instruction cache designs for low-power embedded systems.",
            "Unicast-based fault-tolerant multicasting in wormhole-routed hypercubes."
        ]
    },
    {
        "name": "JSA",
        "year": "2007",
        "info": "Volume 53: 2007",
        "count": 73,
        "papers": [
            "Trace-based leakage energy optimisations at link time.",
            "Fault tolerant Web Services.",
            "Resource consumption-aware QoS in cluster-based VOD servers.",
            "An efficient variable partitioning approach for functional decomposition of circuits.",
            "Embedded cryptographic hardware.",
            "High-speed hardware implementations of Elliptic Curve Cryptography: A survey.",
            "Hardware acceleration of the Tate pairing on a genus 2 hyperelliptic curve.",
            "Fast hardware for modular exponentiation with efficient exponent pre-processing.",
            "Efficient parallel multiplier in shifted polynomial basis.",
            "Scalable hardware implementing high-radix Montgomery multiplication algorithm.",
            "Multi-mode operator for SHA-2 hash functions.",
            "Robust codes and robust, fault-tolerant architectures of the Advanced Encryption Standard.",
            "The SegBus platform - architecture and communication mechanisms.",
            "A comparison of two policies for issuing instructions speculatively.",
            "Efficient FPGA hardware development: A multi-language approach.",
            "An efficient immersion-based watershed transform method and its prototype architecture.",
            "Highly fault-tolerant cycle embeddings of hypercubes.",
            "Hardware support for adaptive tessellation of Bézier surfaces based on local tests.",
            "Editorial.",
            "Asynchronous arbiter for micro-threaded chip multiprocessors.",
            "Supporting multiple-input, multiple-output custom functions in configurable processors.",
            "A consistency-free memory architecture for sort-last parallel rendering processors.",
            "Resource efficiency of the GigaNetIC chip multiprocessor architecture.",
            "Efficient control generation for mapping nested loop programs onto processor arrays.",
            "A system architecture for high-speed deep packet inspection in signature-based network intrusion prevention.",
            "High-speed, low-leakage integrated circuits: An evolutionary algorithm perspective.",
            "Energy consumption analysis for two embedded Java virtual machines.",
            "Genetic algorithms for hardware-software partitioning and optimal resource allocation.",
            "A low-cost strategy to provide full QoS support in Advanced Switching networks.",
            "Efficient FPGA implementation of DWT and modified SPIHT for lossless image compression.",
            "Efficient automatic gain control algorithm and architecture for wireless LAN receivers.",
            "Hardware-oriented ant colony optimization.",
            "Effectiveness of caching in a distributed digital library system.",
            "Systematic methodology for exploration of performance - Energy trade-offs in network applications using Dynamic Data Type refinement.",
            "Achieving multipoint-to-multipoint fairness with RCNWA.",
            "Quantum ternary parallel adder/subtractor with partially-look-ahead carry.",
            "Editorial.",
            "Application of deterministic and stochastic Petri-Nets for performance modeling of NoC architectures.",
            "Benchmarking mesh and hierarchical bus networks in system-on-chip context.",
            "Exploiting program phase behavior for energy reduction on multi-configuration processors.",
            "Ultra fast cycle-accurate compiled emulation of inorder pipelined architectures.",
            "Rapid implementation and optimisation of DSP systems on FPGA-centric heterogeneous platforms.",
            "A scalable embedded JPEG 2000 architecture.",
            "Optimizing data structures at the modeling level in embedded multimedia.",
            "Designing layout-timing independent quantum-dot cellular automata (QCA) circuits by global asynchrony.",
            "Low power data processing system with self-reconfigurable architecture.",
            "A new Mixed Radix Conversion algorithm MRC-II.",
            "Speculative trivialization point advancing in high-performance processors.",
            "Real-time shape description system based on MPEG-7 descriptors.",
            "A heuristic fault-tolerant routing algorithm in mesh using rectilinear-monotone polygonal fault blocks.",
            "Tornado: A self-reconfiguration control system for core-based multiprocessor CSoPCs.",
            "A multi-channel architecture for high-performance NAND flash-based storage system.",
            "Multiprogrammed non-blocking checkpoints in support of optimistic simulation on myrinet clusters.",
            "Editorial.",
            "Effects of program compression.",
            "Hybrid functional- and instruction-level power modeling for embedded and heterogeneous processor architectures.",
            "Simulated and measured performance evaluation of RISC-based SoC platforms in network processing applications.",
            "Exploration of distributed shared memory architectures for NoC-based multiprocessors.",
            "Efficient design space exploration for application specific systems-on-a-chip.",
            "Design space exploration of reliable networked embedded systems.",
            "Chip size estimation for SOC design space exploration.",
            "FLUX interconnection networks on demand.",
            "Automated memory-aware application distribution for Multi-processor System-on-Chips.",
            "Optimization decomposition approach for layered QoS scheduling in grid computing.",
            "Efficient segment-based video transcoding proxy for mobile multimedia services.",
            "Accumulator-based pseudo-exhaustive two-pattern generation.",
            "Static scheduling techniques for dependent tasks on dynamically reconfigurable devices.",
            "Test data compression scheme based on variable-to-fixed-plus-variable-length coding.",
            "STAFF: A flash driver algorithm minimizing block erasures.",
            "Enhanced fault tolerant routing algorithms using a concept of \"balanced ring\".",
            "Dual actuator logging disk architecture and modeling.",
            "Feasibility of decoupling memory management from the execution pipeline.",
            "A platform-based SoC design and implementation of scalable automaton matching for deep packet inspection."
        ]
    },
    {
        "name": "JSA",
        "year": "2006",
        "info": "Volume 52: 2006",
        "count": 58,
        "papers": [
            "A core generator for arithmetic cores and testing structures with a network interface.",
            "Memory latency consideration for load sharing on heterogeneous network of workstations.",
            "Replacing media caches in streaming proxy servers.",
            "Intelligent memory manager: Reducing cache pollution due to memory management functions.",
            "Performance analysis of multistage interconnection networks with a new high-level net model.",
            "Parallel, distributed and network-based processing.",
            "An abstraction model for a Grid execution framework.",
            "Scheduling tasks sharing files on heterogeneous master-slave platforms.",
            "The master-slave paradigm on heterogeneous systems: A dynamic programming approach for the optimal mapping.",
            "RDMA control support for fine-grain parallel computations.",
            "Optimizing bus energy consumption of on-chip multiprocessors using frequent values.",
            "Improved composite confidence mechanisms for a perceptron branch predictor.",
            "Circulating shared-registers for multiprocessor systems.",
            "On-line evolvable fuzzy system for ATM cell-scheduling.",
            "Class-based request control system in multimedia contents service.",
            "Pattern-driven prefetching for multimedia applications on embedded processors.",
            "Dynamic feature selection for hardware prediction.",
            "The algorithm of pipelined gossiping.",
            "Software-based self-testing of microprocessors.",
            "Design of a compact reversible binary coded decimal adder circuit.",
            "The design and utility of the ML-RSIM system simulator.",
            "An optimal message routing algorithm for circulant networks.",
            "A power-efficient TCAM architecture for network forwarding tables.",
            "MEMPHIS: A mobile agent-based system for enabling acquisition of multilingual content and providing flexible format internet premium services.",
            "High-frequency pulse width modulation implementation using FPGA and CPLD ICs.",
            "High-performance adaptive routing for networks with arbitrary topology.",
            "Random early detection with flow number estimation and queue length feedback control.",
            "Deferred locking with shadow transaction for client-server DBMSs.",
            "Analytical modeling of codes with arbitrary data-dependent conditional structures.",
            "Speedup of NULL convention digital circuits using NULL cycle reduction.",
            "An analytical model for hypercubes in the presence of multiple time-scale bursty traffic.",
            "Distributed computing using Java: A comparison of two server designs.",
            "Special issue on nature-inspired applications and systems.",
            "Case studies for self-organization in computer science.",
            "A comprehensive review of nature inspired routing algorithms for fixed telecommunication networks.",
            "ANSI: A swarm intelligence-based unicast routing protocol for hybrid ad hoc networks.",
            "A flocking based algorithm for document clustering analysis.",
            "Evolving classifiers on field programmable gate arrays: Migrating XCS to FPGAs.",
            "Bidirectional liveness analysis, or how less than half of the Alpha's registers are used.",
            "Dual-mode floating-point multiplier architectures with parallel operations.",
            "A schema version model for complex objects in object-oriented databases.",
            "An XML data allocation method on disks.",
            "A scalable VLSI speed/area tunable sorting network.",
            "Dynamic reuse of subroutine results.",
            "Preface.",
            "Modeling and simulation of open source development using an agile practice.",
            "Integrating XP project management in development environments.",
            "FMESP: Framework for the modeling and evaluation of software processes.",
            "Ontology-based multi-site software development methodology and tools.",
            "Motivations and measurements in an agile case study.",
            "A non-invasive approach to product metrics collection.",
            "Managing non-invasive measurement tools.",
            "Discovering the software process by means of stochastic workflow analysis.",
            "Using a role scheme to derive software project metrics.",
            "Quantitative logic-based framework for agile methodologies.",
            "Support for partial run-time reconfiguration of platform FPGAs.",
            "Evaluating the reliability of computational grids from the end user's point of view.",
            "Decentralized media streaming infrastructure (DeMSI): An adaptive and high-performance peer-to-peer content delivery network."
        ]
    },
    {
        "name": "JSA",
        "year": "2005",
        "info": "Volume 51: 2005",
        "count": 43,
        "papers": [
            "Hierarchical star: a new two level interconnection network.",
            "Architecture optimization for multimedia application exploiting data and thread-level parallelism.",
            "An FPGA-based coprocessor for real-time fieldbus traffic scheduling - architecture and implementation.",
            "A novel min-process checkpointing scheme for mobile computing systems.",
            "The impact of x86 instruction set architecture on superscalar processing.",
            "A new distributed storage scheme for cluster video server.",
            "Dual and multiple token based approaches for load balancing.",
            "A new NAND-type flash memory package with smart buffer system for spatial and temporal localities.",
            "CORBA-based distributed and replicated resource repository architecture for hierarchically configurable home network.",
            "Optimal broadcasting on incomplete star graph interconnection networks.",
            "Instruction level redundant number computations for fast data intensive processing in asynchronous processors.",
            "Multicast communication in wormhole-routed symmetric networks with hamiltonian cycle model.",
            "A generalized fault-tolerant sorting algorithm on a product network.",
            "More on rearrangeability of combined (2n.",
            "Generating cache hints for improved program efficiency.",
            "Evaluating IA-32 web servers through simics: a practical experience.",
            "On-chip short-time interval measurement system for high-speed signal timing characterization.",
            "Comments on \"Sign detection in residue arithmetic units\" [Journal of Systems Architecture 45 (1998) 251-258].",
            "Generalized parallel divide and conquer on 3D mesh and torus.",
            "High-performance architecture for anisotropic filtering.",
            "Profiling soft-core processor applications for hardware/software partitioning.",
            "Run-time analysis of time-critical systems.",
            "Reconfigurable embedded systems: Synthesis, design and application.",
            "A configurable system-on-chip architecture for embedded and real-time applications: concepts, design and realization.",
            "Distance-aware L2 cache organizations for scalable multiprocessor systems.",
            "Multiple voltage and frequency scheduling for power minimization.",
            "Novel source-independent characterization methodology for embedded software energy estimation and optimization.",
            "Information-driven circuit synthesis with the pre-characterized gate libraries.",
            "An application of functional decomposition in ROM-based FSM implementation in FPGA devices.",
            "Design and FPGA implementation of an MPEG based video scalar with reduced on-chip memory utilization.",
            "Exploring the performance of split data cache schemes on superscalar processors and symmetric multiprocessors.",
            "A pipeline architecture for computing the Euler number of a binary image.",
            "Functional test generation based on word-level SAT.",
            "Optimal sample length for efficient cache simulation.",
            "A slot swapping protocol for time-critical internetworking.",
            "Equation-based TCP-friendly congestion control under lossy environment.",
            "Switch fabric design for high performance IP routers: A survey.",
            "Implementation and performance study of a hardware-VIA-based network adapter on Gigabit Ethernet.",
            "A plane-based broadcast algorithm for multicomputer networks.",
            "Dynamic voltage scaling techniques for power efficient video decoding.",
            "A low energy cache design for multimedia applications exploiting set access locality.",
            "Time-constrained scheduling of large pipelined datapaths.",
            "Heterogeneous system level co-simulation for the design of telecommunication systems."
        ]
    },
    {
        "name": "JSA",
        "year": "2004",
        "info": "Volume 50: 2004",
        "count": 48,
        "papers": [
            "SAGE: an automatic analyzing system for a new high-performance SoC architecture--processor-in-memory.",
            "Reducing disk I/O times using anticipatory movements of the disk head.",
            "Switch fabric architecture analysis for a scalable bi-directionally reconfigurable IP router.",
            "Special issue on networks on chip.",
            "Interconnect intellectual property for Network-on-Chip (NoC).",
            "Packetization and routing analysis of on-chip multiprocessor networks.",
            "QNoC: QoS architecture and design process for network on chip.",
            "OCCN: a NoC modeling framework for design exploration.",
            "A multiple disk failure recovery scheme in RAID systems.",
            "Task migration in n-dimensional wormhole-routed mesh multicomputers.",
            "Multi-mesh of trees with its parallel algorithms.",
            "On the development of a communication-aware task mapping technique.",
            "Optimal all-ports collective communication algorithms for the k-ary n-cube interconnection networks.",
            "Guest editorial.",
            "Efficient analysis of single event transients.",
            "Matrix-based software test data decompression for systems-on-a-chip.",
            "Fast and energy-frugal deterministic test through efficient compression and compaction techniques.",
            "A novel FPGA local interconnect test scheme and automatic TC derivation/generation.",
            "Balanced dual-stage repair for dependable embedded memory cores.",
            "IDDQ data analysis using neighbor current ratios.",
            "Socket-based RR scheduling scheme for tightly coupled clusters providing single-name images.",
            "Developing a reusable workflow engine.",
            "On the performance analysis of ABR in ATM LANs with Stochastic Petri Nets.",
            "Performance evaluation of a Windows NT based PC cluster for high performance computing.",
            "Adaptable system/software architectures.",
            "Relating evolving business rules to software design.",
            "Assessing systems adaptability to a product family.",
            "Measures for mobile users: an architecture.",
            "A Software System evolutionary and adaptive framework: application to Agent-based systems.",
            "A model of runtime transformation for distributed systems based on directed acyclic graph model.",
            "Generative and incremental implementation for a scripting interface.",
            "General decomposition of incompletely specified sequential machines with multi-state behavior realization.",
            "Implementing a replicated service with group communication.",
            "The use of economic agents under price driven mechanism in grid resource management.",
            "A comparative evaluation of hardware-only and software-only directory protocols in shared-memory multiprocessors.",
            "On the performance of multicomputer interconnection networks.",
            "Multi-node broadcasting in all-ported 3-D wormhole-routed torus using an aggregation-then-distribution strategy.",
            "Replication algorithms for the World-Wide Web.",
            "Efficiently tolerating failures in asynchronous real-time distributed systems.",
            "Stabilizing ring clustering.",
            "A parallel algorithm for constructing reduced visibility graph and its FPGA implementation.",
            "Software environment for integrating critical real-time control systems.",
            "Using a serial cache for energy efficient instruction fetching.",
            "A clocking technique for FPGA pipelined designs.",
            "Optical transpose k-ary n-cube networks.",
            "A tamper resistant hardware accelerator for RSA cryptographic applications.",
            "Exploitation of parallelism to nested loops with dependence cycles.",
            "Design of an efficient VLSI architecture for non-linear spatial warping of wide-angle camera images."
        ]
    },
    {
        "name": "JSA",
        "year": "2003",
        "info": "Volume 49: 2003",
        "count": 45,
        "papers": [
            "Fault-tolerance of Complete Josephus Cubes.",
            "An improved reconfiguration algorithm for degradable VLSI/WSI arrays.",
            "Multiple-path execution for chip multiprocessors.",
            "Residue number system to binary converter for the moduli set (2n-1, 2n-1, 2n+1).",
            "Erratum to \"Bandwidth constrained smoothing for multimedia streaming with scheduling support\" [Journal of Systems Architecture 48 (2003) 353-366].",
            "Parallel, distributed and network-based processing.",
            "Optimization techniques for parallel irregular reductions.",
            "Motion-compensated wavelet packet zerotree video coding on multicomputers.",
            "Efficient implementation of reduce-scatter in MPI.",
            "Incorporating memory layout in the modeling of message passing programs.",
            "Special-issue on reconfigurable systems.",
            "Configware and morphware going mainstream.",
            "Polymorphous fabric-based systems: Model, tools, applications.",
            "Realization of wireless multimedia communication systems on reconfigurable platforms.",
            "Functionally partitioned module-based programmable architecture for wireless base-band processing.",
            "Performance of reconfigurable architectures for image-processing applications.",
            "The design and implementation of a reconfigurable processor for problems of combinatorial computation.",
            "Fast and compact sequential circuits for the FPGA-based reconfigurable systems.",
            "Effective and efficient FPGA synthesis through general functional decomposition.",
            "Run-time support for dynamically reconfigurable computing systems.",
            "Evaluation of delay fault testability of LUTs for the enhancement of application-dependent testing of FPGAs.",
            "An optical switching architecture for hierarchical group communication.",
            "Use of embedded DRAMs in video and image computing.",
            "A VLSI architecture for video object motion estimation using a novel 2-D hierarchical mesh.",
            "On the weakest failure detector for hard agreement problems.",
            "A new cryptography system and its VLSI realization.",
            "A multi-queue TCP window control scheme with dynamic buffer allocation.",
            "Fast reconfigurable systolic hardware for modular multiplication and exponentiation.",
            "Evolutions in parallel distributed and network-based processing.",
            "HPC the easy way: new technologies for high performance application development and deployment.",
            "Automatic performance analysis of hybrid MPI/OpenMP applications.",
            "Supporting adaptive routing in IBA switches.",
            "Architectural concerns in distributed and mobile collaborative systems.",
            "Video transmission adaptation on mobile devices.",
            "Preface.",
            "Global approach to assignment and scheduling of complex behaviors based on HCDG and constraint programming.",
            "Allocation of multiple precision behaviors for maximal bit level reuse of hardware resources.",
            "Recursive bi-partitioning of netlists for large number of partitions.",
            "Theoretical comparison between sequential redundancy addition and removal and retiming optimization techniques.",
            "Analysis of the impact of different methods for division/square root computation in the performance of a superscalar microprocessor.",
            "Two-level branch prediction using neural networks.",
            "Modeling and formal verification of embedded systems based on a Petri net representation.",
            "Implementation of a streaming execution unit.",
            "A scalable single-chip multi-processor architecture with on-chip RTOS kernel.",
            "A flexible architecture for H.263 video coding."
        ]
    },
    {
        "name": "JSA",
        "year": "2003",
        "info": "Volume 48: 2003",
        "count": 28,
        "papers": [
            "An analytical POC stack operations folding for continuous and discontinuous Java bytecodes.",
            "Virtual prototyping of PLC-based embedded system using object model of target and behavior model by converting RLL-to-statechart directly.",
            "Hypermeshes: implementation and performance.",
            "Interface synthesis between software chip model and target board.",
            "Design and analysis of static memory management policies for CC-NUMA multiprocessors.",
            "Building a dependable system from a legacy application with CORBA.",
            "Genetic engineering versus natural evolution: Genetic algorithms with deterministic operators.",
            "A fast and accurate delay dependent method for switching estimation of large combinational circuits.",
            "On the design of low power BIST for multipliers with Booth encoding and Wallace tree summation.",
            "Increasing hardware data prefetching performance using the second-level cache.",
            "Scheduling expression trees for delayed-load architectures.",
            "Scheduling length for switching element disjoint multicasting in Banyan-type switching networks.",
            "Methods for distributed unicast in hypercubes.",
            "Quantifying behavioral differences between multimedia and general-purpose workloads.",
            "PET, a software monitoring toolkit for performance analysis of parallel embedded applications.",
            "Secure checkpointing.",
            "Efficient communication sets generation for block-cyclic distribution on distributed-memory machines.",
            "Clustering and reassignment-based mapping strategy for message-passing architectures.",
            "New design methodology with efficient prediction of quality metrics for logic level design towards dynamic reconfigurable logic.",
            "Permutation routing in optical MIN with minimum number of stages.",
            "On the topological properties of the arrangement-star network.",
            "A VLSI architecture for 3-D self-organizing map based color quantization and its FPGA implementation.",
            "Bandwidth constrained smoothing for multimedia streaming with scheduling support.",
            "Approximate prefix coding for system-on-a-chip programs.",
            "Modeling and evaluating the time overhead induced by BER in COMA multiprocessors.",
            "Permutation routing in double-loop networks: design and empirical evaluation.",
            "High-level algorithmic complexity evaluation for system design.",
            "Highly accurate and efficient evaluation of randomising set index functions."
        ]
    },
    {
        "name": "JSA",
        "year": "2001",
        "info": "Volume 47: 2001/2002",
        "count": 72,
        "papers": [
            "High-level co-simulation based on the extension of processor simulators.",
            "Symbolic two-dimensional minimization of strongly unspecified finite state machines.",
            "Labeled rough partitions - a new general purpose representation for multiple-valued functions and relations.",
            "Secure communication protocols with discrete nonlinear chaotic maps.",
            "Congestion-free embedding of 2(n-k) spanning trees in an arrangement graph.",
            "Interfaces for mixed-level simulation with sequential elements.",
            "The architecture of a Gaussian mixture Bayes (GMB) robot position estimation system.",
            "Self-repairable GALs.",
            "Functional decomposition with an efficient input support selection for sub-functions based on information relationship measures.",
            "Validation of Patient Headache Care Education System (PHCES) using a software reuse reference model.",
            "Reachability analysis of large circuits using disjunctive partitioning and partial iterative squaring.",
            "Using fundamental electrical theory for varying time quantum uni-processor scheduling.",
            "Conversations with fixed and potential participants.",
            "Modern methods and tools in digital system design.",
            "Quality-driven design in the system-on-a-chip era: Why and how?",
            "Grammar-based design of embedded systems.",
            "Constraints-driven design space exploration for distributed embedded systems.",
            "V-SAT: A visual specification and analysis tool for system-on-chip exploration.",
            "Kernel scheduling techniques for efficient solution space exploration in reconfigurable computing.",
            "High-level synthesis using hierarchical conditional dependency graphs in the CODESIS system.",
            "An integrated system for developing regular array designs.",
            "Execution cost interval refinement in static software analysis.",
            "Design-for-testability to achieve complete coverage of delay faults in standard full scan circuits.",
            "POPS: A tool for delay/power performance optimization.",
            "Theory and application of non-group cellular automata for message authentication.",
            "Fundamental principles of modeling timing in hardware description languages.",
            "Specification-based program slicing and its applications.",
            "Gray code clustering of wireless data for partial match queries.",
            "Analysing value substitution and confidence estimation for value prediction.",
            "Baldwinian learning utilizing genetic and heuristic algorithms for logic synthesis and minimization of incompletely specified data with Generalized Reed-Muller (AND-EXOR) forms.",
            "Strategies for solving the Boolean satisfiability problem using binary decision diagrams.",
            "Efficient local memory sequence generation for data parallel programs using permutations.",
            "Efficient parallel timing simulation of synchronous models on networks of workstations.",
            "Buffer management control in data transport network node.",
            "Embedding of complete binary tree with 2-expansion in a faulty Flexible Hypercube.",
            "Maximizing reliability of distributed computing system with task allocation using simple genetic algorithm.",
            "Special issue on Evolutionary computing.",
            "Scalable architecture for parallel distributed implementation of genetic programming on network of workstations.",
            "Coevolving functions in genetic programming.",
            "System identification using evolutionary Markov chain Monte Carlo.",
            "Conditions for the convergence of evolutionary algorithms.",
            "Evolving good hierarchical decompositions of complex systems.",
            "Hybrid evolutionary motion planning using follow boundary repair for mobile robots.",
            "Learning feed-forward and recurrent fuzzy systems: A genetic approach.",
            "Autotuning a PID controller: A fuzzy-genetic approach.",
            "Host-diagnosis algorithms for parallel systems.",
            "A robust stack folding approach for Java processors: an operand extraction-based algorithm.",
            "Adding static data dependence collapsing to a high-performance instruction scheduler.",
            "Modelling adaptive routing in circuit switched networks.",
            "Segmenting endoscopic images using adaptive progressive thresholding: a hardware perspective.",
            "An adaptive approach to achieving hardware and software fault tolerance in a distributed computing environment.",
            "Unsafety vectors: a new fault-tolerant routing for the binary n-cube.",
            "On the merits of hypermeshes and tori with adaptive routing.",
            "A PCI bus simulation framework and some simulation results on PCI standard 2.1 latency limitations.",
            "Behavioral test generation for the selection of BIST logic.",
            "Studies of the SEMATECH IDDq test data.",
            "A prototype of a VHDL-based fault injection tool: description and application.",
            "A new approach for critical area estimation in VLSI.",
            "Quality-effective repair of multichip module systems.",
            "A fault tolerant multistage interconnection network with partly duplicated switches.",
            "Folded-crossed hypercube: a complete interconnection network.",
            "Studies on striping and buffer caching issues for the software RAID file system.",
            "A novel three-level architecture for large data warehouses.",
            "A global approach to improve conditional hardware reuse in high-level synthesis.",
            "NULL convention multiply and accumulate unit with conditional rounding, scaling, and saturation.",
            "Dual-tree-based multicasting on wormhole-routed irregular switch-based networks.",
            "Architectural differences of efficient sequential and parallel computers.",
            "Reconfigurable models of finite state machines and their implementation in FPGAs.",
            "A banked-promotion translation lookaside buffer system.",
            "Fast modular exponentiation of large numbers with large exponents.",
            "Configurable parallel memory architecture for multimedia computers.",
            "Demand-driven logic simulation using a network of loosely coupled processors."
        ]
    },
    {
        "name": "JSA",
        "year": "2000",
        "info": "Volume 46: 2000",
        "count": 95,
        "papers": [
            "Design techniques for low-power systems.",
            "Characterizing and representing workloads for parallel computer architectures.",
            "Performance evaluation of a bus-based multistage multiprocessor architecture.",
            "Scheduling optional computations for adaptive real-time systems.",
            "Extending conventional languages by distributed/concurrent exception resolution.",
            "Traffic analysis in a double grain Dataflow array processor.",
            "GSPN models of bridged LAN configurations.",
            "Optimum reserved resource allocation scheme for handoff in CDMA cellular system.",
            "MAP: Design and implementation of a mobile agents' platform.",
            "Performance analysis of video storage server under initial delay bounds.",
            "A scheme for multiple on-chip signature checking for embedded SRAMS.",
            "A fault tolerant routing algorithm based on cube algebra for hypercube systems.",
            "An improved register-transfer level functional partitioning approach for testability.",
            "An extended-UIO-based method for protocol conformance testing.",
            "Multiple context multithreaded superscalar processor architecture.",
            "Impact of the memory interface structure in the memory-processor integrated architecture for computer vision.",
            "Development of process visualization systems: An object-oriented approach.",
            "Fault tolerant permutation mapping in multistage interconnection network.",
            "The meaning and role of value in scheduling flexible real-time systems.",
            "Schedulability analysis of periodic and aperiodic tasks with resource constraints.",
            "Complete worst-case execution time analysis of straight-line hard real-time programs.",
            "Techniques to increase the schedulable utilization of cache-based preemptive real-time systems.",
            "Operating system support for the management of hard real-time disk traffic.",
            "Issues and approaches to supporting timeliness and security in real-time database systems.",
            "On the performance of distributed objects.",
            "A case study of a distributed high-performance computing system for neurocomputing.",
            "Improving cache performance with Full-Map Block Directory.",
            "Markovian and analytical models for multiple bus multiprocessor systems with memory blockings.",
            "On the design of IP routers Part 1: Router architectures.",
            "Systolic arrays architecture for computing the time-frequency spectrum.",
            "The diagnosability of hypercubes with arbitrarily missing links.",
            "O(n) routing in rearrangeable networks.",
            "Stripped mirroring RAID architecture.",
            "Low power architectures for digital signal processing.",
            "A conditional abortable priority ceiling protocol for scheduling mixed real-time tasks.",
            "Algorithms for real-time scheduling of error-cumulative tasks based on the imprecise computation approach.",
            "Real-time multimedia standards in DQDB.",
            "Worst-case deadline failure probability in real-time applications distributed over controller area network.",
            "Validation of SPEC6TM CFP95 traces for accurate performance evaluation of computer systems.",
            "Heterogeneous distributed and parallel architectures: Hardware, software and design tools.",
            "Techniques for mapping tasks to machines in heterogeneous computing systems.",
            "Efficient use of parallel libraries on heterogeneous Networks of Workstations.",
            "Vertically-partitioned parallel signature file method.",
            "On parallel solvers for sparse triangular systems.",
            "Achieving high degree of concurrency in multidatabase transaction scheduling: MTOS.",
            "Transaction multicasting scheme for resilient routing control in parallel cluster database systems.",
            "Testing and built-in self-test - A survey.",
            "Register bypassing in an asynchronous superscalar processor.",
            "Multistage ring network: An interconnection network for large scale shared memory multiprocessors.",
            "On the design of hypermesh interconnection networks for multicomputers.",
            "Integrated dynamic scheduling of hard and QoS degradable real-time tasks in multiprocessor systems.",
            "An atomic commit protocol for gigabit-networked distributed database systems.",
            "Execution replay of parallel procedural programs.",
            "Scheduling optimization through iterative refinement.",
            "Dynamic reconfiguration of node location in wormhole networks.",
            "Read-down conflict-preserving serializability as a correctness criterion for multilevel-secure optimistic concurrency control: CSR/RD.",
            "Broadcast directory: A scalable cache coherent architecture for mesh-connected multiprocessors.",
            "Efficient path-based multicast in wormhole-routed mesh networks.",
            "Measurement based analysis of temporal behaviour as support for scheduling problems in parallel and distributed real-time systems.",
            "Parameterization of efficient dynamic reconfigurable trees.",
            "Chained backplane communication architecture for scalable multiprocessor systems.",
            "Distributed vector architectures.",
            "Fixed priority scheduling of tasks with arbitrary precedence constraints in distributed hard real-time systems.",
            "An output queueing analysis of multipath ATM switches.",
            "Performance evaluation of system architectures with validated input data.",
            "An efficient implementation of tree-based multicast routing for distributed shared-memory multiprocessors.",
            "Performance of simultaneous multithreaded multimedia-enhanced processors for MPEG-2 video decompression.",
            "Efficient module selections for finding highly acceptable designs based on inclusion scheduling.",
            "YOMNA - An efficient deadlock-free multicast wormhole algorithm in 2-D mesh multicomputers.",
            "Stride prefetching for the secondary data cache.",
            "On the relative performance merits of hypercube and hypermesh networks.",
            "Design of a large-scale Gbit/s MAN using a cyclic reservation-based MAC protocol.",
            "Symbolic forward/backward traversals of large finite state machines.",
            "Rapid prototyping of an ATM programmable associative operator.",
            "Role-based access control in DCOM.",
            "Efficient approaches for constructing a massively parallel processing system.",
            "A scheduling policy for preserving cache locality in a multiprogrammed system.",
            "Analytical modeling of multithreaded architectures.",
            "Quantitative evaluation of pipelining and decoupling a dynamic instruction scheduling mechanism.",
            "Optimal bandwidth allocation and stability of high-speed networks for CSMA/CD protocols.",
            "On the derivation of a correct deadlock free communication kernel for loop connected message passing architecture from its user's specification.",
            "Profiling in the ASP codesign environment.",
            "Architecture for fractal image compression.",
            "A section cache system designed for VLIW architectures.",
            "Synthesising an asynchronous DMA controller with Balsa.",
            "ACTion: Combining logic synthesis and technology mapping for MUX-based FPGAs.",
            "A novel approach for implementing high-speed and long-distance networking protocols in a limited memory embedded kernel.",
            "Communication in a multi-layer MIMD system for computer vision.",
            "An on-chip cache compression technique to reduce decompression overhead and design complexity.",
            "Efficient parity placement schemes for tolerating up to two disk failures in disk arrays.",
            "KAIST image computing system (KICS): A parallel architecture for real-time multimedia data processing.",
            "Agents for information retrieval: Issues of mobility and coordination.",
            "Embedded software verification in hardware-software codesign.",
            "A new cache architecture based on temporal and spatial locality.",
            "Early design stage exploration of fixed-length block structured architectures."
        ]
    },
    {
        "name": "JSA",
        "year": "1998",
        "info": "Volume 45: 1998/1999",
        "count": 82,
        "papers": [
            "A new study for fault-tolerant real-time dynamic scheduling algorithms.",
            "Floating point micropipeline performance.",
            "A real-time hardware implementation of the hough transform.",
            "High-level management of allocation in a parallel objects environment.",
            "A mapping heuristic for minimizing network contention.",
            "The parallel program development environment CDL/ACL for cellular processing.",
            "Concurrency control in multidatabase systems: A performance study.",
            "Cost-effective WDM broadcast-and-select networks for all-to-all transmission schedules.",
            "Network conscious design of distributed real-time systems.",
            "PACWON: A parallelizing compiler for workstations on a network.",
            "An incremental basic block instruction scheduler.",
            "Worker-checker - A framework for run-time parallelization on multiprocessors.",
            "On communications performance and processor efficiency.",
            "Sign detection in residue arithmetic units.",
            "Generating parallel programs from skeleton based specifications.",
            "Maintaining cache coherency in a multisystem data sharing environment.",
            "Performance of a context cache for a multithreaded pipeline.",
            "Product-closed networks.",
            "An operating system extension for a multiprocessor.",
            "A survey of architectural features of contemporary object storage systems.",
            "The ClassiC programming language and design of synchronous concurrent object oriented languages.",
            "An O(n1/3) algorithm for distributed mutual exclusion.",
            "Editorial.",
            "Support of automatic parallelization with concept comprehension.",
            "Formalising high-performance systems methodologies.",
            "Integrating model-based optimization and program transformation to generate efficient parallel programs.",
            "Compiler support for task scheduling in hierarchical execution models.",
            "Optimal exploration of the unrolling degree for software pipelining.",
            "Tools for code optimization and system evaluation of the image processing system PAPRICA-3.",
            "An environment to develop parallel code for solving partial differential equations based-problems.",
            "An application specific environment for the simulation of interacting particle systems.",
            "Performance evaluation of computer architectures with main memory data compression.",
            "An enhanced two-level adaptive multiple branch prediction for superscalar processors.",
            "Design and analysis of a parallel file system for distributed shared memory systems.",
            "The \"Smart\" simulation environment - A tool-set to develop new cache coherency protocols.",
            "Throttle and preempt: A flow control policy for real-time traffic in wormhole networks.",
            "The Precomputed-Branch architecture: Efficient branches with compiler support.",
            "Combining data prefetching with non-blocking loads to alleviate cache pollution effects.",
            "Exploitable levels of ILP in future processors.",
            "Transparent checkpointing protocol for Posix.1b applications.",
            "Editorial.",
            "Architectures for high performance image processing: The future.",
            "Evaluating computation/communication balance in an object recognition task.",
            "Massively parallel processing approach to fractal image compression with near-optimal coefficient quantization.",
            "A fast, cache-aware algorithm for the calculation of radiological paths exploiting subword parallelism.",
            "Strategy for power efficient combined task and data parallelism exploration illustrated on a QSDPCM video codec.",
            "A high level FPGA-based abstract machine for image processing.",
            "A novel method for parallel image processing applications.",
            "A reconfigurable bus structure for multiprocessors with bandwidth reuse.",
            "The design space of shelving.",
            "Fault trees for clusters tolerating failure or disconnectedness of a single node.",
            "An experiment in tool integration: The DDBG parallel and distributed debugger.",
            "POW! - The Programmers Open Workbench.",
            "Mapping of neural network models onto massively parallel hierarchical computer systems.",
            "Editorial.",
            "Basic issues in microprocessor architecture.",
            "TTAs: Missing the ILP complexity wall.",
            "Asynchronous microprocessors: From high level model to FPGA implementation.",
            "DataScalar: A memory-centric approach to computing.",
            "Accelerating object-oriented applications using method lookup caches and register windowing.",
            "Branch-directed and pointer-based data cache prefetching.",
            "Enhancing multiple-path speculative execution with predicate window shifting.",
            "STATS: A framework for microprocessor and system-level design space exploration.",
            "Bounds modelling and compiler optimizations for superscalar performance tuning.",
            "Microprocessor design for embedded system.",
            "Microprocessor system buses: A case study.",
            "A pre-run-time scheduling algorithm for object-based distributed real-time systems.",
            "Analysis of a shared-memory multiprocessor via a novel queuing model.",
            "A floating point multiplier performing IEEE rounding and addition in parallel.",
            "Implementation of two-dimensional systolic algorithms for multi-layered neural networks.",
            "A neuro-emulator with embedded capabilities for generalized learning.",
            "Estimating micro-PLC execution time for time critical system design.",
            "A note on self-stabilizing articulation point detection.",
            "Editorial.",
            "Actors: A unifying model for parallel and distributed computing.",
            "Developing technologies for broad-network concurrent computing.",
            "Web computing framework.",
            "High performance computing on networks of workstations through the exploitation of function parallelism.",
            "SUPPLE: An efficient run-time support for non-uniform parallel loops.",
            "Online stable matching as a means of allocating distributed resources.",
            "Coordinated atomic actions as a technique for implementing distributed gamma computation.",
            "An architectural application framework for evolving distributed systems."
        ]
    },
    {
        "name": "JSA",
        "year": "1997",
        "info": "Volume 44: 1997/1998",
        "count": 62,
        "papers": [
            "Special section on VHDL.",
            "Software methodologies in VHDL code analysis.",
            "Implications of VHDL timing models on simulation and software synthesis.",
            "A VHDL-based approach for power estimation of embedded systems.",
            "NETMAP: An integrated system for building analog neural networks.",
            "An environment based on rewriting logic for parallel systems formal specification and prototyping.",
            "Synchronous sessions and fixed priority scheduling.",
            "A real-time concurrency control algorithm: Use of multiversion and precedence relationships.",
            "Dynamic multi-granularity locking for coordinating cooperative activities.",
            "Multiple precision square root using the Dwandwa square-root algorithm.",
            "Special issue on cluster computing.",
            "Network computing with SONiC.",
            "Performance models for scalable cluster computing.",
            "Advanced workstation cluster architectures for parallel computing.",
            "Switcherland: A scalable interconnection structure for distributed systems.",
            "ParaStation: Efficient parallel computing by clustering workstations: Design and evaluation.",
            "Communicating across parallel message-passing environments.",
            "Replicating parallel simulation on heterogeneous clusters.",
            "Trading computing power with ReGTime.",
            "Architectural design of an RISC processor for programmable logic controllers.",
            "A concurrency control model for real-time distributed collaboration.",
            "Formal specification of CSCW applications with concurrent abstract data types.",
            "Properties and performance of folded cube-connected cycles.",
            "Log-time delay consideration on mesh with multiple buses.",
            "Two-level pipelined systolic arrays for matrix-vector multiplication.",
            "Parallel and distributed simulation.",
            "Models of computation for parallel discrete event simulation.",
            "Analysis of large ATM switches using a platform-independent simulation environment.",
            "Hierarchical partitioning algorithm for optimistic distributed simulation of DEVS models.",
            "Performance comparison of high-level algebraic nets distributed simulation protocols.",
            "Formal verification and empirical analysis of rollback relaxation.",
            "Efficient data structures for Time Warp simulation queues.",
            "An evaluation of implementations of the CMB parallel simulation algorithm on distributed memory multicomputers.",
            "A distributed event processing method for general purpose computation.",
            "Artificial neural networks.",
            "Neural network simulation of a dielectric ring resonator antenna.",
            "Direct control with radial basis function networks: Stability analysis and applications.",
            "A comparison of nonlinear predictive control techniques using neural network models.",
            "Neural networks approach to early breast cancer detection.",
            "Windowed active sampling for reliable neural learning.",
            "Design of cache memories for dataflow architecture.",
            "Hardware architecture for voxelization-based volume rendering of unstructured grids.",
            "Fault-tolerant message routing in the extended hypercube.",
            "A methodology for the evaluation of multiprocessor non-preemptive allocation policies.",
            "Horizontally divided signature files on a parallel machine architecture.",
            "An operating system accelerator.",
            "Methods to improve performance of instruction prefetching through balanced improvement of two primary performance factors.",
            "An algorithm for clock cycle selection in behavioral synthesis.",
            "Modeling and performance analysis of dual head disk structure.",
            "Hypercube structures with high-connectivity supporting nodes.",
            "A cost-effective methodology for the evaluation of interconnection networks.",
            "Alleviating channel bandwidth constraints in multicomputer networks.",
            "Executing tree routing algorithms on a high-performance pattern associative router.",
            "Prospects of distributed shared memory for reducing global traffic in shared-bus multiprocessors.",
            "KH-map: A new way of representing the hypercube structure.",
            "A safe distributed deadlock resolution algorithm.",
            "A suggested protocol for internet access on PSDNs.",
            "Semantic multigranularity locking and its performance in object-oriented database systems.",
            "FlexiFrag: A design pattern for flexible file sharing in distributed collaborative applications.",
            "Petri net-based analysis on object assignment in distributed object-oriented systems.",
            "On-line recognition of Korean characters using ART neural network and hidden Markov model.",
            "The asynchronous counterflow pipeline bit-serial multiplier."
        ]
    },
    {
        "name": "JSA",
        "year": "1997",
        "info": "Volume 43: 1997",
        "count": 72,
        "papers": [
            "EUROMICRO 1995 - Short Contributions.",
            "Multiparallel systolic arrays for multidimensional FFT-architectures on 3D-VLSI.",
            "On the balance of VLIW architectures.",
            "FPGAs and cellular algorithms: Two implementation examples.",
            "Dynamically reconfigurable heterogeneous multi-processor systems with transputer-controlled communication.",
            "An approach to the design of RISC core processors for VLSI embedded systems.",
            "Modelling the hardware cost of full register bypassing in a multiple instruction issue processor.",
            "Design method, fail-stop safety model, and embedded application.",
            "Aspects of an expert design system for the wastewater treatment industry.",
            "A software algorithm for the intelligent mixing of inputs to a tele-operated vehicle.",
            "Navigational assistance for disabled wheelchair-users.",
            "Microcomputer unit for control of distributed devices over computer networks.",
            "Inter-domain movement of functionality as a repartitioning strategy for hardware/software co-design.",
            "Generation of firmwarecompilers.",
            "Methodology for ensuring high reliability of VLSI systems.",
            "Deriving cost functions from cell libraries and real ICs to allow real area-power-delay trade-off in early stages of logic synthesis.",
            "Fault and test-process modelling for integrated circuits.",
            "An environment to perform functional tests on boards and integrated circuits.",
            "Pipelined programming in PVM.",
            "A multi-thread approach reducing program execution time in a heterogeneous reconfigurable multi-processor architecture.",
            "Asynchronous Process Simulator for Parallel Systems (APSPS) 1.",
            "Implementation issues of the Hough Transform.",
            "PVM communication performance over an ATM MAN.",
            "Fast networking based on the STREAMS mechanism with fast module scheduling.",
            "Performance evaluation of switching networks.",
            "Language-based communication protocols for distributed systems.",
            "A nonlinear predistortion technique for radio channels: Algorithms and implementation problems.",
            "A tool for syntax directed software design.",
            "Automatic implementation of programming languages using object oriented approach.",
            "A portable model for predicting the size and execution time of programs.",
            "Advanced versioning mechanisms supporting CSCW environments.",
            "Reconciling chained and unchained transactional support for distributed systems.",
            "Nonblocking two-phase commit protocol to avoid unnecessary transaction abort for distributed systems.",
            "Dynamic replication control scheme using logical configuration information: DYRECT.",
            "Group-oriented catalog allocation in heterogeneous distributed database systems.",
            "A cost model for sort-domain traversal strategy in object-oriented databases.",
            "A storage structure for nested relations using signatures.",
            "Exploiting class hierarchy for effective parallelisation of processing in object-oriented database systems.",
            "Group checkpointing scheme for partition failure recovery in mobile database systems: GCS/MD.",
            "Motion interpretation by analyzing difference images.",
            "A real-time oriented system for vehicle detection.",
            "VISUAL: An object oriented language for image understanding.",
            "On an efficient VLSI architecture for the multirate additive synthesis of musical tones.",
            "T9000 and T800 transputers: A real-time application.",
            "Performance evaluation of hypermeshes and meshes with wormhole routing.",
            "Design and performance analysis of the Practical Fat Tree Network using a butterfly network.",
            "Mapping of interconnection networks for parallel processing onto the advanced sea-of-gates VLSI.",
            "Massively parallel systems.",
            "Divide-and-conquer mapping of parallel programs onto hypercube computers.",
            "An MPP reconfigurable architecture using free-space optical interconnects and Petri net configuring.",
            "A framework for virtually transparent monitoring of parallel programs.",
            "Scheduling problems in general purpose massively parallel systems.",
            "Massively parallel execution of logic programs: A static approach.",
            "Orchid: A portable platform for parallel programming.",
            "A model of massively parallel call and service processing in telecommunications.",
            "Performance impact of run queue organization and synchronization on large-scale NUMA multiprocessor systems.",
            "A partitioned on-chip virtual cache for fast processors.",
            "Evaluating ParFiSys: A high-performance parallel and distributed file system.",
            "Dynamic data decomposition in a message-passing environment.",
            "Constrained software synthesis for embedded applications.",
            "Computation of numerical algorithms with parametric floating point operators.",
            "A study of the dynamic behaviour of some workload allocation algorithms by means of catastrophe theory.",
            "Preemptive transaction scheduling in hard real-time database systems.",
            "An O-O logical machine monitor supporting disk block migration.",
            "Embedding of rings in 2-D meshes and tori with faulty nodes.",
            "Efficient multiple multicasting in hypercubes.",
            "Dependable parallel computer systems.",
            "Formal methods integration for the specification of dependable distributed systems.",
            "Implementation of blocking coordinated atomic actions based on forward error recovery.",
            "A fault tolerant RPC mechanism based on IP multicasting.",
            "A robust multiplexer-based FPGA inspired by biological systems.",
            "Justifying reliability claims for a fault-detecting parallel architecture."
        ]
    },
    {
        "name": "JSA",
        "year": "1996",
        "info": "Volume 42: 1996/1997",
        "count": 59,
        "papers": [
            "A prediction-based adaptive location policy for distributed load balancing.",
            "Accelerating genetic algorithm computation in tree shaped parallel computer.",
            "Performance analysis of hybrid disk array architectures to meet I/O requirements.",
            "Multiresolution analysis and denoising of computer performance evaluation data with the wavelet transform.",
            "Fault identification and routing in Benes networks.",
            "Looping adjacent nodes on multistage interconnection networks.",
            "VHDL( VHSIC Hardware Description Language).",
            "Experiences with VHDL and FPGAs.",
            "VHDL synthesis description portability: The need for Level synthesis subsets.",
            "Verification methods for VHDL RTL-subroutines.",
            "Hardware support for load sharing in parallel systems.",
            "A new indexing scheme supporting multi-attribute database applications: MAX.",
            "Embedding trees in massively parallel computers.",
            "Systolic MIMD architectures for 4-level spherical subspace tracking.",
            "Drop-and-reroute: A new flow control policy for adaptive wormhole routing.",
            "Bandwidth of prioritized crossbar systems.",
            "Bandwidth of a reconfigurable multiple-group multiprocessor system.",
            "Improving R & D processes by an ISO 9001-based quality management system.",
            "A fast prototype tool for parallel reactive systems.",
            "The egoistic approach to parallel process migration into heterogeneous workstation network.",
            "Fault-tolerant routing in multiply twisted cube topology.",
            "Topological properties of hierarchical cubic networks.",
            "Connected component labeling for binary images on a reconfigurable mesh architecture.",
            "Parallel updating algorithms for graph searching problems.",
            "Towards a framework for cost-based transformation.",
            "A portable parallel environment for complex systems simulation through cellular automata networks.",
            "ANDES: Evaluating mapping strategies with synthetic programs.",
            "Optimal broadcasting in hypercubes with link faults using limited global information.",
            "Real-time systems.",
            "Strategies for scheduling optional tasks in intelligent real-time environments.",
            "Scalability in real-time systems with end-to-end requirements.",
            "Minimizing the effects of jitter in distributed hard real-time systems.",
            "Hardware/software partitioning aiming at fulfilment of real-time constraints.",
            "Real time pipelined system design through simulated annealing.",
            "HyperReal: A modular control architecture for HRT systems.",
            "Integrating methods for the design of real-time systems.",
            "A GSPN based methodology for the evaluation of concurrent applications in distributed plant automation systems.",
            "Impact of high speed network on performance of real-time concurrency control protocol.",
            "Software architecture for a firm real-time database system.",
            "A hybrid distributed mutual exclusion algorithm.",
            "ESPITI.",
            "ESPITI - a european challenge.",
            "Implementing ESPITI on a European scale.",
            "Has Europe learnt enough?",
            "What is a software process?",
            "The tailoring process in the German V-Model.",
            "Software process maturity and certification.",
            "Software process assessment concepts.",
            "SPICE: Overview for software process improvement.",
            "Improving R&D processes by an ISO 9001-based Quality Management System.",
            "Software processes, assessment and ISO 9000-certification: A user's view.",
            "Design of hardware and software systems.",
            "Interconnection network analysis for a compliant massively parallel processor.",
            "A hybrid approach to adaptive load sharing and its performance.",
            "Acceleration of software algorithms using hardware/software co-design techniques.",
            "Modular architecture for custom-built systems oriented to real-time computer vision: Application to color recognition.",
            "Post-synthesis back-annotation of timing information in behavioral VHDL.",
            "Sub-optimal solutions to track detection problem using graph theoretic concepts.",
            "Embedding a complete binary tree into the supercube."
        ]
    },
    {
        "name": "JSA",
        "year": "1995",
        "info": "Volume 41: 1995/1996",
        "count": 50,
        "papers": [
            "Letter from the editors-in-chief.",
            "A survey of languages integrating functional, object-oriented and logic programming.",
            "A new approach to schedule operations across nested-ifs and nested-loops.",
            "Stable memory for a disk write cache.",
            "Performance evaluation in image processing with GAPP array processor.",
            "A genetic algorithm-based circuit partitioner for MCMs.",
            "A parallel SVD algorithm and its application to financial ratio analysis.",
            "Incorporating job sizes in distributed load balancing.",
            "A software-controlled prefetching mechanism for software-managed TLBs.",
            "Heuristic and neural algorithms for mapping tasks to a reconfigurable array.",
            "Efficient fault tolerant cache memory design.",
            "On the routing of signals in parallel processor meshes.",
            "Modified straight division: A computer implementation of multiple-precision division.",
            "The multi-associative branch target buffer: a cost effective BTB mechanism.",
            "Two-dimensional specification of queries in object-oriented databases.",
            "Parset: A language construct for system independent parallel programming on distributed systems.",
            "An experimental mixed purpose network.",
            "On synthesizing cube and tree for parallel processing.",
            "Multilayered neural network implementation on transputer systolic array.",
            "A parallel computer based on simple DSP modules.",
            "Supporting user mobility in the Distributed Logical Machine System.",
            "Parallel programmable architectures and compilation for multi-dimensional processing.",
            "Algorithm-architecture co-design by example: a coprocessor for on-line arithmetic.",
            "A scalable design for VLSI dictionary machines.",
            "Architecture and programming of two generations video signal processors.",
            "Architecture and C++-programming environment of a highly parallel image signal processor.",
            "Mapping real-time motion estimation type algorithms to memory efficient, programmable multi-processor architectures.",
            "Compiling for massively parallel architectures: a perspective.",
            "Parallel K-set mutual range-join in hypercubes.",
            "Bit-permute multistage interconnection networks.",
            "Design of a kernel for implementing communication protocols.",
            "Using connectivity and spectral methods to characterize the structure of sequential logic circuits.",
            "A new scheduling algorithm for synthesizing the control blocks of control-dominated circuits.",
            "Parallel systems engineering.",
            "The logic of engineering design.",
            "A two-level programming strategy for distributed systems.",
            "Modeling of optimal load balancing strategy using queueing theory.",
            "From transformations to methodology in parallel program development: A case study.",
            "Deriving structured parallel implementations for numerical methods.",
            "Scope: An extensible interactive environment for the performance evaluation of parallel systems.",
            "Designing parallel programs by the graphical language GRAPNEL.",
            "Exploiting partial replication in unbalanced parallel loop scheduling on multicomputer.",
            "Performance evaluation and optimization in low-cost cellular SIMD systems.",
            "Modelling and performance assessment of large ATM switching networks on loosely-coupled parallel processors.",
            "A neural network-based replacement strategy for high performance computer architectures.",
            "Application specific conversation schemes for ADA programs.",
            "A hybrid distributed mutual exclusion algorithm.",
            "An improved algorithm for evaluation of the product of an exponential function with an error function complement.",
            "A graphical simulator for programmable logic controllers based on Petri nets.",
            "Mixing floating- and fixed-point formats for neural network learning on neuroprocessors."
        ]
    },
    {
        "name": "JSA",
        "year": "1994",
        "info": "Volume 40: 1994",
        "count": 104,
        "papers": [
            "An investigation of binary CLA and ripple CMOS adder designs.",
            "Realization of a fuzzy Boolean neural network classifier.",
            "Models of asynchronous packet-switched multiple and partial multiple bus systems.",
            "Automatic verification of distributed logic specifications.",
            "Efficient message routing in PrSigma-network.",
            "A microprogram-based 3-D image generation system using the Am29300 family.",
            "Euromicro's close encounter of the arctic circle - in real time.",
            "Parallel processing in embedded real-time systems.",
            "Object-oriented decomposition for distributed systems.",
            "Virtuoso: A virtual single processor programming system for distributed real-time applications.",
            "Holistic schedulability analysis for distributed hard real-time systems.",
            "Response time prediction in object-based, parallel embedded systems.",
            "Integrated commitment protocol for parallel transaction processing in real-time systems.",
            "Real-time parallel processing in high energy physics: architecture of the Blitzen data acquisition system.",
            "A high performance embedded machine tool controller.",
            "Scheduling hard real-time tasks with tolerance of multiple processor failures.",
            "Dependable flight control system by data diversity and self-checking components.",
            "A generic hardware architecture to support the system level synthesis of digital systems.",
            "Delay time computation for an active star topology local area network.",
            "Parallelism measures of task graphs for multiprocessors.",
            "Enhancing performance in a parallel file system.",
            "Special-purpose architectures for fuzzy logic controllers.",
            "An implementation-directed design method for microcontroller software.",
            "A parallel neural network implementation in a distributed fault diagnosis system.",
            "An approach to partitioning programs on the functional basis and applications.",
            "Distribution algorithms for document allocation in multiprocessor information retrieval systems.",
            "On implementing computer networking on existing cable TV plants: Some interesting proposals.",
            "Multiple boundary scan-paths for minimizing circuit-board test-application time.",
            "The architecture of response-pipelined content addressable memories.",
            "A methodology for evaluating the performance of CISC computer systems under single and two-level cache environments.",
            "Efficient checkpointing procedures for fault tolerant distributed systems.",
            "An efficient DM switchbox router.",
            "Specification and coordination of long-running design activities for CAD environments.",
            "A new deadlock prevention scheme for nonminimal adaptive wormhole routing.",
            "Odd-even, compare-exchange parallel sorting.",
            "Enhanced systolic array implementations of some graph problems.",
            "Bit-serial VLSI sorter with high reliability specifications.",
            "Genetic algorithm for embedding a complete graph in a hypercube with a VLSI application.",
            "Interface design and controller synthesis of digital systems in an object oriented environment.",
            "Scheduliing expression trees with register variables on delayed-load architectures.",
            "Virus protection using dynamic linking.",
            "VLSI architecture for the Winograd Fourier transform algorithm.",
            "VLSI architectures for the computation of uniform B-spline curves.",
            "Design and evaluation of access method for multi-dimensional objects in spatial databases.",
            "Optimal scheduling of independent jobs in multiprocessor systems.",
            "An explicitly declared delayed-branch mechanism for a superscalar architecture.",
            "A worst case timing analysis technique for instruction prefetch buffers.",
            "HLL enhancement for stack based processors.",
            "Conditional execution: an approach for eliminating the basic block barriers.",
            "High level architectural synthesis: Precedence analysis and automatic cycle detection in data flow graphs.",
            "On the optimal mapping of fuzzy rules on standard micro-controllers.",
            "Conformance testing of X-25 packet level.",
            "Automated derivation of protocols implementing intelligent network services.",
            "Validation of abstract test suites with use of SDL.",
            "Documenting the process of conformance testing.",
            "Automatic Protocol implementation - generating C++ code from SDL/PR specifications.",
            "A concept of a fully distributed processing strategy oriented for unix local area networks.",
            "Development of object-oriented database management system: OOIM.",
            "Concurrency control scheme in multi-level secure database management systems.",
            "Constructing a domain dependent case-base for database schema design with case-based reasoning.",
            "Scheduling cooperative transactions in distributed database systems.",
            "Cost-optimal dynamic data replication for distributed database systems: DYVO.",
            "Optimal evaluation of path predicates in object-oriented queries.",
            "Middleware transaction manager in multidatabase management systems.",
            "Reverse serializability as a correctness criterion for optimistic concurrency control.",
            "Fault tolerant programming for network based parallel computing.",
            "Database cache requirements calculation using near-line data access traces in a 500+ user transaction system.",
            "A knowledge based approach to loop restructuring.",
            "HP-FLEXAR: A reconfigurable multi-unit heterogeneous topology architecture for time critical applications.",
            "Towards a definition of benchmarks for parallel computers dedicated to image processing/understanding.",
            "Proving properties of a new high speed data bus with predicate/transition nets.",
            "Adaptive Steiner tree balancing in distributed algorithm for multicast connection setup.",
            "Coupling algorithms for replicated objects and processes.",
            "Performance evaluation of a distributed system architecture.",
            "Analysis of network protocol performance in the context of multi-workstation parallel distributed applications.",
            "Implementing associations between objects.",
            "Hardware programming using C++.",
            "Clock cycle estimation based on dead time and control unit area minimization.",
            "A flexible VLSI-based hardware system for medium-large-vocabulary real-time speech recognition.",
            "A bit-serial VLSI architecture for the 2-D discrete cosine transform.",
            "Rounding error in the computation of opposite sign floating point number parametric addition: a case study.",
            "Reduction of fault detection costs through a BDD formalism.",
            "Internet and the electronic classroom.",
            "A hypermedia data model for public space and computer aided learning.",
            "MeT: The expert methodology tutor of GENITOR.",
            "Distributing quality-controlled software via the internet.",
            "Computer modelling of single sludge systems for the computer aided design and control of activated sludge processes.",
            "Multiprocessor flight data acquisition system.",
            "PVM-based parallel computing: a case study on power plant simulation.",
            "ASI Instrumentation.",
            "Experiences accumulated working towards medical decision support systems.",
            "Design and development of industrial measurement system - Architecture and software.",
            "Measurements in software requirements specification process.",
            "The problems of designing a conversation scheme for concurrent object oriented languages.",
            "Using versioned object-oriented data in programming languages.",
            "Extending database programming language with declarative querying facilities.",
            "Towards amalgamating high-level synthesis and proof systems.",
            "An efficient critical path tracing algorithm for sequential circuits.",
            "Three dimensional image synthesis in transputers.",
            "Multiresolution image decomposition with wavelet transform.",
            "Image coding using vector quantization of wavelet coefficients.",
            "Morphological evaluation of embryo viability.",
            "Pattern recognition with fuzzy neural network.",
            "An environment for processing images of historical documents."
        ]
    },
    {
        "name": "JSA",
        "year": "1993",
        "info": "Volume 39: 1993",
        "count": 56,
        "papers": [
            "Threaded prefetching: An adaptive instruction prefetch mechanism.",
            "Implementation of the robot inverse dynamics computation algorithm on a transputer network.",
            "URPR-1: A single-chip VLIW architecture.",
            "Broadcasting in faulty hypercubes.",
            "Preface.",
            "HP-MODTRANS: A High performance modular transputer architecture.",
            "Implementation details of ALBA in a transputer machine.",
            "Watchdog processors in parallel systems.",
            "Addressing mechanisms for VLIW and superscalar processors.",
            "Memory management in LOGFLOW.",
            "MEM: A new execution model for Prolog.",
            "High level synthesis through folding of data flow graphs: Optimal intra-node scheduling.",
            "Using CCS for the specification of inheritance.",
            "Using temporal logic specifications to debug parallel programs.",
            "The fuzzy set model based on N-ary positively compensatory operators.",
            "Using term dependencies of a thesaurus in the fuzzy set model.",
            "A quick distributed consensus protocol.",
            "Autodiagnostics for transputer systems.",
            "Determining effective multiprocessor scheduling policies for repetitive real-time tasks.",
            "Spike Algorithm with savings for strictly diagonal dominant tridiagonal systems.",
            "Process to processor mapping within the mathematician's Devil.",
            "Conflict handling in high level Petri Nets.",
            "A rule based programming language for real-time applications.",
            "A true concurrency semantics for parallel programs.",
            "Parallel compiler generation.",
            "Language prototyping with attribute grammars and macros.",
            "Global deadlock detection for concurrency control in multidatabase systems.",
            "Locking in DAG-structured databases.",
            "Extending semantics of relational operators for vague queries.",
            "Parallel algorithm for table division in relational databases.",
            "The performance evaluation of a knowledge-based information retrieval system.",
            "A flexible indexing structure supporting multi-attribute database applications: MAIN.",
            "Certificates handling and their support within X.500 system.",
            "An accurate and fast CSMA/CD simulator.",
            "A frame-based approach to conformance testing.",
            "Service-driven protocol synthesis for specific users.",
            "Advances in adaptive simulation of interconnected systems with delays.",
            "A load balancing system for unix-based local area networks.",
            "Multi-protocol communications controller.",
            "Derivation of protocols implementing services with event priorities.",
            "Architecture for interoperability of network management systems in multi-domain network.",
            "Cycle calculus for hybrid systems.",
            "Hierachical modeling and simulation of processor architectures.",
            "Global hardware synthesis guided by realistic probability computation.",
            "Concurrently self-checking structures for Fsms.",
            "Development of a technology independent library.",
            "Testability enhancement using physical design rules in a CMOS cell library.",
            "VLSI implementation of digit-serial arithmetic modules.",
            "Automatic pattern generation for the electrical characterization of digital modules.",
            "SMILE: A scalable microcontroller library element.",
            "Data path structures and heuristics for testable allocation in high level synthesis.",
            "Multiobjective optimization using analytical models of GaAs high-speed digital circuits.",
            "A five step method for metric-based software evaluation - effective software metrication with respect to quality standards.",
            "Development of a fuzzy logic controller on a digital signal processor.",
            "Monitoring and data recording system for the underground.",
            "High-speed parallel implementation of the statistical feature matrix method."
        ]
    },
    {
        "name": "JSA",
        "year": "1993",
        "info": "Volume 38: 1993",
        "count": 118,
        "papers": [
            "Chairmen's introduction.",
            "Petri Nets applied to the modelling and analysis of computer architecture problems.",
            "Fuzzy logic, neural networks and soft computing.",
            "Matching algorithms and architectures.",
            "Hardware features of the static communication network of a parallel architecture.",
            "Fault tolerant multiple-bus interconnection networks.",
            "Experimental evaluation of Mad Postman bidimensional routing networks.",
            "Processor architecture I.",
            "Evaluating transport triggered architectures for scalar applications.",
            "Move32int, a sea of gates realization of a high performance transport triggered architecture.",
            "Design of a VLIW architecture constructed from standard RISC chips: A case study of hardware/software codesign.",
            "Session A3: System specification I.",
            "X-Nets: A visual formalism for system specification and analysis.",
            "Automated support for the formal specification and design of real-time systems.",
            "SEAL A simple language for prototyping action-event specifications.",
            "Distributed memory management.",
            "The memory hierarchy of the CHESS computer.",
            "Some practical considerations for the implementer of the SCI network.",
            "Conflict-free access to streams in multiprocessor systems.",
            "Session B2: Processor Architecture II.",
            "Evaluating the Cost of conditional branches on the performance of superscalar machines.",
            "Branch optimization of the TOOBSIE2 RISC-processor and classification.",
            "Arco: A cost-effective and flexible hardware maze router.",
            "Protection and routing algorithms for network management : The case of transmission networks.",
            "DIP : Distributed Diagnosis Protocol.",
            "PLANNER 4: A simulator to design packet switching data network.",
            "Parallel software engineering.",
            "Tools for object-oriented SPMD programming.",
            "Distributed active objects: A methodological proposal and tool for distributed programming with transputer systems.",
            "A reusable load balancer for parallel search problems.",
            "Real-time behavior monitoring for multi-processor systems.",
            "VLSI testing and testability.",
            "Fault behavior and testability of asynchronous CMOS circuits.",
            "FSM fault models impact on test performances.",
            "Redundancy analysis and removal for VLSI ASIC's.",
            "Memory testing in a massively parallel machine.",
            "Advances in object-oriented design.",
            "Active object oriented databases in control applications.",
            "Heterogeneous schema integration method for multidatabase system.",
            "Toward automated support for object-oriented modelling.",
            "Incremental resources estimation with real-time feedback from measurement.",
            "Local area networks.",
            "Concurrent ring: Design and evaluation of a new Token Ring LAN.",
            "A distributed bandwidth allocation algorithm for Gbit/s LANs.",
            "An ISDN primary rate interface for ethernet access.",
            "Parallel WZ factorization on mesh multiprocessors.",
            "Image component labeling on reconfigurable processor array.",
            "Computing the generalized eigenvalues of symmetric positive definite pencils on networks of transputers.",
            "Session D2: ASIC design.",
            "Efficient synthesis of distributed vector multipliers.",
            "Implementation of Given's Rotation processors for DSP real-time applications.",
            "On computing the 2-D discrete cosine transform using rotations.",
            "Session D3: Data base systems.",
            "Visual query language for object-oriented databases: OQD.",
            "Global query management in heterogeneous distributed database systems.",
            "A distributed deadlock detection algorithm for the AND model.",
            "Logic design.",
            "A study of the resetability of synchronous sequential circuits.",
            "Relational algebra as formalism for hardware design.",
            "An object-oriented model of design evolution.",
            "Parallelizing compiler techniques.",
            "Exact and efficient advanced loop interchange.",
            "Resource-constrained pipelining based on loop transformations.",
            "Optimal data dependence chaining in parallel loops.",
            "An asynchronous approach to the RISC design of a micro-controller.",
            "Application of the novel associative programmable array-structure multi-match-PLA in synthesis of decomposed finite state machines.",
            "OCEAN: A hardware and software tool for design of future smart cards.",
            "Implementing and checking timing constraints in real-time programs.",
            "On guaranteeing hard real-time tasks.",
            "Priority-driven concurrency control based on data conflict state in distributed real-time databases.",
            "SHC-SLX: A levelized compiled, event driven interpreted VLSI simulator.",
            "Timing analysis for DCFL/SDCFL VLSI circuits.",
            "Sequential and parallel strategies for the demand-driven simulation of logic circuits.",
            "Application-driven architectures.",
            "A processor array module for distributed, massively parallel, embedded computing.",
            "Design of an extended transputer processor farm system.",
            "A parallel architecture for the Color Doppler flow technique in ultrasound imaging.",
            "An empirical study of automatic restructuring of vision programs for simd machines.",
            "A design methodology for the correct specification of VLSI systems.",
            "VHDL/S - integrating statecharts, timing diagrams, and VHDL.",
            "Introducing structure into behavioural descriptions obtained from timing diagram specifications.",
            "VHDL generation from a timed extension of the formal description technique LOTOS within the FORMAT project.",
            "Analysis tools applied to VHDL.",
            "Real-time specification using Petri nets.",
            "IDFG: An interactive applications specification model with phenomenological properties.",
            "Three approaches to interprocedural dynamic slicing.",
            "A software system for the generation of test data for Ada programs.",
            "Issues in distributed systems.",
            "Concurrency control algorithms for real-time systems.",
            "Analysis and simulation of six bus arbitration protocols.",
            "Design of TMS320C40 signal processors and programmable logic based prototyping environment of real-time machine vision architectures.",
            "Modeling and design of the multimedia subsystem of a distributed authoring environment.",
            "Neural networks.",
            "Mapping and parallel simulation of synchronous neural networks on multiprocessors.",
            "Neural accelerator for parallelization of back-propagation algorithm.",
            "Removal of catastrophic noise in hetero-associative training samples.",
            "Algorithms and tools for VLSI design.",
            "An empirical study of genetic operators in genetic algorithms.",
            "Automatic test pattern generation can be solved as a constraint satisfaction problem.",
            "A behavioral level tool for design and verification of parallel architectures: PADS.",
            "Protocols and performance analysis.",
            "Providing circuit service over a high speed deflection network.",
            "Dynamic protocol configuration for multimedia networks.",
            "Performance analysis of synchronous multibuffered packet-switching networks.",
            "RT-level synthesis.",
            "Automata decomposition and synthesis with PLAM.",
            "Synthesis for testability by synthesis controlling.",
            "Glass: a graph-theoretical approach for global binding.",
            "Session H1: Fault tolerance.",
            "The design of time-critical conversations.",
            "A fault-tolerant server on MACH.",
            "Pen-based recognizing of handprinted characters.",
            "N version programming with majority voting decision: Dependability modeling and evaluation.",
            "FDT Tools.",
            "Proconsul, a tool for computer-aided protocol engineering.",
            "Test strategy for indeterministic protocols.",
            "TL: A system specification system.",
            "Connectionist model description: A case study."
        ]
    },
    {
        "name": "JSA",
        "year": "1993",
        "info": "Volume 37: 1993",
        "count": 51,
        "papers": [
            "Letter from the short notes editors, Euromicro '92.",
            "Experiences and results in designing VLSI-chips using standard-cell techniques.",
            "CMOS interconnect modelling for timing analysis.",
            "Préforme/aGAPE: a synergy between symbolic cell design and assembly.",
            "A nonlinear 3D MOSFET table for VLSI circuit simulation.",
            "A delay insensitive approach to the VLSI design of a DRAM controller.",
            "An empirical model to estimate power consumption in GaAs DCFL/SDCFL circuits.",
            "An investigation of the performance characteristics of an i860 processor within a Meiko computing surface.",
            "Distributing pixmap images among parallel disk arrays.",
            "Directory-based cache coherence scheme using number-balanced binary tree.",
            "CDPU for SOHO-CEPAC collaboration.",
            "CISC versus RISC processors for graphics: A simulation study.",
            "An OCCAM circle generator program implemented in VLSI.",
            "Real time Cepstrum computation based on an Advanced CORDIC processor.",
            "Implementation issues of image texture analysis and segmentation.",
            "Detecting components for parallel execution within the Mathematician's Devil.",
            "A flexible architecture for real-time speech recognition.",
            "Pulse slimming in magnetic recording using digital signal processing techniques.",
            "Two-processor monitoring system for airplanes.",
            "Hypertextual applications development tools.",
            "Analysis of multithreaded architectures - A case study.",
            "System level modelling and analysis of complex digital systems.",
            "Guidance for optimization-based synthesis tools.",
            "An extended scheduling technique for software pipelining.",
            "Integer and control units for a GaAs 32-bit RISC processor.",
            "Facilitating composition and increasing object reusability by means of an event-driven object-oriented development.",
            "CADTM: A database transaction manager for coordinating design activities in CAD environments.",
            "Development of an autonomous heterogeneous distributed database system: DHIM.",
            "Developing multi-user interfaces for CSCW environment.",
            "On hierarchical locking of composite objects.",
            "Source - A debugging tool for ParMod.",
            "Graph management within the Fortport migration environment (including comments on the use of objectstore).",
            "Hot spot analysis within the FortPort migration tool for parallel platforms.",
            "Developments in parallel discrete event simulation at the centre for parallel computing.",
            "Dynamically reconfigurable multi-transputer systems with serial bus control.",
            "Design of a massively parallel SIMD architecture for the Boltzmann machine.",
            "ΓCMC: Fast lazy functional languages.",
            "Some performance figures for the G-Machine and its optimisations.",
            "Translation of a query in OODBMS into a system of parallel tasks.",
            "The design of a multiparadigm programming language: I.",
            "Formal specifications as constructive diagrams.",
            "A hierarchical program structure for concurrent fault tolerant software.",
            "A parallel algorithm for the Jacobian matrix of a manipulator.",
            "Modelling dynamic dependencies by functional database model.",
            "Small area network interconnection.",
            "A CATV based metropolitan area network using distributed switching.",
            "An example of the efficient message protocol for industrial LAN.",
            "Effectiveness of bridging in multiprotocol LANS.",
            "An optimized architecture for a rapid-prototype-emulator.",
            "Logic controllers design methods using advanced PLDS.",
            "Configurable cells: Towards dynamic architectures."
        ]
    },
    {
        "name": "JSA",
        "year": "1992",
        "info": "Volume 36: 1992/1993",
        "count": 19,
        "papers": [
            "On the bandwidth of asynchronous multiprocessors.",
            "AMEC - Asynchronous microprogram execution controller.",
            "Architectural tradeoffs in the design of VLSI-based associative memories.",
            "Adaptive data interleaving using a microprocessor controlled reconfigurable gate array.",
            "An ASIC design for edge detection in real time.",
            "An experimental analysis of event set algorithms for discrete event simulation.",
            "An efficient heuristic algorithm for mapping parallel programs onto multicomputers.",
            "Scheduling of precedence-constrained parallel program tasks on multiprocessors.",
            "A high-level performance analysis of the IBM subsystem control block (SCB) architecture.",
            "NSL: A language for neural network simulation.",
            "A survey of memory management.",
            "Performance modeling of multiprocessor systems for different data loading schemes.",
            "An improved algorithm for protocol validation by extended circular exploration.",
            "High level Petri net modelling and analysis of VME-based multiprocessors.",
            "Exploiting multi-way branches to boost superscalar processor performance.",
            "Global representation of local time measurements in transputer networks.",
            "Delay insensitive micro-pipelined combinational logic.",
            "A survey of branch techniques in pipelined processors.",
            "ALU design and processor branch architecture."
        ]
    },
    {
        "name": "JSA",
        "year": "1992",
        "info": "Volume 35: 1992",
        "count": 102,
        "papers": [
            "Chairman's introduction.",
            "Program chairman's introduction.",
            "Highest performance computing machines.",
            "From image coding to multimedia: Algorithms and architectures for a revolution.",
            "Application machines: An approach to realizing understandable systems.",
            "IPTES - Incremental Prototyping Technology for Embedded real-time Systems.",
            "Results of the esprit basic research action 3148 demon (design methods based on nets).",
            "PROOFS: Application engineering based on formal methods.",
            "A light weight kernel server.",
            "Communicating active components: An environment for concurrent applications on parallel machines.",
            "TriOS operating system.",
            "Specification and design of concurrent control units.",
            "EPVD: An interactive protocol specification and validation environment in Estelle formal specification.",
            "An interactive environment for the model-based design of analog circuits.",
            "A data driven hybrid computer architecture.",
            "A new magnitude function for fast numbers comparison in the residue number system.",
            "Design of the processing node of the PTAH 64 parallel computer.",
            "SPECS: Formal methods and techniques for telecommunications software development.",
            "A transputer network for a device simulator.",
            "Implementation of statecharts with transputers.",
            "Checkpointing and recovery in a pipeline of transputers.",
            "Estimators for logic minimization and implementation selection of finite state machines.",
            "On the use of OR-BDDs for test generation.",
            "Modelling of digital circuits function and functional faults on register transfer level.",
            "Galatea neural VLSI architectures: Communication and control considerations.",
            "A behavioral approach to testability analysis for neural networks.",
            "Artificial neural network realization with programmable logic circuit.",
            "A trip to object-oriented land.",
            "Object-oriented versus conventional software development: A comparative case study.",
            "An object-oriented approach to High-Level Petri Nets.",
            "Object-oriented analysis and modeling with the ESAstation.",
            "MPPNL - A Petri Net based Language to design fine-grained parallel machines and debug their software.",
            "Allocation of precedence-constrained tasks to parallel processors for optimal execution.",
            "DELTA-T: A user-transparent software-monitoring tool for multi-transputer systems.",
            "SIMPAC-T : A simulator for multitransputer systems.",
            "High-level synthesis.",
            "Digital system simulation with VHDL in a high-level synthesis system.",
            "A high level synthesis algorithm including control constraints.",
            "System performance modeling with functional schemes and VHDL.",
            "Silicon compilation and rapid prototyping of microprogrammed VLSI-Circuits with MIMOLA and SOLO 1400.",
            "Performance evaluation: An analytical model for calculating start misses in caches.",
            "Level-2 cache for high performance /390 μ-processors.",
            "A clause indexing unit for prolog.",
            "Efficient implementation of regular parallel adders for binary signed digit number representations.",
            "A hybrid knowledge-based approach to information retrieval.",
            "Enhancing the fuzzy set model for high quality document rankings.",
            "Performance comparison of signature-based multikey access methods.",
            "Task level specification and communication.",
            "The specification and design of atomic actions for fault tolerant concurrent software.",
            "Deriving protocol specifications from service specifications including multirendezvous.",
            "CMOS transistor faults and bridging faults: Testability by delay effects and overcurrents.",
            "On the design of a highly testable cell library.",
            "State assignment and testability of PLA-based finite state machines.",
            "Contrasting instruction-fetch time and instruction-decode time branch prediction mechanisms: Achieving synergy through their cooperative operation.",
            "An adaptable frame multiplexing scheme for source routing bridges.",
            "A chip set implementation of a parallel cellular architecture.",
            "An integrated access control in heterogeneous distributed database systems.",
            "Transaction management for global serializability and local autonomy in multidatabase systems.",
            "Development of a real-time database management system for production process-control applications.",
            "The dining philosophers problem and its decentralisation.",
            "Improving the probabilistic clock synchronization algorithm.",
            "Data layouts impacts on the compilation of the communications for a synchronous MSIMD machine.",
            "A quadratic programming approach to estimating the testability and coverage distributions of a VLSI circuit.",
            "An approach to testability analysis and improvement for VLSI systems.",
            "A user programmable macrocell generator for the IEEE 1149.1 boundary scan standard interface port.",
            "UISER - a customizable software engineering environment for development-in-the-large.",
            "PTD: Architectural system description support based on visual specification languages.",
            "Making specifications executable - Using IPTES Meta-IV.",
            "A software generator for multi-transputer-based real-time applications.",
            "Session F2: Parallel architectures I.",
            "Dependence graph transformations in the design of processor arrays for matrix multiplications.",
            "Construction of large-size interconnection networks with high performance.",
            "A comparative analysis of cache memory architectures for the MULTIPLUS multiprocessor.",
            "A multi-processor shared memory architecture for parallel cyclic reference counting.",
            "Constructive evaluation of computer architectures: A CAD approach.",
            "Systematic synthesis of parallel VLSI architectures from FP specifications and its application to scene matching.",
            "LEFT - A learning tool for early floorplanning.",
            "A comparison study of minimization methods of unit interconnection in VLIW processors.",
            "Intel i860 versus Digital Signal Processors (DSP).",
            "A low cost solution for HDTV data reduction.",
            "Transputer model of the human peripheral hearing system.",
            "A software architecture for sound and music processing.",
            "Measuring and analyzing real-time kernel performance.",
            "Verifying networks of processes that communicate via shared variables.",
            "ETS - a performance prediction tool for protocols specified in FDT Estelle.",
            "Fault diagnosis for the generalized Boolean n-cube network.",
            "Fault tolerant wormhole routing in hypercube multicomputers.",
            "A reconfigurable boolean n-cube architecture under faults.",
            "Multiple input transitions in CMOS gates.",
            "Power consumption estimation using statistical signal properties.",
            "Circuit yield optimization by analyzing performance statistics.",
            "A pearl-based multi-loop and multi-sequence controller.",
            "Design of a DSP-based discrete variable structure controller with improved robustness.",
            "A self-tuning robust fuzzy controller.",
            "Automated implementations of Lotos specification.",
            "From specification to implementation of a real-time system.",
            "Neural network implementations and speed-up on Massively Parallel machines.",
            "An abstract prolog machine based on parallel resolution principle.",
            "Measuring and simulating an 802.3 CSMA/CD LAN.",
            "Stochastic modelling of a high speed, short packet length, slotted ring with finite queueing capacity.",
            "Sound recognition and optimal neural network design.",
            "Segmentation of echocardiograms using a neural network."
        ]
    }
]