[
    {
        "year": "2015",
        "name": "29th LISA 2015",
        "info": "Washington, D.C., USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2015",
                "sub_name": "29th Large Installation System Administration Conference, LISA 2015, Washington, D.C., USA, November 8-13, 2015.",
                "count": 4,
                "papers": [
                    "Hyperprobe: Towards Virtual Machine Extrospection.",
                    "Dynamic Provisioning of Storage Workloads.",
                    "SF-TAP: Scalable and Flexible Traffic Analysis Platform Running on Commodity Hardware.",
                    "Spyglass: Demand-Provisioned Linux Containers for Private Network Access."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "28th LISA 2014",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2014",
                "sub_name": "28th Large Installation System Administration Conference, LISA '14, Seattle, WA, USA, November 9-14, 2014.",
                "count": 16,
                "papers": [
                    "HotRestore: A Fast Restore System for Virtual Machine Cluster.",
                    "Compiling Abstract Specifications into Concrete Systems - Bringing Order to the Cloud.",
                    "An Administrator's Guide to Internet Password Research.",
                    "Analyzing Log Analysis: An Empirical Study of User Log Mining.",
                    "Realtime High-Speed Network Traffic Monitoring Using ntopng.",
                    "Towards Detecting Target Link Flooding Attack.",
                    "Automatic and Dynamic Configuration of Data Compression for Web Servers.",
                    "The Truth About MapReduce Performance on SSDs.",
                    "ParaSwift: File I/O Trace Modeling for the Future.",
                    "Pedagogical Framework and Network Laboratory Management Tool for Practical Network Administration Education.",
                    "An Investigation of Cultural and Organizational Impacts on EKR Use and EKR Use Outcomes Among System Administrators at NASA.",
                    "Linux NFSv4.1 Performance Under a Microscope.",
                    "Demand-Provisioned Linux Containers for Private Network Access.",
                    "Virtual Interfaces for Exploration of Heterogeneous & Cloud Computing Architectures.",
                    "Time-Synchronized Visualization of Arbitrary Data Streams for Real-Time Monitoring and Historical Analysis.",
                    "Formalising Configuration Languages: Why is this Important in Practice?"
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "27th LISA 2013",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2013",
                "sub_name": "Lucky LISA: Proceedings of the 27th Large Installation System Administration Conference, LISA 2013, Washington, DC, USA, November 3-8, 2013.",
                "count": 13,
                "papers": [
                    "Building Software Environments for Research Computing Clusters.",
                    "Fixing On-call, or How to Sleep Through the Night.",
                    "Poncho: Enabling Smart Administration of Full Private Clouds.",
                    "Making Problem Diagnosis Work for Large-Scale, Production Storage Systems.",
                    "dsync: Efficient Block-wise Synchronization of Multi-Gigabyte Binary Data.",
                    "HotSnap: A Hot Distributed Snapshot System For Virtual Machine Cluster.",
                    "Supporting Undoability in Systems Operations.",
                    "Back to the Future: Fault-tolerant Live Update with Time-traveling State Transfer.",
                    "Live Upgrading Thousands of Servers from an Ancient Red Hat Distribution to 10 Year Newer Debian Based One.",
                    "Managing Smartphone Testbeds with SmartLab.",
                    "YinzCam: Experiences with In-Venue Mobile Video and Replays.",
                    "Challenges to Error Diagnosis in Hadoop Ecosystems.",
                    "Installation of an External Lustre Filesystem using Cray esMS management and Lustre 1.8.6."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "26th LISA 2012",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2012",
                "sub_name": "Strategies, Tools , and Techniques: Proceedings of the 26th Large Installation System Administration Conference, LISA 2012, San Diego, CA, USA, December 9-14, 2012.",
                "count": 22,
                "papers": [
                    "A Simple File Storage System for Web Applications.",
                    "IDO: Intelligent Data Outsourcing with Improved RAID Reconstruction Performance in Large-Scale Data Centers.",
                    "Theia: Visual Signatures for Problem Diagnosis in Large Hadoop Clusters.",
                    "Lessons in iOS Device Configuration Management.",
                    "A Declarative Approach to Automated Configuration.",
                    "Preventing the Revealing of Online Passwords to Inappropriate Websites with LoginInspector.",
                    "XUTools: Unix Commands for Processing Next-Generation Structured Text.",
                    "Managing User Requests With the Grand Unified Task System (GUTS).",
                    "Bayllocator: A Proactive System to Predict Server Utilization and Dynamically Allocate Memory Resources Using Bayesian Networks and Ballooning.",
                    "A Sustainable Model for ICT Capacity Building in Developing Countries.",
                    "Teaching System Administration.",
                    "Training and Professional Development in an IT Community.",
                    "Extensible Monitoring with Nagios and Messaging Middleware.",
                    "Efficient Multidimensional Aggregation for Large Scale Monitoring.",
                    "On the Accurate Identification of Network Service Dependencies in Distributed Systems.",
                    "What Your CDN Won't Tell You: Optimizing a News Website for Speed and Stability.",
                    "Building a 100K log/sec Logging Infrastructure.",
                    "Building a Protocol Validator for Business to Business Communications.",
                    "DNSSEC Deployment in .gov: Progress and Lessons Learned.",
                    "Building the Network Infrastructure for the International Mathematics Olympiad.",
                    "Lessons Learned When Building a Greenfield High Performance Computing Ecosystem.",
                    "Building a Wireless Network for a High Density of Users."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "25th LISA 2011",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2011",
                "sub_name": "The Past, Present, and Future of System Administration: Proceedings of the 25th Large Installation System Administration Conference, LISA 2011, Boston, MA, USA, December 4-9, 2011.",
                "count": 27,
                "papers": [
                    "Why Do Migrations Fail and What Can We Do about It?",
                    "Provenance for System Troubleshooting.",
                    "Debugging Makefiles with remake.",
                    "Automating Network and Service Configuration Using NETCONF and YANG.",
                    "Adventures in (Small) Datacenter Migration (Practice & Experience Report).",
                    "Experiences with BOWL: Managing an Outdoor WiFi Network (or How to Keep Both Internet Users and Researchers Happy?) (Practice & Experience Report).",
                    "Community-based Analysis of Netflow for Early Detection of Security Incidents.",
                    "WCIS: A Prototype for Detecting Zero-Day Attacks in Web Server Requests.",
                    "DarkNOC: Dashboard for Honeypot Management.",
                    "A Cuckoo's Egg in the Malware Nest: On-the-fly Signature-less Malware Analysis, Detection, and Containment for Large Networks.",
                    "Auto-learning of SMTP TCP Transport-Layer Features for Spam and Abusive Message Detection.",
                    "Using Active Intrusion Detection to Recover Network Trust.",
                    "Getting to Elastic: Adapting a Legacy Vertical Application Environment for Scalability.",
                    "Scaling on EC2 in a Fast-Paced Environment (Practice & Experience Report).",
                    "Deploying IPv6 in the Google Enterprise Network: Lessons Learned (Practice & Experience Report).",
                    "Bringing Up Cielo: Experiences with a Cray XE6 System, or, Getting Started with Your New 140k Processor System (Practice & Experience Report).",
                    "Capacity Forecasting in a Backup Storage Environment (Practice & Experience Report).",
                    "Content-aware Load Balancing for Distributed Backup.",
                    "Tiqr: A Novel Take on Two-Factor Authentication.",
                    "Building Useful Security Infrastructure for Free (Practice & Experience Report).",
                    "Local System Security via SSHD Instrumentation.",
                    "Sequencer: Smart Control of Hardware and Software Components in Clusters (and Beyond).",
                    "Automated Planning for Configuration Changes.",
                    "Fine-grained Access-control for the Puppet Configuration Language.",
                    "Staging Package Deployment via Repository Management.",
                    "CDE: Run Any Linux Application On-Demand Without Installation.",
                    "Improving Virtual Appliance Management through Virtual Layered File Systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "24th LISA 2010",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2010",
                "sub_name": "Uncovering the Secrets of System Administration: Proceedings of the 24th Large Installation System Administration Conference, LISA 2010, San Jose, CA, USA, November 7-12, 2010.",
                "count": 24,
                "papers": [
                    "When Anti-virus Doesn't Cut It: Catching Malware with SIEM.",
                    "In-Flight Mechanics: A Software Package Management Conversion Project.",
                    "Experiences with Eucalyptus: Deploying an Open Source Cloud.",
                    "The Margrave Tool for Firewall Analysis.",
                    "Towards Automatic Update of Access Control Policy.",
                    "First Step Towards Automatic Correction of Firewall Policy Faults.",
                    "A Survey of System Configuration Tools.",
                    "High Performance Multi-Node File Copies and Checksums for Clustered File Systems.",
                    "Fast and Secure Laptop Backups with Encrypted De-duplication.",
                    "Configuration Management for Mac OS X: It's Just Unix, Right?",
                    "Anycast as a Load Balancing Feature.",
                    "iSCSI SANs Don't Have to Suck.",
                    "PeerMon: A Peer-to-Peer Network Monitoring System.",
                    "Keeping Track of 70, 000+ Servers: The Akamai Query System.",
                    "Empirical Virtual Machine Models for Performance Guarantees.",
                    "RC2 - A Living Lab for Cloud Computing.",
                    "Using Syslog Message Sequences for Predicting Disk Failures.",
                    "Log Analysis and Event Correlation Using Variable Temporal Event Correlator (VTEC).",
                    "Chukwa: A System for Reliable Large-Scale Log Collection.",
                    "Implementing IPv6 at ARIN.",
                    "Internet on the Edge.",
                    "Managing Vendor Relations: A Case Study of Two HPC Network Issues.",
                    "Using TCP/IP Traffic Shaping to Achieve iSCSI Service Predictability.",
                    "YAF: Yet Another Flowmeter."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "23rd LISA 2009",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2009",
                "sub_name": "Proceedings of the 23rd Large Installation System Administration Conference, November 1-6, 2009, Baltimore, MD, USA.",
                "count": 12,
                "papers": [
                    "Pushing Boulders Uphill: The Difficulty of Network Intrusion Recovery.",
                    "Two-Person Control Administation: Preventing Administation Faults through Duplication.",
                    "The Water Fountain vs. the Fire Hose: An Examination and Comparison of Two Large Enterprise Mail Service Migrations.",
                    "Crossbow Virtual Wire: Network in a Box.",
                    "EVA: A Framework for Network Analysis and Risk Assessment.",
                    "An Analysis of Network Configuration Artifacts.",
                    "Secure Passwords Through Enhanced Hashing.",
                    "SEEdit: SELinux Security Policy Configuration System with Higher Level Language.",
                    "An SSH-based Toolkit for User-based Network Services.",
                    "Federated Access Control and Workflow Enforcement in Systems Configuration.",
                    "CIMDIFF: Advanced Difference Tracking Tool for CIM Compliant Devices.",
                    "Transparent Mobile Storage Protection in Trusted Virtual Domains."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "22nd LISA 2008",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2008",
                "sub_name": "Proceedings of the 22nd Large Installation System Administration Conference, LISA 2008, November 9-14, 2008, San Diego, CA, USA.",
                "count": 17,
                "papers": [
                    "Designing Tools for System Administrators: An Empirical Test of the Integrated User Satisfaction Model.",
                    "Dynamic Dependencies and Performance Improvement.",
                    "Automatic Software Fault Diagnosis by Exploiting Application Signatures.",
                    "Petascale System Management Experiences.",
                    "Rapid Parallel Systems Deployment: Techniques for Overnight Clustering.",
                    "ENAVis: Enterprise Network Activities Visualization.",
                    "Fast, Cheap, and in Control: Towards Pain-Free Security!",
                    "Concord: A Secure Mobile Data Authorization Framework for Regulatory Compliance.",
                    "Authentication on Untrusted Remote Hosts with Public-Key Sudo.",
                    "STORM: Simple Tool for Resource Management.",
                    "IZO: Applications of Large-Window Compression to Virtual Machine Management.",
                    "Portable Desktop Applications Based on P2P Transportation and Virtualization.",
                    "Topnet: A Network-aware top(1).",
                    "Fast Packet Classification for Snort by Native Compilation of Rules.",
                    "Sysman: A Virtual File System for Managing Clusters.",
                    "Devolved Management of Distributed Infrastructures with Quattor.",
                    "Authorisation and Delegation in the Machination Configuration System."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "21st LISA 2007",
        "info": "Dallas, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2007",
                "sub_name": "Proceedings of the 21th Large Installation System Administration Conference, LISA 2007, Dallas, Texas, USA, November 11-16, 2007.",
                "count": 67,
                "papers": [
                    "Autonomic Administration: HAL 9000 Meets Gene Roddenberry.",
                    "PolicyVis: Firewall Security Policy Visualization and Inspection.",
                    "Inferring Higher Level Policies from Firewall Rules.",
                    "Assisted Firewall Policy Repair Using Examples and History.",
                    "NetADHICT: A Tool for Understanding Network Traffic.",
                    "CAMP: A Common API for Measuring Performance.",
                    "Application Buffer-Cache Management for Performance: Running the World's Largest MRTG.",
                    "Stork: Package Management for Distributed VM Environments.",
                    "Decision Support for Virtual Machine Re-Provisioning in Production Environments.",
                    "OS Circular: Internet Client for Reference.",
                    "Secure Isolation of Untrusted Legacy Applications.",
                    "Policy-Driven Management of Data Sets.",
                    "ATLANTIDES: An Architecture for Alert Verification in Network Intrusion Detection Systems.",
                    "PDA: A Tool for Automated Problem Determination.",
                    "Usher: An Extensible Framework for Managing Clusters of Virtual Machines.",
                    "Remote Control: Distributed Application Configuration, Management, and Visualization with Plush.",
                    "Everlab: A Production Platform for Research in Network Experimentation and Computation.",
                    "Master Education Programmes in Network and System Administration.",
                    "On Designing and Deploying Internet-Scale Services.",
                    "RepuScore: Collaborative Reputation Management Framework for Email Infrastructure.",
                    "Moobi: A Thin Server Management System Using BitTorrent.",
                    "PoDIM: A Language for High-Level Configuration Management.",
                    "Network Patterns in Cfengine and Scalable Data Aggregation.",
                    "The Biggest Game of Clue You Have Ever Played.",
                    "Scaling Production Repairs and QA Operations in a Live Environment.",
                    "Scaling Production Repairs and QA Operations in a Live Environment.",
                    "Who's the Boss? Autonomics and New-Fangled Security Gizmos with Minds of Their Own.",
                    "Experiences with Scalable Network Operations at Akamai.",
                    "Using Throttling and Traffic Shaping to Combat Botnet Spam.",
                    "Homeless Vikings: BGP Prefix Hijacking and the Spam Wars.",
                    "Hardening Your Systems Against Litigation.",
                    "Prince Caspian on Location: Commodity Hardware and Gaffer Tape.",
                    "Deploying Nagios in a Large Enterprise Environment.",
                    "A Service-Oriented Data Grid: Beyond Storage Virtualization.",
                    "No Terabyte Left Behind.",
                    "Ganeti: An Open Source Multi-Node HA Cluster Based on Xen.",
                    "Beyond NAC: What's Your Next Step?",
                    "Data Center Growing Pains.",
                    "The Security Butterfly Effect.",
                    "Virtualization/VMware.",
                    "Samba.",
                    "UNIX and Microsoft Interoperability.",
                    "AFS.",
                    "Data Center Design.",
                    "ZFS.",
                    "NTP.",
                    "Legal Issues/Forensics.",
                    "SIP/VoIP.",
                    "LDAP.",
                    "Databases: Hit the Ground, Running?",
                    "Everything You Need to Know About Spam (in 15 Minutes).",
                    "Datacenter Design Issues.",
                    "Active Directory Group Policy for UNIX.",
                    "Autonomic Computing: Our Hopes, Dreams, and Fears.",
                    "NetFlow; or, How to Know What Your Network Really Did Without Going Broke.",
                    "ZFS.",
                    "Jails, VMs, and Sandboxes.",
                    "Eco Computing: Improving Data Center Energy Efficiency.",
                    "VoIP with NATs and Firewalls.",
                    "OpenLDAP: Highlights for 2.4.",
                    "Ruby: Productivity or Penance?.",
                    "Ganeti: An Open Source High-Availability Cluster Based on Xen.",
                    "How to Get Your LISA Paper Accepted.",
                    "The LHC Computing Challenge.",
                    "The Economic Meltdown of Moore's Law and the Green Data Center.",
                    "Should the Root Prompt Require a Road Test?",
                    "Cookin' at the Keyboard."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "20th LISA 2006",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2006",
                "sub_name": "Proceedings of the 20th Conference on Systems Administration (LISA 2006), Washington, DC, USA, December 3-8, 2006.",
                "count": 62,
                "papers": [
                    "Keynote Address: Hollywood's Secret War on Your NOC.",
                    "Privilege Messaging: An Authorization Framework over Email Infrastructure.",
                    "Securing Electronic Mail on the National Research and Academic Network of Italy.",
                    "A Forensic Analysis of a Distributed Two-Stage Web-Based Spam Attack (Awarded Honorable Mention!).",
                    "Firewall Analysis with Policy-based Host Classification.",
                    "Secure Mobile Code Execution Service.",
                    "FLAIM: A Multi-level Anonymization Framework for Computer and Network Logs.",
                    "Centralized Security Policy Support for Virtual Machine.",
                    "A Platform for RFID Security and Privacy Administration (Awarded Best Paper!).",
                    "Specification-Enhanced Policies for Automated Management of Changes in IT Systems.",
                    "Experience Implementing an IP Address Closure.",
                    "Modeling Next Generation Configuration Management Tools.",
                    "Windows XP Kernel Crash Analysis.",
                    "SUEZ: A Distributed Safe Execution Environment for System Administration Trials.",
                    "WinResMon: A Tool for Discovering Software Dependencies, Configuration, and Requirements in Microsoft Windows.",
                    "LiveOps: Systems Management as a Service.",
                    "Managing Large Networks of Virtual Machines.",
                    "Directing Change Using Bcfg2.",
                    "NAF: The NetSA Aggregated Flow Tool Suite.",
                    "Interactive Network Management Visualization with SVG and AJAX.",
                    "Bridging the Host-Network Divide: Survey, Taxonomy, and Solution.",
                    "The NMI Build & Test Laboratory: Continuous Integration Framework for Distributed Computing Software.",
                    "Unifying Unified Voice Messaging.",
                    "Fighting Institutional Memory Loss: The Trackle Integrated Issue and Solution Tracking System.",
                    "Teaching Problem Solving: You Can and You Should.",
                    "Sysadmins, Network Managers, and Wiretap Law.",
                    "Site Reliability at Google/My First Year at Google.",
                    "Leveraging the IT Community.",
                    "Open Source Software and Its Role in Space Exploration.",
                    "Virtualization: The Good, the Bad, the Ugly.",
                    "Everything You Know About Monitoring Is Wrong.",
                    "Is Entropy Winning? Drowning in the Data Tsunami.",
                    "Perfect Data in an Imperfect World.",
                    "QA and the System Administrator.",
                    "High Availability: From Luxury to Commonplace Necessity in 10 Years.",
                    "What Do You Mean, Identity 2.0?.",
                    "The Last, Best Hope: Sysadmins and DBAs as the Last Guardians of Privacy.",
                    "Command and Control: System Administration at U.S. Central Command.",
                    "Seriously, Tape-Only Backup Systems Are Dead.",
                    "Power-Managed Storage: Longer Data Life and Lower Energy Consumption.",
                    "System Administration: Drowning in Management Complexity.",
                    "Black Ops 2006: Pattern Recognition.",
                    "Zombies and Botnets: Attacks on Messaging Security by Organized Criminal Enterprises.",
                    "Corporate Security: A Hacker Perspective.",
                    "UNIX and Microsoft Interoperability.",
                    "LDAP.",
                    "Spam.",
                    "VoIP.",
                    "How to Get Your Paper Accepted at LISA.",
                    "Time Management for System Administrators.",
                    "Virtualization and the Virtual Infrastructure.",
                    "Backups.",
                    "Identity Management.",
                    "AFS.",
                    "Build a Linux Oracle RAC Cluster.",
                    "NFSv4.",
                    "SNMP.",
                    "Bad Interview Questions.",
                    "Spam.",
                    "Mac OS X.",
                    "bcfg2.",
                    "Puppet."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "19th LISA 2005",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2005",
                "sub_name": "Proceedings of the 19th Conference on Systems Administration (LISA 2005), December 4-9, 2005, San Diego, California, USA.",
                "count": 57,
                "papers": [
                    "Keynote Address: Scaling Search Beyond the Public Web.",
                    "GULP: A Unified Logging Architecture for Authentication Data.",
                    "Toward an Automated Vulnerability Comparison of Open Source IMAP Servers (Awarded Best Student Paper!).",
                    "Fast User-Mode Rootkit Scanner for the Enterprise.",
                    "Configuration Tools: Working Together.",
                    "A Case Study in Configuration Management Tool Deployment.",
                    "Reducing Downtime Due to System Maintenance and Upgrades (Awarded Best Student Paper!).",
                    "About the Integration of Mac OS X Devices into a Centrally Managed UNIX Environment.",
                    "RegColl: Centralized Registry Framework for Infrastructure System Management.",
                    "Herding Cats: Managing a Mobile UNIX Platform.",
                    "Open Network Administrator (ONA) - A Web-based Network Management Tool.",
                    "An Open Source Solution for Testing NAT'd and Nested iptables Firewalls.",
                    "Towards Network Awareness.",
                    "Toward a Cost Model for System Administration (Awarded Best Paper!).",
                    "Voluntary Cooperation in Pervasive Computing Services.",
                    "Network Configuration Management via Model Finding.",
                    "Visualizing NetFlows for Security at Line Speed: The SIFT Tool Suite.",
                    "Interactive Traffic Analysis and Visualization with Wisconsin Netpy.",
                    "NetViewer: A Network Traffic Visualization and Analysis Tool.",
                    "A1: Spreadsheet-based Scripting for Developing Web Tools.",
                    "Hostdb: The Best Damn host2DNS/DHCP Script Ever Written.",
                    "Solaris Service Management Facility: Modern System Startup and Administration.",
                    "Towards a Deep-Packet-Filter Toolkit for Securing Legacy Resources.",
                    "Administering Access Control in Dynamic Coalitions.",
                    "Manage People, Not Userids.",
                    "Computing on Amateur Satellites.",
                    "Network Black Ops: Extracting Unexpected Functionality from Existing Networks.",
                    "What Big Sites Can Learn from Little Sites.",
                    "Building MIT's Stata Center: An IT Perspective.",
                    "Under 200: Applying IS Best Practices to Small Companies.",
                    "What's a PKI, Why Would I Want One, and How Should it Be Designed?",
                    "Modern Trends in UNIX and Linux Infrastructure Management.",
                    "Incident Command for IT: What We Can Learn from the Fire Department.",
                    "Automatic PC Desktop Management with Virtualization Technology.",
                    "What's the Worst That Could Happen?",
                    "Internet Counter-Intelligence: Offense and Defense.",
                    "Preventing Child Neglect in DNSSECbis Using Lookaside Validation (DLV).",
                    "How Sysadmins Can Protect Free Speech and Privacy on the Electronic Frontier.",
                    "Wireless Security.",
                    "Weblogs, Wikis, and RSS for System Administrators.",
                    "Using Your Body for Authentication: A Biometrics Guide for System Administrators.",
                    "Silly Network Management Tricks.",
                    "Picking Locks with Cryptology.",
                    "Backups.",
                    "LDAP.",
                    "Spam.",
                    "AFS.",
                    "Samba.",
                    "VoIP.",
                    "Project Management.",
                    "Time Management.",
                    "Change Management.",
                    "Security/Cryptography.",
                    "Apache/OpenSSL/DNSSEC.",
                    "Mac OS X.",
                    "Solaris 10: System/DTrace/Zones/SMF.",
                    "Virtualization."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "18th LISA 2004",
        "info": "Atlanta, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2004",
                "sub_name": "Proceedings of the 18th Conference on Systems Administration (LISA 2004), Atlanta, USA, November 14-19, 2004.",
                "count": 52,
                "papers": [
                    "Keynote Address: Going Digital at CNN.",
                    "Scalable Centralized Bayesian Spam Mitigation with Bogofilter (Awarded Best Paper!).",
                    "DIGIMIMIR: A Tool for Rapid Situation Analysis of Helpdesk and Support Email.",
                    "Gatekeeper: Monitoring Auto-Start Extensibility Points (ASEPs) for Spyware Management.",
                    "A Machine-Oriented Vulnerability Database for Automated Vulnerability Detection and Processing.",
                    "DigSig: Runtime Authentication of Binaries at Kernel Level.",
                    "I3FS: An In-Kernel Integrity Checker and Intrusion Detection File System.",
                    "Nix: A Safe and Policy-Free System for Software Deployment.",
                    "Auto-configuration by File Construction: Configuration Management with newfig.",
                    "AIS: A Fast, Disk Space Efficient \"Adaptable Installation System\" Supporting Multitudes of Diverse Software Configurations.",
                    "autoMAC: A Tool for Automating Network Moves, Adds, and Changes.",
                    "More Netflow Tools for Performance and Security.",
                    "Experience Talk: FDR: A Flight Data Recorder Using Black-BoxAnalysis of Persistent State Changes for Managing Change and Configuration.",
                    "Real-time Log File Analysis Using the Simple Event Correlator (SEC).",
                    "Combining High Level Symptom Descriptions and Low Level State Information for Configuration Fault Diagnosis.",
                    "LifeBoat: An Autonomic Backup and Restore Solution.",
                    "PatchMaker: A Physical Network Patch Manager Tool.",
                    "Who Moved My Data? A Backup Tracking System for Dynamic Workstation Environments.",
                    "Making a Game of Network Security.",
                    "Securing the PlanetLab Distributed Testbed: How to Manage Security in an Environment with No Firewalls, with All Users Having Root, and No Direct Physical Control of Any System.",
                    "Secure Automation: Achieving Least Privilege with SSH, Sudo, and Suid.",
                    "Experience in Implementing an HTTP Service Closure.",
                    "Meta Change Queue: Tracking Changes to People, Places, and Things.",
                    "Solaris Zones: Operating System Support for Consolidating Commercial Workloads.",
                    "What Is This Thing Called System Configuration?",
                    "Anomaly Detection: Whatever Happened to Computer Immunology?",
                    "LiveJournal's Backend and memcached: Past, Present, and Future.",
                    "Documentation.",
                    "The Administrator, Then and Now.",
                    "Lessons Learned from Howard Dean's Digital Campaign.",
                    "Filtering, Stamping, Blocking, Anti-Spoofing: How to Stop the Spam.",
                    "Lessons Learned Reimplementing an ISP Mail Service Infrastructure to Cope with Spam.",
                    "What Spammers Are Doing to Get Around Bayesian Filtering & What We Can Expect for the Future.",
                    "A System Administrator's Introduction to Bioinformatics.",
                    "What Information Security Laws Mean For You.",
                    "NFS, Its Applications and Future.",
                    "The Security Role of Linguistic Content Analysis.",
                    "Grid Computing: Just What Is It and Why Should I Care?",
                    "A New Approach to Scripting.",
                    "Flying Linux.",
                    "System Administration and Sex Therapy: The Gentle Art of Debugging.",
                    "Used Disk Drives.",
                    "Storage Security: You're Fooling Yourself.",
                    "Samba.",
                    "Mac OS X.",
                    "Linux.",
                    "Backups.",
                    "AFS.",
                    "VoIP and IETF Standards.",
                    "RAID/HA/SAN (with a Heavy Dose of Veritas).",
                    "Professional Growth.",
                    "Configuration Management."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "17th LISA 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2003",
                "sub_name": "Proceedings of the 17th Conference on Systems Administration (LISA 2003), San Diego, California, USA, October 26-31, 2003.",
                "count": 53,
                "papers": [
                    "Inside eBay.com: The System Administrator's Perspective.",
                    "Radmind: The Integration of Filesystem Integrity Checking with Filesystem Management.",
                    "Further Torture: More Testing of Backup and Archive Programs.",
                    "An Analysis of Database-Driven Mail Servers.",
                    "A Secure and Transparent Firewall Web Proxy.",
                    "Designing, Developing, and Implementing a Document Repository.",
                    "DryDock: A Document Firewall.",
                    "Run-time Detection of Heap-based Overflows.",
                    "Designing a Configuration Monitoring and Reporting Environment.",
                    "New NFS Tracing Tools and Techniques for System Analysis.",
                    "EasyVPN: IPsec Remote Access Made Easy.",
                    "The Yearly Review, or How to Evaluate Your Sys Admin.",
                    "Peer Certification: Techniques and Tools for Reducing System Admin Support Burdens While Improving Customer Service.",
                    "ISconf: Theory, Practice, and Beyond.",
                    "Seeking Closure in an Open World: A Behavioral Agent Approach to Configuration Management.",
                    "Archipelago: A Network Security Analysis Tool.",
                    "Three Practical Ways to Improve Your Network.",
                    "Tossing Packets Over the Wall Using Transmit-Only Ethernet Cables.",
                    "The Realities of Deploying Desktop Linux.",
                    "STRIDER: A Black-box, State-based Approach to Change and Configuration Management and Support.",
                    "CDSS: Secure Distribution of Software Installation Media Images in a Heterogeneous Environment.",
                    "Virtual Appliances for Deploying and Maintaining Software.",
                    "Generating Configuration Files: The Director's Cut.",
                    "Preventing Wheel Reinvention: The psgconf System Configuration Framework.",
                    "SmartFrog Meets LCFG: Autonomous Reconfiguration with Central Policy Control.",
                    "Distributed Tarpitting: Impeding Spam Across Multiple Servers.",
                    "Using Service Grammar to Diagnose BGP Configuration Errors.",
                    "Splat: A Network Switch/Port Configuration Management Tool.",
                    "Outsourcing: Common Problems and Current Trends in the Outsourcing Industry.",
                    "Organizational Maturity Models: Achieving Success and Happiness in Modern IT Environments.",
                    "Internet Governance Reloaded.",
                    "Coping with the Disappearance of Network Boundaries.",
                    "Security vs. Science: Changing the Security Culture of a National Lab.",
                    "Through the Lens Geekly: How Sysadmins Are Portrayed in Pop Culture.",
                    "Security Lessons from \"Best in Class\" Organizations.",
                    "Stick, Rudder, and Keyboard: How Flying My Airplane Makes Me a Better Sysadmin.",
                    "A Case Study in Internet Pathology: Flawed Routers Flood University's Network.",
                    "Network Telescopes: Tracking Denial-of-Service Attacks and Internet Worms Around the Globe.",
                    "High Risk Information: Safe Handling for System Administrators.",
                    "Talking to the Walls (Again).",
                    "How to Get Your Papers Accepted at LISA.",
                    "What Washington Still Doesn't Get.",
                    "Security Without Firewalls.",
                    "Emerging Spam-Fighting Techniques.",
                    "Adaptive Filtering: One Year On.",
                    "Panel Discussion: Current Best Practices and Forthcoming Advances.",
                    "IPsec.",
                    "AFS.",
                    "MBAs for Sys Admins.",
                    "PKI/Cryptography.",
                    "Linux.",
                    "Automated System Administration/Infrastructure.",
                    "Professional Growth and Development."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "16th LISA 2002",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2002",
                "sub_name": "Proceedings of the 16th Conference on Systems Administration (LISA 2002), Philadelphia, PA, USA, November 3-8, 2002.",
                "count": 51,
                "papers": [
                    "Keynote: Scaling the Web: An Overview of Google (A Linux Cluster for Fun and Profit).",
                    "Work-Augmented Laziness with the Los Task Request System.",
                    "Spam Blocking with a Dynamically Updated Firewall Ruleset.",
                    "Holistic Quota Management: The Natural Path to a Better, More Efficient Quota System.",
                    "Application Aware Management of Internet Data Center Software.",
                    "Geographically Distributed System for Catastrophic Recovery.",
                    "Embracing and Extending Windows 2000.",
                    "Stem: The System Administration Enabler.",
                    "Pan: A High-Level Configuration Language.",
                    "Why Order Matters: Turing Equivalence in Automated Systems Administration.",
                    "An Analysis of RPM Validation Drift.",
                    "RTG: A Scalable SNMP Statistics Architecture for Service Providers.",
                    "Environmental Acquisition in Network Management.",
                    "A Simple Way to Estimate the Cost of Downtime.",
                    "An Approach for Secure Software Installation.",
                    "Network-based Intrusion Detection - Modeling for a Larger Picture.",
                    "Timing the Application of Security Patches for Optimal Uptime.",
                    "A New Architecture for Managing Enterprise Log Data.",
                    "MieLog: A Highly Interactive Visual Log Browser Using Information Visualization and Statistical Analysis.",
                    "Process Monitor: Detecting Events That Didn't Happen.",
                    "Defining and Monitoring Service-Level Agreements for Dynamic e-Business.",
                    "HotSwap-Transparent Server Failover for Linux.",
                    "Over-Zealous Security Administrators Are Breaking the Internet.",
                    "\"Who ARE These People?\" Internet Governance, Peering, and Legislation.",
                    "SysAdmin, Stories, and Signing: Learning from Communication Experts.",
                    "My Years with the NSA Red Team.",
                    "Panel: Nobody Notices Until It's Broken: Self-Marketing for Sysadmins.",
                    "Perl 6.",
                    "How to Write a Book with Someone You Don't Know: Internet Collaboration for the Truly Geeky.",
                    "Security on Macintosh OS X.",
                    "The Evolving Ethics of System Administration.",
                    "The Constitutional & Financial Argument Against Spam.",
                    "Risk-Taking vs. Management.",
                    "So You Want to Do a Startup?",
                    "Making Backups Easier with Disk.",
                    "Domain Name Server Comparison: BIND 8 vs. BIND 9 vs. djbdns vs. ???",
                    "Load Balancers.",
                    "Large-Scale 802.11 Deployment.",
                    "Internet Security: Beyond Firewalls, Passwords, and Crypto.",
                    "The Promise of Privacy.",
                    "The Intrusion Detection Timeline.",
                    "Performance Tuning Guru.",
                    "System Monitoring Guru.",
                    "Infrastructures Guru.",
                    "SAMBA Guru.",
                    "AFS Gurus.",
                    "Consulting Guru.",
                    "Backups Guru.",
                    "Perl/Scripting Gurus.",
                    "Email/MTAs Guru.",
                    "Project Management Guru."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "15th LISA 2001",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2001",
                "sub_name": "Proceedings of the 15th Conference on Systems Administration (LISA 2001), San Diego, California, USA, December 2-7, 2001.",
                "count": 73,
                "papers": [
                    "Keynote Address: Slime vs. Silicon.",
                    "Keynote: Rebuilding the Digital Enterprise Around Internet Standards.",
                    "CNN.com: Facing a World Crisis.",
                    "Defining the Role of Service Manager: Sanity Through Organizational Evolution.",
                    "Remote Outsourcing Services for Multiple Branch Offices and Small Businesses via the Internet.",
                    "A Probabilistic Approach to Estimating Computer System Reliability (Awarded Best Theory Paper!).",
                    "Scheduling Partially Ordered Events in a Randomised Framework: Empirical Results and Implications for Automatic Configuration Management.",
                    "The Maelstrom: Network Service Debugging via \"Ineffective Procedures\".",
                    "Performance Evaluation of Linux Virtual Server.",
                    "Measuring Real-World Data Availability.",
                    "Simulation of User-Driven Computer Behaviour.",
                    "Specific Simple Network Management Tools.",
                    "Gossips: System and Service Monitor.",
                    "The CoralReef Software Suite as a Tool for System and Network Administrators.",
                    "Global Impact Analysis of Dynamic Library Dependencies.",
                    "Tools to Administer Domain and Type Enforcement.",
                    "Solaris Bare-Metal Recovery from a Specialized CD and Your Enterprise Backup Solution.",
                    "Accessing Files on Unmounted Filesystems.",
                    "Automating Infrastructure Composition for Internet Services.",
                    "TemplateTree II: The Post-Installation Setup Tool.",
                    "The Arusha Project: A Framework for Collaborative UNIX System Administration.",
                    "LEXIS: An EXam Invigilation System (Awarded Best Applied Paper!).",
                    "Dynamic Sublists: Scaling Unmoderated Mailing Lists.",
                    "GEORDI: A Handheld Tool for Remote System Administration.",
                    "Pelican DHCP Automated Self-Registration System: Distributed Registration and Centralized Management.",
                    "A Management System for Network-Shareable Locally Installed Software: Merging RPM and the Depot Scheme Under Solaris.",
                    "File Distribution Efficiencies: cfengine Versus rsync.",
                    "CfAdmin: A User Interface for cfengine.",
                    "Security for E-Voting in Public Elections.",
                    "2001: A Communications Anniversary.",
                    "Internet Measurement: Myths About Internet Data.",
                    "150/5, 000 Years of (E-)Commerce: History Repeats Itself Again.",
                    "Rules of Thumb of System Administration.",
                    "What Sysadmins Need to Know About the New Intellectual Property Laws.",
                    "JINI Networking Technology and Ad-Hoc Networks.",
                    "Reducing System Complexity: A Case Study in Converging Environments.",
                    "SANs and NAS.",
                    "Zope.",
                    "If I Could Talk to the Animals--What Sysadmins Can Learn About Diagnostic Skills from Another Profession.",
                    "The Problem with Developers.",
                    "PHP for System Administration.",
                    "Hardening Windows 2000.",
                    "Panel: An Overview of Terascale Computing.",
                    "Invited Talk: San Diego Supercomputer Center's Blue Horizon.",
                    "Managing the Terascale: Lessons from a 750-Node Supercomputer.",
                    "Wrap-Up and Q & A.",
                    "Panel: Written Any Good Books Lately?",
                    "Panel: Scripting Languages Bake-Off.",
                    "Where Has All the Crypto Gone? Long Time Coming: A Speculative and Historical Talk.",
                    "SUS, an Object Reference Model for Distributing UNIX Super User Privileges.",
                    "IPSECvalidate: A Tool to Validate IPSEC Configurations.",
                    "ScanSSH: Scanning the Internet for SSH Servers.",
                    "Whither End-to-End: Placing Bandwidth and Trust at the Edge.",
                    "Crypto Blunders.",
                    "A Non-Traditional Approach to Network Security Control.",
                    "Beyond File Permissions: Controlling User Actions.",
                    "Are Baseline Computer Security Standards the Answer?",
                    "TCP Performance Tuning.",
                    "BPF Meets UVM.",
                    "How Not to Configure Your Firewall: A Field Guide to Common Firewall Configurations.",
                    "Macroscopic Internet Topology and Performance Measurements from the DNS Root Name Servers.",
                    "DNS Root/g TLD Server Measurements.",
                    "Inspection, Detection & Deflection: Armoring the Next Wave of Security Technology.",
                    "Panel: The Future of Computer Security.",
                    "LDAP.",
                    "AFS.",
                    "Infrastructure Architecture.",
                    "PKI/Cryptography.",
                    "Writing Papers for Usenix Refereed Track.",
                    "Backups.",
                    "Sysadmin for Suits.",
                    "Email MTAs.",
                    "Computer Room Design/Layout."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "14th LISA 2000",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/2000",
                "sub_name": "Proceedings of the 14th Conference on Systems Administration (LISA 2000), New Orleans, Louisiana, USA, December 3-8, 2000.",
                "count": 45,
                "papers": [
                    "Theoretical System Administration.",
                    "An Expectant Chat About Script Maturity.",
                    "An Improved Approach for Generating Configuration Files from a Database.",
                    "FOKSTRAUT and Samba--Dealing with Authentication and Performance Issues on a Large-scale Samba Service.",
                    "Designing a Data Center Instrumentation System.",
                    "Improving Availability in VERITAS Environments.",
                    "User-Centric Account Management with Heterogeneous Password Changing.",
                    "Pelendur: Steward of the Sysadmin.",
                    "Network Information Management and Distribution in a Heterogeneous and Decentralized Enterprise Environment.",
                    "Wide Area Network Packet Capture and Analysis.",
                    "Sequencing of Configuration Operations for IP Networks.",
                    "ND: A Comprehensive Network Administration and Analysis Tool.",
                    "Combining Cisco NetFlow Exports with Relational Database Technology for Usage Statistics, Intrusion Detection, and Network Forensics.",
                    "The OSU Flow-tools Package and CISCO NetFlow Logs.",
                    "FlowScan: A Network Traffic Flow Reporting and Visualization Tool.",
                    "xps--Dynamic Process Tree Watching Under X.",
                    "Extending UNIX System Logging with SHARP.",
                    "Peep (The Network Auralizer): Monitoring Your Network with Sound.",
                    "Thresh--A Data-Directed SNMP Threshold Poller.",
                    "eEMU: A Practical Tool and Language for System Monitoring and Event Management.",
                    "Aberrant Behavior Detection in Time Series for Network Monitoring.",
                    "PIKT: Problem Informant/Killer Tool.",
                    "Relieving the Burden of System Administration Through Support Automation.",
                    "FTP Mirror Tracker: A Few Steps Towards URN.",
                    "Deployme: Tellme's Package Management and Deployment System.",
                    "Automating Request-based Software Distribution.",
                    "Use of Cfengine for Automated, Multi-Platform Software and Patch Distribution.",
                    "Unleashing the Power of JumpStart: A New Technique for Disaster Recovery, Cloning, or Snapshotting a Solaris System.",
                    "A Linux Appliance Construction Setv.",
                    "Automating Dual Boot (Linux and NT) Installations.",
                    "Tracing Anonymous Packets to Their Approximate Source.",
                    "Analyzing Distributed Denial of Service Tools: The Shaft Case.",
                    "YASSP! A Tool for Improving Solaris Security.",
                    "SubDomain: Parsimonious Server Security.",
                    "NOOSE - Networked Object-Oriented Security Examiner.",
                    "How Not to Get Fleeced with Employee Stock Options.",
                    "SAGE Update.",
                    "The Digital House.",
                    "Dr. Felton Goes to Washington: A Personal View of the Microsoft Antitrust Case.",
                    "Experiences with Incident Response at The Ohio State University.",
                    "Integrating LDAP in a Heterogeneous Environment.",
                    "Mapping Corporate Intranets and Internets.",
                    "The Design and Implementation of Highly Scalable Email Systems.",
                    "SANs--From A To Reality.",
                    "Why the Documentation Sucks and What You Can Do About It."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "13th LISA 1999",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1999",
                "sub_name": "Proceedings of the 13th Conference on Systems Administration (LISA-99), Seattle, WA, USA, November 7-12, 1999.",
                "count": 27,
                "papers": [
                    "ssmail: Opportunistic Encryption in sendmail.",
                    "MJDLM: Majordomo based Distribution List Management.",
                    "RedAlert: A Scalable System for Application Monitoring.",
                    "Deconstructing User Requests and the Nine Step Model.",
                    "Adverse Termination Procedures -or- \"How To Fire A System Administrator\".",
                    "Organizing the Chaos: Managing Request Tickets in a Large Environment.",
                    "GTrace: A Graphical Traceroute Tool.",
                    "rat: A Secure Archiving Program With Fast Retrieval.",
                    "Cro-Magnon: A Patch Hunter-Gatherer.",
                    "A Retrospective on Twelve Years of LISA Proceedings.",
                    "Managing Security in Dynamic Networks.",
                    "It's Elementary, Dear Watson: Applying Logic Programming To Convergent System Management Processes.",
                    "NetReg: An Automated DHCP Registration System.",
                    "Dealing with Public Ethernet Jacks: Switches, Gateways, and Authentication.",
                    "NetMapper: Hostname Resolution Based on Client Network Location.",
                    "Enhancements to the Autofs Automounter.",
                    "The Advancement of NFS Benchmarking: SFS 2.0.",
                    "Moving Large Filesystems On-Line, Including Exiting HSM Filesystems.",
                    "ServiceTrak Meets NLOG/NMAP.",
                    "Burt: The Backup and Recovery Tool.",
                    "Design and Implementation of a Failsafe Print System.",
                    "Snort: Lightweight Intrusion Detection for Networks.",
                    "Internet Routing and DNS Voodoo in the Enterprises.",
                    "Moat: a Virtual Private Network Appliance and Services Platform.",
                    "Automated Installation of Linux Systems Using YaST.",
                    "Enterprise Rollouts with JumpStart.",
                    "Automated Client-side Integration of Distributed Application Servers."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "12th LISA 1998",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1998",
                "sub_name": "Proceedings of the 12th Conference on Systems Administration (LISA-98), Boston, MA, USA, December 6-11, 1998.",
                "count": 29,
                "papers": [
                    "TITAN.",
                    "Infrastructure: A Prerequisite for Effective Security.",
                    "SSU: Extending SSH for Secure Root Administration.",
                    "System Management With NetScript.",
                    "Accountworks: Users Create Accounts on SQL, Notes, NT, and UNIX.",
                    "Single Sign-On and the System Administrator.",
                    "Using Gigabit Ethernet to Backup Six Terabytes.",
                    "Configuring Database Systems.",
                    "A Configuration Distribution System for Heterogeneous Networks.",
                    "An NFSConfiguration Management System and its Underlying Object-Oriented Model.",
                    "Design and Implementation of an Administration System for Distributed Web Server.",
                    "MRTG: The Multi Router Traffic Grapher.",
                    "Wide Area Network Ecology.",
                    "Automatically Selecting a Close Mirror Based on Network Topology.",
                    "What to Do When the Lease Expires: A Moving Experience.",
                    "Anatomy of an Athena Workstation.",
                    "Bootstrapping an Infrastructure.",
                    "Ganymede: An Extensible and Customizable Directory Management Framework.",
                    "Building An Enterprise Printing System.",
                    "Large Scale Print Spool Service.",
                    "mkpkg: A software packaging tool.",
                    "SEPP: Software Installation and Sharing System.",
                    "Synctree for Single Point Installation, Upgrades, and OS Patches.",
                    "The Evolution of the CMD Computing Environment: A Case Study in Rapid Growth.",
                    "Computer Immunology.",
                    "A Visual Approach for Monitoring Logs.",
                    "Mailman: The GNU Mailing List Manager.",
                    "Drinking from the Fire(walls) Hose: Another Approach to Very Large Mailing Lists.",
                    "Request v3: A Modular, Extensible Task Tracking Tool."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "11th LISA 1997",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1997",
                "sub_name": "Proceedings of the 11th Conference on Systems Administration (LISA-97), San Diego, California, USA, October 26-31, 1997.",
                "count": 23,
                "papers": [
                    "Implementing a Generalized Tool for Network Monitoring.",
                    "Extensible, Scalable Monitoring for Clusters of Computers.",
                    "Monitoring Application Use with License Server Logs.",
                    "Automating 24x7 Support Response To Telephone Requests.",
                    "Turning the Corner: Upgrading Yourself from \"System Clerk\" to \"System Advocate\".",
                    "How to Control and Manage Change in a Commercial Data Center Without Losing Your Mind.",
                    "Developing Interim Systems.",
                    "A Large Scale Data Warehouse Application Case Study.",
                    "Shuse At Two: Multi-Host Account Administration.",
                    "A Web-Based Backup/Restore Method for Intel-based PC's.",
                    "Managing PC Operating Systems with a Revision Control System.",
                    "Bal - A Tool to Synchronize Document Collections Between Computers.",
                    "Increased Server Availability and Flexibility through Failover Capability.",
                    "The Cyclic News Filesystem: Getting INN To Do More With Less.",
                    "Adaptive Locks For Frequently Scheduled Tasks With Unpredictable Runtimes.",
                    "Creating a Network for Lucent Bell Labs Research South.",
                    "Pinpointing System Performance Issues.",
                    "Automation of Site Configuration Management.",
                    "Chaos Out of Order: A Simple, Scalable File Distribution Facility For 'Intentionally Heterogeneous' Networks.",
                    "An Analysis of UNIX System Configuration.",
                    "Tuning Sendmail for Large Mailing Lists.",
                    "Selectively Rejecting SPAM Using Sendmail.",
                    "A Better E-Mail Bouncer."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "10th LISA 1996",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1996",
                "sub_name": "Proceedings of the 10th Conference on Systems Administration (LISA 1996), Chicago, IL, USA, September 29 - October 4, 1996.",
                "count": 29,
                "papers": [
                    "Priv: Secure and Flexible Privileged Access Dissemination.",
                    "The Igor System Administration Tool.",
                    "Centralized Administration of Distributed Firewalls.",
                    "Shuse: Multi-Host Account Administration.",
                    "The Design and Implementation of a Network Account Management System.",
                    "UNIX Host Administration in a Hererogeneous Distributed Computing Environment.",
                    "Visualizing Huge Tracefiles with Xscal.",
                    "Using Visualization in System and Network Administration.",
                    "How to Avoid Learning Expect -or- Automating Automating Interactive Programs.",
                    "An LPD for the 90s.",
                    "RUST: Managing Problem Reports and To-Do Lists.",
                    "Renumbering: Threat or Menace.",
                    "OC3MON: Flexible, Affordable, High Performance Staistics Collection.",
                    "IP Multiplexing by Transparent Port-Address Translator.",
                    "Many Mail Domains, One Machine: The Forwarding Mailer.",
                    "How to Get There From Here: Scaling the Enterprise-Wide Mail Infrastructure.",
                    "Automatic and Reliable Elimination of E-mail Loops Based on Statistical Analysis.",
                    "MajorCool: A Web Interface to Majordomo.",
                    "The PGP Moose - Implementation and Experience.",
                    "The Brave Little Toaster Meets Usenet.",
                    "A Simple Caching File System for Application Serving.",
                    "Automating the Administration of Heterogeneous LANs.",
                    "PC Administration Tools: Using Linux to Manage Personal Computers.",
                    "Abstract Yourself With Modules.",
                    "SLINK: Simple, Effective Filesystem Maintenance Abstractions for Community-Based Administration.",
                    "Managing and Distributing Application Software.",
                    "A New Twist on Teaching System Administration.",
                    "Institute White Pages as a System Administration Problem.",
                    "New Fangled Phone Systems Pose New Challenges for System Administrators."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "9th LISA 1995",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1995",
                "sub_name": "Ninth System Administration Conference (LISA '95), September 18-22, 1995, Monterey, California, USA.",
                "count": 24,
                "papers": [
                    "lbnamed: A Load Balancing Name Server in Perl.",
                    "LPRng - An Enhanced Printer Spooler System.",
                    "Finding a Needle in a Virtual Haystack: Whois++ and the Whois++ Client Library.",
                    "Capital Markets Trading Floors, Current Practice.",
                    "Morgan Stanley's Aurora System: Designing a Next Generation Global Production Unix Environment.",
                    "How to Upgrade 1500 Workstations on Saturday, and Still Have Time to Mow the Yard on Sunday.",
                    "Security Administration in an Open Networking Environment.",
                    "Multi-platform Interrogation and Reporting with Rscan.",
                    "Exu: A System for Secure Delegation of Authority on an Insecure Network.",
                    "Administering Very High Volume Internet Services.",
                    "Bringing the MBONE Home: Experiences with Internal Use of Multicast-Based Conferencing Tools.",
                    "LACHESIS: A Tool for Benchmarking Internet Service Providers.",
                    "From Something to Nothing (and back).",
                    "Metrics for Management.",
                    "SQL_2_HTML: Automatic Generation of HTML Database Schemas.",
                    "Decentralising Distributed Systems Administration.",
                    "SPM: System for Password Management.",
                    "AGUS: An Automatic Multi-Platform Account Generation System.",
                    "OpenDist: Incremental Software Distribution.",
                    "filetsf: A File Transfer System Based on lpr/lpd.",
                    "Patch Control Mechanism for Large Scale Software.",
                    "From Twisting Country Lanes to MultiLane Ethernet SuperHighways.",
                    "From Thinnet to 10base-T, From Sys Admin to Network Manager.",
                    "Tracking Hardware Configurations in a Heterogeneous Network with syslogd."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "8th LISA 1994",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1994",
                "sub_name": "Proceedings of the 8th Conference on Systems Administration (LISA 1994), San Diego, California, USA, September 19-23, 1994.",
                "count": 25,
                "papers": [
                    "The Road To UNIX: A Report from the Fourth Estate.",
                    "Central System Administration in a Heterogeneous Unix Environment: GeNUAdmin.",
                    "Config: A Mechanism for Installing and Tracking System Configurations.",
                    "Towards a High-Level Machine Configuration System.",
                    "OMNICONF - Make OS Upgrade and Disk Crash Recovery Easier.",
                    "Automated Upgrades in a Lab Environment.",
                    "Tenwen: The Reengineering of a Computing Environment.",
                    "Kernel Mucking in Top.",
                    "Handling Passwords with Security and Reliability in Background Processes.",
                    "Breaking into Banks: Security Lessons Learned from Financial Services.",
                    "Soft: A Software Environment Abstraction Mechanism.",
                    "Beam: A Tool for Flexible Software Update.",
                    "Depot-Lite: A Mechanism for Managing Software.",
                    "SENDS, a Tool for Managing Domain Naming and Electronic Mail in a Large Organization.",
                    "Getting More Work Out Of Work Tracking Systems.",
                    "Managing the Ever-Growing To Do List.",
                    "Speeding Up UNIX Login by Caching the Initial Environment.",
                    "THE BNR Standard Login (A Login Configuration Manager).",
                    "Exporting Home Directories on Demand to PCs.",
                    "Monitoring Usage of Workstations with a Relational Database.",
                    "Adventures in the Evolution of a High-Bandwidth Network for Central Servers.",
                    "Pong: A Flexible Network Services Monitoring System.",
                    "Automating Printing Configuration.",
                    "Highly Automated Low Personnel System Administration in a Wall Street Environment.",
                    "The Group Administration Shell and the GASH Network Computing Environment."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "7th LISA 1993",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lisa/1993",
                "sub_name": "Proceedings of the 7th Conference on Systems Administration (LISA 1993), Monterey, California, USA, November 1-5, 1993.",
                "count": 32,
                "papers": [
                    "Opening Remarks and Announcements.",
                    "Keynote Address: A Management View of Systems Administration.",
                    "Collaborative Networked Communication: MUDs as Systems Tools.",
                    "Horses and Barn Doors: Evolution of Corporate Guidelines for Internet Usage.",
                    "Our Users have Root!",
                    "LUDE: A Distributed Software Library.",
                    "The Corporate Software Bank.",
                    "Customization in a UNIX Computing Environment.",
                    "Local Disk Depot - Customizing the Software Environment.",
                    "Methods for Maintaining One Source Tree in a Heterogeneous Environment.",
                    "Towards a POSIX Standard for Software Administration.",
                    "Managing the Mission Critical Environment.",
                    "Open Systems Formal Evaluation Process.",
                    "A Case Study on Moves and Mergers.",
                    "Guerrilla System Administration: Scaling Small Group Systems Administration To a Larger Installed Base.",
                    "Role-based System Administration or Who, What, Where, and How.",
                    "Delegation: Uniformity in Heterogeneous Distribued Administration.",
                    "satool - A System Administrator's Cockpit, An Implementation.",
                    "Sysctl: A Distributed System Control Package.",
                    "Automated System Monitoring and Notification with Swatch.",
                    "Where Did All The Bytes Go?",
                    "A Practical Approach to NFS Response Time Monitoring.",
                    "The Amanda Network Backkup Manager.",
                    "PLOD: Keep Track of What You're Doing.",
                    "How to Keep Track of Your Network Configuration.",
                    "Forecasting Disk Resource Requirements for a Usenet Server.",
                    "Simplifying System Administration Tasks: The UAMS Approach.",
                    "System Administration as a User Interface: An Extended Metaphor.",
                    "The System Administration Maturity Model - SAMM.",
                    "Establishing and Administering a Public Access Internet facility.",
                    "Implementing Execution Controls in Unix.",
                    "HLFSD: Delivering Email to Your $HOME."
                ]
            }
        ]
    }
]