[
    {
        "year": "2021",
        "name": "29th MASCOTS 2021",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2021",
                "sub_name": "29th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2021, Houston, TX, USA, November 3-5, 2021.",
                "count": 26,
                "papers": [
                    "Automated performance prediction of microservice applications using simulation.",
                    "Exact and Efficient Protective Jamming in SINR-based Wireless Networks.",
                    "Scaling Up The Performance of Distributed Key-Value Stores With In-Switch Coordination.",
                    "Towards Efficient I/O Scheduling for Collaborative Multi-Level Checkpointing.",
                    "S4BXI: the MPI-ready Portals 4 Simulator.",
                    "A Mixture Density Network Approach to Predicting Response Times in Layered Systems.",
                    "Mechanisms for Transition from Monolithic to Distributed Architecture in Software Development Process.",
                    "Precomputed Ionospheric Propagation for HF Wireless Sensor Transmission Scheduling.",
                    "Diffusion Analysis Improves Scalability of IoT Networks to Mitigate the Massive Access Problem.",
                    "Does XORing Pointers Save Bitflips for NVRAM?",
                    "A Case for SDN-based Network Virtualization.",
                    "Enabling Extremely Fine-grained Parallelism via Scalable Concurrent Queues on Modern Many-core Architectures.",
                    "Performance Evaluation of Automated Tape Library Systems.",
                    "An \"A+\" Heuristic for Dispatching in Large-Scale Systems with Unknown Server Speeds.",
                    "OLTP In Real Life: A Large-scale Study of Database Behavior in Modern Online Retail.",
                    "A Multiple Snapshot Attack on Deniable Storage Systems.",
                    "Performance Characterization of MPI_Allreduce in Cloud Data Center Networks.",
                    "Deep Learning Models for Automated Identification of Scheduling Policies.",
                    "Energy-Efficiency Comparison of Common Sorting Algorithms.",
                    "Understanding Energy Efficiency of Databases on Single Board Computers for Edge Computing.",
                    "Sparse Matrix-Vector Multiplication Cache Performance Evaluation and Design Exploration.",
                    "Efficient Brain-Inspired Hyperdimensional Learning with Spatiotemporal Structured Data.",
                    "Characterizing Machine Learning I/O Workloads on Leadership Scale HPC Systems.",
                    "REBAL: Channel Balancing for Payment Channel Networks.",
                    "Simulation Modeling of Urban E-Scooter Mobility.",
                    "Capri: Achieving Predictable Performance in Cloud Spot Markets."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th MASCOTS 2020",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2020",
                "sub_name": "28th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2020, Nice, France, November 17-19, 2020.",
                "count": 34,
                "papers": [
                    "Fabsim-X: A Simulation Framework for the Analysis of Large-Scale Topologies and Congestion Control Protocols in Data Center Networks.",
                    "Instability in Geo-Distributed Kubernetes Federation: Causes and Mitigation.",
                    "A Priority-based Dynamic Link Scheduling Algorithm Using Multi-criteria Decision Making in Wireless Body Area Networks.",
                    "Model-Aided Learning for URLLC Transmission in Unlicensed Spectrum.",
                    "μCache: a mutable cache for SMR translation layer.",
                    "Towards a common environment for learning scheduling algorithms.",
                    "Symbolic Execution for Network Functions with Time-Driven Logic.",
                    "Merkle Hash Grids Instead of Merkle Trees.",
                    "Non-Asymptotic Performance Analysis of Size-Based Routing Policies.",
                    "Performance Prediction for Data-driven Workflows on Apache Spark.",
                    "Investigating Genome Analysis Pipeline Performance on GATK with Cloud Object Storage.",
                    "Security-Performance Trade-offs of Kubernetes Container Runtimes.",
                    "Statistical Learning of Markov Chains of Programs.",
                    "Evaluating the Performance of a State-of-the-Art Group-oriented Encryption Scheme for Dynamic Groups in an IoT Scenario.",
                    "Mobile Network Traffic Forecasting Using Artificial Neural Networks.",
                    "Self-adaptive Threshold-based Policy for Microservices Elasticity.",
                    "Voilà: Tail-Latency-Aware Fog Application Replicas Autoscaler.",
                    "Effective Elastic Scaling of Deep Learning Workloads.",
                    "Adversarial Attacks in a Deep Reinforcement Learning based Cluster Scheduler.",
                    "New Centrality Measures in Networks and their Applications to the International Trade and Migration Networks.",
                    "Age of Information in an Overtake- Free Network of Quasi - Reversible Queues.",
                    "Optimum Checkpoints for Time and Energy.",
                    "Baloo: Measuring and Modeling the Performance Configurations of Distributed DBMS.",
                    "Incentive mechanism for collective coordination in an urban intelligent transportation system using G-networks.",
                    "Reliable Reverse Engineering of Intel DRAM Addressing Using Performance Counters.",
                    "Symbiotic HW Cache and SW DTLB Prefetching for DRAM/NVM Hybrid Memory.",
                    "Energy Packet Networks with general service time distribution.",
                    "COCOA: Cold Start Aware Capacity Planning for Function-as-a-Service Platforms.",
                    "A Smart Background Scheduler for Storage Systems.",
                    "A NUMA-aware NVM File System Design for Manycore Server Applications.",
                    "Infrastructure-Aware TensorFlow for Heterogeneous Datacenters.",
                    "Improving NAND flash performance with read heat separation.",
                    "TrimTuner: Efficient Optimization of Machine Learning Jobs in the Cloud via Sub-Sampling.",
                    "Concept Drift and Avoiding its Negative Effects in Predictive Modeling of Failures of Electricity Production Units in Power Plants."
                ]
            },
            {
                "sub_name_abbr": "conf/mascots/2020s",
                "sub_name": "Modelling, Analysis, and Simulation of Computer and Telecommunication Systems - 28th International Symposium, MASCOTS 2020, Nice, France, November 17-19, 2020, Revised Selected Papers.",
                "count": 17,
                "papers": [
                    "Performance, Energy Savings and Security: An Introduction.",
                    "Software Defined Network Dynamics via Diffusions.",
                    "Network Traffic Classification Using WiFi Sensing.",
                    "Performance Evaluation of the Packet Aggregation Mechanism of an N-GREEN Metro Network Node.",
                    "Random Neural Network for Lightweight Attack Detection in the IoT.",
                    "Contact Holdups and Their Impact for Overlay Delay Tolerant Networks.",
                    "The Random Neural Network as a Bonding Model for Software Vulnerability Prediction.",
                    "Non-neutrality with Users Deciding Differentiation: A Satisfying Option?",
                    "Measuring Performance of Fault Management in a Legacy System: An Alarm System Study.",
                    "SHAMan: A Flexible Framework for Auto-tuning HPC Systems.",
                    "Balanced Gray Codes for Reduction of Bit-Flips in Phase Change Memories.",
                    "QUIC Throughput and Fairness over Dual Connectivity.",
                    "Hypothesis-Based Comparison of IPv6 and IPv4 Path Distances.",
                    "LP WAN Gateway Location Selection Using Modified K-Dominating Set Algorithm.",
                    "Toolset for Run-Time Dataset Collection of Deep-Scene Information.",
                    "Measurement and Modeling of Tumblr Traffic.",
                    "Tail Latency in Datacenter Networks."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th MASCOTS 2019",
        "info": "Rennes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2019",
                "sub_name": "27th IEEE International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2019, Rennes, France, October 21-25, 2019.",
                "count": 44,
                "papers": [
                    "Performance and Stability Analysis of the Task Assignment Based on Guessing Size Routing Policy.",
                    "Resource Allocation in One-Dimensional Distributed Service Networks.",
                    "A Queuing Model of a Stream-Processing Server.",
                    "A Tool for the Automatic Derivation of Symbolic ODE from Symmetric Net Models.",
                    "Closer: A New Design Principle for the Privileged Virtual Machine OS.",
                    "Approximation with Error Bounds in Spark.",
                    "Tracking Application Fingerprint in a Trustless Cloud Environment for Sabotage Detection.",
                    "Practical Progress Verification of Descriptor-Based Non-Blocking Data Structures.",
                    "Theoretical and Experimental Evaluation of the Two-Level Processor Sharing Discipline for TCP Flows.",
                    "Unicast Inference of Additive Metrics in General Network Topologies.",
                    "Disaster-Resilient Cloud Services Provisioning in Elastic Optical Inter-Data Center Networks.",
                    "ExaPlan Archive: Data Placement and Provisioning for Large Storage Systems with Archival Tiers.",
                    "Distribution Fitting and Performance Modeling for Storage Traces.",
                    "Understanding the Design Trade-Offs of Hybrid Flash Controllers.",
                    "Is it Time to Revisit Erasure Coding in Data-Intensive Clusters?",
                    "On Virtual Network Embedding: Paths and Cycles.",
                    "How Often Should I Access My Online Social Networks?",
                    "Scalable Performance Analysis of Epidemic Routing Considering Skewed Location Visiting Preferences.",
                    "Characterization of IMAPS Email Traffic.",
                    "Effect of Shadowing on Energy Efficiency in Small Cellular Networks.",
                    "Campus-Level Instagram Traffic: A Case Study.",
                    "Application-Aware Adaptive Partitioning for Graph Processing Systems.",
                    "Towards Robust Data-Driven Parallel Loop Scheduling Using Bayesian Optimization.",
                    "Initial Experiments with Duet Benchmarking: Performance Testing Interference in the Cloud.",
                    "Bundling Together RAID Disk Arrays for Greater Protection and Easier Repairs.",
                    "K -MLIO: Enabling K -Means for Large Data-Sets and Memory Constrained Embedded Systems.",
                    "Optimizing Validation Phase of Hyperledger Fabric.",
                    "An Improved Model for System-Level Energy Minimization on Real-Time Systems.",
                    "Generating Optimal Thresholds in a Hysteresis Queue: Application to a Cloud Model.",
                    "Optimal Markovian Dynamic Control of Interference-Prone Server Farms.",
                    "Detecting Parametric Dependencies for Performance Models Using Feature Selection Techniques.",
                    "Microservice-Tailored Generation of Session-Based Workload Models for Representative Load Testing.",
                    "Modeling Speedup in Multi-OS Environments.",
                    "Practical Design Space Exploration.",
                    "Portable Cost Modeling for Auto-Vectorizers.",
                    "Prospects for Functional Address Translation.",
                    "iLSM-SSD: An Intelligent LSM-Tree Based Key-Value SSD for Data Analytics.",
                    "PREMSim: A Resilience Framework for Modeling Traditional and Emerging Memory Reliability.",
                    "Profiling the Usage of an Extreme-Scale Archival Storage System.",
                    "HyperMapper: a Practical Design Space Exploration Framework.",
                    "Benchmarking Parallel File System Sensitiveness to I/O patterns.",
                    "Leveraging cloud unused resources for Big data application while achieving SLA.",
                    "Thing in, a research platform for the Web of Things.",
                    "Orchestrating Android Malware Experiments."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th MASCOTS 2018",
        "info": "Milwaukee, WI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2018",
                "sub_name": "26th IEEE International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2018, Milwaukee, WI, USA, September 25-28, 2018.",
                "count": 34,
                "papers": [
                    "Content Popularity-Based Selective Replication for Read Redirection in SSDs.",
                    "Freezing Time: A New Approach for Emulating Fast Storage Devices Using VM.",
                    "Using Simulation to Design Scalable and Cost-Efficient Archival Storage Systems.",
                    "FSTL: A Framework to Design and Explore Shingled Magnetic Recording Translation Layers.",
                    "Tolerating Write Disturbance Errors in PCM: Experimental Characterization, Analysis, and Mechanisms.",
                    "Efficient Reconstruction Techniques for Disaster Recovery in Secret-Split Datastores.",
                    "CachedGC: Cache-Assisted Garbage Collection in Modern Solid State Drives.",
                    "A Robust Fault-Tolerant and Scalable Cluster-Wide Deduplication for Shared-Nothing Storage Systems.",
                    "ChewAnalyzer: Workload-Aware Data Management Across Differentiated Storage Pools.",
                    "Scheduling Distributed Resources in Heterogeneous Private Clouds.",
                    "MIRA: Proactive Music Video Caching Using ConvNet-Based Classification and Multivariate Popularity Prediction.",
                    "A Model-Driven Graybox Approach to Rehoming Service Chains.",
                    "Criso: An Incremental Scalable and Cost-Effective Data Center Interconnection by Using 2-Port Servers and low-end Switches.",
                    "Quantifying and Optimizing Data Access Parallelism on Manycores.",
                    "Entropy-Aware I/O Pipelining for Large-Scale Deep Learning on HPC Systems.",
                    "HPnGs go Non-Linear: Statistical Dependability Evaluation of Battery-Powered Systems.",
                    "Modeling, Analysis, and Characterization of Periodic Traffic on a Campus Edge Network.",
                    "JoiNS: Meeting Latency SLO with Integrated Control for Networked Storage.",
                    "Interference and Blockage Prediction in mmWave-Enabled HetNets.",
                    "SlimCache: Exploiting Data Compression Opportunities in Flash-Based Key-Value Caching.",
                    "TeaStore: A Micro-Service Reference Application for Benchmarking, Modeling and Resource Management Research.",
                    "Improving Performances of Log Mining for Anomaly Prediction Through NLP-Based Log Parsing.",
                    "Prometheus: Coherent Exploration of Hardware and Software Optimizations Using Aspen.",
                    "Network Cache Design Under Stationary Requests: Exact Analysis and Poisson Approximation.",
                    "Performance Benchmarking and Optimizing Hyperledger Fabric Blockchain Platform.",
                    "Elevating Commodity Storage with the SALSA Host Translation Layer.",
                    "Pacaca: Mining Object Correlations and Parallelism for Enhancing User Experience with Cloud Storage.",
                    "A Model-Based Approach to Streamlining Distributed Training for Asynchronous SGD.",
                    "Clustering for Load Balancing and Energy Efficiency in IoT Applications.",
                    "Evaluating Scalability Bottlenecks by Workload Extrapolation.",
                    "Moving Horizon Estimation of Service Demands in Queuing Networks.",
                    "An Evaluation of Asynchronous Software Events on Modern Hardware.",
                    "Overcoming Virtualization Overheads for Large-vCPU Virtual Machines.",
                    "Volumetric Hierarchical Heavy Hitters."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th MASCOTS 2017",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2017",
                "sub_name": "25th IEEE International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2017, Banff, AB, Canada, September 20-22, 2017.",
                "count": 26,
                "papers": [
                    "Performance Evaluation of Priority Queues for Fine-Grained Parallel Tasks on GPUs.",
                    "Nexus: Bringing Efficient and Scalable Training to Deep Learning Frameworks.",
                    "Characterizing Temperature, Power, and Soft-Error Behaviors in Data Center Systems: Insights, Challenges, and Opportunities.",
                    "Cost-Benefit Tradeoffs of Content Sharing in Personal Cloud Storage.",
                    "MPLEX: In-Situ Big Data Processing with Compute-Storage Multiplexing.",
                    "Lightweight Replication Through Remote Backup Memory Sharing for In-memory Key-Value Stores.",
                    "Delay Versus Stickiness Violation Trade-Offs for Load Balancing in Large-Scale Data Centers.",
                    "PTPmesh: Data Center Network Latency Measurements Using PTP.",
                    "Model-Based Performance Evaluation of Batch and Stream Applications for Big Data.",
                    "Toward Managing HPC Burst Buffers Effectively: Draining Strategy to Regulate Bursty I/O Behavior.",
                    "Swimming with Fishes and Sharks: Beneath the Surface of Queue-Based Ethereum Mining Pools.",
                    "Testing Black-Box SDN Applications with Formal Behavior Models.",
                    "Free Energy Approximations for CSMA Networks.",
                    "QDIME: QoS-Aware Dynamic Binary Instrumentation.",
                    "iQ: An Efficient and Flexible Queue-Based Simulation Framework.",
                    "Simulating Exploits for the Creation and Refinement of Detection Signatures.",
                    "Emulating the Power Consumption Behavior of Server Workloads Using CPU Performance Counters.",
                    "Optimal Peak Shaving Using Batteries at Datacenters: Characterizing the Risks and Benefits.",
                    "An Energy Efficient Demand-Response Model for High Performance Computing Systems.",
                    "SELF: A High Performance and Bandwidth Efficient Approach to Exploiting Die-Stacked DRAM as Part of Memory.",
                    "Quantifying the Potential Benefits of On-chip Near-Data Computing in Manycore Processors.",
                    "DEMM: A Dynamic Energy-Saving Mechanism for Multicore Memories.",
                    "An Analytical Model of Hardware Transactional Memory.",
                    "Modeling and Analysis of Performance Under Interference in the Cloud.",
                    "Competition and Peak-Demand Pricing in Clouds Under Tenants' Demand Response.",
                    "A Measurement-Based Approach to Performance Prediction in NoSQL Systems."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th MASCOTS 2016",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2016",
                "sub_name": "24th IEEE International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, MASCOTS 2016, London, United Kingdom, September 19-21, 2016.",
                "count": 68,
                "papers": [
                    "A Better Model for Job Redundancy: Decoupling Server Slowdown and Job Size.",
                    "Exact Analysis of Energy-Aware Multiserver Queueing Systems with Setup Times.",
                    "Optimal Provision of Multiple Service Types.",
                    "Picky: Efficient and Reproducible Sharing of Large Datasets Using Merkle-Trees.",
                    "An Uncertainty-Aware Approach to Optimal Configuration of Stream Processing Systems.",
                    "Parallel Graph Processing on Modern Multi-core Servers: New Findings and Remaining Challenges.",
                    "Performance Evaluation of a Tape Library System.",
                    "Stochastic Modeling of Hybrid Cache Systems.",
                    "Exploiting Replication for Energy Efficiency of Heterogeneous Storage Systems.",
                    "Modeling the Energy-Time Performance of MIC Architecture System.",
                    "ALUPower: Data Dependent Power Consumption in GPUs.",
                    "Experimental Calibration and Validation of a Speed Scaling Simulator.",
                    "Static Program Analysis for Identifying Energy Bugs in Graphics-Intensive Mobile Apps.",
                    "Performance Modeling of Virtual Switching Systems.",
                    "Evacuee Flow Optimisation Using G-Network with Multiple Classes of Positive Customers.",
                    "Modeling Energy Packets Networks in the Presence of Failures.",
                    "A Diffusion Model for Energy Harvesting Sensor Nodes.",
                    "Performance Model Derivation of Operational Systems through Log Analysis.",
                    "Pilot: A Framework that Understands How to Do Performance Benchmarks the Right Way.",
                    "QoS-Aware CAPEX Minimization in Urban Off-Grid Radio Access Networks.",
                    "Vertical Integration of CDN and Network Operator: Model and Analysis.",
                    "Cloud-Based Spectrum Sharing in Virtual Wireless Networks.",
                    "Geographic Routing in Extreme-Scale Highly-Dynamic Mobile Ad Hoc Networks.",
                    "RESAR: Reliable Storage at Exabyte Scale.",
                    "I/O Scheduling Schemes for Better I/O Proportionality on Flash-Based SSDs.",
                    "An Empirical Evaluation of Enterprise and SATA-Based Transactional Solid-State Drives.",
                    "Diplomat: Mapping of Multi-kernel Applications Using a Static Dataflow Abstraction.",
                    "Prospects for Shaping User-Centric Mobile Application Workloads to Benefit the Cloud.",
                    "Configurable and Efficient Memory Access Tracing via Selective Expression-Based x86 Binary Instrumentation.",
                    "Robust Server Consolidation: Coping with Peak Demand Underestimation.",
                    "A Model Predictive Controller for Contention-Aware Resource Allocation in Virtualized Data Centers.",
                    "Optimizing Secure SDN-Enabled Inter-Data Centre Overlay Networks through Cognitive Routing.",
                    "Energy Efficient Policies for Upstream Content Server Selection.",
                    "Online Work Distribution to Clouds.",
                    "Queueing Analysis of Software Defined Network with Realistic OpenFlow-Based Switch Model.",
                    "Autoscaling Effects in Speed Scaling Systems.",
                    "Achieving Efficiency without Sacrificing Model Accuracy: Network Calculus on Compact Domains.",
                    "Bounding Aggregations on Phase-Type Arrivals for Performance Analysis of Clouds.",
                    "A Performance Approach to Mobile Security.",
                    "Is Multipath TCP (MPTCP) Beneficial for Video Streaming over DASH?",
                    "Parallel HTTP for Video Streaming in Wireless Networks.",
                    "Optimal Cell Assignment Algorithms for Pico-Cell Networks.",
                    "Hello Packet Interval Effects on the Overall Network Performance of a Wireless Network after Next (WNaN) Radio Network.",
                    "Performance Evaluation of Fischer's Protocol through Steady-State Analysis of Markov Regenerative Processes.",
                    "Product-Forms for Probabilistic Input/Output Automata.",
                    "Efficient Timeout Synthesis in Fixed-Delay CTMC Using Policy Iteration.",
                    "A Markov Reward Model Based Greedy Heuristic for the Virtual Network Embedding Problem.",
                    "A Platform for Run-Time Health Verification of Elastic Cyber-Physical Systems.",
                    "Energy Storage in Smart Homes: Grid-Convenience Versus Self-Use and Survivability.",
                    "Towards Systemic Risk Aware Engineering of Large-Scale Networks: Complex Systems Perspective.",
                    "Towards a Scalable Test Solution for the Analysis of Interconnect Shorts in On-chip Networks.",
                    "LayerMover: Storage Migration of Virtual Machine across Data Centers Based on Three-Layer Image Structure.",
                    "Write Amplification with Write Skew.",
                    "Bulk I/O Storage Management for Big Data Applications.",
                    "RAIDX: RAID without Striping.",
                    "Efficient Routing for Cost Effective Scale-Out Data Architectures.",
                    "Efficient Memory Occupancy Models for In-memory Databases.",
                    "Understanding the Energy, Performance, and Programming Effort Trade-Offs of Android Persistence Frameworks.",
                    "Behavior-Aware Integrated CPU-GPU Power Management for Mobile Games.",
                    "Designing and Enabling Simulation of Real-World GPU Network Applications with ns-3 and DCE.",
                    "Characterizing Performance and Power towards Efficient Synchronization of GPU Kernels.",
                    "Data Modelling with Gaussian Process in Sensor Networks for Urban Environmental Monitoring.",
                    "TerrainLOS: An Outdoor Propagation Model for Realistic Sensor Network Simulation.",
                    "Cooperation Stimulation and Security in Wireless Ad Hoc Networks - A Power-Efficient Bayesian Game Approach.",
                    "Dynamic Clustering Algorithm for Tracking Target with High and Variable Celerity.",
                    "DIODE: Dynamic Inline-Offline DE Duplication Providing Efficient Space-Saving and Read/Write Performance for Primary Storage Systems.",
                    "Improve Restore Speed in Deduplication Systems Using Segregated Cache.",
                    "An Experimental Study on the Effect of Asymmetric Memory Latency of New Memory on Application Performance."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd MASCOTS 2015",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2015",
                "sub_name": "23rd IEEE International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems, MASCOTS 2015, Atlanta, GA, USA, October 5-7, 2015.",
                "count": 34,
                "papers": [
                    "TARS: A Traffic-Adaptive Receiver-Synchronized MAC Protocol for Underwater Sensor Networks.",
                    "A Graph Theoretical Analysis of the Web Using DNS Traffic Traces.",
                    "evalBox: A Cross-Platform Evaluation Framework for Network Systems.",
                    "On the Fidelity of Single-Machine Network Emulation in Linux.",
                    "Alleviating DRAM Refresh Overhead Via Inter-rank Piggyback Caching.",
                    "Characterizing the Overhead of Software-Managed Hybrid Main Memory.",
                    "FAME: A Fast and Accurate Memory Emulator for New Memory System Architecture Exploration.",
                    "Flash-Aware High-Performance and Endurable Cache.",
                    "On Fair Attribution of Costs under Peak-Based Pricing to Cloud Tenants.",
                    "Reducing Job Slowdown Variability for Data-Intensive Workloads.",
                    "On Biasing towards Optimized Application Placement in the Cloud.",
                    "Energy Efficiency of Hierarchical Server Load Distribution Strategies.",
                    "An Approach to Discrete Parameter Design Space Exploration of Multi-core Systems Using a Novel Simulation Based Interpolation Technique.",
                    "To Co-run, or Not to Co-run: A Performance Study on Integrated Architectures.",
                    "Characterization of Dynamic Memory Allocations in Real-World Applications: An Experimental Study.",
                    "I/O-Cache: A Non-volatile Memory Based Buffer Cache Policy to Improve Storage Performance.",
                    "AYUSH: Extending Lifetime of SRAM-NVM Way-Based Hybrid Caches Using Wear-Leveling.",
                    "InterSense: Interconnect Performance Emulator for Future Scale-out Distributed Memory Applications.",
                    "Perfect Sampling in Stochastic Petri Nets Using Decision Diagrams.",
                    "A Product-Form Model for the Analysis of Systems with Aging Objects.",
                    "A Case for Rigorous Workload Classification.",
                    "Accelerating Graphics in the Simics Full-System Simulator.",
                    "Self-Boosted Co-scheduling for SMP Virtual Machines.",
                    "CloudScope: Diagnosing and Managing Performance Interference in Multi-tenant Clouds.",
                    "MRemu: An Emulation-Based Framework for Datacenter Network Experimentation Using Realistic MapReduce Traffic.",
                    "On Modeling and Impact of Geographic Restrictions for Human Mobility in Opportunistic Networks.",
                    "CPSys: A System for Mobile Video Prefetching.",
                    "Preserving Row Buffer Locality for PCM Wear-Leveling under Massive Parallelism.",
                    "Soothsayer: Predicting Capacity Usage in Backup Storage Systems.",
                    "ExaPlan: Queueing-Based Data Placement and Provisioning for Large Tiered Storage Systems.",
                    "SMR Disks for Mass Storage Systems.",
                    "BATS: Budget-Constrained Autoscaling for Cloud Performance Optimization.",
                    "HALO: Heterogeneity-Aware Load Balancing.",
                    "Using Application Data for SLA-Aware Auto-scaling in Cloud Environments."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd MASCOTS 2014",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2014",
                "sub_name": "IEEE 22nd International Symposium on Modelling, Analysis & Simulation of Computer and Telecommunication Systems, MASCOTS 2014, Paris, France, September 9-11, 2014.",
                "count": 66,
                "papers": [
                    "T-RATE: A Framework for the Trace-Driven Evaluation of 802.11 Rate Adaptation Algorithms.",
                    "Studying the Effective Bandwidth through the Distribution of One-Way Delays.",
                    "Timing Analysis of TDMA-Based Networks Using Network Calculus and Integer Linear Programming.",
                    "Assessing the Impact of Concurrent Replication with Canceling in Parallel Jobs.",
                    "Turbocharged Speed Scaling: Analysis and Evaluation.",
                    "Preserving User Behavior Characteristics in Trace-Based Simulation of Parallel Job Scheduling.",
                    "Optimizing Job Scheduling on Multicore Computers.",
                    "PERSES: Data Layout for Low Impact Failures.",
                    "FlexStore: A Software Defined, Energy Adaptive Distributed Storage Framework.",
                    "WORMStore: A Specialized Object Store for Write-Once Read-Many Workloads.",
                    "Which Storage Device Is the Greenest? Modeling the Energy Cost of I/O Workloads.",
                    "Detection of Greedy Behavior in WSN Using IEEE 802.15 Protocol.",
                    "Local Maximum Routing Recovery in Underwater Sensor Networks: Performance and Trade-offs.",
                    "A Domain-Specific Framework for Creating Early Trusted Underwater Systems Relying on Enterprise Architecture.",
                    "Real-Time Scheduling for Content Broadcasting in LTE.",
                    "Load Balancing for M2M Random Access in LTE HetNets.",
                    "Optimisation of Servers with Different Quality of Services.",
                    "Provisioning of Computing Resources for Web Applications under Time-Varying Traffic.",
                    "Be a Collaborator and a Competitor in Crowdsourcing System.",
                    "Modeling Multi-user Behaviour in Social Networks.",
                    "FT-SOA: A Failure-Prediction Technique in Service-Oriented Systems.",
                    "Mathematical Modeling of Crowdsourcing Systems: Incentive Mechanism and Rating System Design.",
                    "Evaluating Auto-scaling Strategies for Cloud Computing Environments.",
                    "Hybrid Cloud Placement Algorithm.",
                    "A Versatile Traffic and Power Aware Performability Analysis of Server Virtualized Systems.",
                    "Comparative Analysis of Page Cache Provisioning in Virtualized Environments.",
                    "Multi-criteria Virtual Machines Migration Considering the Reconfiguration of Their Logical Topology.",
                    "ZombieNAND: Resurrecting Dead NAND Flash for Improved SSD Longevity.",
                    "An Efficient Buffer Replacement Algorithm for NAND Flash Storage Devices.",
                    "An Economic Perspective of Disk vs. Flash Media in Archival Storage.",
                    "[phi]Sched: A Heterogeneity-Aware Hadoop Workflow Scheduler.",
                    "Performance Modelling of Partially Replicated In-Memory Transactional Stores.",
                    "Weighted-Tuple Synchronization for Parallel Architecture Simulators.",
                    "Continuous Retrieval of Replicated Data from Heterogeneous Storage Arrays.",
                    "Understanding the Impact of vCPU Scheduling on DVFS-Based Power Management in Virtualized Cloud Environment.",
                    "A Hierarchical Demand Response Framework for Data Center Power Cost Optimization under Real-World Electricity Pricing.",
                    "On Characterization of Performance and Energy Efficiency in Heterogeneous HPC Cloud Data Centers.",
                    "Energy Aware Algorithmic Engineering.",
                    "Modeling of I/O Performance Interference in Virtualized Environments with Queueing Petri Nets.",
                    "Modeling and Analysis of Opportunistic Routing in Multi-hop Wireless Networks.",
                    "An Anatomy of SVC for Full HD Video Streaming.",
                    "Synchronization Algorithms for Co-simulation of Power Grid and Communication Networks.",
                    "Joint Message Scheduling and Drop Policies for Many-to-Many Communication in Delay-Tolerant Networks.",
                    "Expected Annual Fraction of Data Loss as a Metric for Data Storage Reliability.",
                    "Quantifying and Optimizing the Impact of Victim Cache Line Selection in Manycore Systems.",
                    "How Processor Speedups Can Slow Down I/O Performance.",
                    "Empirical Study of NVM Storage: An Operating System's Perspective and Implications.",
                    "Revisiting Size-Based Scheduling with Estimated Job Sizes.",
                    "Prefetching Control for On-Demand Contents Distribution: A Markov Decision Process Model.",
                    "On the Relations between Lumpability and Reversibility.",
                    "Online Adaptive Anomaly Detection for Augmented Network Flows.",
                    "Multi-fusion Based Distributed Spectrum Sensing against Data Falsification Attacks and Byzantine Failures in CR-MANET.",
                    "PrivacyCanary: Privacy-Aware Recommenders with Adaptive Input Obfuscation.",
                    "Efficient and Secure Visual Data Transmission Approach for Wireless Multimedia Sensor Networks.",
                    "Opportunistic Routing in Wireless Multi-hop Networks: A Tutorial.",
                    "Balancing Accuracy and Efficiency in TCP Flow Simulation.",
                    "Nakshatra: Towards Running Batch Analytics on an Archive.",
                    "Benchmarking Correctness of Operations in Big Data Applications.",
                    "A Strategy for Data Replication in Mobile Ad Hoc Networks.",
                    "Concurrent and Distributed CloudSim Simulations.",
                    "ParSim: A Tool for Workload Modeling and Reproduction of Parallel Applications.",
                    "Open-PEOPLE, A Collaborative Platform for Remote & Accurate Measurement and Evaluation of Embedded Systems Power Consumption.",
                    "Cloud-Based Extension for Community-Lab.",
                    "UDP Ping: A Dedicated Tool for Improving Measurements of the Internet Topology.",
                    "Showstopper: The Partial CPU Load Tool.",
                    "COLD: Cloud Optimized Workload Deployer."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st MASCOTS 2013",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2013",
                "sub_name": "2013 IEEE 21st International Symposium on Modelling, Analysis and Simulation of Computer and Telecommunication Systems, San Francisco, CA, USA, August 14-16, 2013.",
                "count": 71,
                "papers": [
                    "A VoD System for Massively Scaled, Heterogeneous Environments: Design and Implementation.",
                    "Towards Machine Learning-Based Auto-tuning of MapReduce.",
                    "An Offline Demand Estimation Method for Multi-threaded Applications.",
                    "On Optimal Policies for Energy-Aware Servers.",
                    "Self-Tuning Batching with DVFS for Improving Performance and Energy Efficiency in Servers.",
                    "Managing Network Reservation for Tenants in Oversubscribed Clouds.",
                    "Dynamic Balanced Configuration of Multi-resources in Virtualized Clusters.",
                    "Making JavaScript Better by Making It Even Slower.",
                    "The Continued Evolution of Web Traffic.",
                    "HTTP Adaptive Streaming in Mobile Networks: Characteristics and Caching Opportunities.",
                    "PAB: Parallelism-Aware Buffer Management Scheme for Nand-Based SSDs.",
                    "LiU: Hiding Disk Access Latency for HPC Applications with a New SSD-Enabled Data Layout.",
                    "I/O Performance Modeling of Virtualized Storage Systems.",
                    "Networks of Order Independent Queues with Signals.",
                    "Improved Rate-Based Pull and Push Strategies in Large Distributed Networks.",
                    "Autoreversibility: Exploiting Symmetries in Markov Chains.",
                    "On Zipf Models for Probabilistic Piece Selection in P2P Stored Media Streaming.",
                    "Camera Shooting Location Recommendations for Landmarks in Geo-space.",
                    "Helping Hand or Hidden Hurdle: Proxy-Assisted HTTP-Based Adaptive Streaming Performance.",
                    "Exploiting Spatial Locality to Improve Disk Efficiency in Virtualized Environments.",
                    "Makespan-Optimal Cache Partitioning.",
                    "Measuring and Analyzing Write Amplification Characteristics of Solid State Disks.",
                    "Improving the Revenue, Efficiency and Reliability in Data Center Spot Market: A Truthful Mechanism.",
                    "Carbon-Aware Load Balancing for Geo-distributed Cloud Services.",
                    "Architecting Efficient Peak Power Shaving Using Batteries in Data Centers.",
                    "Performance and Energy Consumption of Lossless Compression/Decompression Utilities on Mobile Computing Platforms.",
                    "Introducing Geographic Restrictions to the SLAW Human Mobility Model.",
                    "GPP vs DSP: A Performance/Energy Characterization and Evaluation of Video Decoding.",
                    "Automatic Meter-Reading Simulation through Power Line Communication.",
                    "Transforming System Load to Throughput for Consolidated Applications.",
                    "Effect of Latent Errors on the Reliability of Data Storage Systems.",
                    "A Versatile Performance and Energy Simulation Tool for Composite GPU Global Memory.",
                    "Path Extension Analysis of Peer-to-Peer Communications in Small 6LoWPAN/RPL Sensor Networks.",
                    "A Fix-and-Relax Model for Heterogeneous LTE-Based Networks.",
                    "Configuring Cloud Admission Policies under Dynamic Demand.",
                    "Analytic Models of Applications in Multi-core Computers.",
                    "Towards Improving MapReduce Task Scheduling Using Online Simulation Based Predictions.",
                    "Three-Dimensional Redundancy Codes for Archival Storage.",
                    "A Novel Simulation Methodology for Accelerating Reliability Assessment of SSDs.",
                    "Single-Snapshot File System Analysis.",
                    "Spectrum Sensing with Receive Diversity for Cognitive Radio Operating over Wideband Channel.",
                    "Analysis of a Simple Approach to Modeling Performance for Streaming Data Applications.",
                    "Revisiting Popularity Characterization and Modeling of User-Generated Videos.",
                    "\"The Tail Wags the Dog\": A Study of Anomaly Detection in Commercial Application Performance.",
                    "DeltaNC: Efficient File Updates for Network-Coding-Based Cloud Storage Systems.",
                    "Detection and Root Cause Analysis of Memory-Related Software Aging Defects by Automated Tests.",
                    "Characterization Analysis of Resource Utilization Distribution.",
                    "A Study of the Effect of Partitioning on Parallel Simulation of Multicore Systems.",
                    "On the Accuracy of Trace Replay Methods for File System Evaluation.",
                    "Modeling Anomalies Prevalent in Sensor Network Deployments: A Representative Ground Truth.",
                    "Performance Analysis of Software-Defined Networking (SDN).",
                    "Channel and Receiver Contention in Optical Flow Switching Networks.",
                    "Impact of Multi-access Links on the Internet Topology Modeling.",
                    "Evaluating Approaches for Performance Prediction in Virtualized Environments.",
                    "Symbolic Solution of Kronecker-Based Structured Markovian Models.",
                    "Accelerating Batch Analytics with Residual Resources from Interactive Clouds.",
                    "Online Energy Budgeting for Virtualized Data Centers.",
                    "Resource Estimation for Network Virtualization through Users and Network Interaction Analysis.",
                    "Capacity of Simple Multiple-Input-Single-Output Wireless Networks over Uniform or Fractal Maps.",
                    "Performance Comparison of Routing Protocols for Cognitive Radio Networks.",
                    "Link-Quality Aware Object Replication and Placement for Multi-hop Wireless Mesh Networks.",
                    "Towards Instruction Level Record and Replay of Sensor Network Applications.",
                    "SYREN: Synergistic Link Correlation-Aware and Network Coding-Based Dissemination in Wireless Sensor Networks.",
                    "A Novel Energy Efficient Broadcast Leader Election.",
                    "Overcoming Limitations of Off-the-Shelf Priority Schedulers in Dynamic Environments.",
                    "Validating Storage System Instrumentation.",
                    "Virtual Machine Scheduling for Parallel Soft Real-Time Applications.",
                    "Introducing DVFS-Management in a Full-System Simulator.",
                    "On Modeling Low-Power Wireless Protocols Based on Synchronous Packet Transmissions.",
                    "DistCL: A Framework for the Distributed Execution of OpenCL Kernels.",
                    "Bayesian Service Demand Estimation Using Gibbs Sampling."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th MASCOTS 2012",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2012",
                "sub_name": "20th IEEE International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, MASCOTS 2012, Washington, DC, USA, August 7-9, 2012.",
                "count": 61,
                "papers": [
                    "A Scalable Algorithm for Placement of Virtual Clusters in Large Data Centers.",
                    "Two Sides of a Coin: Optimizing the Schedule of MapReduce Jobs to Minimize Their Makespan and Improve Cluster Performance.",
                    "Squeezing Out the Cloud via Profit-Maximizing Resource Allocation Policies.",
                    "Multi-armed Bandit Congestion Control in Multi-hop Infrastructure Wireless Mesh Networks.",
                    "A Cross-Layer Analytical Model to Estimate the Capacity of a WiMAX Network.",
                    "Wireless Spectrum Occupancy Prediction Based on Partial Periodic Pattern Mining.",
                    "Comparing the ns-3 Propagation Models.",
                    "Taming Wild Horses: The Need for Virtual Time-Based Scheduling of VMs in Network Simulations.",
                    "Towards Traffic Benchmarks for Empirical Networking Research: The Role of Connection Structure in Traffic Workload Modeling.",
                    "Fair Scheduling on Parallel Bonded Channels with Intersecting Bonding Groups.",
                    "Solving the TCP-Incast Problem with Application-Level Scheduling.",
                    "MMPP Characterization of Web Application Traffic.",
                    "Accelerating Multi-threaded Application Simulation through Barrier-Interval Time-Parallelism.",
                    "Modeling Large Scale Circuits Using Massively Parallel Discrete-Event Simulation.",
                    "Transparent and Efficient Shared-State Management for Optimistic Simulations on Multi-core Machines.",
                    "Connectivity in Wireless Sensor Networks in the SINR Model.",
                    "A Practical Approach for Target Tracking in Sparsely Deployed Binary Sensor Network.",
                    "Hop Distance Analysis in Partially Connected Wireless Sensor Networks.",
                    "Understanding Scalability and Performance Requirements of I/O-Intensive Applications on Future Multicore Servers.",
                    "SMART-IO: SysteM-AwaRe Two-Level Data Organization for Efficient Scientific Analytics.",
                    "Reliability of Data Storage Systems under Network Rebuild Bandwidth Constraints.",
                    "Assuring Demanded Read Performance of Data Deduplication Storage with Backup Datasets.",
                    "Cooperative Storage-Level De-duplication for I/O Reduction in Virtualized Data Centers.",
                    "Content Sharing Dynamics in the Global File Hosting Landscape.",
                    "Energy-Aware Execution of Fork-Join-Based Task Parallelism.",
                    "Power-Sleuth: A Tool for Investigating Your Program's Power Behavior.",
                    "Performance Modeling of Design Patterns for Distributed Computation.",
                    "Extrapolation Pitfalls When Evaluating Limited Endurance Memory.",
                    "Making Write Less Blocking for Read Accesses in Phase Change Memory.",
                    "Machine Learning-Based Self-Adjusting Concurrency in Software Transactional Memory Systems.",
                    "Coordinated VM Resizing and Server Tuning: Throughput, Power Efficiency and Scalability.",
                    "Reducing Scalability Collapse via Requester-Based Locking on Multicore Systems.",
                    "Evaluation of Multi-core Scalability Bottlenecks in Enterprise Java Workloads.",
                    "H-SWD: Incorporating Hot Data Identification into Shingled Write Disks.",
                    "Extent Mapping Scheme for Flash Memory Devices.",
                    "Emulating a Shingled Write Disk.",
                    "Using Software-Defined Radio to Validate Wireless Models in Simulation.",
                    "Barrier Counting in Mixed Wireless Sensor Networks.",
                    "MERCURY: A Scalable and Similarity-Aware Scheme in Multi-level Cache Hierarchy.",
                    "Performance Modeling and Characterization of Large Last Level Caches.",
                    "Carbon-Aware Energy Capacity Planning for Datacenters.",
                    "A Numerical Algorithm for the Decomposition of Cooperating Structured Markov Processes.",
                    "Evolutionary Trends in a Supercomputing Tertiary Storage Environment.",
                    "A Measurement Study of Network Coding in Peer-to-Peer Video-on-Demand Systems.",
                    "Enhancing File Transfer Scheduling and Server Utilization in Data Distribution Infrastructures.",
                    "Improving the Performance Efficiency of an IDS by Exploiting Temporal Locality in Network Traffic.",
                    "PCM-Based Durable Write Cache for Fast Disk I/O.",
                    "Scheduling in Flash-Based Solid-State Drives - Performance Modeling and Optimization.",
                    "On the Use of GPUs in Realizing Cost-Effective Distributed RAID.",
                    "Hybrot: Towards Improved Performance in Hybrid SLC-MLC Devices.",
                    "Split Phase Multi-channel MAC Protocols - Formal Specification and Analysis.",
                    "Analyzing Parallelization and Program Performance in Heterogeneous MPSoCs.",
                    "OpenAirInterface Traffic Generator (OTG): A Realistic Traffic Generation Tool for Emerging Application Scenarios.",
                    "Frequency Affinity: Analyzing and Maximizing Power Efficiency in Multi-core Systems.",
                    "NetSim-Steer: A Runtime Steering Framework for Network Simulators.",
                    "Energy-Efficient Cached DIMM Architecture.",
                    "Energy-Aware Replica Selection for Data-Intensive Services in Cloud.",
                    "Analysis of Prediction and Replacement Algorithms Applied to Real Workload for Storage Devices.",
                    "Performance and Power Consumption Measurement of Java Application Servers.",
                    "Using QNA to Evaluate Parameter Tuning in Mission Critical SOA Networks.",
                    "Energy-efficient Resource Management for QoS-guaranteed Computing Clusters."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th MASCOTS 2011",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2011",
                "sub_name": "MASCOTS 2011, 19th Annual IEEE/ACM International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, Singapore, 25-27 July, 2011.",
                "count": 58,
                "papers": [
                    "CosMig: Modeling the Impact of Reconfiguration in a Cloud.",
                    "A Model-free Learning Approach for Coordinated Configuration of Virtual Machines and Appliances.",
                    "Activity Based Sector Synchronisation: Efficient Transfer of Disk-State for WAN Live Migration.",
                    "Fuzzy Modeling Based Resource Management for Virtualized Database Systems.",
                    "A Distributed Self-Learning Approach for Elastic Provisioning of Virtualized Cloud Resources.",
                    "Estimating Application Cache Requirement for Provisioning Caches in Virtualized Systems.",
                    "Workload Characterization at the Virtualization Layer.",
                    "A Study of Web Services Performance Prediction: A Client's Perspective.",
                    "Cost Minimization for Provisioning Virtual Servers in Amazon Elastic Compute Cloud.",
                    "Sponsored Search Engines in Competition: Advertisers Behavior and Engines Optimal Ranking Strategies.",
                    "Software Performance Prediction with a Time Scaling Scheduling Profiler.",
                    "A Theoretical Framework for Design Space Exploration of Manycore Processors.",
                    "In-N-Out: Reproducing Out-of-Order Superscalar Processor Behavior from Reduced In-Order Traces.",
                    "On the Performance of Tagged Translation Lookaside Buffers: A Simulation-Driven Analysis.",
                    "An Analytical Performance Model for Co-management of Last-Level Cache and Bandwidth Sharing.",
                    "Scalable Multi-cache Simulation Using GPUs.",
                    "Characterizing Memory Write References for Efficient Management of Hybrid PCM and DRAM Memory.",
                    "Characterizing Per-Application Network Traffic Using Entropy.",
                    "A Comprehensive Test Strategy for Network Protocols in Diverse Environment.",
                    "Analysis of the Most Representative Factors Affecting Warning Message Dissemination in VANETs under Real Roadmaps.",
                    "[Epsilon] - DjC: A Disjoint Clique Approach for Data Driven Approximate Bounded Loss Data Collection in Sensor Networks.",
                    "Performance Evaluation of Three Architectural Variants for Multi-sled MEMS Storage.",
                    "HybridStore: A Cost-Efficient, High-Performance Storage System Combining SSDs and HDDs.",
                    "Container Marking: Combining Data Placement, Garbage Collection and Wear Levelling for Flash.",
                    "A Workload-Aware Adaptive Hybrid Flash Translation Layer with an Efficient Caching Strategy.",
                    "How Low Can You Go? Spherical Routing for Scalable Network Simulations.",
                    "Master Selection Policies for Inter-destination Multimedia Synchronization in Distributed Applications.",
                    "Fluid Queue Models of Battery Life.",
                    "Mobility Prediction Using Mobile User Profiles.",
                    "Evaluation of Applied Intra-disk Redundancy Schemes to Improve Single Disk Reliability.",
                    "Reliability of Clustered vs. Declustered Replica Placement in Data Storage Systems.",
                    "Hot Random Off-Loading: A Hybrid Storage System with Dynamic Data Migration.",
                    "Toward Automating Work Consolidation with Performance Guarantees in Storage Clusters.",
                    "Automated Transformation of Component-Based Software Architecture Models to Queueing Petri Nets.",
                    "Analytical Performance Modeling for Null Message-Based Parallel Discrete Event Simulation.",
                    "Predicting Runtime Performance Bounds of Expanded Parallel Discrete Event Simulations.",
                    "Approximate Mean Value Analysis of Process Algebra Models.",
                    "Analyzing and Improving MPI Communication Performance in Overcommitted Virtualized Systems.",
                    "The Case for Evaluating MapReduce Performance Using Workload Suites.",
                    "Towards Synthesizing Realistic Workload Traces for Studying the Hadoop Ecosystem.",
                    "A Flexible Workload Generator for Simulating Stream Computing Systems.",
                    "GPU-Based Architectures and Their Benefit for Accurate and Efficient Wireless Network Simulations.",
                    "A Fully Decentralized and Load-Adaptive Fractional Frequency Reuse Scheme.",
                    "VIRCONEL: A Network Virtualizer.",
                    "Trust-Based Content Distribution for Mobile Ad Hoc Networks.",
                    "EbitSim: An Enhanced BitTorrent Simulation Using OMNeT++ 4.",
                    "Evaluation of Redundancy Driven Provisioning for Hypervisors with Locally Attached Storage.",
                    "Workload Impact on Shingled Write Disks: All-Writes Can Be Alright.",
                    "Characterising Eduroam WLANs Usage Trends: A Case Study.",
                    "An Energy-Aware SaaS Stack.",
                    "Improving Multi-million Virtual Rank MPI Execution in [MUPI].",
                    "Multi-objective Simulated Annealing Approach for Optimal Routing in Time-Driven Sensor Networks.",
                    "Power-Aware Resource Scheduling in Base Stations.",
                    "DBA: A Dynamic Bloom Filter Array for Scalable Membership Representation of Variable Large Data Sets.",
                    "A Two-Layer Hidden Markov Model for the Arrival Process of Web Traffic.",
                    "Towards a Dynamic File Bundling System for Large-Scale Content Distribution.",
                    "PBFTL: The Page to Block Mapping FTL with Low Response Time.",
                    "An Abstraction Methodology for the Evaluation of Multi-core Multi-threaded Architectures."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th MASCOTS 2010",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2010",
                "sub_name": "MASCOTS 2010, 18th Annual IEEE/ACM International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, Miami, Florida, USA, August 17-19, 2010.",
                "count": 62,
                "papers": [
                    "EntomoModel: Understanding and Avoiding Performance Anomaly Manifestations.",
                    "Exploiting Concurrency to Improve Latency and throughput in a Hybrid Storage System.",
                    "PAC: Pattern-driven Application Consolidation for Efficient Cloud Computing.",
                    "Predicting the Performance of Virtual Machine Migration.",
                    "Distributed Routing for Vehicular Ad Hoc Networks: Throughput-Delay Tradeoff.",
                    "DiffECC: Improving SSD Read Performance Using Differentiated Error Correction Coding Schemes.",
                    "PUD-LRU: An Erase-Efficient Write Buffer Management Algorithm for Flash Memory SSD.",
                    "Effect of Replica Placement on the Reliability of Large-Scale Data Storage Systems.",
                    "Sequential Prefetch Cache Sizing for Maximal Hit Rate.",
                    "RRDtrace: Long-term Raw Network Traffic Recording using Fixed-size Storage.",
                    "Profit Allocation in Coalitional VoD Service.",
                    "Fair Allocation of Substrate Resources among Multiple Overlay Networks.",
                    "On Predictability of System Anomalies in Real World.",
                    "On the Relevance of Social Information to Opportunistic Forwarding.",
                    "Autonomic Provisioning with Self-Adaptive Neural Fuzzy Control for End-to-end Delay Guarantee.",
                    "Cluster-Based Correlated Data Gathering in Wireless Sensor Networks.",
                    "Expanding the Event Horizon in Parallelized Network Simulations.",
                    "Analytical Modelling and Message Delay Performance Evaluation of the IEEE 802.16 MAC Protocol.",
                    "Efficient Discovery of Loop Nests in Execution Traces.",
                    "Timing Accurate Functional-Level Hardware Simulation with Pull Model Data Flow.",
                    "A Simulation Framework for the Analysis of the TLB Behavior in Virtualized Environments.",
                    "A Case for Robust Semi-Experiments.",
                    "Performance of Quantized Congestion Notification in TCP Incast Scenarios of Data Centers.",
                    "Measurement-Based Analysis of Head-of-Line Blocking for SIP over TCP.",
                    "Decision Model for Cloud Computing under SLA Constraints.",
                    "Clasas: A Key-Store for the Cloud.",
                    "Profit-Aware Server Allocation for Green Internet Services.",
                    "Frequency Based Chunking for Data De-Duplication.",
                    "Examining Energy Use in Heterogeneous Archival Storage Systems.",
                    "Modeling the Run-time Behavior of Transactional Memory.",
                    "Autonomic Log/Restore for Advanced Optimistic Simulation Systems.",
                    "OnTimeDetect: Dynamic Network Anomaly Notification in perfSONAR Deployments.",
                    "Content Delivery Using Replicated Digital Fountains.",
                    "Barra: A Parallel Functional Simulator for GPGPU.",
                    "Automatic Derivation of Performance Prediction Models for Load-balancing Properties Based on Goal-oriented Measurements.",
                    "CantorSim: Simplifying Acceleration of Micro-architecture Simulations.",
                    "An Adaptive and Energy-efficient Routing Protocol Based on Machine Learning for Underwater Delay Tolerant Networks.",
                    "An Analytical Model with Improved Accuracy of IEEE 802.11 Protocol Under Unsaturated Conditions.",
                    "aSHIIP: Autonomous Generator of Random Internet-like Topologies with Inter-domain Hierarchy.",
                    "Black-Box Performance Modeling for Solid-State Drives.",
                    "Composite Pseudo-Associative Cache for Mobile Processors.",
                    "Content Retrieval Delay Driven by Caching Policy and Source Selection.",
                    "Design of New Aggregation Techniques for Wireless Sensor Networks.",
                    "Dynamic Load Balancing Multipathing in Data Center Ethernet.",
                    "Efficient Storage Management for Object-based Flash Memory.",
                    "Efficient Web Requests Scheduling Considering Resources Sharing.",
                    "Element Based Semantics in Multi Formalism Performance Models.",
                    "Fountains vs Torrents: The P2P ToroVerde Protocol.",
                    "Impact of Deployment Point Arrangement on Intrusion Detection in Wireless Sensor Networks.",
                    "Integrated Monitoring and Control for Performance Management of Distributed Enterprise Systems.",
                    "A Model-Driven Tool for Telecom Service Development Process.",
                    "Modeling and Evaluation of Control Flow Vulnerability in the Embedded System.",
                    "Multi-level Crypto Disk: Secondary Storage with Flexible Performance Versus Security Trade-offs.",
                    "New Algorithms for File System Cooperative Caching.",
                    "Impediments to Analytical Modeling of Multi-Tiered Web Applications.",
                    "On the Universal Generation of Mobility Models.",
                    "Performance Analysis of Selected Error Control Protocols in Wireless Multimedia Sensor Networks.",
                    "Effective Quality of Service Differentiation for Real-world Storage Systems.",
                    "Reinventing Lock Modeling for Multi-Core Systems.",
                    "A Symbolic Reachability Graph and Associated Markov Process for a Class of Dynamic Petri Nets.",
                    "Towards Collaborative Research and Education in Computer Architecture with the Archer System.",
                    "Trust Mechanisms for Efficiency Improvement in Collaborative Working Environments."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th MASCOTS 2009",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2009",
                "sub_name": "17th Annual Meeting of the IEEE/ACM International Symposium on Modelling, Analysis and Simulation of Computer and Telecommunication Systems, MASCOTS 2009, September 21-23, 2009, South Kensington Campus, Imperial College, London, UK.",
                "count": 75,
                "papers": [
                    "Stochastic service guarantee analysis based on time-domain models.",
                    "Hybrid system simulation of computer control applications over communication networks.",
                    "Mining for statistical models of availability in large-scale distributed systems: An empirical study of SETI@home.",
                    "Presenting Dynamic Markovian Agents with a road tunnel application.",
                    "On-line monitoring for model-based QoS management in IEEE 802.11 wireless networks.",
                    "A sensitivity analysis of a new hardware-supported Global Synchronization Unit.",
                    "Shared Transaction Markov Chains for fluid analysis of massively parallel systems.",
                    "Applying ordinal time series methods to grid workload traces.",
                    "Enhancing and optimizing a data protection solution.",
                    "Energy and performance impact of aggressive volunteer computing with multi-core computers.",
                    "A simulation approach to evaluating design decisions in MapReduce setups.",
                    "Protecting against rare event failures in archival systems.",
                    "A comparative simulation study of link quality estimators in wireless sensor networks.",
                    "Autocorrelation-driven load control in distributed systems.",
                    "On finding the right balance between fairness and efficiency in WiMAX scheduling through analytical modeling.",
                    "Timing penalties associated with cache sharing.",
                    "A linear method for calibrating LIDAR-and-camera systems.",
                    "Finding a simple path with multiple must-include nodes.",
                    "Where is the tight link in a home wireless broadband environment?",
                    "CETT: A cross layer routing metric for cooperative wireless Ad hoc networks.",
                    "Power and performance modeling of virtualized desktop systems.",
                    "Characterizing virtual memory write references for efficient page replacement in NAND flash memory.",
                    "Service differentiation in multi-rate HSDPA systems.",
                    "Using storage class memories to increase the reliability of two-dimensional RAID arrays.",
                    "Managing storage space in a flash and disk hybrid storage system.",
                    "Business-oriented autonomic load balancing for multitiered Web sites.",
                    "Traffic characteristics and modeling of emergency calls at the PSAP.",
                    "Large Block CLOCK (LB-CLOCK): A write caching algorithm for solid state disks.",
                    "Self-organized sink placement in large-scale wireless sensor networks.",
                    "A general algorithm to compute the steady-state solution of product-form cooperating Markov chains.",
                    "Workload modeling using pseudo2D-HMM.",
                    "Capacity bounds for cellular wireless mesh networks.",
                    "A graph-based algorithm for partitioning of mobile web services.",
                    "Optimal multicast in multi-channel multi-radio wireless networks.",
                    "Horizon - Exploiting timing information for parallel network simulation.",
                    "Simulation environment for design and verification of Network-on-Chip and multi-core systems.",
                    "Modeling and simulating a path planning and obstacle avoidance algorithm for an autonomous robotic vehicle.",
                    "Saving power in flash and disk hybrid storage system.",
                    "Performance modeling of systems using fair share scheduling with Layered Queueing Networks.",
                    "TransPlant: A parameterized methodology for generating transactional memory workloads.",
                    "Modeling and test generation for worst-case performance evaluation of MAC protocols for wireless ad hoc networks.",
                    "Policies for probe-wear leveling in MEMS-based storage devices.",
                    "Performance evaluation of scheduling policies in symmetric multiprocessing environments.",
                    "Mitigating disk energy management delays by exploiting peer memory.",
                    "Device-transparent network-layer handoff for micro-mobility.",
                    "DAFT: Disk geometry-Aware File system Traversal.",
                    "Globally fair radio resource allocation for wireless mesh networks.",
                    "Runtime state change detector of computer system resources under non stationary conditions.",
                    "Extreme Binning: Scalable, parallel deduplication for chunk-based file backup.",
                    "Models for high-speed interconnection networks performance analysis.",
                    "TSS: Applying two-stage sampling in micro-architecture simulations.",
                    "Accurate, scalable and informative design space exploration for large and sophisticated multi-core oriented architectures.",
                    "A hardware test bed for measuring IEEE 802.11g distribution coordination function performance.",
                    "Revisiting coexistence of poissonity and self-similarity in Internet traffic.",
                    "EXtensible animator for mobile simulations: EXAMS.",
                    "On the structure and evolution of vehicular networks.",
                    "Learning based address mapping for improving the performance of memory subsystems.",
                    "On maximizing the delivery ratio of ultra low duty-cycle WSNs under real-time constraints.",
                    "Reliability modeling of RAID storage systems with latent errors.",
                    "Scheduling issues in multi-channel wireless networks.",
                    "Connection and performance model driven optimization of pageview response time.",
                    "Real-time performance modeling for adaptive software systems with multi-class workload.",
                    "Simulated annealing approach to optimizing the lifetime of sparse time-driven sensor networks.",
                    "Efficient tracing and performance analysis for large distributed systems.",
                    "Anonymous routing protocols: Impact on performance in MANETs.",
                    "Quality of service issues and nonconvex Network Utility Maximization for inelastic services in the Internet.",
                    "CPM: Cooperative power management for object-based storage cluster.",
                    "A methodology for extracting performance parameters in solid state disks (SSDs).",
                    "Balancing soft error coverage with lifetime reliability in redundantly multithreaded processors.",
                    "Adaptive admission control algorithm in a QoS-aware Web system.",
                    "An obstacle-aware human mobility model for ad hoc networks.",
                    "A case for conservative workload modeling: Parallel job scheduling with daily cycles of activity.",
                    "Price war with migrating customers.",
                    "A BitTorrent module for the OMNeT++ simulator.",
                    "Time - It's time for a change."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th MASCOTS 2008",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2008",
                "sub_name": "16th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2008), Baltimore, Maryland, USA, September 8-10, 2008.",
                "count": 47,
                "papers": [
                    "Profiling, Prediction, and Capping of Power Consumption in Consolidated Environments.",
                    "On Impact of Dynamic Virtual Machine Reallocation on Data Center Efficiency.",
                    "Evaluating the Effectiveness of Information Extraction in Real-World Storage Management.",
                    "Runtime Prediction Models for Internet-based Systems.",
                    "A Performance Model of Multi-Version Concurrency Control.",
                    "Finding Good Configurations in High-Dimensional Spaces: Doing More with Less.",
                    "Multi-Torrent: A Performance Study.",
                    "Optimal Layered Multicast with Network Coding: Mathematical Model and Empirical Studies.",
                    "Controlled Epidemic Routing Schemes for Multicasting in Delay Tolerant Networks.",
                    "Sensitivity Based Power Management of Enterprise Storage Systems.",
                    "An Analysis of Hard Drive Energy Consumption.",
                    "GRAID: A Green RAID Storage Architecture with Improved Energy Efficiency and Reliability.",
                    "Modelling and Validation of Response Times in Zoned RAID.",
                    "A Novel and Generic Model for Synthesizing Disk I/O Traffic Based on The Alpha-stable Process.",
                    "Characterization of Large-Scale SMTP Traffic: The Coexistence of the Poisson Process and Self-Similarity.",
                    "Allocation and Admission Policies for Service Streams.",
                    "Network Information Flow in Network of Queues.",
                    "Bounding the Performance of BCMP Networks with Load-Dependent Stations.",
                    "Failure Prediction Models for Proactive Fault Tolerance Within Storage Environments.",
                    "Increased Reliability with SSPiRAL Data Layouts.",
                    "PEARL: Performance, Energy, and Reliability Balanced Dynamic Data Redistribution for Next Generation Disk Arrays.",
                    "Quantifying Temporal and Spatial Localities Due to File System Caching.",
                    "A Large-scale and Decentralized Infrastructure for Multiple Queries Optimization and Aggregation.",
                    "Operational Analysis of Parallel Servers.",
                    "On the Stability of Best Effort Flow Control Mechanisms in On-Chip Architectures.",
                    "Modeling and Analyzing the Effect of Microarchitecture Design Parameters on Microprocessor Soft Error Vulnerability.",
                    "Optimizing Galois Field Arithmetic for Diverse Processor Architectures and Applications.",
                    "Taxis: Scalable Strong Anonymous Communication.",
                    "Realistic Topology Modeling for the Internet BGP Routing Infrastructure.",
                    "A Markov Chain Model to Account for Multi-Rate Transmission and Node Cooperative Behavior in IEEE 802.11 Data Link Protocol.",
                    "Tackling the Memory Balancing Problem for Large-Scale Network Simulation.",
                    "Comparison of Single-Rate Multicast Congestion Control Protocols vs ASMP.",
                    "Modeling Software Contention using Colored Petri Nets.",
                    "TCP over WiMAX: A Measurement Study.",
                    "Geographic Constraint Mobility Model for Ad Hoc Network.",
                    "AKCE: An Efficient and Accurate K-coverage Eligibility Algorithm in Wireless Sensor Networks.",
                    "Applying Variable Competition Range for Prolonging the Lifetime of WSN.",
                    "Filtering Effects of Media Merging in a Cache Hierarchy.",
                    "Lifetime Estimation of Large IEEE 802.15.4 Compliant Wireless Sensor Networks.",
                    "Evaluating the Effectiveness of REDCAP to Recover the Locality Missed by Today's Linux Systems.",
                    "Influence of Propagation Modeling on VoIP Quality Performance in Wireless Mesh Network Simulation.",
                    "Using Non-Volatile RAM as a Write Buffer for NAND Flash Memory-based Storage Devices.",
                    "Write-Buffer-Aware Address Mapping for NAND Flash Memory Devices.",
                    "Power Optimization in Fault-Tolerant MANETs.",
                    "A Discrete Event Simulation Model for Parallel Data Transfer Applications.",
                    "Efficient Index Lookup for De-Duplication Backup System.",
                    "An Energy-Efficient Buffer Cache Replacement."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th MASCOTS 2007",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2007",
                "sub_name": "15th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2007), October 24-26, 2007, Istanbul, Turkey.",
                "count": 62,
                "papers": [
                    "Dynamic Power Management with Scheduled Switching Modes in Wireless Sensor Networks.",
                    "A Turnover based Adaptive HELLO Protocol for Mobile Ad Hoc and Sensor Networks.",
                    "Timestepped Stochastic Simulation of 802.11 WLANs.",
                    "Distance Reduction in Mobile Wireless Communication: Lower Bound Analysis and Practical Attainment.",
                    "Evaluation of TCP Performance in MANETs using an Optimized Scalable Simulation Model.",
                    "Improving Quality of Service in MAC 802.11 Layer.",
                    "Measurement Based Physical Layer Modeling for Wireless Network Simulations.",
                    "Modeling Interference in Wireless Ad Hoc Networks.",
                    "A Hierarchical Connected Dominating Set Based Clustering Algorithm for Mobile Ad Hoc Networks.",
                    "Design and Analysis of a WiMAX Mesh Based Cellular Radio Access Networks.",
                    "Performance Comparison of Error Compensation Techniques with Multipath Transmission in Wireless Multimedia Sensor Networks.",
                    "Energy-Efficent TDMA Design Under Real-Time Constraints in Wireless Sensor Networks.",
                    "Modeling of IEEE 802.11e Contention Free Bursting Scheme with Heterogeneous Stations.",
                    "Performance Analysis of Wireless MAC Protocols Using a Search Based Framework.",
                    "Multiobjective Analysis in Wireless Mesh Networks.",
                    "A Simulation Model for the IEEE 802.15.4 protocol: Delay/Throughput Evaluation of the GTS Mechanism.",
                    "Enhancing The Performance of Nonuniformly Deployed Sensor Network by Locating Bottleneck Areas for Partial Redeployment.",
                    "Efficient External Table Reordering.",
                    "Web Proxy CachingObject Replacement: Frontier Analysis to Discover the Good-Enough Algorithms.",
                    "An Autonomic Admission Control Policy for Distributed Web Systems.",
                    "Modeling the Impact of Resource Sharing in Backfilling Policies using the Alvio Simulator.",
                    "Improving the Performance of Passive Network Monitoring Applications using Locality Buffering.",
                    "Pricing Broadband Internet Adaptive Services.",
                    "Design and Implementation of Flow-Level Simulator for Performance Evaluation of Large Scale Networks.",
                    "MDST: Multiprocessor DSP Simulation Toolkit for Voice Processing Applications.",
                    "Queue Length Distribution and Loss probability of Generalized Processor Sharing Systems under Multi-Class Self-Similar Traffic.",
                    "Adaptive Sampling for Efficient MPSoC Architecture Simulation.",
                    "On Strategies for Dynamic Resource Management in Virtualized Server Environments.",
                    "PerfCenter: A Methodology and Tool for Performance Analysis of Application Hosting Centers.",
                    "Network Performance Analysis based on Histogram Workload Models.",
                    "Queuing Behavior and Packet Delays in Network Processor Systems.",
                    "Approximate Solution of Multiclass Queuing Networks with Region Constraints.",
                    "Reducing Performance Evaluation Sensitivity and Variability by Input Shaking.",
                    "Practical and Accurate Throughput Analysis with the Cyclo Static Dataflow Model.",
                    "PSOS: A Novel Protocol Simulation Platform for Satellite Networks.",
                    "Performance Evaluation of a Commercial Application, Trade, in Scale-out Environments.",
                    "Joint-State Modeling for Open Queuing Networks with Breakdowns, Repairs and Finite Buffers.",
                    "Wireless Multicast Support for the NS-2 Emulation Environment.",
                    "Uncovering the Effect of System Performance on User Behavior from Traces of Parallel Systems.",
                    "Nine months in the life of EGEE: a look from the South.",
                    "Trend-based Load Balancer for a Multi-tier Distributed System.",
                    "Client Side Estimation of a Remote Service Execution.",
                    "Improving the Efficiency of Spam Filtering through Cache Architecture.",
                    "A Machine Learning Approach for Efficient Traffic Classification.",
                    "Search Enhanced by Distributed Semantic Clustering in Gnutella-like P2P Systems.",
                    "Load Distribution for Telecommunications Networks Using Revenue Management.",
                    "Model-free Adaptive Hysteresis for Dynamic Bandwidth Reservation.",
                    "PEPA Analysis of MAP Effects in Hierarchical Mobile IPv6.",
                    "Can Routing Oscillations be Good? The Benefits of Route-switching in Self-aware Networks.",
                    "On the Asymptotic Analysis of Packet Aggregation Systems.",
                    "On Markov Chain Modelling of Asynchronous Optical CSMA/CA Protocol.",
                    "Distributed Dynamic Replica Placement and Request Redirection in Content Delivery Networks.",
                    "Stochastic Bounds Applied to the End to End QoS in Communication Systems.",
                    "A Novel Flow Control Scheme for Best Effort Traffic in NoC Based on Source Rate Utility Maximization.",
                    "Analysis of Core-Assisted Routing in Opportunistic Networks.",
                    "An Analytical Model for Torus Networks in the Presence of Hot-Spot Traffic with Batch Arrivals.",
                    "Reducing Hybrid Disk Write Latency with Flash-Backed I/O Requests.",
                    "Shedding Light in the Black-Box : Structural Modeling of Modern Disk Drives.",
                    "Mathematical Analysis of Delay Line to Wavelength Allocation Algorithmsin Optical Networks.",
                    "Average Network Blocking Probabilities for TDM WDM Optical Networks with OTSIs and without WC.",
                    "LOCOMOTIVE: A Hybrid Access Protocol for Bus-Based Passive Optical Networks.",
                    "Efficient Simulation of Optical Ring Networks with Intermittent Transceiver Faults."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th MASCOTS 2006",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2006",
                "sub_name": "14th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2006), 11-14 September 2006, Monterey, California, USA.",
                "count": 45,
                "papers": [
                    "Adapting Predictions and Workloads for Power Management.",
                    "Parallelism-Aware Request Scheduling for MEMS-based Storage Devices.",
                    "B: Disk Array Data Layout Tolerating Multiple Failures.",
                    "Towards Stadium-Scale Wireless Media Streaming.",
                    "Spatial Stationarity of Link Statistics in Mobile Ad Hoc Network Modelling.",
                    "On Optimal Path and Source Redundancy for Achieving QoS and Maximizing Lifetime of Query-Based Wireless Sensor Networks.",
                    "Metrics for Mass-Count Disparity.",
                    "A New Class of Non-Iterative Bounds for Closed Queueing Networks.",
                    "eRAID: A Queueing Model Based Energy Saving Policy.",
                    "On the Impact of OS and Linker Effects on Level-2 Cache Performance.",
                    "Holistic Debugging -- Enabling Instruction Set Simulation for Software Quality Assurance.",
                    "A Statistical Traffic Model for On-Chip Interconnection Networks.",
                    "V-eM: A Cluster of Virtual Machines for Robust, Detailed, and High-Performance Network Emulation.",
                    "Sluggish Calendar Queues for Network Simulation.",
                    "Performance Analysis of Packet Encapsulation and Aggregation.",
                    "Characterizing Microarchitecture Soft Error Vulnerability Phase Behavior.",
                    "A Fluid-Diffusive Approach for Modelling P2P Systems.",
                    "Using Site-Level Modeling to Evaluate the Performance of Parallel System Schedulers.",
                    "A Longitudinal Study of P2P Traffic Classification.",
                    "Capturing the Elusive Poissonity in Web Traffic.",
                    "Implications of Neighbor Selection on DHT Overlays.",
                    "Modelling and Improving Group Communication in Server Operating Systems.",
                    "Flexible Time-Windows for Advance Reservation Scheduling.",
                    "Computer Resource Optimization for Differentiated Customer Services.",
                    "Verifying the Distributed Real-Time Network Protocol RTnet Using Uppaal.",
                    "Timestep Stochastic Simulation of Computer Networks using Diffusion Approximation.",
                    "Quasi-Dynamic Network Model Partition Method for Accelerating Parallel Network Simulation.",
                    "Situation-Aware Caching Strategies in Highly Varying Mobile Networks.",
                    "Measuring and Explaining Differences in Wireless Simulation Models.",
                    "Fast Simulation of Optical Burst Switching Networks Using Simulated Annealing.",
                    "A Parallel Implicit Method for the Steady-State Solution of CTMCs.",
                    "Performance Trees: A New Approach to Quantitative Performance Specification.",
                    "Modeling Differentiated Services of Multi-Tier Web Applications.",
                    "Analysis of Resource Sharing and Cache Management in Scalable Video-on-Demand.",
                    "An Architecture for Distributed Real-Time Passive Network Measurement.",
                    "Effect of Sequence Number Wrap on DCCP Connection Establishment.",
                    "Performance, Validation and Testing with the Network Simulation Cradle.",
                    "Resilience in Overlay Multicast Protocols.",
                    "End-to-End Delay Behavior in the Internet.",
                    "Building and Validating a Reduced TPC-H Benchmark.",
                    "Video Streaming in 3.5G: On Throughput-Delay Performance of Proportional Fair Scheduling.",
                    "Non-reachability in Petri Nets with Delaying Places.",
                    "Providing High Reliability in a Minimum Redundancy Archival Storage System.",
                    "NVCache: Increasing the Effectiveness of Disk Spin-Down Algorithms with Caching.",
                    "An Empirical Exploration of Black-Box Performance Models for Storage Systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th MASCOTS 2005",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2005",
                "sub_name": "13th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2005), 27-29 September 2005, Atlanta, GA, USA.",
                "count": 75,
                "papers": [
                    "Title Page.",
                    "Copyright Page.",
                    "Message from the General Chair.",
                    "Message from the Program Chairs.",
                    "Comittees.",
                    "Referees.",
                    "The Challenge of Complexity and Scale.",
                    "Towards Pairing Java Applications on SMT Processors.",
                    "Workload Characterization of Bioinformatics Applications.",
                    "Improved Estimation for Software Multiplexing of Performance Counters.",
                    "Understanding Patterns of TCP Connection Usage with Statistical Clustering.",
                    "An empirical model of TCP performance.",
                    "High short-term bit-rates from TCP Flows.",
                    "Statistical Simulation of Multithreaded Architectures.",
                    "Accurate Modeling of Aggressive Speculation in Modern Microprocessor Architectures.",
                    "Cycle Accurate Memory Modelling: A Case-Study in Validation.",
                    "Performance Analysis of TCP/AQM Under Denial-of-Service Attacks.",
                    "Improving OSPF Dynamics On a Broadcast LAN.",
                    "Performance of Routing Protocols in Very Large-Scale Mobile Wireless Ad Hoc Networks.",
                    "Disk Infant Mortality in Large Storage Systems.",
                    "Storage Performance Virtualization via Throughput and Latency Control.",
                    "A Unified Multiple-Level Cache for High Performance Storage Systems.",
                    "A Traffic Characterization Procedure for Multimedia Applications in Converged Networks.",
                    "A Structure-Preserving Method of Sampling Self-Similar Traffic.",
                    "Performance Analysis and Improvement of Overlay Construction for Peer-to-Peer Live Media Streaming.",
                    "Why We STILL Don't Know How to Simulate Networks.",
                    "Automated Detection of Performance Regressions: The Mono Experience.",
                    "Describing and Visualizing the Capacity of a System with Behaviour Uncertainties.",
                    "Non-Preemptive Earliest-Deadline-First Scheduling Policy: A Performance Study.",
                    "Simulation of Large-Scale Sensor Networks Using GTSNetS.",
                    "Scalable Network Path Emulation.",
                    "M/CD++: modeling continuous systems using Modelica and DEVS.",
                    "Continuous resource monitoring for self-predicting DBMS.",
                    "Towards a Responsive, Yet Power-ef.cient, Operating System: A Holistic Approach.",
                    "Effects and Implications of File Size/Service Time Correlation onWeb Server Scheduling Policies.",
                    "SACA: SCM-based Adaptive Clustering Algorithm.",
                    "Delay Analysis of Priority Queues with Modulated Traffic.",
                    "The Feasibility of DHT-based Streaming Multicast.",
                    "Shaping Variables in Service Level Agreements at Application Level.",
                    "Modeling 3-Tiered Web Applications.",
                    "Network Cache Model for Wireless Proxy Caching.",
                    "Modelling Data Access for a Distributed Network Management System.",
                    "Impact of Laxity on Scheduling with Advance Reservations in Grids.",
                    "A Geographic Directed Preferential Internet Topology Model.",
                    "DRR A Fast High-Throughput Scheduling Algorithm for Combined Input Crosspoint-Queued CICQ Switches.",
                    "Rate and Loss Control for Video Transmission over UMTS using Real-Time Protocols.",
                    "Deterministic and probabilistic QoS guarantees for real-time traffics.",
                    "Modeling of QoS-oriented Content Delivery Networks.",
                    "On the modeling of voice sources regulated by dual leaky buckets.",
                    "Dynamic Replica Placement in Content Delivery Networks.",
                    "Replication policies for layered clustering of NFS servers.",
                    "Segmented File Sharing with Recursive Epidemic Placement Policy for Reliability in Mobile Peer-to-Peer Devices.",
                    "A Testbed Validation Tool for MANET Implementations.",
                    "Low-Power Multimedia Scheduling Using Output Pre-buffering.",
                    "Performance measure bounds in mobile networks by state space reduction.",
                    "Approaching Optimal Peer-to-Peer Overlays.",
                    "Simulating Large-Scale P2P Systems with the WiDS Toolkit.",
                    "GPS: A General Peer-to-Peer Simulator and its Use for Modeling BitTorrent.",
                    "Contact-Based Mobility Metrics for Delay-Tolerant Ad Hoc Networking.",
                    "Design and Performance Evaluation of a QoS-Based Dynamic Channel Allocation Protocol for Wireless and Mobile Networks.",
                    "Almost Disjunct Codes in Large Scale Multihop Wireless Network Media Access Control.",
                    "Quantitative Analysis of Permutation Capability with Colored Petri Nets.",
                    "Stochastic Analysis and Comparison of Self-Stabilizing Routing Algorithms for Publish/Subscribe Systems.",
                    "ARTS: A System-Level Framework for Modeling MPSoC Components and Analysis of their Causality.",
                    "A Reactive Workload Generation Framework for Simulation-based Performance Engineering of System Interconnects.",
                    "Solvability of a Markovian Model of an IEEE 802.11 LAN under a Backoff Attack.",
                    "MobiREAL Simulator Evaluating MANET Applications in Real Environments.",
                    "A Visualization and Analysis Tool for NS-2 Wireless Simulations: iNSpect.",
                    "Simulation of Car-to-Car Messaging: Analyzing the Impact on Road Traffic.",
                    "Optimal Performance State Estimation of Compute Systems.",
                    "Performance Evaluation of a Heterogeneous Disk Array Architecture.",
                    "Parallel Logic Simulation of Million-Gate VLSI Circuits.",
                    "SMART: A Simulation Tool for Analyzing Cache Access Behavior on SMPs.",
                    "Optimization of Encounter Gossip Propagation in Mobile Ad-Hoc Networks.",
                    "Proposition of a Hard Real-Time MAC Protocol for Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th MASCOTS 2004",
        "info": "Volendam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2004",
                "sub_name": "12th International Workshop on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2004), 4-8 October 2004, Vollendam, The Netherlands.",
                "count": 67,
                "papers": [
                    "Experimental Evaluation of TCP Performance in Multi-Hop Wireless Ad Hoc Networks.",
                    "On Mobility-Capacity-Delay Trade-off in Wireless Ad Hoc Networks.",
                    "Approximate Analysis of Non-Markovian Stochastic Systems with Multiple Time Scale Delays.",
                    "Size-Based Scheduling Policies with Inaccurate Scheduling Information.",
                    "A GSPN Model for the Analysis of DNS-Based Redirection in Distributed Web Systems.",
                    "ASPEN: Towards Effective Simulation of Threads and Engines in Evolving Platforms.",
                    "SimplePipe: A Simulation Tool for Task Allocation and Design of Processor Pipelines with Application to Network Processors.",
                    "Performance Engineering with the UML Profile for Schedulability, Performance and Time: A Case Study.",
                    "SPOT: An Extensible Model Checking Library Using Transition-Based Generalized Büchi Automata.",
                    "Is TCP Packet Reordering Always Harmful?",
                    "Analysis of Peer-to-Peer Systems: Workload Characterization and Effects on Traffic Cacheability.",
                    "Performance Evaluation of Fairness-Oriented Active Queue Management Schemes.",
                    "Hybrid WLAN for Data Dissemination Applications.",
                    "Dual-Processor Parallelisation of Symbolic Probabilistic Model Checking.",
                    "The N-Burst/G/1 Model with Heavy-Tailed Service-Times Distribution.",
                    "Structured Stochastic Modeling of Fault-Tolerant Systems.",
                    "An Optimisation Model for a Two-Node Router Network.",
                    "A Performance Study of Session State Re-Establishment Schemes in IP-Based Micro-Mobility Scenarios.",
                    "A Hysteresis Model for Web/TCP Transfer Latency.",
                    "Modeling the Burstiness of TCP.",
                    "Stable Node-Disjoint Multipath Routing with Low Overhead in Mobile Ad Hoc Networks.",
                    "INDEPTH: Timeliness Assessment of Ethernet/IP-Based Systems.",
                    "Assessing the Effectiveness of IEEE 802.11e in Multi-Hop Mobile Network Environments.",
                    "Causal Multicast in Mobile Networks.",
                    "Bottlenecks Identification in Multiclass Queueing Networks Using Convex Polytopes.",
                    "A New Recursive Algorithm for Computing Generating Functions in Closed Multi-Class Queueing Networks.",
                    "Multiclass Multiservers with Deferred Operations in Layered Queueing Networks, with Software System Applications.",
                    "A Bandwidth-Efficient Scheduler for MPLS DiffServ Networks.",
                    "A Framework for Resource Allocation in Grid Computing.",
                    "Simulating Internet Worms.",
                    "Routing in an Internet-Scale Network Emulator.",
                    "Large-Scale Simulation Models of BGP.",
                    "Engineering Mobile Wireless Publish/Subscribe Systems for High Performance.",
                    "An Energy-Aware Framework for Coordinated Dynamic Software Management in Mobile Computers.",
                    "Performance Analysis of Reliable Multicast Transport Protocols for GEO Satellite Networks.",
                    "Processing Dynamic PDEVS Models.",
                    "Instrumenting Network Simulators for Evaluating Energy Consumption in Power-Aware Ad-Hoc Network Protocols.",
                    "Fast Simulation of Excessive Population Size in Tandem Jackson Networks.",
                    "Simulation Evaluation of Hybrid SRPT Scheduling Policies.",
                    "Design and Implementation of a High Speed Microprocessor Simulator BurstScalar.",
                    "Bluetooth Simulations for Wireless Sensor Networks Using GTNetS.",
                    "End-to-End Delay Heuristics for Adaptive Optical Wireless Networks.",
                    "Topology Control, Resources Allocation and Routing in Wireless Sensor Networks.",
                    "MC-CDMA Based IEEE 802.11 Wireless LAN.",
                    "Disk Scrubbing in Large Archival Storage Systems.",
                    "Predicting When Not to Predict.",
                    "Reliable Response Delivery in Peer-to-Peer Systems.",
                    "VRing: A Case for Building Application-Layer Multicast Rings (Rather Than Trees).",
                    "A Flexible Architecture for Remote Server-Based Emulation.",
                    "BencHMAP: Benchmark-Based, Hardware and Model-Aware Partitioning for Parallel and Distributed Network Simulation.",
                    "Architecture Independent Performance Characterization and Benchmarking for Scientific Applications.",
                    "Database Server Workload Characterization in an E-Commerce Environment.",
                    "Mining Performance Data from Sampled Event Traces.",
                    "Statistical Selection of Compiler Options.",
                    "Performance Analysis and Improvement of HighSpeed TCP with TailDrop/RED Routers.",
                    "Network Performance of Multi-Service Circuit Switched Networks: Simulational Comparison of Variants of DAR and RTNR.",
                    "Fast Update of Forwarding Tables in TCAM.",
                    "Performance Modeling of Fully Adaptive Wormhole Routing in 2-D Mesh-Connected Multiprocessors.",
                    "A Computational Complexity-Aware Model for Performance Analysis of Software Servers.",
                    "Comparison of Predictive Techniques in Cluster-Based Network Servers with Resource Allocation.",
                    "Performance Characterisation and Verification of JavaSpaces Based on Design of Experiments.",
                    "A Quotient Graph for Asymmetric Distributed Systems.",
                    "Reliability of MEMS-Based Storage Enclosures.",
                    "Caching Values in the Load Store Queue.",
                    "Storage Device Performance Prediction with CART Models.",
                    "MRAMFS: A Compressing File System for Non-Volatile RAM.",
                    "Execution-Driven Simulation of Network Storage Systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th MASCOTS 2003",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2003",
                "sub_name": "11th International Workshop on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2003), 12-15 October 2003, Orlando, FL, USA.",
                "count": 44,
                "papers": [
                    "Perf: An Ongoing Research Project on Performance Evaluation.",
                    "Synthesizing Representative I/O Workloads Using Iterative Distillation.",
                    "Tracking the Evolution of Web Traffic: 1995-2003.",
                    "Using Linear Regression to Characterize Data Coherency Traffic.",
                    "Considering the Energy Consumption of Mobile Storage Alternatives.",
                    "Using User Interface Event Information in Dynamic Voltage Scaling Algorithms.",
                    "k-Weighted Minimum Dominating Sets for Sparse Wavelength Converters Placement under Non-uniform Traffic.",
                    "Creating Realistic BGP Models.",
                    "Mapping Peer Behavior to Packet-level Details: A Framework for Packet-level Simulation of Peer-to-Peer Systems.",
                    "Minimizing Packet Loss by Optimizing OSPF Weights Using Online Simulation.",
                    "SPEK: A Storage Performance Evaluation Kernel Module for Block Level Storage Systems.",
                    "A Light-weight, Temporary File System for Large-scale Web Servers.",
                    "Zone-Based Shortest Positioning Time First Scheduling for MEMS-Based Storage Devices.",
                    "Large-Scale Network Simulation: How Big? How Fast?",
                    "Quantifying the Properties of SRPT Scheduling.",
                    "NAM: A Network Adaptable Middleware to Enhance Response Time of Web Services.",
                    "DEVS Today: Recent Advances in Discrete Event-Based Information Technology.",
                    "Modelling Differentiated Services in UMTS Networks.",
                    "Performance Evaluation of Packet Scheduling and Synchronization Algorithms for Wireless Multimedia Systems.",
                    "On Modeling and Analyzing Cache Hierarchies using CASPER.",
                    "TwoTowers 3.0: Enhancing Usability.",
                    "MQNA - Markovian Queueing Networks Analyser.",
                    "An Evaluation Framework For Active Queue Management Schemes.",
                    "System-Level Simulation Modeling with MLDesigner.",
                    "p-sim: A Simulator for Peer-to-Peer Networks.",
                    "An open tool to compute stochastic bounds on steady-state distributions and rewards.",
                    "Quantifying the Effects of Recent Protocol Improvements to Standards-Track TCP.",
                    "Profit-driven Service Differentiation in Transient Environments.",
                    "Optimal Mobility-aware Admission Control in Content Delivery Networks.",
                    "An Active Traffic Splitter Architecture for Intrusion Detection.",
                    "Toward Scaling Network Emulation using Topology Partitioning.",
                    "Managing Flash Crowds on the Internet.",
                    "Performance Benchmarking of Dynamic Web Technologies.",
                    "Markovian Performance Analysis of a Synchronous Optical Packet Switch.",
                    "Small-World Characteristics of the Internet and Multicast Scaling.",
                    "A Unified Framework for Modeling TCP-Vegas, TCP-SACK, and TCP-Reno.",
                    "Bottleneck Estimation for Load Control Gateways.",
                    "It's not fair - evaluating efficient disk scheduling.",
                    "An integrated performance model of disk arrays.",
                    "Disk Built-in Caches: Evaluation on System Performance.",
                    "Analysis of Design Alternatives for Reverse Proxy Cache Providers.",
                    "A Packet-Level Simulation Study of Optimal Web Proxy Cache Placement.",
                    "Scheduling Parallel Jobs with CPU and I/O Resource Requirements in Cluster Computing Systems.",
                    "Derivation of Passage-time Densities in PEPA Models using ipc: the Imperial PEPA Compiler."
                ]
            },
            {
                "sub_name_abbr": "conf/mascots/2003t",
                "sub_name": "Performance Tools and Applications to Networked Systems, Revised Tutorial Lectures [from MASCOTS 2003].",
                "count": 17,
                "papers": [
                    "A Walk through Content Delivery Networks.",
                    "Computer Virus Propagation Models.",
                    "Performance Evaluation of Mail Systems.",
                    "CPN and QoS Driven Smart Routing in Wired and Wireless Networks.",
                    "Modeling and Simulation of Mesh Networks with Path Protection and Restoration.",
                    "Wireless Internet: Protocols and Performance.",
                    "Performance Models for 2.5/3G Mobile Systems and Networks.",
                    "IP-Oriented QoS in the Next Generation Networks: Application to Wireless Networks.",
                    "Peer-to-Peer Computing in Mobile Ad Hoc Networks.",
                    "Multipath Routing in Mobile Ad Hoc Networks: Issues and Challenges.",
                    "Algorithmic Design for Communication in Mobile Ad Hoc Networks.",
                    "Performance Management in Dynamic Computing Environments.",
                    "Software Performance Modeling Using UML and Petri Nets.",
                    "Enabling Simulation with Augmented Reality.",
                    "PEPA Nets.",
                    "Scheduling in Distributed Systems.",
                    "Data Allocation and Scheduling in Disks and Disk Arrays."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th MASCOTS 2002",
        "info": "Fort Worth, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2002",
                "sub_name": "10th International Workshop on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2002), 11-16 October 2002, Fort Worth, Texas, USA.",
                "count": 59,
                "papers": [
                    "Cognitive Packet Networks: QoS and Performance.",
                    "Workload Characterization in Web Caching Hierarchies.",
                    "Workload Service Requirements Analysis: A Queueing Network Optimization Approach.",
                    "Network Traffic Behaviour in Switched Ethernet Systems.",
                    "Variable Heavy Tailed Durations in Internet Traffic, Part I: Understanding Heavy Tails.",
                    "Power Conservation Strategies for MEMS-Based Storage Devices.",
                    "The Effect of Peer Selection and Buffering Strategies on the Performance of Peer-to-Peer File Sharing Systems.",
                    "DFS: A De-Fragmented File System.",
                    "A Self-Tuning Page Cleaner for DB2.",
                    "Cone Clustering Principles for Parallel Logic Simulatio.",
                    "Exploiting the Predictability of TCP's Steady-State Behavior to Speed Up Network Simulation.",
                    "A Mixed Abstraction Level Simulation Model of Large-Scale Internet Worm Infestations.",
                    "On the Sensitivity of Network Simulation to Topology.",
                    "Energy-Aware Routing in Cluster-Based Sensor Networks.",
                    "Analyzing the Short-Term Fairness of IEEE 802.11 in Wireless Multi-Hop Radio Networks.",
                    "Collision Avoidance in Multi-Hop Ad Hoc Networks.",
                    "Queueing Analysis of Delays in Bluetooth Slave/Slave Bridge.",
                    "An Efficient Routing Algorithm for All-Optical Networks with Turn Constraints.",
                    "Evaluating Advanced Routing Algorithms for Content-Based Publish/Subscribe Systems.",
                    "Modified LC-Trie Based Efficient Routing Lookup.",
                    "Disha: A Performance Model of a True Fully Adaptive Routing Algorithm in k-Ary n-Cubes.",
                    "Playing with Time: On the Specification and Execution of Time-Enriched LSCs.",
                    "eModel: Addressing the Need for a Flexible Modeling Framework in Autonomic Computing.",
                    "Novel Formulae for GSPN Aggregation.",
                    "Performance Analysis Using Coloured Petri Nets.",
                    "Performance Models for Computer and Telecommunications Systems: Maximizing the Benefits.",
                    "Network Level Capacity Planning with Efficiently Computable Global Optimum.",
                    "Faster Network Design with Scenario Pre-Filtering.",
                    "Statistical Service Assurances for Applications in Utility Grid Environments.",
                    "A Simulation Study of Non-Cooperative Pricing Strategies for Circuit-Switched Optical Networks.",
                    "Two-Level Iterative Queuing Modeling of Software Contention.",
                    "Studying Sensitivities of an EJB Performance Model.",
                    "A Case Study in Performance, Modifiability and Extensibility Analysis of a Telecommunication System Software Architecture.",
                    "Performance of Batch-Based Digital Signatures.",
                    "Analysis of Interference in a Wireless Link with Frequency Hopping.",
                    "TCP Performance Analysis of CDMA Systems with RLP and MAC Layer Retransmissions.",
                    "Modeling and Analysis of Fast Handoff Algorithms for Microcellular Networks.",
                    "Distributed Simulation of Dynamic Channel Access Protocols.",
                    "A Tool Based Methodology for Development of Automatically Scalable and Reusable Parallel Code.",
                    "Shaman: A Distributed Simulator for Shared Memory Multiprocessors.",
                    "WebTraff: A GUI for Web Proxy Cache Workload Modeling and Analysis.",
                    "nem: A Software for Network Topology Analysis and Modeling.",
                    "An Algorithmic and Numerical Approach to Bound the Performance of High Speed Networks.",
                    "Performance Modelling and Evaluation of k-Ary n-Cube Networks in the Presence of Bursty Traffi.",
                    "Modeling and Evaluation of Control Flow Prediction Schemes Using Complete System Simulation and Java Workloads.",
                    "Generation of High Bandwidth Network Traffic Traces.",
                    "Understanding the Object Retrieval Dependence of Web Page Access.",
                    "Global Caching Mechanisms in Clusters of Web Servers.",
                    "A New Mechanism for Supporting Differentiated Services in Cluster-Based Network Servers.",
                    "You Can Run, But You Can't Hide: An Effective Methodology to Traceback DDoS Attackers.",
                    "A Discrete-Time Model of TCP Reno with Background Traffic Interference.",
                    "A Model of TCP in Wide Area Networks.",
                    "Evaluation of Gossip to Build Scalable and Reliable Multicast Protocols.",
                    "A Performance Evaluation of a Temporally Correct and Optimistic Concurrency Control Protocol.",
                    "An Architectural Infrastructure and Topological Optimization for End System Multicast.",
                    "A Self-Sizing Framework for Adaptive Resource Allocation in Label-Switched Networks.",
                    "Analytical Modeling of Optical Burst Switching with Fiber Delay Lines.",
                    "Gap-Based Modeling of Packet Losses over the Internet.",
                    "Integrated Fluid and Packet Network Simulations."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th MASCOTS 2001",
        "info": "Cincinnati, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2001",
                "sub_name": "9th International Workshop on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2001), 15-18 August 2001, Cincinnati, OH, USA.",
                "count": 49,
                "papers": [
                    "High-Volume Web Servers: Traffic Patterns, Performance Implications and Resource Management.",
                    "Specification and Validation of a Real-Time Parallel Kernel Using LOTOS.",
                    "Performance Analysis of Pools in Soft Real-Time Design Architectures.",
                    "Dynamic Multipath Routing (DMPR): An Approach to Improve Resource Utilization in Networks for Real-Time Traffic.",
                    "An Evaluation of Grouping Techniques for State Dissemination in Networked Multi-User Games.",
                    "Effect of Event Orderings on Memory Requirement in Parallel Simulation.",
                    "Time-Parallel Algorithms for Simulation of Multiple Access Protocols.",
                    "Optimal Resource Assignment in Internet Data Centers.",
                    "Traffic Engineering Label Switched Paths in IP Networks using a Pre-Planned Flow Optimization Model.",
                    "QoS for Adaptive Multimedia in Wireless/Mobile Networks.",
                    "MoSync: A Synchronization Scheme for Cellular Wireless and Mobile Multimedia Systems.",
                    "Performance Study of a Multipath Routing Method for Wireless Mobile Ad Hoc Network.",
                    "Minimizing Routing State for Light-Weight Network Simulation.",
                    "Non-Blocking, Localized Routing Algorithm for Balanced Energy Consumption in Mobile Ad Hoc Networks.",
                    "Stability Analysis on Active Queue Management Algorithms in Routers.",
                    "ANML: A Language for Describing Networks.",
                    "Multi-Resolution Network Simulations Using Dynamic Component Substitution.",
                    "Packet Reading for Network Emulation.",
                    "Split Protocol Stack Network Simulations Using the Dynamic Simulation Backplan.",
                    "Design-Why We Don't Do It Right.",
                    "Low-Cost Performance Prediction of Data-Dependent Data Parallel Programs.",
                    "A Modular, Analytical Throughput Model for Modern Disk Arrays.",
                    "Performing File Prediction with a Program-Based Successor Model.",
                    "Improving Ensemble-TCP Performance on Asymmetric Networks.",
                    "How Does TCP Generate Pseudo-Self-Similarity?",
                    "Generalized Processor Sharing with Long-Range Dependent Traffic Input.",
                    "Plain End-to-End Measurement for Local Area Network Voice Transmission Feasibility.",
                    "Tuning of the Checkpointing and Communication Library for Optimistic Simulation on Myrinet Based NOWs.",
                    "Performance of Finite Field Arithmetic in an Elliptic Curve Cryptosystem.",
                    "A Queueing Model for Pipelined Circuit-Switched Networks with the MMPP Traffi.",
                    "Service Guarantees in Deflection Networks.",
                    "Analysis of Timeout-Based Adaptive Wormhole Routing.",
                    "PROFS-Performance-Oriented Data Reorganization for Log-Structured File System on Multi-Zone Disks.",
                    "Aggregating Caches: A Mechanism for Implicit File Prefetching.",
                    "A Bit-Parallel Search Algorithm for Allocating Free Space.",
                    "Large-Scale Simulation of Replica Placement Algorithms for a Serverless Distributed File System.",
                    "Parameterized Mobile Action Generator for a Wireless PCS Network.",
                    "On-Line Test System Applied in Routing Protocol Test.",
                    "PTPlan MPLS: A Tool for MPLS Network Dimensioning.",
                    "BRITE: An Approach to Universal Topology Generation.",
                    "On-Line Simulation Techniques for Real-Time Management of Systems.",
                    "The Structural Cause of File Size Distributions.",
                    "A Simulation Analysis of Dynamic Server Selection Algorithms for Replicated Web Services.",
                    "Simulation Evaluation of a Heterogeneous Web Proxy Caching Hierarchy.",
                    "HTTP Simulator Validation Using Real Measurements: A Case Study.",
                    "Performance Evaluation Based on an Aggregate ATM Model.",
                    "Modeling and Analysis of an ABR Flow Control Algorithm for a Virtual Source/Virtual Destination Switch.",
                    "On Class-Based Isolation of UDP, Short-Lived and Long-Lived TCP Flows.",
                    "A Stream Tapping Protocol with Partial Preloading."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th MASCOTS 2000",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/2000",
                "sub_name": "MASCOTS 2000, Proceedings of the 8th International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, 29 August - 1 September 2000, San Francisco, California, USA.",
                "count": 70,
                "papers": [
                    "Networks with Cognitive Packets.",
                    "Intelligent Prefetch in WWW Using Client Behavior Characterization.",
                    "Geographic Load Balancing for Scalable Distributed Web Systems.",
                    "Sources and Characteristics of Web Temporal Locality.",
                    "Towards a Rate-Based TCP Protocol for the Web.",
                    "Using N-body Algorithms for Interference Computation in Wireless Cellular Simulations.",
                    "A Performance Comparison of Energy Consumption for Mobile Ad Hoc Network Routing Protocols.",
                    "Analysis of Randomized Congestion Control in DSDV Routing.",
                    "Distributed Dynamic Channel Allocation for Mobile Communication Systems.",
                    "Establishing a Trade-off between Unicast and Multicast Retransmission Modes for Reliable Multicast Protocol.",
                    "Fieldbus Network Simulation Using a Time Extended Estelle Formalism.",
                    "A Performance Model of Broadcast Communication in Wormhole-Routed Hypercubes.",
                    "A Transaction-Level Tool for Predicting TCP Performance and for Network Engineering.",
                    "Profiling I/O Interrupts in Modern Architectures.",
                    "Sector Cache Design and Performance.",
                    "A Method for an Integrated Simulation Linked with Scheduling Policies on a Program-Driven Simulator.",
                    "Experimental Analysis of Coherency Behavior of Shared Memory Scientific Applications.",
                    "T3C: A Temporally Correct Concurrency Control Algorithm for Distributed Databases.",
                    "Analysis of Large-Scale Distributed Information Systems.",
                    "An Efficient Implementation of Interactive Video-on-Demand.",
                    "A Scalable Distributed Multimedia File System Using Network Attached Autonomous Disks.",
                    "Using Complete System Simulation for Temporal Debugging of General Purpose Operating Systems and Workload.",
                    "A New Approach in the Modeling and Generation of Synthetic Disk Workload.",
                    "Scowl: A Tool for Characterization of Parallel Workload and its Use on Splash-2 Application Suite.",
                    "A Performance Comparison of Monofractal and Multifractal Traffic Streams.",
                    "New Challenges in the Performance Evaluation of Communication Networks.",
                    "Simulation of Fluid Stochastic Petri Nets.",
                    "A Performance Analysis Framework for a System Lifespan.",
                    "The Impact of National Level Indicators on PC Adoption.",
                    "A Performance Study of Dynamic Replication Techniques in Continuous Media Servers.",
                    "NetLogger: A Toolkit for Distributed System Performance Analysis.",
                    "simCore: An Event-Driven Simulation Framework for Performance Evaluation of Computer Systems.",
                    "A Tool for Performance Measurement of NT Networks.",
                    "Parallel Co-Simulation of Conventional and Active Networks.",
                    "Modeling of Pipelined Circuit Switching in Multicomputer Networks.",
                    "Modeling and Simulation of Storage Area Networks.",
                    "A Parallel Discrete Event IP Network Emulator.",
                    "The Active Traffic Control Mechanism for Layered Multimedia Multicast in Active Network.",
                    "The synTraff Suite of Traffic Modeling Toolkits.",
                    "The Queuing Network Analysis Tool (QNAT).",
                    "An Efficient Method for Improving Large Optimistic PDES.",
                    "Comparison of Message Aggregation Strategies for Parallel Simulations on a High Performance Cluster.",
                    "Probabilistic Checkpointing in Time Warp Parallel Simulation.",
                    "An Agent-Based DDM Filtering Mechanism.",
                    "Intelligent Online BGP-4 Analyzer.",
                    "Register-Transfer Level Simulation.",
                    "Fault Tolerance Protocols for Parallel Programs Based on Tasks Replication.",
                    "Thin, High Performance Computing over the Internet.",
                    "BLLB: A Novel Traffic Policing Mechanism for ATM Networks.",
                    "Performance Analysis of an N(N ATM Switch with Markov Modulated Poisson Process under Back-Pressure Mechanism.",
                    "The Design of ATM Virtual Path Connection Networks with Service Separation.",
                    "Modeling and Analysis of UMTS Hierarchical Networks.",
                    "An Integrative Scheme of Differentiated Services: Modeling and Performance Analysis.",
                    "On a Novel Framework for Optimizing QoS of Long Range Dependence Traffic in ATM.",
                    "Network Path Pricing: A QoS-Based Model.",
                    "Statistical Traffic Modeling for Network Intrusion Detection.",
                    "An Optimal Distributed Call Admission Control for Adaptive Multimedia in Wireless/Mobile Networks.",
                    "Stochastic Simulations of Rejected World Wide Web Pages.",
                    "Optimizing a \"Content-Aware\" Load Balancing Strategy for Shared Web Hosting Service.",
                    "Predictive Admission Control Strategy for Overloaded Commercial Web Server.",
                    "Scaling for E-Business.",
                    "A Comparison of Three Protocols for Entry Consistency Maintenance Based on MVA Algorithm.",
                    "Stateless Routing in Network Simulations.",
                    "A Cost-Effective Load Balanced Adaptive Routing Scheme for Mesh-Connected Networks.",
                    "Cache Resident Data Locality Analysis.",
                    "An Approach to On-Line Predictive Detection.",
                    "Improving Small Job Response Time for Opportunistic Scheduling.",
                    "Performance Evaluation of Java RMI: A Distributed Object Architecture for Internet Based Applications.",
                    "Modeling and Evaluation of Redesigning Methodologies for Distributed Workflows.",
                    "Optimization of E-Service Solutions with the Systems of Servers Library."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th MASCOTS 1999",
        "info": "College Park, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1999",
                "sub_name": "MASCOTS 1999, Proceedings of the 7th International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, 24-28 October, 1999, College Park, Maryland, USA.",
                "count": 41,
                "papers": [
                    "The Design and Management of ATM Virtual Path Connection Networks.",
                    "Performance and Robustness Testing of Explicit-Rate ABR Flow Control Schemes.",
                    "Using ATM Services for (In)Efficient Support of TCP.",
                    "Local Resource Allocation for Providing End to End Delay Guarantees in ATM Networks Using PGPS Scheduling.",
                    "Performance Evaluation of Distributed Co-Ordination Function for IEEE 802.11 Wireless LAN Protocol in Presence of Mobile and Hidden Terminals.",
                    "TCP Performance and Buffer Provisioning for Internet in Wireless Networks.",
                    "Fair Scheduling in an Optical Interconnection Network.",
                    "The SimUTC Fault-Tolerant Distributed Systems Simulation Toolkit.",
                    "Optimizing Message Aggregation for Parallel Simulation on High Performance Clusters.",
                    "SDH Digital Cross-Connect Traffic Generation Algorithm.",
                    "Simulation of Broadband Multiple Access Protocols for Wireless Networks.",
                    "CAC Performance with Self-Similar Traffic: Simulation Study and Performance Results.",
                    "Simulation of Ultra-Large Communication Networks.",
                    "Network Simulations of a General Class of Partial-Connection Multiple-Bus Systems.",
                    "A Generic Framework for Parallelization of Network Simulations.",
                    "Failure Distance Based Bounds for Steady-State Availability without the Knowledge of Minimal Cuts.",
                    "Towards Performance Analysis with Partially Symmetrical SWN.",
                    "Jump Transitions in Second Order FSPNs.",
                    "Approximate Analysis of Open Network of GE/GE/m/N Queues with Transfer Blocking.",
                    "An Analytical Comparison of Cooperation Protocols for Web Proxy Servers.",
                    "Modeling Overhead in Servers with Transactional Workloads.",
                    "Analytical Modeling of the Network Traffic Performance.",
                    "Universal Benchmark Suites.",
                    "Analysis of Personal Computer Workloads.",
                    "Modeling User Behavior: A Layered Approach.",
                    "Predicting Behavior Patterns Using Adaptive Workload Models.",
                    "Analysis of Self-Similarity in I/O Workload Using Structural Modeling.",
                    "An Auction-Based Flexible Pricing Scheme for Renegotiated QoS Connections and Its Evaluation.",
                    "Adaptive CPU Scheduling Policies for Mixed Multimedia and Best-Effort Workloads.",
                    "On the Design of Efficient Video-on-Demand Broadcast Schedules.",
                    "Combining Pay-per-View and Video-on-Demand Services.",
                    "Multiprocessor Memory Reference Generation Using Cerberus.",
                    "Modeling Memory Reference Patterns of Programs in Cache Memory Systems.",
                    "A System-Assisted Disk I/O Simulation Technique.",
                    "Prediction of Disk Arm Movements in Anticipation of Future Requests.",
                    "A Design and Management Framework for Mobile Agent Systems.",
                    "A Synchronization Protocol for Group Communication Systems.",
                    "Evaluating Concurrency Options in Software Specifications.",
                    "Feature Interaction as a Satisfiability Problem.",
                    "An Experimental Analysis of Cryptographic Overhead in Performance-Critical Systems.",
                    "Model Checking the Secure Electronic Transaction (SET) Protocol."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th MASCOTS 1998",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1998",
                "sub_name": "MASCOTS 1998, Proceedings of the Sixth International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, 19-24 July, 1998, Montreal, Canada.",
                "count": 44,
                "papers": [
                    "Caches as Filters: A New Approach to Cache Analysis.",
                    "New Adaptive Object Replacement Policy for Video-on-Demand Systems.",
                    "mlcache: A Flexible Multi-Lateral Cache Simulator.",
                    "Extension of the Working Set for Modeling Spatial Locality in Program Behavior.",
                    "Simulation-based 'STRESS' Testing Case Study: A Multicast Routing Protocol.",
                    "Tree-Based Fault-Tolerant Multicast in Multicomputer Networks.",
                    "Multicast in Deflection Networks.",
                    "Cost-Delay Path Selection Function for Real-Time Multicast Routing.",
                    "Effect of Gateway Buffer Management Policies on TCP over ATM Performance.",
                    "A New Scheme for TCP Congestion Control: Smooth-Start and Dynamic Recovery.",
                    "IPB: An Internet Protocol Benchmark using Simulated Traffic.",
                    "Performance Modeling of OrbixTalk: A Message Delivery System based on Reliable Multicast Protocols.",
                    "Approaches to Link-State Alternate Path Routing in Connection-Oriented Networks.",
                    "An Empirical Comparison of Diffusion Approximations and Simulation in ATM Networks.",
                    "Real Time Resource Allocation in an ATM Network.",
                    "A Binary Feedback Flow Control Scheme using System Sensitivity Derivatives for Congestion Detection.",
                    "Statistical Multiplexing of Self-Similar Video Streams: Simulation Study and Performance Results.",
                    "Efficient Broadcasting Protocols for Video on Demand.",
                    "Performance Analysis of an End-to-End Bandwidth Regulation Scheme.",
                    "Comparison of Fair Queuing Algorithms with a Stochastic Approach.",
                    "Pro-active Performance Management of Distributed Applications.",
                    "Prioritized Multiprocessor Networks: Design and Performance.",
                    "Performance Modeling and Measurement of Parallelized Code for Distributed Shared Memory Multiprocessors.",
                    "A General Methodology for Characterizing Access Patterns and Analyzing Web Server Performance.",
                    "Performance of Hard Real-Time Transaction Scheduling Policies in Parallel Database Systems.",
                    "An Efficient Strategy for Developing a Simulator for a Novel Concurrent Multithreaded Processor Architecture.",
                    "Distributed-Shared-Memory Support on the Simultaneous Optical Multiprocessor Exchange Bus.",
                    "NETCAP: A Tool for the Capacity Planning of Ethernet LANs.",
                    "QoS Management: A Model-Based Approach.",
                    "A Novel Analysis Technique for Investigating Transient Performance of Queueing Systems.",
                    "Delay and Queue Size Analysis of TDMA with General Traffic.",
                    "Modeling Node Architectures.",
                    "IDES: A Java-based Distributed Simulation Engine.",
                    "Enabling Large-Scale Simulations: Selective Abstraction Approach to the Study of Multicast Protocols.",
                    "An On-Line Simulator for Wormhole Routing Networks.",
                    "A Measurement Methodology to Calibrate Analytical Models including Operating System Overhead.",
                    "Improving Lookahead in Parallel Wireless Network Simulation.",
                    "Simulation of Self-Organizing Spectrum Management in Wireless Networks.",
                    "Performance Analysis of Cellular Mobile Communication Networks Supporting Multimedia Services.",
                    "Transient Performance Analysis for Location Update Protocols in Cellular Networks.",
                    "Suboptimal Detection of Telemetry Signals: Functional Simulation and VLSI Implementation.",
                    "D2PAMN: Distributed Dynamic Power and Error Control Algorithm for Mobile Networks.",
                    "Extensions to VHDL for Abstraction of Concurrency and Communication.",
                    "Dynamic Schemes for Speculative Execution of Code."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th MASCOTS 1997",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1997",
                "sub_name": "MASCOTS 1997, Proceedings of the Fifth International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems, January 12-15, 1997 Haifa, Israel.",
                "count": 36,
                "papers": [
                    "A Hierarchical Load Sharing Policy for Distributed Systems.",
                    "Channel Based Scheduling of Parallelizable Task.",
                    "The Effect of Scheduling Discipline on Dynamic Load Sharing in Heterogeneous Distributed Systems.",
                    "Design and Implementation of Dynamic Load Balancing Algorithms for Rollback Reduction in Optimistic PDES.",
                    "A Dynamic Load Balancing Algorithm for Conservative Parallel Simulations.",
                    "Partitioning PCS for Parallel Simulation.",
                    "Cache Modeling in a Performance Evaluator for Parallel Database Systems.",
                    "Measuring RPC Traffic in an OS/2 DCE Environment.",
                    "A Modeling Framework for IT Adoption Study.",
                    "Analyzing the Workload of Scientific Visualization Tools: A Preliminary Study on TIPSY.",
                    "The Cache InjectionKofetch Architecture: Initial Performance Evaluation.",
                    "Load and Performance Modeling of Communication Subsystems with the DO-IT Toolbox.",
                    "A Neural Controller for Transit Node in High Speed Communication Networks.",
                    "A Hybrid Simulation Approach Enabling Performance Characterization of Large Software Systems.",
                    "A Study of Virtual Memory MTU Reassembly within the PowerPC Architectur.",
                    "Analytic Models of Workload Behavior and Pipeline Performance.",
                    "AND - ATM Network Design System.",
                    "A Regression Approach to Equivalent Bandwidth Characterization in ATM Networks.",
                    "Fluid Traffic Modeling in Simulation of a Call Admission Control Scheme for ATM Networks.",
                    "Modeling the Communication Behavior of the Intel Paragon.",
                    "Efficient Analysis Techniques for Symmetric Multiprocessor Architecture.",
                    "Smart: An Advanced Shared-Memory Simulator - Towards a System-Level Simulation Environmen.",
                    "Designing B-ISDN Network Topologies Using The Genetic Algorithm.",
                    "Modelling Slotted Multi-Channel Ring All-Optical Networks.",
                    "Modeling Integrated Services Traffic for Bandwidth Management in Next-Generation Intranets.",
                    "A Study of an SCI Switch Fabric.",
                    "On the Quantitative Specification of Jitter Constrained Periodic Stream.",
                    "Empirical Studies of Paging and I/O Activity of Parallel Programs.",
                    "Disk Caching in Large Database and Timeshared Systems.",
                    "Model-Based Alarm Correlation in Cellular Phone Networks.",
                    "Performance Comparison of Control Schemes for ABR Service in ATM LANs.",
                    "Performance Analysis of a Reliable Multicast Session Protocol for Collaborative Continuous-Feed Application.",
                    "A Method for the Computation of Reliability Bounds for Non-repairable Fault-tolerant Systems.",
                    "Queueing Network Models with Two Classes of Customers.",
                    "Performance Evaluation using Measure Dependent Transitions in Petri Nets.",
                    "Traffic Modeling Methodology for Performance Analysis of a Class of Wide-Area Network Problems."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th MASCOTS 1996",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1996",
                "sub_name": "MASCOTS '96, Proceedings of the Fourth International Workshop on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems, February 1-3, 1996, San Jose, California, USA.",
                "count": 48,
                "papers": [
                    "Building Parallel Simulations from Serial Simulators.",
                    "I/O, Performance Analysis, and Performance Data Immersion.",
                    "Performance Analysis, Simulation, and Validation Test: A Comparative Case Study about FDDI for Network Management.",
                    "Tuning the Performance of Fast Resource Management for Bursty Traffic in ATM-based Networks.",
                    "Zone-Bit-Recording-Enhanced Video Data Layout Strategies.",
                    "The Inaccuracy of Trace-Driven Simulation Using Incomplete Mulitprogramming Trace Data.",
                    "Bridge: A Retargetable Extensive Profiling Tool.",
                    "Annai/PMA Instrumentation Instrusion Presentation.",
                    "Simulation of Heterogeneous Networks of Workstations.",
                    "Performance Modeling of Heterogeneous Distributed Applications.",
                    "Using Remote Memory to Avoid Disk Thrashing: A Simulation Study.",
                    "A Multinomial Formulation for Efficient Simulation of Periodic On/Off Sources.",
                    "Two New Fair and Efficient Algorithms for Slot Reuse in DQDB MANs.",
                    "Two New Algorithms to Compute Steady-State Bounds for Markov Models with Slow Forward and Fast Backward Transitions.",
                    "Performance Estimation in a Simultaneous Multithreading Processor.",
                    "A Simulation Platform for Multi-Threaded Architectures.",
                    "Measurement and Modeling of EARTH-MANNA Multithreaded Architecture.",
                    "A Comparison of Methodologies for the Stationary Analysis of Data Gathered in the Simulation of Telecommunication Networks.",
                    "Design and Implementation of an Object-Oriented Network Simulator.",
                    "Object-Oriented Simulation of Multimedia-On-Demand Services over ATM Network.",
                    "Analysis of Buffer Design for Adaptive Routing in Direct Networks.",
                    "On the Design of Efficient Multistage Interconnection Networks.",
                    "Performance Analysis of WDM Networks with Wavelength Conversion.",
                    "Transaction Processing Workloads - A Comparison to the SPEC Benchmarks Using Memory Hierarchy Performance Studies.",
                    "The Design and Simulation of the PACE Prototype Architecture.",
                    "Quantitative Methods for Design of Benchmark Suites.",
                    "A Model for Parallel Simulation of Mobile Telecommunication Systems.",
                    "Parallelizable Execution-Driven Simulation of Threaded Distributed Memory Parallel Computations.",
                    "A Model or Parallel Simulation of Distributed Shared Memory.",
                    "The Annai/PMA Performance Monitor and Analyzer.",
                    "Vista: A Framework for Instrumentation System Design for Multidisplinary Applications.",
                    "Fair Queueing Architectures for High-Speed Networks.",
                    "Analyzing and Improving the IEEE 802.11-MAC Protocol for Wireless LANs.",
                    "Issues in Reliable Network Memory Paging.",
                    "Performability Management in Distributed Database Systems: An Adaptive Concurrency Control Protocol.",
                    "Performance Analysis and Optimization of Search and Selection Algorithms for Highly Parallel Associative Memories.",
                    "VISTA: A Configurable Visualization and Simulation Tool for ATM Switches.",
                    "MVPE: Visual Design of Parallel Simulation Models.",
                    "Simulation of Data-Parallel Programs in Parallaxis-III.",
                    "Evaluation of Cache Consistency Algorithm Performance.",
                    "A Performance Debugger for Eliminating Excess Synchronization in Shared-Memory Parallel Programs.",
                    "Event-Based Study of the Effect of Execution Environments on Prallel Program Performance.",
                    "Modeling and Analysis of Task Migration in Shared-Memory Computer Systems.",
                    "Performance Evaluation of an Intgrated Instrumentation System.",
                    "Comparing the Performance Parameters of Two Network Structures for Scalable Massively Parallel Processors.",
                    "Well-Defined Stochastic Petri Nets.",
                    "Evaluating Performance from Formal Specification.",
                    "Response Time Analysis of Two Server Fork-Join Systems."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd MASCOTS 1995",
        "info": "Durham, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1995",
                "sub_name": "MASCOTS '95, Proceedings of the Third International Workshop on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems, January 10-18, 1995, Durham, North Carolina, USA.",
                "count": 75,
                "papers": [
                    "A Short Theory of Multiprogramming.",
                    "Workload Modeling for Parallel Processing Systems.",
                    "Analysis of the Performance of a Distributed Simulator.",
                    "Performance Aspects of Real-Time Systems.",
                    "Approximate Analysis of Multi-Class Synchronized Closed Queueing Networks.",
                    "Multiple Class G-Networks with Jumps back to Zero.",
                    "G-Networks with Triggered Batch State-Dependent Movement.",
                    "Performance Analysis of the General Multi-Server Finite Waiting Room Model.",
                    "Efficient Massively Parallel Simulation of Dynamic Channel Assignment Schemes for Wireless Cellular Communications.",
                    "A Robust Heuristic for Minimizing Cell Loss in ATM Networks.",
                    "Performance Space of a GI/G/1 Queueing System under a Percentile Goal Criterion.",
                    "Performance Comparable Design of Efficient Synchronization Protocols for Distributed Simulation.",
                    "Parallel Discrete Event Simulation in Star Networks with Application to Telecommunications.",
                    "Parallelized Network Simulators for Message-Passing Parallel Programs.",
                    "An Efficient Algorithm to Compute the Synchronized Product.",
                    "Multiple Times in Systems: A Perspective.",
                    "A Two-Queue Polling Model with a Threshold Service Policy.",
                    "Asymptotics of the Partition Function in Large Closed BCMP Networks with Bottlenecks.",
                    "Bidirectional Estimation and Confidence Regions for TES Processes.",
                    "On the Performance Evaluation of Fully Asynchronous Processor Architectures.",
                    "An Improved Model for the Performance Analysis of Multistage Switches.",
                    "Analytic Performance Modeling for a Spectrum of Multithreaded Processor Architectures.",
                    "Bidirectional versus Unidirectional Networks: Cost/Performance Trade-Offs.",
                    "G-Networks and Minimum Cost Functions.",
                    "Scheduling of Random Task Graphs on Parallel Processors.",
                    "Product Form in Discrete-Time Queueing Networks: New Issues.",
                    "Approximate MVA for Client-Server Systems with Nonpreemptive Priority.",
                    "Approximate Performance Models of Real-Time Software Systems.",
                    "Priority Queueing in RAID5 Disk Arrays with an NVS Cache.",
                    "Adaptive Resource Management.",
                    "Numerical Evaluation of Stochastic Automata Networks.",
                    "An Eclectic Survey of Bounding Methods for Markov Chain Models.",
                    "Analysis of an Open Tandem Queueing Network with Population Constraint and Constant Service Times.",
                    "From Stochastic Petri Nets to Markov Regenerative Stochastic Petri Nets.",
                    "An Experimental Assessment of Express Parallel Programming Environment.",
                    "Extensible Parallel Program Performance Visualization.",
                    "Program Modelling via Inter-Reference Gaps and Applications.",
                    "The Effect of Workload on the Performance and Availability of Voting Algorithms.",
                    "Thread Placement on the Intel Paragon: Modeling and Experimentation.",
                    "A Program Behavior Model and Its Evaluation.",
                    "Differential Profiling.",
                    "SCILab - A Simulation Environment for the Scalable Coherent Interface.",
                    "HALSIM - A Very Fast SPARC-V9 Behavioral Model.",
                    "Bnet: Designing a Connectionless Broadband Data Service in an ATM Network by Simulated Annealing.",
                    "A Technique for the Distributed Simulation of Parallel Computers.",
                    "Modeling ATM Networks: A Case Study.",
                    "Quality-of-Service for Video and Data in Very-High-Speed DQDB MANs.",
                    "Simulation Model for Analysis of Synchronous Digital Hierarchy Network Payload Jitter.",
                    "A Heuristic Algorithm for Admission Control in ATM Networks.",
                    "VIZIR: An Integrated Environment for Distributed Program Visualization.",
                    "A Tool for Optimizing Large Scale Parallel Applications.",
                    "Methodology for Obtaining Abstract Views of State Graphs Labeled with Probabilities and Times: An Example of Application to a Communication Protocol.",
                    "Modelling of Object Based Systems with Hidden Sorted ECATNets.",
                    "System Modeling, Performance Analysis, and Evolutionary Prototyping with Hardware Description Languages.",
                    "Performance Simulation on a Multitarget Radial Remote-Positioning System.",
                    "PN3-Editor: Compositional Petri Net Editor for Protocol Specification.",
                    "Integration of Genetic Algorithms and Fuzzy Logic into a Neural Network Simulation Environment.",
                    "Wildcard Dimensions in Augmented Star and Bubble-Sort Networks.",
                    "Modelling of Client/Server Systems.",
                    "Interval-Based Performance Analysis of Computing Systems.",
                    "Dynamic File Migration to Support Parallel Database Systems.",
                    "The Loading Region: A Framework for the Performance Evaluation of Admission Control Policies for High Speed Networks.",
                    "Discrete Event Simulation Modeling of Concurrent Access in ATM-Based Computer Networks.",
                    "Spare Capacity Assignment in Telecom Networks Using Path Restoration.",
                    "RECET - A Real-Time Cache Evaluation Tool.",
                    "Real-Time and Performance Evaluation Extensions of Specification Language LOTOS.",
                    "From Modelling Using Function Charts for Control Systems to Analysis Using Petri Nets.",
                    "Transient Analysis of Deterministic and Stochastic Petri Nets by the Method of Supplementary Variables.",
                    "Automatic Generation of a Software Performance Model Using an Object-Oriented Prototype.",
                    "Q2: A New Performance Analysis Tool Exploiting Numerical Transform Inversion.",
                    "Teletraffic Challenges in Mobile and Personal Communications.",
                    "M/G/1 Queues with Negative Arrivals: An Iteration to Solve a Fredholm Integral Equation of the First Kind.",
                    "Performance Evaluation of Signalling Procedures for 3rd-Generation Mobile Systems.",
                    "SPLAT: A Standard-to-Standard Real-Time Graphical Scheduling and Code Generation Tool.",
                    "XNeuroGene: A System for Evolving Artificial Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2nd MASCOTS 1994",
        "info": "Durham, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1994",
                "sub_name": "MASCOTS '94, Proceedings of the Second International Workshop on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems, January 31 - February 2, 1994, Durham, North Carolina, USA.",
                "count": 80,
                "papers": [
                    "Distributed Simulation of Large-Scale PCS Networks.",
                    "Markov Reward Approach to Performability and Reliability Analysis.",
                    "Time Constrained Message Transmission in a LAN Environment.",
                    "Evaluating Memory System Performance of a Large-Scale NUMA Multiprocessor.",
                    "G-Networks with Multiple Class Negative and Positive Customers.",
                    "Parallel Simulation of Markovian Queueing Networks.",
                    "Modeling, Performance Evaluation, and Ordinal Optimization of Integrated Voice/Data Networks.",
                    "Trace-Driven Simulation of Data-Alignment and Ohter Factors Affecting Update and Invalidate Based Coherent Memory.",
                    "On Predictability of Caches for Real-Time Applications.",
                    "Evaluation of Write-Back Caches for Multiple Block-Sizes.",
                    "Modeling Power Management for Hard Disks.",
                    "Analytic Models and Characteristics of Video Traffic in High Speed Networks.",
                    "An Analysis of Space Priority Queueing in ATM Switches.",
                    "A Performance Study of Photonic Local Area Network Topologies.",
                    "On the Interaction between Gateway Scheduling and Routing.",
                    "Approximate Analysis of a Multi-Class Open Queueing Network with Class Blocking and Push-out.",
                    "Analytic Performance Estimation of Client-Server Systems with Multi-Threaded Clients.",
                    "A Case of Scientific Study Application I/O Behavior.",
                    "The Feasibility of Using Compression to Increase Memory System Performance.",
                    "Design and Simulation of a Serial-Link Interconnection Network for a Massively Parallel Computer System.",
                    "Modeling Adaptive Routing in k-ary n-cube Networks.",
                    "Conflict Analysis of Multistage Interconnection Networks.",
                    "Complete Exchange on a Wormhole Routed Mesh.",
                    "A Matrix Approach to Performance Data Modeling, Analysis and Visualization.",
                    "FAST: A Functional Algoritm Simulation Testbed.",
                    "Simulation of Temporal Behaviour Based on a Synchronous Language.",
                    "Xmgm: Performance Modeling Using Matrix Geometric Techniques.",
                    "Modeling Data Migration on CC-NUMA and CC-COMA Hierarchical Ring Architectures.",
                    "ES: A Tool for Predicting the Performance of Parallel Systems.",
                    "Performance of Multiple-Bus Multiprocessor under Non-Uniform Memory Reference.",
                    "VHDL Modeling for the Performance Evaluation of Multicomputer Networks.",
                    "Scalability Analysis Tools for SPMD Message-Passing Parallel Programs.",
                    "Automated Modeling of Message-Passing Programs.",
                    "A Flexible Graphical User Interface for Performance Modeling.",
                    "MINT: A Front End for Efficient Simulation of Shared-Memory Multiprocessors.",
                    "Analysis of Memory and Time Savings Using EC/DSIM.",
                    "A Performance Study of the RPE Mechanism for PDES.",
                    "Object-Oriented Modeling, Simulation and Implementation of a Network Management System.",
                    "Synchronous Digital Hierarchy Network Modeling.",
                    "The Knitting Technique and Its Application to Communication Protocol Synthesis.",
                    "Genetic Algorithm and Neural Network Approaches to Local Access Network Design.",
                    "Dynamic Load Balancing in Distributed Systems.",
                    "Adaptive Bidding Load Balancing Algorithms in Heterogeneous Distributed Systems.",
                    "On Solving Stochastic Coupling Matrices Arising in Iterative Aggregation/Disaggregation Methods.",
                    "An Analytical Model for the Binary Feeback Scheme.",
                    "Modeling and Evaluating the DQDB Protocol with Stochastic Timed Petri Nets.",
                    "Efficient Technique for Performance Analysis of Locking Protocols.",
                    "Visualization and Performance Analysis of Formally Specified Communication Protocols.",
                    "Integrating Peforamnce Analysis in the Context of LOTOS-Based Design.",
                    "Performance Comparison between TCP Slow-Start and a New Adaptive Rate-Based Congestion Avoidance Scheme.",
                    "Near-Critical Path Analysis of Program Activity Graphs.",
                    "Modeling to Obtain the Effective Bandwidth of a Traffic Source in an ATM Network.",
                    "A Comparison of Different Wormhole Routing Schemes.",
                    "An Object Oriented Approach in Building an Environment for Simulation and Analysis Based on Timed Petri Nets with Multiple Execution Policies.",
                    "Methodology for LAN Modeling and Analysis Using Petri Nets Based Models.",
                    "Simulation of Marked Graphs on SIMD Architectures Using Efficient Memory Management.",
                    "From Simulation to Virtual Reality: A Robotic Application.",
                    "MCEMS Toolbox - A Hardware-in-the-Loop Simulation Environment for Mechatronic Systems.",
                    "The 3d7-Simulation Environment: A Tool for Autonomous Mobile Robot Development.",
                    "Hierarchical Architecture Design and Simulation Environment.",
                    "Animated Simualtions of Media Access Protocols in Local Area Networks.",
                    "BONeS DESIGNER: A Graphical Environment for Discrete-Event Modeling and Simulation.",
                    "A Toolkit for Advanced Performance Analysis.",
                    "An Interactive Tool for Design, Simulation, Verification, and Synthesis of Protocols.",
                    "On-the-Fly Visualization and Debugging of Parallel Programs.",
                    "Experiment and Performance Evaluation of a Distributed Collaboration System.",
                    "Trace-Driven and Program-Driven Simulation: A Comparison.",
                    "Towards the Automatic Derivation of Computer Performance Models from the Real Time and Embedded Systems Design.",
                    "A Programmable Simulator for Analyzing the Block Data Flow Architecture.",
                    "Colored Petri Net Methods for Performance Analysis of Scalable High-Speed Interconnects.",
                    "Detecting Latent Sector Faults in Modern SCSI Disks.",
                    "Performance of Output-Multibuffered Multistage Interconnection Networks.",
                    "Visualization of Network Performance Using the AVS Visualization System.",
                    "Coreference Detection in Automatic Analysis of Specifications.",
                    "Visual Feedback for Validation of Informal Specifications.",
                    "Discrete Time Open Queueing Networks with Feedback, Bulk Arrivals and Services.",
                    "A Maximum Entropy Analysis of the Single Server Queue.",
                    "A Methodology for Generation and Collection of Multiprocessor Traces.",
                    "IDtrace - A Tracing Tool for i486 Simulation.",
                    "Stochastic Bounds on Execution Times of Parallel Computations."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1st MASCOTS 1993",
        "info": "La Jolla, San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mascots/1993",
                "sub_name": "MASCOTS '93, Proceedings of the International Workshop on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems, January 17-20, 1993, La Jolla, San Diego, CA, USA.",
                "count": 69,
                "papers": [
                    "G-Networks: A Unifying Model for Neural Nets and Queueing Networks.",
                    "The TES Methodology: Modeling Temporal Dependence in Empirical Time Series.",
                    "A Review of Quick Simulation Methods for Queues.",
                    "The IMPROV Meta-Tool Design Methodology for Visualization of Parallel Programs.",
                    "Performance Analysis of Fault-Tolerant Tree-Based VLSI Architectures.",
                    "Concurrent Simulation of Instruction Systolic Array Structures.",
                    "VLSI Architecture for Switch-Level Simulation.",
                    "Modeling and Evaluation of a Superscalar Architecture.",
                    "MultiSim: A Simulation Tool for the Study of Large-Scale Multiprocessors.",
                    "Evaluating Sequential Consistency in a Virtually Shared Memory System by Deterministic and Stochastic Petri Nets.",
                    "A Design for Efficient Simulation of a Multiprocessor.",
                    "A Parallel Algorithm for Cache Miss Ratio Evaluation.",
                    "Execution-Driven Simulation of Shared-Memory Multiprocessors.",
                    "Cell-Relay Network Simulation: A Demonstration of Heterogeneous Large-System Modeling.",
                    "A Testbed for Studying Parallel Programs and Parallel Execution Architectures.",
                    "X-Window Implementation of Finding Critical Loop, Next-Critical Loops and Iteration Bounds of Data Flow Graphs.",
                    "A Modeling Technique for Media Access Protocol Evaluation.",
                    "NETSIM: A General-Purpose Interconnection Network Simulator.",
                    "Incorporating Recovery in Performability Models for Multi-Computer Systems.",
                    "Approximation of Performance Parameters for Multistage, Multipath Networks.",
                    "Reliability and Availability Analysis of Manhattan Street Network.",
                    "Compact Modeling and Rapid Prototyping of Communication Software with ECATNets: A Case Study.",
                    "Performance Analysis of Routing Algorithms for the Rattlesnake Network.",
                    "A Delay Model for a Frame Relay Switch.",
                    "Fast Parallel Simulation of SS7 Telecommunication Networks.",
                    "Modeling and Performance Evaluation of Multiaccess Mechanisms at SUPERLAN.",
                    "A Generic Framework for the Simulation Analysis of Protocol Layered Communication Systems.",
                    "A Visual Simulation Model for Performance Analysis of a Complex Software System.",
                    "Automated Generation of Discrete Event-Driven Simulation Code From Computer Network Specifications.",
                    "Use of Hybrid and Hierarchical Simulation to Reduce Computation Costs.",
                    "Incomplete Trace Data and Trace Driven Simulation.",
                    "Fast Implementations of the Pending Event Set.",
                    "Modeling Object Behaviors Using Finite State Automata.",
                    "A Model for Pipelined Query Execution.",
                    "Simulation Modeling of Weak-Consistency Protocols.",
                    "The 'Two-to-One-Criterion' for Load Control in Locking Systems.",
                    "Performance Models for Perfect and Imperfect Clocks on Timestamp Ordering in Distributed Databases.",
                    "A General Framework for Modelling Data Replication Schemes.",
                    "Stochastic Petri Nets and an Extension of Norton's Theorem.",
                    "A Simulation Model of a Double Ring Protocol Based on Timed Well-Formed Coloured Petri Nets.",
                    "Minimum Marking for No Loop-Combination of General Petri Nets.",
                    "Sensitivity Analysis of Deterministic and Stochastic Petri Nets.",
                    "Experimental Evaluation of Distributed System Configurations.",
                    "A Comparative Analysis of Static Processor Partitioning Policies for Parallel Computers.",
                    "Parallel Modelling of Computer Networks for Connectivity Analysis.",
                    "A Semi-Markov Model of a Home Network Access Protocol.",
                    "Equilibrium Point Approximations for Multiple Access Protocols with Different Customer Classes.",
                    "On Message Delay for Multi-Access Protocols Based on TDMA Schemes.",
                    "An Exact Analysis of Prioritized Bus Arbitration Protocol.",
                    "On the Methods to Detect Sector Faults of a Disk Subsystem.",
                    "OMNeT: Objective Modular Network Testbed.",
                    "Conceptual Modeling of Digital Systems From Informal Descriptions.",
                    "Modeling and Simulation of Astronomical Image Transfer Via the Advanced Communications Technology Satellite.",
                    "SESAME - An Object Oriented Software Tool for Design, Simulation and Analysis of Neural Nets.",
                    "The NeuroGraph Neural Network Simulator.",
                    "SNNS: An Efficient Simulator for Neural Nets.",
                    "COMNET III: The New Enterprise-Wide Performance Analysis Tool.",
                    "SMURPH: An Object-Oriented Simulator for Communication Networks and Protocols.",
                    "The GILDA LAN Design Tool.",
                    "Program Development Simulator (PDS).",
                    "Constructing Microarchitecture Simulators Using Object-Oriented Building Blocks.",
                    "The Research Queueing Package Modeling Environment.",
                    "NeMoSys: A Neural Modeling System.",
                    "Modeling Using Stochastic Reward Nets.",
                    "DSPNexpress: A Software Package for the Efficient Simulation of Deterministic and Stochastic Petri Nets.",
                    "Power Processor Architecture Simulation.",
                    "Simulating Neural Networks in a Distributed Computing Environment Using NeuroGraph.",
                    "Object-Oriented Paradigms for Model Development Environments.",
                    "SPNP: The Stochastic Petri Net Package (Version 3.1)."
                ]
            }
        ]
    }
]