[
    {
        "year": "2019",
        "name": "35th MSST 2019",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2019",
                "sub_name": "35th Symposium on Mass Storage Systems and Technologies, MSST 2019, Santa Clara, CA, USA, May 20-24, 2019.",
                "count": 28,
                "papers": [
                    "Fighting with Unknowns: Estimating the Performance of Scalable Distributed Storage Systems with Minimal Measurement Data.",
                    "A Performance Study of Lustre File System Checker: Bottlenecks and Potentials.",
                    "Scalable QoS for Distributed Storage Clusters using Dynamic Token Allocation.",
                    "FastBuild: Accelerating Docker Image Building for Efficient Development and Deployment of Container.",
                    "BFO: Batch-File Operations on Massive Files for Consistent Performance Improvement.",
                    "vPFS+: Managing I/O Performance for Diverse HPC Applications.",
                    "Accelerating Relative-error Bounded Lossy Compression for HPC datasets with Precomputation-Based Mechanisms.",
                    "Efficient Encoding and Reconstruction of HPC Datasets for Checkpoint/Restart.",
                    "Tiered-ReRAM: A Low Latency and Energy Efficient TLC Crossbar ReRAM Architecture.",
                    "vNVML: An Efficient User Space Library for Virtualizing and Sharing Non-Volatile Memories.",
                    "Towards Virtual Machine Image Management for Persistent Memory.",
                    "Pattern-based Write Scheduling and Read Balance-oriented Wear-Leveling for Solid State Drivers.",
                    "When NVMe over Fabrics Meets Arm: Performance and Implications.",
                    "Long-Term JPEG Data Protection and Recovery for NAND Flash-Based Solid-State Storage.",
                    "Wear-aware Memory Management Scheme for Balancing Lifetime and Performance of Multiple NVM Slots.",
                    "CeSR: A Cell State Remapping Strategy to Reduce Raw Bit Error Rate of MLC NAND Flash.",
                    "Parallel all the time: Plane Level Parallelism Exploration for High Performance SSDs.",
                    "Economics of Information Storage: The Value in Storing the Long Tail.",
                    "DFPE: Explaining Predictive Models for Disk Failure Prediction.",
                    "Mitigate HDD Fail-Slow by Pro-actively Utilizing System-level Data Redundancy with Enhanced HDD Controllability and Observability.",
                    "Adjustable Flat Layouts for Two-Failure Tolerant Storage Systems.",
                    "AZ-Code: An Efficient Availability Zone Level Erasure Code to Provide High Fault Tolerance in Cloud Storage Systems.",
                    "XORInc: Optimizing Data Repair and Update for Erasure-Coded Systems with XOR-Based In-Network Computation.",
                    "Parity-Only Caching for Robust Straggler Tolerance.",
                    "Metadedup: Deduplicating Metadata in Encrypted Deduplication via Indirection.",
                    "CDAC: Content-Driven Deduplication-Aware Storage Cache.",
                    "SES-Dedup: a Case for Low-Cost ECC-based SSD Deduplication.",
                    "LIPA: A Learning-based Indexing and Prefetching Approach for Data Deduplication."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "34th MSST 2018",
        "info": "Santa Clara, California, USA",
        "venues": []
    },
    {
        "year": "2017",
        "name": "33rd MSST 2017",
        "info": "Santa Clara, California, USA",
        "venues": []
    },
    {
        "year": "2016",
        "name": "32nd MSST 2016",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2016",
                "sub_name": "32nd Symposium on Mass Storage Systems and Technologies, MSST 2016, Santa Clara, CA, USA, May 2-6, 2016.",
                "count": 21,
                "papers": [
                    "Pfimbi: Accelerating big data jobs through flow-controlled data replication.",
                    "Manylogs: Improved CMR/SMR disk bandwidth and faster durability with scattered logs.",
                    "Tombolo: Performance enhancements for cloud storage gateways.",
                    "Fine-grained metadata journaling on NVM.",
                    "Fast and failure-consistent updates of application data in non-volatile main memory file system.",
                    "HMVFS: A Hybrid Memory Versioning File System.",
                    "A long-term user-centric analysis of deduplication patterns.",
                    "Lazy exact deduplication.",
                    "Sorted deduplication: How to process thousands of backup streams.",
                    "Effects of prolonged media usage and long-term planning on archival systems.",
                    "Adaptive policies for balancing performance and lifetime of mixed SSD arrays through workload sampling.",
                    "REAL: A retention error aware LDPC decoding scheme to improve NAND flash read performance.",
                    "Analytic models for flash-based SSD performance when subject to trimming.",
                    "Reducing write amplification of flash storage through Cooperative Data Management with NVM.",
                    "Exploiting latency variation for access conflict reduction of NAND flash memory.",
                    "Understanding I/O performance behaviors of cloud storage from a client's perspective.",
                    "File system trace replay methods through the lens of metrology.",
                    "Impact of data placement on resilience in large-scale object storage systems.",
                    "Understanding storage I/O behaviors of mobile applications.",
                    "An Overlay File System for cloud-assisted mobile applications.",
                    "Fast transaction logging for smartphones."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "31st MSST 2015",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2015",
                "sub_name": "IEEE 31st Symposium on Mass Storage Systems and Technologies, MSST 2015, Santa Clara, CA, USA, May 30 - June 5, 2015.",
                "count": 24,
                "papers": [
                    "Blurred persistence in transactional persistent memory.",
                    "A study of application performance with non-volatile main memory.",
                    "SoftWrAP: A lightweight framework for transactional support of storage class memory.",
                    "Reducing MLC flash memory retention errors through Programming Initial Step Only.",
                    "Improving MLC flash performance and endurance with extended P/E cycles.",
                    "Incremental redundancy to reduce data retention errors in flash-based SSDs.",
                    "Removing the costs and retaining the benefits of flash-based SSD virtualization with FSDV.",
                    "Self-sorting SSD: Producing sorted data inside active SSDs.",
                    "GCTrees: Garbage collecting snapshots.",
                    "An empirical study of file systems on NVM.",
                    "WARM: Improving NAND flash memory lifetime with write-hotness aware retention management.",
                    "Classifying data to reduce long term data movement in shingled write disks.",
                    "Realistic request arrival generation in storage benchmarks.",
                    "ASCAR: Automating contention management for high-performance storage systems.",
                    "Atlas: Baidu's key-value storage system for cloud data.",
                    "GreenCHT: A power-proportional replication scheme for consistent hashing based key value storage systems.",
                    "Leap-based Content Defined Chunking - Theory and Implementation.",
                    "Amnesic cache management for non-volatile memory.",
                    "MinCounter: An efficient cuckoo hashing scheme for cloud storage systems.",
                    "Reducing CPU and network overhead for small I/O requests in network storage protocols over raw Ethernet.",
                    "VM-centric snapshot deduplication for cloud data backup.",
                    "Improving performance by bridging the semantic gap between multi-queue SSD and I/O virtualization framework.",
                    "Percival: A searchable secret-split datastore.",
                    "SecDep: A user-aware efficient fine-grained secure deduplication scheme with multi-level key management."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "30th MSST 2014",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2014",
                "sub_name": "IEEE 30th Symposium on Mass Storage Systems and Technologies, MSST 2014, Santa Clara, CA, USA, June 2-6, 2014.",
                "count": 23,
                "papers": [
                    "HiSMRfs: A high performance file system for shingled storage array.",
                    "A protected block device for Persistent Memory.",
                    "The case for sampling on very large file systems.",
                    "NAND flash architectures reducing write amplification through multi-write codes.",
                    "CBM: A cooperative buffer management for SSD.",
                    "PLC-cache: Endurable SSD cache for deduplication-based primary storage.",
                    "Improving min-sum LDPC decoding throughput by exploiting intra-cell bit error characteristic in MLC NAND flash memory.",
                    "CR5M: A mirroring-powered channel-RAID5 architecture for an SSD.",
                    "Tyche: An efficient Ethernet-based protocol for converged networked storage.",
                    "DedupT: Deduplication for tape systems.",
                    "Advanced magnetic tape technology for linear tape systems: Barium ferrite technology beyond the limitation of metal particulate media.",
                    "Toward I/O-efficient protection against silent data corruptions in RAID arrays.",
                    "Client-aware cloud storage.",
                    "Virtualization-aware access control for multitenant filesystems.",
                    "Exploiting parallelism in I/O scheduling for access conflict minimization in flash-based solid state drives.",
                    "H-ARC: A non-volatile memory based cache policy for solid state drives.",
                    "Automatic generation of behavioral hard disk drive access time models.",
                    "MorphStore: A local file system for Big Data with utility-driven replication and load-adaptive access scheduling.",
                    "SSD-optimized workload placement with adaptive learning and classification in HPC environments.",
                    "Analytical modeling of garbage collection algorithms in hotness-aware flash-based solid state drives.",
                    "Anode: Empirical detection of performance problems in storage systems using time-series analysis of periodic measurements.",
                    "Jericho: Achieving scalability through optimal data placement on multicore systems.",
                    "Möbius: A high performance transactional SSD with rich primitives."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "29th MSST 2013",
        "info": "Long Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2013",
                "sub_name": "IEEE 29th Symposium on Mass Storage Systems and Technologies, MSST 2013, May 6-10, 2013, Long Beach, CA, USA.",
                "count": 29,
                "papers": [
                    "The impact of areal density and millions of square inches (MSI) of produced memory on petabyte shipments of TAPE, NAND flash, and HDD storage class memories.",
                    "DROP: Facilitating distributed metadata management in EB-scale storage systems.",
                    "Zettabyte reliability with flexible end-to-end data integrity.",
                    "Secure Logical Isolation for Multi-tenancy in cloud storage.",
                    "Hybrid solid state drives for improved performance and enhanced lifetime.",
                    "A novel I/O scheduler for SSD with improved performance and lifetime.",
                    "Proactive drive failure prediction for large scale storage systems.",
                    "CORE: Augmenting regenerating-coding-based recovery for single and concurrent failures in distributed storage systems.",
                    "TIGER: Thermal-aware file assignment in storage clusters.",
                    "Fjord: Informed storage management for smartphones.",
                    "HCTrie: A structure for indexing hundreds of dimensions for use in file systems search.",
                    "Dynamic I/O congestion control in scalable lustre file system.",
                    "SOS: Software-based out-of-order scheduling for high-performance NAND flash-based SSDs.",
                    "NVMFS: A hybrid file system for improving random write in nand-flash SSD.",
                    "A flexible simulation tool for estimating data loss risks in storage arrays.",
                    "Paragone: What's next in block I/O trace modeling.",
                    "A deduplication study for host-side caches in virtualized data center environments.",
                    "On the design and implementation of a simulator for parallel file system research.",
                    "DRepl: Optimizing access to application data for analysis and visualization.",
                    "FSMAC: A file system metadata accelerator with non-volatile memory.",
                    "A lightweight I/O scheme to facilitate spatial and temporal queries of scientific data analytics.",
                    "Warped Mirrors for flash.",
                    "VSSIM: Virtual machine based SSD simulator.",
                    "Enabling cost-effective data processing with smart SSD.",
                    "Cache, cache everywhere, flushing all hits down the sink: On exclusivity in multilevel, hybrid caches.",
                    "Cooperative caching with return on investment.",
                    "Improving flash-based disk cache with Lazy Adaptive Replacement.",
                    "OSSD: A case for object-based solid state drives.",
                    "Optimizing a hybrid SSD/HDD HPC storage system based on file size distributions."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "28th MSST 2012",
        "info": "Pacific Grove, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2012",
                "sub_name": "IEEE 28th Symposium on Mass Storage Systems and Technologies, MSST 2012, April 16-20, 2012, Asilomar Conference Grounds, Pacific Grove, CA, USA.",
                "count": 26,
                "papers": [
                    "Integrating flash-based SSDs into the storage stack.",
                    "Active Flash: Out-of-core data analytics on flash storage.",
                    "Flashy prefetching for high-performance flash drives.",
                    "Mercury: Host-side flash caching for the data center.",
                    "On the role of burst buffers in leadership-class storage systems.",
                    "vPFS: Bandwidth virtualization of parallel storage systems.",
                    "On the speedup of single-disk failure recovery in XOR-coded storage systems: Theory and practice.",
                    "An active storage framework for object storage devices.",
                    "A new high-performance, energy-efficient replication storage system with reliability guarantee.",
                    "HRAID6ML: A hybrid RAID6 storage architecture with mirrored logging.",
                    "Write amplification due to ECC on flash memory or leave those bit errors alone.",
                    "Storage challenges at Los Alamos National Lab.",
                    "Adaptive pipeline for deduplication.",
                    "Shortcut-JFS: A write efficient journaling file system for phase change memory.",
                    "Deduplication in SSDs: Model and quantitative analysis.",
                    "Design of an exact data deduplication cluster.",
                    "Estimation of deduplication ratios in large data sets.",
                    "Jitter-free co-processing on a prototype exascale storage stack.",
                    "Enhancing shared RAID performance through online profiling.",
                    "Exploiting superpages in a nonvolatile memory file system.",
                    "SLO-aware hybrid store.",
                    "A QoS aware non-work-conserving disk scheduler.",
                    "Valmar: High-bandwidth real-time streaming data management.",
                    "ADAPT: Efficient workload-sensitive flash management based on adaptation, prediction and aggregation.",
                    "NANDFlashSim: Intrinsic latency variation aware NAND flash memory system modeling and simulation at microarchitecture level.",
                    "BloomStore: Bloom-Filter based memory-efficient key-value store for indexing of data deduplication on flash."
                ]
            },
            {
                "sub_name_abbr": "conf/mss/2010",
                "sub_name": "IEEE 26th Symposium on Mass Storage Systems and Technologies, MSST 2012, Lake Tahoe, Nevada, USA, May 3-7, 2010.",
                "count": 30,
                "papers": [
                    "An adaptive partitioning scheme for DRAM-based cache in Solid State Drives.",
                    "High performance solid state storage under Linux.",
                    "Achieving page-mapping FTL performance at block-mapping FTL cost by hiding address translation.",
                    "Block storage listener for detecting file-level intrusions.",
                    "Flat XOR-based erasure codes in storage systems: Constructions, efficient recovery, and tradeoffs.",
                    "S2-RAID: A new RAID architecture for fast data recovery.",
                    "Security Aware Partitioning for efficient file system search.",
                    "The Linear Tape File System.",
                    "The Hadoop Distributed File System.",
                    "A study of self-similarity in parallel I/O workloads.",
                    "BPAC: An adaptive write buffer management scheme for flash-based Solid State Drives.",
                    "Automated lookahead data migration in SSD-enabled multi-tiered storage systems.",
                    "Delayed partial parity scheme for reliable and high-performance flash memory SSD.",
                    "Deferred updates for flash-based storage.",
                    "dedupv1: Improving deduplication throughput using solid state drives (SSD).",
                    "Red: An efficient replacement algorithm based on REsident Distance for exclusive storage caches.",
                    "A performance model and file system space allocation scheme for SSDs.",
                    "Observations made while running a multi-petabyte storage system.",
                    "Write amplification reduction in NAND Flash through multi-write coding.",
                    "Disk-enabled authenticated encryption.",
                    "Scalable storage support for data stream processing.",
                    "Leveraging disk drive acoustic modes for power management.",
                    "Energy and thermal aware buffer cache replacement algorithm.",
                    "Mahanaxar: Quality of service guarantees in high-bandwidth, real-time streaming data storage.",
                    "A content-aware block placement algorithm for reducing PRAM storage bit writes.",
                    "Design issues for a shingled write disk system.",
                    "Indirection systems for shingled-recording disk drives.",
                    "MAD2: A scalable high-throughput exact deduplication approach for network backup services.",
                    "Enabling active storage on parallel I/O software stacks.",
                    "Exporting kernel page caching for efficient user-level I/O."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "27th MSST 2011",
        "info": "Denver, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2011",
                "sub_name": "IEEE 27th Symposium on Mass Storage Systems and Technologies, MSST 2011, Denver, Colorado, USA, May 23-27, 2011.",
                "count": 27,
                "papers": [
                    "Understanding and improving computational science storage access through continuous characterization.",
                    "Performance modeling and analysis of flash-based storage devices.",
                    "YouChoose: A performance interface enabling convenient and efficient QoS support for consolidated storage systems.",
                    "S-FTL: An efficient address translation for flash memory by exploiting spatial locality.",
                    "Hot data identification for flash-based storage systems using multiple bloom filters.",
                    "WAFTL: A workload adaptive flash translation layer with data partition.",
                    "Flexible, modular file volume virtualization in Loris.",
                    "Object-based SCM: An efficient interface for Storage Class Memories.",
                    "Design and evaluation of Oasis: An active storage framework based on T10 OSD standard.",
                    "Reliability-aware energy management for hybrid storage systems.",
                    "Semi-RAID: A reliable energy-aware RAID data layout for sequential data access.",
                    "ZoneFS: Stripe remodeling in cloud data centers.",
                    "Harmonia: A globally coordinated garbage collector for arrays of Solid-State Drives.",
                    "Rejuvenator: A static wear leveling algorithm for NAND flash memory with minimized overhead.",
                    "Boosting random write performance for enterprise flash storage systems.",
                    "Performance models of flash-based solid-state drives for real workloads.",
                    "Sampling-based garbage collection metadata management scheme for flash-based storage.",
                    "Data allocation strategies for the management of Quality of Service in Virtualised Storage Systems.",
                    "RAID6L: A log-assisted RAID6 storage architecture with improved write performance.",
                    "AoE storage protocol over MPLS network.",
                    "A Forest-structured Bloom Filter with flash memory.",
                    "Using XML and XQuery for data management in HPSS.",
                    "Evaluation model for long term data archiving systems in the context of Earth Observation.",
                    "The NASA Center for Climate Simulation Data Management System.",
                    "A technique for moving large data sets over high-performance long distance networks.",
                    "DBLK: Deduplication for primary block storage.",
                    "Heat-based dynamic data caching: A load balancing strategy for energy-efficient parallel storage systems with buffer disks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "26th MSST 2010",
        "info": "Lake Tahoe, Nevada, USA",
        "venues": []
    },
    {
        "year": "2008",
        "name": "25th MSST 2008",
        "info": "Baltimore, MD, USA",
        "venues": []
    },
    {
        "year": "2007",
        "name": "24th MSST 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2007",
                "sub_name": "24th IEEE Conference on Mass Storage Systems and Technologies (MSST 2007), 24-27 September 2007, San Diego, California, USA.",
                "count": 30,
                "papers": [
                    "Preservation DataStores: Architecture for Preservation Aware Storage.",
                    "GreenStor: Application-Aided Energy-Efficient Storage.",
                    "Modeling the Impact of Checkpoints on Next-Generation Systems.",
                    "Storage Resource Managers: Recent International Experience on Requirements and Multiple Co-Operating Implementations.",
                    "Grid-Enabled Standards-based Data Management.",
                    "Quota enforcement for high-performance distributed storage systems.",
                    "Implementing and Evaluating Security Controls for an Object-Based Storage System.",
                    "Trustworthy Migration and Retrieval of Regulatory Compliant Records.",
                    "Capability based Secure Access Control to Networked Storage Devices.",
                    "Enabling database-aware storage with OSD.",
                    "Design and Implementation of a Network Aware Object-based Tape Device.",
                    "Providing Quality of Service Support in Object-Based File System.",
                    "Efficient Logging and Replication Techniques for Comprehensive Data Protection.",
                    "Partial Disk Failures: Using Software to Analyze Physical Damage.",
                    "RAIF: Redundant Array of Independent Filesystems.",
                    "TPT-RAID: a High Performance Box-Fault Tolerant Storage System.",
                    "Tornado Codes for MAID Archival Storage.",
                    "Cryptographic Security for a High-Performance Distributed File System.",
                    "Implementation and Evaluation of a Popularity-Based Reconstruction Optimization Algorithm in Availability-Oriented Disk Arrays.",
                    "Performance Evaluation of Multiple TCP connections in iSCSI.",
                    "E-Beam Hard Disk Drive Using Gated Carbon Nano Tube Source and Phase Change Media.",
                    "The RAM Enhanced Disk Cache Project (REDCAP).",
                    "Inter-node Communication in Peer-to-Peer Storage Clusters.",
                    "Attribute Storage Design for Object-based Storage Devices.",
                    "Cost Analysis of the X-code Double Parity Array.",
                    "CASTOR: A Distributed Storage Resource Facility for High Performance Data Processing at CERN.",
                    "Using Comprehensive Analysis for Performance Debugging in Distributed Storage Systems.",
                    "Hybrid Host/Network Topologies for Massive Storage Clusters.",
                    "Early Experiences in Managing Inter-Site Storage Area Networks Using Secure Web Services.",
                    "Flushing Policies for NVCache Enabled Hard Disks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "23rd MSST 2006",
        "info": "College Park, MD, USA",
        "venues": []
    },
    {
        "year": "2005",
        "name": "22nd MSST 2005",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2005",
                "sub_name": "22nd IEEE / 13th NASA Goddard Conference on Mass Storage Systems and Technologies (MSST 2005), Information Retrieval from Very Large Storage Systems, CD-ROM, 11-14 April 2005, Monterey, CA, USA.",
                "count": 34,
                "papers": [
                    "Parallel File System Testing for the Lunatic Fringe: The Care and Feeding of Restless I/O Power Users.",
                    "Exporting Storage Systems in a Scalable Manner with pNFS.",
                    "QoS Provisioning Framework for an OSD-Based Storage System.",
                    "Mitigating Risk of Data Loss in Preservation Environments.",
                    "Richer File System Metadata Using Links and Attributes.",
                    "A Novel Update Propagation Module for the Data Provenance Problem: A Contemplating Vision on Realizing Data Provenance from Models to Storage.",
                    "Fermilab's Multi-Petabyte Scalable Mass Storage System.",
                    "EOSDIS Petabyte Archives: Tenth Anniversary.",
                    "The Design and Evolution of Jefferson Lab's Jasmine Mass Storage System.",
                    "Scaling a Global File System to the Greatest Possible Extent, Performance, Capacity, and Number of Users.",
                    "Storage-Based Intrusion Detection for Storage Area Networks (SANs).",
                    "Violin: A Framework for Extensible Block-Level Storage.",
                    "High Performance Storage System Scalability: Architecture, Implementation and Experience.",
                    "An Architecture for Lifecycle Management in Very Large File Systems.",
                    "OpenSMS.",
                    "A Hybrid Access Model for Storage Area Networks.",
                    "Impact of Failure on Interconnection Networks for Large Storage Systems.",
                    "Scalable, Reliable Marshalling and Organization of Distributed Large Scale Data Onto Enterprise Storage Environments.",
                    "Using MEMS-Based Storage to Boost Disk Performance.",
                    "Evaluation of Advanced TCP Stacks in the iSCSI Environment using Simulation Model.",
                    "STORAGEDB: Enhancing the Storage Sub-System with DBMS Functionalities.",
                    "Communicating Quality of Service Requirements to an Object-Based Storage Device.",
                    "Beyond the Storage Area Network: Data Intensive Computing in a Distributed Environment.",
                    "Predictive Reduction of Power and Latency (PuRPLe).",
                    "Slash - The Scalable Lightweight Archival Storage Hierarchy.",
                    "Efficient Access Control for Distributed Hierarchical File Systems.",
                    "Performance Evaluation of Commodity iSCSI-Based Storage Systems.",
                    "Security vs Performance: Tradeoffs using a Trust Framework.",
                    "Fault Recovery Designs for Processor-Embedded Distributed Storage Architectures with I/O-Intensive DB Workloads.",
                    "Dynamic Storage Resource Management Framework for the Grid.",
                    "Mass Storage System Performance Prediction Using a Trace-Driven Simulator.",
                    "Performance Impact of External Vibration on Consumer-Grade and Enterprise-Class Disk Drives.",
                    "The Relevance of Long-Range Dependence in Disk Traffic and Implications for Trace Synthesis.",
                    "Trade-Offs in Protecting Storage: A Meta-Data Comparison of Cryptographic, Backup/Versioning, Immutable/Tamper-Proof, and Redundant Storage Solutions."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "21st MSST 2004",
        "info": "Greenbelt, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2004",
                "sub_name": "21st IEEE Conference on Mass Storage Systems and Technologies / 12th NASA Goddard Conference on Mass Storage Systems and Technologies, Greenbelt, Maryland, USA, April 13-16, 2004.",
                "count": 42,
                "papers": [
                    "Data Grid Management Systems.",
                    "Long-term Stewardship of Globally-distributed Representation Information.",
                    "Fibre Channel and IP SAN.",
                    "Challenges in Long-Term Data Stewardship.",
                    "NARA's Electronic Records Archive (ERA) - The Electronic Records Challenge.",
                    "Preservation Environments.",
                    "Data Management as a Cluster Middleware Centerpiece.",
                    "Regulating I/O Performance of Shared Storage with a Control Theoretical Approach.",
                    "SAN and Data Transport Technology Evaluation at the NASA Goddard Space Flight Center.",
                    "File System Workload Analysis For Large Scientific Computing Applications.",
                    "V: Drive - Costs and Benefits of an Out-of-Band Storage Virtualization System.",
                    "Identifying Stable File Access Patterns.",
                    "An On-line Backup Function for a Clustered NAS System (X-NAS).",
                    "dCache, the Commodity Cache.",
                    "Hierarchical Storage Management at the NASA Center for Computational Sciences: From Unitree to SAM-QFS.",
                    "Parity Redundancy Strategies in a Large Scale Distributed Storage System.",
                    "Reducing Storage Management Costs via Informed User-Based Policies.",
                    "A Design of Metadata Server Cluster in Large Distributed Object-based Storage.",
                    "An iSCSI Design and Implementation.",
                    "Quanta Data Storage: A Cross Layer Architecture for the Storage Networks.",
                    "Rebuild Strategies for Redundant Disk Arrays.",
                    "Evaluation of Efficient Archival Storage Techniques.",
                    "An Efficient Data Sharing Scheme for iSCSI-Based File Systems.",
                    "Using DataSpace Archives to Support Long-Term Stewardship of Remote and Distributed Data.",
                    "Promote-IT: An Efficient Real-Time Tertiary-Storage Scheduler.",
                    "The Data Services Archive.",
                    "Interconnection Architectures for High-Performance Object-Based File Systems.",
                    "OBFS: A File System for Object-Based Storage Devices.",
                    "Duplicate Data Elimination in a SAN File System.",
                    "Clotho: Transparent Data Versioning at the Block I/O Level.",
                    "U.S. National Oceanographic Data Center Archival Practices and the Open Archives Information System Reference Model.",
                    "Storage Resource Sharing with CASTOR.",
                    "GUPFS: The Global Unified Parallel File System Project at NERSC.",
                    "SANSim - A Platform for Simulation and Design of a Storage Area Network.",
                    "Cost-Effective Remote Mirroring Using the iSCSI Protocol.",
                    "Simulation Study of iSCSI-based Storage System.",
                    "Comparative Performance Evaluation of iSCSI Protocol over Metro, Local, and Wide Area Networks.",
                    "H-RAIN: An Architecture for Future-Proofing Digital Archives.",
                    "A New Approach to Disk-Based Scalable Mass Storage System.",
                    "Multi-Tiered Storage - Consolidating the Differing Storage Requirements of the Enterprise into a Single Storage System.",
                    "Managing Scalability in Object Storage Systems for HPC Linux Clusters.",
                    "The Evolution of a Distributed Storage System."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "20th MSS 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2003",
                "sub_name": "20th IEEE/11th NASA Goddard Conference on Mass Storage Systems and Technologies, MSS 2003, San Diego, California, USA, April 7-10, 2003.",
                "count": 36,
                "papers": [
                    "Data Grids, Collections, and Grid Bricks.",
                    "Accurate Modeling of Cache Replacement Policies in a Data Grid.",
                    "A Simple Mass Storage System for the SRB Data Grid.",
                    "Building Cost-Effective Remote Data Storage Capabilities for NASA's EOSDI.",
                    "Archive Management: The Missing Component.",
                    "An Overview of a Large-Scale Data Migration.",
                    "Towards Optimal I/O Scheduling for MEMS-Based Storag.",
                    "A Case for the Global Access to Large Distributed Data Sets Using Data Webs Employing Photonic Data Services.",
                    "Design and Implementation of Multiple Addresses Parallel Transmission Architecture for Storage Area Network.",
                    "Storage Devices, Local File System and Crossbar Network File System Characteristics, and 1 Terabyte File IO Benchmark on the \"Numerical Simulator III\" .",
                    "Views, Objects, and Persistence for Accessing a High Volume Global Data Set.",
                    "NAS Switch: A Novel CIFS Server Virtualization.",
                    "NSM: A Distributed Storage Architecture for Data-Intensive Applications.",
                    "Implementing and Evaluating Jukebox Schedulers Using JukeTools.",
                    "Media Stability and Life Expectancies of Magnetic Tape for Use with IBM 3590 and Digital Linear Tape Systems.",
                    "The Fermilab Data Storage Infrastructure.",
                    "High Bandwidth Scientific Data Management Using Storage Area Networking: Lessons Learned at the Starfire Optical Range.",
                    "NCDC the \"One Stop Shop\" for All WSR-88D Level II Data Service.",
                    "Design of the iSCSI Protocol.",
                    "A Performance Analysis of the iSCSI Protocol.",
                    "Considerations and Performance Evaluations of Shared Storage Area Networks at NASA Goddard Space Flight Center.",
                    "Reliability Mechanisms for Very Large Storage Systems.",
                    "Software-Based Erasure Codes for Scalable Distributed Storage.",
                    "Towards an Object Stor.",
                    "Design and Implementation of a Storage Repository Using Commonality Factoring.",
                    "Design and Implementation of a Block Storage Multi-Protocol Converter.",
                    "IP SAN - From iSCSI to IP-Addressable Ethernet Disks.",
                    "A Scalable Architecture for Clustered Network Attached Storage.",
                    "zFS - A Scalable Distributed File System Using Object Disks.",
                    "Concept and Evaluation of X-NAS: A Highly Scalable NAS System.",
                    "Using Multiple Predictors to Improve the Accuracy of File Access Predictions.",
                    "Peabody: The Time Travelling Disk.",
                    "SPIRAL: A Client-Transparent Third-Party Transfer Scheme for Network Attached Disks.",
                    "Effective Management of Hierarchical Storage Using Two Levels of Data Clustering.",
                    "A Centralized Data Access Model for Grid Computing.",
                    "Efficient Metadata Management in Large Distributed Storage Systems."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "19th MSS 2002",
        "info": "College Park, MD, USA",
        "venues": []
    },
    {
        "year": "2001",
        "name": "18th MSS 2001",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2001",
                "sub_name": "18th IEEE Symposium on Mass Storage Systems, MSS 2001: Large Scale Storage in the Web, San Diego, CA, USA, April 17-20, 2001.",
                "count": 29,
                "papers": [
                    "Distributed Database Management Systems and the Data Grid.",
                    "Secure, Efficient Data Transport and Replica Management for High-Performance Data-Intensive Computing.",
                    "Knowledge-based Grids.",
                    "Architecture, Implementation, and Deployment of a High Performance, High Capacity Resilient Mass Storage Server (RMSS).",
                    "Mass Storage on the Terascale Computing System.",
                    "Efficient Algorithms for Persistent Storage Allocation.",
                    "Active Disk File System: A Distributed, Scalable File System.",
                    "File System Benchmarks, Then, Now, and Tomorrow.",
                    "High-Speed Data Transfer via HPSS using Striped Gigabit Ethernet Communications Phil Andrews, Tom Sherwin, and Victor Hazlewood.",
                    "SFIO a striped file I/O library for MPI.",
                    "Two case studies of the application of dynamic modeling techniques in performance assessment and prediction of complex shared storage architectures.",
                    "Building the Mass Storage System at Jefferson Lab Ian Bird, Bryan Hess, Andy Kowalski.",
                    "Simplifying the Web User's Interface to Massive Data Sets.",
                    "A Massive Repository for the National Medical Knowledge Bank Warren M. Sterling, Ph.D.",
                    "Physical Modeling of Probe-Based Storage.",
                    "Multi-layer Optical Data Storage Based on Two-photon Recordable Fluorescent Disk Media.",
                    "Compact Holographic Data Storage System.",
                    "Arms Control in the Information Age: World-Wide Data Acquisition, Analysis, Storage and Access in Near-Realtime.",
                    "Architecture of the Secure File System.",
                    "Large-Scale Flexible Storage with SAN Technology Phil Andrews, Tom Sherwin, and Bryan Banister.",
                    "Retrieving Multimedia Objects From Hierarchical Storage Systems.",
                    "Video Server with Tertiary Storage.",
                    "Characterizing Long Term Usage of a Mass Storage System At a Super Computer Site.",
                    "Software RAID Technology for cluster environments Yoshitake Shinkai, Tetsutaro Maruyama, Naomi Yoshizawa.",
                    "WARP: Warp Around Data Placement Technique for Serpentine Tapes.",
                    "JiroTM Management Applications.",
                    "Archive - Where it started and the Problems of Perpetuity.",
                    "Challenges and Solutions in Allocating Data in a SAN Environment.",
                    "StorHouse.com - The Data Management Service Provider."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "17th MSS 2000",
        "info": "College Park, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/2000",
                "sub_name": "Eighth NASA Goddard Space Flight Center Conference on Mass Storage Systems and Technologies in cooperation with Seventeenth IEEE Symposium on Mass Storage Systems, MSS 2000, College Park, MD, USA, March 27-30, 2000.",
                "count": 37,
                "papers": [
                    "Disk Subsystem Performance Evaluation: From Disk Drives to Storage Area Networks.",
                    "I/O and Storage Tuning: An Introduction to I/O and Storage Tuning Tips and Techniques.",
                    "Accelerated Aging Studies and the Prediction of the Archival Lifetime of Optical Disk Media.",
                    "Functionality and Performance Evaluation of File Systems for Storage Area Networks (SAN).",
                    "APRIL: A Run-Time Library for Tape-Resident Data.",
                    "Performance of an MPI-IO Implementation Using Third-Party Transfer.",
                    "Implementation of a Fault-Tolerant Real-Time Network-Attached Storage Device.",
                    "Access Coordination of Tertiary Storage for High Energy Physics Applications.",
                    "DataCutter: Middleware for Filtering Very Large Scientific Datasets on Archival Storage Systems.",
                    "Towards Mass Storage Systems with Object Granularity.",
                    "The InTENsity PowerWall: A Case Study for a Shared File System Testing Framework.",
                    "Alternatives of Implementing a Cluster File System.",
                    "StorHouse/Relational Manager (RM) - Active Storage Hierarchy Database System and Applications.",
                    "Fault Tolerant Design in the Earth Orbiting Systems Archive.",
                    "Connection of a Climate Model Database and Mass Storage Archive(s).",
                    "New Prospects for Electrostatic Data Storage Systems.",
                    "Tertiary Storage Organization for Large Multidimensional Datasets.",
                    "Ferroelectric Molecular Optical Storage Nanotechnology.",
                    "A Stack Model Based Replacement Policy for a NonVolatile Write Cache.",
                    "Switched FC-AL: An Arbitrated Loop Attachment for Fibre Channel Switches.",
                    "Evaluating Backup Algorithms.",
                    "An Overview of Version 0.9.5 Proposed SCSI Device Locks.",
                    "A Scalable Architecture for Maximizing Concurrency.",
                    "Using Track-Following Servo Technology on LTO Tape Drives.",
                    "Optical Head Design for 1 TB Capacity Optical Tape Drive.",
                    "A Portable Tape Driver Architecture.",
                    "Optical Storage.",
                    "EOSDIS Archive and Distribution Systems in 2000.",
                    "Mass Storage System Upgrades at the NASA Center for Computational Sciences.",
                    "Data Volume Proliferation in the 21st Century - The Challenges Faced by the NOAA National Data Centers (NNDC).",
                    "Implementing Journaling in a Linux Shared Disk File System.",
                    "Design for a Decentralized Security System For Network Attached Storage.",
                    "Jiro Storage Management.",
                    "A Blueprint for Representation Information in the OAIS Model.",
                    "Project 1244: IEEE Storage System Standards.",
                    "Compact Holographic Read/Write Memory.",
                    "High Density Holographic Data Storage."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "16th MSS 1999",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1999",
                "sub_name": "16th IEEE Symposium on Mass Storage Systems in cooperation with the 7th NASA Goddard Space Flight Center Conference on Mass Storage Systems and Technologies, San Diego, California, USA, March 15-18, 1999.",
                "count": 26,
                "papers": [
                    "Massive-Scale Data Management using Standards-Based Solutions.",
                    "Performance Characteristics of Large and Long Fibre Channel Arbitrated Loops.",
                    "A 64-bit, Shared Disk File System for Linux.",
                    "Overview of a TRW Pilot Program.",
                    "The NOAA Virtual Data System: Improving Access to and Management of Federal Environmental Data.",
                    "Satellite Imagery Archive System and its Usage Analysis at IIS, University of Tokyo.",
                    "Tape Group Parity Protection.",
                    "Redundant Optical Storage System Using DVD-RAM Library.",
                    "Adaptive Disk Striping for Parallel Input/Output.",
                    "Analysis of HPSS Performance Based on Per-file Transfer Logs.",
                    "Low-Cost Access Time Model for a Serpentine Tape Drive.",
                    "Improved Adaptive Replacement Algorithm for Disk-Caches in HSM Systems.",
                    "Eurostore - Initial Design and First Results.",
                    "HPSS at Los Alamos: Experiences and Analysis.",
                    "Configuring and Tuning Archival Storage Systems.",
                    "Pursuit of a Scalable High Performance Multi-Petabyte Database.",
                    "Collection-Based Persistent Archives.",
                    "Managing Databases with Binary Large Objects.",
                    "Clustered Multi-media NOD: Popularity-based Article Prefetching and Placement.",
                    "Usage Patterns of a Web-Based Image Collection.",
                    "Hiding HSM Systems from the User.",
                    "Designing a Self-Maintaining Storage System.",
                    "Performance Benchmark Results for Automated Tape Library High Retrieval Rate Applications - Digital Check Image Retrievals.",
                    "Some Parameters in the Design of Streaming Tape Drives.",
                    "Finding Coincident Data from Satellites: Using 'Meta-Metadata' to Reduce Load on Archive.",
                    "Device Locks: Mutual Exclusion for Storage Area Networks."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "15th MSS 1998",
        "info": "College Park, MD, USA",
        "venues": []
    },
    {
        "year": "1995",
        "name": "14th MSS 1995",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1995",
                "sub_name": "Proceedings of the Fourteenth IEEE Symposium on Mass Storage Systems, MSS 1995: Storage - At the Forefront of Information Infrastructures, Monterey, California, USA, September 11-14, 1995.",
                "count": 35,
                "papers": [
                    "Changing Horses in Mid-stream (Or, How Do You Follow of the Most Successful Acts in Mass Storage?).",
                    "Data Storage and Management Requirements for the Multimedia Computer-Based Patient Medical Record.",
                    "Deterministic Load-Balancing Schemes for Disk-Based Video-On-Demand Storage Servers.",
                    "The Parallel I/O Architecture of the High-Performance Storage System (HPSS).",
                    "Using Distributed OLTP Technology in a High Performance Storage System.",
                    "Physical Volume Library Deadlock Avoidance in a Striped Media Environment.",
                    "Architecture and Design of Storage and Data Management for the NASA Earth Observing System Data and Information System (EOSDIS).",
                    "Implementing a Shared File System on a HIPPI Disk Array.",
                    "An Architecture for a Scalable, High-Performance Digital Library.",
                    "Towards a Heterogeneous Common/Shared Storage System Architecture.",
                    "Client/Server data Serving for High-Performance Computing.",
                    "Database Systems for Efficient Access to Tertiary Memory.",
                    "Caching and Migration for Multilevel Persistent Object Stores.",
                    "Multikey Index Support for Tuple Sets on Parallel Mass Storage Systems.",
                    "IMACTS: An Interactive, Multiterabyte Image Archive.",
                    "Scientific Data Management in the Environmental Molecular Science Laboratory.",
                    "Data Management at CERN: Current Status and Future Trends.",
                    "Experiences from NASA/Langley's DMSS Project.",
                    "Implementation of a Campus-wide Distributed Mass Storage Server: The Dream vs. Reality.",
                    "Managing and Service a Multiterabyte Data Set at the Fermilab D0 Experiment.",
                    "An Approximate Performance Model of a Unitree Mas Storage System.",
                    "Analysis of Striping Techniques in Robotic Storage Libraries.",
                    "Design and Implementation of a Network-wide Concurrent File System in a Workstation Cluster.",
                    "Storage Systems for Movies-on-Demand Video Servers.",
                    "Data Retrieval from Climate Model Archives.",
                    "The Planetary Data System Web Catalog Interface - Another Use of the Planetary Data System Data Model.",
                    "A Knowledge-Based System Approach for Scientific Data Analysis and the Notion of Metadata.",
                    "Distributed Access System for Uniform and Scalbale Data and Service Access.",
                    "A Framework for Understanding Large Scale Digital Storage Systems.",
                    "The IEEE Storage System Standards Working Group Overview and Status.",
                    "Virtual Storage Architecture Guide (VSAG).",
                    "The Data Management Applications Programming Interface.",
                    "Managament Issues for High-Performance Storage Systems.",
                    "Silicon Microstructures and Microactuators for Compact Computer Disk Drives.",
                    "A Supercomputer System Interconnect and Scalable IOS."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "13th MSS 1994",
        "info": "L'Annecy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1994",
                "sub_name": "Proceedings of the 13th IEEE Symposium on Mass Storage Systems, MSS 1994: Towards Distributed Storage and Data Management Systems, L'Annecy, France, June 12-16, 1994.",
                "count": 29,
                "papers": [
                    "NOAA's environmental data system requirements: in search of a distributed data management system.",
                    "Data management for the National Space Development Agency's (NASDA's) Earth-Observing Data and Information System (EOIS).",
                    "International Geosphere and Biosphere Program (IGBP) metadata information system for globally distributed data sets.",
                    "Magnetic storage technology-the 1990s-evolution or revolution?",
                    "Optical storage: technology and applications.",
                    "Distributed file systems: focus on Andrew File System/Distributed File Service (AFS/DFS).",
                    "The integration of distributed file systems and mass storage systems.",
                    "Data storage and management for high-energy physics: technical and sociological requirements.",
                    "The National Storage Laboratory (NSL): overview and status.",
                    "Storage Technology Initiatives - NSIC (National Storage Industry Consortium).",
                    "The National Storage System Foundation (NSSF).",
                    "Sequoia 2000: A Next-Generation Information System for the Study of Global Change.",
                    "Flying with instruments: characterizing the NCAR MSS-III workload.",
                    "Alternate views on the physical volume library.",
                    "Simple tape management system.",
                    "Automatic Managed Filestores - Practice and Experience (Abstract).",
                    "Broadband Exchange over Trans-European Links (BETEL).",
                    "Real-time multimedia systems.",
                    "The impact of digital audio and video on high-speed storage.",
                    "Multimedia performance behavior of the GigaView parallel image server.",
                    "Data partitioning and load balancing in parallel storage systems.",
                    "Storage alternatives for video service.",
                    "A joint European mass storage specification effort.",
                    "Major capacity, data rate, and reliability advances in IBM longitudinal magnetic tape recording technology.",
                    "Backup and storage management in distributed heterogeneous environments.",
                    "High-data-rate, high-density magnetic tape recorder using matrix writing head and Kerr reading head.",
                    "Parallel file system experience on the IBM 9076.",
                    "Overview of the removable-media mass storage market.",
                    "Robotic experiences or traumatic experiences?"
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "12th MSS 1993",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1993",
                "sub_name": "Proceedings of the Twelfth IEEE Symposium on Mass Storage Systems, Monterey, California, USA, April 26-29, 1993.",
                "count": 37,
                "papers": [
                    "Data management requirements for high energy physics in the year 2000.",
                    "Electronic archiving for radiology image management systems.",
                    "Requirements for hierarchical storage management at AT&T Bell Laboratories.",
                    "Providing mass data storage and retrieval services in an application-specific environment.",
                    "Requirements for a system to analyze high energy physics events using database computing.",
                    "Now that the storage train's here, can we get everybody on board?",
                    "An introduction to the Mass Storage System Reference Model, version 5.",
                    "Applying IEEE Storage System Management Standards at the National Storage Laboratory.",
                    "Toward a standard IEEE Mover.",
                    "Security in the IEEE Mass Storage System Reference Model.",
                    "The storage server as virtual volume manager.",
                    "The IEEE Storage System Standards Working Group Physical Volume Repository.",
                    "The emerging storage management paradigm.",
                    "Los Alamos HPDS: high-speed data transfer.",
                    "The MaSSIVE project at NCAR.",
                    "An AFS-based supercomputing environment.",
                    "Integrating mass storage and file systems.",
                    "Hierarchical Storage Management for Relational Databases.",
                    "Distributed Information Storage Architecture.",
                    "HighLight: a file system for tertiary storage.",
                    "RAMA: a file system for massively-parallel computers.",
                    "A test bed for a high-performance file server.",
                    "Architecture and implementation of an on-line data archive and distribution system.",
                    "The Planetary Data System data model.",
                    "Application of a mass storage system to science data management.",
                    "Distributed indices for accessing distributed data.",
                    "A proof-of-concept implementation interfacing an object manager with a hierarchical storage system.",
                    "Optimizing mass storage organization and access for multi-dimensional scientific data.",
                    "Parallel storage and retrieval of pixmap images.",
                    "Scheduling real-time disk transfers for continuous media applications.",
                    "Mass storage systems for image management and distribution.",
                    "Network Storage Service usage characteristics.",
                    "System architectures using Fibre Channel.",
                    "Striped Tape Arrays.",
                    "Re-defining the storage hierarchy: an ultra-fast magneto-optical disk drive.",
                    "High-performance data transfers using network-attached peripherals at the National Storage Laboratory.",
                    "A spacecraft mass storage optical disk system."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "11th MSS 1991",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1991",
                "sub_name": "Proceedings of the Eleventh IEEE Symposium on Mass Storage Systems, Monterey, California, USA, October 7-10, 1991.",
                "count": 29,
                "papers": [
                    "Renaissance: managing the network computer and its storage requirements.",
                    "Local area gigabit networking.",
                    "NASA Earth Observing System Data Information System (EOSDIS).",
                    "National Supercomputing Center mass storage system requirements.",
                    "Client requirements for a UNIX-based network file-transport utility.",
                    "High-performance data systems.",
                    "Mass storage requirements in the intelligence community.",
                    "MSS requirements for data acquisition systems.",
                    "Factors affecting the performance of a DOS-based WORM file server.",
                    "Benchmarking a network storage service.",
                    "Performance of balanced disk array schemes.",
                    "Analyzing the I/O behavior of supercomputer applications.",
                    "Performance study of client-server storage systems.",
                    "E-systems Modular Automated Storage System (EMASS) software functionality.",
                    "Design for a transparent, distributed file system.",
                    "Dynamic hierarchies and optimization in distributed storage systems.",
                    "Volume management by the book: the NAStore Volume Manager.",
                    "The NCSC mass storage project.",
                    "A high-performance UNIX network storage server.",
                    "Distributed storage management in high energy physics.",
                    "The HADES file server.",
                    "An AFS-based mass storage system at the Pittsburgh Supercomputing Center.",
                    "Swift: a storage architecture for large objects.",
                    "DataMesh-parallel storage systems for the 1990s.",
                    "Distributed NAStore as the next step.",
                    "Future directions of high-speed networks for distributed storage environments.",
                    "Automated optical mass storage systems with 3-beam magneto-optical disk drives.",
                    "Holostore technology for higher levels of memory hierarchy.",
                    "National Media Laboratory."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "10th MSS 1990",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1990",
                "sub_name": "Tenth IEEE Symposium on Mass Storage Systems, MSS 1990: Crisis in Mass Storage, Monterey, CA, USA, May 7-10, 1990.",
                "count": 33,
                "papers": [
                    "Review of IEEE-CS MSS reference model.",
                    "The Livermore distributed storage system: requirements and overview.",
                    "The Livermore distributed storage system: implementation and experiences.",
                    "A standard method for creating self-defining data structures for information archive and transfer.",
                    "Developments of R-DAT data recorders.",
                    "Magnetic tape technology in the 1990s.",
                    "A mass storage subsystem using ANSI X3B6 ID-1 recorders.",
                    "A survey of DCRSi and D-2 technology.",
                    "Multi-terabyte automated mass storage.",
                    "Magnetic tape recording: archival considerations.",
                    "Applying semantic data modeling techniques to large mass storage system designs.",
                    "Mass storage system advances at Los Alamos.",
                    "User and administrative interfaces for a mass storage system.",
                    "Automating the data center operation: 'Do we have a choice?' 'Can we manage it effectively?'.",
                    "Development of OmniServer.",
                    "Integration of the optical storage processor and the DBC/1012 database computer.",
                    "Data catalogs for archive systems.",
                    "Automated cartridge system library server.",
                    "The importance of metadata in mass-storage systems.",
                    "Early experience with mass storage on a Unix-based supercomputer.",
                    "Reengineering the Los Alamos common file system.",
                    "DataTree and UniTree: software for file and storage management.",
                    "Searching for a Unix mass storage system for a supercomputer environment.",
                    "Overcoming Unix kernel deficiencies in a portable, distributed storage system.",
                    "Hiding mass storage under Unix: NASA's MSS-II architecture.",
                    "Network file for ISDN.",
                    "A high capacity, high performance, small form factor magnetic tape storage system.",
                    "An architecture for a transparent networked mass storage system.",
                    "Product requirements by the reference model: a case study.",
                    "A distributed file and tape management system for the LEP experiments at CERN.",
                    "Storage management issues for Cray Research.",
                    "A 1990s solution to the crisis in mass storage.",
                    "Impact of HPPI and fibre channel standards on data delivery."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "9th MSS 1988",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mss/1988",
                "sub_name": "Ninth IEEE Symposium on Mass Storage Systems, MSS 1988: Storage Systems: Perspectives, Monterey, CA, USA, October 31 - November 3, 1988.",
                "count": 27,
                "papers": [
                    "Mass storage reference model special topics.",
                    "The bitfile server in the IEEE reference model for mass storage systems.",
                    "Storage server as physical box.",
                    "Physical volume repository.",
                    "Bitfile mover.",
                    "Mass storage systems reference model system management.",
                    "Networking storage systems: a problem statement.",
                    "Regional and backbone networks.",
                    "Department of Energy Nuclear Weapons Complex network.",
                    "Mass storage archiving in network environments.",
                    "An MSS security primer.",
                    "Profiles in mass storage: a tale of two systems.",
                    "Optical storage: terabytes on-line for IBM mainframes.",
                    "A file structure for nonerasable media.",
                    "IMPORT and EXPORT of data on the NCAR mass storage system.",
                    "Consideration of Fujitsu mass storage systems.",
                    "The operation and use of a 2 terabyte optical archival store.",
                    "Cimarron user experience.",
                    "FileTek storage machine applications.",
                    "A 30 terabyte mass storage architecture.",
                    "A Unix-MVS based mass storage system for supercomputers.",
                    "File migration in the NCAR mass storage system.",
                    "CD-ROM as a mass storage device.",
                    "D-1 through DAT.",
                    "The once and future tape recorder.",
                    "Terabyte optical tape recorder.",
                    "Performance simulation of a high capacity optical disk system."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "8th MSS 1987",
        "info": "Tucson, AZ, USA",
        "venues": []
    },
    {
        "year": "1985",
        "name": "7th MSS 1985",
        "info": "Tucson, AZ, USA",
        "venues": []
    },
    {
        "year": "1984",
        "name": "6th MSS 1984",
        "info": "Vail, CO, USA",
        "venues": []
    },
    {
        "year": "1982",
        "name": "5th MSS 1982",
        "info": "Boulder, CO, USA",
        "venues": []
    },
    {
        "year": "1980",
        "name": "4th MSS 1980",
        "info": "Denver, CO, USA",
        "venues": []
    },
    {
        "year": "1977",
        "name": "3rd MSS 1977",
        "info": "Palo Alto, CA, USA",
        "venues": []
    },
    {
        "year": "1976",
        "name": "2nd MSS 1976",
        "info": "Valley Forge, PA, USA",
        "venues": []
    },
    {
        "year": "1974",
        "name": "1st MSS 1974",
        "info": "Washington, DC, USA",
        "venues": []
    }
]