[
    {
        "year": "2021",
        "name": "15th NOCS 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2021",
                "sub_name": "NOCS '21: International Symposium on Networks-on-Chip, Virtual Event, October 14-15, 2021.",
                "count": 12,
                "papers": [
                    "A novel network fabric for efficient spatio-temporal reduction in flexible DNN accelerators.",
                    "Analysis of on-chip communication properties in accelerator architectures for deep neural networks.",
                    "NEWROMAP: mapping CNNs to NoC-interconnected self-contained data-flow accelerators for edge-AI.",
                    "Packet header attack by hardware trojan in NoC based TCMP and its impact analysis.",
                    "Securing network-on-chips via novel anonymous routing.",
                    "Denial-of-service attack detection using machine learning in network-on-chip architectures.",
                    "PIugSMART: a pluggable open-source module to implement multihop bypass in networks-on-chip.",
                    "DUB: dynamic underclocking and bypassing in nocs for heterogeneous GPU workloads.",
                    "Worst-case latency analysis for the versal NoC network packet switch.",
                    "Synthesis of predictable global NoC by abutment in synchoros VLSI design.",
                    "Sentry-NoC: a statically-scheduled NoC for secure SoCs.",
                    "Multilayer NoC firewall services: case-study on e-health."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "14th NOCS 2020",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2020",
                "sub_name": "14th IEEE/ACM International Symposium on Networks-on-Chip, NOCS 2020, Hamburg, Germany, September 24-25, 2020.",
                "count": 12,
                "papers": [
                    "In-Network Memory Access Ordering for Heterogeneous Multicore Systems.",
                    "NoC Symbiosis : (Special Session Paper).",
                    "Bufferless NoCs with Scheduled Deflection Routing.",
                    "Ruche Networks: Wire-Maximal, No-Fuss NoCs : Special Session Paper.",
                    "PART: Pinning Avoidance in RDMA Technologies.",
                    "Combinatorics and Geometry for the Many-ported, Distributed and Shared Memory Architecture.",
                    "An Efficient Multicast Router using Shared-Buffer with Packet Merging for Dataflow Architecture.",
                    "Implementing Low-Diameter On-Chip Networks for Manycore Processors Using a Tiled Physical Design Methodology.",
                    "SECTAR: Secure NoC using Trojan Aware Routing.",
                    "PROTEUS: Rule-Based Self-Adaptation in Photonic NoCs for Loss-Aware Co-Management of Laser Power and Performance.",
                    "SecONet: A Security Framework for a Photonic Network-on-Chip.",
                    "Improving Inference Latency and Energy of DNNs through Wireless Enabled Multi-Chip-Module-based Architectures and Model Parameters Compression."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "13th NOCS 2019",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2019",
                "sub_name": "Proceedings of the 13th IEEE/ACM International Symposium on Networks-on-Chip, NOCS 2019, New York, NY, USA, October 17-18, 2019.",
                "count": 23,
                "papers": [
                    "UBERNoC: unified buffer power-efficient router for network-on-chip.",
                    "Ghost routers: energy-efficient asymmetric multicore processors with symmetric NoCs.",
                    "BINDU: deadlock-freedom with one bubble in the network.",
                    "NoC-enabled software/hardware co-design framework for accelerating k-mer counting.",
                    "SMART++: reducing cost and improving efficiency of multi-hop bypass in NoC routers.",
                    "APEC: improved acknowledgement prioritization through erasure coding in bufferless NoCs.",
                    "ClusCross: a new topology for silicon interposer-based network-on-chip.",
                    "Distributed SDN architecture for NoC-based many-core SoCs.",
                    "Approximate nanophotonic interconnects.",
                    "Direct-modulated optical networks for interposer systems.",
                    "NoC-based DNN accelerator: a future design paradigm.",
                    "Energy-efficient and high-performance NoC architecture and mapping solution for deep neural networks.",
                    "Flow mapping and data distribution on mesh-based deep learning accelerator.",
                    "3D NoCs with active interposer for multi-die systems.",
                    "Global and semi-global communication on Si-IF.",
                    "A 7.5-mW 10-Gb/s 16-QAM wireline transceiver with carrier synchronization and threshold calibration for mobile inter-chip communications in 16-nm FinFET.",
                    "Reinforcement learning based interconnection routing for adaptive traffic optimization.",
                    "Power efficient photonic network-on-chip for a scalable GPU.",
                    "CDMA-based multiple multicast communications on WiNOC for efficient parallel computing.",
                    "Channel mapping strategies for effective protection switching in fail-operational hard real-time NoCs.",
                    "Multi-carrier spread-spectrum transceiver for WiNoC.",
                    "Detection and prevention protocol for black hole attack in network-on-chip.",
                    "Analyzing networks-on-chip based deep neural networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "12th NOCS 2018",
        "info": "Torino, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2018",
                "sub_name": "Twelfth IEEE/ACM International Symposium on Networks-on-Chip, NOCS 2018, Torino, Italy, October 4-5, 2018.",
                "count": 27,
                "papers": [
                    "Keynote Talk: Many-Core SoC in Nanoscale CMOS: Challenges & Opportunities.",
                    "Keynote Talk: NoCs: A Short History of Success and a Long Future.",
                    "NoC-Based Support of Heterogeneous Cache-Coherence Models for Accelerators.",
                    "Exploration of Memory and Cluster Modes in Directory-Based Many-Core CMPs.",
                    "Accurate Congestion Control for RDMA Transfers.",
                    "Testing WiNoC-Enabled Multicore Chips with BIST for Wireless Interconnects.",
                    "Towards Energy-Efficient High-Throughput Photonic NoCs for 2.5D Integrated Systems: A Case for AWGRs.",
                    "AxNoC: Low-power Approximate Network-on-Chips using Critical-Path Isolation.",
                    "DAPPER: Data Aware Approximate NoC for GPGPU Architectures.",
                    "FreewayNoC: A DDR NoC with Pipeline Bypassing.",
                    "Brownian Bubble Router: Enabling Deadlock Freedom via Guaranteed Forward Progress.",
                    "Abetting Planned Obsolescence by Aging 3D Networks-on-Chip.",
                    "A Low-Overhead Multicast Bufferless Router with Reconfigurable Banyan Network.",
                    "Critical Packet Prioritisation by Slack-Aware Re-Routing in On-Chip Networks.",
                    "A Diversity Scheme to Enhance the Reliability of Wireless NoC in Multipath Channel Environment.",
                    "Securing NoCs Against Timing Attacks with Non-Interference Based Adaptive Routing.",
                    "Securing Photonic NoC Architectures from Hardware Trojans.",
                    "Architecting a Secure Wireless Network-on-Chip.",
                    "Exploiting Dark Cores for Performance Optimization via Patterning for Many-core Chips in the Dark Silicon Era.",
                    "Reconfigurable Network-on-Chip for 3D Neural Network Accelerators.",
                    "Accurate Channel Models for Realistic Design Space Exploration of Future Wireless NoCs.",
                    "Channel Characterization for Chip-scale Wireless Communications within Computing Packages.",
                    "On-Chip Wireless Channel Propagation: Impact of Antenna Directionality and Placement on Channel Performance.",
                    "Approximate Arithmetic Circuits and Their Applications.",
                    "Approximate Networks on Chip.",
                    "Challenges and Opportunities for Edge Cloud Architectures.",
                    "Co-Design and Abstraction of a Network-on-Chip Using Deterministic Network Calculus."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "11th NOCS 2017",
        "info": "Seoul, Republic of Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2017",
                "sub_name": "Proceedings of the Eleventh IEEE/ACM International Symposium on Networks-on-Chip, NOCS 2017, Seoul, Republic of Korea, October 19 - 20, 2017.",
                "count": 20,
                "papers": [
                    "Minimally buffered deflection routing with in-order delivery in a torus.",
                    "Distributed and Dynamic Shared-Buffer Router for High-Performance Interconnect.",
                    "A Novel Approach to Reduce Packet Latency Increase Caused by Power Gating in Network-on-Chip.",
                    "Improving the Reliability and Energy-Efficiency of High-Bandwidth Photonic NoC Architectures with Multilevel Signaling.",
                    "Energy and Area Efficient Near Field Inductive Coupling: A Case Study on 3D NoC.",
                    "Achieving Lightweight Multicast in Asynchronous NoCs Using a Continuous-Time Multi-Way Read Buffer.",
                    "BiNoCHS: Bimodal Network-on-Chip for CPU-GPU Heterogeneous Systems.",
                    "Synchoricity and NOCs could make Billion Gate Custom Hardware Centric SOCs Affordable.",
                    "System-Level Design of Networks-on-Chip for Heterogeneous Systems-on-Chip.",
                    "Addressing Extensibility and Fault Tolerance in CAN-based Automotive Systems.",
                    "JAMS: Jitter-Aware Message Scheduling for FlexRay Automotive Networks.",
                    "Hybrid Automotive In-Vehicle Networks.",
                    "Fairness-Oriented and Location-Aware NUCA for Many-Core SoC.",
                    "On the Accuracy of Stochastic Delay Bound for Network on Chip.",
                    "SMART: A Scalable Mapping And Routing Technique for Power-Gating in NoC Routers.",
                    "On Runtime Communication- and Thermal-aware Application Mapping in 3D NoC.",
                    "XYZ-Randomization using TSVs for Low-Latency Energy Efficient 3D-NoCs.",
                    "3D NoC-Enabled Heterogeneous Manycore Architectures for Accelerating CNN Training: Performance and Thermal Trade-offs.",
                    "Rethinking NoCs for Spatial Neural Network Accelerators.",
                    "Adaptive Manycore Architectures for Big Data Computing."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "10th NOCS 2016",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2016",
                "sub_name": "Tenth IEEE/ACM International Symposium on Networks-on-Chip, NOCS 2016, Nara, Japan, August 31 - September 2, 2016.",
                "count": 27,
                "papers": [
                    "Logic-based implementation of fault-tolerant routing in 3D network-on-chips.",
                    "Powermax: an automated methodology for generating peak-power traffic in networks-on-chip.",
                    "Tighter time analysis for real-time traffic in on-chip networks with shared priorities.",
                    "PROSA: protocol-driven NoC architecture.",
                    "Safe and dynamic traffic rate control for networks-on-chips.",
                    "Improving NoC performance under spatio-temporal variability by runtime reconfiguration: a general mathematical framework.",
                    "Bubble budgeting: throughput optimization for dynamic workloads by exploiting dark cores in many core systems.",
                    "An area-efficient TDM NoC supporting reconfiguration for mode changes.",
                    "Using benes networks at fault-tolerant and deflection routing based network-on-chips.",
                    "TooT: an efficient and scalable power-gating method for NoC routers.",
                    "Run-time laser power management in photonic NoCs with on-chip semiconductor optical amplifiers.",
                    "Multi-bit transient fault control for NoC links using 2D fault coding method.",
                    "Sharing a global on-chip transmission line medium without centralized scheduling.",
                    "The synchronous vs. asynchronous NoC routers: an apple-to-apple comparison between synchronous and transition signaling asynchronous designs.",
                    "Populating and exploring the design space of wavelength-routed optical network-on-chip topologies by leveraging the add-drop filtering primitive.",
                    "A built-in self-testing framework for asynchronous bundled-data NoC switches resilient to delay variations.",
                    "Design of high bandwidth photonic NoC architectures using optical multilevel signaling.",
                    "A heuristic method of generating diameter 3 graphs for order/degree problem (invited paper).",
                    "Average shortest path length of graphs of diameter 3.",
                    "Constructing large-scale low-latency network from small optimal networks.",
                    "Toward exa-scale photonic switch system for the future datacenter (invited paper).",
                    "Chip-scale si-photonics optical transceiverfor a photonics-electronics convergence system (invited paper).",
                    "Flow-centric computing leveraged by photonic circuit switching for the post-moore era.",
                    "Printed circuits on flexible substrates: opportunities and challenges (invited paper).",
                    "Extending networks from chips to flexible and stretchable electronics.",
                    "Hybrid large-area systems and their interconnection backbone (invited paper).",
                    "Inter/intra-chip optical interconnection network: opportunities, challenges, and implementations."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "9th NOCS 2015",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2015",
                "sub_name": "Proceedings of the 9th International Symposium on Networks-on-Chip, NOCS 2015, Vancouver, BC, Canada, September 28-30, 2015.",
                "count": 32,
                "papers": [
                    "Parka: Thermally Insulated Nanophotonic Interconnects.",
                    "An Interconnection Architecture for Seamless Inter and Intra-Chip Communication Using Wireless Links.",
                    "Accurate System-level TSV-to-TSV Capacitive Coupling Fault Model for 3D-NoC.",
                    "Fabrics on Die: Where Function, Debug and Test Meet.",
                    "Multi-Layer Test and Diagnosis for Dependable NoCs.",
                    "A Framework for Combining Concurrent Checking and On-Line Embedded Test for Low-Latency Fault Detection in NoC Routers.",
                    "Fault-Tolerant 3D-NoC Architecture and Design: Recent Advances and Challenges.",
                    "Runtime Detection of a Bandwidth Denial Attack from a Rogue Network-on-Chip.",
                    "Fault-tolerant Network-on-Chip based on Fault-aware Flits and Deflection Routing.",
                    "Highly Fault-tolerant NoC Routing with Application-aware Congestion Management.",
                    "On-Chip Millimeter Wave Antennas and Transceivers.",
                    "Networking Challenges and Prospective Impact of Broadcast-Oriented Wireless Networks-on-Chip.",
                    "Reconfigurable Wireless Network-on-Chip with a Dynamic Medium Access Mechanism.",
                    "Exploiting Transmission Lines on Heterogeneous Networks-on-Chip to Improve the Adaptivity and Efficiency of Cache Coherence.",
                    "Highway in TDM NoCs.",
                    "On-Chip Decentralized Routers with Balanced Pipelines for Avoiding Interconnect Bottleneck.",
                    "User Cooperation Network Coding Approach for NoC Performance Improvement.",
                    "A Low-Overhead, Fully-Distributed, Guaranteed-Delivery Routing Algorithm for Faulty Network-on-Chips.",
                    "Unbiased Regional Congestion Aware Selection Function for NoCs.",
                    "Modeling and Design of High-Radix On-Chip Crossbar Switches.",
                    "Mathematical Modeling and Control of Multifractal Workloads for Data-Center-on-a-Chip Optimization.",
                    "Data Criticality in Network-On-Chip Design.",
                    "Dark Silicon: From Computation to Communication.",
                    "Improving DVFS in NoCs with Coherence Prediction.",
                    "Asymmetric NoC Architectures for GPU Systems.",
                    "MapPro: Proactive Runtime Mapping for Dynamic Workloads by Quantifying Ripple Effect of Applications on Networks-on-Chip.",
                    "NoC Architectures as Enablers of Biological Discovery for Personalized and Precision Medicine.",
                    "Wear-Aware Adaptive Routing for Networks-on-Chips.",
                    "Achievable Performance Enhancements with mm-Wave Wireless Interconnects in NoC.",
                    "Designing High-Performance, Power-Efficient NoCs With Embedded Silicon-in-Silica Nanophotonics.",
                    "ARTEMIS: An Aging-Aware Runtime Application Mapping Framework for 3D NoC-based Chip Multiprocessors.",
                    "Novel Hybrid Wired-Wireless Network-on-Chip Architectures: Transducer and Communication Fabric Design."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "8th NOCS 2014",
        "info": "Ferrara, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2014",
                "sub_name": "Eighth IEEE/ACM International Symposium on Networks-on-Chip, NoCS 2014, Ferrara, Italy, September 17-19, 2014.",
                "count": 37,
                "papers": [
                    "High-performance energy-efficient NoC fabrics: Evolution and future challenges.",
                    "SpinNNaker: The world's biggest NoC.",
                    "Single-cycle collective communication over a shared network fabric.",
                    "Extending bufferless on-chip networks to high-throughput workloads.",
                    "An efficient Network-on-Chip (NoC) based multicore platform for hierarchical parallel genetic algorithms.",
                    "Achieving balanced buffer utilization with a proper co-design of flow control and routing algorithm.",
                    "FMEA-based analysis of a Network-on-Chip for mixed-critical systems.",
                    "Sampling-based approaches to accelerate network-on-chip simulation.",
                    "An analytical model for worst-case reorder buffer size of multi-path minimal routing NoCs.",
                    "Transient queuing models for input-buffered routers in Network-on-Chip.",
                    "Towards stochastic delay bound analysis for Network-on-Chip.",
                    "Augmenting manycore programmable accelerators with photonic interconnect technology for the high-end embedded computing domain.",
                    "QuT: A low-power optical Network-on-Chip.",
                    "Sharing and placement of on-chip laser sources in silicon-photonic NoCs.",
                    "Variable-width datapath for on-chip network static power reduction.",
                    "Dynamic synchronizer flip-flop performance in FinFET technologies.",
                    "Design of a low power NoC router using Marching Memory Through type.",
                    "Bubble sharing: Area and energy efficient adaptive routers using centralized buffers.",
                    "DiAMOND: Distributed alteration of messages for on-chip network debug.",
                    "ElastiNoC: A self-testable distributed VC-based Network-on-Chip architecture.",
                    "Using packet information for efficient communication in NoCs.",
                    "A loosely synchronizing asynchronous router for TDM-scheduled NOCs.",
                    "ICARO: Congestion isolation in networks-on-chip.",
                    "Introduction to the special session on \"Silicon photonic interconnects: an illusion or a realistic solution?\".",
                    "Technology assessment of silicon interposers for manycore SoCs: Active, passive, or optical?",
                    "Towards compelling cases for the viability of silicon-nanophotonic technology in future manycore systems.",
                    "CLAP: a crosstalk and loss analysis platform for optical interconnects.",
                    "Introduction to the special session on \"Interconnect enhances architecture: Evolution of wireless NoC from planar to 3D\".",
                    "STORM: A Simple Traffic-Optimized Router Microarchitecture for Networks-on-Chip.",
                    "Hermes: Architecting a top-performing fault-tolerant routing algorithm for Networks-on-Chips.",
                    "Scalability-oriented multicast traffic characterization.",
                    "An OFDMA based RF interconnect for massive multi-core processors.",
                    "A novel non-minimal/minimal turn model for highly adaptive routing in 2D NoCs.",
                    "Design trade-offs in energy efficient NoC architectures.",
                    "Effective abstraction for response proof of communication fabrics.",
                    "DyAFNoC: Characterization and analysis of a dynamically reconfigurable NoC using a DOR-based deadlock-free routing algorithm.",
                    "An energy-efficient millimeter-wave wireless NoC with congestion-aware routing and DVFS."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "7th NOCS 2013",
        "info": "Tempe, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2013",
                "sub_name": "2013 Seventh IEEE/ACM International Symposium on Networks-on-Chip (NoCS), Tempe, AZ, USA, April 21-24, 2013.",
                "count": 22,
                "papers": [
                    "Backward probing deadlock detection for networks-on-chip.",
                    "Centralized buffer router: A low latency, low power router for high radix NOCs.",
                    "Per-flow delay bound analysis based on a formalized microarchitectural model.",
                    "Quadrisection-based task mapping on many-core processors for energy-efficient on-chip communication.",
                    "A deadlock-free routing algorithm requiring no virtual channel on 3D-NoCs with partial vertical connections.",
                    "Leveraging the geometric properties of on-chip transmission line structures to improve interconnect performance: A case study in 65nm.",
                    "An accurate and scalable analytic model for round-robin arbitration in network-on-chip.",
                    "Physical planning for the architectural exploration of large-scale chip multiprocessors.",
                    "Dynamic traffic distribution among hierarchy levels in hierarchical Networks-on-Chip (NoCs).",
                    "Scalable parallel simulation of networks on chip.",
                    "A speculative arbiter design to enable high-frequency many-VC router in NoCs.",
                    "On self-tuning networks-on-chip for dynamic network-flow dominance adaptation.",
                    "3D logarithmic interconnect: Stacking multiple L1 memory dies over multi-core clusters.",
                    "Accelerating atomic operations on GPGPUs.",
                    "A greedy approach for latency-bounded deadlock-free routing path allocation for application-specific NoCs.",
                    "SNet, a flexible, scalable network paradigm for manycore architectures.",
                    "GCA: Global congestion awareness for load balance in Networks-on-Chip.",
                    "PROBE: Prediction-based optical bandwidth scaling for energy-efficient NoCs.",
                    "An NoC and cache hierarchy substrate to address effective virtualization and fault-tolerance.",
                    "Minimal-path fault-tolerant approach using connection-retaining structure in Networks-on-Chip.",
                    "Energy-efficient adaptive wireless NoCs architecture.",
                    "Headfirst sliding routing: A time-based routing scheme for bus-NoC hybrid 3-D architecture."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "6th NOCS 2012",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2012",
                "sub_name": "2012 Sixth IEEE/ACM International Symposium on Networks-on-Chip (NoCS), Copenhagen, Denmark, 9-11 May, 2012.",
                "count": 25,
                "papers": [
                    "MinBD: Minimally-Buffered Deflection Routing for Energy-Efficient Interconnect.",
                    "Déjà Vu Switching for Multiplane NoCs.",
                    "HARAQ: Congestion-Aware Learning Model for Highly Adaptive Routing Algorithm in On-Chip Networks.",
                    "Overlaid Mesh Topology Design and Deadlock Free Routing in Wireless Network-on-Chip.",
                    "An Optimal Control Approach to Power Management for Multi-Voltage and Frequency Islands Multiprocessor Platforms under Highly Variable Workloads.",
                    "In-network Monitoring and Control Policy for DVFS of CMP Networks-on-Chip and Last Level Caches.",
                    "Modeling and Power Evaluation of On-Chip Router Components in Spintronics.",
                    "Heterogeneous NoC Design for Efficient Broadcast-based Coherence Protocol Support.",
                    "CCNoC: Specializing On-Chip Interconnects for Energy Efficiency in Cache-Coherent Servers.",
                    "Synthesis of NoC Interconnects for Custom MPSoC Architectures.",
                    "Hierarchical Network-on-Chip and Traffic Compression for Spiking Neural Network Implementations.",
                    "Reservation-based Network-on-Chip Timing Models for Large-scale Architectural Simulation.",
                    "TOPAZ: An Open-Source Interconnection Network Simulator for Chip Multiprocessors and Supercomputers.",
                    "Analytical Performance Modeling of Hierarchical Interconnect Fabrics.",
                    "Dynamic Flow Regulation for IP Integration on Network-on-Chip.",
                    "A Novel Flit Serialization Strategy to Utilize Partially Faulty Links in Networks-on-Chip.",
                    "Fine-Grained Bandwidth Adaptivity in Networks-on-Chip Using Bidirectional Channels.",
                    "Efficient Timing Channel Protection for On-Chip Networks.",
                    "A Statically Scheduled Time-Division-Multiplexed Network-on-Chip for Real-Time Systems.",
                    "A Mixed Verification Strategy Tailored for Networks on Chip.",
                    "Transient and Permanent Error Control for High-End Multiprocessor Systems-on-Chip.",
                    "Generic Monitoring and Management Infrastructure for 3D NoC-Bus Hybrid Architectures.",
                    "Engineering a Bandwidth-Scalable Optical Layer for a 3D Multi-core Processor with Awareness of Layout Constraints.",
                    "A Hybrid Buffer Design with STT-MRAM for On-Chip Interconnects.",
                    "DSENT - A Tool Connecting Emerging Photonics with Electronics for Opto-Electronic Networks-on-Chip Modeling."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "5th NOCS 2011",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2011",
                "sub_name": "NOCS 2011, Fifth ACM/IEEE International Symposium on Networks-on-Chip, Pittsburgh, Pennsylvania, USA, May 1-4, 2011.",
                "count": 39,
                "papers": [
                    "Efficient routing implementation in complex systems-on-chip.",
                    "Analysis of application-aware on-chip routing under traffic uncertainty.",
                    "HOPE: Hotspot congestion control for Clos network on chip.",
                    "Automatic verification for deadlock in networks-on-chips with adaptive routing and wormhole switching.",
                    "Deadlock-free fine-grained thread migration.",
                    "Prevention flow-control for low latency torus networks-on-chip.",
                    "A vertical bubble flow network using inductive-coupling for 3-D CMPs.",
                    "Optimal network architectures for minimizing average distance in k-ary n-dimensional mesh networks.",
                    "Congestion aware, fault tolerant, and thermally efficient inter-layer communication scheme for hybrid NoC-bus 3D architectures.",
                    "Exploring partitioning methods for 3D Networks-on-Chip utilizing adaptive routing model.",
                    "BLOCON: A Bufferless Photonic Clos network-on-chip architecture.",
                    "Two-hop Free-space based optical interconnects for chip multiprocessors.",
                    "All-optical wavelength-routed NoC based on a novel hierarchical topology.",
                    "Exploiting inherent information redundancy to manage transient errors in NoC routing arbitration.",
                    "A distributed and topology-agnostic approach for on-line NoC testing.",
                    "Energy and reliability oriented mapping for regular Networks-on-Chip.",
                    "Online task remapping strategies for fault-tolerant Network-on-Chip multiprocessors.",
                    "FIST: A fast, lightweight, FPGA-friendly packet latency estimator for NoC modeling in full-system simulations.",
                    "DART: A programmable architecture for NoC simulation on FPGAs.",
                    "Inferring packet dependencies to improve trace based simulation of on-chip networks.",
                    "Delay analysis of wormhole based heterogeneous NoC.",
                    "Complex network inspired fault-tolerant NoC architectures with wireless links.",
                    "Design of multi-channel wireless NoC to improve on-chip communication capacity!",
                    "Link pipelining strategies for an application-specific asynchronous NoC.",
                    "A low-latency adaptive asynchronous interconnection network using bi-modal router nodes.",
                    "Dynamic decentralized mapping of tree-structured applications on NoC architectures.",
                    "Cross clock-domain TDM virtual circuits for networks on chips.",
                    "VLSI micro-architectures for high-radix crossbar schedulers.",
                    "Interconnect Physical Analyser (IPAA) applied to the design of scalable Network-on-Chip interconnect for Cryptographic accelerators.",
                    "Reducing network-on-chip energy consumption through spatial locality speculation.",
                    "Curbing energy cravings in networks: A cross-sectional view across the micro-macro boundary.",
                    "Challenges and promises of nano and bio communication networks.",
                    "The XMOS XK-XMP-64 development board.",
                    "Dynamic power management of voltage-frequency island partitioned Networks-on-Chip using Intel's Single-chip Cloud Computer.",
                    "A software framework for trace analysis targeting multicore platforms design.",
                    "Reconfiguration of a 3GPP-LTE telecommunication application on a 22-core NoC-based system-on-chip.",
                    "A comprehensive Networks-on-Chip simulator for error control explorations.",
                    "NoCs simulation framework for OMNeT++.",
                    "Spidergon STNoC design flow."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "4th NOCS 2010",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2010",
                "sub_name": "NOCS 2010, Fourth ACM/IEEE International Symposium on Networks-on-Chip, Grenoble, France, May 3-6, 2010.",
                "count": 32,
                "papers": [
                    "Low-Power Bioelectronics for Massively Parallel Neuromonitoring.",
                    "Photonic Chip-Scale Interconnection Networks for Performance-Energy Optimized Computing.",
                    "Semiconductor Industry: Perspective, Evolution and Challenges.",
                    "Evaluating Bufferless Flow Control for On-chip Networks.",
                    "Comparison of Deadlock Recovery and Avoidance Mechanisms to Approach Message Dependent Deadlocks in On-chip Networks.",
                    "Addressing Manufacturing Challenges with Cost-Efficient Fault Tolerant Routing.",
                    "Improving the Performance of GALS-Based NoCs in the Presence of Process Variation.",
                    "A Low-Overhead Asynchronous Interconnection Network for GALS Chip Multiprocessors.",
                    "Asynchronous Bypass Channels: Improving Performance for Multi-synchronous NoCs.",
                    "Ultra Fine-Grained Run-Time Power Gating of On-chip Routers for CMPs.",
                    "Design of a High-Throughput Distributed Shared-Buffer NoC Router.",
                    "Fault-Tolerant Flow Control in On-chip Networks.",
                    "A 128 x 128 x 24Gb/s Crossbar Interconnecting 128 Tiles in a Single Hop and Occupying 6% of Their Area.",
                    "A Low-Latency and Memory-Efficient On-chip Network.",
                    "Temperature-Aware Delay Borrowing for Energy-Efficient Low-Voltage Link Design.",
                    "Comparing Energy and Latency of Asynchronous and Synchronous NoCs for Embedded SoCs.",
                    "Physical-Aware Link Allocation and Route Assignment for Chip Multiprocessing.",
                    "Network-on-Chip Architectures for Neural Networks.",
                    "Transient and Permanent Error Co-management Method for Reliable Networks-on-Chip.",
                    "Back Suction: Service Guarantees for Latency-Sensitive On-chip Networks.",
                    "Improved Utilization of NoC Channel Bandwidth by Switch Replication for Cost-Effective Multi-processor Systems-on-Chip.",
                    "Physical vs. Virtual Express Topologies with Low-Swing Links for Future Many-Core NoCs.",
                    "Design of High-Radix Clos Network-on-Chip.",
                    "Hierarchical Network-on-Chip for Embedded Many-Core Architectures.",
                    "A Low-Cost Deadlock-Free Design of Minimal-Table Rerouted XY-Routing for Irregular Wireless NoCs.",
                    "Power-Efficient and High-Performance Multi-level Hybrid Nanophotonic Interconnect for Multicores.",
                    "Performance Evaluation of a Multicore System with Optically Connected Memory Modules.",
                    "Traffic- and Thermal-Aware Run-Time Thermal Management Scheme for 3D NoC Systems.",
                    "Distributed Sequencing for Resource Sharing in Multi-applicative Heterogeneous NoC Platforms.",
                    "QuaLe: A Quantum-Leap Inspired Model for Non-stationary Analysis of NoC Traffic in Chip Multi-processors.",
                    "Impact of Half-Duplex and Full-Duplex DMA Implementations on NoC Performance.",
                    "A Network Congestion-Aware Memory Controller."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "3rd NOCS 2009",
        "info": "La Jolla, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2009",
                "sub_name": "Third International Symposium on Networks-on-Chips, NOCS 2009, May 10-13 2009, La Jolla, CA, USA. Proceedings.",
                "count": 41,
                "papers": [
                    "NoCs: It is about the memory and the programming model.",
                    "HiRA: A methodology for deadlock free routing in hierarchical networks on chip.",
                    "Using adaptive routing to compensate for performance heterogeneity.",
                    "Fault-tolerant architecture and deflection routing for degradable NoC switches.",
                    "Adaptive stochastic routing in fault-tolerant on-chip networks.",
                    "Static virtual channel allocation in oblivious routing.",
                    "Analysis of worst-case delay bounds for best-effort communication in wormhole networks on chip.",
                    "Lookahead-based adaptive voltage scheme for energy-efficient on-chip interconnect links.",
                    "Recursive partitioning multicast: A bandwidth-efficient routing for Networks-on-Chip.",
                    "Analytical modeling and evaluation of On-Chip Interconnects using Network Calculus.",
                    "Energy efficient application mapping to NoC processing elements operating at multiple voltage levels.",
                    "The design of a latency constrained, power optimized NoC for a 4G SoC.",
                    "Performance Evaluation of NoC Architectures for Parallel Workloads.",
                    "Packet-level static timing analysis for NoCs.",
                    "Increasing NoC power estimation accuracy through a rate-based model.",
                    "On-Chip photonic interconnects for scalable multi-core architectures.",
                    "A Modeling and exploration framework for interconnect network design in the nanometer era.",
                    "Power reduction through physical placement of asynchronous routers.",
                    "Networks-on-chip in emerging interconnect paradigms: Advantages and challenges.",
                    "NoC's at the center of chip architecture: Urgent needs (today) and what they must become (future).",
                    "Analysis of photonic networks for a chip multiprocessor using scientific applications.",
                    "Scalability of network-on-chip communication architecture for 3-D meshes.",
                    "Silicon-photonic clos networks for global on-chip communication.",
                    "Contention-free on-chip routing of optical packets.",
                    "Connection-centric network for spiking neural networks.",
                    "A Communication and configuration controller for NoC based reconfigurable data flow architecture.",
                    "Configurable emulated shared memory architecture for general purpose MP-SOCs and NOC regions.",
                    "Best of both worlds: A bus enhanced NoC (BENoC).",
                    "Flow-aware allocation for on-chip networks.",
                    "CTC: An end-to-end flow control protocol for multi-core systems-on-chip.",
                    "Performance and power efficient on-chip communication using adaptive virtual point-to-point connections.",
                    "Keynote 3 (Banquet Talk) Digital space.",
                    "A GALS many-core heterogeneous DSP platform with source-synchronous on-chip interconnection network.",
                    "A modular synchronizing FIFO for NoCs.",
                    "Estimating reliability and throughput of source-synchronous wave-pipelined interconnect.",
                    "Comparing tightly and loosely coupled mesochronous synchronizers in a NoC switch architecture.",
                    "Dynamic packet fragmentation for increased virtual channel utilization in on-chip routers.",
                    "Diagnosis of interconnect shorts in mesh NoCs.",
                    "BiNoC: A bidirectional NoC architecture with dynamic self-reconfigurable channel.",
                    "Exploring concentration and channel slicing in on-chip network router.",
                    "Author index."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "2nd NOCS 2008",
        "info": "Newcastle University, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2008",
                "sub_name": "Second International Symposium on Networks-on-Chips, NOCS 2008, 5-6 April 2008, Newcastle University, UK. Proceedings.",
                "count": 28,
                "papers": [
                    "Invited Talk 1- Past, Present, and Future Communicating Processors.",
                    "Invited Talk 2 - Optical Interconnects for Backplane and Chip-to-Chip Photonics.",
                    "Debugging Distributed-Shared-Memory Communication at Multiple Granularities in Networks on Chip.",
                    "A Lightweight Fault-Tolerant Mechanism for Network-on-Chip.",
                    "Adding Slow-Silent Virtual Channels for Low-Power On-Chip Networks.",
                    "A Network of Time-Division Multiplexed Wiring for FPGAs.",
                    "Hardwired Networks on Chip in FPGAs to Unify Functional and Con?guration Interconnects.",
                    "ReNoC: A Network-on-Chip Architecture with Reconfigurable Topology.",
                    "SEU-Hardened Energy Recovery Pipelined Interconnects for On-Chip Networks.",
                    "Low Power and Reliable Interconnection with Self-Corrected Green Coding Scheme for Network-on-Chip.",
                    "An Efficient Implementation of Distributed Routing Algorithms for NoCs.",
                    "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms.",
                    "Exploring High-Dimensional Topologies for NoC Design Through an Integrated Analysis and Synthesis Framework.",
                    "Impact of Process and Temperature Variations on Network-on-Chip Design Exploration.",
                    "Dynamic Voltage and Frequency Scaling Architecture for Units Integration within a GALS NoC.",
                    "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture.",
                    "A Design-for-Test Implementation of an Asynchronous Network-on-Chip Architecture and its Associated Test Pattern Generation and Application.",
                    "Real-Time Communication Analysis for On-Chip Networks with Wormhole Switching.",
                    "Statistical Approach to NoC Design.",
                    "Reducing the Interconnection Network Cost of Chip Multiprocessors.",
                    "Circuit-Switched Coherence.",
                    "Simulation and Evaluation of On-Chip Interconnect Architectures: 2D Mesh, Spidergon, and WK-Recursive Network.",
                    "Low-Cost VC Allocator Design for Virtual Channel Wormhole Routers in Networks-on-Chip.",
                    "Network Simplicity for Latency Insensitive Cores.",
                    "Applying Dataflow Analysis to Dimension Buffers for Guaranteed Performance in Networks on Chip.",
                    "Implementation of Wave-Pipelined Interconnects in FPGAs.",
                    "An On-Chip and Inter-Chip Communications Network for the SpiNNaker Massively-Parallel Neural Net Simulator.",
                    "Dual-Channel Access Mechanism for Cost-Effective NoC Design."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "1st NOCS 2007",
        "info": "Princeton, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nocs/2007",
                "sub_name": "First International Symposium on Networks-on-Chips, NOCS 2007, 7-9 May 2007, Princeton, New Jersey, USA, Proceedings.",
                "count": 39,
                "papers": [
                    "Enabling Technology for On-Chip Interconnection Networks.",
                    "Implementation and Evaluation of a Dynamically Routed Processor Operand Network.",
                    "On Characterizing Performance of the Cell Broadband Engine Element Interconnect Bus.",
                    "Solutions for Real Chip Implementation Issues of NoC and Their Application to Memory-Centric NoC.",
                    "Architecture of the Scalable Communications Core.",
                    "On the Design of a Photonic Network-on-Chip.",
                    "NoC Communication Strategies Using Time-to-Digital Conversion.",
                    "A Low-Latency and Low-Power Hybrid Insertion Methodology for Global Interconnects in VDSM Designs.",
                    "Bi-Synchronous FIFO for Synchronous Circuit Communication Well Suited for Network-on-Chip in GALS Architectures.",
                    "Transaction-Based Communication-Centric Debug.",
                    "The Impact of Higher Communication Layers on NoC Supported MP-SoCs.",
                    "The Power of Priority: NoC Based Distributed Cache Coherency.",
                    "A Generic Model for Formally Verifying NoC Communication Architectures: A Case Study.",
                    "Access Regulation to Hot-Modules in Wormhole NoCs.",
                    "Design Technologies for Networks on Chips.",
                    "Approaching Ideal NoC Latency with Pre-Configured Routes.",
                    "A Power and Energy Exploration of Network-on-Chip Architectures.",
                    "A Hybrid Analog-Digital Routing Network for NoC Dynamic Routing.",
                    "Region-Based Routing: An Efficient Routing Mechanism to Tackle Unreliable Hardware in Network on Chips.",
                    "A Hybrid Ring/Mesh Interconnect for Network-on-Chip Using Hierarchical Rings for Global Routing.",
                    "Towards Open Network-on-Chip Benchmarks.",
                    "An Analytical Approach for Dimensioning Mixed Traffic Networks.",
                    "Implementation of a Design-for-Test Architecture for Asynchronous Networks-on-Chip.",
                    "A Study of NoC Exit Strategies.",
                    "QNoC Asynchronous Router with Dynamic Virtual Channel Allocation.",
                    "Reducing Interconnect Cost in NoC through Serialized Asynchronous Links.",
                    "Thermal Impacts on NoC Interconnects.",
                    "NOC-centric Security of Reconfigurable SoC.",
                    "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases.",
                    "Mesh of Tree: Unifying Mesh and MFPGA for Better Device Performances.",
                    "NoC-Based FPGA: Architecture and Routing.",
                    "Reflections on 10 Years as a Commercial On-Chip Interconnect Provider.",
                    "NoC: Network or Chip?",
                    "NoC Design and Implementation in 65nm Technology.",
                    "Implications of Rent's Rule for NoC Design and Its Fault-Tolerance.",
                    "ASC, a SystemC Extension for Modeling Asynchronous Systems, and Its Application to an Asynchronous NoC.",
                    "Implementing DSP Algorithms with On-Chip Networks.",
                    "A New Binomial Mapping and Optimization Algorithm for Reduced-Complexity Mesh-Based On-Chip Network.",
                    "Fast, Accurate and Detailed NoC Simulations."
                ]
            }
        ]
    }
]