[
    {
        "year": "2021",
        "name": "18th NPC 2021",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2021",
                "sub_name": "Network and Parallel Computing - 18th IFIP WG 10.3 International Conference, NPC 2021, Paris, France, November 3-5, 2021, Proceedings.",
                "count": 20,
                "papers": [
                    "High Resolution of City-Level Climate Simulation by GPU with Multi-physical Phenomena.",
                    "dgQuEST: Accelerating Large Scale Quantum Circuit Simulation through Hybrid CPU-GPU Memory Hierarchies.",
                    "vSketchDLC: A Sketch on Distributed Deep Learning Communication via Fine-grained Tracing Visualization.",
                    "Scalable Algorithms Using Sparse Storage for Parallel Spectral Clustering on GPU.",
                    "XSP: Fast SSSP Based on Communication-Computation Collaboration.",
                    "A Class of Fast and Accurate Multi-layer Block Summation and Dot Product Algorithms.",
                    "A KNN Query Method for Autonomous Driving Sensor Data.",
                    "A Novel Task-Allocation Framework Based on Decision-Tree Classification Algorithm in MEC.",
                    "QoS-Aware Scheduling for Cellular Networks Using Deep Reinforcement Learning.",
                    "Adaptive Buffering Scheme for PCM/DRAM-Based Hybrid Memory Architecture.",
                    "Efficiency-First Fault-Tolerant Replica Scheduling Strategy for Reliability Constrained Cloud Application.",
                    "Towards an Optimized Containerization of HPC Job Schedulers Based on Namespaces.",
                    "Architecture of an On-Time Data Transfer Framework in Cooperation with Scheduler System.",
                    "Data Delta Based Hybrid Writes for Erasure-Coded Storage Systems.",
                    "BDCuckoo: an Efficient Cuckoo Hash for Block Device.",
                    "A Two Tier Hybrid Metadata Management Mechanism for NVM Storage System.",
                    "A Novel CFLRU-Based Cache Management Approach for NAND-Based SSDs.",
                    "Taming Congestion and Latency in Low-Diameter High-Performance Datacenters.",
                    "Evaluation of Topology-Aware All-Reduce Algorithm for Dragonfly Networks.",
                    "MPICC: Multi-Path INT-Based Congestion Control in Datacenter Networks."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th NPC 2020",
        "info": "Zhengzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2020",
                "sub_name": "Network and Parallel Computing - 17th IFIP WG 10.3 International Conference, NPC 2020, Zhengzhou, China, September 28-30, 2020, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "Compiler-Assisted Operator Template Library for DNN Accelerators.",
                    "A Dynamic Mapping Model for General CNN Accelerator Based on FPGA.",
                    "A Dynamic Protection Mechanism for GPU Memory Overflow.",
                    "MTLAT: A Multi-Task Learning Framework Based on Adversarial Training for Chinese Cybersecurity NER.",
                    "Learning-Based Evaluation of Routing Protocol in Vehicular Network Using WEKA.",
                    "Accelerating Large-Scale Deep Convolutional Neural Networks on Multi-core Vector Accelerators.",
                    "M-DRL: Deep Reinforcement Learning Based Coflow Traffic Scheduler with MLFQ Threshold Adaption.",
                    "A Close Look at Multi-tenant Parallel CNN Inference for Autonomous Driving.",
                    "A Multi-model Super-Resolution Training and Reconstruction Framework.",
                    "Deep Visible and Thermal Image Fusion with Cross-Modality Feature Selection for Pedestrian Detection.",
                    "LCache: Machine Learning-Enabled Cache Management in Near-Data Processing-Based Solid-State Disks.",
                    "Security Situation Prediction of Network Based on Lstm Neural Network.",
                    "Dynamic GMMU Bypass for Address Translation in Multi-GPU Systems.",
                    "Parallel Fast DOA Estimation Algorithm Based on SML and Membrane Computing.",
                    "Segmented Merge: A New Primitive for Parallel Sparse Matrix Computations.",
                    "A Hierarchical Model of Control Logic for Simplifying Complex Networks Protocol Design.",
                    "FPGA-Based Multi-precision Architecture for Accelerating Large-Scale Floating-Point Matrix Computing.",
                    "A Configurable Hardware Architecture for Runtime Application of Network Calculus.",
                    "FEB3D: An Efficient FPGA-Accelerated Compression Framework for Microscopy Images.",
                    "NUMA-Aware Optimization of Sparse Matrix-Vector Multiplication on ARMv8-Based Many-Core Architectures.",
                    "CARAM: A Content-Aware Hybrid PCM/DRAM Main Memory System Framework.",
                    "Optimization of RDMA-Based HDFS Data Distribution Mechanism.",
                    "Reducing the Time of Live Container Migration in a Workflow.",
                    "RDMA-Based Apache Storm for High-Performance Stream Data Processing.",
                    "Payment Behavior Prediction and Statistical Analysis for Shared Parking Lots.",
                    "Location-Based Service Recommendation for Cold-Start in Mobile Edge Computing.",
                    "An Adaptive Delay-Limited Offloading Scheme Based on Multi-round Auction Model for Mobile Edge Computing.",
                    "An Efficient Data Transmission Strategy for Edge-Computing-Based Opportunistic Social Networks.",
                    "Shadow Data: A Method to Optimize Incremental Synchronization in Data Center.",
                    "DROAllocator: A Dynamic Resource-Aware Operator Allocation Framework in Distributed Streaming Processing.",
                    "A Medical Support System for Prostate Cancer Based on Ensemble Method in Developing Countries.",
                    "The Entry-Extensible Cuckoo Filter.",
                    "Monitoring Memory Behaviors and Mitigating NUMA Drawbacks on Tiered NVM Systems.",
                    "TPL: A Novel Analysis and Optimization Model for RDMA P2P Communication.",
                    "Connectivity and Routing Algorithm of the Data Center Network HSDC.",
                    "CCRP: Converging Credit-Based and Reactive Protocols in Datacenters.",
                    "CompressedCache: Enabling Storage Compression on Neuromorphic Processor for Liquid State Machine.",
                    "ODCP: Optimizing Data Caching and Placement in Distributed File System Using Erasure Coding.",
                    "Towards Optimizing Deduplication on Persistent Memory."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th NPC 2019",
        "info": "Hohhot, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2019",
                "sub_name": "Network and Parallel Computing - 16th IFIP WG 10.3 International Conference, NPC 2019, Hohhot, China, August 23-24, 2019, Proceedings.",
                "count": 37,
                "papers": [
                    "GraphScSh: Efficient I/O Scheduling and Graph Sharing for Concurrent Graph Processing.",
                    "Game-Based Multi-MD with QoS Computation Offloading for Mobile Edge Computing of Limited Computation Capacity.",
                    "KLSAT: An Application Mapping Algorithm Based on Kernighan-Lin Partition and Simulated Annealing for a Specific WK-Recursive NoC Architecture.",
                    "Modeling and Analysis of the Latency-Based Congestion Control Algorithm DX.",
                    "Distributed Quality-Aware Resource Allocation for Video Transmission in Wireless Networks.",
                    "PRTSM: Hardware Data Arrangement Mechanisms for Convolutional Layer Computation on the Systolic Array.",
                    "PParabel: Parallel Partitioned Label Trees for Extreme Classification.",
                    "Statistical Analysis and Prediction of Parking Behavior.",
                    "ASTracer: An Efficient Tracing Tool for HDFS with Adaptive Sampling.",
                    "BGElasor: Elastic-Scaling Framework for Distributed Streaming Processing with Deep Neural Network.",
                    "High Performance DDoS Attack Detection System Based on Distribution Statistics.",
                    "DDP-B: A Distributed Dynamic Parallel Framework for Meta-genomics Binary Similarity.",
                    "Optimal Resource Allocation Through Joint VM Selection and Placement in Private Clouds.",
                    "A Parallel Multi-keyword Top-k Search Scheme over Encrypted Cloud Data.",
                    "N-Docker: A NVM-HDD Hybrid Docker Storage Framework to Improve Docker Performance.",
                    "MMSR: A Multi-model Super Resolution Framework.",
                    "HiPower: A High-Performance RDMA Acceleration Solution for Distributed Transaction Processing.",
                    "LDAPRoam: A Generic Solution for Both Web-Based and Non-Web-Based Federate Access.",
                    "Characterizing Perception Module Performance and Robustness in Production-Scale Autonomous Driving System.",
                    "Spindle: A Write-Optimized NVM Cache for Journaling File System.",
                    "Two-Erasure Codes from 3-Plexes.",
                    "Deep Fusion: A Software Scheduling Method for Memory Access Optimization.",
                    "Optimizing Data Placement on Hierarchical Storage Architecture via Machine Learning.",
                    "I/O Optimizations Based on Workload Characteristics for Parallel File Systems.",
                    "Energy Consumption of IT System in Cloud Data Center: Architecture, Factors and Prediction.",
                    "Efficient Processing of Convolutional Neural Networks on SW26010.",
                    "ADMMLIB: A Library of Communication-Efficient AD-ADMM for Distributed Machine Learning.",
                    "Energy-Aware Resource Scheduling with Fault-Tolerance in Edge Computing.",
                    "DIN: A Bio-Inspired Distributed Intelligence Networking.",
                    "A DAG Refactor Based Automatic Execution Optimization Mechanism for Spark.",
                    "BTS: Balanced Task Scheduling Strategy Based on Multi-resource Prediction and Allocation in Cloud Environment.",
                    "DAFL: Deep Adaptive Feature Learning for Network Anomaly Detection.",
                    "SIRM: Shift Insensitive Racetrack Main Memory.",
                    "PDRM: A Probability Distribution Based Resource Management for Batch Workloads in Heterogeneous Cluster.",
                    "Collaborating CPUs and MICs for Large-Scale LBM Multiphase Flow Simulations.",
                    "Multiple Algorithms Against Multiple Hardware Architectures: Data-Driven Exploration on Deep Convolution Neural Network.",
                    "A Parallel Retinex Image Enhancement Algorithm Based on OpenMP."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th NPC 2018",
        "info": "Muroran, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2018",
                "sub_name": "Network and Parallel Computing - 15th IFIP WG 10.3 International Conference, NPC 2018, Muroran, Japan, November 29 - December 1, 2018, Proceedings.",
                "count": 22,
                "papers": [
                    "CNLoc: Channel State Information Assisted Indoor WLAN Localization Using Nomadic Access Points.",
                    "ALOR: Adaptive Layout Optimization of Raft Groups for Heterogeneous Distributed Key-Value Stores.",
                    "STrieGD: A Sampling Trie Indexed Compression Algorithm for Large-Scale Gene Data.",
                    "On Retargeting the AI Programming Framework to New Hardwares.",
                    "An Efficient Method for Determining Full Point-to-Point Latency of Arbitrary Indirect HPC Networks.",
                    "KT-Store: A Key-Order and Write-Order Hybrid Key-Value Store with High Write and Range-Query Performance.",
                    "GRAM: A GPU-Based Property Graph Traversal and Query for HPC Rich Metadata Management.",
                    "GPU-Accelerated Clique Tree Propagation for Pouch Latent Tree Models.",
                    "HPC-SFI: System-Level Fault Injection for High Performance Computing Systems.",
                    "Data Fine-Pruning: A Simple Way to Accelerate Neural Network Training.",
                    "Balancing the QOS and Security in Dijkstra Algorithm by SDN Technology.",
                    "Labeled Network Stack: A Co-designed Stack for Low Tail-Latency and High Concurrency in Datacenter Services.",
                    "A Deep Learning Approach for Network Anomaly Detection Based on AMF-LSTM.",
                    "FSObserver: A Performance Measurement and Monitoring Tool for Distributed Storage Systems.",
                    "vGrouper: Optimizing the Performance of Parallel Jobs in Xen by Increasing Synchronous Execution of Virtual Machines.",
                    "Systolic Array Based Accelerator and Algorithm Mapping for Deep Learning Algorithms.",
                    "A Fine-Grained Performance Bottleneck Analysis Method for HDFS.",
                    "Mimir+: An Optimized Framework of MapReduce on Heterogeneous High-Performance Computing System.",
                    "DLIR: An Intermediate Representation for Deep Learning Processors.",
                    "GPU Memory Management Solution Supporting Incomplete Pages.",
                    "Leveraging Subgraph Extraction for Performance Portable Programming Frameworks on DL Accelerators.",
                    "An Intelligent Parking Scheduling Algorithm Based on Traffic and Driver Behavior Predictions."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th NPC 2017",
        "info": "Hefei, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2017",
                "sub_name": "Network and Parallel Computing - 14th IFIP WG 10.3 International Conference, NPC 2017, Hefei, China, October 20-21, 2017, Proceedings.",
                "count": 19,
                "papers": [
                    "SCMKV: A Lightweight Log-Structured Key-Value Store on SCM.",
                    "Adaptive Length Sliding Window-Based Network Coding for Energy Efficient Algorithm in MANETs.",
                    "A Virtual Machine Migration Algorithm Based on Group Selection in Cloud Data Center.",
                    "Two-Stage Job Scheduling Model Based on Revenues and Resources.",
                    "TCon: A Transparent Congestion Control Deployment Platform for Optimizing WAN Transfers.",
                    "Regional Congestion Mitigation in Lossless Datacenter Networks.",
                    "A Fast and Accurate Way for API Network Construction Based on Semantic Similarity and Community Detection.",
                    "Improving Branch Prediction for Thread Migration on Multi-core Architectures.",
                    "Optimizing OpenCL Implementation of Deep Convolutional Neural Network on FPGA.",
                    "ACO-inspired ICN Routing Scheme with Density-Based Spatial Clustering.",
                    "An Efficient Polarity Optimization Approach for Fixed Polarity Reed-Muller Logic Circuits Based on Novel Binary Differential Evolution Algorithm.",
                    "Stem: A Table-Based Congestion Control Framework for Virtualized Data Center Networks.",
                    "SDAC: Porting Scientific Data to Spark RDDs.",
                    "Unified Access Layer with PostgreSQL FDW for Heterogeneous Databases.",
                    "Balancing Global and Local Fairness Allocation Model in Heterogeneous Data Center.",
                    "System Problem Detection by Mining Process Model from Console Logs.",
                    "Quantifying the Isolation Characteristics in Container Environments.",
                    "CSAS: Cost-Based Storage Auto-Selection, a Fine Grained Storage Selection Mechanism for Spark.",
                    "An In-Depth Performance Analysis of Many-Integrated Core for Communication Efficient Heterogeneous Computing."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th NPC 2016",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2016",
                "sub_name": "Network and Parallel Computing - 13th IFIP WG 10.3 International Conference, NPC 2016, Xi'an, China, October 28-29, 2016, Proceedings.",
                "count": 17,
                "papers": [
                    "VIOS: A Variation-Aware I/O Scheduler for Flash-Based Storage Systems.",
                    "Exploiting Cross-Layer Hotness Identification to Improve Flash Memory System Performance.",
                    "Efficient Management for Hybrid Memory in Managed Language Runtime.",
                    "Application-Based Coarse-Grained Incremental Checkpointing Based on Non-volatile Memory.",
                    "DASM: A Dynamic Adaptive Forward Assembly Area Method to Accelerate Restore Speed for Deduplication-Based Backup Systems.",
                    "A Statistics Based Prediction Method for Rendering Application.",
                    "IBB: Improved K-Resource Aware Backfill Balanced Scheduling for HTCondor.",
                    "Multipath Load Balancing in SDN/OSPF Hybrid Network.",
                    "A Study of Overflow Vulnerabilities on GPUs.",
                    "Streaming Applications on Heterogeneous Platforms.",
                    "DSS: A Scalable and Efficient Stratified Sampling Algorithm for Large-Scale Datasets.",
                    "A Fast and Better Hybrid Recommender System Based on Spark.",
                    "Discovering Trip Patterns from Incomplete Passenger Trajectories for Inter-zonal Bus Line Planning.",
                    "FCM: A Fine-Grained Crowdsourcing Model Based on Ontology in Crowd-Sensing.",
                    "QIM: Quantifying Hyperparameter Importance for Deep Learning.",
                    "Toward a Parallel Turing Machine Model.",
                    "On Determination of Balance Ratio for Some Tree Structures."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th NPC 2014",
        "info": "Ilan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2014",
                "sub_name": "Network and Parallel Computing - 11th IFIP WG 10.3 International Conference, NPC 2014, Ilan, Taiwan, September 18-20, 2014. Proceedings.",
                "count": 66,
                "papers": [
                    "Routing and Wavelength Assignment for Exchanged Hypercubes in Linear Array Optical Networks.",
                    "Page Classifier and Placer: A Scheme of Managing Hybrid Caches.",
                    "Temporal-Based Ranking in Heterogeneous Networks.",
                    "Designing Buffer Capacity of Crosspoint-Queued Switch.",
                    "Loss-Rate Driven Network Coding for Transmission Control.",
                    "Multilayer Perceptron and Stacked Autoencoder for Internet Traffic Prediction.",
                    "Optimization of Uncore Data Flow on NUMA Platform.",
                    "APP-LRU: A New Page Replacement Method for PCM/DRAM-Based Hybrid Memory Systems.",
                    "Towards Relaxed Rollback-Recovery Consistency in SOA.",
                    "A Novel Page Replacement Algorithm for the Hybrid Memory Architecture Involving PCM and DRAM.",
                    "HiNetSim: A Parallel Simulator for Large-Scale Hierarchical Direct Networks.",
                    "Wire Length of Midimew-Connected Mesh Network.",
                    "Benchmarking the Memory Hierarchy of Modern GPUs.",
                    "Parallel CYK Membership Test on GPUs.",
                    "Designing Coalescing Network-on-Chip for Efficient Memory Accesses of GPGPUs.",
                    "Efficient Parallel Algorithms for Linear RankSVM on GPU.",
                    "A Real-Time Scheduling Framework Based on Multi-core Dynamic Partitioning in Virtualized Environment.",
                    "Automatic Data Layout Transformation for Heterogeneous Many-Core Systems.",
                    "mpCache: Accelerating MapReduce with Hybrid Storage System on Many-Core Clusters.",
                    "Online Mechanism Design for VMs Allocation in Private Cloud.",
                    "Threshold Based Auto Scaling of Virtual Machines in Cloud Environment.",
                    "A Novel Resource Provisioning Model for DHT-Based Cloud Storage Systems.",
                    "BIDS: Bridgehead-Employed Image Distribution System for Cloud Data Centers.",
                    "A Broker-Based Self-organizing Mechanism for Cloud-Market.",
                    "Group Participation Game Strategy for Resource Allocation in Cloud Computing.",
                    "Towards Optimal Collaboration of Policies in the Two-Phase Scheduling of Cloud Tasks.",
                    "Gossip Membership Management with Social Graphs for Byzantine Fault Tolerance in Clouds.",
                    "An Ensemble Multivariate Model for Resource Performance Prediction in the Cloud.",
                    "Prediction-Based Optimization of Live Virtual Machine Migration.",
                    "Control Protocol and Self-adaptive Mechanism for Live Virtual Machine Migration over XIA.",
                    "Efficient Live Migration of Virtual Machines with a Novel Data Filter.",
                    "Energy-Efficient and Adaptive Algorithms for Constructing Multipath Routing in Wireless Sensor Networks.",
                    "An Adaptive Channel Sensing Approach Based on Sequential Order in Distributed Cognitive Radio Networks.",
                    "A Location Privacy Preserving Method Based on Sensitive Diversity for LBS.",
                    "Message Passing Algorithm for the Generalized Assignment Problem.",
                    "PPMS: A Peer to Peer Metadata Management Strategy for Distributed File Systems.",
                    "Improving Log-Based Fault Diagnosis by Log Classification.",
                    "A Compilation and Run-Time Framework for Maximizing Performance of Self-scheduling Algorithms.",
                    "PaxStore : A Distributed Key Value Storage System.",
                    "Semi-automatic Composition of Data Layout Transformations for Loop Vectorization.",
                    "Dynamic Stripe Management Mechanism in Distributed File Systems.",
                    "Accelerating the Reconstruction Process in Network Coding Storage System by Leveraging Data Temperature.",
                    "Speedup Critical Stage of Machine Learning with Batch Scheduling in GPU.",
                    "The New Territory of Lightweight Security in a Cloud Computing Environment.",
                    "DP: Dynamic Prepage in Postcopy Migration for Fixed-Size Data Load.",
                    "Capacity Region of Wireless Network Coding.",
                    "Tacked Link List - An Improved Linked List for Advance Resource Reservation.",
                    "CFIO2: Overlapping Communications and I/O with Computations Using RDMA Technology.",
                    "Performance Analysis of End-to-End Services in Virtualized Computing Environments.",
                    "Adopting Two Strategies to Ensure and Optimize the Quality of Service in Linux.",
                    "Analysis of VMSS Schemes for Group Key Transfer Protocol.",
                    "Resource Prediction for Inter-cloud Broker.",
                    "An Efficient Certificateless Blind Signature Scheme in the Random Oracle Model.",
                    "Increasing Multi-controller Parallelism for Hybrid-Mapped Flash Translation Layers.",
                    "An Estimation-Based Task Load Balancing Scheduling in Spot Clouds.",
                    "Distributed Ontology Integration Model for Cooperative Inference in Context Aware Computing.",
                    "Cross-Platform Parallel Programming in Parray: A Case Study.",
                    "Different Solvers Evaluation for a Bucking Problem.",
                    "Quality of Service Enhancement by Using an Integer Bloom Filter Based Data Deduplication Mechanism in the Cloud Storage Environment.",
                    "Fault-Tolerant Storage Servers for the Databases of Redundant Web Servers in a Computing Grid.",
                    "Scheduling Cloud Platform Managed Live-Migration Operations to Minimize the Makespan.",
                    "Sequential Sensing and Transmission for Real-Time Traffic in Cognitive Networks.",
                    "An Adaptive Heterogeneous Runtime for Irregular Applications in the Case of Ray-Tracing (Extended Abstract).",
                    "DLBer: A Dynamic Load Balancing Algorithm for the Event-Driven Clusters.",
                    "Performance Prediction Model and Analysis for Compute-Intensive Tasks on GPUs.",
                    "Interdomain Traffic Engineering Techniques to Overcome Undesirable Connectivity Incidents."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th NPC 2013",
        "info": "Guiyang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2013",
                "sub_name": "Network and Parallel Computing - 10th IFIP International Conference, NPC 2013, Guiyang, China, September 19-21, 2013. Proceedings.",
                "count": 29,
                "papers": [
                    "A Virtual Network Embedding Algorithm Based on Graph Theory.",
                    "Access Annotation for Safe Program Parallelization.",
                    "A Fine-Grained Pipelined Implementation of LU Decomposition on SIMD Processors.",
                    "FRESA: A Frequency-Sensitive Sampling-Based Approach for Data Race Detection.",
                    "One-to-One Disjoint Path Covers in DCell.",
                    "A Network-Aware Virtual Machine Allocation in Cloud Datacenter.",
                    "Research on the RRB+ Tree for Resource Reservation.",
                    "Totoro: A Scalable and Fault-Tolerant Data Center Network by Using Backup Port.",
                    "A Cloud Resource Allocation Mechanism Based on Mean-Variance Optimization and Double Multi-Attribution Auction.",
                    "A Scheduling Method for Multiple Virtual Machines Migration in Cloud.",
                    "Speeding Up Galois Field Arithmetic on Intel MIC Architecture.",
                    "Analyzing the Characteristics of Memory Subsystem on Two Different 8-Way NUMA Architectures.",
                    "Software/Hardware Hybrid Network-on-Chip Simulation on FPGA.",
                    "Total Exchange Routing on Hierarchical Dual-Nets.",
                    "Efficiency of Flexible Rerouting Scheme for Maximizing Logical Arrays.",
                    "An Efficient Crosstalk-Free Routing Algorithm Based on Permutation Decomposition for Optical Multi-log2 N Switching Networks.",
                    "Conditional Diagnosability of Complete Josephus Cubes.",
                    "Circular Dimensional-Permutations and Reliable Broadcasting for Hypercubes and Möbius Cubes.",
                    "Accelerating Parallel Frequent Itemset Mining on Graphics Processors with Sorting.",
                    "Asymmetry-Aware Scheduling in Heterogeneous Multi-core Architectures.",
                    "Scalable-Grain Pipeline Parallelization Method for Multi-core Systems.",
                    "An Effective Approach for Vocal Melody Extraction from Polyphonic Music on GPU.",
                    "Modified Incomplete Cholesky Preconditioned Conjugate Gradient Algorithm on GPU for the 3D Parabolic Equation.",
                    "Partition-Based Hardware Transactional Memory for Many-Core Processors.",
                    "Roadside Infrastructure Placement for Information Dissemination in Urban ITS Based on a Probabilistic Model.",
                    "Energy Efficient Task Scheduling in Mobile Cloud Computing.",
                    "BotInfer: A Bot Inference Approach by Correlating Host and Network Information.",
                    "Probabilistic QoS Analysis of Web Services.",
                    "A Novel Search Engine to Uncover Potential Victims for APT Investigations."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th NPC 2012",
        "info": "Gwangju, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2012",
                "sub_name": "Network and Parallel Computing, 9th IFIP International Conference, NPC 2012, Gwangju, Korea, September 6-8, 2012. Proceedings.",
                "count": 75,
                "papers": [
                    "An Application-Level Scheduling with Task Bundling Approach for Many-Task Computing in Heterogeneous Environments.",
                    "DGraph: Algorithms for Shortgun Reads Assembly Using De Bruijn Graph.",
                    "Knowledge-Based Adaptive Self-Scheduling.",
                    "Communication Locality Analysis of Triplet-Based Hierarchical Interconnection Network in Chip Multiprocessor.",
                    "A Scoring System for Short Answers on the Test in a Large Group.",
                    "Reference Variables for Dynamic, Reliable Packet Operations.",
                    "Are Heterogeneous Cellular Networks Superior to Homogeneous Ones?",
                    "Dynamic Spray and Wait Routing Protocol for Delay Tolerant Networks.",
                    "A Dynamic Popularity-Aware Load Balancing Algorithm for Structured P2P Systems.",
                    "NCCPIS: A Co-simulation Tool for Networked Control and Cyber-Physical System Evaluation.",
                    "Dempster-Shafer Theory to Identify Insider Attacker in Wireless Sensor Network.",
                    "MIB-ITrace-CP: An Improvement of ICMP-Based Traceback Efficiency in Network Forensic Analysis.",
                    "Breaking a Robust Remote User Authentication Scheme Using Smart Cards.",
                    "An Analysis of Privacy Preserving Data Aggregation Protocols for WSNs.",
                    "Hybrid Obfuscated Javascript Strength Analysis System for Detection of Malicious Websites.",
                    "Detection and Mitigation of Web Application Vulnerabilities Based on Security Testing.",
                    "Small World Asynchronous Parallel Model for Genome Assembly.",
                    "UKCF: A New Graphics Driver Cross-Platform Translation Framework for Virtual Machines.",
                    "Fast Parallel Garner Algorithm for Chinese Remainder Theorem.",
                    "dMPI: Facilitating Debugging of MPI Programs via Deterministic Message Passing.",
                    "On Dynamic Communication Performance of a Hierarchical 3D-Mesh Network.",
                    "An Elastic Architecture Adaptable to Millions of Application Scenarios.",
                    "Demystifying Performance Predictions of Distributed FFT3D Implementations.",
                    "MAP-numa: Access Patterns Used to Characterize the NUMA Memory Access Optimization Techniques and Algorithms.",
                    "mHLogGP: A Parallel Computation Model for CPU/GPU Heterogeneous Computing Cluster.",
                    "Estimating Available Bandwidth in Cooperative Multi-hop Wireless Networks.",
                    "Relative Priority Analysis of Korean IS Audit Standard Check Items Using the Constant-Sum Method.",
                    "Improving the Performances of Internet-Based Marketplace for Technology: A Korean Case Study.",
                    "The Day-of-the Week Effects for Cloud-Based Shipment Timing Support System for Stored Apples.",
                    "An Empirical View on Opportunistic Forwarding Relay Selection Using Contact Records.",
                    "Design and Deployment of Testbed for Experimental Sensor Network Research.",
                    "Implementation of the Integrated Monitoring System Based on an Automatic Disaster Prevention Device.",
                    "Smart Ring: A Model of Node Failure Detection in High Available Cloud Data Center.",
                    "EaSync: A Transparent File Synchronization Service across Multiple Machines.",
                    "Relationship between Correcting Code and Module Technique in Hiding Secret Data.",
                    "Different Characteristics of Radio Modules in Wireless Body Sensor Network Systems.",
                    "The Development of Sustainable Growth Strategy Model Based on the User Tendency in the Online Game Services.",
                    "Computer Education's Teaching-Learning Methods Using Educational Programming Language Based on STEAM Education.",
                    "The Performances Study of EDCF with Block_Ack in WLANs.",
                    "A Study of SLA-Based Defense Resource Management Strategy in Network Security Defense System.",
                    "A New Approach for Detecting SMTPFA Based on Entropy Measurement.",
                    "A Multi-constraint Resource Search Algorithm for P2P-SIP Conference Services.",
                    "The Effects of Governmental Subsidy on the Quality of Education in Taiwan's Private Universities and Colleges.",
                    "Examining the Effectiveness of a Distant Learning Education Program: Use of Patient Safety and Reporting Law and Ethics as Example.",
                    "The Instructional Design of a Web-Based Self-reflective Learning Portfolio for Skill Training.",
                    "The Difference Analysis between Demographic Variables and Personal Attributes - The Case of Internal Auditors in Taiwan.",
                    "Success Factors and Problems Encountered in the Workplace Learning of University/College of Technology Students in Taiwan: A Five-Star Hotel as an Example.",
                    "Cross-Cultural Training Programs and Expatriate Adjustment Effectiveness.",
                    "Soft Power: A Critical Factor for the Effectiveness and Development of a School.",
                    "Merging Grid into Clustering-Based Routing Protocol for Wireless Sensor Networks.",
                    "A Termination Detection Technique Using Gossip in Cloud Computing Environments.",
                    "OEIRM: An Open Distributed Processing Based Interoperability Reference Model for e-Science.",
                    "Using PCI Pass-Through for GPU Virtualization with CUDA.",
                    "Parallel Valuation of the Lower and Upper Bound Prices for Multi-asset Bermudan Options.",
                    "Insight of Direct Search Methods and Module-Integrated Algorithms for Maximum Power Point Tracking (MPPT) of Stand-Alone Photovoltaic Systems.",
                    "Pricing Bermudan Interest Rate Swaptions via Parallel Simulation under the Extended Multi-factor LIBOR Market Model.",
                    "Evolving Linear Discriminant in a Continuously Growing Dimensional Space for Incremental Attribute Learning.",
                    "Compact Multiplicative Inverter for Hardware Elliptic Curve Cryptosystem.",
                    "Space Exploration of Multi-agent Robotics via Genetic Algorithm.",
                    "Weightless Swarm Algorithm (WSA) for Dynamic Optimization Problems.",
                    "Design of a Reliable XOR-XNOR Circuit for Arithmetic Logic Units.",
                    "New Electronic Acupuncture System Using Intelligence.",
                    "A Runtime Environment for Distributed Mashups in Multi-device Scenarios.",
                    "A Location-Based Algorithm for Supporting Multicast Routing in Mobile Ad-Hoc Networks.",
                    "Nibble-CRC for Underwater Acoustic Communication.",
                    "An Optimized Sub-texture Mapping Technique for an Arbitrary Texture Considering Topology Relations.",
                    "Research on a Smart Input Device Using Multimodal Bio-signal Interface.",
                    "Cryptanalysis of an RFID Tag Search Protocol Preserving Privacy of Mobile Reader.",
                    "Cryptanalysis of Goriparthi et al.'s Bilinear Pairing Based Remote User Authentication Scheme.",
                    "Energy-Efficiency Protocol for Securing the Wireless Sensor Networks.",
                    "A Novel Time Reversal-Least Sidelobe Scheme to Minimize ISI and MUI.",
                    "SNR-Based Partial Relay Selection Scheme over Multiple Relay Network.",
                    "Robust Face Recognition in Low Resolution and Blurred Image Using Joint Information in Space and Frequency.",
                    "Algorithms Based on Finite Automata for Testing of Z-codes.",
                    "Design of the Cognitive Information Display for Water Level Control of the Steam Generator in Korean Nuclear Power Reactor."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th NPC 2011",
        "info": "Changsha, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2011",
                "sub_name": "Network and Parallel Computing - 8th IFIP International Conference, NPC 2011, Changsha, China, October 21-23, 2011. Proceedings.",
                "count": 27,
                "papers": [
                    "Elastic Phoenix: Malleable MapReduce for Shared-Memory Systems.",
                    "A Load-Aware Data Placement Policy on Cluster File System.",
                    "H-Fuzzing: A New Heuristic Method for Fuzzing Data Generation.",
                    "Improved Compact Routing Schemes for Power-Law Networks.",
                    "Accelerating the Requirement Space Exploration through Coarse-Grained Parallel Execution.",
                    "A Global Benefit Maximization Task-Bundle Allocation.",
                    "Service Quality Assurance Mechanisms for P2P SIP VoIP.",
                    "VSCM: A Virtual Server Consolidation Manager for Cluster.",
                    "Informed Live Migration Strategies of Virtual Machines for Cluster Load Balancing.",
                    "Dynamic Advance Reservation for Grid System Using Resource Pools.",
                    "A Way of Key Management in Cloud Storage Based on Trusted Computing.",
                    "A Trust-Based Defensive System Model for Cloud Computing.",
                    "A New Method for Authentication Based on Covert Channel.",
                    "A Layered Detection Method for Malware Identification.",
                    "Pedestrian Detection and Tracking Using HOG and Oriented-LBP Features.",
                    "An Efficient Checkpointing Scheme Using Price History of Spot Instances in Cloud Computing Environment.",
                    "Towards a Universal Sketch for Origin-Destination Network Measurements.",
                    "A Power Adjusting Algorithm on Mobility Control in Mobile Ad Hoc Networks.",
                    "Power-Aware Run-Time Incremental Mapping for 3-D Networks-on-Chip.",
                    "WeLe-RAID: A SSD-Based RAID for System Endurance and Performance.",
                    "Reorder the Write Sequence by Virtual Write Buffer to Extend SSD's Lifespan.",
                    "Memory-Side Acceleration for XML Parsing.",
                    "Hardware Performance Monitoring for the Rest of Us: A Position and Survey.",
                    "An Efficient Architectural Design of Hardware Interface for Heterogeneous Multi-core System.",
                    "Evaluations on Effectiveness of Bump-Slot over DAP-NAD-Based Tactical Wideband Wireless Networks.",
                    "Access Path Based Source Address Validation in Mobile IPv6.",
                    "Improve Google Android User Experience with Regional Garbage Collection."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th NPC 2010",
        "info": "Zhengzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2010",
                "sub_name": "Network and Parallel Computing, IFIP International Conference, NPC 2010, Zhengzhou, China, September 13-15, 2010. Proceedings.",
                "count": 41,
                "papers": [
                    "Building a Domain-Knowledge Guided System Software Environment to Achieve High-Performance of Multi-core Processors.",
                    "Internet-Based Virtual Computing Environment.",
                    "Vectorization for Java.",
                    "Just-in-Time Compiler Assisted Object Reclamation and Space Reuse.",
                    "Optimization of Triangular Matrix Functions in BLAS Library on Loongson2F.",
                    "Exposing Tunable Parameters in Multi-threaded Numerical Code.",
                    "LU Decomposition on Cell Broadband Engine: An Empirical Study to Exploit Heterogeneous Chip Multiprocessors.",
                    "FDTM: Block Level Data Migration Policy in Tiered Storage System.",
                    "Scale-Adaptable Recrawl Strategies for DHT-Based Distributed Web Crawling System.",
                    "Power Efficient Scheduling for Hard Real-Time Systems on a Multiprocessor Platform.",
                    "Storage Device Performance Prediction with Selective Bagging Classification and Regression Tree.",
                    "Embedding Algorithms for Bubble-Sort, Macro-star, and Transposition Graphs.",
                    "An Efficient Simulation Algorithm for Cache of Random Replacement Policy.",
                    "DABGPM: A Double Auction Bayesian Game-Based Pricing Model in Cloud Market.",
                    "NPA-BT: A Network Performance Aware BitTorrent Traffic Optimization Mechanism.",
                    "User Behavior Pattern Analysis and Prediction Based on Mobile Phone Sensors.",
                    "ServiceStore: A Peer-to-Peer Framework for QoS-Aware Service Composition.",
                    "Identifying Nearest Neighbor Nodes and Connectivity in Three-Dimensional Wireless Sensor Networks Using Poisson Point Field.",
                    "A Novel Trust Evaluation Model for Mobile P2P Networks.",
                    "Evaluating and Optimizing I/O Virtualization in Kernel-based Virtual Machine (KVM).",
                    "Distributed Stream Processing with DUP.",
                    "CCIndex: A Complemental Clustering Index on Distributed Ordered Tables for Multi-dimensional Range Queries.",
                    "Online Event Correlations Analysis in System Logs of Large-Scale Cluster Systems.",
                    "Differentiated Replication Strategy in Data Centers.",
                    "Efficient Pipelining Parallel Methods for Image Compositing in Sort-Last Rendering.",
                    "memCUDA: Map Device Memory to Host Memory on GPGPU Platform.",
                    "Adaptive Line Size Cache for Irregular References on Cell Multicore Processor.",
                    "Software-Hardware Cooperative DRAM Bank Partitioning for Chip Multiprocessors.",
                    "Energy-Efficient Scheduling of Real-Time Periodic Tasks in Multicore Systems.",
                    "The Core Degree Based Tag Reduction on Chip Multiprocessor to Balance Energy Saving and Performance Overhead.",
                    "Improve Throughput of Storage Cluster Interconnected with a TCP/IP Network Using Intelligent Server Grouping.",
                    "Evaluate the Performance and Scalability of Image Deployment in Virtual Data Center.",
                    "A Resource Discovery Algorithm in Mobile Grid Computing Based on IP-Paging Scheme.",
                    "JAMILA: A Usable Batch Job Management System to Coordinate Heterogeneous Clusters and Diverse Applications over Grid or Cloud Infrastructure.",
                    "User-Centric Privacy Preservation in Data-Sharing Applications.",
                    "Software Metrics Reduction for Fault-Proneness Prediction of Software Modules.",
                    "A Methodology for Design of Unbuffered Router Microarchitecture for S-Mesh NoC.",
                    "A Worst Case Performance Model for TDM Virtual Circuit in NoCs.",
                    "Convex-Based DOR Routing for Virtualization of NoC.",
                    "MPSoC Architecture-Aware Automatic NoC Topology Design.",
                    "ERA: An Efficient Routing Algorithm for Power, Throughput and Latency in Network-on-Chips."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th NPC 2009",
        "info": "Gold Coast, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2009",
                "sub_name": "NPC 2009, Sixth IFIP International Conference on Network and Parallel Computing, Gold Coast, Australia, October 19-21, 2009.",
                "count": 35,
                "papers": [
                    "The Nornir Run-time System for Parallel Programs Using Kahn Process Networks.",
                    "Network Performance of Pruned Hierarchical Torus Network.",
                    "Energy Aware Loop Scheduling for High Performance Multi-Module Memory.",
                    "Super-Peer Availability Prediction Strategy in Unstructured P2P Network.",
                    "Impact of Fragmentation Strategy on Ethernet Performance.",
                    "VirtualNet: Mapping Distributed Communication on a Single Node.",
                    "A Virtual Machine Replay System Based on Para-virtualized Xen.",
                    "Optimizing Live Migration of Virtual Machines in SMP Clusters for HPC Applications.",
                    "DPM: A Demand-driven Virtual Disk Prefetch Mechanism for Mobile Personal Computing Environments.",
                    "Optimizing Transmission in Multi-Flow Streaming Overlay Networks.",
                    "Explorations of Honeycomb Topologies for Network-on-Chip.",
                    "Dynamic Self-configuration of User QoS for Next Generation Network.",
                    "Adaptive Energy-Efficient Packet Transmission for Voice Delivering in Wireless Sensor Networks.",
                    "Accelerator-Oriented Algorithm Transformation for Temporal Data Mining.",
                    "Sleep Scheduling and Gradient Query in Sensor Networks for Target Monitoring.",
                    "Bag-of-Tasks Self-Scheduling over Range-Queriable Search Overlays.",
                    "Improved Forwarding Architecture and Resource Management for Multi-Core Software Routers.",
                    "Re-exploring the Potential of Using Tree Structure in P2P Live Streaming Networks.",
                    "Design and Performance Evaluation of a Versatile Object-Based File System.",
                    "Performance Evaluation of Parallel Programming in Virtual Machine Environment.",
                    "BLAST: Off-the-Shelf Hardware for Building an Efficient Hash-Based Cluster Storage System.",
                    "Performance of LAMMPS Code on Intel Quad-Core Xeon.",
                    "An Investigation on a Real Time System over WiFi in Educational Environment.",
                    "Reliable Downloading Algorithms for BitTorrent-like Systems.",
                    "Cogset: A Unified Engine for Reliable Storage and Parallel Processing.",
                    "Modeling the Propagation Process of Topology-Aware Worms: An Innovative Logic Matrix Formulation.",
                    "A Theoretical Model of Lock-Keeper Data Exchange and its Practical Verification.",
                    "Robust Multi-Server Authentication Scheme.",
                    "System Level Speedup Oriented Cache Partitioning for Multi-programmed Systems.",
                    "A Topology Aggregation Model for Survivability in Multi-Domain Optical Networks Using p-Cycles.",
                    "Search Space Reduction Technique for Distributed Multiple Sequence Alignment.",
                    "GFFC: The Global Feedback Based Flow Control in the NoC Design for Many-core Processor.",
                    "Non-threaded and Threaded Approaches to MultiRail Communication with uDAPL.",
                    "A Network Emergent Computing Model Based on Cellular Automaton.",
                    "Formal Modeling of Parallel System Based on TCPN."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th NPC 2008",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2008",
                "sub_name": "Network and Parallel Computing, IFIP International Conference, NPC 2008, Shanghai, China, October 18-20, 2008. Proceedings.",
                "count": 32,
                "papers": [
                    "An AIAD-Based Adaptive Routing Protocol in Ad-Hoc Wireless Networks.",
                    "Adaptive Neighbor Selection for Service Discovery in Mobile Ad Hoc Networks.",
                    "A Formal Approach to Robustness Testing of Network Protocol.",
                    "Deadline Probing: Towards Timely Cognitive Wireless Network.",
                    "SRDFA: A Kind of Session Reconstruction DFA.",
                    "Measuring the Normality of Web Proxies' Behavior Based on Locality Principles.",
                    "Feedback Control-Based Database Connection Management for Proportional Delay Differentiation-Enabled Web Application Servers.",
                    "Research on the Detection of Distributed Denial of Service Attacks Based on the Characteristics of IP Flow.",
                    "Password-Authenticated Key Exchange between Clients in a Cross-Realm Setting.",
                    "Forward Secure Password-Based Authenticated Key Distribution in the Three-Party Setting.",
                    "Key Management Using Certificateless Public Key Cryptography in Ad Hoc Networks.",
                    "A Data Storage Mechanism for P2P VoD Based on Multi-channel Overlay.",
                    "HTL: A Locality Bounded Flat Hash Location Service.",
                    "Accelerating the Propagation of Active Worms by Employing Multiple Target Discovery Techniques.",
                    "Online Accumulation: Reconstruction of Worm Propagation Path.",
                    "HRS: A Hybrid Replication Strategy for Exhaustive P2P Search.",
                    "ResourceDog: A Trusted Resource Discovery and Automatic Invocation P2P Framework.",
                    "A Novel Approach to Manage Asymmetric Traffic Flows for Secure Network Proxies.",
                    "Automatic Transformation for Overlapping Communication and Computation.",
                    "Cooperative Communication System for Parallel Computing Agents in Multi-cluster Grid.",
                    "CPI: A Novel Three-Phase Algorithm for QoS-Aware Replica Placement Problem.",
                    "Online Balancing Two Independent Criteria.",
                    "Procrastination Scheduling for Fixed-Priority Tasks with Preemption Thresholds.",
                    "Survey on Parallel Programming Model.",
                    "An Integrated Framework for Wireless Sensor Web Service and Its Performance Analysis Based on Queue Theory.",
                    "Grid Computing: A Case Study in Hybrid GMRES Method.",
                    "Towards Resource Reliability Support for Grid Workflows.",
                    "A SyncML Middleware-Based Solution for Pervasive Relational Data Synchronization.",
                    "An Efficient Authentication and Key Agreement Protocol in RFID System.",
                    "Grid Service Discovery Based on Cross-VO Service Domain Model.",
                    "Ontology-Based Semantic Method for Service Modeling in Grid.",
                    "A Scalable and Adaptive Distributed Service Discovery Mechanism in SOC Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/npc/2008w",
                "sub_name": "IFIP International Conference on Network and Parallel Computing, NPC 2008, Shanghai, China, October 18-21, 2008, Workshop Proceedings.",
                "count": 91,
                "papers": [
                    "A Certificate-Based Authenticated Key Agreement Protocol for SIP-Based VoIP Networks.",
                    "Analyzing Euler-Fermat Theorem Based Multicast Key Distribution Schemes with Chinese Remainder Theorem.",
                    "Conditional Privacy Using Re-encryption.",
                    "Using Outlier Detection to Reduce False Positives in Intrusion Detection.",
                    "Identity-Based On-Line/Off-Line Signcryption.",
                    "Attribute Delegation Authorization Based on Subjective Trust Evaluation.",
                    "A Multi-core Supported Intrusion Detection System.",
                    "Synchronization of Discrete Chaotic Dynamical Systems Using Active Control.",
                    "Secure Prophet Address Allocation for Mobile Ad Hoc Networks.",
                    "Two Security Problems of RFID Security Method with Ownership Transfer.",
                    "Novel Stream Cipher Using 2-D Hybrid CA and Variable Ordered Recursive CA Substitutions.",
                    "Cryptanalysis and Improvement of EC2C-PAKA Protocol in Cross-Realm.",
                    "A Dynamic and Self-Adaptive Network Security Policy Realization Mechanism.",
                    "Experimental Tests on SCTP over IPSec.",
                    "A Dual-Head Cluster Based Secure Aggregation Scheme for Sensor Networks.",
                    "Ontology-Based Knowledge Representation for a P2P Multi-agent Distributed Intrusion Detection System.",
                    "Multicast Cryptosystem: A Cryptosystem for Secure Multicast Communication.",
                    "Secure Bit Enhanced Canary: Hardware Enhanced Buffer-Overflow Protection.",
                    "An Improved Method for Ranking of Search Results Based on User Interest.",
                    "ROAD: An RFID Offline Authentication, Privacy Preserving Protocol with Dos Resilience.",
                    "Characterization of Attackers? Activities in Honeypot Traffic Using Principal Component Analysis.",
                    "Towards Time Limited Secure Agent Execution on Malicious Host: A Concept Paper.",
                    "Self-Authentication of Encrypted Channels in Service Network Graph.",
                    "A Novel Sliding Window Based Change Detection Algorithm for Asymmetric Traffic.",
                    "Anomaly Detection Based on Available Bandwidth Estimation.",
                    "Spam Mail Filtering Based on Network Processor.",
                    "Extending BAN Logic for Reasoning with Modern PKI-Based Protocols.",
                    "Detecting Network-Wide Traffic Anomalies Based on Spatial HMM.",
                    "A Stable Clock Synchronization Based on Clock Drift Rate.",
                    "Multi-classifier Classification of Spam Email on a Ubiquitous Multi-core Architecture.",
                    "A Service Trust Model with Passive Trust.",
                    "A Maximum Entropy Based Multi-dimensional Trust Model.",
                    "An Effective P2P Collaborative Mode for Mobile Web Surfing.",
                    "Automatic Chatbot Knowledge Acquisition from Online Forum via Rough Set and Ensemble Learning.",
                    "An MAODV-Based Energy Saving Multicast Routing Algorithm.",
                    "Chaos of Software Requirements.",
                    "A Parallel Algorithm for Simulating Photochemical Reaction.",
                    "A Novel Genetic Algorithm and Its Application in TSP.",
                    "Parallel Computing in Semiclassical Dynamics Simulation of Photochemical Reactions.",
                    "Community Detection Based on Weighted Networks.",
                    "A New Efficient Algorithm for Detecting Communities in Complex Networks.",
                    "Construction and Application of Linux Virtual Server Cluster for Scientific Computing.",
                    "An Empirical Study on the Informatization and E-commerce Development Level in Chongqing.",
                    "MP-MAODV: A MAODV-Based Multipath Routing Algorithm.",
                    "Benefit Optimization Resource Scheduling Algorithm in Three-Dimensional QoS Model in Grid Computing.",
                    "Classified Optimization Scheduling Algorithm Driven by Multi-QoS Attributes in Economical Grid.",
                    "A Spatial Renewal Video Traffic Model Based on Buffering Metrics.",
                    "An Exception Handling Framework for Service-Oriented Computing.",
                    "Research on Mapping of MPCC SCF to SIP Protocol in Parlay/OSA API.",
                    "A Scheme of Detecting Cheaters Wholly in Threshold Secret Sharing for Mobile Ad Hoc Networks.",
                    "Research on T-bridge Algorithm of Web Session Fuzzy Clustering.",
                    "A New Secure E-mail Scheme Based on Elliptic Curve Cryptography Combined Public Key.",
                    "Traflow: Design and Complementation of a Real Time Traffic Measurement System in High-Speed Networks.",
                    "Research on Design and Its Key Technologies of Web Service Platform in P2P Environment.",
                    "Wiretap Channel with Side Information from Part of Encoder.",
                    "Relay Aided Wireless Multicast Utilizing Network Coding: Outage Behaviour and Diversity Gain.",
                    "Generation-Based Network Coding over Networks with Delay.",
                    "Capacity and Delay of the Wireless Network with Special Relay Nodes.",
                    "A Distributed Fast Light-path Set-up Protocol for Grid over OBS Networks.",
                    "A Volunteer Computing in High Performance Environment Based on Availability Model.",
                    "A Probabilistic Approach to Analyze the Effect of Free-Riders in P2P Streaming Services.",
                    "Network Coding for P2P Live Media Streaming.",
                    "Optimal Placement of Mesh Points in a Wireless Mesh Network Using Multi-path Routing Protocol.",
                    "Towards Mapping Large Scale Ontologies Based on RFCA with Attribute Reduction.",
                    "Design of a Collaborative Ontology Editing System for Enterprise Process Integration.",
                    "Emerging Autopoietic Communities - Scalability of Knowledge Transfer in Complex Systems.",
                    "Fostering the Knowledge-Sharing Behavior of Customers in Interorganizational Healthcare Communities.",
                    "Fitting Grey Relation Model for the Performance of E-government Service: The Case of Kaohsiung City Service On-Line System in Taiwan.",
                    "CUCS: A Web Page Classification Algorithm for Large Training Set.",
                    "A DL-Based Approach for Eliminating Concept Restriction Conflicts in Ontology Merging.",
                    "Knowledge Mining and Visualization on News Webpages and Large-Scale News Video Database.",
                    "Object Lifecycle Evolution History Modeling and Reuse for Knowledge Management.",
                    "Acquiring Compressor Design Case Knowledge Using Rough Set Theory.",
                    "MFDSSF: A Mobile Fuzzy Decision Support System for Firefighter Cooperation in Ad Hoc Networks.",
                    "Behavior-Based Web Services Matchmaking.",
                    "A Semantic Approach to Recommendation System Based on User Ontology and Spreading Activation Model.",
                    "Semantic Mapping in Product Design and Catalog Integration.",
                    "Research on the Modeling of Semantic-Based Web Resources Feature.",
                    "A Semantic Annotation Based Software Knowledge Sharing Space.",
                    "Research on Product Design Knowledge Reuse through Linkage with Design Iteration Records.",
                    "A Method to Guarantee Ontology Consistency on Property Range Changes.",
                    "An Adaptive Transmission Control Mechanism for Underwater Acoustic Sensor Network.",
                    "EBMD: Energy-Balanced Multi-path Data Propation Algorithm for Sensor Networks.",
                    "A Novel Communication Structure for Wireless Sensor Network.",
                    "Quantum Secure Communication Network on EPR States.",
                    "A Group Quantum Communication Network Using Quantum Secret Sharing.",
                    "Data Gathering Approaches for Underwater Sensor Networks.",
                    "The Application and Research of Ontology in Knowledge Management Field.",
                    "EBAT: Energy Balanced Adaptive Transmission Algorithm for Sensor Networks.",
                    "Implementation and Optimization of MPICH2 Multicast on Optical Fiber Network.",
                    "A Resource Scheduling Strategy for Intrusion Detection on Multi-core Platform."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th NPC 2007",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2007",
                "sub_name": "Network and Parallel Computing, IFIP International Conference, NPC 2007, Dalian, China, September 18-21, 2007, Proceedings.",
                "count": 57,
                "papers": [
                    "On a High-Order Compact Scheme and Its Utilization in Parallel Solution of a Time-Dependent System on a Distributed Memory Processor.",
                    "Dynamic Multi-resource Advance Reservation in Grid Environment.",
                    "A Novel Adaptive Proxy Certificates Management Scheme in Military Grid Environment.",
                    "A Scheduling Model for Maximizing Availability with Makespan Constraint Based on Residual Lifetime in Heterogeneous Clusters.",
                    "A VO-Based Two-Stage Replica Replacement Algorithm.",
                    "Grid Scheduling Optimization Under Conditions of Uncertainty.",
                    "A Dynamic Adjustment Strategy for File Transformation in Data Grids.",
                    "Spatial Map Data Share and Parallel Dissemination System Based on Distributed Network Services and Digital Watermark.",
                    "Managing Email Overload with an Automatic Nonparametric Clustering Approach.",
                    "On the Routing Algorithms for Optical Multi-log2 N Networks.",
                    "Overall Blocking Behavior Analysis on Banyan-Based Optical Switching Networks Under Crosstalk Constraint.",
                    "SW-Uinta: A Small-World P2P Overlay Network.",
                    "Unmanned Navigation of the 1/10 Vehicle Using U-SAT.",
                    "Energy-Efficient Scheduling Fixed-Priority Tasks with Preemption Thresholds on Variable Voltage Processors.",
                    "Estimation of Absolute Positioning of Mobile Robot Using U-SAT.",
                    "A Collaborative Service Discovery and Service Sharing Framework for Mobile Ad Hoc Networks.",
                    "Proteus: An Architecture for Adapting Web Page on Small-Screen Devices.",
                    "EEGFGR: An Energy-Efficient Greedy-Face Geographic Routing for Wireless Sensor Networks.",
                    "An Improved Bandwidth-Use Method on IEEE 802.11e Standard over Wireless LAN.",
                    "Maximum Life-Time Localized Broadcast Routing in MANET.",
                    "Modulation Multiplexing Distributed Space-Time Block Coding for Two-User Cooperative Diversity in Wireless Network.",
                    "Modified Widest Disjoint Paths Algorithm for Multipath Routing.",
                    "Optimum Broadcasting Algorithms in (n, k)-Star Graphs Using Spanning Trees.",
                    "Link Protocol Based on DS-CDMA with MUD for Decentralized All-Connected Wireless Network.",
                    "A Small-World Optimization Algorithm Based and ABC Supported QoS Unicast Routing Scheme.",
                    "Algorithms for the m-Coverage Problem and k-Connected m-Coverage Problem in Wireless Sensor Networks.",
                    "A Novel Multiple Access Protocol with QoS Support for Mobile Ad Hoc Networks.",
                    "Dual-Residue Montgomery Multiplication.",
                    "Design and Performance Analysis of CZML-IPSec for Satellite IP Networks.",
                    "A Novel Group Key Management Based on Jacobian Elliptic Chebyshev Rational Map.",
                    "Scheme of Defending Against DDoS Attacks in Large-Scale ISP Networks.",
                    "Security Analysis of the Authentication Modules of Chinese WLAN Standard and Its Implementation Plan.",
                    "Restoration Design in IP over Reconfigurable All-Optical Networks.",
                    "SIPS: A Stateful and Flow-Based Intrusion Prevention System for Email Applications.",
                    "Design and Evaluation of Parallel String Matching Algorithms for Network Intrusion Detection Systems.",
                    "Object-Based Storage Model for Object-Oriented Database.",
                    "HPRD: A High Performance RDF Database.",
                    "A Direction to Avoid Re-encryption in Cryptographic File Sharing.",
                    "Exploit Temporal Locality of Shared Data in SRC Enabled CMP.",
                    "Architectural Implications of Cache Coherence Protocols with Network Applications on Chip MultiProcessors.",
                    "The SKB: A Semi-Completely-Connected Bus for On-Chip Systems.",
                    "An Instruction Folding Solution to a Java Processor.",
                    "HNDP: A Novel Network Distance Prediction Mechanism.",
                    "Analytical Model of IEEE 802.15.4 Non-beacon Mode with Download Traffic by the Piggyback Method.",
                    "A Novel Algorithm for Estimating Flow Length Distributions-LSM.",
                    "Performance Prediction for Mappings of Distributed Applications on PC Clusters.",
                    "Communication-Prediction of Scouting Switching in Adaptively-Routed Torus Networks.",
                    "The Implementation and Evaluation of a Low-Power Clock Distribution Network Based on EPIC.",
                    "Service Process Improvement Based on Exceptional Pattern Analysis.",
                    "An Improved Fuzzy Support Vector Machine for Credit Rating.",
                    "A Cost-Aware Parallel Workload Allocation Approach Based on Machine Learning Techniques.",
                    "A Hierarchical Programming Model for Large Parallel Interactive Applications.",
                    "Design of a Simulator for Mesh-Based Reconfigurable Architectures.",
                    "Personal Grid.",
                    "On Parallel Models of Computation.",
                    "Challenges in Dependability of Networked Systems for Information Society.",
                    "Reference Architectural Styles for Service-Oriented Computing."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "NPC 2005",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2005",
                "sub_name": "Network and Parallel Computing, IFIP International Conference, NPC 2005, Beijing, China, November 30 - December 3, 2005, Proceedings.",
                "count": 71,
                "papers": [
                    "TeraGrid: A Foundation for US Cyberinfrastructure.",
                    "Globus Toolkit Version 4: Software for Service-Oriented Systems.",
                    "System Software for China National Grid.",
                    "CGSV: An Adaptable Stream-Integrated Grid Monitoring System.",
                    "Performance Modeling and Analysis for Resource Scheduling in Data Grids.",
                    "Study on pi-Calculus Based Equipment Grid Service Chain Model.",
                    "A Performance-Based Parallel Loop Self-scheduling on Grid Computing Environments.",
                    "A Resource-Based Server Performance Control for Grid Computing Systems.",
                    "IBP: An Index-Based XML Parser Model.",
                    "A Stochastic Control Model for Hierarchical Grid Service.",
                    "Service-Based Grid Resource Monitoring with Common Information Model.",
                    "Distributed Gridflow Model and Implementation.",
                    "A Secure P2P Video Conference System for Enterprise Environments.",
                    "Adaptive Query-Caching in Peer-to-Peer Systems.",
                    "Design and Deployment of Locality-Aware Overlay Multicast Protocol for Live Streaming Services.",
                    "Dynamic Thread Management in Kernel Pipeline Web Server.",
                    "QoS Aware Service Composition with Multiple Quality Constraints.",
                    "Performance Modelling and Optimization of Memory Access on Cellular Computer Architecture Cyclops64.",
                    "TCP-ABC: From Multiple TCP Connections to Atomic Broadcasting.",
                    "A Parallel File System Based on Spatial Information Object.",
                    "Topology-Aware Multi-cluster Architecture Based on Efficient Index Techniques.",
                    "A Parallel Routing Algorithm on Circulant Networks Employing the Hamiltonian Circuit Latin Square.",
                    "An Efficient Load Balancing Algorithm for Cluster System.",
                    "A Greedy Algorithm for Capacity-Constrained Surrogate Placement in CDNs.",
                    "An Improved Scheme of Wavelength Assignment for Parallel FFT Communication Pattern on a Class of Regular Optical Networks.",
                    "A Parallel O(n27n/8) Time-Memory-Processor Tradeoff for Knapsack-Like Problems.",
                    "Improving Parallelism of Nested Loops with Non-uniform Dependences.",
                    "A Static Data Dependence Analysis Approach for Software Pipelining.",
                    "A Dynamic Data Dependence Analysis Approach for Software Pipelining.",
                    "A Parallel and Distributed Method for Computing High Dimensional MOLAP.",
                    "An Improved ACO Algorithm for Multicast Routing.",
                    "Performance Modelling of Pipelined Circuit Switching in Torus with Hot Spot Traffic.",
                    "An Incremental Compilation Approach for OpenMP Applications.",
                    "Enhanced Congestion Control Algorithm for High-Speed TCP.",
                    "Advanced Software On-Demand Based on Functional Streaming.",
                    "Can Out-of-Order Instruction Execution in Multiprocessors Be Made Sequentially Consistent?.",
                    "Efficiently Passive Monitoring Flow Bandwidth.",
                    "A Heuristic for Scheduling Parallel Programs with Synchronous Communication Model in the Network Computing Environments.",
                    "A Formal Model for Network Processor Workload.",
                    "Coping with Data Dependencies of Multi-dimensional Array References.",
                    "QoS-Based Dynamic Channel Allocation for GSM/GPRS Networks.",
                    "Distributed Active Measuring Link Bandwidth in IP Networks.",
                    "Preferential Bandwidth Allocation for Short Flows with Active Queue Management.",
                    "A New Self-tuning Active Queue Management Algorithm Based on Adaptive Control.",
                    "Research on Multi-agent System Automated Negotiation Theory and Model.",
                    "Adaptive Congestion Control in ATM Networks.",
                    "Secure Password Pocket for Distributed Web Services.",
                    "The Modified DTW Method for On-Line Automatic Signature Verification.",
                    "A Secure On-Demand Routing with Distributed Authentication for Trust-Based Ad Hoc Networks.",
                    "Probabilistic Packet Filtering Model to Protect Web Server from DDoS Attacks.",
                    "An Identity Authentication Protocol for Acknowledgment in IEEE 802.15.4 Network.",
                    "A Design of the Digital Content Distribution System Based on the Public Key and the Hierarchical Web Caching Structure.",
                    "Cluster-Aware Cache for Network Attached Storage.",
                    "Design and Implementation of a SAN Agent for Windows NT Architecture.",
                    "MagicStore: A New Out-of-Band Virtualization System in SAN Environments.",
                    "A Content Delivery Accelerator in Data-Intensive Servers.",
                    "A Systematic Scheme to Resolve QoS Dissatisfaction for Storage Cluster.",
                    "Secure Anonymous Communication with Conditional Traceability.",
                    "Real-Time Video over Programmable Networked Devices.",
                    "A New Raid-Disk Placement Method for Interactive Media Server with an Accurate Bit Count Control.",
                    "A New Region of Interest Image Coding for Narrowband Network: Partial Bitplane Alternating Shift.",
                    "Using Route Probing to Derive Link Traffic Load with Edge-Based Measurements.",
                    "Scheduling Multicast Traffic in a Combined Input Separate Output Queued Switch.",
                    "A QoS-Based Scheduling Mechanism for Overlay Aggregate Traffics.",
                    "Energy Conservation by Peer-to-Peer Relaying in Quasi-Ad Hoc Networks.",
                    "Developing Energy-Efficient Topologies and Routing for Wireless Sensor Networks.",
                    "The Efficient Transmission Scheme in Wireless Crypto Communication.",
                    "Constructing k-Connected k-Cover Set in Wireless Sensor Networks Based on Self-pruning.",
                    "GCMPR: Gateway-Centric Multi-path Routing for Internet Connectivity of Wireless Mobile Ad Hoc Network.",
                    "A Semantic and Adaptive Context Model for Ubiquitous Computing.",
                    "Research of Survival-Time-Based Dynamic Adaptive Replica Allocation Algorithm in Mobile Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "NPC 2004",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/npc/2004",
                "sub_name": "Network and Parallel Computing, IFIP International Conference, NPC 2004, Wuhan, China, October 18-20, 2004, Proceedings.",
                "count": 99,
                "papers": [
                    "Secure Grid Computing with Trusted Resources and Internet Datamining.",
                    "Towards Memory Oriented Scalable Computer Architecture and High Efficiency Petaflops Computing.",
                    "In-VIGO: Making the Grid Virtually Yours.",
                    "Productivity in HPC Clusters.",
                    "Whole-Stack Analysis and Optimization of Commercial Workloads on Server Systems.",
                    "Fuzzy Trust Integration for Security Enforcement in Grid Computing.",
                    "Atomic Commitment in Grid Database Systems.",
                    "A Data Grid Security System Based on Shared Context.",
                    "A Study on Performance Monitoring Techniques for Traditional Parallel Systems and Grid.",
                    "A Workflow-Based Grid Portal for Problem Solving Environment.",
                    "A Real-Time Transaction Approach for Grid Services: A Model and Algorithms.",
                    "QoS Quorum-Constrained Resource Management in Wireless Grid.",
                    "A Data-Aware Resource Broker for Data Grids.",
                    "Managing Service-Oriented Grids: Experiences from VEGA System Software.",
                    "An Efficient Parallel Loop Self-scheduling on Grid Environments.",
                    "ALiCE: A Scalable Runtime Infrastructure for High Performance Grid Computing.",
                    "Mapping Publishing and Mapping Adaptation in the Middleware of Railway Information Grid System.",
                    "A Heuristic Algorithm for the Job Shop Scheduling Problem.",
                    "Coordinating Distributed Resources for Complex Scientific Computation.",
                    "Efficiently Rationing Resources for Grid and P2P Computing.",
                    "Grid Resource Discovery Model Based on the Hierarchical Architecture and P2P Overlay Network.",
                    "Collaborative Process Execution for Service Composition with StarWebService.",
                    "Efficient Gnutella-like P2P Overlay Construction.",
                    "Lookup-Ring: Building Efficient Lookups for High Dynamic Peer-to-Peer Overlays.",
                    "Layer Allocation Algorithms in Layered Peer-to-Peer Streaming.",
                    "Build a Distributed Repository for Web Service Discovery Based on Peer-to-Peer Network.",
                    "Performance Improvement of Hint-Based Locating & Routing Mechanism in P2P File-Sharing Systems.",
                    "Cache Design for Transcoding Proxy Caching.",
                    "Content Aggregation Middleware (CAM) for Fast Development of High Performance Web Syndication Services.",
                    "Domain-Based Proxy for Efficient Location Tracking of Mobile Agents.",
                    "Inhambu: Data Mining Using Idle Cycles in Clusters of PCs.",
                    "Request Distribution for Fairness with a New Load-Update Mechanism in Web Server Cluster.",
                    "Profile Oriented User Distributions in Enterprise Systems with Clustering.",
                    "CBBS: A Content-Based Bandwidth Smoothing Scheme for Clustered Video Servers.",
                    "SuperNBD: An Efficient Network Storage Software for Cluster.",
                    "I/O Response Time in a Fault-Tolerant Parallel Virtual File System.",
                    "SARCNFS: Self-Adaptive Redundancy Clustered NAS File System.",
                    "Research and Implementation of a Snapshot Facility Suitable for Soft-Failure Recovery.",
                    "GOOMPI: A Generic Object Oriented Message Passing Interface.",
                    "Simulating Complex Dynamical Systems in a Distributed Programming Environment.",
                    "Design and Implementation of a Remote Debugger for Concurrent Debugging of Multiple Processes in Embedded Linux Systems.",
                    "Performance Evaluation of Hypercubes in the Presence of Multiple Time-Scale Correlated Traffic.",
                    "Leader Election in Hyper-Butterfly Graphs.",
                    "A New Approach to Local Route Recovery for Multihop TCP in Ad Hoc Wireless Networks.",
                    "Graph-Theoretic Analysis of Kautz Topology and DHT Schemes.",
                    "A Parameterized Model of TCP Slow Start.",
                    "SMM: A Truthful Mechanism for Maximum Lifetime Routing in Wireless Ad Hoc Networks.",
                    "A Dioid Linear Algebra Approach to Study a Class of Continuous Petri Nets.",
                    "A Fully Adaptive Fault-Tolerant Routing Methodology Based on Intermediate Nodes.",
                    "Extended DBP for (m, k)-Firm Based QoS.",
                    "Weighted Fair Scheduling Algorithm for QoS of Input-Queued Switches.",
                    "A Scalable Distributed Architecture for Multi-party Conferencing Using SIP.",
                    "DC-mesh: A Contracted High-Dimensional Mesh for Dynamic Clustering.",
                    "The Effect of Adaptivity on the Performance of the OTIS-Hypercube Under Different Traffic Patterns.",
                    "An Empirical Autocorrelation Form for Modeling LRD Traffic Series.",
                    "Statistical Error Analysis on Recording LRD Traffic Time Series.",
                    "Load Balancing Routing in Low-Cost Parallel QoS Sensitive Network Architecture.",
                    "Reversible Cellular Automata Based Encryption.",
                    "Ontology Based Cooperative Intrusion Detection System.",
                    "Adding Security to Network Via Network Processors.",
                    "A Method to Obtain Signatures from Honeypots Data.",
                    "A Framework for Adaptive Anomaly Detection Based on Support Vector Data Description.",
                    "Design and Analysis of Improved GSM Authentication Protocol for Roaming Users.",
                    "A Novel Intrusion Detection Method.",
                    "An Implementation of Storage-Based Synchronous Remote Mirroring for SANs.",
                    "A Network Bandwidth Computation Technique for IP Storage with QoS Guarantees.",
                    "Paramecium: Assembling Raw Nodes into Composite Cells.",
                    "The Flexible Replication Method in an Object-Oriented Data Storage System.",
                    "Enlarge Bandwidth of Multimedia Server with Network Attached Storage System.",
                    "The NDMP-Plus Prototype Design and Implementation for Network Based Data Management.",
                    "Further Optimized Parallel Algorithm of Watershed Segmentation Based on Boundary Components Graph.",
                    "The Transmitted Strategy of Proxy Cache Based on Segmented Video.",
                    "The Strategy of Batch Using Dynamic Cache for Streaming Media.",
                    "New Regions of Interest Image Coding Using Up-Down Bitplanes Shift for Network Applications.",
                    "Bridging the Gap Between Micro and Nanotechnology: Using Lab-on-a-Chip to Enable Nanosensors for Genomics, Proteomics, and Diagnostic Screening.",
                    "The Development of Biosensors and Biochips in IECAS.",
                    "Open Issues on Intelligent Sensor Networks.",
                    "Enabling Anytime Anywhere Wireless Sensor Networks.",
                    "A Query-Aware Routing Algorithm in Sensor Networks.",
                    "Sensor Network Optimization by a Novel Genetic Algorithm.",
                    "Online Mining in Sensor Networks.",
                    "The HKUST Frog Pond - A Case Study of Sensory Data Analysis.",
                    "BLOSSOMS: A CAS/HKUST Joint Project to Build Lightweight Optimized Sensor Systems on a Massive Scale.",
                    "A Pervasive Sensor Node Architecture.",
                    "Cabot: On the Ontology for the Middleware Support of Context-Aware Pervasive Applications.",
                    "Accurate Emulation of Wireless Sensor Networks.",
                    "LEAPS: A Location Estimation and Action Prediction System in a Wireless LAN Environment.",
                    "Reliable Splitted Multipath Routing for Wireless Sensor Network.",
                    "Reliable Data Aggregation for Real-Time Queries in Wireless Sensor Systems.",
                    "The Design of a DRM System Using PKI and a Licensing Agent.",
                    "Multimedia Synchronization for Handoff Control with MPEG in All-IP Mobile Networks.",
                    "Fuzzy Logic Adaptive Mobile Location Estimation.",
                    "A Host Protection Framework Against Unauthorized Access for Ensuring Network Survivability.",
                    "A Design and Implementation of Network Traffic Monitoring System for PC-room Management.",
                    "A Vulnerability Assessment Tool Based on OVAL in Linux System.",
                    "Performance Analysis of Delay Estimation Models for Signalized Intersection Networks.",
                    "Network Intrusion Protection System Using Rule-Based DB and RBAC Policy.",
                    "Effective FM Bandwidth Estimate Scheme with the DARC in Broadcasting Networks.",
                    "Enhanced Algorithm of TCP Performance on Handover in Wireless Internet Networks."
                ]
            }
        ]
    }
]