[
    {
        "year": "2021",
        "name": "30th PACT 2021",
        "info": "Atlanta, GA, USA",
        "venues": []
    },
    {
        "year": "2020",
        "name": "29th PACT 2020",
        "info": "Virtual Event, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2020",
                "sub_name": "PACT '20: International Conference on Parallel Architectures and Compilation Techniques, Virtual Event, GA, USA, October 3-7, 2020.",
                "count": 49,
                "papers": [
                    "Overview of HPC and AI Computing for COVID-19 in the US.",
                    "cuSZ: An Efficient GPU-Based Error-Bounded Lossy Compression Framework for Scientific Data.",
                    "TAFE: Thread Address Footprint Estimation for Capturing Data/Thread Locality in GPU Systems.",
                    "SparseRT: Accelerating Unstructured Sparsity on GPUs for Deep Learning Inference.",
                    "GOPipe: A Granularity-Oblivious Programming Framework for Pipelined Stencil Executions on GPU.",
                    "Exploring the Design Space of Static and Incremental Graph Connectivity Algorithms on GPUs.",
                    "Fireiron: A Data-Movement-Aware Scheduling Language for GPUs.",
                    "Automatic Generation of Multi-Objective Polyhedral Compiler Transformations.",
                    "Bandwidth-Aware Loop Tiling for DMA-Supported Scratchpad Memory.",
                    "Deep Program Structure Modeling Through Multi-Relational Graph-based Learning.",
                    "AutoHOOT: Automatic High-Order Optimization for Tensors.",
                    "Intelligent Data Placement on Discrete GPU Nodes with Unified Memory.",
                    "Deep Learning Assisted Resource Partitioning for Improving Performance on Commodity Servers.",
                    "Decoupled Address Translation for Heterogeneous Memory Systems.",
                    "Bandwidth Bottleneck in Network-on-Chip for High-Throughput Processors.",
                    "Scalable Specialization: Architectures, Interfaces, & Applications.",
                    "Analyzing and Leveraging Shared L1 Caches in GPUs.",
                    "Transmuter: Bridging the Efficiency Gap using Memory and Dataflow Reconfiguration.",
                    "Enhancing Address Translations in Throughput Processors via Compression.",
                    "Regional Out-of-Order Writes in Total Store Order.",
                    "Parallel and Scalable Precise Clustering.",
                    "SecSched: Flexible Scheduling in Secure Processors.",
                    "Clearing the Shadows: Recovering Lost Performance for Invisible Speculative Execution through HW/SW Co-Design.",
                    "Fast Convolutional Neural Networks with Fine-Grained FFTs.",
                    "Accelerating Sparse CNN Inference on GPUs with Performance-Aware Weight Pruning.",
                    "SparseTrain: Leveraging Dynamic Sparsity in Software for Training DNNs on General-Purpose SIMD Processors.",
                    "Helix: Algorithm/Architecture Co-design for Accelerating Nanopore Genome Base-calling.",
                    "Opportunistic Early Pipeline Re-steering for Data-dependent Branches.",
                    "Model-Based Warp Overlapped Tiling for Image Processing Programs on GPUs.",
                    "Low-Latency Proactive Continuous Vision.",
                    "Collective Affinity Aware Computation Mapping.",
                    "VTensor: Using Virtual Tensors to Build a Layout-oblivious AI Programming Framework.",
                    "Parallelizing Parallel Programs: A Dynamic Pattern Analysis for Modernization of Legacy Parallel Code.",
                    "A New Qubits Mapping Mechanism for Multi-programming Quantum Computing.",
                    "Exploiting Locality in Scalable Ordered Maps.",
                    "DeepSwapper: A Deep Learning Based Page Swap Management Scheme for Hybrid Memory Systems.",
                    "VP Float: First Class Treatment for Variable Precision Floating Point Arithmetic.",
                    "Approximate Pattern Matching for On-Chip Interconnect Traffic Prediction.",
                    "Compiling Chapel: Keys to Making Parallel Programming Productive at Scale.",
                    "The Forward Slice Core Microarchitecture.",
                    "A Methodology for Principled Approximation in Visual SLAM.",
                    "Memory-Equipped Quantum Architectures: The Power of Random Access.",
                    "Mixed-Signal Charge-Domain Acceleration of Deep Neural Networks through Interleaved Bit-Partitioned Arithmetic.",
                    "MEPHESTO: Modeling Energy-Performance in Heterogeneous SoCs and Their Trade-Offs.",
                    "Ribbon: High Performance Cache Line Flushing for Persistent Memory.",
                    "PRISM: Architectural Support for Variable-granularity Memory Metadata.",
                    "Valkyrie: Leveraging Inter-TLB Locality to Enhance GPU Performance.",
                    "RackMem: A Tailored Caching Layer for Rack Scale Computing.",
                    "ATTC (@C): Addressable-TLB based Translation Coherence."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "28th PACT 2019",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2019",
                "sub_name": "28th International Conference on Parallel Architectures and Compilation Techniques, PACT 2019, Seattle, WA, USA, September 23-26, 2019.",
                "count": 58,
                "papers": [
                    "MASR: A Modular Accelerator for Sparse RNNs.",
                    "Gluon-Async: A Bulk-Asynchronous System for Distributed and Heterogeneous Graph Analytics.",
                    "BOLT: Optimizing OpenMP Parallel Regions with User-Level Threads.",
                    "SMT-COP: Defeating Side-Channel Attacks on Execution Units in SMT Processors.",
                    "Type-Directed Program Synthesis and Constraint Generation for Library Portability.",
                    "Deepframe: A Profile-Driven Compiler for Spatial Hardware Accelerators.",
                    "Fast Parallel Equivalence Relations in a Datalog Compiler.",
                    "Enforcing Last-Level Cache Partitioning through Memory Virtual Channels.",
                    "To Stack or Not To Stack.",
                    "Enforcing Crash Consistency of Evolving Network Analytics in Non-Volatile Main Memory Systems.",
                    "Fooling the Sense of Cross-Core Last-Level Cache Eviction Based Attacker by Prefetching Common Sense.",
                    "SpecShield: Shielding Speculative Data from Microarchitectural Covert Channels.",
                    "MOSAIC: Heterogeneity-, Communication-, and Constraint-Aware Model Slicing and Execution for Accurate and Efficient Inference.",
                    "Acorns: A Framework for Accelerating Deep Neural Networks with Input Sparsity.",
                    "Forgive-TM: Supporting Lazy Conflict Detection In Eager Hardware Transactional Memory.",
                    "Unfair Scheduling Patterns in NUMA Architectures.",
                    "Optimizing Persistent Memory Transactions.",
                    "HeTM: Transactional Memory for Heterogeneous Systems.",
                    "Achieving Scalability in a k-NN Multi-GPU Network Service with Centaur.",
                    "Analyzing and Leveraging Remote-Core Bandwidth for Enhanced Performance in GPUs.",
                    "Specialization Opportunities in Graphical Workloads.",
                    "FindeR: Accelerating FM-Index-Based Exact Pattern Matching in Genomic Sequences through ReRAM Technology.",
                    "SLAMBooster: An Application-Aware Online Controller for Approximation in Dense SLAM.",
                    "Exploring Memory Persistency Models for GPUs.",
                    "Adaptive Task Aggregation for High-Performance Sparse Solvers on GPUs.",
                    "EDGE: Event-Driven GPU Execution.",
                    "Generating Portable High-Performance Code via Multi-Dimensional Homomorphisms.",
                    "Absinthe: Learning an Analytical Performance Model to Fuse and Tile Stencil Codes in One Shot.",
                    "Reducing Data Movement and Energy in Multilevel Cache Hierarchies without Losing Performance: Can you have it all?",
                    "Multiversioned Page Overlays: Enabling Faster Serializable Hardware Transactional Memory.",
                    "Computing Three-Dimensional Constrained Delaunay Refinement Using the GPU.",
                    "A Synchronization-Avoiding Distance-1 Grundy Coloring Algorithm for Power-Law Graphs.",
                    "Accelerating DCA++ (Dynamical Cluster Approximation) Scientific Application on the Summit Supercomputer.",
                    "A Methodology for Characterizing Sparse Datasets and Its Application to SIMD Performance Prediction.",
                    "POSTER: Precise Capacity Planning for Database Public Clouds.",
                    "POSTER: BioSEAL: In-Memory Biological Sequence Alignment Accelerator for Large-Scale Genomic Data.",
                    "POSTER: The Performance Impact of Thread Packing on Synchronization-Intensive Applications.",
                    "POSTER: Leveraging Run-Time Feedback for Efficient ASR Acceleration.",
                    "POSTER: Automatic Parallelization Targeting Asynchronous Task-Based Runtimes.",
                    "POSTER: Memory Hotspot Optimization for Data-Intensive Applications.",
                    "POSTER: GPU Based Near Data Processing for Image Processing with Pattern Aware Data Allocation and Prefetching.",
                    "POSTER: Variable Sized Cache-Block Compaction.",
                    "POSTER: Domain-Specialized Cache Management for Graph Analytics.",
                    "POSTER: Runtime Adaptations for Energy-Efficient VSLAM.",
                    "POSTER: GIRAF: General Purpose In-Storage Resistive Associative Framework.",
                    "POSTER: An Optimized Predication Execution for SIMD Extensions.",
                    "POSTER: Tango: An Optimizing Compiler for Just-In-Time RTL Simulation.",
                    "POSTER: SPiDRE: Accelerating Sparse Memory Access Patterns.",
                    "POSTER: CogR: Exploiting Program Structures for Machine-Learning Based Runtime Solutions.",
                    "POSTER: A Collaborative Multi-Factor Scheduler for Asymmetric Multicore Processors.",
                    "POSTER: Space and Time Optimal DNN Primitive Selection with Integer Linear Programming.",
                    "POSTER: Quiescent and Versioned Shadow Copies for NVM.",
                    "POSTER: AR-MMAP: Write Performance Improvement of Memory-Mapped File.",
                    "POSTER: Exploiting Multi-Level Task Dependencies to Prune Redundant Work in Relax-Ordered Task-Parallel Algorithms.",
                    "POSTER: Quantifying the Direct Overhead of Virtual Function Calls on Massively Parallel Architectures.",
                    "POSTER: A Polyhedral+Dataflow Intermediate Language for Performance Exploration.",
                    "POSTER: Pairing Up CNNs for High Throughput Deep Learning.",
                    "POSTER: A Memory-Access-Efficient Adaptive Implementation of kNN on FPGA through HLS."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "27th PACT 2018",
        "info": "Limassol, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2018",
                "sub_name": "Proceedings of the 27th International Conference on Parallel Architectures and Compilation Techniques, PACT 2018, Limassol, Cyprus, November 01-04, 2018.",
                "count": 36,
                "papers": [
                    "Massively parallel skyline computation for processing-in-memory architectures.",
                    "Data motifs: a lens towards fully understanding big data and AI workloads.",
                    "Performance extraction and suitability analysis of multi- and many-core architectures for next generation sequencing secondary analysis.",
                    "Synergistic cache layout for reuse and compression.",
                    "Hypart: a hybrid technique for practical memory bandwidth partitioning on commodity servers.",
                    "EAR: ECC-aided refresh reduction through 2-D zero compression.",
                    "Log(graph): a near-optimal high-performance graph representation.",
                    "An efficient graph accelerator with parallel data conflict management.",
                    "Graphphi: efficient parallel graph processing on emerging throughput-oriented architectures.",
                    "Revealing parallel scans and reductions in recurrences through function reconstruction.",
                    "Compiler assisted coalescing.",
                    "VW-SLP: auto-vectorization with adaptive vector width.",
                    "Stencil codes on a vector length agnostic architecture.",
                    "Maximizing system utilization via parallelism management for co-located parallel applications.",
                    "MemoDyn: exploiting weakly consistent data structures for dynamic parallel memoization.",
                    "Architectural support for convolutional neural networks on modern CPUs.",
                    "A portable, automatic data qantizer for deep neural networks.",
                    "E-PUR: an energy-efficient processing unit for recurrent neural networks.",
                    "Mage: online and interference-aware scheduling for multi-scale heterogeneous systems.",
                    "GMOD: a dynamic GPU memory overflow detector.",
                    "On-the-fly workload partitioning for integrated CPU/GPU architectures.",
                    "3D-Xpath: high-density managed DRAM architecture with cost-effective alternative paths for memory transactions.",
                    "Atributed consistent hashing for heterogeneous storage systems.",
                    "DART: distributed adaptive radix tree for efficient affix-based keyword search on HPC systems.",
                    "Cost effective speculation with the omnipredictor.",
                    "Towards concurrency race debugging: an integrated approach for constraint solving and dynamic slicing.",
                    "Optimizing remote data transfers in X10.",
                    "Near-side prefetch throttling: adaptive prefetching for high-performance many-core processors.",
                    "ComP-net: command processor networking for efficient intra-kernel communications on GPUs.",
                    "Cimple: instruction and memory level parallelism: a DSL for uncovering ILP and MLP.",
                    "Automatic annotation of tasks in structured code.",
                    "Cost-driven thread coarsening for GPU kernels.",
                    "Transactional pre-abort handlers in hardware transactional memory.",
                    "In-DRAM near-data approximate acceleration for GPUs.",
                    "Biased reference counting: minimizing atomic operations in garbage collection.",
                    "Hybrid optimization/heuristic instruction scheduling for programmable accelerator codesign."
                ]
            },
            {
                "sub_name_abbr": "conf/IEEEpact/2018andare",
                "sub_name": "Proceedings of the 2nd Workshop on AutotuniNg and aDaptivity AppRoaches for Energy efficient HPC Systems, ANDARE@PACT 2018, Limassol, Cyprus, November 4, 2018.",
                "count": 5,
                "papers": [
                    "Performance analysis and autotuning setup of the cuFFT library.",
                    "COUNTDOWN: a run-time library for application-agnostic energy saving in MPI communication primitives.",
                    "Evaluation of NTP/PTP fine-grain synchronization performance in HPC clusters.",
                    "Accelerating CNN computation: quantisation tuning and network resizing.",
                    "HERO: an open-source research platform for HW/SW exploration of heterogeneous manycore systems."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "26th PACT 2017",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2017",
                "sub_name": "26th International Conference on Parallel Architectures and Compilation Techniques, PACT 2017, Portland, OR, USA, September 9-13, 2017.",
                "count": 50,
                "papers": [
                    "RCU-HTM: Combining RCU with HTM to Implement Highly Efficient Concurrent Binary Search Trees.",
                    "Redesigning Go's Built-In Map to Support Concurrent Operations.",
                    "MultiGraph: Efficient Graph Processing on GPUs.",
                    "An Ultra Low-Power Hardware Accelerator for Acoustic Scoring in Speech Recognition.",
                    "DrMP: Mixed Precision-Aware DRAM for High Performance Approximate and Precise Computing.",
                    "SAM: Optimizing Multithreaded Cores for Speculative Parallelism.",
                    "Performance Improvement via Always-Abort HTM.",
                    "DRUT: An Efficient Turbo Boost Solution via Load Balancing in Decoupled Look-Ahead Architecture.",
                    "Proxy Benchmarks for Emerging Big-Data Workloads.",
                    "Lightweight Provenance Service for High-Performance Computing.",
                    "POSTER: Putting the G back into GPU/CPU Systems Research.",
                    "POSTER: Application-Driven Near-Data Processing for Similarity Search.",
                    "POSTER: Improving Datacenter Efficiency Through Partitioning-Aware Scheduling.",
                    "POSTER: The Liberation Day of Nondeterministic Programs.",
                    "POSTER: Location-Aware Computation Mapping for Manycore Processors.",
                    "POSTER: BACM: Barrier-Aware Cache Management for Irregular Memory-Intensive GPGPU Workloads.",
                    "POSTER: DaQueue: A Data-Aware Work-Queue Design for GPGPUs.",
                    "POSTER: Accelerate GPU Concurrent Kernel Execution by Mitigating Memory Pipeline Stalls.",
                    "POSTER: Design Space Exploration for Performance Optimization of Deep Neural Networks on Shared Memory Accelerators.",
                    "POSTER: Bridge the Gap Between Neural Networks and Neuromorphic Hardware.",
                    "POSTER: Improving NUMA System Efficiency with a Utilization-Based Co-scheduling.",
                    "POSTER: Bridging the Gap Between Deep Learning and Sparse Matrix Format Selection.",
                    "POSTER: Cutting the Fat: Speeding Up RBM for Fast Deep Learning Through Generalized Redundancy Elimination.",
                    "POSTER: Exploiting Approximations for Energy/Quality Tradeoffs in Service-Based Applications.",
                    "POSTER: Statement Reordering to Alleviate Register Pressure for Stencils on GPUs.",
                    "POSTER: NUMA-Aware Power Management for Chip Multiprocessors.",
                    "POSTER: BigBus: A Scalable Optical Interconnect.",
                    "POSTER: Elastic Reconfiguration for Heterogeneous NoCs with BiNoCHS.",
                    "Nexus: A New Approach to Replication in Distributed Shared Caches.",
                    "Leeway: Addressing Variability in Dead-Block Prediction for Last-Level Caches.",
                    "Application Clustering Policies to Address System Fairness with Intel's Cache Allocation Technology.",
                    "Transparent Dual Memory Compression Architecture.",
                    "End-to-End Deep Learning of Optimization Heuristics.",
                    "Graphie: Large-Scale Asynchronous Graph Traversals on Just a GPU.",
                    "A GPU-Friendly Skiplist Algorithm.",
                    "Sthira: A Formal Approach to Minimize Voltage Guardbands under Variation in Networks-on-Chip for Energy Efficiency.",
                    "Avoiding TLB Shootdowns Through Self-Invalidating TLB Entries.",
                    "Weak Memory Models: Balancing Definitional Simplicity and Implementation Flexibility.",
                    "Near-Memory Address Translation.",
                    "Efficient Checkpointing of Loop-Based Codes for Non-volatile Main Memory.",
                    "SuperGraph-SLP Auto-Vectorization.",
                    "Exploiting Asymmetric SIMD Register Configurations in ARM-to-x86 Dynamic Binary Translation.",
                    "A Generalized Framework for Automatic Scripting Language Parallelization.",
                    "Architecting a Novel Hybrid Cache with Low Energy.",
                    "Introspective Computing.",
                    "A DSL for Performance Orchestration.",
                    "Cache Automaton: Repurposing Caches for Automata Processing.",
                    "Large Scale Data Clustering Using Memristive k-Median Computation.",
                    "In-memory Data Flow Processor.",
                    "Multilayer Compute Resource Management with Robust Control Theory."
                ]
            },
            {
                "sub_name_abbr": "conf/IEEEpact/2017andare",
                "sub_name": "Proceedings of the 1st Workshop on AutotuniNg and aDaptivity AppRoaches for Energy efficient HPC Systems, ANDARE@PACT 2017, Portland, OR, USA, September 9, 2017.",
                "count": 5,
                "papers": [
                    "Auto-tuning Static Schedules for Task Data-flow Applications.",
                    "Autotuning of OpenCL Kernels with Global Optimizations.",
                    "Benefits in Relaxing the Power Capping Constraint.",
                    "Exploiting Parallelism on GPUs and FPGAs with OmpSs.",
                    "Adaptive Performance Sensitivity Model to Support GPU Power Management."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "25th PACT 2016",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2016",
                "sub_name": "Proceedings of the 2016 International Conference on Parallel Architectures and Compilation, PACT 2016, Haifa, Israel, September 11-15, 2016.",
                "count": 55,
                "papers": [
                    "Big Data Analytics on Flash Storage with Accelerators.",
                    "Combating the Reliability Challenge of GPU Register File at Low Supply Voltage.",
                    "μC-States: Fine-grained GPU Datapath Power Management.",
                    "Scheduling Techniques for GPU Architectures with Processing-In-Memory Capabilities.",
                    "OAWS: Memory Occlusion Aware Warp Scheduling.",
                    "Integrating Algorithmic Parameters into Benchmarking and Design Space Exploration in 3D Scene Understanding.",
                    "Fusion of Parallel Array Operations.",
                    "Reduction Drawing: Language Constructs and Polyhedral Compilation for Reductions on GPU.",
                    "Resource Conscious Reuse-Driven Tiling for GPUs.",
                    "Accelerating Linked-list Traversal Through Near-Data Processing.",
                    "Scalable Task Parallelism for NUMA: A Uniform Abstraction for Coordinated Scheduling and Memory Management.",
                    "A Static Cut-off for Task Parallel Programs.",
                    "Greater Performance and Better Efficiency: Predicated Execution has shown us the way.",
                    "WearCore: A Core for Wearable Workloads.",
                    "Energy Aware Persistence: Reducing Energy Overheads of Memory-based Persistence in NVMs.",
                    "Power Tuning HPC Jobs on Power-Constrained Systems.",
                    "Online Scalability Characterization of Data-Parallel Programs on Many Cores.",
                    "Speculatively Exploiting Cross-Invocation Parallelism.",
                    "MicroSpec: Speculation-Centric Fine-Grained Parallelization for FSM Computations.",
                    "Hash Map Inlining.",
                    "Sparso: Context-driven Optimizations of Sparse Linear Algebra.",
                    "Tardis 2.0: Optimized Time Traveling Coherence for Relaxed Consistency Models.",
                    "Reducing Cache Coherence Traffic with Hierarchical Directory Cache and NUMA-Aware Runtime Scheduling.",
                    "Characterizing and Optimizing the Performance of Multithreaded Programs Under Interference.",
                    "Optimizing Indirect Memory References with milk.",
                    "Scaling Data Analytics with Moore's Law.",
                    "Bridging the Semantic Gaps of GPU Acceleration for Scale-out CNN-based Big Data Processing: Think Big, See Small.",
                    "A DSL Compiler for Accelerating Image Processing Pipelines on FPGAs.",
                    "Automatically Exploiting Implicit Pipeline Parallelism from Multiple Dependent Kernels for GPUs.",
                    "CAF: Core to Core Communication Acceleration Framework.",
                    "Vectorization of Multibyte Floating Point Data Formats.",
                    "Rinnegan: Efficient Resource Use in Heterogeneous Architectures.",
                    "Auto-tuning Spark Big Data Workloads on POWER8: Prediction-Based Dynamic SMT Threading.",
                    "EXCITE-VM: Extending the Virtual Memory System to Support Snapshot Isolation Transactions.",
                    "POSTER: Fly-Over: A Light-Weight Distributed Power-Gating Mechanism For Energy-Efficient Networks-on-Chip.",
                    "POSTER: Exploiting Asymmetric Multi-Core Processors with Flexible System Sofware.",
                    "POSTER: Easy PRAM-based High-Performance Parallel Programming with ICE.",
                    "POSTER: Fault-tolerant Execution on COTS Multi-core Processors with Hardware Transactional Memory Support.",
                    "POSTER: Collective Dynamic Parallelism for Directive Based GPU Programming Languages and Compilers.",
                    "POSTER: Firestorm: Operating Systems for Power-Constrained Architectures.",
                    "POSTER: ξ-TAO: A Cache-centric Execution Model and Runtime for Deep Parallel Multicore Topologies.",
                    "POSTER: Efficient Self-Invalidation/Self-Downgrade for Critical Sections with Relaxed Semantics.",
                    "POSTER: SILC-FM: Subblocked InterLeaved Cache-Like Flat Memory Organization.",
                    "POSTER: Hybrid Data Dependence Analysis for Loop Transformations.",
                    "POSTER: An Optimization of Dataflow Architectures for Scientific Applications.",
                    "POSTER: hVISC: A Portable Abstraction for Heterogeneous Parallel Systems.",
                    "POSTER: An Integrated Vector-Scalar Design on an In-order ARM Core.",
                    "POSTER: Pagoda: A Runtime System to Maximize GPU Utilization in Data Parallel Tasks with Limited Parallelism.",
                    "Student Research Poster: Slack-Aware Shared Bandwidth Management in GPUs.",
                    "Student Research Poster: From Processing-in-Memory to Processing-in-Storage.",
                    "Student Research Poster: Network Controller Emulation on a Sidecore for Unmodified Virtual Machines.",
                    "Student Research Poster: A Low Complexity Cache Sharing Mechanism to Address System Fairness.",
                    "Student Research Poster: A Scalable General Purpose System for Large-Scale Graph Processing.",
                    "Student Research Poster: Compiling Boolean Circuits to Non-deterministic Branching Programs to be Implemented by Light Switching Circuits.",
                    "Student Research Poster: Software Out-of-Order Execution for In-Order Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/IEEEpact/2016dfm",
                "sub_name": "Proceedings of the Sixth Workshop on Data-Flow Execution Models for Extreme Scale Computing, DFM@PACT 2016, Haifa, Israel, September 15, 2016.",
                "count": 4,
                "papers": [
                    "Data-Driven execution of the Tile LU Decomposition.",
                    "Tree-based Read-only Data Chunks for NVRAM Programming.",
                    "CnC: A Dependence Programming Model.",
                    "Challenges and Opportunities for Dataflow Processing on Exascale Computers."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "24th PACT 2015",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2015",
                "sub_name": "2015 International Conference on Parallel Architectures and Compilation, PACT 2015, San Francisco, CA, USA, October 18-21, 2015.",
                "count": 50,
                "papers": [
                    "Phase Aware Warp Scheduling: Mitigating Effects of Phase Behavior in GPGPU Applications.",
                    "NVMMU: A Non-volatile Memory Management Unit for Heterogeneous GPU-SSD Architectures.",
                    "Exploiting Inter-Warp Heterogeneity to Improve GPGPU Performance.",
                    "Scalable SIMD-Efficient Graph Processing on GPUs.",
                    "Parallel Methods for Verifying the Consistency of Weakly-Ordered Architectures.",
                    "Stadium Hashing: Scalable and Flexible Hashing on GPUs.",
                    "TSXProf: Profiling Hardware Transactions.",
                    "ALEA: Fine-Grain Energy Profiling with Basic Block Sampling.",
                    "Towards General-Purpose Neural Network Computing.",
                    "Practical Near-Data Processing for In-Memory Analytics Frameworks.",
                    "Scalable Task Scheduling and Synchronization Using Hierarchical Effects.",
                    "PENCIL: A Platform-Neutral Compute Intermediate Language for Accelerator Programming.",
                    "Communication Avoiding Algorithms: Analysis and Code Generation for Parallel Systems.",
                    "Exploiting Program Semantics to Place Data in Hybrid Memory.",
                    "Decoupled Direct Memory Access: Isolating CPU and IO Traffic by Leveraging a Dual-Data-Port DRAM.",
                    "A Software-Managed Approach to Die-Stacked DRAM.",
                    "An Algorithmic Approach to Communication Reduction in Parallel Graph Algorithms.",
                    "Polyhedral Optimizations of Explicitly Parallel Programs.",
                    "Tardis: Time Traveling Coherence Algorithm for Distributed Shared Memory.",
                    "BSSync: Processing Near Memory for Machine Learning Workloads with Bounded Staleness Consistency Models.",
                    "Brain-Inspired Computing.",
                    "Runtime Value Numbering: A Profiling Technique to Pinpoint Redundant Computations.",
                    "Tracking and Reducing Uncertainty in Dataflow Analysis-Based Dynamic Parallel Monitoring.",
                    "Compiler Assisted Load Balancing on Large Clusters.",
                    "RC3: Consistency Directed Cache Coherence for x86-64 with RC Extensions.",
                    "Fine Grain Cache Partitioning Using Per-Instruction Working Blocks.",
                    "An Efficient, Self-Contained, On-chip Directory: DIR1-SISD.",
                    "Dealing with the Unknown: Resilience to Prediction Errors.",
                    "Exploiting Staleness for Approximating Loads on CMPs.",
                    "Orchestrating Multiple Data-Parallel Kernels on Multiple Devices.",
                    "AREP: Adaptive Resource Efficient Prefetching for Maximizing Multicore Performance.",
                    "Runtime-Guided Management of Scratchpad Memories in Multicore Architectures.",
                    "OSPREY: Implementation of Memory Consistency Models for Cache Coherence Protocols involving Invalidation-Free Data Access.",
                    "Cosmology and Computers: HACCing the Universe.",
                    "Vector Parallelism in JavaScript: Language and Compiler Support for SIMD.",
                    "Compiling and Optimizing Java 8 Programs for GPU Execution.",
                    "Throttling Automatic Vectorization: When Less is More.",
                    "Evaluating the Cost of Atomic Operations on Modern Architectures.",
                    "MeToo: Stochastic Modeling of Memory Traffic Timing Behavior.",
                    "Using Compiler Techniques to Improve Automatic Performance Modeling.",
                    "Using Hybrid Schedules to Safely Outperform Classical Polyhedral Schedules.",
                    "Unified Identification of Multiple Forms of Parallelism in Embedded Applications.",
                    "An Optimization of Resource Arrangement for Network-on-Chip using Genetic Algorithm.",
                    "Load Balancing in Decoupled Look-ahead: A Do-It-Yourself (DIY) Approach.",
                    "An Efficient Vectorization Approach to Nested Thread-level Parallelism for CUDA GPUs.",
                    "Extending Polyhedral Model for Analysis and Transformation of OpenMP Programs.",
                    "Energy-Efficient Hybrid DRAM/NVM Main Memory.",
                    "DVFS-Aware Consolidation for Energy-Efficient Clouds.",
                    "Integrating 3D Resistive Memory Cache into GPGPU for Energy-Efficient Data Processing.",
                    "Storage Consolidation on SSDs: Not Always a Panacea, but Can We Ease the Pain?"
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "23rd PACT 2014",
        "info": "Edmonton, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2014",
                "sub_name": "International Conference on Parallel Architectures and Compilation, PACT '14, Edmonton, AB, Canada, August 24-27, 2014.",
                "count": 65,
                "papers": [
                    "Internet of mobile things: challenges and opportunities.",
                    "Virtues and limitations of commodity hardware transactional memory.",
                    "Cooperative cache scrubbing.",
                    "KLA: a new algorithmic paradigm for parallel graph computations.",
                    "Tiling and optimizing time-iterated computations on periodic domains.",
                    "ATCache: reducing DRAM cache latency via a small SRAM tag cache.",
                    "SpongeDirectory: flexible sparse directories utilizing multi-level memristors.",
                    "EFetch: optimizing instruction fetch for event-driven webapplications.",
                    "XStream: cross-core spatial streaming based MLC prefetchers for parallel applications in CMPs.",
                    "What is the cost of weak determinism?",
                    "ILP and TLP in shared memory applications: a limit study.",
                    "Versatile and scalable parallel histogram construction.",
                    "Bitwise data parallelism in regular expression matching.",
                    "Adaptive heterogeneous scheduling for integrated GPUs.",
                    "Warp-aware trace scheduling for GPUs.",
                    "CAWS: criticality-aware warp scheduling for GPGPU workloads.",
                    "Invyswell: a hybrid transactional memory for haswell's restricted transactional memory.",
                    "Consolidated conflict detection for hardware transactional memory.",
                    "DeSTM: harnessing determinism in STMs for application development.",
                    "PATS: pattern aware scheduling and power gating for GPGPUs.",
                    "Heterogeneous microarchitectures trump voltage scaling for low-power cores.",
                    "RCS: runtime resource and core scaling for power-constrained multi-core processors.",
                    "Realm: an event-based low-level runtime for distributed memory architectures.",
                    "kMAF: automatic kernel-level management of thread and data affinity.",
                    "Shuffling: a framework for lock contention aware thread scheduling for multicore multiprocessor systems.",
                    "Domain-specific models for innovation in analytics.",
                    "OpenTuner: an extensible framework for program autotuning.",
                    "Velociraptor: an embedded compiler toolkit for numerical programs targeting CPUs and GPUs.",
                    "Memory scheduling towards high-throughput cooperative heterogeneous computing.",
                    "Bounded memory scheduling of dynamic task graphs.",
                    "Trading cache hit rate for memory performance.",
                    "Compiler support for selective page migration in NUMA architectures.",
                    "COLORIS: a dynamic cache partitioning system using page coloring.",
                    "PEMOGEN: automatic adaptive performance modeling during program runtime.",
                    "ArrayTool: a lightweight profiler to guide array regrouping.",
                    "Design for scalability in enterprise SSDs.",
                    "D2MA: accelerating coarse-grained data transfer for GPUs.",
                    "VAST: the illusion of a large memory space for GPUs.",
                    "Automatic optimization of thread-coarsening for graphics processors.",
                    "Automatic execution of single-GPU computations across multiple GPUs.",
                    "LCA: a memory link and cache-aware co-scheduling approach for CMPs.",
                    "A run-time power manager exploiting software parallelism.",
                    "Graph-based performance accounting for chip multiprocessor memory systems.",
                    "SQRL: hardware accelerator for collecting software data structures.",
                    "Optimizing stencil code via locality of computation.",
                    "ADHA: automatic data layout framework for heterogeneous architectures.",
                    "Active learning accelerated automatic heuristic construction for parallel program mapping.",
                    "Preemptive thread block scheduling with online structural runtime prediction for concurrent GPGPU kernels.",
                    "Using STT-RAM to enable energy-efficient near-threshold chip multiprocessors.",
                    "Protection and utilization in shared cache through rationing.",
                    "Automatic parallelism through macro dataflow in high-level array languages.",
                    "A runtime support mechanism for fast mode switching of a self-morphing core for power efficiency.",
                    "Rollback-free value prediction with approximate loads.",
                    "Measuring flexibility in single-ISA heterogeneous processors.",
                    "SM-centric transformation: circumventing hardware restrictions for flexible GPU scheduling.",
                    "An event-based language for dynamic binary translation frameworks.",
                    "Improving performance of streaming applications with filtering and control messages.",
                    "Stratified sampling for even workload partitioning.",
                    "Design of a hybrid MPI-CUDA benchmark suite for CPU-GPU clusters.",
                    "Data remapping for an energy efficient burst chop in DRAM memory systems.",
                    "Data-reuse optimizations for pipelined tiling with parametric tile sizes.",
                    "From petascale to the pocket: Adaptively scaling parallel programs for mobile SoCs.",
                    "Coarrays in GNU Fortran.",
                    "Locality-aware memory association for multi-target worksharing in OpenMP.",
                    "Processing big data graphs on memory-restricted systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "22nd PACT 2013",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2013",
                "sub_name": "Proceedings of the 22nd International Conference on Parallel Architectures and Compilation Techniques, Edinburgh, United Kingdom, September 7-11, 2013.",
                "count": 48,
                "papers": [
                    "General chairs' welcome message.",
                    "Message from the program chairs.",
                    "Keynote talk: A comprehensive approach to HW/SW codesign.",
                    "Keynote talk: Parallel programming for mobile computing.",
                    "Keynote talk: Towards automatic resource management in parallel architectures.",
                    "INSPIRE: The insieme parallel intermediate representation.",
                    "Parallel flow-sensitive pointer analysis by graph-rewriting.",
                    "Interprocedural strength reduction of critical sections in explicitly-parallel programs.",
                    "ThermOS: System support for dynamic thermal management of chip multi-processors.",
                    "Coordinated power-performance optimization in manycores.",
                    "An opportunistic prediction-based thread scheduling to maximize throughput/watt in AMPs.",
                    "APOGEE: Adaptive prefetching on GPUs for energy efficiency.",
                    "Parallel frame rendering: Trading responsiveness for energy on a mobile GPU.",
                    "Exploring hybrid memory for GPU energy efficiency through software-hardware co-design.",
                    "S-CAVE: Effective SSD caching to improve virtual machine storage performance.",
                    "Writeback-aware bandwidth partitioning for multi-core systems with PCM.",
                    "L1-bandwidth aware thread allocation in multicore SMT processors.",
                    "A unified view of non-monotonic core selection and application steering in heterogeneous chip multiprocessors.",
                    "Memory-centric system interconnect design with Hybrid Memory Cubes.",
                    "Neither more nor less: Optimizing thread-level parallelism for GPGPUs.",
                    "SMT-centric power-aware thread placement in chip multiprocessors.",
                    "Fairness-aware scheduling on single-ISA heterogeneous multi-cores.",
                    "DANBI: Dynamic scheduling of irregular stream programs for many-core systems.",
                    "An empirical model for predicting cross-core performance interference on multicore processors.",
                    "Jigsaw: Scalable software-defined caches.",
                    "Managing shared last-level cache in a heterogeneous multicore processor.",
                    "Reshaping cache misses to improve row-buffer locality in multicore systems.",
                    "Transparent CPU-GPU collaboration for data-parallel kernels on heterogeneous systems.",
                    "Starchart: Hardware and software optimization using recursive partitioning regression trees.",
                    "RSVM: A Region-based Software Virtual Memory for GPU.",
                    "The case for a scalable coherence protocol for complex on-chip cache hierarchies in many-core systems.",
                    "Meeting midway: Improving CMP performance with memory-side prefetching.",
                    "Building expressive, area-efficient coherence directories.",
                    "Traffic steering between a low-latency unswitched TL ring and a high-throughput switched on-chip interconnect.",
                    "McRouter: Multicast within a router for high performance network-on-chips.",
                    "Concurrent predicates: A debugging technique for every parallel programmer.",
                    "Breaking SIMD shackles with an exposed flexible microarchitecture and the access execute PDG.",
                    "Vectorization past dependent branches through speculation.",
                    "Automatic vectorization of tree traversals.",
                    "Generating efficient data movement code for heterogeneous architectures with distributed-memory.",
                    "Automatic OpenCL work-group size selection for multicore CPUs.",
                    "TCPT - Thread criticality-driven prefetcher throttling.",
                    "Do inputs matter? using data-dependence profiling to evaluate thread level speculation in BG/Q.",
                    "Can lock-free and combining techniques co-exist? A novel approach on concurrent queue.",
                    "Task sampling: Computer architecture simulation in the many-core era.",
                    "PS-cache: An energy-efficient cache design for chip multiprocessors.",
                    "Dynamic memory access monitoring based on tagged memory.",
                    "Exposing ILP in custom hardware with a dataflow compiler IR."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "21st PACT 2012",
        "info": "Minneapolis, MN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2012",
                "sub_name": "International Conference on Parallel Architectures and Compilation Techniques, PACT '12, Minneapolis, MN, USA - September 19 - 23, 2012.",
                "count": 79,
                "papers": [
                    "The changing role of supercomputing.",
                    "Power-aware multi-core simulation for early design stage hardware/software co-optimization.",
                    "PGCapping: exploiting power gating for power capping and core lifetime balancing in CMPs.",
                    "Power-efficient time-sensitive mapping in heterogeneous systems.",
                    "Fast and efficient automatic memory management for GPUs using compiler-assisted runtime coherence scheme.",
                    "Riposte: a trace-driven compiler and parallel VM for vector code in R.",
                    "Auto-parallelizing stateful distributed streaming applications.",
                    "PEPON: performance-aware hierarchical power budgeting for NoC based multicores.",
                    "XPoint cache: scaling existing bus-based coherence protocols for 2D and 3D many-core systems.",
                    "APCR: an adaptive physical channel regulator for on-chip interconnects.",
                    "Pointy: a hybrid pointer prefetcher for managed runtime systems.",
                    "Scalability-based manycore partitioning.",
                    "Optimizing datacenter power with memory system levers for guaranteed quality-of-service.",
                    "Evaluation of blue Gene/Q hardware support for transactional memories.",
                    "Making data prefetch smarter: adaptive prefetching on POWER7.",
                    "Enhancing performance optimization of multicore chips and multichip nodes with data structure metrics.",
                    "Compiling to avoid communication.",
                    "Visualizing transactional memory.",
                    "Sandboxing transactional memory.",
                    "Transactional prefetching: narrowing the window of contention in hardware transactional memory.",
                    "RISE: improving the streaming processors reliability against soft errors in gpgpus.",
                    "Chrysalis analysis: incorporating synchronization arcs in dataflow-analysis-based parallel monitoring.",
                    "Probabilistic diagnosis of performance faults in large-scale parallel applications.",
                    "Top500 versus sustained performance: the top problems with the top500 list - and what to do about them.",
                    "Practically private: enabling high performance CMPs through compiler-assisted data classification.",
                    "Complexity-effective multicore coherence.",
                    "HaLock: hardware-assisted lock contention detection in multithreaded applications.",
                    "Runtime detection and optimization of collective communication patterns.",
                    "Coalition threading: combining traditional andnon-traditional parallelism to maximize scalability.",
                    "Shared memory multiplexing: a novel way to improve GPGPU throughput.",
                    "Introducing hierarchy-awareness in replacement and bypass algorithms for last-level caches.",
                    "Efficient techniques for predicting cache sharing and throughput.",
                    "Optimal bypass monitor for high performance last-level caches.",
                    "Lossless and lossy memory I/O link compression for improving performance of GPGPU workloads.",
                    "Multi2Sim: a simulation framework for CPU-GPU computing.",
                    "A yoke of oxen and a thousand chickens for heavy lifting graph processing.",
                    "The evicted-address filter: a unified mechanism to address both cache pollution and thrashing.",
                    "A software memory partition approach for eliminating bank-level interference in multicore systems.",
                    "Base-delta-immediate compression: practical data compression for on-chip caches.",
                    "Hardware acceleration in the IBM PowerEN processor: architecture and performance.",
                    "Workload and power budget partitioning for single-chip heterogeneous processors.",
                    "Database analytics acceleration using FPGAs.",
                    "LumiNOC: a power-efficient, high-performance, photonic network-on-chip for future parallel architectures.",
                    "Acceleration of bulk memory operations in a heterogeneous multicore architecture.",
                    "Integrating nanophotonics in GPU microarchitecture.",
                    "Branch and data herding: reducing control and memory divergence for error-tolerant GPU applications.",
                    "Layout-oblivious optimization for matrix computations.",
                    "Boost.SIMD: generic programming for portable SIMDization.",
                    "Speculative parallelization needs rigor: probabilistic analysis for optimal speculation of finite-state machine applications.",
                    "Supporting stateful tasks in a dataflow graph.",
                    "MaSiF: machine learning guided auto-tuning of parallel skeletons.",
                    "TMNOC: a case of HTM and NoC co-design for increased energy efficiency and concurrency.",
                    "Application-aware prefetch prioritization in on-chip networks.",
                    "ReCaP: a region-based cure for the common cold cache.",
                    "Power-efficient computing for compute-intensive GPGPU applications.",
                    "Off-chip access localization for NoC-based multicores.",
                    "Many-thread aware instruction-level parallelism: architecting shader cores for GPU computing.",
                    "PS-Dir: a scalable two-level directory cache.",
                    "Inference and declaration of independence: impact on deterministic task parallelism.",
                    "Application-to-core mapping policies to reduce memory interference in multi-core systems.",
                    "Bandwidth bandit: quantitative characterization of memory contention.",
                    "Speculative dynamic vectorization for HW/SW co-designed processors.",
                    "Fine-grained parallel traversals of irregular data structures.",
                    "High-performance analysis of filtered semantic graphs.",
                    "Energy-efficient cache partitioning for future CMPs.",
                    "A low-overhead dynamic optimization framework for multicores.",
                    "Making it practical and effective: fast and precise may-happen-in-parallel analysis.",
                    "Mileage-based contention management in transactional memory.",
                    "System-level power-performance efficiency modeling for emergent GPU architectures.",
                    "Transactional event profiling in a best-effort hardware transactional memory system.",
                    "Transparent runtime deadlock elimination.",
                    "Design of a storage processing unit.",
                    "SkipCache: miss-rate aware cache management.",
                    "Using combined profiling to decide when thread level speculation is profitable.",
                    "Hardware prefetchers for emerging parallel applications.",
                    "Strategies based on green policies to the grid resource allocation.",
                    "Linearly compressed pages: a main memory compression framework with low complexity and low latency.",
                    "Energy-efficient workload mapping in heterogeneous systems with multiple types of resources.",
                    "Phase-based scheduling and thread migration for heterogeneous multicore processors."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "20th PACT 2011",
        "info": "Galveston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2011",
                "sub_name": "2011 International Conference on Parallel Architectures and Compilation Techniques, PACT 2011, Galveston, TX, USA, October 10-14, 2011.",
                "count": 68,
                "papers": [
                    "A Unified Scheduler for Recursive and Task Dataflow Parallelism.",
                    "No More Backstabbing... A Faithful Scheduling Policy for Multithreaded Programs.",
                    "Dynamic Fine-Grain Scheduling of Pipeline Parallelism.",
                    "SPATL: Honey, I Shrunk the Coherence Directory.",
                    "POPS: Coherence Protocol Optimization for Both Private and Shared Data.",
                    "An OpenCL Framework for Homogeneous Manycores with No Hardware Cache Coherence.",
                    "Compiling Dynamic Data Structures in Python to Enable the Use of Multi-core and Many-core Libraries.",
                    "Efficient Parallel Graph Exploration on Multi-Core CPU and GPU.",
                    "A Heterogeneous Parallel Framework for Domain-Specific Languages.",
                    "PEPSC: A Power-Efficient Processor for Scientific Computing.",
                    "Improving Throughput of Power-Constrained GPUs Using Dynamic Voltage/Frequency and Core Scaling.",
                    "Performance Per Watt Benefits of Dynamic Core Morphing in Asymmetric Multicores.",
                    "Phase-Based Application-Driven Hierarchical Power Management on the Single-chip Cloud Computer.",
                    "Optimizing Data Layouts for Parallel Computation on Multicores.",
                    "DeNovo: Rethinking the Memory Hierarchy for Disciplined Parallelism.",
                    "A Hierarchical Approach to Maximizing MapReduce Efficiency.",
                    "Building Retargetable and Efficient Compilers for Multimedia Instruction Sets.",
                    "Compiler Directed Data Locality Optimization for Multicore Architectures.",
                    "CriticalFault: Amplifying Soft Error Effect Using Vulnerability-Driven Injection.",
                    "Understanding the Behavior of Pthread Applications on Non-Uniform Cache Architectures.",
                    "Exploiting Mutual Awareness between Prefetchers and On-chip Networks in Multi-cores.",
                    "Decoupled Architectures as a Low-Complexity Alternative to Out-of-order Execution.",
                    "Parameterized Micro-benchmarking: An Auto-tuning Approach for Complex Applications.",
                    "Prediction Based DRAM Row-Buffer Management in the Many-Core Era.",
                    "Program Interferometry.",
                    "Regulating Locality vs. Parallelism Tradeoffs in Multiple Memory Controller Environments.",
                    "Row-Buffer Reorganization: Simultaneously Improving Performance and Reducing Energy in DRAMs.",
                    "Scalable Proximity-Aware Cache Replication in Chip Multiprocessors.",
                    "Scalable and Efficient Bounds Checking for Large-Scale CMP Environments.",
                    "An Alternative Memory Access Scheduling in Manycore Accelerators.",
                    "Beforehand Migration on D-NUCA Caches.",
                    "SymptomTM: Symptom-Based Error Detection and Recovery Using Hardware Transactional Memory.",
                    "rPRAM: Exploring Redundancy Techniques to Improve Lifetime of PCM-based Main Memory.",
                    "Pi-TM: Pessimistic Invalidation for Scalable Lazy Hardware Transactional Memory.",
                    "MCFQ: Leveraging Memory-level Parallelism and Application's Cache Friendliness for Efficient Management of Quasi-partitioned Last-level Caches.",
                    "MRAC: A Memristor-based Reconfigurable Framework for Adaptive Cache Replacement.",
                    "Sampling Temporal Touch Hint (STTH) Inclusive Cache Management Policy.",
                    "Exploiting Rank Idle Time for Scheduling Last-Level Cache Writeback.",
                    "TIDeFlow: A Parallel Execution Model for High Performance Computing Programs.",
                    "Decoupled Cache Segmentation: Mutable Policy with Automated Bypass.",
                    "A Software-Managed Coherent Memory Architecture for Manycores.",
                    "Improving Last-Level Cache Performance by Exploiting the Concept of MRU-Tour.",
                    "A Compiler-assisted Runtime-prefetching Scheme for Heterogenous Platforms.",
                    "Improving Run-Time Scheduling for General-Purpose Parallel Code.",
                    "Collaborative Caching for Unknown Cache Sizes.",
                    "Programming Strategies for GPUs and their Power Consumption.",
                    "An Architecture to Enable Lifetime Full Chip Testability in Chip Multiprocessors.",
                    "Probabilistic Models Towards Optimal Speculation of DFA Applications.",
                    "STM2: A Parallel STM for High Performance Simultaneous Multithreading Systems.",
                    "Making STMs Cache Friendly with Compiler Transformations.",
                    "Enhancing Data Locality for Dynamic Simulations through Asynchronous Data Transformations and Adaptive Control.",
                    "SFMalloc: A Lock-Free and Mostly Synchronization-Free Dynamic Memory Allocator for Manycores.",
                    "Coherent Profiles: Enabling Efficient Reuse Distance Analysis of Multicore Scaling for Loop-based Parallel Programs.",
                    "StVEC: A Vector Instruction Extension for High Performance Stencil Computation.",
                    "OpenMDSP: Extending OpenMP to Program Multi-Core DSP.",
                    "ARIADNE: Agnostic Reconfiguration in a Disconnected Network Environment.",
                    "Correctly Treating Synchronizations in Compiling Fine-Grained SPMD-Threaded Programs for CPU.",
                    "Divergence Analysis and Optimizations.",
                    "Large Scale Verification of MPI Programs Using Lamport Clocks with Lazy Update.",
                    "DiDi: Mitigating the Performance Impact of TLB Shootdowns Using a Shared TLB Directory.",
                    "Linear-time Modeling of Program Working Set in Shared Cache.",
                    "Using a Reconfigurable L1 Data Cache for Efficient Version Management in Hardware Transactional Memory.",
                    "An Evaluation of Vectorizing Compilers.",
                    "Modeling and Performance Evaluation of TSO-Preserving Binary Optimization.",
                    "Exploiting Task Order Information for Optimizing Sequentially Consistent Java Programs.",
                    "Memory Architecture for Integrating Emerging Memory Technologies.",
                    "Speculative Parallelization in Decoupled Look-ahead.",
                    "Optimizing Regular Expression Matching with SR-NFA on Multi-Core Systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "19th PACT 2010",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2010",
                "sub_name": "19th International Conference on Parallel Architectures and Compilation Techniques, PACT 2010, Vienna, Austria, September 11-15, 2010.",
                "count": 70,
                "papers": [
                    "Build Watson: an overview of DeepQA for the Jeopardy! challenge.",
                    "Towards a science of parallel programming.",
                    "Raising the level of many-core programming with compiler technology: meeting a grand challenge.",
                    "Power and thermal characterization of POWER6 system.",
                    "System-level max power (SYMPO): a systematic approach for escalating system-level power consumption using synthetic benchmarks.",
                    "Scalable thread scheduling and global power management for heterogeneous many-core architectures.",
                    "Dynamically managed multithreaded reconfigurable architectures for chip multiprocessors.",
                    "Accelerating multicore reuse distance analysis with sampling and parallelization.",
                    "Simple and fast biased locks.",
                    "Avoiding deadlock avoidance.",
                    "DAFT: decoupled acyclic fault tolerance.",
                    "WAYPOINT: scaling coherence to thousand-core architectures.",
                    "Subspace snooping: filtering snoops with operating system support.",
                    "Proximity coherence for chip multiprocessors.",
                    "SPACE: sharing pattern-based directory coherence for multicore scalability.",
                    "Feedback-directed pipeline parallelism.",
                    "Scalable hardware support for conditional parallelization.",
                    "Reducing task creation and termination overhead in explicitly parallel programs.",
                    "MEDICS: ultra-portable processing for medical image reconstruction.",
                    "An OpenCL framework for heterogeneous multicores with local memory.",
                    "Twin peaks: a software platform for heterogeneous computing on general-purpose and graphics processors.",
                    "MapCG: writing parallel program portable between CPU and GPU.",
                    "Adaptive spatiotemporal node selection in dynamic networks.",
                    "On mitigating memory bandwidth contention through bandwidth-aware scheduling.",
                    "AKULA: a toolset for experimenting and developing thread placement algorithms on multicore systems.",
                    "Criticality-driven superscalar design space exploration.",
                    "A programmable parallel accelerator for learning and classification.",
                    "Discovering and understanding performance bottlenecks in transactional applications.",
                    "Efficient sequential consistency using conditional fences.",
                    "Partitioning streaming parallelism for multi-cores: a machine learning based approach.",
                    "Handling the problems and opportunities posed by multiple on-chip memory controllers.",
                    "Design and implementation of the PLUG architecture for programmable and efficient network lookups.",
                    "A model for fusion and code motion in an automatic parallelizing compiler.",
                    "Ocelot: a dynamic optimization framework for bulk-synchronous applications in heterogeneous systems.",
                    "An empirical characterization of stream programs and its implications for language and compiler design.",
                    "Semi-automatic extraction and exploitation of hierarchical pipeline parallelism using profiling information.",
                    "The Paralax infrastructure: automatic parallelization with a helping hand.",
                    "AM++: a generalized active message framework.",
                    "Using memory mapping to support cactus stacks in work-stealing runtime systems.",
                    "Speculative-aware execution: a simple and efficient technique for utilizing multi-cores to improve single-thread performance.",
                    "The potential of using dynamic information flow analysis in data value prediction.",
                    "Efficient runahead threads.",
                    "Energy efficient speculative threads: dynamic thread allocation in Same-ISA heterogeneous multicore systems.",
                    "SWEL: hardware cache coherence protocols to map shared data onto shared caches.",
                    "ATAC: a 1000-core cache-coherent processor with on-chip optical network.",
                    "Using dead blocks as a virtual victim cache.",
                    "Compiler-assisted data distribution for chip multiprocessors.",
                    "Data layout transformation exploiting memory-level parallelism in structured grid many-core applications.",
                    "Tiled-MapReduce: optimizing resource usages of data-parallel applications on multicore with tiling.",
                    "On-chip network design considerations for compute accelerators.",
                    "Believe it or not!: mult-core CPUs can match GPU performance for a FLOP-intensive application!",
                    "Ordered and unordered algorithms for parallel breadth first search.",
                    "Moths: mobile threads for on-chip networks.",
                    "Improving speculative loop parallelization via selective squash and speculation reuse.",
                    "Revisiting sorting for GPGPU stream architectures.",
                    "Analyzing cache performance bottlenecks of STM applications and addressing them with compiler's help.",
                    "An intra-tile cache set balancing scheme.",
                    "StatCC: a statistical cache contention model.",
                    "An integer programming framework for optimizing shared memory use on GPUs.",
                    "Exploiting subtrace-level parallelism in clustered processors.",
                    "A case for NUMA-aware contention management on multicore systems.",
                    "DMATiler: revisiting loop tiling for direct memory access.",
                    "Scaling of the PARSEC benchmark inputs.",
                    "Online cache modeling for commodity multicore processors.",
                    "NoC-aware cache design for chip multiprocessors.",
                    "A software-SVM-based transactional memory for multicore accelerator architectures with local memory.",
                    "NUcache: a multicore cache organization based on next-use distance.",
                    "CoreGenesis: erasing core boundaries for robust and configurable performance.",
                    "Automatic vector instruction selection for dynamic compilation.",
                    "Approximating age-based arbitration in on-chip networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "18th PACT 2009",
        "info": "Raleigh, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2009",
                "sub_name": "PACT 2009, Proceedings of the 18th International Conference on Parallel Architectures and Compilation Techniques, 12-16 September 2009, Raleigh, North Carolina, USA.",
                "count": 34,
                "papers": [
                    "Adaptive Locks: Combining Transactions and Locks for Efficient Concurrency.",
                    "Anaphase: A Fine-Grain Thread Decomposition Scheme for Speculative Multithreading.",
                    "Characterizing the TLB Behavior of Emerging Parallel Workloads on Chip Multiprocessors.",
                    "Interprocedural Load Elimination for Dynamic Optimization of Parallel Programs.",
                    "Quantifying the Potential of Program Analysis Peripherals.",
                    "Algorithmic Skeletons within an Embedded Domain Specific Language for the CELL Processor.",
                    "A Task-Centric Memory Model for Scalable Accelerator Architectures.",
                    "SHIP: Scalable Hierarchical Power Control for Large-Scale Data Centers.",
                    "Exploring Phase Change Memory and 3D Die-Stacking for Power/Thermal Friendly, Fast and Durable Memory Architectures.",
                    "Core-Selectability in Chip Multiprocessors.",
                    "Chainsaw: Using Binary Matching for Relative Instruction Mix Comparison.",
                    "tm_db: A Generic Debugging Library for Transactional Programs.",
                    "StealthTest: Low Overhead Online Software Testing Using Transactional Memory.",
                    "CPROB: Checkpoint Processing with Opportunistic Minimal Recovery.",
                    "Architecture Support for Improving Bulk Memory Copying and Initialization Performance.",
                    "Oblivious Routing in On-Chip Bandwidth-Adaptive Networks.",
                    "Exploiting Parallelism with Dependence-Aware Scheduling.",
                    "ITCA: Inter-task Conflict-Aware CPU Accounting for CMPs.",
                    "Flextream: Adaptive Compilation of Streaming Applications for Heterogeneous Architectures.",
                    "DDCache: Decoupled and Delegable Cache Data and Metadata.",
                    "Zero-Value Caches: Cancelling Loads that Return Zero.",
                    "Soft-OLP: Improving Hardware Cache Performance through Software-Controlled Object-Level Partitioning.",
                    "Memory Performance and Cache Coherency Effects on an Intel Nehalem Multiprocessor System.",
                    "Automatic Tuning of Discrete Fourier Transforms Driven by Analytical Modeling.",
                    "Analytical Modeling of Pipeline Parallelism.",
                    "FASTM: A Log-based Hardware Transactional Memory with Fast Abort Recovery.",
                    "Improving Signatures by Locality Exploitation for Transactional Memory.",
                    "Mapping Out a Path from Hardware Transactional Memory to Speculative Multithreading.",
                    "Polyhedral-Model Guided Loop-Nest Auto-Vectorization.",
                    "Region Based Structure Layout Optimization by Selective Data Copying.",
                    "Data Layout Transformation for Enhancing Data Locality on NUCA Chip Multiprocessors.",
                    "SOS: A Software-Oriented Distributed Shared Cache Management Approach for Chip Multiprocessors.",
                    "Using Aggressor Thread Information to Improve Shared Cache Management for CMPs.",
                    "Cache Sharing Management for Performance Fairness in Chip Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "17th PACT 2008",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2008",
                "sub_name": "17th International Conference on Parallel Architectures and Compilation Techniques, PACT 2008, Toronto, Ontario, Canada, October 25-29, 2008.",
                "count": 32,
                "papers": [
                    "GPU evolution: will graphics morph into compute?",
                    "Outer-loop vectorization: revisited for short SIMD architectures.",
                    "Redundancy elimination revisited.",
                    "Exploiting loop-dependent stream reuse for stream processors.",
                    "Feature selection and policy optimization for distributed instruction placement using reinforcement learning.",
                    "Core cannibalization architecture: improving lifetime chip performance for multicore processors in the presence of hard faults.",
                    "Pangaea: a tightly-coupled IA32 heterogeneous chip multiprocessor.",
                    "Skewed redundancy.",
                    "The PARSEC benchmark suite: characterization and architectural implications.",
                    "Visualizing potential parallelism in sequential programs.",
                    "Characterizing and modeling the behavior of context switch misses.",
                    "MCAMP: communication optimization on massively parallel machines with hierarchical scratch-pad memory.",
                    "Profiler and compiler assisted adaptive I/O prefetching for shared storage caches.",
                    "Runtime optimization of vector operations on large scale SMP clusters.",
                    "(How) can programmers conquer the multicore menace?",
                    "Distributed cooperative caching.",
                    "Scalable and reliable communication for hardware transactional memory.",
                    "Improving support for locality and fine-grain sharing in chip multiprocessors.",
                    "Edge-centric modulo scheduling for coarse-grained reconfigurable architectures.",
                    "Multi-optimization power management for chip multiprocessors.",
                    "Multitasking workload scheduling on flexible-core chip multiprocessors.",
                    "Leveraging on-chip networks for data cache migration in chip multiprocessors.",
                    "Adaptive insertion policies for managing shared caches.",
                    "Analysis and approximation of optimal co-scheduling on chip multiprocessors.",
                    "An adaptive resource partitioning algorithm for SMT processors.",
                    "Meeting points: using thread criticality to adapt multicore hardware to parallel regions.",
                    "Prediction models for multi-dimensional power-performance optimization on many cores.",
                    "Mars: a MapReduce framework on graphics processors.",
                    "Multi-mode energy management for multi-tier server clusters.",
                    "A tuning framework for software-managed memory hierarchies.",
                    "Hybrid access-specific software cache techniques for the cell BE architecture.",
                    "COMIC: a coherent shared memory interface for cell be."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "16th PACT 2007",
        "info": "Brasov, Romania",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2007",
                "sub_name": "16th International Conference on Parallel Architectures and Compilation Techniques (PACT 2007), Brasov, Romania, September 15-19, 2007.",
                "count": 68,
                "papers": [
                    "Architectural Support for the Stream Execution Model on General-Purpose Processors.",
                    "A Flexible Heterogeneous Multi-Core Architecture.",
                    "Improving Performance Isolation on Chip Multiprocessors via an Operating System Scheduler.",
                    "Software-Pipelining on Multi-Core Architectures.",
                    "Speculative Decoupled Software Pipelining.",
                    "Rotating Register Allocation for Enhanced Pipeline Scheduling.",
                    "Unified Architectural Support for Soft-Error Protection or Software Bug Detection.",
                    "Verification-Aware Microprocessor Design.",
                    "I2SEMS: Interconnects-Independent Security Enhanced Shared Memory Multiprocessor Systems.",
                    "Error Detection Using Dynamic Dataflow Verification.",
                    "Extending Object-Oriented Optimizations for Concurrent Programs.",
                    "Language and Virtual Machine Support for Efficient Fine-Grained Futures in Java.",
                    "Call-chain Software Instruction Prefetching in J2EE Server Applications.",
                    "Detecting Change in Program Behavior for Adaptive Optimization.",
                    "Reducing Energy Consumption of On-Chip Networks Through a Hybrid Compiler-Runtime Approach.",
                    "An Energy Efficient Parallel Architecture Using Near Threshold Operation.",
                    "AA-Sort: A New Parallel Sorting Algorithm for Multi-Core SIMD Processors.",
                    "The Fault Tolerant Parallel Algorithm: the Parallel Recomputing Based Failure Recovery.",
                    "Paceline: Improving Single-Thread Performance in Nanoscale CMPs through Core Overclocking.",
                    "Early Register Release for Out-of-Order Processors with RegisterWindows.",
                    "L1 Cache Filtering Through Random Selection of Memory References.",
                    "Effective Management of DRAM Bandwidth in Multicore Processors.",
                    "A Loop Correlation Technique to Improve Performance Auditing.",
                    "Latency Hiding in Multi-Threading and Multi-Processing of Network Applications.",
                    "Introducing Control Flow into Vectorized Code.",
                    "Automatic Correction of Loop Transformations.",
                    "FAME: FAirly MEasuring Multithreaded Architectures.",
                    "CIGAR: Application Partitioning for a CPU/Coprocessor Architecture.",
                    "Using PredictiveModeling for Cross-Program Design Space Exploration in Multicore Systems.",
                    "CacheScouts: Fine-Grain Monitoring of Shared Caches in CMP Platforms.",
                    "Component-Based Lock Allocation.",
                    "JudoSTM: A Dynamic Binary-Rewriting Approach to Software Transactional Memory.",
                    "The OpenTM Transactional Application Programming Interface.",
                    "A Study of a Transactional Parallel Routing Algorithm.",
                    "Ring Prediction for Non-Uniform Cache Architectures.",
                    "Source Level Merging of Independent Programs.",
                    "Studying the impact of synchronization frequency on scheduling tasks with dependencies in heterogeneous systems.",
                    "Fast prototyping of complex Signal and Image Processing applications on SoC using homogenous network of communicating processors.",
                    "Stream Scheduling: A Framework to Manage Bulk Operations in a Memory Hierarchy.",
                    "Studying Compiler-Microarchitecture Interactions through Interval Analysis.",
                    "FastForward for Efficient Pipeline Parallelism.",
                    "The Automatic Transformation of Linked List Data Structures.",
                    "Trace-based Automatic Padding for Locality Improvement with Correlative Data Visualization Interface.",
                    "A New Parallel Gauss-Seidel Method by Iteration Space Alternate Tiling.",
                    "Performance Portable Optimizations for Loops Containing Communication Operations.",
                    "Exploring the Application Behavior Space Using Parameterized Synthetic Benchmarks.",
                    "Studying Asynchronous Shared Memory Computations.",
                    "Fast Track: Supporting Unsafe Optimizations with Software Speculation.",
                    "Hybrid Specialization: A Trade-off Between Static and Dynamic Specialization.",
                    "Rate-Driven Control of Resizable Caches for Highly Threaded SMT Processors.",
                    "Redesigning Parallel Symbolic Computations Packages.",
                    "MLP-Aware Dynamic Cache Partitioning.",
                    "A Lightweight Model for Software Thread-Level Speculation (TLS).",
                    "HelperCore_DB: Exploiting Multicore Technology for Databases.",
                    "Data Structure Exploration of Dynamic Applications.",
                    "Dynamic Cache Placement with Two-level Mapping to Reduce Conflict Misses.",
                    "Runahead Threads: Reducing Resource Contention in SMT Processors.",
                    "Reducing the Impact of Process Variability with Prefetching and Criticality-Based Resource Allocation.",
                    "Drug Design on the Cell BroadBand Engine.",
                    "Bridging Inputs and Program Dynamic Behavior.",
                    "Power-Aware Compiler Controllable Chip Multiprocessor.",
                    "RSTM : A Relaxed Consistency Software Transactional Memory for Multicores.",
                    "VB-MT: Design Issues and Performance of the Validation Buffer Microarchitecture for Multithreaded Processors.",
                    "A Scalable Low Power Store Queue for Large InstructionWindow Processors.",
                    "Adapting to Intermittent Faults in Future Multicore Systems.",
                    "A Phase-Adaptive Approach to Increasing Cache Performance.",
                    "Compiler Optimizations for Fault Tolerance Software Checking.",
                    "Optimizing Bandwidth Constraint through Register Interconnection for Stream Processors."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "15th PACT 2006",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2006",
                "sub_name": "15th International Conference on Parallel Architectures and Compilation Techniques (PACT 2006), Seattle, Washington, USA, September 16-20, 2006.",
                "count": 34,
                "papers": [
                    "Experiences with MapReduce, an abstraction for large-scale computation.",
                    "Architectural support for operating system-driven CMP cache management.",
                    "Communist, utilitarian, and capitalist cache policies on CMPs: caches as a shared resource.",
                    "Core architecture optimization for heterogeneous chip multiprocessors.",
                    "Compiling for stream processing.",
                    "Region array SSA.",
                    "A two-phase escape analysis for parallel java programs.",
                    "Challenges and opportunities in the post single-thread-processor era.",
                    "Self-checking instructions: reducing instruction redundancy for concurrent error detection.",
                    "A low-cost memory remapping scheme for address bus protection.",
                    "Efficient data protection for distributed shared memory multiprocessors.",
                    "Wavelet-based phase classification.",
                    "Complexity-based program phase analysis and classification.",
                    "Performance prediction based on inherent program similarity.",
                    "Deep computing in biology: challenges and progress.",
                    "Hardware support for spin management in overcommitted virtual machines.",
                    "Testing implementations of transactional memory.",
                    "Efficient emulation of hardware prefetchers via event-driven helper threading.",
                    "DEP: detailed execution profile.",
                    "Whole-program optimization of global variable layout.",
                    "Fast, automatic, procedure-level performance tuning.",
                    "Reducing control overhead in dataflow architectures.",
                    "Power-efficient instruction delivery through trace reuse.",
                    "Branch predictor guided instruction decoding.",
                    "Two-level mapping based cache index selection for packet forwarding engines.",
                    "Program generation for the all-pairs shortest path problem.",
                    "Combining analytical and empirical approaches in tuning matrix transposition.",
                    "Processor architecture: too much parallelism?",
                    "Adaptive reorder buffers for SMT processors.",
                    "SEED: scalable, efficient enforcement of dependences.",
                    "SPARTAN: speculative avoidance of register allocations to transient values for performance and energy efficiency.",
                    "Overlapping dependent loads with addressless preload.",
                    "Prematerialization: reducing register pressure for free.",
                    "An empirical evaluation of chains of recurrences for array dependence testing."
                ]
            },
            {
                "sub_name_abbr": "conf/medea/2006",
                "sub_name": "Proceedings of the 2006 workshop on MEmory performance - DEaling with Applications, systems and architectures, MEDEA '06, Seattle, Washington, USA, September 16-20, 2006.",
                "count": 6,
                "papers": [
                    "Analyzing block locality in Morton-order and Morton-hybrid matrices.",
                    "Investigating cache energy and latency break-even points in high performance processors.",
                    "Evaluating instruction cache vulnerability to transient errors.",
                    "A simple speculative load control mechanism for energy saving.",
                    "Data prefetching in a cache hierarchy with high bandwidth and capacity.",
                    "An LRU-based replacement algorithm augmented with frequency of access in shared chip-multiprocessor caches."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "14th PACT 2005",
        "info": "Saint Louis, MO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2005",
                "sub_name": "14th International Conference on Parallel Architectures and Compilation Techniques (PACT 2005), 17-21 September 2005, St. Louis, MO, USA.",
                "count": 37,
                "papers": [
                    "Message from the General Chair.",
                    "Message from the Program Chair.",
                    "Tutorials and Workshops.",
                    "Committees.",
                    "Reviewers.",
                    "Multi-Core to the Masses.",
                    "Variational Path Profiling.",
                    "Extended Whole Program Paths.",
                    "Instruction Based Memory Distance Analysis and its Application.",
                    "HPS: Hybrid Profiling Support.",
                    "Maximizing CMP Throughput with Mediocre Cores.",
                    "Characterization of TCC on Chip-Multiprocessors.",
                    "Store-Ordered Streaming of Shared Memory.",
                    "An Event-Driven Multithreaded Dynamic Optimization Framework.",
                    "Design and Implementation of a Compiler Framework for Helper Threading on Multi-core Processors.",
                    "Compiler Directed Early Register Release.",
                    "Automatic Selection of Compiler Options Using Non-parametric Inferential Statistics.",
                    "Data Centric Transformations on Non-Integer Iteration Spaces.",
                    "Efficient Techniques for Advanced Data Dependence Analysis.",
                    "Parallel Programming and Parallel Abstractions in Fortress.",
                    "Optimizing Compiler for the CELL Processor.",
                    "Exploiting Coarse-Grained Parallelism to Accelerate Protein Motif Finding with a Network Processor.",
                    "Automatic Tuning Matrix Multiplication Performance on Graphics Hardware.",
                    "A Distributed Control Path Architecture for VLIW Processors.",
                    "Variable-Based Multi-module Data Caches for Clustered VLIW Processors.",
                    "Performance Analysis of System Overheads in TCP/IP Workloads.",
                    "Dual-Core Execution: Building a Highly Scalable Single-Thread Instruction Window.",
                    "A Simple Divide-and-Conquer Approach for Neural-Class Branch Prediction.",
                    "Trace Cache Sampling Filter.",
                    "Communication Optimizations for Fine-Grained UPC Applications.",
                    "HUNTing the Overlap.",
                    "Deep Jam: Conversion of Coarse-Grain Parallelism to Instruction-Level and Vector Parallelism for Irregular Applications.",
                    "Memory State Compressors for Giga-Scale Checkpoint/Restore.",
                    "Exploiting Coarse-Grain Verification Parallelism for Power-Efficient Fault Tolerance.",
                    "Memory Coloring: A Compiler Approach for Scratchpad Memory Management.",
                    "Multiple Page Size Modeling and Optimization.",
                    "Future Execution: A Hardware Prefetching Technique for Chip Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "13th PACT 2004",
        "info": "Antibes Juan-les-Pins, France",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2004",
                "sub_name": "13th International Conference on Parallel Architectures and Compilation Techniques (PACT 2004), 29 September - 3 October 2004, Antibes Juan-les-Pins, France.",
                "count": 25,
                "papers": [
                    "Code Generation in the Polyhedral Model Is Easier Than You Think.",
                    "A Compiler Framework for Recovery Code Generation in General Speculative Optimizations.",
                    "A Multi-Platform Co-Array Fortran Compiler.",
                    "Retargeting JIT Compilers by using C-Compiler Generated Executable Code.",
                    "Adding Limited Reconfigurability to Superscalar Processors.",
                    "Architectural Support for Enhanced SMT Job Scheduling.",
                    "Static Placement, Dynamic Issue (SPDI) Scheduling for EDGE Architectures.",
                    "A High-Performance SIMD Floating Point Unit for BlueGene/L: Architecture, Compilation, and Algorithm Design.",
                    "Impact of Java Memory Model on Out-of-Order Multiprocessors.",
                    "Fair Cache Sharing and Partitioning in a Chip Multiprocessor Architecture.",
                    "Architectural Support for High Speed Protection of Memory Integrity and Confidentiality in Multiprocessor Systems.",
                    "AC/DC: An Adaptive Data Cache Prefetcher.",
                    "The Earth Simulator and Beyond-Technological Considerations Toward the Sustained PetaFlops Machine.",
                    "The Energy Impact of Aggressive Loop Fusion.",
                    "Scalable High Performance Cross-Module Inlining.",
                    "Decoupled Software Pipelining with the Synchronization Array.",
                    "Fast Paths in Concurrent Programs.",
                    "Compiler Estimation of Load Imbalance Overhead in Speculative Parallelization.",
                    "Implementing Malleability on MPI Jobs.",
                    "Partitioning of Code for a Massively Parallel Machine.",
                    "Polymorphic Processors: How to Expose Arbitrary Hardware Functionality to Programmers.",
                    "The Value Evolution Graph and its Use in Memory Reference Analysis.",
                    "TO-Lock: Removing Lock Overhead Using the Owners' Temporal Locality.",
                    "The Stream Virtual Machine.",
                    "An Adaptive Algorithm Selection Framework."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "12th PACT 2003",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2003",
                "sub_name": "12th International Conference on Parallel Architectures and Compilation Techniques (PACT 2003), 27 September - 1 October 2003, New Orleans, LA, USA.",
                "count": 26,
                "papers": [
                    "Constraint Graph Analysis of Multithreaded Programs.",
                    "The Impact of Resource Partitioning on SMT Processors.",
                    "Initial Observations of the Simultaneous Multithreading Pentium 4 Processor.",
                    "Efficient Resource Management during Instruction Scheduling for the EPIC Architecture.",
                    "Instruction Replication: Reducing Delays Due to Inter-PE Communication Latency.",
                    "Y-Branches: When You Come to a Fork in the Road, Take It.",
                    "Optimizing Program Locality Through CMEs and GAs.",
                    "Miss Rate Prediction across All Program Inputs.",
                    "Compiler-Directed Content-Aware Prefetching for Dynamic Data Structures.",
                    "Challenges and New Approaches to Program Analysis.",
                    "Combining Program Recovery, Auto-Parallelisation and Locality Analysis for C Programs on Multi-Processor Embedded Systems.",
                    "Inter-Procedural Loop Fusion, Array Contraction and Rotation.",
                    "Spill Code Minimization by Spill Code Motion.",
                    "Compilation, Architectural Support, and Evaluation of SIMD Graphics Pipeline Programs on a General-Purpose CPU.",
                    "An Efficient Online Path Profiling Framework for Java Just-In-Time Compilers.",
                    "Compressing Extended Program Traces Using Value Predictors.",
                    "Using Software Logging to Support Multi-Version Buffering in Thread-Level Speculation.",
                    "Reactive Multi-Word Synchronization for Multiprocessors.",
                    "Design Trade-Offs in High-Throughput Coherence Controllers.",
                    "Memory Hierarchy Design for a Multiprocessor Look-up Engine.",
                    "Biomedical Computing and Visualization.",
                    "Characterizing and Predicting Program Behavior and its Variability.",
                    "Redeeming IPC as a Performance Metric for Multithreaded Programs.",
                    "Picking Statistically Valid and Early Simulation Points.",
                    "Reducing Datapath Energy through the Isolation of Short-Lived Operands.",
                    "Resolving Register Bank Conflicts for a Network Processor."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "11th PACT 2002",
        "info": "Charlottesville, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2002",
                "sub_name": "2002 International Conference on Parallel Architectures and Compilation Techniques (PACT 2002), 22-25 September 2002, Charlottesville, VA, USA.",
                "count": 29,
                "papers": [
                    "Parallelism in Mainstream Enterprise Platforms of the Future.",
                    "An Evaluation of Data-Parallel Compiler Support for Line-Sweep Applications.",
                    "Increasing and Detecting Memory Address Congruence.",
                    "Transparent Threads: Resource Sharing in SMT Processors for High Single-Thread Performance.",
                    "Compiler-Controlled Caching in Superword Register Files for Multimedia Extension Architectures.",
                    "Effective Compilation Support for Variable Instruction Set Architecture.",
                    "A Framework for Parallelizing Load/Stores on Embedded Processors.",
                    "Workload Design: Selecting Representative Program-Input Pairs.",
                    "Dataflow Frequency Analysis Based on Whole Program Paths.",
                    "Quantifying Instruction Criticality.",
                    "The Role of Computational Science in Energy Efficiency and Renewable Energy.",
                    "Application Transformations for Energy and Performance-Aware Device Management.",
                    "Leakage Energy Management in Cache Hierarchies.",
                    "Integrating Adaptive On-Chip Storage Structures for Reduced Dynamic Power.",
                    "The Use of Prediction for Accelerating Upgrade Misses in cc-NUMA Multiprocessors.",
                    "Predicting Conditional Branches With Fusion-Based Hybrid Predictors.",
                    "Speculative Sequential Consistency with Little Custom Storage.",
                    "Cost-Effective Compiler Directed Memory Prefetching and Bypassing.",
                    "Using the Compiler to Improve Cache Replacement Decisions.",
                    "Software Bubbles: Using Predication to Compensate for Aliasing in Software Pipelines.",
                    "Speculative Alias Analysis for Executable Code.",
                    "Cost Effective Memory Dependence Prediction using Speculation Levels and Color Sets.",
                    "The Computational Grid: Aggregating Performance and Enhanced Capability from Federated Resources.",
                    "Just-In-Time Java? Compilation for the Itanium® Processor.",
                    "Eliminating Exception Constraints of Java Programs for IA-64.",
                    "Optimizing Loop Performance for Clustered VLIW Architectures.",
                    "Exploiting Pseudo-Schedules to Guide Data Dependence Graph Partitioning.",
                    "Efficient Interconnects for Clustered Microarchitectures.",
                    "SIGARCH Conference Guidelines."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "10th PACT 2001",
        "info": "Barcelona, Catalunya, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2001",
                "sub_name": "2001 International Conference on Parallel Architectures and Compilation Techniques (PACT 2001), 8-12 September 2001, Barcelona, Spain.",
                "count": 26,
                "papers": [
                    "Basic Block Distribution Analysis to Find Periodic Behavior and Simulation Points in Applications.",
                    "Modeling Superscalar Processors via Statistical Simulation.",
                    "Hybrid Analytical-Statistical Modeling for Efficiently Exploring Architecture and Workload Design Spaces.",
                    "Filtering Techniques to Improve Trace-Cache Efficiency.",
                    "Reactive-Associative Caches.",
                    "Adaptive Mode Control: A Static-Power-Efficient Cache Design.",
                    "Implementation and Evaluation of the Complex Streamed Instruction Set.",
                    "On the Efficiency of Reductions in µ-SIMD Media Extensions.",
                    "Boolean Formula-Based Branch Prediction for Future Technologies.",
                    "Using Dataflow Based Context for Accurate Value Prediction.",
                    "Recovery Mechanism for Latency Misprediction.",
                    "A Cost Framework for Evaluating Integrated Restructuring Optimizations.",
                    "Compiling for the Impulse Memory Controller.",
                    "On the Stability of Temporal Data Reference Profiles.",
                    "Code Reordering and Speculation Support for Dynamic Optimization System.",
                    "A Unified Modulo Scheduling and Register Allocation Technique for Clustered Processors.",
                    "Cache-Friendly Implementations of Transitive Closure.",
                    "Exploring the Design Space of Future CMPs.",
                    "Area and System Clock Effects on SMT/CMP Processors.",
                    "Limits on Speculative Module-Level Parallelism in Imperative and Object-Oriented Programs on CMP Platforms.",
                    "Compiler and Runtime Analysis for Efficient Communication in Data Intensive Applications.",
                    "Architectural Support for Parallel Reductions in Scalable Shared-Memory Multiprocessors.",
                    "Optimizing Software Data Prefetches with Rotating Registers.",
                    "Multi-Chain Prefetching: Effective Exploitation of Inter-Chain Memory Parallelism for Pointer-Chasing Codes.",
                    "Data Flow Analysis for Software Prefetching Linked Data Structures in Java.",
                    "Comparing and Combining Read Miss Clustering and Software Prefetching."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "9th PACT 2000",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/2000",
                "sub_name": "Proceedings of the 2000 International Conference on Parallel Architectures and Compilation Techniques (PACT'00), Philadelphia, Pennsylvania, USA, October 15-19, 2000.",
                "count": 29,
                "papers": [
                    "Register Queues: A New Hardware/Software Approach to Efficient Software Pipelining.",
                    "Global Register Partitioning.",
                    "Region Formation Analysis with Demand-Driven Inlining for Region-Based Optimization.",
                    "aSOC: A Scalable, Single-Chip Communications Architecture.",
                    "Address Partitioning in DSM Clusters with Parallel Coherence Controllers.",
                    "Custom Wide Counterflow Pipelines for High-Performance Embedded Applications.",
                    "A Lightweight Algorithm for Dynamic If-Conversion during Dynamic Optimization.",
                    "Exploring the Limits of Sub-Word Level Parallelism.",
                    "The Dynamic Trace Memorization Reuse Technique.",
                    "Exploring Sub-Block Value Reuse for Superscalar Processors.",
                    "Hiding Relaxed Memory Consistency with Compilers.",
                    "Neighborhood Prefetching on Multiprocessors Using Instruction History.",
                    "Characterization of Silent Stores.",
                    "On Some Implementation Issues for Value Prediction on Wide-Issue ILP Processors.",
                    "A Unified Compiler Framework for Control and Data Speculation.",
                    "Applying Data Speculation in Modulo Scheduled Loops.",
                    "Branch Prediction in Multi-Threaded Processors.",
                    "The Effect of Code Reordering on Branch Prediction.",
                    "A Taxonomy of Branch Mispredictions, and Alloyed Prediction as a Robust Solution to Wrong-History Mispredictions.",
                    "Dynamic Branch Prediction for a VLIW Processor.",
                    "Fine Grained Multithreading with Process Calculi.",
                    "Data Relation Vectors: A New Abstraction for Data Optimizations.",
                    "Combined Selection of Tile Sizes and Unroll Factors Using Iterative Compilation.",
                    "Faster FFTs via Architecture-Cognizance.",
                    "Hybrid Parallel Circuit Simulation Approaches.",
                    "Multithreaded Programming of PC Clusters.",
                    "A Fast Algorithm for Scheduling Instructions with Deadline Constraints on RISC Processors.",
                    "Instruction Scheduling for Clustered VLIW DSPs.",
                    "Efficient Backtracking Instruction Schedulers."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "8th PACT 1999",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/1999",
                "sub_name": "Proceedings of the 1999 International Conference on Parallel Architectures and Compilation Techniques, Newport Beach, California, USA, October 12-16, 1999.",
                "count": 37,
                "papers": [
                    "Exploring Instruction-Fetch Bandwidth Requirement in Wide-Issue Superscalar Processors.",
                    "MPEG-2 Video Decompression on Simultaneous Multithreaded Multimedia Processors.",
                    "A Fully Asynchronous Superscalar Architecture.",
                    "The Need for Fast Communication in Hardware-Based Speculative Chip Multiprocessors.",
                    "A Multithreaded Java Microcontroller for Thread-Oriented Real-Time Event Handling.",
                    "On Dynamic Speculative Thread Partitioning and the MEM-Slicing Algorithm.",
                    "Branch Prediction Using Selective Branch Inversion.",
                    "Control-Flow Speculation through Value Prediction for Superscalar Processors.",
                    "Exploring Last n Value Prediction.",
                    "Evaluating Register Allocation and Instruction Scheduling Techniques in Out-Of-Order Issue Processors.",
                    "Containers on the Parallelization of General-Purpose Java Programs.",
                    "The Modulo Interval: A Simple and Practical Representation for Program Analysis.",
                    "Memory System Support for Image Processing.",
                    "Performance Characteristics of a Network of Commodity Multiprocessors for the NAS Benchmarks Using a Hybrid Memory Model.",
                    "Quantifying the Benefits of SPECint Distant Parallelism in Simultaneous Multi-Threading Architectures.",
                    "High-End Computing Technology: Where is it Heading?",
                    "LaTTe: A Java VM Just-In-Time Compiler with Fast and Efficient Register Allocation.",
                    "Automatic Parallelization of Recursive Procedures.",
                    "On the Complexity of Loop Fusion.",
                    "A Cost-Effective Clustered Architecture.",
                    "Optimizing Data Locality for SCI-Based PC-Clusters with the SmiLE Monitoring Approach.",
                    "Dynamic Linking on a Shared-Memory Multiprocessor.",
                    "Reducing Cache Conflicts by Partitioning and Privatizing Shared Arrays.",
                    "Localizing Non-Affine Array References.",
                    "On Reducing False Sharing while Improving Locality on Shared Memory Multiprocessors.",
                    "Lower Bounding Techniques for the Multiprocessor Scheduling Problem with Communication Delay.",
                    "Automatic Analytical Modeling for the Estimation of Cache Misses.",
                    "Linux Alighted: Down to Earth Clusters.",
                    "Cameron: High level Language Compilation for Reconfigurable Systems.",
                    "Predicated Static Single Assignment.",
                    "The Effect of Program Optimization on Trace Cache Efficiency.",
                    "Data Dependence Testing in Practice.",
                    "On Index Set Splitting.",
                    "Efficient Parallelization Using Combined Loop and Data Transformations.",
                    "Caching and Predicting Branch Sequences for Improved Fetch Effectiveness.",
                    "In Search of Speculative Thread-Level Parallelism.",
                    "Looking at History to Filter Allocations in Prediction Tables."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "7th PACT 1998",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/1998",
                "sub_name": "Proceedings of the 1998 International Conference on Parallel Architectures and Compilation Techniques, Paris, France, October 12-18, 1998.",
                "count": 50,
                "papers": [
                    "Scanning Polyhedra without Do-loops.",
                    "Integrating Loop and Data Transformations for Global Optimization.",
                    "Optical versus Electronic Bus for Address-Transactions in Future SMP Architectures.",
                    "Origin 2000 Design Enhancements for Communication Intensive Applications.",
                    "Sirocco: Cost-Effective Fine-Grain Distributed Shared Memory.",
                    "Design Study of Shared Memory in VLIW Video Signal Processors.",
                    "Exploiting Fine- and Coarse-Grain Parallelism in Embedded Programs.",
                    "Command Vector Memory Systems: High Performance at Low Cost.",
                    "Eliminating Bottlenecks on Parallel Systems using Adaptive Objects.",
                    "Athapascan-1: On-Line Building Data Flow Graph in a Parallel Language.",
                    "General Parallel Computation can be Performed with a Cycle-Free Heap.",
                    "Code Generation in the Polytope Model.",
                    "Handling Cross Interferences by Cyclic Cache Line Coloring.",
                    "Capturing the Effects of Code Improving Transformations.",
                    "Fast, Accurate and Flexible Data Locality Analysis.",
                    "Superscalar Execution with Direct Data Forwarding.",
                    "A Fast Interrupt Handling Scheme for VLIW Processors.",
                    "Dynamic Elimination of Pointer-Expressions.",
                    "Efficacy and Performance Impact of Value Prediction.",
                    "A Fast Algorithm for Scheduling Time-Constrained Instructions on Processors with ILP.",
                    "A New Framework for Integrated Global Local Scheduling.",
                    "Exploiting Method-Level Parallelism in Single-Threaded Java Programs.",
                    "The StarT-Voyager Parallel System.",
                    "Optimistic Register Coalescing.",
                    "Efficient JavaVM Just-in-Time Compilation.",
                    "Improving Static Branch Prediction in a Compiler.",
                    "Static Methods in Hybrid Branch Prediction.",
                    "Split Last-Address Predictor.",
                    "Madeleine: An Efficient and Portable Communication Interface for RPC-Based Multithreaded Environments.",
                    "Breaking the Barriers: Two Models for MPI Programming.",
                    "Adaptive Receiver Notification for Non-Dedicated Workstation Clusters.",
                    "Performance of Message-Passing Systems using a Zero-Copy Communication Protocol.",
                    "Dynamic Hammock Predication for Non-Predicated Instruction Set Architectures.",
                    "An Direct-Execution Framework for Fast and Accurate Simulation of Superscalar Processors.",
                    "Efficient Edge Profiling for ILP-Processors.",
                    "A Matrix-Based Approach to the Global Locality Optimization Problem.",
                    "Transformations for Improving Data Access Locality in Non-Perfectly Nested Loops.",
                    "Improving Cache Behavior of Dynamically Allocated Data Structures.",
                    "Instance-Wise Reaching Definition Analysis for Recursive Programs using Context-Free Transductions.",
                    "Data Dependence Analysis of Assembly Code.",
                    "Load Balancing in Individual-Based Spatial Applications.",
                    "A New Heuristic for Scheduling Parallel Programs on Multiprocessor.",
                    "Adaptive Scheduling of Computations and Communications on Distributed Memory Systems.",
                    "Using Algebraic Transformations to Optimize Expression Evaluation in Scientific Codes.",
                    "Integrated Compilation and Scalability Analysis for Parallel Systems.",
                    "Improving Compiler and Run-Time Support for Adaptive Irregular Codes.",
                    "Parallelization of Benchmarks for Scalable Shared-Memory Multiprocessors.",
                    "Efficient Methods for Multi-Dimensional Array Redistribution.",
                    "A Multithreaded Runtime Environment with Thread Migration for a HPF Data-Parallel Compiler.",
                    "Optimized Code Generation for Heterogeneous Computing Environment using Parallelizing Compiler TINPAR."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th PACT 1997",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/1997",
                "sub_name": "Proceedings of the 1997 Conference on Parallel Architectures and Compilation Techniques (PACT '97), San Francisco, CA, USA, October 11-15, 1997.",
                "count": 27,
                "papers": [
                    "Locality Analysis for Parallel C Programs.",
                    "Heap Analysis and Optimizations for Threaded Programs.",
                    "Interprocedural Distribution Assignment Placement: More than Just Enhancing Intraprocedural Placing Techniques.",
                    "The Effect of Limited Network Bandwidth and its Utilization by Latency Hiding Techniques in Large-Scale Shared Memory Systems.",
                    "Efficient Personalized Communication on Wormhole Networks.",
                    "Empirical Evaluation of Deterministic and Adaptive Routing with Constant-Area Routers.",
                    "A Register Pressure Sensitive Instruction Scheduler for Dynamic Issue Processors.",
                    "A Parallel Algorithm for Compile-Time Scheduling of Parallel Programs on Multiprocessors.",
                    "Path Profile Guided Partial Dead Code Elimation Using Predication.",
                    "The PROMIS Compiler Prototype.",
                    "Improving the Memory Bandwidth of Highly-Integrated, Wide-Issue, Microprocessor-Based Systems.",
                    "Parallel Execution of Radix Sort Program Using Fine-Grain Communication.",
                    "Interprocedural Array Remapping.",
                    "Design of Heterogenous Multi-Processor Embedded Systems: Applying Functional Pipelining.",
                    "VLIW Across Multiple Superscalar Processors on a Single Chip.",
                    "Path Prediction for High Issue-Rate Processors.",
                    "Buffer-Safe Communication Optimization Based on Data Flow Analysis and Performance Prediction.",
                    "MDL: A Language and Compiler for Dynamic Program Instrumentation.",
                    "Optimally Synchronizing DOACROSS Loops on Shared Memory Multiprocessors.",
                    "Two Techniques for Static Array Partitioning on Message-Passing Parallel Machines.",
                    "Compiler Algorithms for Optimizing Locality and Parallelism on Shared and Distributed Memory Machines.",
                    "Effective Usage of Vector Registers in Advanced Vector Architectures.",
                    "Static Locality Analysis for Cache Management.",
                    "Overcoming Limitations of Prefetching in Multiprocessors by Compiler-Initiated Coherence Actions.",
                    "Towards a Time and Space Efficient Functional Implementation of a Monte Carlo Photon Transport Code.",
                    "Direct Generation of Data-Driven Program for Stream-Oriented Processing.",
                    "Determining the Idle Time of Tiling: New Results."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5th PACT 1996",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/1996",
                "sub_name": "Proceedings of the Fifth International Conference on Parallel Architectures and Compilation Techniques, PACT'96, Boston, MA, USA, October 20-23, 1996.",
                "count": 34,
                "papers": [
                    "Nomadic Threads: a migrating multithreaded approach to remote memory accesses in multiprocessors.",
                    "Compiling C for the EARTH multithreaded architecture.",
                    "Performance and hardware complexity tradeoffs in designing multithreaded architectures.",
                    "The superthreaded architecture: thread pipelining with run-time data dependence checking and control speculation.",
                    "Improving branch prediction accuracy by reducing pattern history table interference.",
                    "The effects of mispredicted-path execution on branch prediction structures.",
                    "Improving the effectiveness of software prefetching with adaptive executions.",
                    "Swing module scheduling: a lifetime-sensitive approach.",
                    "An efficient, global resource-directed approach to exploiting instruction-level parallelism.",
                    "The design of a modulo scheduler for a superscalar RISC processor.",
                    "Using the parallel complexity of programs to improve compaction.",
                    "Multithread execution mechanisms on RICA-1 for massively parallel computation.",
                    "I-Structure Software Cache: a split-phase transaction runtime cache system.",
                    "A heuristic approach for finding a solution to the constant-degree parallelism alignment problem.",
                    "Identifying the capability of overlapping computation with communication.",
                    "Address generation of dataflow fine-grain parallel data-structures on a distributed-memory computer.",
                    "Elastic-plastic flow simulation using the Supercomputer Toolkit.",
                    "Managing the computing space in the mpC compiler.",
                    "A robust compile time method for scheduling task parallelism on distributed memory machines.",
                    "A fine-grain multithreading superscalar architecture.",
                    "Branch prediction and simultaneous multithreading.",
                    "A compiler transformation to improve memory access time in SIMD systems.",
                    "A scalable register file architecture for dynamically scheduled processors.",
                    "Dynamic parallelization of modifications to directed acyclic graphs.",
                    "Performance tuning scientific codes for dataflow execution.",
                    "Bulk Synchronous Parallel: practical experience with a model for parallel computing.",
                    "Implementation techniques for a parallel relative debugger.",
                    "Loop induction variable canonicalization in parallelizing compilers.",
                    "Combining optimization for cache and instruction-level parallelism.",
                    "A compiler algorithm to reduce invalidation latency in virtual shared memory systems.",
                    "Adaptive granularity: transparent integration of fine- and coarse-grain communication.",
                    "Automatic partitioning of signal processing programs for symmetric multiprocessors.",
                    "Optimal fine and medium grain parallelism detection in polyhedral reduced dependence graphs.",
                    "The compiler TwoL for the design of parallel implementations."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4th PACT 1995",
        "info": "Limassol, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEpact/1995",
                "sub_name": "Proceedings of the IFIP WG10.3 working conference on Parallel architectures and compilation techniques, PACT '95, Limassol, Cyprus, June 27-29, 1995.",
                "count": 39,
                "papers": [
                    "Register allocation sensitive region scheduling.",
                    "CRAIG: a practical framework for combining instruction scheduling and register assignment.",
                    "Compiler techniques for data prefetching on the PowerPC.",
                    "Multithreading with the EM-4 distributed-memory multiprocessor.",
                    "Ordered multithreading: a novel technique for exploiting thread-level parallelism.",
                    "Increasing superscalar performance through multistreaming.",
                    "A design study of the EARTH multiprocessor.",
                    "A compiler algorithm that reduces read latency in ownership-based cache coherence protocols.",
                    "Direct-mapped versus set-associative pipelined caches.",
                    "The influence of branch prediction table interference on branch prediction scheme performance.",
                    "Using predicated execution to improve the performance of a dynamically scheduled machine with speculative execution.",
                    "Single-program speculative multithreading (SPSM) architecture: compiler-assisted fine-grained multithreading.",
                    "Analysis of communications and overhead reduction in multithreaded execution.",
                    "Control of loop parallelism in multithreaded code.",
                    "Effects of data bundling in non-strict data structures.",
                    "Practical approach to single assignment code.",
                    "A simple algorithm for the generation of efficient loop structures.",
                    "Data flow analysis of parallel programs.",
                    "Scheduling optimization through iterative refinement.",
                    "Mappings for communication minimization using distribution and alignment.",
                    "An analytical model of high performance superscalar-based multiprocessors.",
                    "Evaluating the impact of advanced memory systems on compiler-parallelized codes.",
                    "An empirical evaluation of the Convex SPP-1000 hierarchical shared memory system.",
                    "A partitioning-independent paradigm for nested data parallelism.",
                    "IPF for real-time image processing on massively parallel architectures.",
                    "Handling block-cyclic distributed arrays in Vienna Fortran 90.",
                    "Translation of serial recursive codes to parallel SIMD codes.",
                    "The meeting graph: a new model for loop cyclic register allocation.",
                    "Transformation of functional specifications of finite difference methods to parallel distributed codes.",
                    "Using compilers for heterogeneous system design.",
                    "Decomposed software pipelining with reduced register requirement.",
                    "Self-parallelization of sequential object codes.",
                    "A loop parallelization technique for linear dependence vector.",
                    "Allocating registers in multiple instruction-issuing processors.",
                    "Increasing cache bandwidth using multi-port caches for exploiting ILP in non-numerical code.",
                    "A proposal of self-cleanup cache.",
                    "Performance impact of architectural features during binary to binary translation.",
                    "Automatic generation of loop scheduling for VLIW.",
                    "From functional equations to Occam programs: systolizing compilation."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "3rd PACT 1994",
        "info": "Montréal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ifipPACT/1994",
                "sub_name": "Parallel Architectures and Compilation Techniques, Proceedings of the IFIP WG10.3 Working Conference on Parallel Architectures and Compilation Techniques, PACT'94, Montréal, Canada, 24-26 August, 1994.",
                "count": 41,
                "papers": [
                    "EM-C: Programming with Explicit Parallelism and Locality for EM-4 Multiprocessor.",
                    "A Fine-Grain Threaded Abstract Machine.",
                    "Tradeoffs in the Design of Single Chip Multiprocessors.",
                    "An Evaluation of Optimized Threaded Code Generation.",
                    "Functional I-structure, and M-structure Implementations of NAS Benchmark FT.",
                    "The Plan-Du Style Compilation Technique for Eager Data Transfer in Thread-Based Execution.",
                    "A Compiler-Assisted Scheme for Adaptive Cache Coherence Enforcement.",
                    "The Impact of Cache Coherence Protocols on Systems using Fine-Grain Data Synchronization.",
                    "Towards a Programming Environment for a Computer with Intelligent Memory.",
                    "Communication Analysis for Multicomputer Compilers.",
                    "Automatic Data Layout Using 0-1 Integer Programming.",
                    "Processor Tagged Descriptors: A Data Structure for Compiling for Distributed-Memory Multicomputers.",
                    "Resource Spackling: A Framework for Integrating Register Allocation in Local and Global Schedulers.",
                    "An Approach to Combine Predicated/Speculative Execution for Programs with Unpredictable Branches.",
                    "A PDG-based Tool and its Use in Analyzing Program Control Dependences.",
                    "Static Analysis of Barrier Synchronization in Explicitly Parallel Programs.",
                    "Exploiting the Parallelism Exposed by Partial Evaluation.",
                    "Effects of Loop Fusion and Statement Migration on the Speedup of Vector Multiprocessors.",
                    "Practical Static Mode Analyses of Concurrent Logic Languages.",
                    "Demand-Driven Dataflow for Concurrent Committed-Choice Code.",
                    "Exploitation of Fine-grain Parallelism in Logic Languages on Massively Parallel Architectures.",
                    "From SIGNAL to fine-grain parallel implementations.",
                    "Microcode Generation for Flexible Parallel Target Architectures.",
                    "A Fleng Compiler for PIE64.",
                    "Compiling Higher-Order Functions for Tagged-Dataflow.",
                    "Dataflow-Based Lenient Implementation of a Functional Language, Valid, on Conventional Multi-processors.",
                    "Dataflow and Logicflow Models for Defining a Parallel Prolog Abstract Machine.",
                    "Towards a Computational Model for UFO.",
                    "Software pipelining: A Genetic Algorithm Approach.",
                    "Parallel Compilation on Associative Computers.",
                    "Partitioning of Variables for Multiple-Register-File Architectures via Hypergraph Coloring.",
                    "Realizing Parallel Reduction Operations in Sisal 1.2.",
                    "An Introduction to Simplex Scheduling.",
                    "Speculative Evaluation for Parallel Graph Reduction.",
                    "Toward a General-Purpose Multi-Stream System.",
                    "Representing Control Flow Behaviour of Programs.",
                    "Transformations on Doubly Nested Loops.",
                    "A Comparative Study of Data-Flow Architectures.",
                    "Progress Report on Porting Sisal to the EM-4 Multiprocessor.",
                    "Static vs. Dynamic Strategies for Fine-Grain Dataflow Synchronization.",
                    "Trace Software Pipelining: A Novel Technique for Parallelization of Loops with Branches."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "2nd PACT 1993",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ifip10-3/1993",
                "sub_name": "Proceedings of the IFIP WG10.3. Working Conference on Architectures and Compilation Techniques for Fine and Medium Grain Parallelism, PACT 1993, Orlando, Florida, USA, January 20-22, 1993.",
                "count": 27,
                "papers": [
                    "Decomposed Software Pipelining: A New Approach to Exploit Instruction Level Parallelism for Loop Programs.",
                    "Software Pipelining: Petri Net Pacemaker.",
                    "Efficient Execution of Doacross Loops on Distributed Memory Systems.",
                    "Balancing Fine- and Medium-Grained Parallelism in Scheduling Loops for the XIMD Architecture.",
                    "A New Loop Partition Method-Clustering.",
                    "Flow-sensitive Interprocedural Analysis Method for Parallelization.",
                    "Code Generation for Multi-Threaded Architectures from Dataflow Graphs.",
                    "The Initial Performance of a Bottom-Up Clustering Algorithm for Dataflow Graphs.",
                    "Synchronization and Parallelism Control in the BARDE Dataflow Processor.",
                    "The Instruction Set Architecture of the Inference Processor UNIRED II.",
                    "A Functional Data-flow Architecture Dedicated to Real-time Image Processing.",
                    "DART: A Data-Driven Processor Architecture for Real-Time Computing.",
                    "Two Fundamental Limits on Dataflow Multiprocessing.",
                    "The Realities of Parallel Processing and Dataflow's Role in It: Lessons from the NASA HPCC Program.",
                    "Integrated Network Barriers for D-Dimensional Meshes.",
                    "Parallel Dimension Permutations on Star-Graph.",
                    "On the Effectiveness of Interleaved Memories for Binary Trees.",
                    "Contribution of Compilation Techniques to the Synthesis of Dedicated VLIW Architectures.",
                    "Selective Scheduling Framework for Speculative Operations in VLIW and Superscalar Processors.",
                    "URSA: A Unified ReSource Allocator for Registers and Functional Units in VLIW Architectures.",
                    "Data Flow Computing and the Conjugate Gradient Method.",
                    "Results of Parallel Implementations of the Selection Problem Using Sisal.",
                    "A Parallel Implementation of the Traveling Salesman Problem on a Sequent Symmetry Mulitprocessor.",
                    "Exploring the Stream Data Type in SISAL and Other Languages.",
                    "Mulitdimensional Streams Rooted in Dataflow.",
                    "High Level Compiling for Low Level Machines.",
                    "Modeling Instruction-Level Parallelism for Software Pipelining."
                ]
            }
        ]
    }
]