[
    {
        "year": "2021",
        "name": "40th PODC 2021",
        "info": "Virtual Event, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2021",
                "sub_name": "PODC '21: ACM Symposium on Principles of Distributed Computing, Virtual Event, Italy, July 26-30, 2021.",
                "count": 65,
                "papers": [
                    "2021 Edsger W. Dijkstra Prize in Distributed Computing.",
                    "2021 Principles of Distributed Computing Doctoral Dissertation Award.",
                    "Differential Privacy in Distributed Environments: An Overview and Open Questions.",
                    "Elle: Finding Isolation Violations in Real-World Databases.",
                    "Separating Bounded and Unbounded Asynchrony for Autonomous Robots: Point Convergence with Limited Visibility.",
                    "On Implementing Stabilizing Leader Election with Weak Assumptions on Network Dynamics.",
                    "Time-Optimal Self-Stabilizing Leader Election in Population Protocols.",
                    "Lower Bounds on the State Complexity of Population Protocols.",
                    "Comparison Dynamics in Population Protocols.",
                    "Diversity, Fairness, and Sustainability in Population Protocols.",
                    "Brief Announcement: A Time and Space Optimal Stable Population Protocol Solving Exact Majority.",
                    "Search via Parallel Lévy Walks on Z2.",
                    "A Thin Self-Stabilizing Asynchronous Unison Algorithm with Applications to Fault Tolerant Biological Networks.",
                    "Efficient Deterministic Leader Election for Programmable Matter.",
                    "Decision Power of Weak Asynchronous Models of Distributed Computing.",
                    "Contention Resolution with Predictions.",
                    "Tight Trade-off in Contention Resolution without Collision Detection.",
                    "Brief Announcement: Wake Up and Join Me! An Energy Efficient Algorithm for Maximal Matching in Radio Networks.",
                    "Hedging Against Sore Loser Attacks in Cross-Chain Transactions.",
                    "All You Need is DAG.",
                    "Embedding a Deterministic BFT Protocol in a Block DAG.",
                    "Brief Announcement: Be Prepared When Network Goes Bad: An Asynchronous View-Change Protocol.",
                    "Brief Announcement: Classifying Trusted Hardware via Unidirectional Communication.",
                    "Brief Announcement: Malicious Security Comes for Free in Consensus with Leaders.",
                    "Brief Announcement: Brokering with Hashed Timelock Contracts is NP-Hard.",
                    "Low-Congestion Shortcuts in Constant Diameter Graphs.",
                    "Low-Congestion Shortcuts for Graphs Excluding Dense Minors.",
                    "Constant-Round Spanners and Shortest Paths in Congested Clique and MPC.",
                    "Ultra-Sparse Near-Additive Emulators.",
                    "Can We Break Symmetry with o(m) Communication?",
                    "Brief Announcement: On the Message Complexity of Fault-Tolerant Computation: Leader Election and Agreement.",
                    "Locally Checkable Problems in Rooted Trees.",
                    "Strong-Diameter Network Decomposition.",
                    "Improved Distributed Lower Bounds for MIS and Bounded (Out-)Degree Dominating Sets in Trees.",
                    "On the Locality of Nash-Williams Forest Decomposition and Star-Forest Decomposition.",
                    "The Randomized Local Computation Complexity of the Lovász Local Lemma.",
                    "Breaking the O(√ n)-Bit Barrier: Byzantine Agreement with Polylog Bits Per Party.",
                    "Good-case Latency of Byzantine Broadcast: a Complete Categorization.",
                    "Revisiting Optimal Resilience of Fast Byzantine Consensus.",
                    "A New Way to Achieve Round-Efficient Byzantine Agreement.",
                    "Reaching Consensus for Asynchronous Distributed Key Generation.",
                    "Brief Announcement: Making Synchronous BFT Protocols Secure in the Presence of Mobile Sluggish Faults.",
                    "Approximate Byzantine Fault-Tolerance in Distributed Optimization.",
                    "Differential Privacy and Byzantine Resilience in SGD: Do They Add Up?",
                    "Stochastic Coordination in Heterogeneous Load Balancing Systems.",
                    "The Topology of Randomized Symmetry-Breaking Distributed Computing.",
                    "Brief Announcement: Variants of Approximate Agreement on Graphs and Simplicial Complexes.",
                    "Brief Announcement: A Randomness-efficient Massively Parallel Algorithm for Connectivity.",
                    "Restorable Shortest Path Tiebreaking for Edge-Faulty Graphs.",
                    "Fault-Tolerant Labeling and Compact Routing Schemes.",
                    "Time-Optimal Construction of Overlay Networks.",
                    "Improved Deterministic (Δ+1) Coloring in Low-Space MPC.",
                    "Component Stability in Low-Space Massively Parallel Computation.",
                    "Brief Announcement: An Improved Distributed Approximate Single Source Shortest Paths Algorithm.",
                    "Reductions and Extension-Based Proofs.",
                    "The Space Complexity of Scannable Binary Objects.",
                    "On Register Linearizability and Termination.",
                    "Tight Lower Bound for the RMR Complexity of Recoverable Mutual Exclusion.",
                    "An Efficient Adaptive Partial Snapshot Implementation.",
                    "Brief Announcement: Detectable Sequential Specifications for Recoverable Shared Objects.",
                    "Brief Announcement: Linearizability: A Typo.",
                    "Brief Announcement: What's Live? Understanding Distributed Consensus.",
                    "Byzantine Agreement and Leader Election: From Classical to the Modern.",
                    "Security and Privacy for Distributed Optimization & Distributed Machine Learning.",
                    "Interaction-Oriented Programming: An Application Semantics Approach for Engineering Decentralized Applications."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "39th PODC 2020",
        "info": "Virtual Event, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2020",
                "sub_name": "PODC '20: ACM Symposium on Principles of Distributed Computing, Virtual Event, Italy, August 3-7, 2020.",
                "count": 66,
                "papers": [
                    "An Adaptive Approach to Recoverable Mutual Exclusion.",
                    "Upper and Lower Bounds on the Space Complexity of Detectable Objects.",
                    "Extending the Wait-free Hierarchy to Multi-Threaded Systems.",
                    "Long-Lived Snapshots with Polylogarithmic Amortized Step Complexity.",
                    "From Bezout's Identity to Space-Optimal Election in Anonymous Memory Systems.",
                    "Brief Announcement: Collect in the Presence of Continuous Churn with Application to Snapshots and Lattice Agreement.",
                    "Brief Announcement: Why Extension-Based Proofs Fail.",
                    "Brief Announcement: The Only Undoable CRDTs are Counters.",
                    "Exponentially Faster Shortest Paths in the Congested Clique.",
                    "Truly Tight-in-Δ Bounds for Bipartite Maximal Matching and Variants.",
                    "Lower Bounds for Distributed Sketching of Maximal Matchings and Maximal Independent Sets.",
                    "Seeing Far vs. Seeing Wide: Volume Complexity of Local Graph Problems.",
                    "Sleeping is Efficient: MIS in O(1)-rounds Node-averaged Awake Complexity.",
                    "Computing Shortest Paths and Diameter in the Hybrid Network Model.",
                    "Massively Parallel Algorithms for Minimum Cut.",
                    "Dumbo-MVBA: Optimal Multi-Valued Validated Asynchronous Byzantine Agreement, Revisited.",
                    "Revisiting Asynchronous Fault Tolerant Computation with Optimal Resilience.",
                    "Asynchronous Byzantine Approximate Consensus in Directed Networks.",
                    "On the Subject of Non-Equivocation: Defining Non-Equivocation in Synchronous Agreement Systems.",
                    "Brief Announcement: Almost-surely Terminating Asynchronous Byzantine Agreement Protocols with a Constant Expected Running Time.",
                    "Brief Announcement: On the Significance of Consecutive Ballots in Paxos.",
                    "Brief Announcement: Not a COINcidence: Sub-Quadratic Asynchronous Byzantine Agreement WHP.",
                    "Brief Announcement: Byzantine Agreement with Unknown Participants and Failures.",
                    "Recoverable Mutual Exclusion with Constant Amortized RMR Complexity from Standard Primitives.",
                    "An O(log3/2 n) Parallel Time Population Protocol for Majority with O(log n) States.",
                    "Fine-grained Analysis on Fast Implementations of Distributed Multi-writer Atomic Registers.",
                    "Self-Stabilizing Leader Election in Regular Graphs.",
                    "Brief Announcement: Optimal Time and Space Leader Election in Population Protocols.",
                    "Brief Announcement: Intermediate Value Linearizability: A Quantitative Correctness Criterion.",
                    "Brief Announcement: On Implementing Software Transactional Memory in the C++ Memory Model.",
                    "Brief Announcement: Self-stabilizing Systems in Spite of High Dynamics.",
                    "Brief Announcement: Hazard Pointer Protection of Structures with Immutable Links.",
                    "Distance-2 Coloring in the CONGEST Model.",
                    "Efficient Deterministic Distributed Coloring with Small Bandwidth.",
                    "Want to Gather? No Need to Chatter!",
                    "Tight Analysis of Asynchronous Rumor Spreading in Dynamic Networks.",
                    "The Energy Complexity of BFS in Radio Networks.",
                    "Brief Announcement: Improved Distributed Approximations for Maximum-Weight Independent Set.",
                    "Brief Announcement: Resource Competitive Broadcast against Adaptive Adversary in Multi-channel Radio Networks.",
                    "Distributed Edge Coloring in Time Quasi-Polylogarithmic in Delta.",
                    "How much does randomness help with locally checkable problems?",
                    "Simple, Deterministic, Constant-Round Coloring in the Congested Clique.",
                    "Compact Distributed Certification of Planar Graphs.",
                    "Generalizing the Sharp Threshold Phenomenon for the Distributed Complexity of the Lovász Local Lemma.",
                    "Multiple Source Replacement Path Problem.",
                    "Brief Announcement: Classification of Distributed Binary Labeling Problems.",
                    "Brief Announcement: Round eliminator: a tool for automatic speedup simulation.",
                    "Genuinely Distributed Byzantine Machine Learning.",
                    "Fault-Tolerance in Distributed Optimization: The Case of Redundancy.",
                    "Probably Approximately Knowing.",
                    "Positive Aging Admits Fast Asynchronous Plurality Consensus.",
                    "K-set agreement bounds in round-based models through combinatorial topology.",
                    "Brief Announcement: On Using Null Messages in a Byzantine Setting.",
                    "Can Uncoordinated Beeps tell Stories?",
                    "Noisy Beeps.",
                    "Perigee: Efficient Peer-to-Peer Network Design for Blockchains.",
                    "DConstructor: Efficient and Robust Network Construction with Polylogarithmic Overhead.",
                    "Distributed Computation and Reconfiguration in Actively Dynamic Networks.",
                    "Brief Announcement: Noisy Beeping Networks.",
                    "Brief Announcement: Deterministic Lower Bound for Dynamic Balanced Graph Partitioning.",
                    "Single-Source Shortest Paths in the CONGEST Model with Improved Bound.",
                    "On Distributed Listing of Cliques.",
                    "Distributed Construction of Light Networks.",
                    "Efficient and Simple Algorithms for Fault-Tolerant Spanners.",
                    "Distributed Approximation on Power Graphs.",
                    "Beyond Alice and Bob: Improved Inapproximability for Maximum Independent Set in CONGEST."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "38th PODC 2019",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2019",
                "sub_name": "Proceedings of the 2019 ACM Symposium on Principles of Distributed Computing, PODC 2019, Toronto, ON, Canada, July 29 - August 2, 2019.",
                "count": 78,
                "papers": [
                    "2019 Edsger W. Dijkstra Prize in Distributed Computing.",
                    "2019 Principles of Distributed Computing Doctoral Dissertation Award.",
                    "Local Computation Algorithms.",
                    "Symmetry Breaking in the Plane: Rendezvous by Robots with Unknown Attributes.",
                    "Composable Computation in Discrete Chemical Reaction Networks.",
                    "How to Spread a Rumor: Call Your Neighbors or Take a Walk?",
                    "Efficient Size Estimation and Impossibility of Termination in Uniform Dense Population Protocols.",
                    "On Counting the Population Size.",
                    "Self-Stabilizing Leader Election.",
                    "Logarithmic Expected-Time Leader Election in Population Protocol Model.",
                    "On Site Fidelity and the Price of Ignorance in Swarm Robotic Central Place Foraging Algorithms.",
                    "Improved Distributed Expander Decomposition and Nearly Optimal Triangle Enumeration.",
                    "Fast Approximate Shortest Paths in the Congested Clique.",
                    "Quantum Distributed Algorithm for the All-Pairs Shortest Path Problem in the CONGEST-CLIQUE Model.",
                    "Deterministic Distributed Dominating Set Approximation in the CONGEST Model.",
                    "Optimal Distributed Covering Algorithms.",
                    "Secure Distributed Computing Made (Nearly) Optimal.",
                    "With Great Speed Come Small Buffers: Space-Bandwidth Tradeoffs for Routing.",
                    "Plain SINR is Enough!",
                    "Efficient Multiparty Interactive Coding for Insertions, Deletions, and Substitutions.",
                    "Multiparty Interactive Communication with Private Channels.",
                    "Coded State Machine - Scaling State Machine Execution under Byzantine Faults.",
                    "On Termination of a Flooding Process.",
                    "Towards a Theory of Randomized Shared Memory Algorithms.",
                    "Optimal Memory-Anonymous Symmetric Deadlock-Free Mutual Exclusion.",
                    "Constant Amortized RMR Abortable Mutex for CC and DSM.",
                    "A Recoverable Mutex Algorithm with Sub-logarithmic RMR on Both CC and DSM.",
                    "Randomized Concurrent Set Union and Generalized Wake-Up.",
                    "Strongly Linearizable Implementations of Snapshots and Other Types.",
                    "Fast Concurrent Data Sketches.",
                    "Self-Stabilizing Snapshot Objects for Asynchronous Failure-Prone Networked Systems.",
                    "The Recoverable Consensus Hierarchy.",
                    "How Fast Reads Affect Multi-Valued Register Simulations.",
                    "Topological Characterization of Consensus under General Message Adversaries.",
                    "Can Distributed Uniformity Testing Be Local?",
                    "Hardness of Distributed Optimization.",
                    "Broadcast Congested Clique: Planted Cliques and Pseudorandom Generators.",
                    "Connectivity Lower Bounds in Broadcast Congested Clique.",
                    "Does Preprocessing Help under Congestion?",
                    "The Distributed Complexity of Locally Checkable Problems on Paths is Decidable.",
                    "Hardness of Exact Distance Queries in Sparse Graphs Through Hub Labeling.",
                    "On the Complexity of Distributed Splitting Problems.",
                    "On the Use of Randomness in Local Distributed Graph Algorithms.",
                    "Message Reduction in the LOCAL Model is a Free Lunch.",
                    "P-SLOCAL-Completeness of Maximum Independent Set Approximation.",
                    "Engineering Distributed Systems that We Can Trust (and Also Run).",
                    "The Consensus Number of a Cryptocurrency.",
                    "Communication Complexity of Byzantine Agreement, Revisited.",
                    "Exact Byzantine Consensus on Undirected Graphs under Local Broadcast Model.",
                    "Asymptotically Optimal Validated Asynchronous Byzantine Agreement.",
                    "HotStuff: BFT Consensus with Linearity and Responsiveness.",
                    "Fault Tolerant Gradient Clock Synchronization.",
                    "Bootstrapping Public Blockchains Without a Trusted Setup.",
                    "Hardness of Minimal Symmetry Breaking in Distributed Computing.",
                    "An Automatic Speedup Theorem for Distributed Problems.",
                    "A Sharp Threshold Phenomenon for the Distributed Complexity of the Lovász Local Lemma.",
                    "Reconfigurable Atomic Transaction Commit.",
                    "The Impact of RDMA on Agreement.",
                    "Hyaline: Fast and Transparent Lock-Free Memory Reclamation.",
                    "Layering Data Structures over Skip Graphs for Increased NUMA Locality.",
                    "Partially Replicated Causally Consistent Shared Memory: Lower Bounds and An Algorithm.",
                    "Vorpal: Vector Clock Ordering For Large Persistent Memory Systems.",
                    "On the Parallels between Paxos and Raft, and how to Port Optimizations.",
                    "Linearizable State Machine Replication of State-Based CRDTs without Logs.",
                    "On Mixing Eventual and Strong Consistency: Bayou Revisited.",
                    "Massively Parallel Algorithms for Finding Well-Connected Components in Sparse Graphs.",
                    "The Complexity of (Δ+1) Coloring in Congested Clique, Massively Parallel Computation, and Centralized Local Computation.",
                    "Massively Parallel Computation of Matching and MIS in Sparse Graphs.",
                    "Weighted Matchings via Unweighted Augmentations.",
                    "Implementing Mediators with Asynchronous Cheap Talk.",
                    "Distributed Minimum Degree Spanning Trees.",
                    "Improved Distributed Approximations for Minimum-Weight Two-Edge-Connected Spanning Subgraph.",
                    "Near-Additive Spanners In Low Polynomial Deterministic CONGEST Time.",
                    "A Trivial Yet Optimal Solution to Vertex Fault Tolerant Spanners.",
                    "From Classical to Blockchain Consensus: What Are the Exact Algorithms?",
                    "Byzantine Fault Tolerant State Machine Replication in Any Programming Language.",
                    "Central Control over Distributed Asynchronous Systems: A Tutorial on Software-Defined Networks and Consistent Network Updates.",
                    "Tutorial: Specifying, Implementing, and Verifying Algorithms for Persistent Memory."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "37th PODC 2018",
        "info": "Egham, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2018",
                "sub_name": "Proceedings of the 2018 ACM Symposium on Principles of Distributed Computing, PODC 2018, Egham, United Kingdom, July 23-27, 2018.",
                "count": 79,
                "papers": [
                    "2018 Edsger W. Dijkstra Prize in Distributed Computing.",
                    "2018 Doctoral Dissertation Award.",
                    "Overview of Persistent Memory in Distributed Systems Architecture - Past, Present, Future.",
                    "Session details: Session 1A: Persistent Memory.",
                    "Nesting-Safe Recoverable Linearizability: Modular Constructions for Non-Volatile Memory.",
                    "Recoverable Mutual Exclusion Under System-Wide Failures.",
                    "Deterministic Abortable Mutual Exclusion with Sublogarithmic Adaptive RMR Complexity.",
                    "Brief Announcement: Persistent Multi-Word Compare-and-Swap.",
                    "Session details: Session 1B: Shared Memory Theory.",
                    "Separating Lock-Freedom from Wait-Freedom.",
                    "Passing Messages while Sharing Memory.",
                    "Revisionist Simulations: A New Approach to Proving Space Lower Bounds.",
                    "On the Classification of Deterministic Objects via Set Agreement Power.",
                    "Brief Announcement: Specification and Implementation of Replicated List: The Jupiter Protocol Revisited.",
                    "Session details: Session 1C: Wireless Networks.",
                    "Leveraging Indirect Signaling for Topology Inference and Fast Broadcast.",
                    "The Energy Complexity of Broadcast.",
                    "Deterministic Digital Clustering of Wireless Ad Hoc Networks.",
                    "Brief Announcement: Broadcast in Radio Networks, Time vs. Energy Tradeoffs.",
                    "Session details: Session 1D: Graph Algorithms.",
                    "Round- and Message-Optimal Distributed Graph Algorithms.",
                    "Improved Massively Parallel Computation Algorithms for MIS, Matching, and Vertex Cover.",
                    "Distributed Spanner Approximation.",
                    "Distributed Approximation of Minimum k-edge-connected Spanning Subgraphs.",
                    "Brief Announcement: Distributed Minimum Vertex Coloring and Maximum Independent Set in Chordal Graphs.",
                    "Brief Announcement: Simple and Local Independent Set Approximation.",
                    "Data Summarization and Distributed Computation.",
                    "Session details: Session 2A: Approximation and Learning.",
                    "The Convergence of Stochastic Gradient Descent in Asynchronous Shared Memory.",
                    "Optimal Gossip Algorithms for Exact and Approximate Quantile Computations.",
                    "On Local Distributed Sampling and Counting.",
                    "Session details: Session 2B: Routing and Leader Election.",
                    "A Deterministic Distributed Algorithm for Exact Weighted All-Pairs Shortest Paths in Õ(n 3/2 ) Rounds.",
                    "Near-Optimal Distributed Routing with Low Memory.",
                    "Fair Leader Election for Rational Agents in Asynchronous Rings and Networks.",
                    "Leader Election in Well-Connected Graphs.",
                    "Brief Announcement: Beeping a Time-Optimal Leader Election.",
                    "Brief Announcement: Graph Exploration Using Constant-Size Memory and Storage.",
                    "Session details: Session 2C: Security, Blockchains, and Replication.",
                    "Atomic Cross-Chain Swaps.",
                    "Interactive Distributed Proofs.",
                    "Brief Announcement: Asynchronous Secure Distributed Computing with Transferrable Non-equivocation Revisited.",
                    "Brief Announcement: Sustainable Blockchains through Proof of eXercise.",
                    "Brief Announcement: Partially Replicated Causally Consistent Shared Memory.",
                    "Brief Announcement: Optimal Record and Replay under Causal Consistency.",
                    "Brief Announcement: MUSIC: Multi-Site Entry Consistencyfor Geo-Distributed Services.",
                    "Session details: Session 2D: Consensus.",
                    "Silence.",
                    "Almost-Surely Terminating Asynchronous Byzantine Agreement Revisited.",
                    "Nearly-Tight Analysis for 2-Choice and 3-Majority Consensus Dynamics.",
                    "Sublinear Message Bounds for Randomized Agreement.",
                    "Tight Bounds for Asymptotic and Approximate Consensus.",
                    "Barriers due to Congestion and Two Ways to Deal With Them.",
                    "Session details: Session 3A: Congest.",
                    "Sublinear-Time Quantum Computation of the Diameter in CONGEST Networks.",
                    "Property Testing of Planarity in the CONGEST model.",
                    "Congested Clique Algorithms for the Minimum Cut Problem.",
                    "Locking Timestamps versus Locking Objects.",
                    "Relaxed Schedulers Can Efficiently Parallelize Iterative Algorithms.",
                    "An Asynchronous Computability Theorem for Fair Adversaries.",
                    "Population Stability: Regulating Size in the Presence of an Adversary.",
                    "Brief Announcement: 2D-Stack - A Scalable Lock-Free Stack Design that Continuously Relaxes Semantics for Better Performance.",
                    "Brief Announcement: Performance Prediction for Coarse-Grained Locking.",
                    "Brief Announcement: Automatic Log Enhancement for Fault Diagnosis.",
                    "Session details: Session 3C: Coloring.",
                    "Distributed Coloring in Sparse Graphs with Fewer Colors.",
                    "Improved Distributed Delta-Coloring.",
                    "Locally-Iterative Distributed (Δ+ 1): -Coloring below Szegedy-Vishwanathan Barrier, and Applications to Self-Stabilization and to Restricted-Bandwidth Models.",
                    "Session details: Session 3D: Graphs and Population.",
                    "Lower Bounds for Searching Robots, some Faulty.",
                    "Distributed Uniformity Testing.",
                    "Minor Excluded Network Families Admit Fast Distributed Algorithms.",
                    "Brief Announcement: Population Protocols Are Fast.",
                    "Brief Announcement: Space-Optimal Naming in Population Protocols.",
                    "Brief Announcement: A Local Stochastic Algorithm for Separation in Heterogeneous Self-Organizing Particle Systems.",
                    "A Brief Tutorial on Distributed and Concurrent Machine Learning.",
                    "Erasure Coding in Object Stores: Challenges and Opportunities.",
                    "Tutorial: Consistency Choices in Modern Distributed Systems.",
                    "From Self-Stabilization to Self-Optimization: Principles of Distributed Network Design."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2018topic",
                "sub_name": "Proceedings of the 2018 Workshop on Theory and Practice for Integrated Cloud, Fog and Edge Computing Paradigms, TOPIC@PODC 2018, Egham, United Kingdom, July 27, 2018.",
                "count": 7,
                "papers": [
                    "Relays: Towards a Link Layer for Robust and Secure Fog Computing.",
                    "Distributing Computations in Fog Architectures.",
                    "Scheduling at the Edge for Assisting Cloud Real-Time Systems.",
                    "Enabling Exclusive Shared Access to Cloud of Things Resources.",
                    "Digital Epidemiology and Beyond.",
                    "A Novel NFV Schedule Optimization Approach with Sensitivity to Packets Dropping Positions.",
                    "GoEdge: A Scalable and Stateless Local Breakout Method."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2018applied",
                "sub_name": "Proceedings of the 2018 Workshop on Advanced Tools, Programming Languages, and PLatforms for Implementing and Evaluating Algorithms for Distributed systems, ApPLIED@PODC 2018, Egham, United Kingdom, July 27, 2018.",
                "count": 10,
                "papers": [
                    "Apply or Perish!",
                    "Saying What You Mean.",
                    "Towards Reproducible Evaluation of Large-Scale Distributed Systems.",
                    "Turn of the Carousel - What Does Edge Computing Change for Distributed Applications?",
                    "Towards a More Reliable Store-and-forward Protocol for Mobile Text Messages.",
                    "Logical Clocks Are Not Fair: What Is Fair?",
                    "An Analysis of Quorum-based Abstractions: A Case Study using Gorums to Implement Raft.",
                    "Data Distribution Method for Fast Giga-scale Hologram Generation on a Multi-GPU Cluster.",
                    "Language Semantics Driven Design and Formal Analysis for Distributed Cyber-Physical Systems: [Extended Abstract].",
                    "Partisan: Enabling Real-World Protocol Evaluation."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "36th PODC 2017",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2017",
                "sub_name": "Proceedings of the ACM Symposium on Principles of Distributed Computing, PODC 2017, Washington, DC, USA, July 25-27, 2017.",
                "count": 62,
                "papers": [
                    "Some Sequential Algorithms are Almost Always Parallel.",
                    "Exploiting Spontaneous Transmissions for Broadcasting and Leader Election in Radio Networks.",
                    "The Space Requirement of Local Forwarding on Acyclic Networks.",
                    "Communication Primitives in Cognitive Radio Networks.",
                    "Broadcasting in Noisy Radio Networks.",
                    "Gossip in a Smartphone Peer-to-Peer Network.",
                    "Analyzing Contention and Backoff in Asynchronous Shared Memory.",
                    "A Layered Architecture for Erasure-Coded Consistent Distributed Storage.",
                    "Seeing is Believing: A Client-Centric Specification of Database Isolation.",
                    "Space Complexity of Fault-Tolerant Register Emulations.",
                    "Brief Announcement: Readers of Wait-Free Unbounded Registers Must Write.",
                    "Brief Announcement: Fast Shared Counting using (O(n)) Compare-and-Swap Registers.",
                    "Brief Announcement: Fence Insertion for Straight-line Programs is in P.",
                    "LCL Problems on Grids.",
                    "On the Multiparty Communication Complexity of Testing Triangle-Freeness.",
                    "What Can be Sampled Locally?",
                    "Distributed MST and Routing in Almost Mixing Time.",
                    "Distributed MIS via All-to-All Communication.",
                    "Brief Announcement: Optimal Address-Oblivious Epidemic Dissemination.",
                    "Blockchains and the Future of Distributed Computing.",
                    "A Simple Deterministic Distributed MST Algorithm, with Near-Optimal Time and Message Complexities.",
                    "Distributed Approximation of Maximum Independent Set and Maximum Matching.",
                    "Deterministic Distributed (Delta + o(Delta))-Edge-Coloring, and Vertex-Coloring of Graphs with Bounded Diversity.",
                    "Optimal Distance Labeling Schemes for Trees.",
                    "Brief Announcement: How Large is your Graph?",
                    "Brief Announcement: Distributed Approximation for Tree Augmentation.",
                    "Brief Announcement: Leader Election in SINR Model with Arbitrary Power Control.",
                    "Brief Announcement: Symmetry Breaking in the CONGEST Model: Time- and Message-Efficient Algorithms for Ruling Sets.",
                    "Recoverable Mutual Exclusion in Sub-logarithmic Time.",
                    "Randomized Abortable Mutual Exclusion with Constant Amortized RMR Complexity on the CC Model.",
                    "Transactional Lock Elision Meets Combining.",
                    "On Using Time Without Clocks via Zigzag Causality.",
                    "Brief Announcement: Proust: A Design Space for Highly-Concurrent Transactional Data Structures.",
                    "Brief Announcement: Gossiping with Latencies.",
                    "Brief Announcement: A Probabilistic Performance Model and Tuning Framework for Eventually Consistent Distributed Storage Systems.",
                    "Effectiveness of Delaying Timestamp Computation.",
                    "Symmetry Breaking with Noisy Processes.",
                    "The Power of Choice in Priority Scheduling.",
                    "A Template for Implementing Fast Lock-free Trees Using HTM.",
                    "Adding Concurrency to Smart Contracts.",
                    "Verifiable Outsourced Computation: A Survey.",
                    "FruitChains: A Fair Blockchain.",
                    "Coordination Without Prior Agreement.",
                    "Ignore or Comply?: On Breaking Symmetry in Consensus.",
                    "Life Beyond Set Agreement.",
                    "Brief Announcement: Hierarchical Consensus.",
                    "Brief Announcement: Statement Voting and Liquid Democracy.",
                    "Brief Announcement: Rapid Asynchronous Plurality Consensus.",
                    "Brief Announcement: Object Oriented Consensus.",
                    "Greedy Routing and the Algorithmic Small-World Phenomenon.",
                    "Triangle Finding and Listing in CONGEST Networks.",
                    "Asynchronous Shared Channel.",
                    "Self-organized Segregation on the Grid.",
                    "Brief Announcement: Efficient Self-Stabilizing 1-Maximal Matching Algorithm for Arbitrary Networks.",
                    "Brief Announcement: Secure Self-Stabilizing Computation.",
                    "Stateless Computation.",
                    "Towards Efficient Verification of Population Protocols.",
                    "Clocked Population Protocols.",
                    "A Distributed Learning Dynamics in Social Groups.",
                    "Brief Announcement: Population Protocols for Leader Election and Exact Majority with O(log2 n) States and O(log2 n) Convergence Time.",
                    "Brief Announcement: Byzantine-Tolerant Machine Learning.",
                    "Brief Announcement: Certified Multiplicative Weights Update: Verified Learning Without Regret."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2017armscc",
                "sub_name": "Proceedings of the 2017 Workshop on Adaptive Resource Management and Scheduling for Cloud Computing, ARMS-CC@PODC 2017, Washington, DC, USA, July 28, 2017.",
                "count": 4,
                "papers": [
                    "Benchmarking OpenCL, OpenACC, OpenMP, and CUDA: Programming Productivity, Performance, and Energy Consumption.",
                    "A Distributed and Fault Tolerant Robotic Localisation and Mapping in Network Edge.",
                    "An RLS Memory-based Mechanism for the Automatic Adaptation of VMs on Cloud Environments.",
                    "Healthcare Sensor Data Management on the Cloud."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "35th PODC 2016",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2016",
                "sub_name": "Proceedings of the 2016 ACM Symposium on Principles of Distributed Computing, PODC 2016, Chicago, IL, USA, July 25-28, 2016.",
                "count": 67,
                "papers": [
                    "New Opportunities for PODC?: Massive, Volatile, but Highly Predictable Resources.",
                    "A Distributed (2+ε)-Approximation for Vertex Cover in O(logδ/ε log log δ) Rounds.",
                    "The Greedy Spanner is Existentially Optimal.",
                    "MST in Log-Star Rounds of Congested Clique.",
                    "Distributed Algorithms for Planar Networks I: Planar Embedding.",
                    "Brief Announcement: Labeling Schemes for Power-Law Graphs.",
                    "Brief Announcement: Sublinear-Space Distance Labeling Using Hubs.",
                    "Brief Announcement: Optimal Leader Election in Multi-Hop Radio Networks.",
                    "Brief Announcement: The Small World of Curious Beings.",
                    "Analysing Snapshot Isolation.",
                    "Recoverable Mutual Exclusion: [Extended Abstract].",
                    "A Randomized Concurrent Algorithm for Disjoint Set Union.",
                    "Self-stabilizing Balls & Bins in Batches: The Power of Leaky Bins [Extended Abstract].",
                    "Brief Announcement: Local Independent Set Approximation.",
                    "Deterministic Objects: Life Beyond Consensus.",
                    "Unbeatable Set Consensus via Topological and Combinatorial Reasoning.",
                    "A Polylogarithmic Gossip Algorithm for Plurality Consensus.",
                    "Noisy Rumor Spreading and Plurality Consensus.",
                    "Rational Consensus: Extended Abstract.",
                    "Brief Announcement: A Tight Space Bound for Consensus.",
                    "Concurrent Data Structures.",
                    "Contention Resolution on a Fading Channel.",
                    "Reliable Communication over Highly Connected Noisy Networks.",
                    "Contention Resolution on Multiple Channels with Collision Detection.",
                    "How Asynchrony Affects Rumor Spreading Time.",
                    "Brief Announcement: An Exponential Separation Between Randomized and Deterministic Complexity in the LOCAL Model.",
                    "Brief Announcement: Data Dissemination in Unified Dynamic Wireless Networks.",
                    "Brief Announcement: Reliable Message Transmission under Partial Knowledge and General Adversaries.",
                    "Brief Announcement: Self-stabilizing Clock Synchronization with 3-bit Messages.",
                    "Distributed Strong Diameter Network Decomposition: Extended Abstract.",
                    "Optimal Dynamic Distributed MIS.",
                    "A Local Constant Factor MDS Approximation for Bounded Genus Graphs.",
                    "On Efficient Distributed Construction of Near Optimal Routing Schemes: Extended Abstract.",
                    "Brief Announcement: Deterministic Graph Connectivity in the Broadcast Congested Clique.",
                    "Space Bounds for Reliable Storage: Fundamental Limits of Coding.",
                    "Specification and Complexity of Collaborative Text Editing.",
                    "Optimal Mobile Byzantine Fault Tolerant Distributed Storage: Extended Abstract.",
                    "A Markov Chain Algorithm for Compression in Self-Organizing Particle Systems.",
                    "A Complexity-Based Hierarchy for Multiprocessor Synchronization: [Extended Abstract].",
                    "Brief Announcement: Asynchronous Coordination with Constraints and Preferences.",
                    "How Emerging Memory Technologies Will Have You Rethinking Algorithm Design.",
                    "Information-Theoretic Lower Bounds on the Storage Cost of Shared Memory Emulation.",
                    "On the Complexity of Reader-Writer Locks: Extended Abstract.",
                    "An Algorithm for Replicated Objects with Efficient Reads.",
                    "Are Shared Objects Composable under an Oblivious Adversary?",
                    "Brief Announcement: A Family of Leaderless Generalized-Consensus Algorithms.",
                    "Brief Announcement: Computing in the Presence of Weak Crash Failures.",
                    "Brief Announcement: Oh-RAM! One and a Half Round Read/Write Atomic Memory.",
                    "Brief Announcement: Space-Time Tradeoffs for Distributed Verification.",
                    "A Faster Distributed Radio Broadcast Primitive: Extended Abstract.",
                    "Broadcast Extensions with Optimal Communication and Round Complexity.",
                    "Two-Bit Messages are Sufficient to Implement Atomic Read/Write Registers in Crash-prone Systems.",
                    "How Proofs are Prepared at Camelot: Extended Abstract.",
                    "Brief Announcement: Proactive Secret Sharing with a Dishonest Majority.",
                    "Search on a Line with Faulty Robots.",
                    "Uniform Deployment of Mobile Agents in Asynchronous Rings.",
                    "Fault-Tolerant Multi-Agent Optimization: Optimal Iterative Distributed Algorithms.",
                    "Brief Announcement: Active Information Spread in Networks.",
                    "Brief Announcement: Certified Universal Gathering in R2 for Oblivious Mobile Robots.",
                    "Brief Announcement: Probabilistic Asynchronous Arbitrary Pattern Formation.",
                    "Brief Announcement: Pattern Formation Problem for Synchronous Mobile Robots in the Three Dimensional Euclidean Space.",
                    "Low-Congestion Shortcuts without Embedding.",
                    "The Coalescing-Branching Random Walk on Expanders and the Dual Epidemic Process.",
                    "Ant-Inspired Density Estimation via Random Walks: Extended Abstract.",
                    "Brief Announcement: Multi-Broadcasting under the SINR Model.",
                    "Brief Announcement: Using Read-k Inequalities to Analyze a Distributed MIS Algorithm.",
                    "Brief Announcement: A Key-Value Map for Massive Real-Time Analytics."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2016armscc",
                "sub_name": "Proceedings of the Third International Workshop on Adaptive Resource Management and Scheduling for Cloud Computing, ARMS-CC@PODC 2016, Chicago, IL, USA, July 25-28, 2016.",
                "count": 9,
                "papers": [
                    "Computation Offloading from Mobile Devices: Can Edge Devices Perform Better Than the Cloud?",
                    "Performance of Approximate Causal Consistency for Partially Replicated Systems.",
                    "Modelling the Scalability of Real-Time Online Interactive Applications on Clouds.",
                    "The Impact on the Performance of Co-running Virtual Machines in a Virtualized Environment.",
                    "A Gossip-Based Dynamic Virtual Machine Consolidation Strategy for Large-Scale Cloud Data Centers.",
                    "Internet of Things data management in the cloud for Bluetooth Low Energy (BLE) devices.",
                    "I2oT: Inexactness in IoT.",
                    "Cloud Elasticity: going beyond demand as user load.",
                    "Cloud live streaming System based on Auto-adaptive Overlay for Cyber Physical Infrastructure."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2016dcc",
                "sub_name": "Proceedings of the 4th Workshop on Distributed Cloud Computing, DCC@PODC 2016, Chicago, IL, USA, July 25, 2016.",
                "count": 11,
                "papers": [
                    "Next generation virtual network architecture for multi-tenant distributed clouds: challenges and emerging techniques.",
                    "vMCN: virtual mobile cloud network for realizing scalable, real-time cyber physical systems.",
                    "Software-defined consistency group abstractions for virtual machines.",
                    "Slicing in locavore infrastructures.",
                    "Adaptive resilient routing via preorders in SDN.",
                    "The CAT theorem and performance of transactional distributed systems.",
                    "New techniques to curtail the tail latency in stream processing systems.",
                    "Optimized VM memory allocation based on monitored cache hit ratio.",
                    "The misbelief in delay scheduling.",
                    "Towards migrating computation to distributed memory caches.",
                    "DSB-SEIS: a deduplicating secure backup system with encryption intensity selection."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "34th PODC 2015",
        "info": "Donostia-San Sebastián, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2015",
                "sub_name": "Proceedings of the 2015 ACM Symposium on Principles of Distributed Computing, PODC 2015, Donostia-San Sebastián, Spain, July 21 - 23, 2015.",
                "count": 58,
                "papers": [
                    "Cortical Computation.",
                    "Near-Optimal Scheduling of Distributed Algorithms.",
                    "Scheduling Loop-free Network Updates: It's Good to Relax!",
                    "New Routing Techniques and their Applications.",
                    "Brief Announcement: Routing the Internet with Very Few Entries.",
                    "Terminating Distributed Construction of Shapes and Patterns in a Fair Solution of Automata.",
                    "Fast and Exact Majority in Population Protocols.",
                    "Distributed House-Hunting in Ant Colonies.",
                    "Brief Announcement: On the Feasibility of Leader Election and Shape Formation with Self-Organizing Programmable Matter.",
                    "Construction and Impromptu Repair of an MST in a Distributed Network with o(m) Communication.",
                    "Near-Optimal Distributed Maximum Flow: Extended Abstract.",
                    "Toward Optimal Bounds in the Congested Clique: Graph Connectivity and MST.",
                    "Fast Distributed Almost Stable Matchings.",
                    "A (Truly) Local Broadcast Layer for Unreliable Radio Networks.",
                    "Efficient Communication in Cognitive Radio Networks.",
                    "A Local Broadcast Layer for the SINR Network Model.",
                    "Brief Announcement: Fast and Simple Node Coloring in the SINR Model.",
                    "Algebraic Methods in the Congested Clique.",
                    "Fast Partial Distance Estimation and Applications.",
                    "Brief Announcement: Distributed Single-Source Reachability.",
                    "Brief Announcement: A Hierarchy of Congested Clique Models, from Broadcast to Unicast.",
                    "The \"Mobile Adversary\" Paradigm in Distributed Computation and Systems.",
                    "Trading Fences with RMRs and Separating Memory Models.",
                    "The Price of being Adaptive.",
                    "On the Time and Space Complexity of ABA Prevention and Detection.",
                    "Brief Announcement: Fault-tolerant Broadcast in Anonymous Distributed Systems with Fair Lossy Communication Channels.",
                    "Impossibility Results for Distributed Transactional Memory.",
                    "Disjoint-Access Parallelism: Impossibility, Possibility, and Cost of Transactional Memory Implementations.",
                    "Safety-Liveness Exclusion in Distributed Computing.",
                    "Brief Announcement: Eventually Consistent Linearizability.",
                    "Help!",
                    "Lock-Free Algorithms under Stochastic Schedulers.",
                    "Reclaiming Memory for Lock-Free Data Structures: There has to be a Better Way.",
                    "On the Space Complexity of Set Agreement?",
                    "How Fair is Your Protocol?: A Utility-based Approach to Protocol Optimality.",
                    "Adaptively Secure Computation with Partial Erasures.",
                    "Improved Analysis of Deterministic Load-Balancing Schemes.",
                    "Brief Announcement: Robust and Private Distributed Shared Atomic Memory in Message Passing Networks.",
                    "Randomized Proof-Labeling Schemes.",
                    "Distributed Convex Thresholding.",
                    "Brief Announcement: Average Complexity for the LOCAL Model.",
                    "Brief Announcement: Investigating the Cost of Anonymity on Dynamic Networks.",
                    "Online Resource Leasing.",
                    "Deterministic (Δ + 1)-Coloring in Sublinear (in Δ) Time in Static, Dynamic and Faulty Networks.",
                    "On Information Complexity in the Broadcast Model.",
                    "How To Elect a Leader Faster than a Tournament.",
                    "The Weakest Failure Detector for Eventual Consistency.",
                    "Limitations of Highly-Available Eventually-Consistent Data Stores.",
                    "Computing Weak Consistency in Polynomial Time: [Extended Abstract].",
                    "On the Push&Pull Protocol for Rumour Spreading: [Extended Abstract].",
                    "Distributed Resource Discovery in Sub-Logarithmic Time.",
                    "The Cost of Synchronizing Multiple-Access Channels.",
                    "Leveraging Multiple Channels in Ad Hoc Networks.",
                    "Towards Optimal Synchronous Counting.",
                    "Fault-Tolerant Consensus in Directed Graphs.",
                    "Minimal Synchrony for Byzantine Consensus.",
                    "Stabilizing Server-Based Storage in Byzantine Asynchronous Message-Passing Systems: Extended abstract.",
                    "Dual Failure Resilient BFS Structure."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2015armscc",
                "sub_name": "Adaptive Resource Management and Scheduling for Cloud Computing - Second International Workshop, ARMS-CC 2015, Held in Conjunction with ACM Symposium on Principles of Distributed Computing, PODC 2015, Donostia-San Sebastián, Spain, July 20, 2015, Revised Selected Papers.",
                "count": 13,
                "papers": [
                    "Competitive Analysis of Task Scheduling Algorithms on a Fault-Prone Machine and the Impact of Resource Augmentation.",
                    "Using Performance Forecasting to Accelerate Elasticity.",
                    "Parametric Analysis of Mobile Cloud Computing Frameworks Using Simulation Modeling.",
                    "Bandwidth-Aware Resource Optimization for SMT Processors.",
                    "User-Guided Provisioning in Federated Clouds for Distributed Calculations.",
                    "Compute on the Go: A Case of Mobile-Cloud Collaborative Computing Under Mobility.",
                    "Impact of Virtual Machines Heterogeneity on Data Center Power Consumption in Data-Intensive Applications.",
                    "Implementing the Cloud Software to Data Approach for OpenStack Environments.",
                    "Is Cloud Self-organization Feasible?",
                    "Cloud Services Composition Through Cloud Patterns.",
                    "An Eye on the Elephant in the Wild: A Performance Evaluation of Hadoop's Schedulers Under Failures.",
                    "Partitioning Graph Databases by Using Access Patterns.",
                    "Cloud Search Based Applications for Big Data - Challenges and Methodologies for Acceleration."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "33rd PODC 2014",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2014",
                "sub_name": "ACM Symposium on Principles of Distributed Computing, PODC '14, Paris, France, July 15-18, 2014.",
                "count": 54,
                "papers": [
                    "Rational and resilient protocols.",
                    "Signature-free asynchronous byzantine consensus with t 2<n/3 and o(n2) messages.",
                    "Asynchronous MPC with a strict honest majority using non-equivocation.",
                    "Distributing the setup in universally composable multi-party computation.",
                    "The future(s) of shared data structures.",
                    "A paradox of eventual linearizability in shared memory.",
                    "Brief announcement: are lock-free concurrent algorithms practically wait-free?",
                    "Brief announcement: a generic construction for nonblocking dual containers.",
                    "Multi-message broadcast with abstract MAC layers and unreliable links.",
                    "Consensus with an abstract MAC layer.",
                    "Simple and efficient local codes for distributed stable network construction.",
                    "Linear-in-delta lower bounds in the LOCAL model.",
                    "Anonymous networks: randomization = 2-hop coloring.",
                    "Beyond set disjointness: the communication complexity of finding the intersection.",
                    "Breathe before speaking: efficient information dissemination despite noisy, limited and anonymous communication.",
                    "Estimation for monotone sampling: competitiveness and customization.",
                    "Distributed algorithms for the Lovász local lemma and graph coloring.",
                    "Brief announcement: towards security and privacy for outsourced data in the multi-party setting.",
                    "Brief announcement: game theoretical approach for energy-delay balancing in distributed duty-cycled MAC protocols of wireless networks.",
                    "Coding theory for scalable media delivery.",
                    "Distributed connectivity decomposition.",
                    "Can quantum communication speed up distributed computation?",
                    "Optimal gossip with direct addressing.",
                    "Complexity tradeoffs for read and update operations.",
                    "Concurrent updates with RCU: search tree as an example.",
                    "Brief announcement: distributed universality: contention-awareness; wait-freedom; object progress, and other properties.",
                    "Brief announcement: concurrency-aware linearizability.",
                    "Software-improved hardware lock elision.",
                    "A generalized asynchronous computability theorem.",
                    "Balls-into-leaves: sub-logarithmic renaming in synchronous message-passing systems.",
                    "Dynamic-sized nonblocking hash tables.",
                    "Trade-offs between selection complexity and performance when searching the plane without communication.",
                    "Improved distributed steiner forest construction.",
                    "Spanners and sparsifiers in dynamic streams.",
                    "Time versus cost tradeoffs for deterministic rendezvous in networks.",
                    "An incomplete history of concurrency chapter 1. 1965-1977.",
                    "Rigorous system design.",
                    "How to withstand mobile virus attacks, revisited.",
                    "Born and raised distributively: fully distributed non-interactive adaptively-secure threshold signatures with short shares.",
                    "Fast and unconditionally secure anonymous channel.",
                    "Efficient lock-free binary search trees.",
                    "The amortized complexity of non-blocking binary search trees.",
                    "Brief announcement: gracefully degrading consensus and k-set agreement under dynamic link failures.",
                    "Brief announcement: local approximability of minimum dominating set on planar graphs.",
                    "Beyond geometry: towards fully realistic wireless models.",
                    "On the impact of geometry on ad hoc communication in wireless networks.",
                    "On the power of the congested clique model.",
                    "Brief announcement: linial's lower bound made easy.",
                    "Brief announcement: Super-fast t-ruling sets.",
                    "Brief announcement: almost-tight approximation distributed algorithm for minimum cut.",
                    "Making objects writable.",
                    "Asynchronous convex hull consensus in the presence of crash faults.",
                    "Distributed computing building blocks for rational agents.",
                    "Near-optimal communication-time tradeoff in fault-tolerant computation of aggregate functions."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2014armscc",
                "sub_name": "Adaptive Resource Management and Scheduling for Cloud Computing - First International Workshop, ARMS-CC 2014, held in Conjunction with ACM Symposium on Principles of Distributed Computing, PODC 2014, Paris, France, July 15, 2014, Revised Selected Papers.",
                "count": 15,
                "papers": [
                    "In-Memory Runtime File Systems for Many-Task Computing.",
                    "A Multi-capacity Queuing Mechanism in Multi-dimensional Resource Scheduling.",
                    "A Green Scheduling Policy for Cloud Computing.",
                    "A Framework for Speculative Scheduling and Device Selection for Task Execution on a Mobile Cloud.",
                    "An Interaction Balance Based Approach for Autonomic Performance Management in a Cloud Computing Environment.",
                    "Power-Efficient Assignment of Virtual Machines to Physical Machines.",
                    "SLA-Driven Simulation of Multi-Tenant Scalable Cloud-Distributed Enterprise Information Systems.",
                    "Towards Type-Based Optimizations in Distributed Applications Using ABS and JAVA 8.",
                    "A Parallel Genetic Algorithm Framework for Cloud Computing Applications.",
                    "Analysing Scalability Strategies for Service Choreographies on Cloud Environments.",
                    "Towards Efficient Power Management in MapReduce: Investigation of CPU-Frequencies Scaling on Power Efficiency in Hadoop.",
                    "Self-management of Live Streaming Application in Distributed Cloud Infrastructure.",
                    "Towards the Impact of Design Flaws on the Resources Used by an Application.",
                    "Policy-Based Cloud Management Through Resource Usage Prediction.",
                    "An Inter-Cloud Architecture for Future Internet Infrastructures."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "32nd PODC 2013",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2013",
                "sub_name": "ACM Symposium on Principles of Distributed Computing, PODC '13, Montreal, QC, Canada, July 22-24, 2013.",
                "count": 57,
                "papers": [
                    "Plenary talk.",
                    "Athena lecture: distributed computing theory for wireless networks and mobile systems.",
                    "Programming models for extreme-scale computing.",
                    "On deterministic abortable objects.",
                    "Pragmatic primitives for non-blocking data structures.",
                    "The SkipTrie: low-depth concurrent search without rebalancing.",
                    "Compact routing schemes with improved stretch.",
                    "Optimal deterministic routing and sorting on the congested clique.",
                    "Brief announcement: fair maximal independent sets in trees.",
                    "Brief announcement: threshold load balancing in networks.",
                    "Fast byzantine agreement.",
                    "Byzantine vector consensus in complete graphs.",
                    "Fast byzantine agreement in dynamic networks.",
                    "Synchronous byzantine agreement with nearly a cubic number of communication bits: synchronous byzantine agreement with nearly a cubic number of communication bits.",
                    "How to meet asynchronously at polynomial cost.",
                    "On the complexity of universal leader election.",
                    "Brief announcement: a simple stretch 2 distance oracle.",
                    "Brief announcement: pareto optimal solutions to consensus and set consensus.",
                    "Brief announcement: self-stabilizing resource discovery algorithm.",
                    "Brief announcement: parameterized model checking of fault-tolerant distributed algorithms by abstraction.",
                    "Brief announcement: on minimum interaction time for continuous distributed interactive computing.",
                    "Brief announcement: deterministic self-stabilizing leader election with O(log log n)-bits.",
                    "Brief announcement: scalable anonymous communication with byzantine adversary.",
                    "Brief announcement: brokerage and closure in a strategic model of social capital.",
                    "Brief announcement: techniques for programmatically troubleshooting distributed systems.",
                    "Stone age distributed computing.",
                    "Feedback from nature: an optimal distributed algorithm for maximal independent set selection.",
                    "What can be decided locally without identifiers?",
                    "Synchrony weakened by message adversaries vs asynchrony restricted by failure detectors.",
                    "Highly dynamic distributed computing with byzantine failures.",
                    "Brief announcement: constructing fault-tolerant overlay networks for topic-based publish/subscribe.",
                    "Brief announcement: byzantine agreement with a strong adversary in polynomial expected time.",
                    "Upper bound on the complexity of solving hard renaming.",
                    "Randomized loose renaming in O(log log n) time.",
                    "Byzantine renaming in synchronous systems with t<N.",
                    "An O(1)-barriers optimal RMRs mutual exclusion algorithm: extended abstract.",
                    "Fair and resilient incentive tree mechanisms.",
                    "What's a little collusion between friends?",
                    "A distributed algorithm for gathering many fat mobile robots in the plane.",
                    "Stable and scalable universal swarms.",
                    "Early-deciding consensus is expensive.",
                    "On the complexity of asynchronous agreement against powerful adversaries.",
                    "Introducing speculation in self-stabilization: an application to mutual exclusion.",
                    "Leaplist: lessons learned in designing tm-supported range queries.",
                    "A programming language perspective on transactional memory consistency.",
                    "Brief announcement: an asymmetric flat-combining based queue algorithm.",
                    "Brief announcement: resettable objects and efficient memory reclamation for concurrent algorithms.",
                    "Randomized broadcast in radio networks with collision detection.",
                    "Maximal independent sets in multichannel radio networks.",
                    "The cost of radio network broadcast for different models of unreliable links.",
                    "Connectivity and aggregation in multihop wireless networks.",
                    "The multi-agent rotor-router on the ring: a deterministic alternative to parallel random walks.",
                    "Efficient distributed source detection with limited bandwidth.",
                    "Distributed algorithms for barrier coverage using relocatable sensors.",
                    "Delegation of computation with verification outsourcing: curious verifiers.",
                    "Brief announcement: a shorter and stronger proof of an Ω(d log(n/d)) lower bound for broadcast in radio networks.",
                    "Brief announcement: a local approximation algorithm for MDS problem in anonymous planar networks."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "31st PODC 2012",
        "info": "Funchal, Madeira, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2012",
                "sub_name": "ACM Symposium on Principles of Distributed Computing, PODC '12, Funchal, Madeira, Portugal, July 16-18, 2012.",
                "count": 61,
                "papers": [
                    "Faster randomized consensus with an oblivious adversary.",
                    "On the liveness of transactional memory.",
                    "On the time and space complexity of randomized test-and-set.",
                    "Random walks which prefer unvisited edges.: exploring high girth even degree expanders in linear time.",
                    "Information spreading in dynamic graphs.",
                    "Coalescing random walks and voting on graphs.",
                    "The cost of fault tolerance in multi-party communication complexity.",
                    "The communication complexity of distributed task allocation.",
                    "Collaborative search on the plane without communication.",
                    "Brief announcement: what can be computed without communication?",
                    "Brief announcement: distributed algorithms for throughput performance in wireless networks.",
                    "Brief announcement: distributed cryptography using trinc.",
                    "Brief announcement: reconfigurable state machine replication from non-reconfigurable building blocks.",
                    "Brief announcement: all-to-all gradecast using coding with byzantine failures.",
                    "Brief announcement: there are plenty of tasks weaker than perfect renaming and stronger than set agreement.",
                    "Brief announcement: waiting in dynamic networks.",
                    "Brief announcement: optimal amortized secret sharing with cheater identification.",
                    "Brief announcement: efficient optimally resilient statistical AVSS and its applications.",
                    "Wait-freedom with advice.",
                    "Universal constructions that ensure disjoint-access parallelism and wait-freedom.",
                    "Generalized lattice agreement.",
                    "Distributed selfish load balancing with weights and speeds.",
                    "Making evildoers pay: resource-competitive broadcast in sensor networks.",
                    "Distributed public key schemes secure against continual leakage.",
                    "Distributed maximal matching: greedy is optimal.",
                    "Lower bounds for local approximation.",
                    "Weak models of distributed computing, with connections to modal logic.",
                    "Aggregation in dynamic networks.",
                    "Distributed connectivity of wireless networks.",
                    "Leader election in shared spectrum radio networks.",
                    "Brief announcement: achieving reliability in master-worker computing via evolutionary dynamics.",
                    "Brief announcement: breaking the O(nm) bit barrier, secure multiparty computation with a static adversary.",
                    "Brief announcement: maintaining large dense subgraphs on dynamic networks.",
                    "Brief announcement: decentralized network supercomputing in the presence of malicious and crash-prone workers.",
                    "Brief announcement: order-preserving renaming in synchronous message passing systems with byzantine faults.",
                    "Brief announcement: an obstacle to scalability in wireless networks.",
                    "Brief announcement: on the resilience of routing tables.",
                    "Brief announcement: a tight RMR lower bound for randomized mutual exclusion.",
                    "Brief announcement: From sequential to concurrent: correctness and relative efficiency.",
                    "Asynchronous failure detectors.",
                    "Simulations and reductions for colorless tasks.",
                    "A closer look at fault tolerance.",
                    "A simple approach for adapting continuous load balancing processes to discrete settings.",
                    "Dynamic packet scheduling in wireless networks.",
                    "Competitive and fair throughput for co-existing networks under adversarial interference.",
                    "On the (limited) power of non-equivocation.",
                    "On the price of equivocation in byzantine agreement.",
                    "Byzantine broadcast in point-to-point networks using local linear coding.",
                    "Brief announcement: network formation games can give rise to realistic networks.",
                    "Brief announcement: network-destabilizing attacks.",
                    "Brief announcement: tolerating permanent and transient value faults.",
                    "Brief announcement: efficient causality tracking in distributed storage systems with dotted version vectors.",
                    "Brief announcement: increasing the power of the iterated immediate snapshot model with failure detectors.",
                    "Brief announcement: delay or deliver dilemma in organization networks.",
                    "Brief announcement: live streaming with utilities, quality and cost.",
                    "Brief announcement: a calculus of policy-based routing systems.",
                    "Distributed algorithms for scheduling on line and tree networks.",
                    "Optimal distributed all pairs shortest paths and applications.",
                    "Iterative approximate byzantine consensus in arbitrary directed graphs.",
                    "Faster than optimal snapshots (for a while): preliminary version.",
                    "Strongly linearizable implementations: possibilities and impossibilities."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "30th PODC 2011",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2011",
                "sub_name": "Proceedings of the 30th Annual ACM Symposium on Principles of Distributed Computing, PODC 2011, San Jose, CA, USA, June 6-8, 2011.",
                "count": 65,
                "papers": [
                    "Coordinated consensus in dynamic networks.",
                    "Error-free multi-valued consensus with byzantine failures.",
                    "Byzantine agreement with homonyms.",
                    "Distributed graph coloring in a few rounds.",
                    "MIS on trees.",
                    "Toward more localized local algorithms: removing assumptions concerning global knowledge.",
                    "The complexity of robust atomic storage.",
                    "Resilience of mutual exclusion algorithms to transient memory faults.",
                    "Structuring unreliable radio networks.",
                    "The impact of memory models on software reliability in multiprocessors.",
                    "On the power of hardware transactional memory to simplify memory management.",
                    "A complexity separation between the cache-coherent and distributed shared memory models.",
                    "From bounded to unbounded concurrency objects and back.",
                    "Distributed deterministic edge coloring using bounded neighborhood independence.",
                    "The space complexity of long-lived and one-shot timestamp implementations.",
                    "Compact policy routing.",
                    "Locally checkable proofs.",
                    "Fault-tolerant spanners: better and simpler.",
                    "Adaptively secure broadcast, revisited.",
                    "Scalable rational secret sharing.",
                    "Analyzing consistency properties for fun and profit.",
                    "Distributed k-core decomposition.",
                    "Fork-consistent constructions from registers.",
                    "Unbounded contention resolution in multiple-access channels.",
                    "Tracking distributed aggregates over time-based sliding windows.",
                    "Accurate byzantine agreement with feedback.",
                    "B-neck: a distributed and quiescent max-min fair algorithm.",
                    "Information dissemination on multiple channels.",
                    "Robust data sharing with key-value stores.",
                    "Network synchronization and localization based on stolen signals.",
                    "Validity bound of regular registers with churn and byzantine processes.",
                    "Easy impossibility proofs for k-set agreement in message passing systems.",
                    "Solving the at-most-once problem with nearly optimal effectiveness.",
                    "Transforming worst-case optimal solutions for simultaneous tasks into all-case optimal solutions.",
                    "Optimal-time adaptive strong renaming, with applications to counting.",
                    "The round complexity of distributed sorting: extended abstract.",
                    "A tight unconditional lower bound on distributed randomwalk computation.",
                    "Minimum congestion mapping in a cloud.",
                    "Conflict on a communication channel.",
                    "The universe of symmetry breaking tasks.",
                    "Rationality authority for provable rational behavior.",
                    "Secure data structures based on multi-party computation.",
                    "Robust network supercomputing without centralized control.",
                    "On the hardness and approximation of minimum topic-connected overlay.",
                    "A generalization of multiple choice balls-into-bins.",
                    "A theory of goal-oriented communication.",
                    "Xheal: localized self-healing using expanders.",
                    "Fast and compact self stabilizing verification, computation, and fault detection of an MST.",
                    "Stability of a peer-to-peer communication system.",
                    "Scalability versus semantics of concurrent FIFO queues.",
                    "Distributed computing with rules of thumb.",
                    "Incentive-compatible distributed greedy protocols.",
                    "Sustaining collaboration in multicast despite rational collusion.",
                    "Reliable end-user communication under a changing packet network protocol.",
                    "Securing social networks.",
                    "Parallel and distributed programming extensions for mainstream languages based on pi-calculus.",
                    "A nonblocking set optimized for querying the minimum value.",
                    "Time bounds for shared objects in partially synchronous systems.",
                    "The inherent difficulty of timely primary-backup replication.",
                    "Randomized compact routing in decomposable metrics.",
                    "Partial reversal acyclicity.",
                    "Tight bounds on information dissemination in sparse mobile networks.",
                    "Order optimal information spreading using algebraic gossip.",
                    "Time-efficient randomized multiple-message broadcast in radio networks.",
                    "Faster information dissemination in dynamic networks via network coding."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "29th PODC 2010",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2010",
                "sub_name": "Proceedings of the 29th Annual ACM Symposium on Principles of Distributed Computing, PODC 2010, Zurich, Switzerland, July 25-28, 2010.",
                "count": 89,
                "papers": [
                    "The inherent complexity of transactional memory and what to do about it.",
                    "Transactional predication: high-performance concurrent sets and maps for STM.",
                    "On maintaining multiple versions in STM.",
                    "The multiplicative power of consensus numbers.",
                    "The k-bakery: local-spin k-exclusion using non-atomic reads and writes.",
                    "Group mutual exclusion in O(log n) RMR.",
                    "On asymmetric progress conditions.",
                    "Brief announcement: view transactions: transactional model with relaxed consistency checks.",
                    "Brief announcement: single-version permissive STM.",
                    "Brief announcement: NUMA-aware transactional memory.",
                    "Brief announcement: actions in the twilight - concurrent irrevocable transactions and inconsistency repair.",
                    "Brief announcement: on enhancing concurrency in distributed transactional memory.",
                    "Brief announcement: queuing or priority queuing? on the design of cache-coherence protocols for distributed transactional memory.",
                    "Brief announcement: k-shot distributed broadcasting in radio networks.",
                    "Brief announcement: a shared disk on distributed storage.",
                    "Brief announcement: on L-resilience, hitting sets, and colorless tasks.",
                    "Brief announcement: an efficient failure detector for omission environments.",
                    "Verifying linearizability with hindsight.",
                    "Eventually linearizable shared objects.",
                    "The topology of shared-memory adversaries.",
                    "Brief announcement: towards robust medium access in multi-hop networks.",
                    "Brief announcement: routing with obstacle avoidance mechanism with constant approximation ratio.",
                    "Brief announcement: ART--sub-logarithmic decentralized range query processing with probabilistic guarantees.",
                    "Brief announcement: pan and scan.",
                    "Brief announcement: complexity and solution of the send-receive correlation problem.",
                    "Brief announcement: distributed contention resolution in wireless networks.",
                    "Brief announcement: sources of instability in data center multicast.",
                    "Brief announcement: superpeer formation amidst churn and rewiring.",
                    "Brief announcement: self-monitoring in dynamic wireless networks.",
                    "Non-blocking binary search trees.",
                    "Adaptive randomized mutual exclusion in sub-logarithmic expected time.",
                    "Distributed data classification in sensor networks.",
                    "Partial information spreading with application to distributed maximum coverage.",
                    "Distributed computational complexities: are you volvo-addicted or nascar-obsessed?",
                    "Adaptive system anomaly prediction for large-scale hosting infrastructures.",
                    "Efficient threshold detection in a distributed environment: extended abstract.",
                    "Forbidden-set distance labels for graphs of bounded doubling dimension.",
                    "Efficient distributed random walks with applications.",
                    "On the theoretical gap between synchronous and asynchronous MPC protocols.",
                    "Hybrid-secure MPC: trading information-theoretic robustness for computational privacy.",
                    "Brief announcement: the price of anarchy for distributed network formation in an adversary model.",
                    "Brief announcement: swarming secrets.",
                    "Brief announcement: distributed trust management and revocation.",
                    "Brief announcement: realizing secure multiparty computation on incomplete networks.",
                    "Brief announcement: anonymity and trust in distributed systems.",
                    "Brief announcement: secret sharing based on the social behaviors of players.",
                    "Brief announcement: improving social-network-based sybil-resilient node admission control.",
                    "Brief announcement: communication efficient asynchronous byzantine agreement.",
                    "Brief announcement: perfectly secure message transmissiontolerating mobile mixed adversary with reduced phase complexity.",
                    "Meeting the deadline: on the complexity of fault-tolerant continuous gossip.",
                    "A new technique for distributed symmetry breaking.",
                    "On the computational power of oblivious robots: forming a series of geometric patterns.",
                    "Brief announcement: on the quest of optimal service ordering in decentralized queries.",
                    "Brief announcement: network traffic can optimize consolidation during transformation to virtualization.",
                    "Brief announcement: distributed almost stable marriage.",
                    "Brief announcement: decentralized construction of multicast trees embedded into P2P overlay networks based on virtual geometric coordinates.",
                    "Brief announcement: deterministic dominating set construction in networks with bounded degree.",
                    "Brief announcement: tree decomposition for faster concurrent data structures.",
                    "Brief announcement: efficient graph algorithms without synchronization.",
                    "Brief announcement: the accuracy of tree-based counting in dynamic networks.",
                    "Brief announcement: adaptive content placement for peer-to-peer video-on-demand systems.",
                    "Brief announcement: exponential speed-up of local algorithms using non-local communication.",
                    "Finding mobile data under delay constraints with searching costs.",
                    "On utilizing speed in networks of mobile agents.",
                    "Expansion and the cover time of parallel random walks.",
                    "Rapid randomized pruning for fast greedy distributed algorithms.",
                    "A certain freedom: thoughts on the CAP theorem.",
                    "Broadcasting in unreliable radio networks.",
                    "Discrete load balancing is (almost) as easy as continuous load balancing.",
                    "Locating a target with an agent guided by unreliable local advice: how to beat the random walk when you have a clock?",
                    "Distributed algorithms for edge dominating sets.",
                    "Fast flooding over Manhattan.",
                    "Bayesian ignorance.",
                    "Brief announcement: asynchronous bounded expected delay networks.",
                    "Brief announcement: locally-accessible implementations for distributed shared memory multiprocessors.",
                    "Brief announcement: capacity of byzantine agreement with finite link capacity - complete characterization of four-node networks.",
                    "Brief announcement: a framework for building self-stabilizing overlay networks.",
                    "Brief announcement: revisiting the power-law degree distribution for social graph analysis.",
                    "Brief announcement: collusion free protocol for rational secret sharing.",
                    "Brief announcement: leader election vs pattern formation.",
                    "Brief announcement: monotonic stabilization.",
                    "Brief announcement: modelling MapReduce for optimal execution in the cloud.",
                    "Deterministic distributed vertex coloring in polylogarithmic time.",
                    "Breaking the O(n2) bit barrier: scalable byzantine agreement with an adaptive adversary.",
                    "Optimal gradient clock synchronization in dynamic networks.",
                    "Online set packing and competitive scheduling of multi-part tasks.",
                    "How to meet when you forget: log-space rendezvous in arbitrary graphs.",
                    "A modular approach to shared-memory consensus, with applications to the probabilistic-write model.",
                    "Constant RMR solutions to reader writer synchronization."
                ]
            },
            {
                "sub_name_abbr": "conf/podc/2010wras",
                "sub_name": "Proceedings of the Third International Workshop on Reliability, Availability, and Security, WRAS 2010, conjunction with PODC 2010 Zurich, Switzerland, July 29, 2010.",
                "count": 9,
                "papers": [
                    "Conditions for the solvability of fault-tolerant consensus in asynchronous unknown networks: invited paper.",
                    "Accessing probabilistic quorums in dynamic networks.",
                    "Improving validity of query answering in dynamic systems.",
                    "Purifying data by machine learning with certainty levels.",
                    "Trust your social network according to satisfaction, reputation and privacy.",
                    "Robust architectures for open distributed systems and topological self-stabilization: invited paper.",
                    "An agent exploration in unknown undirected graphs with whiteboards.",
                    "Optimal exploration of small rings.",
                    "Self-stabilizing tiny interaction protocols."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "28th PODC 2009",
        "info": "Calgary, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2009",
                "sub_name": "Proceedings of the 28th Annual ACM Symposium on Principles of Distributed Computing, PODC 2009, Calgary, Alberta, Canada, August 10-12, 2009.",
                "count": 69,
                "papers": [
                    "Refining the way to consensus.",
                    "Memory models: a case for rethinking parallel languages and hardware.",
                    "Emerging challenges and opportunities in parallel computing: the cretaceous redux?",
                    "The life and times of a zookeeper.",
                    "Cassandra: structured storage system on a P2P network.",
                    "Pregel: a system for large-scale graph processing.",
                    "Preventing versus curing: avoiding conflicts in transactional memories.",
                    "Dynamic atomic storage without consensus.",
                    "Randomized mutual exclusion in O(log N / log log N) RMRs.",
                    "Max registers, counters, and monotone circuits.",
                    "Tight bounds for clock synchronization.",
                    "Load balancing without regret in the bulletin board model.",
                    "Concurrent imitation dynamics in congestion games.",
                    "Extracting quorum failure detectors.",
                    "The weakest failure detector for solving k-set agreement.",
                    "Simple and efficient asynchronous byzantine agreement with optimal resilience.",
                    "Partial synchrony based on set timeliness.",
                    "Fast scalable deterministic consensus for crash failures.",
                    "The forgiving graph: a distributed data structure for low stretch under adversarial attack.",
                    "A distributed polylogarithmic time algorithm for self-stabilizing skip graphs.",
                    "The flip markov chain and a randomising P2P protocol.",
                    "Correctness of gossip-based membership under message loss.",
                    "Fast distributed random walks.",
                    "Distributed and parallel algorithms for weighted vertex cover and other covering problems.",
                    "Return of the primal-dual: distributed metric facilitylocation.",
                    "The wireless synchronization problem.",
                    "SINR diagrams: towards algorithmically usable SINR models of wireless networks.",
                    "Coloring unstructured wireless multi-hop networks.",
                    "Oblivious interference scheduling.",
                    "Efficient broadcasting in known topology radio networks with long-range interference.",
                    "The effect of power-law degrees on the navigability of small worlds: [extended abstract].",
                    "Bounding the locality of distributed routing algorithms.",
                    "Parsimonious flooding in dynamic graphs.",
                    "Brief announcement: Stateless distributed algorithms for generalized packing linear programs.",
                    "Brief announcement: concurrent non-commutative boosted transactions.",
                    "Brief announcement: distributed phase synchronization of dynamic set of processes.",
                    "Brief announcement: how to speed-up fault-tolerant clock generation in VLSI systems-on-chip via pipelining.",
                    "Brief announcement: perfectly secure message transmission in directed networks re-visited.",
                    "Brief announcement: virtual world consistency: a new condition for STM systems.",
                    "Brief announcement: a note on distributed stable matching.",
                    "On a selfish caching game.",
                    "Brief announcement: non-self-stabilizing and self-stabilizing gathering in networks of mobile agents--the notion of speed.",
                    "The disagreement power of an adversary: extended abstract.",
                    "Brief announcement: weakest failure detectors via an egg-laying simulation.",
                    "Brief announcement: optimization based rate allocation for application layer multicast.",
                    "Brief announcement: the price of anonymity: optimal consensus despite asynchrony, crash and anonymity.",
                    "Brief announcement: minimum spanning trees and cone-based topology control.",
                    "Brief announcement: locality-based aggregate computation in wireless sensor networks.",
                    "Brief announcement: tight lower bounds for greedy routing in uniform small world rings.",
                    "Brief announcement: optimal self-stabilizing multi-token ring: a randomized solution.",
                    "Brief announcement: fast scalable Byzantine agreement in the full information model with a nonadaptive adversary.",
                    "Brief announcement: PUSH, a DISC shell.",
                    "Brief announcement: deaf, dumb, and chatting robots.",
                    "Brief announcement: global consistency can be easier than point-to-point communication.",
                    "Vertical paxos and primary-backup replication.",
                    "Brief announcement: topology knowledge affects probabilistic reliable communication.",
                    "Brief announcement: a platform for experimenting with mobile algorithms in a laboratory.",
                    "Brief announcement: the theory of network tracing.",
                    "Brief announcement: (more) efficient pruning of ad-hoc wireless networks.",
                    "Brief announcement: self-assembly as graph grammar as distributed system.",
                    "Distributed discovery of large near-cliques.",
                    "Brief announcement: lightweight key agreement and digital certificates for wireless sensor networks.",
                    "Brief announcement: distributed algorithms for approximating wireless network capacity.",
                    "Brief announcement: hardness of broadcasting in wireless networks with unreliable communication.",
                    "Brief announcement: complexity analysis and algorithm design for pipeline configuration in distributed networks.",
                    "Brief announcement: exactly electing a unique leader is not harder than computing symmetric functions on anonymous quantum networks.",
                    "Brief announcement: impossibility results for optimistic fair exchange with multiple autonomous arbiters.",
                    "Brief announcement: collaborative measurement of upload speeds in P2P systems.",
                    "Brief announcement: new bounds for the controller problem."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "27th PODC 2008",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2008",
                "sub_name": "Proceedings of the Twenty-Seventh Annual ACM Symposium on Principles of Distributed Computing, PODC 2008, Toronto, Canada, August 18-21, 2008.",
                "count": 92,
                "papers": [
                    "Beyond nash equilibrium: solution concepts for the 21st century.",
                    "The internet is flat: a brief history of networking in the next ten years.",
                    "Accountability for distributed systems.",
                    "Distributed computation of the mode.",
                    "Sublogarithmic distributed MIS algorithm for sparse graphs using nash-williams decomposition.",
                    "A log-star distributed maximal independent set algorithm for growth-bounded graphs.",
                    "A jamming-resistant MAC protocol for single-hop wireless networks.",
                    "Anti-Omega: the weakest failure detector for set agreement.",
                    "Failure detectors in loosely named systems.",
                    "Every problem has a weakest failure detector.",
                    "Sharing is harder than agreeing.",
                    "Collaborative enforcement of firewall policies in virtual private networks.",
                    "Secure communication over radio channels.",
                    "On tradeoff between network connectivity, phase complexity and communication complexity of reliable communication tolerating mixed adversary.",
                    "CAR-STM: scheduling-based collision avoidance and resolution for software transactional memory.",
                    "On the complexity of asynchronous gossip.",
                    "Brahms: byzantine resilient random membership sampling.",
                    "Efficient randomised broadcasting in random regular networks with applications in peer-to-peer systems.",
                    "Bounded budget connection (BBC) games or how to make friends and influence people, on a budget.",
                    "On a capacitated multivehicle routing problem.",
                    "Improved compact routing schemes for dynamic trees.",
                    "Tight bounds for delay-sensitive aggregation.",
                    "The forgiving tree: a self-healing distributed data structure.",
                    "Flooding time in edge-Markovian dynamic graphs.",
                    "On the effect of the deployment setting on broadcasting in Euclidean radio networks.",
                    "Virtual infrastructure for collision-prone wireless networks.",
                    "Sleeping on the job: energy-efficient and robust broadcast for radio networks.",
                    "Distributed algorithms for ultrasparse spanners and linear size skeletons.",
                    "Efficient distributed approximation algorithms via probabilistic tree embeddings.",
                    "On the locality of distributed sparse spanner construction.",
                    "The stretched exponential distribution of internet media access patterns.",
                    "New combinatorial topology upper and lower bounds for renaming.",
                    "Timeliness-based wait-freedom: a gracefully degrading progress condition.",
                    "Lower bounds for randomized consensus under a weak adversary.",
                    "Randomized consensus in expected O(n log n) individual work.",
                    "Packet mode and QoS algorithms for buffered crossbar switches with FIFO queuing.",
                    "The impact of randomization in smoothing networks.",
                    "Optimizing data popularity conscious bloom filters.",
                    "Distributed order scheduling and its application to multi-core dram controllers.",
                    "Asynchronous exclusive selection.",
                    "Fast self-stabilizing byzantine tolerant digital clock synchronization.",
                    "OCD: obsessive consensus disorder (or repetitive consensus).",
                    "An almost-surely terminating polynomial protocol forasynchronous byzantine agreement with optimal resilience.",
                    "Forget him and keep on moving.",
                    "Online and dynamic embeddings of approximate ultrametrics.",
                    "Dynamic routing and location services in metrics of low doubling dimension.",
                    "On ad hoc routing with guaranteed delivery.",
                    "On the internet delay space dimensionality.",
                    "Maximizing quorum availability in multi-clustered systems.",
                    "BMobi_Causal: a causal broadcast protocol in mobile dynamic groups.",
                    "Correctness criteria for replicated database systems with snapshot isolation replicas.",
                    "The asynchronous bounded-cycle model.",
                    "Model checking transactional memory with spin.",
                    "On the robustness of (semi) fast quorum-based implementations of atomic shared memory.",
                    "Principles of untrusted storage: a new look at consistency conditions.",
                    "A fast distributed slicing algorithm.",
                    "A dynamic exchange game.",
                    "Anonymous and censorship resistant content sharing in unstructured overlays.",
                    "Our brothers' keepers.",
                    "Distributed churn measurement in arbitrary networks.",
                    "Efficient pipeline configuration in distributed heterogeneous computing environments.",
                    "A tradeoff analysis on message complexity and lifetime optimality for a distributed multicast algorithm in WSNs.",
                    "Nearest-neighbor graphs on random point sets and their applications to sensor networks.",
                    "From anarchy to geometric structuring: the power of virtual coordinates.",
                    "Balancing energy consumption for uniform data gathering wireless sensor networks.",
                    "Scheduling sensors by tilinglattices.",
                    "Power management of devices: when should i switch off?",
                    "Greedy distributed optimization of unsplittable multicommodity flows.",
                    "Stateless distributed algorithms for near optimal maximum multicommodity flows.",
                    "Distributed averaging in the presence of a sparse cut.",
                    "Gossip-based aggregate computation: computing faster with non address-oblivious schemes.",
                    "Snap-stabilization in message-passing systems.",
                    "Dynamic service assignment in mobile networks: the magma approach.",
                    "Quantum distributed consensus.",
                    "Looking for the optimal conditions for solving set agreement.",
                    "Tight RMR lower bounds for mutual exclusion and other problems.",
                    "Closing the complexity gap between mutual exclusion and FCFS mutual exclusion.",
                    "Fault-tolerant implementations of atomic registers by safe registers in networks.",
                    "Optimal failure detection with low sporadic overhead and communication locality.",
                    "Optimizing consistency checking for memory-intensive transactions.",
                    "Wait-free programming for general purpose computations on graphics processors.",
                    "Transactional memory retry mechanisms.",
                    "Scheduling tasks with dependencies on asymmetric multiprocessors.",
                    "The lotus-eater attack.",
                    "Extracting models from design documents with mapster.",
                    "Efficient single phase unconditionally secure message transmission with optimum communication complexity.",
                    "Mobile proactive secret sharing.",
                    "Evolution of distributed computing theory: from concurrency to networks and beyond.",
                    "A world of (Im) possibilities.",
                    "The power of simulation relations.",
                    "On fault tolerance and wireless networks.",
                    "The future of distributed computing: renaissance or reformation?"
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "26th PODC 2007",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2007",
                "sub_name": "Proceedings of the Twenty-Sixth Annual ACM Symposium on Principles of Distributed Computing, PODC 2007, Portland, Oregon, USA, August 12-15, 2007.",
                "count": 81,
                "papers": [
                    "Transactional memory for a modern microprocessor.",
                    "The Akamai approach to achieving performance and reliability on the internet.",
                    "Constant-RMR implementations of CAS and other synchronization primitives using read and write operations.",
                    "SNZI: scalable NonZero indicators.",
                    "Abortable and query-abortable objects and their efficient implementation.",
                    "Time-optimal, space-efficient single-scanner snapshots & multi-scanner snapshots using CAS.",
                    "Reconstructing approximate tree metrics.",
                    "A randomized distributed algorithm for the maximal independent set problem in growth-bounded graphs.",
                    "Improved sparse covers for graphs excluding a fixed minor.",
                    "Compact routing with slack in low doubling dimension.",
                    "Compact routing with slack.",
                    "Towards fast decentralized construction of locality-aware overlay networks.",
                    "On the complexity of greedy routing in ring-based peer-to-peer networks.",
                    "Constructing scalable overlays for pub-sub with many topics.",
                    "Refined quorum systems.",
                    "Efficient fork-linearizable access to untrusted shared memory.",
                    "Verifying distributed erasure-coded data.",
                    "Truth in advertising: lightweight verification of route integrity.",
                    "Countering web spam with credibility-based link analysis.",
                    "Distributed approximate matching.",
                    "Controller and estimator for dynamic networks.",
                    "A near-optimal distributed fully dynamic algorithm for maintaining sparse spanners.",
                    "Broadcasting in udg radio networks with unknown topology.",
                    "Communication in dynamic radio networks.",
                    "Time-decaying sketches for sensor data aggregation.",
                    "Summarizing data using bottom-k sketches.",
                    "On the weakest failure detector ever.",
                    "Tolerating corrupted communication.",
                    "Optimal inter-object correlation when replicating for availability.",
                    "Graceful degradation via versions: specifications and implementations.",
                    "Greedy distributed optimization of multi-commodity flows.",
                    "Distributed network monitoring and multicommodity flows: a primal-dual approach.",
                    "The price of anarchy in network creation games.",
                    "Network formation games with local coalitions.",
                    "Partition approach to failure detectors for k-set agreement.",
                    "Failure detectors are schedulers.",
                    "Bounded wait-free implementation of optimally resilient byzantine storage without (unproven) cryptographic assumptions.",
                    "Remote storage with byzantine servers.",
                    "Towards the minimal synchrony for byzantine consensus.",
                    "Multicoordinated Paxos.",
                    "The complexity of updating multi-writer snapshot objects.",
                    "From an intermittent rotating star to a leader.",
                    "Constant phase efficient protocols for secure message transmission in directed networks.",
                    "Space adaptation: privacy-preserving multiparty collaborative mining with geometric perturbation.",
                    "Practical private computation of vector addition-based functions.",
                    "Integrated resource allocation in heterogeneous SAN data centers.",
                    "d-clock: distributed QoS in heterogeneous resource environments.",
                    "Configurations: a model for distributed data storage.",
                    "A formal treatment of an abstract channel implementation using java sockets and TCP.",
                    "Transactions and privatization in Delaunay triangulation.",
                    "Privatization techniques for software transactional memory.",
                    "From causal to z-linearizable transactional memory.",
                    "The power of DCAS: highly-concurrent software transactional memory.",
                    "Object replication degree customization for high availability.",
                    "Sharpness, a tight condition for throughput scalability.",
                    "An analysis of intention preservation in group editors.",
                    "The coBFIT toolkit.",
                    "On local representation of distances in trees.",
                    "Minimizing the total cost of network measurements in a distributed manner: a primal-dual approach.",
                    "Game authority for robust andscalable distributed selfish-computer systems.",
                    "Theory of BAR games.",
                    "An algorithm composition scheme preserving monotonicity.",
                    "An incentive-compatible multi-armed bandit mechanism.",
                    "On cost sharing mechanisms in the network design game.",
                    "Asynchronous recommendation systems.",
                    "Bringing order to BGP: decreasing time and message complexity.",
                    "A denial-of-service resistant DHT.",
                    "Measuring robustness of superpeer topologies.",
                    "SuperTrust: a secure and efficient framework for handling trust in super-peer networks.",
                    "Toward an optimal social network defense against Sybil attacks.",
                    "Trinity: distributed defense against transient spam-bots.",
                    "Non-searchability of random scale-free graphs.",
                    "Distributed broadcasting and mapping protocols in directed anonymous networks.",
                    "Optimal atomic broadcast and multicast algorithms for wide area networks.",
                    "Solvability of geocasting in mobile ad-hoc networks.",
                    "Geographic gossip on geometric random graphs via affine combinations.",
                    "Practical summation via gossip.",
                    "Distributed algorithms for dynamic coverage in sensor networks.",
                    "DoS-resilient secure aggregation queries in sensor networks.",
                    "Self-stabilizing counting in mobile sensor networks.",
                    "Paxos made live: an engineering perspective."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "25th PODC 2006",
        "info": "Denver, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2006",
                "sub_name": "Proceedings of the Twenty-Fifth Annual ACM Symposium on Principles of Distributed Computing, PODC 2006, Denver, CO, USA, July 23-26, 2006.",
                "count": 38,
                "papers": [
                    "The art of multiprocessor programming.",
                    "Century papers at the first quarter-century milestone.",
                    "Distributed social systems.",
                    "On the complexity of distributed graph coloring.",
                    "Quorum placement in networks: minimizing network congestion.",
                    "Distributed verification of minimum spanning trees.",
                    "When selfish meets evil: byzantine players in a virus inoculation game.",
                    "Routing without regret: on convergence to nash equilibria of regret-minimizing algorithms in routing games.",
                    "Distributed computing meets game theory: robust mechanisms for rational secret sharing and multiparty computation.",
                    "EquiCast: scalable multicast with selfish users.",
                    "Grouped distributed queues: distributed queue, proportional share multiprocessor scheduling.",
                    "Sketching asynchronous streams over a sliding window.",
                    "Adversarial queuing on the multiple-access channel.",
                    "Veracity radius: capturing the locality of distributed computations.",
                    "Life is not a state-machine: the long road from research to production.",
                    "Computing separable functions via gossip.",
                    "Peer counting and sampling in overlay networks: random walk methods.",
                    "On the topologies formed by selfish peers.",
                    "Self-stabilizing byzantine agreement.",
                    "Irreducibility and additivity of set agreement-oriented failure detector classes.",
                    "Optimally efficient multi-valued byzantine agreement.",
                    "Timeliness, failure-detectors, and consensus performance.",
                    "Oracle size: a new measure of difficulty for communication tasks.",
                    "Object location using path separators.",
                    "Optimal-stretch name-independent compact routing in doubling metrics.",
                    "Local approximation schemes for topology control.",
                    "Common2 extended to stacks and unbounded concurrency.",
                    "Single-scanner multi-writer snapshot implementations are fast!",
                    "An O(1) RMRs leader election algorithm.",
                    "How fast can a very robust read be?",
                    "Reliable broadcast in radio networks: the bounded collision case.",
                    "Possibility and complexity of probabilistic reliable communication in directed networks.",
                    "An Omega (n log n) lower bound on the cost of mutual exclusion.",
                    "Lower bound for scalable Byzantine Agreement.",
                    "Stably computable predicates are semilinear.",
                    "Synchronizing without locks is inherently expensive.",
                    "Transactional contention management as a non-clairvoyant scheduling problem.",
                    "Towards a theory of transactional contention managers."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "24th PODC 2005",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2005",
                "sub_name": "Proceedings of the Twenty-Fourth Annual ACM Symposium on Principles of Distributed Computing, PODC 2005, Las Vegas, NV, USA, July 17-20, 2005.",
                "count": 58,
                "papers": [
                    "A topological characterization of weakness.",
                    "Proof labeling schemes.",
                    "Efficient dependency tracking for relevant events in shared-memory systems.",
                    "Policy-hiding access control in open environment.",
                    "Brief announcement: a flexible framework for secret handshakes.",
                    "Brief announcement: strong detection of misconfigurations.",
                    "Distance estimation and object location via rings of neighbors.",
                    "Building scalable and robust peer-to-peer overlay networks for broadcasting using network coding.",
                    "On the locality of bounded growth.",
                    "Skip-webs: efficient distributed data structures for multi-dimensional data sets.",
                    "Efficient lookup on unstructured topologies.",
                    "Quorum placement in networks to minimize access delays.",
                    "Brief announcement: ring-like DHTs and the postage stamp problem.",
                    "Brief announcement: the overlay network content distribution problem.",
                    "The price of selfish behavior in bilateral network formation.",
                    "Facility location: distributed approximation.",
                    "Primal-dual based distributed algorithms for vertex cover with semi-hard capacities.",
                    "Brief announcement: on the expected overpayment of VCG mechanisms in large networks.",
                    "Brief announcement: an incentive-compatible capacity assignment algorithm for bulk data distribution using P2P.",
                    "Brief announcement: distributed algorithmic mechanism design for scheduling.",
                    "Faster communication in known topology radio networks.",
                    "On reliable broadcast in a radio network.",
                    "Maximal independent sets in radio networks.",
                    "On selection problem in radio networks.",
                    "Brief announcement: broadcast in radio networks in the presence of byzantine adversaries.",
                    "Brief announcement: exploring the consistency problem space.",
                    "Fast fault-tolerant agreement algorithms.",
                    "The combined power of conditions and failure detectors to solve asynchronous set agreement.",
                    "The weakest failure detector to solve nonuniform consensus.",
                    "Consensus and collision detectors in wireless Ad Hoc networks.",
                    "Brief announcement: minimal system conditions to implement unreliable failure detectors.",
                    "Brief announcement: on the possibility and the impossibility of message-driven self-stabilizing failure detection.",
                    "Routing complexity of faulty networks.",
                    "Feedback control for router congestion resolution.",
                    "Competitive weighted throughput analysis of greedy protocols on DAGs.",
                    "Brief announcement: continuous containment and local stabilization in path-vector routing.",
                    "Brief announcement: gradient clock synchronization in sensor networks.",
                    "Brief announcement: evaluation of tree-based data gathering algorithms for wireless sensor networks.",
                    "Advanced contention management for dynamic software transactional memory.",
                    "Efficient multi-word locking using randomization.",
                    "Toward a theory of transactional contention managers.",
                    "Stochastic analysis of distributed deadlock scheduling.",
                    "Brief announcement: analysis of a randomized contention-resolution protocol for distributed access.",
                    "Brief announcement: improved asynchronous group mutual exclusion in token-passing networks.",
                    "Adaptive routing with stale information.",
                    "A network pricing game for selfish traffic.",
                    "Correctness of a gossip based membership protocol.",
                    "A scheme for load balancing in heterogenous distributed hash tables.",
                    "On the establishment of distinct identities in overlay networks.",
                    "Brief announcement: controlled quorum selection in arbitrary topologies.",
                    "Brief announcement: coupling for Markov decision processes - application to self-stabilization with arbitrary schedulers.",
                    "Brief announcement: virtual stationary automata for mobile networks.",
                    "Simultaneous broadcast revisited.",
                    "Feasibility and complexity of broadcasting with random transmission failures.",
                    "Reliable broadcast in unknown fixed-identity networks.",
                    "Brief announcement: dynamic interoperable point-to-point connection of MPI implementations.",
                    "Brief announcement: wait-free implementation of multiple-writers/multiple-readers atomic byzantine data storage systems.",
                    "Brief announcement: abstractions for implementing atomic objects in dynamic systems."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "23rd PODC 2004",
        "info": "St. John's, Newfoundland, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2004",
                "sub_name": "Proceedings of the Twenty-Third Annual ACM Symposium on Principles of Distributed Computing, PODC 2004, St. John's, Newfoundland, Canada, July 25-28, 2004.",
                "count": 75,
                "papers": [
                    "Completely fair SFE and coalition-safe cheap talk.",
                    "Mechanism design for policy routing.",
                    "Selfish caching in distributed systems: a game-theoretic analysis.",
                    "Bringing practical lock-free synchronization to 64-bit applications.",
                    "An almost non-blocking stack.",
                    "Lock-free linked lists and skip lists.",
                    "Lower bounds for adaptive collect and related objects.",
                    "Efficient synchronous snapshots.",
                    "On the inherent weakness of conditional synchronization primitives.",
                    "Specification faithfulness in networks with rational nodes.",
                    "On the expected payment of mechanisms for task allocation.",
                    "On spectrum sharing games.",
                    "Load balancing and locality in range-queriable data structures.",
                    "Choosing a random peer.",
                    "Bounds for the convergence rate of randomized local search in a multiplayer load-balancing game.",
                    "Compact routing on euclidian metrics.",
                    "When graph theory helps self-stabilization.",
                    "Efficient algorithms for constructing (1+, varepsilon;, beta)-spanners in the distributed and streaming models.",
                    "Eclecticism shrinks even small worlds.",
                    "Analyzing Kleinberg's (and other) small-world Models.",
                    "Tradeoffs between stretch factor and load balancing ratio in routing on growth restricted graphs.",
                    "Balanced binary trees for ID management and load balance in distributed hash tables.",
                    "Efficient top-K query calculation in distributed networks.",
                    "On the design of distributed protocols from differential equations.",
                    "Byzantine disk paxos: optimal resilience with byzantine shared memory.",
                    "How fast can a distributed atomic read be?",
                    "Signed quorum systems.",
                    "Competitive on-line paging strategies for mobile users under delay constraints.",
                    "A better wake-up in radio networks.",
                    "Broadcast in radio networks tolerating byzantine adversarial behavior.",
                    "A note on efficient aggregate queries in sensor networks.",
                    "Computation in networks of passively mobile finite-state sensors.",
                    "What cannot be computed locally!",
                    "Geometrically aware communication in random wireless networks.",
                    "Gradient clock synchronization.",
                    "Communication-efficient leader election and consensus with limited link synchrony.",
                    "The weakest failure detectors to solve certain fundamental problems in distributed computing.",
                    "Group membership: a novel approach and the first single-round algorithm.",
                    "Asynchronous group key exchange with failures.",
                    "Brief announcement: stretch between nearby peers.",
                    "Brief announcement: prefix hash tree.",
                    "Brief announcement: detecting malicious routers.",
                    "Brief announcement: a single enqueuer wait-free queue implementation.",
                    "Brief Announcement: constraint-based synchronization and verification of concurrent programs.",
                    "Brief announcement: completing the lock-free dynamic cycle.",
                    "Brief announcement: implementing multi-word atomic snapshots on current hardware.",
                    "Brief announcement: exposing and eliminating vulnerabilities to denial of service attacks in secure gossip-based multicast.",
                    "Brief announcement: spoofing prevention method.",
                    "Brief announcement: concurrent maintenance of rings.",
                    "Brief announcement: self-stabilizing distance-d distinct labels via enriched fair composition.",
                    "Brief announcement: STALK: a self-stabilizing hierarchical tracking service for sensor networks.",
                    "Brief announcement: linear time byzantine self-stabilizing clock synchronization.",
                    "Brief announcement: randomized rumor spreading with fewer phone calls.",
                    "Brief announcement: an incremental algorithm for calculation of backup-paths in link-state networks.",
                    "Brief announcement: name-independent compact routing in trees.",
                    "Brief announcement: towards a secure indirection infrastructure.",
                    "Brief announcement: Trilix: a scalable unstructured lookup system for dynamic environments.",
                    "Brief announcement: virtual mobile nodes for mobile ad hoc networks.",
                    "Brief announcement: reconfigurable byzantine-fault-tolerant atomic memory.",
                    "Brief announcement: adaptive balancing networks.",
                    "Brief announcement: building an adaptive distributed web server system on the fly for handling web hotspots.",
                    "Brief announcement: the design of an internet-scale monitoring and assertion-checking infrastructure.",
                    "Brief announcement: Cataclysm: handling extreme overloads in internet services.",
                    "Brief announcement: polygonal broadcast, secret maturity and the firing sensors.",
                    "Brief announcement: optimal asynchronous garbage collection for checkpointing protocols with rollback-dependency trackability.",
                    "Brief announcement: RT oblivious erasure correcting.",
                    "Brief announcement: secret handshakes from CA-oblivious encryption.",
                    "Brief announcement: degree: optimal deterministic routing for P2P systems.",
                    "Brief announcement: efficient clustering in unstructured radio networks.",
                    "Brief announcement: on the round complexity of distributed consensus over synchronous networks.",
                    "Brief announcement: veto number and the respective power of eventual failure detectors.",
                    "Brief announcement: the synchronous condition-based consensus hierarchy.",
                    "Brief announcement: efficient implementation of a byzantine data storage system.",
                    "Brief announcement: on the inherent cost of generic broadcast.",
                    "Brief announcement: on the possibility of consensus in asynchronous systems with finite average response times."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "22nd PODC 2003",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2003",
                "sub_name": "Proceedings of the Twenty-Second ACM Symposium on Principles of Distributed Computing, PODC 2003, Boston, Massachusetts, USA, July 13-16, 2003.",
                "count": 55,
                "papers": [
                    "Cryptography and competition policy: issues with 'trusted computing'.",
                    "Working with mike on distributed computing theory, 1978--1992.",
                    "Simple and fast optimistic protocols for fair electronic exchange.",
                    "Fischer's cryptographic protocols.",
                    "Constant-time distributed dominating set approximation.",
                    "Distributed error confinement.",
                    "Compact roundtrip routing with topology-independent node names.",
                    "A new approach to on-demand loop-free routing in ad hoc networks.",
                    "Geometric ad-hoc routing: of theory and practice.",
                    "Broadcasting in undirected ad hoc radio networks.",
                    "Brief announcement: cluster-based control mechanism for communication networks.",
                    "Operation-valency and the cost of coordination.",
                    "Software transactional memory for dynamic-sized data structures.",
                    "Split-ordered lists: lock-free extensible hash tables.",
                    "Brief announcement: concurrent counting is harder than queuing.",
                    "Brief announcement: dynamic group communication.",
                    "Scalable and dynamic quorum systems.",
                    "Peer-to-peer systems for prefix search.",
                    "Routing networks for distributed hash tables.",
                    "Asynchronous resource discovery.",
                    "Brief announcement: an overview of the content-addressable network D2B.",
                    "Brief announcement: deterministic skipnet.",
                    "An asynchronous protocol for distributed computation of RSA inverses and its applications.",
                    "Efficient revocation and threshold pairing based cryptosystems.",
                    "Constructing fair-exchange protocols for E-commerce via distributed computation of RSA signatures.",
                    "Oblivious signature-based envelope.",
                    "Scalable public-key tracing and revoking.",
                    "Brief announcement: impossibility results for concurrent secure two-party computation.",
                    "Brief announcement: a method for exchanging valuable data: how to realize matching oblivious transfer.",
                    "Distributed consensus in the presence of sectional faults.",
                    "Efficient player-optimal protocols for strong and differential consensus.",
                    "tight bounds for k-set agreement with limited-scope failure detectors.",
                    "Brief announcement: early decision despite general process omission failures.",
                    "Proactive secure message transmission in asynchronous networks.",
                    "Efficient reliable communication over partially authenticated networks.",
                    "Algorithms for dynamic multicast key distribution trees.",
                    "Brief announcement: efficient perfectly secure communication over synchronous networks.",
                    "Brief announcement: building data structures on untrusted peer-to-peer storage with per-participant logs.",
                    "Brief announcement: extending SQL access control to derived and distributed data.",
                    "A work-optimal deterministic algorithm for the asynchronous certified write-all problem.",
                    "Performing work with asynchronous processors: message-delay-sensitive bounds.",
                    "Fair group mutual exclusion.",
                    "Efficient and practical constructions of LL/SC variables.",
                    "Adaptive and efficient abortable mutual exclusion.",
                    "Automatic discovery of mutual exclusion algorithms.",
                    "On implementing omega with weak reliability and synchrony assumptions.",
                    "On using network attached disks as shared memory.",
                    "A lattice-theoretic characterization of safety and liveness.",
                    "Brief announcement: branching time refinement.",
                    "Brief announcement: efficient replication of large data objects.",
                    "Brief announcement: efficient flooding in power-law networks.",
                    "Scaling properties of the Internet graph.",
                    "On a network creation game.",
                    "Adaptive AIMD congestion control.",
                    "Adapting to a reliable network path."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "21st PODC 2002",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2002",
                "sub_name": "Proceedings of the Twenty-First Annual ACM Symposium on Principles of Distributed Computing, PODC 2002, Monterey, California, USA, July 21-24, 2002.",
                "count": 43,
                "papers": [
                    "Nonatomic mutual exclusion with local spinning.",
                    "Space-optimal multi-writer snapshot objects are slow.",
                    "Safe memory reclamation for dynamic lock-free objects using atomic reads and writes.",
                    "Non-blocking timeout in scalable queue-based spin locks.",
                    "Establishing wireless conference calls under delay constraints.",
                    "Efficient algorithms for leader election in radio networks.",
                    "GS3: scalable self-configuration and self-healing in wireless networks.",
                    "Lexicographically optimal smoothing for broadband traffic multiplexing.",
                    "Active disk paxos with infinitely many processes.",
                    "The inherent price of indulgence.",
                    "Minimal replication cost for availability.",
                    "Building secure file systems out of Byzantine storage.",
                    "Detectable byzantine agreement secure against faulty majorities.",
                    "Building responseive TMR-based servers in presence of timing constraints.",
                    "Exploiting precision vs. efficiency tradeoffs in symmetric replication environments.",
                    "Towards a formal model for view maintenance in data warehouses.",
                    "A highly concurrent group mutual /-exclusion algorithm0.",
                    "Dynamic-sized lock-free data structures.",
                    "Optimally work-competitive scheduling for cooperative computing with merging groups.",
                    "Assignment-based partitioning in a condition monitoring system.",
                    "Nearly optimal FIFO buffer management for DiffServ.",
                    "Optmial plans for aggregation.",
                    "Searching for a black hole in arbitrary networks: optimal mobile agent protocols.",
                    "General perfectly periodic scheduling.",
                    "A BGP-based mechanism for lowest-cost routing.",
                    "Viceroy: a scalable and dynamic emulation of the butterfly.",
                    "On perfectly secure cmmunication over arbitrary networks.",
                    "Sequential composition of protocols without simultaneous termination.",
                    "Squirrel: a decentralized peer-to-peer web cache.",
                    "Fault-tolerant routing in peer-to-peer systems.",
                    "Analysis of the evolution of peer-to-peer systems.",
                    "Evaluating the running time of a communication round over the internet.",
                    "Asynchronous interactive consistency and its relation with error-correcting codes.",
                    "Selective anti-entropy.",
                    "Compact routing for average-case networks.",
                    "How to wait when you are not going to block.",
                    "Understanding perfect failure detectors.",
                    "Early stopping in aglobal data computation.",
                    "Random walk for self-stabilitzing group communication in ad hoc networks.",
                    "Two-handed emulation: how to build non-blocking implementation of complex data-structures using DCAS.",
                    "f-arrays: implementation and applications.",
                    "Non-blocking steal-half work queues.",
                    "Dynamic and self-stabilizing distributed matching."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "20th PODC 2001",
        "info": "Newport, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2001",
                "sub_name": "Proceedings of the Twentieth Annual ACM Symposium on Principles of Distributed Computing, PODC 2001, Newport, Rhode Island, USA, August 26-29, 2001.",
                "count": 42,
                "papers": [
                    "Lamport on mutual exclusion: 27 years of planting seeds.",
                    "The ABCD's of Paxos.",
                    "Sticks and stones: a coding scheme for parameterized verification.",
                    "Leslie Lamport's properties and actions.",
                    "Implementing atomic objects in a dynamic environment.",
                    "The LATEX legacy: 2.09 and all that.",
                    "On beyond registers: wait-free readable objects.",
                    "Restoration by path concatenation: fast recovery of MPLS paths.",
                    "Computing almost shortest paths.",
                    "Distributed MST for constant diameter graphs.",
                    "String realizers of posets with applications to distributed computing.",
                    "On the generalized dining philosophers problem.",
                    "An improved lower bound for the time complexity of mutual exclusion.",
                    "A note on group mutual exclusion.",
                    "Nearly optimal perfectly-periodic schedules.",
                    "The do-all problem in broadcast networks.",
                    "Competitive concurrent distributed queuing.",
                    "Bandwidth constrained placement in a WAN.",
                    "Compressed bloom filters.",
                    "A hierarchy of conditions for consensus solvability.",
                    "The concurrency hierarchy, and algorithms for unbounded concurrency.",
                    "On scalable and efficient distributed failure detectors.",
                    "Average probe complexity in quorum systems.",
                    "Lock-free reference counting.",
                    "Detecting distributed cycles of garbage in large-scale systems.",
                    "The IceCube approach to the reconciliation of divergent replicas.",
                    "Exploitng event stream interpretation in publish-subscribe systems.",
                    "Replicated condition monitoring.",
                    "Computing property-preserving behaviour abstractions from trace reductions: abstraction-based verification of linear-time properties under fairness.",
                    "Reliability and performance of hierarchical RAID with multiple controllers.",
                    "Distributed multi-broadcast in unknown radio networks.",
                    "Analysis of a cone-based distributed topology control algorithm for wireless multi-hop networks.",
                    "Practical multi-candidate election system.",
                    "An optimally robust hybrid mix network.",
                    "Selective private function evaluation with applications to private statistics.",
                    "Optimal scheduling for disconnected cooperation.",
                    "Adding networks.",
                    "Randomized shared queues.",
                    "Dynamic input/output automata, a formal model for dynamic systems.",
                    "A framework for semantic reasoning about Byzantine quorum systems.",
                    "An efficient communication strategy for ad-hoc mobile networks.",
                    "Correction: practical implementations of non-blocking synchronization primitives."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "19th PODC 2000",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/2000",
                "sub_name": "Proceedings of the Nineteenth Annual ACM Symposium on Principles of Distributed Computing, July 16-19, 2000, Portland, Oregon, USA.",
                "count": 48,
                "papers": [
                    "Distributed algorithms in TLA (abstract).",
                    "A middleware overview: goals, research issues, and coded examples (abstract).",
                    "Data communications vs. distributed computing (abstract).",
                    "How computer architecture trends may affect future distributed systems: from infiniBand clusters to inter-processor speculation (abstract).",
                    "Towards robust distributed systems (abstract).",
                    "Interval routing schemes allow broadcasting with linear message-complexity (extended abstract).",
                    "Optimal smoothing schedules for real-time streams (extended abstract).",
                    "Average-case analysis of greedy packet scheduling (extended astract).",
                    "Sparse communication networks and efficient routing in the plane (extended abstract).",
                    "Compact roundtrip routing in directed networks (extended abstract).",
                    "Laziness pays! using lazy synchronization mechanisms to improve non-blocking constructions.",
                    "Long-lived and adaptive atomic snapshot and immediate snapshot (extended abstract).",
                    "Bounds on the shared memory requirements for long-lived adaptive objects (extended abstract).",
                    "Adaptive and efficient mutual exclusion (extended abstract).",
                    "Assigning labels in unknown anonymous networks (extended abstract).",
                    "The wakeup problem in synchronous broadcast systems (extended abstract).",
                    "Random oracles in constantipole: practical asynchronous Byzantine agreement using cryptography (extended abstract).",
                    "Clock synchronization with faults and recoveries (extended abstract).",
                    "k-set agreement with limited accuracy failure detectors.",
                    "Garbage collection of timestamped data in Stampede.",
                    "On the interconnection of causal memory systems.",
                    "Distributed reconfigurtion of metamorphic robot chains.",
                    "1/k phase stamping for continuous shared data (extended abstract).",
                    "p2 - a generic proxy platform for wireless access and mobility in CORBA.",
                    "High performance adaptive middleware for CORBA-based systems.",
                    "Efficient atomic broadcast using deterministic merge.",
                    "Achieving scalability and expressiveness in an Internet-scale event notification service.",
                    "X-ability: a theory of replication.",
                    "Debugging distributed programs using controlled re-execution.",
                    "Self-stabilizing token circulation on asynchronous uniform unidirectional rings.",
                    "Stable and fault-tolerant object allocation.",
                    "Resettable vector clocks.",
                    "Efficient generation of all regular non-dominated coteries.",
                    "Indulgent algorithms (preliminary version).",
                    "Fast deterministic consensus in a noisy environment.",
                    "Stability of long-lived consensus (extended abstract).",
                    "Toward a theory of maximally concurrent programs (shortened version).",
                    "A verification technique for self-stabilizing algorithms based on Ljapunov's \"Second Method\" (brief announcement).",
                    "Time and message-efficient S-based consensus (brief announcement).",
                    "Self-stabilization - beyond the token ring circulation (brief announcement).",
                    "Optimal implementation of the weakest failure detector for solving consensus (brief announcement).",
                    "Memory consistency and process coordination for SPARC v8 multiprocessors (brief announcement).",
                    "Deterministic distributed resource discovery (brief announcement).",
                    "Compact routing with stretch factor of less than three (brief announcement).",
                    "Specification, implementation and application of randomized regular registers (brief announcement).",
                    "Distributed cooperation in the absence of communication (brief announcement).",
                    "Average probe complexity of non-dominated coteries (brief announcement).",
                    "Fast protocol transition in a distributed environment (brief announcement)."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "18th PODC 1999",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1999",
                "sub_name": "Proceedings of the Eighteenth Annual ACM Symposium on Principles of Distributed Computing, PODC, '99Atlanta, Georgia, USA, May 3-6, 1999.",
                "count": 43,
                "papers": [
                    "Optimal and Efficient Clock Synchronization Under Drifting Clocks.",
                    "Analysis of Timing-Based Mutual Exclusion with Random Times.",
                    "A Simple Local-Spin Group Mutual Exclusion Algorithm.",
                    "Rollback-Dependency Trackability: Visible Characterizations.",
                    "Optimal Locking Integrated with Operational Transformation in Distributed Real-Time Group Editors.",
                    "Matching Events in a Content-Based Subscription System.",
                    "Liveness-Preserving Simulation Relations.",
                    "A Knowledge-Theoretic Analysis of Uniform Distributed Coordination and Failure Detectors.",
                    "Flash Mixing.",
                    "Long-Lived Renaming Made Adaptive.",
                    "Fast, Wait-Free (2k)-Renaming.",
                    "Scalable Concurrent Priority Queue Algorithms.",
                    "Wait-Free Synchronization in Multiprogrammed Systems: Integrating Priority-Based and Quantum-Based Scheduling.",
                    "Sequentially Consistent versus Linearizable Counting Networks.",
                    "Decentalized Replicated-Object Protocols.",
                    "LOTEC: A Simple DSM Consistency Protocol for Nested Object Transactions.",
                    "Timed Consistency for Shared Distributed Objects.",
                    "Comparison of Initial Conditions for Distributed Algorithms on Anonymous Networks.",
                    "Computing Anonymously with Arbitrary Knowledge.",
                    "Backward Consistency and Sense of Direction in Advanced Distributed Systems.",
                    "Memory Space Requirements for Self-Stabilizing Leader Election Protocols.",
                    "Optimal Reactive k-Stabilization: The Case of Mutual Exclusion.",
                    "A Faster Distributed Algorithm for Computing Maximal Matchings Deterministically.",
                    "Resource Discovery in Distributed Networks.",
                    "The Complexity of End-to-End Communication in Memoryless Networks.",
                    "Fast Set Agreement in the Presence of Timing Uncertainty.",
                    "On k-Set Consensus Problems in Asynchronous Systems.",
                    "A Design of a Protocol for Detecting an Agent Clone in Mobile Agent Systems and its Correctness Proof.",
                    "Mutable Check-Points: A New Checkpointing Approach for Mobile Computing Systems.",
                    "Delay-Optimal Quorum-Based Mutual Exclusion for Distributed Systems.",
                    "The HiMAT Model for Mobile Agent Applications.",
                    "The Sound of Silence - Guessing Games for Saving Energy in Mobile Environment.",
                    "Fundamental Distributed Protocols in Mobile Networks.",
                    "External Logging on a Logical Ring.",
                    "A Dynamic Self-Stabilizing Algorithm for Finding Strongly Connected Components.",
                    "Two Classes of Communication Patterns.",
                    "Dynamically Configurable Distributed Objects.",
                    "Optimal, Distributed Decision-Making: The Case of no Communication.",
                    "Using CSP to Derive a Sequentially Consistent DSM System.",
                    "Properties of a Family of Booster Types.",
                    "Maintenance of a Spanning Tree in Dynamic Networks.",
                    "Lower and Upper Bounds for Attacks on Authentication Protocols.",
                    "A Design Methodology for Mobile Distributed Applications Based on UNITY Formalism and Communication-Closed Layering."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "17th PODC 1998",
        "info": "Puerto Vallarta, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1998",
                "sub_name": "Proceedings of the Seventeenth Annual ACM Symposium on Principles of Distributed Computing, PODC '98, Puerto Vallarta, Mexico, June 28 - July 2, 1998.",
                "count": 50,
                "papers": [
                    "Algorithmic Problems in Internet Research.",
                    "High Performance Clusters: State of the Art and Challenges Ahead.",
                    "How to Find It: Research Issues in Distributed Search (Abstract).",
                    "Distributed and Parallel Computing Issues in Data Warehousing (Abstract).",
                    "Compact Routing Schemes with Low Stretch Factor (Extended Abstract).",
                    "Reconsidering Fragmentation and Reassembly.",
                    "Competitive Dynamic Bandwidth Allocation.",
                    "Contention in Balancing Networks Resolved (Extended Abstract).",
                    "Asynchronous Group Mutual Exclusion (Extended Abstract).",
                    "Combining Funnels: A New Twist on an Old Tale...",
                    "Synchronization Mechanisms for SCRAMNet+ Systems.",
                    "Amortizing Randomness in Private Multiparty Computations.",
                    "Universal Service-Providers for Database Private Information Retrieval (Extended Abstract).",
                    "Simplified VSS and Fast-Track Multiparty Computations with Applications to Threshold Cryptography.",
                    "Optimal Efficiency of Optimistic Contract Signing.",
                    "The Unified Structure of Consensus: A Layered Analysis Approach.",
                    "Unifying Synchronous and Asynchronous Message-Passing Models.",
                    "Round-by-Round Fault Detectors: Unifying Synchrony and Asynchrony (Extended Abstract).",
                    "The Message Classification Model.",
                    "Reliable Message Delivery and Conditionally-Fast Transactions are not Possible Without Accurate Clocks.",
                    "Synthesis of Fault-Tolerant Concurrent Programs.",
                    "A Lower Bound on the Local Time Complexity of Universal Constructions.",
                    "A Tight Lower Bound for Randomized Synchronous Consensus.",
                    "A Time Complexity Lower Bound for Randomized Implementations of Some Shared Objects.",
                    "Consensus Numbers of Multi-Objects.",
                    "Persistent Messages in Local Transactions.",
                    "A Dynamic View-Oriented Group Communication Service.",
                    "An Adaptive Totally Ordered Multicast Protocol That Tolerates Partitions.",
                    "Supporting Quality of Service in HTTP Servers.",
                    "The Protocol for Hierarchical Multicast Routing.",
                    "In-Place Reconstruction of Delta Compressed Files.",
                    "Adaptive Wait-Free Algorithms for Lattice Agreement and Renaming (Extended Abstract).",
                    "A Polylog Time Wait-Free Construction for Closed Objects.",
                    "Structured Derivations of Consensus Algorithms for Failure Detectors.",
                    "A Consistent History Link Connectivity Protocol.",
                    "An Error Control Scheme for Large-Scale Multicast Applications.",
                    "The Global Efficiency of Distributed, Rate-Based, Flow Control Algorithms.",
                    "Scalable Best Matching Prefix Lookups.",
                    "Optimal Allocation of Electronic Contect in Networks.",
                    "A Direct Lower Bound for k-Set Consensus.",
                    "Muteness Detectors for Consensus with Byzantine Processes.",
                    "Implementing and Evaluating an Eventualy-Serializable Data Service.",
                    "k-Stabilization of Reactive Tasks.",
                    "Asynchronous Time-Adaptive Self Stabilization.",
                    "Robust Efficient Distributed RSA-Key Generation.",
                    "Probabilistic Byzantine Quorum Systems.",
                    "Efficient Evaluation of Causality Relations Between Nonatomic Events.",
                    "An Agent-Based Architecture for Buildiang CORBA Distributed Systems.",
                    "Responsiveness and Consistency Tradoffs in Interactive Groupware.",
                    "Properties of the r-Operators to Insure Termination of Distributed Computatioons."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "16th PODC 1997",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1997",
                "sub_name": "Proceedings of the Sixteenth Annual ACM Symposium on Principles of Distributed Computing, Santa Barbara, California, USA, August 21-24, 1997.",
                "count": 50,
                "papers": [
                    "Multi-Party Computations: Past and Present.",
                    "Verification Engineering: A Future Profession (A. M. Turing Award Lecture).",
                    "Internet Support for Wireless and Mobile Networking.",
                    "Principles and Patterns of High-Performance and Real-Time Distributed Object Computing.",
                    "Maintaining Authenticated Communication in the Presence of Break-ins.",
                    "Complete Characterization of Adversaries Tolerable in Secure Multi-Party Computation (Extended Abstract).",
                    "Randomness vs. Fault-Tolerance.",
                    "Relative Liveness and Behavior Abstraction (Extended Abstract).",
                    "Specifying and Using a Partitionable Group Communication Service.",
                    "Dynamic Voting for Consistent Primary Components.",
                    "Lazy Consistency Using Loosely Synchronized Clocks.",
                    "How Useful Is Old Information? (Extended Abstract).",
                    "Determining Consensus Numbers.",
                    "On the Power of Shared Object Types to Implement One-Resilient Consensus.",
                    "Disentangling Multi-Object Operations (Extended Abstract).",
                    "A Wait-Free Sorting Algorithm.",
                    "On the Potential of FEC Algorithms in Building Fault-Tolerant Distributed Applications to Support High QoS Video Communications.",
                    "Efficiency of Oblivious Versus Non-Oblivious Schedules for Optimistic, Rate-Based Flow Control (Extended Abstract).",
                    "Time-Adaptive Self Stabilization.",
                    "An Inherent Bottleneck in Distributed Counting.",
                    "An Interval-Based Framework for Clock Rate Synchronization.",
                    "The Complexity of Crash Failures.",
                    "A Simple Algorithmically Reasoned Characterization of Wait-Free Computations (Extended Abstract).",
                    "Towards a Topological Characterization of Asynchronous Complexity (Preliminary Version).",
                    "Efficient Asynchronous Consensus with the Weak Adversary Scheduler.",
                    "Practical Implementations of Non-Blocking Synchronization Primitives.",
                    "Implementing Wait-Free Objects on Priority-Based Systems.",
                    "Collecting Distributed Garbage Cycles by Back Tracing.",
                    "The Load and Availability of Byzantine Quorum Systems.",
                    "Synchronous Byzantine Quorum Systems.",
                    "Probabilistic Quorum Systems.",
                    "Computing Vector Functions on Anonymous Networks.",
                    "A Technique for Partial Broadcasting in Networks (Abstract).",
                    "The Consensus Hierarchy Is Not Robust.",
                    "Space-Optimal Wait-Free Queues.",
                    "Leap Forward Virtual Clock: A New Fair Queuing Scheme with Guaranteed Delays and Throughput Fairness.",
                    "Compiler Support for Decoupled Virtual Shared Memory Systems.",
                    "Using Broadcast Primitives in Replicated Databases (Abstract).",
                    "Competing against Specialists.",
                    "Fault Tolerance Bounds for Memory Consistency.",
                    "Failure Detectors in Omission Failure Environments.",
                    "Local Stabilizer (Brief Announcement).",
                    "Memory Efficient, Self-Stabilizing Algorithm to Construct BFS Spanning Trees.",
                    "Trade-offs in Fault-Containing Self-Stabilization.",
                    "On FTSS-Solvable Distributed Problems.",
                    "Dynamic Hashing + Quorum = Efficient Location Management for Mobile Computing Systems.",
                    "An Algorithm for Message Delivery to Mobile Units.",
                    "Dynamic Wavelength Allocation in Optical Networks.",
                    "On the Relation between Bit Delay for Slot Reuse and the Number of Address Bits in the Dual Bus Configuration (Brief Announcement).",
                    "Automatic Verification of Liveness Properties of Randomized Systems."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "15th PODC 1996",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1996",
                "sub_name": "Proceedings of the Fifteenth Annual ACM Symposium on Principles of Distributed Computing, Philadelphia, Pennsylvania, USA, May 23-26, 1996.",
                "count": 71,
                "papers": [
                    "Fundamental Challenges in Mobile Computing.",
                    "Atomicity in Electronic Commerce.",
                    "Memory Requirements for Silent Stabilization (Extended Abstract).",
                    "Self-Stabilization by Window Washing.",
                    "Fault-Containing Self-Stabilizing Algorithms.",
                    "About State Recording in Asynchronous Computations (Abstract).",
                    "Minimizing Access Costs in Replicated Distributed Syste (Abstract).",
                    "On the Borowsky-Gafni Simulation Algorithm (Abstract).",
                    "Trade-Offs in Implementing Optimal Message Logging Protocols.",
                    "Efficient Message Ordering in Dynamic Networks.",
                    "An Efficient Recovery-Based Spin Lock Protocol for Preemptive Shared Memory Multiprocessors.",
                    "An Optimal Algorithm for Generalized Causal Message Ordering (Abstract).",
                    "Characterization of Message Ordering Specifications and Protocols (Abstract).",
                    "Efficient Delta-Causal Broadcasting of Multimedia Applications (Abstract).",
                    "Comparing Primary-Backup and State Machines for Crash Failures (Abstract).",
                    "Refining Knowledge Oriented Actions to Layered Implementations.",
                    "Automated Logical Verification Based on Trace Abstractions.",
                    "Synthesis of Concurrent Systems for an Atomic Read / Atomic Write Model of Computation (Extended Abstract).",
                    "Synthesis of Distributed Control Systems (Abstract).",
                    "I/O Automata Based Verification of Finite State Distributed Systems: Complexity Issues (Abstract).",
                    "Using Events Structures for the Efficient Analysis of State Graphs (Abstract).",
                    "Testing Concurrent Data Structures (Abstract).",
                    "Memory Requirements for Routing in Distributed Networks (Extended Abstract).",
                    "Optimal Routing Tables.",
                    "Spreading Rumors Rapidly Despite and Adversary.",
                    "Fast, Long-Lived Renaming Improved and Simplified (Abstract).",
                    "The Complexity of Data Mining on the Web (Abstract).",
                    "Efficient Token-Based Control in Rings (Abstract).",
                    "Efficient Traffic Laws for Mobile Robots - Work in Progress (Avstract).",
                    "Strong-Feasibilities of Equivalence-Completions.",
                    "Polylog Randomized Wait-Free Consensus.",
                    "Asynchrony versus Bulk-Synchrony in QRQW PRAM model (Abstract).",
                    "Constructing a Reliable Test&Set Bit (Abstract).",
                    "Space-Efficient Construction of Buffer-Optimal 1-Writer 1-Reader Multivalued Atomic Variable (Abstract).",
                    "Randomized Adaptive Video on Demand (Abstract).",
                    "Distributed Algorithms for Sparse k-Connectivity Certificates (Abstract).",
                    "Randomness in Private Computations.",
                    "Distributed Pseudo-Random Bit Generators - A New Way to Speed-Up Shared Coin Tossing.",
                    "A Randomized Byzantine Agreement Protocol with Constant Expected Time and Guaranteed Termination in Optimal (Deterministic) Time.",
                    "Early-Stopping Terminating Reliable Broadcast Protocol for General Omission Failures (Abstract).",
                    "Baked Potatoes: Deadlock Prevention Via Scheduling (Abstract).",
                    "Witness-Based Cryptographic Program Checking and Applications (an Announcement).",
                    "On the Convergence Complexity of Optimistic Rate Based Flow Control Algorithms (Brief Announcement).",
                    "The Power of Multi-objects (Extended Abstract).",
                    "Universal Operations: Unary versus Binary (Extended Abstract).",
                    "Real-Time Object Sharing with Minimal System Support (Extended Abstract).",
                    "Space Bounds for Transactional Synchronization (Abstract).",
                    "What Critical Algebraic Property Allows Operations of Concurrent Abstract Data Types to be Fast? (Brief Announement).",
                    "The Role of Data-Race-Free Programs in Recoverable DSM (Abstract).",
                    "Crash Failures vs. Crash + Link Failures (Abstract).",
                    "Crash Failures can Drive Protocols to Arbitrary States.",
                    "Time and Space Lower Bounds for Non-Blocking Implementations (Preliminary Version).",
                    "Simple, Fast, and Practical Non-Blocking and Blocking Concurrent Queue Algorithms.",
                    "A Proof of a Theorem in Algebraic Topology by a Distributed Algorithm (Abstract).",
                    "Wait-Free Solvability Via Combinatorial Topology (Abstract).",
                    "Simulation as an Iterated Task (Abstract).",
                    "On the Decidability of Distributed Decision Tasks (Brief Announcement).",
                    "Counting Networks are Practically Linearizable.",
                    "How to be an Efficient Snoop, or the Probe Complexity of Quorum Systems (Extended Abstract).",
                    "Eventually-Serializable Data Services.",
                    "From Serializable to Causal Transactions (Abstract).",
                    "The Strength of Counting Networks (Abstract).",
                    "Tight Bounds on the Cumulative Profit of Distributed Voters (Abstract).",
                    "The Offset Problem (Abstract).",
                    "Fail-Awareness in Timed Asynchronous Systems.",
                    "On the Impossibility of Group Membership.",
                    "A New Look at Membership Services (Extended Abstract).",
                    "Collective Consistency (Work in Progress, Abstract).",
                    "Impossibility of (Repeated) Reliable Broadcast (Abstract).",
                    "A Framework for Partitionable Membership Service (Abstract).",
                    "Evaluating Quorum Systems Over the Internet (Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "14th PODC 1995",
        "info": "Ottawa, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1995",
                "sub_name": "Proceedings of the Fourteenth Annual ACM Symposium on Principles of Distributed Computing, Ottawa, Ontario, Canada, August 20-23, 1995.",
                "count": 51,
                "papers": [
                    "Issues in Distributed Control for ATM Networks.",
                    "A Case for NOW (Networks of Workstations) - Abstract.",
                    "Fault-Local Distributed Mending (Extended Abstract).",
                    "Sub-linear Distributed Algorithms for Sparse Certificates and Biconnected Components (Extended Abstract).",
                    "Faster Computation On Directed Networks of Automata (Extended Abstract).",
                    "Distributed Dynamic Channel Allocation for Mobile Computing.",
                    "Collecting Cyclic Distributed Garbage Using Heuristics to Control Migration.",
                    "On Distributed Object Checkpointing and Recovery.",
                    "On the Relevance of Communication Costs of Rollback-Recovery Protocols.",
                    "A Framework for Protocol Composition in Horus.",
                    "Algebraic Spans (Preliminary Version).",
                    "Failure Detectors and the Wait-Free Hierarchy.",
                    "More on t-Resilience vs. Wait-Freedom (Extended Abstract).",
                    "Crumbling Walls: A Class of Practical and Efficient Quorum Systems (Extended Abstract).",
                    "Achieving Independence Efficiently and Securely.",
                    "Lower Bounds for Convergence Function Based Clock Synchronization.",
                    "Reasoning about Meta Level Activities in Open Distributed Systems.",
                    "Knowledge-Based Programs.",
                    "Formal Semantics for Expressing Optimism: The Meaning of HOPE.",
                    "Formal Verification of Timed Properties for Randomized Distributed Algorithms.",
                    "Universal Constructions for Multi-Object Operations.",
                    "Long-Lived Renaming Made Fast.",
                    "Software Transactional Memory.",
                    "Lock-Free Linked Lists Using Compare-and-Swap.",
                    "Memory Requirement for Universal Routing Schemes.",
                    "Optimal Distributed Algorithm for Minimum Spanning Trees Revisited.",
                    "Fast Distributed Construction of k-Dominating Sets and Applications.",
                    "A Modular Measure of Competitiveness for Distributed Algorithms (Abstract).",
                    "Randomized Competitive Algorithms for Admission Control in General Networks (Abstract).",
                    "Log-Space Polynomial End-to-End Communication (Abstract).",
                    "SuperStabilizing Protocols for Dynamic Distributed Systems (Abstract).",
                    "Self-Stabilizing Clock Synchronization in the Presence of Byzantine Faults (Abstract).",
                    "Securing the Internet (Abstract).",
                    "The RAPID C++ Environment (Abstract).",
                    "Architecture Decisions for Wide Area Applications (Abstract).",
                    "A Sequencing Service for Group Communication (Abstract).",
                    "Prediction Based Task Scheduling in Distributed Computing (Abstract).",
                    "Scheduling in Client-Server Systems (Abstract).",
                    "Deriving Optimal Checkpoint Protocols for Distributed Shared Memory Architectures (Abstract).",
                    "Active Client Primary-Backup Protocols (Abstract).",
                    "A View-Based Approach to Relaxing Global Serializability in a Multidatabase System (Abstract).",
                    "Constraint-based Structuring of Distributed Protocols (Abstract).",
                    "Generalizing Fair Reachability Analysis to Protocols with Arbitrary Topology (Abstract).",
                    "Compiling Knowledge-Based Programs (Abstract).",
                    "A Calculus for Concurrent Update (Abstract).",
                    "Lazy-Writer Multivalued Registers (Abstract).",
                    "3-Processor Tasks Are Undecidable (Abstract).",
                    "Using Lock-Free Objects in Hard Real-Time Applications (Abstract).",
                    "Complete Implementations for Shared Memory Consistency Conditions (Abstract).",
                    "A Logarithmic Depth Counting Network (Abstract).",
                    "Load Balancing Networks (Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "13th PODC 1994",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1994",
                "sub_name": "Proceedings of the Thirteenth Annual ACM Symposium on Principles of Distributed Computing, Los Angeles, California, USA, August 14-17, 1994.",
                "count": 69,
                "papers": [
                    "Research Issues in Ubiquitous Computing.",
                    "Multimedia Networking: Applications and Challenges.",
                    "Reconciliations.",
                    "Repeatable and Portable Message-Passing Programs.",
                    "Making Operations of Concurrent Data Types Fast.",
                    "Delimiting the Power of Bounded Size Synchronization Objects (Extended Abstract).",
                    "Wait-Freedom vs. Bounded Wait-Freedom in Public Data Structures (Extended Abstract).",
                    "Contention-free Complexity of Shared Memory Algorithms.",
                    "Using Belief to Reason about Cache Coherence.",
                    "Open Systems in TLA.",
                    "ENF Event Predicate Detection in Distributed Systems.",
                    "Mixed Consistency: A Model for Parallel Programming (Extended Abstract).",
                    "Global Flush Communication Primitive for Inter-process Communication.",
                    "A Checkpoint Protocol for an Entry Consistent Shared Memory System.",
                    "A Performance Evaluation of Lock-Free Synchronization Protocols.",
                    "Using k-Exclusion to Implement Resilient, Scalable Shared Objects (Extended Abstract).",
                    "Disjoint-Access-Parallel Implementations of Strong Shared Memory Primitives.",
                    "Time-Optimal Message-Efficient Work Performance in the Presence of Faults (Extended Summary).",
                    "Resilience of General Interactive Tasks.",
                    "Asynchronous Secure Computations with Optimal Resilience (Extended Abstract).",
                    "Coins, Weights and Contention in Balancing Networks.",
                    "A Combinatorial Treatment of Balancing Networks.",
                    "A Characterization of Networks Supporting Linear Interval Routing.",
                    "Potential Function Analysis of Greedy Hot-Potato Routing.",
                    "The Virtual Path Layout Problem in Fast Networks (Extended Abstract).",
                    "Self-Stabilization by Counter Flushing.",
                    "Memory-Efficient and Self-Stabilizing Network {RESET} (Extended Abstract).",
                    "Adaptive Algorithms for PASO Systems.",
                    "Uniform Actions in Asynchronous Distributed Systems (Extended Abstract).",
                    "Observable Clock Synchronization (Extended Abstract).",
                    "Knowledge, Timed Precedence and Clocks (Preliminary Report).",
                    "A Formally Verifiable Algorithm for Clock Synchronization under a Hybrid Fault Model.",
                    "Proving Time Bounds for Randomized Distributed Algorithms.",
                    "Set Consensus Using Arbitrary Objects (Preliminary Version).",
                    "Wait-Freedom vs. t-Resiliency and the Robustness of Wait-Free Hierarchies.",
                    "A Gap Theorem for Consensus Types (Extended Abstract).",
                    "On the Use of Registers in Achieving Wait-Free Consensus.",
                    "Consensus Power Makes (Some) Sense! (Extended Abstract).",
                    "Self-Stabilizing Algorithms for Finding Centers and Medians of Trees.",
                    "Leader Election in the Presence of Link Failures (Abstract).",
                    "Stabilizing Algorithms for Diagnosing Crash Failures.",
                    "On the Coding of Dependencies in Distributed Computations (Abstract).",
                    "Probabilistic Self-Stabilizing Mutual Exclusion in Uniform Rings.",
                    "The Impact of Synchronization on the Session Problem.",
                    "A Fault-Tolerant Dynamic Resource Allocation Algorithm (Short Abstract).",
                    "Implementation of Authenticated Communication Based on Hierarchy-Relative Naming Scheme.",
                    "Derivation of Fault Tolerance Properties of Distributed Algorithms.",
                    "Towards a Minimal Object-Oriented Language for Distributed and Concurrent Programming.",
                    "CoLa: A Coordination Language for Massive Parallelism.",
                    "Dynamic Load Sharing Algorithm with a Weighted Load Representation.",
                    "A Recognize-and-Accuse Policy to Speed up Distributed Processes.",
                    "Controlling Real-Time Asynchronous Tasks with ESTEREL Synchronous Language.",
                    "Consistency and Conformance in ODP (Abstract).",
                    "XMP++: An Object-Oriented Solution for Hiding the Complexity of Network Management Protocols.",
                    "A Compositional Verification Method for LOTOS.",
                    "Verification of a Distributed Algorithm (Abstract).",
                    "The Formal Verification of an ATM Network.",
                    "A Verification Method Based on Homomorphic Model Abstractions (Abstract).",
                    "Modelling Garbage Collection Algorithms Using CCS and Temporal Logic (Abstract).",
                    "Integrated Support Environment for Concurrent Process Calculi.",
                    "Set-Linearizability.",
                    "Dynamic Sets for Search.",
                    "Competitiveness in Distributed Algorithms.",
                    "Simulating Fail-Stop in Asynchronous Distributed Systems.",
                    "PCODE: Efficient Parallel Computing over Distributed Environments.",
                    "On the Memory Overhead of Distributed Snapshots.",
                    "Adaptive Video on Demand.",
                    "Distributed Pursuit-Evasion: Some Aspects of Privacy and Security in Distributed Computing.",
                    "Contention in Counting Networks."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "12th PODC 1993",
        "info": "Ithaca, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1993",
                "sub_name": "Proceedings of the Twelth Annual ACM Symposium on Principles of Distributed Computing, Ithaca, New York, USA, August 15-18, 1993.",
                "count": 24,
                "papers": [
                    "A Perspective on AN2: Local Area Network as Distributed System.",
                    "Recent Trends in Experimental Operating Systems Research.",
                    "Issues and Directions in Scalable Parallel Computing.",
                    "Atomic Snapshots in O(n log n) Operations (Preliminary Version).",
                    "Immediate Atomic Snapshots and Fast Renaming (Extended Abstract).",
                    "Bounded Round Numbers.",
                    "An Omega(D log(N/D)) Lower Bound for Broadcast in Radio Networks.",
                    "Fast Deflection Routing for Packets and Worms (Extended Summary).",
                    "Experiences with a Model for Parallel Computation.",
                    "Wait-Free Clock Synchronization (Extended Abstract).",
                    "Optimal Clock Synchronization under Different Delay Assumptions (Preliminary Version).",
                    "Designing Algorithms for Distributed Systems with Partially Synchronized Clocks.",
                    "Resource Bounds and Combinations of Consensus Objects.",
                    "On the Robustness of Herlihy's Hierarchy.",
                    "A Completeness Theorem for a Class of Synchronization Objects (Extended Abstract).",
                    "Fast, Scalable Synchronization with Minimal Hardware Support (Extended Abstract).",
                    "Adaptive Solutions to the Mutual Exclusion Problem (Extended Abstract).",
                    "Unifying Self-Stabilization and Fault-Tolerance (Preliminary Version).",
                    "Distributed Fingerprints and Secure Information Dispersal.",
                    "Efficient Detection of Corrupted Pages in a Replicated File (Preliminary Report).",
                    "Implementing Hybrid Consistency with High-Level Synchronization Operations (Extenced Abstract).",
                    "On the Space Complexity of Randomized Synchronization.",
                    "A Lower Bound on Wait-Free Counting.",
                    "Knowledge-Oriented Programming (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "11th PODC 1992",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1992",
                "sub_name": "Proceedings of the Eleventh Annual ACM Symposium on Principles of Distributed Computing, Vancouver, British Columbia, Canada, August 10-12, 1992.",
                "count": 25,
                "papers": [
                    "Distributed Priority Algorithms Under One-Bit-Delay Constraints.",
                    "Connection-Based Communication in Dynamic Networks (Extended Abstract).",
                    "Requirements for Deadlock-Free, Adaptive Packet Routing.",
                    "The Slide Mechanism with Applications in Dynamic Networks (Extended Abstract).",
                    "Computing with Faulty Shared Memory (Extended Abstract).",
                    "Concurrent Counting (Extended Abstract).",
                    "Optimal Multi-Writer Multi-Reader Atomic Register.",
                    "Tolerating Linear Number of Faults in Networks of Bounded Degree.",
                    "Performing Work Efficiently in the Presence of Faults.",
                    "On the Complexity of Global Computation in the Presence of Link Failures: The Case of Uni-Directional Faults.",
                    "Observing Self-Stabilization.",
                    "Performance Issues in Non-blocking Synchronization on Shared-memory Multiprocessors.",
                    "Robust, Distributed References and Acyclic Garbage Collection.",
                    "The Weakest Failure Detector for Solving Consensus.",
                    "Improving Fast Mutual Exclusion.",
                    "Fast Network Decomposition (Extended Abstract).",
                    "Leader Election in Complete Networks.",
                    "The Impact of Time on the Session Problem.",
                    "The Possibility and the Complexity of Achieving Fault-Tolerant Coordination.",
                    "From Sequential Layers to Distributed Processes: Deriving a Distributed Minimum Weight Spanning Tree Algorithm (Extended Anstract).",
                    "Progress Measures and Stack Assertions for Fair Termination.",
                    "A Tradeoff Between Safety and Liveness for Randomized Coordinated Attack Protocols.",
                    "Fast Randomized Algorithms for Distributed Edge Coloring (Extended Abstract).",
                    "Proving Probabilistic Correctness Statements: the Case of Rabin's Algorithm for Mutual Exclusion.",
                    "Randomized Mutual Exclusion Algorithms Revisited."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "10th PODC 1991",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1991",
                "sub_name": "Proceedings of the Tenth Annual ACM Symposium on Principles of Distributed Computing, Montreal, Quebec, Canada, August 19-21, 1991.",
                "count": 28,
                "papers": [
                    "Practical Uses of Synchronized Clocks in Distributed Systems.",
                    "Randomized Wait-Free Concurrent Objects (Extended Abstract).",
                    "Efficient Parallel Algorithms on Restartable Fail-Stop Processors.",
                    "Resiliency of Interactive Distributed Tasks (Extended Abstract).",
                    "How to Withstand Mobile Virus Attacks (Extended Abstract).",
                    "On the Value of Information in Distributed Decision-Making (Extended Abstract).",
                    "Optimal Space Distributed Move-to-Front Lists.",
                    "Optimal Coteries.",
                    "Compact Deterministic Distributed Dictionaries (Extended Abstract).",
                    "A Theory of Relaxed Atomicity (Extended Abstract).",
                    "Real-Time Sequence Transmission Problem.",
                    "Consensus in the Presence of Timing Uncertainty: Omission and Byzantine Failures (Extended Abstract).",
                    "The Benefits of Relaxing Punctuality.",
                    "Broadcast with Partial Knowledge (Preliminary Version).",
                    "Greedy Packet Scheduling on Shortest Paths (Preliminary Version).",
                    "Efficient Deadlock-Free Routing.",
                    "Knowledge in Shared Memory Systems (Preliminary Version).",
                    "A Semantics for a Logic of Authentication (Extended Abstract).",
                    "A Predicate Transformer Approach to Knowledge and Knowledge-Based Protocols (Extended Abstract).",
                    "Exploiting Locality in Maintaining Potential Causality.",
                    "Replay, Recovery, Replication, and Snapshots of Nondeterministic Concurrent Programs.",
                    "Inconsistency and Contamination (Preliminary Version).",
                    "On a Random Walk Problem Arising in Self-Stabilizing Token Management.",
                    "Resource Bounds for Self Stabilizing Message Driven Protocols.",
                    "Bootstrap Network Resynchronization (Extended Abstract).",
                    "Message-Optimal Protocols for Byzantine Agreement (Extended Abstract).",
                    "Unreliable Failure Detectors for Asynchronous Systems (Preliminary Version).",
                    "Using Process Groups to Implement Failure Detection in Asynchronous Environments."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "9th PODC 1990",
        "info": "Quebec City, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1990",
                "sub_name": "Proceedings of the Ninth Annual ACM Symposium on Principles of Distributed Computing, Quebec City, Quebec, Canada, August 22-24, 1990.",
                "count": 27,
                "papers": [
                    "Atomic Snapshots of Shared Memory.",
                    "Composite Registers.",
                    "The Inhibition Spectrum and the Achievement of Causal Consistency.",
                    "Lazy Replication: Exploiting the Semantics of Distributed Services.",
                    "Distributed Variable Server for Atomic Unification.",
                    "Virtual Time II: Storage Management in Conservative and Optimistic Systems.",
                    "Self-Stabilizing Extensions for Message-Passing Systems.",
                    "Self-Stabilization of Dynamic Systems Assuming only Read/Write Atomicity.",
                    "Token Management Schemes and Random Walks Yield Self-Stabilizing Mutual Exclusion.",
                    "Continuous Clock Amortization Need Not Affect the Precision of a Clock Synchronization Algorithm.",
                    "Distributed Control for PARIS.",
                    "Principle for High Speed Network Control: Congestion- and Deadlock-Freeness, Self-Routing, and a Single Buffer per Link.",
                    "Cost-Sensitive Analysis of Communication Protocols.",
                    "A Quantitative Approach to Dynamic Networks.",
                    "Tight Bounds for Weakly Bounded Protocols.",
                    "Two Messages are Almost Optimal for Conveying Information.",
                    "A Decidable Temporal Logic to Reason About Many Processes.",
                    "Reasoning About Probabilistic Algorithms.",
                    "Using Mappings to Prove Timing Properties.",
                    "Half-Order Modal Logic: How to Prove Real-Time Properties.",
                    "Early-Delivery Atomic Broadcast.",
                    "Agreement is Harder than Consensus: Set Consensus Problems in Totally Asynchronous Systems.",
                    "Time- and Space-Efficient Randomized Consensus.",
                    "A Characterization of Eventual Byzantine Agreement.",
                    "Lower Bounds for Wait-Free Computation in Message-Passing Systems.",
                    "Sharing Memory Robustly in Message-Passing Systems.",
                    "A Hierarchy of Temporal Properties."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "8th PODC 1989",
        "info": "Edmonton, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1989",
                "sub_name": "Proceedings of the Eighth Annual ACM Symposium on Principles of Distributed Computing, Edmonton, Alberta, Canada, August 14-16, 1989.",
                "count": 25,
                "papers": [
                    "A Hundred Impossibility Proofs for Distributed Computing.",
                    "Equational Reasoning About Nondeterministic Processes.",
                    "Towards Dataflow Analysis of Communicating Finite State Machines.",
                    "The Intractability of Bounded Protocols for Non-FIFO Channels.",
                    "Tight Bounds for the Sequence Transmission Problem.",
                    "Source to Destination Communication in the Presence of Faults.",
                    "Knowledge, Probability, and Adversaries.",
                    "On Reliable Message Diffusion.",
                    "A Categorical Approach to Distributed Systems Expressibility and Knowledge.",
                    "The Ambiguity of Choosing.",
                    "Sticky Bits and Universality of Consensus.",
                    "Tight Bounds for Shared Memory Symmetric Mutual Exclusion Problems.",
                    "Efficient Solution to the Distributed Mutual Exclusion Problem.",
                    "Non-Cryptographic Fault-Tolerant Computing in Constant Number of Rounds of Interaction.",
                    "Efficient Parallel Algorithms Can Be Made Robust.",
                    "Efficient Distributed Recovery Using Message Logging.",
                    "A Structural Induction Theorem for Processes.",
                    "A Predicate Transformer Approach to Semantics of Parallel Programs.",
                    "Predicates are Predicate Transformers: A Unified Compositional Theory for Concurrency.",
                    "Bounded Polynomial Randomized Consensus.",
                    "Modular Construction of Nearly Optimal Byzantine Agreement Protocols.",
                    "Shared-Memory vs. Message-Passing in an Asynchronous Distributed Environment.",
                    "Calling Names in Nameless Networks.",
                    "Multiple Communication in Multi-Hop Radio Networks.",
                    "Fast Isolation of Arbitrary Forwarding Faults."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "7th PODC 1988",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1988",
                "sub_name": "Proceedings of the Seventh Annual ACM Symposium on Principles of Distributed Computing, Toronto, Ontario, Canada, August 15-17, 1988.",
                "count": 25,
                "papers": [
                    "A Hundred Impossibility Proofs for Distributed Computing.",
                    "Equational Reasoning About Nondeterministic Processes.",
                    "Towards Dataflow Analysis of Communicating Finite State Machines.",
                    "The Intractability of Bounded Protocols for Non-FIFO Channels.",
                    "Tight Bounds for the Sequence Transmission Problem.",
                    "Source to Destination Communication in the Presence of Faults.",
                    "Knowledge, Probability, and Adversaries.",
                    "On Reliable Message Diffusion.",
                    "A Categorical Approach to Distributed Systems Expressibility and Knowledge.",
                    "The Ambiguity of Choosing.",
                    "Sticky Bits and Universality of Consensus.",
                    "Tight Bounds for Shared Memory Symmetric Mutual Exclusion Problems.",
                    "Efficient Solution to the Distributed Mutual Exclusion Problem.",
                    "Non-Cryptographic Fault-Tolerant Computing in Constant Number of Rounds of Interaction.",
                    "Efficient Parallel Algorithms Can Be Made Robust.",
                    "Efficient Distributed Recovery Using Message Logging.",
                    "A Structural Induction Theorem for Processes.",
                    "A Predicate Transformer Approach to Semantics of Parallel Programs.",
                    "Predicates are Predicate Transformers: A Unified Compositional Theory for Concurrency.",
                    "Bounded Polynomial Randomized Consensus.",
                    "Modular Construction of Nearly Optimal Byzantine Agreement Protocols.",
                    "Shared-Memory vs. Message-Passing in an Asynchronous Distributed Environment.",
                    "Calling Names in Nameless Networks.",
                    "Multiple Communication in Multi-Hop Radio Networks.",
                    "Fast Isolation of Arbitrary Forwarding Faults."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "6th PODC 1987",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1987",
                "sub_name": "Proceedings of the Sixth Annual ACM Symposium on Principles of Distributed Computing, Vancouver, British Columbia, Canada, August 10-12, 1987.",
                "count": 25,
                "papers": [
                    "Epidemic Algorithms for Replicated Database Maintenance.",
                    "Update Propagation in Bakunin Data Networks.",
                    "Quorum Consensus in Nested Transaction Systems.",
                    "Shifting Gears: Changing Algorithms on the Fly To Expedite Byzantine Agreement.",
                    "Fault-Tolerant Decision Making in Totally Asynchronous Distributed Systems (Preliminary Version).",
                    "Asynchronous Approximate Agreement.",
                    "An Optimal Synchronizer for the Hypercube.",
                    "On Processor Coordination Using Asynchronous Hardware.",
                    "On the Time-Complexity of Broadcast in Radio Networks: An Exponential Gap Between Determinism and Randomization.",
                    "Detecting Global Termination Conditions in the Face of Uncertainty.",
                    "Detection of Stable Properties in Distributed Applications.",
                    "Hierarchical Correctness Proofs for Distributed Algorithms.",
                    "Modular Verification of Asynchronous Networks.",
                    "Specifying Graceful Degradation in Distributed Systems.",
                    "Interleaving Set Temporal Logic (Preliminary Version).",
                    "Specifying Message Passing Systems Requires Extending Temporal Logic.",
                    "A Hierarchy of Temporal Properties (Abstract).",
                    "The Elusive Atomic Register Revisited.",
                    "Constructing Multi-reader Atomic Values From Non-atomic Values.",
                    "A Protocol for Wait-Free, Atomic, Multi-Reader Shared Variables.",
                    "Constructing Two-Writer Atomic Registers.",
                    "Achieving Independence in Logarithmic Number of Rounds.",
                    "A Little Knowledge Goes a Long Way: Simple Knowledge-based Derivations and Correctness Proofs for a Family of Protocols.",
                    "Substituting for Real Time and Common Knowledge in Asynchronous Distributed Systems.",
                    "Avoiding The State Explosion Problem in Temporal Logic Model Checking."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "5th PODC 1986",
        "info": "Calgary, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1986",
                "sub_name": "Proceedings of the Fifth Annual ACM Symposium on Principles of Distributed Computing, Calgary, Alberta, Canada, August 11-13, 1986.",
                "count": 25,
                "papers": [
                    "Designing a Global Name Service.",
                    "Correctness Conditions for Highly Available Replicated Databases.",
                    "Highly-Available Distributed Service and Fault-Tolerant Distributed Garbage Collection.",
                    "Transaction Commit in a Realistic Fault Model.",
                    "Distributing the Power of a Government to Enhance the Privacy of Voters (Extended Abstract).",
                    "A Communication-Efficient Canonical Form for Fault-Tolerant Distributed Protocols.",
                    "Asymptotically Optimal Algorithms For Approximale Agreement.",
                    "Optimal Message Routing without Complete Routing Tables (preliminary version).",
                    "On Fault Tolerant Routings in General Networks.",
                    "The Complexity of Using Forwarding Addresses for Decentralized Object Finding.",
                    "Incremental Attribute Evaluation in Distributed Language-Based Environments.",
                    "Gap Theorems for Distributed Computation.",
                    "On the Bit Complexity of Distributed Computations in a Ring with a Leader.",
                    "Probabilistic Solitude Verification on a Ring.",
                    "The Effect of Link Failures on Computations in Asynchronous Rings.",
                    "Limitations on Database Availability when Networks Partition.",
                    "Protocols for Dynamic Vote Reassignment.",
                    "Optimistic Concurrency Control for Abstract Data Types.",
                    "Efficient Synchronization on Multiprocessors with Shared Memory.",
                    "Memory Coherence in Shared Virtual Memory Systems.",
                    "Reasoning About Networks With Many Identical Finite-State Processes.",
                    "What Processes Know: Definitions and Proof Methods (Preliminary Version).",
                    "The Synthesis of Communication Protocols.",
                    "Continous Routing and Batch Routing on the Hypercube.",
                    "Slowing Sequential Algorithms for Obtaining Fast Distributed and Parallel Algorithms: Maximum Matchings."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "4th PODC 1985",
        "info": "Minaki, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1985",
                "sub_name": "Proceedings of the Fourth Annual ACM Symposium on Principles of Distributed Computing, Minaki, Ontario, Canada, August 5-7, 1985.",
                "count": 30,
                "papers": [
                    "Concurrent Programming For The Masses (PODC 1984 Invited Address).",
                    "Symmetry and Similarity in Distributed Systems.",
                    "On the Analysis of Cooperation and Antagonism in Networks of Communicating Processes.",
                    "On Characterization of Safety and Liveness Properties in Temporal Logic.",
                    "A Model and Proof System for Asynchronous Networks.",
                    "Easy Impossibility Proofs for Distributed Consensus Problems.",
                    "Optimal Clock Synchronization.",
                    "Fast Distributed Agreement (Preliminary Version).",
                    "Comparing How Atomicity Mechanisms Support Replication.",
                    "Site Optimal Termination Protocols for a Distributed Database under Network Partitioning.",
                    "Distributed Version Management for Read-Only Actions (Extended Abstract).",
                    "A Provably Secure Polynomial Approximation Scheme for the Distributed Lottery Problem (Extended Abstract).",
                    "Fast Asynchronous Byzantine Agreement (Extended Abstract).",
                    "Simple Constant-Time Consensus Protocols in Realistic Failure Models (Extended Abstract).",
                    "A Modular Technique for the Design of Efficient Distributed Leader Finding Algorithms.",
                    "Improvements in the Time Complexity of Two Message-Optimal Election Algorithms.",
                    "Time and Message Bounds of Election in Synchronous and Asynchronous Complete Networks.",
                    "Computing on an Anonymous Ring.",
                    "How Processes Learn.",
                    "Cheating Husbands and Other Stories: A Case Study of Knowledge, Action, and Communication (Preliminary Version).",
                    "A Formal Model of Knowledge, Action, and Communication in Distributed Systems: Preliminary Report.",
                    "Inexact Agreement: Accuracy, Precision, and Graceful Degradation.",
                    "Towards a Universal Directory Service.",
                    "Distributed Match-Making for Processes in Computer Networks (Preliminary Version).",
                    "Communication-Time Trade-Offs in Network Synchronization.",
                    "The Optimality of Distributed Constructions of Minimum Weigth and Degree Restricted Spanning Trees in a Complete Network of Processors.",
                    "Terminating Iterative Solution of Simultaneous Equations in Distributed Message Passing Systems.",
                    "Parallel Arithmetic with Concurrent Writes.",
                    "Simple, Efficient Asynchronous Parallel Algorithms for Maximization.",
                    "Choice Coordination with Bounded Failure (a Preliminary Version)."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "3rd PODC 1984",
        "info": "Vancouver, B. C., Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1984",
                "sub_name": "Proceedings of the Third Annual ACM Symposium on Principles of Distributed Computing, Vancouver, B. C., Canada, August 27-29, 1984.",
                "count": 27,
                "papers": [
                    "Solved Problems, Unsolved Problems and Non-Problems in Concurrency (Invited Address).",
                    "Verification of Multiprocess Probabilistic Protocols.",
                    "A Temporal Logic for Reasoning about Partially Ordered Computations (Extended Abstract).",
                    "A Technique for Proving Liveness of Communicating Finite State Machines with Examples.",
                    "Knowledge and Common Knowledge in a Distributed Environment.",
                    "Knowledge, Common Knowledge and related puzzles (Extended Summary).",
                    "Byzantine Clock Synchronization.",
                    "A New Fault-Tolerant Algorithm for Clock Synchronization.",
                    "Fault-Tolerant Clock Synchronization.",
                    "Consensus in the Presence of Partial Synchrony (Preliminary Version).",
                    "Asynchronous Byzantine Consensus.",
                    "Elections in the Presence of Faults.",
                    "Patterns of Communication in Consensus Protocols.",
                    "An Asynchronou [(n-1)/3]-Resilient Consensus Protocol.",
                    "Randomized Byzantine Agreements.",
                    "Relations Between Concurrent-Write Models of Parallel Computation.",
                    "Election and Traversal in Unidirectional Networks.",
                    "Tight Lower and Upper Bounds for Some Distributed Algorithms for a Complete Network of Processors.",
                    "SODA: A Simplified Operating System for Distributed Applications.",
                    "Replicated Procedure Call.",
                    "Efficient Solutions to the Replicated Log and Dictionart Problems.",
                    "An Approach to Performance Analysis of Timestamp-driven Synchronization Mechanisms.",
                    "Fail Termination of Communicating Processe.",
                    "Distributed Algorithms for Ensuring Fair Interprocess Communications.",
                    "Efficient and Reliable Broadcast is Achievable in an Eventually Connected Network.",
                    "A Distributed Algorithm for Deadlock Detection and Resolution.",
                    "A Distributed Algorithm for Generalized Deadlock Detection."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "2nd PODC 1983",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1983",
                "sub_name": "Proceedings of the Second Annual ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing, Montreal, Quebec, Canada, August 17-19, 1983.",
                "count": 26,
                "papers": [
                    "The Inherent Cost of Nonblocking Commitment.",
                    "Resilient Consensus Protocols.",
                    "Another Advantage of Free Choice: Completely Asynchronous Agreement Protocols (Extended Abstract).",
                    "Synchronization and Recovery of Actions.",
                    "A Concurrency Control Theory for Nested Transactions.",
                    "Data-dependent Concurrency Control and Recovery (Extended Abstract).",
                    "Efficient Commit Protocols for the Tree of Processes Model of Distributed Transactions.",
                    "Method for Distributed Transaction Commit and recovery Using Byzantine Agreement Within Clusters of Processors.",
                    "An Algorithm for Replicated Directories.",
                    "The Failure and Recovery Problem for Replicated Databases.",
                    "Synthesis of Communicating Processes.",
                    "Decentralization of Process Nets with Centralized Control.",
                    "Distributed k-Selection: From a Sequential to a Distributed Algorithm.",
                    "Tradeoffs for Selection in Distributed Networks (Preliminary Version).",
                    "The Balanced Sorting Network.",
                    "An Interval Logic for Higher-Level Temporal Reasoning.",
                    "Real-Time Programming and Asynchronous Message Passing.",
                    "GEM: A Tool for Concurrency Specification and Verification.",
                    "Script: A Communication Abstraction Mechanism.",
                    "CCS Expressions, Finite State Processes, and THree Problems of Equivalence.",
                    "A Formal Description of the UNIX Operating System.",
                    "Scheduling File Transfers in a Distributed Network.",
                    "Freedom from Deadlock of Locked Transactions in a Distributed Database.",
                    "Distributed Task and Memory Management.",
                    "Detecting Termination of Distributed Computations Using Markers.",
                    "Maintaining the Time in a Distributed System."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "1st PODC 1982",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/podc/1982",
                "sub_name": "ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing, Ottawa, CanadaAugust 18-20, 1982.",
                "count": 30,
                "papers": [
                    "Language Constructs and Support Systems for Distributed Computing.",
                    "Distributed Communication via Global Buffer.",
                    "Language Concepts for Distributed Processing of Large Arrays.",
                    "Dynamic Systems and Their Distributed Termination.",
                    "UIDS as Internal Names in a Distributed File System.",
                    "Testing Incomplete Specifications of Distributed Systems.",
                    "Distributed Multi-Destination Routing: The Constraints of Local Information.",
                    "Efficient Schemes for Parallel Communication.",
                    "Randomized Parallel Communication (Preliminary Version).",
                    "Distributed Allocation with Pools of Servers.",
                    "Real Time Resource Allocation in Distributed Systems.",
                    "Finding Safe Paths in a Faulty Environment.",
                    "Four Combinators for Concurrency.",
                    "A Refinement of Kahn's Semantic to Handle Non-Determinism and Communication (Extended Abstract).",
                    "On the Distribution of an Assertion.",
                    "Bounds on Information Exchange for Byzantine Agreement.",
                    "Understanding and Using Asynchronous Message Passing (Preliminary Version).",
                    "Can Message Buffers be Characterized in Linear Temporal Logic?",
                    "A Distributed Algorithm for Detecting Resource Deadlocks in Distributed Systems.",
                    "On-the-fly Deadlock Prevention.",
                    "Edge Locks and Deadlock Avoidance in Distributed Systems.",
                    "Why Control of the Concurrency Level in Distributed Systems is More Fundamental Than Deadlock Management.",
                    "On Serializability of Iterated Transactions.",
                    "Proving Safety and Liveness of Communicating Processes with Examples.",
                    "Concurrency Control Algorithms for Multiversion Database Systems.",
                    "A Multi-Version Concurrency Scheme With No Rollbacks.",
                    "A Distributed Transaction Processing Protocol Based on Majority Consensus.",
                    "N-Processors Graph Distributively Achieve Perfect Matchings in O(log2N) Beats.",
                    "On Parallel Searching (Extended Abstract).",
                    "Folding and Unrolling Systolic Arrays (Preliminary Version)."
                ]
            }
        ]
    }
]