[
    {
        "year": "2021",
        "name": "26th PPOPP 2021",
        "info": "Virtual Event, Republic of Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2021",
                "sub_name": "PPoPP '21: 26th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Virtual Event, Republic of Korea, February 27- March 3, 2021.",
                "count": 48,
                "papers": [
                    "Efficient algorithms for persistent transactional memory.",
                    "Investigating the semantics of futures in transactional memory systems.",
                    "Constant-time snapshots with applications to concurrent data structures.",
                    "Reasoning about recursive tree traversals.",
                    "Synthesizing optimal collective algorithms.",
                    "Parallel binary code analysis.",
                    "Compiler support for near data computing.",
                    "Scaling implicit parallelism via dynamic control replication.",
                    "Understanding and bridging the gaps in current GNN performance optimizations.",
                    "A fast work-efficient SSSP algorithm for GPUs.",
                    "ShadowVM: accelerating data plane for data analytics with bare metal CPUs and GPUs.",
                    "BiPart: a parallel and deterministic hypergraph partitioner.",
                    "NBR: neutralization based reclamation.",
                    "Efficiently reclaiming memory in concurrent search data structures while bounding wasted memory.",
                    "OrcGC: automatic lock-free memory reclamation.",
                    "Are dynamic memory managers on GPUs slow?: a survey and benchmarks.",
                    "GPTune: multitask learning for autotuning exascale applications.",
                    "I/O lower bounds for auto-tuning of convolutions in CNNs.",
                    "ApproxTuner: a compiler and runtime system for adaptive approximations.",
                    "EGEMM-TC: accelerating scientific computing on tensor cores with extended precision.",
                    "Efficiently running SpMV on long vector architectures.",
                    "Improving communication by optimizing on-node data movement with data layout.",
                    "Sparta: high-performance, element-wise sparse tensor contraction on heterogeneous memory.",
                    "Advanced synchronization techniques for task-based runtime systems.",
                    "An ownership policy and deadlock detector for promises.",
                    "Understanding a program's resiliency through error propagation.",
                    "Lightweight preemptive user-level threads.",
                    "TurboTransformers: an efficient GPU serving system for transformer models.",
                    "Extracting clean performance models from tainted programs.",
                    "Modernizing parallel code with pattern analysis.",
                    "DAPPLE: a pipelined data parallel approach for training large models.",
                    "On group mutual exclusion for dynamic systems.",
                    "Bundled references: an abstraction for highly-concurrent linearizable range queries.",
                    "Verifying C11-style weak memory libraries.",
                    "A lock-free relaxed concurrent queue for fast work distribution.",
                    "A more pragmatic implementation of the lock-free, ordered, linked list.",
                    "Extending MapReduce framework with locality keys.",
                    "On the parallel I/O optimality of linear algebra kernels: near-optimal LU factorization.",
                    "Asynchrony versus bulk-synchrony for a generalized N-body problem from genomics.",
                    "In-situ workflow auto-tuning through combining component models.",
                    "Simplifying low-level GPU programming with GAS.",
                    "Corder: cache-aware reordering for optimizing graph analytics.",
                    "DFOGraph: an I/O- and communication-efficient system for distributed fully-out-of-core graph processing.",
                    "An efficient uncertain graph processing framework for heterogeneous architectures.",
                    "Dynamic scaling for low-precision learning.",
                    "Exploring deep reuse in winograd CNN inference.",
                    "A novel memory-efficient deep learning training framework via error-bounded lossy compression.",
                    "FFT blitz: the tensor cores strike back."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "25th PPOPP 2020",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2020",
                "sub_name": "PPoPP '20: 25th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, San Diego, California, USA, February 22-26, 2020.",
                "count": 46,
                "papers": [
                    "Kite: efficient and available release consistency for the datacenter.",
                    "Oak: a scalable off-heap allocated key-value map.",
                    "Optimizing batched Winograd convolution on GPUs.",
                    "Taming unbalanced training workloads in deep learning with partial collective operations.",
                    "Scalable top-k retrieval with Sparta.",
                    "waveSZ: a hardware-algorithm co-design of efficient lossy compression for scientific data.",
                    "Scaling concurrent queues by using HTM to profit from failed atomic operations.",
                    "A wait-free universal construction for large objects.",
                    "Fast concurrent data sketches.",
                    "Universal wait-free memory reclamation.",
                    "Using sample-based time series data for automated diagnosis of scalability losses in parallel programs.",
                    "Scaling out speculative execution of finite-state machines with parallel merge.",
                    "On the fly MHP analysis.",
                    "Detecting and reproducing error-code propagation bugs in MPI implementations.",
                    "Parallel and distributed bounded model checking of multi-threaded programs.",
                    "Parallel determinacy race detection for futures.",
                    "Practical parallel hypergraph algorithms.",
                    "A supernodal all-pairs shortest path algorithm.",
                    "Increasing the parallelism of graph coloring via shortcutting.",
                    "Non-blocking interpolation search trees with doubly-logarithmic running time.",
                    "YewPar: skeletons for exact combinatorial search.",
                    "XIndex: a scalable learned index for multicore data storage.",
                    "Overlapping host-to-device copy and computation using hidden unified memory.",
                    "<u>G</u>PU <u>i</u>nitiated <u>O</u>penSHMEM: correct and efficient intra-kernel networking for dGPUs.",
                    "No barrier in the road: a comprehensive study and optimization of ARM barriers.",
                    "spECK: accelerating GPU sparse matrix-matrix multiplication through lightweight analysis.",
                    "A novel data transformation and execution strategy for accelerating sparse matrix multiplication on GPUs.",
                    "MatRox: modular approach for improving data locality in hierarchical (Mat)rix App(Rox)imation.",
                    "A parallel sparse tensor benchmark suite on CPUs and GPUs.",
                    "Nesting and composition in transactional data structure libraries.",
                    "ELDA: LDA made efficient via algorithm-system codesign submission.",
                    "Identifying scalability bottlenecks for large-scale parallel programs with graph analysis.",
                    "Revisiting linpack algorithm on large-scale CPU-GPU heterogeneous systems.",
                    "Neighbor-list-free molecular dynamics on sunway TaihuLight supercomputer.",
                    "A tool for top-down performance analysis of GPU-accelerated applications.",
                    "Functional faults.",
                    "Breaking master-slave model between host and FPGAs.",
                    "Understanding and optimizing persistent memory allocation.",
                    "Testing concurrency on the JVM with lincheck.",
                    "ArcherGear: data race equivalencing for expeditious HPC debugging.",
                    "Reflector: a fine-grained I/O tracker for HPC systems.",
                    "Nonblocking persistent software transactional memory.",
                    "Optimizing GPU programs by partial evaluation.",
                    "Restricted memory-friendly lock-free bounded queues.",
                    "Understand the overheads of storage data structures on persistent memory.",
                    "PLUM: static parallel program locality analysis under uniform multiplexing."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2020gpgpu",
                "sub_name": "GPGPU@PPoPP '20: 13th Annual Workshop on General Purpose Processing using Graphics Processing Unit colocated with 25th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, San Diego, California, USA, February 23, 2020.",
                "count": 7,
                "papers": [
                    "The Minos Computing Library: efficient parallel programming for extremely heterogeneous systems.",
                    "Unveiling kernel concurrency in multiresolution filters on GPUs with an image processing DSL.",
                    "High-level hardware feature extraction for GPU performance prediction of stencils.",
                    "GPGPU performance estimation for frequency scaling using cross-benchmarking.",
                    "Automatic generation of specialized direct convolutions for mobile GPUs.",
                    "Custom code generation for a graph DSL.",
                    "Automated test generation for OpenCL kernels using fuzzing and constraint solving."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2020pmam",
                "sub_name": "PMAM@PPoPP '20: Eleventh International Workshop on Programming Models and Applications for Multicores and Manycores colocated with the 25th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, San Diego, California, USA, February 22, 2020.",
                "count": 8,
                "papers": [
                    "Bounded incoherence: a programming model for non-cache-coherent shared memory architectures.",
                    "ELSE: an efficient link-time static instrumentation tool for embedded system.",
                    "TardisTM: incremental repair for transactional memory.",
                    "Self-adjusting task granularity for Global load balancer library on clusters of many-core processors.",
                    "Towards a portable hierarchical view of distributed shared memory systems: challenges and solutions.",
                    "Lock-free transactional vector.",
                    "Exploring accelerator and parallel graph algorithmic choices for temporal graphs.",
                    "Generating energy-efficient code for parallel applications specified by streaming task graphs with dynamic elements."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2020wpmvp",
                "sub_name": "WPMVP@PPoPP '20: Sixth Workshop on Programming Models for SIMD/Vector Processing lolocated with the 25th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, San Diego, CA, USA, February 22, 2020.",
                "count": 3,
                "papers": [
                    "Scheduling Irregular Dataflow Pipelines on SIMD Architectures.",
                    "How to speed Connected Component Labeling up with SIMD RLE algorithms.",
                    "SIMD-based Exact Parallel Fuzzy Dilation Operator for Fast Computing of Fuzzy Spatial Relations."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th PPOPP 2019",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2019",
                "sub_name": "Proceedings of the 24th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP 2019, Washington, DC, USA, February 16-20, 2019.",
                "count": 60,
                "papers": [
                    "Beyond human-level accuracy: computational challenges in deep learning.",
                    "S-EnKF: co-designing for scalable ensemble Kalman filter.",
                    "Throughput-oriented GPU memory allocation.",
                    "SEP-graph: finding shortest execution paths for graph processing under a hybrid framework on GPU.",
                    "Incremental flattening for nested data parallelism.",
                    "Adaptive sparse matrix-matrix multiplication on the GPU.",
                    "Modular transactions: bounding mixed races in space and time.",
                    "Leveraging hardware TM in Haskell.",
                    "Stretching the capacity of hardware transactional memory in IBM POWER architectures.",
                    "Processing transactions in a predefined order.",
                    "Harmonia: a high throughput B+tree for GPUs.",
                    "Engineering a high-performance GPU B-Tree.",
                    "QTLS: high-performance TLS asynchronous offload framework with Intel® QuickAssist technology.",
                    "Data-flow/dependence profiling for structured transformations.",
                    "Lightweight hardware transactional memory profiling.",
                    "A pattern based algorithmic autotuner for graph processing on GPUs.",
                    "Provably and practically efficient granularity control.",
                    "A coordinated tiling and batching framework for efficient GEMM on GPUs.",
                    "Semantics-aware scheduling policies for synchronization determinism.",
                    "Proactive work stealing for futures.",
                    "A round-efficient distributed betweenness centrality algorithm.",
                    "Corrected trees for reliable group communication.",
                    "Adaptive sparse tiling for sparse matrix multiplication.",
                    "Encapsulated open nesting for STM: fine-grained higher-level conflict detection.",
                    "A specialized B-tree for concurrent datalog evaluation.",
                    "Efficient race detection with futures.",
                    "Verifying C11 programs operationally.",
                    "Checking linearizability using hitting families.",
                    "Transitive joins: a sound and efficient online deadlock-avoidance policy.",
                    "VEBO: a vertex- and edge-balanced ordering heuristic to load balance parallel graph processing.",
                    "GPOP: a cache and memory-efficient framework for graph processing over partitions.",
                    "Optimizing graph processing on GPUs using approximate computing: poster.",
                    "A GPU memory efficient speed-up scheme for training ultra-deep neural networks: poster.",
                    "Profiling based out-of-core hybrid method for large neural networks: poster.",
                    "Exploiting the input sparsity to accelerate deep neural networks: poster.",
                    "Accelerating distributed stochastic gradient descent with adaptive periodic parameter averaging: poster.",
                    "Optimizing GPU programs by register demotion: poster.",
                    "A distributed hypervisor for resource aggregation: poster.",
                    "Scheduling HPC workloads on heterogeneous-ISA architectures: poster.",
                    "T-thinker: a task-centric distributed framework for compute-intensive divide-and-conquer algorithms.",
                    "Toward efficient architecture-independent algorithms for dynamic programs: poster.",
                    "Optimizing computation-communication overlap in asynchronous task-based programs: poster.",
                    "Lock-free channels for programming via communicating sequential processes: poster.",
                    "Making concurrent algorithms detectable: poster.",
                    "GPU-based 3D cryo-EM reconstruction with key-value streams: poster.",
                    "BASMAT: bottleneck-aware sparse matrix-vector multiplication auto-tuning on GPGPUs.",
                    "LOFT: lock-free transactional data structures.",
                    "Automated multi-dimensional elasticity for streaming runtimes: poster.",
                    "Compiler-assisted adaptive program scheduling in big.LITTLE systems: poster.",
                    "GOPipe: a granularity-oblivious programming framework for pipelined stencil executions on GPU.",
                    "High-throughput image alignment for connectomics using frugal snap judgments: poster.",
                    "CuLDA_CGS: solving large-scale LDA problems on GPUs.",
                    "Managing application parallelism via parallel efficiency regulation: poster.",
                    "Blockchain abstract data type: poster.",
                    "Creating repeatable, reusable experimentation pipelines with popper: tutorial.",
                    "Building parallel programming language constructs in the AbleC extensible C compiler framework: a PPoPP tutorial.",
                    "Implementing parallel and concurrent tree structures.",
                    "Programming quantum computers: a primer with IBM Q and D-Wave exercises.",
                    "High performance distributed deep learning: a beginner's guide.",
                    "Performance portable C++ programming with RAJA."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2019pmam",
                "sub_name": "Proceedings of the 10th International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM@PPoPP 2019, Washington, DC, USA, February 17, 2019.",
                "count": 10,
                "papers": [
                    "LiTM: A Lightweight Deterministic Software Transactional Memory System.",
                    "Don't Forget About Synchronization!: A Case Study of K-Means on GPU.",
                    "Gecko: Hierarchical Distributed View of Heterogeneous Shared Memory Architectures.",
                    "Brie: A Specialized Trie for Concurrent Datalog.",
                    "Wait-free Dynamic Transactions for Linked Data Structures.",
                    "Deciphering Predictive Schedulers for Heterogeneous-ISA Multicore Architectures.",
                    "Formal Verification through Combinatorial Topology: the CAS-Extended Model.",
                    "Process Barrier for Predictable and Repeatable Concurrent Execution.",
                    "libMPNode: An OpenMP Runtime For Parallel Processing Across Incoherent Domains.",
                    "Task-DAG Support in Single-Source PHAST Library: Enabling Flexible Assignment of Tasks to CPUs and GPUs in Heterogeneous Architectures."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd PPOPP 2018",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2018",
                "sub_name": "Proceedings of the 23rd ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP 2018, Vienna, Austria, February 24-28, 2018.",
                "count": 50,
                "papers": [
                    "Interval-based memory reclamation.",
                    "Harnessing epoch-based reclamation for efficient range queries.",
                    "A persistent lock-free queue for non-volatile memory.",
                    "Superneurons: dynamic GPU memory management for training deep neural networks.",
                    "Juggler: a dependence-aware task-based execution framework for GPUs.",
                    "HPVM: heterogeneous parallel virtual machine.",
                    "Hierarchical memory management for mutable state.",
                    "Bridging the gap between deep learning and sparse matrix format selection.",
                    "Optimizing N-dimensional, winograd-based convolution for manycore CPUs.",
                    "vSensor: leveraging fixed-workload snippets of programs for performance variance detection.",
                    "Cache-tries: concurrent lock-free hash tries with constant-time operations.",
                    "Featherlight on-the-fly false-sharing detection.",
                    "Register optimizations for stencils on GPUs.",
                    "FlashR: parallelize and scale R for machine learning using SSDs.",
                    "DisCVar: discovering critical variables using algorithmic differentiation for transient faults.",
                    "Practical concurrent traversals in search trees.",
                    "Communication-avoiding parallel minimum cuts and connected components.",
                    "Safe privatization in transactional memory.",
                    "Making pull-based graph processing performant.",
                    "An effective fusion and tile size model for optimizing image processing pipelines.",
                    "Lazygraph: lazy data coherency for replicas in distributed graph-parallel computation.",
                    "PAM: parallel augmented maps.",
                    "Efficient shuffle management with SCache for DAG computing frameworks.",
                    "High-performance genomic analysis framework with in-memory computing.",
                    "Griffin: uniting CPU and GPU in information retrieval systems for intra-query parallelism.",
                    "swSpTRSV: a fast sparse triangular solve with sparse level tile layout on sunway architectures.",
                    "VerifiedFT: a verified, high-performance precise dynamic race detector.",
                    "Efficient parallel determinacy race detection for two-dimensional dags.",
                    "Performance challenges in modular parallel programs.",
                    "Reducing the burden of parallel loop schedulers for many-core processors.",
                    "Reducing transaction aborts by looking to the future.",
                    "Strong trylocks for reader-writer locks.",
                    "SecureMR: secure mapreduce using homomorphic encryption and program partitioning.",
                    "A scalable distance-1 vertex coloring algorithm for power-law graphs.",
                    "Shared-memory parallelization of MTTKRP for dense tensors.",
                    "Revealing parallel scans and reductions in sequential loops through function reconstruction.",
                    "Performance modeling for GPUs using abstract kernel emulation.",
                    "Two concurrent data structures for efficient datalog query processing.",
                    "A scalable queue for work distribution on GPUs.",
                    "Designing scalable FPGA architectures using high-level synthesis.",
                    "Layrub: layer-centric GPU memory reuse and data migration in extreme-scale deep learning systems.",
                    "Register-based implementation of the sparse general matrix-matrix multiplication on GPUs.",
                    "Quantifying and reducing execution variance in STM via model driven commit optimization.",
                    "Transparent GPU memory management for DNNs.",
                    "Stamp-it, amortized constant-time memory reclamation in comparison to five other schemes.",
                    "A predictable synchronisation algorithm.",
                    "Automated code acceleration targeting heterogeneous openCL devices.",
                    "Graph partitioning applied to DAG scheduling to reduce NUMA effects.",
                    "A microbenchmark to study GPU performance models.",
                    "SIMD code generation for stencils on brick decompositions."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2018gpgpu",
                "sub_name": "11th Workshop on General Purpose Processing using GPUs, GPGPU@PPoPP 2018, February 25, 2018, Vosendorf (Vienna), Austria.",
                "count": 8,
                "papers": [
                    "Initial Steps toward Making GPU a First-Class Computing Resource: Sharing and Resource Management.",
                    "A Case for Scoped Persist Barriers in GPUs.",
                    "Overcoming the difficulty of large-scale CGH generation on multi-GPU cluster.",
                    "Transparent Avoidance of Redundant Data Transfer on GPU-enabled Apache Spark.",
                    "GPU-based Acceleration of Detailed Tissue-Scale Cardiac Simulations.",
                    "Generating High Performance GPU Code using Rewrite Rules with Lift.",
                    "MaxPair: Enhance OpenCL Concurrent Kernel Execution by Weighted Maximum Matching.",
                    "Oversubscribed Command Queues in GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2018wpmvp",
                "sub_name": "Proceedings of the 4th Workshop on Programming Models for SIMD/Vector Processing, WPMVP@PPoPP 2018, Vienna, Austria, February 24, 2018.",
                "count": 8,
                "papers": [
                    "Small SIMD Matrices for CERN High Throughput Computing.",
                    "MIPP: a Portable C++ SIMD Wrapper and its use for Error Correction Coding in 5G Standard.",
                    "SIMDization of Small Tensor Multiplication Kernels for Wide SIMD Vector Processors.",
                    "Usuba: Optimizing & Trustworthy Bitslicing Compiler.",
                    "Investigating automatic vectorization for real-time 3D scene understanding.",
                    "Ikra-Cpp: A C++/CUDA DSL for Object-Oriented Programming with Structure-of-Arrays Layout.",
                    "A Data Layout Transformation for Vectorizing Compilers.",
                    "Vectorization of a spectral finite-element numerical kernel."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2018pmam",
                "sub_name": "Proceedings of the 9th International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM@PPoPP 2018, February 25, 2018, Vienna, Austria.",
                "count": 9,
                "papers": [
                    "Understanding Parallelization Tradeoffs for Linear Pipelines.",
                    "Combining PREM compilation and ILP scheduling for high-performance and predictable MPSoC execution.",
                    "An Evaluation of Vectorization and Cache Reuse Tradeoffs on Modern CPUs.",
                    "Fast and Accurate Performance Analysis of Synchronization.",
                    "Supporting Fine-grained Dataflow Parallelism in Big Data Systems.",
                    "Reduction to Band Form for the Singular Value Decomposition on Graphics Accelerators.",
                    "Intra-Task Parallelism in Automotive Real-Time Systems.",
                    "Extending ILUPACK with a Task-Parallel Version of BiCG for Dual-GPU Servers.",
                    "VAIL: A Victim-Aware Cache Policy for Improving Lifetime of Hybrid Memory."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22nd PPOPP 2017",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2017",
                "sub_name": "Proceedings of the 22nd ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Austin, TX, USA, February 4-8, 2017.",
                "count": 47,
                "papers": [
                    "It's Time for a New Old Language.",
                    "EffiSha: A Software Framework for Enabling Effficient Preemptive Scheduling of GPU.",
                    "Layout Lock: A Scalable Locking Paradigm for Concurrent Data Layout Modifications.",
                    "Understanding the GPU Microarchitecture to Achieve Bare-Metal Performance Tuning.",
                    "Checking Concurrent Data Structures Under the C/C++11 Memory Model.",
                    "An Efficient Abortable-locking Protocol for Multi-level NUMA Systems.",
                    "Contention in Structured Concurrency: Provably Efficient Dynamic Non-Zero Indicators for Nested Parallelism.",
                    "Noise Injection Techniques to Expose Subtle and Unintended Message Races.",
                    "Thread Data Sharing in Cache: Theory and Measurement.",
                    "Exploiting Vector and Multicore Parallelism for Recursive, Data- and Task-Parallel Programs.",
                    "Isoefficiency in Practice: Configuring and Understanding the Performance of Task-based Applications.",
                    "Processor-Oblivious Record and Replay.",
                    "Simple, Accurate, Analytical Time Modeling and Optimal Tile Size Selection for GPGPU Stencils.",
                    "Combining SIMD and Many/Multi-core Parallelism for Finite State Machines with Enumerative Speculation.",
                    "S-Caffe: Co-designing MPI Runtimes and Caffe for Scalable Deep Learning on Modern GPU Clusters.",
                    "Model-based Iterative CT Image Reconstruction on GPUs.",
                    "Pagoda: Fine-Grained GPU Resource Virtualization for Narrow Tasks.",
                    "Groute: An Asynchronous Multi-GPU Programming Model for Irregular Computations.",
                    "Tapir: Embedding Fork-Join Parallelism into LLVM's Intermediate Representation.",
                    "A Multicore Path to Connectomics-on-Demand.",
                    "SC-Haskell: Sequential Consistency in Languages That Minimize Mutable Shared Heap.",
                    "Synchronized-by-Default Concurrency for Shared-Memory Systems.",
                    "Function Call Re-Vectorization.",
                    "Optimizing the Four-Index Integral Transform Using Data Movement Lower Bounds Analysis.",
                    "Using Butterfly-Patterned Partial Sums to Draw from Discrete Distributions.",
                    "KiWi: A Key-Value Map for Scalable Real-Time Analytics.",
                    "Grammar-aware Parallelization for Scalable XPath Querying.",
                    "Eunomia: Scaling Concurrent Search Trees under Contention Using HTM.",
                    "Self-Checkpoint: An In-Memory Checkpoint Method Using Less Space and Its Practice on Fault-Tolerant HPL.",
                    "Silent Data Corruption Resilient Two-sided Matrix Factorizations.",
                    "POSTER: Reuse, don't Recycle: Transforming Algorithms that Throw Away Descriptors.",
                    "POSTER: An Architecture and Programming Model for Accelerating Parallel Commutative Computations via Privatization.",
                    "POSTER: HythTM: Extending the Applicability of Intel TSX Hardware Transactional Support.",
                    "POSTER: Provably Efficient Scheduling of Cache-Oblivious Wavefront Algorithms.",
                    "POSTER: State Teleportation via Hardware Transactional Memory.",
                    "POSTER: IOGP: An Incremental Online Graph Partitioning for Large-Scale Distributed Graph Databases.",
                    "POSTER: Distributed Control: The Benefits of Eliminating Global Synchronization via Effective Scheduling.",
                    "POSTER: MAPA: An Automatic Memory Access Pattern Analyzer for GPU Applications.",
                    "POSTER: Cache-Oblivious MPI All-to-All Communications on Many-Core Architectures.",
                    "POSTER: Automated Load Balancer Selection Based on Application Characteristics.",
                    "POSTER: A GPU-Friendly Skiplist Algorithm.",
                    "POSTER: Poor Man's URCU.",
                    "POSTER: A Wait-Free Queue with Wait-Free Memory Reclamation.",
                    "POSTER: STAR (Space-Time Adaptive and Reductive) Algorithms for Real-World Space-Time Optimality.",
                    "POSTER: Recovering Performance for Vector-based Machine Learning on Managed Runtime.",
                    "POSTER: On the Problem of Consistency Exceptions in the Context of Strong Memory Models.",
                    "POSTER: An Infrastructure for HPC Knowledge Sharing and Reuse."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2017pmam",
                "sub_name": "Proceedings of the 8th International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM@PPoPP 2017, Austin, TX, USA, February 5, 2017.",
                "count": 9,
                "papers": [
                    "Batched Gauss-Jordan Elimination for Block-Jacobi Preconditioner Generation on GPUs.",
                    "TaskInsight: Understanding Task Schedules Effects on Memory and Performance.",
                    "A high-performance portable abstract interface for explicit SIMD vectorization.",
                    "PETRAS: Performance, Energy and Thermal Aware Resource Allocation and Scheduling for Heterogeneous Systems.",
                    "Reduction to Tridiagonal Form for Symmetric Eigenproblems on Asymmetric Multicore Processors.",
                    "High Performance Detection of Strongly Connected Components in Sparse Graphs on GPUs.",
                    "Towards Composable GPU Programming: Programming GPUs with Eager Actions and Lazy Views.",
                    "Assessing One-to-One Parallelism Levels Mapping for OpenMP Offloading to GPUs.",
                    "A Framework for Developing Parallel Applications with high level Tasks on Heterogeneous Platforms."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2017gpgpu",
                "sub_name": "Proceedings of the General Purpose GPUs, GPGPU@PPoPP, Austin, TX, USA, February 4-8, 2017.",
                "count": 8,
                "papers": [
                    "Understanding The Security of Discrete GPUs.",
                    "Efficient Convex Optimization on GPUs for Embedded Model Predictive Control.",
                    "Merge or Separate?: Multi-job Scheduling for OpenCL Kernels on CPU/GPU Platforms.",
                    "Launch-Time Optimization of OpenCL GPU Kernels.",
                    "High-performance Cholesky factorization for GPU-only execution.",
                    "Directive-based tile abstraction to distribute loops on accelerators.",
                    "DNNMark: A Deep Neural Network Benchmark Suite for GPUs.",
                    "Parallel CCD++ on GPU for Matrix Factorization."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21st PPOPP 2016",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2016",
                "sub_name": "Proceedings of the 21st ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP 2016, Barcelona, Spain, March 12-16, 2016.",
                "count": 55,
                "papers": [
                    "Coarse grain parallelization of deep neural networks.",
                    "High performance model based image reconstruction.",
                    "Exploiting accelerators for efficient high dimensional similarity search.",
                    "Declarative coordination of graph-based parallel programs.",
                    "Distributed Halide.",
                    "Parallel type-checking with haskell using saturating LVars and stream generators.",
                    "Articulation points guided redundancy elimination for betweenness centrality.",
                    "Multi-core on-the-fly SCC decomposition.",
                    "A high-performance parallel algorithm for nonnegative matrix factorization.",
                    "AUTOGEN: automatic discovery of cache-oblivious parallel recursive algorithms for solving dynamic programs.",
                    "Gunrock: a high-performance graph processing library on the GPU.",
                    "GPU multisplit.",
                    "Keep calm and react with foresight: strategies for low-latency and energy-efficient elastic data stream processing.",
                    "Work stealing for interactive services to meet target latency.",
                    "Adding approximate counters.",
                    "A wait-free queue as fast as fetch-and-add.",
                    "Lease/release: architectural support for scaling contended data structures.",
                    "Optimistic concurrency with OPTIK.",
                    "Refined transactional lock elision.",
                    "Drinking from both glasses: combining pessimistic and optimistic tracking of cross-thread dependences.",
                    "Be my guest: MCS lock now welcomes guests.",
                    "Contention-conscious, locality-preserving locks.",
                    "DomLock: a new multi-granularity locking technique for hierarchies.",
                    "Benchmarking weak memory models.",
                    "The virtues of conflict: analysing modern concurrency.",
                    "Causal consistency: beyond memory.",
                    "ESTIMA: extrapolating scalability of in-memory applications.",
                    "Grain graphs: OpenMP performance analysis made easy.",
                    "Production-guided concurrency debugging.",
                    "Affinity-aware work-stealing for integrated CPU-GPU processors.",
                    "An interval constrained memory allocator for the Givy GAS runtime.",
                    "A programming system for future proofing performance critical libraries.",
                    "A scalable lock-free hash table with open addressing.",
                    "Concurrent hash tables: fast and general?(!).",
                    "CUDA acceleration for Xen virtual machines in infiniband clusters with rCUDA.",
                    "Effect of portable fine-grained locality on energy efficiency and performance in concurrent search trees.",
                    "Efficient distributed workstealing via matchmaking.",
                    "Data-centric combinatorial optimization of parallel code.",
                    "DSMR: a shared and distributed memory algorithm for single-source shortest path problem.",
                    "Generic messages: capability-based shared memory parallelism for event-loop systems.",
                    "Hybrid CPU-GPU scheduling and execution of tree traversals.",
                    "Improving efficacy of internal binary search trees using local recovery.",
                    "Merge-based sparse matrix-vector multiplication (SpMV) using the CSR storage format.",
                    "NUMA-aware scheduling and memory allocation for data-flow task-parallel applications.",
                    "On designing NUMA-aware concurrency control for scalable transactional memory.",
                    "On ordering transaction commit.",
                    "OPR: deterministic group replay for one-sided communication.",
                    "Preemption-aware planning on big-data systems.",
                    "Samsara parallel: a non-BSP parallel-in-time model.",
                    "Scalable adaptive NUMA-aware lock: combining local locking and remote locking for efficient concurrency.",
                    "SPIRIT: a runtime system for distributed irregular tree applications.",
                    "Tidex: a mutual exclusion lock.",
                    "Unifying fixed code and fixed data mapping of load-imbalanced pipelined loops.",
                    "User-assisted storage reuse determination for dynamic task graphs.",
                    "Verification of MPI Java programs using software model checking."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2016pmam",
                "sub_name": "Proceedings of the 7th International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM@PPoPP 2016, Barcelona, Spain, March 12-16, 2016.",
                "count": 13,
                "papers": [
                    "An Evaluation of Emerging Many-Core Parallel Programming Models.",
                    "Discovering Pipeline Parallel Patterns in Sequential Legacy C++ Codes.",
                    "Embedding Semantics of the Single-Producer/Single-Consumer Lock-Free Queue into a Race Detection Tool.",
                    "Accelerating Dynamic Data Race Detection Using Static Thread Interference Analysis.",
                    "Efficient Parallelization of Complex Automotive Systems.",
                    "Enhancing Metaheuristic-based Virtual Screening Methods on Massively Parallel and Heterogeneous Systems.",
                    "Parallel Locality and Parallelization Quality.",
                    "Software-managed Cache Coherence for fast One-Sided Communication.",
                    "Multitasking Real-time Embedded GPU Computing Tasks.",
                    "Flow Driven GPGPU Programming combining Textual and Graphical Programming.",
                    "Multi-GPU implementation of the Horizontal Diffusion method of the Weather Research and Forecast Model.",
                    "JParEnt: Parallel Entropy Decoding for JPEG Decompression on Heterogeneous Multicore Architectures.",
                    "On Guided Installation of Basic Linear Algebra Routines in Nodes with Manycore Components."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2016gpgpu",
                "sub_name": "Proceedings of the 9th Annual Workshop on General Purpose Processing using Graphics Processing Unit, GPGPU@PPoPP 2016, Barcelona, Spain, March 12 - 16, 2016.",
                "count": 12,
                "papers": [
                    "Runtime aware architectures.",
                    "GPU centric extensions for parallel strongly connected components computation.",
                    "General-purpose join algorithms for large graph triangle listing on heterogeneous systems.",
                    "Performance portable GPU code generation for matrix multiplication.",
                    "Multi-stage programming for GPUs in C++ using PACXX.",
                    "Simplifying programming and load balancing of data parallel applications on heterogeneous systems.",
                    "Working together to build the heterogeneous processing ecosystem.",
                    "Implementing directed acyclic graphs with the heterogeneous system architecture.",
                    "GPUpIO: the case for I/O-driven preemption on GPUs.",
                    "A systems perspective on GPU computing: a tribute to Karsten Schwan.",
                    "Designing high performance communication runtime for GPU managed memory: early experiences.",
                    "Effective resource management for enhancing performance of 2D and 3D stencils on GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2016wpmvp",
                "sub_name": "Proceedings of the 3rd Workshop on Programming Models for SIMD/Vector Processing, WPMVP@PPoPP 2016, Barcelona, Spain, March 13, 2016.",
                "count": 6,
                "papers": [
                    "A new SIMD iterative connected component labeling algorithm.",
                    "Support for data parallelism in the CAL actor language.",
                    "An evaluation of current SIMD programming models for C++.",
                    "Compilers, hands-off my hands-on optimizations.",
                    "Auto-vectorizing a large-scale production unstructured-mesh CFD application.",
                    "Code vectorization using Intel Array Notation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20th PPOPP 2015",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2015",
                "sub_name": "Proceedings of the 20th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP 2015, San Francisco, CA, USA, February 7-11, 2015.",
                "count": 44,
                "papers": [
                    "More than you ever wanted to know about synchronization: synchrobench, measuring the impact of the synchronization on concurrent algorithms.",
                    "The SprayList: a scalable relaxed priority queue.",
                    "Predicate RCU: an RCU for scalable concurrent updates.",
                    "Automatic scalable atomicity via semantic locking.",
                    "A framework for practical parallel fast matrix multiplication.",
                    "PLUTO+: near-complete modeling of affine transformations for parallelism and locality.",
                    "Distributed memory code generation for mixed Irregular/Regular computations.",
                    "Software partitioning of hardware transactions.",
                    "Performance implications of dynamic memory allocators on transactional memory systems.",
                    "Low-overhead software transactional memory with progress guarantees and strong semantics.",
                    "Barrier elision for production parallel programs.",
                    "Scalable and efficient implementation of 3d unstructured meshes computation: a case study on matrix assembly.",
                    "Diagnosing the causes and severity of one-sided message contention.",
                    "A parallel algorithm for global states enumeration in concurrent systems.",
                    "Dynamic deadlock verification for general barrier synchronisation.",
                    "VirtCL: a framework for OpenCL device abstraction and management.",
                    "On optimizing machine learning workloads via kernel fusion.",
                    "NUMA-aware graph-structured analytics.",
                    "SYNC or ASYNC: time to fuse for distributed graph-parallel computation.",
                    "Cache-oblivious wavefront: improving parallelism of recursive dynamic programming algorithms without losing cache-efficiency.",
                    "High performance locks for multi-level NUMA systems.",
                    "A library for portable and composable data locality optimizations for NUMA systems.",
                    "MPI+Threads: runtime contention and remedies.",
                    "Fence placement for legacy data-race-free programs via synchronization read detection.",
                    "JAWS: a JavaScript framework for adaptive CPU-GPU work sharing.",
                    "GStream: a graph streaming processing method for large-scale graphs on GPUs.",
                    "SemCache++: semantics-aware caching for efficient multi-GPU offloading.",
                    "An OpenACC-based unified programming model for multi-accelerator systems.",
                    "The lazy happens-before relation: better partial-order reduction for systematic concurrency testing.",
                    "Towards batched linear solvers on accelerated hardware platforms.",
                    "A collection-oriented programming model for performance portability.",
                    "Gunrock: a high-performance graph processing library on the GPU.",
                    "Decoupled load balancing.",
                    "Combining phase identification and statistic modeling for automated parallel benchmark generation.",
                    "Optimization of asynchronous graph processing on GPU with hybrid coloring model.",
                    "Efficient and reasonable object-oriented concurrency.",
                    "A programming model and runtime system for significance-aware energy-efficient computing.",
                    "The lock-free k-LSM relaxed priority queue.",
                    "Static/Dynamic validation of MPI collective communications in multi-threaded context.",
                    "CASTLE: fast concurrent internal binary search tree using edge-based locking.",
                    "Section based program analysis to reduce overhead of detecting unsynchronized thread communication.",
                    "A hierarchical approach to reducing communication in parallel graph algorithms.",
                    "Tiles: a new language mechanism for heterogeneous parallelism.",
                    "Are web applications ready for parallelism?"
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2015pmam",
                "sub_name": "Proceedings of the Sixth International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM@PPoPP 2015, San Francisco, CA, USA, February 7-8, 2015.",
                "count": 19,
                "papers": [
                    "Energy efficiency and performance frontiers for sparse computations on GPU supercomputers.",
                    "Energy-efficient computing for HPC workloads on heterogeneous manycore chips.",
                    "A performance study of Java garbage collectors on multicore architectures.",
                    "Toward an evolutionary task parallel integrated MPI + X programming model.",
                    "Design and evaluation of a novel dataflow based bigdata solution.",
                    "Programming support for reconfigurable custom vector architectures.",
                    "Thread-level parallelization and optimization of NWChem for the Intel MIC architecture.",
                    "Parallelism vs. speculation: exploiting speculative genetic algorithm on GPU.",
                    "GPU technology applied to reverse time migration and seismic modeling via OpenACC.",
                    "Parallelizing a discrete event simulation application using the Habanero-Java multicore library.",
                    "RaftLib: a C++ template library for high performance stream parallel processing.",
                    "A Java util concurrent park contention tool.",
                    "Debugging parallel programs using fork handlers.",
                    "Effective communication for a system of cluster-on-a-chip processors.",
                    "Exploiting communication concurrency on high performance computing systems.",
                    "CRA: a dynamic task allocation algorithm for many-core processor.",
                    "Patty: a pattern-based parallelization tool for the multicore age.",
                    "Deadlock-free buffer configuration for stream computing.",
                    "Supporting multiple accelerators in high-level programming models."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2015gpgpu",
                "sub_name": "Proceedings of the 8th Workshop on General Purpose Processing using GPUs, GPGPU@PPoPP 2015, San Francisco, CA, USA, February 7, 2015.",
                "count": 11,
                "papers": [
                    "A comparative investigation of device-specific mechanisms for exploiting HPC accelerators.",
                    "GPU-SM: shared memory multi-GPU programming.",
                    "Adaptive GPU cache bypassing.",
                    "Efficient utilization of GPGPU cache hierarchy.",
                    "Effects of source-code optimizations on GPU performance and energy consumption.",
                    "Optimization for performance and energy for batched matrix computations on GPUs.",
                    "Helium: a transparent inter-kernel optimizer for OpenCL.",
                    "Stochastic gradient descent on GPUs.",
                    "High performance computing of fiber scattering simulation.",
                    "Rethinking the parallelization of random-restart hill climbing: a case study in optimizing a 2-opt TSP solver for GPU execution.",
                    "Forma: a DSL for image processing applications to target GPUs and multi-core CPUs."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19th PPOPP 2014",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2014",
                "sub_name": "ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP '14, Orlando, FL, USA, February 15-19, 2014.",
                "count": 46,
                "papers": [
                    "21st century computer architecture.",
                    "PREDATOR: predictive false sharing detection.",
                    "Concurrency testing using schedule bounding: an empirical study.",
                    "Trace driven dynamic deadlock detection and reproduction.",
                    "Efficient search for inputs causing high floating-point errors.",
                    "X10 and APGAS at Petascale.",
                    "Resilient X10: efficient failure-aware programming.",
                    "Portable, MPI-interoperable coarray fortran.",
                    "CUDA-NP: realizing nested thread-level parallelism in GPGPU applications.",
                    "yaSpMV: yet another SpMV framework on GPUs.",
                    "Singe: leveraging warp specialization for high performance on GPUs.",
                    "Eliminating global interpreter locks in ruby through hardware transactional memory.",
                    "Leveraging hardware message passing for efficient thread synchronization.",
                    "Well-structured futures and cache locality.",
                    "Time-warp: lightweight abort minimization in transactional memory.",
                    "Beyond parallel programming with domain specific languages.",
                    "Designing and auto-tuning parallel 3-D FFT for computation-communication overlap.",
                    "A decomposition for in-place matrix transposition.",
                    "In-place transposition of rectangular matrices on accelerators.",
                    "Parallelizing dynamic programming through rank convergence.",
                    "Revisiting loop fusion in the polyhedral framework.",
                    "Triolet: a programming system that unifies algorithmic skeleton interfaces for high-performance cluster computing.",
                    "A tool to analyze the performance of multithreaded programs on NUMA architectures.",
                    "Towards fair and efficient SMP virtual machine scheduling.",
                    "Efficient deterministic multithreading without global barriers.",
                    "Race directed scheduling of concurrent programs.",
                    "Heterogeneous computing: what does it mean for compiler research?",
                    "Fast concurrent lock-free binary search trees.",
                    "A general technique for non-blocking trees.",
                    "Practical concurrent binary search trees via logical ordering.",
                    "A practical wait-free simulation for lock-free data structures.",
                    "Lock contention aware thread migrations.",
                    "Infrastructure-free logging and replay of concurrent execution on multiple cores.",
                    "Parallelization hints via code skeletonization.",
                    "Concurrency bug localization using shared memory access pairs.",
                    "Task mapping stencil computations for non-contiguous allocations.",
                    "Data structures for task-based priority scheduling.",
                    "Detecting silent data corruption through data dynamic monitoring for scientific applications.",
                    "Fine-grain parallel megabase sequence comparison with multiple heterogeneous GPUs.",
                    "Automatic semantic locking.",
                    "Optimistic transactional boosting.",
                    "Provably good scheduling for parallel programs that use data structures through implicit batching.",
                    "Theoretical analysis of classic algorithms on highly-threaded many-core GPUs.",
                    "SCCMulti: an improved parallel strongly connected components algorithm.",
                    "Initial study of multi-endpoint runtime for MPI+OpenMP hybrid programming model on multi-core systems.",
                    "Extracting logical structure and identifying stragglers in parallel execution traces."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2014pmam",
                "sub_name": "Proceedings of the 2014 PPOPP International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM 2014, Orlando, Florida, USA, February 15, 2014.",
                "count": 15,
                "papers": [
                    "Autotuning Wavefront Applications for Multicore Multi-GPU Hybrid Architectures.",
                    "Reduction Operations in Parallel Loops for GPGPUs.",
                    "Self-Configuration and Self-Optimization Autonomic Skeletons using Events.",
                    "Programming a Multicore Architecture without Coherency and Atomic Operations.",
                    "Vectorizing Unstructured Mesh Computations for Many-core Architectures.",
                    "Compiling Fresh Breeze Codelets.",
                    "A Framework for Multiplatform HPC Applications.",
                    "A Novel CPU-GPU Cooperative Implementation of A Parallel Two-List Algorithm for the Subset-Sum Problem.",
                    "Dynamic Partitioning-based JPEG Decompression on Heterogeneous Multicore Architectures.",
                    "Fast Longest Common Subsequence with General Integer Scoring Support on GPUs.",
                    "Efficient Parallel Implementations of Multiple Sequence Alignment using BSP/CGM Model.",
                    "Work Stealing Strategies For Multi-Core Parallel Branch-and-Bound Algorithm Using Factorial Number System.",
                    "Palirria: Accurate On-line Parallelism Estimation for Adaptive Work-Stealing.",
                    "DWS: Demand-aware Work-Stealing in Multi-programmed Multi-core Architectures.",
                    "Reachability Analysis of Cost-Reward Timed Automata for Energy Efficiency Scheduling."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2014ppaa",
                "sub_name": "Proceedings of the first workshop on Parallel programming for analytics applications, PPAA 2014, Orlando, Florida, USA, February 16, 2014.",
                "count": 10,
                "papers": [
                    "Future directions in analytic applications.",
                    "Load balanced clustering coefficients.",
                    "A performance evaluation of open source graph databases.",
                    "Graphs & networks: computing and analytics at lincoln laboratory.",
                    "Maximal clique enumeration for large graphs on hadoop framework.",
                    "GLB: lifeline-based global load balancing library in x10.",
                    "High-speed graph analytics with the galois system.",
                    "Rigorous specification and low-latency implementation of technical market indicators.",
                    "Active workflow system for near real-time extreme-scale science.",
                    "Cognitive computing journey."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2014wpmvp",
                "sub_name": "Proceedings of the 2014 Workshop on Programming models for SIMD/Vector processing, WPMVP 2014, Orlando, Florida, USA, February 16, 2014.",
                "count": 11,
                "papers": [
                    "Boost.SIMD: generic programming for portable SIMDization.",
                    "Simple, portable and fast SIMD intrinsic programming: generic simd library.",
                    "Sierra: a SIMD extension for C++.",
                    "Writing scalable SIMD programs with ISPC.",
                    "OpenCL framework for ARM processors with NEON support.",
                    "Vector seeker: a tool for finding vector potential.",
                    "High level transforms for SIMD and low-level computer vision algorithms.",
                    "Comparing the performance of different x86 SIMD instruction sets for a medical imaging application on modern multi- and manycore chips.",
                    "SIMDizing pairwise sums: a summation algorithm balancing accuracy with throughput.",
                    "A SIMD programming model for dart, javascript, and other dynamically typed scripting languages.",
                    "Exploring the vectorization of python constructs using pythran and boost SIMD."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18th PPOPP 2013",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2013",
                "sub_name": "ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPoPP '13, Shenzhen, China, February 23-27, 2013.",
                "count": 45,
                "papers": [
                    "A peta-scalable CPU-GPU algorithm for global atmospheric simulations.",
                    "Adoption protocols for fanout-optimal fault-tolerant termination detection.",
                    "Array dataflow analysis for polyhedral X10 programs.",
                    "Betweenness centrality: algorithms and implementations.",
                    "Compiler aided manual speculation for high performance concurrent data structures.",
                    "Complexity analysis and algorithm design for reorganizing data to minimize non-coalesced memory accesses on GPU.",
                    "Correct and efficient work-stealing for weak memory models.",
                    "Data-only flattening for nested data parallelism.",
                    "Distributed merge trees.",
                    "Fast concurrent queues for x86 processors.",
                    "FastLane: improving performance of software transactional memory for low thread counts.",
                    "From relational verification to SIMD loop synthesis.",
                    "Ligra: a lightweight graph processing framework for shared memory.",
                    "Morph algorithms on GPUs.",
                    "NUMA-aware reader-writer locks.",
                    "Online-ABFT: an online algorithm based fault tolerance scheme for soft error detection in iterative methods.",
                    "Ownership passing: efficient distributed memory programming on multi-core systems.",
                    "Parallel schedule synthesis for attribute grammars.",
                    "Parallel suffix array and least common prefix for the GPU.",
                    "Scalable deterministic replay in a parallel full-system emulator.",
                    "Scheduling parallel programs by work stealing with private deques.",
                    "StreamScan: fast scan algorithms for GPUs without global barrier synchronization.",
                    "The tasks with effects model for safe concurrency.",
                    "TigerQuoll: parallel event-based JavaScript.",
                    "Using hardware transactional memory to correct and simplify and readers-writer lock algorithm.",
                    "ZOOMM: a parallel web browser engine for multicore mobile devices.",
                    "Automatic problem size sensitive task partitioning on heterogeneous parallel systems.",
                    "Data layout optimization for GPGPU architectures.",
                    "Decomposition techniques for optimal design-space exploration of streaming applications.",
                    "Exploring different automata representations for efficient regular expression matching on GPUs.",
                    "Expressing graph algorithms using generalized active messages.",
                    "Multi-level parallel computing of reverse time migration for seismic imaging on blue Gene/Q.",
                    "Parallel programming with big operators.",
                    "Programming with hardware lock elision.",
                    "RaceFree: an efficient multi-threading model for determinism.",
                    "Reducing contention through priority updates.",
                    "Relational algorithms for multi-bulk-synchronous processors.",
                    "Runtime elision of transactional barriers for captured memory.",
                    "Scalable data race detection for partitioned global address space programs.",
                    "Scalable statistics counters.",
                    "Swift/T: scalable data flow programming for many-task applications.",
                    "TeamWork: synchronizing threads globally to detect real deadlocks for multithreaded programs.",
                    "Towards an energy estimator for fault tolerance protocols.",
                    "Work-stealing with configurable scheduling strategies.",
                    "WuKong: effective diagnosis of bugs at large system scales."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2013pmam",
                "sub_name": "Proceedings of the 2013 PPOPP International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM 2013, Shenzhen, China, February 23, 2013.",
                "count": 14,
                "papers": [
                    "A compiler infrastructure for embedded heterogeneous MPSoCs.",
                    "X10-FT: transparent fault tolerance for APGAS language and runtime.",
                    "Bulk synchronous visualization.",
                    "The JStar language philosophy.",
                    "Pyjama: OpenMP-like implementation for Java, with GUI extensions.",
                    "A pattern-supported parallelization approach.",
                    "Parallel time-space processing model based fast N-body simulation on GPUs.",
                    "A generate-test-aggregate parallel programming library: systematic parallel programming for MapReduce.",
                    "libEOMP: a portable OpenMP runtime library based on MCA APIs for embedded systems.",
                    "Low power cache architectures with hybrid approach of filtering unnecessary way accesses.",
                    "Empirical measurement of instruction level parallelism for four generations of ARM CPUs.",
                    "CAP: co-scheduling based on asymptotic profiling in CPU+GPU hybrid systems.",
                    "Scheduling directives for shared-memory many-core processor systems.",
                    "Auto-tuning methodology to represent landform attributes on multicore and multi-GPU systems."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17th PPOPP 2012",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2012",
                "sub_name": "Proceedings of the 17th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2012, New Orleans, LA, USA, February 25-29, 2012.",
                "count": 57,
                "papers": [
                    "Scalable framework for mapping streaming applications onto multi-GPU systems.",
                    "A performance analysis framework for identifying potential benefits in GPGPU applications.",
                    "Efficient performance evaluation of memory hierarchy for highly multithreaded graphics processors.",
                    "Communication avoiding successive band reduction.",
                    "Faster topology-aware collective algorithms through non-minimal communication.",
                    "Efficient SIMD code generation for irregular kernels.",
                    "Extending a C-like language for portable SIMD programming.",
                    "A hybrid approach of OpenMP for clusters.",
                    "DOJ: dynamically parallelizing object-oriented programs.",
                    "S: a scripting language for high-performance RESTful web services.",
                    "A GPU implementation of inclusion-based points-to analysis.",
                    "Scalable GPU graph traversal.",
                    "GPU-based NFA implementation for memory efficient high speed regular expression matching.",
                    "A methodology for creating fast wait-free data structures.",
                    "Concurrent tries with efficient non-blocking snapshots.",
                    "A speculation-friendly binary search tree.",
                    "PARRAY: a unifying array representation for heterogeneous parallelism.",
                    "Internally deterministic parallel algorithms can be fast.",
                    "Deterministic parallel random-number generation for dynamic-multithreading platforms.",
                    "Scalable parallel minimum spanning forest computation.",
                    "GKLEE: concolic verification and test generation for GPUs.",
                    "Algorithm-based fault tolerance for dense matrix factorizations.",
                    "Efficient deadlock avoidance for streaming computation with filtering.",
                    "Lock cohorting: a general technique for designing NUMA locks.",
                    "Revisiting the combining synchronization technique.",
                    "A work-stealing scheduler for X10's task parallelism with suspension.",
                    "Automatic communication optimizations through memory reuse strategies.",
                    "FlexBFS: a parallelism-aware implementation of breadth-first search on GPU.",
                    "Programming parallel embedded and consumer applications in OpenMP superscalar.",
                    "An overview of Medusa: simplified graph processing on GPUs.",
                    "Optimizing remote accesses for offloaded kernels: application to high-level synthesis for FPGA.",
                    "Using GPU's to accelerate stencil-based computation kernels for the development of large scale scientific applications on heterogeneous systems.",
                    "Mechanizing the expert dense linear algebra developer.",
                    "The boat hull model: adapting the roofline model to enable performance prediction for parallel computing.",
                    "Speculative parallelization on GPGPUs.",
                    "Adapting the polyhedral model as a framework for efficient speculative parallelization.",
                    "An overview of CMPI: network performance aware MPI in the cloud.",
                    "OpenCL as a unified programming model for heterogeneous CPU/GPU clusters.",
                    "BDDT: : block-level dynamic dependence analysis for deterministic task-based parallelism.",
                    "Portable parallel performance from sequential, productive, embedded domain-specific languages.",
                    "Communication-centric optimizations by dynamically detecting collective operations.",
                    "LHlf: lock-free linear hashing (poster paper).",
                    "Wait-free linked-lists.",
                    "Scalable parallel debugging with statistical assertions.",
                    "Verification of software barriers.",
                    "Collective algorithms for sub-communicators.",
                    "Synchronization views for event-loop actors.",
                    "CPHASH: a cache-partitioned hash table.",
                    "RACECAR: a heuristic for automatic function specialization on multi-core heterogeneous systems.",
                    "A lock-free, array-based priority queue.",
                    "An infrastructure for dynamic optimization of parallel programs.",
                    "Automatic datatype generation and optimization.",
                    "NDetermin: inferring nondeterministic sequential specifications for parallelism correctness.",
                    "Concurrent breakpoints.",
                    "Establishing a Miniapp as a programmability proxy.",
                    "OpenMP-style parallelism in data-centered multicore computing with R.",
                    "Performance analysis of parallel constraint-based local search."
                ]
            },
            {
                "sub_name_abbr": "conf/ppopp/2012pmam",
                "sub_name": "Proceedings of the 2012 PPOPP International Workshop on Programming Models and Applications for Multicores and Manycores, PMAM 2012, New Orleans, LA, USA, February 26, 2012.",
                "count": 19,
                "papers": [
                    "Kokkos Array performance-portable manycore programming model.",
                    "AGC: adaptive global clock in software transactional memory.",
                    "GHOST: GPGPU-offloaded high performance storage I/O deduplication for primary storage system.",
                    "Efficient execution of time-step computations with pipelined parallelism and inter-thread data locality optimizaitions.",
                    "PMA: Pixel-based multi-anchor algorithm for image recognition on multi-core systems.",
                    "Revisiting shared virtual memory systems for non-coherent memory-coupled cores.",
                    "An hybrid model for very high level threads.",
                    "Exploring parallelism in volume ray casting: understanding the programming issues of multithreaded accelerators.",
                    "Function flow: making synchronization easier in task parallelism.",
                    "Efficient memory management of a hierarchical and a hybrid main memory for MN-MATE platform.",
                    "New strategy for coarse grid solvers in parallel multigrid methods using OpenMP/MPI hybrid programming models.",
                    "Better speedups using simpler parallel programming for graph connectivity and biconnectivity.",
                    "Massively parallel breadth first search using a tree-structured memory model.",
                    "Shared work list: hacking amorphous data parallelism in UPC.",
                    "A case for secure and scalable hypervisor using safe language.",
                    "Techniques for the parallelization of unstructured grid applications on multi-GPU systems.",
                    "Semi-sparse algorithm based on multi-layer optimization for recommendation system.",
                    "Chestnut: a GPU programming language for non-experts.",
                    "Networks beat pipelines: the design of FG 2.0."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16th PPOPP 2011",
        "info": "San Antonio, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2011",
                "sub_name": "Proceedings of the 16th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2011, San Antonio, TX, USA, February 12-16, 2011.",
                "count": 41,
                "papers": [
                    "Programming the cloud.",
                    "Ordered vs. unordered: a comparison of parallelism and work-efficiency in irregular algorithms.",
                    "Programming the memory hierarchy revisited: supporting irregular parallelism in sequoia.",
                    "Compact data structure and scalable algorithms for the sparse grid technique.",
                    "A domain-specific approach to heterogeneous parallelism.",
                    "Copperhead: compiling an embedded data parallel language.",
                    "OoOJava: software out-of-order execution.",
                    "SpiceC: scalable parallelism via implicit copying and explicit commit.",
                    "Inferring ownership transfer for efficient message passing.",
                    "All-window profiling and composable models of cache sharing.",
                    "ULCC: a user-level facility for optimizing shared cache performance on multicores.",
                    "ScalaExtrap: trace-based communication extrapolation for spmd programs.",
                    "How's the parallel computing revolution going?",
                    "Thread contracts for safe parallelism.",
                    "GRace: a low-overhead mechanism for detecting data races in GPU programs.",
                    "Cooperative reasoning for preemptive execution.",
                    "Communicating memory transactions.",
                    "Transaction communicators: enabling cooperation among concurrent transactions.",
                    "Lock-free and scalable multi-version software transactional memory.",
                    "Enhanced speculative parallelization via incremental recovery.",
                    "Lifeline-based global load balancing.",
                    "COREMU: a scalable and portable parallel full-system emulator.",
                    "Wait-free queues with multiple enqueuers and dequeuers.",
                    "The STAPL parallel container framework.",
                    "CSX: an extended compression format for spmv on shared memory systems.",
                    "Auto-tuning of fast fourier transform on graphics processors.",
                    "Accelerating CUDA graph algorithms at maximum warp.",
                    "Achieving a single compute device image in OpenCL for multiple GPUs.",
                    "QoS aware storage cache management in multi-server environments.",
                    "Weak atomicity under the x86 memory consistency model.",
                    "Kremlin: like gprof, but for parallelization.",
                    "Time skewing made simple.",
                    "Evaluating graph coloring on GPUs.",
                    "Two examples of parallel programming without concurrency constructs (PP-CC).",
                    "A wait-free NCAS library for parallel applications with timing constraints.",
                    "Algorithm-based recovery for HPL.",
                    "Active pebbles: a programming model for highly parallel fine-grained data-driven computations.",
                    "Symbolically modeling concurrent MCAPI executions.",
                    "Automatic formal verification of MPI-based parallel programs.",
                    "SCRATCH: a tool for automatic analysis of dma races.",
                    "Automatic safety proofs for asynchronous memory operations."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15th PPOPP 2010",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2010",
                "sub_name": "Proceedings of the 15th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2010, Bangalore, India, January 9-14, 2010.",
                "count": 49,
                "papers": [
                    "Exascale computing: the challenges and opportunities in the next decade.",
                    "Structure-driven optimizations for amorphous data-parallel programs.",
                    "GAMBIT: effective unit testing for concurrency libraries.",
                    "Featherweight X10: a core calculus for async-finish parallelism.",
                    "Compiler aided selective lock assignment for improving the performance of software transactional memory.",
                    "Is transactional programming actually easier?",
                    "Debugging programs that use atomic blocks and transactional memory.",
                    "NOrec: streamlining STM by abolishing ownership records.",
                    "Scheduling support for transactional memory contention management.",
                    "Leveraging parallel nesting in transactional memory.",
                    "Extreme scale computing: challenges and opportunities.",
                    "Is hardware innovation over?",
                    "An adaptive performance modeling tool for GPU architectures.",
                    "Model-driven autotuning of sparse matrix-vector multiply on GPUs.",
                    "Fast tridiagonal solvers on the GPU.",
                    "CUDAlign: using GPU to accelerate the comparison of megabase genomic sequences.",
                    "Load balancing on speed.",
                    "Scalable communication protocols for dynamic sparse data exchange.",
                    "The LOFAR correlator: implementation and performance analysis.",
                    "Lazy binary-splitting: a run-time adaptive work-stealing scheduler.",
                    "Thread to strand binding of parallel network applications in massive multi-threaded systems.",
                    "Does cache sharing on modern CMP matter to the performance of contemporary multithreaded programs?",
                    "Improving parallelism and locality with asynchronous algorithms.",
                    "Scaling LAPACK panel operations using parallel cache assignment.",
                    "Composable thread coloring.",
                    "Helper locks for fork-join parallel programming.",
                    "A practical concurrent binary search tree.",
                    "Analyzing lock contention in multithreaded applications.",
                    "Using data structure knowledge for efficient lock generation and strong atomicity.",
                    "Modeling advanced collective communication algorithms on cell-based systems.",
                    "PHANTOM: predicting performance of parallel applications on large-scale parallel machines using a single node.",
                    "Input-driven dynamic execution prediction of streaming applications.",
                    "Towards scalable and transparent parallelization of multiplayer games using transactional memory support.",
                    "KRASH: reproducible CPU load generation on many cores machines.",
                    "Intra-application shared cache partitioning for multithreaded applications.",
                    "Symbolic prefetching in transactional distributed shared memory.",
                    "New abstractions for effective performance analysis of STM programs.",
                    "Continuous speculative program parallelization in software.",
                    "Effective communication and computation overlap with hybrid MPI/SMPSs.",
                    "Supporting lock-free composition of concurrent data objects.",
                    "SLAW: a scalable locality-aware adaptive work-stealing scheduler for multi-core systems.",
                    "An optimizing compiler for GPGPU programs with input-data sharing.",
                    "Applying the concurrent collections programming model to asynchronous parallel dense linear algebra.",
                    "Application heartbeats for software performance and health.",
                    "Modeling transactional memory workload performance.",
                    "The pilot library for novice MPI programmers.",
                    "Data transformations enabling loop vectorization on multithreaded data parallel architectures.",
                    "A distributed placement service for graph-structured and tree-structured data.",
                    "A symbolic verifier for CUDA programs."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th PPOPP 2009",
        "info": "Raleigh, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2009",
                "sub_name": "Proceedings of the 14th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2009, Raleigh, NC, USA, February 14-18, 2009.",
                "count": 43,
                "papers": [
                    "Parallel thinking.",
                    "How much parallelism is there in irregular applications?",
                    "An efficient transactional memory algorithm for computing minimum spanning forest of sparse graphs.",
                    "Atomic quake: using transactional memory in an interactive multiplayer game server.",
                    "Application-aware management of parallel simulation collections.",
                    "Idempotent work stealing.",
                    "Backtracking-based load balancing.",
                    "Efficient and scalable multiprocessor fair scheduling using distributed weighted round-robin.",
                    "Mapping parallelism to multi-cores: a machine learning based approach.",
                    "Serialization sets: a dynamic dependence-based parallel execution model.",
                    "Opportunities beyond single-core microprocessors.",
                    "Multi-core demands multi-interfaces.",
                    "OpenMP to GPGPU: a compiler framework for automatic translation and optimization.",
                    "Comparability graph coloring for optimizing utilization of stream register files in stream processors.",
                    "Solving dense linear systems on platforms with multiple hardware accelerators.",
                    "A comparison of programming models for multiprocessors with explicitly managed memory hierarchies.",
                    "A comprehensive strategy for contention management in software transactional memory.",
                    "Safe open-nested transactions through ownership.",
                    "Committing conflicting transactions in an STM.",
                    "Detecting and tolerating asymmetric races.",
                    "Transactional memory with strong atomicity using off-the-shelf memory protection hardware.",
                    "Industrial perspectives panel.",
                    "Techniques for efficient placement of synchronization primitives.",
                    "A compiler-directed data prefetching scheme for chip multiprocessors.",
                    "Compiler-assisted dynamic scheduling for effective parallelization of loop nests on multicore processors.",
                    "Effective performance measurement and analysis of multithreaded applications.",
                    "Petascale computing with accelerators.",
                    "MPIWiz: subgroup reproducible replay of mpi applications.",
                    "Formal verification of practical MPI programs.",
                    "Efficient, portable implementation of asynchronous multi-place programs.",
                    "How to build programmable multi-core chips.",
                    "Architectural support for cilk computations on many-core architectures.",
                    "A compiler and runtime system for enabling data mining applications on gpus.",
                    "Exploiting global optimizations for openmp programs in the openuh compiler.",
                    "NePalTM: design and implementation of nested parallelism for transactional memory systems.",
                    "Parallelization spectroscopy: analysis of thread-level parallelism in hpc programs.",
                    "Preliminary results on nb-feb, a synchronization primitive for parallel programming.",
                    "Software transactional distributed shared memory.",
                    "Stack-based parallel recursion on graphics processors.",
                    "Topology aware task mapping techniques: an api and case study.",
                    "Towards concurrency refactoring for x10.",
                    "A tunable holistic resiliency approach for high-performance computing systems.",
                    "Turbocharging boosted transactions or: how i learnt to stop worrying and love longer transactions."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th PPOPP 2008",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2008",
                "sub_name": "Proceedings of the 13th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2008, Salt Lake City, UT, USA, February 20-23, 2008.",
                "count": 44,
                "papers": [
                    "Compilers and parallel computing systems.",
                    "Automatic data movement and computation mapping for multi-level parallel architectures with explicitly managed memories.",
                    "Type inference for locality analysis of distributed data structures.",
                    "Quasi-static scheduling for safe futures.",
                    "Scalable packet classification using interpreting: a cross-platform multi-core solution.",
                    "FastForward for efficient pipeline parallelism: a cache-optimized concurrent lock-free queue.",
                    "Matrix product on heterogeneous master-worker platforms.",
                    "High performance dense linear algebra on a spatially distributed processor.",
                    "Optimization principles and application performance evaluation of a multithreaded GPU using CUDA.",
                    "Massive parallel LDPC decoding on GPU.",
                    "A case study in SIMD text processing with parallel bit streams: UTF-8 to UTF-16 transcoding.",
                    "Performance without pain = productivity: data layout and collective communication in UPC.",
                    "Programming with tiles.",
                    "SuperMatrix: a multithreaded runtime scheduling system for algorithms-by-blocks.",
                    "Design and implementation of a high-performance MPI for C# and the common language infrastructure.",
                    "A portable runtime interface for multi-level memory hierarchies.",
                    "ZOID: I/O-forwarding infrastructure for petascale architectures.",
                    "Nested parallelism in transactional memory.",
                    "On the correctness of transactional memory.",
                    "Modeling optimistic concurrency using quantitative dependence analysis.",
                    "Split hardware transactions: true nesting of transactions using best-effort hardware transactional memory.",
                    "Transactional boosting: a methodology for highly-concurrent transactional objects.",
                    "Concurrent GC leveraging transactional memory.",
                    "Toward high performance nonblocking software transactional memory.",
                    "Dynamic performance tuning of word-based software transactional memory.",
                    "Software transactional memory for large scale clusters.",
                    "Where will all the threads come from?",
                    "Experiences using adaptive concurrency in transactional memory with Lee's routing algorithm.",
                    "An adaptive memory conscious approach for mining frequent trees: implications for multi-core architectures.",
                    "All-window profiling of concurrent executions.",
                    "Assertional reasoning about data races in relaxed memory models.",
                    "Cache-aware iteration space partitioning.",
                    "Compiler optimizations for parallelizing general-purpose applications under thread-level speculation.",
                    "Automated application-level checkpointing based on live-variable analysis in MPI programs.",
                    "Compiler-enhanced incremental checkpointing for OpenMP applications.",
                    "Enhancing the performance of MPI-IO applications by overlapping I/O, computation and communication.",
                    "Experience on optimizing irregular computation for memory hierarchy in manycore architecture.",
                    "Extracting coarse-grain parallelism in general-purpose programs.",
                    "Formal specification of the MPI-2.0 standard in TLA+.",
                    "ISP: a tool for model checking MPI programs.",
                    "Practical experiences with Java software transactional memory.",
                    "Probabilistic advanced reservations for batch-scheduled parallel machines.",
                    "Safer open-nested transactions through ownership.",
                    "Semantics-based distributed I/O for mpiBLAST."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th PPOPP 2007",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2007",
                "sub_name": "Proceedings of the 12th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2007, San Jose, California, USA, March 14-17, 2007.",
                "count": 43,
                "papers": [
                    "Parallel programming environment: a key to translating tera-scale platforms into a big success.",
                    "Toward terabyte pattern mining: an architecture-conscious solution.",
                    "Expressing and exploiting concurrency in networked applications with aspen.",
                    "Disens: scalable distributed sensor network simulation.",
                    "Optimizing communication overlap for high-speed networks.",
                    "On using connection-oriented vs. connection-less transport for performance and scalability of collective and one-sided operations: trade-offs and impact.",
                    "Potential show-stoppers for transactional synchronization.",
                    "Transactional collection classes.",
                    "Open nesting in software transactional memory.",
                    "Implicit parallelism with ordered transactions.",
                    "Dynamic multigrain parallelization on the cell broadband engine.",
                    "Automatic mapping of nested loops to FPGAS.",
                    "Adaptive work stealing with parallelism feedback.",
                    "Self-adaptive applications on the grid.",
                    "Latency hiding through multithreading on a network processor.",
                    "Alert-on-update: a communication aid for shared memory multiprocessors.",
                    "Featherweight transactions: decoupling threads and atomic blocks.",
                    "Efficient nonblocking software transactional memory.",
                    "Conservative vs. optimistic parallelization of stateful network intrusion detection.",
                    "Adaptive structured parallelism for computational grids.",
                    "Fault detection in multi-threaded c++ server applications.",
                    "MCSTL: the multi-core standard template library.",
                    "Optimized lock assignment and allocation: a method for exploiting concurrency among critical sections.",
                    "Performance evaluation of the cray XT3 configured with dual core opteron processors.",
                    "Locality-aware connection management and rank assignment for wide-area MPI.",
                    "Speculations: providing fault-tolerance and improving performance of parallel applications.",
                    "Promised messages: recovering from inconsistent global states.",
                    "Supporting fault-tolerance in streaming grid applications.",
                    "A study of tracing overhead on a high-performance linux cluster.",
                    "Pervasive parallel computing: an historic opportunity for innovation in programming and architecture.",
                    "A theory of memory models.",
                    "Reordering constraints for pthread-style locks.",
                    "May-happen-in-parallel analysis of X10 programs.",
                    "Barrier matching for programs with textually unaligned barriers.",
                    "Speculative thread decomposition through empirical optimization.",
                    "Tight analysis of the performance potential of thread speculation using spec CPU 2006.",
                    "Compilation for explicitly managed memory hierarchies.",
                    "The Z-polyhedral model.",
                    "Methods of inference and learning for performance modeling of parallel applications.",
                    "Using fine grain multithreading for energy efficient computing.",
                    "Programming with cluster openMP.",
                    "X10: concurrent programming for modern architectures.",
                    "Transactional programming in a multi-core environment."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th PPOPP 2006",
        "info": "New York, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2006",
                "sub_name": "Proceedings of the ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2006, New York, New York, USA, March 29-31, 2006.",
                "count": 27,
                "papers": [
                    "Parallel programming and code selection in fortress.",
                    "Collective communication on architectures that support simultaneous communication over multiple links.",
                    "Performance evaluation of adaptive MPI.",
                    "Mobile MPI programs in computational grids.",
                    "RDMA read based rendezvous protocol for MPI over InfiniBand: design alternatives and benefits.",
                    "Global-view abstractions for user-defined reductions and scans.",
                    "Programming for parallelism and locality with hierarchically tiled arrays.",
                    "Parallel programming in modern web search engines.",
                    "Performance characterization of molecular dynamics techniques for biomolecular simulations.",
                    "On-line automated performance diagnosis on thousands of processes.",
                    "A case study in top-down performance estimation for a large-scale parallel application.",
                    "Hardware profile-guided automatic page placement for ccNUMA systems.",
                    "Adaptive scheduling with parallelism feedback.",
                    "Predicting bounds on queuing delay for batch-scheduled parallel machines.",
                    "Optimizing irregular shared-memory applications for distributed-memory systems.",
                    "Proving correctness of highly-concurrent linearisable objects.",
                    "Accurate and efficient runtime detection of atomicity errors in concurrent programs.",
                    "Scalable synchronous queues.",
                    "POSH: a TLS compiler that exploits program structure.",
                    "High-performance IPv6 forwarding algorithm for multi-core and multithreaded network processor.",
                    "\"MAMA!\": a memory allocator for multithreaded architectures.",
                    "McRT-STM: a high performance software transactional memory system for a multi-core runtime.",
                    "Exploiting distributed version concurrency in a transactional memory cluster.",
                    "Hybrid transactional memory.",
                    "Fast and transparent recovery for continuous availability of cluster-based servers.",
                    "Minimizing execution time in MPI programs on an energy-constrained, power-scalable cluster.",
                    "Teaching parallel computing to science faculty: best practices and common pitfalls."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th PPOPP 2005",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2005",
                "sub_name": "Proceedings of the ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2005, June 15-17, 2005, Chicago, IL, USA.",
                "count": 29,
                "papers": [
                    "Why is graphics hardware so fast?",
                    "Compiler techniques for high performance sequentially consistent java programs.",
                    "Effective communication coalescing for data-parallel applications.",
                    "A linear-time algorithm for optimal barrier placement.",
                    "An evaluation of global address space languages: co-array fortran and unified parallel C.",
                    "Composable memory transactions.",
                    "Static analysis of atomicity for programs with non-blocking synchronization.",
                    "Revocable locks for non-blocking programming.",
                    "Automated type-based analysis of data races and atomicity.",
                    "Modeling wildcard-free MPI programs for verification.",
                    "Scaling model checking of dataraces using dynamic information.",
                    "Language innovations for HPCS.",
                    "A novel approach for partitioning iteration spaces with variable densities.",
                    "Automatic multithreading and multiprocessing of C programs for IXP.",
                    "Exposing speculative thread parallelism in SPEC2000.",
                    "Extracting SMP parallelism for dense linear algebra algorithms from high-level specifications.",
                    "Using multiple energy gears in MPI programs on a power-scalable cluster.",
                    "Exposing disk layout to compiler for reducing energy consumption of parallel disk based systems.",
                    "Energy conservation in heterogeneous server clusters.",
                    "Trust but verify: monitoring remotely executing programs for progress and correctness.",
                    "Applications of synchronization coverage.",
                    "Fault tolerant high performance computing by a coding approach.",
                    "Teleport messaging for distributed stream programs.",
                    "Adaptive execution techniques for SMT multiprocessor architectures.",
                    "System-wide performance monitors and their application to the optimization of coherent memory accesses.",
                    "A sampling-based framework for parallel data mining.",
                    "Performance modeling and optimization of parallel out-of-core tensor contractions.",
                    "A framework for adaptive algorithm selection in STAPL.",
                    "Locality aware dynamic load management for massively multiplayer games."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th PPOPP 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2003",
                "sub_name": "Proceedings of the ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, PPOPP 2003, June 11-13, 2003, San Diego, CA, USA.",
                "count": 26,
                "papers": [
                    "Using thread-level speculation to simplify manual parallelization.",
                    "Toward efficient and robust software speculative parallelization on multiprocessors.",
                    "Compiler support for speculative multithreading architecture with probabilistic points-to analysis.",
                    "Improving server software support for simultaneous multithreaded processors.",
                    "Programming the FlexRAM parallel intelligent memory system.",
                    "Exploiting task-level concurrency in a programmable network interface.",
                    "User-controllable coherence for high performance shared memory multiprocessors.",
                    "High performance spatial data mining for very large data-sets.",
                    "A component architecture for LAM/MPI.",
                    "CC-MPI: a compiled communication capable MPI prototype for ethernet switched clusters.",
                    "Automated application-level checkpointing of MPI programs.",
                    "CC-MPI: a compiled communication capable MPI prototype for ethernet switched clusters.",
                    "Impala: a middleware system for managing autonomic, parallel sensor systems.",
                    "Optimizing data aggregation for cluster-based internet services.",
                    "Exploiting high-level coherence information to optimize distributed shared state.",
                    "Adapting convergent scheduling using machine learning.",
                    "An emerging co-array fortran compiler.",
                    "SCOOP It up!",
                    "Factorization with morton-ordered quadtree matrices for memory re-use and parallelism.",
                    "The design and implementation of a parallel array operator for the arbitrary remapping of data.",
                    "Hybrid dynamic data race detection.",
                    "Efficient on-the-fly data race detection in multihreaded C++ programs.",
                    "Compactly representing parallel program executions.",
                    "Using generative design patterns to generate parallel code for a distributed memory environment.",
                    "Phoenix: a parallel programming model for accommodating dynamically joining/leaving resources.",
                    "ARMI: an adaptive, platform independent communication library."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th PPOPP 2001",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/2001",
                "sub_name": "Proceedings of the 2001 ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPOPP'01), Snowbird, Utah, USA, June 18-20, 2001.",
                "count": 17,
                "papers": [
                    "Parallel computing in 2010: opportunities and challenges in a networked world (abstract).",
                    "Reference idempotency analysis: a framework for optimizing speculative execution.",
                    "Pointer and escape analysis for multithreaded programs.",
                    "Language support for Morton-order matrices.",
                    "Efficient load balancing for wide-area divide-and-conquer applications.",
                    "Scalable queue-based spin locks with timeout.",
                    "Contention elimination by replication of sequential sections in distributed shared memory programs.",
                    "Accurate data redistribution cost estimation in software distributed shared memory systems.",
                    "Dynamic adaptation to available resources for parallel computing in an autonomous network of workstations.",
                    "Parallel programming challenges for Internet-scale computing (entropia).",
                    "Source-level global optimizations for fine-grain distributed shared memory systems.",
                    "High-level adaptive program optimization with ADAPT.",
                    "Blocking and array contraction across arbitrarily nested loops using affine partitioning.",
                    "Efficiency vs. portability in cluster-based network servers.",
                    "Statistical scalability analysis of communication operations in distributed applications.",
                    "LogGPS: a parallel computational model for synchronization analysis.",
                    "Peer to peer and distributed computing (abstract)."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th PPOPP 1999",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1999",
                "sub_name": "Proceedings of the 1999 ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPOPP'99), Atlanta, Georgia, USA, May 4-6, 1999.",
                "count": 17,
                "papers": [
                    "Basic Compiler Algorithms for Parallel Programs.",
                    "Code Motion for Explicitly Parallel Programs.",
                    "An Evaluation of Computing Paradigms for N-Body Simulations on Distributed Memory Architectures.",
                    "SUIF Explorer: An Interactive and Interprocedural Parallelizer.",
                    "Dynamic Instrumentation of Threaded Applications.",
                    "StackThreads/MP: Integrating Futures into Calling Standards.",
                    "Automatic Parallelization of Divide and Conquer Algorithms.",
                    "Evaluation of Predicated Array Data-Flow Analysis for Automatic Parallelization.",
                    "Transparent Adaptive Parallelism on NOWs using OpenMP.",
                    "Compile/Run-Time Support for Threaded MPI Execution on Multiprogrammed Shared Memory Machines.",
                    "Design Challenges of Virtual Networks: Fast, General-Purpose Communication.",
                    "MagPIe: MPI's Collective Communication Operations for Clustered Wide Area Systems.",
                    "Predictive Analysis of a Wavefront Application using LogGP.",
                    "Performance Prediction of Large Parallel Applications using Parallel Simulations.",
                    "Automatic Node Selection for High Performance Applications on Networks.",
                    "An Efficient Implementation of Java's Remote Method Invocation.",
                    "Space-Time Memory: A Parallel Programming Abstraction for Interactive Multimedia Applications."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th PPOPP 1997",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1997",
                "sub_name": "Proceedings of the Sixth ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming (PPOPP), Las Vegas, Nevada, USA, June 18-21, 1997.",
                "count": 25,
                "papers": [
                    "A New Model for Integrated Nested Task and Data Parallel Programming.",
                    "High Performance FORTRAN for Highly Unstructured Problems.",
                    "Space-Efficient Implementation of Nested Parallelism.",
                    "Dynamic Pointer Alignment: Tiling and Communication Optimizations for Parallel Pointer-based Computations.",
                    "Compiler and Software Distributed Shared Memory Support for Irregular Applications.",
                    "Space and Time Efficient Execution of Parallel Irregular Computation.",
                    "The Interaction of Parallel Programming Constructs and Coherence Protocols.",
                    "Ace: Linguistic Mechanisms for Customizable Protocols.",
                    "Trade-offs Between False Sharing and Aggregation in Software Distributed Shared Memory.",
                    "Optimizing Communication in HPF programs for Fine-Grain Distributed Shared Memory.",
                    "Effective Fine-Grain Synchronization for Automatically Parallelized Programs Using Optimistic Synchronization Primitives.",
                    "Experiences with Non-numeric Applications on Multithreaded Architectures.",
                    "Automatic Placement of Communications in Mesh-Partitioning Parallelization.",
                    "Parallel Breadth-First BDD Construction.",
                    "Experience with Efficient Array Data-Flow Analysis for Array Privatization.",
                    "Compiling Dynamic Mappings with Array Copies.",
                    "Compilation of Parallel Multimedia Computations - Extending Retiming Theory and Amdahl's Law.",
                    "Relaxed Consistency and Coherence Granularity in DSM Systems: A Performance Evaluation.",
                    "Auto-blocking Matrix-Multiplication or Tracking BLAS3 Performance with Source Code.",
                    "Application Restructuring and Performance Portability on Shared Virtual Memory and Hardware-Coherent Multiprocessors.",
                    "Performance Implications of Communication Mechanisms in All-Software Global Address Space Systems.",
                    "Shared Memory Performance Profiling.",
                    "Parallel Shear-Warp Volume Rendering on Shared Address Space Multiprocessors.",
                    "An Effective Garbage Collection Strategy for Parallel Programming Languages on Large Scale Distributed-Memory Machines.",
                    "LoPC: Modeling Contention in Parallel Algorithms."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th PPOPP 1995",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1995",
                "sub_name": "Proceedings of the Fifth ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming (PPOPP), Santa Barbara, California, USA, July 19-21, 1995.",
                "count": 22,
                "papers": [
                    "A Model and Compilation Strategy for Out-of-Core Data Parallel Programs.",
                    "pC++/streams: a Library for I/O on Complex Distributed Data Structures.",
                    "Parallel Skeletons for Structured Composition.",
                    "Software Caching and Computation Migration in Olden.",
                    "Distributed Data Access in AC.",
                    "Generating Parallel Code from Object Oriented Mathematical Models.",
                    "Flattening and Parallelizing Irregular, Recurrent Loop Nests.",
                    "Efficient Support for Irregular Applications on Distributed-Memory Machines.",
                    "High-Level Optimization via Automated Statistical Modeling.",
                    "Fuzzy Array Dataflow Analysis.",
                    "A Linear-Time Algorithm for Computing the Memory Access Sequence in Data-Parallel Programs.",
                    "An Array Operation Synthesis Scheme to Optimize Fortran 90 Programs.",
                    "Parallel Algorithms for Image Histogramming and Connected Components with an Experimental Study (Extended Abstract).",
                    "Optimal Mapping of Sequences of Data Parallel Tasks.",
                    "Compiler Optimizations for Eliminating Barrier Synchronization.",
                    "Automatic Alignment of Array Data and Processes to Reduce Communication Time on DMPPs.",
                    "Data and Computation Transformations for Multiprocessors.",
                    "Reducing False Sharing on Shared Memory Multiprocessors through Compile Time Data Transformations.",
                    "Evaluating the Locality Benefits of Active Messages.",
                    "High Performance Synchronization Algorithms for Multiprogrammed Multiprocessors.",
                    "Cilk: An Efficient Multithreaded Runtime System.",
                    "Optimistic Active Messages: A Mechanism for Scheduling Communication with Computation."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th PPOPP 1993",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1993",
                "sub_name": "Proceedings of the Fourth ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming (PPOPP), San Diego, California, USA, May 19-22, 1993.",
                "count": 26,
                "papers": [
                    "LogP: Towards a Realistic Model of Parallel Computation.",
                    "Programming Task and Data Parallelism on a Multicomputer.",
                    "ActorSpaces: An Open Distributed Programming Paradigm.",
                    "Experiences Using the ParaScope Editor: an Interactive Parallel Programming Tool.",
                    "Perturbation Analysis of High Level Instrumentation for SPMD Programs.",
                    "Integrating Message-Passing and Shared-Memory: Early Experience.",
                    "Using Scheduler Information to Achieve Optimal Barrier Synchronization Performance.",
                    "A Concurrent Copying Garbage Collector for Languages that Distinguish (Im)mutable Data.",
                    "Improving the Performance of Runtime Parallelization.",
                    "High Performance Fortran Without Templates: An Alternative Model for Distribution and Alignment.",
                    "Implementation of a Portable Nested Data-Parallel Language.",
                    "An Equational Language for Data-Parallelism.",
                    "Transforming High-Level Data-Parallel Programs into Vector Operations.",
                    "Non-concurrency Analysis.",
                    "Explicit Data Placement (XDP): A Methodology for Explicit Compile-Time Representation and Optimization.",
                    "Generating Local Address and Communication Sets for Data-Parallel Programs.",
                    "Data Flow Equations for Explicitly Parallel Programs.",
                    "Implementing an Irregular Application on a Distributed Memory Multiprocessor.",
                    "Parallelizing Algorithms for Symbolic Computation using ||MAPLE||.",
                    "Experience with Fine-Grain Synchronization in MIMD Machines for Preconditioned Conjugate Gradient.",
                    "Procs and Locks: A Portable Multiprocessing Platform for Standard ML of New Jersey.",
                    "Leapfrogging: A Portable Technique for Implementing Efficient Futures.",
                    "An Efficient Implementation Scheme of Concurrent Object-Oriented Languages on Stock Multicomputers.",
                    "The Shared Regions Approach to Software Cache Coherence on Multiprocessors.",
                    "Computation Migration: Enhancing Locality for Distributed-Memory Parallel Systems.",
                    "Data Locality and Load Balancing in COOL."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "3rd PPOPP 1991",
        "info": "Williamsburg, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1991",
                "sub_name": "Proceedings of the Third ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming (PPOPP), Williamsburg, Virginia, USA, April 21-24, 1991.",
                "count": 21,
                "papers": [
                    "Optimal Schedules for Parallel Prefix Computation with Bounded Resources.",
                    "Parallel-Program Transformation Using A Metalanguage.",
                    "Mapping Concurrent Programs to VLIW Processors.",
                    "A Unified Framework for Systemic Loop Transformation.",
                    "Scanning Polyhedra with DO Loops.",
                    "Removal of Redundant Dependences in DOACROSS Lops with Constant Dependences.",
                    "Exploitation of APL Data Parallelism on a Shared-memory MIMD Machine.",
                    "A Production-Quality C* Compiler for Hypercube Multicomputers.",
                    "Andorra-I: A Parallel Prolog System that Transparently Exploits both And- and Or-Parallelism.",
                    "Coarse-Grain Parallel Programming in Jade.",
                    "Scalable Reader-Writer Synchronization for Shared-Memory Multiprocessors.",
                    "Dynamic Node Reconfiguration in a Parallel-Distributed Environment.",
                    "Exploiting Operating System Support for Dynamic Page Placement on a NUMA Shared Memory Multiprocessor.",
                    "Improving the Accuracy of Data Race Detection.",
                    "Race Frontier: Reproducing Data Races in Parallel-Program Debugging.",
                    "Optimistic Parallelization of Communicating Sequential Processes.",
                    "Parallelizing a New Class of Large Applications over High-speed Networks.",
                    "Parallelization and Performance of Conjugate Gradient Algorithms on the Cedar Hierarchical-Memory Multiprocessor.",
                    "The Integration of Application and System Based Metrics in a Parallel Program Performance Tool.",
                    "Event-Based Performance Perturbation: A Case Study.",
                    "A Static Performance Estimator to Guide Data Partitioning Decisions."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "2nd PPOPP 1990",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1990",
                "sub_name": "Proceedings of the Second ACM SIGPLAN Symposium on Princiles & Practice of Parallel Programming (PPOPP), Seattle, Washington, USA, March 14-16, 1990.",
                "count": 21,
                "papers": [
                    "An Empirical Comparison of Monitoring Algorithms for Access Anomaly Detection.",
                    "Modeling Concurrency in Parallel Debugging.",
                    "Analysis of Event Synchronization in A Parallel Programming Tool.",
                    "Programming Techniques for Efficiently Exploiting Parallelism in Logic Programming Languages.",
                    "Design and Distributed Implementation of the Parallel Logic Language Shared Prolog.",
                    "A Multi-Level Load Balancing Scheme for OR-Parallel Exhaustive Search Programs on the Multi-PSI.",
                    "The Evolution of HPC/VORX.",
                    "Multi-Model Parallel Programming in Psyche.",
                    "Real-Time, Concurrent Checkpoint for Parallel Programs.",
                    "Analysis of Synchronization in Massively Parallel Discrete-Event Sumulations.",
                    "A Chare Kernel Implementation of a Parallel Prolog Compiler.",
                    "An Implementation of a Barotropic Numerical Weather Prediction Model in the Functional Language SISAL.",
                    "Employing Register Channels for the Exploitation of Instruction Level Parallelism.",
                    "Continuations and Concurrency.",
                    "An Approach to Ordering Optimizing Transformations.",
                    "The Process Trellis Architectur for Real-Time Monitors.",
                    "The Effectiveness of Task-Level Parallelism for High-Level Vision.",
                    "Munin: Distributed Shared Memory Based on Type-Specific Memory Coherence.",
                    "Supporting Shared Data Structures on Distributed Memory Architectures.",
                    "Concurrent Aggregates (CA).",
                    "A Methodology for Implementing Highly Concurrent Data Structures."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "1st PPOPP(PPEALS) 1988",
        "info": "New Haven, Connecticut, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ppopp/1988",
                "sub_name": "Proceedings of the ACM/SIGPLAN PPEALS 1988, Parallel Programming: Experience with Applications, Languages and Systems, New Haven, Connecticut, USA, July 19-21, 1988.",
                "count": 21,
                "papers": [
                    "An Open Environment for Building Parallel Programming Systems.",
                    "Experiences with Poker.",
                    "Non-Intrusive and Interactive Profiling in Parasight.",
                    "Program Development for a Systolic Array.",
                    "Compiling Fortran 8x Array Features for the Connection Machine Computer System.",
                    "Compiling C* Programs for a Hypercube Multicomputer.",
                    "Using Data Partitioning to Implement a Parallel Assembler.",
                    "Automatic Discovery of Parallelism: A Tool and an Experiment (Extended Abstract).",
                    "Efficient Interprocedural Analysis for Program Parallelization and Restructuring.",
                    "Restructuring Lisp Programs for Concurrent Execution.",
                    "Qlisp: Experience and New Directions.",
                    "Parallel Discrete-Event Simulation Of FCFS Stochastic Queuing Networks.",
                    "The Parallel Decomposition and Implementation of an Integrated Circuit Global Router.",
                    "Soar/PSM-E: Investigating Match Parallelism in a Learning Production System.",
                    "Large-Scale Parallel Programming: Experience with the BBN Butterfly Parallel Processor.",
                    "Applications Experience with Linda.",
                    "On the Implementation of Applicative Languages on Shared-Memory, MIMD Multiprocessors.",
                    "Characterizing the Synchronization Behavior of Parallel Programs.",
                    "Exploiting Variable Grain Parallelism at Runtime.",
                    "Communication-Sensitive Heuristics and Algorithms for Mapping Compilers.",
                    "Compile-time Techniques for Efficient Utilization of Parallel Memories."
                ]
            }
        ]
    }
]