[
    {
        "name": "RTS",
        "year": "2022",
        "info": "2022: Volume 58",
        "count": 4,
        "papers": [
            "Editorial on the special issue of RTNS 2020.",
            "Workload assignment for global real-time scheduling on unrelated clustered platforms.",
            "Precise, efficient, and context-sensitive cache analysis.",
            "An ILP representation of a DAG scheduling problem."
        ]
    },
    {
        "name": "RTS",
        "year": "2021",
        "info": "2021: Volume 57",
        "count": 16,
        "papers": [
            "Selected papers presented at the 26th International Conference on Real-Time and Network Systems (RTNS 2018).",
            "Tardiness bounds for fixed-priority global scheduling without intra-task precedence constraints.",
            "A novel view on bounding execution demand under mixed-criticality EDF.",
            "Guest Editorial: Special issue on outstanding papers from RTNS 2019.",
            "Statically optimal dynamic soft real-time semi-partitioned scheduling.",
            "Response time analysis of multiframe mixed-criticality systems with arbitrary deadlines.",
            "Concurrency groups: a new way to look at real-time multiprocessor lock nesting.",
            "Algorithms for implementing elastic tasks on multiprocessor platforms: a comparative evaluation.",
            "Guest editorial: Special issue on Real-Time Systems Symposium (RTSS).",
            "Mixed-criticality real-time scheduling of gang task systems.",
            "Online reconfiguration of regularity-based resource partitions in cyber-physical systems.",
            "Reaching self-stabilising distributed synchronisation with COTS Ethernet components: the WALDEN approach.",
            "A note on slack enforcement mechanisms for self-suspending tasks.",
            "Schedulability of probabilistic mixed-criticality systems.",
            "Dynamic power management under the RUN scheduling algorithm: a slack filling approach.",
            "Linear-time admission control for elastic scheduling."
        ]
    },
    {
        "name": "RTS",
        "year": "2020",
        "info": "2020: Volume 56",
        "count": 16,
        "papers": [
            "Analysis and elimination of noise-induced temperature error in processor thermal control.",
            "Estimating WCET using prediction models to compute fitness function of a genetic algorithm.",
            "Performance maximization of energy-variable self-powered (m, k)-firm real-time systems.",
            "Commentary to: An exact schedulability test for fixed-priority preemptive mixed-criticality real-time systems.",
            "Guest editorial: Special Issue on Predictable multi-core systems.",
            "Work-conserving dynamic time-division multiplexing for multi-criticality systems.",
            "Reduced latency DRAM for multi-core safety-critical real-time systems.",
            "Design and analysis of SIC: a provably timing-predictable pipelined processor core.",
            "Optimal scheduling of measurement-based parallel real-time tasks.",
            "Feasibility of on-line speed policies in real-time systems.",
            "A branch-and-cut approach to examining the maximum density guarantee for pinwheel schedulability of low-dimensional vectors.",
            "End-to-end latency characterization of task communication models for automotive systems.",
            "Supporting I/O and IPC via fine-grained OS isolation for mixed-criticality real-time tasks.",
            "Co-scheduling aperiodic real-time tasks with end-to-end firm and soft deadlines in two-stage systems.",
            "A schedule randomization policy to mitigate timing attacks in WirelessHART networks.",
            "Correspondence Article: Counterexample for suspension-aware schedulability analysis of EDF scheduling."
        ]
    },
    {
        "name": "RTS",
        "year": "2019",
        "info": "2019: Volume 55",
        "count": 26,
        "papers": [
            "Uniprocessor scheduling of real-time synchronous dataflow tasks.",
            "Stretching algorithm for global scheduling of real-time DAG tasks.",
            "Real-time analysis of priority-preemptive NoCs with arbitrary buffer sizes and router delays.",
            "DeepRT: predictable deep learning inference for cyber-physical systems.",
            "Correspondence article: a correction of the reduction-based schedulability analysis for APA scheduling.",
            "Many suspensions, many problems: a review of self-suspending tasks in real-time systems.",
            "Efficient offline scheduling of task-sets with complex constraints on large distributed time-triggered systems.",
            "Uneven memory regulation for scheduling IMA applications on multi-core platforms.",
            "Guest editorial: special issue on Real-Time and Network Systems.",
            "Real-time multiprocessor locks with nesting: optimizing the common case.",
            "A parallel branch-and-bound algorithm to compute a tighter tardiness bound for preemptive global EDF.",
            "Schedulability analysis of DAG tasks with arbitrary deadlines under global fixed-priority scheduling.",
            "Hard real-time application mapping reconfiguration for NoC-based many-core systems.",
            "FFOB: efficient online mode-switch procrastination in mixed-criticality systems.",
            "Decision-driven scheduling.",
            "Dynamic budget management and budget reclamation for mixed-criticality systems.",
            "A comparison of schedulability analysis methods using state and digraph models for the schedulability analysis of synchronous FSMs.",
            "Guest editorial: special issue on the Real-Time Systems Symposium 2017.",
            "Analysis techniques for supporting hard real-time sporadic gang task systems.",
            "The concept of Maximal Unschedulable Deadline Assignment for optimization in fixed-priority scheduled real-time systems.",
            "Priority-based scheduling of mixed-critical jobs.",
            "Thermal-aware task allocation and scheduling for periodic real-time applications in mesh-based heterogeneous NoCs.",
            "Cache-conscious off-line real-time scheduling for multi-core platforms: algorithms and implementation.",
            "A real-time scratchpad-centric OS with predictable inter/intra-core communication for multi-core embedded systems.",
            "Practical task allocation for software fault-tolerance and its implementation in embedded automotive systems.",
            "Correction to: A compiler framework for the reduction of worst-case execution times."
        ]
    },
    {
        "name": "RTS",
        "year": "2018",
        "info": "2018: Volume 54",
        "count": 26,
        "papers": [
            "Improved response-time bounds in fixed priority scheduling with arbitrary deadlines.",
            "Erratum to: Improved response-time bounds in fixed priority scheduling with arbitrary deadlines.",
            "An exact schedulability test for fixed-priority preemptive mixed-criticality real-time systems.",
            "Response time analysis of digraph real-time tasks scheduled with static priority: generalization, approximation, and improvement.",
            "Energy-efficient real-time scheduling for two-type heterogeneous multiprocessors.",
            "Automated competitive analysis of real-time scheduling with graph games.",
            "Exact speedup factors and sub-optimality for non-preemptive scheduling.",
            "Multi-rate fluid scheduling of mixed-criticality systems on multiprocessors.",
            "Delay-dependent partial order reduction technique for real time systems.",
            "On the analysis of random replacement caches using static probabilistic timing methods for multi-path programs.",
            "Patmos: a time-predictable microprocessor.",
            "Multi-objective design exploration approach for Ravenscar real-time systems.",
            "Enhancing timeliness and saving power in real-time databases.",
            "On the ineffectiveness of 1/m-based interference bounds in the analysis of global EDF and FIFO scheduling.",
            "On the use of static branch prediction to reduce the worst-case execution time of real-time applications.",
            "A hybrid performance analysis technique for distributed real-time embedded systems.",
            "Guest editorial: special issue on real time and network systems.",
            "An extensible framework for multicore response time analysis.",
            "Online and offline scheduling with cache-related preemption delays.",
            "Analysis of preemption costs for the stack cache.",
            "An industrial view on the common academic understanding of mixed-criticality systems.",
            "Guest editorial: real-time networks and systems.",
            "A design flow for supporting component-based software development in multiprocessor real-time systems.",
            "Optimal harmonic period assignment: complexity results and approximation algorithms.",
            "Independent WCRT analysis for individual priority classes in Ethernet AVB.",
            "Response-time analysis for fixed-priority systems with a write-back cache."
        ]
    },
    {
        "name": "RTS",
        "year": "2017",
        "info": "2017: Volume 53",
        "count": 28,
        "papers": [
            "Real-time processing of streaming big data.",
            "Real-time scheduling algorithm for safety-critical systems on faulty multicore environments.",
            "Optimizing resource speed for two-stage real-time tasks.",
            "Deterministic delay analysis of AVB switched Ethernet networks using an extended Trajectory Approach.",
            "A misconception in blocking time analyses under multiprocessor synchronization protocols.",
            "Model predictive control under timing constraints induced by controller area networks.",
            "Energy-efficient response time management for embedded databases.",
            "Timing analysis of rate-constrained traffic in TTEthernet using network calculus.",
            "Guest Editorial: Special issue on formal modeling and analysis of timed systems.",
            "Bounded determinization of timed automata with silent transitions.",
            "Timed-automata abstraction of switched dynamical systems using control invariants.",
            "Verification and control of partially observable probabilistic systems.",
            "Fixed priority scheduling with pre-emption thresholds and cache-related pre-emption delays: integrated analysis and evaluation.",
            "An efficient schedulability analysis for optimizing systems with adaptive mixed-criticality scheduling.",
            "Schedulability analysis of Ethernet Audio Video Bridging networks with scheduled traffic support.",
            "Optimal minimal routing and priority assignment for priority-preemptive real-time NoCs.",
            "Erratum to: Optimal minimal routing and priority assignment for priority-preemptive real-time NoCs.",
            "Isolation scheduling on multicores: model and scheduling approaches.",
            "Guest editorial: special issue on mixed-criticality, multi-core, and micro-kernels.",
            "Addressing isolation challenges of non-blocking caches for multicore real-time systems.",
            "Attacking the one-out-of-m multicore problem by combining hardware management with mixed-criticality provisioning.",
            "Mixed-criticality federated scheduling for parallel real-time tasks.",
            "High-assurance timing analysis for a high-assurance real-time operating system.",
            "Guest editorial: special issue on embedded and real-time computing systems and applications.",
            "rt-muse: measuring real-time characteristics of execution platforms.",
            "Using non-preemptive regions and path modification to improve schedulability of real-time traffic over priority-based NoCs.",
            "Designing end-to-end resource reservations in predictable distributed embedded systems.",
            "Parameter adaptation for generalized multiframe tasks: schedulability analysis, case study, and applications to self-suspending tasks."
        ]
    },
    {
        "name": "RTS",
        "year": "2016",
        "info": "2016: Volume 52",
        "count": 25,
        "papers": [
            "Schedulability analysis of a graph-based task model for mixed-criticality systems.",
            "Calculating WCET estimates from timed traces.",
            "Formal timing analysis of CAN-to-Ethernet gateway strategies in automotive networks.",
            "On the compatibility of exact schedulability tests for global fixed priority pre-emptive scheduling with Audsley's optimal priority assignment algorithm.",
            "Guest Editorial - RTNS 2014.",
            "Response time analysis for fixed priority real-time systems with energy-harvesting.",
            "Combined task- and network-level scheduling for distributed time-triggered systems.",
            "Cache related pre-emption delays in hierarchical scheduling.",
            "Schedulability analysis of non-preemptive strictly periodic tasks in multi-core real-time systems.",
            "A framework for memory contention analysis in multi-core platforms.",
            "A pre-order relation for exact schedulability test of sporadic tasks on multiprocessor Global Fixed-Priority scheduling.",
            "Bounding and reducing memory interference in COTS-based multi-core systems.",
            "Guest editorial: special issue on multicore systems.",
            "Mixed-criticality scheduling on cluster-based manycores with shared communication and storage resources.",
            "Energy-aware task mapping onto heterogeneous platforms using DVFS and sleep states.",
            "Using a lag-balance property to tighten tardiness bounds for global EDF.",
            "Special issue of the Euromicro Conference on Real-Time Systems (ECRTS).",
            "Quasi-partitioned scheduling: optimality and adaptation in multiprocessor real-time systems.",
            "On the effectiveness of cache partitioning in hard real-time systems.",
            "Integrating security constraints into fixed priority real-time schedulers.",
            "Architecture and analysis of a dynamically-scheduled real-time memory controller.",
            "Early execution time-estimation through automatically generated timing models.",
            "A composable worst case latency analysis for multi-rank DRAM devices under open row policy.",
            "Periodicity of real-time schedules for dependent periodic tasks on identical multiprocessor platforms.",
            "Federated scheduling admits no constant speedup factors for constrained-deadline DAG task systems."
        ]
    },
    {
        "name": "RTS",
        "year": "2015",
        "info": "2015: Volume 51",
        "count": 23,
        "papers": [
            "Design optimization of TTEthernet-based distributed real-time systems.",
            "Utilization-based admission control for aperiodic tasks under EDF scheduling.",
            "Static probabilistic timing analysis for real-time systems using random replacement caches.",
            "Special issue on scheduling and timing analysis for advanced real-time systems.",
            "Static probabilistic worst case execution time estimation for architectures with faulty instruction caches.",
            "Scheduling algorithms to reduce the static energy consumption of real-time systems.",
            "Timing analysis enhancement for synchronous program.",
            "Hard real-time guarantees in feedback-based resource reservations.",
            "The limited-preemptive feasibility of real-time tasks on uniprocessors.",
            "Architecture aware semi partitioned real-time scheduling on multicore platforms.",
            "Real-time application mapping for many-cores using a limited migrative model.",
            "Editor's Note: Special Issue on ECRTS.",
            "Computing periodic request functions to speed-up the analysis of non-cyclic task models.",
            "Global EDF scheduling for parallel real-time tasks.",
            "Multiprocessor real-time scheduling with arbitrary processor affinities: from practice to theory.",
            "Maintaining thermal comfort in buildings: feasibility, algorithms, implementation, evaluation.",
            "Off-line mapping of multi-rate dependent task sets to many-core platforms.",
            "Exact comparison of fixed priority and EDF scheduling based on speedup factors for both pre-emptive and non-pre-emptive paradigms.",
            "Graph-based models for real-time workload: a survey.",
            "Guest Editorial: Special Issue on The Real-Time Systems Symposium.",
            "Combinatorial abstraction refinement for feasibility analysis of static priorities.",
            "Cache-aware compositional analysis of real-time multicore virtualization platforms.",
            "Reliable social sensing with physical constraints: analytic bounds and performance evaluation."
        ]
    },
    {
        "name": "RTS",
        "year": "2014",
        "info": "2014: Volume 50",
        "count": 22,
        "papers": [
            "Special issue on multiprocessor and mixed-criticality scheduling - Foreword.",
            "Fair lateness scheduling: reducing maximum lateness in G-EDF-like scheduling.",
            "Bounding and shaping the demand of generalized mixed-criticality sporadic task systems.",
            "Task assignment algorithms for two-type heterogeneous multiprocessors.",
            "Mixed-criticality scheduling on multiprocessors.",
            "Clairvoyance and online scheduling in real-time energy harvesting systems.",
            "Static analysis of multi-core TDMA resource arbitration delays.",
            "Holistic schedulability analysis for multipacket messages in AFDX networks.",
            "Real-time scheduling with resource sharing on heterogeneous multiprocessors.",
            "Guest Editorial: Optimization of real-time systems.",
            "Implementing mixed-criticality synchronous reactive programs upon uniprocessor platforms.",
            "Compositional multiprocessor scheduling: the GMPR interface.",
            "Criticality: static profiling for real-time programs.",
            "Interference-aware fixed-priority schedulability analysis on multiprocessors.",
            "An optimal boundary fair scheduling.",
            "Fault-tolerant and real-time scheduling for mixed-criticality systems.",
            "Precautious-RM: a predictable non-preemptive scheduling algorithm for harmonic tasks.",
            "CPMD-mindful task assignment for NPS-F.",
            "Energy efficient fault-tolerant earliest deadline first scheduling for hard real-time systems.",
            "Parameter synthesis for hierarchical concurrent real-time systems.",
            "Unified overhead-aware schedulability analysis for slot-based task-splitting.",
            "A formal approach to the WCRT analysis of multicore systems with memory contention under phase-structured task sets."
        ]
    },
    {
        "name": "RTS",
        "year": "2013",
        "info": "2013: Volume 49",
        "count": 25,
        "papers": [
            "Data cache organization for accurate timing analysis.",
            "Assigning real-time tasks on heterogeneous multiprocessors with two unrelated types of processors.",
            "Schedulability analysis for Controller Area Network (CAN) with FIFO queues priority queues and gateways.",
            "Design of a crossbar VOQ real-time switch with clock-driven scheduling for a guaranteed delay bound.",
            "Guest editorial: multiprocessor scheduling.",
            "An optimal k-exclusion real-time locking protocol motivated by multi-GPU systems.",
            "Multiprocessor schedulability of arbitrary-deadline sporadic tasks: complexity and antichain algorithm.",
            "Partitioned EDF scheduling on a few types of unrelated multiprocessors.",
            "Scheduling of hard real-time multi-phase multi-thread (MPMT) periodic tasks.",
            "Resource and performance trade-offs in real-time embedded control systems.",
            "Optimal design of virtual links in AFDX networks.",
            "Preface to special issue on adaptive embedded systems.",
            "Optimal and efficient adaptation in distributed real-time systems with discrete rates.",
            "Stability of adaptive feedback-based resource managers for systems with execution time variations.",
            "Guest Editorial: From Uniprocessors to Multiprocessors: Advances in Real-Time Systems.",
            "Multi-core real-time scheduling for generalized parallel task models.",
            "Multiprocessor scheduling by reduction to uniprocessor: an original optimal approach.",
            "Resource augmentation for uniprocessor and multiprocessor partitioned scheduling of sporadic real-time tasks.",
            "Scalable and precise refinement of cache timing analysis via path-sensitive verification.",
            "Service based meta-model for the development of distributed embedded real-time systems.",
            "Resource sharing among real-time components under multiprocessor clustered scheduling.",
            "Safety-critical Java programs from Circus models.",
            "Implementation and evaluation of global and partitioned scheduling in a real-time OS.",
            "Partitioned EDF scheduling: a closer look.",
            "Real-time worst-case temperature analysis with temperature-dependent parameters."
        ]
    },
    {
        "name": "RTS",
        "year": "2012",
        "info": "2012: Volume 48",
        "count": 26,
        "papers": [
            "Guest editorial - RTNS 2010.",
            "Partitioned EDF scheduling for multiprocessors using a C=D task splitting scheme.",
            "Globally scheduled real-time multiprocessor systems with GPUs.",
            "CoMem: collaborative memory management for real-time operation within reactive sensor/actor networks.",
            "Applying Trajectory approach with static priority queuing for improving the use of available AFDX resources.",
            "Energy-optimal Batching periods for asynchronous multistage data processing on sensor nodes: foundations and an mPlatform case study.",
            "Instruction cache locking for multi-task real-time embedded systems.",
            "Hierarchical CPU utilization control for real-time guarantees in power grid computing.",
            "A bandwidth allocation scheme for compositional real-time systems with periodic resources.",
            "Scheduling real-time divisible loads with advance reservations.",
            "On the nature and impact of self-similarity in real-time systems.",
            "Feasibility analysis of real-time transactions.",
            "Strictly periodic scheduling in IMA-based architectures.",
            "Maintaining data temporal consistency in distributed real-time systems.",
            "State-based scheduling with tree schedules: analysis and evaluation.",
            "Quality-aware data abstraction layer for collaborative 2-tier sensor network applications.",
            "Improved cache related pre-emption delay aware response time analysis for fixed priority pre-emptive systems.",
            "Numerical analysis of worst-case end-to-end delay bounds in FIFO tandem networks.",
            "Performance debugging of Esterel specifications.",
            "On-line schedulability tests for adaptive reservations in fixed priority scheduling.",
            "Guest editorial.",
            "Timing analysis of concurrent programs running on shared cache multi-cores.",
            "Memory-centric scheduling for multicore hard real-time systems.",
            "Laxity dynamics and LLF schedulability analysis on multiprocessor platforms.",
            "FPSL, FPCL and FPZL schedulability analysis.",
            "Analysis and implementation of the multiprocessor bandwidth inheritance protocol."
        ]
    },
    {
        "name": "RTS",
        "year": "2011",
        "info": "2011: Volume\n47",
        "count": 25,
        "papers": [
            "Improved priority assignment for global fixed priority pre-emptive scheduling in multiprocessor real-time systems.",
            "Hardware design of a new genetic based disk scheduling method.",
            "Guest editorial.",
            "Energy efficient scheduling for real-time embedded systems with QoS guarantee.",
            "Global scheduling based reliability-aware power management for multiprocessor real-time systems.",
            "Hybrid power management in real time embedded systems: an interplay of DVFS and DPM techniques.",
            "Applying real-time interface and calculus for dynamic power management in hard real-time systems.",
            "Guest editorial: embedded and real-time computing systems and applications.",
            "Feasibility analysis under fixed priority scheduling with limited preemptions.",
            "Sensitivity analysis of arbitrary deadline real-time systems with EDF scheduling.",
            "Cluster scheduling for real-time systems: utilization bounds and run-time overhead.",
            "Efficient verification of distributed real-time systems with broadcasting behaviors.",
            "Preemption-light multiprocessor scheduling of sporadic tasks with high utilisation bound.",
            "Sticky-ERfair: a task-processor affinity aware proportional fair scheduler.",
            "A counter-example to: Sticky-ERfair: a task-processor affinity aware proportional fair scheduler.",
            "A Corrigendum to: \"Sticky-ERfair: a task-processor affinity aware proportional fair scheduler\".",
            "Guest editorial: real time systems resource management.",
            "DP-Fair: a unifying theory for optimal hard real-time multiprocessor scheduling.",
            "Making DRAM refresh predictable.",
            "CPU scheduling and memory management for interactive real-time applications.",
            "System-wide energy optimization for multiple DVS components and real-time tasks.",
            "Efficient computation of response time bounds for preemptive uniprocessor deadline monotonic scheduling.",
            "QoC elastic scheduling for real-time control systems.",
            "Multiprocessor extensions to real-time calculus.",
            "Slack-based multiprocessor scheduling of aperiodic real-time tasks."
        ]
    },
    {
        "name": "RTS",
        "year": "2010",
        "info": "2010: Volumes\n44, 45, 46",
        "count": 22,
        "papers": [
            "DESH: overhead reduction algorithms for deferrable scheduling.",
            "Generalized tardiness bounds for global multiprocessor scheduling.",
            "Processing element allocation and dynamic scheduling codesign for multi-function SoCs.",
            "Exploiting slack time for just-in-time scheduling in wireless sensor networks.",
            "Optimal online multiprocessor scheduling of sporadic real-time tasks is impossible.",
            "Transforming flow information during code optimization for timing analysis.",
            "A timeband framework for modelling real-time systems.",
            "Real time stochastic scheduling in broadcast systems with decentralized data storage.",
            "Scheduling of hard real-time garbage collection.",
            "Guest editorial: special issue of the Euromicro Conference on Real-Time Systems (ECRTS 2009).",
            "Improved multiprocessor global schedulability analysis.",
            "Spin-based reader-writer synchronization for multiprocessor real-time systems.",
            "Competitive analysis of online real-time scheduling algorithms under hard energy constraint.",
            "Reduction-based schedulability analysis of distributed systems with cycles in the task graph.",
            "Provably good multiprocessor scheduling with resource sharing.",
            "Schedulability analysis in hard real-time systems under thermal constraints.",
            "SetExp: a method of transformation of timed automata into finite state automata.",
            "A compiler framework for the reduction of worst-case execution times.",
            "Guest editorial: special issue on the Real-Time and Network Systems (RTNS 2009) conference.",
            "Schedulability and sensitivity analysis of multiple criticality tasks with fixed-priorities.",
            "LRE-TL: an optimal multiprocessor algorithm for sporadic task sets with unconstrained deadlines.",
            "Schedulability analysis and task mapping for real-time on-chip communication."
        ]
    },
    {
        "name": "RTS",
        "year": "2009",
        "info": "2009: Volumes\n41, 42, 43",
        "count": 24,
        "papers": [
            "The feasibility of general task systems with precedence constraints on multiprocessor platforms.",
            "The space of EDF deadlines: the exact region and a convex approximation.",
            "Cache-aware timing analysis of streaming applications.",
            "Resource holding times: computation and optimization.",
            "Formal verification of real-time systems with preemptive scheduling.",
            "Robust priority assignment for messages on Controller Area Network (CAN).",
            "An earlier time for inserting and/or accelerating tasks.",
            "Energy efficient redundant configurations for real-time parallel reliable servers.",
            "A DVS-assisted hard real-time I/O device scheduling algorithm.",
            "Modelling computational requirements of mobile robotic systems using zones and processing windows.",
            "A real-time configurable synchronization protocol for self-suspending process sets.",
            "Worst-case response time analysis of real-time tasks under fixed-priority scheduling with deferred preemption.",
            "Guest editorial: Special issue on ECRTS 2008.",
            "An analysis of global edf schedulability for arbitrary-deadline sporadic task systems.",
            "Optimal virtual cluster-based multiprocessor scheduling.",
            "A hierarchical multiprocessor bandwidth reservation scheme with timing guarantees.",
            "A gravitational task model with arbitrary anchor points for target sensitive real-time applications.",
            "Guest editorial: special issue on the Real-Time and Network Systems (RTNS 2008) conference.",
            "Exact scheduling analysis of non-accumulatively monotonic multiframe tasks.",
            "Approximation techniques for response-time analysis of static-priority tasks.",
            "Enhancing a dependable multiserver operating system with temporal protection via resource reservations.",
            "Exact quantification of the sub-optimality of uniprocessor fixed priority pre-emptive scheduling.",
            "Investigating the usability of real-time scheduling theory with the Cheddar project.",
            "Handling mixed sets of tasks in combined offline and online scheduled real-time systems."
        ]
    },
    {
        "name": "RTS",
        "year": "2008",
        "info": "2008: Volumes\n38, 39, 40",
        "count": 29,
        "papers": [
            "An analysis method for variable execution time tasks based on histograms.",
            "Formal verification of multitasking applications based on timed automata model.",
            "A time-predictable VLIW processor and its compiler support.",
            "An EDF-based restricted-migration scheduling algorithm for multiprocessor soft real-time systems.",
            "Tardiness bounds under global EDF scheduling on a multiprocessor.",
            "On-line and post-processing timestamp correspondence for free-running clock nodes, using a network clock.",
            "Schedulability analysis of global edf.",
            "A schedulable utilization bound for the multiprocessor EPDF\\mathsf{EPDF} Pfair algorithm.",
            "Guest Editorial.",
            "Sensitivity analysis for fixed-priority real-time systems.",
            "Sensitivity analysis of complex embedded real-time systems.",
            "Reactive speed control in temperature-constrained real-time systems.",
            "Non-migratory feasibility and migratory schedulability analysis of multiprocessor real-time systems.",
            "Task reweighting under global scheduling on multiprocessors.",
            "An implicit GTS allocation mechanism in IEEE 802.15.4 for time-sensitive wireless sensor networks: theory and practice.",
            "Timing analysis of the FlexRay communication protocol.",
            "Hierarchical control of multiple resources in distributed real-time and embedded systems.",
            "Symbolic quality control for multimedia applications.",
            "Quantifying and suppressing the measurement disturbance in feedback controlled real-time systems.",
            "Efficient implementation of tight response-times for tasks with offsets.",
            "M-CASH: A real-time resource reclaiming algorithm for multiprocessor platforms.",
            "A constant-time dynamic storage allocator for real-time systems.",
            "Stochastic analysis of real-time systems under preemptive priority-driven scheduling.",
            "On earliest deadline first scheduling for temporal consistency maintenance.",
            "Guest Editorial: special issue on the Euromicro Conference on Real-Time Systems (ECRTS 2007).",
            "Flexible hard real-time scheduling for deliberative AI systems.",
            "EDZL scheduling analysis.",
            "Delay composition in preemptive and non-preemptive real-time pipelines.",
            "TDBS: a time division beacon scheduling mechanism for ZigBee cluster-tree wireless sensor networks."
        ]
    },
    {
        "name": "RTS",
        "year": "2007",
        "info": "2007: Volumes\n35, 36, 37",
        "count": 30,
        "papers": [
            "Enforceable component-based realtime contracts.",
            "A statistics-based sensor selection scheme for continuous probabilistic queries in sensor networks.",
            "Implementation of algebraic controllers for non-conventional sampled-data systems.",
            "Analysis of VME-Bus communication protocol - RTCP-net approach.",
            "Analysis of window-constrained execution time systems.",
            "Guaranteeing Response Times for Aperiodic Tasks in Global Multiprocessor Scheduling.",
            "Distributed simulation of modular time Petri nets: An approach and a case study exploiting temporal uncertainty.",
            "Modeling distributed real-time applications with specification PEARL.",
            "Experimental evaluation of linear time-invariant models for feedback performance control in real-time systems.",
            "Controller Area Network (CAN) schedulability analysis: Refuted, revisited and revised.",
            "Editorial.",
            "Garbage collection-aware utility accrual scheduling.",
            "On scheduling garbage collector in dynamic real-time systems with statistical timing assurances.",
            "Schedulable garbage collection in CLI virtual execution system.",
            "A middleware model supporting time-triggered message-triggered objects for standard Linux systems.",
            "An integrated architecture for future car generations.",
            "Specification and analysis of timing requirements for real-time systems in the CBD approach.",
            "Predictable real-time software synthesis.",
            "The partitioned dynamic-priority scheduling of sporadic task systems.",
            "Search and track coordination in multi-ship multi-radar systems using schedulability envelope.",
            "Scoped types and aspects for real-time Java memory management.",
            "Implementation and analysis of real-time communication protocol compositions.",
            "Dynamic voltage scaling under EDF revisited.",
            "Timing predictability of cache replacement policies.",
            "Rate monotonic schedulability tests using period-dependent conditions.",
            "Cost enforcement in the real-time specification for Java.",
            "Editorial: Special issue on real-time wireless sensor networks.",
            "FireFly: a cross-layer platform for real-time embedded wireless networks.",
            "Real-time scheduling for energy harvesting sensor nodes.",
            "Robust and timely communication over highly dynamic sensor networks."
        ]
    },
    {
        "name": "RTS",
        "year": "2006",
        "info": "2006: Volumes\n32, 33, 34",
        "count": 30,
        "papers": [
            "Editorial.",
            "The Non-preemptive Scheduling of Periodic Tasks upon Multiprocessors.",
            "Dynamic Real-time Scheduling of Firm Periodic Tasks with Hard and Soft Aperiodic Tasks.",
            "An Analysis of Fixed-Priority Schedulability on a Multiprocessor.",
            "A Method for Computing the Number of Iterations in Data Dependent Loops.",
            "Modular Design of Real-Time Systems Using Hierarchical Communicating Real-time State Machines.",
            "Group-Based Pfair Scheduling.",
            "Guest Editorial: Introduction to the Special Issue.",
            "Scalable Online Feasibility Tests for Admission Control in a Java Real-Time System.",
            "A Non-Blocking Buffer Mechanism for Real-Time Event Message Communication.",
            "The TTA's Approach to Resilience after Transient Upsets.",
            "A Dynamic Shadow Approach to Fault-Tolerant Mobile Agents in an Autonomic Environment.",
            "Code Analysis for Temporal Predictability.",
            "Real-Time Camera Tracking for Mobile Devices: The VisiTrack System.",
            "Editorial.",
            "Integrated QoS-aware resource management and scheduling with multi-resource constraints.",
            "Finite-horizon scheduling of radar dwells with online template construction.",
            "Verifying distributed real-time properties of embedded systems via graph transformations and model checking.",
            "A framework for modular analysis and exploration of heterogeneous embedded systems.",
            "Combination of clock-state and clock-rate correction in fault-tolerant distributed systems.",
            "LyraNET: A zero-copy TCP/IP protocol stack for embedded systems.",
            "Q-SCA: Incorporating QoS support into software communications architecture for SDR waveform processing.",
            "Applying pinwheel scheduling and compiler profiling for power-aware real-time scheduling.",
            "Real-time arithmetic unit.",
            "Scheduling real-time requests in on-demand data broadcast environments.",
            "Resource access control for dynamic priority distributed real-time systems.",
            "Improving WCET by applying worst-case path optimizations.",
            "Approximation algorithms for scheduling real-time jobs with multiple feasible intervals.",
            "Approximation algorithm for periodic real-time tasks with workload-dependent running-time functions.",
            "Modeling out-of-order processors for WCET analysis."
        ]
    },
    {
        "name": "RTS",
        "year": "2005",
        "info": "2005: Volumes\n29, 30, 31",
        "count": 25,
        "papers": [
            "Rate Monotonic vs. EDF: Judgment Day.",
            "Modeling Control Speculation for Timing Analysis.",
            "On the Dynamic Semantics and the Timing Behavior of Ravenscar Kernels.",
            "Editorial.",
            "Integrated Adaptive QoS Management in Middleware: A Case Study.",
            "QoS Management Through Adaptive Reservations.",
            "Radio-Triggered Wake-Up for Wireless Sensor Networks.",
            "Global Control of Robotic Highway Safety Markers: A Real-time Solution.",
            "Quantitative Characterization of Event Streams in Analysis of Hard Real-Time Applications.",
            "String Matching Over Compressed Text on Handheld Devices Using Tagged Sub-Optimal Code (TSC).",
            "A Real-Time Image Recognition System for Tiny Autonomous Mobile Robots.",
            "Dynamic Voltage Scaling for Digital Control System Implementation.",
            "CCMPerf: A Benchmarking Tool for CORBA Component Model Implementations.",
            "Guest Editorial.",
            "QoS Control Strategies for High-Quality Video Processing.",
            "Design, Implementation and Evaluation of a Real-Time Active Content Distribution Service.",
            "Timing Analysis of Real-Time Communication Under Electromagnetic Interference.",
            "Pre-Scheduling.",
            "Feasibility Analysis of Real-Time Periodic Tasks with Offsets.",
            "Measuring the Performance of Schedulability Tests.",
            "Integrating On-Line Performance Visualization and Real-Time System Design.",
            "A Technique for Adaptive Scheduling of Soft Real-Time Tasks.",
            "A QoS-Enabled Transmission Scheme for MPEG Video Streaming.",
            "Maximizing the Robustness of TDMA Networks with Applications to TTP/C.",
            "Feedback EDF Scheduling of Real-Time Tasks Exploiting Dynamic Voltage Scaling."
        ]
    },
    {
        "name": "RTS",
        "year": "2004",
        "info": "2004: Volumes\n26, 27, 28",
        "count": 35,
        "papers": [
            "Editorial.",
            "Guest Editorial.",
            "The Distributed Time-Triggered Simulation Scheme: Core Principles and Supporting Execution Engine.",
            "An Adaptive Middleware for Context-Sensitive Communications for Real-Time Applications in Ubiquitous Computing Environments.",
            "Memory Management for Real-Time Java: An Efficient Solution using Hardware Support.",
            "Real-Time Garbage Collection for a Multithreaded Java Microcontroller.",
            "Integrating Data Flow Equations with UML/Realtime.",
            "Modeling Complex Real-Time and Embedded Systems-The UML and DORIS Combination.",
            "Mode Change Protocols for Real-Time Systems: A Survey and a New Proposal.",
            "Probabilistic Schedulability Analysis of Harmonic Multi-Task Systems with Dual-Modular Temporal Redundancy.",
            "Design of H2 Controllers for Sampled-Data Systems with Input Time Delays.",
            "Replication Management in Reliable Real-Time Systems.",
            "Schedulability-Driven Communication Synthesis for Time Triggered Embedded Systems.",
            "Guest Editorial: Special Issue for Applications of Intelligent Real-Time Systems for Nuclear Engineering.",
            "Uncertainty Analysis of Memory Based Sensor Validation Techniques.",
            "Redundant Sensor Calibration Monitoring Using Independent Component Analysis and Principal Component Analysis.",
            "Classification of Steam Generator Tube Defects for Real-Time Applications Using Eddy Current Test Data and Self-Organizing Maps.",
            "A Real-Time Artificially Intelligent Monitoring System for Nuclear Power Plants Operators Support.",
            "Enhancing Cross-Correlation Analysis with Artificial Neural Networks for Nuclear Power Plant Feedwater Flow Measurement.",
            "Diagnostics and Surveillance Methods in Nuclear Systems for Real-Time Applications.",
            "Resource Reservation in Dynamic Real-Time Systems.",
            "A Model for Updating Real-Time Applications.",
            "Using Program Transformations to Provide Safety Properties for Real-Time Systems.",
            "A Task Model to Reduce Control Delays.",
            "Scheduling Value-Based Nested Transactions in Distributed Real-Time Database Systems.",
            "Hard Real-Time Communication with the Timed Token Protocol: Current State and Challenging Problems.",
            "Online QoS Optimization Using Service Classes in Surveillance Radar Systems.",
            "Utilization Bounds for EDF Scheduling on Real-Time Multiprocessor Systems.",
            "Specification and Timing Analysis of Real-Time Systems.",
            "Editorial Special Anniversary Issue.",
            "Real Time Scheduling Theory: A Historical Perspective.",
            "Design for Timing Predictability.",
            "Real-Time Databases and Data Services.",
            "Licensing Reliable Embedded Software for Safety-Critical Applications.",
            "Real-Time Operating Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "2003",
        "info": "2003: Volumes\n24, 25",
        "count": 23,
        "papers": [
            "Utilization Bounds for Multiprocessor Rate-Monotonic Scheduling.",
            "A Ravenscar-Compliant Run-time Kernel for Safety-Critical Systems.",
            "Real-Time Atomic Multicast Algorithms Implemented on a Shared Memory Multiprocessor.",
            "Dynamic- and Static-priority Scheduling of Recurring Real-time Tasks.",
            "How to Verify a Safe Real-Time System: The Application of Model Checking and Timed Automata to the Production Cell Case Study.",
            "On the Scheduling of Flexible and Reliable Real-Time Control Systems.",
            "Utilization-Based Admission Control for Scalable Real-Time Communication.",
            "Fail-Awareness: An Approach to Construct Fail-Safe Systems.",
            "Scheduling of Offset Free Systems.",
            "Integrating Schedulability Analysis and Design Techniques in SD.",
            "Voltage-Clock Scaling for Low Energy Consumption in Fixed-Priority Real-Time Systems.",
            "Evaluating the Expressive Power of the Real-Time Specification for Java.",
            "An Integrated Approach to Scheduling in Safety-Critical Embedded Control Systems.",
            "Dual-Priority versus Background Scheduling: A Path-Wise Comparison.",
            "Response Time Driven Scheduling for Programmable Logic Controllers with Network-Based I/O Systems.",
            "Integrated End-to-End Delay Analysis for Regulated ATM Networks.",
            "Response Time Analysis of Asynchronous Real-Time Systems.",
            "Multicycle Polling Scheduling Algorithms for FieldBus Networks.",
            "Priority-Driven Scheduling of Periodic Task Systems on Multiprocessors.",
            "Burst Mode Bandwidth Allocation for Real-Time Messages in IEEE 802.12 Networks.",
            "Reactive and Real-Time Systems Course: How to Get the Most Out of it.",
            "Compact Data Structures and State-Space Reduction for Model-Checking Real-Time Systems.",
            "The Valid Use of Utility in Adaptive Real-Time Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "2002",
        "info": "2002: Volumes\n22, 23",
        "count": 21,
        "papers": [
            "Introduction to the Special Issue on Flexible Scheduling.",
            "Cello: A Disk Scheduling Framework for Next Generation Operating Systems.",
            "Multiple Servers and Capacity Sharing for Implementing Flexible Scheduling.",
            "Flexible Soft Real-Time Processing in Middleware.",
            "Integrating Priority with Share in the Priority-Based Weighted Fair Queuing Scheduler for Real-Time Networks.",
            "Flexible Real-Time Linux*: A Flexible Hard Real-Time Environment.",
            "Data-Flow Frameworks for Worst-Case Execution Time Analysis.",
            "Communication Response Time in P-NET Networks: Worst-Case Analysis Considering the Actual Token Utilization.",
            "Testing the Schedulability of Synchronous Traffic for the Timed Token Medium Access Control Protocol.",
            "Guest Editorial.",
            "Adaptive Workload Management through Elastic Scheduling.",
            "Feedback-Feedforward Scheduling of Control Tasks.",
            "Scheduler Modeling Based on the Controller Synthesis Paradigm.",
            "Feedback Control Real-Time Scheduling: Framework, Modeling, and Algorithms.",
            "Using Control Theory to Achieve Service Level Objectives In Performance Management.",
            "Specification, Mapping and Control for QoS Adaptation.",
            "Real-Time Supervisory Control of a Processor for Non-Preemptive Execution of Periodic Tasks.",
            "Analysis of Worst Case DMA Response Time in a Fixed-Priority Bus Arbitration Protocol.",
            "Robust Adaptive Metrics for Deadline Assignment in Distributed Hard Real-Time Systems.",
            "Utilization Based Schedulability Bounds for Age Constraint Process Sets in Real-Time Systems.",
            "A Computation Method for Providing Statistical Performance Guarantee to an ATM Switch."
        ]
    },
    {
        "name": "RTS",
        "year": "2001",
        "info": "2001: Volumes\n20, 21",
        "count": 23,
        "papers": [
            "Improving the Accuracy of Scheduling Analysis Applied to Distributed Systems Computing Minimal Response Times and Reducing Jitter.",
            "Extending the SCR Method for Real-Time Systems.",
            "Dynamic Scheduling and Fault-Tolerance: Specification and Verification.",
            "Analysis of Checkpointing for Real-Time Systems.",
            "Challenges in Design and Implementation of Middlewares for Real-Time Systems: Guest Editor's Introduction.",
            "The Design and Performance of a Real-Time CORBA Scheduling Service.",
            "Scheduling and Priority Mapping for Static Real-Time Middleware.",
            "Resource Management Middleware for Dynamic, Dependable Real-Time Systems.",
            "Real-Time Reactions in Supervisory Control According to Data Freshness.",
            "Enhancing O-O Middleware to Become Time-Aware.",
            "Optimal Real-Time Scheduling with Minimal Rejections and Minimal Finishing Time.",
            "Scheduling Messages with Earliest Deadline Techniques.",
            "Application of Partial-Order Methods to Reactive Programs with Event Memorization.",
            "Synergos-Synergetic Vision Research.",
            "Archictecture and Performance of Java-Based Distributed Object Models: CORBA vs RMI.",
            "Software Architectures for Reducing Priority Inversion and Non-determinism in Real-time Object Request Brokers.",
            "Visual Keyword Image Retrieval Based on Synergetic Neural Network for Web-Based Image Search.",
            "Object Caching and Prefetching in Distributed Virtual Walkthrough.",
            "Towards a Mobile Code Management Environment for Complex, Real-Time, Distributed Systems.",
            "Trade-Off Analysis of Real-Time Control Performance and Schedulability.",
            "Implementation of Adaptive Fuzzy Control for a Real-Time Control Demo-Model.",
            "A Comparison of Static Analysis and Evolutionary Testing for the Verification of Timing Constraints.",
            "Quality of Service Support for Multimedia Applications in Third Generation Mobile Networks Using Adaptive Scheduling."
        ]
    },
    {
        "name": "RTS",
        "year": "2000",
        "info": "2000: Volumes\n18, 19",
        "count": 29,
        "papers": [
            "Editorial.",
            "Priority Scheduling Versus Pre-Run-Time Scheduling.",
            "A Network Time Interface M-Module for Distributing GPS-Time over LANs.",
            "Measuring the Performance of Real-Time Systems.",
            "Critical Issues in Object-Oriented Real-Time Systems - A Guided Panel Discussion.",
            "A Case For Object-Oriented Real-Time Systems (OORTS).",
            "Object Orientation vs. Real-Time Systems - Response to Alan C. Shaw's Contribution.",
            "Real-Time Object-Oriented Design and Formal Methods.",
            "Can Formal Methods be Integrated into Real-Time Object-Oriented Design? Response to J. de la Puente's Contribution.",
            "Are Object-Oriented Concepts Useful to Real-Time Systems Development?",
            "Object Oriented Design for Real-Time Systems-Response to C. E. Pereira's Contribution.",
            "Guest Editorial: A Review of Worst-Case Execution-Time Analysis.",
            "Supporting Timing Analysis by Automatic Bounding of Loop Iterations.",
            "Fast and Precise WCET Prediction by Separated Cache and Path Analyses.",
            "Symbolic Cache Analysis for Real-Time Systems.",
            "Timing Analysis for Instruction Caches.",
            "Worst Case Execution Time Analysis for a Processor with Branch Prediction.",
            "WCET Analysis of Superscalar Processors Using Simulation With Coloured Petri Nets.",
            "Dynamic Dispatching of Cyclic Real-Time Tasks with Relative Timing Constraints.",
            "A Codesign Approach to Real-time High Precision Control.",
            "An Approach to Platform Independent Real-Time Programming: (1) Formal Description.",
            "An Approach to Platform Independent Real-Time Programming: (2) Practical Application.",
            "A Software-Reuse Approach to Build Monitor Programs for Soft Real-Time Applications.",
            "Real-Time Disk Scheduling for Multimedia Applications with Deadline-Modification-Scan Scheme.",
            "Transaction Scheduling in Distributed Real-Time Systems.",
            "Real-Time Database Systems in the New Millenium.",
            "Triggered Updates for Temporal Consistency in Real-Time Databases.",
            "Real-Time Access Control and Reservation on B-Tree Indexed Data.",
            "Improving Predictability of Transaction Execution Times in Real-time Databases."
        ]
    },
    {
        "name": "RTS",
        "year": "1999",
        "info": "1999: Volumes\n16, 17",
        "count": 21,
        "papers": [
            "An Optimal Value-Based Admission Policy and its Reflective Use in Real-Time Systems.",
            "Priority Scheduling of Transactions in Distributed Real-Time Databases.",
            "Real-Time Performance of Sorting Algorithms.",
            "Procedure-Level Verification of Real-time Concurrent Systems.",
            "ARMADA Middleware and Communication Services.",
            "An Open Environment for Real-Time Applications.",
            "On Developing Distributed Middleware Services for QoS- and Criticality-Based Resource Negotiation and Adaptation.",
            "The Spring System: Integrated Support for Complex Real-Time Systems.",
            "Expressing and Enforcing Timing Constraints in a Dynamic Real-Time CORBA System.",
            "To Schedule or to Execute: Decision Support and Performance Implications.",
            "Generalized Multiframe Tasks.",
            "Non-Preemptive Real-Time Scheduling of Multimedia Tasks.",
            "Experimental Assessment of the Period Calibration Method: A Case Study.",
            "Stabilizing Pre-Run-Time Schedules With the Help of Grace Time.",
            "The EDL Server for Scheduling Periodic and Soft Aperiodic Tasks with Resource Constraints.",
            "Timing Analysis and Validation for Real-Time Systems - Guest Editor's Introduction.",
            "Efficient and Precise Cache Behavior Prediction for Real-Time Systems.",
            "An Integrated Path and Timing Analysis Method based on Cycle-Level Symbolic Execution.",
            "Timing Analysis for Data and Wrap-Around Fill Caches.",
            "Cache Aware Pre-Runtime Scheduling.",
            "Cache-Conscious Limited Preemptive Scheduling."
        ]
    },
    {
        "name": "RTS",
        "year": "1998",
        "info": "1998: Volumes\n14, 15",
        "count": 27,
        "papers": [
            "Editorial.",
            "Reengineering a Single Threaded Embedded Missile Application onto a Parallel Processing Platform Using MetaH.",
            "Techniques for LAN Performance Analysis in a Real-Time Environment.",
            "User-level Real-Time Network System on Microkernel-based Operating Systems.",
            "Real-Time Schedulability Tests for Preemptive Multitasking.",
            "Automated Meta-Control for Adaptable Real-Time Software.",
            "Real-Time Transaction Scheduling: A Framework for Synthesizing Static and Dynamic Factors.",
            "A Feasibility Decision Algorithm for Rate Monotonic and Deadline Monotonic Scheduling.",
            "Decomposition in Real-Time Safety-Critical Systems.",
            "Editorial.",
            "Fundamentals of Implementing Real-Time Control Applications in Distributed Computer Systems.",
            "Design and Programming Tools for Time Critical Applications.",
            "Rapid Prototyping of Real-Time Information Processing Units for Mechatronic Systems.",
            "Implementation of Hard Real-Time Embedded Control Systems.",
            "HEDRA: Heterogeneous Distributed Real-Time Architecture.",
            "Open Embedded Control.",
            "Stability and Performance of List Scheduling With External Process Delays.",
            "A New Approach for Scheduling of Parallelizable Tasks in Real-Time Multiprocessor Systems.",
            "How to Implement a Safe Real-Time System: The OBSERV Implementation of the Production Cell Case Study.",
            "The Slack Method: A New Method for Static Allocation of Hard Real-Time Tasks.",
            "Low-Power Design for Real-Time Systems.",
            "Fault-Tolerant Rate-Monotonic Scheduling.",
            "Utilization Bounds for N-Processor Rate Monotone Scheduling with Static Processor Assignment.",
            "A Process Algebraic Approach to the Schedulability Analysis of Real-Time Systems.",
            "Cashing in on Caching: An Architecture for Time-Bounded Knowledge-Based Problem Solving.",
            "Criticality- and QoS-Based Multiresource Negotiation and Adaptation.",
            "Verifying Timing Constraints of Real-Time Systems by Means of Evolutionary Testing."
        ]
    },
    {
        "name": "RTS",
        "year": "1997",
        "info": "1997: Volumes\n12, 13",
        "count": 23,
        "papers": [
            "Global Positioning System (GPS) Time Dissemination for Real-Time Applications.",
            "Terrestrial Time Signal Dissemination.",
            "GPS-based Clock Synchronization in a Mobile, Distributed Real-Time System.",
            "High Accuracy Concurrent Event Processing in Hard Real-Time Systems.",
            "Possible and Impossible Self-Stabilizing Digital Clock Synchronization in General Graphs.",
            "Integrating External and Internal Clock Synchronization.",
            "Interval-based Clock Synchronization.",
            "CesiumSpray: a Precise and Accurate Global Time Service for Large-scale Systems.",
            "Specification and Implementation of the Universal Time Coordinated Synchronization Unit (UTCSU).",
            "Report Dagstuhl Seminar on Time Services, Schloß Dagstuhl, March 11-15, 1996.",
            "A Traffic Generator for Testing Communication Systems: Presentation, Implementation and Performance.",
            "Implementing a Probabilistic Clock Synchronization Algorithm.",
            "Threaded Prefetching: A New Instruction Memory Hierarchy for Real-Time Systems.",
            "Computing Maximum Task Execution Times - A Graph-Based Approach.",
            "The Non-Optimality of the Monotonic Priority Assignments for Hard Real-Time Offset Free Systems.",
            "Presto - A System Environment for Mission-Critical Multimedia Applications.",
            "On Using Real-Time Static Locking Protocols for Distributed Real-Time Databases.",
            "A Heuristic Approach to the Multitask-Multiprocessor Assignment Problem using the Empty-Slots Method and Rate Monotonic Scheduling.",
            "Editorial.",
            "A Systematic Approach to the Petri Net Based Specification of Concurrent Systems.",
            "A Highly Dependable Computing Architecture for Safety-Critical Control Applications.",
            "The ProCoS Approach to Correct Systems.",
            "Building Large, Complex, Distributed Safety-Critical Operating Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "1996",
        "info": "1996: Volumes\n10, 11",
        "count": 24,
        "papers": [
            "A Formal Approach to the Specification and the Behavior Validation of Real-Time Systems Based on Rewriting Logic.",
            "Algorithms and Optimality of Scheduling Soft Aperiodic Requests in Fixed-Priority Preemptive Systems.",
            "Causal Delivery Protocols in Real-time Systems: A Generic Model.",
            "Real-Time Communication in FDDI Networks.",
            "Quantitative Analysis of Hardware Support for Real-Time Operating Systems.",
            "Specification and Verification of Reactive System Behaviour: The Railroad Crossing Example.",
            "Scheduling Aperiodic Tasks in Dynamic Priority Systems.",
            "Predictability of a RTX2000-based Implementation.",
            "Causal Delivery of Messages with Real-Time Data in Unreliable Networks.",
            "Towards a Stable Earliest Deadline Scheduling Algorithm.",
            "A Scheduling Algorithm for Tasks Described by Time Value Function.",
            "A Synthetic Workload for a Distributed Real-time System.",
            "Improvement in Feasibility Testing for Real-Time Tasks.",
            "Least Suffering Strategy in Distributed Real-Time Programming Language DROL.",
            "A Compact Task Graph Representation for Real-Time Scheduling.",
            "Worst-Case Space and Time Complexity of Recursive Procedures.",
            "Combining Static Worst-Case Timing Analysis and Program Proof.",
            "Task Behavior Monitoring for Adaptive Real-Time Communication.",
            "Invited Note: Java for Real-Time.",
            "Preface to the Special Issue on \"The Engineering of Complex Real-Time Computer Control Systems\".",
            "BASEMENT: A Distributed Real-Time Architecture for Vehicle Applications.",
            "A Description Language for Engineering of Complex Real-Time Systems.",
            "A Real-Time Self-Tuning Web Tension Regulation Scheme.",
            "Application of the Genetic Algorithm to Real-Time Active Noise Control."
        ]
    },
    {
        "name": "RTS",
        "year": "1994",
        "info": "1994: Volumes\n8, 9",
        "count": 18,
        "papers": [
            "A Model for Scheduling of Object-Based, Distributed Real-Time Systems.",
            "Hard Real-Time Communication in Multiple-Access Networks.",
            "Real-time Fault Tolerant Operation of the 802.5 Token Ring.",
            "Tools for Specifying Real-Time Systems.",
            "Fixed Priority Pre-emptive Scheduling: An Historical Perspective.",
            "An Historical Survey of Early Real-Time Computing Developments in the U.S.",
            "A History of Real-Time Industrial Process Control in the Dutch Steel-Making Industry.",
            "Report of the First European Dependable Computing Conference EDCC-1.",
            "Increasing Processor Utilization in Hard-Real-Time Systems with Checkpoints.",
            "Aperiodic Servers in a Deadline Scheduling Environment.",
            "Analytic Evaluation of Contention Protocols Used in Distributed Real-Time Systems.",
            "Formal Specification and Compositional Verification of an Atomic Broadcast Protocol.",
            "Analysis of Hard Real-Time Communications.",
            "Support Software for the Development of Programmable Logic Controller Applications.",
            "Allocating Fixed-Priority Periodic Tasks on Multiprocessor Systems.",
            "Analysis of Railway Stations by Means of Interval Timed Coloured Petri Nets.",
            "On Tasks Synchronization with the MMS Protocol.",
            "Fast Heuristic Scheduling Based on Neural Networks for Real-Time Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "1994",
        "info": "1994: Volumes\n6, 7",
        "count": 24,
        "papers": [
            "A Decomposition Approach to Non-Preemptive Real-Time Scheduling.",
            "Mutliprocessor Task Scheduling with Resource Requirements.",
            "Scheduling Customers in a Non-Removal Real-time System with an Application to Disk Scheduling.",
            "HRT-HOOD: A Structured Design Method for Hard Real-Time Systems.",
            "An Extendible Approach for Analyzing Fixed Priority Hard Real-Time Tasks.",
            "Real-Time Software Specification and Validation with Transnet.",
            "Compositional Verification of a Distributed Real-Time Arbitration Protocol.",
            "Dynamic Priority Scheduling of Periodic and Aperiodic Tasks in Hard Real-time Systems.",
            "Temporal Modeling of Real-Time Communication Protocols Based on a Process/Channel Approach.",
            "An Architecture for Real-Time Distributed Artificial Intelligent Systems.",
            "Replica Determinism in Distributed Real-Time Systems: A Brief Survey.",
            "A Survey of Research in Deliberative Real-Time Artificial Intelligence.",
            "Conventional and Early Token Release Scheduling Models for the IEEE 802.5 Taken Ring.",
            "Monitoring Distributed Real-Times.",
            "Formal Timing Analysis for Distributed Real-Time Programs.",
            "Ordering and Timeliness Requirements of Dependable Real-Time Programs.",
            "Fundamental Issues in Testing Distributed Real-Time Systems.",
            "A Retargetable Technique for Predicting Execution Time of Code Segments.",
            "Schedulability-Analyzable Exception Handling for Fault-Tolerant Real-Time Languages.",
            "Scheduling Algorithms for Fault-Tolerance in Hard-Real-Time Systems.",
            "Runtime Monitoring of Timing Constraints in Distributed Real-Time Systems.",
            "Automated Verification of Responsive Protocols Modeled by Extended Finite State Machines.",
            "Compositional Reasoning about Responsive Systems with Limited Resources.",
            "Enhancing Fault-Tolerance in Rate-Monotonic Scheduling."
        ]
    },
    {
        "name": "RTS",
        "year": "1993",
        "info": "1993: Volume\n5",
        "count": 17,
        "papers": [
            "Introduction: Real-Time Language and Language-Level Timing Tools and Analysis.",
            "A Partial Evaluator for the Maruti Hard Real-Time System.",
            "Predicting Program Execution Times by Analyzing Static and Dynamic Program Paths.",
            "RTC: Language Support for Real-Time Concurrency.",
            "Timing Analysis of MRL: A Real-Time Rule-Based System.",
            "Guest Introduction: The IPTES Project.",
            "IPTES: A Concurrent Engineering Approach for Real-Time Software Development.",
            "The IPTES Environment: Support for Incremental Heterogeneous and Distributed Prototyping.",
            "Graphical Animation as a Form of Prototyping Real-Time Software Systems.",
            "An Executable Subset of VDM-SL, in an SA/RT Framework.",
            "Distributed Execution of Specifications.",
            "High-Level Timed Petri Nets as a Kernel for Executable Specifications.",
            "Giving Semantics to SA/RT by Means of High-Level Times Petri Nets.",
            "A Formalization of Priority Inversion.",
            "Deadlock Prevention in Concurrent Real-Time Systems.",
            "Pipelined Processors and Worst Case Execution Times.",
            "A Comparison of Four Microcomputer Operating Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "1992",
        "info": "1992: Volume\n4",
        "count": 17,
        "papers": [
            "A Verifier for Real-Time Properties.",
            "Software Architecture for Hard Real-Time Applications: Cyclic Executives vs. Fixed Priority Executives.",
            "Cy-Clone: An Approach to the Engineering of Resource Adequate Cyclic Real-Time Systems.",
            "Workshop Report: 1991 Workshop on Architectural Aspects of Real-Time Systems, San Antonio, Texas, U. S. A..",
            "An Improved Hard Real-Time Scheduling for the IEEE 802.5.",
            "Handling Real-Time Communication Constraints in a Mobile Station used for the Pan European Digital Mobile Communication Network.",
            "On the Competitiveness of On-Line Real-Time Task Scheduling.",
            "Allocating Hard Real-Time tasks: An NP-Hard Problem Made Easy.",
            "Conference Announcement: NATO Study Institute (ASI) on Real-Time Computing.",
            "Issues in Real-Time Data Management.",
            "Data Access Scheduling in Firm Real-Time Database Systems.",
            "Priority Inheritance in Soft Real-Time Databases.",
            "Hybrid Protocols Using Dynamic Adjustment of serialization Order for Real-Time Concurrency Control.",
            "Modeling and Evaluating the Feasibility of Timing Constraints Under Different Real-time scheduling Algorithms.",
            "Polynomial-Time Transformations and Schedulability Analysis of Parallel Real-Time Programs with Restricted Resource Contention.",
            "Quantitative Temporal Reasoning.",
            "Hartstone Uniprocessor Benchmark: Definitions and Experiments for Real-Time Systems."
        ]
    },
    {
        "name": "RTS",
        "year": "1991",
        "info": "1991: Volume\n3",
        "count": 17,
        "papers": [
            "Maintaining Global Time in Futurebus+.",
            "Priority Inheritance and Message Passing Communication: A Formal Treatment.",
            "global Cyclic Scheduling: A Method to Guarantee the Timing Behavior of Distributed Real-Time Systems.",
            "Stack-based Scheduling of Realtime Processes.",
            "Guest Introduction: Some Italian Research on Real-Time Systems.",
            "A Local Area Network Architecture for Communication in Distributed Real-Time Systems.",
            "A Hierarchical Approach to Systems with Heterogeneous Real-Time Requirements.",
            "Timed High-Level Nets.",
            "Dealing with Different Time Granularities in Formal Specifications of Real-Time Systems.",
            "A Static Scheduling Algorithm for Distributed Real-Time Systems.",
            "A Study on the timeliness Property in Real-Time Systems.",
            "Guaranteed Task Deadlines for Fault-Tolerant Workloads with Conditional Branches.",
            "Performance Evaluation of Two New Disk Scheduling algorithms for Real-Time Systems.",
            "Criticality and Utility in the Next Generation.",
            "Time Capsules: An Abstraction for Access to Continuous-Media Data.",
            "Real-Time Concurrent C: A Language for Programming Dynamic Real-Time Systems.",
            "A Temporal Logic-Based Model of Event-Driven Nets."
        ]
    },
    {
        "name": "RTS",
        "year": "1990",
        "info": "1990: Volume\n2",
        "count": 16,
        "papers": [
            "Depth-Limited Search for Real-Time Problem Solving.",
            "Time-Constrained Reasoning Under Uncertainty.",
            "Extending a Blackboard Architecture for Approximate Processing.",
            "Addressing Real-Time Constraints in the Design of Autonomous Agents.",
            "Architectural Foundations for Real-Time Performance in Intelligent Agents.",
            "Concepts, Methods, and Languages for Building Timely Intelligent Systems.",
            "Predictable Synchronization Mechanisms for Multiprocessor Real-Time Systems.",
            "Dynamic Scheduling of Real-Time Tasks under Precedence Constraints.",
            "Synchronous Atomic Broadcast for Redundant Broadcast Channels.",
            "RIMMS - An OSI-based Real-Time Messaging System.",
            "Editorial: What is Predictability for Real-Time Systems?",
            "Specifying Real-Time Properties with Metric Temporal Logic.",
            "Algorithms and Complexity Concerning the Preemptive Scheduling of Periodic, Real-Time Tasks on One Processor.",
            "Dynamic Priority Ceilings: A Concurrency Control Protocol for Real-Time.",
            "MELODY: A Completely Decentralized Adaptive File System for Handling Real-Time Tasks in Unpredictable Environments.",
            "Comparative Evaluation of High-Level Real-Time Programming Languages."
        ]
    },
    {
        "name": "RTS",
        "year": "1989",
        "info": "1989: Volume\n1",
        "count": 16,
        "papers": [
            "The Cyclic Executive Model and Ada.",
            "Aperiodic Task Scheduling for Hard Real-Time Systems.",
            "Forecasting Real-Time Behavior During Software Design using a CASE Environment.",
            "Feasible Processor Allocation in a Hard-Real-Time Environment.",
            "The OR Dataflow Architecture for a Machine Embedded Control System.",
            "Responsive, Deterministic IEEE 802.5 Token Ring Scheduling.",
            "Calculating the Maximum Execution Time of Real-Time Programs.",
            "On the Efficiency of Cautious Schedulers for Database Concurrency Control - Why Insist on Two-Phase Locking?",
            "Fast Sensor Corrections of Robot Motion Paths Processed in Real-Time by Control Algorithms Running in Parallel.",
            "Analysis of Real-Time Properties and Rules for Setting Protocol Parameters of MAP Networks.",
            "Mode Change Protocols for Priority-Driven Preemptive Scheduling.",
            "Preemptive Scheduling with Release Times and Deadlines.",
            "Real-Time Control Software for Transaction Processing Based on Colored Safe Petri Net Model.",
            "An Application of Structural Modeling and Automated Reasoning to Real-Time Systems Design.",
            "Dataflow Computer Extension Towards Real-Time Processing.",
            "Programmable Real-Time Scheduler Using a Neurocomputer."
        ]
    }
]