[
    {
        "year": "2021",
        "name": "SIGMETRICS 2021",
        "info": "Virtual Event, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2021",
                "sub_name": "SIGMETRICS '21: ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, Virtual Event, China, June 14-18, 2021.",
                "count": 41,
                "papers": [
                    "Opening the Black Box of Deep Learning: Some Lessons and Take-aways.",
                    "Federated Bandit: A Gossiping Approach.",
                    "Statistically Efficient, Polynomial-Time Algorithms for Combinatorial Semi-Bandits.",
                    "Information Aggregation for Constrained Online Control.",
                    "Online Virtual Machine Allocation with Lifetime and Load Predictions.",
                    "Nudge: Stochastically Improving upon FCFS.",
                    "Zero Queueing for Multi-Server Jobs.",
                    "The Gittins Policy is Nearly Optimal in the M/G/k under Extremely General Conditions.",
                    "Where did my 256 GB go? A Measurement Analysis of Storage Consumption on Smart Mobile Devices.",
                    "A Measurement Study of Wechat Mini-Apps.",
                    "PredictRoute: A Network Path Prediction Toolkit.",
                    "A Look Behind the Curtain: Traffic Classification in an Increasingly Encrypted Web.",
                    "Achieving Zero Asymptotic Queueing Delay for Parallel Jobs.",
                    "Achievable Stability in Redundancy Systems.",
                    "On the Asymptotic Insensitivity of the Supermarket Model in Processor Sharing Systems.",
                    "Refining Mean-field Approximations by Dynamic State Truncation.",
                    "Tracking Counterfeit Cryptocurrency End-to-end.",
                    "SADPonzi: Detecting and Characterizing Ponzi Schemes in Ethereum Smart Contracts.",
                    "adPerf: Characterizing the Performance of Third-party Ads.",
                    "AI for System - Infusing AI into Cloud Computing Systems.",
                    "A Systematic Framework to Identify Violations of Scenario-dependent Driving Rules in Autonomous Vehicle Software.",
                    "SUGAR: Speeding Up GPGPU Application Resilience Estimation with Input Sizing.",
                    "Mix and Match: Reorganizing Tasks for Enhancing Data Locality.",
                    "Optimal Load Balancing with Locality Constraints.",
                    "Load Balancing Under Strict Compatibility Constraints.",
                    "Mean Waiting Time in Large-Scale and Critically Loaded Power of d Load Balancing Systems.",
                    "Improving the Performance of Heterogeneous Data Centers through Redundancy.",
                    "On Private Peering Agreements between Content and Access Providers: A Contractual Equilibrium Analysis.",
                    "I Know What You Bought At Chipotle for $9.81 by Solving A Linear Inverse Problem.",
                    "Dynamic Pricing and Matching for Two-Sided Markets with Strategic Servers.",
                    "Revisiting Modified Greedy Algorithm for Monotone Submodular Maximization with a Knapsack Constraint.",
                    "Approximation Algorithms for Submodular Data Summarization with a Knapsack Constraint.",
                    "Competitive Algorithms for the Online Multiple Knapsack Problem with Application to Electric Vehicle Charging.",
                    "Enabling Intelligent Services at the Network Edge.",
                    "Input-Dynamic Distributed Algorithms for Communication Networks.",
                    "Real-time Approximate Routing for Smart Transit Systems.",
                    "Bregman-style Online Convex Optimization with Energy Harvesting Constraints.",
                    "The Power of D-hops in Matching Power-Law Graphs.",
                    "Chasm in Hegemony: Explaining and Reproducing Disparities in Homophilous Networks.",
                    "Magma: A Ground-Truth Fuzzing Benchmark.",
                    "Stay Connected, Leave no Trace: Enhancing Security and Privacy in WiFi via Obfuscating Radiometric Fingerprints."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "SIGMETRICS 2020",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2020",
                "sub_name": "Abstracts of the 2020 SIGMETRICS/Performance Joint International Conference on Measurement and Modeling of Computer Systems, Boston, MA, USA, June, 8-12, 2020.",
                "count": 55,
                "papers": [
                    "Uniform Loss Algorithms for Online Stochastic Decision-Making With Applications to Bin Packing.",
                    "Online Primal-Dual Mirror Descent under Stochastic Constraints.",
                    "Dynamic Weighted Fairness with Minimal Disruptions.",
                    "Online Linear Optimization with Inventory Management Constraints.",
                    "Online Optimization with Predictions and Non-convex Losses.",
                    "Mechanism Design for Online Resource Allocation: A Unified Approach.",
                    "Predict and Match: Prophet Inequalities with Uncertain Supply.",
                    "Fundamental Limits on the Regret of Online Network-Caching.",
                    "Adaptive Discretization for Episodic Reinforcement Learning in Metric Spaces.",
                    "Staleness Control for Edge Data Analytics.",
                    "Fundamental Limits of Approximate Gradient Coding.",
                    "Forecasting with Alternative Data.",
                    "Fast Dimensional Analysis for Root Cause Investigation in a Large-Scale Service Environment.",
                    "Inferring Streaming Video Quality from Encrypted Traffic: Practical Models and Deployment Experience.",
                    "Social Learning in Multi Agent Multi Armed Bandits.",
                    "Non-Asymptotic Analysis of Monte Carlo Tree Search.",
                    "Heavy-traffic Analysis of the Generalized Switch under Multidimensional State Space Collapse.",
                    "Characterizing Policies with Optimal Response Time Tails under Heavy-Tailed Job Sizes.",
                    "Simple Near-Optimal Scheduling for the M/G/1.",
                    "Delay-Optimal Policies in Partial Fork-Join Systems with Redundancy and Random Slowdowns.",
                    "Mean Field Analysis of Join-Below-Threshold Load Balancing for Resource Sharing Servers.",
                    "Achieving Efficient Routing in Reconfigurable DCNs.",
                    "Fundamental Limits of Volume-based Network DoS Attacks.",
                    "On the Complexity of Traffic Traces and Implications.",
                    "On the Analysis of a Multipartite Entanglement Distribution Switch.",
                    "On Time Synchronization Issues in Time-Sensitive Networks with Regulators and Nonideal Clocks.",
                    "Lancet: Better network resilience by designing for pruned failure sets.",
                    "vrfinder: Finding Outbound Addresses in Traceroute.",
                    "Ludo Hashing: Compact, Fast, and Dynamic Key-value Lookups for Practical Network Systems.",
                    "The Great Internet TCP Congestion Control Census.",
                    "I Know What You Did Last Summer: Network Monitoring using Interval Queries.",
                    "Generalized Sketch Families for Network Traffic Measurement.",
                    "Latency Imbalance Among Internet Load-Balanced Paths: A Cloud-Centric View.",
                    "On the Bottleneck Structure of Congestion-Controlled Networks.",
                    "Characterizing Transnational Internet Performance and the Great Bottleneck of China.",
                    "Stability and Scalability of Blockchain Systems.",
                    "Measuring Membership Privacy on Aggregate Location Time-Series.",
                    "Who Filters the Filters: Understanding the Growth, Usefulness and Efficiency of Crowdsourced Ad Blocking.",
                    "Under the Concealing Surface: Detecting and Understanding Live Webcams in the Wild.",
                    "Your Noise, My Signal: Exploiting Switching Noise for Stealthy Data Exfiltration from Desktop Computers.",
                    "Privacy-Utility Tradeoffs in Routing Cryptocurrency over Payment Channel Networks.",
                    "Understanding (Mis)Behavior on the EOSIO Blockchain.",
                    "Optimal Data Placement for Heterogeneous Cache, Memory, and Storage Systems.",
                    "Set the Configuration for the Heart of the OS: On the Practicality of Operating System Kernel Debloating.",
                    "User-level Threading: Have Your Cake and Eat It Too.",
                    "DSM: A Case for Hardware-Assisted Merging of DRAM Rows with Same Content.",
                    "Centaur: A Novel Architecture for Reliable, Low-Wear, High-Density 3D NAND Storage.",
                    "Rateless Codes for Near-Perfect Load Balancing in Distributed Matrix-Vector Multiplication.",
                    "Logarithmic Communication for Distributed Optimization in Multi-Agent Systems.",
                    "Partial Recovery of Erdős-Rényi Graph Alignment via k-Core Alignment.",
                    "Fiedler Vector Approximation via Interacting Random Walks.",
                    "Third-Party Data Providers Ruin Simple Mechanisms.",
                    "Dynamic Pricing and Matching for Two-Sided Queues.",
                    "Unimodal Bandits with Continuous Arms: Order-optimal Regret without Smoothness.",
                    "Optimal Bidding Strategies for Online Ad Auctions with Overlapping Targeting Criteria."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "SIGMETRICS 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2019",
                "sub_name": "Abstracts of the 2019 SIGMETRICS/Performance Joint International Conference on Measurement and Modeling of Computer Systems, Phoenix, AZ, USA, June 24-28, 2019.",
                "count": 50,
                "papers": [
                    "Collaboratively Learning the Best Option on Graphs, Using Bounded Local Memory.",
                    "Learning Graphs from Noisy Epidemic Cascades.",
                    "Heavy-traffic Delay Optimality in Pull-based Load Balancing Systems: Necessary and Sufficient Conditions.",
                    "Performance Analysis of Workload Dependent Load Balancing Policies.",
                    "Load Balancing Guardrails: Keeping Your Heavy Traffic on the Road to Low Response Times.",
                    "Random Walk Based Sampling for Load Balancing in Multi-Server Systems.",
                    "Network Resilience Assessment via QoS Degradation Metrics: An Algorithmic Approach.",
                    "A TTL-based Approach for Data Aggregation in Geo-distributed Streaming Analytics.",
                    "Retroactive Packet Sampling for Traffic Receipts.",
                    "Inferring Catchment in Internet Routing.",
                    "Crystal Gazer: Profile-Driven Write-Rationing Garbage Collection for Hybrid Memories.",
                    "Architecture-Aware Approximate Computing.",
                    "Quantifying Data Locality in Dynamic Parallelism in GPUs.",
                    "Computing with Near Data.",
                    "Dynamic Pricing of Relocating Resources in Large Networks: Extended Abstract.",
                    "The Segmentation-Thickness Tradeoff in Online Marketplaces.",
                    "On the Value of Look-Ahead in Competitive Online Convex Optimization.",
                    "Competitive Online Optimization under Inventory Constraints.",
                    "Analyzing Location-Based Advertising for Vehicle Service Providers Using Effective Resistances.",
                    "A Structural Result for Personalized PageRank and its Algorithmic Consequences.",
                    "Learning to Control Renewal Processes with Bandit Feedback.",
                    "Efficient Distributed Workload (Re-)Embedding.",
                    "Optimizing the Cost of Executing Mixed Interactive and Batch Workloads on Transient VMs.",
                    "Online Optimization in Cloud Resource Provisioning: Predictions, Regrets, and Algorithms.",
                    "A New Flexible Multi-flow LRU Cache Management Paradigm for Minimizing Misses.",
                    "Axiomatizing Congestion Control.",
                    "Information, Memory and Capacity in Dynamic Resource Allocation.",
                    "mRSC: Multidimensional Robust Synthetic Control.",
                    "A Distributed Algorithm to Calculate Max-Min Fair Rates Without Per-Flow State.",
                    "Global Attraction of ODE-based Mean Field Models with Hyperexponential Job Sizes.",
                    "Hyper-Scalable JSQ with Sparse Feedback.",
                    "Two Extensions of Kingman's GI/G/1 Bound.",
                    "Queue and Loss Distributions in Finite-Buffer Queues.",
                    "Improved Queue-Size Scaling for Input-Queued Switches via Graph Factorization.",
                    "TeksDB: Weaving Data Structures for a High-Performance Key-Value Store.",
                    "PROFET: Modeling System Performance and Energy Without Simulating the CPU.",
                    "HyperBench: A Benchmark Suite for Virtualization Capabilities.",
                    "App in the Middle: Demystify Application Virtualization in Android and its Security Threats.",
                    "Everything You Should Know about Intel SGX Performance on Virtualized Systems.",
                    "QuickStop: A Markov Optimal Stopping Approach for Quickest Misinformation Detection.",
                    "The Bayesian Prophet: A Low-Regret Framework for Online Decision Making.",
                    "Securing Distributed Gradient Descent in High Dimensional Statistical Learning.",
                    "Model Agnostic Time Series Analysis via Matrix Estimation.",
                    "What-If Analysis of Page Load Time in Web Browsers Using Causal Profiling.",
                    "Proactive Caching for Low Access-Delay Services under Uncertain Predictions.",
                    "Understanding the Networking Performance of Wear OS.",
                    "Demystifying Complex Workload-DRAM Interactions: An Experimental Study.",
                    "Non-Markovian Monte Carlo on Directed Graphs.",
                    "Analysis of a Canonical Labeling Algorithm for the Alignment of Correlated Erdős-Rényi Graphs.",
                    "Computationally Efficient Estimation of the Spectral Gap of a Markov Chain."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "SIGMETRICS 2018",
        "info": "Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2018",
                "sub_name": "Abstracts of the 2018 ACM International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS 2018, Irvine, CA, USA, June 18-22, 2018.",
                "count": 59,
                "papers": [
                    "Steady-state Approximations: Achievement Lecture.",
                    "State Dependent Control of Closed Queueing Networks.",
                    "Dandelion++: Lightweight Cryptocurrency Networking with Formal Anonymity Guarantees.",
                    "Bootstrapped Graph Diffusions: Exposing the Power of Nonlinearity.",
                    "The Cost of Uncertainty in Curing Epidemics.",
                    "The Price of Fragmentation in Mobility-on-Demand Services.",
                    "Censored Demand Estimation in Retail.",
                    "New Metrics and Models for a Post-ISA Era: Managing Complexity and Scaling Performance in Heterogeneous Parallelism and Internet-of-Things.",
                    "Delay Scaling in Many-Sources Wireless Networks without Queue State Information.",
                    "Practical Bounds on Optimal Caching with Variable Object Sizes.",
                    "On Resource Pooling and Separation for LRU Caching.",
                    "An Optimal Randomized Online Algorithm for QoS Buffer Management.",
                    "Minimizing Queue Length Regret Under Adversarial Network Models.",
                    "Dynamic Proportional Sharing: A Game-Theoretic Approach.",
                    "SOAP: One Clean Analysis of All Age-Based Scheduling Policies.",
                    "A Whittle's Index Based Approach for QoE Optimization in Wireless Networks.",
                    "Inherent Trade-Offs in Algorithmic Fairness.",
                    "An Optimal Algorithm for Online Non-Convex Learning.",
                    "Asymptotic Optimal Control of Markov-Modulated Restless Bandits.",
                    "Online Learning of Optimally Diverse Rankings.",
                    "Learning Proportionally Fair Allocations with Low Regret.",
                    "Multi-armed Bandit with Additional Observations.",
                    "Online Learning in Weakly Coupled Markov Decision Processes: A Convergence Time Study.",
                    "Hound: Causal Learning for Datacenter-scale Straggler Diagnosis.",
                    "Working Set Size Estimation Techniques in Virtualized Environments: One Size Does not Fit All.",
                    "PreFix: Switch Failure Prediction in Datacenter Networks.",
                    "On Non-Preemptive VM Scheduling in the Cloud.",
                    "Why Some Like It Loud: Timing Power Attacks in Multi-tenant Data Centers Using an Acoustic Side Channel.",
                    "ECI-Cache: A High-Endurance and Cost-Efficient I/O Caching Scheme for Virtualized Platforms.",
                    "Supporting Mobile VR in LTE Networks: How Close Are We?",
                    "Tomographic Node Placement Strategies and the Impact of the Routing Model.",
                    "LTERadar: Towards LTE-Aware Wi-Fi Access Points.",
                    "Network Resilience and the Length-Bounded Multicut Problem: Reaching the Dynamic Billion-Scale with Guarantees.",
                    "Predictive Impact Analysis for Designing a Resilient Cellular Backhaul Network.",
                    "Synthesis of Fault-Tolerant Distributed Router Configurations.",
                    "Reinforcement with Fading Memories.",
                    "On the Convergence Rate of Distributed Gradient Methods for Finite-Sum Optimization under Communication Delays.",
                    "Distributed Statistical Machine Learning in Adversarial Settings: Byzantine Gradient Descent.",
                    "Neural Network Meets DCN: Traffic-driven Topology Adaptation with Deep Learning.",
                    "The CSI Framework for Compiler-Inserted Program Instrumentation.",
                    "A Quantitative Evaluation of Contemporary GPU Simulation Methodology.",
                    "Improving 3D NAND Flash Memory Lifetime by Tolerating Early Retention Loss and Process Variation.",
                    "A Fine-grained Event-based Modem Power Model for Enabling In-depth Modem Energy Drain Analysis.",
                    "What Your DRAM Power Models Are Not Telling You: Lessons from a Detailed Experimental Study.",
                    "Intel MPX Explained: A Cross-layer Analysis of the Intel MPX System Stack.",
                    "A Refined Mean Field Approximation.",
                    "On the Power-of-d-choices with Least Loaded Server Selection.",
                    "Degree of Queue Imbalance: Overcoming the Limitation of Heavy-traffic Delay Optimality in Load Balancing Systems.",
                    "Towards Optimality in Parallel Job Scheduling.",
                    "On a Class of Stochastic Multilayer Networks.",
                    "Fork and Join Queueing Networks with Heavy Tails: Scaling Dimension and Throughput Limit.",
                    "Performance of Balanced Fairness in Resource Pools: A Recursive Approach.",
                    "Designing Low-Complexity Heavy-Traffic Delay-Optimal Load Balancing Schemes: Theory to Algorithms.",
                    "Towards Fast-Convergence, Low-Delay and Low-Complexity Network Optimization.",
                    "The PDE Method for the Analysis of Randomized Load Balancing Networks.",
                    "Safe Randomized Load-Balanced Switching by Diffusing Extra Loads.",
                    "Asymptotically Optimal Load Balancing Topologies.",
                    "ACM Sigmetrics Performance Evaluation Review: A New Series on Diversity.",
                    "Diversity in Faculty Recruiting: A WiSE Approach."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "SIGMETRICS 2017",
        "info": "Urbana-Champaign, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2017",
                "sub_name": "Proceedings of the 2017 ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, Urbana-Champaign, IL, USA, June 05 - 09, 2017.",
                "count": 50,
                "papers": [
                    "Delay Scalings and Mean-Field Limits in Networked Systems.",
                    "A Low-Complexity Approach to Distributed Cooperative Caching with Geographic Constraints.",
                    "Optimal Service Elasticity in Large-Scale Distributed Systems.",
                    "Queue-Proportional Sampling: A Better Approach to Crossbar Scheduling for Input-Queued Switches.",
                    "Hieroglyph: Locally-Sufficient Graph Processing via Compute-Sync-Merge.",
                    "A Simple Yet Effective Balanced Edge Partition Model for Parallel Computing.",
                    "Overcommitment in Cloud Services Bin packing with Chance Constraints.",
                    "Investigation of the 2016 Linux TCP Stack Vulnerability at Scale.",
                    "Characterizing and Modeling Patching Practices of Industrial Control Systems.",
                    "Security Game with Non-additive Utilities and Multiple Attacker Resources.",
                    "Fluid-Model-Based Car Routing for Modern Ridesharing Systems.",
                    "Pseudo-Separation for Assessment of Structural Vulnerability of a Network.",
                    "On the Capacity Requirement for Arbitrary End-to-End Deadline and Reliability Guarantees in Multi-hop Networks.",
                    "Optimizing Speculative Execution of Deadline-Sensitive Jobs in Cloud.",
                    "A Spot Capacity Market to Increase Power Infrastructure Utilization in Multi-Tenant Data Centers.",
                    "Hour-Ahead Offering Strategies in Electricity Market for Power Producers with Storage and Intermittent Supply.",
                    "Why \"Some\" Like It Hot Too: Thermal Attack on Data Centers.",
                    "Incentivizing Reliable Demand Response with Customers' Uncertainties and Capacity Planning.",
                    "A Study on Performance and Power Efficiency of Dense Non-Volatile Caches in Multi-Core Systems.",
                    "Scheduling Coflows in Datacenter Networks: Improved Bound for Total Weighted Completion Time.",
                    "Characterizing 3D Floating Gate NAND Flash.",
                    "ECF: An MPTCP Path Scheduler to Manage Heterogeneous Paths.",
                    "Simplex Queues for Hot-Data Download.",
                    "An Empirical Analysis of Facebook's Free Basics.",
                    "Multipath TCP on a VANET: A Performance Study.",
                    "A Fast, Small, and Dynamic Forwarding Information Base.",
                    "HFTraC: High-Frequency Traffic Control.",
                    "Adaptive TTL-Based Caching for Content Delivery.",
                    "Online Optimization for Markets and the Cloud: Theory and Practice.",
                    "Stein's Method for Mean-Field Approximations in Light and Heavy Traffic Regimes.",
                    "Expected Values Estimated via Mean-Field Approximation are 1/N-Accurate: Extended Abstract.",
                    "Analysis of a Stochastic Model of Replication in Large Distributed Storage Systems: A Mean-Field Approach.",
                    "Understanding Reduced-Voltage Operation in Modern DRAM Devices: Experimental Characterization, Analysis, and Mechanisms.",
                    "Exploiting Data Longevity for Enhancing the Lifetime of Flash-based Storage Class Memory.",
                    "Design-Induced Latency Variation in Modern DRAM Chips: Characterization, Analysis, and Latency Reduction Mechanisms.",
                    "Hadoop on Named Data Networking: Experience and Results.",
                    "Using Burstable Instances in the Public Cloud: Why, When and How?",
                    "Dandelion: Redesigning the Bitcoin Network for Anonymity.",
                    "On Gradient-Based Optimization: Accelerated, Distributed, Asynchronous and Stochastic.",
                    "Portfolio-driven Resource Management for Transient Cloud Servers.",
                    "Optimal Posted Prices for Online Cloud Resource Allocation.",
                    "On Optimal Two-Sided Pricing of Congested Networks.",
                    "Matrix Factorization at the Frontier of Non-convex Optimizations: Abstract for SIGMETRICS 2017 Rising Star Award Talk.",
                    "Outward Influence and Cascade Size Estimation in Billion-scale Networks.",
                    "Accelerating Performance Inference over Closed Systems by Asymptotic Methods.",
                    "Quality and Cost of Deterministic Network Calculus: Design and Evaluation of an Accurate and Fast Analysis.",
                    "A Case Study in Power Substation Network Dynamics.",
                    "Persistent Spread Measurement for Big Network Data Based on Register Intersection.",
                    "Deconstructing the Energy Consumption of the Mobile Page Load.",
                    "Routing Money, Not Packets: A Tutorial on Internet Economics."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "SIGMETRICS 2016",
        "info": "Antibes Juan-Les-Pins, France",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2016",
                "sub_name": "Proceedings of the 2016 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Science, Antibes Juan-Les-Pins, France, June 14-18, 2016.",
                "count": 54,
                "papers": [
                    "Delay, Memory, and Messaging Tradeoffs in Distributed Service Systems.",
                    "Optimal Heavy-Traffic Queue Length Scaling in an Incompletely Saturated Switch.",
                    "A Necessary and Sufficient Condition for Throughput Scalability of Fork and Join Networks with Blocking.",
                    "Generalized Threshold-Based Epidemics in Random Graphs: The Power of Extreme Values.",
                    "Reverse Ranking by Graph Structure: Model and Scalable Algorithms.",
                    "Improved Achievability and Converse Bounds for Erdos-Renyi Graph Matching.",
                    "A Better Model for Task Assignment in Server Farms: How Replication can Help.",
                    "Costly Circuits, Submodular Schedules and Approximate Carathéodory Theorems.",
                    "Reducing Latency Through Page-aware Management of Web Objects by Content Delivery Networks.",
                    "Optimizing TTL Caches under Heavy-Tailed Demands.",
                    "Adaptive Caching Networks with Optimality Guarantees.",
                    "Breathing Mankind Thoughts.",
                    "Unsupervised Clustering Under Temporal Feature Volatility in Network Stack Fingerprinting.",
                    "Noisy Bloom Filters for Multi-Set Membership Testing.",
                    "Rumor Source Obfuscation on Irregular Trees.",
                    "Inference in OSNs via Lightweight Partial Crawls.",
                    "Social Clicks: What and Who Gets Read on Twitter?",
                    "Using Predictions in Online Optimization: Looking Forward with an Eye on the Past.",
                    "Collaborative Filtering with Low Regret.",
                    "Achieving Low-Delay and Fast-Convergence in Stochastic Network Optimization: A Nesterovian Approach.",
                    "On the Viability of a Cloud Virtual Service Provider.",
                    "The Value of Privacy: Strategic Data Subjects, Incentive Mechanisms and Fundamental Limits.",
                    "Instability in Distributed Mobility Management: Revisiting Configuration Management in 3G/4G Mobile Networks.",
                    "Transiently Secure Network Updates.",
                    "On the Approximation Error of Mean-Field Models.",
                    "On the Duration and Intensity of Competitions in Nonlinear Pólya Urn Processes with Fitness.",
                    "Asymptotics of Insensitive Load Balancing and Blocking Phases.",
                    "Understanding Latency Variation in Modern DRAM Chips: Experimental Characterization, Analysis, and Optimization.",
                    "Hash, Don't Cache (the Page Table).",
                    "Exploiting Core Criticality for Enhanced GPU Performance.",
                    "A Service System with Randomly Behaving On-demand Agents.",
                    "An Analysis of Load Imbalance in Scale-out Data Serving.",
                    "Analyzing the Power Consumption of the Mobile Page Load.",
                    "Automated Test Location Selection For Cellular Network Upgrades.",
                    "CAR: A Compression-Aware Refresh Approach to Improve Memory Performance and Energy Efficiency.",
                    "Contrasting Effects of Replication in Parallel Systems: From Overload to Underload and Back.",
                    "Explicit Back-off Rates for Achieving Target Throughputs in CSMA/CA Networks.",
                    "Freestyle Dancing: Randomized Algorithms for Dynamic Storage Load-Balancing.",
                    "Joint Data Purchasing and Data Placement in a Geo-Distributed Data Market.",
                    "Majority Rule Based Opinion Dynamics with Biased and Stubborn Agents.",
                    "Mean Field Equilibria of Pricing Games in Internet Marketplaces.",
                    "Modeling SMR Drive Performance.",
                    "Multipath Streaming: Fundamental Limits and Efficient Algorithms.",
                    "Network Calculus Analysis of a Feedback System with Random Service.",
                    "QoE Analysis of a Large-Scale Live Video Streaming Event.",
                    "Safe Randomized Load-Balanced Switching by Diffusing Extra Loads.",
                    "Searching For A Single Community in a Graph.",
                    "Shoot for the Moon and You Will Never Miss: Characterizing and Detecting Aimbots in Online Games.",
                    "Spatial Multi-LRU Caching for Wireless Networks with Coverage Overlaps.",
                    "SSD Failures in Datacenters: What, When and Why?",
                    "The Power of d Choices for Redundancy.",
                    "Time-Based Bandwidth Allocation for Heterogeneous Storage.",
                    "Towards Multi-Resource Fair Allocation with Placement Constraints.",
                    "Trading Discount for Reputation?: On the Design and Analysis of E-Commerce Discount Mechanisms."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "SIGMETRICS 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2015",
                "sub_name": "Proceedings of the 2015 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, Portland, OR, USA, June 15-19, 2015.",
                "count": 56,
                "papers": [
                    "Bounds Implied by Drift with Applications.",
                    "Online Auctions in IaaS Clouds: Welfare and Profit Maximization with Server Costs.",
                    "Distributed Proportional Fair Load Balancing in Heterogenous Systems.",
                    "Multi-Resource Fairness: Objectives, Algorithms and Performance.",
                    "Exchange of Services in Networks: Competition, Cooperation, and Fairness.",
                    "Whittle Index Approach to Size-aware Scheduling with Time-varying Channels.",
                    "60 GHz Indoor Networking through Flexible Beams: A Link-Level Profiling.",
                    "Sponsored Data Plan: A Two-Class Service Model in Wireless Data Networks.",
                    "Queue-Proportional Rate Allocation with Per-Link Information in Multihop Networks.",
                    "Resource Allocation and Rate Gains in Practical Full-Duplex Systems.",
                    "Transient and Steady-state Regime of a Family of List-based Cache Replacement Algorithms.",
                    "Memory Row Reuse Distance and its Role in Optimizing Application Performance.",
                    "Smartphone Energy Drain in the Wild: Analysis and Implications.",
                    "Newer Is Sometimes Better: An Evaluation of NFSv4.1.",
                    "A Large-Scale Study of Flash Memory Failures in the Field.",
                    "Online Convex Optimization Using Predictions.",
                    "Reliable Multiple-choice Iterative Algorithm for Crowdsourcing Systems.",
                    "An Online Learning Approach to Improving the Quality of Crowd-Sourcing.",
                    "Learning to Rank: Regret Lower Bounds and Efficient Algorithms.",
                    "Bandits with Budgets: Regret Lower Bounds and Optimal Algorithms.",
                    "Social Network Monetization via Sponsored Viral Marketing.",
                    "Spy vs. Spy: Rumor Source Obfuscation.",
                    "Greedy-Bayes for Targeted News Dissemination.",
                    "DiskAccel: Accelerating Disk-Based Experiments by Representative Sampling.",
                    "Combining Phase Identification and Statistic Modeling for Automated Parallel Benchmark Generation.",
                    "Power of d Choices for Large-Scale Bin Packing: A Loss Model.",
                    "Computable Bounds in Fork-Join Queueing Systems.",
                    "Reducing Latency via Redundant Requests: Exact Analysis.",
                    "Joint Cyber and Physical Attacks on Power Grids: Graph Theoretical Approaches for Information Recovery.",
                    "Impact of Fairness and Heterogeneity on Delays in Large-scale Content Delivery Networks.",
                    "Fisher Information-based Experiment Design for Network Tomography.",
                    "When Virtual Meets Physical at the Edge: A Field Study on Datacenters' Virtual Traffic.",
                    "Hyper-Compact Virtual Estimators for Big Network Data Based on Register Sharing.",
                    "Investigating the Potential of the Inter-IXP Multigraph for the Provisioning of Guaranteed End-to-End Services.",
                    "MaxWeight Scheduling: Asymptotic Behavior of Unscaled Queue-Differentials in Heavy Traffic.",
                    "Kraken: Towards Elastic Performance Guarantees in Multi-tenant Data Centers.",
                    "Latency in Software Defined Networks: Measurements and Mitigation Techniques.",
                    "Tree-structured Bloom Filters for Joint Optimization of False Positive Probability and Transmission Bandwidth.",
                    "Scheduling Storms and Streams in the Cloud.",
                    "Localized Epidemic Detection in Networks with Overwhelming Noise.",
                    "Pricing Bilateral Electricity Trade between Smart Grids and Hybrid Green Datacenters.",
                    "Detecting Sponsored Recommendations.",
                    "Understanding Parallel Performance Under Interferences in Multi-tenant Clouds.",
                    "Clustering and Inference From Pairwise Comparisons.",
                    "Deterministic Near-Optimal P2P Streaming.",
                    "Flexible Transformations For Learning Big Data.",
                    "Energy Coupon: A Mean Field Game Perspective on Demand Response in Smart Grids.",
                    "DeltaTree: A Locality-aware Concurrent Search Tree.",
                    "Detecting and Localizing End-to-End Performance Degradation for Cellular Data Services.",
                    "Speeding up Glauber Dynamics for Random Generation of Independent Sets.",
                    "Online Electricity Cost Saving Algorithms for Co-Location Data Centers.",
                    "Web Transparency for Complex Targeting: Algorithms, Limits, and Tradeoffs.",
                    "Lagrangian-based Online Stochastic Bin Packing.",
                    "Towards Cooling Internet-Scale Distributed Networks on the Cheap.",
                    "A Simple Model to Quantify the Impact of Memory Latency and Bandwidth on Performance.",
                    "Performance Characterization of Hyperscale Applicationson on NVMe SSDs."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "SIGMETRICS 2014",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2014",
                "sub_name": "ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS 2014, Austin, TX, USA, June 16-20, 2014.",
                "count": 68,
                "papers": [
                    "Rumor source detection with multiple observations: fundamental limits and algorithms.",
                    "Collecting, organizing, and sharing pins in pinterest: interest-driven or social-driven?",
                    "Jointly clustering rows and columns of binary matrices: algorithms and trade-offs.",
                    "Filter & follow: how social media foster content curation.",
                    "Privacy tradeoffs in predictive analytics.",
                    "An online auction framework for dynamic resource provisioning in cloud computing.",
                    "Energy procurement strategies in the presence of intermittent sources.",
                    "Randomized auction design for electricity markets between grids and microgrids.",
                    "Pricing data center demand response.",
                    "Index policies for a multi-class queue with convex holding cost and abandonments.",
                    "Concave switching in single and multihop networks.",
                    "The power of online learning in stochastic network optimization.",
                    "Is sharing with retransmissions causing instabilities?",
                    "Non-work-conserving effects in MapReduce: diffusion limit and criticality.",
                    "Conquering big data with spark and BDAS.",
                    "Hershel: single-packet os fingerprinting.",
                    "Noise can help: accurate and efficient per-flow latency measurement without packet probing and time stamping.",
                    "A measurement study of google play.",
                    "IntroPerf: transparent context-sensitive multi-layer performance inference using system stack traces.",
                    "Non-intrusive, out-of-band and out-of-the-box systems monitoring in the cloud.",
                    "The behavior of epidemics under bounded susceptibility.",
                    "Studying social networks at scale: macroscopic anatomy of the twitter social graph.",
                    "Stochastic bandits with side observations on networks.",
                    "On maximizing diffusion speed in social networks: impact of random seeding and clustering.",
                    "Tunable survivable spanning trees.",
                    "Balanced resource allocations across multiple dynamic MapReduce clusters.",
                    "On the relevance of adversarial queueing theory in practice.",
                    "GemDroid: a framework to evaluate mobile platforms.",
                    "Understanding the impact of network dynamics on mobile video user engagement.",
                    "Error estimating codes for insertion and deletion channels.",
                    "Data dissemination performance in large-scale sensor networks.",
                    "Movers and shakers: kinetic energy harvesting for the internet of things.",
                    "Pricing link by time.",
                    "Serving content with unknown demand: the high-dimensional regime.",
                    "Network-design sensitivity analysis.",
                    "The multi-shop ski rental problem.",
                    "CApRI: CAche-conscious data reordering for irregular codes.",
                    "Neighbor-cell assisted error correction for MLC NAND flash memories.",
                    "ANATOMY: an analytical model of memory system performance.",
                    "The efficacy of error mitigation techniques for DRAM retention failures: a comparative experimental study.",
                    "GDM: device memory management for gpgpu computing.",
                    "On the energy and performance of commodity hardware transactional memory.",
                    "Impact of correlated mobility and cluster scalability on connectivity of wireless networks.",
                    "Unleashing the potentials of dynamism for page allocation strategies in SSDs.",
                    "Traffic congestion: models, costs and optimal transport.",
                    "Randomized routing schemes for large processor sharing systems with multiple service rates.",
                    "Automated analysis of multithreaded programs for performance modeling.",
                    "A comparison of core power gating strategies implemented in modern hardware.",
                    "Topic modeling from network spread.",
                    "BATS: budget-constrained autoscaling for cloud performance optimization.",
                    "What's your choice?: learning the mixed multi-nomial.",
                    "Revisiting caching in content delivery networks.",
                    "FLOWR: a self-learning system for classifying mobileapplication traffic.",
                    "Accurate and robust time reconstruction for deployed sensor networks.",
                    "Effect of proactive serving on user delay reduction in service systems.",
                    "Optimal energy source selection and capacity planning for green datacenters.",
                    "Scheduling using interactive oracles: connection between iterative optimization and low-complexity scheduling.",
                    "Unified localization framework using trajectory signatures.",
                    "TS-CLOCK: temporal and spatial locality aware buffer replacement algorithm for NAND flash storages.",
                    "Multi-source multipath HTTP (mHTTP): a proposal.",
                    "Performance analysis of MAC for power-line communications.",
                    "Impact of DHCP churn on network characterization.",
                    "Online algorithms for joint application-VM-physical-machine auto-scaling in a cloud.",
                    "Distributed optimal load shedding for disaster recovery in smart electric power grids: a second-order approach.",
                    "TARDIS: stably shifting traffic in space and time.",
                    "Exact analysis of TTL cache networks: the case of caching policies driven by stopping times.",
                    "Measuring throughput of data center network topologies.",
                    "Efficient task replication for fast response times in parallel computation."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "SIGMETRICS 2013",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2013",
                "sub_name": "ACM SIGMETRICS / International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS '13, Pittsburgh, PA, USA, June 17-21, 2013.",
                "count": 59,
                "papers": [
                    "Designing large-scale nudge engines.",
                    "Challenges in cloud scale data centers.",
                    "Practical conflict graphs for dynamic spectrum distribution.",
                    "A first look at cellular network performance during crowded events.",
                    "Characterizing and modeling the impact of wireless signal strength on smartphone battery drain.",
                    "A large-scale service system with packing constraints: minimizing the number of occupied servers.",
                    "Online energy generation scheduling for microgrids with intermittent energy sources and co-generation.",
                    "Defragmenting the cloud using demand-based resource allocation.",
                    "Efficient crowdsourcing for multi-class labeling.",
                    "Root cause detection in a service-oriented architecture.",
                    "The design space of probing algorithms for network-performance measurement.",
                    "Delays and mixing times in random-access networks.",
                    "Scheduling of users with markovian time-varying transmission rates.",
                    "Lingering issues in distributed scheduling.",
                    "Exact analysis of the M/M/k/setup class of Markov chains via recursive renewal reward.",
                    "Queueing system topologies with limited flexibility.",
                    "Stochastic modeling of large-scale solid-state storage systems: analysis, design tradeoffs and optimization.",
                    "A mean field model for a class of garbage collection algorithms in flash-based solid state drives.",
                    "Revisiting widely held SSD expectations and rethinking system-level implications.",
                    "Characterizing the impact of process variation on write endurance enhancing techniques for non-volatile memory systems.",
                    "Distributing content simplifies ISP traffic engineering.",
                    "Quantifying the benefits of joint content and network routing.",
                    "High-throughput low-latency fine-grained disk logging.",
                    "On understanding the energy consumption of ARM-based multicore servers.",
                    "Reuse-based online models for caches.",
                    "Probabilistic optimal tree hopping for RFID identification.",
                    "Multipath TCP algorithms: theory and design.",
                    "Trap array: a unified model for scalability evaluation of geometric routing.",
                    "A tale of two metrics: simultaneous bounds on competitiveness and regret.",
                    "Accelerating GPGPU architecture simulation.",
                    "ACE: abstracting, characterizing and exploiting peaks and valleys in datacenter power consumption.",
                    "An empirical analysis of intra- and inter-datacenter network failures for geo-distributed services.",
                    "Computational analysis of cascading failures in power networks.",
                    "Data center asset tracking using a mobile robot.",
                    "Data center demand response: avoiding the coincident peak via workload shifting and local generation.",
                    "Delivering fairness and priority enforcement on asymmetric multicore systems via OS scheduling.",
                    "Detecting user dissatisfaction and understanding the underlying reasons.",
                    "Discriminant malware distance learning on structuralinformation for automated malware classification.",
                    "Elastic paging.",
                    "Exact convex relaxation for optimal power flow in distribution networks.",
                    "Exploiting the past to reduce delay in CSMA scheduling: a high-order markov chain approach.",
                    "FaRNet: fast recognition of high multi-dimensional network traffic patterns.",
                    "Firming solar power.",
                    "Greedy name lookup for named data networking.",
                    "How does energy accounting matter for energy management?",
                    "Online load balancing under graph constraints.",
                    "Parallel scaling properties from a basic block view.",
                    "Sharp bounds in stochastic network calculus.",
                    "Stable and scalable universal swarms.",
                    "Sustainability of service provisioning systems under attack.",
                    "Temperature aware workload management in geo-distributed datacenters.",
                    "Tolerating path heterogeneity in multipath TCP with bounded receive buffers.",
                    "Understanding architectural characteristics of multimedia retrieval workloads.",
                    "Understanding internet video viewing behavior in the wild.",
                    "Understanding SMS spam in a large cellular network.",
                    "Web performance bottlenecks in broadband access networks.",
                    "Tutorial on geo-replication in data center applications.",
                    "The fundamentals of heavy-tails: properties, emergence, and identification.",
                    "Profiling and analyzing the I/O performance of NoSQL DBs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "SIGMETRICS 2012",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2012",
                "sub_name": "ACM SIGMETRICS/PERFORMANCE Joint International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS '12, London, United Kingdom, June 11-15, 2012.",
                "count": 61,
                "papers": [
                    "Performance implications of flash and storage class memories.",
                    "High-performance computing in mobile services.",
                    "Delay tails in MapReduce scheduling.",
                    "Optimal queue-size scaling in switched networks.",
                    "Minimizing slowdown in heterogeneous size-aware dispatching systems.",
                    "Bipartite graph structures for efficient balancing of heterogeneous loads.",
                    "Workload analysis of a large-scale key-value store.",
                    "A first look at cellular machine-to-machine traffic: large scale measurement and characterization.",
                    "Bundling practice in BitTorrent: what, how, and why.",
                    "Energy-efficient congestion control.",
                    "Uniform approximation of the distribution for the number of retransmissions of bounded documents.",
                    "Fluid limit of an asynchronous optical packet switch with shared per link full range wavelength conversion.",
                    "Towards optimal error-estimating codes through the lens of Fisher information analysis.",
                    "How well can congestion pricing neutralize denial of service attacks?",
                    "Pricing cloud bandwidth reservations under demand uncertainty.",
                    "Temperature management in data centers: why some (might) like it hot.",
                    "Renewable and cooling aware workload management for sustainable data centers.",
                    "Energy storage in datacenters: what, where, and how much?",
                    "Rumor centrality: a universal source detector.",
                    "Learning the graph of epidemic cascades.",
                    "Network forensics: random infection vs spreading epidemic.",
                    "What is a good buffer cache replacement scheme for mobile flash storage?",
                    "Versatile refresh: low complexity refresh scheduling for high-throughput multi-banked eDRAM.",
                    "Does lean imply green?: a study of the power performance implications of Java runtime bloat.",
                    "D-factor: a quantitative model of application slow-down in multi-resource shared systems.",
                    "ADP: automated diagnosis of performance pathologies using hardware events.",
                    "Providing fairness on shared-memory multiprocessors via process scheduling.",
                    "Characterizing continuous time random walks on time varying graphs.",
                    "Beyond random walk and metropolis-hastings samplers: why you should not backtrack for unbiased graph sampling.",
                    "Clustered embedding of massive social networks.",
                    "Don't let the negatives bring you down: sampling from streams of signed updates.",
                    "Efficient rank aggregation using partial data.",
                    "Fair sampling across network flow measurements.",
                    "TCAM-based NFA implementation.",
                    "Stable and efficient pricing for inter-domain traffic forwarding.",
                    "Measuring and characterizing home networks.",
                    "Comparing metro-area cellular and WiFi performance: extended abstract.",
                    "Towards a statistical characterization of the competitiveness of oblivious routing.",
                    "Range tomography.",
                    "A scalable architecture for maintaining packet latency measurements.",
                    "Modeling randomness in network traffic.",
                    "Performance evaluation of the random replacement policy for networks of caches.",
                    "Saving on cooling: the thermal scheduling problem.",
                    "Congestion control meets medium access: throughput, delay, and complexity.",
                    "Optimized cloud placement of virtual clusters using biased importance sampling.",
                    "Power and energy containers for multicore servers.",
                    "Characterizing the impact of the workload on the value of dynamic resizing in data centers.",
                    "Provisioning for large scale cloud computing services.",
                    "Distributed wide-area traffic management for cloud services.",
                    "On the efficacy of fine-grained traffic splitting protocols in data center networks.",
                    "Content-aware traffic engineering.",
                    "Understanding performance anomalies of SSDs and their impact in enterprise application environment.",
                    "Classifying internet one-way traffic.",
                    "Fast cost efficient designs by building upon the plackett and burman method.",
                    "Multi-hop network tomography: path reconstruction and per-hop arrival time estimation from partial information.",
                    "Smartphones vs. laptops: comparing web browsing behavior and the implications for caching.",
                    "Micro and macro views of discrete-state markov models and their application to efficient simulation with phase-type distributions.",
                    "POTRA: a framework for building power models for next generation multicore architectures.",
                    "Basic theory and some applications of martingales.",
                    "Applications of machine learning to performance evaluation.",
                    "Introduction to network experiments using the GENI cyberinfrastructure."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "SIGMETRICS 2011",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2011",
                "sub_name": "SIGMETRICS 2011, Proceedings of the 2011 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, San Jose, CA, USA, 07-11 June 2011 (Co-located with FCRC 2011).",
                "count": 50,
                "papers": [
                    "Modeling program resource demand using inherent program characteristics.",
                    "METE: meeting end-to-end QoS in multicores through system-wide resource management.",
                    "Studying inter-core data reuse in multicores.",
                    "Studying the impact of hardware prefetching and bandwidth partitioning in chip-multiprocessors.",
                    "Stability analysis of QCN: the averaging principle.",
                    "Stochastic networks with multipath flow control: impact of resource pools on flow-level performance and network congestion.",
                    "Analysis of DCTCP: stability, convergence, and fairness.",
                    "Soft error benchmarking of L2 caches with PARMA.",
                    "Network architecture for joint failure recovery and traffic engineering.",
                    "Record and transplay: partial checkpointing for replay debugging across heterogeneous systems.",
                    "An FPGA-based experimental evaluation of microprocessor core error detection with Argus-2.",
                    "The role of KL divergence in anomaly detection.",
                    "Applying idealized lower-bound runtime models to understand inefficiencies in data-intensive computing.",
                    "How prevalent is content bundling in BitTorrent.",
                    "Self-adaptive provisioning of virtualized resources in cloud computing.",
                    "Characterizing and analyzing renewable energy driven data centers.",
                    "Tight moments-based bounds for queueing systems.",
                    "Scalable monitoring via threshold compression in a large operational 3G network.",
                    "How do you 'Tube'.",
                    "A control scheme for batching DRAM requests to improve power efficiency.",
                    "Optimal neighbor selection in BitTorrent-like peer-to-peer networks.",
                    "Towards understanding modern web traffic.",
                    "De-ossifying internet routing through intrinsic support for end-network and ISP selfishness.",
                    "Dynamic server provisioning to minimize cost in an IaaS cloud.",
                    "HeteroScouts: hardware assist for OS scheduling in heterogeneous CMPs.",
                    "Characterizing continuous-time random walks on dynamic networks.",
                    "Autocorrelation analysis: a new and improved method for measuring branch predictability.",
                    "IP geolocation in metropolitan areas.",
                    "TCP behavior in sub packet regimes.",
                    "Network link tomography and compressive sensing.",
                    "On the power of (even a little) centralization in distributed processing.",
                    "Weighted proportional allocation.",
                    "On the optimal trade-off between SRPT and opportunistic scheduling.",
                    "Structure-aware sampling on data streams.",
                    "Gossip PCA.",
                    "Optimal power cost management using stored energy in data centers.",
                    "Greening geographical load balancing.",
                    "Slick packets.",
                    "Geographic routing in d-dimensional spaces with guaranteed delivery and low stretch.",
                    "Model-driven optimization of opportunistic routing.",
                    "Walking on a graph with a magnifying glass: stratified sampling via weighted random walks.",
                    "Topology discovery of sparse random graphs with few participants.",
                    "Characterizing and modeling internet traffic dynamics of cellular devices.",
                    "Cellular data network infrastructure characterization and implication on mobile content placement.",
                    "Fine-grained latency and loss measurements in the presence of reordering.",
                    "On the stability and optimality of universal swarms.",
                    "Storage technologies, management and troubleshooting in virtualized datacenters.",
                    "Cloud data center networks: technologies, trends, and challenges.",
                    "Building accurate workload models using Markovian arrival processes.",
                    "Non-asymptotic capacity and delay analysis of mobile wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "SIGMETRICS 2010",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2010",
                "sub_name": "SIGMETRICS 2010, Proceedings of the 2010 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, New York, New York, USA, 14-18 June 2010.",
                "count": 49,
                "papers": [
                    "Practical performance models for complex, popular applications.",
                    "A mean field model of work stealing in large-scale systems.",
                    "A unifying approach to product-forms in networks with finite capacity constraints.",
                    "Optimality, fairness, and robustness in speed scaling designs.",
                    "Elon: enabling efficient and long-term reprogramming for wireless sensor networks.",
                    "Distributed sensor network localization from local connectivity: performance analysis for the HOP-TERRAIN algorithm.",
                    "Self-synchronizing properties of CSMA wireless multi-hop networks.",
                    "On the flow-level dynamics of a packet-switched network.",
                    "Incentive compatibility and dynamics of congestion control.",
                    "Dynamics in congestion games.",
                    "Optimal recovery of single disk failure in RDP code storage systems.",
                    "A query language and runtime tool for evaluating behavior of multi-tier servers.",
                    "Small subset queries and bloom filters using ternary associative memories, with applications.",
                    "Transparent, lightweight application execution replay on commodity multiprocessor operating systems.",
                    "Coloring spatial point processes with applications to peer discovery in large wireless networks.",
                    "Optimal tradeoff between exposed and hidden nodes in large wireless networks.",
                    "Scheduling in multichannel wireless networks with flow-level dynamics.",
                    "Detecting sources of computer viruses in networks: theory and experiment.",
                    "Incentivizing peer-assisted services: a fluid shapley value approach.",
                    "Leveraging parallelism for multi-dimensional packetclassification on software routers.",
                    "Qualitative properties of alpha-weighted scheduling policies.",
                    "CWS: a model-driven scheduling policy for correlated workloads.",
                    "RSIO: automatic user interaction detection and scheduling.",
                    "Randomized load balancing with general service time distributions.",
                    "Load balancing via random local search in closed and open systems.",
                    "A unified modeling framework for distributed resource allocation of general fork and join processing networks.",
                    "Distributed caching over heterogeneous mobile networks.",
                    "An analytical framework to infer multihop path reliability in MANETs.",
                    "Channel fragmentation in dynamic spectrum access systems: a theoretical study.",
                    "A distributed scheduling algorithm for wireless networks with constant overhead and arbitrary binary interference.",
                    "Successive c-optimal designs: a scalable technique to optimize the measurements on large networks.",
                    "Deep diving into BitTorrent locality.",
                    "Inferring applications at the network layer using collective traffic statistics.",
                    "The price of anarchy in parallel queues revisited.",
                    "Optimal propagation of security patches in mobile wireless networks: extended abstract.",
                    "Managing the cost, energy consumption, and carbon footprint of internet services.",
                    "Coordinated power management of voltage islands in CMPs.",
                    "Rigorous statistical analysis of internet loss measurements.",
                    "Semidefinite optimization for transient analysis of queues.",
                    "CFTL: a convertible flash translation layer adaptive to data access patterns.",
                    "A case for unsupervised-learning-based spam filtering.",
                    "Distributed averaging in dynamic networks.",
                    "Program behavior prediction using a statistical metric model.",
                    "Delay optimal queue-based CSMA.",
                    "Characterizing and modeling user activity on smartphones: summary.",
                    "Detecting traffic anomalies using an equilibrium property.",
                    "Characterizing the soft error vulnerability of multicores running multithreaded applications.",
                    "Can multipath mitigate power law delays?: effects of parallelism on tail performance.",
                    "Distributed user profiling via spectral methods."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "SIGMETRICS/Performance 2009",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2009",
                "sub_name": "Proceedings of the Eleventh International Joint Conference on Measurement and Modeling of Computer Systems, SIGMETRICS/Performance 2009, Seattle, WA, USA, June 15-19, 2009.",
                "count": 27,
                "papers": [
                    "Efficient control of epidemics over random networks.",
                    "Botnet spam campaigns can be long lasting: evidence, implications, and analysis.",
                    "Inferring undesirable behavior from P2P traffic analysis.",
                    "Redundancy in network traffic: findings and implications.",
                    "Unveiling core network-wide communication patterns through application traffic activity graph decomposition.",
                    "On the treeness of internet latency and bandwidth.",
                    "Topological transformation approaches to optimizing TCAM-based packet classification systems.",
                    "Reference-driven performance anomaly identification.",
                    "Node weighted scheduling.",
                    "The age of gossip: spatial mean field regime.",
                    "Scheduling in multi-channel wireless networks: rate function optimality in the small-buffer regime.",
                    "Network adiabatic theorem: an efficient randomized protocol for contention resolution.",
                    "Dynamic data compression in multi-hop wireless networks.",
                    "Optimal power allocation in server farms.",
                    "Evaluating the impact of job scheduling and power management on processor lifetime for chip multiprocessors.",
                    "Understanding intrinsic characteristics and system implications of flash memory based solid state drives.",
                    "DRAM errors in the wild: a large-scale field study.",
                    "Restrained utilization of idleness for transparent scheduling of background tasks.",
                    "Neighbor-specific BGP: more flexible routing policies while improving global stability.",
                    "Delay tolerant bulk data transfers on the internet.",
                    "Cooperative content distribution and traffic engineering in an ISP network.",
                    "Leveraging discarded samples for tighter estimation of multiple-set aggregates.",
                    "Maximum likelihood estimation of the flow size distribution tail index from sampled packet data.",
                    "Modeling channel popularity dynamics in a large IPTV system.",
                    "Surprising results on task assignment in server farms with high-variability workloads.",
                    "MapReduce optimization using regulated dynamic prioritization.",
                    "Self-adaptive admission control policies for resource-sharing systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "SIGMETRICS 2008",
        "info": "Annapolis, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2008",
                "sub_name": "Proceedings of the 2008 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS 2008, Annapolis, MD, USA, June 2-6, 2008.",
                "count": 56,
                "papers": [
                    "Performance of random medium access control, an asymptotic approach.",
                    "Bound analysis of closed queueing networks with workload burstiness.",
                    "Scheduling despite inexact job-size information.",
                    "Network externalities and the deployment of security features and protocols in the internet.",
                    "The delay-friendliness of TCP.",
                    "Scalable VPN routing via relaying.",
                    "Hierarchical routing over dynamic wireless networks.",
                    "Loss-aware network coding for unicast wireless sessions: design, implementation, and performance evaluation.",
                    "Exploiting manufacturing variations for compensating environment-induced clock drift in time synchronization.",
                    "Confident estimation for multistage measurement sampling and aggregation.",
                    "Counter braids: a novel counter architecture for per-flow measurement.",
                    "Tracking in a spaghetti bowl: monitoring transactions using footprints.",
                    "Optimal sampling in state space models with applications to network monitoring.",
                    "On the design of hybrid peer-to-peer systems.",
                    "Utility maximization in peer-to-peer systems.",
                    "A queueing system for modeling a file sharing principle.",
                    "Path-quality monitoring in the presence of adversaries.",
                    "Densification arising from sampling fixed graphs.",
                    "In search of the elusive ground truth: the internet's as-level connectivity structure.",
                    "HMTT: a platform independent full-system memory trace monitoring system.",
                    "Disk scrubbing versus intra-disk redundancy for high-reliability raid storage systems.",
                    "Ironmodel: robust performance models in the wild.",
                    "Xengine: a fast and scalable XACML policy evaluation engine.",
                    "DARC: dynamic analysis of root causes of latency distributions.",
                    "QDSL: a queuing model for systems with differential service levels.",
                    "Analysis of bittorrent-like protocols for on-demand stored media streaming.",
                    "Performance bounds for peer-assisted live streaming.",
                    "Epidemic live streaming: optimal performance trade-offs.",
                    "Software thermal management of dram memory for multicore systems.",
                    "Noncooperative power control and transmission scheduling in wireless collision channels.",
                    "Software-directed combined cpu/link voltage scaling fornoc-based cmps.",
                    "Interaction-aware energy management for wireless network cards.",
                    "Fully decentralized emulation of best-effort and processor sharing queues.",
                    "Optimal delay scheduling in networks with arbitrary constraints.",
                    "Revisiting stochastic loss networks: structures and algorithms.",
                    "Traffic capacity of multi-cell WLANS.",
                    "Relative competitiveness of cache replacement policies.",
                    "Network distance estimation with dynamic landmark triangles.",
                    "Class-of-service in ip backbones: informing the network neutrality debate.",
                    "Predicting the resource consumption of network intrusion detection systems.",
                    "Efficient mart-aided modeling for microarchitecture design space exploration and performance prediction.",
                    "Combined intra- and inter-domain traffic engineering using hot-potato aware link weights optimization.",
                    "Modeling directionality in wireless networks: extended abstract.",
                    "Layered interval codes for tcam-based classification.",
                    "Durability of replicated distributed storage systems.",
                    "Implementation and evaluation of a migration-based NUCA design for chip multiprocessors.",
                    "M/G/1 queue with repeated inhomogeneous vacations applied to ieee 802.16e power saving.",
                    "Managing inter-domain traffic in the presence of bittorrent file-sharing.",
                    "Clock offset estimation using collaborative one-way transit time.",
                    "Scheduling with queue length guarantees for shared resource systems.",
                    "Estimating cardinality distributions in network traffic: extended abstract.",
                    "Weighted fair sharing for dynamic virtual clusters.",
                    "Exploring the throughput-fairness tradeoff of deadline scheduling in heterogeneous computing environments.",
                    "Characterizing multiparty voice communication for multiplayer games.",
                    "Algorithmic approaches to redesigning tcam-based systems.",
                    "Performance analysis in the real world."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "SIGMETRICS 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2007",
                "sub_name": "Proceedings of the 2007 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS 2007, San Diego, California, USA, June 12-16, 2007.",
                "count": 48,
                "papers": [
                    "Modeling and improving data cache reliability.",
                    "pClock: an arrival curve based approach for QoS guarantees in shared storage systems.",
                    "QoS policies and architecture for cache/memory in CMP platforms.",
                    "Modeling the relative fitness of storage.",
                    "Facilitating focused internet measurements.",
                    "Diagnosing network disruptions with network-wide analysis.",
                    "Understanding network delay changes caused by routing events.",
                    "Two-phase routing, scheduling and power control for wireless mesh networks with variable traffic.",
                    "A machine learning approach to TCP throughput prediction.",
                    "Sensitivity of PCA for traffic anomaly detection.",
                    "Backbone construction in selfish wireless networks.",
                    "Scalability of fork/join queueing networks with blocking.",
                    "Optimizing system configurations quickly by guessing at the performance.",
                    "Sizing sketches: a rank-based analysis for similarity search.",
                    "Managing energy-performance tradeoffs for multithreaded applications on multiprocessor architectures.",
                    "An algorithm for approximate counting using limited memory resources.",
                    "Synthetic designs: a new form of true experimental design for use in information systems development.",
                    "PBS: a unified priority-based scheduler.",
                    "Adaptive and scalable comparison scheduling.",
                    "Optimal capacity planning in stochastic loss networks with time-varying workloads.",
                    "Flow-level stability of data networks with non-convex and time-varying rate regions.",
                    "Future directions in performance evaluation research.",
                    "Wire speed packet classification without tcams: a few more registers (and a bit of logic) are enough.",
                    "Data layouts for object-oriented programs.",
                    "Building high accuracy bloom filters using partitioned hashing.",
                    "An analysis of latent sector errors in disk drives.",
                    "Clustering and sharing incentives in BitTorrent systems.",
                    "Distributed link scheduling with constant overhead.",
                    "Theoretical bounds on control-plane self-monitoring in routing protocols.",
                    "Oblivious routing for fat-tree based system area networks with uncertain traffic demands.",
                    "Evaluating SIP server performance.",
                    "Pipeline spectroscopy.",
                    "Bottom-k sketches: better and more efficient estimation of aggregates.",
                    "GRE encapsulated multicast probing: a scalable technique for measuring one-way loss.",
                    "When is service really denied?: a user-centric dos metric.",
                    "Does internet media traffic really follow Zipf-like distribution?",
                    "Comparative characterization of SPEC CPU2000 and CPU2006 on Itanium architecture.",
                    "Power reduction through measurement and modeling of users and CPUs: summary.",
                    "Generating representative ISP topologies from first-principles.",
                    "Bounding damage from link destruction, with application to the internet.",
                    "Semi-supervised network traffic classification.",
                    "Efficient management of idleness in systems.",
                    "Asynchronous iterative solution for state-based performance metrics.",
                    "Analyzing commercial processor performance numbers for predicting performance of applications of interest.",
                    "BRADO: scalable streaming through reconfigurable trees.",
                    "QBETS: queue bounds estimation from time series.",
                    "Pong: diagnosing spatio-temporal internet congestion properties.",
                    "Mean delay optimization for the M/G/1 queue with pareto type service times."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "SIGMETRICS/Performance 2006",
        "info": "Saint-Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2006",
                "sub_name": "Proceedings of the Joint International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS/Performance 2006, Saint Malo, France, June 26-30, 2006.",
                "count": 47,
                "papers": [
                    "Performance and reliability: the ubiquitous challenge.",
                    "Stardust: tracking activity in a distributed storage system.",
                    "Exploiting redundancy to conserve energy in storage systems.",
                    "Maximizing throughput in wireless networks via gossiping.",
                    "Determining the end-to-end throughput capacity in multi-hop networks: methodology and applications.",
                    "Impacts of channel variability on link-level throughput in wireless networks.",
                    "Partially overlapped channels not considered harmful.",
                    "GPS scheduling: selection of optimal weights and comparison with strict priorities.",
                    "The impact of reneging in processor sharing queues.",
                    "Tail asymptotics for policies favoring short jobs in a many-flows regime.",
                    "On light and heavy traffic approximations of balanced fairness.",
                    "NetQuest: a flexible framework for large-scale network measurement.",
                    "Robust traffic matrix estimation with imperfect information: making use of multiple data sources.",
                    "Data streaming algorithms for estimating entropy of network traffic.",
                    "On suitability of Euclidean embedding of internet hosts.",
                    "An efficient algorithm for the exact analysis of multiclass queueing networks with large population sizes.",
                    "Transient analysis of tree-Like processes and its application to random access systems.",
                    "Bounding stationary results of Tandem networks with MAP input and PH service time distributions.",
                    "Fundamental characteristics of queues with fluctuating load.",
                    "Automatic logging of operating system effects to guide application-level architecture simulation.",
                    "An analytical model for cache replacement policy performance.",
                    "Understanding the management of client perceived response time.",
                    "Confidence intervals for priority sampling.",
                    "Finding probably better system configurations quickly.",
                    "The Erlang model with non-poisson call arrivals.",
                    "On the way to a distributed systems calculus: an end-to-end network calculus with data scaling.",
                    "Robust network connectivity: when it's the big picture that matters.",
                    "Packet classifiers in ternary CAMs can be smaller.",
                    "Design of a novel statistics counter architecture with optimal space and time efficiency.",
                    "Fluid modeling of pollution proliferation in P2P networks.",
                    "Fast statistical spam filter by approximate classifications.",
                    "QuickProbe: available bandwidth estimation in two roundtrips.",
                    "Flexible time-windows for advance reservation in LambdaGrids.",
                    "Analyzing persistent state interactions to improve state management.",
                    "Delay-optimal scheduling in bandwidth-sharing networks.",
                    "Throughput performance of popular JMS servers.",
                    "Optimizing the HPCC randomaccess benchmark on blue Gene/L Supercomputer.",
                    "Peer-to-peer streaming of stored media: the indirect approach.",
                    "Analysis of a new intra-disk redundancy scheme for high-reliability RAID storage systems in the presence of unrecoverable errors.",
                    "Applying architectural vulnerability Analysis to hard faults in the microprocessor.",
                    "A multicommodity flow model for distributed stream processing.",
                    "A characterization of a java-based commercial workload on a high-end enterprise server.",
                    "Optimizing transmission rate in wireless channels using adaptive probes.",
                    "Consolidating clients on back-end servers with co-location and frequency control.",
                    "Congestion responsiveness of internet traffic: (a fresh look at an old problem).",
                    "Towards deterministic network diagnosis.",
                    "Modeling adoptability of secure BGP protocols."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "SIGMETRICS 2005",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2005",
                "sub_name": "Proceedings of the International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 2005, June 6-10, 2005, Banff, Alberta, Canada.",
                "count": 58,
                "papers": [
                    "Google: or how I learned to love terabytes.",
                    "Coupon replication systems.",
                    "Low traffic overlay networks with large routing tables.",
                    "On lifetime-based node failure and stochastic resilience of decentralized peer-to-peer networks.",
                    "Denial-of-service resilience in peer-to-peer file sharing systems.",
                    "Internet traffic classification using bayesian analysis techniques.",
                    "A data streaming algorithm for estimating subpopulation flow size distribution.",
                    "Packet classification in large ISPs: design and evaluation of decision tree classifiers.",
                    "A robust system for accurate real-time summaries of internet traffic.",
                    "On the performance characteristics of WLANs: revisited.",
                    "Fixed point analysis of single cell IEEE 802.11e WLANs: uniqueness, multistability and throughput differentiation.",
                    "Modeling epidemic information dissemination on mobile devices with finite buffers.",
                    "Algorithmic aspects of capacity in wireless networks.",
                    "Empirical evaluation of multi-level buffer cache collaboration for storage systems.",
                    "The performance impact of kernel prefetching on buffer cache replacement algorithms.",
                    "Fast data-locality profiling of native execution.",
                    "Automatic measurement of memory hierarchy parameters.",
                    "Optimal insensitive routing and bandwidth sharing in simple data networks.",
                    "Nearly insensitive bounds on SMART scheduling.",
                    "Evaluating the number of active flows in a scheduler realizing fair statistical bandwidth sharing.",
                    "Classifying scheduling policies with respect to higher moments of conditional response time.",
                    "Why is the internet traffic bursty in short time scales?",
                    "Fundamental bounds on the accuracy of network performance measurements.",
                    "End-to-end estimation of the available bandwidth variation range.",
                    "Optimization and Control of Communication Networks.",
                    "Network utility maximization with nonconcave, coupled, and reliability-based uilities.",
                    "Optimization model of internet protocols.",
                    "Joint pricing-network design and stochastic traffic engineering to manage demand uncertainty.",
                    "An optimization based approach for cross-layer design in wireless communication networks.",
                    "Achieving fair rates with ingress policing.",
                    "A network service curve approach for the stochastic analysis of networks.",
                    "An analytical model for multi-tier internet services and its applications.",
                    "Managing server energy and operational costs in hosting centers.",
                    "Evaluating the impact of simultaneous multithreading on network servers using real hardware.",
                    "Efficient algorithms for large-scale topology discovery.",
                    "On AS-level path inference.",
                    "Data streaming algorithms for accurate and efficient measurement of traffic and flow matrices.",
                    "Traffic matrices: balancing measurements, inference and modeling.",
                    "Rate-adaptive time synchronization for long-lived sensor networks.",
                    "Introducing permuted states for analyzing conflict rates in optimistic replication.",
                    "Predicting node availability in peer-to-peer networks.",
                    "Troubleshooting multihop wireless networks.",
                    "Fair operation of multi-server and multi-queue systems.",
                    "Deadline scheduling for animation rendering.",
                    "Smooth switching problem in buffered crossbar switches.",
                    "Prediction of TCP throughput: formula-based and history-based methods.",
                    "A statistical framework for efficient monitoring of end-to-end network properties.",
                    "TBBT: scalable and accurate trace replay for file server evaluation.",
                    "On the use of anycast in DNS.",
                    "Managing memory access latency in packet processing.",
                    "Some observations on bitTorrent performance.",
                    "Theory and practice of cross-traffic estimation.",
                    "Characterizing the two-tier gnutella topology.",
                    "Analysis of search and replication in unstructured peer-to-peer networks.",
                    "An interposed 2-Level I/O scheduling framework for performance virtualization.",
                    "TurboSMARTS: accurate microarchitecture simulation sampling in minutes.",
                    "A reactive channel model for expediting wireless network simulation.",
                    "Message delay in MANET."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "SIGMETRICS 2004",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2004",
                "sub_name": "Proceedings of the International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 2004, June 10-14, 2004, New York, NY, USA.",
                "count": 58,
                "papers": [
                    "Stochastic traffic engineering for demand uncertainty and risk-aware network revenue management.",
                    "Cross-architecture performance predictions for scientific applications using parameterized models.",
                    "Multi-dimensional storage virtualization.",
                    "Myths and realities: the performance impact of garbage collection.",
                    "Interposed proportional sharing for a storage service utility.",
                    "Flow classification by histograms: or how to go on safari in the internet.",
                    "Structural analysis of network traffic flows.",
                    "How to identify and estimate the largest traffic matrix elements in a dynamic environment.",
                    "Flow sampling under hard resource constraints.",
                    "Two-level processor-sharing scheduling disciplines: mean delay analysis.",
                    "Performance analysis of LAS-based scheduling disciplines in a packet switched network.",
                    "Emulating low-priority transport at the application layer: a background transfer service.",
                    "A resource-allocation queueing fairness measure.",
                    "Measuring adversaries.",
                    "A fast simulation framework for IEEE 802.11-operated wireless LANs.",
                    "ACCEL-RATE: a faster mechanism for memory efficient per-flow traffic estimation.",
                    "VPC3: a fast and effective trace-compression algorithm.",
                    "Data streaming algorithms for efficient and accurate estimation of flow size distribution.",
                    "A game theoretic approach to provide incentive and service differentiation in P2P networks.",
                    "Failure recovery for structured P2P networks: protocol design and performance evaluation.",
                    "On zone-balancing of peer-to-peer networks: analysis of random node join.",
                    "Performance aware tasking for environmentally powered sensor networks.",
                    "On performance bounds for the integration of elastic and adaptive streaming flows.",
                    "Rate-based versus queue-based models of congestion control.",
                    "Uncooperative congestion control.",
                    "Coping with network failures: routing strategies for optimal demand oblivious restoration.",
                    "Some systems, applications and models I have known.",
                    "Characterization of queue fluctuations in probabilistic AQM mechanisms.",
                    "The output of a cache under the independent reference model: where did the locality of reference go?",
                    "Dynamics of hot-potato routing in IP networks.",
                    "The impact of BGP dynamics on intra-domain traffic.",
                    "A model of BGP routing for network engineering.",
                    "A mean-field analysis of short lived interacting TCP flows.",
                    "Bridging router performance and queuing theory.",
                    "Insensitive load balancing.",
                    "Wireless data performance in multi-cell scenarios.",
                    "CapProbe: a simple and accurate capacity estimation technique for wired and wireless environments.",
                    "Harpoon: a flow-level traffic generator for router and network tests.",
                    "Spatio-temporal available bandwidth estimation with STAB.",
                    "Optimizing the quality of scalable video streams on P2P networks.",
                    "PeerPressure for automatic troubleshooting.",
                    "A quantitative analysis of partitioning in mobile ad hoc networks.",
                    "Locating the tightest link of a network path.",
                    "Using probabilistic reasoning to automate software tuning.",
                    "Multimedia streaming via TCP: an analytic performance study.",
                    "Parameter inference of queueing models for IT systems using end-to-end measurements.",
                    "Performance analysis of BSTs in system software.",
                    "Storage device performance prediction with CART models.",
                    "Controlling the performance of 3-tiered web sites: modeling, design and implementation.",
                    "Combining routing and traffic data for detection of IP forwarding anomalies.",
                    "Exploring the performance benefits of end-to-end path switching.",
                    "Complete or fast reference trace collection for simulating multiprogrammed workloads: choose one.",
                    "Quantifying trade-offs in resource allocation for VPNs.",
                    "The origins of network server latency & the myth of connection scheduling.",
                    "A hybrid direct-indirect estimator of network internal delays.",
                    "Multicast protocols for scalable on-demand download.",
                    "Isolating the performance impacts of network interface cards through microbenchmarks.",
                    "An evaluation of chord using traces of peer-to-peer file sharing."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "SIGMETRICS 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2003",
                "sub_name": "Proceedings of the International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 2003, June 9-14, 2003, San Diego, CA, USA.",
                "count": 42,
                "papers": [
                    "DiST: a simple, reliable and scalable method to significantly reduce processor architecture simulation time.",
                    "A framework for modeling and optimization of prescient instruction prefetch.",
                    "Queueing systems with long-range dependent input process and subexponential service times.",
                    "An algorithm for computing the mean response time of a single server queue with generalized on/off traffic arrivals.",
                    "Modeling, simulation and measurements of queuing delay under long-tail internet traffic.",
                    "A hybrid systems modeling framework for fast and accurate simulation of data communication networks.",
                    "Modeling the throughput of TCP Vegas.",
                    "Maximum and asymptotic UDP throughput under CHOKe.",
                    "Fluid models and solutions for large-scale IP networks.",
                    "Resilient multicast using overlays.",
                    "Incrementally improving lookup latency in distributed hash table systems.",
                    "Measuring the effects of internet path faults on reactive routing.",
                    "Internet intrusions: global characteristics and prevalence.",
                    "Conductance and congestion in power law graphs.",
                    "Run-time modeling and estimation of operating system power consumption.",
                    "Effects of clock resolution on the scheduling of interactive and soft real-time processes.",
                    "Analysis of cycle stealing with switching cost.",
                    "A recursive random search algorithm for large-scale network parameter configuration.",
                    "Fast accurate computation of large-scale IP traffic matrices from link loads.",
                    "Analysis of LAS scheduling for job size distributions with high variance.",
                    "Fairness and efficiency in web server protocols.",
                    "Classifying scheduling policies with respect to unfairness in an M/GI/1.",
                    "Estimating membership in a multicast session.",
                    "Efficient implementation of a statistics counter architecture.",
                    "Data cache locking for higher program predictability.",
                    "Effect of node size on the performance of cache-conscious B+-trees.",
                    "Analysis of TCP's computational energy cost for mobile computing.",
                    "Traffic grooming in path, star, and tree networks: complexity, bounds, and algorithms.",
                    "Dynamic resource allocation for shared data centers using online measurements.",
                    "A self-tuning structure for adaptation in TCP/AQM networks.",
                    "Characterizing and measuring path diversity of internet topologies.",
                    "CacheCOW: providing QoS for storage system caches.",
                    "Characterization of essential dynamic instructions.",
                    "On the effectiveness of movement prediction to reduce energy consumption in wireless communication.",
                    "Robustness of multicast congestion control to inflated subscription.",
                    "Choosing an accurate network path model.",
                    "An empirical evaluation of wide-area internet bottlenecks.",
                    "Using SimPoint for accurate and efficient simulation.",
                    "Spectroscopy of DNS update traffic.",
                    "Gated asymptotic modEls (GAMEs): a new tool for the stability analysis of queueing systems.",
                    "Priority queueing with finite buffer size and randomized push-out mechanism.",
                    "Performance of estimated traffic matrices in traffic engineering."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "SIGMETRICS 2002",
        "info": "Marina del Rey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2002",
                "sub_name": "Proceedings of the International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 2002, June 15-19, 2002, Marina Del Rey, California, USA.",
                "count": 41,
                "papers": [
                    "PC based precision timing without GPS.",
                    "Maximum likelihood network topology identification from edge-based unicast measurements.",
                    "Network tomography on general topologies.",
                    "LIRS: an efficient low inter-reference recency set replacement policy to improve buffer cache performance.",
                    "Modeling and analysis of dynamic coscheduling in parallel and distributed environments.",
                    "Analysis of methods for scheduling low priority disk drive tasks.",
                    "Symbiotic jobscheduling with priorities for a simultaneous multithreading processor.",
                    "Passage time distributions in large Markov chains.",
                    "Exact aggregate solutions for M/G/1-type Markov processes.",
                    "Scalability of multicast delivery for non-sequential streaming access.",
                    "Full-system timing-first simulation.",
                    "Performance prediction for random write reductions: a case study in modeling shared memory programs.",
                    "Characterizing the d-TLB behavior of SPEC CPU2000 benchmarks.",
                    "Error-free garbage collection traces: how to cheat and not get caught.",
                    "High-density model for server allocation and placement.",
                    "Inferring client response time at the web server.",
                    "Admission control and dynamic adaptation for a proportional-delay diffserv-enabled web server.",
                    "Quality of service evaluations of multicast streaming protocols.",
                    "Characterizing user behavior and network performance in a public wireless LAN.",
                    "Energy consumption of TCP Reno, Newreno, and SACK in multi-hop wireless networks.",
                    "Improving cluster availability using workstation validation.",
                    "Limits of wide-area thin-client computing.",
                    "Dynamic statistical profiling of communication activity in distributed applications.",
                    "Toward reducing processor simulation time via dynamic reduction of microarchitecture complexity.",
                    "Evaluating tradeoffs of congestion pricing for voice calls.",
                    "Workload based optimization of probe-based storage.",
                    "Search and replication in unstructured peer-to-peer networks.",
                    "Application level traffic measurements for capacity engineering.",
                    "Context-aware TCP/IP.",
                    "On Internet backbone traffic modeling.",
                    "Some new disk scheduling policies and their performance.",
                    "On the sensitivity of cooperative caching performance to workload and network characteristics.",
                    "A microscopic analysis of TCP performance over wireless ad-hoc networks.",
                    "Adaptive random sampling for load change detection.",
                    "A method for estimating non-responsive traffic at a router.",
                    "Scheduling flows with unknown sizes: approximate analysis.",
                    "Forwarders vs. centralized server: an evaluation of two approaches for locating mobile agents.",
                    "Towards capturing representative AS-level Internet topologies.",
                    "Internet stream size distributions.",
                    "Can large disk built-in caches really improve system performance?.",
                    "Web server benchmarking using parallel WAN emulation."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "SIGMETRICS/Performance 2001",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2001",
                "sub_name": "Proceedings of the Joint International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS/Performance 2001, June 16-20, 2001, Cambridge, MA, USA.",
                "count": 46,
                "papers": [
                    "Performance modeling for fast IP lookups.",
                    "Scheduling computations on a software-based router.",
                    "Dynamic multi-path routing: asymptotic approximation and simulations.",
                    "Predictability requirements of a soft modem.",
                    "Improving dynamic voltage scaling algorithms with PACE.",
                    "Analysis and implementation of software rejuvenation in cluster systems.",
                    "A time-stamping algorithm for efficient performance estimation of superscalar processors.",
                    "Impact of fairness on Internet performance.",
                    "Hidden Markov modeling for network communication channels.",
                    "On the nonstationarity of Internet traffic.",
                    "Performance comparison of cellular and multi-hop wireless networks: a quantitative study.",
                    "Blocking in large mobile cellular networks with bursty traffic.",
                    "Capacity evaluation of frequency hopping based ad-hoc systems.",
                    "A new predictive flow control scheme for efficient network utilization and QoS.",
                    "Model-based estimation of buffer overflow probabilities from measurements.",
                    "On optimal traffic grooming in WDM rings.",
                    "Some properties of variable length packet shapers.",
                    "On the performance of multiplexing independent regulated inputs.",
                    "Characterizing the memory behavior of Java workloads: a structured view and opportunities for optimizations.",
                    "A study of memory system performance of multimedia applications.",
                    "Fixed point approximations for TCP behavior in an AQM network.",
                    "Understanding TCP vegas: a duality model.",
                    "Controlling the robots of Web search engines.",
                    "What TCP/IP protocol headers can tell us about the web.",
                    "The effects of wide-area conditions on WWW server performance.",
                    "A M/M/q queue in a semi-Markovian environment.",
                    "Analysis of SRPT scheduling: investigating unfairness.",
                    "Interval parameters for capturing uncertainties in an EJB performance model.",
                    "Automation support for software performance engineering.",
                    "Periodic broadcast and patching services: implementation, measurement, and analysis in an Internet streaming video testbed.",
                    "Towards scalable and reliable group key management.",
                    "Restoration path concatenation: fast recovery of MPLS paths.",
                    "On modeling networks of wireless microsensors.",
                    "Evaluating the performance of non-blocking synchronization on shared-memory multiprocessors.",
                    "Obtaining high performance for storage outsourcing.",
                    "Determining the geographic location of Internet hosts.",
                    "Load chracterization and anomaly detection for voice over IP traffic.",
                    "The structural cause of file size distributions.",
                    "Using approximate majorization to characterize protocol fairness.",
                    "On providing useful information for analyzing and tuning applications.",
                    "Alternative techniques for the efficient acquisition of haptic data.",
                    "Online prediction of the running time of tasks.",
                    "Analyzing robot behavior in e-business sites.",
                    "Characterization of user access to streaming media files.",
                    "Performance modeling of elastic traffic in overload.",
                    "Fast firewall implementations for software-based and hardware-based routers."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "SIGMETRICS 2000",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/2000",
                "sub_name": "Proceedings of the 2000 ACM SIGMETRICS international conference on Measurement and modeling of computer systems, Santa Clara, CA, USA, June 18-21, 2000.",
                "count": 39,
                "papers": [
                    "A case for end system multicast.",
                    "PLM: fast convergence for cumulative layered multicast transmisson schemes.",
                    "On achievable service differentiation with token bucket marking for TCP.",
                    "Feasibility of a serverless distributed file system deployed on an existing set of desktop PCs.",
                    "Comparing random data allocation and data striping in multimedia servers.",
                    "Modeling and performance of MEMS-based storage devices.",
                    "Implications of proxy caching for provisioning networks and servers.",
                    "Collaborative Web caching based on proxy affinities.",
                    "Cluster reserves: a mechanism for resource management in cluster-based network servers.",
                    "Analysis of the phenomenon of several slow start phases in TCP (poster).",
                    "Providing guaranteed quality of service for interactive visualization applications (poster).",
                    "IP multicast fault recovery in PIM over OSPF (poster).",
                    "Cell-based multicast grouping in large-scale virtual environments (poster).",
                    "Temporal locality in Web request streams: sources, characteristics, and caching implications (poster).",
                    "Automated disk drive characterization (poster).",
                    "Online superpage promotion revisited (poster).",
                    "An inherently loss-less and bandwidth-efficient periodic broadcast scheme for VBR video (poster).",
                    "An analysis of short-term fairness in wireless media access protocols (poster).",
                    "RESCU: dynamic hybrid packet-loss recovery for video transmission over the Internet (poster).",
                    "The content and access dynamics of a busy Web server (poster).",
                    "TCP in presence of bursty losses.",
                    "The incremental deployability of RTT-based congestion avoidance for high speed TCP Internet connections.",
                    "Detecting shared congestion of flows via end-to-end measurement.",
                    "Measurement and analysis of LDAP performance.",
                    "IP packet generation: statistical models for TCP start times based on connection-rate superposition.",
                    "On the impact of soft hand-off in cellular systems.",
                    "Delay asymptotics for a priority queueing system.",
                    "A fast and accurate iterative solution of a multi-class threshold-based queueing system with hysteresis.",
                    "Using the exact state space of a Markov model to compute approximate stationary measures.",
                    "AMVA techniques for high service time variability.",
                    "Efficient performance prediction for modern microprocessors.",
                    "Improving interactive performance using TIPME.",
                    "Quantifying the energy consumption of a pocket computer and a Java virtual machine.",
                    "Memory system behavior of Java programs: methodology and analysis.",
                    "An analytical model of the working-set sizes in decision-support systems.",
                    "Towards application/file-level characterization of block references: a case for fine-grained buffer management.",
                    "Online multicast routing with bandwidth guarantees: a new approach using multicast network flow.",
                    "Stable Internet routing without global coordination.",
                    "An efficient algorithm for finding a path subject to two additive constraints."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "SIGMETRICS 1999",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1999",
                "sub_name": "Proceedings of the 1999 ACM SIGMETRICS international conference on Measurement and modeling of computer systems, Atlanta, Georgia, USA, May 1-4, 1999.",
                "count": 37,
                "papers": [
                    "Simulation of nonGaussian Long-Range-Dependent Traffic Using Wavelets.",
                    "Bandwidth-Efficient Continuous Media Streaming Through Optimal Multiplexing.",
                    "Evaluating Synchronization on Shared Address Space Multiprocessors: Methodology and Performance.",
                    "Availability and Utility of Idle Memory in Workstation Clusters.",
                    "Trace Reduction for Virtual Memory Simulations.",
                    "A Large-Scale Study of File-System Contents.",
                    "NFS Sensitivity to High Performance Networks.",
                    "Modeling and Optimizing I/O Throughput of Multiple Disks on a Bus.",
                    "Optimal Stochastic Scheduling in Multiclass Parallel Queues.",
                    "Mean Value Technique for Closed Fork-Join Networks.",
                    "On Management of Free Space in Compressed Memory Systems.",
                    "EELRU: Simple and Effective Adaptive Page Replacement.",
                    "On the Existence of a Spectrum of Policies that Subsumes the Least Recently Used (LRU) and Least Frequently Used (LFU) Policies.",
                    "Multi-Layer Tracing of TCP over a Reliable Wireless Link.",
                    "On the Behavior of Different TCP Algorithms over a Wireless Channel With Correlated Packet Losses.",
                    "A Third-Party Value-Added Network Service Approach to Reliable Multicast.",
                    "Web Prefetching Between Low-Bandwidth Clients and Proxies: Potential and Performance.",
                    "A Performance Evaluation of Hyper Text Transfer Protocols.",
                    "Hierarchical Resource Management for Web Server Clusters with Dynamic Content.",
                    "An Adaptive Globally-Synchronizing Clock Algorithm and its Implementation on a Myrinet-based PC Cluster.",
                    "A Performance Study of Dynamic Replication Techniques in Continuous Media Servers.",
                    "Relative Differentiated Services in the Internet: Issues and Mechanisms.",
                    "Potentials and Limitations of Fault-Based Markov Prefetching for Virtual Memory Pages.",
                    "On the Use of Trace Sampling for Architectural Studies of Desktop Applications.",
                    "Workload Modeling for Highly Interactive Applications.",
                    "Design and Evaluation of Congestion Control Algorithms in the Future Internet.",
                    "Address Trace Compression Through Loop Detection and Reduction.",
                    "Performance Issues in WWW Servers.",
                    "Supporting Best-Effort Traffic With Fair Service Curve.",
                    "A TCP-Friendly Rate Adjustment Protocol for Continuous Media Flows over Best Effort Networks.",
                    "Using Pathchar to Estimate Internet Link Characteristics.",
                    "Self-Tuning Synchronization Mechanisms in Network Operating Systems.",
                    "Performance Evaluation and Validation of Microprocessors.",
                    "Controlling Memory Contention on a Scalable Multiprocessor-Based Telephone Switch.",
                    "Model-Based Performance Analysis of an EDP/ERP-Oriented Wide Area Network.",
                    "The Value of a Systematic Approach to Measurement and Analysis: An ISP Case Study.",
                    "Improving Performance of Data Analysis in Data Warehouses: A Methodology and Case Study."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "SIGMETRICS 1998",
        "info": "Madison, Wisconsin, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1998",
                "sub_name": "Proceedings of the 1998 ACM SIGMETRICS joint international conference on Measurement and modeling of computer systems, SIGMETRICS '98 / PERFORMANCE '98, Madison, Wisconsin, USA, June 22-26, 1998.",
                "count": 34,
                "papers": [
                    "Faster IP Lookups Using Controlled Prefix Expansion.",
                    "On Calibrating Measurements of Packet Transit Times.",
                    "Modeling Communication Pipeline Latency.",
                    "Implementing Cooperative Prefetching and Caching in a Globally-Managed Memory System.",
                    "Cello: A Disk Scheduling Framework for Bext Generation Operating Systems.",
                    "The Impact of I/O on Program Behavior and Parallel Scheduling.",
                    "Is Service Priority Useful in Networks?",
                    "Improving TCP Throughput over Two-Way Asymmetric Links: Analysis and Solutions.",
                    "Asymptotic Behavior of Global Recovery in SRM.",
                    "The Busy Period in the Fluid Queue.",
                    "Transient Loss Performance of a Class of Finite Buffer Queueing Systems.",
                    "Queueing-Based Analysis of Broadcast Optical Networks.",
                    "Predicting MPEG Execution Times.",
                    "Self-Similarity in File Systems.",
                    "Generating Representative Web Workloads for Network and Server Performance Evaluation.",
                    "Performance Measurements for Multithreaded Programs.",
                    "A Methodology and an Evaluation of the SGI Origin2000.",
                    "An Analytic Behavior Model for Disk Drives with Readahead Caches and Request Reordering.",
                    "Modeling Set Associative Caches Behavior for Irregular Computations.",
                    "Inter-Receiver Fairness: A Novel Performance Measure for Multicast ABR Sessions.",
                    "Application and Evaluation of Large Deviation Techniques for Traffic Engineering in Broadband Networks.",
                    "The Concept of Relevant Time Scales and Its Application to Queuing Analysis of Self-Similar Traffic (or Is Hurst Naughty or Nice?).",
                    "Scheduling with Implicit Information in Distributed Systems.",
                    "Scheduling Policies to Support Distributed 3D Multimedia Applications.",
                    "LoGPC: Modeling Network Contention in Message-Passing Programs.",
                    "Modeling and Optimizing I/O Throughput of Multiple Disks on a Bus (Summary).",
                    "The Performance of Work Stealing in Multiprogrammed Environments (Extended Abstract).",
                    "Task Assignment in a Distributed System: Improving Performance by Unbalancing Load (Extended Abstract).",
                    "A Self-Scaling and Self-Configuring Benchmark for Web Servers (Extended Abstract).",
                    "On Performance of Caching Proxies (Extended Abstract).",
                    "Total Acknowledgements: A Robust Feedback Mechanism for End-to-End Congestion Control (Extended Abstract).",
                    "Portable, Continuous Recording of Complete Computer Behavior with Low Overhead (Extended Abstract).",
                    "Using Idle Memory for Data-Intensive Computations (Extended Abstract).",
                    "Temporally Determinate Disk Access: An Experimental Approach (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "SIGMETRICS 1997",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1997",
                "sub_name": "Proceedings of the 1997 ACM SIGMETRICS international conference on Measurement and modeling of computer systems, Seattle, Washington, USA, June 15-18, 1997.",
                "count": 26,
                "papers": [
                    "Architecture and Performance of Large Internets, Based on Terrestrial and Satellite Infrastructure (Abstract).",
                    "Analyzing Stability in Wide-Area Network Performance.",
                    "Performance Issues of Enterprise Level Web Proxies.",
                    "A New Method for Analysing Feedback-Based Protocols with Applications to Engineering Web Traffic over the Internet.",
                    "Queue Management for Explicit Rate Based Congestion Control.",
                    "TCP over ATM: ABR or UBR?",
                    "Scalable Reliable Multicast Using Multiple Multicast Groups.",
                    "Performance Debugging Shared Memory Parallel Programs Using Run-Time Dependence Analysis.",
                    "Preprototyping SIMD Coprocessors Using Virtual Machine Emulation and Trace Compilation.",
                    "Informed Multi-Process Prefetching and Caching.",
                    "Adaptive Page Replacement Based on Memory Reference Behavior.",
                    "Managing Server Load in Global Memory Systems.",
                    "Size-Limited Batch Movement in Product-Form Closed Discrete-Time Queueing Networks.",
                    "Bounding of Performance Measures for a Threshold-based Queueing System with Hysteresis.",
                    "Using Real-Time Queueing Theory to Control Lateness in Real-Time Systems.",
                    "Cache Behavior of Network Protocols.",
                    "Second Moment Resource Allocation in Multi-Service Networks.",
                    "On the Characterization of VBR MPEG Streams.",
                    "File System Aging - Increasing the Relevance of File System Benchmarks.",
                    "Operating System Benchmarking in the Wake of Lmbench: A Case Study of the Performance of NetBSD on Intel x86 Architecture.",
                    "The Utility of Exploiting Idle Workstations for Parallel Computation.",
                    "A Performance Evaluation of Cluster-Based Architectures.",
                    "Design and Evaluation of a DRAM-based Shared Memory ATM Switch.",
                    "Efficient Retrieval of Composite Multimedia Objects in the JINSIL Distributed System.",
                    "File Server Scaling with Network-Attached Secure Disks.",
                    "Group-Guaranteed Channel Capacity in Multimedia Storage Servers."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "SIGMETRICS 1996",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1996",
                "sub_name": "Proceedings of the 1996 ACM SIGMETRICS international conference on Measurement and modeling of computer systems, Philadelphia, Pennsylvania, USA, May 23-26, 1996.",
                "count": 30,
                "papers": [
                    "Bringing Real-Time Scheduling Theory and Practice Closer for Multimedia Computing.",
                    "Exploiting Process Lifetime Distributions for Dynamic Load Balancing.",
                    "Effective Distributed Scheduling of Parallel Workloads.",
                    "Limits on the Performance Benefits of Multithreading and Prefetching.",
                    "Fast Message Assembly Using Compact Address Relations.",
                    "Coordinated Allocation of Memory and Processors in Multiprocessors.",
                    "Embra: Fast and Flexible Machine Simulation.",
                    "Experiences with Network Simulation.",
                    "Asynchronous Updates in Large Parallel Systems.",
                    "Design and Analysis of Frame-Based Fair Queuing: A New Traffic Scheduling Algorithm for Packet Switched Networks.",
                    "Networking Support for Large Scale Multiprocessor Servers.",
                    "Web Server Workload Characterization: The Search for Invariants.",
                    "Integrating Performance Monitoring and Communication in Parallel Computers.",
                    "Micro-Architecture Evaluation Using Performance Vectors.",
                    "Self-Similarity in World Wide Web Traffic: Evidence and Causes.",
                    "On the Modeling and Performance Characteristics of a Serpentine Tape Drive.",
                    "An Analytic Model of Hierachical Mass Storage Systems with Network-Attached Storage Devices.",
                    "An Approximate Analysis of Waiting Time in Multi-Class M/G/1/./EDF Queues.",
                    "On Optimal Piggyback Merging Policies for Video-on-Demand Systems.",
                    "Experiments with Digital Video Playback.",
                    "Supporting Stored Video: Reducing Rate Variability and End-to-End Resource Requirements through Optimal Smoothing.",
                    "Analysis of Balanced Fork-Join Queueing Networks.",
                    "Efficient Exploration of Availability Models Guided by Failure Distances.",
                    "Minimizing Completion Time of a Program by Checkpointing and Rejuvenation.",
                    "Integrating Parallel Prefetching and Caching.",
                    "A Buffer Model for Evaluating the Performance of R-Tree Packing Algorithms.",
                    "An Approach to Selecting Metrics for detecting Performance Problems in Information Systems.",
                    "RAIDframe: Rapid Prototyping for Disk Arrays.",
                    "Quantifying Achievable Routing Performance in Multiprocessor Interconnection Networks.",
                    "Analysis of the Early Workload on the Cornell Theory Center IBM SP2."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "SIGMETRICS 1995",
        "info": "Ottawa, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1995",
                "sub_name": "Proceedings of the 1995 ACM SIGMETRICS joint international conference on Measurement and modeling of computer systems, Ottawa, Canada, May 15-19, 1995.",
                "count": 45,
                "papers": [
                    "Memory System Performance of UNIX on CC-NUMA Multiprocessors.",
                    "Talisman: Fast and Accurate Multicomputer Simulation.",
                    "Reducing I/O Demand in Video-On-Demand Storage Servers.",
                    "On Configuring a Single Disk Continuous Media Server.",
                    "A Traffic Model for MPEG-Coded VBR Streams.",
                    "Network Traffic Measurement and Modelling (Panel).",
                    "G-Networks - New Queueing Models with Additional Control Capabilities (Panel).",
                    "Free Performance and Fault Tolerance: Using System Idle Capacity Efficiently (Panel).",
                    "Data Interpretation and Experiment Planning in Performance Tools (Panel).",
                    "A Case for Two-Level Distributed Recovery Schemes.",
                    "An Analysis of Decay-Usage Scheduling in Multiprocessors.",
                    "Fundamental Results on the Performance of ATM Multiplexers with Applications to Video Teleconferencing.",
                    "Fundamental Limits and Tradeoffs of Providing Deterministic Guarantees to VBR Video Traffic.",
                    "Exponential Bounds for the Waiting Time Distribution in Markovian Queues, with Applications to TES/GI/I Systems.",
                    "Optimal Probabilistic Allocation of Customer Types to Server.",
                    "Z-Iteration: A Simple Method for Throughput Estimation in Time-Dependent Multi-Class Systems.",
                    "Striping in a RAID Level 5 Disk Array.",
                    "On-Line Extraction of SCSI Disk Drive Parameters.",
                    "DASD Dancing: A Disk Load Balancing Optimization Scheme for Video-on-Demand Computer.",
                    "An Analytic Study of Dynamic Hardware and Software Cache Coherence Strategies.",
                    "SM-prof: A Tool to Visualise and Find Cache Coherence Performance Bottlenecks in Multiprocessor Programs.",
                    "A Study of Integrated Prefetching and Caching Strategies.",
                    "On Characterizing Bandwidth Requirements of Parallel Applications.",
                    "Scheduling Memory Constrained Jobs on Distributed Memory Parallel Computers.",
                    "Active Memory: A New Abstraction for Memory-System Simulation.",
                    "Calculating Transient Distributions of Cumulative Reward.",
                    "Regenerative Randomization: Theory and Application Examples.",
                    "Computational Techniques for Accurate Performance Evaluation of Multirate, Multihop Communication Networks.",
                    "The Internet in Evolution, and TCP Over ATM (Panel).",
                    "Non-Markovian Petri Nets (Panel).",
                    "Performance Impacts of Self-Similarity in Traffic (Panel).",
                    "The Interaction of Parallel and Sequential Workloads on a Network of Workstations.",
                    "Disk-Tape Joins: Synchronizing Disk and Tape Access.",
                    "An Inter-Reference Gap Model for Temporal Locality in Program Behavior.",
                    "Batch Class Process Scheduler for Unix SVR4.",
                    "State Space Reductions Using Stochastic Well-Formed Net Simplifications: An Application to Random Polling Systems.",
                    "Approximate Response Time Distribution in Fork and Join Systems.",
                    "A Semi-Empirical Approach to Scalability Study.",
                    "PEDCAD: A Framework for Performance Evaluation of Object Database Applications.",
                    "Scheduling for Cache Affinity in Parallelized Communication Protocols.",
                    "Modeling and Analysis of Multi Channel Asymmetric Packet Switch Modules in a Bursty and Non-Uniform Traffic Environment.",
                    "Timepatch: A Novel Technique for the Parallel Simulation of Multiprocessor Caches.",
                    "Future Applicability of Bus-Based Shared Memory Multiprocessors.",
                    "Modeling A Fibre Channel Switch with Stochastic Petri Nets.",
                    "A Prefetching Prototype for the Parallel File System on the Paragon."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "SIGMETRICS 1994",
        "info": "Nashville, Tennessee, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1994",
                "sub_name": "Proceedings of the 1994 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Vanderbilt University, Nashville, Tennessee, USA, May 16-20, 1994.",
                "count": 35,
                "papers": [
                    "The Fifteenth Level.",
                    "Analysis of the Impact of Memory in Distributed Parallel Processing Systems.",
                    "Processor Allocation Policies for Message-Passing Parallel Computers.",
                    "Use of Application Characteristics and Limited Preemption for Run-to-Completion Parallel Processor Scheduling Policies.",
                    "Scheduling Multiple Queries on a Parallel Machine.",
                    "Accurate Modeling of the Hybrid Hash Join Algorithm.",
                    "Asymtotic Performance of a Buffer Model in a Data Sharing Environment.",
                    "Approximate Mean Value Analysis of Client-Server Systems with Multi-class Requests.",
                    "Arrival Theorems for Product-Form Stochastic Petri Nets.",
                    "Phased-Mission System Analysis Using Boolean Algebraic Methods.",
                    "SynRGen: An Extensible File Reference Generator.",
                    "Generative Networkload Models for a Single Server Environment.",
                    "Shade: A Fast Instruction-Set Simulator for Execution Profiling.",
                    "An Empirical Study of a Highly Available File System.",
                    "A Quantitative Analysis of Cache Policies for Scalable Network File Systems.",
                    "The Expected Lifetime of \"Single-Address-Space\" Operating Systems.",
                    "An Approach to Scalability Study of Shared Memory Parallel Systems.",
                    "A Comparison of Two Model-Based Performance-Prediction Techniques for Message-Passing Parallel Programs.",
                    "A Multi-Level Solution Algorithm for Steady-State Markov Chains.",
                    "An Adaptive Memory Management Protocol for Time Warp Simulation.",
                    "Providing End-to-End Statistical Performance Guarantees with Bounding Interval Dependent Stochastic Models.",
                    "A Comparison of Sender-Initiated and Receiver-Initiated Reliable Multicast Protocols.",
                    "Time-Parallel Simulation of Cascaded Statistical Multiplexers.",
                    "Scheduling Algorithms for Modern Disk Drives.",
                    "Optimal Multiphase Complete Exchange on Circuit-Switched Hypercube Architectures.",
                    "Cache Interference Phenomena.",
                    "Profiling the X Protocol.",
                    "Toward Workload Characterization of Video Server and Digital Library Applications.",
                    "A Case Study of File System Workload in a Large-Scale Distributed Environment.",
                    "A Comparison of Techniques for Diagnosing Performance Problems In Information Systems.",
                    "Efficient User-Level Communication on Multicomputers with an Optimistic Flow-Control Protocol.",
                    "Modeling RPC Performance.",
                    "Stochastic Performance Models of Parallel Task Systems.",
                    "Kernel-Based Memory Simulation.",
                    "Performance Prediction of Parallel Systems with Scalable Specifications - Methodology and Case Study."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "SIGMETRICS 1993",
        "info": "Santa Clara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1993",
                "sub_name": "Proceedings of the 1993 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Santa Clara, California, USA, May 10-14, 1993.",
                "count": 32,
                "papers": [
                    "A New Approach to I/O Performance Evaluation - Self-Scaling I/O Benchmarks, Predicted I/O Performance.",
                    "Trace Driven Analysis of Write Caching Policies for Disks.",
                    "Efficient Simulation of Caches under Optimal Replacement with Applications to Miss Characterization.",
                    "Cache Inclusion and Processor Sampling in Multiprocessor Simulations.",
                    "The Wisconsin Wind Tunnel: Virtual Prototyping of Parallel Computers.",
                    "The Influence of Random Delays on Parallel Execution Times.",
                    "The KSR1: Experimentation and Modeling of Poststore.",
                    "The Process-Flow Model: Examining I/O Performance from the System's Point of View.",
                    "An Analytic Performance Model of Disk Arrays.",
                    "MEASURE+ - A Measurement-Based Dependability Analysis Package.",
                    "On the Sensitivity of Transient Solutions of Markov Models.",
                    "Parallel Simulation of Markovian Queueing Networks Using Adaptive Uniformization.",
                    "The Accuracy of Trace-Driven Simulations of Multiprocessors.",
                    "Processor Scheduling on Multiprogrammed, Distributed Memory Parallel Computers.",
                    "Performance Comparison of Thrashing Control Policies for Concurrent Mergesorts with Parallel Prefetching.",
                    "A Markov-Modulated Bernoulli Process Approximation for the Analysis of Banyan Networks.",
                    "Modeling and Validation of the Real-Time Mach Scheduler.",
                    "ROBUST: A Hardware Solution to Real-Time Overload.",
                    "Efficient On-Line Processor Scheduling for a Class of IRIS (Increasing Reward with Increasing Service.) Real-Time Tasks.",
                    "Analysis of Superposition of Streams into a Cache Buffer.",
                    "Analyzing Multiprocessor Cache Behavior Through Data Reference Modeling.",
                    "Effectiveness of Trace Sampling for Performance Debugging Tools.",
                    "Hybrid Technique for Simulating High Bandwidth Delay Computer Networks.",
                    "An Analysis of the Information Content of Address and Data Reference Streams.",
                    "An Evaluation of Alternative Virtual Replication Strategies for Continuous Retrieval of Multimedia Data.",
                    "A Summary of TCP/IP Networking Software Performance for the DECstation 5000.",
                    "Asynchronous Analysis of Parallel Dynamic Programming.",
                    "Evaluation of Load Sharing in HARTS while Considering Message Routing and Broadcasting.",
                    "Benefits of Cache-Affinity Scheduling in Shared-Memory Multiprocessors: A Summary.",
                    "A Composite Modelling Approach to Software Performance Measurement.",
                    "Approximate Mean Value Analysis of Interconnection Networks with Deflection Routing.",
                    "Optimizing File Transfer Response Time Using the Loss-Load Curve Congestion Control Mechanism."
                ]
            },
            {
                "sub_name_abbr": "conf/sigmetrics/1993t",
                "sub_name": "Performance Evaluation of Computer and Communication Systems, Joint Tutorial Papers of Performance '93 and Sigmetrics '93, Santa Clara, CA, USA, May 10-14, 1993.",
                "count": 26,
                "papers": [
                    "Parallel Simulation.",
                    "Properties and Analysis of Queueing Network Models with Finite Capacities.",
                    "Performance Analysis and Optimization with the Power-Series Algorithm.",
                    "Metropolitan Area Networks (MANs): Protocols, Modeling and Performance Evaluation.",
                    "Multiprocessor and Distributed System Design: The Integration of Functional Specification and Performance Analysis Using Stochastic Process Algebras.",
                    "Response Time Distributions in Queueing Network Models.",
                    "Fast Simulation of Rare Events in Queueing and Reliability Models.",
                    "An Introduction to Modeling Dynamic Behavior with Time Series Analysis.",
                    "Issues in Trace-Driven Simulation.",
                    "Maximum Entropy Analysis of Queueing Network Models.",
                    "Performance Modeling Using DSPNexpress.",
                    "Relaxation for Massively Parallel Discrete Event Simulation.",
                    "The BMAP/G/1 QUEUE: A Tutorial.",
                    "An Overview of Tes Processes and Modeling Methodology.",
                    "Performance Engineering of Client-Server Systems.",
                    "Queueing Networks with Finite Capacities.",
                    "Real Time Systems: A Tutorial.",
                    "Performance Instrumentation Techniques for Parallel Systems.",
                    "A Survey of Bottleneck Analysis in Closed Networks of Queues.",
                    "Software Performance Engineering.",
                    "Performance Measurement Using System Monitors.",
                    "Providing Quality of Service Packet Switched Networks.",
                    "Dependability and Performability Analysis.",
                    "Architectures and Algorithms for Digital Multimedia On-Demand Servers.",
                    "Analysis and Control of Poling Systems.",
                    "Modeling and Analysis of Transaction Processing Systems."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "SIGMETRICS 1992",
        "info": "Newport, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1992",
                "sub_name": "Proceedings of the 1992 ACM SIGMETRICS joint international conference on Measurement and modeling of computer systems, Newport, Rhode Island, USA, June 1-5, 1992.",
                "count": 32,
                "papers": [
                    "MemSpy: Analyzing Memory System Bottlenecks in Programs.",
                    "Fast Instruction Cache Performance Evaluation Using Compile-Time Analysis.",
                    "An Analysis of Dynamic Page Replacement on a NUMA Multiprocessor.",
                    "Analysis of the Generalized Clock Buffer Replacement Scheme for Database Transaction Processing.",
                    "Collection of Customers: a Correlated M/G/1 Queue.",
                    "Subexponential Tail Distribution in LaPalice Queues.",
                    "A Reservation Based Cyclic Server Queue With Limited Service.",
                    "Analysis of File I/O Traces in Commercial Computing Environments.",
                    "Cluster-Based File Replication in Large-Scale Distributed Systems.",
                    "Performance Analysis of Dynamic Finite Versioning for Concurrency Transaction and Query Processing.",
                    "Performance of Locking Policies with Limited Wait Depth.",
                    "On Computing Per-session Performance Bounds in High-Speed Multi-hop Computer Networks.",
                    "Algorithmic Approach to Bounding the Mean Response Time of a Minimum Expected Delay Routing System.",
                    "State Space Exploration in Markov Models.",
                    "Factors in the Performance of the AN1 Computer Network.",
                    "Performance Comparison of Routing Protocols using MaRS: Distance-Vector versus Link-State.",
                    "Closed-Loop Control with Delayed Information.",
                    "Analytical Models of Combining Banyan Networks.",
                    "Performance Analysis of \"Time Warp\" with Limited Memory.",
                    "Scheduling Parallelizable Tasks: Putting it All on the Shelf.",
                    "Derivatives of Likelihood Ratios and Smoothed Perturbation Analysis for the Routing Problem.",
                    "Studying the Performance Properties of Concurrent Programs by Simulation Experiments on Synthetic Programs.",
                    "Characterizing and Interpreting Periodic Behavior in Computer Systems.",
                    "High Performance Cache Management for Sequential Data Access.",
                    "Multiprocessor Systems with General Breakdowns and Repairs.",
                    "PROTEUS: A High-Performance Parallel-Architecture Simulator.",
                    "Performance Analysis of Communications in Static Interconnection Networks.",
                    "Characterization of Database Access Skew in a Transaction Processing Environment.",
                    "Xprof: Profiling the Execution of X Window Programs.",
                    "Elevator-Type Polling Systems.",
                    "Parallel Simulation of Stochastic Petri Nets Using Recurrence Equations.",
                    "Modelling and Performances Analysis of a Parallel Theorem Prover."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "SIGMETRICS 1991",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1991",
                "sub_name": "Proceedings of the 1991 ACM SIGMETRICS conference on Measurement and modeling of computer systems, San Diego, California, USA, May 21-24, 1991.",
                "count": 28,
                "papers": [
                    "Performance Analysis of a Broadcast Communications Protocol.",
                    "An Analytical Model of Operating System Protocol Processing Including Effects of Multiprogramming.",
                    "Load Sharing In Limited Access Distributed Systems.",
                    "Scheduling Periodic and Aperiodic Tasks in Hard Real-Time Computing Systems.",
                    "An Approach to Detecting Changes in the Factors Affecting the Performance of Computer Systems.",
                    "A Synthetic Workload Model for a Distributed System File Server.",
                    "A Markov Chain Approximation for the Analysis of Banyan Networks.",
                    "Performance Analysis of Finite-Buffered Multistage Interconnection Networks with a General Traffic Pattern.",
                    "A Model for Estimating Trace-Sample Miss Ratios.",
                    "Experience with Mean Value Analysis Models for Evaluating Shared Bus, Throughput-Oriented Multiprocessors.",
                    "Performance Analysis of Time Warp with Homogeneous Processors and Exponential Task Times.",
                    "On Subcube Dependability in a Hypercube.",
                    "The Impact of Operating System Scheduling Policies and Synchronization Methods of the Performance of Parallel Application.",
                    "Processor-Pool-Based Scheduling for Large-Scale NUMA Multiprocessors.",
                    "Analysis of Task Migration in Shared-Memory Multiprocessor Scheduling.",
                    "Analytical Modeling of a Hierarchical Buffer for a Data Sharing Environment.",
                    "Performance Analysis of Concurrent-Read Exclusive-Write.",
                    "Performance Measurement of a Parallel Input/Output System for the Intel iPSC/2 Hypercube.",
                    "Performance of a RAID Prototype.",
                    "Performance od a Mirrored Disk in a Real-Time Transaction System.",
                    "Instrumentation for a Massively Parallel MIMD Application.",
                    "MTOOL: A Method for Detecting Memory Bottlenecks.",
                    "Implementing Stack Simulation for Highly-Associative Memories.",
                    "Performance Analysis Case Study: Application of Experimental Design & Statistical Data Analysis Techniques.",
                    "Measurements of the Paging Behavior of UNIX.",
                    "A Static and Dynamic Workload Characterization Study of the San Diego Supercomputer Center Cray X-MP.",
                    "An Experiment on Measuring Application Performance over the Internet.",
                    "A Parallel Branch-and Bound Algorithm for MIN-Based Multiprocessors."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "SIGMETRICS 1990",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1990",
                "sub_name": "Proceedings of the 1990 ACM SIGMETRICS conference on Measurement and modeling of computer systems, University of Colorado, Boulder, Colorado, USA, May 22-25, 1990.",
                "count": 39,
                "papers": [
                    "Unboundedly Parallel Simulations Via Recurrence Relations.",
                    "A Performance Evaluation of a General Parallel Processing Model.",
                    "Efficient Trace-Driven Simulation Methods for Cache Performance Analysis.",
                    "Techniques for Efficient Inline Tracing on a Shared-Memory Multiprocessor.",
                    "Blocking: Exploiting Spatial Locality for Trace Compaction.",
                    "A Bayesian Appraoch to Fault Classification.",
                    "Probabilistic Language Analysis of Weighted Voting Algorithms.",
                    "An Evaluation of Redundant Arrays of Disks Using an Amdahl 5890.",
                    "Simultaneous Analysis of Flow and Error Control Strategies With Congestion-Dependent Errors.",
                    "Queueing Analysis of an ATM Switch with Multichannel Transmission Groups.",
                    "Approximate Analysis of Reader and Writer Access to a Shared Resource.",
                    "Quartz: A Tool for Tuning Parallel Program Performance.",
                    "A Calculus of Variations Approach to File Allocation Problems in Computer Systems.",
                    "Data Cache Management Using Frequency-Based Replacement.",
                    "An Approximate Analysis of the LRU and FIFO Buffer Replacement Schemes.",
                    "An Advisor for Flexible Working Sets.",
                    "Analysis of Critical Architectural and Program Parameters in a Hierarchical Shared Memory Multiprocessor.",
                    "Performance Evaluation of a Commercial Cache-Coherent Shared Memory Multiprocessor.",
                    "Performance Analysis of the Connection Machine.",
                    "An Analytical Model of Multistage Interconnection Networks.",
                    "Dynamic Partitioning in a Transputer Environment.",
                    "Processor Scheduling in Shared Memory Multiprossors.",
                    "The Performance of Multiprogrammed Multiprocessor Scheduling Policies.",
                    "Efficient Simulation of Multiprogramming.",
                    "Making Flow Control Work in Networks: A Control-Theoretic Analysis of Gateway Service Disciplines.",
                    "Making Greed Work in Networks: A Game-Theoretic Analysis of Gateway Service Disciplines.",
                    "Factors Affecting the Performance of Multiuser Database Management Systems.",
                    "A Benchmark of NonStop SQL Release 2 Demonstrating Near-Linear Speedup and Scaleup on Large Databases.",
                    "Phased Mission Reliability Analysis.",
                    "Performance Analysis of a Fault Tolerant Computer System.",
                    "Ray Tracing on Distributed Memory Parallel Systems.",
                    "Characterizing and Modeling Ethernet Performance of Distributed DECwindows Applications.",
                    "Challenges in Obtaining Peak Parallel Performance with a Convex C240, a Parallel Vector Processor.",
                    "Traffic Characterization of the NSFNET National Backbone.",
                    "Ease: An Environment for Architecture Study and Experimentation.",
                    "Dynamic Queue Behavior in Networks with Window Protocols.",
                    "The Performance of Multistage Interconnection Networks with Finite Buffers.",
                    "Adaptive Window Flow Control and Learning Algorithms for Adaptive Routing in Data Networks.",
                    "Modeling a Circuit Switched Multiprocessor Interconnect."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "SIGMETRICS 1989",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1989",
                "sub_name": "Proceedings of the 1989 ACM SIGMETRICS international conference on Measurement and modeling of computer systems, Berkeley, California, USA, May 23-26, 1989.",
                "count": 53,
                "papers": [
                    "The Placement Optimization Program: A Practical Solution to the Disk File Assignment Problem.",
                    "Diversity in Database Reference Behavior.",
                    "A Statistical Approach to Diagnosing Intermittent Performance-Problems Using Monotone Relationships.",
                    "Bounding Availability of Repairable Computer Systems.",
                    "Performance of Optimistic Make.",
                    "The Performance Implications of Thread Management Alternatives for Shared-Memory Multiprocessors.",
                    "Optimistic Implementation of Bulk Data Transfer Protocols.",
                    "TRAPEDS: Producing Traces for Multicomputers Via Execution Driven Simulation.",
                    "Behavioral Characterization of Multiprocessor Memory Systems: A Case Study.",
                    "Mache: No-Loss Trace Compaction.",
                    "Evaluation of Retransmission Strategies in a Local Area Network Environment.",
                    "Finite Buffers and Fast Multicast.",
                    "Performance of a Dual-Bus Unidirectional Broadcast Network Operating Under a Probabilistic Scheduling Strategy.",
                    "Solution of Closed, Product Form, Queueing Networks via the RECAL and Tree-RECAL Methods on a Shared Memory Multiprocessor.",
                    "Feedback Queues with Preemption-Distance Priorities.",
                    "Parallel Simulation of Queueing Networks: Limitations and Potentials.",
                    "Control and Coordination Policies for Systems with Buffers.",
                    "Accurate Modeling of Parallel Scientific Computations.",
                    "Characterizations of Parallelism in Applications and Their Use In Scheduling.",
                    "An Approximation to the Response Time for Shortest Queue Routing.",
                    "Approximating Response Time Distributions.",
                    "A Closed Network with a Discriminatory Processor-Sharing Server.",
                    "Workload Characterization for Tightly-Coupled and Loosely-Coupled Systems.",
                    "UNIX Performance Evaluation.",
                    "Experimental Methods in Reliability Measurement.",
                    "Modeling the Effect of Reliability on Performance.",
                    "Performance Prediction Modeling: A Tutorial.",
                    "Introduction to Queueing Network Models.",
                    "Congestiion Control in Computer Networks.",
                    "Network Protocol Performance.",
                    "Measurement Techniques for Distributed Systems During Operation.",
                    "CPU Cache Memories.",
                    "PC Workload Characterization.",
                    "Integrating Monitoring and Modeling for Evaluation of Multiprocessor Systems.",
                    "An Example of Validation and Evaluation ofa Concurrent Program: Lamport's Fast Mutual Exclusion Algorithm.",
                    "A Pseudoconservation Law for Service Systems with a Polling Table.",
                    "The Effect of High Performance Processors in Butterfly Multiprocessor System (Extended Abstract).",
                    "Performability Modelling Using Dynamic Queueing Networks.",
                    "Traffic Studies of Unbuffered Delta Networks.",
                    "A Simulation Study of Simultaneous Vector Prefetch Performance in Multiprocessor Memory Subsystems (Extended Abstract).",
                    "Modeling Multibus Interconnection Networks Using State Aggregation.",
                    "File Migration in Distributed File Systems without Replication.",
                    "Design and Evaluation of A Watermark-Based Lazy Buddy System.",
                    "Some Applications of Gibbs Ensemble Theory to Systems Performance Analysis.",
                    "Memory Management for a Large Operating System.",
                    "Service Stage Petri Net Protocols with Product Form Solution.",
                    "Load Sharing in Distributed Real-Time Systems with Broadcast of State Changes.",
                    "A Validated Cost Model for Main Memory Databases.",
                    "Analysis of Asymmetric Single-Buffer Polling and Priority Systems without Switchover Times.",
                    "Analysis of a Threshold Policy for Scheduling Readers and Writers.",
                    "Performance Analysis of Optimistic Concurrency Control Schemes for Systems with Large Memory.",
                    "Hybrid Performance Measurement Instrumentation for Loosely-Cpupled MIMD Architectures.",
                    "Product Forms for Random Access Schemes."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "SIGMETRICS 1988",
        "info": "Santa Fe, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1988",
                "sub_name": "Proceedings of the 1988 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Santa Fe, New Mexico, USA, May 24-27, 1988.",
                "count": 48,
                "papers": [
                    "The Rice Parallel Processing Testbed.",
                    "Efficient Distributed Event-Driven Simulations of Multiple-Loop Networks.",
                    "Performance Evaluation for Multiprocessors Programmed Using Monitors.",
                    "Queueing Analysis of Finite Buffer Token Networks.",
                    "Performance Modelling of a HSLAN Slotted Ring Protocol.",
                    "A Case Study of DECnet Applications and Protocol Performance.",
                    "Asymptotic Analysis of Large Heterogeneous Queueing Systems.",
                    "The Limited Performance Benefits of Migrating Active Processes For Load Sharing.",
                    "From Local to Global: An Analysis of Nearest Neighbor Balancing on Hypercubes.",
                    "Application Level Modeling of Parallel Machines.",
                    "Analytic Derivation of Processor Potential Utilization in Straight Line, Ring, Square Mesh, and Hypercube Networks.",
                    "Scheduling in Multiprogrammed Parallel Systems.",
                    "On Hot-Spot; Contention in Interconnection Networks.",
                    "Performance Analysis of Multipath Mulistage Interconnection Networks.",
                    "Modelling and Performance Evaluation of Multiprocessor Based Packet Switches.",
                    "A Manufacturing Capacity Planning Experiment Through Functional Workload Decomposition.",
                    "FAST: A Large Scale Expert System For Application and System Software Performance Tuning.",
                    "Comparison of Dataflow Control Techniques In Distributed Data-Intensive Systems.",
                    "A Mean-Value Performance Analysis of a New Multiprocessor Architecture.",
                    "Sensitivity Analysis of Reliability and Performability Measures for Multiprocessor Systems.",
                    "Design of Partially Replicated Distributed Database Systems: An Integrated Methodology.",
                    "Monitoring and Performance Measuring Distributed Systems During Operation.",
                    "The Use of Microcode Instrumentation for Development, Debugging and Tuning of Operating System Kernels.",
                    "Memory-Reference Characteristics of Multiprocessor Applications under MACH.",
                    "Characterising Program Behaviour with Phases and Transitions.",
                    "Adaptive Storage Control For Page Frame Supply in Large Scale Computer Systems.",
                    "On The Properties of Approximate Mean Value Analysis Algorithms for Queueing Networks.",
                    "Optimal Allocation of Multiple Class Resources in Computer Systems.",
                    "PAM - A Noniterative Approximate Solution Method for Closed Multichain Queueing Networks.",
                    "A PROLOG-Based Expert System for Tuning MVX/XA.",
                    "Performance Analysis of Heterogeneous Multiprocessors.",
                    "Load Balancing in VAX Clusters.",
                    "Algorithms for File Replication in a Distributed System.",
                    "An Aggregated Stochastic Petri Net for the FPS/264 Model.",
                    "A Lisp System for Evaluating Garbage Collector Performance.",
                    "Some Considerations in Using VSCAN Disk Scheduling With Optimal Page Arrangements.",
                    "On the Generation of Connected General-Topology Networks with Control Over Diameter.",
                    "Approximate Analysis of Task Graphs for Parallel Processing Systems.",
                    "Design of a Measurement Instrument for Distributed Systems.",
                    "I-Xpert A Performance Analysis Expert System.",
                    "Hardware Usage Measurements for a Scientific Workload.",
                    "A New Interpretation of Instabilities in Computer Performance Models.",
                    "PARCBench: A Benchmark Methodology for Multiprocessors.",
                    "Approximate Queueing Models for the Load Balancing Problem.",
                    "On the Distribution of Flow Times of Marking States in Stochastic Petri Nets.",
                    "A Generalized Queueing Network Model of a Local Area Network for Performance Evaluation of File Management Techniques with File Locking.",
                    "Interpreting RMF/XA Data for I/O Performance Issues.",
                    "Immediate vs Deferred Blocking Policies in Symmetrical Networks."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "SIGMETRICS 1987",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1987",
                "sub_name": "Proceedings of the 1987 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Banff, Alberta, Canada, May 11-14, 1987.",
                "count": 28,
                "papers": [
                    "A View of Database System Performance Measures.",
                    "A Performance Comparison of Multi-Micro and Mainframe Database Architectures.",
                    "Packet Routing Algorithms for Integrated Switching Networks.",
                    "Performance of the Expressnet with Voice/Data Traffic.",
                    "Analysis of the Resequencing Delay for M/M/m Systems.",
                    "Parallel Discrete Event Simulation: A Shared Memory Approach.",
                    "A Close Look at Vector Performance of Register-to-Register Vector Computers and a New Model.",
                    "Memory Access Patterns of Parallel Scientific Programs.",
                    "Disk Scheduling in System V.",
                    "Multi-Disk Management Algorithms.",
                    "A Unified Operational Treatment of RPS Reconnect Delays.",
                    "Performance Analysis of Parallel Processing Systems.",
                    "Reduced Distance Routing in Single-Stage Shuffle-Exchange Interconnection Networks.",
                    "Queueing Delays in Buffered Multistage Interconnection Networks.",
                    "Performance Through Memory.",
                    "Predicting Performance of Concurrency Control Designs.",
                    "Performance Analysis of a Fault Detection Scheme in Multiprocessor Systems.",
                    "A Statistical Approach to Computer Performance Modeling.",
                    "Monit: A Performance Monitoring Tool for Parallel and Pseudo-Parallel Programs.",
                    "Modeling the Software Architecture of a Prototype Parallel Machine.",
                    "A Workload Characterization Pipeline for Models of Parallel Systems.",
                    "Transformation Between Different Levels of Workload Characterization for Capacity Planning.",
                    "Performance Analysis of File Replication Schemes in Distributed Systems.",
                    "Network Measurement of the VMTP Request-Response Protocol in the V Distributed System.",
                    "Performance Evaluation of LAN Sorting Algorithms.",
                    "Delay Analysis of a Window Tree Conflict Resolution Algorithm in a Local Area Network Environment.",
                    "Some Conjectures on the Behavior of Acknowledgment-Based Transmission Control of Random Access Communication Channels.",
                    "The Effect of Channel-Exit Protocols on the Performance of Finite Population Random-Access Systems."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "SIGMETRICS 1986",
        "info": "North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1986",
                "sub_name": "Proceedings of the 1986 ACM SIGMETRICS joint international conference on Computer performance modelling, measurement and evaluation, North Carolina, State University, USA, May 28-30, 1986.",
                "count": 32,
                "papers": [
                    "Modeling I/O subsystems (tutorial).",
                    "Workload characterization (tutorial): issues and approaches.",
                    "Performance modeling in integrated curcuit design (tutorial).",
                    "Software reliability modeling (tutorial).",
                    "Performance issues in local area networks (tutorial).",
                    "Expert systems for performance analysis (tutorial).",
                    "Footprints in the Cache.",
                    "Performance Analysis of Multiprocessor Cache Consistency Protocols Using Generalized Timed Petri Nets.",
                    "Performance Modelling of Parallel Computer Architectures.",
                    "Modeling Multiprocessor Computer Systems with Unbalanced Flows.",
                    "The Analysis and Performance of Batching Arbiters.",
                    "Performance of Real-Time Bus Scheduling Algorithms.",
                    "Load-Balancing Heuristics and Process Behavior.",
                    "A Comparison of Priority-Based Decentralized Load Balancing Policies.",
                    "A BCMP Extension to Multiserver Stations with Concurrent Classes of Customers.",
                    "An Efficient Algorithm for Semi-Homogeneous Queueing Network Models.",
                    "Optimal Multiplexing of Heterogeneous Traffic with Hard Constraint.",
                    "Cycle Time Properties of the FDDI Token Ring Protocol.",
                    "Approximate Disaggregation and Performance Bound for Queueing Networks with Multiple-Server Stations.",
                    "A Generalization of Mean Value Analysis to Higher Moments: Moment Analysis.",
                    "A Probabilistic Analysis of a Database System.",
                    "Performance Evaluation of Multiversion with the Oracle Synchronization.",
                    "Performance Analysis of an Algorithm for Concurrency Control in Replicated Database Systems.",
                    "ARMA Models of Program Behaviour.",
                    "Measurement and Analysis of Locality Phases in File Referencing Behaviour.",
                    "Measuring Operating System Performance on Modern Micro-Processors.",
                    "Queueing Analysis of Fault-Tolerant Computer Systems.",
                    "Analysis of a Conveyor Queue in a Flexible Manufacturing System.",
                    "A Maximum Entropy Queue Length Distribution for a G/G/1 Finite Capacity Queue.",
                    "Queueing Analysis of Nonpreemptive Reservation Priority Discipline.",
                    "Queueing Systems with a Procrastinating Server.",
                    "Waiting-Time Approximations for Cyclic-Service Systems with Switch-Over Times."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "SIGMETRICS 1985",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1985",
                "sub_name": "Proceedings of the 1985 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Austin, Texas, USA, August 26-29, 1985.",
                "count": 24,
                "papers": [
                    "A Comparison of Receiver-Initiated and Sender-Initiated Adaptive Load Sharing.",
                    "An Adaptive Communications Protocol for Network Computers.",
                    "On the Availability of a Distributed Computer System with Failing Components.",
                    "RECAL - A New Efficient Algorithm for the Exact Analysis of Multiple-Chain Closed Queueing Networks.",
                    "Modeling Priority Schemes.",
                    "Nonexponential Networks of Queues: A Maximum Entropy Analysis.",
                    "A Sensitivity Study of the Clustering Approach to Workload Modeling.",
                    "On the Classification of Interactive Users Based on User Bahavior Indices.",
                    "Empirical Results on Locality in Database Referencing.",
                    "Degradable Computer Systems with Dependent Subsystems.",
                    "The Effect of System Workload on Error Latency: An Experimental Study.",
                    "Performance Characteristics of Two Ethernets: An Experimental Study.",
                    "Performance of Integrated Services (Voice/Data) CSMA/CD Networks.",
                    "An Analytic Model of the Hyperchannel Network Using Multiple Channel Architecture.",
                    "Analytic Performance Model of the U.S. En Route Air Traffic Control Computer Systems.",
                    "On the Applicability of Using Multiprogramming Level Distributions.",
                    "Multiclass Queueing Networks with Population Constrained Subnetworks.",
                    "A Note on Service Interruptions.",
                    "On the Stochastic Structure of Parallelism and Synchronization Models for Distributed Algorithms.",
                    "An Approximate Numerical Solution for Multiclass Preemtive Priority Queues with General Service Time Distributions.",
                    "Evaluation of Optical Disk Systems for Very Large Database Applications.",
                    "The Local Disk Controller.",
                    "Modelling of Centralized Concurrency Control in a Multi-System Environment.",
                    "Analysis of Some Optimistic Concurrency Control Schemes Based on Certification."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "SIGMETRICS 1984",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1984",
                "sub_name": "Proceedings of the 1984 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Cambridge, Massachusetts, USA, August 21-24, 1984.",
                "count": 22,
                "papers": [
                    "Recent Progress in the Performance Evaluation of Fundamental Allocation Algorithms.",
                    "On the Foundations of Artificial Workload Design.",
                    "Parameter Interdependencies of File Placement Models in a Unix System.",
                    "A Measure of Program Locality and Its Application.",
                    "Improved Lineariser Methods for Queueing Networks with Queue Dependent Centres.",
                    "Incorporating Load Dependent Servers in Approximate Mean Value Analysis.",
                    "Response Time Preservation: A General Technique for Developing Approximate Algorithms for Queueing Networks.",
                    "Evaluation of Parallel Execution of Program Tree Structures.",
                    "Program Optimization for a Pipelined Machine: A Case Study.",
                    "Performance of a DECnet Based Disk Block Server.",
                    "Throughput-Delay Characteristics and Stability Considerations of the Access Channel in a Mobile Telephone System.",
                    "Processor Queueing Disciplines in Distributed Systems.",
                    "Convolutional Bound Hierarchies.",
                    "A New 'Building Block' for Performance Evaluation of Queueing Networks with Finite Buffers.",
                    "A Simple Analysis of Exclusive and Shared Lock Contention in a Database System.",
                    "A Modeling Methodology for Sizing a Computer Based System in a Netted Environment.",
                    "An Experimental Investigation of Scheduling Strategies for UNIX.",
                    "Performance Evaluation of Isolated and Interconnected Token-Bus Local Area Networks.",
                    "A Unified Approach to Scan Time Analysis of Token Rings and Polling Networks.",
                    "Efficient Approximation for Models of Multiprogramming with Shared Domains.",
                    "The Response Times of Priority Classes Under Preemptive Resume in M/G/m Queues.",
                    "Analysis of Queueing Network Models with Population Size Constraints and Delayed Blocked Customers."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "SIGMETRICS 1983",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1983",
                "sub_name": "Proceedings of the International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 1983, August 29-31, 1983, Minneapolis, Minnesota, USA.",
                "count": 26,
                "papers": [
                    "A study of dynamic reconnection.",
                    "The MVA Pre-empt resume priority approximation.",
                    "On the BLI-model of program behaviour.",
                    "HOPT: A myopic version of the STOCHOPT automatic file migration policy.",
                    "Paging on an object-oriented personal computer.",
                    "State space transformations in queueing network modeling.",
                    "Workload representations in queueing models of computer systems.",
                    "A decomposition solution to the queueing network model of the centralized DBMS with static locking.",
                    "Diffusion approximations for storage processes in computer systems.",
                    "Transient diffusion approximation for some queuening systems.",
                    "Performance analysis of checkpointing strategies.",
                    "An operational view on renewal theory.",
                    "Construction of a validated simulator for performance prediction of DECnet-based computer networks.",
                    "The computational speed of supercomputers.",
                    "On the measured behaviour of a X.25 packet switching subnetwork.",
                    "Queueing analysis of a canonical model of real-time multiprocessors.",
                    "Queueing network models of multimicrocomputer networks.",
                    "A class of generalised stochastic petri nets for the performance evaluation of multiprocessor systems.",
                    "A performance evaluation of the multiple bus network for multiprocessor systems.",
                    "An approximate analysis of multiprocessor systems.",
                    "A new aggregation approximation procedure for solving closed queueing networks with simultaneous resource possession.",
                    "An exact analysis of the distribution of cycle times in a class of queueing networks.",
                    "The phantom customer and marked customer methods for optimization of closed queueing networks with blocking and general service times.",
                    "Characterization of an optimal delayed resolution policy.",
                    "Performance models of token ring local area networks.",
                    "Queueing delays on virtual circuits using a sliding window flow control scheme."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "SIGMETRICS 1982",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1982",
                "sub_name": "Proceedings of the 1982 ACM SIGMETRICS conference on Measurement and modeling of computer systems, SIGMETRICS 1982, Seattle, Washington, USA, August 30 - September 1, 1982.",
                "count": 27,
                "papers": [
                    "Optimal Control of Thrashing.",
                    "Hierarchical Replacement Decisions in Hierarchical Stores.",
                    "Program Page Reference Patterns.",
                    "The Effective Management of Paging Storage Hierarchies.",
                    "Workload Characterization and Performance Evaluation in a Research Environment.",
                    "On State-Dependent Workload Characterization by Software Resources.",
                    "A Package for the Implementation of Static Workload Models.",
                    "The Mesa Spy: An Interactive Tool for Performance Debugging.",
                    "Measuring Simultaneous Events in a Multiprocessor System.",
                    "Stationary Deterministic Flows in Discrete Systems : I.",
                    "A Data Base Replication Analysis Using an M/M/m Queue with Service Interruptions.",
                    "Modelling of the Parallel Resolution of a Numerical Problem on a Locally Distributed Computing System.",
                    "Modeling I/O Systems with Dynamic Path Selection, and General Transmission Networks.",
                    "Multiple Class Memory Constrained Queueing Networks.",
                    "Fast Approximate Solution of Multiprogramming Models.",
                    "The Aggregate Server Method for Analyzing Serialization Delays in Computer Systems.",
                    "Performance Analysis of Software for an MIMD Computer.",
                    "Modeling Reentrant and Nonreentrant Software.",
                    "Operational Models for the Evaluation of Degradable Computing Systems.",
                    "Extensions and Computational Aspects of an Iterative Method.",
                    "HAM: The Heuristic Aggregation Method.",
                    "Performance Bound Hierarchies for Queueing Networks.",
                    "Error Analysis of Homogeneous Mean Queue and Response Time Estimatiors.",
                    "A Model of Transport Level Flow Control.",
                    "Control Policies in CSMA Local Area Networks: Ethernet Controls.",
                    "An Analysis of Two Flow Control Techniques.",
                    "Modelling the Cambridge Ring."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "SIGMETRICS 1981",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1981",
                "sub_name": "Proceedings of the 1981 ACM SIGMETRICS conference on Measurement and modeling of computer systems, Las Vegas, Nevada, USA., September 14-16, 1981.",
                "count": 26,
                "papers": [
                    "Designing systems for performance.",
                    "A Method for Adaptive Performance Improvement of Operating Systems.",
                    "On the VAX/VMS Time-Critical Process Scheduling.",
                    "Evaluation of Concurrent Physical Data Base Reorganization Through Simulation Modeling.",
                    "Analytic Modelling of Disk I/O Subsystems: A Tutorial.",
                    "A Model of Univac 1100/ 42 Swapping.",
                    "Segmented FIFO Page Replacement.",
                    "A Generative Model of Working Set Dynamics.",
                    "Balanced Job Bound Analysis of Queueing Networks.",
                    "SCAT: A Heuristic Algorithm for Queueing Network Models of Computing Systems.",
                    "The Solution of Separable Queueing Network Models Using Mean Value Analysis.",
                    "Aggregation of Station in Queueing Network Models of Multiprogrammed Computers.",
                    "An Iterative Method for the Exact Solution of Coxian Queueing Networks.",
                    "Computer System Models: An Introduction.",
                    "Performance Evaluation: Experimental Computer Science at its Best.",
                    "Structure and Application of a Measurement Tool-Sampler/3000.",
                    "An Event Trace Monitor for the VAX 11/780.",
                    "A Log File Design for Analyzing Secondary Storage Occupancy.",
                    "The Effects of Solid State Paging Devices in a Large Time-Sharing System.",
                    "Virtual Machine-Based Simulation of Distributed Computing and Network Computing.",
                    "A Combined Evaluation of Performance and Reliability for Degradable Systems.",
                    "The Method of Surrogate Delays: Simultaneous Resource Possession in Analytic Models of Computer Systems.",
                    "Approximate Analytic Models of Arbiters.",
                    "Performance of Cache-Based Multiprocessors.",
                    "A Queueing Network Approach to the Module Allocation Problem in Distributed Systems.",
                    "Analytical Models for an Ethernet-Like Local Area Network Link."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "SIGMETRICS 1979",
        "info": "Boulder, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1979",
                "sub_name": "Proceedings of the 1979 ACM SIGMETRICS conference on Simulation, measurement and modeling of computer systems, SIGMETRICS 1979, Boulder, Colorado, USA, August 13-15, 1979.",
                "count": 23,
                "papers": [
                    "Tailor: A simple model that works.",
                    "An analysis of central processor-input-output processor contention.",
                    "Performance simulation as a tool in central processing unit design.",
                    "Simulation of a distributed system for performance modelling.",
                    "The benchmarking, tuning and analytic modeling of VAX/VMS.",
                    "Analytic modelling of \"working set like\" replacement algorithms.",
                    "Effects of buffered memory requests in multiprocessor systems.",
                    "Effects of channel blocking on the performance of shared disk pack in a multi-computer system.",
                    "An exact solution method for the general class of closed separable queueing networks.",
                    "Survey of analytic queueing network models of computer systems.",
                    "A simulation environment for performing dataflow research.",
                    "Simulated execution of dataflow programs on processors having finite resources.",
                    "An operating system implementation and simulation language (OASIS).",
                    "A technique for integrating simulation and system design.",
                    "Evaluation methods in SARA - the graph model simulator.",
                    "Modeling and simulating data flow computations at machine language level.",
                    "Models for specification and anaysis of parallel computing systems.",
                    "Performance evaluation of communicating processes.",
                    "Benchmarking interactive systems: Producing the software.",
                    "Criteria for computer performance analysis.",
                    "Small business system performance analysis.",
                    "System characterization of a Retail Business System.",
                    "Field performance aids for IBM GSD systems."
                ]
            }
        ]
    },
    {
        "year": "1976",
        "name": "SIGMETRICS 1976",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1976",
                "sub_name": "Proceedings of the Joint International Conference on Measurements and Modeling of Computer Systems, SIGMETRICS 1976, March 29-31, 1976, Cambridge, MA, USA.",
                "count": 32,
                "papers": [
                    "Some experiments in directory organization - a simulation study.",
                    "File allocation in distributed systems.",
                    "On the self contained modelling of DB/DC systems.",
                    "Probabilistic models of inverted file information retrieval systems.",
                    "Multitype multiprogramming: Probability models and numerical procedures.",
                    "Validation of a computer performance model of the exponential queuing network family.",
                    "An analytic performance model of a multiprogrammed batch-timeshared computer.",
                    "Performance evaluation of IAS on the PDP-11/70.",
                    "Measurements of major locality phases in symbolic reference strings.",
                    "Hardware monitoring of real-time aerospace computer systems.",
                    "Multi-queue scheduling of two tasks.",
                    "On the convolution algorithm for separable queuing networks.",
                    "Probabilistic models of computer systems.",
                    "The role of emulation in performance measurement and evaluation.",
                    "A hardware monitor study of a CDC KRONOS system.",
                    "A functional instruction mix and some related topics.",
                    "The Test Support Program (TSP) a real-time interactive simulation system.",
                    "Graph models of computer systems: Application to performance evaluation of an operating system.",
                    "Using Covariance Analysis as an aid to interpret the results of a performance measurement.",
                    "A system model for computer performance evaluation.",
                    "Fundamental laws of computer system performance.",
                    "Principles of optimality for multiprogramming.",
                    "An L=S criterion for optimal multiprogramming.",
                    "A study of queueing networks with deterministic service and applications to computer networks.",
                    "Protocol considerations for software controlled access methods in distributed data bases.",
                    "Performance evaluation of a batch processing computer network under different processing strategies.",
                    "An heuristic model for analysis of memory use under static partition allocation strategies.",
                    "An endogenous priority model for load control in combined batch - interactive computer systems.",
                    "An experimental approach to system tuning.",
                    "A generalized bound on LPT sequencing.",
                    "Allocation and compaction - a mathematical model for memory management.",
                    "Validation of a queueing model with classes of customers."
                ]
            }
        ]
    },
    {
        "year": "1974",
        "name": "SIGMETRICS 1974",
        "info": "USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigmetrics/1974",
                "sub_name": "Proceedings of the 1974 ACM SIGMETRICS conference on Measurement and evaluation, SIGMETRICS 1974, USA, 1974.",
                "count": 20,
                "papers": [
                    "Multiprogramming and program behavior.",
                    "A model of performance for virtual memory systems.",
                    "The optimal choice of window sizes for working set dispatching.",
                    "Comments on a linear paging model.",
                    "Feedback coupled resource allocation policies in the multiprogramming-multiprocessor computer system.",
                    "A closed, cyclic, two-stage multiprogrammed system model and its diffusion approximation solution.",
                    "Analysis of a time-sharing subsystem (A Preliminary Report).",
                    "The analysis of storage constraints by a queueing network model with blocking.",
                    "Statistical validation of a trace-driven simulator.",
                    "A general-purpose software measurement tool.",
                    "An event-driven data collection and analysis facility for a two-computer network.",
                    "Measurements of the virtual memory demands of Algol-60 programs (Extended Abstract).",
                    "HEMI (Hybrid Events Monitoring Instrument).",
                    "Interpretive analysis of computer system performance.",
                    "Develop your computer performance pattern.",
                    "The computer capacity curve - a prerequisite for computer performance evaluation and improvement.",
                    "The value of CPU utilization as a criterion for computer system usage.",
                    "Adaptive optimization of the performance of a virtual memory computer.",
                    "Batch computer scheduling: A heuristically motivated approach.",
                    "An adaptive policy driven scheduler."
                ]
            }
        ]
    }
]