[
    {
        "year": "2021",
        "name": "12th SoCC 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2021",
                "sub_name": "SoCC '21: ACM Symposium on Cloud Computing, Seattle, WA, USA, November 1 - 4, 2021.",
                "count": 46,
                "papers": [
                    "Llama: A Heterogeneous & Serverless Framework for Auto-Tuning Video Analytics Pipelines.",
                    "Lorien: Efficient Deep Learning Workloads Delivery.",
                    "Elastic Hyperparameter Tuning on the Cloud.",
                    "Siren: Byzantine-robust Federated Learning via Proactive Alarming.",
                    "Automating instrumentation choices for performance problems in distributed applications with VAIF.",
                    "tprof: Performance profiling via structural aggregation and automated analysis of distributed systems traces.",
                    "Cloud-Scale Runtime Verification of Serverless Applications.",
                    "Building Reliable Cloud Services Using Coyote Actors.",
                    "Faa$T: A Transparent Auto-Scaling Cache for Serverless Applications.",
                    "Atoll: A Scalable Low-Latency Serverless Platform.",
                    "Kraken: Adaptive Container Provisioning for Deploying Dynamic DAGs in Serverless Platforms.",
                    "Mu: An Efficient, Fair and Responsive Serverless Framework for Resource-Constrained Edge Clouds.",
                    "OneEdge: An Efficient Control Plane for Geo-Distributed Infrastructures.",
                    "Portkey: Adaptive Key-Value Placement over Dynamic Edge Networks.",
                    "Trisk: Task-Centric Data Stream Reconfiguration.",
                    "Good Things Come to Those Who Wait: Optimizing Job Waiting in the Cloud.",
                    "Mind the Gap: Broken Promises of CPU Reservations in Containerized Multi-tenant Clouds.",
                    "George: Learning to Place Long-Lived Containers in Large Clusters with Operation Constraints.",
                    "Sayer: Using Implicit Feedback to Optimize System Policies.",
                    "Iter8: Online Experimentation in the Cloud.",
                    "Parallax: Hybrid Key-Value Placement in LSM-based Key-Value Stores.",
                    "Provisioning Differentiated Last-Level Cache Allocations to VMs in Public Clouds.",
                    "Latency-Aware Dynamic Server and Cooling Capacity Provisioner for Data Centers.",
                    "Enabling Sustainable Clouds: The Case for Virtualizing the Energy System.",
                    "OptDebug: Fault-Inducing Operation Isolation for Dataflow Applications.",
                    "Falkirk Wheel: Rollback Recovery for Dataflow Systems.",
                    "Service-Level Fault Injection Testing.",
                    "Towards Reliable AI for Source Code Understanding.",
                    "Characterizing Microservice Dependency and Performance: Alibaba Trace Analysis.",
                    "SHOWAR: Right-Sizing And Efficient Scheduling of Microservices.",
                    "Parslo: A Gradient Descent-based Approach for Near-optimal Partial SLO Allotment in Microservices.",
                    "3MileBeach: A Tracer with Teeth.",
                    "Version Reconciliation for Collaborative Databases.",
                    "Scaling Blockchains Using Pipelined Execution and Sparse Peers.",
                    "Fast and Accurate Optimizer for Query Processing over Knowledge Graphs.",
                    "Secure Namespaced Kernel Audit for Containers.",
                    "Lasagna: Accelerating Secure Deep Learning Inference in SGX-enabled Edge Cloud.",
                    "Citadel: Protecting Data Privacy and Model Confidentiality for Collaborative Learning.",
                    "Tell me when you are sleepy and what may wake you up!",
                    "ServerMore: Opportunistic Execution of Serverless Functions in the Cloud.",
                    "Speedo: Fast dispatch and orchestration of serverless workflows.",
                    "On Merits and Viability of Multi-Cloud Serverless.",
                    "Chronus: A Novel Deadline-aware Scheduler for Deep Learning Training Jobs.",
                    "Scrooge: A Cost-Effective Deep Learning Inference System.",
                    "Morphling: Fast, Near-Optimal Auto-Configuration for Cloud-Native Model Serving.",
                    "Clamor: Extending Functional Cluster Computing Frameworks with Fine-Grained Remote Memory Access."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "11th SoCC 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2020",
                "sub_name": "SoCC '20: ACM Symposium on Cloud Computing, Virtual Event, USA, October 19-21, 2020.",
                "count": 35,
                "papers": [
                    "Wukong: a scalable and locality-enhanced framework for serverless parallel computing.",
                    "Particle: ephemeral endpoints for serverless networking.",
                    "Characterizing serverless platforms with serverlessbench.",
                    "Photons: lambdas on a diet.",
                    "ByteSeries: an in-memory time series database for large-scale monitoring systems.",
                    "A user-level toolkit for storage I/O isolation on multitenant hosts.",
                    "Baoverlay: a block-accessible overlay file system for fast and efficient container storage.",
                    "Challenges and solutions for fast remote persistent memory access.",
                    "Improving the accuracy, adaptability, and interpretability of SSD failure prediction models.",
                    "Leveraging application classes to save power in highly-utilized data centers.",
                    "Peafowl: in-application CPU scheduling to reduce power consumption of in-memory key-value stores.",
                    "High availability in cheap distributed key value storage.",
                    "Concury: a fast and light-weight software cloud load balancer.",
                    "Bypassing the load balancer without regrets.",
                    "Finding the right cloud configuration for analytics clusters.",
                    "Gosig: a scalable and high-performance byzantine consensus for consortium blockchains.",
                    "Shrec: bandwidth-efficient transaction relay in high-throughput blockchain systems.",
                    "Making edge-computing resilient.",
                    "Specializing the network for scatter-gather workloads.",
                    "Serverless linear algebra.",
                    "SNF: serverless network functions.",
                    "Sequoia: enabling quality-of-service in serverless computing.",
                    "Kappa: a programming framework for serverless computing.",
                    "HangFix: automatically fixing software hang bugs for production cloud systems.",
                    "Automatically detecting risky scripts in infrastructure code.",
                    "Influence-based provenance for dataflow applications with taint propagation.",
                    "T-Lease: a trusted lease primitive for distributed systems.",
                    "PaGraph: Scaling GNN training on large graphs via computation-aware caching.",
                    "Baechi: fast device placement of machine learning graphs.",
                    "Semi-dynamic load balancing: efficient distributed learning in non-dedicated environments.",
                    "Network-accelerated distributed machine learning for multi-tenant settings.",
                    "Vessels: efficient and scalable deep learning prediction on trusted processors.",
                    "InferLine: latency-aware provisioning and scaling for prediction serving pipelines.",
                    "GSLICE: controlled spatial sharing of GPUs for a scalable inference platform.",
                    "Elastic parameter server load distribution in deep learning clusters."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "10th SoCC 2019",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2019",
                "sub_name": "Proceedings of the ACM Symposium on Cloud Computing, SoCC 2019, Santa Cruz, CA, USA, November 20-23, 2019.",
                "count": 55,
                "papers": [
                    "Narrowing the Gap Between Serverless and its State with Storage Functions.",
                    "Cirrus: a Serverless Framework for End-to-end ML Workflows.",
                    "Cartel: A System for Collaborative Transfer Learning at the Edge.",
                    "Seamless Offloading of Web App Computations From Mobile Device to Edge Clouds via HTML5 Web Worker Migration.",
                    "BigDL: A Distributed Deep Learning Framework for Big Data.",
                    "HyperSched: Dynamic Resource Reallocation for Model Development on a Deadline.",
                    "Matrix Profile XIV: Scaling Time Series Motif Discovery with GPUs to Break a Quintillion Pairwise Comparisons a Day and Beyond.",
                    "Grasper: A High Performance Distributed System for OLAP on Property Graphs.",
                    "Lessons from Large-Scale Software as a Service at Databricks.",
                    "Hotspot Mitigations for the Masses.",
                    "DCUDA: Dynamic GPU Scheduling with Live Migration Support.",
                    "BurScale: Using Burstable Instances for Cost-Effective Autoscaling in the Public Cloud.",
                    "Characterizing and Synthesizing Task Dependencies of Data-Parallel Jobs in Alibaba Cloud.",
                    "MME-FaaS Cloud-Native Control for Mobile Networks.",
                    "Centralized Core-granular Scheduling for Serverless Functions.",
                    "An automated, cross-layer instrumentation framework for diagnosing performance problems in distributed applications.",
                    "A System-Wide Debugging Assistant Powered by Natural Language Processing.",
                    "Startups That Stand Out from the Cloud.",
                    "Perceptual Compression for Video Storage and Processing Systems.",
                    "pRedis: Penalty and Locality Aware Memory Allocation in Redis.",
                    "Acorn: Aggressive Result Caching in Distributed Data Processing Frameworks.",
                    "RapidCDC: Leveraging Duplicate Locality to Accelerate Chunking in CDC-based Deduplication Systems.",
                    "Neptune: Scheduling Suspendable Tasks for Unified Stream/Batch Applications.",
                    "Pigeon: an Effective Distributed, Hierarchical Datacenter Job Scheduler.",
                    "Pufferfish: Container-driven Elastic Memory Management for Data-intensive Applications.",
                    "Scavenger: A Black-Box Batch Workload Resource Manager for Improving Utilization in Cloud Environments.",
                    "Securing Data in Compromised Clouds.",
                    "Repeatable Oblivious Shuffling of Large Outsourced Data Blocks.",
                    "WormSpace: A Modular Foundation for Simple, Verifiable Distributed Systems.",
                    "Sifter: Scalable Sampling for Distributed Traces, without Feature Engineering.",
                    "HP-Mapper: A High Performance Storage Driver for Docker Containers.",
                    "Software Data Planes: You Can't Always Spin to Win.",
                    "Composing SDN Controller Enhancements with Mozart.",
                    "Libra and the Art of Task Sizing in Big-Data Analytic Systems.",
                    "Coupling Decentralized Key-Value Stores with Erasure Coding.",
                    "Agni: An Efficient Dual-access File System over Object Storage.",
                    "Analysis of and Optimization for Write-dominated Hybrid Storage Nodes in Cloud.",
                    "Peregrine: Workload Optimization for Cloud Query Engines.",
                    "Reverb: Speculative Debugging for Web Applications.",
                    "Griffon: Reasoning about Job Anomalies with Unlabeled Data in Cloud-based Platforms.",
                    "TagSniff: Simplified Big Data Debugging for Dataflow Jobs.",
                    "PerfDebug: Performance Debugging of Computation Skew in Dataflow Systems.",
                    "Practical Cloud Workloads for Serverless FaaS.",
                    "Perphon: a ML-based Agent for Workload Co-location via Performance Prediction and Resource Inference.",
                    "Accordia: Adaptive Cloud Configuration Optimization for Recurring Data-Intensive Applications.",
                    "Vote Them Out: Detecting and Eliminating Byzantine Peers.",
                    "C-LSM: Cooperative Log Structured Merge Trees.",
                    "WedgeDB: Transaction Processing for Edge Databases.",
                    "Isopod: An Expressive DSL for Kubernetes Configuration.",
                    "Collaborative Edge-Cloud and Edge-Edge Video Analytics.",
                    "Hy-FiX: Fast In-place upgrade of KVM hypervisors.",
                    "Towards a Library for Deterministic Failure Testing of Distributed Systems.",
                    "SpIitServe: Efficiently Splitting Complex Workloads Across FaaS and IaaS.",
                    "Linear Quadratic Regulator for Resource-Efficient Cloud Services.",
                    "Big Data Processing at Microsoft: Hyper Scale, Massive Complexity, and Minimal Cost."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "9th SoCC 2018",
        "info": "Carlsbad, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2018",
                "sub_name": "Proceedings of the ACM Symposium on Cloud Computing, SoCC 2018, Carlsbad, CA, USA, October 11-13, 2018.",
                "count": 70,
                "papers": [
                    "Orpheus: Efficient Distributed Machine Learning via System and Algorithm Co-design.",
                    "Dynamic and Decentralized Global Analytics via Machine Learning.",
                    "Continuum: A Platform for Cost-Aware, Low-Latency Continual Learning.",
                    "Parameter Hub: a Rack-Scale Parameter Server for Distributed Deep Neural Network Training.",
                    "Bolt-On Global Consistency for the Cloud.",
                    "SDPaxos: Building Efficient Semi-Decentralized Geo-replicated State Machines.",
                    "Early Scheduling in Parallel State Machine Replication.",
                    "Uncertainty Propagation in Data Processing Systems.",
                    "Elasecutor: Elastic Executor Scheduling in Data Analytics Systems.",
                    "Stratus: cost-aware container scheduling in the public cloud.",
                    "Kairos: Preemptive Data Center Scheduling Without Runtime Estimates.",
                    "Overload Control for Scaling WeChat Microservices.",
                    "Mutant: Balancing Storage Cost and Latency in LSM-Tree Data Stores.",
                    "Wharf: Sharing Docker Images in a Distributed File System.",
                    "Netco: Cache and I/O Management for Analytics over Disaggregated Stores.",
                    "Unikernels as Processes.",
                    "libVNF: Building Virtual Network Functions Made Easy.",
                    "RoGUE: RDMA over Generic Unconverged Ethernet.",
                    "VIP: Virtual Performance-State for Efficient Power Management of Virtual Machines.",
                    "Henge: Intent-driven Multi-Tenant Stream Processing.",
                    "Sprocket: A Serverless Video Processing Framework.",
                    "RIOS: Runtime Integrated Optimizer for Spark.",
                    "ScootR: Scaling R Dataframes on Dataflow Systems.",
                    "GraPU: Accelerate Streaming Graph Analysis through Preprocessing Buffered Updates.",
                    "DScope: Detecting Real-World Data Corruption Hang Bugs in Cloud Server Systems.",
                    "Weighted Sampling of Execution Traces: Capturing More Needles and Less Hay.",
                    "Debugging Distributed Systems with Why-Across-Time Provenance.",
                    "The Elasticity and Plasticity in Semi-Containerized Co-locating Cloud Workload: a View from Alibaba Trace.",
                    "I Heard It through the Firewall: Exploiting Cloud Management Services as an Information Leakage Channel.",
                    "DC-DRF: Adaptive Multi-Resource Sharing at Public Cloud Scale.",
                    "Fast and Accurate Load Balancing for Geo-Distributed Storage Systems.",
                    "IONN: Incremental Offloading of Neural Network Computations from Mobile Devices to Edge Servers.",
                    "Multi-Query Optimization in Wide-Area Streaming Analytics.",
                    "ApproxJoin: Approximate Distributed Joins.",
                    "Pay One, Get Hundreds for Free: Reducing Cloud Costs through Shared Query Execution.",
                    "Cloud Index Tracking: Enabling Predictable Costs in Cloud Spot Markets.",
                    "Cascade Mapping: Optimizing Memory Efficiency for Flash-based Key-value Caching.",
                    "SifrDB: A Unified Solution for Write-Optimized Key-Value Stores in Large Datacenter.",
                    "An Efficient Memory-Mapped Key-Value Store for Flash Storage.",
                    "Scheduling CPU for GPU-based Deep Learning Jobs.",
                    "Application-Agnostic Batch Workload Management in Cloud Environments.",
                    "Decentralized Distributed Deep Learning in Heterogeneous WAN Environments.",
                    "Resource Profile Advisor for Containers in Cognitive Platform.",
                    "Secure In-memory Key-Value Storage with SGX.",
                    "Untethered: Deployable Blockchains for IoT Environments.",
                    "Does your fault-tolerant system tolerate faults?",
                    "SLO Computational Sprinting.",
                    "SSD QoS Improvements through Machine Learning.",
                    "Auto-Scaling with Apprenticeship Learning.",
                    "Rejig: A Scalable Online Algorithm for Cache Server Configuration Changes.",
                    "RangeQC: A Framework for Caching Range Predicate Query Results.",
                    "Scalable and Reliable RDMA.",
                    "Network Scheduling in the Dark.",
                    "Energy-aware and Machine Learning-based Resource Provisioning of In-Memory Analytics on Cloud.",
                    "Multi-tenant Isolation of What?: Building a Secure Tenant Isolation Architecture for Cloud Networks.",
                    "Plumb: Efficient Processing of Multi-User Pipelines.",
                    "WITCAT: A Workload Spike Targeted Cloud Management Solution.",
                    "Fast Distributed Deep Learning via Worker-adaptive Batch Sizing.",
                    "Experimental Evaluation of Sketching Techniques for Big Spatial Data.",
                    "Mnemo: Boosting Memory Cost Efficiency in Hybrid Memory Systems.",
                    "The Curious Case of Container Orchestration and Scheduling in GPU-based Datacenters.",
                    "ShadeNF: A Platform for Online Network Function Verification.",
                    "Elastic Provisioning of Cloud Caches: a Cost-aware TTL Approach.",
                    "Data-Driven Resource Shaping for Compute Clusters.",
                    "Drishti: Disaggregated and Interoperable Security Analytics Framework for Cloud.",
                    "Memory-Oriented Distributed Computing at Rack Scale.",
                    "High-Performance Multi-Rail Erasure Coding Library over Modern Data Center Architectures: Early Experiences.",
                    "iQCAR: Inter-Query Contention Analyzer.",
                    "A ML-based Runtime System for Executing Dataflow Graphs on Heterogeneous Processors.",
                    "TEE-KV: Secure Immutable Key-Value Store for Trusted Execution Environments."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "8th SoCC 2017",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2017",
                "sub_name": "Proceedings of the 2017 Symposium on Cloud Computing, SoCC 2017, Santa Clara, CA, USA, September 24-27, 2017.",
                "count": 86,
                "papers": [
                    "FSP: towards flexible synchronous parallel framework for expectation-maximization based algorithms on cloud.",
                    "Trustable virtual machine scheduling in a cloud.",
                    "Search lookaside buffer: efficient caching for index data structures.",
                    "Architectural implications on the performance and cost of graph analytics systems.",
                    "Incentivizing self-capping to increase cloud utilization.",
                    "Mithril: mining sporadic associations for cache prefetching.",
                    "GLoop: an event-driven runtime for consolidating GPGPU applications.",
                    "APUS: fast and scalable paxos on RDMA.",
                    "No data left behind: real-time insights from a complex data ecosystem.",
                    "Remote memory in the age of fast networks.",
                    "CapNet: security and least authority in a capability-enabled cloud.",
                    "LSM-tree managed storage for large-scale key-value store.",
                    "HyperNF: building a high performance, high utilization and fair NFV platform.",
                    "Workload analysis and caching strategies for search advertising systems.",
                    "Prism: a proxy architecture for datacenter networks.",
                    "Towards automatic parameter tuning of stream processing systems.",
                    "STYX: a trusted and accelerated hierarchical SSL key management and distribution system for cloud based CDN application.",
                    "QFrag: distributed graph search via subgraph isomorphism.",
                    "A robust partitioning scheme for ad-hoc query workloads.",
                    "DLSH: a distribution-aware LSH scheme for approximate nearest neighbor query in cloud computing.",
                    "SLO-aware colocation of data center tasks based on instantaneous processor requirements.",
                    "Preserving I/O prioritization in virtualized OSes.",
                    "A policy-based system for dynamic scaling of virtual machine memory reservations.",
                    "PBSE: a robust path-based speculative execution for degraded-network tail tolerance in data-parallel frameworks.",
                    "Polygravity: traffic usage accountability via coarse-grained measurements in multi-tenant data centers.",
                    "Distributed shared persistent memory.",
                    "BestConfig: tapping the performance potential of systems via automatic configuration tuning.",
                    "A machine learning approach to live migration modeling.",
                    "Latency reduction and load balancing in coded storage systems.",
                    "On-demand virtualization for live migration in bare metal cloud.",
                    "SLAQ: quality-driven scheduling for distributed machine learning.",
                    "Practical whole-system provenance capture.",
                    "Processing Java UDFs in a C++ environment.",
                    "An experimental comparison of complex object implementations for big data systems.",
                    "Occupy the cloud: distributed computing for the 99%.",
                    "Selecting the best VM across multiple public clouds: a data-driven performance modeling approach.",
                    "AidOps: a data-driven provisioning of high-availability services in cloud.",
                    "Secure data types: a simple abstraction for confidentiality-preserving data analytics.",
                    "HotSpot: automated server hopping in cloud spot markets.",
                    "UNO: uniflying host and smart NIC offload for flexible packet processing.",
                    "Automated debugging in data-intensive scalable computing.",
                    "Sketches of space: ownership accounting for shared storage.",
                    "A scalable distributed spatial index for the internet-of-things.",
                    "ALOHA-KV: high performance read-only and write-only distributed transactions.",
                    "Analysis of TPC-DS: the first standard benchmark for SQL-based big data systems.",
                    "Optimized on-demand data streaming from sensor nodes.",
                    "WorkloadCompactor: reducing datacenter cost while providing tail latency SLO guarantees.",
                    "Distributed resource management across process boundaries.",
                    "Reducing tail latencies in micro-batch streaming workloads.",
                    "DAIET: a system for data aggregation inside the network.",
                    "Resilient cloud in dynamic resource environments.",
                    "Disaggregated operating system.",
                    "To edge or not to edge?",
                    "Abstract: cache management and load balancing for 5G cloud radio access networks.",
                    "Batch spot market for data analytics cloud providers.",
                    "Building smart memories and high-speed cloud services for the internet of things with derecho.",
                    "Towards an emergency edge supercloud.",
                    "AKC: advanced KSM for cloud computing.",
                    "KVS: high-efficiency kernel-level virtual switch.",
                    "An implementation of fast memset() using hardware accelerators: extended abstract.",
                    "Bridging the architectural gap between NOS design principles in software-defined networks.",
                    "Mitigating traffic-based side channel attacks in bandwidth-efficient cloud storage.",
                    "Revisiting performance in big data systems: an resource decoupling approach.",
                    "Exploiting speculation in partially replicated transactional data stores.",
                    "Hytrace: a hybrid approach to performance bug diagnosis in production cloud infrastructures.",
                    "Fragola: low-latency transactions in distributed data stores.",
                    "Lever: towards low-latency batched stream processing by pre-scheduling.",
                    "Mitigating multi-tenant interference on mobile offloading servers: poster abstract.",
                    "SEaMLESS: a SErvice migration cLoud architecture for energy saving and memory releaSing capabilities.",
                    "Siphon: a high-performance substrate for inter-datacenter transfers in wide-area data analytics.",
                    "Efficient and consistent replication for distributed logs.",
                    "Rethinking reinforcement learning for cloud elasticity.",
                    "How good are machine learning clouds for binary classification with good features?: extended abstract.",
                    "Indy: a software system for the dense cloud.",
                    "Towards verifiable metering for database as a service providers.",
                    "Janus: supporting heterogeneous power management in virtualized environments.",
                    "Stocator: an object store aware connector for apache spark.",
                    "mBalloon: enabling elastic memory management for big data processing.",
                    "Prometheus: online estimation of optimal memory demands for workers in in-memory distributed computation.",
                    "Sparkle: optimizing spark for large memory machines and analytics.",
                    "Exploring memory locality for big data analytics in virtualized clusters.",
                    "RStore: efficient multiversion document management in the cloud.",
                    "SQML: large-scale in-database machine learning with pure SQL.",
                    "DFS-container: achieving containerized block I/O for distributed file systems.",
                    "Early work on modeling computational sprinting.",
                    "Job scheduling for data-parallel frameworks with hybrid electrical/optical datacenter networks."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "7th SoCC 2016",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2016",
                "sub_name": "Proceedings of the Seventh ACM Symposium on Cloud Computing, Santa Clara, CA, USA, October 5-7, 2016.",
                "count": 38,
                "papers": [
                    "Why Does the Cloud Stop Computing? Lessons from Hundreds of Service Outages.",
                    "Automating Failure Testing Research at Internet Scale.",
                    "Characterizing Private Clouds: A Large-Scale Empirical Analysis of Enterprise Clusters.",
                    "Availability Knob: Flexible User-Defined Availability in the Cloud.",
                    "Optasia: A Relational Platform for Efficient Large-Scale Video Analytics.",
                    "A Fault-Tolerant Framework for Asynchronous Iterative Computations in Cloud Environments.",
                    "Ako: Decentralised Deep Learning with Partial Gradient Exchange.",
                    "Addressing the straggler problem for iterative convergent parallel ML.",
                    "RAMinate: Hypervisor-based Virtualization for Hybrid Main Memory Systems.",
                    "A Case for Virtualizing Persistent Memory.",
                    "Follow the Sun through the Clouds: Application Migration for Geographically Shifting Workloads.",
                    "HIL: Designing an Exokernel for the Data Center.",
                    "BASS: Improving I/O Performance for Cloud Block Storage via Byte-Addressable Storage Stack.",
                    "The Case for RackOut: Scalable Data Serving Using Rack-Scale Systems.",
                    "Grandet: A Unified, Economical Object Store for Web Applications.",
                    "Randomized Algorithms for Dynamic Storage Load-Balancing.",
                    "CQSTR: Securing Cross-Tenant Applications with Cloud Containers.",
                    "Radiatus: a Shared-Nothing Server-Side Web Architecture.",
                    "Tutamen: A Next-Generation Secret-Storage Platform.",
                    "Privacy Preserving Collaboration in Bring-Your-Own-Apps.",
                    "Disciplined Inconsistency with Consistency Types.",
                    "Towards Weakly Consistent Local Storage Systems.",
                    "The Freeze-Frame File System.",
                    "Adaptive Caching in Big SQL using the HDFS Cache.",
                    "ReStream: Accelerating Backtesting and Stream Replay with Serial-Equivalent Parallel Processing.",
                    "STYX: Stream Processing with Trustworthy Cloud-based Execution.",
                    "Trading Timeliness and Accuracy in Geo-Distributed Streaming Analytics.",
                    "SNC-Meister: Admitting More Tenants with Tail Latency SLOs.",
                    "STeP: Scalable Tenant Placement for Managing Database-as-a-Service Deployments.",
                    "Principled workflow-centric tracing of distributed systems.",
                    "PerfOrator: eloquent performance models for Resource Optimization.",
                    "VNToR: Network Virtualization at the Top-of-Rack Switch.",
                    "Expeditus: Congestion-aware Load Balancing in Clos Data Center Networks.",
                    "Programming and Runtime Support to Blaze FPGA Accelerator Deployment at Datacenter Scale.",
                    "PipeGen: Data Pipe Generator for Hybrid Analytics.",
                    "TR-Spark: Transient Computing for Big Data Analytics.",
                    "Job-aware Scheduling in Eagle: Divide and Stick to Your Probes.",
                    "Optimizing Interactive Development of Data-Intensive Applications."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "6th SoCC 2015",
        "info": "Kohala Coast, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2015",
                "sub_name": "Proceedings of the Sixth ACM Symposium on Cloud Computing, SoCC 2015, Kohala Coast, Hawaii, USA, August 27-29, 2015.",
                "count": 36,
                "papers": [
                    "Interactive data analytics: the new frontier.",
                    "Understanding issue correlations: a case study of the Hadoop system.",
                    "The nearest replica can be farther than you think.",
                    "Potassium: penetration testing as a service.",
                    "MemcachedGPU: scaling-up scale-out key-value stores.",
                    "dJay: enabling high-density multi-tenancy for cloud gaming servers with dynamic cost-benefit GPU load balancing.",
                    "DSwitch: a dual mode direct and network attached disk.",
                    "FastLane: making short flows shorter with agile drop notification.",
                    "Tarcil: reconciling scheduling speed and quality in large shared clusters.",
                    "Scheduling jobs across geo-distributed datacenters.",
                    "vFair: latency-aware fair storage scheduling via per-IO cost-based differentiation.",
                    "On data skewness, stragglers, and MapReduce progress indicators.",
                    "Forecasting the cost of processing multi-join queries via hashing for main-memory databases.",
                    "Kubernetes and the path to cloud native.",
                    "Harnessing data loss with forgetful data structures.",
                    "Software-defined caching: managing caches in multi-tenant data centers.",
                    "Domino: understanding wide-area, asynchronous event causality in web applications.",
                    "Microsoft azure SQL database telemetry.",
                    "Zorro: zero-cost reactive failure recovery in distributed graph processing.",
                    "Database high availability using SHADOW systems.",
                    "Reducing replication bandwidth for distributed document databases.",
                    "ShardFS vs. IndexFS: replication vs. caching strategies for distributed metadata management in cloud storage systems.",
                    "Evaluating the impact of fine-scale burstiness on cloud elasticity.",
                    "Centiman: elastic, high performance optimistic concurrency control by watermarking.",
                    "Online parameter optimization for elastic data stream processing.",
                    "Towards a comprehensive performance model of virtual machine live migration.",
                    "Achieving cost-efficient, data-intensive computing in the cloud.",
                    "Response time service level agreements for cloud-hosted web applications.",
                    "SpotOn: a batch computing service for the spot market.",
                    "Energy proportionality and workload consolidation for latency-critical applications.",
                    "CoolProvision: underprovisioning datacenter cooling.",
                    "Automating model search for large scale machine learning.",
                    "Managed communication and consistency for fast data-parallel iterative analytics.",
                    "Using data transformations for low-latency time series analysis.",
                    "GraM: scaling graph computation to the trillions.",
                    "Algebricks: a data model-agnostic compiler backend for big data languages."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "5th SoCC 2014",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2014",
                "sub_name": "Proceedings of the ACM Symposium on Cloud Computing, Seattle, WA, USA, November 3-5, 2014.",
                "count": 29,
                "papers": [
                    "Automating Distributed Partial Aggregation.",
                    "Reservation-based Scheduling: If You're Late Don't Blame Us!",
                    "Transparent, Live Migration of a Software-Defined Network.",
                    "GentleRain: Cheap and Scalable Causal Consistency with Physical Clocks.",
                    "Exploiting iterative-ness for parallel ML computations.",
                    "Tachyon: Reliable, Memory Speed Storage for Cluster Computing Frameworks.",
                    "What Bugs Live in the Cloud? A Study of 3000+ Issues in Cloud Systems.",
                    "PerfScope: Practical Online Server Performance Bug Inference in Production Cloud Computing Infrastructures.",
                    "Tales of the Tail: Hardware, OS, and Application-level Sources of Tail Latency.",
                    "On the Control Plane of a Self-service Cloud Platform.",
                    "DIMMer: A case for turning off DIMMs in clouds.",
                    "Hybris: Robust Hybrid Cloud Storage.",
                    "The Case for Drill-Ready Cloud Computing.",
                    "Merlin: Application- and Platform-aware Resource Allocation in Consolidated Server Systems.",
                    "DaRPC: Data Center RPC.",
                    "Adaptive Stream Processing using Dynamic Batch Sizing.",
                    "ATAC: Ambient Temperature-Aware Capping for Power Efficient Datacenters.",
                    "Connected Components in MapReduce and Beyond.",
                    "Vanguard: Increasing Server Efficiency via Workload Isolation in the Storage I/O Path.",
                    "Long-term SLOs for reclaimed cloud computing resources.",
                    "Vagabond: Dynamic Network Endpoint Reconfiguration in Virtualized Environments.",
                    "Paxos Quorum Leases: Fast Reads Without Sacrificing Writes.",
                    "C-Hint: An Effective and Reliable Cache Management for RDMA-Accelerated Key-Value Stores.",
                    "Distributed Autonomous Virtual Resource Management in Datacenters Using Finite-Markov Decision Process.",
                    "ReproLite: A Lightweight Tool to Quickly Reproduce Hard System Bugs.",
                    "Wrangler: Predictable and Faster Jobs using Fewer Resources.",
                    "vPipe: Piped I/O Offloading for Efficient Data Movement in Virtualized Clouds.",
                    "Dynamic Performance Profiling of Cloud Caches.",
                    "PriorityMeister: Tail Latency QoS for Shared Networked Storage."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "4th SoCC 2013",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2013",
                "sub_name": "ACM Symposium on Cloud Computing, SOCC '13, Santa Clara, CA, USA, October 1-3, 2013.",
                "count": 60,
                "papers": [
                    "Pico replication: a high availability framework for middleboxes.",
                    "On fault resilience of OpenStack.",
                    "COLO: COarse-grained LOck-stepping virtual machines for non-stop service.",
                    "Hierarchical scheduling for diverse datacenter workloads.",
                    "Apache Hadoop YARN: yet another resource negotiator.",
                    "Natjam: design and evaluation of eviction policies for supporting priorities and deadlines in mapreduce clusters.",
                    "Small is better: avoiding latency traps in virtualized data centers.",
                    "Go, server, go!: parallel computing with moving servers.",
                    "Virtual network diagnosis as a service.",
                    "jVerbs: ultra-low latency for data center applications.",
                    "Orbe: scalable causal consistency using dependency matrices and physical clocks.",
                    "Leveraging sharding in the design of scalable replication protocols.",
                    "Understanding and mitigating the impact of load imbalance in the memory caching tier.",
                    "Limplock: understanding the impact of limpware on scale-out cloud systems.",
                    "When the network crumbles: an empirical study of cloud network failures and their impact on services.",
                    "vTube: efficient streaming of virtual appliances over last-mile networks.",
                    "Scalable lineage capture for debugging DISC analytics.",
                    "Memory-efficient groupby-aggregate using compressed buffer trees.",
                    "Memory footprint matters: efficient equi-join algorithms for main memory data processing.",
                    "Scale-up vs scale-out for Hadoop: time to rethink?",
                    "EventWave: programming model and runtime support for tightly-coupled elastic cloud applications.",
                    "Tolerating business failures in hosted applications.",
                    "Consistency without borders.",
                    "Leveraging data deduplication to improve the performance of primary storage systems in the cloud.",
                    "FAST: near real-time data analytics for the cloud.",
                    "Towards a performance-as-a-service cloud.",
                    "MRM: delivering predictability and service differentiation in shared compute clusters.",
                    "Client-centric benchmarking of eventual consistency for cloud storage systems.",
                    "Introducing service-level awareness in the cloud.",
                    "Mortar: filling the gaps in data center memory.",
                    "PoWER: prediction of workload for energy efficient relocation of virtual machines.",
                    "Simple and efficient coupling of Hadoop with a database engine.",
                    "The wisdom of virtual crowds: mining datacenter telemetry to collaboratively debug performance.",
                    "Extending modern PaaS clouds with BSP to execute legacy MPI applications.",
                    "Adaptive partitioning for large-scale dynamic graphs.",
                    "Towards a general framework for secure MapReduce computation on hybrid clouds.",
                    "CATS: a linearizable and self-organizing key-value store.",
                    "FastMR: fast processing for large distributed data streams.",
                    "XDB: a novel database architecture for data analytics as a service.",
                    "CloudLEGO: scalable cross-VM-type application performance prediction.",
                    "Comparing SSD-placement strategies to scale a database-in-the-cloud.",
                    "VMShadow: optimizing the performance of virtual desktops in distributed clouds.",
                    "Fault-tolerant industrial automation as a cloud service.",
                    "High performance clustering of social images in a map-collective programming model.",
                    "Does RDMA-based enhanced Hadoop MapReduce need a new performance model?",
                    "Syndicate: democratizing cloud storage and caching through service composition.",
                    "Coloring the cloud for predictable performance.",
                    "Decentralized privacy protection strategies for location-based services.",
                    "Recommending just enough memory for analytics.",
                    "Process-oriented recovery for operations on cloud applications.",
                    "CloudSSI: revisiting SSI in cloud era.",
                    "Firewall placement in cloud data centers.",
                    "Harmony: coordinating network, compute, and storage in software-defined clouds.",
                    "Pregelix: dataflow-based big graph analytics.",
                    "Wide-area streaming analytics: distributing the data cube.",
                    "High performance in-memory caching through flexible fine-grained services.",
                    "Compiling machine learning algorithms with SystemML.",
                    "SuperCloud: economical cloud service on multiple vendors.",
                    "Dynamic performance profiling of cloud caches.",
                    "DEDIS: distributed exact deduplication for primary storage infrastructures."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "3rd SoCC 2012",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2012",
                "sub_name": "ACM Symposium on Cloud Computing, SOCC '12, San Jose, CA, USA, October 14-17, 2012.",
                "count": 28,
                "papers": [
                    "Logic and lattices for distributed programming.",
                    "vBalance: using interrupt load balance to improve I/O performance for SMP virtual machines.",
                    "Improving large graph processing on partitioned graphs in the cloud.",
                    "Sailfish: a framework for large scale data processing.",
                    "OS-Sommelier: memory-only operating system fingerprinting in the cloud.",
                    "How consistent is your cloud application?",
                    "Heterogeneity and dynamicity of clouds at scale: Google trace analysis.",
                    "Using vector interfaces to deliver millions of IOPS from a networked key-value storage server.",
                    "Chronos: predictable low latency for data center applications.",
                    "Bridging the tenant-provider gap in cloud services.",
                    "Using batteries to reduce the power costs of internet-scale distributed networks.",
                    "Zeta: scheduling interactive services with partial execution.",
                    "Themis: an I/O-efficient MapReduce.",
                    "Cake: enabling high-level SLOs on shared storage systems.",
                    "Generalized resource allocation for the cloud.",
                    "Balancing reducer skew in MapReduce workloads using progressive sampling.",
                    "Probabilistic deduplication for cluster-based storage systems.",
                    "All aboard the Databus!: Linkedin's scalable consistent change data capture platform.",
                    "Untangling cluster management with Helix.",
                    "More for your money: exploiting performance heterogeneity in public clouds.",
                    "Romano: autonomous storage management using performance prediction in multi-tenant datacenters.",
                    "The potential dangers of causal consistency and an explicit solution.",
                    "A case for dual stack virtualization: consolidating HPC and commodity applications in the cloud.",
                    "True elasticity in multi-tenant data-intensive compute clusters.",
                    "alsched: algebraic scheduling of mixed workloads in heterogeneous clouds.",
                    "Designing good algorithms for MapReduce and beyond.",
                    "Distributed programming and consistency: principles and practice.",
                    "Open source cloud technologies."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "2nd SoCC 2011",
        "info": "Cascais, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2011",
                "sub_name": "ACM Symposium on Cloud Computing in conjunction with SOSP 2011, SOCC '11, Cascais, Portugal, October 26-28, 2011.",
                "count": 30,
                "papers": [
                    "An efficient multi-tier tablet server storage architecture.",
                    "Small-world datacenters.",
                    "Modeling and synthesizing task placement constraints in Google compute clusters.",
                    "DOT: a matrix model for analyzing, optimizing and deploying software for big data analytics in distributed systems.",
                    "CloudScale: elastic resource scaling for multi-tenant cloud systems.",
                    "ALIAS: scalable, decentralized label assignment for data centers.",
                    "Incoop: MapReduce for incremental computations.",
                    "CloudNaaS: a cloud networking platform for enterprise applications.",
                    "YCSB++: benchmarking and performance debugging advanced features in scalable table stores.",
                    "Silverline: toward data confidentiality in storage-intensive cloud applications.",
                    "CoScan: cooperative scan sharing in the cloud.",
                    "Query optimization for massively parallel data processing.",
                    "PrIter: a distributed framework for prioritized iterative computations.",
                    "Policy expressivity in the Anzere personal cloud.",
                    "ActiveSLA: a profit-oriented admission control framework for database-as-a-service providers.",
                    "Orleans: cloud computing for everyone.",
                    "PipeCloud: using causality to overcome speed-of-light delays in cloud-based disaster recovery.",
                    "No one (cluster) size fits all: automatic cluster sizing for data-intensive analytics.",
                    "Pesto: online storage performance management in virtualized datacenters.",
                    "Making time-stepped applications tick in the cloud.",
                    "Trojan data layouts: right shoes for a running elephant.",
                    "Cuanta: quantifying effects of shared on-chip resource interference for consolidated virtual machines.",
                    "Small cache, big effect: provable load balancing for randomly partitioned cluster services.",
                    "Opportunistic flooding to improve TCP transmit performance in virtualized clouds.",
                    "Improving per-node efficiency in the datacenter with new OS abstractions.",
                    "Declarative automated cloud resource orchestration.",
                    "Automatic management of partitioned, replicated search services.",
                    "Scaling the mobile millennium system in the cloud.",
                    "To cloud or not to cloud?: musings on costs and viability.",
                    "Switching the optical divide: fundamental challenges for hybrid electrical/optical datacenter networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "1st SoCC 2010",
        "info": "Indianapolis, Indiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cloud/2010",
                "sub_name": "Proceedings of the 1st ACM Symposium on Cloud Computing, SoCC 2010, Indianapolis, Indiana, USA, June 10-11, 2010.",
                "count": 26,
                "papers": [
                    "Evolution and future directions of large-scale storage and computation systems at Google.",
                    "An operating system for multicore and clouds: mechanisms and implementation.",
                    "Lithium: virtual machine storage for the cloud.",
                    "Differential virtual time (DVT): rethinking I/O service differentiation for virtual machines.",
                    "Virtual machine power metering and provisioning.",
                    "Stateful bulk processing for incremental analytics.",
                    "Comet: batched stream processing for data intensive distributed computing.",
                    "Skew-resistant parallel processing of feature-extracting scientific user-defined functions.",
                    "Building facebook: performance at massive scale.",
                    "Hermes: clustering users in large-scale e-mail services.",
                    "Defining future platform requirements for e-Science clouds.",
                    "Fluxo: a system for internet service programming by non-expert developers.",
                    "Nephele/PACTs: a programming model and execution framework for web-scale analytical processing.",
                    "The case for PIQL: a performance insightful query language.",
                    "Towards automatic optimization of MapReduce programs.",
                    "Benchmarking cloud serving systems with YCSB.",
                    "Automated software testing as a service.",
                    "The internal design of salesforce.com's multi-tenant architecture.",
                    "G-Store: a scalable data store for transactional multi key access in the cloud.",
                    "Google fusion tables: data management, integration and collaboration in the cloud.",
                    "Making cloud intermediate data fault-tolerant.",
                    "Characterizing cloud computing hardware reliability.",
                    "A self-organized, fault-tolerant and scalable replication scheme for cloud storage.",
                    "Robust and flexible power-proportional storage.",
                    "RACS: a case for cloud storage diversity.",
                    "Characterizing, modeling, and generating workload spikes for stateful services."
                ]
            }
        ]
    }
]