[
    {
        "year": "2021",
        "name": "33rd SPAA 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2021",
                "sub_name": "SPAA '21: 33rd ACM Symposium on Parallelism in Algorithms and Architectures, Virtual Event, USA, 6-8 July, 2021.",
                "count": 49,
                "papers": [
                    "SPAA'21 Panel Paper: Architecture-Friendly Algorithms versus Algorithm-Friendly Architectures.",
                    "Fast Stencil Computations using Fast Fourier Transforms.",
                    "Low-Span Parallel Algorithms for the Binary-Forking Model.",
                    "Provable Advantages for Graph Algorithms in Spiking Neural Networks.",
                    "Algorithms for Right-Sizing Heterogeneous Data Centers.",
                    "Efficient Parallel Self-Adjusting Computation.",
                    "Parallel Minimum Cuts in O(m log2n) Work and Low Depth.",
                    "Speed Scaling with Explorable Uncertainty.",
                    "Efficient Online Weighted Multi-Level Paging.",
                    "Paging and the Address-Translation Problem.",
                    "Massively Parallel Algorithms for Distance Approximation and Spanners.",
                    "Efficient Load-Balancing through Distributed Token Dropping.",
                    "Finding Subgraphs in Highly Dynamic Networks.",
                    "On Sparsity Awareness in Distributed Computations.",
                    "Near-Optimal Time-Energy Trade-Offs for Deterministic Leader Election.",
                    "Hemlock: Compact and Scalable Mutual Exclusion.",
                    "Efficient Stepping Algorithms and Implementations for Parallel Shortest Paths.",
                    "Deterministic PRAM Approximate Shortest Paths in Polylogarithmic Time and Slightly Super-Linear Work.",
                    "A Scalable Concurrent Algorithm for Dynamic Connectivity.",
                    "Optimal Virtual Network Embeddings for Tree Topologies.",
                    "Efficiency and Stability in Euclidean Network Design.",
                    "Parallel Algorithms for Finding Large Cliques in Sparse Graphs.",
                    "On the Complexity of Load Balancing in Dynamic Networks.",
                    "Four Shades of Deterministic Leader Election in Anonymous Networks.",
                    "String Matching with Wildcards in the Massively Parallel Computation Model.",
                    "Non-Clairvoyant Scheduling with Predictions.",
                    "The Processing-in-Memory Model.",
                    "Supervised Average Consensus in Anonymous Dynamic Networks.",
                    "Scheduling Opportunistic Links in Two-Tiered Reconfigurable Datacenters.",
                    "Pebbles, Graphs, and a Pinch of Combinatorics: Towards Tight I/O Lower Bounds for Statically Analyzable Programs.",
                    "Analysis of Busy-Time Scheduling on Heterogeneous Machines.",
                    "Work-Optimal Parallel Minimum Cuts for Non-Sparse Graphs.",
                    "Distributed Graph Coloring Made Easy.",
                    "Data Oblivious Algorithms for Multicores.",
                    "Durable Queues: The Second Amendment.",
                    "Efficient Parallel Determinacy Race Detection for Structured Futures.",
                    "Parallel Network Mapping Algorithms.",
                    "Block-Granularity-Aware Caching.",
                    "Network Scaffolding for Efficient Stabilization of the Chord Overlay Network.",
                    "Min-Max Gathering of Oblivious Robots.",
                    "PHPRX: An Efficient Hash Table for Persistent Memory.",
                    "A Scalable Recoverable Skip List for Persistent Memory.",
                    "Toward Self-Adjusting Networks for the Matching Model.",
                    "Deterministic Size Discovery and Topology Recognition in Radio Networks with Short Labels.",
                    "BALM: QoS-Aware Memory Bandwidth Partitioning for Multi-Socket Cloud Nodes.",
                    "Efficient Distributed Algorithms for Convolutional Neural Networks.",
                    "VBR: Version Based Reclamation.",
                    "Semantic Conflict Detection for Transactional Data Structure Libraries.",
                    "Efficient Access History for Race Detection."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "32nd SPAA 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2020",
                "sub_name": "SPAA '20: 32nd ACM Symposium on Parallelism in Algorithms and Architectures, Virtual Event, USA, July 15-17, 2020.",
                "count": 68,
                "papers": [
                    "Simple Local Computation Algorithms for the General Lovász Local Lemma.",
                    "Faster Deterministic All Pairs Shortest Paths in Congest Model.",
                    "Contention Resolution with Message Deadlines.",
                    "Memory Tagging: Minimalist Synchronization for Scalable Concurrent Data Structures.",
                    "Work-Efficient Batch-Incremental Minimum Spanning Trees with Applications to the Sliding-Window Model.",
                    "Closing the Gap Between Cache-oblivious and Cache-adaptive Analysis.",
                    "Optimal Resource Allocation for Elastic and Inelastic Jobs.",
                    "Optimal Parallel Algorithms in the Binary-Forking Model.",
                    "Randomized Incremental Convex Hull is Highly Parallel.",
                    "Almost Universal Anonymous Rendezvous in the Plane.",
                    "The Online Multi-Commodity Facility Location Problem.",
                    "Unconditional Lower Bounds for Adaptive Massively Parallel Computation.",
                    "On the Hardness of Massively Parallel Computation.",
                    "Parallel Load Balancing on Constrained Client-Server Topologies.",
                    "Graph Sparsification for Derandomizing Massively Parallel Computation with Low Space.",
                    "How to Manage High-Bandwidth Memory Automatically.",
                    "Self-Stabilizing Task Allocation In Spite of Noise.",
                    "Constant-Length Labelling Schemes for Faster Deterministic Radio Broadcast.",
                    "Time- and Space-Optimal Discrete Clock Synchronization in the Beeping Model.",
                    "Predicate Detection to Solve Combinatorial Optimization Problems.",
                    "Efficient Local Medium Access.",
                    "A Massively Parallel Algorithm for Minimum Weight Vertex Cover.",
                    "Parallel Planar Subgraph Isomorphism and Vertex Connectivity.",
                    "The Recoverable Consensus Hierarchy.",
                    "Bandwidth Optimized Parallel Algorithms for Sparse Matrix-Matrix Multiplication using Propagation Blocking.",
                    "Scheduling Flows on a Switch to Optimize Response Times.",
                    "Sublinear Algorithms in T-interval Dynamic Networks.",
                    "Spectral Lower Bounds on the I/O Complexity of Computation Graphs.",
                    "Commitment and Slack for Online Load Maximization.",
                    "Approximation Algorithms for Scheduling with Class Constraints.",
                    "Connected Components on a PRAM in Log Diameter Time.",
                    "Fast Byzantine Agreement for Permissioned Distributed Ledgers.",
                    "The Append Memory Model: Why BlockDAGs Excel Blockchains.",
                    "A Unified Sparsification Approach for Matching Problems in Graphs of Bounded Neighborhood Independence.",
                    "Deterministic Leader Election in Anonymous Radio Networks.",
                    "On the Hardness of Red-Blue Pebble Games.",
                    "Non-Linear Ski Rental.",
                    "pTrans: A Scalable Algorithm for Reservation Guarantees in Distributed Systems.",
                    "Functional Faults.",
                    "Priority Scheduling for Interactive Applications.",
                    "Communication vs Synchronisation in Parallel String Comparison.",
                    "Reconstructing Binary Trees in Parallel.",
                    "Green Paging and Parallel Paging.",
                    "Provable Neuromorphic Advantages for Computing Shortest Paths.",
                    "A LOCAL Constant Approximation Factor Algorithm for Minimum Dominating Set of Certain Planar Graphs.",
                    "Tracking in Order to Recover - Detectable Recovery of Lock-Free Data Structures.",
                    "ParlayLib - A Toolkit for Parallel Algorithms on Shared-Memory Multicore Machines.",
                    "Improved Work Span Tradeoff for Single Source Reachability and Approximate Shortest Paths.",
                    "A Discrete and Continuous Study of the Max-Chain-Formation Problem: Slow Down to Speed up.",
                    "A Computational Model for Tensor Core Units.",
                    "Communication-Optimal Tilings for Projective Nested Loops with Arbitrary Bounds.",
                    "Efficient Distributed Algorithms for the K-Nearest Neighbors Problem.",
                    "How Fast Can You Update Your MST?",
                    "A Queueing Network-Based Distributed Laplacian Solver.",
                    "A Closer Look at Quantum Distributed Consensus.",
                    "Communication-Efficient Weighted Reservoir Sampling from Fully Distributed Data Streams.",
                    "Multicore Paging Algorithms Cannot Be Competitive.",
                    "Cache-Efficient Parallel-Partition Algorithms using Exclusive-Read-and-Write Memory.",
                    "Towards Lockfree Persistent Homology.",
                    "Sparse Tensor Transpositions.",
                    "Network Partitioning and Avoidable Contention.",
                    "On the Limits of Parallelizing Convolutional Neural Networks on GPUs.",
                    "Efficient Concurrent Range Queries in B+-trees using RCU-HTM.",
                    "Balanced Partitioning of Several Cache-Oblivious Algorithms.",
                    "Feasibility of Cross-Chain Payment with Success Guarantees.",
                    "Benchmarking Recoverable Mutex Locks.",
                    "Giving Future(s) to Transactional Memory.",
                    "Communication Lower Bounds of Convolutions in CNNs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "31st SPAA 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2019",
                "sub_name": "The 31st ACM on Symposium on Parallelism in Algorithms and Architectures, SPAA 2019, Phoenix, AZ, USA, June 22-24, 2019.",
                "count": 46,
                "papers": [
                    "The Price of Clustering in Bin-Packing with Applications to Bin-Packingwith Delays.",
                    "Faster Matrix Multiplication via Sparse Decomposition.",
                    "NC Algorithms for Computing a Perfect Matching, the Number of Perfect Matchings, and a Maximum Flow in One-Crossing-Minor-Free Graphs.",
                    "Improved MPC Algorithms for Edit Distance and Ulam Distance.",
                    "Scalable Diversity Maximization via Small-size Composable Core-sets (Brief Announcement).",
                    "Eccentricities via Parallel Set Cover (Brief Announcement).",
                    "Asymptotically Optimal Filters.",
                    "Dynamic Algorithms for the Massively Parallel Computation Model.",
                    "Massively Parallel Computation via Remote Memory Access.",
                    "Distributed Computation in Node-Capacitated Networks.",
                    "Ultra-Fast Asynchronous Randomized Rumor Spreading (Brief Announcement).",
                    "Using Time to Break Symmetry: Universal Deterministic Anonymous Rendezvous.",
                    "Almost Logarithmic-Time Space Optimal Leader Election in Population Protocols.",
                    "The Dispersion Time of Random Walks on Finite Graphs.",
                    "Best-of-Three Voting on Dense Graphs.",
                    "Near Optimal Coflow Scheduling in Networks.",
                    "An EPTAS for Machine Scheduling with Bag-Constraints.",
                    "Efficiency Guarantees for Parallel Incremental Algorithms under Relaxed Schedulers.",
                    "Near-Linear Approximation Algorithms for Scheduling Problems with Batch Setup Times.",
                    "Reduced I/O Latency with Futures (Brief Announcement).",
                    "Optimizing Persistent Transactions (Brief Announcement).",
                    "Constant-Length Labeling Schemes for Deterministic Radio Broadcast.",
                    "Fast and Resource Competitive Broadcast in Multi-channel Radio Networks.",
                    "Energy Efficient Adversarial Routing in Shared Channels.",
                    "Histogram Sort with Sampling.",
                    "Theoretically-Efficient and Practical Parallel In-Place Radix Sorting.",
                    "The Arvy Distributed Directory Protocol.",
                    "Approximation of Scheduling with Calibrations on Multiple Machines (Brief Announcement).",
                    "Multiversion Concurrency with Bounded Delay and Precise Garbage Collection.",
                    "Delay-Free Concurrency on Faulty Persistent Memory.",
                    "Small Refinements to the DAM Can Have Big Consequences for Data-Structure Design.",
                    "Persistent Non-Blocking Binary Search Trees Supporting Wait-Free Range Queries.",
                    "Skeap & Seap: Scalable Distributed Priority Queues for Constant and Arbitrary Priorities.",
                    "Concurrent Data Structures with Near-Data-Processing: an Architecture-Aware Implementation.",
                    "Persistent Atomics for Implementing Durable Lock-Free Data Structures for Non-Volatile Memory (Brief Announcement).",
                    "Parallel Balanced Allocations: The Heavily Loaded Case.",
                    "Geometric Network Creation Games.",
                    "Linear-Size Hopsets with Small Hopbound, and Constant-Hopbound Hopsets in RNC.",
                    "A Parallel Algorithm for Subgraph Isomorphism (Brief Announcement).",
                    "Writeback-Aware Caching (Brief Announcement).",
                    "Blockchain Abstract Data Type.",
                    "Data Races and the Discrete Resource-time Tradeoff Problem with Resource Reuse over Paths.",
                    "Distributed Transactional Systems Cannot Be Fast.",
                    "Parallel Batch-Dynamic Graph Connectivity.",
                    "Fast Distributed Algorithms for LP-Type Problems of Bounded Dimension (Brief Announcement).",
                    "A Memory Optimized Architecture for Multi-Field Packet Classification (Brief Announcement)."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "30th SPAA 2018",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2018",
                "sub_name": "Proceedings of the 30th on Symposium on Parallelism in Algorithms and Architectures, SPAA 2018, Vienna, Austria, July 16-18, 2018.",
                "count": 49,
                "papers": [
                    "Parallel Minimum Cuts in Near-linear Work and Low Depth.",
                    "Wireless Expanders.",
                    "Trees for Vertex Cuts, Hypergraph Cuts and Minimum Hypergraph Bisection.",
                    "Dynamic Representations of Sparse Distributed Networks: A Locality-Sensitive Approach.",
                    "Greedy and Local Ratio Algorithms in the MapReduce Model.",
                    "The Resurgence of Software Performance Engineering.",
                    "A 3D Parallel Algorithm for QR Decomposition.",
                    "Constant-Depth and Subcubic-Size Threshold Circuits for Matrix Multiplication.",
                    "Integrated Model, Batch, and Domain Parallelism in Training Neural Networks.",
                    "Brief Announcement: On Approximating PageRank Locally with Sublinear Query Complexity.",
                    "Brief Announcement: Coloring-based Task Mapping for Dragonfly Systems.",
                    "Brief Announcement: Parallel Transitive Closure Within 3D Crosspoint Memory.",
                    "BQ: A Lock-Free Queue with Batching.",
                    "An Efficient Wait-free Resizable Hash Table.",
                    "Lock-free Contention Adapting Search Trees.",
                    "Distributionally Linearizable Data Structures.",
                    "Distributed Domination on Graph Classes of Bounded Expansion.",
                    "Possibilities and Impossibilities for Distributed Subgraph Detection.",
                    "Towards a Complexity Theory for the Congested Clique.",
                    "Breaking the $ilde$Omega($sqrt{n})$ Barrier: Fast Consensus under a Late Adversary.",
                    "Intense Competition can Drive Selfish Explorers to Optimize Coverage.",
                    "Massive-scale Streaming Analytics: Models, Parallelism, & Real-world Applications.",
                    "Red-Blue Pebble Game: Complexity of Computing the Trade-Off between Cache Size and Memory Transfers.",
                    "Online Generalized Caching with Varying Weights and Costs.",
                    "Cache-Adaptive Exploration: Experimental Results and Scan-Hiding for Adaptivity.",
                    "Brief Announcement: Distributed Symmetry-Breaking with Improved Vertex-Averaged Complexity.",
                    "Brief Announcement: Hardware Transactional Persistent Memory.",
                    "Brief Announcement: Competitive Routing in Hybrid Communication Networks.",
                    "Parallel Write-Efficient Algorithms and Data Structures for Computational Geometry.",
                    "The Parallel Persistent Memory Model.",
                    "The Inherent Cost of Remembering Consistently.",
                    "Romulus: Efficient Algorithms for Persistent Transactional Memory.",
                    "A Unified Rounding Algorithm For Unrelated Machines Scheduling Problems.",
                    "Online Non-preemptive Scheduling on Unrelated Machines with Rejections.",
                    "The Price of Bounded Preemption.",
                    "Accurate Traffic Splitting on Commodity Switches.",
                    "Parallel Working-Set Search Structures.",
                    "Improved Worst-Case Deterministic Parallel Dynamic Minimum Spanning Forest.",
                    "Brief Announcement: Approximation Algorithms for Preemptive Resource Allocation.",
                    "Brief Announcement: A Greedy 2 Approximation for the Active Time Problem.",
                    "Brief Announcement: Open Cilk.",
                    "Brief Announcement: Stamp-it, a more Thread-efficient, Concurrent Memory Reclamation Scheme in the C++ Memory Model.",
                    "Brief Announcement: Communication in Systems of Home Based Mobile Agents.",
                    "Optimal Algorithms for Right-Sizing Data Centers.",
                    "Online Facility Location with Mobile Facilities.",
                    "The Transactional Conflict Problem.",
                    "Theoretically Efficient Parallel Graph Algorithms Can Be Fast and Scalable.",
                    "On the Distributed Complexity of Large-Scale Graph Computations.",
                    "Laika: Efficient In-Place Scheduling for 3D Mesh Graph Computations."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "29th SPAA 2017",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2017",
                "sub_name": "Proceedings of the 29th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2017, Washington DC, USA, July 24-26, 2017.",
                "count": 47,
                "papers": [
                    "Beyond P vs. NP: Quadratic-Time Hardness for Big Data Problems.",
                    "Randomized Composable Coresets for Matching and Vertex Cover.",
                    "Almost Optimal Streaming Algorithms for Coverage Problems.",
                    "Bicriteria Distributed Submodular Maximization in a Few Rounds.",
                    "On Energy Conservation in Data Centers.",
                    "Asymptotically Optimal Approximation Algorithms for Coflow Scheduling.",
                    "Online Flexible Job Scheduling for Minimum Span.",
                    "Minimizing Total Weighted Flow Time with Calibrations.",
                    "Tight Bounds for Clairvoyant Dynamic Bin Packing.",
                    "Brief Announcement: Scheduling Parallelizable Jobs Online to Maximize Throughput.",
                    "Brief Announcement: A New Improved Bound for Coflow Scheduling.",
                    "Bounding Laconic Proof Systems by Solving CSPs in Parallel.",
                    "Matrix Multiplication, a Little Faster.",
                    "A Communication-Avoiding Parallel Algorithm for the Symmetric Eigenvalue Problem.",
                    "Sharing is Caring: Multiprocessor Scheduling with a Sharable Resource.",
                    "Brief Announcement: Graph Matching in Massive Datasets.",
                    "Brief Announcement: Using Multi-Level Parallelism and 2-3 Cuckoo Filters for Set Intersection Queries and Sparse Boolean Matrix Multiplication.",
                    "Some Sequential Algorithms are Almost Always Parallel.",
                    "Distributed Partial Clustering.",
                    "Distributed Detection of Cycles.",
                    "Distributed Graph Clustering by Load Balancing.",
                    "Fast Scheduling in Distributed Transactional Memory.",
                    "Is Our Model for Contention Resolution Wrong?: Confronting the Cost of Collisions.",
                    "Optimal Reissue Policies for Reducing Tail Latency.",
                    "Impact of Knowledge on Election Time in Anonymous Networks.",
                    "Swarm-based Incast Congestion Control in Datacenters Serving Web Applications.",
                    "Brief Announcement: Approximation Algorithms for Unsplittable Resource Allocation Problems with Diseconomies of Scale.",
                    "Brief Announcement: Towards Fault-Tolerant Bin Packing for Online Cloud Resource Allocation.",
                    "Concurrent Data Structures for Near-Memory Computing.",
                    "Lower Bounds in the Asymmetric External Memory Model.",
                    "Hand-Over-Hand Transactions with Precise Memory Reclamation.",
                    "Optimal Local Buffer Management for Information Gathering with Adversarial Traffic.",
                    "Brief Announcement: Parallel Dynamic Tree Contraction via Self-Adjusting Computation.",
                    "Brief Announcement: STAR (Space-Time Adaptive and Reductive) Algorithms for Dynamic Programming Recurrences with more than O(1) Dependency.",
                    "Near Optimal Parallel Algorithms for Dynamic DFS in Undirected Graphs.",
                    "Julienne: A Framework for Parallel Graph Algorithms using Work-efficient Bucketing.",
                    "Improved Cover Time Bounds for the Coalescing-Branching Random Walk on Graphs.",
                    "The Mobile Server Problem.",
                    "Brief Announcement: Efficient Best Response Computation for Strategic Network Formation under Attack.",
                    "Brief Announcement: Complete Visibility for Oblivious Robots in Linear Time.",
                    "Online Tree Caching.",
                    "Provably Efficient Scheduling of Cache-oblivious Wavefront Algorithms.",
                    "Bounding Cache Miss Costs of Multithreaded Computations Under General Schedulers: Extended Abstract.",
                    "Brief Announcement: Meeting the Challenges of Parallelizing Sequential Programs.",
                    "Brief Announcement: Hazard Eras - Non-Blocking Memory Reclamation.",
                    "Brief Announcement: Extending Transactional Memory with Atomic Deferral.",
                    "Brief Announcement: Hardware Transactional Storage Class Memory."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "28th SPAA 2016",
        "info": "Asilomar State Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2016",
                "sub_name": "Proceedings of the 28th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2016, Asilomar State Beach/Pacific Grove, CA, USA, July 11-13, 2016.",
                "count": 54,
                "papers": [
                    "Shuffles and Circuits: (On Lower Bounds for Modern Parallel Computation).",
                    "Parallel Algorithms for Summing Floating-Point Numbers.",
                    "Randomized Approximate Nearest Neighbor Search with Limited Adaptivity.",
                    "Encoding Short Ranges in TCAM Without Expansion: Efficient Algorithm and Applications.",
                    "On Computational Thinking, Inferential Thinking and Data Science.",
                    "Extending the Nested Parallel Model to the Nested Dataflow Model with Provably Efficient Schedulers.",
                    "A Practical Solution to the Cactus Stack Problem.",
                    "Latency-Hiding Work Stealing: Scheduling Interacting Parallel Computations with Work Stealing.",
                    "Provably Good and Practically Efficient Parallel Race Detection for Fork-Join Programs.",
                    "Brief Announcement: Dynamic Determinacy Race Detection for Task Parallelism with Futures.",
                    "RUBIC: Online Parallelism Tuning for Co-located Transactional Memory Applications.",
                    "Extending TM Primitives using Low Level Semantics.",
                    "Investigating the Performance of Hardware Transactions on a Multi-Socket Machine.",
                    "Brief Announcement: Transactional Data Structure Libraries.",
                    "Cache-Adaptive Analysis.",
                    "Parallel Algorithms for Asymmetric Read-Write Costs.",
                    "Brief Announcement: Preserving Happens-before in Persistent Memory.",
                    "Brief Announcement: Approximating the I/O Complexity of One-Shot Red-Blue Pebbling.",
                    "General Profit Scheduling and the Power of Migration on Heterogeneous Machines.",
                    "The Power of Migration in Online Machine Minimization.",
                    "Fair Online Scheduling for Selfish Jobs on Heterogeneous Machines.",
                    "Scheduling Parallelizable Jobs Online to Minimize the Maximum Flow Time.",
                    "Brief Announcement: A QPTAS for Non-preemptive Speed-scaling.",
                    "A Multicore Path to Connectomics-on-Demand.",
                    "Robust and Probabilistic Failure-Aware Placement.",
                    "Brief Announcement: Flexible Resource Allocation for Clouds and All-Optical Networks.",
                    "Clairvoyant Dynamic Bin Packing for Job Scheduling with Minimum Server Usage Time.",
                    "Brief Announcement: Improved Approximation Algorithms for Scheduling Co-Flows.",
                    "Online Packet Scheduling for CIOQ and Buffered Crossbar Switches.",
                    "Brief Announcement: Energy Optimization of Memory Intensive Parallel Workloads.",
                    "Just Join for Parallel Ordered Sets.",
                    "Parallel Equivalence Class Sorting: Algorithms, Lower Bounds, and Distribution-Based Analysis.",
                    "Parallel Approaches to the String Matching Problem on the GPU.",
                    "Brief Announcement: MIC++: Accelerating Maximal Information Coefficient Calculation with GPUs and FPGAs.",
                    "Universal Shape Formation for Programmable Matter.",
                    "Asymptotically Optimal Gathering on a Grid.",
                    "Better Bounds for Coalescing-Branching Random Walks.",
                    "Lock-free Transactions without Rollbacks for Linked Data Structures.",
                    "Concurrent Search Data Structures Can Be Blocking and Practically Wait-Free.",
                    "Fast and Robust Memory Reclamation for Concurrent Data Structures.",
                    "Brief Announcement: Benchmarking Concurrent Priority Queues.",
                    "Brief Announcement: Fast Concurrent Cuckoo Kick-Out Eviction Schemes for High-Density Tables.",
                    "The Family Holiday Gathering Problem or Fair and Periodic Scheduling of Independent Sets.",
                    "Election vs. Selection: How Much Advice is Needed to Find the Largest Node in a Graph?",
                    "Near-Optimal Distributed Algorithms for Fault-Tolerant Tree Structures.",
                    "Brief Announcement: Applications of Uniform Sampling: Densest Subgraph and Beyond.",
                    "Brief Announcement: Relaxed Byzantine Vector Consensus.",
                    "The Cost of Unknown Diameter in Dynamic Networks.",
                    "Churn- and DoS-resistant Overlay Networks Based on Network Reconfiguration.",
                    "Fast Distributed Algorithms for Connectivity and MST in Large Graphs.",
                    "Brief Announcement: A Tight Distributed Algorithm for All Pairs Shortest Paths and Applications.",
                    "Parallel Shortest Paths Using Radius Stepping.",
                    "Parallel Metric Tree Embedding based on an Algebraic View on Moore-Bellman-Ford.",
                    "Parallelism in Randomized Incremental Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "27th SPAA 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2015",
                "sub_name": "Proceedings of the 27th ACM on Symposium on Parallelism in Algorithms and Architectures, SPAA 2015, Portland, OR, USA, June 13-15, 2015.",
                "count": 44,
                "papers": [
                    "Sorting with Asymmetric Read and Write Costs.",
                    "Practical Massively Parallel Sorting.",
                    "A Top-Down Parallel Semisort.",
                    "Matrix Multiplication I/O-Complexity by Path Routing.",
                    "Online Caching with Convex Costs: Extended Abstract.",
                    "Myths and Misconceptions about Threads.",
                    "Brief Announcement: New Streaming Algorithms for Parameterized Maximal Matching & Beyond.",
                    "Brief Announcement: Local Computation Algorithms for Graphs of Non-Constant Degrees.",
                    "Brief Announcement: Efficient Approximation Algorithms for Computing k Disjoint Restricted Shortest Paths.",
                    "Brief Announcement: Fast and Better Distributed MapReduce Algorithms for k-Center Clustering.",
                    "Brief Announcement: Fair Adaptive Parallelism for Concurrent Transactional Memory Applications.",
                    "Brief Announcement: Managing Resource Limitation of Best-Effort HTM.",
                    "Brief Announcement: On Scheduling Best-Effort HTM Transactions.",
                    "Brief Announcement: Towards a Universal Approach for the Finite Departure Problem in Overlay Networks.",
                    "Brief Announcement: MultiQueues: Simple Relaxed Concurrent Priority Queues.",
                    "Brief Announcement: A Compiler-Runtime Application Binary Interface for Pipe-While Loops.",
                    "Brief Announcement: Hypergraph Partitioning for Parallel Sparse Matrix-Matrix Multiplication.",
                    "The Cilkprof Scalability Profiler.",
                    "Race Detection in Two Dimensions.",
                    "Efficiently Detecting Races in Cilk Programs That Use Reducer Hyperobjects.",
                    "ThreadScan: Automatic and Scalable Memory Reclamation.",
                    "Speed Scaling in the Non-clairvoyant Model.",
                    "Cost-Oblivious Reallocation for Scheduling and Planning.",
                    "Temporal Fairness of Round Robin: Competitive Analysis for Lk-norms of Flow Time.",
                    "Scheduling Non-Unit Jobs to Minimize Calibrations.",
                    "Scheduling in Bandwidth Constrained Tree Networks.",
                    "The Revolution in Graph Theoretic Optimization Problems.",
                    "Space and Time Efficient Parallel Graph Decomposition, Clustering, and Diameter Approximation.",
                    "Improved Parallel Algorithms for Spanners and Hopsets.",
                    "Access to Data and Number of Iterations: Dual Primal Algorithms for Maximum Matching under Resource Constraints.",
                    "Branch-Avoiding Graph Algorithms.",
                    "Seer: Probabilistic Scheduling for Hardware Transactional Memory.",
                    "Conflict Reduction in Hardware Transactions Using Advisory Locks.",
                    "Transactional Acceleration of Concurrent Data Structures.",
                    "Efficient Memory Management for Lock-Free Data Structures with Optimistic Access.",
                    "Fault Tolerant BFS Structures: A Reinforcement-Backup Tradeoff.",
                    "Distributed Backup Placement in Networks.",
                    "Better Deterministic Online Packet Routing on Grids.",
                    "Minimizing the Total Weighted Completion Time of Coflows in Datacenter Networks.",
                    "Electing a Leader in Wireless Networks Quickly Despite Jamming.",
                    "Communication-Efficient Computation on Distributed Noisy Datasets.",
                    "Parallel Computation of Persistent Homology using the Blowup Complex.",
                    "Self-Stabilizing Repeated Balls-into-Bins.",
                    "Randomized Local Network Computing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "26th SPAA 2014",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2014",
                "sub_name": "26th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA '14, Prague, Czech Republic - June 23 - 25, 2014.",
                "count": 44,
                "papers": [
                    "A distributed perspective on graph connectivity and cuts.",
                    "On dynamic bin packing for resource allocation in the cloud.",
                    "On the online fault-tolerant server consolidation problem.",
                    "Competitively scheduling tasks with intermediate parallelizability.",
                    "Experimental analysis of space-bounded schedulers.",
                    "On computing maximal independent sets of hypergraphs in parallel.",
                    "Hierarchical graph partitioning.",
                    "Simple parallel and distributed algorithms for spectral graph sparsification.",
                    "Brief announcement: few buffers, many hot spots, and no tree saturation (with high probability).",
                    "Brief announcement: queue delegation locking.",
                    "Brief announcement: fast dual ring queues.",
                    "Brief announcement: concurrent data structures for efficient streaming aggregation.",
                    "Brief announcement: cache-oblivious scheduling of streaming pipelines.",
                    "Brief announcement: persistent unfairness arising from cache residency imbalance.",
                    "Provably good scheduling for parallel programs that use data structures through implicit batching.",
                    "Phase-concurrent hash tables for determinism.",
                    "Scheduling selfish jobs on multidimensional parallel machines.",
                    "LP rounding and combinatorial algorithms for minimizing active and busy time.",
                    "Scheduling shared continuous resources on many-cores.",
                    "A note on multiprocessor speed scaling with precedence constraints.",
                    "A simple and practical linear-work parallel algorithm for connectivity.",
                    "Executing dynamic data-graph computations deterministically using chromatic scheduling.",
                    "Ordering heuristics for parallel graph coloring.",
                    "The PCL theorem: transactions cannot be parallel, consistent and live.",
                    "Adaptive integration of hardware and software lock elision techniques.",
                    "Transaction-friendly condition variables.",
                    "Brief announcement: fairness-efficiency tradeoffs in tiered storage allocation.",
                    "Brief announcement: deadline-aware scheduling of big-data processing jobs.",
                    "Brief announcement: parallelization of asynchronous variational integrators forshared memory architectures.",
                    "Brief annoucement: a distributed minimum cut approximation scheme.",
                    "Brief announcement: amoebot - a new model for programmable matter.",
                    "Brief announcement: faster 3-periodic merging networks.",
                    "Automatic complexity analysis of explicitly parallel programs.",
                    "Parallel streaming frequency-based aggregates.",
                    "A universal approach to data center network design.",
                    "Simple dynamics for plurality consensus.",
                    "(Near) optimal resource-competitive broadcast with jamming.",
                    "Ephemeral networks with random availability of links: diameter and connectivity.",
                    "Locality-based network creation games.",
                    "Finding approximate partitions and splitters in external memory.",
                    "On characterizing the data movement complexity of computational DAGs for parallel execution.",
                    "Tradeoffs between synchronization, communication, and computation in parallel linear algebra computations.",
                    "Parallel peeling algorithms.",
                    "Balanced allocations and double hashing."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "25th SPAA 2013",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2013",
                "sub_name": "25th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA '13, Montreal, QC, Canada - July 23 - 25, 2013.",
                "count": 39,
                "papers": [
                    "Fast greedy algorithms in mapreduce and streaming.",
                    "Reduced hardware transactions: a new approach to hybrid transactional memory.",
                    "Recursive design of hardware priority queues.",
                    "Drop the anchor: lightweight memory management for non-blocking data structures.",
                    "Scalable statistics counters.",
                    "Storage and search in dynamic peer-to-peer networks.",
                    "Broadcasting in logarithmic time for ad hoc network nodes on a line using mimo.",
                    "Expected sum and maximum of displacement of random sensors for coverage of a domain: extended abstract.",
                    "On dynamics in selfish network creation.",
                    "Brief announcement: truly parallel burrows-wheeler compression and decompression.",
                    "Brief announcement: locality in wireless scheduling.",
                    "Brief announcement: universally truthful secondary spectrum auctions.",
                    "Brief announcement: online batch scheduling for flow objectives.",
                    "Brief announcement: set it and forget it - approximating the set once strip cover problem.",
                    "Brief announcement: between all and nothing - versatile aborts in hardware transactional memory.",
                    "Brief announcement: towards a fully-articulated pessimistic distributed transactional memory.",
                    "Brief announcement: a game-theoretic model motivated by the darpa network challenge.",
                    "IRIS: a robust information system against insider dos-attacks.",
                    "SybilCast: broadcast on the open airwaves (extended abstract).",
                    "On-the-fly pipeline parallelism.",
                    "Reducing contention through priority updates.",
                    "HEX: scaling honeycombs is easier than scaling clock trees.",
                    "Coalescing-branching random walks on graphs.",
                    "Parallel rotor walks on finite graphs and applications in discrete load balancing.",
                    "Parallel graph decompositions using random shifts.",
                    "A constant factor approximation algorithm for the storage allocation problem: extended abstract.",
                    "Work-efficient matrix inversion in polylogarithmic time.",
                    "Communication optimal parallel multiplication of sparse random matrices.",
                    "Communication efficient gaussian elimination with partial pivoting using a shape morphing data layout.",
                    "Optimal patrolling of fragmented boundaries.",
                    "Profitable scheduling on multiple speed-scalable processors.",
                    "Nonclairvoyant sleep management and flow-time scheduling on multiple processors.",
                    "Reallocation problems in scheduling.",
                    "Efficient scheduling to minimize calibrations.",
                    "Non-monetary fair scheduling: a cooperative game theory approach.",
                    "Cloud scheduling with setup cost.",
                    "Efficient online scheduling for deadline-sensitive jobs: extended abstract.",
                    "Locality-aware task management for unstructured parallelism: a quantitative limit study.",
                    "Balls-into-bins with nearly optimal load distribution."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "24th SPAA 2012",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2012",
                "sub_name": "24th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA '12, Pittsburgh, PA, USA, June 25-27, 2012.",
                "count": 42,
                "papers": [
                    "Time vs. space trade-offs for rendezvous in trees.",
                    "Allowing each node to communicate only once in a distributed system: shared whiteboard models.",
                    "Optimal and competitive runtime bounds for continuous, local gathering of mobile robots.",
                    "Online multi-robot exploration of grid graphs with rectangular obstacles.",
                    "In search of parallel dimensions.",
                    "Delegation and nesting in best-effort hardware transactional memory.",
                    "Design, verification and applications of a new read-write lock algorithm.",
                    "A lock-free B+tree.",
                    "Brief announcement: the problem based benchmark suite.",
                    "Brief announcement: subgraph isomorphism on a multithreaded shared memory architecture.",
                    "Brief announcement: efficient cache oblivious algorithms for randomized divide-and-conquer on the multicore model.",
                    "Brief announcement: strong scaling of matrix multiplication algorithms and memory-independent communication lower bounds.",
                    "Brief announcement: on the complexity of the minimum latency scheduling problem on the euclidean plane.",
                    "Parallel and I/O efficient set covering algorithms.",
                    "A scalable framework for heterogeneous GPU-based clusters.",
                    "Faster and simpler width-independent parallel algorithms for positive semidefinite programming.",
                    "Deterministic multi-channel information exchange.",
                    "High-performance RMA-based broadcast on the intel SCC.",
                    "The impact of the power law exponent on the behavior of a dynamic epidemic type process.",
                    "Discovery through gossip.",
                    "Abstraction failures in concurrent programming.",
                    "SALSA: scalable and low synchronization NUMA-aware algorithm for producer-consumer pools.",
                    "A non-blocking internal binary search tree.",
                    "Lower bounds for restricted-use objects: extended abstract.",
                    "Brief announcement: towards a communication optimal fast multipole method and its implications at exascale.",
                    "Brief announcement: application-sensitive QoS scheduling in storage servers.",
                    "Brief announcement: a GPU accelerated iterated local search TSP solver.",
                    "Brief announcement: speedups for parallel graph triconnectivity.",
                    "Communication-optimal parallel algorithm for strassen's matrix multiplication.",
                    "Parallel probabilistic tree embeddings, k-median, and buy-at-bulk network design.",
                    "A parallel buffer tree.",
                    "A(3/2+ε) approximation algorithm for scheduling moldable and non-moldable parallel tasks.",
                    "Cache-conscious scheduling of streaming applications.",
                    "Non-clairvoyant weighted flow time scheduling with rejection penalty.",
                    "Near-optimal scheduling mechanisms for deadline-sensitive jobs in large computing clusters.",
                    "Hedonic clustering games.",
                    "Enforcing efficient equilibria in network design games via subsidies.",
                    "Memory-mapping support for reducer hyperobjects.",
                    "On the cost of composing shared-memory algorithms.",
                    "Greedy sequential maximal independent set and matching are parallel on average.",
                    "Efficient computation of distance sketches in distributed networks.",
                    "Scheduling in wireless networks with rayleigh-fading interference."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "23rd SPAA 2011",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2011",
                "sub_name": "SPAA 2011: Proceedings of the 23rd Annual ACM Symposium on Parallelism in Algorithms and Architectures, San Jose, CA, USA, June 4-6, 2011 (Co-located with FCRC 2011).",
                "count": 50,
                "papers": [
                    "Graph expansion and communication costs of fast matrix multiplication: regular submission.",
                    "Near linear-work parallel SDD solvers, low-diameter decomposition, and low-stretch subgraphs.",
                    "Linear-work greedy parallel approximate set cover and variants.",
                    "Parallelism in dynamic well-spaced point sets.",
                    "A study of transactional memory vs. locks in practice.",
                    "Optimizing hybrid transactional memory: the importance of nonspeculative operations.",
                    "Flat-combining NUMA locks.",
                    "Location-based memory fences.",
                    "Filtering: a method for solving graph problems in MapReduce.",
                    "Parallelism and data movement characterization of contemporary application classes.",
                    "Work-stealing for mixed-mode parallelism by deterministic team-building.",
                    "The pochoir stencil compiler.",
                    "Brief announcement: full reversal routing as a linear dynamical system.",
                    "Brief announcement: better speedups for parallel max-flow.",
                    "Brief announcement: reclaiming the energy of a schedule, models and algorithms.",
                    "Brief announcement: paging for multicore processors.",
                    "A tight runtime bound for synchronous gathering of autonomous robots with limited visibility.",
                    "Stabilizing consensus with the power of two choices.",
                    "Convergence of local communication chain strategies via linear transformations: or how to trade locality for speed.",
                    "The car sharing problem.",
                    "Approximation algorithms for secondary spectrum auctions.",
                    "Maximising lifetime for fault-tolerant target coverage in sensor networks.",
                    "Convergence to equilibrium of logit dynamics for strategic games.",
                    "On a bounded budget network creation game.",
                    "Online packet-routing in grids with bounded buffers.",
                    "Sparse spanners vs. compact routing.",
                    "Re-Chord: a self-stabilizing chord overlay network.",
                    "Recommender systems with non-binary grades.",
                    "Brief announcement: distributed shared memory based on computation migration.",
                    "Brief announcement: communication bounds for heterogeneous architectures.",
                    "Brief announcement: large-scale multimaps.",
                    "Brief announcement: processor allocation for optimistic parallelization of irregular programs.",
                    "Brief announcement: locality-enhancing loop transformations for tree traversal algorithms.",
                    "Brief announcement: program regularization in verifying memory consistency.",
                    "Brief announcement: RedRem: a parallel redundancy remover.",
                    "On a local protocol for concurrent file transfers.",
                    "On multi-processor speed scaling with migration: extended abstract.",
                    "On scheduling in map-reduce and flow-shops.",
                    "Finding heavy distinct hitters in data streams.",
                    "Brief announcement: a partitioned ticket lock.",
                    "Brief announcement: transaction polymorphism.",
                    "Brief announcement: multilane - a concurrent blocking multiset.",
                    "Brief announcement: read invisibility, virtual world consistency and permissiveness are compatible.",
                    "Tight bounds for anonymous adopt-commit objects.",
                    "A highly-efficient wait-free universal construction.",
                    "A lock-free algorithm for concurrent bags.",
                    "Understanding bloom filter intersection for lazy address-set disambiguation.",
                    "Scheduling irregular parallel computations on hierarchical caches.",
                    "Sharing-aware algorithms for virtual machine colocation.",
                    "Data-oblivious external-memory algorithms for the compaction, selection, and sorting of outsourced data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "22nd SPAA 2010",
        "info": "Thira, Santorini, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2010",
                "sub_name": "SPAA 2010: Proceedings of the 22nd Annual ACM Symposium on Parallelism in Algorithms and Architectures, Thira, Santorini, Greece, June 13-15, 2010.",
                "count": 48,
                "papers": [
                    "Buffer-space efficient and deadlock-free scheduling of stream applications on multi-core architectures.",
                    "Scheduling jobs with varying parallelizability to reduce variance.",
                    "Scheduling to minimize power consumption using submodular functions.",
                    "Assigning tasks for efficiency in Hadoop: extended abstract.",
                    "Database systems in the multicore era.",
                    "Collaborative scoring with dishonest participants.",
                    "Securing every bit: authenticated broadcast in radio networks.",
                    "Multi-sided shared coins and randomized set-agreement.",
                    "Brief announcement: on speculative replication of transactional systems.",
                    "Brief announcement: combine -- an improved directory-based consistency protocol.",
                    "Brief announcement: byzantine agreement with homonyms.",
                    "Brief announcement: fun in numbers - a platform for sensor-based multiplayer pervasive games.",
                    "Brief announcement: Lower bounds on communication for sparse Cholesky factorization of a model problem.",
                    "Data-aware scheduling of legacy kernels on heterogeneous platforms with distributed memory.",
                    "Online capacity maximization in wireless networks.",
                    "Balls into bins with related random choices.",
                    "Basic network creation games.",
                    "Tree network coding for peer-to-peer networks.",
                    "Optimal gossip-based aggregate computation.",
                    "On the bit communication complexity of randomized rumor spreading.",
                    "Algorithms and application for grids and clouds.",
                    "The Cilkview scalability analyzer.",
                    "Towards optimizing energy costs of algorithms for shared memory architectures.",
                    "Computing the throughput of probabilistic and replicated streaming applications.",
                    "Brief announcement: flashcrowding in tiled multiprocessors under thermal constraints.",
                    "Brief announcement: on regenerator placement problems in optical networks.",
                    "Brief announcement: a reinforcement learning approach for dynamic load-balancing of parallel digital logic simulation.",
                    "Brief announcement: locality-aware load balancing for speculatively-parallelized irregular applications.",
                    "Brief announcement: serial-parallel reciprocity in dynamic multithreaded languages.",
                    "Low depth cache-oblivious algorithms.",
                    "Managing the complexity of lookahead for LU factorization with pivoting.",
                    "New algorithms for efficient parallel string comparison.",
                    "A local O(n2) gathering algorithm.",
                    "Delays induce an exponential memory gap for rendezvous in trees.",
                    "Best-effort group service in dynamic networks.",
                    "Deadlock avoidance for streaming computations with filtering.",
                    "Implementing and evaluating nested parallel transactions in software transactional memory.",
                    "Transactions in the jungle.",
                    "Lightweight, robust adaptivity for software transactional memory.",
                    "TLRW: return of the read-write lock.",
                    "Fast distributed approximation algorithms for vertex cover and set cover in anonymous networks.",
                    "A work-efficient parallel breadth-first search algorithm (or how to cope with the nondeterminism of reducers).",
                    "Parallel approximation algorithms for facility-location problems.",
                    "Simplifying concurrent algorithms by exploiting hardware transactional memory.",
                    "A universal construction for wait-free transaction friendly data structures.",
                    "Low-contention data structures.",
                    "Flat combining and the synchronization-parallelism tradeoff.",
                    "Corrigendum: weakest failure detector for wait-free dining under eventual weak exclusion."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "21st SPAA 2009",
        "info": "Calgary, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2009",
                "sub_name": "SPAA 2009: Proceedings of the 21st Annual ACM Symposium on Parallelism in Algorithms and Architectures, Calgary, Alberta, Canada, August 11-13, 2009.",
                "count": 48,
                "papers": [
                    "Speed scaling of processes with arbitrary speedup curves on a multiprocessor.",
                    "The bell is ringing in speed-scaled multiprocessor scheduling.",
                    "Mapping filtering streaming applications with communication costs.",
                    "Scheduling to minimize staleness and stretch in real-time data warehouses.",
                    "Brief announcement: parameterized maximum and average degree approximation in topic-based publish-subscribe overlay network design.",
                    "Brief announcement: selfishness in transactional memory.",
                    "At-most-once semantics in asynchronous shared memory.",
                    "Memory models: a case for rethinking parallel languages and hardware.",
                    "The life and times of a zookeeper.",
                    "Cassandra: a structured storage system on a P2P network.",
                    "Pregel: a system for large-scale graph processing.",
                    "Towards transactional memory semantics for C++.",
                    "On avoiding spare aborts in transactional memory.",
                    "Inherent limitations on disjoint-access parallel implementations of transactional memory.",
                    "Reducers and other Cilk++ hyperobjects.",
                    "Beyond nested parallelism: tight bounds on work-stealing overheads for parallel futures.",
                    "Scalable reader-writer locks.",
                    "The weakest failure detector for wait-free dining under eventual weak exclusion.",
                    "Brief announcement: low depth cache-oblivious sorting.",
                    "Brief announcement: a lower bound for depth-restricted work stealing.",
                    "Brief announcement: TeraByte TokuSampleSort sorts 1TB in 197s.",
                    "Emerging challenges and opportunities in parallel computing: the cretaceous redux?",
                    "On randomized representations of graphs using short labels.",
                    "Weak graph colorings: distributed algorithms and applications.",
                    "Routing without ordering.",
                    "On the complexity of the regenerator placement problem in optical networks.",
                    "Brief announcement: performance potential of an easy-to-program PRAM-on-chip prototype versus state-of-the-art processor.",
                    "Brief announcement: the impact of classical electronics constraints on a solid-state logical qubit memory.",
                    "Finding similar users in social networks: extended abstract.",
                    "A randomized, o(log w)-depth 2 smoothing network.",
                    "Field-split parallel architecture for high performance multi-match packet classification using FPGAs.",
                    "Distributed algorithms for QoS load balancing.",
                    "NZTM: nonblocking zero-indirection transactional memory.",
                    "Optimizing transactions for captured memory.",
                    "A lightweight in-place implementation for software thread-level speculation.",
                    "Parallel sparse matrix-vector and matrix-transpose-vector multiplication using compressed sparse blocks.",
                    "Communication-optimal parallel and sequential Cholesky decomposition: extended abstract.",
                    "Dynamic external hashing: the limit of buffering.",
                    "An optimal local approximation algorithm for max-min linear programs.",
                    "Gradient clock synchronization in dynamic networks.",
                    "Remote storage with byzantine servers.",
                    "Locally scalable randomized consensus for synchronous crash failures.",
                    "A DoS-resilient information system for dynamic data management.",
                    "Classifying peer-to-peer network coding schemes.",
                    "Buffer management for colored packets with deadlines.",
                    "Competitive buffer management for multi-queue switches in qos networks using packet buffering algorithms.",
                    "Approximation algorithms for time-constrained scheduling on line networks.",
                    "Power-aware online file allocation in mobile ad hoc networks: [extended abstract]."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "20th SPAA 2008",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2008",
                "sub_name": "SPAA 2008: Proceedings of the 20th Annual ACM Symposium on Parallelism in Algorithms and Architectures, Munich, Germany, June 14-16, 2008.",
                "count": 53,
                "papers": [
                    "Utilizing shared data in chip multiprocessors with the nahalal architecture.",
                    "A consistency architecture for hierarchical shared caches.",
                    "Combinable memory-block transactions.",
                    "Parallelizing dynamic information flow tracking.",
                    "What can be approximated locally?: case study: dominating sets in planar graphs.",
                    "Distributed packing in planar graphs.",
                    "Polylogarithmic network navigability using compact metrics with small stretch.",
                    "Online multicast with egalitarian cost sharing.",
                    "Trade-offs between the size of advice and broadcasting time in trees.",
                    "Cost sharing mechanisms for near-optimal traffic aggregation and network design.",
                    "On spreading recommendations via social gossip.",
                    "Against lock-based semantics for transactional memory.",
                    "A transactional approach to lock scalability.",
                    "RaceTM: detecting data races using transactional memory.",
                    "A first insight into object-aware hardware transactional memory.",
                    "Safe open-nested transactions through ownership.",
                    "Leveraging non-blocking collective communication in high-performance applications.",
                    "Fractal communication in software data dependency graphs.",
                    "Many random walks are faster than one.",
                    "Improved distributed approximate matching.",
                    "Graph partitioning into isolated, high conductance clusters: theory, computation and applications to preconditioning.",
                    "Finding strongly connected components in parallel using o(log2n) reachability queries.",
                    "Automatic data partitioning in software transactional memories.",
                    "Checkpoints and continuations instead of nested transactions.",
                    "Adaptive transaction scheduling for transactional memory systems.",
                    "Operational analysis of processor speed scaling.",
                    "A temperature-aware virtual submesh allocation scheme for noc-based manycore chips.",
                    "Optimal speedup on a low-degree multi-core parallel architecture (LoPRAM).",
                    "Energy-optimal distributed algorithms for minimum spanning trees.",
                    "Data replication in p2p environments.",
                    "Graphical congestion games with linear latencies.",
                    "Fundamental parallel algorithms for private-cache chip multiprocessors.",
                    "Cache-efficient dynamic programming algorithms for multicores.",
                    "Scheduling strategies for optimistic parallel execution of irregular programs.",
                    "Fast distributed scheduling via primal-dual.",
                    "A primal-dual resource augmentation analysis of a constant approximate algorithm for stable coalitions in a cluster.",
                    "Improved approximations for multiprocessor scheduling under uncertainty.",
                    "Competitive non-migratory scheduling for flow time and energy.",
                    "Kicking the tires of software transactional memory: why the going gets tough.",
                    "RingSTM: scalable transactions with a single atomic instruction.",
                    "Irrevocable transactions and their applications.",
                    "Dreadlocks: efficient deadlock detection.",
                    "On obstruction-free transactions.",
                    "Practical weak-atomicity semantics for java stm.",
                    "Commit phase in timestamp-based stm.",
                    "Partial snapshot objects.",
                    "Communication in wireless networks with directional antennas.",
                    "Tight competitive ratios for parallel disk prefetching and caching.",
                    "The adaptive transactional memory test platform: a tool for experimenting with transactional code for rock (poster).",
                    "Improving software concurrency with hardware-assisted memory snapshot.",
                    "Distributed voronoi diagram computation in wireless sensor networks.",
                    "Directed transmission method, a fully asynchronous approach to solve sparse linear systems in parallel.",
                    "Ased: availability, security, and debugging support usingtransactional memory."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "19th SPAA 2007",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2007",
                "sub_name": "SPAA 2007: Proceedings of the 19th Annual ACM Symposium on Parallelism in Algorithms and Architectures, San Diego, California, USA, June 9-11, 2007.",
                "count": 46,
                "papers": [
                    "Universal augmentation schemes for network navigability: overcoming the sqrt(n)-barrier.",
                    "On triangulation of simple networks.",
                    "Strong-diameter decompositions of minor free graphs.",
                    "Approximation algorithms for multiprocessor scheduling under uncertainty.",
                    "Scheduling DAGs on asynchronous processors.",
                    "Scheduling to minimize gaps and power consumption.",
                    "Feasibility study of MPI implementation on the heterogeneous multi-core cell BETM architecture.",
                    "Evaluating synchronization techniques for light-weight multithreaded/multicore architectures.",
                    "Towards soft optimization techniques for parallel cognitive applications.",
                    "Optimal sparse matrix dense vector multiplication in the I/O-model.",
                    "The cache-oblivious gaussian elimination paradigm: theoretical framework, parallelization and experimental evaluation.",
                    "Cache-oblivious streaming B-trees.",
                    "An experimental comparison of cache-oblivious and cache-conscious programs.",
                    "Scheduling threads for constructive cache sharing on CMPs.",
                    "Supermatrix out-of-order scheduling of matrix operations for SMP and multi-core architectures.",
                    "Proximity-aware directory-based coherence for multi-core processor architectures.",
                    "A parallel dynamic programming algorithm on a multi-core architecture.",
                    "Tight bounds for distributed selection.",
                    "Local MST computation with short advice.",
                    "Distributed approximation of capacitated dominating sets.",
                    "Packing to angles and sectors.",
                    "Conflict-free coloring for rectangle ranges using O(n.382) colors.",
                    "Balanced allocations with heterogenous bins.",
                    "Weakening the online adversary just enough to get optimal conflict-free colorings for intervals.",
                    "On the truthfulness and the approximation for scheduling selfish tasks.",
                    "Optimal bit-reversal using vector permutations.",
                    "The notion of a timed register and its application to indulgent synchronization.",
                    "Nonblocking transactions without indirection using alert-on-update.",
                    "Time-based transactional memory with scalable time bases.",
                    "Deadlock-free scheduling of X10 computations with bounded resources.",
                    "Online frequency allocation in cellular networks.",
                    "Energy efficient randomised communication in unknown AdHoc networks.",
                    "Local strategies for maintaining a chain of relay stations between an explorer and a base station.",
                    "Maximizing total upload in latency-sensitive P2P applications.",
                    "Bi-objective scheduling algorithms for optimizing makespan and reliability on heterogeneous systems.",
                    "Speed scaling on parallel processors.",
                    "Cilk provides the \"best overall productivity\" for high performance computing: (and won the HPC challenge award to prove it).",
                    "PRAM-on-chip: first commitment to silicon.",
                    "Transactional memory and the birthday paradox.",
                    "Rate vs. buffer size: greedy information gathering on the line.",
                    "Online collaborative filtering with nearly optimal dynamic regret.",
                    "Truthful unsplittable flow for large capacity networks.",
                    "On the convergence of multicast games in directed networks.",
                    "Sparse parallel Delaunay mesh refinement.",
                    "Using SIMD registers and instructions to enable instruction-level parallelism in sorting algorithms.",
                    "A tight bound on online buffer management for two-port shared-memory switches."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "18th SPAA 2006",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2006",
                "sub_name": "SPAA 2006: Proceedings of the 18th Annual ACM Symposium on Parallelism in Algorithms and Architectures, Cambridge, Massachusetts, USA, July 30 - August 2, 2006.",
                "count": 48,
                "papers": [
                    "Tell me who I am: an interactive recommendation system.",
                    "Publish and perish: definition and analysis of an n-person publication impact game.",
                    "The price of optimum in Stackelberg games on arbitrary single commodity networks and latency functions.",
                    "Network design with weighted players.",
                    "Towards automatic parallelization of tree reductions in dynamic programming.",
                    "A general approach for partitioning N-dimensional parallel nested loops with conditionals.",
                    "Astronomical real-time streaming signal processing on a Blue Gene/L supercomputer.",
                    "Exponential separation of quantum and classical online space complexity.",
                    "Smooth scheduling under variable rates or the analog-digital confinement game.",
                    "On the price of heterogeneity in parallel systems.",
                    "Reconfigurable resource scheduling.",
                    "Minimizing the stretch when scheduling flows of biological requests.",
                    "Why Intel is designing multi-core processors.",
                    "An empirical study to compare two parallel programming models.",
                    "The FG programming environment: good and good for you.",
                    "Introducing the hydra parallel programming system.",
                    "An envolutionary path towards virtual shared memory with random access.",
                    "Efficient parallel algorithms for dead sensor diagnosis and multiple access channels.",
                    "Conflict-free coloring for intervals: from offline to online.",
                    "Packet-mode emulation of output-queued switches.",
                    "On the communication complexity of randomized broadcasting in random-like graphs.",
                    "Modeling instruction placement on a spatial architecture.",
                    "Translating between itanium and sparc memory consistency models.",
                    "Strip packing with precedence constraints and strip packing with release times.",
                    "Power-aware scheduling for makespan and flow.",
                    "Tight bounds for the Min-Max boundary decomposition cost of weighted graphs.",
                    "On space-stretch trade-offs: lower bounds.",
                    "On space-stretch trade-offs: upper bounds.",
                    "Towards small world emergence.",
                    "Compact routing with additive stretch using distance labelings.",
                    "Semi-oblivious routing.",
                    "An implementation report for parallel triangular decompositions.",
                    "The cache-oblivious gaussian elimination paradigm: theoretical framework and experimental evaluation.",
                    "A distributed O(1)-approximation algorithm for the uniform facility location problem.",
                    "Playing push vs pull: models and algorithms for disseminating dynamic data in networks.",
                    "A performance analysis of local synchronization.",
                    "Symmetric network computation.",
                    "The cache complexity of multithreaded cache oblivious algorithms.",
                    "Fault-tolerant semifast implementations of atomic read/write registers.",
                    "Fair online load balancing.",
                    "Deterministic load balancing and dictionaries in the parallel disk model.",
                    "Distributed random digraph transformations for peer-to-peer networks.",
                    "Towards a scalable and robust DHT.",
                    "Chip-level integration: the new frontier for microprocessor architecture.",
                    "Energy implications of multiprocessor synchronization.",
                    "Parallel depth first vs. work stealing schedulers on CMP architectures.",
                    "Minimizing peak energy on mesh-connected systems.",
                    "Promoting cooperation in selfish grids."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "17th SPAA 2005",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2005",
                "sub_name": "SPAA 2005: Proceedings of the 17th Annual ACM Symposium on Parallelism in Algorithms and Architectures, July 18-20, 2005, Las Vegas, Nevada, USA.",
                "count": 41,
                "papers": [
                    "Randomized queue management for DiffServ.",
                    "Randomization does not reduce the average delay in parallel packet switches.",
                    "Dynamic circular work-stealing deque.",
                    "Lexicographic QoS scheduling for parallel I/O.",
                    "Coloring unstructured radio networks.",
                    "Name independent routing for growth bounded networks.",
                    "Windows scheduling of arbitrary length jobs on parallel machines.",
                    "Parallel scheduling of complex dags under uncertainty.",
                    "On distributed smooth scheduling.",
                    "Scheduling malleable tasks with precedence constraints.",
                    "An adaptive power conservation scheme for heterogeneous wireless sensor networks with node redeployment.",
                    "Irrigating ad hoc networks in constant time.",
                    "Constant density spanners for wireless ad-hoc networks.",
                    "The expansion and mixing time of skip graphs with applications.",
                    "Decentralized algorithms using both local and random probes for P2P load balancing.",
                    "Fast construction of overlay networks.",
                    "Peer-to-peer networks based on random transformations of connected regular undirected graphs.",
                    "Processor efficient parallel matching.",
                    "Parallelizing time with polynomial circuits.",
                    "Finding effective support-tree preconditioners.",
                    "Is partial quantum search of a database any easier?",
                    "A truthful mechanism for the non-utilitarian minimum radius spanning tree problem.",
                    "Selfish routing with incomplete information.",
                    "A segmented parallel-prefix VLSI circuit with small delays for small segments.",
                    "A forward planning situated protocol for data propagation in wireless sensor networks based on swarm intelligence techniques.",
                    "Autonomous virtual mobile nodes.",
                    "A space lower bound for name-independent compact routing in trees.",
                    "On competitive online read-many parallel disks scheduling.",
                    "Weighted distributed hash tables.",
                    "Concurrent cache-oblivious b-trees.",
                    "Admission control to minimize rejections and online set cover with repetitions.",
                    "Efficient algorithms for verifying memory consistency.",
                    "Using elimination to implement scalable and lock-free FIFO queues.",
                    "Collaborate with strangers to find own preferences.",
                    "Dynamic page migration with stochastic requests.",
                    "Broadcasting on networks of workstations.",
                    "Traffic engineering of management flows by link augmentations on confluent trees.",
                    "Value-maximizing deadline scheduling and its application to animation rendering.",
                    "Radio communication in random graphs: extended abstract.",
                    "Oblivious routing on geometric networks.",
                    "Adversarial contention resolution for simple channels."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "16th SPAA 2004",
        "info": "Barcelona, Catalonia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2004",
                "sub_name": "SPAA 2004: Proceedings of the Sixteenth Annual ACM Symposium on Parallelism in Algorithms and Architectures, June 27-30, 2004, Barcelona, Spain.",
                "count": 40,
                "papers": [
                    "On delivery times in packet networks under adversarial traffic.",
                    "Adaptive channel queue routing on k-ary n-cubes.",
                    "Compact name-independent routing with minimum stretch.",
                    "Object location in realistic networks.",
                    "Simple efficient load balancing algorithms for peer-to-peer systems.",
                    "Consistent and compact data management in distributed storage systems.",
                    "Geometric generalizations of the power of two choices.",
                    "Fighting against two adversaries: page migration in dynamic networks.",
                    "Online hierarchical cooperative caching.",
                    "New results on web caching with request reordering.",
                    "Packet-mode policies for input-queued switches.",
                    "Parallelism versus memory allocation in pipelined router forwarding engines.",
                    "Lower bounds for graph embeddings and combinatorial preconditioners.",
                    "Balanced graph partitioning.",
                    "Bi-criteria algorithm for scheduling jobs on cluster platforms.",
                    "On-the-fly maintenance of series-parallel relationships in fork-join multithreaded programs.",
                    "An NC algorithm for finding a maximal acyclic set in a graph.",
                    "Scheduling against an adversarial network.",
                    "On achieving optimized capacity utilization in application overlay networks with multiple competing sessions.",
                    "Pagoda: a dynamic overlay network for routing, data management, and multicasting.",
                    "Sharing the cost of multicast transmissions in wireless networks.",
                    "Selfish load balancing and atomic congestion games.",
                    "How to route and tax selfish unsplittable traffic.",
                    "A scalable lock-free stack algorithm.",
                    "DCAS is not a silver bullet for nonblocking algorithm design.",
                    "Efficient orchestration of sub-word parallelism in media processors.",
                    "Effectively sharing a cache among threads.",
                    "Cache-oblivious shortest paths in graphs using buffer heap.",
                    "Online algorithms for prefetching and caching on parallel disks.",
                    "Improved combination of online algorithms for acceptance and rejection.",
                    "Time complexity of practical parallel steiner point insertion algorithms.",
                    "The inherent queuing delay of parallel packet switches.",
                    "Efficient search in unstructured peer-to-peer networks.",
                    "The potential in energy efficiency of a speculative chip-multiprocessor.",
                    "Online algorithms for network design.",
                    "Expansion properties of (secure) wireless networks.",
                    "The effect of faults on network expansion.",
                    "Dynamic analysis of the arrow distributed protocol.",
                    "Optimal early stopping uniform consensus in synchronous systems with process omission failures.",
                    "Writing-all deterministically and optimally using a non-trivial number of asynchronous processors."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "15th SPAA 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2003",
                "sub_name": "SPAA 2003: Proceedings of the Fifteenth Annual ACM Symposium on Parallelism in Algorithms and Architectures, June 7-9, 2003, San Diego, California, USA (part of FCRC 2003).",
                "count": 47,
                "papers": [
                    "Optimal sharing of bags of tasks in heterogeneous clusters.",
                    "Minimizing total flow time and total completion time with immediate dispatching.",
                    "Online deadline scheduling: multiple machines and randomization.",
                    "A practical algorithm for constructing oblivious routing schemes.",
                    "A polynomial-time tree decomposition to minimize congestion.",
                    "Online oblivious routing.",
                    "Novel architectures for P2P applications: the continuous-discrete approach.",
                    "Optimal fault-tolerant linear arrays.",
                    "The effect of communication costs in solid-state quantum computing architectures.",
                    "VLSI layout of trees into grids of minimum width.",
                    "I/O-efficient topological sorting of planar DAGs.",
                    "MST construction in O(log log n) communication rounds.",
                    "A proportionate fair scheduling rule with good worst-case performance.",
                    "Integrated prefetching and caching in single and parallel disk systems.",
                    "Performance comparison of MPI and three openMP programming styles on shared memory multiprocessors.",
                    "Quantifying instruction criticality for shared memory multiprocessors.",
                    "Asynchronous parallel disk sorting.",
                    "Designing overlay multicast networks for streaming.",
                    "Combining online algorithms for rejection and acceptance.",
                    "Off-line and on-line guaranteed start-up delay for media-on-demand with stream merging.",
                    "TCP is competitive against a limited adversary.",
                    "Compact routing with name independence.",
                    "Tree based MPLS routing.",
                    "Throughput-centric routing algorithm design.",
                    "Analysis of link reversal routing algorithms for mobile ad hoc networks.",
                    "On local algorithms for topology control and routing in ad hoc networks.",
                    "Worst case mobility in ad hoc networks.",
                    "High throughput, parallelized 128-bit AES encryption in a resource-limited FPGA.",
                    "MAPO: using a committee of algorithm-experts for parallel optimization of costly functions.",
                    "Buffer overflows of merging streams.",
                    "Short length menger's theorem and reliable optical routing.",
                    "Randomized permutations in a coarse grained parallel environment.",
                    "Relaxing the problem-size bound for out-of-core columnsort.",
                    "Bicriteria approximation algorithms for scheduling problems with communications.",
                    "The complexity of verifying memory coherence.",
                    "Efficient galois field arithmetic on SIMD architectures.",
                    "The load rebalancing problem.",
                    "Load balancing of unit size tokens and expansion properties of graphs.",
                    "Cycle stealing under immediate dispatch task assignment.",
                    "Polynomial time algorithms for network information flow.",
                    "Improved approximation algorithms for the freeze-tag problem.",
                    "Toward a decidable notion of sequential consistency.",
                    "Nonblocking k-compare-single-swap.",
                    "Can we elect if we cannot compare?",
                    "Information gathering in adversarial systems: lines and cycles.",
                    "A near optimal scheduler for switch-memory-switch routers.",
                    "Scheduling policies for CIOQ switches."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "14th SPAA 2002",
        "info": "Winnipeg, Manitoba, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2002",
                "sub_name": "Proceedings of the Fourteenth Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA 2002, Winnipeg, Manitoba, Canada, August 11-13, 2002.",
                "count": 36,
                "papers": [
                    "Worst-case traffic for oblivious routing functions.",
                    "Locality-preserving randomized oblivious routing on torus networks.",
                    "Õ(congestion + dilation) hot-potato routing on leveled networks.",
                    "Distributed caching independent of the network size.",
                    "Distributed object location in a dynamic network.",
                    "Compact, adaptive placement schemes for non-uniform requirements.",
                    "Distributed streams algorithms for sliding windows.",
                    "High performance dynamic lock-free hash tables and list-based sets.",
                    "Scalability and resource usage of an OLAP benchmark on clusters of PCs.",
                    "Two techniques for reconciling algorithm parallelism with memory constraints.",
                    "A general compiler framework for speculative multithreading.",
                    "Optimal organizations for pipelined hierarchical memories.",
                    "Scheduling reductions on realistic machines.",
                    "Two processor scheduling with real release times and deadlines.",
                    "Extra processors versus future information in optimal deadline scheduling.",
                    "The lazy adversary conjecture fails.",
                    "AT2L2 appr. equal N2/2 for fast fourier transform in multilayer VLSI.",
                    "Rapid prototyping methodology for multi-DSP TI C6X platforms applied to an Mpeg-2 coding application.",
                    "Energy estimation of nested loop programs.",
                    "Sequential consistency as lazy linearizability.",
                    "Verifying sequential consistency using vector clocks.",
                    "Exploiting flexibly assignable work to improve load balance.",
                    "Work dealing.",
                    "Optimal tiling for the RNA base pairing problem.",
                    "Universal stability of undirected graphs in the adversarial queueing model.",
                    "New stability results for adversarial queuing.",
                    "Capture of an intruder by mobile agents.",
                    "Tracking immediate predecessors in distributed computations.",
                    "Gossiping to reach consensus.",
                    "Energy, congestion and dilation in radio networks.",
                    "Parallel scheduling problems in next generation wireless networks.",
                    "A lightweight idempotent messaging protocol for faulty networks.",
                    "Nearest common ancestors: a survey and a new distributed algorithm.",
                    "Algorithms for fault-tolerant routing in circuit switched networks.",
                    "Parallel dynamic programming for solving the string editing problem on a CGM/BSP.",
                    "Heuristics for semi-external depth first search on directed graphs."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "13th SPAA 2001",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2001",
                "sub_name": "Proceedings of the Thirteenth Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA 2001, Heraklion, Crete Island, Greece, July 4-6, 2001.",
                "count": 48,
                "papers": [
                    "Compact routing schemes.",
                    "Routing without flow control.",
                    "Fast, minimal and oblivious routing algorithms on the mesh with bounded queues.",
                    "One-to-Many routing on the mesh.",
                    "Simple on-line algorithms for the maximum disjoint paths problem.",
                    "Stability and non-stability of the FIFO protocol.",
                    "Competitve buffer management for shared-memory switches.",
                    "Tradeoffs between knowledge and time of communication in geometric radio networks.",
                    "Attack propagation in networks.",
                    "Deterministic resource discovery in distributed networks.",
                    "Latency effects on reachability in large-scale peer-to-peer networks.",
                    "Towards a first vertical prototyping of an extremely fine-grained parallel programming approach.",
                    "A cost effective architecture for vectorizable numerical and multimedia applications.",
                    "Automatable verification of sequential consistency.",
                    "Room synchronizations.",
                    "A simple, fast and scalable non-blocking concurrent FIFO queue for shared memory multiprocessor systems.",
                    "Computational power of pipelined memory hierarchies.",
                    "Optimal semi-oblique tiling.",
                    "Finding large independent sets of hypergraphs in parallel.",
                    "Columnsort lives! an efficient out-of-core sorting program.",
                    "Efficient parallel exponentiation in GF(2n) using normal basis representations.",
                    "Low-contention depth-first scheduling of parallel computations with write-once synchronization variables.",
                    "Scheduling on hierarchical clusters using malleable tasks.",
                    "Scheduling best-effort and real-time pipelined applications on time-shared clusters.",
                    "Optimal prefetching and caching for parallel I/O systems.",
                    "Ordering disks for double erasure codes.",
                    "Approximation algorithms for data management in networks.",
                    "A data tracking scheme for general networks.",
                    "New spectral bounds on k-partitioning of graphs.",
                    "Efficient quantum algorithms for some instances of the non-Abelian hidden subgroup problem.",
                    "Towards practical deteministic write-all algorithms.",
                    "Estimating simple functions on the union of data streams.",
                    "Randomized k-set agreement.",
                    "Periodic, random-fault-tolerant correction networks.",
                    "D-CAT: A distributed channel allocation strategy based on a threshold scheme for cellular mobile networks.",
                    "A note on cycle covering.",
                    "Pursuit and evasion on a ring: An infinite hierarchy for parallel real--time systems.",
                    "Scheduling tasks with small communication delays for clusters of processors.",
                    "Library support for orthogonal processor groups.",
                    "The push tree problem.",
                    "Parallel controlled conspiracy number search.",
                    "On tiling space-time mapped loop nests.",
                    "A parallel block algorithm for exact triangularization of rectangular matrices.",
                    "Eventually consistent failure detectors.",
                    "Finding strongly connected components in parallel in particle transport sweeps.",
                    "A work-optimal CGM algorithm for the LIS problem.",
                    "Modeling weakly consistent memories with locks.",
                    "The power of duality for prefetching and sorting with parallel disks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "12th SPAA 2000",
        "info": "Bar Harbor, Maine, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/2000",
                "sub_name": "Proceedings of the Twelfth annual ACM Symposium on Parallel Algorithms and Architectures, SPAA 2000, Bar Harbor, Maine, USA, July 9-13, 2000.",
                "count": 24,
                "papers": [
                    "The data locality of work stealing.",
                    "Scheduling Cilk multithreaded parallel programs on processors of different speeds.",
                    "Optimal schedules for data-parallel cycle-stealing in networks of workstations (extended abstract).",
                    "Diffusive load balancing schemes on heterogeneous networks.",
                    "Interprocessor communication with memory constraints.",
                    "Efficient on-line communication in cellular networks.",
                    "Connection caching under vaious models of communication.",
                    "Fault tolerant networks with small degree.",
                    "Generalized connection caching.",
                    "Comparing the effectiveness of fine-grain memory caching against page migration/replication in reducing traffic in DSM clusters.",
                    "Asynchronous scheduling of redundant disk arrays.",
                    "Infinite parallel job allocation (extended abstract).",
                    "Data management in hierarchical bus networks.",
                    "Efficient, distributed data placement strategies for storage area networks (extended abstract).",
                    "Broadcast scheduling optimization for heterogeneous cluster systems.",
                    "DCAS-based concurrent deques.",
                    "A no-busy-wait balanced tree parallel algorithmic paradigm.",
                    "Algorithmic foundations for a parallel vector access memory system.",
                    "An experimental study of a simple, distributed edge coloring algorithm.",
                    "Multithreaded algorithms for the fast Fourier transform.",
                    "A (2.954 epsilon)n oblivious routing algorithm on 2D meshes.",
                    "VLSI layout and packaging of butterfly networks.",
                    "Compact, multilayer layout for butterfly fat-tree.",
                    "An efficient self-simulation algorithm for reconfigurable meshes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "11th SPAA 1999",
        "info": "Saint Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1999",
                "sub_name": "Proceedings of the Eleventh Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '99, Saint-Malo, France, June 27-30, 1999.",
                "count": 27,
                "papers": [
                    "Time-Constrained Scheduling of Weighted Packets on Trees and Meshes.",
                    "Scheduling Optimization for Resource-Intensive Web Requests on Server Clusters.",
                    "Efficient Approximation Algorithms for Scheduling Malleable Tasks.",
                    "Simple Competitive Request Scheduling Strategies.",
                    "Making Sparse Matrix Computations Scalable (Invited Talk Abstract).",
                    "Post-Mortem Black-Box Correctness Tests for Basic Parallel Data Structures.",
                    "Some Compact Layouts of the Butterfly.",
                    "Sorting and Counting Networks of Small Depth and Arbitrary Width.",
                    "Communication-Processor Tradeoffs in Limited Resources PRAM.",
                    "Scheduling Threads for Low Space Requirement and Good Locality.",
                    "A Closer Look at Coscheduling Approaches for a Network of Workstations.",
                    "Experience with an Adaptive Globally-Synchronizing Clock Algorithm.",
                    "BOS is Boss: A Case for Bulk-Synchronous Object Systems.",
                    "A Comparison of Scalable Superscalar Processors.",
                    "A System-Level Specification Framework for I/O Architectures.",
                    "On the Scheduling of Variable Latency Functional Units.",
                    "Optimal Replacements in Caches with Two Miss Costs.",
                    "Data Management in Networks: Experimental Evaluation of a Provably Good Strategy.",
                    "Randomized and Adversarial Load Balancing.",
                    "All-to-All Routing and Coloring in Weighted Trees of Rings.",
                    "Tradeoffs Between Parallelism and Fill in Nested Dissection.",
                    "Selecting Tile Shape for Minimal Execution Time.",
                    "Efficient Parallel Solutions of Linear Algebraic Circuits.",
                    "Recursive Array Layouts and Fast Parallel Matrix Multiplication.",
                    "A Simple and Efficient Parallel Disk Mergesort.",
                    "Multidimensional, Multiprocessor, Out-of-Core FFTs.",
                    "Fundamental Control Algorithms in Mobile Networks."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "10th SPAA 1998",
        "info": "Puerto Vallarta, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1998",
                "sub_name": "Proceedings of the Tenth Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '98, Puerto Vallarta, Mexico, June 28 - July 2, 1998.",
                "count": 34,
                "papers": [
                    "Algorithmic Problems in Internet Research (Abstract).",
                    "High Performance Clusters (Abstract): State of the Art and Challenges Ahead.",
                    "How to Find It: Research Issues in Distributed Search (Abstract).",
                    "Elimination Forest Guided 2D Sparse LU Factorization.",
                    "Fast Set Operations Using Treaps.",
                    "Communication-Optimal Parallel Minimum Spanning Tree Algorithms (Extended Abstract).",
                    "\"Dynamic-Fault-Prone BSP\": A Paradigm for Robust Computations in Changing Environments.",
                    "An Adversarial Model for Distributed Dynamic Load Balancing.",
                    "Deadlock-Free Routing in Arbitrary Networks via the Flattest Common Supersequence Method.",
                    "Lamport Clocks: Verifying a Directory Cache-Coherence Protocol.",
                    "Distributed and Parallel Computing Issues in Data Warehousing (Abstract).",
                    "Efficient Disk Allocation for Fast Similarity Searching.",
                    "A Framework for Simple Sorting Algorithms on Parallel Disk Systems (Extended Abstract).",
                    "Blocking in Parallel Multisearch Problems (Extended Abstract).",
                    "Automatic Parallel I/O Performance Optimization in Panda.",
                    "Thread Scheduling for Multiprogrammed Multiprocessors.",
                    "How \"Hard\" is Thread Partitioning and How \"Bad\" is a List Scheduling Based Partitioning Algorithm?",
                    "Explicit Multi-Threading (XMT) Bridging Models for Instruction Parallelism (Extended Abstract).",
                    "Computational Bounds for Fundamental Problems on General-Purpose Parallel Models.",
                    "Broadcasting, Multicasting and Gossiping in Trees Under the All-Port Line Model.",
                    "Layout of the Batcher Bitonic Sorter (Extended Abstract).",
                    "Dynamic Scheduling With Incomplete Information.",
                    "Parallel Continuous Randomized Load Balancing (Extended Abstract).",
                    "Recovery Time of Dynamic Allocation Processes.",
                    "Analyses of Load Stealing Models Based on Differential Equations.",
                    "In-Memory Directories: Eliminating the Cost of Directories in CC-NUMAs.",
                    "Using \"Test Model-Checking\" to Verify the Runway-PA8000 Memory Model.",
                    "Computation-Centric Memory Models.",
                    "Linear Programming Models for Scheduling Systems of Affine Recurrence Equations - A Comparative Study.",
                    "Efficient Communication Strategies for Ad-Hoc Wireless Networks (Extended Abstract).",
                    "Scheduling Time-Constrained Communication in Linear Networks.",
                    "Asynchronous Parallel Algorithm for Mining Association Rules on a Shared-Memory MultiPprocessors.",
                    "Trace-Driven Studies of VLIW Video Signal Processors.",
                    "Detecting Data Rase in Cilk Programs That use Locks."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "9th SPAA 1997",
        "info": "Newport, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1997",
                "sub_name": "Proceedings of the 9th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '97, Newport, RI, USA, June 23-25, 1997.",
                "count": 32,
                "papers": [
                    "Efficient Detection of Determinacy Races in Cilk Programs.",
                    "Space-Efficient Scheduling of Parallelism with Synchronization Variables.",
                    "Reactive Diffracting Trees.",
                    "Efficient Load Balancing and Data Remapping for Adaptive Grid Calculations.",
                    "HARP: A Fast Spectral Partitioner.",
                    "Three-Dimensional Pattern Matching.",
                    "On the Parallel Complexity of Matrix Factorization Algorithms.",
                    "Can Shared-Memory Model Serve as a Bridging Model for Parallel Computation?",
                    "Efficient Computations on Fault-Prone BSP Machines.",
                    "Modeling Parallel Bandwidth: Local vs. Global Restrictions.",
                    "Efficient External Memory Algorithms by Simulating Coarse-Grained Parallel Algorithms.",
                    "System Area Network Mapping.",
                    "Triplex: A Multi-Class Routing Algorithm.",
                    "Bounds to the Throughput of an Interconnection Network.",
                    "Deadlock-Free Oblivious Wormhole Routing with Cyclic Dependencies.",
                    "The Performance of Simple Routing Algorithms That Drop Packets.",
                    "Simple, Efficient Routing Schemes for All-Optical Networks.",
                    "Approximation Algorithms for Structured Communication Problems.",
                    "Fine-Grain Multithreading with the EM-X Multiprocessor.",
                    "Using Speculative Retirement and Larger Instruction Windows to Narrow the Performance Gap Between Memory Consistency Models.",
                    "Temporal Notions of Synchronization and Consistency in Beehive.",
                    "Better Trade-Offs for Parallel List Ranking.",
                    "Using Tadpoles to Reduce Memory and Communication Requirements for Exhaustive, Breadth-First Search Using Distributed Computers.",
                    "Implementation and Evaluation of an Efficient Parallel Delaunay Triangulation Algorithm.",
                    "Pipelining with Futures.",
                    "From Algorithm Parallelism to Instruction-Level Parallelism: An Encode-Decode Chain Using Prefix-Sum.",
                    "Thread Partitioning and Scheduling Based on Cost Model.",
                    "Optimal Weighted Loop Fusion for Parallel Programs.",
                    "On the Analysis of Randomized Load Balancing Schemes.",
                    "Allocating Weighted Jobs in Parallel.",
                    "Accessing Nearby Copies of Replicated Objects in a Distributed Environment.",
                    "A Localized Algorithm for Parallel Association Mining."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "8th SPAA 1996",
        "info": "Padua, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1996",
                "sub_name": "Proceedings of the 8th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '96, Padua, Italy, June 24-26, 1996.",
                "count": 39,
                "papers": [
                    "Towards Efficiency and Portability: Programming with the BSP Model.",
                    "A Quantitative Comparison of Parallel Computation Models.",
                    "BSP vs LogP.",
                    "A Steady State Analysis of Diffracting Trees (Extended Abstract).",
                    "Asynchronous Shared Memory Search Structures.",
                    "Improved Methods for Hiding Latency in High Bandwidth Networks (Extended Abstract).",
                    "Optimal Latency-Throughput Tradeoffs for Data Parallel Pipelines.",
                    "First and Second Order Diffusive Methods for Rapid, Coarse, Distributed Load Balancing (Extended Abstract).",
                    "On Multiprocessor System Scheduling.",
                    "An Analysis of Gang Scheduling for Multiprogrammed Parallel Computing Environments.",
                    "Flexible Usage of Parity Storage Space in Disk Arrays.",
                    "Simple Randomized Mergesort on Parallel Disks.",
                    "Anticipatory Instruction Scheduling.",
                    "On the Benefit of Supporting Virtual Channels in Wormhole Routers.",
                    "Universal Continuous Routing Strategies.",
                    "On the Communication Throughput of Buffered Multistage Interconnection Networks.",
                    "Constant Time per Edge is Optimal on Rooted Tree Networks.",
                    "A Tight Layout of the Butterfly Network.",
                    "On the Slowdown of Efficient Simulations of Multibutterflies on Butterflies and Butterfly-Derived Networks.",
                    "Local Memory Requirement of Universal Routing Schemes.",
                    "A Dynamic Load Balancing Framework for Unstructured Adaptive Computations on Distributed-Memory Multiprocessors.",
                    "A Library of Basic PRAM Algorithms and its Implementation in FORK.",
                    "µDatabase: Parallelism in a Memory-Mapped Environment.",
                    "From AAPC Algorithms to High Performance Permutation Routing and Sorting.",
                    "Parallel Neighborhood Modeling.",
                    "Components of Congestion Control.",
                    "Parallel Algorithms for Personalized Communication and Sorting with an Experimental Study (Extended Abstract).",
                    "Deterministic Sorting and Randomized Median Finding on the BSP Model.",
                    "Fully Dynamic Search Trees for an Extension of the BSP Model.",
                    "Finding Minimum Spanning Forests in Logarithmic Time and Linear Work Using Random Sampling.",
                    "Parallel Multidimensional Search Using Approximation Algorithms: With Applications to Linear-Programming and Related Problems.",
                    "Parallel Balanced Allocations.",
                    "Efficient Execution of Nondeterministic Parallel Programs on Asynchronous Systems.",
                    "Scope Consistency: A Bridge Between Release Consistency and Entry Consistency.",
                    "Verification of FLASH Cache Coherence Protocol by Aggregation of Distributed Transactions.",
                    "An Analysis of Dag-Consistent Distributed Shared-Memory Algorithms.",
                    "On Trading Task Reallocation for Thread Management in Partitionable Multiprocessors.",
                    "Load-Sharing in Heterogeneous Systems via Weighted Factoring.",
                    "Resource Scheduling for Parallel Database and Scientific Applications."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "7th SPAA 1995",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1995",
                "sub_name": "7th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '95, Santa Barbara, California, USA, July 17-19, 1995.",
                "count": 31,
                "papers": [
                    "Provably Efficient Scheduling for Languages with Fine-Grained Parallelism.",
                    "Parallel Algorithms for the Circuit Value Update Problem.",
                    "An Optimal Randomized Planar Convex Hull Algorithm With Good Empirical Performance.",
                    "A Randomized Parallel 3D Convex Hull Algorithm for Coarse Grained Multicomputers.",
                    "An Executable Specification, Analyzer and Verifier for RMO (Relaxed Memory Order).",
                    "Remote Queues: Exposing Message Queues for Optimization and Atomicity.",
                    "Elimination Trees and the Construction of Pools and Stacks (Preliminary Version).",
                    "Efficient Message Passing Interface (MPI) for Parallel Computing on Clusters of Workstations.",
                    "Modeling the Benefits of Mixed Data and Task Parallelism.",
                    "Accounting for Memory Bank Contention and Delay in High-Bandwidth Multiprocessors.",
                    "LogGP: Incorporating Long Messages into the LogP Model - One Step Closer Towards a Realistic Model for Parallel Computation.",
                    "On Probabilistic Networks for Selection, Merging, and Sorting.",
                    "Optimal Trade-Offs Between Size and Slowdown for Universal Parallel Networks.",
                    "Parallel Sorting with Limited Bandwidth.",
                    "Space-Efficient Routing in Vertex-Symmetric Networks (Extended Abstract).",
                    "The Communication Requirements of Mutual Exclusion.",
                    "Efficient Techniques for Fast Nested Barrier Synchronization.",
                    "Universal Congestion Control for Meshes.",
                    "A Universal Proof Technique for Deadlock-Free Routing in Interconnection Networks.",
                    "Upper Bounds to Processor-Time Tradeoffs under Bounded-Speed Message Propagation.",
                    "Finding Connected Components on a Scan Line Array Processor.",
                    "Future Applicability of Bus-Based Shared Memory Multiprocessors.",
                    "Parallel Molecular Computation.",
                    "Approximating Biconnectivity in Parallel.",
                    "On Testing Consecutive-Ones Property in Parallel.",
                    "Optimal Parallel Dictionary Matching and Compression (Extended Abstract).",
                    "Lower Bounds for Randomized Exclusive Write PRAMs.",
                    "Applying Randomized Edge Coloring Algorithms to Distributed Communication: An Experimental Study.",
                    "ROMM Routing on Mesh and Torus Networks.",
                    "Don't Be Too Clever: Routing BMMC Permutations on the MasPar MP-2.",
                    "On Shortest Path Routing in Single Stage Shuffle-Exchange Networks."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "6th SPAA 1994",
        "info": "Cape May, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1994",
                "sub_name": "Proceedings of the 6th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '94, Cape May, New Jersey, USA, June 27-29, 1994.",
                "count": 38,
                "papers": [
                    "An Optimal Randomized Logarithmic Time Connectivity algorithm for the EREW PRAM (Extended Abstract).",
                    "A Comparison of Parallel Algorithms for Connected Components.",
                    "Improved Bounds for Routing and Sorting on Multi-Dimensional Meshes.",
                    "2d-Bubblesorting in Average time O(N lg N).",
                    "Parallel Sorting by Over Partitioning.",
                    "Efficient Compilation of High-Level Data Parallel Algorithms.",
                    "SIMD Instruction Cache.",
                    "Improved Parity-Declustered Layouts for Disk Arrays.",
                    "Scheduling Trees using FIFO Queues: A Control-Memory Tradeoff.",
                    "Studying Overheads in Massively Parallel MIN/MAX-Tree Evaluation.",
                    "List Ranking and List Scan on the Cray C-90.",
                    "Dynamic Parallel Tree Contraction (Extended Abstract).",
                    "Experiences with Parallel N-Body Simulation.",
                    "Bandwidth-Based Lower Bounds on Slowdown for Efficient Emulations of Fixed-Connection Networks.",
                    "AT2 Bounds for a Class of VLSI Problems and String Matching.",
                    "An W(log log n) Lower Bound for Routing in Optical Networks.",
                    "Programming DEC-Alpha Based Multiprocessors the Easy Way (Extended Abstract).",
                    "Diffracting Trees (Preliminary Version).",
                    "On Testing Cache-Coherent Shared Memories.",
                    "Modeling Communication in Parallel Algorithms: A Fruitful Interaction Between Theory and Systems?",
                    "Scheduling Parallelizable Tasks to Minimize Average Response Time.",
                    "Job Scheduling in Rings.",
                    "An Analysis of Diffusive Load-Balancing.",
                    "Dynamic Load Balancing in Parallel and Distributed Networks by Random Matchings (Extended Abstract).",
                    "Efficient Low-Contention Parallel Algorithms.",
                    "Constructive Deterministic PRAM Simulation on a Mesh-Connected Computer.",
                    "An Optical Simulation of Shared Memory.",
                    "Construction of the Mesh and the Torus Tolerating a Large Number of Faults.",
                    "O(log² n) Time Efficient Parallel Factorization of Dense, Sparse Separable, and Banded Matrices.",
                    "How Much Can We Speedup Gaussian Elimination with Pivoting?",
                    "Efficient Algorithms for All-to-All Communications in Multi-Port Message-Passing Systems.",
                    "An Architecture for Optimal All-to-All Personalized Communication.",
                    "Communication Efficient Matrix Multiplication on Hypercubes.",
                    "A Model for Multi-Grained Parallelism (Extended Abstract).",
                    "Increasing Network Bandwidth on Meshes.",
                    "Bounds on the Greedy Routing Algorithm for Array Networks.",
                    "Minimal Adaptive Routing on the Mesh with Bounded Queue Size.",
                    "Segment Router: A Novel Router Design for Parallel Computers."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "5th SPAA 1993",
        "info": "Velen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1993",
                "sub_name": "Proceedings of the 5th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '93, Velen, Germany, June 30 - July 2, 1993.",
                "count": 50,
                "papers": [
                    "Fault-Tolerant Meshes with Small Degree.",
                    "The Verification of Cache Coherence Protocols.",
                    "Fault Diagnosis in a Small Constant Number of Parallel Testing Rounds.",
                    "Tight Bounds on the Size of Fault-Tolerant Merging and Sorting Networks With Destructive Faults.",
                    "Scalable Parallel Computing: The IBM 9076 Scalable POWERparallel 1.",
                    "On Gazit and Miller's Parallel Algorithm for Planar Separators: Achieving Greater Efficiency Through Random Sampling.",
                    "Parallel and Output Sensitive Algorithms for Combinatorial and Linear Algebra Problems.",
                    "Efficient Parallel Shortest-Paths in Digraphs with a Separator Decomposition.",
                    "Components for Computing and Communications.",
                    "Highly Efficient Dictionary Matching in Parallel.",
                    "Optimal Parallel Two Dimensional Pattern Matching.",
                    "Parallel Construction and Query of Suffix Trees for Two-Dimensional Matrices.",
                    "Autonomous SIMD Flexibility in the MP-1 and MP-2.",
                    "A Practical Constructive Scheme for Deterministic Shared-Memory Access.",
                    "Simple, Efficient Shared Memory Simulations.",
                    "Deterministic Distribution Sort in Shared and Distributed Memory Multiprocessors.",
                    "Asymptotically Tight Bounds for Performing BMMC Permutations on Parallel Disk Systems.",
                    "The S3.mp Architecture: A Local Area Multiprocessor.",
                    "Optimal Broadcast and Summation in the LogP Model.",
                    "An Atomic Model for Message-Passing.",
                    "A Dynamic Distributed Load Balancing Algorithm with Provable Good Performance.",
                    "Bounds on the Efficiency of Message-Passing Protocols for Parallel Computers.",
                    "Technology Advances in the Intel Paragon System.",
                    "An Implementation of the epsilon-Relaxation Algorithm on the CM-5.",
                    "Experience in Massively Parallel Discrete Event Simulation.",
                    "Supporting Sets of Arbitrary Connections on iWarp Through Communication Context Switches.",
                    "The Meiko CS-2 System Architecture.",
                    "Parallel Construction of Optimal Alphabetic Trees.",
                    "Optimal Parallel Construction of Hamiltonian Cycles and Spanning Trees in Random Graphs.",
                    "An Efficient Parallel Algorithm for the Single Function Coarsest Partition Problem.",
                    "Scalable Hardware and Scalable Software : The nCUBE System.",
                    "Shared Memory Consistency Conditions for Non-Sequential Execution: Definitions and Programming Strategies.",
                    "The Power of Processor Consistency.",
                    "A Method for Implementing Lock-Free Shared-Data Structures.",
                    "An Overview of Cray Research Computers Including the Y-MP/C90 and the new MPP T3D.",
                    "Randomized routing with shorter paths.",
                    "Fast Parallel Matching in Expander Graphs.",
                    "A Doubly Logarithmic Communication Algorithm for the Completely Connected Optical Communication Parallel Computer.",
                    "Scalable Operating Systems, or What Do a Million Processors Mean?",
                    "Lower Bounds for Graph Embeddings via Algebraic Topology.",
                    "Efficient Wiring of Reconfigurable Parallel Processors.",
                    "New Graph Decompositions and Fast Emulations in Hypercubes and Butterflies.",
                    "KRS1: High Performance and Ease of Programming, No Longer an Oxymoron.",
                    "Average Case Analysis of Five Two-Dimensional Bubble Sorting Algorithms.",
                    "Fast Deterministic Approximate and Exact Parallel Sorting.",
                    "The New Class of g-Chain Periodic Sorters.",
                    "The Connection Machine Systems CM-5.",
                    "Scan Grammars: Parallel Attribute Evaluation via Data-Parallelism.",
                    "Implementing the Multiprefix Operation on Parallel and Vector Computers.",
                    "Vector Prefix Addition on Sub-Bus Mesh Computers."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "4th SPAA 1992",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1992",
                "sub_name": "Proceedings of the 4th Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '92, San Diego, CA, USA, June 29 - July 1, 1992.",
                "count": 45,
                "papers": [
                    "Adaptive Deadlock- and Livelock-Free Routing with all Minimal Paths in Torus Networks.",
                    "Designing Broadcasting Algorithms in the Postal Model for Message-Passing Systems.",
                    "Simple Path Selection for Optimal Routing on Processor Arrays.",
                    "Matching the Bisection Bound for Routing and Sorting on the Mesh.",
                    "Efficient Optical Communication in Parallel Computers.",
                    "Optimal Sorting on Mesh-Connected Processor Arrays.",
                    "Layered Cross Product - A Technique to Construct Interconnection Networks.",
                    "A Lower Bound for Sorting Networks Based on the Shuffle Permutation.",
                    "Universality of Iterated Networks.",
                    "Fast Parallel Discrete Approximation Algorithms for the Radon Transform.",
                    "Parallel Algorithms for Gray-Scale Image Component Labeling on a Mesh-Connected Computer.",
                    "Optimal Routing of Parentheses on the Hypercube.",
                    "Branch-and-Bound and Backtrack Search on Mesh-Connected Arrays of Processors.",
                    "Maintaining Dynamic Ordered Sets on Processor Networks.",
                    "Optimal Dynamic Scheduling of Task Tree on Constant-Dimensional Architectures.",
                    "Supporting the Hypercube Programming Model on Mesh Architectures: A Fast Sorter for iWarp Tori.",
                    "Implementations of Randomized Sorting on Large Parallel Machines.",
                    "On the Parallel Implementation of Goldberg's Maximum Flow Algorithm.",
                    "Polynomial Root-Finding: Analysis and Computational Investigation of a Parallel Algorithm.",
                    "Designing Synchronous Algorithms for Asynchronous Processors.",
                    "Primitives for Asynchronous List Compression.",
                    "Subset Barrier Synchronization on a Private-Memory Parallel System.",
                    "Low Contention Load Balancing on Large-Scale Multiprocessors.",
                    "Fault-Tolerant Circuit-Switching Networks.",
                    "Competitive Fault-Tolerance in Area-Universal Networks.",
                    "Robust Bounded-Degree Networks with Small Diameters.",
                    "Dense Edge-Disjoint Embedding of Binary Trees in the Mesh.",
                    "Embedding Leveled Hypercube Algorithms into Hypercubes (Extended Abstract).",
                    "The Network Architecture of the Connection Machine CM-5 (Extended Abstract).",
                    "Design and Performance of Multipath MIN Architectures.",
                    "Hardware Combining and Scalability.",
                    "Specifying Non-Blocking Shared Memories (Extended Abstract).",
                    "Splash 2.",
                    "Approximate Algorithms Scheduling Parallelizable Tasks.",
                    "Analysis of Free Schedule in Periodic Graphs.",
                    "Space and Time Efficient Implementations of Parallel Nested Dissection.",
                    "Efficient Parallel Algorithms for Computing all Pair Shortest Paths in Directed Graphs.",
                    "A Parallel Algorithm for Computing Minimum Spanning Trees.",
                    "Fast Connected Components Algorithms for the EREW PRAM.",
                    "Connected Components and the Interval Graph.",
                    "An Efficient Expected Time Parallel Algorithm for Voronoi Construction.",
                    "Supereffective Slow-Down of Parallel Computations.",
                    "O(n log log n)-Work Parallel Algorithms for Straight-Line Grid Embeddings of Planar Graphs.",
                    "Separator Based Parallel Divide and Conquer in Computational Geometry.",
                    "A Contraction Procedure for Planar Directed Graphs."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "3rd SPAA 1991",
        "info": "Hilton Head, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1991",
                "sub_name": "Proceedings of the 3rd Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '91, Hilton Head, South Carolina, USA, July 21-24, 1991.",
                "count": 33,
                "papers": [
                    "A Comparison of Sorting Algorithms for the Connection Machine CM-2.",
                    "Randomized Sorting and Selection on Mesh-Connected Processor Arrays (Preliminary Version).",
                    "Large-Scale Sorting in Parallel Memories (Extended Abstract).",
                    "Optimal Speedup for Backtrack Search on a butterfly Network.",
                    "Fast and Reliable Parallel Hashing.",
                    "Tight Bounds for the Chaining Problem.",
                    "Parallel Construction of Trees with Optimal Weighted Path Length.",
                    "More Time-Work Tradeoffs for Parallel Graph Algorithms.",
                    "An Overview of Supertoroidal Networks.",
                    "Architectural Primitives for a Scalable Shared Memory Multiprocessor.",
                    "Architectural Mechanisms to Support Three-Dimensional Lattice Gas Simulations.",
                    "Coding Theory, Hypercube Embeddings, and Fault Tolerance.",
                    "Embedding de Bruijn and Shuffle-Exchange Graphs in Five Pages (Preliminary Version).",
                    "Simulating Binary Trees on X-Trees (Extended Abstract).",
                    "An Approach to Emulating Separable Graphs (preliminary Version).",
                    "Constructing Arrangements Optimally in Parallel (Preliminary Version).",
                    "Processor Efficient Parallel Solution of Linear Systems over an Abstract Field.",
                    "In-Place Techniques for Parallel Convex Hull Algorithms (Preliminary Version).",
                    "Multisearch Techniques for Implementing Data Structures on a Mesh-Connected Computer (Preliminary Version).",
                    "Generalised Multiprocessor Scheduling Using Optimal Control.",
                    "Lock-Free garbage Collection for Multiprocessors.",
                    "A Simple Load Balancing Scheme for Task Allocation in Parallel Machines.",
                    "The Efficiency of Greedy Routing in Hypercubes and Butterflies.",
                    "Balanced Routing: Towards the Distance Bound on Grids.",
                    "Parallel Algorithms for Routing in Non-Blocking Networks.",
                    "Fully-Adaptive Minimal Deadlock-Free Packet Routing in Hypercubes, Meshes, and Other Networks.",
                    "Proving Sequential Consistency of High-Performance Shared Memories (Extended Abstract).",
                    "Sequential Consistency Versus Linearizability (Extended Abstract).",
                    "Detecting Violations of Sequential Consistency.",
                    "Impossibility Results for Asynchronous PRAM (Extended Abstract).",
                    "Understanding Retiming Through Maximum Average-Weight Cycles.",
                    "A One-Way Array Algorithm for Matroid Scheduling.",
                    "On the Capabilities of Systolic Systems (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "2nd SPAA 1990",
        "info": "Island of Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1990",
                "sub_name": "Proceedings of the 2nd Annual ACM Symposium on Parallel Algorithms and Architectures, SPAA '90, Island of Crete, Greece, July 2-6, 1990.",
                "count": 45,
                "papers": [
                    "Average Case Analysis of Greedy Routing algorithms on Arrays.",
                    "Message-Passing Algorithms for a SIMD Torus with Coteries.",
                    "The Chaos Router: A Practical Application of Randomization in Network Routing.",
                    "Tight Bounds for Oblivious Routing in the Hypercube.",
                    "Running Algorithms Efficiently on Faulty Hypercubes.",
                    "Routing Multiple Paths in Hypercubes.",
                    "Fast Algorithms for Bit-Serial Routing on a Hypercube.",
                    "Low Overhead Parallel Schedules for Task Graphs.",
                    "Asynchronous Shared Memory Parallel Computation.",
                    "The Expected Advantage of Asynchrony.",
                    "Parallel Algorithms for Generating Random Permutations on a Shared memory Machine.",
                    "Processor Networks and Alternating Machines.",
                    "Lower Bounds for Parallel Computation on Linked Structures.",
                    "Every Robust CRCW PRAM Can Efficiently Simulate a PRIORITY PRAM.",
                    "Exact Time Bounds for Computing Boolean Functions on PRAMs Without Simultaneous Writes.",
                    "Hardware Speedups in Long Integer Multiplication.",
                    "Optimal-Time Multipliers and C-Testability.",
                    "Cache Coherence for Large Scale Shared Memory Multiprocessors.",
                    "FLIP-FLOP: A Stack-Oriented Multiprocessing System.",
                    "Analysis of Multithreaded Architectures for Parallel Computing.",
                    "Architectural Support for the Efficient Data-Driven Evaluation Scheme.",
                    "Utilizing Virtual Shared Memory in a Topology Independent, Multicomputer Environment.",
                    "High-Probability Parallel Transitive Closure Algorithms.",
                    "A Randomized Parallel Algorithm for Planar Graph Isomorphism.",
                    "A New Preconditioner for the Parallel Solution of Positive Definite Toeplitz Systems.",
                    "Disjoint Paths Through a 3-Dimensional Grid.",
                    "Parallel Construction of near Optimal binary Trees.",
                    "Parallel Least-Squares Solution of General and Toeplitz Systems.",
                    "On the Euclidean Scheme for Polynomials Having Interlaced Real Zeros.",
                    "Parallel Searching in Generalized Monge Arrays with Applications.",
                    "Parallel Rectilinear Shortest Paths with Rectangular Obstacles.",
                    "Generalized Sweep Methods for Parallel Computational Geometry.",
                    "Efficient Parallel Computation of Arrangements of Hyperplanes in d Dimensions.",
                    "Parallel Algorithms for Arrangements.",
                    "Optimal Cooperative Search in Fractional Cascaded Data Structures.",
                    "P-Complete Geometric Problems.",
                    "Randomized Algorithms for Binary Search and Load Balancing with Geometric Applications.",
                    "Wait-Free Data Structures in the Asynchronous PRAM Model.",
                    "A Foundation for Sequentializing Parallel Code.",
                    "Preconditioning Index Set Transformations for Time-Optimal Affine Scheduling.",
                    "Study of Parallelism in Regular Iterative Algorithms.",
                    "Fast-Fault-Tolerant Parallel Communication and On-Line Maintenance Using Information Dispersal.",
                    "On the Computational Equivalence of Hypercube-Derived Networks.",
                    "A Unified Approach to Off-Line Permutation Routing on Parallel Networks.",
                    "Space-Efficient Representations of Shared Data for Parallel Computers."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "1st SPAA 1989",
        "info": "Santa Fe, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/spaa/1989",
                "sub_name": "Proceedings of the ACM Symposium on Parallel Algorithms and Architectures, SPAA '89, Santa Fe, New Mexico, USA, June 18-21, 1989.",
                "count": 45,
                "papers": [
                    "A Framework for Adaptive Routing in Multicomputer Networks.",
                    "On Communication Latency in PRAM Computations.",
                    "The Communication Complexity of Several Problems in Matrix Computation.",
                    "Cost-Bandwidth Tradeoffs for Communication Networks.",
                    "Processor Networks and Interconnection Networks Without Long Wires.",
                    "Embedding of d-Dimensional Grids into Optimal Hypercubes.",
                    "A Lower Bound on the Size of Shellsort Networks.",
                    "Load Balancing, Selection Sorting on the Hypercube.",
                    "Towards Understanding Exclusive Read.",
                    "Parallel RAMs with Bounded Memory Wordsize.",
                    "The Power of Parallel Pointer Manipulation.",
                    "Deterministic P-RAM Simulation with Constant Redundancy.",
                    "On the Parallel Complexity of Integer Programming.",
                    "Fast Parallel Algorithms for the Unit Cost Editing Distance Between Trees.",
                    "Intersecting Line Segments in Parallel With an Output-Sensitive Number of Processors.",
                    "Square Meshes Are Not Always Optimal.",
                    "Parallel Graph Contraction.",
                    "A More practical PRAM Model.",
                    "The APRAM: Incorporating Asynchrony into the PRAM Model.",
                    "Fault Tolerance in Hypercube-Derivative Networks.",
                    "Locating Faults in a Constant Number of Parallel Testing Rounds.",
                    "The Virtual Time Machine.",
                    "A Lazy Cache Algorithm.",
                    "Dynamic Tree Embeddings in Butterflies and Hypercubes.",
                    "Optimal On-Line Load Balancing.",
                    "Matching Partition a Linked List and Its Optimization.",
                    "Lower Bounds and Efficient Algorithms for Multiprocessor Scheduling of Dags with Communication Delays.",
                    "Optimal VLSI Architectures for Multidimensional DFT.",
                    "Advances in Homotopic Layout Compaction.",
                    "Systolic Implementations of a Move-to-Front Text Compressor.",
                    "Four Vector-Matrix Primitives.",
                    "Run-Time Parallelization and Scheduling of Loops.",
                    "Conflict-Free Access of Arrays in a Parallel Processor.",
                    "On the Number of Rounds Necessary to Disseminate Information.",
                    "A 2n-2 Step Algorithm for Routing in an nxn Array with Constant Size Queues.",
                    "Multi-Packet-Routing on Mesh Connected Arrays.",
                    "Robust Algorithms for Packet Routing in a Mesh.",
                    "Technologies for Low Latency Interconnection Switches.",
                    "An Optimal Parallel Dictionary.",
                    "Efficient Parallel Algorithms for Path Problems in Directed Graphs.",
                    "An Efficient Parallel Algorithm for Computing a Large Independent Set in a Plan Graph.",
                    "Optimal Parallel Suffix-Prefix Matching Algorithm and Applications.",
                    "Optimal Parallel Algorithms for Transitive Closure and Point Location in Planar Structures.",
                    "On Parallel Evaluation of Game Trees.",
                    "Constructing Trees in Parallel."
                ]
            }
        ]
    }
]