[
    {
        "name": "TAAS",
        "year": "2021",
        "info": "Volume 16: 2021",
        "count": 6,
        "papers": [
            "Computing Contingent Plan Graphs using Online Planning.",
            "Gist Trace-based Learning: Efficient Convention Emergence from Multilateral Interactions.",
            "A Flexible Framework for Diverse Multi-Robot Task Allocation Scenarios Including Multi-Tasking.",
            "Dynamic Evaluation of Microservice Granularity Adaptation.",
            "Loosening Control - A Hybrid Approach to Controlling Heterogeneous Swarms.",
            "An Autonomous System for Efficient Control of PTZ Cameras."
        ]
    },
    {
        "name": "TAAS",
        "year": "2020",
        "info": "Volume 15: 2020",
        "count": 15,
        "papers": [
            "PSINES: Activity and Availability Prediction for Adaptive Ambient Intelligence.",
            "SecRET: Secure Range-based Localization with Evidence Theory for Underwater Sensor Networks.",
            "Information Reuse and Stochastic Search: Managing Uncertainty in Self-* Systems.",
            "A Q-values Sharing Framework for Multi-agent Reinforcement Learning under Budget Constraint.",
            "Enki: A Diversity-driven Approach to Test and Train Robust Learning-enabled Systems.",
            "SARDE: A Framework for Continuous and Self-Adaptive Resource Demand Estimation.",
            "Resilient Team Formation with Stabilisability of Agent Networks for Task Allocation.",
            "Optimizing the Performance of Containerized Cloud Software Systems Using Adaptive PID Controllers.",
            "Applying Machine Learning in Self-adaptive Systems: A Systematic Literature Review.",
            "Introduction to the Special Issue with Selected Papers of The International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS) 2020.",
            "Uncertainty in Self-adaptive Systems: A Research Community Perspective.",
            "Behavioural Plasticity Can Help Evolving Agents in Dynamic Environments but at the Cost of Volatility.",
            "REACT-ION: A Model-based Runtime Environment for Situation-aware Adaptations.",
            "AT-DIFC+: Toward Adaptive and Trust-Aware Decentralized Information Flow Control.",
            "Reconfigurable Embedded Devices Using Reinforcement Learning to Develop Action Policies."
        ]
    },
    {
        "name": "TAAS",
        "year": "2019",
        "info": "Volume 14: 2019",
        "count": 15,
        "papers": [
            "Knowledge Management for Self-Organised Resource Allocation.",
            "Designing Robot Teams for Distributed Construction, Repair, and Maintenance.",
            "Runtime Monitoring and Resolution of Probabilistic Obstacles to System Goals.",
            "Mutual Influence-aware Runtime Learning of Self-adaptation Behavior.",
            "Self-awareness in Software Engineering: A Systematic Literature Review.",
            "Collective Adaptation through Multi-Agents Ensembles: The Case of Smart Urban Mobility.",
            "Supporting Dynamic Workflows with Automatic Extraction of Goals from BPMN.",
            "Controlling Interactions with Libraries in Android Apps Through Runtime Enforcement.",
            "Argumentation-Based Reasoning about Plans, Maintenance Goals, and Norms.",
            "Human-centric Data Dissemination in the IoP: Large-scale Modeling and Evaluation.",
            "A Bike-sharing Optimization Framework Combining Dynamic Rebalancing and User Incentives.",
            "Improving Scalability and Reward of Utility-Driven Self-Healing for Large Dynamic Architectures.",
            "UAVs vs. Pirates: An Anticipatory Swarm Monitoring Method Using an Adaptive Pheromone Map.",
            "Human Feedback as Action Assignment in Interactive Reinforcement Learning.",
            "Finding the Largest Successful Coalition under the Strict Goal Preferences of Agents."
        ]
    },
    {
        "name": "TAAS",
        "year": "2018",
        "info": "Volume 13: 2018",
        "count": 20,
        "papers": [
            "Editorial: The First.",
            "Engineering Self-Adaptive Software Systems: From Requirements to Model Predictive Control.",
            "Effective Capacity Modulation as an Explicit Control Knob for Public Cloud Profitability.",
            "Flexible and Efficient Decision-Making for Proactive Latency-Aware Self-Adaptation.",
            "Model-Based Response Planning Strategies for Autonomic Intrusion Protection.",
            "Viable Algorithmic Options for Designing Reactive Robot Swarms.",
            "Adaptive Opportunistic Airborne Sensor Sharing.",
            "Self-Organizing Control Mechanism Based on Collective Decision-Making for Information Uncertainty.",
            "Understanding Crowdsourcing Systems from a Multiagent Perspective and Approach.",
            "Adaptive Process Migrations in Coupled Applications for Exchanging Data in Local File Cache.",
            "Decentralized Collective Learning for Self-managed Sharing Economies.",
            "SDN Flow Entry Management Using Reinforcement Learning.",
            "SOD: Making Smartphone Smart on Demand with Radio Interface Management.",
            "Improving Data-Analytics Performance Via Autonomic Control of Concurrency and Resource Units.",
            "Probabilistic Policy Reuse for Safe Reinforcement Learning.",
            "Adaptive Behavior Modeling in Logistic Systems with Agents and Dynamic Graphs.",
            "TSLAM: A Trust-enabled Self-Learning Agent Model for Service Matching in the Cloud Market.",
            "SimCA*: A Control-theoretic Approach to Handle Uncertainty in Self-adaptive Systems with Guarantees.",
            "A Measure of Added Value in Groups.",
            "An Innovative Approach for Ad Hoc Network Establishment in Disaster Environments by the Deployment of Wireless Mobile Agents."
        ]
    },
    {
        "name": "TAAS",
        "year": "2017",
        "info": "Volume 12: 2017/2018",
        "count": 25,
        "papers": [
            "e-Sampling: Event-Sensitive Autonomous Adaptive Sensing and Low-Cost Monitoring in Networked Sensing Systems.",
            "Topology Management-Based Distributed Camera Actuation in Wireless Multimedia Sensor Networks.",
            "Tight Analysis of a Collisionless Robot Gathering Algorithm.",
            "Decentralised Detection of Emergence in Complex Adaptive Systems.",
            "Budget-Driven Scheduling of Scientific Workflows in IaaS Clouds with Fine-Grained Billing Periods.",
            "On Service Migrations in the Cloud for Mobile Accesses: A Distributed Approach.",
            "Autonomous Mobile Sensor Placement in Complex Environments.",
            "Integrating Reinforcement Learning with Multi-Agent Techniques for Adaptive Service Composition.",
            "Prediction-Based Multi-Agent Reinforcement Learning in Inherently Non-Stationary Environments.",
            "Feature Construction for Controlling Swarms by Visual Demonstration.",
            "SASO 2016: Selected, Revised, and Extended Best Papers.",
            "Self-Adaptation to Device Distribution in the Internet of Things.",
            "Electronic Social Capital for Self-Organising Multi-Agent Systems.",
            "Hyper-Learning Algorithms for Online Evolution of Robot Controllers.",
            "Evolved Control of Natural Plants: Crossing the Reality Gap for User-Defined Steering of Growth and Motion.",
            "Defining Emergent Software Using Continuous Self-Assembly, Perception, and Learning.",
            "Farewell Editorial.",
            "Software Adaptation in Wireless Sensor Networks.",
            "Performance and Cost Considerations for Providing Geo-Elasticity in Database Clouds.",
            "On Ordering Multi-Robot Task Executions within a Cyber Physical System.",
            "MARC: A Resource Consumption Modeling Service for Self-Aware Autonomous Agents.",
            "Hierarchical Optimal Control Method for Controlling Large-Scale Self-Organizing Networks.",
            "Efficient and Robust Emergence of Norms through Heuristic Collective Learning.",
            "A Stepwise Auto-Profiling Method for Performance Optimization of Streaming Applications.",
            "From DevOps to BizOps: Economic Sustainability for Scalable Cloud Applications."
        ]
    },
    {
        "name": "TAAS",
        "year": "2016",
        "info": "Volume 11: 2016/2017",
        "count": 25,
        "papers": [
            "Managing Server Clusters on Renewable Energy Mix.",
            "An Auction Mechanism for Cloud Spot Markets.",
            "Using Imitation to Build Collaborative Agents.",
            "Privacy Policy Negotiation in Social Media.",
            "SASO 2014: Selected, Revised, and Extended Best Papers.",
            "Artificial Immunology for Collective Adaptive Systems Design and Implementation.",
            "Controlling Negative Emergent Behavior by Graph Analysis at Runtime.",
            "Modeling Robot Swarms Using Integrals of Birth-Death Processes.",
            "Controlling Large-Scale Self-Organized Networks with Lightweight Cost for Fast Adaptation to Changing Environments.",
            "Trust-Based Decision Making in a Self-Adaptive Agent Organization.",
            "A Support System for Clustering Data Streams with a Variable Number of Clusters.",
            "Distributed Multirobot Formation and Tracking Control in Cluttered Environments.",
            "A Game-Theoretic Approach for Elastic Distributed Data Stream Processing.",
            "Transparent and Efficient Parallelization of Swarm Algorithms.",
            "Group Norms for Multi-Agent Organisations.",
            "Topology Control for Diverse Coverage in Underwater Wireless Sensor Networks.",
            "Online Adaptive Anomaly Detection for Augmented Network Flows.",
            "Designing Self-Stabilizing Systems Using Game Theory.",
            "Attributed Graph Rewriting for Complex Event Processing Self-Management.",
            "Characterizing and Adapting the Consistency-Latency Tradeoff in Distributed Key-Value Stores.",
            "Topology Control for Self-Adaptation in Wireless Sensor Networks with Temporary Connection Impairment.",
            "Introduction to the Special Section on Best Papers from SEAMS 2015.",
            "Modeling and Extracting Load Intensity Profiles.",
            "Control Strategies for Self-Adaptive Software Systems.",
            "Formal Design and Verification of Self-Adaptive Systems with Decentralized Control."
        ]
    },
    {
        "name": "TAAS",
        "year": "2015",
        "info": "Volume 10: 2015/2016",
        "count": 30,
        "papers": [
            "Engineering Pervasive Service Ecosystems: The SAPERE Approach.",
            "Online Automated Synthesis of Compact Normative Systems.",
            "Reliable Task Allocation with Load Balancing in Multiplex Networks.",
            "SHõWA: A Self-Healing Framework for Web-Based Applications.",
            "A Reinforcement Learning Approach for Interdomain Routing with Link Prices.",
            "Self-Tuning Batching with DVFS for Performance Improvement and Energy Efficiency in Internet Servers.",
            "SASO 2013: Selected, Revised, and Extended Best Papers.",
            "Static, Dynamic, and Adaptive Heterogeneity in Distributed Smart Camera Networks.",
            "A Generic Holonic Control Architecture for Heterogeneous Multiscale and Multiobjective Smart Microgrids.",
            "Superdiffusive Dispersion and Mixing of Swarms.",
            "Cooperative Resource Allocation in Open Systems of Systems.",
            "A Distributed Algorithm for Large-Scale Graph Partitioning.",
            "Crowdsourcing through Cognitive Opportunistic Networks.",
            "Game-Theoretic Mechanisms to Increase Data Availability in Decentralized Storage Systems.",
            "MAPE-K Formal Templates to Rigorously Design Behaviors for Self-Adaptive Systems.",
            "Computing Swarms for Self-Adaptiveness and Self-Organization in Floating-Point Array Processing.",
            "Distributed Spatiotemporal Gesture Recognition in Sensor Arrays.",
            "Autonomous Orchestration of Distributed Discrete Event Simulations in the Presence of Resource Uncertainty.",
            "Distributed Binary Consensus in Networks with Disturbances.",
            "Fault Monitoring with Sequential Matrix Factorization.",
            "SMT-Based Synthesis of Distributed Self-Stabilizing Systems.",
            "Introduction to the Special Section on Best Papers from SEAMS 2014.",
            "Analyzing Latency-Aware Self-Adaptation Using Stochastic Games and Simulations.",
            "User-Centric Adaptation Analysis of Multi-Tenant Services.",
            "Designing Adaptive Applications Deployed on Cloud Environments.",
            "Inferring Software Component Interaction Dependencies for Adaptation Support.",
            "Just-in-Time Adaptive Algorithm for Optimal Parameter Setting in 802.15.4 WSNs.",
            "Connectivity Reestablishment in Self-Organizing Sensor Networks with Dumb Nodes.",
            "Self-Stabilized Fast Gossiping Algorithms.",
            "Enhancing Reliability of Workflow Execution Using Task Replication and Spot Instances."
        ]
    },
    {
        "name": "TAAS",
        "year": "2014",
        "info": "Volume 9: 2014",
        "count": 21,
        "papers": [
            "Fostering Cooperation through Dynamic Coalition Formation and Partner Switching.",
            "A Cooperative Predictive Control Approach to Improve the Reconfiguration Stability of Adaptive Distributed Parallel Applications.",
            "Mitigating DoS Attacks Using Performance Model-Driven Adaptive Algorithms.",
            "Bionic Autonomic Nervous Systems for Self-Defense against DoS, Spyware, Malware, Virus, and Fishing.",
            "Modeling and Defending against Adaptive BitTorrent Worms in Peer-to-Peer Networks.",
            "Best ACM SAC Articles on Coordination and Self-Adaptation.",
            "A Formal Approach to Autonomic Systems Programming: The SCEL Language.",
            "Programming Urban-Area Applications by Exploiting Public Transportation.",
            "Improving the Effectiveness of Testing Pervasive Software via Context Diversity.",
            "Adaptive Resource Provisioning for Virtualized Servers Using Kalman Filters.",
            "Transactional Auto Scaler: Elastic Scaling of Replicated In-Memory Transactional Data Grids.",
            "Utility-Based Mechanism for Structural Self-Organization in Service-Oriented MAS.",
            "Multi-Cloud Provisioning and Load Distribution for Three-Tier Applications.",
            "Distributive Justice for Self-Organised Common-Pool Resource Management.",
            "The Complexity of Adding Multitolerance.",
            "An Intelligent Agent for Bilateral Negotiation with Unknown Opponents in Continuous-Time Domains.",
            "Property-Driven Design for Robot Swarms: A Design Method Based on Prescriptive Modeling and Model Checking.",
            "Reinforcement Learning of Informed Initial Policies for Decentralized Planning.",
            "AutoPlacer: Scalable Self-Tuning Data Placement in Distributed Key-Value Stores.",
            "Multiagent Reinforcement Social Learning toward Coordination in Cooperative Multiagent Systems.",
            "Distributed Data-Centric Adaptive Sampling for Cyber-Physical Systems."
        ]
    },
    {
        "name": "TAAS",
        "year": "2013",
        "info": "Volume 8: 2013/2014",
        "count": 21,
        "papers": [
            "Editorial.",
            "Robust convention emergence in social networks through self-reinforcing structures dissolution.",
            "Convergence results for ant routing algorithms via stochastic approximation.",
            "Adapting scientific workflow structures using multi-objective optimization strategies.",
            "Learning user preferences for adaptive pervasive environments: An incremental and temporal approach.",
            "A state-dependent time evolving multi-constraint routing algorithm.",
            "An Analysis of Language-Level Support for Self-Adaptive Software.",
            "Conditional Safety Certification of Open Adaptive Systems.",
            "Autonomic Provisioning with Self-Adaptive Neural Fuzzy Control for Percentile-Based Delay Guarantee.",
            "Adaptive Composition of Distributed Pervasive Applications in Heterogeneous Environments.",
            "Fast, Accurate Event Classification on Resource-Lean Embedded Sensors.",
            "Design and Performance Evaluation of Data Dissemination Systems for Opportunistic Networks Based on Cognitive Heuristics.",
            "Robust Regulation Adaptation in Multi-Agent Systems.",
            "Performance Modeling and Optimization of Deadline-Driven Pig Programs.",
            "Achieving Socially Optimal Outcomes in Multiagent Systems with Reinforcement Social Learning.",
            "Introduction to the Special Section on Best Papers from SEAMS 2012.",
            "A Systematic Survey of Self-Protecting Software Systems.",
            "Model-Driven Engineering of Self-Adaptive Software with EUREMA.",
            "Adaptive Epidemic Dynamics in Networks: Thresholds and Control.",
            "CAAC - An Adaptive and Proactive Access Control Approach for Emergencies in Smart Infrastructures.",
            "A Host-Based Approach for Unknown Fast-Spreading Worm Detection and Containment."
        ]
    },
    {
        "name": "TAAS",
        "year": "2012",
        "info": "Volume 7: 2012",
        "count": 39,
        "papers": [
            "Decentralized approaches for self-adaptation in agent organizations.",
            "Self-organizing virtual macro sensors.",
            "Efficiency of optimistic fair exchange using trusted devices.",
            "Host selection through collective decision.",
            "Efficient load balancing in partitioned queries under random perturbations.",
            "Introduction to special section on formal methods in pervasive computing.",
            "A formalized, taxonomy-driven approach to cross-layer application adaptation.",
            "FORMS: Unifying reference model for formal specification of distributed self-adaptive systems.",
            "Introduction to the special section on pervasive adaptation.",
            "3PC: System support for adaptive peer-to-peer pervasive computing.",
            "Autonomic multi-policy optimization in pervasive systems: Overview and evaluation.",
            "Reflective pervasive systems.",
            "Introduction to the special section on self-adaptive systems: Models and algorithms.",
            "Decentralized and optimal control of shared resource pools.",
            "A morphogenetic framework for self-organized multirobot pattern formation and boundary coverage.",
            "Techniques for knowledge acquisition in dynamically changing environments.",
            "On modeling of coevolution of strategies and structure in autonomous overlay networks.",
            "Adaptare: Supporting automatic and dependable adaptation in dynamic environments.",
            "Conceptual modeling of flexible temporal workflows.",
            "Improving differential evolution algorithm by synergizing different improvement mechanisms.",
            "Centralized and distributed task allocation in multi-robot teams via a stochastic clustering auction.",
            "An erasure-resilient encoding system for flexible reading and writing in storage networks.",
            "A shared-secret free security infrastructure for wireless networks.",
            "Designing and optimizing swarming in a distributed base station network: Application to power control.",
            "Choosing partners based on availability in P2P networks.",
            "Anonymous transactions in computer networks.",
            "First step towards automatic correction of firewall policy faults.",
            "RelaxDHT: A churn-resilient replication strategy for peer-to-peer distributed hash-tables.",
            "Control-based p-persistent adaptive communication protocol.",
            "Self-organizing synchronization with inhibitory-coupled oscillators: Convergence and robustness.",
            "Heterogeneity playing key role: Modeling and analyzing the dynamics of incentive mechanisms in autonomous networks.",
            "Push- and pull-based epidemic spreading in networks: Thresholds and deeper insights.",
            "A method fragments approach to methodologies for engineering self-organizing systems.",
            "Design and evaluation of decentralized online clustering.",
            "Bio-Inspired P2P Systems: The Case of Multidimensional Overlay.",
            "Comparison of Decision-Making Strategies for Self-Optimization in Autonomic Computing Systems.",
            "The XtreemOS Resource Selection Service.",
            "A Lightweight Method for Automated Design of Convergence in Network Protocols.",
            "Axiomatization of Socio-Economic Principles for Self-Organizing Institutions: Concepts, Experiments and Challenges."
        ]
    },
    {
        "name": "TAAS",
        "year": "2011",
        "info": "Volume 6: 2011",
        "count": 29,
        "papers": [
            "Special Issue: Adaptive Service Discovery and Composition in Ubiquitous and Pervasive Computing.",
            "Design and Implementation of an Anycast Services Discovery in Mobile Ad Hoc Networks.",
            "Network Service Description and Discovery for High-Performance Ubiquitous and Pervasive Grids.",
            "Dynamic User Task Composition Based on User Preferences.",
            "Trustworthy Service Selection and Composition.",
            "SeDiM: A Middleware Framework for Interoperable Service Discovery in Heterogeneous Networks.",
            "A Decentralized Self-Organizing Service Composition for Autonomic Entities.",
            "AutoHome: An Autonomic Management Framework for Pervasive Home Applications.",
            "Formal Specification and Verification of Ubiquitous and Pervasive Systems.",
            "Action Selection Algorithms for Autonomous System in Pervasive Environment: A Computational Approach.",
            "Spatial Computing: Distributed Systems That Take Advantage of Our Geometric World.",
            "Gabriel Graphs in Arbitrary Metric Space and their Cellular Automaton for Many Grids.",
            "Detecting Locally Distributed Predicates.",
            "Spatial Coordination of Pervasive Services through Chemical-Inspired Tuple Spaces.",
            "Infrastructureless Spatial Storage Algorithms.",
            "Macro Programming a Spatial Computer with Bayesian Networks.",
            "Spatial hardware implementation for sparse graph algorithms in GraphStep.",
            "ScatterD: Spatial deployment optimization with hybrid heuristic/evolutionary algorithms.",
            "Self-organizing and self-reconfigurable event routing in ad hoc networks with causal dependency awareness.",
            "Cooperative evolution of services in ubiquitous computing environments.",
            "Behavior-based adaptive call predictor.",
            "An adaptive and predictive approach for autonomic multirate multicast networks.",
            "The Price of Anonymity: Optimal Consensus Despite Asynchrony, Crash, and Anonymity.",
            "Effective Usage of Computational Trust Models in Rational Environments.",
            "Bird Flight-Inspired Routing Protocol for Mobile Ad Hoc Networks.",
            "Primate-Inspired Communication Methods for Mobile and Static Sensors and RFID Tags.",
            "Scalable Stealth Mode P2P Overlays of Very Small Constant Degree.",
            "From Autonomic to Self-Self Behaviors: The JADE Experience.",
            "Editorial."
        ]
    },
    {
        "name": "TAAS",
        "year": "2010",
        "info": "Volume 5: 2010",
        "count": 16,
        "papers": [
            "Particle swarm optimizer with adaptive tabu and mutation: A unified framework for efficient mutation operators.",
            "Structured overlay for heterogeneous environments: Design and evaluation of oscar.",
            "The MACODO middleware for context-driven dynamic agent organizations.",
            "Cooperation through self-similar social networks.",
            "Editorial: Special issue on ambient intelligence.",
            "Self-organized service placement in ambient intelligence environments.",
            "A multi-society-based intelligent association discovery and selection for ambient intelligence environments.",
            "Interoperable and adaptive fuzzy services for ambient intelligence applications.",
            "Editorial: Special issue on organic computing.",
            "Adaptivity and self-organization in organic computing systems.",
            "Empowered by wireless communication: Distributed methods for self-organizing traffic collectives.",
            "Parsimonious rule generation for a nature-inspired approach to self-assembly.",
            "Autonomous vehicle coordination with wireless sensor and actuator networks.",
            "Evidence-based trust: A mathematical model geared for multiagent systems.",
            "A self-organization mechanism based on cross-entropy method for P2P-like applications.",
            "The MACODO organization model for context-driven dynamic agent organizations."
        ]
    },
    {
        "name": "TAAS",
        "year": "2009",
        "info": "Volume 4: 2009",
        "count": 24,
        "papers": [
            "Introduction to special issue on stabilization, safety, and security of distributed systems.",
            "Fault tolerance measures for large-scale wireless sensor networks.",
            "Chowkidar: Reliable and scalable health monitoring for wireless sensor network testbeds.",
            "Optimal message-driven implementations of omega with mute processes.",
            "Complexity results in revising UNITY programs.",
            "Light enabling snap-stabilization of fundamental protocols.",
            "Self-stabilizing philosophers with generic conflicts.",
            "On bootstrapping topology knowledge in anonymous networks.",
            "Using eventually consistent compasses to gather memory-less mobile robots with limited visibility.",
            "Isolation points: Creating performance-robust enterprise systems.",
            "On the use of memory and resources in minority games.",
            "Semantics-based context-aware dynamic service composition.",
            "Exploiting user location for load balancing WLANs and improving wireless QoS.",
            "Self-adaptive software: Landscape and research challenges.",
            "Introduction to the special issue on self-adaptive and self-organizing wireless networking systems.",
            "Agilla: A mobile agent middleware for self-adaptive wireless sensor networks.",
            "Self-stabilizing robot formations over unreliable networks.",
            "On the convergence and stability of data-driven link estimation and routing in sensor networks.",
            "Self-organizing fault-tolerant topology control in large-scale three-dimensional wireless networks.",
            "Editorial to the special issue.",
            "An autonomic framework for reliable multicast: A game theoretical approach based on social psychology.",
            "An immunologically-inspired autonomic framework for self-organizing and evolvable network applications.",
            "Machine learning in disruption-tolerant MANETs.",
            "M-AID: An adaptive middleware built upon anomaly detectors for intrusion detection and rational response."
        ]
    },
    {
        "name": "TAAS",
        "year": "2008",
        "info": "Volume 3: 2008",
        "count": 20,
        "papers": [
            "Agile dynamic provisioning of multi-tier Internet applications.",
            "An adaptative agent architecture for holonic multi-agent systems.",
            "Ant-based distributed constrained steiner tree algorithm for jointly conserving energy and bounding delay in ad hoc multicast routing.",
            "Admission of QoS aware users in a smart network.",
            "So-Grid: A self-organizing Grid featuring bio-inspired algorithms.",
            "A control theoretical approach to self-optimizing block transfer in Web service grids.",
            "Agent clustering based on semantic negotiation.",
            "ViSAGE: A Virtual Laboratory for Simulation and Analysis of Social Group Evolution.",
            "Interactive access control for autonomic systems: From theory to implementation.",
            "An adaptive automatically tuning intrusion detection system.",
            "A new class of nature-inspired algorithms for self-adaptive peer-to-peer computing.",
            "Introduction to special issue on stabilization, safety, and security of distributed systems.",
            "Self-stabilizing population protocols.",
            "MiniMax equilibrium of networked differential games.",
            "An exercise in selfish stabilization.",
            "Circle formation of weak mobile robots.",
            "Self-stabilizing device drivers.",
            "Logarithmic keying.",
            "Safe peer-to-peer self-downloading.",
            "A general characterization of indulgence."
        ]
    },
    {
        "name": "TAAS",
        "year": "2007",
        "info": "Volume 2: 2007",
        "count": 16,
        "papers": [
            "Properties and mechanisms of self-organizing MANET and P2P systems.",
            "Socio-technical defense against voice spamming.",
            "A performance analysis method for autonomic computing systems.",
            "Pervasive pheromone-based interaction with RFID tags.",
            "The multilevel hypernetwork dynamics of complex systems of robot soccer agents.",
            "Adaptive selection of necessary and sufficient checkpoints for dynamic verification of temporal constraints in grid workflow systems.",
            "Introduction: Special issue of the IEEE SUTC'06.",
            "Adaptive correctness monitoring for wireless sensor networks using hierarchical distributed run-time invariant checking.",
            "Network intrusion detection through Adaptive Sub-Eigenspace Modeling in multiagent systems.",
            "The role of roles in supporting reconfigurability and fault localizations for open distributed and embedded systems.",
            "Ranking factors in peer-to-peer overlay networks.",
            "Introduction to the special issue: The AgentLink III technical forums.",
            "Awareness in collaborative ubiquitous environments: The Multilayered Multi-Agent Situated System approach.",
            "A Framework for Web service negotiation.",
            "Specifying protocols for multi-agent systems interaction.",
            "High variability design for software agents: Extending Tropos."
        ]
    },
    {
        "name": "TAAS",
        "year": "2006",
        "info": "Volume 1: 2006",
        "count": 9,
        "papers": [
            "Introduction.",
            "Division of labor in a group of robots inspired by ants' foraging behavior.",
            "Design patterns from biology for distributed computing.",
            "A software retrieval service based on adaptive knowledge-driven agents for wireless environments.",
            "Automated Facial Expression Classification and affect interpretation using infrared measurement of facial skin temperature variations.",
            "Cooperation through self-assembly in multi-robot systems.",
            "Reactive provisioning of backend databases in shared dynamic content server clusters.",
            "A reactive agent-based problem-solving model: Application to localization and tracking.",
            "A survey of autonomic communications."
        ]
    }
]