[
    {
        "name": "TOCS",
        "year": "2021",
        "info": "Volume 38, 2021",
        "count": 4,
        "papers": [
            "Modular and Distributed Management of Many-Core SoCs.",
            "SmartIO: Zero-overhead Device Sharing through PCIe Networking.",
            "Metron: High-performance NFV Service Chaining Even in the Presence of Blackboxes.",
            "Systemizing Interprocedural Static Analysis of Large-scale Systems Code with Graspan."
        ]
    },
    {
        "name": "TOCS",
        "year": "2021",
        "info": "Volume 37, 2021",
        "count": 6,
        "papers": [
            "Highly Concurrent Latency-tolerant Register Files for GPUs.",
            "KylinX: Simplified Virtualization Architecture for Specialized Virtual Appliances with Strong Isolation.",
            "AI Tax: The Hidden Cost of AI Data Center Applications.",
            "UNIQ: Uniform Noise Injection for Non-Uniform Quantization of Neural Networks.",
            "Distributed Graph Processing System and Processing-in-memory Architecture with Precise Loop-carried Dependency Guarantee.",
            "A Simulation Software for the Evaluation of Vulnerabilities in Reputation Management Systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "2019",
        "info": "Volume 36, 2019/2020",
        "count": 15,
        "papers": [
            "Lock-Unlock: Is That All? A Pragmatic Analysis of Locking in Software Systems.",
            "Venice: An Effective Resource Sharing Architecture for Data Center Servers.",
            "Deca: A Garbage Collection Optimizer for In-Memory Data Processing.",
            "Derecho: Fast State Machine Replication for Cloud Services.",
            "SPIN: Seamless Operating System Integration of Peer-to-Peer DMA Between SSDs and GPUs.",
            "Mitigating Load Imbalance in Distributed Data Serving with Rack-Scale Memory Pooling.",
            "The Arm Triple Core Lock-Step (TCLS) Processor.",
            "Software Prefetching for Indirect Memory Accesses: A Microarchitectural Perspective.",
            "An Instruction Set Architecture for Machine Learning.",
            "Effective Detection of Sleep-in-atomic-context Bugs in the Linux Kernel.",
            "Introduction to the Special Issue on the Award Papers of USENIX ATC 2019.",
            "SILK+ Preventing Latency Spikes in Log-Structured Merge Key-Value Stores Running Heterogeneous Workloads.",
            "Transactuations: Where Transactions Meet the Physical World.",
            "A Retargetable System-level DBT Hypervisor.",
            "Corrigendum to \"Derecho: Fast State Machine Replication for Cloud Services, \" by Jha et al., ACM Transactions on Computer Systems (TOCS) Volume 36, Issue 2, Article No. 4."
        ]
    },
    {
        "name": "TOCS",
        "year": "2017",
        "info": "Volume 35, 2017/2018",
        "count": 13,
        "papers": [
            "Optimizing General-Purpose CPUs for Energy-Efficient Mobile Web Computing.",
            "Reining in Long Tails in Warehouse-Scale Computers with Quick Voltage Boosting Using Adrenaline.",
            "Fast In-Memory Transaction Processing Using RDMA and HTM.",
            "Using Multicore Reuse Distance to Study Coherence Directories.",
            "Apache REEF: Retainable Evaluator Execution Framework.",
            "Supercloud: A Library Cloud for Exploiting Cloud Diversity.",
            "Seer: Probabilistic Scheduling for Hardware Transactional Memory.",
            "The Hipster Approach for Improving Cloud System Efficiency.",
            "Determining Application-Specific Peak Power and Energy Requirements for Ultra-Low-Power Processors.",
            "Corrigendum to \"The IX Operating System: Combining Low Latency, High Throughput and Efficiency in a Protected Dataplane\".",
            "Pivot Tracing: Dynamic Causal Monitoring for Distributed Systems.",
            "Building Consistent Transactions with Inconsistent Replication.",
            "Ryoan: A Distributed Sandbox for Untrusted Computation on Secret Data."
        ]
    },
    {
        "name": "TOCS",
        "year": "2016",
        "info": "Volume 34, 2016/2017",
        "count": 12,
        "papers": [
            "L4 Microkernels: The Lessons from 20 Years of Research and Deployment.",
            "Designing Future Warehouse-Scale Computers for Sirius, an End-to-End Voice and Vision Personal Assistant.",
            "Identifying Power-Efficient Multicore Cache Hierarchies via Reuse Distance Analysis.",
            "EOLE: Combining Static and Dynamic Scheduling Through Value Prediction to Reduce Complexity and Increase Performance.",
            "Full-Stack Architecting to Achieve a Billion-Requests-Per-Second Throughput on a Single Key-Value Store Server Platform.",
            "Improving Resource Efficiency at Scale with Heracles.",
            "BlueDBM: Distributed Flash Storage for Big Data Analytics.",
            "A Virtualized Separation Kernel for Mixed-Criticality Systems.",
            "GPUnet: Networking Abstractions for GPU Programs.",
            "Reliability Analysis of SSDs Under Power Fault.",
            "The IX Operating System: Combining Low Latency, High Throughput, and Efficiency in a Protected Dataplane.",
            "Computational Sprinting: Architecture, Dynamics, and Strategies."
        ]
    },
    {
        "name": "TOCS",
        "year": "2015",
        "info": "Volume 33, 2015/2016",
        "count": 13,
        "papers": [
            "A Differential Approach to Undefined Behavior Detection.",
            "Energy-Oriented Partial Desktop Virtual Machine Migration.",
            "ISA Wars: Understanding the Relevance of ISA being RISC or CISC to Performance, Power, and Energy on Modern Architectures.",
            "K2: A Mobile Operating System for Heterogeneous Coherence Domains.",
            "Fireflies: A Secure and Scalable Membership and Gossip Service.",
            "A Small-Footprint Accelerator for Large-Scale Neural Networks.",
            "The RAMCloud Storage System.",
            "Shielding Applications from an Untrusted Cloud with Haven.",
            "SKMD: Single Kernel on Multiple Devices for Transparent CPU-GPU Collaboration.",
            "Efficient Control and Communication Paradigms for Coarse-Grained Spatial Architectures.",
            "Arrakis: The Operating System Is the Control Plane.",
            "Assisting Static Compiler Vectorization with a Speculative Dynamic Vectorizer in an HW/SW Codesigned Environment.",
            "Fast and Portable Locking for Multicore Architectures."
        ]
    },
    {
        "name": "TOCS",
        "year": "2014",
        "info": "Volume 32, 2014/2015",
        "count": 12,
        "papers": [
            "GPUfs: Integrating a file system with GPUs.",
            "Comprehensive formal verification of an OS microkernel.",
            "Market mechanisms for managing datacenters with heterogeneous microarchitectures.",
            "Faults in Linux 2.6.",
            "TaintDroid: An Information-Flow Tracking System for Realtime Privacy Monitoring on Smartphones.",
            "Optimizing the Block I/O Subsystem for Fast Storage Devices.",
            "Scaling Performance via Self-Tuning Approximation for Graphics Engines.",
            "Energy Analysis of Hardware and Software Range Partitioning.",
            "Approximate Storage in Solid-State Memories.",
            "The Scalable Commutativity Rule: Designing Scalable Software for Multicore Processors.",
            "Mechanistic Modeling of Architectural Vulnerability Factor.",
            "The Next 700 BFT Protocols."
        ]
    },
    {
        "name": "TOCS",
        "year": "2013",
        "info": "Volume 31, 2013",
        "count": 12,
        "papers": [
            "Efficient Reuse Distance Analysis of Multicore Scaling for Loop-Based Parallel Programs.",
            "Aggressive Datacenter Power Provisioning with Batteries.",
            "TritonSort: A Balanced and Energy-Efficient Large-Scale Sorting System.",
            "Parametric Content-Based Publish/Subscribe.",
            "Optimizing Storage Performance for VM-Based Mobile Computing.",
            "Exploring the Tradeoffs between Programmability and Efficiency in Data-Parallel Accelerators.",
            "Protocol Responsibility Offloading to Improve TCP Throughput in Virtualized Environments.",
            "Spanner: Google's Globally Distributed Database.",
            "Editorial.",
            "CORFU: A distributed shared log.",
            "A programmable memory controller for the DDRx interfacing standards.",
            "QoS-Aware scheduling in heterogeneous datacenters with paragon."
        ]
    },
    {
        "name": "TOCS",
        "year": "2012",
        "info": "Volume 30, 2012",
        "count": 15,
        "papers": [
            "Introduction to Special Issue APLOS 2011.",
            "The S2E Platform: Design, Implementation, and Applications.",
            "DoublePlay: Parallelizing Sequential Logging and Replay.",
            "Improving Software Diagnosability via Log Enhancement.",
            "A Declarative Language Approach to Device Configuration.",
            "Leveraging Core Specialization via OS Scheduling to Improve Performance on Asymmetric Multicore Systems.",
            "Fairness via Source Throttling: A Configurable and High-Performance Fairness Substrate for Multicore Memory Systems.",
            "A Hierarchical Thread Scheduler and Register File for Energy-Efficient Throughput Processors.",
            "The Design, Implementation, and Evaluation of Cells: A Virtual Smartphone Architecture.",
            "A File Is Not a File: Understanding the I/O Behavior of Apple Desktop Applications.",
            "Power Limitations and Dark Silicon Challenge the Future of Multicore.",
            "Bringing Virtualization to the x86 Architecture with the Original VMware Workstation.",
            "Fay: Extensible Distributed Tracing from Kernels to Clusters.",
            "AutoScale: Dynamic, Robust Capacity Management for Multi-Tier Data Centers.",
            "Quantifying the Mismatch between Emerging Scale-Out Applications and Modern Processors."
        ]
    },
    {
        "name": "TOCS",
        "year": "2011",
        "info": "Volume 29, 2011",
        "count": 12,
        "papers": [
            "SEATTLE: A Scalable Ethernet Architecture for Large Enterprises.",
            "SnowFlock: Virtual Machine Cloning as a First-Class Cloud Primitive.",
            "The PowerNap Server Architecture.",
            "DieCast: Testing Distributed Systems with an Accurate Scale Model.",
            "Management of Multilevel, Multiclient Cache Hierarchies with Application Hints.",
            "Application-Tailored I/O with Streamline.",
            "On the design of perturbation-resilient atomic commit protocols for mobile transactions.",
            "Scheduling real-time garbage collection on uniprocessors.",
            "Mobile processors for energy-efficient web search.",
            "EventGuard: A System Architecture for Securing Publish-Subscribe Networks.",
            "Efficient Testing of Recovery Code Using Fault Injection.",
            "Depot: Cloud Storage with Minimal Trust."
        ]
    },
    {
        "name": "TOCS",
        "year": "2010",
        "info": "Volume 28, 2010",
        "count": 9,
        "papers": [
            "Editorial.",
            "Predicting and preventing inconsistencies in deployed distributed systems.",
            "DDoS defense by offense.",
            "Proactive obfuscation.",
            "Throughput optimal total order broadcast for cluster environments.",
            "The SMesh wireless mesh network.",
            "Probabilistic quorum systems in wireless Ad Hoc networks.",
            "Contention-Aware Scheduling on Multicore Systems.",
            "Load Balancing Content-Based Publish/Subscribe Systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "2009",
        "info": "Volume 27, 2009",
        "count": 8,
        "papers": [
            "Hill-climbing SMT processor resource distribution.",
            "Distributed hash sketches: Scalable, efficient, and accurate cardinality estimation for distributed multisets.",
            "A mechanistic performance model for superscalar out-of-order processors.",
            "Practical and low-overhead masking of failures of TCP-based servers.",
            "Sinfonia: A new paradigm for building scalable distributed systems.",
            "Automated anomaly detection and performance modeling of enterprise applications.",
            "Zyzzyva: Speculative Byzantine fault tolerance.",
            "Selective replication: A lightweight technique for soft errors."
        ]
    },
    {
        "name": "TOCS",
        "year": "2008",
        "info": "Volume 26, 2008",
        "count": 10,
        "papers": [
            "A generic component model for building systems software.",
            "Incrementally parallelizing database transactions with thread-level speculation.",
            "High-bandwidth data dissemination for large-scale distributed systems.",
            "Bigtable: A Distributed Storage System for Structured Data.",
            "RaWMS - Random Walk Based Lightweight Membership Service for Wireless Ad Hoc Networks.",
            "Rethink the sync.",
            "Adaptive work-stealing with parallelism feedback.",
            "A stateless approach to connection-oriented protocols.",
            "Vigilante: End-to-end containment of Internet worm epidemics.",
            "Improving peer-to-peer performance through server-side scheduling."
        ]
    },
    {
        "name": "TOCS",
        "year": "2007",
        "info": "Volume 25, 2007",
        "count": 11,
        "papers": [
            "Specifying memory consistency of write buffer multiprocessors.",
            "Comprehensive multivariate extrapolation modeling of multiprocessor cache miss rates.",
            "Trace cache sampling filter.",
            "The WaveScalar architecture.",
            "Concurrent programming without locks.",
            "Experience distributing objects in an SMMP OS.",
            "Rx: Treating bugs as allergies - a safe method to survive software failures.",
            "Gossip-based peer sampling.",
            "Minimizing expected energy consumption in real-time systems through dynamic voltage scaling.",
            "Memory scheduling for modern microprocessors.",
            "Labels and event processes in the Asbestos operating system."
        ]
    },
    {
        "name": "TOCS",
        "year": "2006",
        "info": "Volume 24, 2006",
        "count": 12,
        "papers": [
            "Cryptography as an operating system service: A case study.",
            "Performance analysis of TLS Web servers.",
            "The costs and limits of availability for replicated services.",
            "Inferring Internet denial-of-service activity.",
            "Locking under Pfair scheduling.",
            "On the performance of wide-area thin-client computing.",
            "The Liberty Simulation Environment: A deliberate approach to high-level system modeling.",
            "Energy-aware lossless data compression.",
            "Energy-efficient CPU scheduling for multimedia applications.",
            "Recovering device drivers.",
            "Speculative execution in a distributed file system.",
            "Using model checking to find serious file system errors."
        ]
    },
    {
        "name": "TOCS",
        "year": "2005",
        "info": "Volume 23, 2005",
        "count": 13,
        "papers": [
            "Editorial.",
            "The LOCKSS peer-to-peer digital preservation system.",
            "Backtracking intrusions.",
            "Improving the reliability of commodity operating systems.",
            "Comprehensive multiprocessor cache miss rate generation using multivariate models.",
            "Nonblocking memory management support for dynamic-sized data structures.",
            "Improved latency and accuracy for neural branch prediction.",
            "Gossip-based aggregation in large dynamic networks.",
            "The STAMPede approach to thread-level speculation.",
            "Shared memory computing on clusters with symmetric multiprocessors and system area networks.",
            "Quickly finding near-optimal storage designs.",
            "MIDDLE-R: Consistent database replication at the middleware level.",
            "The automatic improvement of locality in storage systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "2004",
        "info": "Volume 22, 2004",
        "count": 10,
        "papers": [
            "Stateful distributed interposition.",
            "Using certes to infer client response time at the web server.",
            "Parallel program performance prediction using deterministic task graph analysis.",
            "Managing battery lifetime with energy-aware adaptation.",
            "Coupling compiler-enabled and conventional memory accessing for energy efficiency.",
            "A general framework for prefetch scheduling in linked data structures and its application to multi-chain prefetching.",
            "Cluster communication protocols for parallel-programming systems.",
            "A study of source-level compiler algorithms for automatic construction of pre-execution code.",
            "Firmato: A novel firewall management toolkit.",
            "System support for pervasive applications."
        ]
    },
    {
        "name": "TOCS",
        "year": "2003",
        "info": "Volume 21, 2003",
        "count": 13,
        "papers": [
            "Run-time support for distributed sharing in safe languages.",
            "Run-time adaptation in river.",
            "Measuring thin-client performance using slow-motion benchmarking.",
            "A SMART scheduler for multimedia applications.",
            "Astrolabe: A robust and scalable technology for distributed system monitoring, management, and data mining.",
            "Size-based scheduling to improve web performance.",
            "Editorial.",
            "BASE: Using abstraction to improve fault tolerance.",
            "New directions in traffic measurement and accounting: Focusing on the elephants, ignoring the mice.",
            "An evaluation of speculative instruction execution on simultaneous multithreaded processors.",
            "Lightweight probabilistic broadcast.",
            "Balancing performance and flexibility with hardware support for network architectures.",
            "Call graph prefetching for database applications."
        ]
    },
    {
        "name": "TOCS",
        "year": "2002",
        "info": "Volume 20, 2002",
        "count": 12,
        "papers": [
            "Fast and secure distributed read-only file system.",
            "Interposed request routing for scalable network storage.",
            "Fast and flexible application-level networking on exokernel systems.",
            "The evolution of Coda.",
            "Measuring system normality.",
            "Let caches decay: reducing leakage energy via exploitation of cache generational behavior.",
            "Moshe: A group membership service for WANs.",
            "Design and evaluation of a conit-based continuous consistency model for replicated services.",
            "Secure program partitioning.",
            "COCA: A secure distributed online certification authority.",
            "Neural methods for dynamic branch prediction.",
            "Practical byzantine fault tolerance and proactive recovery."
        ]
    },
    {
        "name": "TOCS",
        "year": "2001",
        "info": "Volume 19, 2001",
        "count": 13,
        "papers": [
            "Accelerating shared virtual memory via general-purpose network interface support.",
            "Separating access control policy, enforcement, and functionality in extensible systems.",
            "Architectural and compiler support for effective instruction prefetching: a cooperative approach.",
            "Compiler-based I/O prefetching for out-of-core applications.",
            "Specifying and using a partitionable group communication service.",
            "Specialization tools and techniques for systematic optimization of system software.",
            "The effect of seance communication on multiprocessing systems.",
            "Implicit coscheduling: coordinated scheduling with implicit information in distributed systems.",
            "Design and evaluation of a wide-area event notification service.",
            "An Internet multicast system for the stock market.",
            "Runtime identification of cache conflict misses: The adaptive miss buffer.",
            "Scalable high-speed prefix matching.",
            "Minerva: An automated resource provisioning tool for large-scale storage systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "2000",
        "info": "Volume 18, 2000",
        "count": 12,
        "papers": [
            "A high-level abstraction of shared accesses.",
            "IO-Lite: a unified I/O buffering and caching system.",
            "Smart packets: applying active networks to network management.",
            "Value-based clock gating and operation packing: dynamic strategies for improving processor power and performance.",
            "Soft updates: a solution to the metadata update problem in file systems.",
            "Multigrain shared memory.",
            "Soft timers: efficient microsecond software timer support for network processing.",
            "Cellular disco: resource management using virtual clusters on shared-memory multiprocessors.",
            "The click modular router.",
            "Manageability, availability, and performance in porcupine: a highly scalable, cluster-based mail service.",
            "Java consistency: nonoperational characterizations for Java memory behavior.",
            "Hint-based cooperative caching."
        ]
    },
    {
        "name": "TOCS",
        "year": "1999",
        "info": "Volume 17, 1999",
        "count": 9,
        "papers": [
            "Fast Address Lookups Using Controlled Prefix Expansion.",
            "Bimodal Multicast.",
            "Eliminating Synchronization Overhead in Automatically Parallelized Programs Using Dynamic Feedback.",
            "RecPlay: A Fully Integrated Practical Record/Replay System.",
            "Garbage collection for a client-server persistent object store.",
            "Ace: a language for parallel programming with customizable protocols.",
            "An architecture for packet-striping protocols.",
            "Quantifying loop nest locality using SPEC'95 and the perfect benchmarks.",
            "Effective fine-grain synchronization for automatically parallelized programs using optimistic synchronization primitives."
        ]
    },
    {
        "name": "TOCS",
        "year": "1998",
        "info": "Volume 16, 1998",
        "count": 11,
        "papers": [
            "Performance Evaluation of the Orca Shared-Object System.",
            "Reconfiguration for Fault Tolerance Using Graph Grammars.",
            "Tolerating Latency in Multiprocessors Through Compiler-Inserted Prefetching.",
            "The Totem Multiple-Ring Ordering and Topology Maintenance Protocol.",
            "The Part-Time Parliament.",
            "Informing Memory Operations: Memory Performance Feedback Mechanisms and Their Applications.",
            "UFO: A Personal Global File System Based on User-Level Extensions to the Operating System.",
            "Using Value Prediction to Increase the Power of Speculative Execution Hardware.",
            "A Quantitative Comparison of Parallel Computation Models.",
            "Coyote: A System for Constructing Fine-Grain Configurable Communication Services.",
            "Decay-Usage Scheduling in Multiprocessors."
        ]
    },
    {
        "name": "TOCS",
        "year": "1997",
        "info": "Volume 15, 1997",
        "count": 14,
        "papers": [
            "Scheduler-Conscious Synchronization.",
            "Disk-Directed I/O for MIMD Multiprocessors.",
            "A High-Speed Network Interface for Distributed-Memory Systems: Architecture and Applications.",
            "Device Reservation in Audio/Video Editing Systems.",
            "Real-Time Computing with Lock-Free Shared Objects.",
            "Optimally Adaptive, Minimum-Distance, Circuit-Switched Routing in Hypercubes.",
            "Strong Loss Tolerance of Electronic Coin Systems.",
            "Eliminating Receive Livelock in an Interrupt-Driven Kemel.",
            "Exploiting Process Lifetime Distributions for Dynamic Load Balancing.",
            "HFS: A Performance-Oriented Flexible File System Based on Building-Block Compositions.",
            "Converting Thread-Level Parallelism to Instruction-Level Parallelism via Simultaneous Multithreading.",
            "Continuous Profiling: Where Have All the Cycles Gone?",
            "Eraser: A Dynamic Data Race Detector for Multithreaded Programs.",
            "Disco: Running Commodity Operating Systems on Scalable Multiprocessors."
        ]
    },
    {
        "name": "TOCS",
        "year": "1996",
        "info": "Volume 14, 1996",
        "count": 13,
        "papers": [
            "The Measured Performance of Personal Computer Operating Systems.",
            "Serverless Network File Systems.",
            "Hypervisor-Based Fault Tolerance.",
            "The HP AutoRAID Hierarchical Storage System.",
            "Portable Run-Time Support for Dynamic Object-Oriented Parallel Processing.",
            "Customized Information Extraction as a Basis for Resource Discovery.",
            "An Empirical Styudy of a Wide-Area Distributed File System.",
            "The Vesta Parallel File System.",
            "Fault-Tolerance in Air Traffic Control Systems.",
            "Recovery in the Calypso File System.",
            "Implementation and Performance of Integrated Application-Controlled File Caching, Prefetching, and Disk Scheduling.",
            "Analysis of Benchmark Characteristics and Benchmark Performance Prediction.",
            "Diffracting Trees."
        ]
    },
    {
        "name": "TOCS",
        "year": "1995",
        "info": "Volume 13, 1995",
        "count": 12,
        "papers": [
            "Debugging Heterogeneous Distributed Systems Using Event-Based Models of Behavior.",
            "Set-Associative Cache Simulation Using Generalized Binomial Trees.",
            "Effective Cache Prefetching on Bus-Based Multiprocessors.",
            "Adaptive Block Rearrangement.",
            "A Simple and Efficient Bus Management Scheme that Supports Continuous Streams.",
            "Implications of Hierarchical N-Body Methods for Multiprocessor Architectures.",
            "Techniques for Reducing Consistency-Related Communication in Distributed Shared-Memory Systems.",
            "Memory System Performance of Programs with Intensive Heap Allocation.",
            "The Zebra Striped Network File System.",
            "The Totem Single-Ring Ordering and Membership Protocol.",
            "Scalable Concurrent Counting.",
            "Generating Test Cases for Real-Time Systems from Logic Specifications."
        ]
    },
    {
        "name": "TOCS",
        "year": "1994",
        "info": "Volume 12, 1994",
        "count": 14,
        "papers": [
            "Editorial.",
            "Authentication in the Taos Operating System.",
            "Lightweight Recoverable Virtual Memory.",
            "File-System Development with Stackable Layers.",
            "Sequential Consistency versus Linearizability.",
            "A Coherent Distributed File Cache with Directory Write-Behind.",
            "Lightweight Recoverable Virtual Memory - Corrigendum.",
            "Preface to the Special Issues on Computer Architecture.",
            "Design Tradeoffs for Software-Managed TLBs.",
            "Parity-Logging Disk Arrays.",
            "The TickerTAIP Parallel RAID Architecture.",
            "Sharing and Protection in a Single-Address-Space Operating System.",
            "A New Approach to I/O Performance Evaluation - Self-Scaling I/O Benchmarks, Predicted I/O Performance.",
            "A Security Architecture for Fault-Toerant Systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "1993",
        "info": "Volume 11, 1993",
        "count": 15,
        "papers": [
            "Chores: Enhanced Run-Time Support for Shared-Memory Parallel Computing.",
            "CHAOS-arc: Kernel Support for Multiweight Objects, Invocations, and Atomicity in Real-Time Multiprocessor Applications.",
            "FLIP: An Internetwork Protocol for Supporting Distributed Systems.",
            "Editorial.",
            "Design and Verification of the Rollback Chip Using HOP: A Case Study of Formal Methods Applied to Hardware design.",
            "A Dynamic Processor Allocation Policy for Multiprogrammed Shared-memory Multiprocessors.",
            "Limits to Low-Latency Communication on High-Speed Networks.",
            "Distributed Timestamp Generation in Planar Lattice Networks.",
            "Metascheduling for Continuous Media.",
            "Waiting Algorithms for Synchronization in Large-Scale Multiprocessors.",
            "Preface to the Special Issue on Architectural Support for Programming Languages and Systems.",
            "Cooperative Shared Memory: Software and Hardware Support for Scalable Multiprocesors.",
            "High Speed Switch Scheduling for Local Area Networks.",
            "Access Normalization: Loop Restructuring for NUMA Compilers.",
            "Sentinel Scheduling for VLIW and Superscalar Processors."
        ]
    },
    {
        "name": "TOCS",
        "year": "1992",
        "info": "Volume 10, 1992",
        "count": 14,
        "papers": [
            "Preface to the Special Issue on Operating System Principles.",
            "Disconnected Operation in the Coda File System.",
            "The Design and Implementation of a Log-Structured File System.",
            "Scheduler Activations: Effective Kernel Support for the User-Level Management of Parallelism.",
            "Network Locality at the Scale of Processes.",
            "A Dynamic Network Architecture.",
            "Delivery of Time-Critical Message Using a Multiple Copy Approach.",
            "An Effective Synchronization Network for Hot-Spot Accesses.",
            "Adaptable Concurrency Control for Atomic Data Types.",
            "A Logic for Reasoning About Security.",
            "Authentication in Distributed Systems: Theory and Practice.",
            "A File System for Continuous Media.",
            "Page Placement Algorithms for Large Real-Indexed Caches.",
            "Providing High Availability Using Lazy Replication."
        ]
    },
    {
        "name": "TOCS",
        "year": "1991",
        "info": "Volume 9, 1991",
        "count": 17,
        "papers": [
            "An Efficient and Fault-Tolerant Solution for Distributed Mutual Exclusion.",
            "Algorithms for Scalable Synchronization on Shared-Memory Multiprocessors.",
            "Architectural Support for Reduced Register Saving / Restoring in Single-Window Register Files.",
            "Guest Editorial - Special Section on Communication Architectures and Protocols.",
            "VirtualClock: A New Traffic Control Algorithm for Packet-Switched Networks.",
            "Efficient At-Most-Once Messages Based on Synchronized Clocks.",
            "Dynamic Adaption of Real-Time Software.",
            "User-Level Interprocess Communication for Shared Memory Multiprocessors.",
            "Preface to the Special Section on Measurement and Modeling of Computer Systems.",
            "Algorithms for Unboundedly Parallel Simulations.",
            "Efficient Trace-Driven Simulation Methods for Cache Performance Analysis.",
            "Ordered and Reliable Multicast Communication.",
            "Lightweigt Causal and Atomic Group Multicast.",
            "Experimental Comparison of Memory Management Policies for NUMA Multiprocessors.",
            "Improving Round-Trip Time Estimates in Reliable Transport Protocols.",
            "Reliable Broadcast Algorithms for HARTS.",
            "Multidimensional Voting."
        ]
    },
    {
        "name": "TOCS",
        "year": "1990",
        "info": "Volume 8, 1990",
        "count": 14,
        "papers": [
            "Performance of Firefly RPC.",
            "A Logic of Authentication.",
            "Lightweight Remote Procedure Call.",
            "A System for Computer Music Performance.",
            "Multicast Routing in Datagram Internetworks and Extended LANs.",
            "\"Topologies\" - Distributed Objects on Multicomputers.",
            "A Binary Feedback Scheme for Congestion Avoidance in Computer Networks.",
            "A Formal Protection Model of Security in Centralized, Parallel, and Distributed Systems.",
            "Disk Arm Movement in Anticipation of Future Requests.",
            "The Effects of Processor Architecture on Instruction Memory Traffic.",
            "Deriving Protocol Specifications from Service Specifications Including Parameters.",
            "Tolerating Failures of Continuous-Valued Sensors.",
            "Concurrent Reading and Writing of Clocks.",
            "High-Level Language Debugging for Concurrent Programs."
        ]
    },
    {
        "name": "TOCS",
        "year": "1989",
        "info": "Volume 7, 1989",
        "count": 13,
        "papers": [
            "Fault Tolerance Under UNIX.",
            "Reliable Scheduling in a TMR Database System.",
            "A Tree-Based Algorithm for Distributed Mutual Exclusion.",
            "Efficient (Stack) Algorithms for Analysis of Write-Back and Sector Machines.",
            "High-Speed Implementations of Rule-Based Systems.",
            "Decentralizing a Global Naming Service for Improved Performance and Fault Tolerance.",
            "An Analytical Cache Model.",
            "Preserving and Using Context Information in Interprocess Communication.",
            "Integrating Security in a Large Distributed System.",
            "Verified Data Transfer Protocols with Variable Flow Control.",
            "Memory Coherence in Shared Virtual Memory Systems.",
            "Using Histories to Implement Atomic Objects.",
            "Increasing Availability Under Mutual Exclusion Constraints with Dynamic Vote Reassignment."
        ]
    },
    {
        "name": "TOCS",
        "year": "1988",
        "info": "Volume 6, 1988",
        "count": 17,
        "papers": [
            "Preface: Special Issue on Operating System Principles.",
            "Managing Stored Voice in the Etherphone System.",
            "801 Storage: Architecture and Programming.",
            "Scale and Performance in a Distributed File System.",
            "Recovery Management in QuickSilver.",
            "Fine-Grained Mobility in the Emerald System.",
            "Caching in the Sprite Network File System.",
            "A Relational Approach to Monitoring Complex Systems.",
            "The NTree: A Two Dimension Partial Order for Protection Groups.",
            "Measurement and Evaluation of the MIPS Architecture and Processor.",
            "Remote Pipes and Procedures for Efficient Distributed Communication.",
            "Stating Security Requirements with Tolerable Sets.",
            "Performance Effects of Architectural Complexity in the Intel 432.",
            "The Profile Naming Service.",
            "Experiments in SR with Different Upcall Program Structures.",
            "Cache Performance of Operating System and Multiprogramming Workloads.",
            "A Digital Multisignature Schema Using Bijective Public-Key Cryptosystems."
        ]
    },
    {
        "name": "TOCS",
        "year": "1987",
        "info": "Volume 5, 1987",
        "count": 17,
        "papers": [
            "A Fast Mutual Exclusion Algorithm.",
            "UIO: A Uniform I/O System Interface for Distributed Systems.",
            "Reliable Communication in the Presence of Failures.",
            "A Continuum of Disk Scheduling Algorithms.",
            "Gaining Efficiency in Transport Services by Appropriate Design and Implementation Choices.",
            "Monitoring Distributed Systems.",
            "The Development and Proof of a Formal Specification for a Multilevel Secure System.",
            "High-Performance Operating System Primitives for Robotics and Real-Time Control Systems.",
            "Response Times in Level-Structured Systems.",
            "Concurrency versus Availability: Atomic Mechanisms for Replicated Data.",
            "An Optimized Contention Protocol for Broadband Networks.",
            "The Information Structure of Distributed Mutual Exclusion Algorithms.",
            "Footprints in the Cache.",
            "A Programmable Interface Language for Heterogeneous Distributed Systems.",
            "Disk File Allocation Based on the Buddy System.",
            "Public Protection of Software.",
            "On the Reliability of Consensus-Based Fault-Tolerant Distributed Compting Systems."
        ]
    },
    {
        "name": "TOCS",
        "year": "1986",
        "info": "Volume 4, 1986",
        "count": 16,
        "papers": [
            "Independent General Principles for Constructing Responsive Software Systems.",
            "A Quorum-Consensus Replication Method for Abstract Data Types.",
            "Low Cost Management of Replicated Data in Fault-Tolerant Distributed Systems.",
            "Effects of Job Loading Policies for Multiprogramming Systems in Processing a Job Stream.",
            "Preface to Special Issue on Operating System Princiles.",
            "The S/Net's Linda Kernel.",
            "VAXclusters: A Closely-Coupled Distributed System.",
            "The Integration of Virtual Memory Management and Interprocess Communication in Accent.",
            "A Tree-Structured Mean Value Analysis Algorithm.",
            "The Vulnerabilty of Vote Assignments.",
            "Measurement and Modeling of Computer Reliability as Affected by System Activity.",
            "File Access Performance of Diskless Workstations.",
            "Cache Coherence Protocols: Evaluation Using a Multiprocessor Simulation Model.",
            "Conversation-Based Mail.",
            "The Distributed Deadlock Detection Algorithm.",
            "The Performance of Multiversion Concurrency Control Algorithms."
        ]
    },
    {
        "name": "TOCS",
        "year": "1985",
        "info": "Volume 3, 1985",
        "count": 15,
        "papers": [
            "Secure Communication Using Remote Procedure Calls.",
            "Determining the Last Process to Fail.",
            "Performance of the VAX-11/780 Translation Buffer: Simulation and Measurement.",
            "Distributed Snapshots: Determining Global States of Distributed Systems.",
            "Distributed Process Groups in the V Kernel.",
            "On the Power of Cascade Ciphers.",
            "Performance Analysis of Redundant-Path Networks for Multiprocessor Systems.",
            "A Square Root N Algorithm for Mutual Exclusion in Decentralized Systems.",
            "Disk Cache-Miss Ratio Analysis and Design Considerations.",
            "Optimistic Recovery in Distributed Systems.",
            "Error Bounds for Performance Prediction in Queuing Networks.",
            "The Alpine File System.",
            "A Recursive Algorithm for Binary Multiplication and Its Implementation.",
            "A Discipline for Constructing Multiphase Communication Protocols.",
            "A Distributed Mutual Exclusion Algorithm."
        ]
    },
    {
        "name": "TOCS",
        "year": "1984",
        "info": "Volume 2, 1984",
        "count": 18,
        "papers": [
            "Experience with Grapevine: The Growth of a Distributed System.",
            "Computation and Communication in R*: A Distributed Database Manager.",
            "Implementing Remote Procedure Calls.",
            "A Computer Communication Technique Using Content-Induced Transaction Overlap.",
            "Optimality of a Central Processor Scheduling Policy for Processing a Job Stream.",
            "A Class of Generalized Stochastic Petri Nets for the Performance Evaluation of Multiprocessor Systems.",
            "Performance Analysis of Checkpointing Strategies.",
            "Byzantine Generals in Action: Implementing Fail-Stop Processors.",
            "Static Grouping of Small Objects to Enhance Performance of a Paged Virtual Memory.",
            "A Fast File System for UNIX.",
            "A Security Model for Military Message Systems.",
            "Synchronizing Shared Abstract Types.",
            "Reliable Broadcast Protocols.",
            "End-To-End Arguments in System Design.",
            "Decoupled Access/Execute Computer Architectures.",
            "The String-to-String Correction Problem with Block Moves.",
            "Ordering Subscribers on Cable Networks.",
            "The MVA Priority Approximation."
        ]
    },
    {
        "name": "TOCS",
        "year": "1983",
        "info": "Volume 1, 1983",
        "count": 19,
        "papers": [
            "Implementing Atomic Actions on Decentralized Data.",
            "Cache Performance in the VAX-11/780.",
            "On the Generation of Cryptographically Strong Pseudorandom Sequences.",
            "Interprocess Communication and Processor Dispatching on the Intel 432.",
            "Computational Algorithms for State-Dependent Queueing Networks.",
            "Performance Bound Hierarchies for Queueing Networks.",
            "The Aggregate Server Method for Analyzing Serialization Delays in Computer System.",
            "Distributed Deadlock Detection.",
            "A VLSI Layout for a Pipelined Dadda Multiplier.",
            "How to Exchange (Secret) Keys.",
            "PACS: A Parallel Microprocessor Array for Scientific Calculations.",
            "Fail-Stop Processors: An Approach to Designing Fault-Tolerant Computing Systems.",
            "Cryptographic Solution to a Problem of Access Control in a Hierarchy.",
            "A Key Distribution Protocol Using Event Markers.",
            "Shared Resource Matrix Methodology: An Approach to Identifying Storage and Timing Channels.",
            "Transient Behavior of Cache Memories.",
            "Optimal Routing in Closed Queuing Networks.",
            "Mechanisms that Enforce Bounds on Packet Lifetimes.",
            "An HDLC Protocol Specification and Its Verification Using Image Protocols."
        ]
    }
]