[
    {
        "name": "TODAES",
        "year": "2022",
        "info": "Volume 27, 2022",
        "count": 19,
        "papers": [
            "A Comprehensive Survey of Attacks without Physical Access Targeting Hardware Vulnerabilities in IoT/IIoT Devices, and Their Detection Mechanisms.",
            "A Novel Hybrid Cache Coherence with Global Snooping for Many-core Architectures.",
            "An Efficient Execution Framework of Two-Part Execution Scenario Analysis.",
            "A Design Methodology for Energy-Aware Processing in Unmanned Aerial Vehicles.",
            "Improving LDPC Decoding Performance for 3D TLC NAND Flash by LLR Optimization Scheme for Hard and Soft Decision.",
            "A Native SPICE Implementation of Memristor Models for Simulation of Neuromorphic Analog Signal Processing Circuits.",
            "Demand-Driven Multi-Target Sample Preparation on Resource-Constrained Digital Microfluidic Biochips.",
            "Fault Injection Attack Emulation Framework for Early Evaluation of IC Designs.",
            "Synthesizing Brain-network-inspired Interconnections for Large-scale Network-on-chips.",
            "Introduction to the Special Issue on Approximate Systems.",
            "Towards Fine-Grained Online Adaptive Approximation Control for Dense SLAM on Embedded GPUs.",
            "ParTBC: Faster Estimation of Top-k Betweenness Centrality Vertices on GPU.",
            "An Adaptive Application Framework with Customizable Quality Metrics.",
            "Leveraging Automatic High-Level Synthesis Resource Sharing to Maximize Dynamical Voltage Overscaling with Error Control.",
            "Double-Shift: A Low-Power DNN Weights Storage and Access Framework based on Approximate Decomposition and Quantization.",
            "Plasticine: A Cross-layer Approximation Methodology for Multi-kernel Applications through Minimally Biased, High-throughput, and Energy-efficient SIMD Soft Multiplier-divider.",
            "Distance-aware Approximate Nanophotonic Interconnect.",
            "MeF-RAM: A New Non-Volatile Cache Memory Based on Magneto-Electric FET.",
            "A Compact High-Dimensional Yield Analysis Method using Low-Rank Tensor Approximation."
        ]
    },
    {
        "name": "TODAES",
        "year": "2021",
        "info": "Volume 26, 2021",
        "count": 50,
        "papers": [
            "Modular Neural Networks for Low-Power Image Classification on Embedded Devices.",
            "FaultDroid: An Algorithmic Approach for Fault-Induced Information Leakage Analysis.",
            "Mitigating Negative Impacts of Read Disturb in SSDs.",
            "Ising-FPGA: A Spintronics-based Reconfigurable Ising Model Solver.",
            "TransNet: Minimally Supervised Deep Transfer Learning for Dynamic Adaptation of Wearable Systems.",
            "High-Level Synthesis of Key-Obfuscated RTL IP with Design Lockout and Camouflaging.",
            "Robust Multi-Target Sample Preparation on MEDA Biochips Obviating Waste Production.",
            "A Deterministic-Path Routing Algorithm for Tolerating Many Faults on Very-Large-Scale Network-on-Chip.",
            "SmartDR: Algorithms and Techniques for Fast Detailed Routing with Good Design Rule Handling.",
            "Efficient Parasitic-aware gm/ID-based Hybrid Sizing Methodology for Analog and RF Integrated Circuits.",
            "Core Placement Optimization for Multi-chip Many-core Neural Network Systems with Reinforcement Learning.",
            "Leakage-Aware Dynamic Thermal Management of 3D Memories.",
            "Performance-Driven Post-Processing of Control Loop Execution Schedules.",
            "Thermal Management for FPGA Nodes in HPC Systems.",
            "A Robust Modulus-Based Matrix Splitting Iteration Method for Mixed-Cell-Height Circuit Legalization.",
            "HeM3D: Heterogeneous Manycore Architecture Based on Monolithic 3D Vertical Integration.",
            "COPE: Reducing Cache Pollution and Network Contention by Inter-tile Coordinated Prefetching in NoC-based MPSoCs.",
            "Multi-objective Optimization of Mapping Dataflow Applications to MPSoCs Using a Hybrid Evaluation Combining Analytic Models and Measurements.",
            "Logic Diagnosis with Hybrid Fail Data.",
            "Fault-based Built-in Self-test and Evaluation of Phase Locked Loops.",
            "Approximate Learning and Fault-Tolerant Mapping for Energy-Efficient Neuromorphic Systems.",
            "MaxSense: Side-channel Sensitivity Maximization for Trojan Detection Using Statistical Test Patterns.",
            "Covering Test Holes of Functional Broadside Tests.",
            "Machine Learning for Statistical Modeling: The Case of Perpendicular Spin-Transfer-Torque Random Access Memory.",
            "Equivalent Faults under Launch-on-Shift (LOS) Tests with Equal Primary Input Vectors.",
            "Directed Test Generation for Activation of Security Assertions in RTL Models.",
            "Efficient One-pass Synthesis for Digital Microfluidic Biochips.",
            "TAAL: Tampering Attack on Any Key-based Logic Locked Circuits.",
            "Security Assessment of Dynamically Obfuscated Scan Chain Against Oracle-guided Attacks.",
            "Design Space Optimization of Shared Memory Architecture in Accelerator-rich Systems.",
            "Design Automation for Tree-based Nearest Neighborhood-aware Placement of High-speed Cellular Automata on FPGA with Scan Path Insertion.",
            "Security Threat Analyses and Attack Models for Approximate Computing Systems: From Hardware and Micro-architecture Perspectives.",
            "QuadSeal: Quadruple Balancing to Mitigate Power Analysis Attacks with Variability Effects and Electromagnetic Fault Injection Attacks.",
            "A Dynamic Huffman Coding Method for Reliable TLC NAND Flash Memory.",
            "Dataflow Model-based Software Synthesis Framework for Parallel and Distributed Embedded Systems.",
            "Design Flow and Methodology for Dynamic and Static Energy-constrained Scheduling Framework in Heterogeneous Multicore Embedded Devices.",
            "Pseudo-3D Physical Design Flow for Monolithic 3D ICs: Comparisons and Enhancements.",
            "A Module-Linking Graph Assisted Hybrid Optimization Framework for Custom Analog and Mixed-Signal Circuit Parameter Synthesis.",
            "FastCFI: Real-time Control-Flow Integrity Using FPGA without Code Instrumentation.",
            "Machine Learning for Electronic Design Automation: A Survey.",
            "A Conditionally Chaotic Physically Unclonable Function Design Framework with High Reliability.",
            "Placement of Digital Microfluidic Biochips via a New Evolutionary Algorithm.",
            "Voltage-Based Covert Channels Using FPGAs.",
            "FTT-NAS: Discovering Fault-tolerant Convolutional Neural Architecture.",
            "A Runtime Reconfigurable Design of Compute-in-Memory-Based Hardware Accelerator for Deep Learning Inference.",
            "A Framework for Validation of Synthesized MicroElectrode Dot Array Actuations for Digital Microfluidic Biochips.",
            "A Variation-aware Hold Time Fixing Methodology for Single Flux Quantum Logic Circuits.",
            "High-throughput Near-Memory Processing on CNNs with 3D HBM-like Memory.",
            "An Energy-Efficient Inference Method in Convolutional Neural Networks Based on Dynamic Adjustment of the Pruning Level.",
            "A Delay-Adjustable, Self-Testable Flip-Flop for Soft-Error Tolerability and Delay-Fault Testability."
        ]
    },
    {
        "name": "TODAES",
        "year": "2020",
        "info": "Volume 25, 2020",
        "count": 56,
        "papers": [
            "Security-aware Routing and Scheduling for Control Applications on Ethernet TSN Networks.",
            "Automatic Stage-form Circuit Reduction for Multistage Opamp Design Equation Generation.",
            "An Implication-based Test Scheme for Both Diagnosis and Concurrent Error Detection Applications.",
            "Hidden in Plaintext: An Obfuscation-based Countermeasure against FPGA Bitstream Tampering Attacks.",
            "Bio-chemical Assay Locking to Thwart Bio-IP Theft.",
            "Hardware Trojan Mitigation in Pipelined MPSoCs.",
            "Analog/RF Post-silicon Tuning via Bayesian Optimization.",
            "Memristive Crossbar Mapping for Neuromorphic Computing Systems on 3D IC.",
            "LBNoC: Design of Low-latency Router Architecture with Lookahead Bypass for Network-on-Chip Using FPGA.",
            "Harnessing the Granularity of Micro-Electrode-Dot-Array Architectures for Optimizing Droplet Routing in Biochips.",
            "Energy-aware Scheduling of Task Graphs with Imprecise Computations and End-to-end Deadlines.",
            "Hierarchical Ensemble Reduction and Learning for Resource-constrained Computing.",
            "Making Aging Useful by Recycling Aging-induced Clock Skew.",
            "Search-space Decomposition for System-level Design Space Exploration of Embedded Systems.",
            "Lithography Hotspot Detection with FFT-based Feature Extraction and Imbalanced Learning Rate.",
            "A Theoretical Foundation for Timing Synchronous Systems Using Asynchronous Structures.",
            "Secure Assay Execution on MEDA Biochips to Thwart Attacks Using Real-Time Sensing.",
            "Target Faults for Test Compaction Based on Multicycle Tests.",
            "Tunable FPGA Bitstream Obfuscation with Boolean Satisfiability Attack Countermeasure.",
            "How Secure Is Split Manufacturing in Preventing Hardware Trojan?",
            "Lagrangian Relaxation-Based Time-Division Multiplexing Optimization for Multi-FPGA Systems.",
            "Single-Layer Obstacle-Aware Substrate Routing via Iterative Pin Reassignment and Wire Assignment.",
            "On Fundamental Principles for Thermal-Aware Design on Periodic Real-Time Multi-Core Systems.",
            "Reuse Distance-based Victim Cache for Effective Utilisation of Hybrid Main Memory System.",
            "Architectural Design of Flow-Based Microfluidic Biochips for Multi-Target Dilution of Biochemical Fluids.",
            "SCRIPT: A CAD Framework for Power Side-channel Vulnerability Assessment Using Information Flow Tracking and Pattern Generation.",
            "Security of Microfluidic Biochip: Practical Attacks and Countermeasures.",
            "An Energy-aware Online Learning Framework for Resource Management in Heterogeneous Platforms.",
            "Algorithmic Fault Detection for RRAM-based Matrix Operations.",
            "Generating Representative Test Sequences from Real Workload for Minimizing DRAM Verification Overhead.",
            "A Hierarchical HVAC Control Scheme for Energy-aware Smart Building Automation.",
            "Machine Learning Assisted PUF Calibration for Trustworthy Proof of Sensor Data in IoT.",
            "Runtime Identification of Hardware Trojans by Feature Analysis on Gate-Level Unstructured Data and Anomaly Detection.",
            "Strong Logic Obfuscation with Low Overhead against IC Reverse Engineering Attacks.",
            "Soft-HaT: Software-Based Silicon Reprogramming for Hardware Trojan Implementation.",
            "Introduction to the Special Issue on Machine Learning for CAD.",
            "Machine Learning for Congestion Management and Routability Prediction within FPGA Placement.",
            "Fine-grained Adaptive Testing Based on Quality Prediction.",
            "Predicting Memory Compiler Performance Outputs Using Feed-forward Neural Networks.",
            "PREASC: Automatic Portion Resilience Evaluation for Approximating SystemC-based Designs Using Regression Analysis Techniques.",
            "NeuPow: A CAD Methodology for High-level Power Estimation Based on Machine Learning.",
            "Machine Learning Approach for Fast Electromigration Aware Aging Prediction in Incremental Design of Large Scale On-chip Power Grid Network.",
            "Towards Smarter Diagnosis: A Learning-based Diagnostic Outcome Previewer.",
            "Machine Learning Approaches for Efficient Design Space Exploration of Application-Specific NoCs.",
            "Multi-Fidelity Surrogate-Based Optimization for Electromagnetic Simulation Acceleration.",
            "Improving FPGA-Based Logic Emulation Systems through Machine Learning.",
            "Machine Learning-based Defect Coverage Boosting of Analog Circuits under Measurement Variations.",
            "Adversarial Perturbation Attacks on ML-based CAD: A Case Study on CNN-based Lithographic Hotspot Detection.",
            "Editorial: A Message from the New Editor-in-Chief.",
            "LDE-aware Analog Layout Migration with OPC-inclusive Routing.",
            "MNFTL: An Efficient Flash Translation Layer for MLC NAND Flash Memory.",
            "A Locality Optimizer for Loop-dominated Applications Based on Reuse Distance Analysis.",
            "Energy-Efficient GPU L2 Cache Design Using Instruction-Level Data Locality Similarity.",
            "Reconfigurable Network-on-Chip Security Architecture.",
            "Interval Arithmetic and Self-Similarity Based RTL Input Vector Control for Datapath Leakage Minimization.",
            "Wire Load Oriented Analog Routing with Matching Constraints."
        ]
    },
    {
        "name": "TODAES",
        "year": "2019",
        "info": "Volume 24, 2019",
        "count": 69,
        "papers": [
            "Quality-Enhanced OLED Power Savings on Mobile Devices.",
            "Switching Predictive Control Using Reconfigurable State-Based Model.",
            "Knowledge- and Simulation-Based Synthesis of Area-Efficient Passive Loop Filter Incremental Zoom-ADC for Built-In Self-Test Applications.",
            "SystemC-AMS Thermal Modeling for the Co-simulation of Functional and Extra-Functional Properties.",
            "Harvesting Row-Buffer Hits via Orchestrated Last-Level Cache and DRAM Scheduling for Heterogeneous Multicore Systems.",
            "Optimization of Fault-Tolerant Mixed-Criticality Multi-Core Systems with Enhanced WCRT Analysis.",
            "Boundary-Functional Broadside and Skewed-Load Tests.",
            "SynergyFlow: An Elastic Accelerator Architecture Supporting Batch Processing of Large-Scale Deep Neural Networks.",
            "Automatic Optimization of the VLAN Partitioning in Automotive Communication Networks.",
            "Instruction-Level Abstraction (ILA): A Uniform Specification for System-on-Chip (SoC) Verification.",
            "Remote Attestation via Self-Measurement.",
            "Efficiently Managing the Impact of Hardware Variability on GPUs' Streaming Processors.",
            "Three-dimensional Floorplan Representations by Using Corner Links and Partial Order.",
            "Probabilistic Evaluation of Hardware Security Vulnerabilities.",
            "A Hardware-Efficient Block Matching Algorithm and Its Hardware Design for Variable Block Size Motion Estimation in Ultra-High-Definition Video Encoding.",
            "Reducing Writebacks Through In-Cache Displacement.",
            "Performance-Aware Test Scheduling for Diagnosing Coexistent Channel Faults in Topology-Agnostic Networks-on-Chip.",
            "Writeback-Aware LLC Management for PCM-Based Main Memory Systems.",
            "Reconfigurable Battery Systems: A Survey on Hardware Architecture and Research Challenges.",
            "Formal Modeling and Verification of a Victim DRAM Cache.",
            "Design Automation for Dilution of a Fluid Using Programmable Microfluidic Device-Based Biochips.",
            "Integrated Latch Placement and Cloning for Timing Optimization.",
            "Incomplete Tests for Undetectable Faults to Improve Test Set Quality.",
            "Integrated Approach of Airgap Insertion for Circuit Timing Optimization.",
            "A Novel Resistive Memory-based Process-in-memory Architecture for Efficient Logic and Add Operations.",
            "Enhancing Speculative Execution With Selective Approximate Computing.",
            "A Cross-level Verification Methodology for Digital IPs Augmented with Embedded Timing Monitors.",
            "Thermal-aware 3D Symmetrical Buffered Clock Tree Synthesis.",
            "Compilation of Dataflow Applications for Multi-Cores using Adaptive Multi-Objective Optimization.",
            "Augmenting Operating Systems with OpenCL Accelerators.",
            "Electronics Supply Chain Integrity Enabled by Blockchain.",
            "Comparing Platform-aware Control Design Flows for Composable and Predictable TDM-based Execution Platforms.",
            "Data-driven Anomaly Detection with Timing Features for Embedded Systems.",
            "SSA-AC: Static Significance Analysis for Approximate Computing.",
            "An Optimized Cost Flow Algorithm to Spread Cells in Detailed Placement.",
            "Enabling IC Traceability via Blockchain Pegged to Embedded PUF.",
            "DCW: A Reactive and Predictable Programming Framework for LET-Based Distributed Real-Time Systems.",
            "CAD-Base: An Attack Vector into the Electronics Supply Chain.",
            "Share-n-Learn: A Framework for Sharing Activity Recognition Models in Wearable Systems With Context-Varying Sensors.",
            "Analysis of Dissipative Losses in Modular Reconfigurable Energy Storage Systems Using SystemC TLM and SystemC-AMS.",
            "Compiler-Assisted and Profiling-Based Analysis for Fast and Efficient STT-MRAM On-Chip Cache Design.",
            "Layout Resynthesis by Applying Design-for-manufacturability Guidelines to Avoid Low-coverage Areas of a Cell-based Design.",
            "MEMS-IC Robustness Optimization Considering Electrical and Mechanical Design and Process Parameters.",
            "On Chip Reconfigurable CMOS Analog Circuit Design and Automation Against Aging Phenomena: Sense and React.",
            "Adaptive Test for RF/Analog Circuit Using Higher Order Correlations among Measurements.",
            "Cross-point Resistive Memory: Nonideal Properties and Solutions.",
            "Fault Tolerance Technique Offlining Faulty Blocks by Heap Memory Management.",
            "A Novel Rule Mapping on TCAM for Power Efficient Packet Classification.",
            "Improving Test and Diagnosis Efficiency through Ensemble Reduction and Learning.",
            "Revealing Cluster Hierarchy in Gate-level ICs Using Block Diagrams and Cluster Estimates of Circuit Embeddings.",
            "Stress-Induced Performance Shifts in 3D DRAMs.",
            "Exploring the Role of Large Centralised Caches in Thermal Efficient Chip Design.",
            "Reducing DRAM Refresh Rate Using Retention Time Aware Universal Hashing Redundancy Repair.",
            "Time-Multiplexed FPGA Overlay Architectures: A Survey.",
            "Energy Efficient Chip-to-Chip Wireless Interconnection for Heterogeneous Architectures.",
            "Approximate Data Reuse-based Accelerator Design for Embedded Processor.",
            "Investigating the Impact of Image Content on the Energy Efficiency of Hardware-accelerated Digital Spatial Filters.",
            "Modeling and Simulation of Dynamic Applications Using Scenario-Aware Dataflow.",
            "Energy-Efficient and Quality-Assured Approximate Computing Framework Using a Co-Training Method.",
            "Efficient Cache Reconfiguration Using Machine Learning in NoC-Based Many-Core CMPs.",
            "Cut Optimization for Redundant Via Insertion in Self-Aligned Double Patterning.",
            "Impact of Electrostatic Coupling on Monolithic 3D-enabled Network on Chip.",
            "JAMS-SG: A Framework for Jitter-Aware Message Scheduling for Time-Triggered Automotive Networks.",
            "Smart-Hop Arbitration Request Propagation: Avoiding Quadratic Arbitration Complexity and False Negatives in SMART NoCs.",
            "IP Protection and Supply Chain Security through Logic Obfuscation: A Systematic Overview.",
            "Real-Time Scheduling of DAG Tasks with Arbitrary Deadlines.",
            "Optimization of Threshold Logic Networks with Node Merging and Wire Replacement.",
            "Two-sided Net Untangling with Internal Detours for Single-layer Bus Routing.",
            "Runtime Stress Estimation for Three-dimensional IC Reliability Management Using Artificial Neural Network."
        ]
    },
    {
        "name": "TODAES",
        "year": "2017",
        "info": "Volume 23, 2017/2018",
        "count": 82,
        "papers": [
            "Optimization and Quality Estimation of Circuit Design via Random Region Covering Method.",
            "A Comprehensive BIST Solution for Polar Transceivers Using On-Chip Resources.",
            "Electric Vehicle Optimized Charge and Drive Management.",
            "Word- and Partition-Level Write Variation Reduction for Improving Non-Volatile Cache Lifetime.",
            "Optimal Don't Care Filling for Minimizing Peak Toggles During At-Speed Stuck-At Testing.",
            "Two-Stage Layout Decomposition for Hybrid E-Beam and Triple Patterning Lithography.",
            "VFI-Based Power Management to Enhance the Lifetime of High-Performance 3D NoCs.",
            "A Novel Range Matching Architecture for Packet Classification Without Rule Expansion.",
            "A Hierarchical Technique for Statistical Path Selection and Criticality Computation.",
            "Architectural Supports to Protect OS Kernels from Code-Injection Attacks and Their Applications.",
            "An Effective Layout Decomposition Method for DSA with Multiple Patterning in Contact-Hole Generation.",
            "An Adaptive Markov Model for the Timing Analysis of Probabilistic Caches.",
            "DYNASCORE: DYNAmic Software COntroller to Increase REsource Utilization in Mixed-Critical Systems.",
            "Emerging NVM: A Survey on Architectural Integration and Research Challenges.",
            "Exploiting Chip Idleness for Minimizing Garbage Collection - Induced Chip Access Conflict on SSDs.",
            "Recovering from Biased Distribution of Faulty Cells in Memory by Reorganizing Replacement Regions through Universal Hashing.",
            "Revisiting Routability-Driven Placement for Analog and Mixed-Signal Circuits.",
            "Architecture and Compiler Support for GPUs Using Energy-Efficient Affine Register Files.",
            "Repair of FPGA-Based Real-Time Systems With Variable Slacks.",
            "C-Mine: Data Mining of Logic Common Cases for Improved Timing Error Resilience with Energy Efficiency.",
            "Flexible and Tradeoff-Aware Constraint-Based Design Space Exploration for Streaming Applications on Heterogeneous Platforms.",
            "Multi-Objective 3D Floorplanning with Integrated Voltage Assignment.",
            "Hardware-Enabled Pharmaceutical Supply Chain Security.",
            "Runtime Slack Creation for Processor Performance Variability using System Scenarios.",
            "A Disturbance-Free Built-In Self-Test and Diagnosis Technique for DC-DC Converters.",
            "Static Mapping of Applications on Heterogeneous Multi-Core Platforms Combining Logic-Based Benders Decomposition with Integer Linear Programming.",
            "Selection of Critical Paths for Reliable Frequency Scaling under BTI-Aging Considering Workload Uncertainty and Process Variations Effects.",
            "Providing SLO Compliance on NVMe SSDs Through Parallelism Reservation.",
            "ReSC: An RFID-Enabled Solution for Defending IoT Supply Chain.",
            "Learning-Based, Fine-Grain Power Modeling of System-Level Hardware IPs.",
            "Domino Cache: An Energy-Efficient Data Cache for Modern Applications.",
            "An Efficient False Path-Aware Heuristic Critical Path Selection Method with High Coverage of the Process Variation Space.",
            "Express Read in MLC Phase Change Memories.",
            "Direction-Constrained Rectangle Escape Routing.",
            "Multicast Testing of Interposer-Based 2.5D ICs: Test-Architecture Design and Test Scheduling.",
            "An Efficient Non-Gaussian Sampling Method for High Sigma SRAM Yield Analysis.",
            "Flexible Droplet Routing in Active Matrix-Based Digital Microfluidic Biochips.",
            "Avoiding Data Inconsistency in Energy Harvesting Powered Embedded Systems.",
            "On the Reliability and Tightness of GP and Exponential Models for Probabilistic WCET Estimation.",
            "Graph-Grammar-Based IP-Integration (GRIP) - An EDA Tool for Software-Defined SoCs.",
            "Introduction to the Special Section on Advances in Physical Design Automation.",
            "UTPlaceF 2.0: A High-Performance Clock-Aware FPGA Placement Engine.",
            "Eh?Legalizer: A High Performance Standard-Cell Legalizer Observing Technology Constraints.",
            "Variation-Aware Global Placement for Improving Timing-Yield of Carbon-Nanotube Field Effect Transistor Circuit.",
            "A Maze Routing-Based Methodology With Bounded Exploration and Path-Assessed Retracing for Constrained Multilayer Obstacle-Avoiding Rectilinear Steiner Tree Construction.",
            "Ordered Escape Routing with Consideration of Differential Pair and Blockage.",
            "Routable and Matched Layout Styles for Analog Module Generation.",
            "iTimerM: A Compact and Accurate Timing Macro Model for Efficient Hierarchical Timing Analysis.",
            "Optimal Allocation of LDOs and Decoupling Capacitors within a Distributed On-Chip Power Grid.",
            "Reverse Engineering Digital ICs through Geometric Embedding of Circuit Graphs.",
            "An Integration Flow for Mixed-Critical Embedded Systems on a Flexible Time-Triggered Platform.",
            "Enhancements to SAT Attack: Speedup and Breaking Cyclic Logic Encryption.",
            "Partially Invariant Patterns for LFSR-Based Generation of Close-to-Functional Broadside Tests.",
            "Thermal-Sensor-Based Occupancy Detection for Smart Buildings Using Machine-Learning Methods.",
            "Demand-Driven Single- and Multitarget Mixture Preparation Using Digital Microfluidic Biochips.",
            "Distributed Machine Learning on Smart-Gateway Network toward Real-Time Smart-Grid Energy Management with Behavior Cognition.",
            "A Comprehensive Side-Channel Information Leakage Analysis of an In-Order RISC CPU Microarchitecture.",
            "Non-Intrusive In-Situ Requirements Monitoring of Embedded System.",
            "Dynamically Determined Preferred Values and a Design-for-Testability Approach for Multiplexer Select Inputs under Functional Test Sequences.",
            "Performance and Thermal Tradeoffs for Energy-Efficient Monolithic 3D Network-on-Chip.",
            "Folded Circuit Synthesis: Min-Area Logic Synthesis Using Dual-Edge-Triggered Flip-Flops.",
            "Guiding Formal Verification Orchestration Using Machine Learning Methods.",
            "An Algorithmic Approach to Formally Verify an ECC Library.",
            "Enhancing Flash Memory Reliability by Jointly Considering Write-back Pattern and Block Endurance.",
            "Toward Effective Reliability Requirement Assurance for Automotive Functional Safety.",
            "GPlace3.0: Routability-Driven Analytic Placer for UltraScale FPGA Architectures.",
            "Trading Off Power Consumption and Prediction Performance in Wearable Motion Sensors: An Optimal and Real-Time Approach.",
            "An Approximation Algorithm for Threshold Voltage Optimization.",
            "CASCA: A Design Automation Approach for Designing Hardware Countermeasures Against Side-Channel Attacks.",
            "Detection Mechanisms for Unauthorized Wireless Transmissions.",
            "PV-Aware Analog Sizing for Robust Analog Layout Retargeting with Optical Proximity Correction.",
            "Rapid Triggering Capability Using an Adaptive Overlay during FPGA Debug.",
            "Fault-Tolerant Unicast-Based Multicast for Reliable Network-on-Chip Testing.",
            "Editorial for TODAES Special Issue on Internet of Things System Performance, Reliability, and Security.",
            "UCR: An Unclonable Environmentally Sensitive Chipless RFID Tag For Protecting Supply Chain.",
            "SHAIP: Secure Hamming Distance for Authentication of Intrinsic PUFs.",
            "Programmable Gates Using Hybrid CMOS-STT Design to Prevent IC Reverse Engineering.",
            "Learning From Sleeping Experts: Rewarding Informative, Available, and Accurate Experts.",
            "Optimal Allocation of Computation and Communication in an IoT Network.",
            "P3: Privacy Preserving Positioning for Smart Automotive Systems.",
            "Instinctive Assistive Indoor Navigation using Distributed Intelligence.",
            "Remote Detection of Unauthorized Activity via Spectral Analysis."
        ]
    },
    {
        "name": "TODAES",
        "year": "2016",
        "info": "Volume 22, 2016/2017",
        "count": 75,
        "papers": [
            "Hierarchical Dynamic Thermal Management Method for High-Performance Many-Core Microprocessors.",
            "Error-Correcting Sample Preparation with Cyberphysical Digital Microfluidic Lab-on-Chip.",
            "State Assignment and Optimization of Ultra-High-Speed FSMs Utilizing Tristate Buffers.",
            "A Framework for Block Placement, Migration, and Fast Searching in Tiled-DNUCA Architecture.",
            "Obstacle-Avoiding Wind Turbine Placement for Power Loss and Wake Effect Optimization.",
            "Hardware Trojans: Lessons Learned after One Decade of Research.",
            "Periodic Scan-In States to Reduce the Input Test Data Volume for Partially Functional Broadside Tests.",
            "Efficient Security Monitoring with the Core Debug Interface in an Embedded Processor.",
            "Improving PCM Endurance with a Constant-Cost Wear Leveling Design.",
            "Ripple 2.0: Improved Movement of Cells in Routability-Driven Placement.",
            "A Compact Implementation of Salsa20 and Its Power Analysis Vulnerabilities.",
            "Partitioning and Data Mapping in Reconfigurable Cache and Scratchpad Memory-Based Architectures.",
            "Genetic-Algorithm-Based FPGA Architectural Exploration Using Analytical Models.",
            "Hybrid Power Management for Office Equipment.",
            "Probabilistic Model Checking for Uncertain Scenario-Aware Data Flow.",
            "DReAM: An Approach to Estimate per-Task DRAM Energy in Multicore Systems.",
            "Non-enumerative Generation of Path Delay Distributions and Its Application to Critical Path Selection.",
            "An Adaptive Demand-Based Caching Mechanism for NAND Flash Memory Storage Systems.",
            "ERfair Scheduler with Processor Suspension for Real-Time Multiprocessor Embedded Systems.",
            "Security Analysis of Arbiter PUF and Its Lightweight Compositions Under Predictability Test.",
            "CALM: Contention-Aware Latency-Minimal Application Mapping for Flattened Butterfly On-Chip Networks.",
            "Scalable SMT-Based Equivalence Checking of Nested Loop Pipelining in Behavioral Synthesis.",
            "Optimized Implementation of Multirate Mixed-Criticality Synchronous Reactive Models.",
            "Reducing the Complexity of Dataflow Graphs Using Slack-Based Merging.",
            "Security in Automotive Networks: Lightweight Authentication and Authorization.",
            "On the Restore Time Variations of Future DRAM Memory.",
            "A Hybrid DRAM/PCM Buffer Cache Architecture for Smartphones with QoS Consideration.",
            "An Elastic Mixed-Criticality Task Model and Early-Release EDF Scheduling Algorithms.",
            "Computation of Seeds for LFSR-Based n-Detection Test Generation.",
            "Scale & Cap: Scaling-Aware Resource Management for Consolidated Multi-threaded Applications.",
            "Secure and Flexible Trace-Based Debugging of Systems-on-Chip.",
            "A MATLAB Vectorizing Compiler Targeting Application-Specific Instruction Set Processors.",
            "Scrubbing Mechanism for Heterogeneous Applications in Reconfigurable Devices.",
            "A Model-Driven Engineering Methodology to Design Parallel and Distributed Embedded Systems.",
            "Special Section: Integrating Dataflow, Embedded Computing and Architecture.",
            "Worst-Case Response Time Analysis of a Synchronous Dataflow Graph in a Multiprocessor System with Real-Time Tasks.",
            "Multiprocessor Scheduling of a Multi-Mode Dataflow Graph Considering Mode Transition Delay.",
            "A Survey of Parametric Dataflow Models of Computation.",
            "Symbolic Analyses of Dataflow Graphs.",
            "HoPE: Hot-Cacheline Prediction for Dynamic Early Decompression in Compressed LLCs.",
            "PeaPaw: Performance and Energy-Aware Partitioning of Workload on Heterogeneous Platforms.",
            "CDTA: A Comprehensive Solution for Counterfeit Detection, Traceability, and Authentication in the IoT Supply Chain.",
            "Generation of Transparent-Scan Sequences for Diagnosis of Scan Chain Faults.",
            "Application-Specific Residential Microgrid Design Methodology.",
            "Layer Assignment of Escape Buses with Consecutive Constraints in PCB Designs.",
            "Leak Stopper: An Actively Revitalized Snoop Filter Architecture with Effective Generation Control.",
            "Topological Approach to Automatic Symbolic Macromodel Generation for Analog Integrated Circuits.",
            "Content-Aware Bit Shuffling for Maximizing PCM Endurance.",
            "SSAGA: SMs Synthesized for Asymmetric GPGPU Applications.",
            "Low-Power Clock Tree Synthesis for 3D-ICs.",
            "TEI-power: Temperature Effect Inversion-Aware Dynamic Thermal Management.",
            "Using CoreSight PTM to Integrate CRA Monitoring IPs in an ARM-Based SoC.",
            "Fundamental Challenges Toward Making the IoT a Reachable Reality: A Model-Centric Investigation.",
            "Obfuscation-Based Protection Framework against Printed Circuit Boards Unauthorized Operation and Reverse Engineering.",
            "A Fast Hierarchical Adaptive Analog Routing Algorithm Based on Integer Linear Programming.",
            "A Single-Tier Virtual Queuing Memory Controller Architecture for Heterogeneous MPSoCs.",
            "Accelerated Soft-Error-Rate (SER) Estimation for Combinational and Sequential Circuits.",
            "Exploring Energy-Efficient Cache Design in Emerging Mobile Platforms.",
            "Scalable Bandwidth Shaping Scheme via Adaptively Managed Parallel Heaps in Manycore-Based Network Processors.",
            "Optimal Scheduling and Allocation for IC Design Management and Cost Reduction.",
            "Proof-Carrying Hardware via Inductive Invariants.",
            "Automated Integration of Dual-Edge Clocking for Low-Power Operation in Nanometer Nodes.",
            "Design Methodology of Fault-Tolerant Custom 3D Network-on-Chip.",
            "Approximate Energy-Efficient Encoding for Serial Interfaces.",
            "Parallel High-Level Synthesis Design Space Exploration for Behavioral IPs of Exact Latencies.",
            "Generating Current Constraints to Guarantee RLC Power Grid Safety.",
            "Test Modification for Reduced Volumes of Fail Data.",
            "Multiharmonic Small-Signal Modeling of Low-Power PWM DC-DC Converters.",
            "Training Fixed-Point Classifiers for On-Chip Low-Power Implementation.",
            "Efficient Mapping of Applications for Future Chip-Multiprocessors in Dark Silicon Era.",
            "Spatio-Temporal Scheduling of Preemptive Real-Time Tasks on Partially Reconfigurable Systems.",
            "Measurement-Based Worst-Case Execution Time Estimation Using the Coefficient of Variation.",
            "Noc-HMP: A Heterogeneous Multicore Processor for Embedded Systems Designed in SystemJ.",
            "Time-Triggered Scheduling of Mixed-Criticality Systems.",
            "Incremental Layer Assignment for Timing Optimization."
        ]
    },
    {
        "name": "TODAES",
        "year": "2015",
        "info": "Volume 21, 2015/2016",
        "count": 72,
        "papers": [
            "FuzzRoute: A Thermally Efficient Congestion-Free Global Routing Method for Three-Dimensional Integrated Circuits.",
            "Layout Decomposition with Pairwise Coloring and Adaptive Multi-Start for Triple Patterning Lithography.",
            "DARP-MP: Dynamically Adaptable Resilient Pipeline Design in Multicore Processors.",
            "Memory Management Scheme to Improve Utilization Efficiency and Provide Fast Contiguous Allocation without a Statically Reserved Area.",
            "Exploiting Instruction Set Encoding for Aging-Aware Microprocessor Design.",
            "Locality-Aware Network Utilization Balancing in NoCs.",
            "Adaptive Burst-Writes (ABW): Memory Requests Scheduling to Reduce Write-Induced Interference.",
            "An MDE Approach for Rapid Prototyping and Implementation of Dynamic Reconfigurable Systems.",
            "Clock Period Minimization with Minimum Leakage Power.",
            "A Finite-Point Method for Efficient Gate Characterization Under Multiple Input Switching.",
            "Lowering Minimum Supply Voltage for Power-Efficient Cache Design by Exploiting Data Redundancy.",
            "Complementary Synthesis for Encoder with Flow Control Mechanism.",
            "Enhanced Test Compaction for Multicycle Broadside Tests by Using State Complementation.",
            "DFT Assisted Techniques for Peak Launch-to-Capture Power Reduction during Launch-On-Shift At-Speed Testing.",
            "Performance-Driven Unit-Capacitor Placement of Successive-Approximation-Register ADCs.",
            "A New Uncertainty Budgeting-Based Method for Robust Analog/Mixed-Signal Design.",
            "Offline Washing Schemes for Residue Removal in Digital Microfluidic Biochips.",
            "Security-Aware Design Methodology and Optimization for Automotive Systems.",
            "A C2RTL Framework Supporting Partition, Parallelization, and FIFO Sizing for Streaming Applications.",
            "Auxiliary Variables in Temporal Specifications: Semantic and Practical Analysis for System-Level Requirements.",
            "Performance-Driven Assignment of Buffered I/O Signals in Area-I/O Flip-Chip Designs.",
            "Array Size Computation under Uniform Overlapping and Irregular Accesses.",
            "Improving Write Performance by Controlling Target Resistance Distributions in MLC PRAM.",
            "A New Unicast-Based Multicast Scheme for Network-on-Chip Router and Interconnect Testing.",
            "Optimization of 3D Digital Microfluidic Biochips for the Multiplexed Polymerase Chain Reaction.",
            "Parallel Power Grid Analysis Based on Enlarged Partitions.",
            "A Cost-Effective Energy Optimization Framework of Multicore SoCs Based on Dynamically Reconfigurable Voltage-Frequency Islands.",
            "Yield and Speedup Improvements in Extensible Processors by Allocating Extra Cycles to Some Custom Instructions.",
            "TSocket: Thermal Sustainable Power Budgeting.",
            "Reliability-Aware Resource Allocation and Binding in High-Level Synthesis.",
            "ECDSA Passive Attacks, Leakage Sources, and Common Design Mistakes.",
            "Security-Aware Obfuscated Priority Assignment for Automotive CAN Platforms.",
            "Adapting to Varying Distribution of Unknown Response Bits.",
            "Exploring Soft-Error Robust and Energy-Efficient Register File in GPGPUs using Resistive Memory.",
            "Design-for-Testability for Functional Broadside Tests under Primary Input Constraints.",
            "Preface to Special Section on New Physical Design Techniques for the Next Generation of Integration Technology.",
            "Eh?Placer: A High-Performance Modern Technology-Driven Placer.",
            "Clock-Tree-Aware Incremental Timing-Driven Placement.",
            "Parasitic-Aware Common-Centroid FinFET Placement and Routing for Current-Ratio Matching.",
            "Floorplanning and Topology Synthesis for Application-Specific Network-on-Chips with RF-Interconnect.",
            "Analytical Clustering Score with Application to Postplacement Register Clustering.",
            "PARR: Pin-Access Planning and Regular Routing for Self-Aligned Double Patterning.",
            "EBL Overlapping Aware Stencil Planning for MCC System.",
            "Novel Adaptive Power-Gating Strategy and Tapered TSV Structure in Multilayer 3D IC.",
            "DC Characteristics and Variability on 90nm CMOS Transistor Array-Style Analog Layout.",
            "Minimizing Stack Memory for Hard Real-Time Applications on Multicore Platforms with Partitioned Fixed-Priority or EDF Scheduling.",
            "Differential Write-Conscious Software Design on Phase-Change Memory: An SQLite Case Study.",
            "FH-OAOS: A Fast Four-Step Heuristic for Obstacle-Avoiding Octilinear Steiner Tree Construction.",
            "A Survey of Techniques for Cache Locking.",
            "Process Independent Design Methodology for the Active RC and Single-Inverter-Based Rail Clamp.",
            "Synthesis of Dual-Mode Circuits Through Library Design, Gate Sizing, and Clock-Tree Optimization.",
            "Performance Evaluation of NoC-Based Multicore Systems: From Traffic Analysis to NoC Latency Modeling.",
            "Path Selection for Real-Time Communication on Priority-Aware NoCs.",
            "An Effective Chemical Mechanical Polishing Fill Insertion Approach.",
            "Streaming Sorting Networks.",
            "Statistical Rare-Event Analysis and Parameter Guidance by Elite Learning Sample Selection.",
            "Construction of Reconfigurable Clock Trees for MCMM Designs Using Mode Separation and Scenario Compression.",
            "A Hardware-Assisted Energy-Efficient Processing Model for Activity Recognition Using Wearables.",
            "Power, Area, and Performance Optimization of Standard Cell Memory Arrays Through Controlled Placement.",
            "On Battery Recovery Effect in Wireless Sensor Nodes.",
            "Accurate Modeling of Nonideal Low-Power PWM DC-DC Converters Operating in CCM and DCM using Enhanced Circuit-Averaging Techniques.",
            "Cyber-Physical Co-Simulation Framework for Smart Cells in Scalable Battery Packs.",
            "FORTIS: A Comprehensive Solution for Establishing Forward Trust for Protecting IPs and ICs.",
            "Timing Path-Driven Cycle Cutting for Sequential Controllers.",
            "Hierarchical Statistical Leakage Analysis and Its Application.",
            "Efficient Algorithms for Discrete Gate Sizing and Threshold Voltage Assignment Based on an Accurate Analytical Statistical Yield Gradient.",
            "Ensemble Reduction via Logic Minimization.",
            "N-Detection Test Sets for Circuits with Multiple Independent Scan Chains.",
            "Resource Sharing Centric Dynamic Voltage and Frequency Scaling for CMP Cores, Uncore, and Memory.",
            "Area-Aware Decomposition for Single-Electron Transistor Arrays.",
            "Library-Based Placement and Routing in FPGAs with Support of Partial Reconfiguration.",
            "Index-Resilient Zero-Suppressed BDDs: Definition and Operations."
        ]
    },
    {
        "name": "TODAES",
        "year": "2014",
        "info": "Volume 20, 2014/2015",
        "count": 66,
        "papers": [
            "Editorial: ACM Transactions on Design Automation of Electronics Systems and Beyond.",
            "Gate-Level Information Flow Tracking for Security Lattices.",
            "Clock Tree Synthesis Considering Slew Effect on Supply Voltage Variation.",
            "Scaling Input Stimulus Generation through Hybrid Static and Dynamic Analysis of RTL.",
            "Dataflow Graph Partitioning for Area-Efficient High-Level Synthesis with Systems Perspective.",
            "Synthesizing Optimal Switching Lattices.",
            "Efficient Coverage-Driven Stimulus Generation Using Simultaneous SAT Solving, with Application to SystemVerilog.",
            "SmartCap: Using Machine Learning for Power Adaptation of Smartphone's Application Processor.",
            "Compiler Optimization for Reducing Leakage Power in Multithread BSP Programs.",
            "Hybrid Cache Designs for Reliable Hybrid High and Ultra-Low Voltage Operation.",
            "Designing Hybrid DRAM/PCM Main Memory Systems Utilizing Dual-Phase Compression.",
            "Reducing Contention in Shared Last-Level Cache for Throughput Processors.",
            "A Formal Approach to Incremental Converter Synthesis for System-on-Chip Design.",
            "Multiplierless Design of Folded DSP Blocks.",
            "An Efficient Hardware-Based Higher Radix Floating Point MAC Design.",
            "Design of Hardened Embedded Systems on Multi-FPGA Platforms.",
            "ePlace: Electrostatics-Based Placement Using Fast Fourier Transform and Nesterov's Method.",
            "Robust Design Space Modeling.",
            "Yield Improvement for 3D Wafer-to-Wafer Stacked ICs Using Wafer Matching.",
            "Conditional Diagnosability of Cayley Graphs Generated by Transposition Trees under the PMC Model.",
            "Data-Driven Optimization of Order Admission Policies in a Digital Print Factory.",
            "The Design and Experiments of A SID-Based Power-Aware Simulator for Embedded Multicore Systems.",
            "Prolonging Lifetime of PCM-Based Main Memories through On-Demand Page Pairing.",
            "Obstacle-Avoiding Algorithm in X-Architecture Based on Discrete Particle Swarm Optimization for VLSI Design.",
            "Marching-Based Wear-Leveling for PCM-Based Storage Systems.",
            "Applying Pay-Burst-Only-Once Principle for Periodic Power Management in Hard Real-Time Pipelined Multiprocessor Systems.",
            "ASP-Based Encoding Model of Architecture Synthesis for Smart Cameras in Distributed Networks.",
            "Automated Iterative Pipelining for ASIC Design.",
            "A Generalized Definition of Unnecessary Test Vectors in Functional Test Sequences.",
            "Reconfigurable Scan Networks: Modeling, Verification, and Optimal Pattern Generation.",
            "A Tool for Analog/RF BIST Evaluation Using Statistical Models of Circuit Parameters.",
            "A Fault-Aware Toolchain Approach for FPGA Fault Tolerance.",
            "Reconfigurable Binding against FPGA Replay Attacks.",
            "Design of Ultra-Low Power Scalable-Throughput Many-Core DSP Applications.",
            "Least Upper Delay Bound for VBR Flows in Networks-on-Chip with Virtual Channels.",
            "A Methodology to Recover RTL IP Functionality for Automatic Generation of SW Applications.",
            "High-Throughput Logic Timing Simulation on GPGPUs.",
            "Decoupling Capacitance Design Strategies for Power Delivery Networks with Power Gating.",
            "Aging- and Variation-Aware Delay Monitoring Using Representative Critical Path Selection.",
            "Scheduling Globally Asynchronous Locally Synchronous Programs for Guaranteed Response Times.",
            "Explaining Software Failures by Cascade Fault Localization.",
            "System-Level Observation Framework for Non-Intrusive Runtime Monitoring of Embedded Systems.",
            "Lazy-RTGC: A Real-Time Lazy Garbage Collection Mechanism with Jointly Optimizing Average and Worst Performance for NAND Flash Memory Storage Systems.",
            "Array Interleaving - An Energy-Efficient Data Layout Transformation.",
            "Layout-Aware Mixture Preparation of Biochemical Fluids on Application-Specific Digital Microfluidic Biochips.",
            "Adaptive Generation of Unique IDs for Digital Chips through Analog Excitation.",
            "H-Matrix-Based Finite-Element-Based Thermal Analysis for 3D ICs.",
            "TCONMAP: Technology Mapping for Parameterised FPGA Configurations.",
            "Component-Based Synthesis of Embedded Systems Using Satisfiability Modulo Theories.",
            "An Application Adaptation Approach to Mitigate the Impact of Dynamic Thermal Management on Video Encoding.",
            "VSSD: Performance Isolation in a Solid-State Drive.",
            "Accurate Analysis and Prediction of Enterprise Service-Level Performance.",
            "Implementing an Application-Specific Instruction-Set Processor for System-Level Dynamic Program Analysis Engines.",
            "Constructing Large and Fast On-Chip Cache for Mobile Processors with Multilevel Cell STT-MRAM Technology.",
            "Architecting the Last-Level Cache for GPUs using STT-RAM Technology.",
            "Fast Simulation of Networks-on-Chip with Priority-Preemptive Arbitration.",
            "FOLD: Extreme Static Test Compaction by Folding of Functional Test Sequences.",
            "Built-In Self-Test and Test Scheduling for Interposer-Based 2.5D IC.",
            "Introduction to the Special Issue on Reliable, Resilient, and Robust Design of Circuits and Systems.",
            "Single-Event Multiple-Transient Characterization and Mitigation via Alternative Standard Cell Placement Methods.",
            "In-Scratchpad Memory Replication: Protecting Scratchpad Memories in Multicore Embedded Systems against Soft Errors.",
            "Enhancing the Reliability of MLC NAND Flash Memory Systems by Read Channel Optimization.",
            "Impact of Cell Failure on Reliable Cross-Point Resistive Memory Design.",
            "Robust and Low-Power Digitally Programmable Delay Element Designs Employing Neuron-MOS Mechanism.",
            "Use It or Lose It: Proactive, Deterministic Longevity in Future Chip Multiprocessors.",
            "An Improved Methodology for Resilient Design Implementation."
        ]
    },
    {
        "name": "TODAES",
        "year": "2013",
        "info": "Volume 19, 2013/2014",
        "count": 41,
        "papers": [
            "CoMETC: Coordinated management of energy/thermal/cooling in servers.",
            "Dynamic programming-based runtime thermal management (DPRTM): An online thermal control strategy for 3D-NoC systems.",
            "Improving the performance of port range check for network packet filtering.",
            "Near-optimal and scalable intrasignal in-place optimization for non-overlapping and irregular access schemes.",
            "Low-energy volatile STT-RAM cache design using cache-coherence-enabled adaptive refresh.",
            "Performance bound analysis of analog circuits in frequency- and time-domain considering process variations.",
            "Optimal common-centroid-based unit capacitor placements for yield enhancement of switched-capacitor circuits.",
            "Built-in generation of multicycle functional broadside tests with observation points.",
            "Test compaction techniques for assertion-based test generation.",
            "Performance and power profiling for emulated Android systems.",
            "Performance-driven dynamic thermal management of MPSoC based on task rescheduling.",
            "Cost-effective lifetime and yield optimization for NoC-based MPSoCs.",
            "Configurable range memory for effective data reuse on programmable accelerators.",
            "Accelerating FPGA debug: Increasing visibility using a runtime reconfigurable observation and triggering network.",
            "A comparative evaluation of multi-objective exploration algorithms for high-level design.",
            "Critical-path-aware high-level synthesis with distributed controller for fast timing closure.",
            "Techniques for scalable and effective routability evaluation.",
            "Low-power skewed-load tests based on functional broadside tests.",
            "Design-for-testability for multi-cycle broadside tests by holding of state variables.",
            "Reducing test cost of integrated, heterogeneous systems using pass-fail test data analysis.",
            "BLAS: Block-level adaptive striping for solid-state drives.",
            "SPMCloud: Towards the Single-Chip Embedded ScratchPad Memory-Based Storage Cloud.",
            "MAESTRO - Holistic Actor-Oriented Modeling of Nonfunctional Properties and Firmware Behavior for MPSoCs.",
            "Integrated Coherence Prediction: Towards Efficient Cache Coherence on NoC-Based Multicore Architectures.",
            "Garbage Collection for Multiversion Index in Flash-Based Embedded Databases.",
            "Power Modeling for GPU Architectures Using McPAT.",
            "Diagnosability of Component-Composition Graphs in the MM* Model.",
            "Exact Logic and Fault Simulation in Presence of Unknowns.",
            "An Effective Floorplan-Guided Placement Algorithm for Large-Scale Mixed-Size Designs.",
            "Integrated Resource Allocation and Binding in Clock Mesh Synthesis.",
            "Incremental Analysis of Power Grids Using Backward Random Walks.",
            "Quantifying Notions of Extensibility in FlexRay Schedule Synthesis.",
            "Scalable Power Management Using Multilevel Reinforcement Learning for Multiprocessors.",
            "WaveSync: Low-Latency Source-Synchronous Bypass Network-on-Chip Architecture.",
            "Implementation and Analysis of History-Based Output Channel Selection Strategies for Adaptive Routers in Mesh NoCs.",
            "Power and Area Efficiency NoC Router Design for Application-Specific SoC by Using Buffer Merging and Resource Sharing.",
            "Multilevel Simulation of Nonfunctional Properties by Piecewise Evaluation.",
            "High-Level Test Synthesis: A Survey from Synthesis Process Flow Perspective.",
            "Statistical Peak Temperature Prediction and Thermal Yield Improvement for 3D Chip Multiprocessors.",
            "A Hybrid Technique for Discrete Gate Sizing Based on Lagrangian Relaxation.",
            "Understanding SRAM Stability via Bifurcation Analysis: Analytical Models and Scaling Trends."
        ]
    },
    {
        "name": "TODAES",
        "year": "2013",
        "info": "Volume 18, 2013",
        "count": 61,
        "papers": [
            "Introduction to the special section on adaptive power management for energy and temperature-aware computing systems.",
            "Hierarchical power management for adaptive tightly-coupled processor arrays.",
            "Design of energy-efficient, adaptable throughput systems at near/sub-threshold voltage.",
            "A self-tuning design methodology for power-efficient multi-core systems.",
            "Improving performance per watt of asymmetric multi-core processors via online program phase classification and adaptive core morphing.",
            "Online thermal control methods for multiprocessor systems.",
            "Thermal prediction and adaptive control through workload phase detection.",
            "Hybrid nonvolatile disk cache for energy-efficient and high-performance systems.",
            "Accelerating throughput-aware runtime mapping for heterogeneous MPSoCs.",
            "Concurrency-aware compiler optimizations for hardware description languages.",
            "Compiler-in-the-loop exploration during datapath synthesis for higher quality delay-area trade-offs.",
            "Verification work reduction methodology in low-power chip implementation.",
            "SEU fault evaluation and characteristics for SRAM-based FPGA architectures and synthesis algorithms.",
            "Using implications to choose tests through suspect fault identification.",
            "Discrete sizing for leakage power optimization in physical design: A comparative study.",
            "ECO cost measurement and incremental gate sizing for late process changes.",
            "A survey and taxonomy of on-chip monitoring of multicore systems-on-chip.",
            "Runtime verification for multicore SoC with high-quality trace data.",
            "Coverage-directed observability-based validation for embedded software.",
            "t/t-Diagnosability of regular graphs under the PMC model.",
            "Synthesis of networks of custom processing elements for real-time physical system emulation.",
            "Resource-aware architectures for adaptive particle filter based visual target tracking.",
            "Shared recovery for energy efficiency and reliability enhancements in real-time applications with precedence constraints.",
            "Achieving autonomous power management using reinforcement learning.",
            "Reducing instruction bit-width for low-power VLIW architectures.",
            "Low-power resource binding by postsilicon customization.",
            "Low-power anti-aging zero skew clock gating.",
            "Composable thermal modeling and simulation for architecture-level thermal designs of multicore microprocessors.",
            "IC power delivery: Voltage regulation and conversion, system-level cooptimization and technology implications.",
            "A study of row-based area-array I/O design planning in concurrent chip-package design flow.",
            "Revisiting automated physical synthesis of high-performance clock networks.",
            "BonnRoute: Algorithms and data structures for fast and good VLSI routing.",
            "The survivability of design-specific spare placement in FPGA architectures with high defect rates.",
            "On bottleneck analysis in stochastic stream processing.",
            "How to efficiently implement dynamic circuit specialization systems.",
            "Thread-based multi-engine model checking for multicore platforms.",
            "Analysis and minimization of power-transmission loss in locally daisy-chained systems by local energy buffering.",
            "Employing circadian rhythms to enhance power and reliability.",
            "Routability optimization for crossbar-switch structured ASIC design.",
            "Agglomerative-based flip-flop merging and relocation for signal wirelength and clock tree optimization.",
            "An efficient method for analyzing on-chip thermal reliability considering process variations.",
            "Order statistics for correlated random variables and its application to at-speed testing.",
            "Power-safe application of tdf patterns to flip-chip designs during wafer test.",
            "Test compaction for small-delay defects using an effective path selection scheme.",
            "Editorial to special section on networks on chip: Architecture, tools, and methodologies.",
            "Dynamic power management for multidomain system-on-chip platforms: An optimal control approach.",
            "In-network monitoring and control policy for DVFS of CMP networks-on-chip and last level caches.",
            "Adaptive virtual channel partitioning for network-on-chip in heterogeneous architectures.",
            "Ordering circuit establishment in multiplane NoCs.",
            "Deflection routing in 3D network-on-chip with limited vertical bandwidth.",
            "A fast and scalable multidimensional multiple-choice knapsack heuristic.",
            "Architecture customization of on-chip reconfigurable accelerators.",
            "Enabling energy efficient reliability in embedded systems through smart cache cleaning.",
            "Hardware/software approaches for reducing the process variation impact on instruction fetches.",
            "Exploiting workload dynamics to improve SSD read latency via differentiated error correction codes.",
            "An index-based management scheme with adaptive caching for huge-scale low-cost embedded flash storages.",
            "Common-source-line array: An area efficient memory architecture for bipolar nonvolatile devices.",
            "A novel differential scan attack on advanced DFT structures.",
            "A parallel dual-scanline algorithm for partitioning parameterized 45-degree polygons.",
            "Destination-based congestion awareness for adaptive routing in 2D mesh networks.",
            "A routing algorithm for graphene nanoribbon circuit."
        ]
    },
    {
        "name": "TODAES",
        "year": "2012",
        "info": "Volume 17, 2012",
        "count": 51,
        "papers": [
            "Easy Formal Specification and Validation of Unbounded Networks-on-Chips Architectures.",
            "System-Level Synthesis for Wireless Sensor Node Controllers: A Complete Design Flow.",
            "Optimization Algorithms for the Multiplierless Realization of Linear Transforms.",
            "Postplacement Voltage Island Generation.",
            "Compact Modeling of Interconnect Circuits over Wide Frequency Band by Adaptive Complex-Valued Sampling Method.",
            "Reliability-Driven Power/Ground Routing for Analog ICs.",
            "Coverage-Directed Test Generation Automated by Machine Learning - A Review.",
            "Error Rate Estimation for Defective Circuits via Ones Counting.",
            "Statistical Soft Error Rate (SSER) Analysis for Scaled CMOS Designs.",
            "A Fast Non-Monte-Carlo Yield Analysis and Optimization by Stochastic Orthogonal Polynomials.",
            "An Extended SystemC Framework for Efficient HW/SW Co-Simulation.",
            "Optimized 3D Network-on-Chip Design Using Simulated Allocation.",
            "Performance/Thermal-Aware Design of 3D-Stacked L2 Caches for CMPs.",
            "Timing Analysis of System Initialization and Crash Recovery for a Segment-Based Flash Translation Layer.",
            "Computer Generation of Hardware for Linear Digital Signal Processing Transforms.",
            "Timing Optimization in Sequential Circuit by Exploiting Clock-Gating Logic.",
            "A Yield and Reliability Improvement Methodology Based on Logic Redundant Repair with a Repairable Scan Flip-Flop Designed by Push Rule.",
            "Scan Flip-Flop Grouping to Compress Test Data and Compact Test Responses for Launch-on-Capture Delay Testing.",
            "Introduction to special section on verification challenges in the concurrent world.",
            "Towards the formal verification of cache coherency at the architectural level.",
            "A full lifecycle performance verification methodology for multicore systems-on-chip.",
            "Deterministic replay for message-passing-based concurrent programs.",
            "Verification and coverage of message passing multicore applications.",
            "Directed test generation for validation of multicore architectures.",
            "Targeted random test generation for power-aware multicore designs.",
            "A3MAP: Architecture-aware analytic mapping for networks-on-chip.",
            "Postscheduling buffer management trade-offs in streaming software synthesis.",
            "An ILP solution to address code generation for embedded applications on digital signal processors.",
            "Divide and conquer high-level synthesis design space exploration.",
            "Formal verification of code motion techniques using data-flow-driven equivalence checking.",
            "Model-driven automation for simulation-based functional verification.",
            "Fast poisson solvers for thermal analysis.",
            "High-performance clock mesh optimization.",
            "Load-balanced clock tree synthesis with adjustable delay buffer insertion for clock skew reduction in multiple dynamic supply voltage designs.",
            "A fast heuristic approach for parametric yield enhancement of analog designs.",
            "MCEmu: A Framework for Software Development and Performance Analysis of Multicore Systems.",
            "Formal Verification and Debugging of Precise Interrupts on High Performance Microprocessors.",
            "Synchronizing AMS Assertions with AMS Simulation: From Theory to Practice.",
            "Resource Sharing of Pipelined Custom Hardware Extension for Energy-Efficient Application-Specific Instruction Set Processor Design.",
            "A Hardware/Software Cooperative Custom Register Binding Approach for Register Spill Elimination in Application-Specific Instruction Set Processors.",
            "Buffer Optimization and Dispatching Scheme for Embedded Systems with Behavioral Transparency.",
            "An Algorithm for Jointly Optimizing Quantization and Multiple Constant Multiplication.",
            "Synthesis of Adaptable Hybrid Adders for Area Optimization under Timing Constraint.",
            "The Synthesis of Cyclic Dependencies with Boolean Satisfiability.",
            "Static NBTI Reduction Using Internal Node Control.",
            "Conditional Diagnosability of k-Ary n-Cubes under the PMC Model.",
            "Symbolic-Event-Propagation-Based Minimal Test Set Generation for Robust Path Delay Faults.",
            "Launch-on-Shift Test Generation for Testing Scan Designs Containing Synchronous and Asynchronous Clock Domains.",
            "Migration-Resistant Policies for Probe-Wear Leveling in MEMS Storage Devices.",
            "ECR: A Powerful and Low-Complexity Error Cancellation Rewiring Scheme.",
            "Fast Statistical Full-Chip Leakage Analysis for Nanometer VLSI Systems."
        ]
    },
    {
        "name": "TODAES",
        "year": "2010",
        "info": "Volume 16, 2010/2011",
        "count": 51,
        "papers": [
            "Guest Editorial: Current Trends in Low-Power Design.",
            "Nanometer MOSFET Effects on the Minimum-Energy Point of Sub-45nm Subthreshold Logic - Mitigation at Technology and Circuit Levels.",
            "NBTI-Aware Clustered Power Gating.",
            "Behavior-Level Observability Analysis for Operation Gating in Low-Power Behavioral Synthesis.",
            "Low-Power Hypercube Divided Memory FFT Engine Using 3D Integration.",
            "vGreen: A System for Energy-Efficient Management of Virtual Machines.",
            "Energy-Efficient Progressive Remote Update for Flash-Based Firmware of Networked Embedded Systems.",
            "Energy- and Performance-Efficient Communication Framework for Embedded MPSoCs through Application-Driven Release Consistency.",
            "A Simultaneous Input Vector Control and Circuit Modification Technique to Reduce Leakage with Zero Delay Penalty.",
            "Scan-Cell Reordering for Minimizing Scan-Shift Power Based on Nonspecified Test Cubes.",
            "ACM Journal on Emerging Technologies in Computing Systems.",
            "Call for papers: Verification issue and challenges with multicore systems.",
            "Dimension-reducible Boolean functions based on affine spaces.",
            "Overhead-aware energy optimization for real-time streaming applications on multiprocessor System-on-Chip.",
            "Automatic memory partitioning and scheduling for throughput and power optimization.",
            "MicroFix: Using timing interpolation and delay sensors for power reduction.",
            "Reducing the switching activity of test sequences under transparent-scan.",
            "A parallel branch-and-cut approach for detailed placement.",
            "A gridless routing system with nonslicing floorplanning-based crosstalk reduction on gridless track assignment.",
            "Scan-based attacks on linear feedback shift register based stream ciphers.",
            "A Special Section on Multicore Parallel CAD: Algorithm Design and Programming.",
            "Efficient and Deterministic Parallel Placement for FPGAs.",
            "Design and Implementation of a Throughput-Optimized GPU Floorplanning Algorithm.",
            "GPU-Based Parallelization for Fast Circuit Optimization.",
            "Multithreaded Simulation for Synchronous Dataflow Graphs.",
            "Accelerating UNISIM-Based Cycle-Level Microarchitectural Simulations on Multicore Platforms.",
            "A New Algorithm for VHDL Parallel Simulation.",
            "Locality-Driven Parallel Static Analysis for Power Delivery Networks.",
            "Massively Parallel Logic Simulation with GPUs.",
            "Gate-Level Simulation with GPU Computing.",
            "Hardware-Software Codesign of an Embedded Multiple-Supply Power Management Unit for Multicore SoCs Using an Adaptive Global/Local Power Allocation and Processing Scheme.",
            "Thread Warping: Dynamic and Transparent Synthesis of Thread Accelerators.",
            "Chassis: A Platform for Verifying PMU Integration Using Autogenerated Behavioral Models.",
            "A Metric for Quantifying Similarity between Timing Constraint Sets in Real-Time Systems.",
            "40nm CMOS 0.35V-Optimized Standard Cell Libraries for Ultra-Low Power Applications.",
            "2011 ACM TODAES best paper award.",
            "Concurrency-oriented verification and coverage of system-level designs.",
            "A probabilistic analysis of coverage methods.",
            "GALS-Designer: A design framework for GALS software systems.",
            "Timing variation-aware scheduling and resource binding in high-level synthesis.",
            "Resource-constrained multiprocessor synthesis for floating-point applications on FPGAs.",
            "Memory access optimization in compilation for coarse-grained reconfigurable architectures.",
            "Dynamic data folding with parameterizable FPGA configurations.",
            "Parallel circuit simulation with adaptively controlled projective integration.",
            "Mitigating the effects of large multiple cell upsets (MCUs) in memories.",
            "Integrated microarchitectural floorplanning and run-time controller for inductive noise mitigation.",
            "IO connection assignment and RDL routing for flip-chip designs.",
            "Clock Tree synthesis for TSV-based 3D IC designs.",
            "Clock buffer polarity assignment with skew tuning.",
            "Analog layout retargeting using geometric programming.",
            "A 36μW heartbeat-detection processor for a wireless sensor node."
        ]
    },
    {
        "name": "TODAES",
        "year": "2009",
        "info": "Volume 15, 2009/2010",
        "count": 33,
        "papers": [
            "Automatic design of application-specific reconfigurable processor extensions with UPaK synthesis kernel.",
            "Autonomous hardware/software partitioning and voltage/frequency scaling for low-power embedded systems.",
            "Performance-constrained voltage assignment in multiple supply voltage SoC floorplanning.",
            "Minimizing leakage power of sequential circuits through mixed-Vt flip-flops and multi-Vt combinational gates.",
            "Circuit optimization techniques to mitigate the effects of soft errors in combinational logic.",
            "Design and implementation of an efficient wear-leveling algorithm for solid-state-disk microcontrollers.",
            "Using stuck-at tests to form scan-based tests for transition faults in standard-scan circuits.",
            "Spatial locality exploitation for runtime reordering of JPEG2000 wavelet data layouts.",
            "ACM Transactions on Design Automation of Electronic Systems (TODAES) special section call for papers: Parallel CAD: Algorithm design and programming.",
            "Fast and accurate processor models for efficient MPSoC design.",
            "Low-overhead Fmax calibration at multiple operating points using delay-sensitivity-based path selection.",
            "Serialized parallel code generation framework for MPSoC.",
            "Speeding-up heuristic allocation, scheduling and binding with SAT-based abstraction/refinement techniques.",
            "Hardware/software partitioning and pipelined scheduling on runtime reconfigurable FPGAs.",
            "Benchmarking and evaluating reconfigurable architectures targeting the mobile domain.",
            "Thermal analysis of multiprocessor SoC applications by simulation and verification.",
            "Parameterized architecture-level dynamic thermal models for multicore microprocessors.",
            "Phase-adjustable error detection flip-flops with 2-stage hold-driven optimization, slack-based grouping scheme and slack distribution control for dynamic voltage scaling.",
            "Reliability analysis of memories protected with BICS and a per-word parity bit.",
            "Call for papers ACM transactions on design automation of electronic systems (TODAES) special section on low-power electronics and design.",
            "Race analysis for systemc using model checking.",
            "Concept-based partitioning for large multidomain multifunctional embedded systems.",
            "Low-power TinyOS tuned processor platform for wireless sensor network motes.",
            "Register file partitioning and recompilation for register file power reduction.",
            "On-chip sensor-driven efficient thermal profile estimation algorithms.",
            "Logic synthesis and circuit customization using extensive external don't-cares.",
            "Effective congestion reduction for IC package substrate routing.",
            "Power gating: Circuits, design methodologies, and best practice for standard-cell VLSI designs.",
            "An in-place search algorithm for the resource constrained scheduling problem during high-level synthesis.",
            "Partitioning techniques for partially protected caches in resource-constrained embedded systems.",
            "Huffman-based code compression techniques for embedded processors.",
            "On the completeness of the polymorphic gate set.",
            "Complexity of 3-D floorplans by analysis of graph cuboidal dual hardness."
        ]
    },
    {
        "name": "TODAES",
        "year": "2009",
        "info": "Volume 14, 2009",
        "count": 56,
        "papers": [
            "SystemCoDesigner - an automatic ESL synthesis approach by design space exploration and behavioral synthesis for streaming applications.",
            "CoMPSoC: A template for composable and predictable multi-processor system on chips.",
            "System-scenario-based design of dynamic embedded systems.",
            "SOC test-architecture optimization for the testing of embedded cores and signal-integrity faults on core-external interconnects.",
            "A gateway node with duty-cycled radio and processing subsystems for wireless sensor networks.",
            "An energy-efficient I/O request mechanism for multi-bank flash-memory storage systems.",
            "A design automation and power estimation flow for RFID systems.",
            "Provably efficient algorithms for resolving temporal and spatial difference constraint violations.",
            "Design intent coverage revisited.",
            "Model checking sequential software programs via mixed symbolic analysis.",
            "Interconnect customization for a hardware fabric.",
            "Congestion prediction in early stages of physical design.",
            "Energy and switch area optimizations for FPGA global routing architectures.",
            "Opposite-phase register switching for peak current minimization.",
            "Straightforward construction of depth-size optimal, parallel prefix circuits with fan-out 2.",
            "Lens aberration aware placement for timing yield.",
            "A 252Kgates/4.9Kbytes SRAM/71mW multistandard video decoder for high definition video applications.",
            "Efficient error detection codes for multiple-bit upset correction in SRAMs with BICS.",
            "Provably correct on-chip communication: A formal approach to automatic protocol converter synthesis.",
            "System-level PVT variation-aware power exploration of on-chip communication architectures.",
            "Instrumenting AMS assertion verification on commercial platforms.",
            "Trade-offs in loop transformations.",
            "A cosimulation methodology for HW/SW validation and performance estimation.",
            "Dynamic security domain scaling on embedded symmetric multiprocessors.",
            "Cost minimization while satisfying hard/soft timing constraints for heterogeneous embedded systems.",
            "Temperature-aware register reallocation for register file power-density minimization.",
            "Reducing fault dictionary size for million-gate large circuits.",
            "Efficient partial scan cell gating for low-power scan-based testing.",
            "Battery voltage modeling for portable systems.",
            "External memory layout vs. schematic.",
            "Skew-aware polarity assignment in clock tree.",
            "BoxRouter 2.0: A hybrid and robust global router with layer assignment for routability.",
            "FPGA-based hardware acceleration for Boolean satisfiability.",
            "SystemJ compilation using the tandem virtual machine approach.",
            "Simultaneous resource binding and interconnection optimization based on a distributed register-file microarchitecture.",
            "Playing the trade-off game: Architecture exploration using Coffeee.",
            "Scenario-based timing verification of multiprocessor embedded applications.",
            "Methods for power optimization in SOC-based data flow systems.",
            "Word-length selection for power minimization via nonlinear optimization.",
            "Generating realistic stimuli for accurate power grid analysis.",
            "Allocating power ground vias in 3D ICs for simultaneous power and thermal integrity.",
            "A memetic approach to the automatic design of high-performance analog integrated circuits.",
            "Selective shielding technique to eliminate crosstalk transitions.",
            "Custom topology rotary clock router with tree subnetworks.",
            "High-performance obstacle-avoiding rectilinear steiner tree construction.",
            "Theories and algorithms on single-detour routing for untangling twisted bus.",
            "2009 ACM TODAES best paper award: Optimization of polynomial datapaths using finite ring algebra.",
            "Efficient memory management for hardware accelerated Java Virtual Machines.",
            "A hardware platform for efficient worm outbreak detection.",
            "Thermal sensor allocation and placement for reconfigurable systems.",
            "T-trees: A tree-based representation for temporal and three-dimensional floorplanning.",
            "Leakage-aware task scheduling for partially dynamically reconfigurable FPGAs.",
            "Leakage reduction, delay compensation using partition-based tunable body-biasing techniques.",
            "Variation-aware multimetric optimization during gate sizing.",
            "Power-delay optimization in VLSI microprocessors by wire spacing.",
            "SUPERB: Simulator utilizing parallel evaluation of resistive bridges."
        ]
    },
    {
        "name": "TODAES",
        "year": "2008",
        "info": "Volume 13, 2008",
        "count": 68,
        "papers": [
            "Editorial.",
            "Introduction to special section on high-level design, validation, and test.",
            "Boosting interpolation with dynamic localized abstraction and redundancy removal.",
            "Automata-based assertion-checker synthesis of PSL properties.",
            "C-testable bit parallel multipliers over GF(2m).",
            "A tool for automatic detection of deadlock in wormhole networks on chip.",
            "A new efficient retiming algorithm derived by formal manipulation.",
            "Probabilistic transfer matrices in symbolic reliability analysis of logic circuits.",
            "A versatile paradigm for scan chain diagnosis of complex faults using signal processing techniques.",
            "Interrupt modeling for efficient high-level scheduler design space exploration.",
            "Analysis and optimization of prediction-based flow control in networks-on-chip.",
            "Tailoring circuit-switched network-on-chip to application-specific system-on-chip by two optimization schemes.",
            "Wavelet-based dynamic power management for nonstationary service requests.",
            "Synthesis of a novel timing-error detection architecture.",
            "ReChannel: Describing and simulating reconfigurable hardware in systemC.",
            "Application-aware snoop filtering for low-power cache coherence in embedded multiprocessors.",
            "SoCDAL: System-on-chip design AcceLerator.",
            "Enabling multimedia using resource-constrained video processing techniques: A node-centric perspective.",
            "A fuel-cell-battery hybrid for portable embedded systems.",
            "Low-power gated and buffered clock network construction.",
            "Optimizing wirelength and routability by searching alternative packings in floorplanning.",
            "Chip placement in a reticle for multiple-project wafer fabrication.",
            "Editorial.",
            "SAT-based ATPG using multilevel compatible don't-cares.",
            "A noniterative equivalent waveform model for timing analysis in presence of crosstalk.",
            "Timing-driven octilinear Steiner tree construction based on Steiner-point reassignment and path reconstruction.",
            "An open-source binary utility generator.",
            "Reconfigurable content-based router using hardware-accelerated language parser.",
            "Radio frequency identification prototyping.",
            "Physical synthesis for FPGA interconnect power reduction by dual-Vdd budgeting and retiming.",
            "A multiprocessor system-on-chip for real-time biomedical monitoring and analysis: ECG prototype architectural design space exploration.",
            "Heterogeneously tagged caches for low-power embedded systems with virtual memory support.",
            "Parametric variability analysis for multistage analog circuits using analytical sensitivity modeling.",
            "A fast simultaneous input vector generation and gate replacement algorithm for leakage power reduction.",
            "The optimization of kEP-SOPs: Computational complexity, approximability and experiments.",
            "Introduction to joint ACM JETC/TODAES special issue on new, emerging, and specialized technologies.",
            "Editorial.",
            "Introduction to the special section on demonstrable software systems and hardware platforms II.",
            "A retargetable parallel-programming framework for MPSoC.",
            "Multiprocessor systems synthesis for multiple use-cases of multiple applications on FPGA.",
            "Implementing the scale vector-thread processor.",
            "Specification-driven directed test generation for validation of pipelined processors.",
            "An energy characterization platform for memory devices and energy-aware data compression for multilevel-cell flash memory.",
            "Designing secure systems on reconfigurable hardware.",
            "Automatic verification of safety and liveness for pipelined machines using WEB refinement.",
            "Postplacement voltage assignment under performance constraints.",
            "Reuse and optimization of testbenches and properties in a TLM-to-RTL design flow.",
            "Processor virtualization for secure mobile terminals.",
            "Combining system scenarios and configurable memories to tolerate unpredictability.",
            "ILP-Based energy minimization techniques for banked memories.",
            "Resource sharing among mutually exclusive sum-of-product blocks for area reduction.",
            "Partitioning parameterized 45-degree polygons with constraint programming.",
            "Power-aware SoC test planning for effective utilization of port-scalable testers.",
            "Evolution of synthetic RTL benchmark circuits with predefined testability.",
            "Editorial.",
            "Schedulability analysis of preemptive and nonpreemptive EDF on partial runtime-reconfigurable FPGAs.",
            "A high-level clustering algorithm targeting dual Vdd FPGAs.",
            "Efficiently scheduling runtime reconfigurations.",
            "System-level throughput analysis for process variation aware multiple voltage-frequency island designs.",
            "Access pattern-based code compression for memory-constrained systems.",
            "A compiler approach to managing storage and memory bandwidth in configurable architectures.",
            "Auxiliary state machines + context-triggered properties in verification.",
            "Simulation-based verification using Temporally Attributed Boolean Logic.",
            "Layout-aware scan chain reorder for launch-off-shift transition test coverage.",
            "Timing-aware power-optimal ordering of signals.",
            "Effective decap insertion in area-array SoC floorplan design.",
            "Constraint-driven floorplan repair.",
            "Optimal routing algorithms for rectilinear pin clusters in high-density multichip modules."
        ]
    },
    {
        "name": "TODAES",
        "year": "2007",
        "info": "Volume 12, 2007",
        "count": 52,
        "papers": [
            "Impact of intercluster communication mechanisms on ILP in clustered VLIW architectures.",
            "System-level performance/power analysis for platform-based design of multimedia applications.",
            "Area reduction by deadspace utilization on interconnect optimized floorplan.",
            "Scan-BIST based on cluster analysis and the encoding of repeating sequences.",
            "Workload-ahead-driven online energy minimization techniques for battery-powered embedded systems with time-constraints.",
            "A hierarchical modeling framework for on-chip communication architectures of multiprocessing SoCs.",
            "Hierarchical partitioning of VLSI floorplans by staircases.",
            "Instruction set synthesis with efficient instruction encoding for configurable processors.",
            "Editorial.",
            "Disjunctive image computation for software verification.",
            "Transition-overhead-aware voltage scheduling for fixed-priority real-time systems.",
            "Prediction of leakage power under process uncertainties.",
            "A model-based extensible framework for efficient application design using FPGA.",
            "A predictive decode filter cache for reducing power consumption in embedded processors.",
            "DRDU: A data reuse analysis technique for efficient scratch-pad memory management.",
            "Low test application time resource binding for behavioral synthesis.",
            "A critical-path-aware partial gating approach for test power reduction.",
            "Forming N-detection test sets without test generation.",
            "The exact channel density and compound design for generic universal switch blocks.",
            "Introduction to special issue on demonstrable software systems and hardware platforms.",
            "Efficient simulation of critical synchronous dataflow graphs.",
            "A framework for heterogeneous specification and design of electronic embedded systems in SystemC.",
            "On-chip communication architecture exploration: A quantitative evaluation of point-to-point, bus, and network-on-chip approaches.",
            "PeaCE: A hardware-software codesign environment for multimedia embedded systems.",
            "HW-SW emulation framework for temperature-aware design in MPSoCs.",
            "Efficient power modeling and software thermal sensing for runtime temperature monitoring.",
            "Efficient and scalable compiler-directed energy optimization for realtime applications.",
            "Circuit-simulated obstacle-aware Steiner routing.",
            "Probabilistic system-on-a-chip architectures.",
            "A functionality-directed clustering technique for low-power MTCMOS design - computation of simultaneously discharging current.",
            "A verification system for transient response of analog circuits.",
            "Postplacement rewiring by exhaustive search for functional symmetries.",
            "EWD: A metamodeling driven customizable multi-MoC system modeling framework.",
            "Binary synthesis.",
            "Speedups in embedded systems with a high-performance coprocessor datapath.",
            "Event propagation for accurate circuit delay calculation using SAT.",
            "Temporal floorplanning using the three-dimensional transitive closure subGraph.",
            "Idle energy minimization by mode sequence optimization.",
            "Ultra-fast and efficient algorithm for energy optimization by gradient-based stochastic voltage and task scheduling.",
            "A practical dynamic single assignment transformation.",
            "Methodology for operation shuffling and L0 cluster generation for low energy heterogeneous VLIW processors.",
            "Techniques for the synthesis of reversible Toffoli networks.",
            "MPSoC memory optimization using program transformation.",
            "Functional verification of task partitioning for multiprocessor embedded systems.",
            "Clock skew scheduling with race conditions considered.",
            "Exploring time/resource trade-offs by solving dual scheduling problems with the ant colony optimization.",
            "Low-Power and testable circuit synthesis using Shannon decomposition.",
            "ILP and heuristic techniques for system-level design on network processor architectures.",
            "Optimization of polynomial datapaths using finite ring algebra.",
            "Incremental hierarchical memory size estimation for steering of loop transformations.",
            "Compilation for compact power-gating controls.",
            "A note on \"a mapping algorithm for computer-assisted exploration in the design of embedded systems\"."
        ]
    },
    {
        "name": "TODAES",
        "year": "2006",
        "info": "Volume 11, 2006",
        "count": 44,
        "papers": [
            "Editorial.",
            "Zero cost indexing for improved processor cache performance.",
            "Word-length optimization for differentiable nonlinear systems.",
            "Accurate modeling of substrate resistive coupling for floating substrates.",
            "Effective techniques for the generalized low-power binding problem.",
            "An interactive codesign environment for domain-specific coprocessors.",
            "Reliable crosstalk-driven interconnect optimization.",
            "Compile-time area estimation for LUT-based FPGAs.",
            "Compilation framework for code size reduction using reduced bit-width ISAs (rISAs).",
            "Compilers for leakage power reduction.",
            "Loop scheduling with timing and switching-activity minimization for VLIW DSP.",
            "ILP models for simultaneous energy and transient power minimization during behavioral synthesis.",
            "Two-layer bus routing for high-speed printed circuit boards.",
            "Improving the energy behavior of block buffering using compiler optimizations.",
            "Prototyping time- and space-efficient computations of algebraic operations over dynamically reconfigurable systems modeled by rewriting-logic.",
            "Reuse analysis of indirectly indexed arrays.",
            "Handling inverted temperature dependence in static timing analysis.",
            "Efficient thermal-oriented 3D floorplanning and thermal via planning for two-stacked-die integration.",
            "Implicit grading of multiple path delay faults.",
            "Optimal simultaneous module and multivoltage assignment for low power.",
            "On the construction of zero-deficiency parallel prefix circuits with minimum depth.",
            "Reducing energy consumption of multiprocessor SoC architectures by exploiting memory bank locality.",
            "Concurrent testing of digital microfluidics-based biochips.",
            "Systematic dynamic memory management design methodology for reduced memory footprint.",
            "LVS verification across multiple power domains for a quad-core microprocessor.",
            "A survey of fault tolerant methodologies for FPGAs.",
            "Introduction to special issue: Novel paradigms in system-level design.",
            "System level design paradigms: Platform-based design and communication synthesis.",
            "Computation and communication refinement for multiprocessor SoC design: A system-level perspective.",
            "Analysis and optimization of distributed real-time embedded systems.",
            "Architecture description language (ADL)-driven software toolkit generation for architectural exploration of programmable SOCs.",
            "Warp Processors.",
            "Module placement for fault-tolerant microfluidics-based biochips.",
            "A game-theoretic framework for multimetric optimization of interconnect delay, power, and crosstalk noise during wire sizing.",
            "Simultaneous placement with clustering and duplication.",
            "A stimulus-free graphical probabilistic switching model for sequential circuits using dynamic bayesian networks.",
            "Postlayout optimization for synthesis of Domino circuits.",
            "Synthesis of time-constrained multitasking embedded software.",
            "Statistical timing analysis using levelized covariance propagation considering systematic and random variations of process parameters.",
            "Decomposition of instruction decoders for low-power designs.",
            "Crosstalk minimization in logic synthesis for PLAs.",
            "Test sequence generation for controller verification and test with high coverage.",
            "Multiple wire reconnections based on implication flow graph.",
            "Performance-driven technology mapping with MSG partition and selective gate duplication."
        ]
    },
    {
        "name": "TODAES",
        "year": "2005",
        "info": "Volume 10, 2005",
        "count": 35,
        "papers": [
            "Editorial.",
            "Technology mapping and architecture evalution for k/m-macrocell-based FPGAs.",
            "Bipartitioning and encoding in low-power pipelined circuits.",
            "A scheduling algorithm for optimization and early planning in high-level synthesis.",
            "Combinatorial techniques for mixed-size placement.",
            "RL-huffman encoding for test compression and power reduction in scan applications.",
            "A 4-geometry maze router and its application on multiterminal nets.",
            "Algorithmic aspects of hardware/software partitioning.",
            "A unified method for phase shifter computation.",
            "An efficient algorithm for finding the minimal-area FPGA technology mapping.",
            "Scheduling and optimal register placement for synchronous circuits derived using software pipelining techniques.",
            "Synthesis of skewed logic circuits.",
            "Optimizing instruction TLB energy using software and hardware techniques.",
            "Efficient techniques for transition testing.",
            "A detailed power model for field-programmable gate arrays.",
            "Optimized wafer-probe and assembled package test design for analog circuits.",
            "Energy-efficient datapath scheduling using multiple voltages and dynamic clocking.",
            "Voltage scheduling under unpredictabilities: a risk management paradigm.",
            "Energy-aware variable partitioning and instruction scheduling for multibank memory architectures.",
            "Large-scale circuit placement.",
            "High-level modeling and simulation of single-chip programmable heterogeneous multiprocessors.",
            "A framework for systematic validation and debugging of pipeline simulators.",
            "The open family of temporal logics: Annotating temporal operators with input constraints.",
            "Behavioral synthesis techniques for intellectual property protection.",
            "Routing-aware scan chain ordering.",
            "An algorithm for integrated pin assignment and buffer planning.",
            "An o(min(m, n)) parallel deadlock detection algorithm.",
            "Introduction.",
            "XFM: An incremental methodology for developing formal models.",
            "Equivalence checking between behavioral and RTL descriptions with virtual controllers and datapaths.",
            "Using 2-domain partitioned OBDD data structure in an enhanced symbolic simulator.",
            "Simplifying the design and automating the verification of pipelines with structural hazards.",
            "Instruction-level test methodology for CPU core self-testing.",
            "Test chip experimental results on high-level structural test.",
            "An event-based monitoring service for networks on chip."
        ]
    },
    {
        "name": "TODAES",
        "year": "2004",
        "info": "Volume 9, 2004",
        "count": 21,
        "papers": [
            "Formal hardware specification languages for protocol compliance verification.",
            "Power minimization algorithms for LUT-based FPGA technology mapping.",
            "Fast memory bank assignment for fixed-point digital signal processors.",
            "Manhattan-diagonal routing in channels and switchboxes.",
            "A BNF-based automatic test program generator for compatible microprocessor verification.",
            "Storage requirement estimation for optimized design of data intensive applications.",
            "IDDX-based test methods: A survey.",
            "Stairway compaction using corner block list and its applications with rectilinear blocks.",
            "Buffer merging - a powerful technique for reducing memory requirements of synchronous dataflow specifications.",
            "A two-layer library-based approach to synthesis of analog systems from VHDL-AMS specifications.",
            "A new approach for integration of min-area retiming and min-delay padding for simultaneously addressing short-path and long-path constraints.",
            "Simultaneous shield insertion and net ordering for capacitive and inductive coupling minimization.",
            "Annealing placement by thermodynamic combinatorial optimization.",
            "An adaptive cryptographic engine for internet protocol security architectures.",
            "Frequent value encoding for low power data buses.",
            "Experimental analysis of the fastest optimum cycle ratio and mean algorithms.",
            "Cache optimization for embedded processor cores: An analytical approach.",
            "Coordinated parallelizing compiler optimizations and high-level synthesis.",
            "Reusing an on-chip network for the test of core-based systems.",
            "Achieving high encoding efficiency with partial dynamic LFSR reseeding.",
            "Segmented channel routability via satisfiability."
        ]
    },
    {
        "name": "TODAES",
        "year": "2003",
        "info": "Volume 8, 2003",
        "count": 30,
        "papers": [
            "Path delay fault testing using test points.",
            "Analysis of FPGA/FPIC switch modules.",
            "Design theory and implementation for low-power segmented bus systems.",
            "Floorplan representations: Complexity and connections.",
            "Transistor placement for noncomplementary digital VLSI cell synthesis.",
            "On the properties of the input pattern fault model.",
            "Search space definition and exploration for nonuniform data reuse opportunities in data-dominant applications.",
            "Tutorial: Compiling concurrent languages for sequential processors.",
            "Rectilinear block placement using B*-trees.",
            "Minimum delay optimization for domino circuits - a coupling-aware approach.",
            "Compacting sequences with invariant transition frequencies.",
            "Sequential optimization in the absence of global reset.",
            "Compiler optimization on VLIW instruction scheduling for low power.",
            "On the hardware-software partitioning problem: System modeling and partitioning techniques.",
            "Gravity: Fast placement for 3-D VLSI.",
            "Congestion reduction during placement with provably good approximation bound.",
            "Synthesis of saturation arithmetic architectures.",
            "Constraints-driven scheduling and resource assignment.",
            "Address code generation for DSP instruction-set architectures.",
            "Introduction.",
            "SOC test architecture design for efficient utilization of test bandwidth.",
            "Test vector decomposition-based static compaction algorithms for combinational circuits.",
            "On test data volume reduction for multiple scan chain designs.",
            "Test data compression using dictionaries with selective entries and fixed-length indices.",
            "Multimode scan: Test per clock BIST for IP cores.",
            "Testing high-performance pipelined circuits with slow-speed testers.",
            "BIST and production testing of ADCs using imprecise stimulus.",
            "A circuit level fault model for resistive bridges.",
            "A data acquisition methodology for on-chip repair of embedded memories.",
            "A multiple bit upset tolerant SRAM memory."
        ]
    },
    {
        "name": "TODAES",
        "year": "2002",
        "info": "Volume 7, 2002",
        "count": 31,
        "papers": [
            "General technology mapping for field-programmable gate arrays based on lookup tables.",
            "ATPG tools for delay faults at the functional level.",
            "Prefetching for improved bus wrapper performance in cores.",
            "Cluster-aware iterative improvement techniques for partitioning large VLSI circuits.",
            "Microarchitectural synthesis of performance-constrained, low-power VLSI designs.",
            "Satisfiability models and algorithms for circuit delay computation.",
            "Constructing and exploiting linear schedules with prescribed parallelism.",
            "A fast algorithm for context-aware buffer insertion.",
            "An efficient register optimization algorithm for high-level synthesis from hierarchical behavioral specifications.",
            "Optimal time borrowing analysis and timing budgeting optimization for latch-based designs.",
            "Monotone bipartitioning problem in a planar point set with applications to VLSI.",
            "Initializability analysis of synchronous sequential circuits.",
            "Logic transformation for low-power synthesis.",
            "Fast placement approaches for FPGAs.",
            "Technology mapping algorithms for domino logic.",
            "Global array reference allocation.",
            "UST/DME: a clock tree router for general skew constraints.",
            "Efficient scheduling of conditional behaviors for high-level synthesis.",
            "Partitioning sequential programs for CAD using a three-step approach.",
            "Cluster assignment for high-performance embedded VLIW processors.",
            "Estimation of state line statistics in sequential circuits.",
            "False-noise analysis using logic implications.",
            "Guest editorial.",
            "BDD-based logic synthesis for LUT-based FPGAs.",
            "Reduction design for generic universal switch blocks.",
            "Run-time performance optimization of an FPGA-based deduction engine for SAT solvers.",
            "Behavioral synthesis of field programmable analog array circuits.",
            "Instruction generation for hybrid reconfigurable systems.",
            "Performance-driven placement for dynamically reconfigurable FPGAs.",
            "Efficient circuit clustering for area and power reduction in FPGAs.",
            "A search-based bump-and-refit approach to incremental routing for ECO applications in FPGAs."
        ]
    },
    {
        "name": "TODAES",
        "year": "2001",
        "info": "Volume 6, 2001",
        "count": 28,
        "papers": [
            "Performance-constrained hierarchical pipelining for behaviors, loops, and operations.",
            "Optimal test access architectures for system-on-a-chip.",
            "Architecture-level power estimation and design experiments.",
            "POSE: a parallel object-oriented synthesis environment.",
            "Co-synthesis of pipelined structures and instruction reordering constraints for instruction set processors.",
            "A mapping algorithm for computer-assisted exploration in the design of embedded systems.",
            "Data and memory optimization techniques for embedded systems.",
            "An algorithm for synthesis of large time-constrained heterogeneous adaptive systems.",
            "Intrinsic response for analog module testing using an analog testability bus.",
            "Verifying sequential equivalence using ATPG techniques.",
            "Processor modeling and code selection for retargetable compilation.",
            "Von Neumann hybrid cellular automata for generating deterministic test sequences.",
            "Constrained polygon transformations for incremental floorplanning.",
            "Closed form solutions to simultaneous buffer insertion/sizing and wire sizing.",
            "Efficient list-approximation techniques for floorplan area minimization.",
            "Integrated test of interacting controllers and datapaths.",
            "Introducing redundant computations in RTL data paths for reducing BIST resources.",
            "Slicible rectangular graphs and their optimal floorplans.",
            "Diagnostic simulation of stuck-at faults in sequential circuits using compact lists.",
            "A fast approach to computing exact solutions to the resource-constrained scheduling problem.",
            "Introspection: A register transfer level technique for cocurrent error detection and diagnosis in data dominated designs.",
            "Optimal design of synchronous circuits using software pipelining techniques.",
            "On the fundamental limitations of transformational design.",
            "Data memory design and exploration for low-power embedded systems.",
            "Using complete-1-distinguishability for FSM equivalence checking.",
            "Optimizing designs containing black boxes.",
            "Forced simulation: A technique for automating component reuse in embedded systems.",
            "An exact solution to the minimum size test pattern problem."
        ]
    },
    {
        "name": "TODAES",
        "year": "2000",
        "info": "Volume 5, 2000",
        "count": 35,
        "papers": [
            "A code-motion pruning technique for global scheduling.",
            "Multiway FPGA partitioning by fully exploiting design hierarchy.",
            "CMAPS: a cosynthesis methodology for application-oriented parallel systems.",
            "On the use of flexible, rectilinear blocks to obtain minimum-area floorplans in mixed block and cell designs.",
            "Power-delay optimizations in gate sizing.",
            "System-level power optimization: techniques and tools.",
            "Structural gate decomposition for depth-optimal technology mapping in LUT-based FPGA designs.",
            "A predictive system shutdown method for energy saving of event-driven computation.",
            "Simultaneous reference allocation in code generation for dual data memory bank ASIPs.",
            "Editorial.",
            "Power optimization of technology-dependent circuits based on symbolic computation of logic implications.",
            "Allocation of FIFO structures in RTL data paths.",
            "Synthesis of low-power selectively-clocked systems from high-level specification.",
            "Efficient optimal design space characterization methodologies.",
            "Regression-based RTL power modeling.",
            "Retiming-based factorization for sequential logic optimization.",
            "Hardware/software synthesis of formal specifications in codesign of embedded systems.",
            "Timing-driven routing for symmetrical array-based FPGAs.",
            "Modeling layout tools to derive forward estimates of area and delay at the RTL level.",
            "A codesign back-end approach for embedded system design.",
            "CLIP: integer-programming-based optimal layout synthesis of 2D CMOS cells.",
            "Dynamic state traversal for sequential circuit test generation.",
            "High-level library mapping for memories.",
            "Optimizing computations for effective block-processing.",
            "FILL and FUNI: algorithms to identify illegal states and sequentially untestable faults.",
            "Stochastic sequential machine synthesis with application to constrained sequence generation.",
            "On-chip vs. off-chip memory: the data partitioning problem in embedded processor-based systems.",
            "Environment modeling and language universality.",
            "Three-layer bubble-sorting-based nonManhattan channel routing.",
            "Efficient routability check algorithms for segmented channel routing.",
            "Guest Editorial.",
            "Code size minimization and retargetable assembly for custom EPIC and VLIW instruction formats.",
            "Constraint analysis for code generation: basic techniques and applications in FACTS.",
            "Graph-based code selection techniques for embedded processors.",
            "Retargetable compiled simulation of embedded processors using a machine description language."
        ]
    },
    {
        "name": "TODAES",
        "year": "1999",
        "info": "Volume 4, 1999",
        "count": 17,
        "papers": [
            "Bus-based communication synthesis on system level.",
            "A text-compression-based method for code size minimization in embedded systems.",
            "On the crossing distribution problem.",
            "Two-level logic minimization for low power.",
            "Procedure cloning: a transformation for improved system-level functional partitioning.",
            "Power reduction and power-delay trade-offs using logic transformations.",
            "Formal verification in hardware design: a survey.",
            "BIFEST: a built-in intermediate fault effect sensing and test generation system for CMOS bridging faults.",
            "Behavioral synthesis of combinational logic using spectral-based heuristics.",
            "Code generation of nested loops for DSP processors with heterogeneous registers and structural pipelining.",
            "Performance estimation of embedded software with instruction cache modeling.",
            "Simulation and sensitivity of linear analog circuits under parameter variations by Robust interval analysis.",
            "Functional multiple-output decomposition with application to technology mapping for lookup table-based FPGAs.",
            "Symbolic synthesis of clock-gating logic for power optimization of synchronous controllers.",
            "A flexible datapath allocation method for architectural synthesis.",
            "Power optimization using divide-and-conquer techniques for minimization of the number of operations.",
            "A methodology and algorithms for the design of hard real-time multitasking ASICs."
        ]
    },
    {
        "name": "TODAES",
        "year": "1998",
        "info": "Volume 3, 1998",
        "count": 29,
        "papers": [
            "Measurement and analysis of sequential design processes.",
            "Semantics and verification of action diagrams with linear timing.",
            "A new viewpoint on code generation for directed acyclic graphs.",
            "Cluster-cover a theoretical framework for a class of VLSI-CAD optimization problems.",
            "ICOS: an intelligent concurrent object-oriented synthesis methodology for multiprocessor systems.",
            "Code generation for fixed-point DSPs.",
            "Estimation of lower bounds in scheduling algorithms for high-level synthesis.",
            "Functional partitioning improvements over structural partitioning for packaging constraints and synthesis: tool performance.",
            "Breakpoints and breakpoint detection in source-level emulation.",
            "Functional test generation for delay faults in combinational circuits.",
            "Structural diagnosis of interconnects by coloring.",
            "Estimating the storage requirements of the rectangular and L-shaped corner stitching data structures.",
            "Effects of resource sharing on circuit delay: an assignment algorithm for clock period optimization.",
            "Auxiliary variables for BDD-based representation and manipulation of Boolean functions.",
            "Bounded-skew clock and Steiner routing.",
            "Confidence analysis for defect-level estimation of VLSI random testing.",
            "Rate analysis for embedded systems.",
            "Optimal clock period FPGA technology mapping for sequential circuits.",
            "The edge-based design rule model revisited.",
            "Eliminating false loops caused by sharing in control path.",
            "Optimal river routing with crosstalk constraints.",
            "Modeling reactive systems in Java.",
            "On measuring the effectiveness of various design validation approaches for PowerPC microprocessor embedded arrays.",
            "A timing-driven design and validation methodology for embedded real-time systems.",
            "ATM switch design by high-level modeling, formal verification and high-level synthesis.",
            "Specification and verification of pipelining in the ARM2 RISC microprocessor.",
            "High-level design verification of microprocessors via error modeling.",
            "Efficient equivalence checking of multi-phase designs using phase abstraction and retiming.",
            "EXFI: a low-cost fault injection system for embedded microprocessor-based boards."
        ]
    },
    {
        "name": "TODAES",
        "year": "1997",
        "info": "Volume 2, 1997",
        "count": 19,
        "papers": [
            "Recent developments in high-level synthesis.",
            "Model refinement for hardware-software codesign.",
            "AGENTS a distributed client-server system for leaf cell generation.",
            "A performance-driven IC/MCM placement algorithm featuring explicit design space exploration.",
            "Scheduling techniques for variable voltage low power designs.",
            "Functional design for testability of control-dominated architectures.",
            "Parallel logic simulation on a network of workstations using parallel virtual machine.",
            "Hmap: a fast mapper for EPGAs using extended GBDD hash tables.",
            "Board-level multiterminal net routing for FPGA-based logic emulation.",
            "Analysis of RC interconnections under ramp input.",
            "A survey of Boolean matching techniques for library binding.",
            "Datapath scheduling with multiple supply voltages and level converters.",
            "Event propagation conditions in circuit delay computation.",
            "Algorithms to compute bridging fault coverage of IDDQ test sets.",
            "Layout-driven RTL binding techniques for high-level synthesis using accurate estimators.",
            "An efficient ILP-based scheduling algorithm for control-dominated VHDL descriptions.",
            "A codesign experiment in acoustic echo cancellation GMDF.",
            "Memory data organization for improved cache performance in embedded processor applications.",
            "Code placement techniques for cache miss rate reduction."
        ]
    },
    {
        "name": "TODAES",
        "year": "1996",
        "info": "Volume 1, 1996",
        "count": 20,
        "papers": [
            "Power minimization in IC design: principles and applications.",
            "Automatic generation of functional vectors using the extended finite state machine model.",
            "Universal switch modules for FPGA design.",
            "Series-parallel functions and FPGA logic module design.",
            "Optimal folding of standard and custom cells.",
            "Combinational logic synthesis for LUT based field programmable gate arrays.",
            "From VHDL to efficient and first-time-right designs: a formal approach.",
            "Optimal register assignment to loops for embedded code generation.",
            "Transistor reordering for power minimization under delay constraint.",
            "Object-oriented cosynthesis of distributed embedded systems.",
            "Low power realization of finite state machines - a decomposition approach.",
            "A fast algorithm for minimizing FPGA combinational and sequential modules.",
            "An optimal clock period selection method based on slack minimization criteria.",
            "Efficient decomposition of polygons into L-shapes with application to VLSI layouts.",
            "Register estimation in unscheduled dataflow graphs.",
            "Gate-level test generation for sequential circuits.",
            "A recursive technique for computing lower-bound performance of schedules.",
            "The Unison algorithm: fast evaluation of Boolean expressions.",
            "Optimal wiresizing for interconnects with multiple sources.",
            "Rectilinear Steiner trees on a checkerboard."
        ]
    }
]