[
    {
        "name": "TOS",
        "year": "2022",
        "info": "Volume 18: 2022",
        "count": 9,
        "papers": [
            "Introduction to the Special Section on USENIX OSDI 2021.",
            "Nap: Persistent Memory Indexes for NUMA Architectures.",
            "Optimizing Storage Performance with Calibrated Interrupts.",
            "Survey of Distributed File System Design Choices.",
            "RAIL: Predictable, Low Tail Latency for NVMe Flash.",
            "Exploration and Exploitation for Buffer-Controlled HDD-Writes for SSD-HDD Hybrid Storage Server.",
            "Pattern-Based Prefetching with Adaptive Cache Management Inside of Solid-State Drives.",
            "The Concurrent Learned Indexes for Multicore Data Storage.",
            "Reprogramming 3D TLC Flash Memory based Solid State Drives."
        ]
    },
    {
        "name": "TOS",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 32,
        "papers": [
            "Thanking the TOS Associated Editors and Reviewers.",
            "Introduction to the Special Section on USENIX FAST 2020.",
            "Reliability of SSDs in Enterprise Storage Systems: A Large-Scale Field Study.",
            "Strong and Efficient Consistency with Consistency-aware Durability.",
            "Copy-on-Abundant-Write for Nimble File System Clones.",
            "NVMM-Oriented Hierarchical Persistent Client Caching for Lustre.",
            "Kreon: An Efficient Memory-Mapped Key-Value Store for Flash Storage.",
            "SSD-based Workload Characteristics and Their Performance Implications.",
            "Introduction to the Special Issue on USENIX ATC 2020.",
            "Design of LSM-tree-based Key-value SSDs with Bounded Tails.",
            "Twizzler: A Data-centric OS for Non-volatile Memory.",
            "Can Applications Recover from fsync Failures?",
            "Repair Pipelining for Erasure-coded Storage: Algorithms and Evaluation.",
            "Performance Modeling and Practical Use Cases for Black-Box SSDs.",
            "Penalty- and Locality-aware Memory Allocation in Redis Using Enhanced AET.",
            "Introduction to the Special Section on USENIX OSDI 2020.",
            "A Large-scale Analysis of Hundreds of In-memory Key-value Cache Clusters at Twitter.",
            "XStore: Fast RDMA-Based Ordered Key-Value Store Using Remote Learned Cache.",
            "Octopus+: An RDMA-Enabled Distributed Persistent Memory File System.",
            "Toward Virtual Machine Image Management for Persistent Memory.",
            "Reparo: A Fast RAID Recovery Scheme for Ultra-large SSDs.",
            "Multi-objective Optimization of Data Placement in a Storage-as-a-Service Federated Cloud.",
            "NVLSM: A Persistent Memory Key-Value Store Using Log-Structured Merge Tree with Accumulative Compaction.",
            "GoSeed: Optimal Seeding Plan for Deduplicated Storage.",
            "Introduction to the Special Section on USENIX FAST 2021.",
            "RocksDB: Evolution of Development Priorities in a Key-value Store Serving Large-scale Applications.",
            "Leveraging NVMe SSDs for Building a Fast, Cost-effective, LSM-tree-based KV Store.",
            "Lightweight Dynamic Redundancy Control with Adaptive Encoding for Server-based Storage.",
            "Programming Abstractions for Managing Workflows on Tiered Storage Systems.",
            "Improving the Performance of Deduplication-Based Backup Systems via Container Utilization Based Hot Fingerprint Entry Distilling.",
            "Two Reconfigurable NDP Servers: Understanding the Impact of Near-Data Processing on Data Center Applications.",
            "FluidSMR: Adaptive Management for Hybrid SMR Drives."
        ]
    },
    {
        "name": "TOS",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 26,
        "papers": [
            "Introduction to the Special Section on USENIX ATC 2019.",
            "The Reliability of Modern File Systems in the face of SSD Errors.",
            "Everyone Loves File: Oracle File Storage Service.",
            "Information Leakage in Encrypted Deduplication via Frequency Analysis: Attacks and Defenses.",
            "The Composite-File File System: Decoupling One-to-One Mapping of Files and Metadata for Better Performance.",
            "PBS: An Efficient Erasure-Coded Block Storage System Based on Speculative Partial Writes.",
            "Fast Erasure Coding for Data Storage: A Comprehensive Study of the Acceleration Techniques.",
            "Introduction to the Special Section on SOSP 2019.",
            "The Case for Custom Storage Backends in Distributed Storage Systems.",
            "Finding Bugs in File Systems with an Extensible Fuzzing Framework.",
            "On Fault Tolerance, Locality, and Optimality in Locally Repairable Codes.",
            "ShieldNVM: An Efficient and Fast Recoverable System for Secure Non-Volatile Memory.",
            "Practical Quick File Server Migration.",
            "SlimCache: An Efficient Data Compression Scheme for Flash-based Key-value Caching.",
            "Cosmos+ OpenSSD: Rapid Prototype for Flash Storage Systems.",
            "Spiffy: Enabling File-System Aware Storage Applications.",
            "B3-Tree: Byte-Addressable Binary B-Tree for Persistent Memory.",
            "Cache What You Need to Cache: Reducing Write Traffic in Cloud Cache via \"One-Time-Access-Exclusion\" Policy.",
            "Batch-file Operations to Optimize Massive Files Accessing: Analysis, Design, and Application.",
            "Introduction to the Special Section on Computational Storage.",
            "Cost-effective, Energy-efficient, and Scalable Storage Computing for Large-scale AI Applications.",
            "Bridging Storage Semantics Using Data Labels and Asynchronous I/O.",
            "Streaming Data Reorganization at Scale with DeltaFS Indexed Massive Directories.",
            "TH-DPMS: Design and Implementation of an RDMA-enabled Distributed Persistent Memory Storage System.",
            "Inspection and Characterization of App File Usage in Mobile Devices.",
            "Hybrid Codes: Flexible Erasure Codes with Optimized Recovery Performance."
        ]
    },
    {
        "name": "TOS",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 31,
        "papers": [
            "ACM TOS Distinguished Reviewers.",
            "On the Lifecycle of the File.",
            "Liquid Cloud Storage.",
            "Leveraging Glocality for Fast Failure Recovery in Distributed RAM Storage.",
            "TDDFS: A Tier-Aware Data Deduplication-Based File System.",
            "Introduction to the Special Issue on ACM International Systems and Storage Conference (SYSTOR) 2018.",
            "Lerna: Parallelizing Dependent Loops Using Speculation.",
            "REGISTOR: A Platform for Unstructured Data Processing Inside SSD Storage.",
            "Introduction to the Special Section on the 2018 USENIX Annual Technical Conference (ATC'18).",
            "TxFS: Leveraging File-system Crash Consistency to Provide ACID Transactions.",
            "CGraph: A Distributed Storage and Processing System for Concurrent Iterative Graph Analysis Jobs.",
            "SolarDB: Toward a Shared-Everything Database on Distributed Log-Structured Storage.",
            "Introduction to the Special Section on OSDI'18.",
            "Level Hashing: A High-performance and Flexible-resizing Persistent Hashing Index Structure.",
            "CrashMonkey and ACE: Systematically Testing File-System Crash Consistency.",
            "Performance and Resource Utilization of FUSE User-Space File Systems.",
            "CORES: Towards Scan-Optimized Columnar Storage for Nested Records.",
            "Mitigating Synchronous I/O Overhead in File Systems on Open-Channel SSDs.",
            "An Exploratory Study on Software-Defined Data Center Hard Disk Drives.",
            "ZoneTier: A Zone-based Storage Tiering and Caching Co-design to Integrate SSDs with SMR Drives.",
            "Enabling Efficient Updates in KV Storage via Hashing: Design and Performance Evaluation.",
            "An Attention-augmented Deep Architecture for Hard Drive Status Monitoring in Large-scale Storage Systems.",
            "EIC Message.",
            "Introduction to the Special Issue on USENIX FAST 2019.",
            "INSTalytics: Cluster Filesystem Co-design for Big-data Analytics.",
            "Sketching Volume Capacities in Deduplicated Storage.",
            "Countering Fragmentation in an Enterprise Storage System.",
            "Characterizing Output Bottlenecks of a Production Supercomputer: Analysis and Implications.",
            "Determining Data Distribution for Large Disk Enclosures with 3-D Data Templates.",
            "LDJ: Version Consistency Is Almost Free on Commercial Storage Devices.",
            "GraphOne: A Data Store for Real-time Analytics on Evolving Graphs."
        ]
    },
    {
        "name": "TOS",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 36,
        "papers": [
            "Editor-in Chief Letter.",
            "Introduction to the Special Issue on NVM and Storage.",
            "UnistorFS: A Union Storage File System Design for Resource Sharing between Memory and Storage on Persistent RAM-Based Systems.",
            "HiNFS: A Persistent Memory File System with Both Buffering and Direct-Access.",
            "clfB-tree: Cacheline Friendly Persistent B-tree for NVRAM.",
            "Persisting RB-Tree into NVM in a Consistency Perspective.",
            "DudeTx: Durable Transactions Made Decoupled.",
            "Bidirectional Database Storage and SQL Query Exploiting RRAM-Based Process-in-Memory Structure.",
            "A Novel ReRAM-Based Processing-in-Memory Architecture for Graph Traversal.",
            "An Analysis of Flash Page Reuse With WOM Codes.",
            "An SLC-Like Programming Scheme for MLC Flash Memory.",
            "Fast Miss Ratio Curve Modeling for Storage Cache.",
            "Cluster and Single-Node Analysis of Long-Term Deduplication Patterns.",
            "Empirical Evaluation and Enhancement of Enterprise Storage System Request Scheduling.",
            "A Low-cost Disk Solution Enabling LSM-tree to Achieve High Performance for Mixed Read/Write Workloads.",
            "Characterizing 3D Floating Gate NAND Flash: Observations, Analyses, and Implications.",
            "OrcFS: Orchestrated File System for Flash Storage.",
            "Challenges and Solutions for Tracing Storage Systems: A Case Study with Spectrum Scale.",
            "Workload Characterization for Enterprise Disk Drives.",
            "Introduction to the Special Issue on USENIX FAST 2018.",
            "Protocol-Aware Recovery for Consensus-Based Distributed Storage.",
            "Efficient Directory Mutations in a Full-Path-Indexed File System.",
            "Fail-Slow at Scale: Evidence of Hardware Performance Faults in Large Production Systems.",
            "Bringing Order to Chaos: Barrier-Enabled I/O Stack for Flash Storage.",
            "M-CLOCK: Migration-optimized Page Replacement Algorithm for Hybrid Memory Architecture.",
            "DIDACache: An Integration of Device and Application for Flash-based Key-value Caching.",
            "Write Energy Reduction for PCM via Pumping Efficiency Improvement.",
            "ROS: A Rack-based Optical Storage System with Inline Accessibility for Long-Term Data Preservation.",
            "Introduction to the Special Issue on SYSTOR 2017.",
            "FlashNet: Flash/Network Stack Co-Design.",
            "Performance Characterization of NVMe-over-Fabrics Storage Disaggregation.",
            "Exploiting Internal Parallelism for Address Translation in Solid-State Drives.",
            "Management of Next-Generation NAND Flash to Achieve Enterprise-Level Endurance and Latency Targets.",
            "LibPM: Simplifying Application Usage of Persistent Memory.",
            "Towards Robust File System Checkers.",
            "HIL: A Framework for Compositional FTL Development and Provably-Correct Crash Recovery."
        ]
    },
    {
        "name": "TOS",
        "year": "2017",
        "info": "Volume 13: 2017",
        "count": 40,
        "papers": [
            "Introduction to the Special Issue on USENIX FAST 2016.",
            "Treating the Storage Stack Like a Network.",
            "Writes Wrought Right, and Other Adventures in File System Optimization.",
            "Isotope: ACID Transactions for Block Storage.",
            "WiscKey: Separating Keys from Values in SSD-Conscious Storage.",
            "Customizable SLO and Its Near-Precise Enforcement for Storage Bandwidth.",
            "CDF-LDPC: A New Error Correction Method for SSD to Improve the Read Performance.",
            "Exploiting I/O Reordering and I/O Interleaving to Improve Application Launch Performance.",
            "The Design and Implementation of a Rekeying-Aware Encrypted Deduplication Storage System.",
            "Introduction to the Special Issue on MSST 2016.",
            "Lazy Exact Deduplication.",
            "Reducing Write Amplification of Flash Storage through Cooperative Data Management with NVM.",
            "Optimizing File Systems with Fine-grained Metadata Journaling on Byte-addressable NVM.",
            "Understanding and Alleviating the Impact of the Flash Address Translation on Solid State Devices.",
            "High-Performance General Functional Regenerating Codes with Near-Optimal Repair Bandwidth.",
            "Understanding I/O Performance Behaviors of Cloud Storage from a Client's Perspective.",
            "ExaPlan: Efficient Queueing-Based Data Placement, Provisioning, and Load Balancing for Large Tiered Storage Systems.",
            "Introduction to the Special Issue on USENIX FAST 2017.",
            "Application Crash Consistency and Performance with CCFS.",
            "Redundancy Does Not Imply Fault Tolerance: Analysis of Distributed Storage Reactions to File-System Faults.",
            "vNFS: Maximizing NFS Performance with Compounds and Vectorized I/O.",
            "Tiny-Tail Flash: Near-Perfect Elimination of Garbage Collection Tail Latencies in NAND SSDs.",
            "Efficient Free Space Reclamation in WAFL.",
            "Pannier: Design and Analysis of a Container-Based Flash Cache for Compound Objects.",
            "Efficient and Available In-Memory KV-Store with Hybrid Erasure Coding and Replication.",
            "Systematic Erasure Codes with Optimal Repair Bandwidth and Storage.",
            "Hybris: Robust Hybrid Cloud Storage.",
            "Introduction to the Special Issue on Massive Storage Systems and Technology 2017.",
            "Building Efficient Key-Value Stores via a Lightweight Compaction Tree.",
            "Ouroboros Wear Leveling for NVRAM Using Hierarchical Block Migration.",
            "Experience from Two Years of Visualizing Flash with SSDPlayer.",
            "SUPA: A Single Unified Read-Write Buffer and Pattern-Change-Aware FTL for the High Performance of Multi-Channel SSD.",
            "Optimal Repair Layering for Erasure-Coded Data Centers: From Theory to Practice.",
            "CosaFS: A Cooperative Shingle-Aware File System.",
            "TinyLFU: A Highly Efficient Cache Admission Policy.",
            "Client-Side Journaling for Durable Shared Storage.",
            "GCMix: An Efficient Data Protection Scheme against the Paired Page Interference.",
            "Modeling Drive-Managed SMR Performance.",
            "hfplayer: Scalable Replay for Intensive Block I/O Workloads.",
            "GDS-LC: A Latency- and Cost-Aware Client Caching Scheme for Cloud Storage."
        ]
    },
    {
        "name": "TOS",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 24,
        "papers": [
            "Introduction to the Special Issue on MSST 2015.",
            "Classifying Data to Reduce Long-Term Data Movement in Shingled Write Disks.",
            "Blurred Persistence: Efficient Transactions in Persistent Memory.",
            "GCTrees: Garbage Collecting Snapshots.",
            "LoneStar RAID: Massive Array of Offline Disks for Archival Systems.",
            "NANDFlashSim: High-Fidelity, Microarchitecture-Aware NAND Flash Memory Simulation.",
            "Can We Group Storage? Statistical Techniques to Identify Predictive Groupings in Storage System Accesses.",
            "Improving Flash-Based Disk Cache with Lazy Adaptive Replacement.",
            "Efficient Dynamic Provable Possession of Remote Data via Update Trees.",
            "SWANS: An Interdisk Wear-Leveling Strategy for RAID-0 Structured SSD Arrays.",
            "Does RAID Improve Lifetime of SSD Arrays?",
            "MultiLanes: Providing Virtualized Storage for OS-Level Virtualization on Manycores.",
            "Internal Parallelism of Flash Memory-Based Solid-State Drives.",
            "Storage Workload Identification.",
            "Exploiting Sequential and Temporal Localities to Improve Performance of NAND Flash-Based SSDs.",
            "H-Scale: A Fast Approach to Scale Disk Arrays via Hybrid Stripe Deployment.",
            "A User-Friendly Log Viewer for Storage Systems.",
            "TrueErase: Leveraging an Auxiliary Data Path for Per-File Secure Deletion.",
            "Efficient Memory-Mapped I/O on Fast Storage Device.",
            "Efficient Deduplication in a Distributed Primary Storage Infrastructure.",
            "Write Skew and Zipf Distribution: Evidence and Implications.",
            "LDM: Log Disk Mirroring with Improved Performance and Reliability for SSD-Based Disk Arrays.",
            "FlexDPDP: Flexlist-Based Optimized Dynamic Provable Data Possession.",
            "Tools for Predicting the Reliability of Large-Scale Storage Systems."
        ]
    },
    {
        "name": "TOS",
        "year": "2015",
        "info": "Volume 11: 2015",
        "count": 19,
        "papers": [
            "Low-Complexity Implementation of RAID Based on Reed-Solomon Codes.",
            "Efficient Hybrid Inline and Out-of-Line Deduplication for Backup Storage.",
            "HEAPO: Heap-Based Persistent Object Store.",
            "Z-MAP: A Zone-Based Flash Translation Layer with Workload Classification for Solid-State Drive.",
            "SmartCon: SmartCon: Smart Context Switching for Fast Storage Devices.",
            "Visualizing Block IO Workloads.",
            "Data Sorting in Flash Memory.",
            "Design Tradeoffs of SSDs: From Energy Consumption's Perspective.",
            "Rebuttal to \"Beyond MTTDL: A Closed-Form RAID-6 Reliability Equation\".",
            "An Energy-Efficient and Reliable Storage Mechanism for Data-Intensive Academic Archive Systems.",
            "Frog: A Framework for Context-Based File Systems.",
            "Accelerating File System Metadata Access with Byte-Addressable Nonvolatile Memory.",
            "On the Trade-Offs among Performance, Energy, and Endurance in a Versatile Hybrid Drive.",
            "ImmortalGraph: A System for Storage and Analysis of Temporal Graphs.",
            "Introduction to the Special Issue on USENIX FAST 2015.",
            "Skylight - A Window on Shingled Disk Operation.",
            "RAIDShield: Characterizing, Monitoring, and Proactively Protecting Against Disk Failures.",
            "BetrFS: Write-Optimization in a Kernel File System.",
            "Shuffle Index: Efficient and Private Access to Outsourced Data."
        ]
    },
    {
        "name": "TOS",
        "year": "2014",
        "info": "Volume 10: 2014",
        "count": 17,
        "papers": [
            "A Unified Buffer Cache Architecture that Subsumes Journaling Functionality via Nonvolatile Memory.",
            "Ffsck: The Fast File-System Checker.",
            "A Study of Linux File System Evolution.",
            "Sector-Disk (SD) Erasure Codes for Mixed Failure Modes in RAID Systems.",
            "Towards High-Performance SAN with Fast Storage Devices.",
            "Read-Performance Optimization for Deduplication-Based Storage Systems in the Cloud.",
            "Beyond MTTDL: A Closed-Form RAID 6 Reliability Equation.",
            "Analytic Models of SSD Write Performance.",
            "Random Slicing: Efficient and Scalable Data Placement for Large-Scale Storage Systems.",
            "Design and Prototype of a Solid-State Cache.",
            "Caching Strategies for High-Performance Storage Media.",
            "A Lightweight Data Location Service for Nondeterministic Exascale Storage Systems.",
            "Introduction to the Special Issue on USENIX FAST 2014.",
            "STAIR Codes: A General Family of Erasure Codes for Tolerating Device and Sector Failures.",
            "Evaluating Phase Change Memory for Enterprise Storage Systems: A Study of Caching and Tiering Approaches.",
            "Agility and Performance in Elastic Distributed Storage.",
            "Checking the Integrity of Transactional Mechanisms."
        ]
    },
    {
        "name": "TOS",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 14,
        "papers": [
            "Ursa: Scalable Load and Power Management in Cloud Storage Systems.",
            "Improving Bandwidth Efficiency for Consistent Multistream Storage.",
            "Pyramid Codes: Flexible Schemes to Trade Space for Access Efficiency in Reliable Data Storage Systems.",
            "Exploiting Redundancies and Deferred Writes to Conserve Energy in Erasure-Coded Storage Clusters.",
            "Generalized Optimal Response Time Retrieval of Replicated Data from Storage Arrays.",
            "Datacenter Scale Evaluation of the Impact of Temperature on Hard Disk Drive Failures.",
            "SCMFS: A File System for Storage Class Memory and its Extensions.",
            "Dynamic Synchronous/Asynchronous Replication.",
            "BTRFS: The Linux B-Tree Filesystem.",
            "A Prefetching Scheme Exploiting both Data Layout and Access History on Disk.",
            "Design and Evaluation of a New Approach to RAID-0 Scaling.",
            "DepSky: Dependable and Secure Storage in a Cloud-of-Clouds.",
            "Hybrid Associative Flash Translation Layer for the Performance Optimization of Chip-Level Parallel Flash Memory.",
            "Evaluation of a Hybrid Approach for Efficient Provenance Storage."
        ]
    },
    {
        "name": "TOS",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 15,
        "papers": [
            "An adaptive write buffer management scheme for flash-based SSDs.",
            "Efficient software implementations of large finite fields GF(2n) for secure storage applications.",
            "A caching-oriented management design for the performance enhancement of solid-state drives.",
            "HPDA: A hybrid parity-based disk array for enhanced performance and reliability.",
            "Transparent Online Storage Compression at the Block-Level.",
            "Analysis of Workload Behavior in Scientific and Historical Long-Term Data Repositories.",
            "MFTL: A Design and Implementation for MLC Flash Memory Storage Systems.",
            "Efficient cooperative backup with decentralized trust management.",
            "File system virtual appliances: Portable file system implementations.",
            "Generalized X-code: An efficient RAID-6 code for arbitrary size of disk array.",
            "Editorial note.",
            "Introduction to the special issue USENIX FAST 2012.",
            "WAN-optimized replication of backup datasets using stream-informed delta compression.",
            "Revisiting storage for smartphones.",
            "Recon: Verifying file system consistency at runtime."
        ]
    },
    {
        "name": "TOS",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 14,
        "papers": [
            "A driver-layer caching policy for removable storage devices.",
            "Fast file existence checking in archiving systems.",
            "PRE-BUD: Prefetching for energy-efficient parallel I/O systems with buffer disks.",
            "Request Bridging and Interleaving: Improving the Performance of Small Synchronous Updates under Seek-Optimizing Disk Subsystems.",
            "Disk Scrubbing Versus Intradisk Redundancy for RAID Storage Systems.",
            "PRESIDIO: A Framework for Efficient Archival Data Storage.",
            "Guest Editorial.",
            "Understanding and Improving Computational Science Storage Access through Continuous Characterization.",
            "YouChoose: Choosing your Storage Device as a Performance Interface to Consolidated I/O Service.",
            "Reducing Repair Traffic in P2P Backup Systems: Exact Regenerating Codes on Hierarchical Codes.",
            "A Hybrid Approach to Failed Disk Recovery Using RAID-6 Codes: Algorithms and Performance Evaluation.",
            "Emulating goliath storage systems with David.",
            "Making the common case the only case with anticipatory memory allocation.",
            "A study of practical deduplication."
        ]
    },
    {
        "name": "TOS",
        "year": "2010",
        "info": "Volume 6: 2010/2011",
        "count": 17,
        "papers": [
            "Optimizing MEMS-based storage devices for mobile battery-powered systems.",
            "NCQ vs. I/O scheduler: Preventing unexpected misbehaviors.",
            "FRASH: Exploiting storage class memory in hybrid file system for hierarchical storage.",
            "Differential RAID: Rethinking RAID for SSD reliability.",
            "A strategy to emulate NOR flash with NAND flash.",
            "Extract and infer quickly: Obtaining sector geometry of modern hard disk drives.",
            "SOPA: Selecting the optimal caching policy adaptively.",
            "Guest editorial: FAST'10.",
            "Understanding latent sector errors and how to protect against them.",
            "Optimizing energy and performance for server-class file system workloads.",
            "Membrane: Operating system support for restartable file systems.",
            "quFiles: The right file at the right time.",
            "I/O Deduplication: Utilizing content similarity to improve I/O performance.",
            "DFS: A file system for virtualized flash storage.",
            "A hybrid flash translation layer with adaptive merge for SSDs.",
            "Minimum density RAID-6 codes.",
            "Online availability upgrades for parity-based RAIDs through supplementary parity augmentations."
        ]
    },
    {
        "name": "TOS",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 16,
        "papers": [
            "P/PA-SPTF: Parallelism-aware request scheduling algorithms for MEMS-based storage devices.",
            "A new approach to secure logging.",
            "Umbrella file system: Storage management across heterogeneous devices.",
            "Efficient management of idleness in storage systems.",
            "POTSHARDS - a secure, recoverable, long-term archival storage system.",
            "Storing semi-structured data on disk drives.",
            "Higher reliability redundant disk arrays: Organization, operation, and coding.",
            "Divide-and-conquer scheme for strictly optimal retrieval of range queries.",
            "Dynamic load balancing for I/O-intensive applications on clusters.",
            "A file assignment strategy independent of workload characteristic assumptions.",
            "Introduction to special issue FAST 2009.",
            "Preventing history forgery with secure provenance.",
            "Causality-based versioning.",
            "Cumulus: Filesystem backup to the cloud.",
            "CA-NFS: A congestion-aware network file system.",
            "Generating realistic impressions for file-system benchmarking."
        ]
    },
    {
        "name": "TOS",
        "year": "2008",
        "info": "Volume 4: 2008/2009",
        "count": 15,
        "papers": [
            "A new intra-disk redundancy scheme for high-reliability RAID storage systems in the presence of unrecoverable errors.",
            "Predictive data grouping: Defining the bounds of energy and latency reduction through predictive data grouping and replication.",
            "A new approach to dynamic self-tuning of database buffers.",
            "Intel Turbo Memory: Nonvolatile disk caches in the storage hierarchy of mainstream computer systems.",
            "A nine year study of file system and storage benchmarking.",
            "Introduction to special issue of USENIX FAST 2008.",
            "Are disks the dominant contributor for storage failures - A comprehensive study of storage subsystem failure characteristics.",
            "An analysis of data corruption in the storage stack.",
            "Portably solving file races with hardness amplification.",
            "Write off-loading: Practical power management for enterprise storage.",
            "Kinesis: A new approach to replica placement in distributed storage systems.",
            "QoS for storage subsystems using IEEE-1394.",
            "Rethinking FTP: Aggressive block reordering for large file transfers.",
            "JFTL: A flash translation layer based on a journal remapping for flash memory.",
            "GRID codes: Strip-based erasure codes with high fault tolerance for storage systems."
        ]
    },
    {
        "name": "TOS",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 18,
        "papers": [
            "Zoned-RAID.",
            "Dynamic data reallocation in disk arrays.",
            "SLAS: An efficient approach to scaling round-robin striped volumes.",
            "Extending ACID semantics to the file system.",
            "A buffer cache management scheme exploiting both temporal and spatial localities.",
            "Building MEMS-based storage systems for streaming media.",
            "Introduction to special issue USENIX FAST 2007.",
            "Understanding disk failure rates: What does an MTTF of 1, 000, 000 hours mean to you?",
            "A five-year study of file-system metadata.",
            "Optimal multistream sequential prefetching in a shared cache.",
            "Strong accountability for network storage.",
            "Contributing storage using the transparent file system.",
            "PARAID: A gear-shifting power-aware RAID.",
            "Niobe: A practical replication protocol.",
            "B-trees, shadowing, and clones.",
            "Workload-based generation of administrator hints for optimizing database storage utilization.",
            "A utility-based unified disk scheduling framework for shared mixed-media services.",
            "Storage optimization for large-scale distributed stream-processing systems."
        ]
    },
    {
        "name": "TOS",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 18,
        "papers": [
            "Using MEMS-based storage in computer systems - MEMS storage architectures.",
            "Efficient identification of hot data for flash memory storage systems.",
            "Thermal issues in disk drive design: Challenges and possible solutions.",
            "Versatility and Unix semantics in namespace unification.",
            "Authentication and integrity in outsourced databases.",
            "Using MEMS-based storage in computer systems - device modeling and management.",
            "On incremental file system development.",
            "Spin MOSFETs as a basis for spintronics.",
            "Constructing collaborative desktop storage caches for large scientific datasets.",
            "Intelligent storage: Cross-layer optimization for soft real-time workload.",
            "Storage performance virtualization via throughput and latency control.",
            "The Conquest file system: Better performance through a disk/persistent-RAM hybrid design.",
            "Multicollective I/O: A technique for exploiting inter-file access patterns.",
            "An approach to virtual allocation in storage systems.",
            "Modeling and improving security of a local disk system for write-intensive workloads.",
            "Improving duplicate elimination in storage systems.",
            "The Design of efficient initialization and crash recovery for log-based file systems over flash memory.",
            "Efficient indexing data structures for flash-based sensor devices."
        ]
    },
    {
        "name": "TOS",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 17,
        "papers": [
            "Editorial.",
            "Consistent and automatic replica regeneration.",
            "Cheap recovery: a key to self-managing state.",
            "DISP: Practical, efficient, secure and fault-tolerant distributed data storage.",
            "Reliability and security of RAID storage systems and D2D archives using SATA disk drives.",
            "Tunable randomization for load management in shared-disk clusters.",
            "Improving storage system availability with D-GRAID.",
            "Network file storage with graceful performance degradation.",
            "Ext3cow: a time-shifting file system for regulatory compliance.",
            "Mining block correlations to improve storage performance.",
            "Bridging the digital divide: storage media + postal network = generic high-bandwidth communication.",
            "Multiresolution storage and search in sensor networks.",
            "Efficient disk replacement and data migration algorithms for large disk subsystems.",
            "Performance directed energy management for main memory and disks.",
            "Efficient management for large-scale flash-memory storage systems with resource conservation.",
            "Scalable and fault-tolerant support for variable bit-rate data in the exedra streaming server.",
            "Triage: Performance differentiation for storage systems using adaptive control."
        ]
    }
]