[
    {
        "name": "TRETS",
        "year": "2022",
        "info": "Volume 15: 2022",
        "count": 22,
        "papers": [
            "Introduction to Special Section on FPGA 2020.",
            "When Massive GPU Parallelism Ain't Enough: A Novel Hardware Architecture of 2D-LSTM Neural Network.",
            "Hipernetch: High-Performance FPGA Network Switch.",
            "Buffer Placement and Sizing for High-Performance Dataflow Circuits.",
            "Enhancing the Security of FPGA-SoCs via the Usage of ARM TrustZone and a Hybrid-TPM.",
            "Low-precision Floating-point Arithmetic for High-performance FPGA-based CNN Acceleration.",
            "Note from the TRETS EiC about the new Journal-first track in FPT'21.",
            "Design and Evaluation of a Tunable PUF Architecture for FPGAs.",
            "RWRoute: An Open-source Timing-driven Router for Commercial FPGAs.",
            "Rethinking Embedded Blocks for Machine Learning Applications.",
            "The Strong Scaling Advantage of FPGAs in HPC for N-body Simulations.",
            "Introduction to Special Issue on FPGAs in Data Centers.",
            "The Impact of Terrestrial Radiation on FPGAs in Data Centers.",
            "Request, Coalesce, Serve, and Forget: Miss-Optimized Memory Systems for Bandwidth-Bound Cache-Unfriendly Applications on FPGAs.",
            "Cloud Building Block Chip for Creating FPGA and ASIC Clouds.",
            "Elastic-DF: Scaling Performance of DNN Inference in FPGA Clouds through Automatic Partitioning.",
            "NASCENT2: Generic Near-Storage Sort Accelerator for Data Analytics on SmartSSD.",
            "BlastFunction: A Full-stack Framework Bringing FPGA Hardware Acceleration to Cloud-native Applications.",
            "xDNN: Inference for Deep Convolutional Neural Networks.",
            "Deploying Multi-tenant FPGAs within Linux-based Cloud Infrastructure.",
            "Hardware Acceleration of High-Performance Computational Flow Dynamics Using High-Bandwidth Memory-Enabled Field-Programmable Gate Arrays.",
            "BurstZ+: Eliminating The Communication Bottleneck of Scientific Computing Accelerators via Accelerated Compression."
        ]
    },
    {
        "name": "TRETS",
        "year": "2020",
        "info": "Volume 14: 2020/2021",
        "count": 20,
        "papers": [
            "CoNFV: A Heterogeneous Platform for Scalable Network Function Virtualization.",
            "An OpenGL Compliant Hardware Implementation of a Graphic Processing Unit Using Field Programmable Gate Array-System on Chip Technology.",
            "PipeArch: Generic and Context-Switch Capable Data Processing on FPGAs.",
            "Parallel Unary Computing Based on Function Derivatives.",
            "Large-scale Cellular Automata on FPGAs: A New Generic Architecture and a Framework.",
            "Design and Analysis of Configurable Ring Oscillators for True Random Number Generation Based on Coherent Sampling.",
            "Practical Model Checking on FPGAs.",
            "Specializing FGPU for Persistent Deep Learning.",
            "A Software/Hardware Co-Design of Crystals-Dilithium Signature Scheme.",
            "Analytical Performance Estimation for Large-Scale Reconfigurable Dataflow Platforms.",
            "Process Variability Analysis in Interconnect, Logic, and Arithmetic Blocks of 16-nm FinFET FPGAs.",
            "Hardware Context Switch-based Cryptographic Accelerator for Handling Multiple Streams.",
            "Enhancing the Scalability of Multi-FPGA Stencil Computations via Highly Optimized HDL Components.",
            "A Deep Learning Framework to Predict Routability for FPGA Circuit Placement.",
            "Programming and Synthesis for Software-defined FPGA Acceleration: Status and Future Prospects.",
            "BISWSRBS: A Winograd-based CNN Accelerator with a Fine-grained Regular Sparsity Pattern and Mixed Precision Quantization.",
            "CGRA-EAM - Rapid Energy and Area Estimation for Coarse-grained Reconfigurable Architectures.",
            "Dependency Graph-based High-level Synthesis for Maximum Instruction Parallelism.",
            "ACE-GCN: A Fast Data-driven FPGA Accelerator for GCN Embedding.",
            "Reconfigurable Framework for Resilient Semantic Segmentation for Space Applications."
        ]
    },
    {
        "name": "TRETS",
        "year": "2020",
        "info": "Volume 13: 2020",
        "count": 21,
        "papers": [
            "DSL-Based Hardware Generation with Scala: Example Fast Fourier Transforms and Sorting Networks.",
            "RAiSD-X: A Fast and Accurate FPGA System for the Detection of Positive Selection in Thousands of Genomes.",
            "Feel Free to Interrupt: Safe Task Stopping to Enable FPGA Checkpointing and Context Switching.",
            "Fast Turnaround HLS Debugging Using Dependency Analysis and Debug Overlays.",
            "In-Circuit Debugging with Dynamic Reconfiguration of FPGA Interconnects.",
            "HopliteBuf: Network Calculus-Based Design of FPGA NoCs with Provably Stall-Free FIFOs.",
            "Kernel Normalised Least Mean Squares with Delayed Model Adaptation.",
            "Substream-Centric Maximum Matchings on FPGA.",
            "VTR 8: High-performance CAD and Customizable FPGA Architecture Modelling.",
            "Model-based Design of Hardware SC Polar Decoders for FPGAs.",
            "Processing Grid-format Real-world Graphs on DRAM-based FPGA Accelerators with Application-specific Caching Mechanisms.",
            "FPGA Logic Block Architectures for Efficient Deep Learning Inference.",
            "Optimizing OpenCL-Based CNN Design on FPGA with Comprehensive Design Space Exploration and Collaborative Performance Modeling.",
            "Reconfigurable Framework for Environmentally Adaptive Resilience in Hybrid Space Systems.",
            "FPGADefender: Malicious Self-oscillator Scanning for Xilinx UltraScale + FPGAs.",
            "Partitioning and Scheduling with Module Merging on Dynamic Partial Reconfigurable FPGAs.",
            "Introduction to Special Section on FCCM 2019.",
            "Accelerating FPGA Routing Through Algorithmic Enhancements and Connection-aware Parallelization.",
            "MEG: A RISCV-based System Emulation Infrastructure for Near-data Processing Using FPGAs and High-bandwidth Memory.",
            "FOS: A Modular FPGA Operating System for Dynamic Workloads.",
            "UNILOGIC: A Novel Architecture for Highly Parallel Reconfigurable Systems."
        ]
    },
    {
        "name": "TRETS",
        "year": "2019",
        "info": "Volume 12: 2019",
        "count": 24,
        "papers": [
            "An Efficient Memory Partitioning Approach for Multi-Pattern Data Access via Data Reuse.",
            "[DL] A Survey of FPGA-based Neural Network Inference Accelerators.",
            "COFFE 2: Automatic Modelling and Optimization of Complex and Heterogeneous FPGA Architectures.",
            "In-Depth Analysis on Microarchitectures of Modern Heterogeneous CPU-FPGA Platforms.",
            "FlexSaaS: A Reconfigurable Accelerator for Web Search Selection.",
            "Editorial: A Message from the New Editor-in-Chief.",
            "FeatherNet: An Accelerated Convolutional Neural Network Design for Resource-constrained FPGAs.",
            "Fast Adjustable NPN Classification Using Generalized Symmetries.",
            "Exact and Practical Modulo Scheduling for High-Level Synthesis.",
            "Automata Processing in Reconfigurable Architectures: In-the-Cloud Deployment, Cross-Platform Evaluation, and Fast Symbol-Only Reconfiguration.",
            "A Novel FPGA Implementation of a Time-to-Digital Converter Supporting Run-Time Estimation and Compensation.",
            "Introduction to the Special Section on Security in FPGA-accelerated Cloud and Datacenters.",
            "Leakier Wires: Exploiting FPGA Long Wires for Covert- and Side-channel Attacks.",
            "Mitigating Electrical-level Attacks towards Secure Multi-Tenant FPGAs in the Cloud.",
            "A Protection and Pay-per-use Licensing Scheme for On-cloud FPGA Circuit IPs.",
            "Recent Attacks and Defenses on FPGA-based Systems.",
            "Optimizing Bit-Serial Matrix Multiplication for Reconfigurable Computing.",
            "Novel Congestion-estimation and Routability-prediction Methods based on Machine Learning for Modern FPGAs.",
            "Distributed Inference over Decision Tree Ensembles on Clusters of FPGAs.",
            "The FPOA, a Medium-grained Reconfigurable Architecture for High-level Synthesis.",
            "A Design Flow Engine for the Support of Customized Dynamic High Level Synthesis Flows.",
            "FRoC 2.0: Automatic BRAM and Logic Testing to Enable Dynamic Voltage Scaling for FPGA Applications.",
            "GraVF-M: Graph Processing System Generation for Multi-FPGA Platforms.",
            "Unrolling Ternary Neural Networks."
        ]
    },
    {
        "name": "TRETS",
        "year": "2018",
        "info": "Volume 11: 2018/2019",
        "count": 27,
        "papers": [
            "Introduction to the Special Section on FCCM'16.",
            "High-Performance Instruction Scheduling Circuits for Superscalar Out-of-Order Soft Processors.",
            "KAPow: High-Accuracy, Low-Overhead Online Per-Module Power Estimation for FPGA Designs.",
            "Continuous Online Self-Monitoring Introspection Circuitry for Timing Repair by Incremental Partial-Reconfiguration (COSMIC TRIP).",
            "Fine-Grained Module-Based Error Recovery in FPGA-Based TMR Systems.",
            "General-Purpose Computing with Soft GPUs on FPGAs.",
            "Enhancing FPGAs with Magnetic Tunnel Junction-Based Block RAMs.",
            "RIPL: A Parallel Image Processing Language for FPGAs.",
            "An Evaluation on the Accuracy of the Minimum-Width Transistor Area Models in Ranking the Layout Area of FPGA Architectures.",
            "Framework for Rapid Performance Estimation of Embedded Soft Core Processors.",
            "Preemption of the Partial Reconfiguration Process to Enable Real-Time Computing With FPGAs.",
            "Wotan: Evaluating FPGA Architecture Routability without Benchmarks.",
            "Reconfigurable Hardware Architecture for Authenticated Key Agreement Protocol Over Binary Edwards Curve.",
            "Automated Synthesis of Streaming Transfer Level Hardware Designs.",
            "Introduction to the Special Section on Deep Learning in FPGAs.",
            "High-Efficiency Convolutional Ternary Neural Networks with Custom Adder Trees and Weight Compression.",
            "FINN-R: An End-to-End Deep-Learning Framework for Fast Exploration of Quantized Neural Networks.",
            "Lightening the Load with Highly Accurate Storage- and Energy-Efficient LightNNs.",
            "NEURAghe: Exploiting CPU-FPGA Synergies for Efficient and Flexible CNN Inference Acceleration on Zynq SoCs.",
            "Optimizing CNN-based Segmentation with Deeply Customized Convolutional and Deconvolutional Architectures on FPGA.",
            "You Cannot Improve What You Do not Measure: FPGA vs. ASIC Efficiency Gaps for Convolutional Neural Network Inference.",
            "ReDCrypt: Real-Time Privacy-Preserving Deep Learning Inference in Clouds Using FPGAs.",
            "Instruction Driven Cross-layer CNN Accelerator for Fast Detection on FPGA.",
            "PIMap: A Flexible Framework for Improving LUT-Based Technology Mapping via Parallelized Iterative Optimization.",
            "FPGA-based Acceleration of FT Convolution for Pulsar Search Using OpenCL.",
            "Efficient Fine-grained Processor-logic Interactions on the Cache-coherent Zynq Platform.",
            "Loop Unrolling for Energy Efficiency in Low-Cost Field-Programmable Gate Arrays."
        ]
    },
    {
        "name": "TRETS",
        "year": "2016",
        "info": "Volume 10: 2016/2017",
        "count": 29,
        "papers": [
            "A Framework for Evaluating and Optimizing FPGA-Based SoCs for Aerospace Computing.",
            "Analysis of Fixed, Reconfigurable, and Hybrid Devices with Computational, Memory, I/O, & Realizable-Utilization Metrics.",
            "Dynamic Task Mapping with Congestion Speculation for Reconfigurable Network-on-Chip.",
            "A Flexible SoC and Its Methodology for Parser-Based Applications.",
            "A Microcoded Kernel Recursive Least Squares Processor Using FPGA Technology.",
            "Acceleration of k-Means Algorithm Using Altera SDK for OpenCL.",
            "Microarchitecture and Circuits for a 200 MHz Out-of-Order Soft Processor Memory System.",
            "Automated Real-Time Analysis of Streaming Big and Dense Data on Reconfigurable Platforms.",
            "Generating Efficient Context-Switch Capable Circuits through Autonomous Design Flow.",
            "Introduction to the Special Section on FPL 2015.",
            "Synthesizable Standard Cell FPGA Fabrics Targetable by the Verilog-to-Routing CAD Flow.",
            "Efficient Assembly for High-Order Unstructured FEM Meshes (FPL 2015).",
            "(FPL 2015) Scavenger: Automating the Construction of Application-Optimized Memory Hierarchies.",
            "Hoplite: A Deflection-Routed Directional Torus NoC for FPGAs.",
            "The First 25 Years of the FPL Conference: Significant Papers.",
            "Performance Scalability of Adaptive Processor Architecture.",
            "Throughput-Optimized FPGA Accelerator for Deep Convolutional Neural Networks.",
            "Bandwidth Compression of Floating-Point Numerical Data Streams for FPGA-Based High-Performance Computing.",
            "Microarchitectural Comparison of the MXP and Octavo Soft-Processor FPGA Overlays.",
            "Improved Reliability of FPGA-Based PUF Identification Generator Design.",
            "Efficient and Versatile FPGA Acceleration of Support Counting for Stream Mining of Sequences and Frequent Itemsets.",
            "Reducing the Performance Gap between Soft Scalar CPUs and Custom Hardware with TILT.",
            "Optimizing FPGA Performance, Power, and Dependability with Linear Programming.",
            "Efficient Branch and Bound on FPGAs Using Work Stealing and Instance-Specific Designs.",
            "Network on Chip Architecture for Multi-Agent Systems in FPGA.",
            "FPGA Implementations of Kernel Normalised Least Mean Squares Processors.",
            "Fast and Cycle-Accurate Emulation of Large-Scale Networks-on-Chip Using a Single FPGA.",
            "Pipelined Parallel Join and Its FPGA-Based Acceleration.",
            "Efficient Reconfigurable Architecture for Pricing Exotic Options."
        ]
    },
    {
        "name": "TRETS",
        "year": "2015",
        "info": "Volume 9: 2015/2016",
        "count": 30,
        "papers": [
            "Program-Invariant Checking for Soft-Error Detection using Reconfigurable Hardware.",
            "ARC 2014: A Multidimensional FPGA-Based Parallel DBSCAN Architecture.",
            "Implementing Curve25519 for Side-Channel-Protected Elliptic Curve Cryptography.",
            "An Enhanced Adaptive Recoding Rotation CORDIC.",
            "Guest Editorial ARC 2014.",
            "On the Impact of Replacing Low-Speed Configuration Buses on FPGAs with the Chip's Internal Configuration Infrastructure.",
            "ARC 2014 Over-Clocking KLT Designs on FPGAs under Process, Voltage, and Temperature Variation.",
            "ARC 2014: Towards a Fast FPGA Implementation of a Heap-Based Priority Queue for Image Coding Using a Parallel Index-Aware Tree.",
            "CORDIC-Based Enhanced Systolic Array Architecture for QR Decomposition.",
            "Separation Logic for High-Level Synthesis.",
            "Compact and On-the-Fly Secure Dynamic Reconfiguration for Volatile FPGAs.",
            "Coarse-Grained Architecture for Fingerprint Matching.",
            "Guest Editorial RAW 2014.",
            "Value State Flow Graph: A Dataflow Compiler IR for Accelerating Control-Intensive Code in Spatial Hardware.",
            "RAW 2014: Random Number Generators on FPGAs.",
            "A Reconfigurable Architecture for the Detection of Strongly Connected Components.",
            "Optimizing Soft Vector Processing in FPGA-Based Embedded Systems.",
            "Introduction to Special Issue on Reconfigurable Components with Source Code.",
            "Open-Source Variable-Precision Floating-Point Library for Major Commercial FPGAs.",
            "The Unified Accumulator Architecture: A Configurable, Portable, and Extensible Floating-Point Accumulator.",
            "Modular Switched Multiported SRAM-Based Memories.",
            "A Parallel Sliding-Window Generator for High-Performance Digital-Signal Processing on FPGAs.",
            "A Retargetable Compilation Framework for Heterogeneous Reconfigurable Computing.",
            "FPGA-Based Dynamically Reconfigurable SQL Query Processing.",
            "Shared Memory Multicore MicroBlaze System with SMP Linux Support.",
            "ODoST: Automatic Hardware Acceleration for Biomedical Model Integration.",
            "Introduction.",
            "Application of Specific Delay Window Routing for Timing Optimization in FPGA Designs.",
            "Impact of Parallelism and Memory Architecture on FPGA Communication Energy.",
            "Fine-Grained Interconnect Synthesis."
        ]
    },
    {
        "name": "TRETS",
        "year": "2015",
        "info": "Volume 8: 2015",
        "count": 26,
        "papers": [
            "SATTA: A Self-Adaptive Temperature-Based TDF Awareness Methodology for Dynamically Reconfigurable FPGAs.",
            "A Tradeoff Analysis of FPGAs, GPUs, and Multicores for Sliding-Window Applications.",
            "The Cibola Flight Experiment.",
            "Identification of Dynamic Circuit Specialization Opportunities in RTL Code.",
            "Microkernel Architecture and Hardware Abstraction Layer of a Reliable Reconfigurable Real-Time Operating System (R3TOS).",
            "Imprecise Datapath Design: An Overclocking Approach.",
            "Parallelizing Data Processing on FPGAs with Shifter Lists.",
            "Guest Editorial FPL 2013.",
            "A Runtime FPGA Placement and Routing Using Low-Complexity Graph Traversal.",
            "Timing-Driven Titan: Enabling Large Benchmarks and Exploring the Gap between Academic and Commercial CAD.",
            "Solving the Global Atmospheric Equations through Heterogeneous Reconfigurable Platforms.",
            "Autonomous Soft-Error Tolerance of FPGA Configuration Bits.",
            "A Hash Table for Line-Rate Data Processing.",
            "The Effect of Compiler Optimizations on High-Level Synthesis-Generated Hardware.",
            "Automating Elimination of Idle Functions by Runtime Reconfiguration.",
            "Exploiting FPGA Block Memories for Protected Cryptographic Implementations.",
            "CoEx: A Novel Profiling-Based Algorithm/Architecture Co-Exploration for ASIP Design.",
            "Execution Trace-Driven Energy-Reliability Optimization for Multimedia MPSoCs.",
            "Efficient Fault-Tolerant Topology Reconfiguration Using a Maximum Flow Algorithm.",
            "Low-Level Flexible Architecture with Hybrid Reconfiguration for Evolvable Hardware.",
            "Low-Overhead FPGA Middleware for Application Portability and Productivity.",
            "RIFFA 2.1: A Reusable Integration Framework for FPGA Accelerators.",
            "The Table-Hadamard GRNG: An Area-Efficient FPGA Gaussian Random Number Generator.",
            "Memory Interface Design for 3D Stencil Kernels on a Massively Parallel Memory System.",
            "SuperDragon: A Heterogeneous Parallel System for Accelerating 3D Reconstruction of Cryo-Electron Microscopy Images.",
            "Safe Dynamic Reshaping of Reconfigurable MPSoC Embedded Systems for Self-Healing and Self-Adaption Purposes."
        ]
    },
    {
        "name": "TRETS",
        "year": "2014",
        "info": "Volume 7: 2014/2015",
        "count": 37,
        "papers": [
            "Dynamic Power and Thermal Management of NoC-Based Heterogeneous MPSoCs.",
            "High-Level Abstractions and Modular Debugging for FPGA Design Validation.",
            "Fast and Accurate Stereo Vision System on FPGA.",
            "Fast Design Exploration for Performance, Power and Accuracy Tradeoffs in FPGA-Based Accelerators.",
            "A Fully Pipelined FPGA Architecture of a Factored Restricted Boltzmann Machine Artificial Neural Network.",
            "VTR 7.0: Next Generation Architecture and CAD System for FPGAs.",
            "Multi-Application Network-on-Chip Design using Global Mapping and Local Reconfiguration.",
            "FPGA Implementation of a Special-Purpose VLIW Structure for Double-Precision Elementary Function.",
            "A Mapping-Scheduling Algorithm for Hardware Acceleration on Reconfigurable Platforms.",
            "Intra-Masking Dual-Rail Memory on LUT Implementation for SCA-Resistant AES on FPGA.",
            "Introduction to the TRETS Special Section on the Workshop on Self-Awareness in Reconfigurable Computing Systems (SRCS'12).",
            "Coordination of Independent Loops in Self-Adaptive Systems.",
            "Self-Awareness as a Model for Designing and Operating Heterogeneous Multicores.",
            "Design Tools for Implementing Self-Aware and Fault-Tolerant Systems on FPGAs.",
            "A Self-Aware Tuning and Self-Aware Evaluation Method for Finite-Difference Applications in Reconfigurable Systems.",
            "Composing Multi-Ported Memories on FPGAs.",
            "Benefits of Adding Hardware Support for Broadcast and Reduce Operations in MPSoC Applications.",
            "Introduction to the Special Issue on the 11th International Conference on Field-Programmable Technology (FPT'12).",
            "The iDEA DSP Block-Based Soft Processor for FPGAs.",
            "Networks-on-Chip for FPGAs: Hard, Soft or Mixed?",
            "Graph Minor Approach for Application Mapping on CGRAs.",
            "ULP-SRP: Ultra Low-Power Samsung Reconfigurable Processor for Biomedical Applications.",
            "Introduction to the Special Issue on the 7th International Workshop on Reconfigurable Communication-centric Systems-on-Chip (ReCoSoC'12).",
            "RIVER: Reconfigurable Flow and Fabric for Real-Time Signal Processing on FPGAs.",
            "Adaptive Parallelism Exploitation under Physical and Real-Time Constraints for Resilient Systems.",
            "Exploiting FPGA-Aware Merging of Custom Instructions for Runtime Reconfiguration.",
            "Extending UML/MARTE to Support Discrete Controller Synthesis, Application to Reconfigurable Systems-on-Chip Modeling.",
            "High-Speed Hardware Partition Generation.",
            "A Reconfigurable Architecture for Binary Acceleration of Loops with Memory Accesses.",
            "Area-Efficient Near-Associative Memories on FPGAs.",
            "Dynamic Energy, Performance, and Accuracy Optimization and Management Using Automatically Generated Constraints for Separable 2D FIR Filtering for Digital Video Processing.",
            "GROK-LAB: Generating Real On-chip Knowledge for Intra-cluster Delays Using Timing Extraction.",
            "NCBI BLASTP on High-Performance Reconfigurable Computing Systems.",
            "Physical Security Evaluation of the Bitstream Encryption Mechanism of Altera Stratix II and Stratix III FPGAs.",
            "Secure, Remote, Dynamic Reconfiguration of FPGAs.",
            "Mapping Adaptive Particle Filters to Heterogeneous Reconfigurable Systems.",
            "Graph-Based Approaches to Placement of Processing Element Networks on FPGAs for Physical Model Simulation."
        ]
    },
    {
        "name": "TRETS",
        "year": "2013",
        "info": "Volume 6: 2013",
        "count": 19,
        "papers": [
            "Self-Alignment Schemes for the Implementation of Addition-Related Floating-Point Operators.",
            "An FPGA-Based Accelerator for Frequent Itemset Mining.",
            "Quipu: A Statistical Model for Predicting Hardware Resources.",
            "Floating-Point Exponentiation Units for Reconfigurable Computing.",
            "ReShape: Towards a High-Level Approach to Design and Operation of Modular Reconfigurable Systems.",
            "Introduction to the special section on 19th reconfigurable architectures workshop (RAW 2012).",
            "JITPR: A framework for supporting fast application's implementation onto FPGAs.",
            "Virtual networks - distributed communication resource management.",
            "A comprehensive performance analysis of virtual routers on FPGA.",
            "Towards development of an analytical model relating FPGA architecture parameters to routability.",
            "Virtualizable hardware/software design infrastructure for dynamically partially reconfigurable systems.",
            "Integration of Net-Length Factor with Timing- and Routability-Driven Clustering Algorithms.",
            "UNTANGLED: A Game Environment for Discovery of Creative Mapping Strategies.",
            "Self-Reconfigurable Constant Multiplier for FPGA.",
            "Analyzing System-Level Information's Correlation to FPGA Placement.",
            "Exploiting Task- and Data-Level Parallelism in Streaming Applications Implemented in FPGAs.",
            "A Reconfigurable Parallel Hardware Implementation of the Self-Tuning Regulator.",
            "An Analytical Model for Evaluating Static Power of Homogeneous FPGA Architectures.",
            "Optimizing Wait States in the Synthesis of Memory References with Unpredictable Latencies."
        ]
    },
    {
        "name": "TRETS",
        "year": "2012",
        "info": "Volume 5: 2012",
        "count": 22,
        "papers": [
            "Low-cost sensing with ring oscillator arrays for healthier reconfigurable systems.",
            "On the exploitation of a high-throughput SHA-256 FPGA design for HMAC.",
            "Reconfigurable architecture for VBSME with variable pixel precision.",
            "A novel framework for exploring 3-D FPGAs with heterogeneous interconnect fabric.",
            "Design and analysis of adaptive processor.",
            "Portable and scalable FPGA-based acceleration of a direct linear system solver.",
            "SCF: A Framework for Task-Level Coordination in Reconfigurable, Heterogeneous Systems.",
            "Dynamic Defragmentation of Reconfigurable Devices.",
            "Statistical Timing and Power Optimization of Architecture and Device for FPGAs.",
            "Constraint Programming Approach to Reconfigurable Processor Extension Generation and Application Compilation.",
            "Introduction to the Special Issue on ReCoSoC 2011.",
            "Asymmetric Cache Coherency: Policy Modifications to Improve Multicore Performance.",
            "Memory Latency Hiding by Load Value Speculation for Reconfigurable Computers.",
            "Enhancing Reconfigurable Platforms Programmability for Synchronous Data-Flow Applications.",
            "A SDM-TDM-Based Circuit-Switched Router for On-Chip Networks.",
            "Secure Extension of FPGA General Purpose Processors for Symmetric Key Cryptography with Partial Reconfiguration Capabilities.",
            "Enabling Adaptive Techniques in Heterogeneous MPSoCs Based on Virtualization.",
            "Remote FPGA Lab for Enhancing Learning of Digital Systems.",
            "POWER-MODES: POWer-EmulatoR- and MOdel-Based DEpendability and Security Evaluations.",
            "Adaptive Voltage Scaling in a Dynamically Reconfigurable FPGA-Based Platform.",
            "Reconfigurable Fault Tolerance: A Comprehensive Framework for Reliable and Adaptive FPGA-Based Space Computing.",
            "On the Evolution of Hardware Circuits via Reconfigurable Architectures."
        ]
    },
    {
        "name": "TRETS",
        "year": "2010",
        "info": "Volume 4: 2010/2011",
        "count": 40,
        "papers": [
            "Guest Editorial ARC 2009.",
            "An Optimized Hardware Architecture of a Multivariate Gaussian Random Number Generator.",
            "Efficient Heterogeneous Architecture Floorplan Optimization using Analytical Methods.",
            "Design Assurance Strategy and Toolset for Partially Reconfigurable FPGA Systems.",
            "A Variable-Grain Logic Cell and Routing Architecture for a Reconfigurable IP Core.",
            "Optimized System-on-Chip Integration of a Programmable ECC Coprocessor.",
            "A New Timing Driven Placement Algorithm for Dependable Circuits on SRAM-based FPGAs.",
            "Exploiting Self-Reconfiguration Capability to Improve SRAM-based FPGA Robustness in Space and Avionics Applications.",
            "Scheduling and Placement of Hardware/Software Real-Time Relocatable Tasks in Dynamically Partially Reconfigurable Systems.",
            "An Approach for Solving Large SAT Problems on FPGA.",
            "Evaluation of Random Delay Insertion against DPA on FPGAs.",
            "Logarithmic-Time FPGA Bitstream Analysis: A Step Towards JIT Hardware Compilation.",
            "A Novel Multicontext Coarse-Grained Reconfigurable Architecture (CGRA) For Accelerating Column-Oriented Databases.",
            "A Scalable and Programmable Modular Traffic Manager Architecture.",
            "Fast Optical Reconfiguration of a Nine-Context DORGA Using a Speed Adjustment Control.",
            "A Performance-Oriented Algorithm with Consideration on Communication Cost for Dynamically Reconfigurable FPGA Partitioning.",
            "Domain-Specific Optimization of Signal Recognition Targeting FPGAs.",
            "The Instruction-Set Extension Problem: A Survey.",
            "Scientific Application Demands on a Reconfigurable Functional Unit Interface.",
            "FPGA Acceleration of MultiFactor CDO Pricing.",
            "Application-specific signatures for transactional memory in soft processors.",
            "Optimizing memory bandwidth use and performance for matrix-vector multiplication in iterative methods.",
            "TR-FSM: Transition-Based reconfigurable finite state machine.",
            "Application-Specific FPGA using heterogeneous logic blocks.",
            "An FPGA-based accelerator for LambdaRank in Web search engines.",
            "SHMEM+: A multilevel-PGAS programming model for reconfigurable supercomputing.",
            "An analytical model for multilevel performance prediction of Multi-FPGA systems.",
            "Leveraging reconfigurability in the hardware/software codesign process.",
            "Applying dynamic reconfiguration in the mobile robotics domain: A case study on computer vision algorithms.",
            "Platform-aware bottleneck detection for reconfigurable computing applications.",
            "Introduction to special section FPGA 2009.",
            "VPR 5.0: FPGA CAD and architecture exploration tools with single-driver routing, heterogeneity and process scaling.",
            "Choose-your-own-adventure routing: Lightweight load-time defect avoidance.",
            "Scalable don't-care-based logic optimization and resynthesis.",
            "FPGA technology mapping with encoded libraries and staged priority cuts.",
            "Performance of partial reconfiguration in FPGA systems: A survey and a cost model.",
            "Exploiting data-level parallelism for energy-efficient implementation of LDPC decoders and DCT on an FPGA.",
            "Net-length-based routability-driven power-aware clustering.",
            "Compressor tree synthesis on commercial high-performance FPGAs.",
            "Test compression for dynamically reconfigurable processors."
        ]
    },
    {
        "name": "TRETS",
        "year": "2010",
        "info": "Volume 3: 2010",
        "count": 26,
        "papers": [
            "A High Throughput FPGA-Based Floating Point Conjugate Gradient Implementation for Dense Matrices.",
            "Sparse Matrix-Vector Multiplication on a Reconfigurable Supercomputer with Application.",
            "DSPs, BRAMs, and a Pinch of Logic: Extended Recipes for AES on FPGAs.",
            "Configuration Merging in Point-to-Point Networks for Module-Based FPGA Reconfiguration.",
            "Performance Analysis Framework for High-Level Language Applications in Reconfigurable Computing.",
            "A Comparison Study on Implementing Optical Flow and Digital Communications on FPGAs and GPUs.",
            "Titan-R: A Multigigabit Reconfigurable Combined Compression/Decompression Unit.",
            "SARFUM: Security Architecture for Remote FPGA Update and Monitoring.",
            "Improving the Robustness of Ring Oscillator TRNGs.",
            "Security Primitives for Reconfigurable Hardware-Based Systems.",
            "Fast, Efficient Floating-Point Adders and Multipliers for FPGAs.",
            "Implementation Approaches Trade-Offs for WiMax OFDM Functions on Reconfigurable Platforms.",
            "An Automated Flow for Arithmetic Component Generation in Field-Programmable Gate Arrays.",
            "Hardware-Accelerated RNA Secondary-Structure Alignment.",
            "Reducing Memory Constraints in Modulo Scheduling Synthesis for FPGAs.",
            "VFloat: A Variable Precision Fixed- and Floating-Point Library for Reconfigurable Hardware.",
            "Runtime Reconfiguration of Multiprocessors Based on Compile-Time Analysis.",
            "Bandwidth Management in Application Mapping for Dynamically Reconfigurable Architectures.",
            "Characterization of Fixed and Reconfigurable Multi-Core Devices for Application Acceleration.",
            "Reconfiguration and Communication-Aware Task Scheduling for High-Performance Reconfigurable Computing.",
            "FPGA-Array with Bandwidth-Reduction Mechanism for Scalable and Power-Efficient Numerical Simulations Based on Finite Difference Methods.",
            "MPI as a Programming Model for High-Performance Reconfigurable Computers.",
            "Molecular Dynamics Simulations on High-Performance Reconfigurable Computing Systems.",
            "Placement and Floorplanning in Dynamically Reconfigurable FPGAs.",
            "A Simulation Framework for Rapid Analysis of Reconfigurable Computing Systems.",
            "High-Performance Quasi-Monte Carlo Financial Simulation: FPGA vs. GPP vs. GPU."
        ]
    },
    {
        "name": "TRETS",
        "year": "2009",
        "info": "Volume 2: 2009",
        "count": 26,
        "papers": [
            "Guest Editors' Introduction to Security in Reconfigurable Systems Design.",
            "Elliptic Curve Cryptography on FPGA for Low-Power Applications.",
            "Isolated WDDL: A Hiding Countermeasure for Differential Power Analysis on FPGAs.",
            "Electromagnetic Radiations of FPGAs: High Spatial Resolution Cartography and Attack on a Cryptographic Module.",
            "Techniques for Design and Implementation of Secure Reconfigurable PUFs.",
            "Trust-Based Design and Check of FPGA Circuits Using Two-Level Randomized ECC Structures.",
            "Guest Editors' Introduction: ICFPT 2007.",
            "TAS-MRAM-Based Low-Power High-Speed Runtime Reconfiguration (RTR) FPGA.",
            "Hardware Decompression Techniques for FPGA-Based Embedded Systems.",
            "Self-Measurement of Combinatorial Circuit Delays in FPGAs.",
            "Automation Schemes for FPGA Implementation of Wave-Pipelined Circuits.",
            "Vector Processing as a Soft Processor Accelerator.",
            "Field Programmable Compressor Trees: Acceleration of Multi-Input Addition on FPGAs.",
            "WireMap: FPGA Technology Mapping for Improved Routability and Enhanced LUT Merging.",
            "ProtoFlex: Towards Scalable, Full-System Multiprocessor Simulations Using FPGAs.",
            "A-Port Networks: Preserving the Timed Behavior of Synchronous Systems for Modeling on FPGAs.",
            "FPGA-Based Hardware Acceleration of Lithographic Aerial Image Simulation.",
            "Packing Techniques for Virtex-5 FPGAs.",
            "An FPGA Logic Cell and Carry Chain Configurable as a 6: 2 or 7: 2 Compressor.",
            "Introduction to the Special Issue ARC'08.",
            "Exploring Reconfigurable Architectures for Tree-Based Option Pricing Models.",
            "Robust Real-Time Super-Resolution on FPGA and an Application to Video Enhancement.",
            "Space Optimization on Counters for FPGA-Based Perl Compatible Regular Expressions.",
            "An Application Development Framework for ARISE Reconfigurable Processors.",
            "Optimal Loop Unrolling and Shifting for Reconfigurable Architectures.",
            "From Silicon to Science: The Long Road to Production Reconfigurable Supercomputing."
        ]
    },
    {
        "name": "TRETS",
        "year": "2008",
        "info": "Volume 1: 2008/2009",
        "count": 24,
        "papers": [
            "Introduction.",
            "Guest Editorial: TRETS Special Edition on the 15th International Symposium on FPGAs.",
            "Suppression of Intrinsic Delay Variation in FPGAs using Multiple Configurations.",
            "Statistical Analysis and Process Variation-Aware Routing and Skew Assignment for FPGAs.",
            "A Desktop Computer with a Reconfigurable Pentium®.",
            "Designing Efficient Input Interconnect Blocks for LUT Clusters Using Counting and Entropy.",
            "A Synthesizable Datapath-Oriented Embedded FPGA Fabric for Silicon Debug Applications.",
            "Special-Purpose Hardware for Solving the Elliptic Curve Discrete Logarithm Problem.",
            "Mercury BLASTP: Accelerating Protein Sequence Alignment.",
            "Parametric Yield Modeling and Simulations of FPGA Circuits Considering Within-Die Delay Variations.",
            "Merged Dictionary Code Compression for FPGA Implementation of Custom Microcoded PEs.",
            "Multivariate Gaussian Random Number Generation Targeting Reconfigurable Hardware.",
            "On the trade-off between power and flexibility of FPGA clock networks.",
            "An open-source HyperTransport core.",
            "Particle graphics on reconfigurable hardware.",
            "Perturb+mutate: Semisynthetic circuit generation for incremental placement and routing.",
            "Perfecto: A systemc-based design-space exploration framework for dynamically reconfigurable architectures.",
            "Static and Dynamic Memory Footprint Reduction for FPGA Routing Algorithms.",
            "FPGA Acceleration of RankBoost in Web Search Engines.",
            "Searching for Transient Pulses with the ETA Radio Telescope.",
            "Exploiting Partial Runtime Reconfiguration for High-Performance Reconfigurable Computing.",
            "RAT: RC Amenability Test for Rapid Performance Prediction.",
            "Compute Bound and I/O Bound Cellular Automata Simulations on FPGA Logic.",
            "Synthesis and Optimization of 2D Filter Designs for Heterogeneous FPGAs."
        ]
    }
]