[
    {
        "year": "2021",
        "name": "USENIX ATC 2021",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2021",
                "sub_name": "2021 USENIX Annual Technical Conference, USENIX ATC 2021, July 14-16, 2021.",
                "count": 64,
                "papers": [
                    "Naos: Serialization-free RDMA networking in Java.",
                    "One-sided RDMA-Conscious Extendible Hashing for Disaggregated Memory.",
                    "MLEE: Effective Detection of Memory Leaks on Early-Exit Paths in OS Kernels.",
                    "MigrOS: Transparent Live-Migration Support for Containerised RDMA Applications.",
                    "Avocado: A Secure In-Memory Distributed Storage System.",
                    "Scaling Large Production Clusters with Partitioned Synchronization.",
                    "A Linux Kernel Implementation of the Homa Transport Protocol.",
                    "A Case Study of Processing-in-Memory in off-the-Shelf Systems.",
                    "Fighting the Fog of War: Automated Incident Detection for Cloud Systems.",
                    "RIFF: Reduced Instruction Footprint for Coverage-Guided Fuzzing.",
                    "Zico: Efficient GPU Memory Sharing for Concurrent DNN Training.",
                    "Octo: INT8 Training with Loss-aware Compensation and Backward Quantization for Tiny On-device Learning.",
                    "Argus: Debugging Performance Issues in Modern Desktop Applications with Annotated Causal Tracing.",
                    "aDFS: An Almost Depth-First-Search Distributed Graph-Querying System.",
                    "GLIST: Towards In-Storage Graph Learning.",
                    "DART: A Scalable and Adaptive Edge Stream Processing Engine.",
                    "CrystalPerf: Learning to Characterize the Performance of Dataflow Computation through Code Analysis.",
                    "Controlling Memory Footprint of Stateful Streaming Graph Processing.",
                    "SONIC: Application-aware Data Passing for Chained Serverless Applications.",
                    "Proactive Energy-Aware Adaptive Video Streaming on Mobile Devices.",
                    "ICARUS: Attacking low Earth orbit satellite networks.",
                    "RainBlock: Faster Transaction Processing in Public Blockchains.",
                    "PYLIVE: On-the-Fly Code Change for Python-based Online Services.",
                    "ASAP: Fast Mobile Application Switch via Adaptive Prepaging.",
                    "Fine-tuning giant neural networks on commodity hardware with automatic pipeline model parallelism.",
                    "INFaaS: Automated Model-less Inference Serving.",
                    "Jump-Starting Multivariate Time Series Anomaly Detection for Online Service Systems.",
                    "Palleon: A Runtime System for Efficient Video Processing toward Dynamic Class Skew.",
                    "FaaSNet: Scalable and Fast Provisioning of Custom Serverless Container Runtimes at Alibaba Cloud Function Compute.",
                    "Video Analytics with Zero-streaming Cameras.",
                    "Prediction-Based Power Oversubscription in Cloud Platforms.",
                    "TCP-Fuzz: Detecting Memory and Semantic Bugs in TCP Stacks with Fuzzing.",
                    "Habitat: A Runtime-Based Computational Performance Predictor for Deep Neural Network Training.",
                    "Characterizing and Optimizing Remote Persistent Memory with RDMA and NVM.",
                    "Refurbish Your Training Data: Reusing Partially Augmented Samples for Faster Deep Neural Network Training.",
                    "ZeRO-Offload: Democratizing Billion-Scale Model Training.",
                    "An Off-The-Chain Execution Environment for Scalable Testing and Profiling of Smart Contracts.",
                    "Live in the Express Lane.",
                    "Understanding Precision Time Protocol in Today's Wi-Fi Networks: A Measurement Study.",
                    "AUTO: Adaptive Congestion Control Based on Multi-Objective Reinforcement Learning for the Satellite-Ground Integrated Network.",
                    "Hey, Lumi! Using Natural Language for Intent-Based Network Management.",
                    "Boosting Full-Node Repair in Erasure-Coded Storage.",
                    "KVIMR: Key-Value Store Aware Data Management Middleware for Interlaced Magnetic Recording Based Hard Disk Drive.",
                    "Differentiated Key-Value Storage Management for Balanced I/O Performance.",
                    "ZNS: Avoiding the Block Interface Tax for Flash-based SSDs.",
                    "MapperX: Adaptive Metadata Maintenance for Fast Crash Recovery of DM-Cache Based Hybrid Storage Devices.",
                    "Exploring the Design Space of Page Management for Multi-Tiered Memory Systems.",
                    "A Fast and Flexible Hardware-based Virtualization Mechanism for Computational Storage Devices.",
                    "Fair Scheduling for AVX2 and AVX-512 Workloads.",
                    "SKQ: Event Scheduling for Optimizing Tail Latency in a Traditional OS Kernel.",
                    "TIPS: Making Volatile Index Structures Persistent with DRAM-NVMM Tiering.",
                    "Ayudante: A Deep Reinforcement Learning Approach to Assist Persistent Memory Programming.",
                    "Faastlane: Accelerating Function-as-a-Service Workflows.",
                    "Improving Performance of Flash Based Key-Value Stores Using Storage Class Memory as a Volatile Memory Extension.",
                    "First Responder: Persistent Memory Simultaneously as High Performance Buffer Cache and Storage.",
                    "Hashing Linearity Enables Relative Path Control in Data Centers.",
                    "XFUSE: An Infrastructure for Running Filesystem Services in User Space.",
                    "Max: A Multicore-Accelerated File System for Flash Storage.",
                    "Z-Journal: Scalable Per-Core Journaling.",
                    "LODIC: Logical Distributed Counting for Scalable File Access.",
                    "UniStore: A fault-tolerant marriage of causal and strong consistency.",
                    "Optimistic Concurrency Control for Real-world Go Programs.",
                    "Accelerating Encrypted Deduplication via SGX.",
                    "Experiences in Managing the Performance and Reliability of a Large-Scale Genomics Cloud Platform."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "USENIX ATC 2020",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2020",
                "sub_name": "2020 USENIX Annual Technical Conference, USENIX ATC 2020, July 15-17, 2020.",
                "count": 67,
                "papers": [
                    "Libnvmmio: Reconstructing Software IO Path with Failure-Atomic Memory-Mapped Interface.",
                    "MatrixKV: Reducing Write Stalls and Write Amplification in LSM-tree Based KV Stores with Matrix Container in NVM.",
                    "Disaggregating Persistent Memory and Controlling Them Remotely: An Exploration of Passive Disaggregated Key-Value Stores.",
                    "SplinterDB: Closing the Bandwidth Gap for NVMe Key-Value Stores.",
                    "Twizzler: a Data-Centric OS for Non-Volatile Memory.",
                    "BASTION: A Security Enforcement Network Stack for Container Networks.",
                    "Spool: Reliable Virtualized NVMe Storage Pool in Public Cloud Infrastructure.",
                    "HDDse: Enabling High-Dimensional Disk State Embedding for Generic Failure Detection System of Heterogeneous Disks in Large Data Centers.",
                    "Adaptive Placement for In-memory Storage Functions.",
                    "NetKernel: Making Network Stack Part of the Virtualized Infrastructure.",
                    "Platinum: A CPU-Efficient Concurrent Garbage Collector for Tail-Reduction of Interactive Services.",
                    "PinK: High-speed In-storage Key-value Store with Bounded Tails.",
                    "OPTIMUSCLOUD: Heterogeneous Configuration Optimization for Distributed Databases in the Cloud.",
                    "Serverless in the Wild: Characterizing and Optimizing the Serverless Workload at a Large Cloud Provider.",
                    "Lessons Learned from the Chameleon Testbed.",
                    "SPINFER: Inferring Semantic Patches for the Linux Kernel.",
                    "FuZZan: Efficient Sanitizer Metadata Design for Fuzzing.",
                    "PracExtractor: Extracting Configuration Good Practices from Manuals to Detect Server Misconfigurations.",
                    "Reverse Debugging of Kernel Failures in Deployed Systems.",
                    "Offload Annotations: Bringing Heterogeneous Computing to Existing Libraries and Workloads.",
                    "The Future of the Past: Challenges in Archival Storage.",
                    "HetPipe: Enabling Large DNN Training on (Whimpy) Heterogeneous GPU Clusters through Integration of Pipelined Model Parallelism and Data Parallelism.",
                    "AutoSys: The Design and Operation of Learning-Augmented Systems.",
                    "Daydream: Accurately Estimating the Efficacy of Optimizations for DNN Training.",
                    "ALERT: Accurate Learning for Energy and Timeliness.",
                    "NeuOS: A Latency-Predictable Multi-Dimensional Optimization Framework for DNN-driven Autonomous Systems.",
                    "PERCIVAL: Making In-Browser Perceptual Ad Blocking Practical with Deep Learning.",
                    "Harmonizing Performance and Isolation in Microkernels with Efficient Intra-kernel Isolation and Communication.",
                    "Faasm: Lightweight Isolation for Efficient Stateful Serverless Computing.",
                    "Fewer Cores, More Hertz: Leveraging High-Frequency Cores in the OS Scheduler for Improved Application Performance.",
                    "vSMT-IO: Improving I/O Performance and Efficiency on SMT Processors in Virtualized Clouds.",
                    "Lightweight Preemptible Functions.",
                    "coIOMMU: A Virtual IOMMU with Cooperative DMA Buffer Tracking for Efficient Memory Management in Direct I/O.",
                    "BatchCrypt: Efficient Homomorphic Encryption for Cross-Silo Federated Learning.",
                    "A Deep Dive into DNS Query Failures.",
                    "A Decentralized Blockchain with High Throughput and Fast Confirmation.",
                    "Reconstructing proprietary video streaming algorithms.",
                    "Midgress-aware traffic provisioning for content delivery.",
                    "GraphWalker: An I/O-Efficient and Resource-Friendly Graph Analytic System for Fast and Scalable Random Walks.",
                    "Scaph: Scalable GPU-Accelerated Graph Processing with Value-Driven Differential Scheduling.",
                    "Peregreen - modular database for efficient storage of historical time series in cloud environments.",
                    "AC-Key: Adaptive Caching for LSM-based Key-Value Stores.",
                    "POSH: A Data-Aware Shell.",
                    "The Fine Line between Bold and Fringe Lunatic.",
                    "FineStream: Fine-Grained Window-Based Stream Processing on CPU-GPU Integrated Architectures.",
                    "OpenExpress: Fully Hardware Automated Open Research Framework for Future Fast NVMe Devices.",
                    "Fast Software Cache Design for Network Appliances.",
                    "Reexamining Direct Cache Access to Optimize I/O Intensive Applications for Multi-hundred-gigabit Networks.",
                    "sRDMA - Efficient NIC-based Authentication and Encryption for Remote Direct Memory Access.",
                    "UREQA: Leveraging Operation-Aware Error Rates for Effective Quantum Circuit Mapping on NISQ-Era Quantum Computers.",
                    "Austere Flash Caching with Deduplication and Compression.",
                    "DADI: Block-Level Image Service for Agile and Elastic Application Deployment.",
                    "Efficient Miss Ratio Curve Computation for Heterogeneous Content Popularity.",
                    "Can Applications Recover from fsync Failures?",
                    "DupHunter: Flexible High-Performance Deduplication for Docker Registries.",
                    "OSCA: An Online-Model Based Cache Allocation Scheme in Cloud Block Storage Systems.",
                    "Lock-free Concurrent Level Hashing for Persistent Memory.",
                    "Optimizing Memory-mapped I/O for Fast Storage Devices.",
                    "A Comprehensive Analysis of Superpage Management Mechanisms and Policies.",
                    "Effectively Prefetching Remote Memory with Leap.",
                    "go-pmem: Native Support for Programming Persistent Memory in Go.",
                    "End the Senseless Killing: Improving Memory Management for Mobile Operating Systems.",
                    "Retwork: Exploring Reader Network with COTS RFID Systems.",
                    "Acclaim: Adaptive Memory Reclaim to Improve User Experience in Android Systems.",
                    "SweynTooth: Unleashing Mayhem over Bluetooth Low Energy.",
                    "Fine-Grained Isolation for Scalable, Dynamic, Multi-tenant Edge Clouds.",
                    "Firefly: Untethered Multi-user VR for Commodity Mobile Devices."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "USENIX ATC 2019",
        "info": "Renton, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2019",
                "sub_name": "2019 USENIX Annual Technical Conference, USENIX ATC 2019, Renton, WA, USA, July 10-12, 2019.",
                "count": 78,
                "papers": [
                    "DistCache: Provable Load Balancing for Large-Scale Storage Systems with Distributed Caching.",
                    "Protocol-Aware Recovery for Consensus-Based Storage.",
                    "Orca: Differential Bug Localization in Large-Scale Services.",
                    "LegoOS: A Disseminated, Distributed OS for Hardware Resource Disaggregation.",
                    "Darwin: A Genomics Co-processor Provides up to 15, 000X Acceleration on Long Read Assembly.",
                    "The Semantics of Transactions and Weak Memory in x86, Power, ARM, and C++.",
                    "Who Left Open the Cookie Jar? A Comprehensive Evaluation of Third-Party Cookie Policies.",
                    "The Design and Operation of CloudLab.",
                    "Everyone Loves File: File Storage Service (FSS) in Oracle Cloud Infrastructure.",
                    "Zanzibar: Google's Consistent, Global Authorization System.",
                    "IASO: A Fail-Slow Detection and Mitigation Framework for Distributed Storage Services.",
                    "PARTISAN: Scaling the Distributed Actor Runtime.",
                    "Unleashing the Power of Learning: An Enhanced Learning-Based Approach for Dynamic Binary Translation.",
                    "Transactuations: Where Transactions Meet the Physical World.",
                    "Not So Fast: Analyzing the Performance of WebAssembly vs. Native Code.",
                    "Extension Framework for File Systems in User space.",
                    "FlexGroup Volumes: A Distributed WAFL File System.",
                    "EROFS: A Compression-friendly Readonly File System for Resource-scarce Devices.",
                    "QZFS: QAT Accelerated Compression in File System for Application Agnostic and Cost Efficient Data Storage.",
                    "Apache Nemo: A Framework for Building Distributed Dataflow Optimization Policies.",
                    "Tangram: Bridging Immutable and Mutable Abstractions for Distributed Data Analytics.",
                    "STRADS-AP: Simplifying Distributed Machine Learning Programming without Introducing a New Programming Model.",
                    "SOPHIA: Online Reconfiguration of Clustered NoSQL Databases for Time-Varying Workloads.",
                    "libmpk: Software Abstraction for Intel Memory Protection Keys (Intel MPK).",
                    "Effective Static Analysis of Concurrency Use-After-Free Bugs in Linux Device Drivers.",
                    "LXDs: Towards Isolation of Kernel Subsystems.",
                    "JumpSwitches: Restoring the Performance of Indirect Branches In the Era of Spectre.",
                    "Multi-Queue Fair Queuing.",
                    "BRAVO - Biased Locking for Reader-Writer Locks.",
                    "Mitigating Asymmetric Read and Write Costs in Cuckoo Hashing for Storage Systems.",
                    "NICA: An Infrastructure for Inline Acceleration of Network Applications.",
                    "E3: Energy-Efficient Microservices on SmartNIC-Accelerated Servers.",
                    "INSIDER: Designing In-Storage Computing System for Emerging High-Performance Drive.",
                    "Cognitive SSD: A Deep Learning Engine for In-Storage Data Retrieval.",
                    "SIMD-X: Programming and Processing of Graph Algorithms on GPUs.",
                    "LUMOS: Dependency-Driven Disk-based Graph Processing.",
                    "NeuGraph: Parallel Deep Neural Network Computation on Large Graphs.",
                    "Pre-Select Static Caching and Neighborhood Ordering for BFS-like Algorithms on Disk-based Graph Engines.",
                    "From Laptop to Lambda: Outsourcing Everyday Jobs to Thousands of Transient Functional Containers.",
                    "Hodor: Intra-Process Isolation for High-Throughput Data Plane Libraries.",
                    "A Retargetable System-Level DBT Hypervisor.",
                    "MTS: Bringing Multi-Tenancy to Virtual Networking.",
                    "StreamBox-TZ: Secure Stream Analytics at the Edge with TrustZone.",
                    "CoSMIX: A Compiler-based System for Secure Memory Instrumentation and Execution in Enclaves.",
                    "Secured Routines: Language-based Construction of Trusted Execution Environments.",
                    "Supporting Security Sensitive Tenants in a Bare-Metal Cloud.",
                    "Asynchronous I/O Stack: A Low-latency Kernel I/O Stack for Ultra-Low Latency SSDs.",
                    "M³x: Autonomous Accelerators via Context-Enabled Fast-Path Communication.",
                    "SmartDedup: Optimizing Deduplication for Resource-constrained Devices.",
                    "Data Domain Cloud Tier: Backup here, backup there, deduplicated everywhere!",
                    "GAIA: An OS Page Cache for Heterogeneous Systems.",
                    "Transkernel: Bridging Monolithic Kernels to Peripheral Cores.",
                    "Detecting Asymmetric Application-layer Denial-of-Service Attacks In-Flight with Finelame.",
                    "SemperOS: A Distributed Capability System.",
                    "Pragh: Locality-preserving Graph Traversal with Split Live Migration.",
                    "ElasticBF: Elastic Bloom Filter with Hotness Awareness for Boosting Read Performance in Large Key-Value Stores.",
                    "SILK: Preventing Latency Spikes in Log-Structured Merge Key-Value Stores.",
                    "Unification of Temporary Storage in the NodeKernel Architecture.",
                    "Evaluating File System Reliability on Solid State Drives.",
                    "Alleviating Garbage Collection Interference Through Spatial Separation in All Flash Arrays.",
                    "Practical Erase Suspension for Modern Low-latency SSDs.",
                    "Track-based Translation Layers for Interlaced Magnetic Recording.",
                    "Your Coflow has Many Flows: Sampling them for Fun and Speed.",
                    "PostMan: Rapidly Mitigating Bursty Traffic by Offloading Packet Processing.",
                    "R2P2: Making RPCs first-class datacenter citizens.",
                    "Lancet: A self-correcting Latency Measuring Tool.",
                    "Pangolin: A Fault-Tolerant Persistent Memory Programming Library.",
                    "Pisces: A Scalable and Efficient Persistent Transactional Memory.",
                    "EdgeWise: A Better Stream Processing Engine for the Edge.",
                    "Analysis of Large-Scale Multi-Tenant GPU Clusters for DNN Training Workloads.",
                    "Lessons and Actions: What We Learned from 10K SSD-Related Storage System Failures.",
                    "Who's Afraid of Uncorrectable Bit Errors? Online Recovery of Flash Errors with Distributed Redundancy.",
                    "Dayu: Fast and Low-interference Data Recovery in Very-large Storage Systems.",
                    "OPTR: Order-Preserving Translation and Recovery Design for SSDs with a Standard Block Device Interface.",
                    "Optimizing CNN Model Inference on CPUs.",
                    "Accelerating Rule-matching Systems with Learned Rankers.",
                    "MArk: Exploiting Cloud Services for Cost-Effective, SLO-Aware Machine Learning Inference Serving.",
                    "Cross-dataset Time Series Anomaly Detection for Cloud Systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "USENIX ATC 2018",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2018",
                "sub_name": "2018 USENIX Annual Technical Conference, USENIX ATC 2018, Boston, MA, USA, July 11-13, 2018.",
                "count": 76,
                "papers": [
                    "Tributary: spot-dancing for elastic services with latency SLOs.",
                    "FastTrack: Foreground App-Aware I/O Management for Improving User Experience of Android Smartphones.",
                    "Mainstream: Dynamic Stem-Sharing for Multi-Tenant Video Processing.",
                    "VideoChef: Efficient Approximation for Streaming Video Processing Pipelines.",
                    "SOCK: Rapid Task Provisioning with Serverless-Optimized Containers.",
                    "DynaMix: Dynamic Mobile Device Integration for Efficient Cross-device Resource Sharing.",
                    "The Battle of the Schedulers: FreeBSD ULE vs. Linux CFS.",
                    "The Design and Implementation of Hyperupcalls.",
                    "AIQL: Enabling Efficient Attack Investigation from System Monitoring Data.",
                    "Application Memory Isolation on Ultra-Low-Power MCUs.",
                    "Peeking Behind the Curtains of Serverless Platforms.",
                    "Soteria: Automated IoT Safety and Security Analysis.",
                    "Scaling Guest OS Critical Sections with eCS.",
                    "KylinX: A Dynamic Library Operating System for Simplified and Efficient Cloud Virtualization.",
                    "Virtualizing Energy Storage Management Using RAIBA.",
                    "Cntr: Lightweight OS Containers.",
                    "Throwhammer: Rowhammer Attacks over the Network and Defenses.",
                    "Varys: Protecting SGX Enclaves from Practical Side-Channel Attacks.",
                    "Kernel-Supported Cost-Effective Audit Logging for Causality Tracking.",
                    "EPTI: Efficient Defence against Meltdown Attack for Unpatched VMs.",
                    "Effectively Mitigating I/O Inactivity in vCPU Scheduling.",
                    "Placement of Virtual Containers on NUMA systems: A Practical and Comprehensive Model.",
                    "Getting to the Root of Concurrent Binary Search Tree Performance.",
                    "TerseCades: Efficient Data Compression in Stream Processing.",
                    "Troubleshooting Transiently-Recurring Errors in Production Systems with Blame-Proportional Logging.",
                    "NanoLog: A Nanosecond Scale Logging System.",
                    "Model Governance: Reducing the Anarchy of Production ML.",
                    "Fine-grained consistency for geo-replicated systems.",
                    "Log-Free Concurrent Data Structures.",
                    "Stable and Consistent Membership at Scale with Rapid.",
                    "On Smart Query Routing: For Distributed Graph Querying with Decoupled Storage.",
                    "Locality-Aware Software Throttling for Sparse Matrix Operation on GPUs.",
                    "Accelerating PageRank using Partition-Centric Processing.",
                    "CGraph: A Correlations-aware Approach for Efficient Concurrent Iterative Graph Processing.",
                    "Don't share, Don't lock: Large-scale Software Connection Tracking with Krononat.",
                    "Accurate Timeout Detection Despite Arbitrary Processing Delays.",
                    "Improving Service Availability of Cloud Systems by Predicting Disk Error.",
                    "RAFI: Risk-Aware Failure Identification to Improve the RAS in Erasure-coded Data Centers.",
                    "Siphon: Expediting Inter-Datacenter Coflows in Wide-Area Data Analytics.",
                    "PerfIso: Performance Isolation for Commercial Latency-Sensitive Services.",
                    "On the diversity of cluster workloads and its impact on research results.",
                    "SLAOrchestrator: Reducing the Cost of Performance SLAs for Cloud Data Analytics.",
                    "Spindle: Informed Memory Access Monitoring.",
                    "Touchstone: Generating Enormous Query-Aware Test Databases.",
                    "DSAC: Effective Static Analysis of Sleep-in-Atomic-Context Bugs in Kernel Modules.",
                    "Coccinelle: 10 Years of Automated Evolution in the Linux Kernel.",
                    "Albis: High-Performance File Format for Big Data Systems.",
                    "Litz: Elastic Framework for High-Performance Distributed Machine Learning.",
                    "Putting the \"Micro\" Back in Microservice.",
                    "Fast and Concurrent RDF Queries using RDMA-assisted GPU Graph Exploration.",
                    "MDev-NVMe: A NVMe Storage Virtualization Solution with Mediated Pass-Through.",
                    "AutoSSD: an Autonomic SSD Architecture.",
                    "Geriatrix: Aging what you see and what you don't see. A file system aging approach for modern storage systems.",
                    "Can't We All Get Along? Redesigning Protection Storage for Modern Workloads.",
                    "STMS: Improving MPTCP Throughput Under Heterogeneous Networks.",
                    "Pantheon: the training ground for Internet congestion-control research.",
                    "ClickNF: a Modular Stack for Custom Network Functions.",
                    "Selecta: Heterogeneous Cloud Storage Configuration for Data Analytics.",
                    "Remote regions: a simple abstraction for remote memory.",
                    "Understanding Ephemeral Storage for Serverless Analytics.",
                    "Solar: Towards a Shared-Everything Database on Distributed Log-Structured Storage.",
                    "Toward Coordination-free and Reconfigurable Mixed Concurrency Control.",
                    "Scaling Hardware Accelerated Network Monitoring to Concurrent and Dynamic Queries With *Flow.",
                    "Applying Hardware Transactional Memory for Concurrency-Bug Failure Recovery in Production Runs.",
                    "Tailwind: Fast and Atomic RDMA-based Replication.",
                    "On Fault Tolerance, Locality, and Optimality in Locally Repairable Codes.",
                    "TxFS: Leveraging File-System Crash Consistency to Provide ACID Transactions.",
                    "Towards Better Understanding of Black-box Auto-Tuning: A Comparative Analysis for Storage Systems.",
                    "HeavyKeeper: An Accurate Algorithm for Finding Top-k Elephant Flows.",
                    "SAND: Towards High-Performance Serverless Computing.",
                    "Cavs: An Efficient Runtime System for Dynamic Neural Networks.",
                    "DeepCPU: Serving RNN-based Deep Learning Models 10x Faster.",
                    "Closing the Performance Gap Between Volatile and Persistent Key-Value Stores Using Cross-Referencing Logs.",
                    "Metis: Robustly Tuning Tail Latencies of Cloud Systems.",
                    "Redesigning LSMs for Nonvolatile Memory with NoveLSM.",
                    "HashKV: Enabling Efficient Updates in KV Storage via Hashing."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "USENIX ATC 2017",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2017",
                "sub_name": "2017 USENIX Annual Technical Conference, USENIX ATC 2017, Santa Clara, CA, USA, July 12-14, 2017.",
                "count": 64,
                "papers": [
                    "Lock-in-Pop: Securing Privileged Operating System Kernels by Keeping on the Beaten Path.",
                    "Fast and Precise Retrieval of Forward and Back Porting Information for Linux Device Drivers.",
                    "Optimizing the TLB Shootdown Algorithm with Page Access Tracking.",
                    "Falcon: Scaling IO Performance in Multi-SSD Volumes.",
                    "deTector: a Topology-aware Monitoring System for Data Center Networks.",
                    "Pricing Intra-Datacenter Networks with Over-Committed Bandwidth Guarantee.",
                    "Unobtrusive Deferred Update Stabilization for Efficient Geo-Replication.",
                    "Don't cry over spilled records: Memory elasticity of data-parallel applications and its application to cluster scheduling.",
                    "Popularity Prediction of Facebook Videos for Higher Quality Streaming.",
                    "Squeezing out All the Value of Loaded Data: An Out-of-core Graph Processing System with Reduced Disk I/O.",
                    "Ending the Anomaly: Achieving Low Latency and Airtime Fairness in WiFi.",
                    "Persona: A High-Performance Bioinformatics Framework.",
                    "SPIN: Seamless Operating System Integration of Peer-to-Peer DMA Between SSDs and GPUs.",
                    "Poseidon: An Efficient Communication Architecture for Distributed Deep Learning on GPU Clusters.",
                    "Garaph: Efficient GPU-accelerated Graph Processing on a Single Machine with Balanced Replication.",
                    "GPU Taint Tracking.",
                    "Optimizing the Design and Implementation of the Linux ARM Hypervisor.",
                    "Multi-Hypervisor Virtual Machines: Enabling an Ecosystem of Hypervisor-level Services.",
                    "Preemptive, Low Latency Datacenter Scheduling via Lightweight Virtualization.",
                    "The RCU-Reader Preemption Problem in VMs.",
                    "Bunshin: Compositing Security Mechanisms through Diversification.",
                    "Glamdring: Automatic Application Partitioning for Intel SGX.",
                    "High-Resolution Side Channels for Untrusted Operating Systems.",
                    "Understanding Security Implications of Using Containers in the Cloud.",
                    "Memshare: a Dynamic Multi-tenant Key-value Cache.",
                    "Replication-driven Live Reconfiguration for Fast Distributed Transaction Processing.",
                    "HiKV: A Hybrid Index Key-Value Store for DRAM-NVM Memory Systems.",
                    "TRIAD: Creating Synergies Between Memory, Disk and Log in Log Structured Key-Value Stores.",
                    "Engineering Record and Replay for Deployability.",
                    "Proactive error prediction to improve storage system reliability.",
                    "Towards Production-Run Heisenbugs Reproduction on Commercial Hardware.",
                    "A DSL Approach to Reconcile Equivalent Divergent Program Executions.",
                    "Titan: Fair Packet Scheduling for Commodity Multiqueue NICs.",
                    "MopEye: Opportunistic Monitoring of Per-app Mobile Network Performance.",
                    "Emu: Rapid Prototyping of Networking Services.",
                    "Protego: Cloud-Scale Multitenant IPsec Gateway.",
                    "Cache Modeling and Optimization using Miniature Simulations.",
                    "Hyperbolic Caching: Flexible Caching for Web Applications.",
                    "Execution Templates: Caching Control Plane Decisions for Strong Scaling of Data Analytics.",
                    "cHash: Detection of Redundant Compilations via AST Hashing.",
                    "Application Crash Consistency and Performance with CCFS.",
                    "Push-Button Verification of File Systems via Crash Refinement.",
                    "Early Detection of Configuration Errors to Reduce Failure Damage.",
                    "Fast, Lean, and Accurate: Modeling Password Guessability Using Neural Networks.",
                    "Giza: Erasure Coding Objects across Global Data Centers.",
                    "SmartCuckoo: A Fast and Cost-Efficient Hashing Index Scheme for Cloud Storage Systems.",
                    "Repair Pipelining for Erasure-Coded Storage.",
                    "PARIX: Speculative Partial Writes in Erasure-Coded Systems.",
                    "E-Team: Practical Energy Accounting for Multi-Core Systems.",
                    "Scalable NUMA-aware Blocking Synchronization Primitives.",
                    "StreamBox: Modern Stream Processing on a Multicore Machine.",
                    "Everything you always wanted to know about multicore graph processing but were afraid to ask.",
                    "Graphene-SGX: A Practical Library OS for Unmodified Applications on SGX.",
                    "PrivApprox: Privacy-Preserving Stream Analytics.",
                    "Mercury: Bandwidth-Effective Prevention of Rollback Attacks Against Community Repositories.",
                    "CAB-Fuzz: Practical Concolic Testing Techniques for COTS Operating Systems.",
                    "Log-Structured Non-Volatile Main Memory.",
                    "Soft Updates Made Simple and Fast on Non-volatile Memory.",
                    "SmartMD: A High Performance Deduplication Engine with Mixed Pages.",
                    "Elastic Memory Management for Cloud Data Analytics.",
                    "Improving File System Performance of Mobile Storage Systems Using a Decoupled Defragmenter.",
                    "Octopus: an RDMA-enabled Distributed Persistent Memory File System.",
                    "iJournaling: Fine-Grained Journaling for Improving the Latency of Fsync System Call.",
                    "Scaling Distributed File Systems in Resource-Harvesting Datacenters."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "USENIX ATC 2016",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2016",
                "sub_name": "2016 USENIX Annual Technical Conference, USENIX ATC 2016, Denver, CO, USA, June 22-24, 2016.",
                "count": 58,
                "papers": [
                    "Optimizing Every Operation in a Write-optimized File System.",
                    "Pivot Tracing: Dynamic Causal Monitoring for Distributed Systems.",
                    "Environmental Conditions and Disk Reliability in Free-cooled Datacenters.",
                    "Using Crash Hoare Logic for Certifying the FSCQ File System.",
                    "COZ: Finding Code that Counts with Causal Profiling.",
                    "All Your Biases Belong to Us: Breaking RC4 in WPA-TKIP and TLS.",
                    "Under-Constrained Symbolic Execution: Correctness Checking for Real Code.",
                    "Passive Wi-Fi: Bringing Low Power to Wi-Fi Transmissions.",
                    "An Industrial-Scale Software Defined Internet Exchange Point.",
                    "PhyCloak: Obfuscating Sensing from Communication Signals.",
                    "Hyperprobe: Towards Virtual Machine Extrospection.",
                    "FLICK: Developing and Running Application-Specific Network Services.",
                    "SoftFlow: A Middlebox Architecture for Open vSwitch.",
                    "Fast and Cautious: Leveraging Multi-path Diversity for Transport Loss Recovery in Data Centers.",
                    "StackMap: Low-Latency Networking with the OS Stack and Dedicated NICs.",
                    "SLIK: Scalable Low-Latency Indexes for a Key-Value Store.",
                    "Understanding Manycore Scalability of File Systems.",
                    "ParaFS: A Log-Structured File System to Exploit the Internal Parallelism of Flash Devices.",
                    "FastCDC: a Fast and Efficient Content-Defined Chunking Approach for Data Deduplication.",
                    "Unsafe Time Handling in Smartphones.",
                    "Energy Discounted Computing on Multicore Smartphones.",
                    "Beam: Ending Monolithic Applications for Connected Devices.",
                    "Caching Doesn't Improve Mobile Web Performance (Much).",
                    "Secure and Efficient Application Monitoring and Replication.",
                    "Blockstack: A Global Naming and Storage System Secured by Blockchains.",
                    "Satellite: Joint Analysis of CDNs and Network-Level Interference.",
                    "Subversive-C: Abusing and Protecting Dynamic Message Dispatch.",
                    "Callinicos: Robust Transactional Storage for Distributed Data Structures.",
                    "Filo: Consolidated Consensus as a Cloud Service.",
                    "Modular Composition of Coordination Services.",
                    "Cheap and Available State Machine Replication.",
                    "Horton Tables: Fast Hash Tables for In-Memory Data-Intensive Computing.",
                    "Ginseng: Market-Driven LLC Allocation.",
                    "Elfen Scheduling: Fine-Grain Principled Borrowing from Latency-Critical Workloads Using Simultaneous Multithreading.",
                    "Coherence Stalls or Latency Tolerance: Informed CPU Scheduling for Socket and Core Sharing.",
                    "Replex: A Scalable, Highly Available Multi-Index Data Store.",
                    "Kinetic Modeling of Data Eviction in Cache.",
                    "Scalable In-Memory Transaction Processing with HTM.",
                    "Erasing Belady's Limitations: In Search of Flash Cache Offline Optimality.",
                    "Unlocking Energy.",
                    "Greening the Video Transcoding Service with Low-Cost Hardware Transcoders.",
                    "MEANTIME: Achieving Both Minimal Energy and Timeliness with Approximate Computing.",
                    "Design Guidelines for High Performance RDMA Systems.",
                    "Balancing CPU and Network in the Cell Distributed B-Tree Store.",
                    "An Evolutionary Study of Linux Memory Management for Fun and Profit.",
                    "Getting Back Up: Understanding How Enterprise Data Backups Fail.",
                    "SplitJoin: A Scalable, Low-latency Stream Join Architecture with Adjustable Ordering Precision.",
                    "Load the Edges You Need: A Generic I/O Optimization for Disk-based Graph Processing.",
                    "Version Traveler: Fast and Memory-Efficient Version Switching in Graph Processing Systems.",
                    "Tucana: Design and Implementation of a Fast and Efficient Scale-up Key-value Store.",
                    "Samsara: Efficient Deterministic Replay in Multiprocessor Environments with Hardware Virtualization Extensions.",
                    "Hardware-Assisted On-Demand Hypervisor Activation for Efficient Security Critical Code Execution on Mobile Devices.",
                    "gScale: Scaling up GPU Virtualization with Dynamic Sharing of Graphics Memory Space.",
                    "A General Persistent Code Caching Framework for Dynamic Binary Translation (DBT).",
                    "Instant OS Updates via Userspace Checkpoint-and-Restart.",
                    "Apps with Hardware: Enabling Run-time Architectural Customization in Smart Phones.",
                    "Testing Error Handling Code in Device Drivers Using Characteristic Fault Injection.",
                    "Multicore Locks: The Case Is Not Closed Yet."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "USENIX ATC 2015",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2015",
                "sub_name": "2015 USENIX Annual Technical Conference, USENIX ATC '15, July 8-10, Santa Clara, CA, USA.",
                "count": 47,
                "papers": [
                    "Spartan: A Distributed Array Framework with Smart Tiling.",
                    "Experience with Rules-Based Programming for Distributed, Concurrent, Fault-Tolerant Code.",
                    "Tiered Replication: A Cost-effective Alternative to Full Cluster Geo-replication.",
                    "Callisto-RTS: Fine-Grain Parallel Loops.",
                    "LAMA: Optimized Locality-aware Memory Allocation for Key-value Cache.",
                    "LSM-trie: An LSM-tree-based Ultra-Large Key-Value Store for Small Data Items.",
                    "MetaSync: File Synchronization Across Multiple Untrusted Storage Services.",
                    "Pyro: A Spatial-Temporal Big-Data Storage System.",
                    "CDStore: Toward Reliable, Secure, and Cost-Efficient Cloud Storage via Convergent Dispersal.",
                    "Surviving Peripheral Failures in Embedded Systems.",
                    "Log2: A Cost-Aware Logging Mechanism for Performance Diagnosis.",
                    "Identifying Trends in Enterprise Data Protection Systems.",
                    "Systematically Exploring the Behavior of Control Programs.",
                    "Fence: Protecting Device Availability With Uniform Resource Control.",
                    "Request-Oriented Durable Write Caching for Application Performance.",
                    "NVMKV: A Scalable, Lightweight, FTL-aware Key-Value Store.",
                    "Lightweight Application-Level Crash Consistency on Transactional Flash Storage.",
                    "WALDIO: Eliminating the Filesystem Journaling in Resolving the Journaling of Journal Anomaly.",
                    "SpanFS: A Scalable File System on Fast Storage Devices.",
                    "Shoal: Smart Allocation and Replication of Memory For Parallel Programs.",
                    "Thread and Memory Placement on NUMA Systems: Asymmetry Matters.",
                    "Latency-Tolerant Software Distributed Shared Memory.",
                    "NightWatch: Integrating Lightweight and Transparent Cache Pollution Control into Dynamic Memory Allocation Systems.",
                    "Secure Deduplication of General Computations.",
                    "Lamassu: Storage-Efficient Host-Side Encryption.",
                    "SecPod: a Framework for Virtualization-based Security Systems.",
                    "Between Mutual Trust and Mutual Distrust: Practical Fine-grained Privilege Separation in Multithreaded Applications.",
                    "GridGraph: Large-Scale Graph Processing on a Single Machine Using 2-Level Hierarchical Partitioning.",
                    "GraphQ: Graph Query Processing with Abstraction Refinement - Scalable and Programmable Analytics over Very Large Graphs on a Single PC.",
                    "Accurate Latency-based Congestion Feedback for Datacenters.",
                    "Mahimahi: Accurate Record-and-Replay for HTTP.",
                    "Slipstream: Automatic Interprocess Communication Optimization.",
                    "FloSIS: A Highly Scalable Network Flow Capture System for Fast Retrieval and Storage Efficiency.",
                    "Bistro: Scheduling Data-Parallel Jobs Against Live Production Systems.",
                    "Rubik: Unlocking the Power of Locality and End-point Flexibility in Cloud Scale Load Balancing.",
                    "Mercury: Hybrid Centralized and Distributed Scheduling in Large Shared Clusters.",
                    "Hawk: Hybrid Datacenter Scheduling.",
                    "Bolt: Faster Reconfiguration in Operating Systems.",
                    "Boosting GPU Virtualization Performance with Hybrid Shadow Page Tables.",
                    "Data Sharing or Resource Contention: Toward Performance Transparency on Multicore Systems.",
                    "Establishing a Base of Trust with Performance Counters for Enterprise Workloads.",
                    "Utilizing the IOMMU Scalably.",
                    "Selectively Taming Background Android Apps to Improve Battery Lifetime.",
                    "U-root: A Go-based, Firmware Embeddable Root File System with On-demand Compilation.",
                    "LPD: Low Power Display Mechanism for Mobile and Wearable Devices.",
                    "Memory-Centric Data Storage for Mobile Systems.",
                    "WearDrive: Fast and Energy-Efficient Storage for Wearables."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "USENIX ATC 2014",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2014",
                "sub_name": "2014 USENIX Annual Technical Conference, USENIX ATC '14, Philadelphia, PA, USA, June 19-20, 2014.",
                "count": 44,
                "papers": [
                    "ShuffleWatcher: Shuffle-aware Scheduling in Multi-tenant MapReduce Clusters.",
                    "Violet: A Storage Stack for IOPS/Capacity Bifurcated Storage Environments.",
                    "ELF: Efficient Lightweight Fast Stream Processing at Scale.",
                    "Exploiting Bounded Staleness to Speed Up Big Data Analytics.",
                    "Making State Explicit for Imperative Big Data Processing.",
                    "OSv - Optimizing the Operating System for Virtual Machines.",
                    "Gleaner: Mitigating the Blocked-Waiter Wakeup Problem for Virtualized Multicore Applications.",
                    "HYPERSHELL: A Practical Hypervisor Layer Guest OS Shell for Automated In-VM Management.",
                    "XvMotion: Unified Virtual Machine Migration over Long Distance.",
                    "GPUvm: Why Not Virtualizing GPUs at the Hypervisor?",
                    "A Full GPU Virtualization Solution with Mediated Pass-Through.",
                    "vCacheShare: Automated Server Flash Cache Space Management in a Virtualization Environment.",
                    "Missive: Fast Application Launch From an Untrusted Buffer Cache.",
                    "A Modular and Efficient Past State System for Berkeley DB.",
                    "SCFS: A Shared Cloud-backed File System.",
                    "Accelerating Restore and Garbage Collection in Deduplication-based Backup Systems via Exploiting Historical Information.",
                    "The TURBO Diaries: Application-controlled Frequency Scaling Explained.",
                    "Implementing a Leading Loads Performance Predictor on Commodity Processors.",
                    "HaPPy: Hyperthread-aware Power Profiling Dynamically.",
                    "Scalable Read-mostly Synchronization Using Passive Reader-Writer Locks.",
                    "Large Pages May Be Harmful on NUMA Systems.",
                    "Efficient Tracing of Cold Code via Bias-Free Sampling.",
                    "Gestalt: Fast, Unified Fault Localization for Networked Systems.",
                    "Insight: In-situ Online Service Failure Path Inference in Production Computing Infrastructures.",
                    "Automating the Choice of Consistency Levels in Replicated Systems.",
                    "Sirius: Distributing and Coordinating Application Reference Data.",
                    "In Search of an Understandable Consensus Algorithm.",
                    "GASPP: A GPU-Accelerated Stateful Packet Processing Framework.",
                    "Panopticon: Reaping the Benefits of Incremental SDN Deployment in Enterprise Networks.",
                    "Pythia: Diagnosing Performance Problems in Wide Area Providers.",
                    "BISmark: A Testbed for Deploying Measurements and Applications in Broadband Access Networks.",
                    "Programmatic Orchestration of WiFi Networks.",
                    "HACK: Hierarchical ACKs for Efficient Wireless Medium Utilization.",
                    "Application-Defined Decentralized Access Control.",
                    "MiniBox: A Two-Way Sandbox for x86 Native Code.",
                    "Static Analysis of Variability in System Software: The 90, 000 #ifdefs Issue.",
                    "Yat: A Validation Framework for Persistent Memory Software.",
                    "Medusa: Managing Concurrency and Communication in Embedded Systems.",
                    "Reliable Writeback for Client-side Flash Caches.",
                    "Flash on Rails: Consistent Flash Performance through Redundancy.",
                    "I/O Speculation for the Microsecond Era.",
                    "OS I/O Path Optimizations for Flash Solid-state Drives.",
                    "FlexECC: Partially Relaxing ECC of MLC SSD for Better Cache Performance.",
                    "Nitro: A Capacity-Optimized SSD Cache for Primary Storage."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "USENIX ATC 2013",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2013",
                "sub_name": "2013 USENIX Annual Technical Conference, San Jose, CA, USA, June 26-28, 2013.",
                "count": 33,
                "papers": [
                    "Optimizing VM Checkpointing for Restore Performance in VMware ESXi.",
                    "Hyper-Switch: A Scalable Software Virtual Switching Architecture.",
                    "MiG: Efficient Migration of Desktop VMs Using Semantic Compression.",
                    "Copysets: Reducing the Frequency of Data Loss in Cloud Storage.",
                    "TAO: Facebook's Distributed Data Store for the Social Graph.",
                    "PIKACHU: How to Rebalance Load in Optimizing MapReduce On Heterogeneous Clusters.",
                    "FlashFQ: A Fair Queueing I/O Scheduler for Flash-Based SSDs.",
                    "The Harey Tortoise: Managing Heterogeneous Write Performance in SSDs.",
                    "Janus: Optimal Flash Provisioning for Cloud Storage Workloads.",
                    "Using One-Sided RDMA Reads to Build a Fast, CPU-Efficient Key-Value Store.",
                    "Lightweight Memory Tracing.",
                    "Flash Caching on the Storage Client.",
                    "Practical and Effective Sandboxing for Non-root Users.",
                    "TABLEFS: Enhancing Metadata Efficiency in the Local File System.",
                    "Characterization of Incremental Data Changes for Efficient Data Protection.",
                    "On the Efficiency of Durable State Machine Replication.",
                    "Estimating Duplication by Content-based Sampling.",
                    "MutantX-S: Scalable Malware Clustering Based on Static Features.",
                    "Redundant State Detection for Dynamic Symbolic Execution.",
                    "packetdrill: Scriptable Network Stack Testing, from Sockets to Packets.",
                    "DeepDive: Transparently Identifying and Managing Performance Interference in Virtualized Environments.",
                    "Efficient and Scalable Paravirtual I/O System.",
                    "vTurbo: Accelerating Virtual Machine I/O Processing Using Designated Turbo-Sliced Core.",
                    "When Slower Is Faster: On Heterogeneous Multicores for Reliable Systems.",
                    "IAMEM: Interaction-Aware Memory Energy Management.",
                    "XLH: More Effective Memory Deduplication Scanners Through Cross-layer Hints.",
                    "Enabling OS Research by Inferring Interactions in the Black-Box GPU Stack.",
                    "Mantis: Automatic Performance Prediction for Smartphone Applications.",
                    "I/O Stack Optimization for Smartphones.",
                    "How to Run POSIX Apps in a Minimal Picoprocess.",
                    "Network Interface Design for Low Latency Request-Response Protocols.",
                    "DEFINED: Deterministic Execution for Interactive Control-Plane Debugging.",
                    "Improving Server Application Performance via Pure TCP ACK Receive Optimization."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2013esos",
                "sub_name": "2013 Workshop on Embedded Self-Organizing Systems, ESOS'13, San Jose, CA, USA, June 25, 2013.",
                "count": 7,
                "papers": [
                    "Infrastructure for Studying Infrastructure.",
                    "A Formal Specification of the Hormone Loop of an Artificial Hormone System.",
                    "Reducing the Communication Overhead of an Artificial Hormone System for Task Allocation by a Task Window.",
                    "DHT Broadcast Optimisation with ID Assignment Rules.",
                    "Solving DCOPs in Self-optimising Multi-Agent Systems by Extending the Local Objective Functions.",
                    "Using a Neural Network for Forecasting in an Organic Traffic Control Management System.",
                    "Mandatory Access Control for the Android Dalvik Virtual Machine."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "USENIX ATC 2012",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2012",
                "sub_name": "2012 USENIX Annual Technical Conference, Boston, MA, USA, June 13-15, 2012.",
                "count": 41,
                "papers": [
                    "Demand Based Hierarchical QoS Using Storage Resource Pools.",
                    "Erasure Coding in Windows Azure Storage.",
                    "Composable Reliability for Asynchronous Systems.",
                    "Managing Large Graphs on Multi-Cores with Graph Awareness.",
                    "MemProf: A Memory Profiler for NUMA Multicore Systems.",
                    "Remote Core Locking: Migrating Critical-Section Execution to Improve the Performance of Multithreaded Applications.",
                    "The Click2NetFPGA Toolchain.",
                    "Building a Power-Proportional Software Router.",
                    "netmap: A Novel Framework for Fast Packet I/O.",
                    "Toward Efficient Querying of Compressed Network Payloads.",
                    "Body Armor for Binaries: Preventing Buffer Overflows Without Recompilation.",
                    "Abstractions for Usable Information Flow Control in Aeolus.",
                    "Treehouse: Javascript Sandboxes to Help Web Developers Help Themselves.",
                    "Cloud Terminal: Secure Access to Sensitive Applications from Untrusted Systems.",
                    "Mosh: An Interactive Remote Shell for Mobile Clients.",
                    "TROPIC: Transactional Resource Orchestration Platform in the Cloud.",
                    "Trickle: Rate Limiting YouTube Video Streaming.",
                    "Tolerating Overload Attacks Against Packet Capturing Systems.",
                    "Enforcing Murphy's Law for Advance Identification of Run-time Failures.",
                    "A Scalable Server for 3D Metaverses.",
                    "Granola: Low-Overhead Distributed Transaction Coordination.",
                    "High Performance Vehicular Connectivity with Opportunistic Erasure Coding.",
                    "Server-assisted Latency Management for Wide-area Distributed Systems.",
                    "Generating Realistic Datasets for Deduplication Analysis.",
                    "An Empirical Study of Memory Sharing in Virtual Machines.",
                    "Primary Data Deduplication - Large Scale Study and System Design.",
                    "Design and Implementation of an Embedded Python Run-Time System.",
                    "AddressSanitizer: A Fast Address Sanity Checker.",
                    "Software Persistent Memory.",
                    "Rivet: Browser-agnostic Remote Debugging for Web Applications.",
                    "Wimpy Nodes with 10GbE: Leveraging One-Sided Operations in Soft-RDMA to Boost Memcached.",
                    "Revisiting Software Zero-Copy for Web-caching Applications with Twin Memory Allocation.",
                    "Seagull: Intelligent Cloud Bursting for Enterprise Applications.",
                    "The Forgotten 'Uncore': On the Energy-Efficiency of Heterogeneous Cores.",
                    "Software Techniques for Avoiding Hardware Virtualization Exits.",
                    "AppScope: Application Energy Metering Framework for Android Smartphone Using Kernel Activity Monitoring.",
                    "Gdev: First-Class GPU Resource Management in the Operating System.",
                    "Gnothi: Separating Data and Metadata for Efficient and Available Storage Replication.",
                    "Dynamic Reconfiguration of Primary/Backup Clusters.",
                    "Surviving Congestion in Geo-Distributed Storage Systems.",
                    "Practical Hardening of Crash-Tolerant Systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "USENIX ATC 2011",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2011",
                "sub_name": "2011 USENIX Annual Technical Conference, Portland, OR, USA, June 15-17, 2011.",
                "count": 35,
                "papers": [
                    "Eyo: Device-Transparent Personal Storage.",
                    "Autonomous Storage Management for Personal Devices with PodBase.",
                    "Semantics of Caching with SPOCA: A Stateless, Proportional, Optimally-Consistent Addressing Algorithm.",
                    "TidyFS: A Simple and Small Distributed File System.",
                    "Enabling Security in Cloud Storage SLAs with CloudProof.",
                    "jVPFS: Adding Robustness to a Secure Stacked File System with Untrusted Local Storage Components.",
                    "G2: A Graph Processing System for Diagnosing Distributed Systems.",
                    "Context-based Online Configuration-Error Detection.",
                    "OFRewind: Enabling Record and Replay Troubleshooting for Networks.",
                    "ORDER: Object centRic DEterministic Replay for Java.",
                    "Building a High-performance Deduplication System.",
                    "SiLo: A Similarity-Locality based Near-Exact Deduplication Scheme with Low RAM Overhead and High Throughput.",
                    "Slow Down or Sleep, That Is the Question.",
                    "Low Cost Working Set Size Tracking.",
                    "FVD: A High-Performance Virtual Machine Image Format for Cloud.",
                    "Okeanos: Wasteless Journaling for Fast and Reliable Multistream Storage.",
                    "Toward Online Testing of Federated and Heterogeneous Distributed Systems.",
                    "CDE: Using System Call Interposition to Automatically Create Portable Software Packages.",
                    "Vsys: A Programmable sudo.",
                    "Internet-scale Visualization and Detection of Performance Events.",
                    "Polygraph: System for Dynamic Reduction of False Alerts in Large-Scale IT Service Delivery Environments.",
                    "Victim Disk First: An Asymmetric Cache to Boost the Performance of Disk Arrays under Faulty Conditions.",
                    "The Design and Evolution of Live Storage Migration in VMware ESX.",
                    "Online Migration for Geo-distributed Storage Systems.",
                    "Exception-Less System Calls for Event-Driven Servers.",
                    "Resizable, Scalable, Concurrent Hash Tables via Relativistic Programming.",
                    "HiTune: Dataflow-Based Performance Analysis for Big Data Cloud.",
                    "Taming the Flying Cable Monster: A Topology Design and Optimization Framework for Data-Center Networks.",
                    "In-situ MapReduce for Log Processing.",
                    "vIC: Interrupt Coalescing for Virtual Machine Storage Device IO.",
                    "Power Budgeting for Virtualized Data Centers.",
                    "vIOMMU: Efficient IOMMU Emulation.",
                    "A Case for NUMA-aware Contention Management on Multicore Systems.",
                    "TimeGraph: GPU Scheduling for Real-Time Multi-Tasking Environments.",
                    "Pegasus: Coordinated Scheduling for Virtualized Accelerator-based Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2011wiov",
                "sub_name": "3rd Workshop on I/O Virtualization, WIOV'11, Portland, OR, USA, June 14, 2011.",
                "count": 5,
                "papers": [
                    "Revisiting the Storage Stack in Virtualized NAS Environments.",
                    "Nested QoS: Providing Flexible Performance in Shared IO Environment.",
                    "Gatekeeper: Supporting Bandwidth Guarantees for Multi-tenant Datacenter Networks.",
                    "SplitX: Split Guest/Hypervisor Execution on Multi-Core.",
                    "VAMOS: Virtualization Aware Middleware."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "USENIX ATC 2010",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2010",
                "sub_name": "2010 USENIX Annual Technical Conference, Boston, MA, USA, June 23-25, 2010.",
                "count": 24,
                "papers": [
                    "An Extensible Technique for High-Precision Testing of Recovery Code.",
                    "Mining Invariants from Console Logs for System Problem Detection.",
                    "An Analysis of Power Consumption in a Smartphone.",
                    "SleepServer: A Software-Only Approach for Reducing the Energy Consumption of PCs within Enterprise Environments.",
                    "Sleepless in Seattle No Longer.",
                    "Wide-area Network Acceleration for the Developing World.",
                    "An Evaluation of Per-Chip Nonuniform Frequency Scaling on Multicores.",
                    "A DNS Reflection Method for Global Traffic Management.",
                    "A Transparently-Scalable Metadata Service for the Ursa Minor Storage System.",
                    "FlashVM: Virtual Memory Management on Flash.",
                    "Dyson: An Architecture for Extensible Wireless LANs.",
                    "ChunkStash: Speeding Up Inline Storage Deduplication Using Flash Memory.",
                    "Proxychain: Developing a Robust and Efficient Authentication Infrastructure for Carrier-Scale VoIP Networks.",
                    "ZooKeeper: Wait-free Coordination for Internet-scale Systems.",
                    "Testing Closed-Source Binary Device Drivers with DDT.",
                    "A Realistic Evaluation of Memory Hardware Errors and Software System Susceptibility.",
                    "The Utility Coprocessor: Massively Parallel Computation from the Coffee Shop.",
                    "Apiary: Easy-to-Use Desktop Application Fault Containment on Commodity Operating Systems.",
                    "Tolerating Malicious Device Drivers in Linux.",
                    "Stout: An Adaptive Interface to Scalable Cloud Storage.",
                    "IsoStack - Highly Efficient Network Processing on Dedicated Cores.",
                    "DEFCON: High-Performance Event Processing with Information Security.",
                    "Wide-Area Route Control for Distributed Services.",
                    "LiteGreen: Saving Energy in Networked Desktops Using Virtualization."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "USENIX ATC 2009",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2009",
                "sub_name": "2009 USENIX Annual Technical Conference, San Diego, CA, USA, June 14-19, 2009.",
                "count": 31,
                "papers": [
                    "Immediate Multi-Threaded Dynamic Software Updates Using Stack Reconstruction.",
                    "The Beauty and the Beast: Vulnerabilities in Red Hat's Packages.",
                    "Black-Box Performance Control for High-Volume Non-Interactive Systems.",
                    "Server Workload Analysis for Power Minimization using Consolidation.",
                    "RCB: A Simple and Practical Framework for Real-time Collaborative Browsing.",
                    "Reducing Seek Overhead with Application-Directed Prefetching.",
                    "Fido: Fast Inter-Virtual-Machine Communication for Enterprise Appliances.",
                    "STOW: A Spatially and Temporally Optimized Write Caching Algorithm.",
                    "The Restoration of Early UNIX Artifacts.",
                    "Block Management in Solid-State Devices.",
                    "Linux Kernel Developer Responses to Static Analysis Bug Reports.",
                    "Hardware Execution Throttling for Multi-core Resource Management.",
                    "Automatically Generating Predicates and Solutions for Configuration Troubleshooting.",
                    "JustRunIt: Experiment-Based Management of Virtualized Data Centers.",
                    "vPath: Precise Discovery of Request Processing Paths from Black-Box Observations of Thread and Network Activities.",
                    "Decaf: Moving Device Drivers to a Modern Language.",
                    "Rump File Systems: Kernel Code Reborn.",
                    "CiAO: An Aspect-Oriented Operating-System Family for Resource-Constrained Embedded Systems.",
                    "Object Storage on CRAQ: High-Throughput Chain Replication for Read-Mostly Workloads.",
                    "Census: Location-Aware Membership Management for Large-Scale Distributed Systems.",
                    "Veracity: Practical Secure Network Coordinates via Vote-based Agreements.",
                    "Tolerating File-System Mistakes with EnvyFS.",
                    "Decentralized Deduplication in SAN Cluster File Systems.",
                    "FlexFS: A Flexible Flash File System for MLC NAND Flash Memory.",
                    "Layering in Provenance Systems.",
                    "Design and Implementation of TCP Data Probes for Reliable and Metric-Rich Network Path Monitoring.",
                    "StrobeLight: Lightweight Availability Mapping and Anomaly Detection.",
                    "Hashing Round-down Prefixes for Rapid Packet Classification.",
                    "Satori: Enlightened Page Sharing.",
                    "vNUMA: A Virtual Shared-Memory Multiprocessor.",
                    "ShadowNet: A Platform for Rapid and Safe Network Evolution."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "USENIX ATC 2008",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2008",
                "sub_name": "2008 USENIX Annual Technical Conference, Boston, MA, USA, June 22-27, 2008. Proceedings.",
                "count": 34,
                "papers": [
                    "VMwareDecoupling Dynamic Program Analysis from Execution in Virtual Environments.",
                    "Protection Strategies for Direct Access to Virtualized I/O Devices.",
                    "Bridging the Gap between Software and Hardware Techniques for I/O Virtualization.",
                    "Idle Read After Write - IRAW.",
                    "Design Tradeoffs for SSD Performance.",
                    "Context-Aware Mechanisms for Reducing Interactive Delays of Energy Management in Disks.",
                    "Optimizing TCP Receive Performance.",
                    "ConfiDNS: Leveraging Scale and History to Detect Compromise.",
                    "Large-scale Virtualization in the Emulab Network Testbed.",
                    "FlexVol: Flexible, Efficient File Volume Virtualization in WAFL.",
                    "Fast, Inexpensive Content-Addressed Storage in Foundation.",
                    "Adaptive File Transfers for Diverse Environments.",
                    "Handling Flash Crowds from Your Garage.",
                    "Remote Profiling of Resource Constraints of Web Servers Using Mini-Flash Crowds.",
                    "A Dollar from 15 Cents: Cross-Platform Management for Internet Services.",
                    "Measurement and Analysis of Large-Scale Network File System Workloads.",
                    "Evaluating Distributed Systems: Does Background Traffic Matter?",
                    "Cutting Corners: Workbench Automation for Server Benchmarking.",
                    "Power-aware Remote Replication for Enterprise-level Disaster Recovery Systems.",
                    "A Linux Implementation Validation of Track-Aligned Extents and Track-Aligned RAIDs.",
                    "Automatic Optimization of Parallel Dataflow Programs.",
                    "A TCP-layer Name Service for TCP Ports.",
                    "Using Causality to Diagnose Configuration Bugs.",
                    "Diverse Replication for Single-Machine Byzantine-Fault Tolerance.",
                    "Vx32: Lightweight User-level Sandboxing on the x86.",
                    "LeakSurvivor: Towards Safely Tolerating Memory Leaks for Garbage-Collected Languages.",
                    "Perspectives:  Improving SSH-style Host Authentication with Multi-Path Probing.",
                    "Spectator: Detection and Containment of JavaScript Worms.",
                    "A Compacting Real-Time Memory Management System.",
                    "Prefetching with Adaptive Cache Culling for Striped Disk Arrays.",
                    "Context-Aware Prefetching at the Storage Server .",
                    "Free Factories: Unified Infrastructure for Data Intensive Web Services.",
                    "Wide-Scale Data Stream Management.",
                    "Experiences with Client-based Speculative Remote Display."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2008lasco",
                "sub_name": "First USENIX Workshop on Large-Scale Computing, LASCO 2008, June 23, 2008, Boston, MA, USA, Proceedings.",
                "count": 6,
                "papers": [
                    "XOS-SSH: A Lightweight User-Centric Tool to Support Remote Execution in Virtual Organizations.",
                    "Improving Scalability and Fault Tolerance in an Application Management Infrastructure.",
                    "The XtreemOS JScheduler: Using Self-Scheduling Techniques in Large Computing Architectures.",
                    "A Multi-Site Virtual Cluster System for Wide Area Networks.",
                    "A Comparative Experimental Study of Parallel File Systems for Large-Scale Data Processing.",
                    "Striping without Sacrifices: Maintaining POSIX Semantics in a Parallel File System."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "USENIX ATC 2007",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2007",
                "sub_name": "Proceedings of the 2007 USENIX Annual Technical Conference, Santa Clara, CA, USA, June 17-22, 2007.",
                "count": 52,
                "papers": [
                    "The Impact of Virtualization on Computing Systems.",
                    "Energy Management for Hypervisor-Based Virtual Machines.",
                    "Xenprobus, a Lightweight User-Space Probing Framework for Xen Virtual Machine.",
                    "Virtual Machine Memory Access Tracing with Hypervisor Exclusive Cache.",
                    "Hyperion: High Volume Stream Archival for Retrospective Querying.",
                    "Load Shedding in Network Monitoring Applications.",
                    "Configuration Management at Massive Scale: System Design and Experience.",
                    "Events Can Make Sense.",
                    "MapJAX: Data Structure Abstractions for Asynchronous Web Applications.",
                    "Sprockets: Safe Extensions for Distributed File Systems.",
                    "SafeStore: A Durable and Practical Storage System.",
                    "POTSHARDS: Secure Long-Term Storage Without Encryption.",
                    "Dandelion: Cooperative Content Distribution with Robust Incentives.",
                    "Using Provenance to Aid in Personal File Search.",
                    "Supporting Practical Content-Addressable Caching with CZIP Compression.",
                    "Implementation and Performance Evaluation of Fuzzy File Block Matching.",
                    "From Trusted to Secure: Building and Executing Applications That Enforce System Security.",
                    "From STEM to SEAD: Speculative Execution for Automated Defense.",
                    "Dynamic Spyware Analysis.",
                    "Evaluating Block-level Optimization Through the IO Path.",
                    "DiskSeen: Exploiting Disk Layout and Access History to Enhance I/O Prefetch.",
                    "A Memory Soft Error Measurement on Production Systems.",
                    "Addressing Email Loss with SureMail: Measurement, Design, and Evaluation.",
                    "Wresting Control from BGP: Scalable Fine-Grained Route Control.",
                    "A Comparison of Structured and Unstructured P2P Approaches to Heterogeneous Random Peer Selection.",
                    "Transparent Checkpoint-Restart of Multiple Processes on Commodity Operating Systems.",
                    "Reboots Are for Hardware: Challenges and Solutions to Updating an Operating System on the Fly.",
                    "Exploring Recovery from Operating System Lockups.",
                    "Supporting Multiple OSes with OS Switching.",
                    "Cool Job Allocation: Measuring the Power Savings of Placing Jobs at Cooling-Efficient Locations in the Data Center.",
                    "Passwords for Everyone: Secure Mnemonic-based Accessible Authentication.",
                    "Virtually Shared Displays and User Input Devices.",
                    "Life Is Not a State-Machine: The Long Road from Research to Production.",
                    "Exploiting Online Games.",
                    "Second Life.",
                    "Specializing General-Purpose Computing: A New Approach to Designing Clusters for High-Performance Technical Computing.",
                    "Live Malware Attack!",
                    "LiveJournal's Backend Technologies.",
                    "MapReduce and Other Building Blocks for Large-Scale Distributed Systems at Google.",
                    "Perfect Data in an Imperfect World.",
                    "Human Computation.",
                    "Warehouse-scale Computers.",
                    "Python Programming Language.",
                    "Advanced Perl.",
                    "Programming Languages.",
                    "Building and Running an Open-Source Community: The FreeBSD Project.",
                    "Datacenters.",
                    "Wireless Networks.",
                    "VMware Virtual Infrastructure Tools and Techniques.",
                    "Security Is Broken.",
                    "UNIX/Linux and Active Directory Interoperability.",
                    "Crossing the Digital Divide: The Latest Efforts from One Laptop per Child."
                ]
            },
            {
                "sub_name_abbr": "conf/sruti/2007",
                "sub_name": "3rd Workshop on Steps to Reducing Unwanted Traffic on the Internet, SRUTI'07, Santa Clara, CA, USA, June 18, 2007.",
                "count": 5,
                "papers": [
                    "Analyzing Network and Content Characteristics of Spim Using Honeypots.",
                    "A New Service for Increasing the Effectiveness of Network Address Blacklists.",
                    "Accountability as a Service.",
                    "BotTorrent: Misusing BitTorrent to Launch DDoS Attacks.",
                    "Boundary Detection and Containment of Local Worm Infections."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "USENIX ATC 2006",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2006g",
                "sub_name": "Proceedings of the 2006 USENIX Annual Technical Conference, Boston, MA, USA, May 30 - June 3, 2006.",
                "count": 58,
                "papers": [
                    "Opening Remarks.",
                    "PlanetLab: Evolution vs. Intelligent Design in Planetary-Scale Infrastructure.",
                    "Antfarm: Tracking Processes in a Virtual Machine Environment.",
                    "Optimizing Network Virtualization in Xen (awarded best paper).",
                    "High Performance VMM-Bypass I/O in Virtual Machines.",
                    "Provenance-Aware Storage Systems.",
                    "Thresher: An Efficient Storage Manager for Copy-on-write Snapshots.",
                    "Design Tradeoffs in Applying Content Addressable Storage to Enterprise-scale Systems Based on Virtual Machines.",
                    "Compare-by-Hash: A Reasoned Analysis.",
                    "An Evaluation of Network Stack Parallelization Strategies in Modern Operating Systems.",
                    "Disk Drive Level Workload Characterization.",
                    "Towards a Resilient Operating System for Wireless Sensor Networks.",
                    "Transparent Contribution of Memory.",
                    "Implementation and Evaluation of Moderate Parallelism in the BIND9 DNS Server.",
                    "Flux: A Language for Programming High-Performance Servers.",
                    "Understanding and Addressing Blocking-Induced Network Server Latency.",
                    "Reval: A Tool for Real-time Evaluation of DDoS Mitigation Strategies.",
                    "LADS: Large-scale Automated DDoS Detection System.",
                    "Bump in the Ether: A Framework for Securing Sensitive User Input.",
                    "Sharing Networked Resources with Brokered Leases.",
                    "Understanding and Validating Database System Administration.",
                    "SMART: An Integrated Multi-Action Advisor for Storage Systems.",
                    "sMonitor: A Non-Intrusive Client-Perceived End-to-End Performance Monitor of Secured Internet Services.",
                    "Privacy Analysis for Data Sharing in *nix Systems.",
                    "Securing Web Service by Automatic Robot Detection.",
                    "Cutting through the Confusion: A Measurement Study of Homograph Attacks.",
                    "Stealth Probing: Efficient Data-Plane Security for IP Routing.",
                    "Service Placement in a Shared Wide-Area Platform.",
                    "Replay Debugging for Distributed Applications (Awarded Best Paper!).",
                    "Loose Synchronization for Large-Scale Networked Systems.",
                    "System- and Application-level Support for Runtime Hardware Reconfiguration on SoC Platforms.",
                    "Resilient Connections for SSH and TLS.",
                    "Structured and Unstructured Overlays under the Microscope: A Measurement-based View of Two P2P Systems That People Use.",
                    "Reclaiming Network-wide Visibility Using Ubiquitous Endsystem Monitors.",
                    "Integrated Scientific Workflow Management for the Emulab Network Testbed.",
                    "How DNS Misnaming Distorts Internet Topology Mapping.",
                    "Efficient Query Subscription Processing for Prospective Search Engines.",
                    "IP Only Server.",
                    "Deploying a Sensor Network on an Active Volcano.",
                    "Panel: Open Source Software Business Models.",
                    "Success, Failure, and Alternative Solutions for Network Security.",
                    "Panel: Is University Systems Teaching and Research Relevant to Industry?.",
                    "Architectures and Algorithms for Biomolecular Simulation.",
                    "Permissive Action Links, Nuclear Weapons, and the History of Public Key Cryptography.",
                    "Gold and Fool's Gold: Successes, Failures, and Futures in Computer Systems Research.",
                    "Routing Without Tears, Bridging Without Danger.",
                    "An Introduction to Software Radio.",
                    "Hackers and Founders.",
                    "Computers, Developers, and The Law.",
                    "Hacking Perl².",
                    "Algorithms and Data Structures for the 21st Century.",
                    "Sure, You Can Archive Data, But Will You Be Able to Retrieve It in 20 Years?.",
                    "RRDTool: Logging and Graphing.",
                    "Security Is Broken.",
                    "VoIP Security.",
                    "Privacy & Cryptography.",
                    "Surviving Spam Mail.",
                    "High Capacity and High Performance Storage on a Limited Budget."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "USENIX ATC 2005",
        "info": "Anaheim, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2005g",
                "sub_name": "Proceedings of the 2005 USENIX Annual Technical Conference, April 10-15, 2005, Anaheim, CA, USA.",
                "count": 36,
                "papers": [
                    "Debugging Operating Systems with Time-Traveling Virtual Machines (Awarded General Track Best Paper Award!).",
                    "Using Valgrind to Detect Undefined Value Errors with Bit-Precision.",
                    "Pulse: A Dynamic Deadlock Detection Mechanism Using Speculative Execution.",
                    "Surviving Internet Catastrophes.",
                    "Making Scheduling \"Cool\": Temperature-Aware Workload Placement in Data Centers.",
                    "CHAMELEON: A Self-Evolving, Fully-Adaptive Resource Arbitrator for Storage Systems.",
                    "A Transactional Flash File System for Microcontrollers.",
                    "Analysis and Evolution of Journaling File Systems.",
                    "Comparison-Based File Server Verification.",
                    "Active Internet Traffic Filtering: Real-Time Response to Denial-of-Service Attacks.",
                    "Building a Reactive Immune System for Software Services.",
                    "Attrition Defenses for a Peer-to-Peer Digital Preservation System.",
                    "Peer-to-Peer Communication Across Network Address Translators.",
                    "Maintaining High-Bandwidth Under Dynamic Network Conditions.",
                    "Server Network Scalability and TCP Offload.",
                    "A Hierarchical Semantic Overlay Approach to P2P Similarity Search.",
                    "A Parts-of-File File System.",
                    "BINDER: An Extrusion-Based Break-In Detector for Personal Computers.",
                    "Proper: Privileged Operations in a Virtualised System Environment.",
                    "AMP: Program Context Specific Buffer Caching.",
                    "Automatic Synthesis of Filters to Discard Buffer Overflow Attacks: A Step Towards Realizing Self-Healing Systems.",
                    "Facilitating the Development of Soft Devices.",
                    "Implementing Transparent Shared Memory on Clusters Using Virtual Machines.",
                    "Measuring CPU Overhead for I/O Processing in the Xen Virtual Machine Monitor.",
                    "Fast Transparent Migration for Virtual Machines.",
                    "Performance of Multithreaded Chip Multiprocessors and Implications for Operating System Design.",
                    "Hyper-Threading Aware Process Scheduling Heuristics.",
                    "A Portable Kernel Abstraction for Low-Overhead Ephemeral Mapping Management.",
                    "Adaptive Main Memory Compression.",
                    "Drive-Thru: Fast, Accurate Evaluation of Storage Power Management.",
                    "Itanium - A System Implementor's Tale(Awarded General Track Best Student Paper Award!).",
                    "Providing Dynamic Update in an Operating System.",
                    "SARC: Sequential Prefetching in Adaptive Replacement Cache.",
                    "SLINKY: Static Linking Reloaded.",
                    "CLOCK-Pro: An Effective Improvement of the CLOCK Replacement.",
                    "Group Ratio Round-Robin: O(1) Proportional Share Scheduling for Uniprocessor and Multiprocessor Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2005f",
                "sub_name": "Proceedings of the FREENIX Track: 2005 USENIX Annual Technical Conference, April 10-15, 2005, Anaheim, CA, USA.",
                "count": 21,
                "papers": [
                    "Build Buddy for Fun and Profit.",
                    "Scmbug: Policy-based Integration of Software Configuration Management with Bug-tracking.",
                    "Linux Physical Memory Analysis.",
                    "Running Virtualized Native Drivers in User Mode Linux.",
                    "QEMU, a Fast and Portable Dynamic Translator.",
                    "USB/IP - A Peripheral Bus Extension for Device Sharing over IP Network (Awarded FREENIX Track Best Paper Award!).",
                    "Trickle: A Userland Bandwidth Shaper for UNIX-like Systems.",
                    "A Tool for Automated iptables Firewall Analysis.",
                    "Grave Robbers from Outer Space: Using 9P2000 Under Linux.",
                    "Under the Hood: Open Source Business Models in Context.",
                    "Mac OS X Tiger: What's New for UNIX Users?",
                    "Linux and JPL's Mars Exploration Rover Project: Earth-based Planning, Simulation, and Really Remote Scheduling.",
                    "Ourmon and Network Monitoring Performance.",
                    "Brooery: A Graphical Environment for Analysis of Security-Relevant Network Activity.",
                    "NetState: A Network Version Tracking System.",
                    "OpenCSG: A Library for Image-Based CSG Rendering.",
                    "FreeVGA: Architecture Independent Video Graphics Initialization for LinuxBIOS.",
                    "The Ethernet Speaker System.",
                    "A PC-Based Open-Source Voting Machine with an Accessible Voter-Verifiable Paper Ballot.",
                    "Auto-pilot: A Platform for System Software Benchmarking.",
                    "Interactive Performance Measurement with VNCPlay."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "USENIX ATC 2004",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2004g",
                "sub_name": "Proceedings of the General Track: 2004 USENIX Annual Technical Conference, June 27 - July 2, 2004, Boston Marriott Copley Place, Boston, MA, USA.",
                "count": 21,
                "papers": [
                    "Making the \"Box\" Transparent: System Call Performance as a First-Class Result.",
                    "Dynamic Instrumentation of Production Systems.",
                    "Flashback: A Lightweight Extension for Rollback and Deterministic Replay for Software Debugging.",
                    "Email Prioritization: Reducing Delays on Legitimate Mail Caused by Junk Mail.",
                    "Redundancy Elimination Within Large Collections of Files.",
                    "Alternatives for Detecting Redundancy in Storage Systems Data.",
                    "Monkey See, Monkey Do: A Tool for TCP Tracing and Replaying.",
                    "A Transport Layer Approach for Improving End-to-End Performance and Robustness Using Redundant Paths.",
                    "Multihoming Performance Benefits: An Experimental Evaluation of Practical Enterprise Strategies.",
                    "Handling Churn in a DHT (Awarded Best Paper!).",
                    "A Network Positioning System for the Internet.",
                    "Early Experience with an Internet Broadcast System Based on Overlay Multicast.",
                    "Reliability and Security in the CoDeeN Content Distribution Network.",
                    "Building Secure High-Performance Web Services with OKWS.",
                    "REX: Secure, Extensible Remote Execution.",
                    "Network Subsystems Reloaded: A High-Performance, Defensible Network Subsystem.",
                    "accept()able Strategies for Improving Web Server Performance.",
                    "Lazy Asynchronous I/O for Event-Driven Servers.",
                    "Energy Efficient Prefetching and Caching (Awarded Best Paper!).",
                    "Time-based Fairness Improves Performance in Multi-Rate WLANs.",
                    "EmStar: A Software Environment for Developing and Deploying Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2004f",
                "sub_name": "Proceedings of the FREENIX Track: 2004 USENIX Annual Technical Conference, June 27 - July 2, 2004, Boston Marriott Copley Place, Boston, MA, USA.",
                "count": 16,
                "papers": [
                    "Migrating an MVS Mainframe Application to a PC.",
                    "C-JDBC: Flexible Database Clustering Middleware.",
                    "Wayback: A User-level Versioning File System for Linux (Awarded Best Paper!).",
                    "Glitz: Hardware Accelerated Image Compositing Using OpenGL.",
                    "High Performance X Servers in the Kdrive Architecture.",
                    "How Xlib Is Implemented (and What We're Doing About It).",
                    "Design and Implementation of Netdude, a Framework for Packet Trace Manipulation (Awarded Best Student Paper!).",
                    "Trusted Path Execution for the Linux 2.6 Kernel as a Linux Security Module.",
                    "Modular Construction of DTE Policies.",
                    "Demonstration: Croquet, a Networked Collaborative 3D Immersive Environment.",
                    "Managing Volunteer Activity in Free Software Projects.",
                    "Creating a Portable Programming Language Using Open Source Software.",
                    "Current Gtk+ Development.",
                    "KDE Kontact: An Application Integration Framework.",
                    "mGTK: An SML Binding of Gtk+.",
                    "Xen and the Art of Repeated Research."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "USENIX ATC 2003",
        "info": "San Antonio, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2003g",
                "sub_name": "Proceedings of the General Track: 2003 USENIX Annual Technical Conference, June 9-14, 2003, San Antonio, Texas, USA.",
                "count": 24,
                "papers": [
                    "Undo for Operators: Building an Undoable E-mail Store.",
                    "Role Classification of Hosts Within Enterprise Networks Based on Connection Patterns.",
                    "A Cooperative Internet Backup Scheme.",
                    "Currentcy: A Unifying Abstraction for Expressing Energy Management Policies.",
                    "Design and Implementation of Power-Aware Virtual Memory.",
                    "Operating System Support for Virtual Machines.",
                    "A Multi-User Virtual Machine.",
                    "A Logic File System.",
                    "Application-specific Delta-encoding via Resemblance Detection.",
                    "Opportunistic Use of Content Addressable Storage for Distributed File Systems.",
                    "System Support for Online Reconfiguration.",
                    "Checkpoints of GUI-based Applications.",
                    "CUP: Controlled Update Propagation in Peer-to-Peer Networks.",
                    "The Design of the {OpenBSD} Cryptographic Framework.",
                    "NCryptfs: A Secure and Convenient Cryptographic File System.",
                    "A Binary Rewriting Defense Against Stack based Buffer Overflow Attacks.",
                    "Kernel Support for Faster Web Proxies.",
                    "Multiprocessor Support for Event-Driven Programs.",
                    "Seneca: remote mirroring done write.",
                    "Eviction-based Cache Placement for Storage Caches.",
                    "Fast, Scalable Disk Imaging with Frisbee.",
                    "Robust, Portable I/O Scheduling with the Disk Mimic.",
                    "Controlling Your PLACE in the File System with Gray-box Techniques.",
                    "Operating System I/O Speculation: How Two Invocations Are Faster Than One."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2003f",
                "sub_name": "Proceedings of the FREENIX Track: 2003 USENIX Annual Technical Conference, June 9-14, 2003, San Antonio, Texas, USA.",
                "count": 27,
                "papers": [
                    "Implementation of a Modern Web Search Engine Cluster.",
                    "CSE - A C++ Servlet Environment for High-Performance Web Applications.",
                    "U-P2P: A Peer-to-Peer Framework for Universal Resource Sharing and Discovery.",
                    "GNU Mailman, Internationalized.",
                    "ASK: Active Spam Killer.",
                    "Learning Spam: Simple Techniques For Freely-Available Software.",
                    "Network Programming for the Rest of Us.",
                    "In-Place Rsync: File Synchronization for Mobile and Wireless Devices.",
                    "NFS Tricks and Benchmarking Traps.",
                    "Flexibility in ROM: A Stackable Open Source BIOS.",
                    "Console over Ethernet.",
                    "Implementing a Clonable Network Stack in the FreeBSD Kernel.",
                    "StarFish: highly-available block storage.",
                    "Secure and Flexible Global File Sharing.",
                    "The CryptoGraphic Disk Driver.",
                    "xstroke: Full-screen Gesture Recognition for X.",
                    "Matchbox: Window Management Not for the Desktop.",
                    "X Window System Network Performance.",
                    "Building a Wireless Community Network in the Netherlands.",
                    "OpenCM: Early Experiences and Lessions Learned.",
                    "Free Software and High-Power Rocketry: The Portland State Aerospace Society.",
                    "POSIX Access Control Lists on Linux.",
                    "Privman: A Library for Partitioning Applications.",
                    "The TrustedBSD MAC Framework: Extensible Kernel Access Control for FreeBSD 5.0.",
                    "Using Read-Copy-Update Techniques for System V IPC in the Linux 2.5 Kernel.",
                    "An Implementation of User-level Restartable Atomic Sequences on the NetBSD Operating System.",
                    "Providing a Linux API on the Scalable K42 Kernel."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "USENIX ATC 2002",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2002g",
                "sub_name": "Proceedings of the General Track: 2002 USENIX Annual Technical Conference, June 10-15, 2002, Monterey, California, USA.",
                "count": 25,
                "papers": [
                    "Structure and Performance of the Direct Access File System.",
                    "Conquest: Better Performance Through a Disk/Persistent-RAM Hybrid File System.",
                    "Exploiting Gray-Box Knowledge of Buffer-Cache Management.",
                    "The JX Operating System.",
                    "Design Evolution of the EROS Single-Level Store.",
                    "Think: A Software Framework for Component-based Operating System Kernels.",
                    "Ninja: A Framework for Network Services.",
                    "Using Cohort-Scheduling to Enhance Server Performance.",
                    "EtE: Passive End-to-End Internet Service Performance Monitoring.",
                    "The Performance of Remote Display Mechanisms for Thin-Client Computing.",
                    "A Mechanism for TCP-Friendly Transport-Level Protocol Coordination.",
                    "My Cache or Yours? Making Storage More Exclusive.",
                    "Bridging the Information Gap in Storage Protocol Stacks.",
                    "Maximizing Throughput in Replicated Disk Striping of Variable Bit-Rate Streams.",
                    "Simple and General Statistical Profiling with PCT.",
                    "Engineering a Differencing and Compression Data Format.",
                    "A Precise and Efficient Evaluation of the Proximity Between Web Clients and Their Local DNS Servers.",
                    "Geographic Properties of Internet Routing.",
                    "Providing Process Origin Information to Aid in Network Traceback.",
                    "Cyclone: A Safe Dialect of C.",
                    "Cooperative Task Management Without Manual Stack Management.",
                    "Improving Wait-Free Algorithms for Interprocess Communication in Embedded Real-Time Systems.",
                    "Robust Positioning Algorithms for Distributed Ad-Hoc Wireless Sensor Networks.",
                    "Application-specific Network Management for Energy-Aware Streaming of Popular Multimedia Formats.",
                    "Characterizing Alert and Browse Services of Mobile Clients."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2002f",
                "sub_name": "Proceedings of the FREENIX Track: 2002 USENIX Annual Technical Conference, June 10-15, 2002, Monterey, California, USA.",
                "count": 26,
                "papers": [
                    "Interactive 3D Graphics Applications for Tcl.",
                    "The AGFL Grammar Work Lab.",
                    "SWILL: A Simple Embedded Web Server Library.",
                    "Linux NFS Client Write Performance.",
                    "A Study of the Relative Costs of Network Security Protocols.",
                    "Congestion Control in Linux TCP.",
                    "The Future Is Coming: Where the X Window System Should Go.",
                    "XCL: An Xlib Compatibility Layer for XCB.",
                    "Biglook: A Widget Library for the Scheme Programming Language.",
                    "An Implementation of Scheduler Activations on the NetBSD Operating System.",
                    "Authorization and Charging in Public WLANs Using FreeBSD and 802.1x.",
                    "ACPI Implementation on FreeBSD.",
                    "Gscope: A Visualization Tool for Time-Sensitive Software.",
                    "Inferring Scheduling Behavior with Hourglass.",
                    "A Decoupled Architecture for Application-Specific File Prefetching.",
                    "Design and Performance of the OpenBSD Stateful Packet Filter (pf).",
                    "Enhancing NFS Cross-Administrative Domain Access.",
                    "Ningaui: A Linux Cluster for Business.",
                    "CPCMS: A Configuration Management System Based on Cryptographic Names.",
                    "X Meets Z: Verifying Correctness in the Presence of POSIX Threads.",
                    "Planned Extensions to the Linux Ext2/Ext3 Filesystem.",
                    "Recent Filesystem Optimisations on FreeBSD.",
                    "Filesystem Performance and Scalability in Linux 2.4.17.",
                    "Speeding Up Kernel Scheduler by Reducing Cache Misses.",
                    "Overhauling Amd for the '00s: A Case Study of GNU Autotools.",
                    "Simple Memory Protection for Embedded Operating System Kernels."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "USENIX ATC 2001",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2001g",
                "sub_name": "Proceedings of the General Track: 2001 USENIX Annual Technical Conference, June 25-30, 2001, Boston, Massachusetts, USA.",
                "count": 24,
                "papers": [
                    "Virtualizing I/O Devices on VMware Workstation's Hosted Virtual Machine Monitor.",
                    "Magazines and Vmem: Extending the Slab Allocator to Many CPUs and Arbitrary Resources.",
                    "Measuring Thin-Client Performance Using Slow-Motion Benchmarking.",
                    "An Architecture for Secure Generation and Verification of Electronic Coupons.",
                    "Defective Sign & Encrypt in S/MIME, PKCS#7, MOSS, PEM, PGP, and XML.",
                    "Unifying File System Protection.",
                    "The Multi-Queue Replacement Algorithm for Second Level Buffer Caches.",
                    "Design and Implementation of a Predictive File Prefetching Algorithm.",
                    "Extending Heterogeneity to RAID Level 5.",
                    "Reverse-Engineering Instruction Encodings.",
                    "An Embedded Error Recovery and Debugging Mechanism for Scripting Language Extensions.",
                    "Interactive Simultaneous Editing of Multiple Text Regions.",
                    "High-Performance Memory-Based Web Servers: Kernel and User-Space Performance.",
                    "Kernel Mechanisms for Service Differentiation in Overloaded Web Servers.",
                    "Storage Management for Web Proxies.",
                    "Pragmatic Nonblocking Synchronization for Real-Time Systems.",
                    "Scalability of Linux Event-Dispatch Mechanisms.",
                    "Virtual-Time Round-Robin: An O(1) Proportional Share Scheduler.",
                    "A Toolkit for User-Level File Systems.",
                    "Charm: An I/O-Driven Execution Strategy for High-Performance Transaction Processing.",
                    "Fast Indexing: Support for Size-Changing Algorithms in Stackable File Systems.",
                    "Payload Caching: High-Speed Data Forwarding for Network Intermediaries.",
                    "A Waypoint Service Approach to Connect Heterogeneous Internet Address Spaces.",
                    "Flexible Control of Parallelism in a Multiprocessor PC Router."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2001f",
                "sub_name": "Proceedings of the FREENIX Track: 2001 USENIX Annual Technical Conference, June 25-30, 2001, Boston, Massachusetts, USA.",
                "count": 27,
                "papers": [
                    "LOMAC: MAC You Can Live With.",
                    "TrustedBSD: Adding Trusted Operating System Features to FreeBSD.",
                    "Integrating Flexible Support for Security Policies into the Linux Operating System.",
                    "A Practical Scripting Environment for Mobile Devices.",
                    "Nickle: Language Principles and Pragmatics.",
                    "The Design and Implementation of the NetBSD rc.d System.",
                    "User-Level Checkpointing for LinuxThreads Programs.",
                    "Building an Open-source Solaris-compatible Threads Library.",
                    "Are Mallocs Free of Fragmentation?",
                    "Sandboxing Applications.",
                    "Building a Secure Web Browser.",
                    "Citrus Project: True Multilingual Support for BSD Operating Systems.",
                    "Kqueue - A Generic and Scalable Event Notification Facility.",
                    "Improving the FreeBSD SMP Implementation.",
                    "Page Replacement in Linux 2.4 Memory Management.",
                    "User-Level Extensibility in the Mona File System.",
                    "Volume Managers in Linux.",
                    "The Design and Implementation of a Transparent Cryptographic File System for UNIX.",
                    "Design and Implementation of the X Rendering Extension.",
                    "Scwm: An Extensible Constraint-Enabled Window Manager.",
                    "The X Resize and Rotate Extension - RandR.",
                    "MEF: Malicious Email Filter - A UNIX Mail Filter That Detects Malicious Windows Executables.",
                    "Cost Effective Security for Small Businesses.",
                    "Heimdal and Windows 2000 Kerberos - How to Get Them to Play Together.",
                    "Predictable Management of System Resources for Linux.",
                    "Scalable Linux Scheduling.",
                    "A Universal Dynamic Trace for Linux and Other Operating Systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "USENIX ATC 2000",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/2000g",
                "sub_name": "Proceedings of the General Track: 2000 USENIX Annual Technical Conference, June 18-23, 2000, San Diego, CA, USA.",
                "count": 24,
                "papers": [
                    "Virtualizing I/O Devices on VMware Workstation's Hosted Virtual Machine Monitor.",
                    "Magazines and Vmem: Extending the Slab Allocator to Many CPUs and Arbitrary Resources.",
                    "Measuring Thin-Client Performance Using Slow-Motion Benchmarking.",
                    "An Architecture for Secure Generation and Verification of Electronic Coupons.",
                    "Defective Sign & Encrypt in S/MIME, PKCS#7, MOSS, PEM, PGP, and XML.",
                    "Unifying File System Protection.",
                    "The Multi-Queue Replacement Algorithm for Second Level Buffer Caches.",
                    "Design and Implementation of a Predictive File Prefetching Algorithm.",
                    "Extending Heterogeneity to RAID Level 5.",
                    "Reverse-Engineering Instruction Encodings.",
                    "An Embedded Error Recovery and Debugging Mechanism for Scripting Language Extensions.",
                    "Interactive Simultaneous Editing of Multiple Text Regions.",
                    "High-Performance Memory-Based Web Servers: Kernel and User-Space Performance.",
                    "Kernel Mechanisms for Service Differentiation in Overloaded Web Servers.",
                    "Storage Management for Web Proxies.",
                    "Pragmatic Nonblocking Synchronization for Real-Time Systems.",
                    "Scalability of Linux Event-Dispatch Mechanisms.",
                    "Virtual-Time Round-Robin: An O(1) Proportional Share Scheduler.",
                    "A Toolkit for User-Level File Systems.",
                    "Charm: An I/O-Driven Execution Strategy for High-Performance Transaction Processing.",
                    "Fast Indexing: Support for Size-Changing Algorithms in Stackable File Systems.",
                    "Payload Caching: High-Speed Data Forwarding for Network Intermediaries.",
                    "A Waypoint Service Approach to Connect Heterogeneous Internet Address Spaces.",
                    "Flexible Control of Parallelism in a Multiprocessor PC Router."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/2000f",
                "sub_name": "Proceedings of the Freenix Track: 2000 USENIX Annual Technical Conference, June 18-23, 2000, San Diego, CA, USA.",
                "count": 29,
                "papers": [
                    "Swarm: A Log-Structured Storage System for Linux.",
                    "DMFS-A Data Migration File System for NetBSD.",
                    "A 3-Tier RAID Storage System with RAID1, RAID5, and Compressed RAID5 for Linux.",
                    "Extending Internet Services via LDAP.",
                    "MOSIX: How Linux Clusters Solve Real-World Problems.",
                    "Webmin: A Web-Based System Administration Tool for UNIX.",
                    "Porting the SGI XFS File System to Linux.",
                    "LinLogFS - A Log-Structured File System for Linux.",
                    "UNIX File System Extensions in the GNOME Environment.",
                    "Protocol Independence Using the Sockets API.",
                    "Scalable Network I/O in Linux.",
                    "Accept() Scalability in Linux.",
                    "Permanent Web Publishing.",
                    "The Globe Distribution Network.",
                    "Open Information Pools.",
                    "The GNOME Canvas: A Generic Engine for Structured Graphics.",
                    "Efficiently Scheduling X Clients.",
                    "The AT&T AST OpenSource Software Collection.",
                    "Implementing Internet Key Exchange (IKE).",
                    "Transparent Network Security Policy Enforcement.",
                    "Safety Checking of Kernel Extensions.",
                    "An Operating System in Java for the Lego Mindstorms RCX Microcontroller.",
                    "LAP: A Little Language for OS Emulation.",
                    "Traffic Data Repository at the WIDE Project.",
                    "JEmacs-The Java/Scheme-based Emacs.",
                    "A New Rendering Model for X.",
                    "UBC: An Efficient Unified I/O and Memory Caching Subsystem for NetBSD.",
                    "Mbuf Issues in 4.4BSD IPv6 Support-Experiences from KAME IPv6/IPsec Implementation.",
                    "Malloc() Performance in a Multithreaded Linux Environment."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "USENIX ATC 1999",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/1999g",
                "sub_name": "Proceedings of the 1999 USENIX Annual Technical Conference, June 6-11, 1999, Monterey, California, USA.",
                "count": 23,
                "papers": [
                    "Implementing Lottery Scheduling: Matching the Specializations in Traditional Schedulers.",
                    "Retrofitting Quality of Service into a Time-Sharing Operating System.",
                    "Adaptive Modem Connection Lifetimes.",
                    "Operation-based Update Propagation in a Mobile File System.",
                    "Extending File Systems Using Stackable Templates.",
                    "Why does file system prefetching work?",
                    "The Region Trap Library: Handling Traps on Application-Defined Regions of Memory.",
                    "The Case for Compressed Caching in Virtual Memory Systems.",
                    "The UVM Virtual Memory System.",
                    "Lightweight Structured Text Processing.",
                    "SBOX: Put CGI Scripts in a Box.",
                    "The MultiSpace: An Evolutionary Platform for Infrastructural Services.",
                    "Web++: A System for Fast and Reliable Web Service.",
                    "Efficient Support for P-HTTP in Cluster-Based Web Servers.",
                    "Flash: An efficient and portable Web server.",
                    "NewsCache - A High-Performance Cache Implementation for Usenet News.",
                    "Reducing the Disk I/O of Web Proxy Server Caches.",
                    "An Implementation Study of a Detection-Based Adaptive Block Replacement Scheme.",
                    "A Scalable and Explicit Event Delivery Mechanism for UNIX.",
                    "The Pebble Component-Based Operating System.",
                    "Linking Programs in a Single Address Space.",
                    "The Design and Implementation of a DCD Device Driver for Unix.",
                    "An Application-Aware Data Storage Model."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1999f",
                "sub_name": "Proceedings of the FREENIX Track: 1999 USENIX Annual Technical Conference, June 6-11, 1999, Monterey, California, USA.",
                "count": 27,
                "papers": [
                    "Soft Updates: A Technique for Eliminating Most Synchronous Writes in the Fast Filesystem.",
                    "Design and Implementation of a Transaction-Based Filesystem on FreeBSD.",
                    "Standalone Device Drivers in Linux.",
                    "Design and Implementation of a Firewire Device Driver on FreeBSD.",
                    "Newconfig: a dynamic-configuration framework for FreeBSD.",
                    "The Vinum Volume Manager.",
                    "Porting the Coda File System to Windows.",
                    "A network file system over HTTP: remote access and modification of files and files.",
                    "A Future-Adaptable Password Scheme.",
                    "Cryptography in OpenBSD: An Overview.",
                    "Minding Your Own Business: The Platform for Privacy Preferences Project and Privacy Minder.",
                    "Trapeze/IP: TCP/IP at Near-Gigabit Speeds.",
                    "Managing Traffic with ALTQ.",
                    "Opening the Source Repository with Anonymous CVS.",
                    ", Open Software in a Commercial Operating System.",
                    "Business Issues in Free Software Licensing.",
                    "Sendmail Evolution: 8.10 and Beyond.",
                    "Meta: A Freely-Available Scalable MTA.",
                    "Porting Kernel Code to Four BSDs and Linux.",
                    "strlcpy and strlcat - Consistent, Safe, String Copy and Concatenation.",
                    "pk: A POSIX Threads Kernel.",
                    "Berkeley DB.",
                    "The FreeBSD Ports Collection.",
                    "Multilingual vi Clones: Past, Now and the Future.",
                    "Improving Application Performance Through Swap Compression.",
                    "New Tricks for an Old Terminal Driver.",
                    "The Design of the Dents DNS Server."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "USENIX ATC 1998",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/1998",
                "sub_name": "1998 USENIX Annual Technical Conference, New Orleans, Louisiana, USA, June 15-19, 1998.",
                "count": 36,
                "papers": [
                    "Implementing Multiple Protection Domains in Java.",
                    "The Safe-Tcl Security Model.",
                    "Kawa - Compiling Dynamic Languages to Java VM.",
                    "User API for Tape Drives.",
                    "Making Commodity PCs Fit for Signal Processing.",
                    "The Eclipse Operating System: Providing Quality of Service via Reservation Domains.",
                    "A Framework for Alternate Queueing: Towards Traffic Management by PC-UNIX Based Routers.",
                    "GNOME Desktop Project.",
                    "Console Server.",
                    "Linux Emulation for SCO.",
                    "Transformer Tunnels: A Framework for Providing Route Specific Adaptations.",
                    "The Design and Implementation of an IPv6/IPv4 Network Address and Protocol Translator.",
                    "Increasing Effective Link Bandwidth by Supressing Replicated Data.",
                    "malloc(3) Revisited.",
                    "ifmail - Fidonet.",
                    "Mhz: Anatomy of a Micro-benchmark.",
                    "Automatic Program Transformation with JOIE.",
                    "Deducing Similarities in Java Sources from Bytecodes.",
                    "Weblint: Just Another Perl Hack.",
                    "SimICS/Sun4m: A Virtual Workstation.",
                    "High-Performance Caching With The Lava Hit-Server.",
                    "Cheating the I/O Bottleneck: Network Storage with Trapeze/Myrinet.",
                    "Multimedia Driver Support.",
                    "Heimdal: I18N Free Kerberos Implementation.",
                    "Fast Consistency Checking for the Solaris File System.",
                    "General Purpose Operating System Support for Multiple Page Sizes.",
                    "Implementation of Multiple Pagesize Support in HP-UX.",
                    "Arla: Freely Available AFS Client.",
                    "SLIC: An Extensibility System for Commodity Operating Systems.",
                    "A Transactional Memory in an Extensible Operating System.",
                    "Dynamic C++ Classes - A Lightweight Mechanism to Update Code in a Running Program.",
                    "Dummynet and Forward Error Correction.",
                    "Scalable Kernel Performance for Internet Servers Under Realistic Loads.",
                    "Tribeca: A System for Managing Large Databases of Network Traffic.",
                    "Transparent Result Caching.",
                    "A Machine-Independent DMA Framework for Net BSD."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "USENIX ATC 1997",
        "info": "Anaheim, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/1997",
                "sub_name": "USENIX 1997 Annual Technical Conference, January 6-10, 1997, Anaheim, California, USA Conference Proceedings.",
                "count": 1,
                "papers": [
                    "Embedded Inodes and Explicit Grouping: Exploiting Disk Bandwidth for Small Files."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "USENIX ATC 1996",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/1996",
                "sub_name": "Proceedings of the USENIX Annual Technical Conference, San Diego, California, USA, January 22-26, 1996.",
                "count": 28,
                "papers": [
                    "Scalability in the XFS File System.",
                    "A Comparison of FFS Disk Allocation Policies.",
                    "AFRAID - A Frequently Redundant Array of Independent Disks.",
                    "A Comparison of OS Extension Technologies.",
                    "An Extensible Protocol Architecture for Application-Specific Networking.",
                    "Linux Device Driver Emulation in Mach.",
                    "Calliope: A Distributed, Scalable Multimedia Server.",
                    "Simple Continuous Media Storage Server on Real-Time Mach.",
                    "Eliminating Receive Livelock in an Interrupt-driven Kernel.",
                    "Implementation of IPv6 in 4.4 BSD.",
                    "Supporting Mobility in MosquitoNet.",
                    "World Wide Web Cache Consistency.",
                    "A Hierarchical Internet Object Cache.",
                    "Tracking and Viewing Changes on the Web.",
                    "Implementation of a Reliable Remote Memory Pager.",
                    "Solaris MC: A Multi Computer OS.",
                    "A New Approach to Distributed Memory Management in the Mach Microkernel.",
                    "Fault Tolerance in a Distributed CHORUS/MiX System.",
                    "FLIPC: A Low Latency Messaging System for Distributed Real Time Environments.",
                    "An Analysis of Process and Memory Models to Support High-Speed Networking in a UNIX Environment.",
                    "Zero-Copy TCP in Solaris.",
                    "A Performance Comparison of UNIX Operating Systems on the Pentium.",
                    "lmbench: Portable Tools for Performance Analysis.",
                    "Process Labeled Kernel Profiling: A New Facility to Profile System Activities.",
                    "Cut-and-Paste File-Systems: Integrating Simulators and File-Systems.",
                    "Predicting Future File-System Actions From Prior Events.",
                    "Transparent Fault Tolerance for Parallel Applications on Networks of Workstations.",
                    "Why Use a Fishing Line When you Have a Net? An Adaptive Multicast Data Distribution Protocol."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "USENIX TC 1995",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/usenix/1995",
                "sub_name": "USENIX 1995 Technical Conference on UNIX and Advanced Computing Systems, New Orleans, Louisiana, USA, January 16-20, 1995, Conference Proceedings.",
                "count": 27,
                "papers": [
                    "Portals in 4.4BSD.",
                    "Dynamic Vnodes - Design and Implementation.",
                    "Union Mounts in 4.4BSD-Lite.",
                    "Evaluation of Design Alternatives for a Cluster File System.",
                    "Multi-Resident AFS: An Adventure in Mass Storage.",
                    "RAMA: Easy Access to a High-Bandwidth Massively Parallel File System.",
                    "Implementing Real Time Packet Forwarding Policies Using Streams.",
                    "Scaling the Web of Trust: Combining Kerberos and PGP to Provide Large Scale Authentication.",
                    "Flexible and Safe Resolution of File Conflicts.",
                    "OODCE: A C++ Framework for the OSF Distributed Computing Environment.",
                    "Mach-US: Unix On Generic OS Object Servers.",
                    "Events in an RPC Based Distributed System.",
                    "Turning the AIX Operating System into an MP-capable OS.",
                    "A Flash-Memory Based File System.",
                    "TRON: Process-Specific File Protection for the UNIX Operating System.",
                    "SIFT - a Tool for Wide-Area Information Dissemination.",
                    "Performance Implications of Multiple Pointer Sizes.",
                    "Idleness is Not Sloth.",
                    "Libckpt: Transparent Checkpointing under UNIX.",
                    "Optimizing the Performance of Dynamically-Linked Programs.",
                    "DP: A Library for Building Portable, Reliable Distributed Applications.",
                    "File System Logging versus Clustering: A Performance Comparison.",
                    "Metadata Logging in an NFS Server.",
                    "Heuristic Cleaning Algorithms in Log-Structured File Systems.",
                    "The New Jersey Machine-Code Toolkit.",
                    "ATOM: A Flexible Interface for Building High Performance Program Analysis Tools.",
                    "Adaptable Binary Programs."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1994su",
                "sub_name": "USENIX Summer 1994 Technical Conference, Boston, Massachusetts, USA, June 6-10, 1994, Conference Proceeding.",
                "count": 26,
                "papers": [
                    "A New Object-Oriented Programming Language: sh.",
                    "The Old Man and the C.",
                    "Key Management in an Encrypting File System.",
                    "A Toolkit and Methods for Internet Firewalls.",
                    "SNP: An Interface for Secure Network Programming.",
                    "An Efficient Kernel-Based Implementation of POSIX Threads.",
                    "Using OS Locking Services to Implement a DBMS: An Experience Report.",
                    "The Slab Allocator: An Object-Caching Kernel Memory Allocator.",
                    "A Better Update Policy.",
                    "The Desktop File System.",
                    "Sawmill: A High-Bandwidth Logging File System.",
                    "NFS Version 3: Design and Implementation.",
                    "Clue Tables: A Distributed, Dynamic-Binding Naming Mechanism.",
                    "Optimistic Lookup of Whole NFS Paths in a Single Operation.",
                    "Application-Controlled File Caching Policies.",
                    "Resolving File Conflicts in the Ficus File System.",
                    "Reducing File System Latency using a Predictive Approach.",
                    "Operating System Support for Distributed Multimedia.",
                    "Splicing UNIX into a Genome Mapping Laboratory.",
                    "A Text Retrieval Package for the Unix Operating System.",
                    "Probing TCP Implementations.",
                    "Experiences with a Survey Tool for Discovering Network Time Protocol Servers.",
                    "Profiling and Tracing Dynamic Library Usage Via Interposition.",
                    "Large Granularity Cache Coherence for Intermittent Connectivity.",
                    "An Analysis of Trace Data for Predictive File Caching in Mobile Computing.",
                    "Secure Short-Cut Routing for Mobile IP."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1994wi",
                "sub_name": "USENIX Winter 1994 Technical Conference, San Francisco, California, USA, January 17-21, 1994, Conference Proceedings.",
                "count": 27,
                "papers": [
                    "Finding Similar Files in a Large File System.",
                    "cql - A Flat File Database Query Language.",
                    "GLIMPSE: A Tool to Search Through Entire File Systems.",
                    "Drinking from the Firehose: Multicast USENET News.",
                    "The refdbms Distributed Bibliographic Database System.",
                    "Filesystem Daemons as Unifying Mechanism for Network Information Access.",
                    "Concert/C: A Language for Distributed Programming.",
                    "Evolving Mach 3.0 to A Migrating Thread Model.",
                    "TreadMarks: Distributed Shared Memory on Standard Workstations and Operating Systems.",
                    "Workstation Support for Real-Time Multimedia Communication.",
                    "Experience and Results from Implementation of an ATM Socket Family.",
                    "Efficient Packet Demultiplexing for Multiple Endpoints and Large Messages.",
                    "Latency Analysis of TCP on an ATM Network.",
                    "Improving UNIX Kernel and Networking Performance Using Profile Based Optimization.",
                    "Memory Behavior for an X11 Window System.",
                    "A Uniform Name Service for Spring's UNIX Environment.",
                    "ACID: A Debugger Built From A Language.",
                    "Acme: A User Interface for Programmers.",
                    "File System Design for an NFS File Server Appliance.",
                    "Improving the Write Performance of an NFS Server.",
                    "Not Quite NFS, Soft Cache Consistency for NFS.",
                    "A Quantitative Analysis of Disk Drive Power Management in Portable Computers.",
                    "Thwarting the Power-Hungry Disk.",
                    "A Usage Profile and Evaluation of a Wide-Area Distributed File System.",
                    "Wux: UNIX Tools under Windows.",
                    "An MS-DOS Filesystem for UNIX.",
                    "An Overview of the NetWare Operating System."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1993su",
                "sub_name": "Proceedings of the Summer 1993 USENIX Conference, Cincinnati, OH, USA, June 21-25, 1993.",
                "count": 22,
                "papers": [
                    "Call Path Profiling of Monotonic Program Resources in UNIX.",
                    "Computer System Performance Problem Detection Using Time Series Model.",
                    "Design and Implementation of a Simulation Library Using Lightweight Processes.",
                    "The Restore-o-Mounter: The File Motel Revisited.",
                    "The Autofs Automounter.",
                    "Discovery and Hot Replacement of Replicated Read-Only File Systems, with Application to Mobile Computing.",
                    "X Through the Firewall, and Other Application Relay.",
                    "The Ferret Document Browser.",
                    "LADDIS: The Next Generation in NFS File Server Benchmarking.",
                    "Design and Implementation of a Multimedia Protocol Suite in a BSD UNIX Kernel.",
                    "The Spring Nucleus: A Microkemel for Objects.",
                    "\"Stacking/\" Vnodes: A Progress Report.",
                    "Anonymous RPC: Low-Latency Protection in a 64-Bit Address Space.",
                    "Integrating Handwriting Recognition into UNIX.",
                    "Optimizing UNIX Resource Scheduling for User Interaction.",
                    "AudioFile: A Network-Transparent System for Distributed Audio Applications.",
                    "Fast and Flexible Shared Libraries.",
                    "High Performance Dynamic Linking Through Caching.",
                    "The Shell as a Service.",
                    "A User-Level Replicated File System.",
                    "it/sfs: A Parallel File System for the CM-5.",
                    "Adaptive Block Rearrangement Under UNIX."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1993wi",
                "sub_name": "Proceedings of the Usenix Winter 1993 Technical Conference, San Diego, California, USA, January 1993.",
                "count": 45,
                "papers": [
                    "Dictionary and Graph Libraries.",
                    "Linking Shared Segments.",
                    "A Library Implementation of POSIX Threads under UNIX.",
                    "Hello World.",
                    "Es: A shell with higher-order functions.",
                    "Jgraph - A Filter for Plotting Graphs in PostScript.",
                    "Faster AFS.",
                    "The AutoCacher: A File Cache Which Operates at the NFS Level.",
                    "Pitfalls in Multithreading SVR4 STREAMS and Other Weightless Processes.",
                    "WARLOCK - A Static Data Race Analysis Tool.",
                    "DUEL - A Very High-Level Debugging Language.",
                    "The San Diego \"Zoo\": A multicomputer stress test suite.",
                    "PhoneStation, Moving the Telephone onto the Virtual Desktop.",
                    "Glish: A User-Level Software Bus for Loosely-Coupled Distributed Systems.",
                    "UNIX Services for Multilevel Storage and Communications Over a Secure LAN.",
                    "A Sketch Of The Smart Frame Buffer.",
                    "Wafe - An X Toolkit Based Frontend for Application Programs in Various Programming Languages.",
                    "Design and Implementation of a Multi-Threaded Xlib.",
                    "The Design and Implementation of the Inversion File System.",
                    "Operating System Support for Portable Filesystem Extensions.",
                    "File Systems in User Space.",
                    "UNIX Kernel Support for OLTP Performance.",
                    "Measurement, Analysis, and Improvement of UDP/IP Throughput for the DECstation 5000.",
                    "The BSD Packet Filter: A New Architecture for User-level Packet Capture.",
                    "The Organization of Networks in Plan 9.",
                    "Removable Media in Solaris.",
                    "An Advanced Tape Cataloging System for UNIX Systems.",
                    "Efficient Kernel Memory Allocation on Shared-Memory Multiprocessors.",
                    "An Implementation of a Log-Structured File System for UNIX.",
                    "Exploiting In-Kernel Data Paths to Improve I/O Throughput and CPU Availability.",
                    "Fremont: A System for Discovering Network Characteristics and Problems.",
                    "The Enterprise Distributed White-pages Service.",
                    "Essence: A Resource Discovery System Based on Semantic File Indexing.",
                    "Hardware Profiling of Kernels.",
                    "A Randomized Sampling Clock for CPU Utilization Estimation and Code Profiling.",
                    "Fault Interpretation: Fine-Grain Monitoring of Page Accesses.",
                    "UNIX Disk Access Patterns.",
                    "An Analysis of File Migration in a UNIX Supercomputing Environment.",
                    "HighLight: Using a Log-structured File System for Tertiary Storage Management.",
                    "An OSF/1 UNIX for Massively Parallel Multicomputers.",
                    "An Implementation of UNIX on an Object-oriented Operating System.",
                    "The Nachos Instructional Operating System.",
                    "The Design and Implementation of a Mobile Internetworking Architecture.",
                    "Mobile Computing Environment Based on Internet Packet Forwarding.",
                    "The Compression Cache: Using On-line Compression to Extend Physical Memory."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1992su",
                "sub_name": "USENIX Summer 1992 Technical Conference, San Antonio, TX, USA, June 8-12, 1992.",
                "count": 36,
                "papers": [
                    "Introduction to the Shadow Password Suite.",
                    "Giving Customers the Tools to Protect Themselves.",
                    "Performance of a Parallel Network Backup Manager.",
                    "The DIDS (Distributed Intrusion Detection System) Prototype.",
                    "A Privilege Mechanism for UNIX System V Release 4 Operating Systems.",
                    "#ifdef Considered Harmful, or Portability Experience with C News.",
                    "Incl: A Tool to Analyze Include Files.",
                    "Large Scale Porting through Parameterization.",
                    "The Continuous Media File System.",
                    "Mainframe Services from Gigabit-Networked Workstations.",
                    "A Highly Available Lock Manager for HA-NFS.",
                    "A Discipline of Error Handling.",
                    "Regression Testing and Conformance Testing Interactive Programs.",
                    "NeD: The Network Extensible Debugger.",
                    "Tiled Virtual Memory for UNIX.",
                    "A Scalable Implementation of Virtual Memory HAT Layer for Shared Memory Multiprocessor Machines.",
                    "Virtual Window Systems: A New Approach to Supporting Concurrent Heterogeneous Windowing Systems.",
                    "TDBM: A DBM Library with Atomic Transactions.",
                    "VNS Retriever: Querying MEDLINE over the Internet.",
                    "InterNetNews: Usenet Transport for Internet Sites.",
                    "The Recovery Box: Using Fast Recovery to Provide High Availability in the UNIX Environment.",
                    "On Migrating a Distributed Application to a Multi-Threaded Environment.",
                    "Cheap Mutual Exclusion.",
                    "Implementing Lightweight Threads.",
                    "Beyond Multiprocessing: Multithreading the SunOS Kernel.",
                    "File System Multithreading in System V Release 4 MP.",
                    "Covers and Frontmatter.",
                    "There Be Dragons.",
                    "The Greatest Cracker-Case in Denmark: The Detecting, Tracing, and Arresting of Two International Crackers.",
                    "Experiences of Internet Security in Italy.",
                    "An Internet Gatekeeper.",
                    "Network (In)Security Through IP Packet Filtering.",
                    "SOCKS.",
                    "TCP Wrapper: Network Monitoring, Access Control, and Booby Traps.",
                    "Centralized System Monitoring with Swatch.",
                    "Security Aspects of a UNIX PEM Implementation."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1991su",
                "sub_name": "Proceedings of the Summer 1991 USENIX Conference, Nashville, TE, USA, June 1991.",
                "count": 37,
                "papers": [
                    "Musical Dreams and Musical Reality.",
                    "Long-Term Caching Strategies for Very Large Distributed File Systems.",
                    "Management of Replicated Volume Location Data in the Ficus Replicated File System.",
                    "Exploiting Multiple I/O Streams to Provide High Data-Rates.",
                    "An Open and Extensible Event-Based Transaction Manager.",
                    "Emerging Hypermedia Standards - Hypermedia Marketplace Frepares for HyTime and MHEG.",
                    "Multimedia Presentation System Harmony with Temporal and Active Media.",
                    "Spacio-Temporal Editing for HDTV Program Production.",
                    "DIDDLY: Digital's Integrated Distributed Database LaboratorY.",
                    "Neural Orchestration: From Cortical Simulation to Cortical Symphony.",
                    "MediaView: An Editable Multimedia Publishing System Developed with an Object-Oriented Toolkit.",
                    "A Structure for Transportable, Dynamic Multimedia Documents.",
                    "Parsing Movies in Context.",
                    "Distributed Multimedia: How Can the Necessary Data Rates be Supported?",
                    "Multimedia/Realtime Extensions for the Mach Operating System.",
                    "A Testbed for Managing Digital Video and Audio Storage.",
                    "The Architecture of the IRCAM Musical Workstation.",
                    "Fast String Searching.",
                    "SFIO: Safe/Fast String/File IO.",
                    "8-1/2, the Plan 9 Window System.",
                    "A Minimalist Global User Interface.",
                    "Integrating Gesture Recognition and Direct Manipulation.",
                    "Activity Server: You can run but you can't hide.",
                    "Software Technology at NeXT Computer.",
                    "Plastic Editors for Multimedia Documents.",
                    "MAEstro - A Distributed Multimedia Authoring Environment.",
                    "Newspace: Mass Media and Personal Computing.",
                    "The MIT Media Laboratory.",
                    "Integrating Real-Time Video with Sun Workstations.",
                    "Design Considerations for JPEG Video and Synchronized Audio in a UNIX Workstation Environment.",
                    "Shared Video under UNIX.",
                    "Compressed Executables: An Exercise in Thinking Small.",
                    "Experiences with Audio Conferencing Using the X Window System, UNIX, and TCP/IP.",
                    "Integrating Audio and Telephony in a Distributed Workstation Environment.",
                    "A Brief Overview of the DCS Distributed Conferencing System.",
                    "Software and Intellectual Property - Who Owns Your Work?",
                    "A Workstation-based Multi-media Environment for Broadcast Television."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1991wi",
                "sub_name": "Proceedings of the Usenix Winter 1991 Conference, Dallas, TX, USA, January 1991.",
                "count": 31,
                "papers": [
                    "Processors, Priority, and Policy: Mach Scheduling for New Environments.",
                    "A Second-Generation Micro-Kernel Based UNIX: Lessons in Performance and Compatibility.",
                    "Partitioned Multiprocessors and The Coexistence of Heterogeneous Operating Systems.",
                    "Extent-like Performance from a UNIX File System.",
                    "Smart Filesystems.",
                    "Lessons Learned Tuning the 4.3BSD Reno Implementation of the NFS Protocol.",
                    "SunOS Multi-thread Architecture.",
                    "Bringing the C Libraries With Us into a Multi-Threaded Future.",
                    "A Tree-Based Packet Routing Table for Berkeley Unix.",
                    "An X11 Toolkit Based on the Tcl Language.",
                    "User Interface Construction Based On Parallel and Sequential Execution Specification.",
                    "\\HOME MOVIE - Tools for Building Demos on a Sparcstation.",
                    "Awk As A Major Systems Programming Language.",
                    "Program Loading in OSF/1.",
                    "Compiling from Saved State: Fast Incremental Compilation with Traditional UNIX Compilers.",
                    "A New Hashing Package for UNIX.",
                    "Evolutionary Path to Network Storage Management.",
                    "A Highly Available Network File Server.",
                    "The OSF/1 UNIX Filesystem (UFS).",
                    "Advancing Files to Attributed Software Objects.",
                    "Organizing Tools in a Uniform Environment Framework.",
                    "The Process File System and Process Model in UNIX System V.",
                    "Limitations of the Kerberos Authentication System.",
                    "UNIX Password Encryption Considered Insecure.",
                    "An Authentication Mechanism for USENET.",
                    "An Experimental Implementation of Draft POSIX Asynchronous I/O.",
                    "The Parallelization of UNIX System V Release 4.0.",
                    "A NonStop UNIX OPerating System.",
                    "DRUMS: A Distributed Statistical Server for STARS.",
                    "Experience Building a Process Migration Subsystem for UNIX.",
                    "A Modular Architecture for Distributed Transaction processing."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1990su",
                "sub_name": "Proceedings of the Usenix Summer 1990 Technical Conference, Anaheim, California, USA, June 1990.",
                "count": 34,
                "papers": [
                    "ELF: An Object File to Mitigate Mischievous Misoneism.",
                    "Issues in Shared Libraries Design.",
                    "Shared Libraries as Objects.",
                    "A Portable Run-time System for the Hermes Distributed Programming Language.",
                    "Deceit: A Flexible Distributed File System.",
                    "Implementation of the Ficus Replicated File System.",
                    "Binary Emulation of UNIX Using the V Kernel.",
                    "UNIX as an Application Program.",
                    "An Implementation of Real-Time Thread Synchronization.",
                    "Evolving the Vnode interface.",
                    "A Transparent Integration Approach for Rewritable Optical Autochangers.",
                    "A New Design for Distributed Systems: The Remote Memory Model.",
                    "A Pageable Memory Based Filesystem.",
                    "A Fast /tmp File System by Delay Mount Option.",
                    "DEcorum File System Architectural Overview.",
                    "The COPS Security Checker System.",
                    "The Evolution of turnin: A Classroom Oriented File Exchange Service.",
                    "expect: Curing Those Uncontrollable Fits of Interaction.",
                    "IAW - The Intelligence Analyst Workbench.",
                    "Evolution of the Ucode Compiler Intermediate Language.",
                    "The Evolution of Dbx.",
                    "Dalek: A GNU, Improved Programmable Debugger.",
                    "The Design of a Secure Internet Gateway.",
                    "Putting UNIX on Very Fast Computers or What the Speed of Light Means to Your Favorite System Call.",
                    "Why Aren't Operating Systems Getting Faster As Fast as Hardware?",
                    "The Big Picture: Visualizing System Behavior in Real Time.",
                    "Perspectives on NES File Server Performance Characterization.",
                    "Performance Measurements of a Multiprocessor Sprite Kernel.",
                    "Montage: Breaking Windows into Small Pieces.",
                    "swm: An X Window Manager Shell.",
                    "A High-Level User Interface Toolkit for the X Window System and Character Terminals.",
                    "The LFS Storage Manager.",
                    "Efficient User-Level File Cache Management on the Sun Vnode Interface.",
                    "A Filesystem for Software Development."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1988wi",
                "sub_name": "Proceedings of the USENIX Winter Conference. Dallas, Texas, USA, January 1988.",
                "count": 46,
                "papers": [
                    "\"Make or Take\" Decisions in Andrew.",
                    "The Andrew Toolkit - An Overview.",
                    "On Overview of the Andrew File System.",
                    "Synchronization and Caching Issues in the Andrew File System.",
                    "A Multi-media Message System for Andrew.",
                    "An RPC/LWP System for Interconnecting Heterogeneous Systems.",
                    "UNIX Systems as Cypress Implets.",
                    "Special Purpose User-Space Network Protocols.",
                    "Nest: A Network Simulation and Prototyping Tool.",
                    "A Fast Transaction Oriented Protocol for Distributed Applications.",
                    "A UNIX Implementation of HEMS.",
                    "Building an Equities Trading System in a Distributed UNIX Environment.",
                    "Comparing the Efficiency of the Internet Protocols to DECNET.",
                    "PMON: Graphical Performance Monitoring Tool.",
                    "System Administration in a Heterogeneous Network.",
                    "A Faster UNIX Dump Program.",
                    "Automatic Unix Backup in a Mass-Storage Environment.",
                    "System Administration Daemons.",
                    "The Postman Always Rings Twice: Electronic Mail in a Highly Distributed Environment.",
                    "A User Account Registration System for a Large (Heterogeneous) UNIX Network.",
                    "Project Accounting on UNICOS.",
                    "Using Groups Effectively in Berkeley Unix.",
                    "Berkeley UNIX on 1000 Workstations: Athena Changes to 4.3BSD.",
                    "The Hesiod Name Server.",
                    "Kerberos: An Authentication Service for Open Network Systems.",
                    "The Athena Service Management System.",
                    "The Zephyr Notification Service.",
                    "The X Toolkit: More Bricks for Building User-Interfaces or Widgets for Hire.",
                    "A Simple X11 Client Program -or- How hard can it really be to write \"Hello, World\"?",
                    "The Counterpoint Fast File System.",
                    "UNIX I/O in a Multiprocessor System.",
                    "Beyond Threads: Resource Sharing in UNIX.",
                    "Watchdogs: Extending the UNIX File System.",
                    "Invoking System Calls from Within the UNIX Kernel.",
                    "An Experimental Symmetric Multiprocessor Ultrix Kernel.",
                    "A New Exception Handling Mechanism for the UNIX Kernel.",
                    "Translation Lookaside Buffer Synchronization in a Multiprocessor System.",
                    "Adding Packet Radio to the Ultrix Kernel.",
                    "Man-Machine Interfaces for Software Development Environments (HandS).",
                    "A Memory Allocator with Garbage Collection for C.",
                    "Rescuing Data in UNIX File Systems (What to do after rm *).",
                    "How to Steal Code -or- Inventing The Wheel Only Once.",
                    "The Integration Toolkit and the Unison Real Time Operating System.",
                    "Process Migration in UNIX Networks.",
                    "A Process Migration Implementation for a Unix System.",
                    "Process Cloning: A System for Duplicating UNIX Processes."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1987su",
                "sub_name": "Proceedings of the USENIX Summer Conference. Phoenix, AR, USA, June 1987.",
                "count": 6,
                "papers": [
                    "The Diamond Multimedia Editor.",
                    "An Interactive WYSIWYG Table Editor.",
                    "PSFIG - A DITROFF Preprocessor for Postscript Figures.",
                    "An Environment for SGML Document Preparation.",
                    "A UNIX Interface for Shared Memory and Memory Mapped Files Under Mach.",
                    "A Replacement for Berkeley Memory Management."
                ]
            },
            {
                "sub_name_abbr": "conf/usenix/1986su",
                "sub_name": "Proceedings of the USENIX Summer Conference, Altanta, GA, USA, June 1986.",
                "count": 20,
                "papers": [
                    "MIDI Music Software for UNIX.",
                    "201 644-2332 or Eedie & Eddie on the Wire: An Experiment in Music Generation.",
                    "Secure Networking in the Sun Environment.",
                    "A Framework for Networking in System V.",
                    "OSI and TCP/IP Protocols on a UNIX System V.",
                    "A Multiuser Multiprocessor Benchmark to Compare UNIX Systems.",
                    "A System Call Tracer for UNIX.",
                    "A New Virtual Memory Implementation for UNIX.",
                    "Mach: A New Kernel Foundation for UNIX Development.",
                    "An Extensible I/O System.",
                    "PATHALIAS or The Care and Feeding of Relative Addresses.",
                    "Pollster: A Document Annotation System for Distributed Environments.",
                    "When Network File Systems Aren't Enough: Automatic Software Distribution Revisited.",
                    "Experiences Implementing BIND, a Distributed Name Server for the DARPA Internet.",
                    "Network Performance and Management with 4.3BSD and IP/TCP.",
                    "A Real-Time Electronic Conferencing System based on Distributed UNIX.",
                    "How to Make Friends with Number-Crunchers.",
                    "Kanji UNIX: Yunikkusu wa Nihongo o Hanasemasu (UNIX Speaks Japanese).",
                    "Tools for the Maintenance and Installation of a large Software Distribution.",
                    "Vnodes: An Architecture for Multiple File System Types in Sun UNIX."
                ]
            }
        ]
    },
    {
        "year": "1994s",
        "name": "USENIX Summer 1994",
        "info": "Boston, Massachusetts, USA",
        "venues": []
    },
    {
        "year": "1994w",
        "name": "USENIX Winter 1994",
        "info": "San Francisco, California, USA",
        "venues": []
    },
    {
        "year": "1993s",
        "name": "USENIX Summer 1993",
        "info": "Cincinnati, OH, USA",
        "venues": []
    },
    {
        "year": "1993w",
        "name": "USENIX Winter 1993",
        "info": "San Diego, California, USA",
        "venues": []
    },
    {
        "year": "1992s",
        "name": "USENIX Summer 1992",
        "info": "San Antonio, TX, USA",
        "venues": []
    },
    {
        "year": "1992w",
        "name": "USENIX Winter 1992",
        "info": "San Francisco, CA, USA",
        "venues": []
    },
    {
        "year": "1991s",
        "name": "USENIX Summer 1991",
        "info": "Nashville, TN, USA",
        "venues": []
    },
    {
        "year": "1991w",
        "name": "USENIX Winter 1991",
        "info": "Dallas, Texas, USA",
        "venues": []
    },
    {
        "year": "1990s",
        "name": "USENIX Summer 1990",
        "info": "Anaheim, California, USA",
        "venues": []
    },
    {
        "year": "1990w",
        "name": "USENIX Winter 1990",
        "info": "Washington, D.C., USA",
        "venues": []
    },
    {
        "year": "1989s",
        "name": "USENIX Summer 1989",
        "info": "Baltimore, Maryland, USA",
        "venues": []
    },
    {
        "year": "1989w",
        "name": "USENIX Winter 1989",
        "info": "San Diego, CA, USA",
        "venues": []
    },
    {
        "year": "1988s",
        "name": "USENIX Summer 1988",
        "info": "San Francisco, CA, USA",
        "venues": []
    },
    {
        "year": "1988w",
        "name": "USENIX Winter 1988",
        "info": "Dallas, Texas, USA",
        "venues": []
    },
    {
        "year": "1987s",
        "name": "USENIX Summer 1987",
        "info": "Phoenix, AR, USA",
        "venues": []
    },
    {
        "year": "1987w",
        "name": "USENIX Winter 1987",
        "info": "Washington, D.C., USA",
        "venues": []
    },
    {
        "year": "1986s",
        "name": "USENIX Summer 1986",
        "info": "Atlanta, GA, USA",
        "venues": []
    },
    {
        "year": "1986w",
        "name": "USENIX Winter 1986",
        "info": "Denver, CO, USA",
        "venues": []
    },
    {
        "year": "1985s",
        "name": "USENIX Summer 1985",
        "info": "Portland, OR, USA",
        "venues": []
    },
    {
        "year": "1985w",
        "name": "USENIX Winter 1985",
        "info": "Dallas, TX, USA",
        "venues": []
    },
    {
        "year": "1984s",
        "name": "USENIX Summer 1984",
        "info": "Salt Lake City, Utah, USA",
        "venues": []
    },
    {
        "year": "1984w",
        "name": "USENIX Winter 1984",
        "info": "Washington, D.C., USA",
        "venues": []
    },
    {
        "year": "1983s",
        "name": "USENIX Summer 1983",
        "info": "Toronto, Canada",
        "venues": []
    },
    {
        "year": "1983w",
        "name": "USENIX Winter 1983",
        "info": "San Diego, CA, USA",
        "venues": []
    }
]