[
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 85,
        "papers": [
            "Table of Contents: Online Supplement Volume 17, Number 1s.",
            "Multi-task Learning-based All-in-one Collaboration Framework for Degraded Image Super-resolution.",
            "Cumulative Quality Modeling for HTTP Adaptive Streaming.",
            "Socializing the Videos: A Multimodal Approach for Social Relation Recognition.",
            "Robust Secret Image Sharing Resistant to Noise in Shares.",
            "ART-UP: A Novel Method for Generating Scanning-Robust Aesthetic QR Codes.",
            "Compressed Imaging Reconstruction with Sparse Random Projection.",
            "GreyReID: A Novel Two-stream Deep Framework with RGB-grey Information for Person Re-identification.",
            "Bi-manual Haptic-based Periodontal Simulation with Finger Support and Vibrotactile Feedback.",
            "Multi-human Parsing with a Graph-based Generative Adversarial Model.",
            "Improved Jitter Buffer Management for WebRTC.",
            "Automated Orchestration of Online Educational Collaboration in Cloud-based Environments.",
            "Bottom-up and Layerwise Domain Adaptation for Pedestrian Detection in Thermal Images.",
            "Market2Dish: Health-aware Food Recommendation.",
            "Affinity Derivation for Accurate Instance Segmentation.",
            "Conditional LSTM-GAN for Melody Generation from Lyrics.",
            "Attribute-wise Explainable Fashion Compatibility Modeling.",
            "A Semi-supervised Learning Approach Based on Adaptive Weighted Fusion for Automatic Image Annotation.",
            "360-Degree VR Video Watermarking Based on Spherical Wavelet Transform.",
            "SDN Enabled QoE and Security Framework for Multimedia Applications in 5G Networks.",
            "Entropy Slicing Extraction and Transfer Learning Classification for Early Diagnosis of Alzheimer Diseases with sMRI.",
            "TripRes: Traffic Flow Prediction Driven Resource Reservation for Multimedia IoV with Edge Computing.",
            "A Fast Defogging Image Recognition Algorithm Based on Bilateral Hybrid Filtering.",
            "An Image Privacy Protection Algorithm Based on Adversarial Perturbation Generative Networks.",
            "Fast Accurate and Automatic Brushstroke Extraction.",
            "Assessment of Machine Learning-Based Audiovisual Quality Predictors: Why Uncertainty Matters.",
            "Exploring Uncertainty Measures for Image-caption Embedding-and-retrieval Task.",
            "Interactive Search vs. Automatic Search: An Extensive Study on Video Retrieval.",
            "3D Tensor Auto-encoder with Application to Video Compression.",
            "Multi-Tier CloudVR: Leveraging Edge Computing in Remote Rendered Virtual Reality.",
            "An Augmented Reality Online Assistance Platform for Repair Tasks.",
            "Server Allocation for Massively Multiplayer Online Cloud Games Using Evolutionary Optimization.",
            "Integrating Scene Semantic Knowledge into Image Captioning.",
            "Visual Semantic-Based Representation Learning Using Deep CNNs for Scene Recognition.",
            "On the Performance Comparisons of Native and Clientless Real-Time Screen-Sharing Technologies.",
            "Automatic Comic Generation with Stylistic Multi-page Layouts and Emotion-driven Text Balloon Generation.",
            "High-quality Frame Recurrent Video De-raining with Multi-contextual Adversarial Network.",
            "Spatial-temporal Regularized Multi-modality Correlation Filters for Tracking with Re-detection.",
            "Neural-Network-Based Cross-Channel Intra Prediction.",
            "MFECN: Multi-level Feature Enhanced Cumulative Network for Scene Text Detection.",
            "Secure Chaff-less Fuzzy Vault for Face Identification Systems.",
            "Global-Local Enhancement Network for NMF-Aware Sign Language Recognition.",
            "Residual Refinement Network with Attribute Guidance for Precise Saliency Detection.",
            "IRTS: An Intelligent and Reliable Transmission Scheme for Screen Updates Delivery in DaaS.",
            "Semantic Correspondence with Geometric Structure Analysis.",
            "Single-shot Semantic Matching Network for Moment Localization in Videos.",
            "Payoff-based Dynamic Segment Replication and Graph Classification Method with Attribute Vectors Adapted to Urban VANET.",
            "Part-wise Spatio-temporal Attention Driven CNN-based 3D Human Action Recognition.",
            "PGNet: Progressive Feature Guide Learning Network for Three-dimensional Shape Recognition.",
            "Video Decolorization Based on the CNN and LSTM Neural Network.",
            "A Densely Connected Network Based on U-Net for Medical Image Segmentation.",
            "Label Consistent Flexible Matrix Factorization Hashing for Efficient Cross-modal Retrieval.",
            "Is the Reign of Interactive Search Eternal? Findings from the Video Browser Showdown 2020.",
            "Lifelog Image Retrieval Based on Semantic Relevance Mapping.",
            "A Real-Time Effective Fusion-Based Image Defogging Architecture on FPGA.",
            "Full-reference Screen Content Image Quality Assessment by Fusing Multilevel Structure Similarity.",
            "Deep-based Self-refined Face-top Coordination.",
            "Distribution Aligned Multimodal and Multi-domain Image Stylization.",
            "Invertible Grayscale with Sparsity Enforcing Priors.",
            "Knowledge-aware Multi-modal Adaptive Graph Convolutional Networks for Fake News Detection.",
            "Table of Contents: Online Supplement Volume 17, Number 2s-3s.",
            "Dual-Stream Guided-Learning via a Priori Optimization for Person Re-identification.",
            "Adaptive Compression for Online Computer Vision: An Edge Reinforcement Learning Approach.",
            "Smart Director: An Event-Driven Directing System for Live Broadcasting.",
            "Dual-Stream Structured Graph Convolution Network for Skeleton-Based Action Recognition.",
            "Unsupervised Domain Expansion for Visual Categorization.",
            "Task-independent Recognition of Communication Skills in Group Interaction Using Time-series Modeling.",
            "Where Are They Going? Predicting Human Behaviors in Crowded Scenes.",
            "Using Multisensory Content to Impact the Quality of Experience of Reading Digital Books.",
            "Bi-Directional Co-Attention Network for Image Captioning.",
            "Cross-Domain Object Representation via Robust Low-Rank Correlation Analysis.",
            "Cross-Modal Hybrid Feature Fusion for Image-Sentence Matching.",
            "Fine-Grained Visual Textual Alignment for Cross-Modal Retrieval Using Transformer Encoders.",
            "Health Status Prediction with Local-Global Heterogeneous Behavior Graph.",
            "Perceptual Quality Assessment of Low-light Image Enhancement.",
            "Dissimilarity-Based Regularized Learning of Charts.",
            "A New Foreground-Background based Method for Behavior-Oriented Social Media Image Classification.",
            "An Adaptive Bitrate Switching Algorithm for Speech Applications in Context of WebRTC.",
            "A Fast View Synthesis Implementation Method for Light Field Applications.",
            "Bayesian Covariance Representation with Global Informative Prior for 3D Action Recognition.",
            "Pedestrian-Aware Panoramic Video Stitching Based on a Structured Camera Array.",
            "Y-Net: Dual-branch Joint Network for Semantic Segmentation.",
            "Detecting Non-Aligned Double JPEG Compression Based on Amplitude-Angle Feature.",
            "Residual-guided In-loop Filter Using Convolution Neural Network.",
            "Trust Mechanism of Feedback Trust Weight in Multimedia Network."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 121,
        "papers": [
            "Table of Contents: Online Supplement Volume 15, Number 3s.",
            "LFGAN: 4D Light Field Synthesis from a Single RGB Image.",
            "Adaptive Exploration for Unsupervised Person Re-identification.",
            "DQ-DASH: A Queuing Theory Approach to Distributed Adaptive Video Streaming.",
            "RCE-HIL: Recognizing Cross-media Entailment with Heterogeneous Interactive Learning.",
            "Cross Refinement Techniques for Markerless Human Motion Capture.",
            "Cloud Gaming with Foveated Video Encoding.",
            "An Evaluation of Tile Selection Methods for Viewport-Adaptive Streaming of 360-Degree Video.",
            "Learning Shared Semantic Space with Correlation Alignment for Cross-Modal Event Retrieval.",
            "Joint Stacked Hourglass Network and Salient Region Attention Refinement for Robust Face Alignment.",
            "Causal Structures of Multidimensional QoE in Haptic-Audiovisual Communications: Bayesian Modeling.",
            "Inception U-Net Architecture for Semantic Segmentation to Identify Nuclei in Microscopy Cell Images.",
            "Image Retrieval for Complex Queries Using Knowledge Embedding.",
            "Spatio-temporal Segmentation Based Adaptive Compression of Dynamic Mesh Sequences.",
            "Frame-level Bit Allocation Optimization Based on Video Content Characteristics for HEVC.",
            "Enforcing Affinity Feature Learning through Self-attention for Person Re-identification.",
            "A Deep Learning Approach for Face Hallucination Guided by Facial Boundary Responses.",
            "Exploring Deep Learning for View-Based 3D Model Retrieval.",
            "SCeVE: A Component-based Framework to Author Mixed Reality Tours.",
            "A Benchmark Dataset and Comparison Study for Multi-modal Human Action Analytics.",
            "EGroupNet: A Feature-enhanced Network for Age Estimation with Novel Age Group Schemes.",
            "SAMAF: Sequence-to-sequence Autoencoder Model for Audio Fingerprinting.",
            "Shuffled ImageNet Banks for Video Event Detection and Search.",
            "Human Activity Recognition from Multiple Sensors Data Using Multi-fusion Representations and CNNs.",
            "Do Users Behave Similarly in VR? Investigation of the User Influence on the System Design.",
            "Listen, Look, and Find the One: Robust Person Search with Multimodality Index.",
            "FIN: Feature Integrated Network for Object Detection.",
            "PPNet: Privacy Protected CDN-ISP Collaboration for QoS-aware Multi-CDN Adaptive Video Streaming.",
            "CryptoLesion: A Privacy-preserving Model for Lesion Segmentation Using Whale Optimization over Cloud.",
            "Dual-path Convolutional Image-Text Embeddings with Instance Loss.",
            "Meta-path Augmented Sequential Recommendation with Contextual Co-attention Network.",
            "Image to Modern Chinese Poetry Creation via a Constrained Topic-aware Model.",
            "Region-Level Visual Consistency Verification for Large-Scale Partial-Duplicate Image Search.",
            "Spatio-temporal Saliency-based Motion Vector Refinement for Frame Rate Up-conversion.",
            "Learning Visual Elements of Images for Discovery of Brand Posts.",
            "Hyperspectral Reconstruction with Redundant Camera Spectral Sensitivity Functions.",
            "Table of Contents: Online Supplement Volume 16, Number 1s.",
            "Constrained LSTM and Residual Attention for Image Captioning.",
            "Deep Triplet Neural Networks with Cluster-CCA for Audio-Visual Cross-Modal Retrieval.",
            "Multi-View Graph Matching for 3D Model Retrieval.",
            "Recurrent Attention Network with Reinforced Generator for Visual Dialog.",
            "Attention-Based Modality-Gated Networks for Image-Text Sentiment Analysis.",
            "Posed and Spontaneous Expression Distinction Using Latent Regression Bayesian Networks.",
            "Upgrading the Newsroom: An Automated Image Selection System for News Articles.",
            "3D Facial Similarity Measurement and Its Application in Facial Organization.",
            "Image Captioning with a Joint Attention Mechanism by Visual Concept Samples.",
            "Improving Multiperson Pose Estimation by Mask-aware Deep Reinforcement Learning.",
            "Learning Joint Structure for Human Pose Estimation.",
            "Single-stage Instance Segmentation.",
            "Few-shot Food Recognition via Multi-view Representation Learning.",
            "Sketch-guided Deep Portrait Generation.",
            "Design, Analysis, and Implementation of Efficient Framework for Image Annotation.",
            "Kernel Attention Network for Single Image Super-Resolution.",
            "Blind Image Quality Assessment by Natural Scene Statistics and Perceptual Characteristics.",
            "A Unified Tensor Framework for Clustering and Simultaneous Reconstruction of Incomplete Imaging Data.",
            "Table of Contents: Online Supplement Volume 16, Number 3s.",
            "Eye-based Recognition for User Identification on Mobile Devices.",
            "A Novel (t, s, k, n)-Threshold Visual Secret Sharing Scheme Based on Access Structure Partition.",
            "Am I Done? Predicting Action Progress in Videos.",
            "Correlation Discrepancy Insight Network for Video Re-identification.",
            "Smart Scribbles for Image Matting.",
            "Depth Image Denoising Using Nuclear Norm and Learning Graph Model.",
            "Motion-Aware Structured Matrix Factorization for Foreground Detection in Complex Scenes.",
            "Controlling Neural Learning Network with Multiple Scales for Image Splicing Forgery Detection.",
            "Vertical Retargeting for Stereoscopic Images via Stereo Seam Carving.",
            "Perceptual Image Compression with Block-Level Just Noticeable Difference Prediction.",
            "Make Full Use of Priors: Cross-View Optimized Filter for Multi-View Depth Enhancement.",
            "Adaptive Attention-based High-level Semantic Introduction for Image Caption.",
            "Evaluation of Information Comprehension in Concurrent Speech-based Designs.",
            "Learning a Deep Agent to Predict Head Movement in 360-Degree Images.",
            "MMFN: Multimodal Information Fusion Networks for 3D Model Classification and Retrieval.",
            "GuessUNeed: Recommending Courses via Neural Attention Network and Course Prerequisite Relation Embeddings.",
            "Knowledge-driven Egocentric Multimodal Activity Recognition.",
            "Part-based Structured Representation Learning for Person Re-identification.",
            "Multi-scale Supervised Attentive Encoder-Decoder Network for Crowd Counting.",
            "Multichannel Attention Refinement for Video Question Answering.",
            "Random Forest with Self-Paced Bootstrap Learning in Lung Cancer Prognosis.",
            "Spatial Preserved Graph Convolution Networks for Person Re-identification.",
            "Delving Deeper in Drone-Based Person Re-Id by Employing Deep Decision Forest and Attributes Fusion.",
            "Action Recognition Using Form and Motion Modalities.",
            "ACMNet: Adaptive Confidence Matching Network for Human Behavior Analysis via Cross-modal Retrieval.",
            "Machine Learning Techniques for the Diagnosis of Alzheimer's Disease: A Review.",
            "Introduction to the Special Issue on Multimodal Machine Learning for Human Behavior Analysis.",
            "Exploring Disorder-Aware Attention for Clinical Event Extraction.",
            "Active Balancing Mechanism for Imbalanced Medical Data in Deep Learning-Based Classification Models.",
            "Hybrid Wolf-Bat Algorithm for Optimization of Connection Weights in Multi-layer Perceptron.",
            "CovLets: A Second-Order Descriptor for Modeling Multiple Features.",
            "Robust Visual Tracking Using Kernel Sparse Coding on Multiple Covariance Descriptors.",
            "Intelligent Classification and Analysis of Essential Genes Using Quantitative Methods.",
            "A Decision Support System with Intelligent Recommendation for Multi-disciplinary Medical Treatment.",
            "Introduction to the Special Issue on Computational Intelligence for Biomedical Data and Imaging.",
            "Pulmonary Nodule Detection Based on ISODATA-Improved Faster RCNN and 3D-CNN with Focal Loss.",
            "Textual Entailment-Based Figure Summarization for Biomedical Articles.",
            "Cell Nuclei Classification in Histopathological Images using Hybrid O L ConvNet.",
            "AMIL: Adversarial Multi-instance Learning for Human Pose Estimation.",
            "Modeling Long-Term Dependencies from Videos Using Deep Multiplicative Neural Networks.",
            "A New Transfer Function for Volume Visualization of Aortic Stent and Its Application to Virtual Endoscopy.",
            "Introduction to the Special Issue on Smart Communications and Networking for Future Video Surveillance.",
            "The Impact of Motion and Delay on Selecting Game Targets with a Mouse.",
            "Introduction to the Best Papers from the ACM Multimedia Systems (MMSys) 2019 and Co-Located Workshops.",
            "An Adaptive Two-Layer Light Field Compression Scheme Using GNN-Based Reconstruction.",
            "Cross-Domain Brain CT Image Smart Segmentation via Shared Hidden Space Transfer FCM Clustering.",
            "Evaluation of Shared Resource Allocation Using SAND for ABR Streaming.",
            "Spatio-Temporal Deep Residual Network with Hierarchical Attentions for Video Event Recognition.",
            "Proposal Complementary Action Detection.",
            "A Practical Learning-based Approach for Viewer Scheduling in the Crowdsourced Live Streaming.",
            "QoE-Fair DASH Video Streaming Using Server-side Reinforcement Learning.",
            "Performance Analysis of ACTE: A Bandwidth Prediction Method for Low-latency Chunked Streaming.",
            "Requet: Real-Time QoE Metric Detection for Encrypted YouTube Traffic.",
            "DenseNet-201-Based Deep Neural Network with Composite Learning Factor and Precomputation for Multiple Sclerosis Classification.",
            "An LSH-based Offloading Method for IoMT Services in Integrated Cloud-Edge Environment.",
            "Fog-based Secure Service Discovery for Internet of Multimedia Things: A Cross-blockchain Approach.",
            "Social-sensed Image Aesthetics Assessment.",
            "Differentially Private Tensor Train Deep Computation for Internet of Multimedia Things.",
            "SDN-Assisted DDoS Defense Framework for the Internet of Multimedia Things.",
            "Introduction to the Special Issue on Privacy and Security in Evolving Internet of Multimedia Things.",
            "Securing Multimedia by Using DNA-Based Encryption in the Cloud Computing Environment.",
            "MV2Flow: Learning Motion Representation for Fast Compressed Video Action Recognition.",
            "Analysis of the Security of Internet of Multimedia Things.",
            "Data Hiding: Current Trends, Innovation and Potential Challenges.",
            "Privacy Protection for Medical Data Sharing in Smart Healthcare."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 100,
        "papers": [
            "Table of Contents: Online Supplement Volume 15, Number 1s.",
            "Efficient QoE-Aware Scheme for Video Quality Switching Operations in Dynamic Adaptive Streaming.",
            "HTTP/2-based Frame Discarding for Low-Latency Adaptive Video Streaming.",
            "Symmetrical Residual Connections for Single Image Super-Resolution.",
            "Deep Cross-Modal Correlation Learning for Audio and Lyrics in Music Retrieval.",
            "Expression Robust 3D Facial Landmarking via Progressive Coarse-to-Fine Tuning.",
            "CM-GANs: Cross-modal Generative Adversarial Networks for Common Representation Learning.",
            "Reconstructing 3D Face Models by Incremental Aggregation and Refinement of Depth Frames.",
            "Orchestrating Caching, Transcoding and Request Routing for Adaptive Video Streaming Over ICN.",
            "Discovering Latent Topics by Gaussian Latent Dirichlet Allocation and Spectral Clustering.",
            "Image Captioning With Visual-Semantic Double Attention.",
            "Modality-Invariant Image-Text Embedding for Image-Sentence Matching.",
            "Photorealistic Face Completion with Semantic Parsing and Face Identity-Preserving Features.",
            "Interactive Search or Sequential Browsing? A Detailed Analysis of the Video Browser Showdown 2018.",
            "Editorial to Special Issue on Deep Learning for Intelligent Multimedia Analytics.",
            "Deep Learning-Based Multimedia Analytics: A Review.",
            "Convolutional Attention Networks for Scene Text Recognition.",
            "Structure-Aware Deep Learning for Product Image Classification.",
            "Deep Patch Representations with Shared Codebook for Scene Classification.",
            "Visual Content Recognition by Exploiting Semantic Feature Map with Attention and Multi-task Learning.",
            "Cross-Modality Feature Learning via Convolutional Autoencoder.",
            "Dense 3D-Convolutional Neural Network for Person Re-Identification in Videos.",
            "Deep Semantic Mapping for Heterogeneous Multimedia Transfer Learning Using Co-Occurrence Data.",
            "Applying Deep Learning for Epilepsy Seizure Detection and Brain Mapping Visualization.",
            "Special Section on Multimodal Understanding of Social, Affective, and Subjective Attributes.",
            "Virtual Portraitist: An Intelligent Tool for Taking Well-Posed Selfies.",
            "Modeling Dyadic and Group Impressions with Intermodal and Interperson Features.",
            "Personalized Emotion Recognition by Personality-Aware High-Order Learning of Physiological Signals.",
            "Understanding the Dynamics of Social Interactions: A Multi-Modal Multi-View Approach.",
            "A Multi-sensor Framework for Personal Presentation Analytics.",
            "Rich Visual and Language Representation with Complementary Semantics for Video Captioning.",
            "Multi-level Similarity Perception Network for Person Re-identification.",
            "A Deep Learning System for Recognizing Facial Expression in Real-Time.",
            "Using Eye Tracking and Heart-Rate Activity to Examine Crossmodal Correspondences QoE in Mulsemedia.",
            "Detecting Online Counterfeit-goods Seller using Connection Discovery.",
            "QoE for Mobile Clients with Segment-aware Rate Adaptation Algorithm (SARA) for DASH Video Streaming.",
            "Watch Me from Distance (WMD): A Privacy-Preserving Long-Distance Video Surveillance System.",
            "Look at Me! Correcting Eye Gaze in Live Video Communication.",
            "How Deep Features Have Improved Event Recognition in Multimedia: A Survey.",
            "Appearance-consistent Video Object Segmentation Based on a Multinomial Event Model.",
            "Design, Large-Scale Usage Testing, and Important Metrics for Augmented Reality Gaming Applications.",
            "Increasing Image Memorability with Neural Style Transfer.",
            "From Selective Deep Convolutional Features to Compact Binary Representations for Image Retrieval.",
            "Low-Complexity Scalable Extension of the High-Efficiency Video Coding (SHVC) Encoding System.",
            "A2CMHNE: Attention-Aware Collaborative Multimodal Heterogeneous Network Embedding.",
            "Resilient Color Image Watermarking Using Accurate Quaternion Radial Substituted Chebyshev Moments.",
            "Alone versus In-a-group: A Multi-modal Framework for Automatic Affect Recognition.",
            "Introduction to the Special Issue on the Cross-Media Analysis for Visual Question Answering.",
            "Semantic Concept Network and Deep Walk-based Visual Question Answering.",
            "BTDP: Toward Sparse Fusion with Block Term Decomposition Pooling for Visual Question Answering.",
            "Multi-source Multi-level Attention Networks for Visual Question Answering.",
            "Video Question Answering via Knowledge-based Progressive Spatial-Temporal Attention Network.",
            "Spatiotemporal-Textual Co-Attention Network for Video Question Answering.",
            "Show, Reward, and Tell: Adversarial Visual Story Generation.",
            "Image Captioning by Asking Questions.",
            "Cross-Modality Retrieval by Joint Correlation Learning.",
            "Introduction to the Special Issue on Big Data, Machine Learning, and AI Technologies for Art and Design.",
            "Artificial Intelligence, Artists, and Art: Attitudes Toward Artwork Produced by Humans vs. Artificial Intelligence.",
            "Art by Computing Machinery: Is Machine Art Acceptable in the Artworld?",
            "Visual Arts Search on Mobile Devices.",
            "Interpretable Partitioned Embedding for Intelligent Multi-item Fashion Outfit Composition.",
            "Color Theme-based Aesthetic Enhancement Algorithm to Emulate the Human Perception of Beauty in Photos.",
            "Beauty Is in the Eye of the Beholder: Demographically Oriented Analysis of Aesthetics in Photographs.",
            "Introduction to the Best Papers of the ACM Multimedia Systems (MMSys) Conference 2018 and the ACM Workshop on Network and Operating System Support for Digital Audio and Video (NOSSDAV) 2018 and the International Workshop on Mixed and Virtual Environment Systems (MMVE) 2018.",
            "Game of Streaming Players: Is Consensus Viable or an Illusion?",
            "A Framework for Adaptive Residual Streaming for Single-Player Cloud Gaming.",
            "From Theory to Practice: Improving Bitrate Adaptation in the DASH Reference Player.",
            "6K and 8K Effective Resolution with 4K HEVC Decoding Capability for 360 Video Streaming.",
            "Table of Contents: Online Supplement Volume 15, Number 2s.",
            "Advanced Stereo Seam Carving by Considering Occlusions on Both Sides.",
            "Statistical Early Termination and Early Skip Models for Fast Mode Decision in HEVC INTRA Coding.",
            "A Simplistic Global Median Filtering Forensics Based on Frequency Domain Analysis of Image Residuals.",
            "Harvesting Visual Objects from Internet Images via Deep-Learning-Based Objectness Assessment.",
            "Spatial Structure Preserving Feature Pyramid Network for Semantic Image Segmentation.",
            "Moving Foreground-Aware Visual Attention and Key Volume Mining for Human Action Recognition.",
            "A Pseudo-likelihood Approach for Geo-localization of Events from Crowd-sourced Sensor-Metadata.",
            "Paillier Cryptosystem based Mean Value Computation for Encrypted Domain Image Processing Operations.",
            "Subtitle Region Selection of S3D Images in Consideration of Visual Discomfort and Viewing Habit.",
            "Learning Click-Based Deep Structure-Preserving Embeddings with Visual Attention.",
            "Stochastic Optimization for Green Multimedia Services in Dense 5G Networks.",
            "Pseudo-3D Attention Transfer Network with Content-aware Strategy for Image Captioning.",
            "Deep Scalable Supervised Quantization by Self-Organizing Map.",
            "Chunk Duration-Aware SDN-Assisted DASH.",
            "Rethinking the Combined and Individual Orders of Derivative of States for Differential Recurrent Neural Networks: Deep Differential Recurrent Neural Networks.",
            "Eigenvector-Based Distance Metric Learning for Image Classification and Retrieval.",
            "HGAN: Holistic Generative Adversarial Networks for Two-dimensional Image-based Three-dimensional Object Retrieval.",
            "Image/Video Restoration via Multiplanar Autoregressive Model and Low-Rank Optimization.",
            "Steganographer Detection via Multi-Scale Embedding Probability Estimation.",
            "Random Playlists Smoothly Commuting Between Styles.",
            "Sequential Cross-Modal Hashing Learning via Multi-scale Correlation Mining.",
            "Efficient Image Hashing with Geometric Invariant Vector Distance for Copy Detection.",
            "AB-LSTM: Attention-based Bidirectional LSTM Model for Scene Text Detection.",
            "Embedding Distortion Analysis in Wavelet-domain Watermarking.",
            "Video Retrieval with Similarity-Preserving Deep Temporal Hashing.",
            "Tile-based Adaptive Streaming for Virtual Reality Video.",
            "Dissecting the Performance of VR Video Streaming through the VR-EXP Experimentation Platform.",
            "Unsupervised Learning of Human Action Categories in Still Images with Deep Representations.",
            "An Image Cues Coding Approach for 3D Human Pose Estimation.",
            "An End-to-End Attention-Based Neural Model for Complementary Clothing Matching.",
            "Adaptive Chunklets and AQM for Higher-Performance Content Streaming."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 90,
        "papers": [
            "Emotion Recognition Using Multiple Kernel Learning toward E-learning Applications.",
            "Learning Label Preserving Binary Codes for Multimedia Retrieval: A General Approach.",
            "Implicit Emotion Communication: EEG Classification and Haptic Feedback.",
            "Delay-Aware Quality Optimization in Cloud-Assisted Video Streaming System.",
            "Deep Bidirectional Cross-Triplet Embedding for Online Clothing Shopping.",
            "DeepSearch: A Fast Image Search Framework for Mobile Devices.",
            "Robust Multi-Variate Temporal Features of Multi-Variate Time Series.",
            "Online Early-Late Fusion Based on Adaptive HMM for Sign Language Recognition.",
            "Joint Estimation of Age and Expression by Combining Scattering and Convolutional Networks.",
            "Egocentric Hand Detection Via Dynamic Region Growing.",
            "Visual Background Recommendation for Dance Performances Using Deep Matrix Factorization.",
            "Adaptive Fractional-Pixel Motion Estimation Skipped Algorithm for Efficient HEVC Motion Estimation.",
            "A Discriminatively Learned CNN Embedding for Person Reidentification.",
            "Robust Privacy-Preserving Image Sharing over Online Social Networks (OSNs).",
            "Introduction to the Special Issue on Representation, Analysis, and Recognition of 3D Humans.",
            "Representation, Analysis, and Recognition of 3D Humans: A Survey.",
            "Deformation-Based 3D Facial Expression Representation.",
            "Texture and Geometry Scattering Representation-Based Facial Expression Recognition in 2D+3D Videos.",
            "Combining Facial Parts For Learning Gender, Ethnicity, and Emotional State Based on RGB-D Information.",
            "Early Recognition of 3D Human Actions.",
            "A Unified Framework for Multi-Modal Isolated Gesture Recognition.",
            "Gait Recognition from Motion Capture Data.",
            "Sequential Articulated Motion Reconstruction from a Monocular Image Sequence.",
            "Full 3D Reconstruction of Non-Rigidly Deforming Objects.",
            "Introduction to the Special Section on Multimedia Computing and Applications of Socio-Affective Behaviors in the Wild.",
            "Detection of Human, Legitimate Bot, and Malicious Bot in Online Social Networks Based on Wavelets.",
            "Spatially Coherent Feature Learning for Pose-Invariant Facial Expression Recognition.",
            "Guest Editorial: Special Issue on \"QoE Management for Multimedia Services\".",
            "A Survey of Emerging Concepts and Challenges for QoE Management of Multimedia Services.",
            "Measuring Individual Video QoE: A Survey, and Proposal for Future Directions Using Social Media.",
            "Quality of Experience-Centric Management of Adaptive Video Streaming Services: Status and Challenges.",
            "SABR: Network-Assisted Content Distribution for QoE-Driven ABR Video Streaming.",
            "A Generic Approach to Video Buffer Modeling Using Discrete-Time Analysis.",
            "Can You See What I See? Quality-of-Experience Measurements of Mobile Live Video Broadcasting.",
            "PMS: A Novel Scale-Adaptive and Quality-Adaptive Hybrid P2P/Multisource Solution for Live Streaming.",
            "QoE-Aware OTT-ISP Collaboration in Service Management: Architecture and Approaches.",
            "Guest Editorial: Special Section on \"Multimedia Understanding via Multimodal Analytics\".",
            "Multimodal Multiplatform Social Media Event Summarization.",
            "Structure-Aware Multimodal Feature Fusion for RGB-D Scene Classification and Beyond.",
            "Image Captioning with Deep Bidirectional LSTMs and Multi-Task Learning.",
            "Toward Personalized Activity Level Prediction in Community Question Answering Websites.",
            "Table of Contents: Online Supplement Volume 14, Number 1s.",
            "Improved Audio Steganalytic Feature and Its Applications in Audio Forensics.",
            "Analytical Global Median Filtering Forensics Based on Moment Histograms.",
            "Multifeature Selection for 3D Human Action Recognition.",
            "Learning a Multi-Concept Video Retrieval Model with Multiple Latent Variables.",
            "Data Musicalization.",
            "Paying More Attention to Saliency: Image Captioning with Saliency and Context Attention.",
            "Contrast Enhancement Estimation for Digital Image Forensics.",
            "DeepProduct: Mobile Product Search With Portable Deep Features.",
            "Ensemble of Deep Models for Event Recognition.",
            "Over- and Under-Exposure Reconstruction of a Single Plenoptic Capture.",
            "Introduction to the Special Issue on Delay-Sensitive Video Computing in the Cloud.",
            "Delay-Sensitive Video Computing in the Cloud: A Survey.",
            "Cost-Efficient Server Provisioning for Cloud Gaming.",
            "Game Categorization for Deriving QoE-Driven Video Encoding Configuration Strategies for Cloud Gaming.",
            "Game Input with Delay - Moving Target Selection with a Game Controller Thumbstick.",
            "Novel Hybrid-Cast Approach to Reduce Bandwidth and Latency for Cloud-Based Virtual Space.",
            "Cloud Baking: Collaborative Scene Illumination for Dynamic Web3D Scenes.",
            "Best Papers of the ACM Multimedia Systems (MMSys) Conference 2017 and the ACM Workshop on Network and Operating System Support for Digital Audio and Video (NOSSDAV) 2017.",
            "ASAP: Adaptive Stall-Aware Pacing for Improved DASH Video Experience in Cellular Networks.",
            "On the Effectiveness of Offset Projections for 360-Degree Video Streaming.",
            "Designing and Evaluating a Mesh Simplification Algorithm for Virtual Reality.",
            "Enabling Live Video Analytics with a Scalable and Privacy-Aware Framework.",
            "Prototyping a Web-Scale Multimedia Retrieval Service Using Spark.",
            "Characterizing User Behaviors in Mobile Personal Livecast: Towards an Edge Computing-assisted Paradigm.",
            "User Behavior Analysis and Video Popularity Prediction on a Large-Scale VoD System.",
            "Table of Contents: Online Supplement Volume 14, Number 3s.",
            "Aesthetic Highlight Detection in Movies Based on Synchronization of Spectators' Reactions.",
            "Automatic Data Augmentation from Massive Web Images for Deep Visual Recognition.",
            "User-Click-Data-Based Fine-Grained Image Recognition via Weakly Supervised Metric Learning.",
            "ORL-SDN: Online Reinforcement Learning for SDN-Enabled HTTP Adaptive Streaming.",
            "Efficient Video Encoding for Automatic Video Analysis in Distributed Wireless Surveillance Systems.",
            "Image Captioning with Affective Guiding and Selective Attention.",
            "Soundscape of an Archaeological Site Recreated with Audio Augmented Reality.",
            "Properties and Design of Variable-to-Variable Length Codes.",
            "A Survey on Content-Aware Image and Video Retargeting.",
            "A Network-Based Virtual Reality Simulation Training Approach for Orthopedic Surgery.",
            "Learning Multiple Kernel Metrics for Iterative Person Re-Identification.",
            "Joint Head Attribute Classifier and Domain-Specific Refinement Networks for Face Alignment.",
            "Unsupervised Similarity Learning through Rank Correlation and kNN Sets.",
            "Thinking Like a Director: Film Editing Patterns for Virtual Cinematographic Storytelling.",
            "SKEPRID: Pose and Illumination Change-Resistant Skeleton-Based Person Re-Identification.",
            "Unsupervised Person Re-identification: Clustering and Fine-tuning.",
            "Robust Electric Network Frequency Estimation with Rank Reduction and Linear Prediction.",
            "Probability Model-Based Early Merge Mode Decision for Dependent Views Coding in 3D-HEVC.",
            "A Hybrid Approach for Spatio-Temporal Validation of Declarative Multimedia Documents.",
            "Image Captioning via Semantic Guidance Attention and Consensus Selection Strategy.",
            "OmniArt: A Large-scale Artistic Benchmark.",
            "Collaborations on YouTube: From Unsupervised Detection to the Impact on Video and Channel Popularity."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2016",
        "info": "Volume 13: 2016/2017",
        "count": 63,
        "papers": [
            "Learning from Collective Intelligence: Feature Learning Using Social Images and Tags.",
            "Prediction of Virality Timing Using Cascades in Social Media.",
            "Approximate Asymmetric Search for Binary Embedding Codes.",
            "QoE-Based Low-Delay Live Streaming Using Throughput Predictions.",
            "Digital Lollipop: Studying Electrical Stimulation on the Human Tongue to Simulate Taste Sensations.",
            "Fixation Prediction through Multimodal Analysis.",
            "Predicting Occupation from Images by Combining Face and Body Context Information.",
            "Consistent Synchronization of Action Order with Least Noticeable Delays in Fast-Paced Multiplayer Online Games.",
            "Audiovisual Tool for Solfège Assessment.",
            "Identification of Reconstructed Speech.",
            "Drift-Compensated Robust Watermarking Algorithm for H.265/HEVC Video Stream.",
            "An Efficient Framework for Compressed Domain Watermarking in P Frames of High-Efficiency Video Coding (HEVC)-Encoded Video.",
            "Multichannel-Kernel Canonical Correlation Analysis for Cross-View Person Reidentification.",
            "A Temporal Order Modeling Approach to Human Action Recognition from Multimodal Sensor Data.",
            "Multi-Class Latent Concept Pooling for Computer-Aided Endoscopy Diagnosis.",
            "Machine Learning-Based Parametric Audiovisual Quality Prediction Models for Real-Time Communications.",
            "Congestion Control for Network-Aware Telehaptic Communication.",
            "A Video Bitrate Adaptation and Prediction Mechanism for HTTP Adaptive Streaming.",
            "Crowd Scene Understanding from Video: A Survey.",
            "V-JAUNE: A Framework for Joint Action Recognition and Video Summarization.",
            "A Multiplexing Scheme for Multimodal Teleoperation.",
            "A Dual-Domain Perceptual Framework for Generating Visual Inconspicuous Counterparts.",
            "Secure Cloud-Based Image Tampering Detection and Localization Using POB Number System.",
            "Creating Segments and Effects on Comics by Clustering Gaze Data.",
            "Query Expansion for Content-Based Similarity Search Using Local and Global Features.",
            "From Annotation to Computer-Aided Diagnosis: Detailed Evaluation of a Medical Multimedia System.",
            "Enhancing Person Re-identification in a Self-Trained Subspace.",
            "Recognizing Human Actions with Outlier Frames by Observation Filtering and Completion.",
            "Intensifying Emotional Reactions via Tactile Gestures in Immersive Films.",
            "An Analytic System for User Gender Identification through User Shared Images.",
            "Pithos: Distributed Storage for Massive Multi-User Virtual Environments.",
            "Saliency Detection on Light Field: A Multi-Cue Approach.",
            "Introduction to Special Issue on Deep Learning for Mobile Multimedia.",
            "Deep Learning for Mobile Multimedia: A Survey.",
            "Deep Artwork Detection and Retrieval for Automatic Context-Aware Audio Guides.",
            "Mobile Multi-Food Recognition Using Deep Learning.",
            "Enhancing Transmission Collision Detection for Distributed TDMA in Vehicular Networks.",
            "Spott: On-the-Spot e-Commerce for Television Using Deep Learning-Based Video Analysis Techniques.",
            "A Tucker Deep Computation Model for Mobile Multimedia Feature Learning.",
            "Best Papers of the 2016 ACM Multimedia Systems (MMSys) Conference and Workshop on Network and Operating System Support for Digital Audio and Video (NOSSDAV) 2016.",
            "Distributed Rate Allocation in Switch-Based Multiparty Videoconferencing System.",
            "Design and Performance Evaluation of Network-assisted Control Strategies for HTTP Adaptive Streaming.",
            "On Optimizing Adaptive Algorithms Based on Rebuffering Probability.",
            "An SDN Architecture for Privacy-Friendly Network-Assisted DASH.",
            "Design and Analysis of QoE-Aware Quality Adaptation for DASH: A Spectrum-Based Approach.",
            "Cloud-Assisted Crowdsourced Livecast.",
            "Table of Contents: Online Supplement Volume 13, Number 3s.",
            "Sparse Representation-Based Semi-Supervised Regression for People Counting.",
            "Caching Online Video: Analysis and Proposed Algorithm.",
            "Multimodal Retrieval with Diversification and Relevance Feedback for Tourist Attraction Images.",
            "Mixtape: Using Real-Time User Feedback to Navigate Large Media Collections.",
            "Securing Speech Noise Reduction in Outsourced Environment.",
            "Interactive Film Recombination.",
            "Complexity Correlation-Based CTU-Level Rate Control with Direction Selection for HEVC.",
            "Modeling and Analysis of Power Consumption in Live Video Streaming Systems.",
            "When Smart Devices Interact With Pervasive Screens: A Survey.",
            "O-Mopsi: Mobile Orienteering Game for Sightseeing, Exercising, and Education.",
            "Performance Analysis of Game Engines on Mobile and Fixed Devices.",
            "An Efficient Computation Framework for Connection Discovery using Shared Images.",
            "A Distributed Streaming Framework for Connection Discovery Using Shared Videos.",
            "Semantic Reasoning in Zero Example Video Event Retrieval.",
            "An Efficient Motion Detection and Tracking Scheme for Encrypted Surveillance Videos.",
            "PLACID: A Platform for FPGA-Based Accelerator Creation for DCNNs."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2015",
        "info": "Volume 12: 2015/2016",
        "count": 85,
        "papers": [
            "Using Paired Distances of Signal Peaks in Stereo Channels as Fingerprints for Copy Identification.",
            "QoE-Based Cross-Layer Optimization for Uplink Video Transmission.",
            "CelebrityNet: A Social Network Constructed from Large-Scale Online Celebrity Images.",
            "Segmentation of Discriminative Patches in Human Activity Video.",
            "Wireless Multicast for Zoomable Video Streaming.",
            "User Preferences Modeling and Learning for Pleasing Photo Collage Generation.",
            "QoE-Based SVC Layer Dropping in LTE Networks Using Content-Aware Layer Priorities.",
            "Area of Simulation: Mechanism and Architecture for Multi-Avatar Virtual Environments.",
            "Link-Aware Reconfigurable Point-to-Point Video Streaming for Mobile Devices.",
            "Combining Acoustic and Multilevel Visual Features for Music Genre Classification.",
            "Introduction to: Special Issue on Smartphone-Based Interactive Technologies, Systems, and Applications.",
            "ShotVis: Smartphone-Based Visualization of OCR Information from Images.",
            "Automated Link Generation for Sensor-Enriched Smartphone Images.",
            "Visual Comfort for Stereoscopic 3D by Using Motion Sensors on 3D Mobile Devices.",
            "Enabling Context-Aware Indoor Augmented Reality via Smartphone Sensing and Vision Tracking.",
            "Supporting Healthy Grocery Shopping via Mobile Augmented Reality.",
            "PSNController: An Unwanted Content Control System in Pervasive Social Networking Based on Trust Management.",
            "Launching an Efficient Participatory Sensing Campaign: A Smart Mobile Device-Based Approach.",
            "Context-Aware Photography Learning for Smart Mobile Devices.",
            "Accessing Tape Music Documents on Mobile Devices.",
            "SAfeDJ: A Crowd-Cloud Codesign Approach to Situation-Aware Music Delivery for Drivers.",
            "Investigating On-Screen Gamepad Designs for Smartphone-Controlled Video Games.",
            "Smartening Up the Student Learning Experience with Ubiquitous Media.",
            "Introduction to: Special Issue on Extended Best Papers from ACM Multimedia 2014.",
            "Emotion Recognition During Speech Using Dynamics of Multiple Regions of the Face.",
            "Correspondence Autoencoders for Cross-Modal Retrieval.",
            "From 3D Sensing to Printing: A Survey.",
            "QoE-Driven Rate Adaptation Heuristic for Fair Adaptive Video Streaming.",
            "Scalable Object Retrieval with Compact Image Representation from Generic Object Regions.",
            "Multiview Image Block Compressive Sensing with Joint Multiphase Decoding for Visual Sensor Network.",
            "Opinion Question Answering by Sentiment Clip Localization.",
            "Improving Concept-Based Image Retrieval with Training Weights Computed from Tags.",
            "Automatic Generation of Visual-Textual Presentation Layout.",
            "Measuring Collectiveness via Refined Topological Similarity.",
            "Measurements and Analysis of a Major Adult Video Portal.",
            "Finding Social Points of Interest from Georeferenced and Oriented Online Photographs.",
            "From the Past Editor-In-Chief.",
            "Semantic Photo Retargeting Under Noisy Image Labels.",
            "Mobile Device-to-Device Video Distribution: Theory and Application.",
            "Forensic Analysis of Linear and Nonlinear Image Filtering Using Quantization Noise.",
            "Secure Nonlocal Denoising in Outsourced Images.",
            "Depth Personalization and Streaming of Stereoscopic Sports Videos.",
            "Enhanced Reweighted MRFs for Efficient Fashion Image Parsing.",
            "Atom Decomposition with Adaptive Basis Selection Strategy for Matrix Completion.",
            "A High-Fidelity and Low-Interaction-Delay Screen Sharing System.",
            "Collaborative Annotation of Videos Relying on Weak Consistency.",
            "Adaptive Streaming in P2P Live Video Systems: A Distributed Rate Control Approach.",
            "When Game Becomes Life: The Creators and Spectators of Online Game Replays and Live Streaming.",
            "Depth-Based View-Invariant Blind 3D Image Watermarking.",
            "MobiCoop: An Incentive-Based Cooperation Solution for Mobile Applications.",
            "Progressive Visual Cryptography with Unexpanded Meaningful Shares.",
            "Audio Masking Effect on Inter-Component Skews in Olfaction-Enhanced Multimedia Presentations.",
            "Field Effect Deep Networks for Image Recognition with Incomplete Data.",
            "A Unified Video Recommendation by Cross-Network User Modeling.",
            "Covert Voice over Internet Protocol Communications with Packet Loss Based on Fractal Interpolation.",
            "Semantic Feature Mining for Video Event Understanding.",
            "Applying Seamful Design in Location-Based Mobile Museum Applications.",
            "Editorial: Trust Management for Multimedia Big Data.",
            "Evaluating the Privacy Risk of User-Shared Images.",
            "Enhanced User Context-Aware Reputation Measurement of Multimedia Service.",
            "Privacy-Preserving Multimedia Big Data Aggregation in Large-Scale Wireless Sensor Networks.",
            "Secure Social Multimedia Big Data Sharing Using Scalable JFE in the TSHWT Domain.",
            "Image Encryption Based on Compressive Sensing and Scrambled Index for Secure Multimedia Transmission.",
            "Robust Hashing Based on Quaternion Zernike Moments for Image Authentication.",
            "Trustworthy Authentication on Scalable Surveillance Video with Background Model Support.",
            "SecSIFT: Secure Image SIFT Feature Extraction in Cloud Computing.",
            "PPHOCFS: Privacy Preserving High-Order CFS Algorithm on the Cloud for Clustering Multimedia Data.",
            "Intercrossed Access Controls for Secure Financial Services on Multimedia Big Data in Cloud Systems.",
            "Generalized Deep Transfer Networks for Knowledge Propagation in Heterogeneous Domains.",
            "Deep Learning at Scale and at Ease.",
            "Introduction to Special Issue on Multimedia Big Data: Networking.",
            "Toward Delay-Efficient Game-Aware Data Centers for Cloud Gaming.",
            "Video Management and Resource Allocation for a Large-Scale VoD Cloud.",
            "A Deployment Optimization Scheme Over Multimedia Big Data for Large-Scale Media Streaming Application.",
            "A Tensor-Based Framework for Software-Defined Cloud Data Center.",
            "Device-to-Device Communication for Mobile Multimedia in Emerging 5G Networks.",
            "Real-Time Load Reduction in Multimedia Big Data for Mobile Internet.",
            "Performance Modelling and Analysis of Software-Defined Networking under Bursty Multimedia Traffic.",
            "Introduction to Special Issue MMSys/NOSSDAV 2015.",
            "Toward an Adaptive Screencast Platform: Measurement and Optimization.",
            "Design, Implementation, and Measurement of a Crowdsourcing-Based Content Distribution Platform.",
            "Mobile Video Streaming over Dynamic Single-Frequency Networks.",
            "A Content-Aware Video Adaptation Service to Support Mobile Video.",
            "Congestion-Aware MAC Layer Adaptation to Improve Video Telephony over Wi-Fi.",
            "Content-Adaptive Display Power Saving for Internet Video Applications on Mobile Devices."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2014",
        "info": "Volume 11: 2014/2015",
        "count": 57,
        "papers": [
            "Editorial Note.",
            "A Sketch-Based Approach for Interactive Organization of Video Clips.",
            "Circle & Search: Attribute-Aware Shoe Retrieval.",
            "A Top-Down Approach for Video Summarization.",
            "PROPANE: A Progressive Panorama Streaming Protocol to Support Interactive 3D Virtual Environment Exploration on Graphics-Constrained Devices.",
            "Up-Fusion: An Evolving Multimedia Fusion Method.",
            "Exploration in Interactive Personalized Music Recommendation: A Reinforcement Learning Approach.",
            "Online Estimation of Evolving Human Visual Interest.",
            "Introduction.",
            "Multimodal Hand and Foot Gesture Interaction for Handheld Devices.",
            "Designing Vibrotactile Codes to Communicate Verb Phrases.",
            "Multiple-Scent Enhanced Multimedia Synchronization.",
            "EEG Correlates of Pleasant and Unpleasant Odor Perception.",
            "A Generic Utility Model Representing the Quality of Sensory Experience.",
            "User Quality of Experience of Mulsemedia Applications.",
            "Integration of Multisensorial Stimuli and Multimodal Interaction in a Hybrid 3DTV System.",
            "Mulsemedia: State of the Art, Perspectives, and Challenges.",
            "Introduction to the Special Issue Best Papers of ACM Multimedia 2013.",
            "Discovering Geo-Informative Attributes for Location Recognition and Exploration.",
            "\"Wow! You Are So Beautiful Today!\".",
            "Attribute-Augmented Semantic Hierarchy: Towards a Unified Framework for Content-Based Image Retrieval.",
            "Structured Streaming Skeleton - A New Feature for Online Human Gesture Recognition.",
            "Errata for: A Framework for Network Aware Caching for Video on Demand Systems.",
            "Aesthetics-Guided Summarization from Multiple User Generated Videos.",
            "ALP: Adaptive Loss Protection Scheme with Constant Overhead for Interactive Video Applications.",
            "Beyond 1Mbps Global Overlay Live Streaming: The Case of Proxy Helpers.",
            "Social Event Classification via Boosted Multimodal Supervised Latent Dirichlet Allocation.",
            "Octree-Based 3D Logic and Computation of Spatial Relationships in Live Video Query Processing.",
            "Spatial-Temporal Tag Mining for Automatic Geospatial Video Annotation.",
            "Large-Area, Multilayered, and High-Resolution Visual Monitoring Using a Dual-Camera System.",
            "Twitter is Faster: Personalized Time-Aware Video Recommendation from Twitter to YouTube.",
            "Speaker-Following Video Subtitles.",
            "Progressive Motion Vector Clustering for Motion Estimation and Auxiliary Tracking.",
            "A 3D-HEVC Fast Mode Decision Algorithm for Real-Time Applications.",
            "Boosted Multifeature Learning for Cross-Domain Transfer.",
            "Double Verification Secret Sharing Mechanism Based on Adaptive Pixel Pair Matching.",
            "INSTRE: A New Benchmark for Instance-Level Object Retrieval and Recognition.",
            "Image Enhancement in Encrypted Domain over Cloud.",
            "Content vs. Context: Visual and Geographic Information Use in Video Landmark Retrieval.",
            "Robust Color Image Watermarking Using Geometric Invariant Quaternion Polar Harmonic Transform.",
            "Introduction to the Special Issue on MMSys 2014 and NOSSDAV 2014.",
            "CamMark: Analyzing, Modeling, and Simulating Artifacts in Camcorder Copies.",
            "Optimal Selection of Adaptive Streaming Representations.",
            "Analysis and Detection of Fake Views in Online Video Services.",
            "Scheduling a Video Transcoding Server to Save Energy.",
            "Decoder-Complexity-Aware Encoding of Motion Compensation for Multiple Heterogeneous Receivers.",
            "3DTI Amphitheater: Towards 3DTI Broadcasting.",
            "Cache-Centric Video Recommendation: An Approach to Improve the Efficiency of YouTube Caches.",
            "Parallel Massive Clustering of Discrete Distributions.",
            "Efficient MAC for Real-Time Video Streaming over Wireless LAN.",
            "Similarity Search over the Cloud Based on Image Descriptors' Dimensions Value Cardinalities.",
            "Audio Musical Dice Game: A User-Preference-Aware Medley Generating System.",
            "An Advanced Visibility Restoration Algorithm for Single Hazy Images.",
            "Cross-Platform Emerging Topic Detection and Elaboration from Multimedia Streams.",
            "QuGu: A Quality Guaranteed Video Dissemination Protocol Over Urban Vehicular Ad Hoc Networks.",
            "The Cameraman Operating My Virtual Camera is Artificial: Can the Machine Be as Good as a Human?",
            "Multi-Camera Coordination and Control in Surveillance Systems: A Survey."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2013",
        "info": "Volume 10: 2013/2014",
        "count": 37,
        "papers": [
            "Enhancing news organization for convenient retrieval and browsing.",
            "A survey of music similarity and recommendation from music context data.",
            "Detecting profilable and overlapping communities with user-generated multimedia contents in LBSNs.",
            "Secure randomized image watermarking based on singular value decomposition.",
            "Content-based copy detection through multimodal feature representation and temporal pyramid matching.",
            "Large-scale multilabel propagation based on efficient sparse graph construction.",
            "Annotation propagation in image databases using similarity graphs.",
            "MOWL: An ontology representation language for web-based multimedia applications.",
            "Introduction to the special issue of best papers of ACM MMSys 2013 and ACM NOSSDAV 2013.",
            "GamingAnywhere: The first open source cloud gaming system.",
            "User-profile-based perceived olfactory and visual media synchronization.",
            "OSM: Prioritized evolutionary QoS optimization for interactive 3D teleimmersion.",
            "Bandwidth adaptation for 3D mesh preview streaming.",
            "Bagadus: An integrated real-time system for soccer analytics.",
            "Saving disk energy in video servers by combining caching and prefetching.",
            "Dynamic load balancing in distributed virtual environments using heat diffusion.",
            "Convergence of interactive displays with smart mobile devices for effective advertising: A survey.",
            "Scalable multimedia content analysis on parallel platforms using python.",
            "High performance many-to-many intranet screen sharing with DisplayCast.",
            "A new data hiding method via revision history records on collaborative writing platforms.",
            "Memory recall based video search: Finding videos you have seen before based on your memory.",
            "Mixed image-keyword query adaptive hashing over multilabel images.",
            "Dissecting User Behaviors for a Simultaneous Live and VoD IPTV System.",
            "DIP: Distributed Identification of Polluters in P2P Live Streaming.",
            "Saving Energy in Mobile Devices for On-Demand Multimedia Streaming - A Cross-Layer Approach.",
            "A Hamming Embedding Kernel with Informative Bag-of-Visual Words for Video Semantic Indexing.",
            "Mesh Discriminative Features for 3D Steganalysis.",
            "A Quality of Experience Model for Haptic Virtual Environments.",
            "Protecting the Content Integrity of Digital Imagery with Fidelity Preservation: An Improved Version.",
            "Identifying Compression History of Wave Audio and Its Applications.",
            "Cross-Domain Multi-Event Tracking via CO-PMHT.",
            "Personalized Video Recommendation through Graph Propagation.",
            "Understanding Video Sharing Propagation in Social Networks: Measurement and Analysis.",
            "Bilateral Correspondence Model for Words-and-Pictures Association in Multimedia-Rich Microblogs.",
            "Fast Near-Duplicate Image Detection Using Uniform Randomized Trees.",
            "Personalized Photograph Ranking and Selection System Considering Positive and Negative User Feedback.",
            "Placing Videos on a Semantic Hierarchy for Search Result Navigation."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 53,
        "papers": [
            "Procedural content generation for games: A survey.",
            "Image retrieval with query-adaptive hashing.",
            "GPSView: A scenic driving route planner.",
            "SIFT match verification by geometric coding for large-scale partial-duplicate web image search.",
            "Identification of scene locations from geotagged images.",
            "Region- and action-aware virtual world clients.",
            "Spider: A system for finding 3D video copies.",
            "Web-accessible geographic integration and calibration of webcams.",
            "Human perception of haptic-to-video and haptic-to-audio skew in multimedia applications.",
            "A reward-and-punishment-based approach for concept detection using adaptive ontology rules.",
            "Identity verification based on handwritten signatures with haptic information using genetic programming.",
            "Multifeature analysis and semantic context learning for image classification.",
            "Modeling the effect of user interactions on mesh-based P2P VoD streaming systems.",
            "Effective transfer tagging from image to video.",
            "APRICOD: An access-pattern-driven distributed caching middleware for fast content discovery of noncontinuous media access.",
            "Near-lossless semantic video summarization and its applications to video analysis.",
            "Information recall task impact in olfaction-enhanced multimedia.",
            "A conditional access system with efficient key distribution and revocation for mobile pay-TV systems.",
            "A generalized tamper localization approach for reversible watermarking algorithms.",
            "A self-similarity approach to repairing large dropouts of streamed music.",
            "Interactive partner control in close interactions for real-time applications.",
            "Editorial: Reviewers.",
            "Privacy preserving continuous multimedia streaming in MANETs.",
            "Robust image annotation via simultaneous feature and sample outlier pursuit.",
            "Hybrid method based on topography for robust detection of iris center and eye corners.",
            "Exploiting content relevance and social relevance for personalized ad recommendation on internet TV.",
            "Mobile haptic e-book system to support 3D immersive reading in ubiquitous environments.",
            "Towards decrypting attractiveness via multi-modality cues.",
            "Towards optimizing human labeling for interactive image tagging.",
            "A framework for network aware caching for video on demand systems.",
            "Editorial note.",
            "Introduction to the special section on the 20th anniversary of the ACM international conference on multimedia.",
            "Two decades of internet video streaming: A retrospective view.",
            "Evolution of temporal multimedia synchronization principles: A historical viewpoint.",
            "Socially-aware multimedia authoring: Past, present, and future.",
            "Image search - from thousands to billions in 20 years.",
            "Looking forward 10 years to multimedia successes.",
            "Multimedia systems research: The first twenty years and lessons for the next twenty.",
            "Online video delivery: Past, present, and future.",
            "Are we in the middle of a video streaming revolution?",
            "Advances in immersive communication: (1) Telephone, (2) Television, (3) Teleportation.",
            "How far we've come: Impact of 20 years of multimedia information retrieval.",
            "A personal look back at twenty years of research in multimedia content analysis.",
            "Multimedia retrieval that matters.",
            "Over twenty years of eigenfaces.",
            "Care and scale: Fifteen years of music retrieval.",
            "Navigating the worldwide community of photos.",
            "Exploiting unconscious user signals in multimodal human-computer interaction.",
            "Experiential media systems.",
            "Introduction to the special section of best papers of ACM multimedia 2012.",
            "Robust and accurate mobile visual localization and its applications.",
            "Propagation-based social-aware multimedia content distribution.",
            "Social influence analysis and application on multimedia sharing websites."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 56,
        "papers": [
            "Editorial note and call for nominations: Nicolas D. Georganas best paper award.",
            "The sweet smell of success: Enhancing multimedia applications with olfaction.",
            "Design and evaluation of a testbed for mobile TV networks.",
            "Discovering multirelational structure in social media streams.",
            "Exploring interest correlation for peer-to-peer socialized video sharing.",
            "ImageSense: Towards contextual image advertising.",
            "Fusing multiple video sensors for surveillance.",
            "Towards an automatic music arrangement framework using score reduction.",
            "Editorial note.",
            "Building an efficient transcoding overlay for P2P streaming to heterogeneous devices.",
            "ISP-friendly P2P live streaming: A roadmap to realization.",
            "Quality of data delivery in peer-to-peer video streaming.",
            "Diagnosing network-wide P2P live streaming inefficiencies.",
            "Auction-based P2P VoD streaming: Incentives and optimal scheduling.",
            "Providing hierarchical lookup service for P2P-VoD systems.",
            "Table of Contents: Online Supplement Volume 8S, Number 1.",
            "Image registration for foveated panoramic sensing.",
            "Comparison of predictive contract mechanisms from an information theory perspective.",
            "Interactive television news.",
            "REED: Optimizing first person shooter game server discovery using network coordinates.",
            "Image label completion by pursuing contextual decomposability.",
            "Sprite generation using sprite fusion.",
            "Collaborative video reindexing via matrix factorization.",
            "Video streaming using a location-based bandwidth-lookup service for bitrate planning.",
            "Automatic evaluation of video summaries.",
            "Sparse transfer learning for interactive video search reranking.",
            "An information-based dynamic extrapolation model for networked virtual environments.",
            "A unified context model for web image retrieval.",
            "A control theoretic scheme for efficient video transmission over IEEE 802.11e EDCA WLANs.",
            "A joint layered scheme for reliable and secure mobile JPEG-2000 streaming.",
            "Introduction to special issue on multimedia security.",
            "Image hatching for visual cryptography.",
            "Reference index-based H.264 video watermarking scheme.",
            "A robust high-capacity affine-transformation-invariant scheme for watermarking 3D geometric models.",
            "Exposing MP3 audio forgeries using frame offsets.",
            "A collusion attack optimization strategy for digital fingerprinting.",
            "Aggregate licenses validation for digital rights violation detection.",
            "Introduction to the special section of best papers of ACM multimedia 2011.",
            "CZLoD: A psychophysical approach for 3D tele-immersive video.",
            "Active query sensing: Suggesting the best query view for mobile visual search.",
            "Introduction to special section on 3D mobile multimedia.",
            "QoE-oriented 3D video transcoding for mobile streaming.",
            "A novel 3D video transcoding scheme for adaptive 3D video transmission to heterogeneous terminals.",
            "A new methodology to derive objective quality assessment metrics for scalable multiview 3D video coding.",
            "Energy-efficient multicasting of multiview 3D videos to mobile devices.",
            "A real-time remote rendering system for interactive mobile graphics.",
            "Efficient matchings and mobile augmented reality.",
            "Table of contents: Online supplement volume 8, number 2s, online supplement volume 8, number 3s.",
            "Editorial.",
            "Label-to-region with continuity-biased bi-layer sparsity priors.",
            "Efficient targeted search using a focus and context video browser.",
            "User perception of media content association in olfaction-enhanced multimedia.",
            "NextSlidePlease: Authoring and delivering agile multimedia presentations.",
            "Object-based image retrieval with kernel on adjacency matrix and local combined features.",
            "In-video product annotation with web information mining.",
            "Algorithms for stochastic optimization of multicast content delivery with network coding."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 39,
        "papers": [
            "Multigranularity reuse of learning resources.",
            "SMIL builder: An incremental authoring tool for SMIL Documents.",
            "Modeling and assessing quality of information in multisensor multimedia monitoring systems.",
            "Near-duplicate keyframe retrieval by semi-supervised learning and nonrigid image matching.",
            "A framework for cross-layer optimization of video streaming in wireless networks.",
            "An empirical analysis of serendipitous media sharing among campus-wide wireless users.",
            "Optimal layered multicast.",
            "Using simulcast and scalable video coding to efficiently control channel switching delay in mobile tv broadcast networks.",
            "Knowledge discovery from 3D human motion streams through semantic dimensional reduction.",
            "Modeling progressive mesh streaming: Does data dependency matter?",
            "A fuzzy algorithm for dynamically adaptive multimedia streaming.",
            "Statistical multiplexing of variable-bit-rate videos streamed to mobile devices.",
            "Editorial notice.",
            "Video quality for face detection, recognition, and tracking.",
            "Protecting the content integrity of digital imagery with fidelity preservation.",
            "Selecting vantage objects for similarity indexing.",
            "Supporting region-of-interest cropping through constrained compression.",
            "Derivative-based audio steganalysis.",
            "Game-on-demand: : An online game engine based on geometry streaming.",
            "Introduction to ACM multimedia 2010 best paper candidates.",
            "A holistic approach to aesthetic enhancement of photographs.",
            "Using rich social media information for music recommendation via hypergraph model.",
            "A cognitive approach for effective coding and transmission of 3D video.",
            "Video accessibility enhancement for hearing-impaired users.",
            "Introduction to special issue on social media.",
            "Exploiting online music tags for music emotion classification.",
            "Automatic creation of photo books from stories in social media.",
            "Recognition of adult images, videos, and web page bags.",
            "SCENT: Scalable compressed monitoring of evolving multirelational social networks.",
            "Browse by chunks: Topic mining and organizing on web-scale social media.",
            "Mining flickr landmarks by modeling reconstruction sparsity.",
            "Contextual tag inference.",
            "VlogSense: Conversational behavior and social attention in YouTube.",
            "Beyond search: Event-driven summarization for web videos.",
            "Traffic prediction and QoS transmission of real-time live VBR videos in WLANs.",
            "Beat space segmentation and octave scale cepstral feature for sung language recognition in pop music.",
            "Efficient computation of queries on feature streams.",
            "Interactive films and coconstruction.",
            "Domical cooperative caching for streaming media in wireless home networks."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2010",
        "info": "Volume 6: 2010",
        "count": 30,
        "papers": [
            "Server selection in large-scale video-on-demand systems.",
            "Blind robust watermarking of 3d motion data.",
            "DSI: A model for distributed multimedia semantic indexing and content integration.",
            "Effect of compressed offline foveated video on viewing behavior and subjective quality.",
            "Real-time H.264 video encoding in software with fast mode decision and dynamic complexity control.",
            "Authentication schemes for multimedia streams: Quantitative analysis and comparison.",
            "Enabling multi-party 3D tele-immersive environments with ViewCast.",
            "An eye localization, tracking and blink pattern recognition system: Algorithm and evaluation.",
            "Detecting malicious nodes in peer-to-peer streaming by peer-based monitoring.",
            "Fast min-hashing indexing and robust spatio-temporal matching for detecting video copies.",
            "Waiting-time prediction in scalable on-demand video streaming.",
            "Introduction to the best papers of ACM multimedia 2009.",
            "Visual query suggestion: Towards capturing user intent in internet image search.",
            "Audio-visual atoms for generic video concept classification.",
            "Looking at near-duplicate videos from a human-centric perspective.",
            "LiveSky: Enhancing CDN with P2P.",
            "ELVIS: Entertainment-led video summaries.",
            "Semi-supervised distance metric learning for collaborative image retrieval and clustering.",
            "Word level automatic alignment of music and lyrics using vocal synthesis.",
            "Efficient delivery of on-demand video streams to heterogeneous receivers.",
            "Source traffic analysis.",
            "Obituary to our dear friend professor Dr. Nicolas D. Georganas, PhD.",
            "Foreword to the special issue on multimedia sensor fusion.",
            "MultiFusion: A boosting approach for multimedia fusion.",
            "Multimedia sensor fusion for retrieving identity in biometric access control systems.",
            "Dialocalization: Acoustic speaker diarization and visual localization as joint optimization problem.",
            "Spatial-geometric approach to physical mobile interaction based on accelerometer and IR sensory data fusion.",
            "Enabling multiparty 3D tele-immersive environments with ViewCast.",
            "Optimizing consistency by maximizing bandwidth usage in distributed interactive applications.",
            "Understanding overlay characteristics of a large-scale peer-to-peer IPTV system."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2008",
        "info": "Volume 5: 2008/2009",
        "count": 31,
        "papers": [
            "Special section from the ACM multimedia conference 2007.",
            "Re-cinematography: Improving the camerawork of casual video.",
            "Correlative multilabel video annotation with temporal kernels.",
            "A dynamic decision network framework for online media adaptation in stroke rehabilitation.",
            "Equipment allocation in video-on-demand network deployments.",
            "Nuisance level of a voice call.",
            "Constructing visual phrases for effective and efficient object-based image retrieval.",
            "Scalable on-demand media streaming for heterogeneous clients.",
            "ScaleFFS: A scalable log-structured flash file system for mobile multimedia systems.",
            "Dynamic privacy assessment in a smart house environment using multimodal sensing.",
            "Sensing and using social context.",
            "Invisible watermarking based on creation and robust insertion-extraction of image adaptive watermarks.",
            "Offering data confidentiality for multimedia overlay multicast: Design and analysis.",
            "Estimation of certainty for responses to multiple-choice questionnaires using eye movements.",
            "Authoring, viewing, and generating hypervideo: An overview of Hyper-Hitchcock.",
            "End-to-end delay control of multimedia applications over multihop wireless links.",
            "A criterion-based multilayer access control approach for multimedia applications and the implementation considerations.",
            "Introduction to the special section for the best papers of ACM multimedia 2008.",
            "Fragment, tag, enrich, and send: Enhancing social sharing of video.",
            "The big picture on small screens delivering acceptable video quality in mobile TV.",
            "Compact and progressive plant models for streaming in networked virtual environments.",
            "Client-centered multimedia content adaptation.",
            "Design of multimedia surveillance systems.",
            "SEVA: Sensor-enhanced video annotation.",
            "Multipath live streaming via TCP: Scheme, performance and benefits.",
            "Playout buffer and rate optimization for streaming over IEEE 802.11 wireless networks.",
            "Music-driven character animation.",
            "A study of content authentication in proxy-enabled multimedia delivery systems: Model, techniques, and applications.",
            "Touchable 3D video system.",
            "Video interactions in online video social networks.",
            "Improving the extraction of bilingual terminology from Wikipedia."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 28,
        "papers": [
            "Incorporating feature hierarchy and boosting to achieve more effective classifier training and concept-oriented video summarization and skimming.",
            "Rate-distortion optimized streaming of fine-grained scalable video sequences.",
            "Video quality estimation in wireless IP networks: Algorithms and applications.",
            "Partial query resolution for animation authoring.",
            "A revenue-rewarding scheme of providing incentive for cooperative proxy caching for media streaming systems.",
            "An automated end-to-end lecture capture and broadcasting system.",
            "Optimization of interactive visual-similarity-based search.",
            "Hierarchical video patching with optimal server bandwidth.",
            "Achieving simultaneous distribution control and privacy protection for Internet media delivery.",
            "Feature synthesized EM algorithm for image retrieval.",
            "Audio keywords generation for sports video analysis.",
            "Multimedia streaming using multiple TCP connections.",
            "A scalable and extensible segment-event-object-based sports video retrieval system.",
            "Distributed musical performances: Architecture and stream management.",
            "On the accuracy and complexity of rate-distortion models for fine-grained scalable video sequences.",
            "Multimedia streaming via TCP: An analytic performance study.",
            "A neural-network-based context-aware handoff algorithm for multimedia computing.",
            "Towards attention-centered interfaces: An aesthetic evaluation of perspective with eye tracking.",
            "Exploring large-scale peer-to-peer live streaming topologies.",
            "Low-latency adaptive streaming over tcp.",
            "Data placement and prefetching with accurate bit rate control for interactive media server.",
            "Video game design using an eye-movement-dependent model of visual attention.",
            "Predictive real-time perceptual compression based on eye-gaze-position analysis.",
            "Introduction to special issue: Human-centered television - directions in interactive digital television research.",
            "Interactive TV narratives: Opportunities, progress, and challenges.",
            "GridCast: Improving peer sharing for P2P VoD.",
            "Examining presence and lightweight messaging in a social television experience.",
            "Watch-and-comment as a paradigm toward ubiquitous interactive video editing."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 27,
        "papers": [
            "Content-adaptive digital music watermarking based on music structure analysis.",
            "Goal-oriented optimal subset selection of correlated multimedia streams.",
            "Video abstraction: A systematic review and classification.",
            "Virtual videography.",
            "Multimedia simplification for optimized MMS synthesis.",
            "Detecting social interactions of the elderly in a nursing home environment.",
            "Computational approaches to temporal sampling of video sequences.",
            "Online audio background determination for complex audio environments.",
            "A piano duo support system for parents to lead children to practice musical performances.",
            "Clustering and searching WWW images using link and page layout analysis.",
            "A narrative-based abstraction framework for story-oriented video.",
            "Ubiquitous device personalization and use: The next generation of IP multimedia communications.",
            "Exploring many-to-one speech-to-text correlation for web-based language learning.",
            "Efficient sampling of training set in large and noisy multimedia data.",
            "Critical causal order of events in distributed virtual environments.",
            "Segmentation and recognition of motion streams by similarity search.",
            "An open architecture for transport-level protocol coordination in distributed multimedia applications.",
            "Robust content-based MPEG-4 XMT scene structure authentication and multimedia content location.",
            "Introduction to special issue on eye-tracking applications in multimedia systems.",
            "Robust tracking and remapping of eye appearance with passive computer vision.",
            "Using geometric properties of topographic manifold to detect and track eyes for human-computer interaction.",
            "Towards efficient context-specific video coding based on gaze-tracking analysis.",
            "Detecting eye fixations by projection clustering.",
            "Foveated gaze-contingent displays for peripheral LOD management, 3D visualization, and stereo imaging.",
            "How late can you update gaze-contingent multiresolutional displays without detection?.",
            "An assessment of eye-gaze potential within immersive virtual environments.",
            "The conductor interaction method."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 18,
        "papers": [
            "Content-based multimedia information retrieval: State of the art and challenges.",
            "Content-based retrieval of 3D models.",
            "Fusion of AV features and external information sources for event detection in team sports video.",
            "The Story Picturing Engine - a system for automatic text illustration.",
            "Learning rich semantics from news video archives by style analysis.",
            "Smooth and efficient real-time video transport in the presence of wireless errors.",
            "Automatic summarization of music videos.",
            "Real-time video content analysis: QoS-aware application composition and parallel processing.",
            "Introduction to special issue on the use of context in multimedia information systems.",
            "A Semantic Web ontology for context-based classification and retrieval of music resources.",
            "Handling multiple points of view in a multimedia data warehouse.",
            "Modeling context in haptic perception, rendering, and visualization.",
            "Defining user perception of distributed multimedia quality.",
            "Statistical admission control using delay distribution measurements.",
            "Middleware for streaming 3D progressive meshes over lossy networks.",
            "Process prioritization using output production: Scheduling for multimedia.",
            "A graphics architecture for high-end interactive television terminals.",
            "Metadata handling: A video perspective."
        ]
    },
    {
        "name": "ACM Transactions on Multimedia Computing, Communications and Applications",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 20,
        "papers": [
            "The birth of the ACM transactions on multimedia computing, communications and applications (TOMCCAP).",
            "ACM SIGMM retreat report on future directions in multimedia research.",
            "Guest editorial: the international ACM Multimedia conference 1993 - ten years after.",
            "Salient stills.",
            "Disk scheduling in a multimedia I/O system.",
            "Automatic temporal layout mechanisms revisited.",
            "Structured multimedia authoring.",
            "The berkeley software MPEG-1 video decoder.",
            "Selected papers from the ACM multimedia conference 2003.",
            "Real-time multidepth stream compression.",
            "Panoptes: scalable low-power video sensor networking technologies.",
            "Semantics and feature discovery via confidence-based ensemble.",
            "Understanding performance in coliseum, an immersive videoconferencing system.",
            "IMCE: Integrated media creation environment.",
            "Flexible cross-domain event delivery for quality-managed multimedia applications.",
            "Temporal event clustering for digital photo collections.",
            "Coordinated enroute multimedia object caching in transcoding proxies for tree networks.",
            "Adjusting forward error correction with temporal scaling for TCP-friendly streaming MPEG.",
            "Layered unequal loss protection with pre-interleaving for fast progressive image transmission over packet-loss channels.",
            "An analytical study of peer-to-peer media streaming systems."
        ]
    }
]