[
    {
        "name": "Ad hoc Networks",
        "year": "2022",
        "info": "2022: Volumes\n124,\n125,\n126,\n127,\n128,\n129,",
        "count": 43,
        "papers": [
            "Survey and taxonomy of information-centric vehicular networking security attacks.",
            "A cooperative crowdsensing system based on flying and ground vehicles to control respiratory viral disease outbreaks.",
            "Computation offloading in D2D-enabled MCC for precedence-constrained components.",
            "A secure and efficient certificateless signature scheme for Internet of Things.",
            "Li-Wi: An upper layer hybrid VLC-WiFi network handover solution.",
            "A realistic relay selection scheme for cooperative MIMO networks.",
            "Dynamic Programming based Low-Latency Schedule (DPLLS) for 6TiSCH networks.",
            "On the Rate and Age of Information for non-preemptive systems with prioritized arrivals and deterministic packet deadlines in IoT networks.",
            "Smart adaptive collision avoidance for IEEE 802.11.",
            "A collaborative deep learning microservice for backdoor defenses in Industrial IoT networks.",
            "A comprehensive survey on clustering in vehicular networks: Current solutions and future challenges.",
            "Distributed sparsity-based non-linear regression with multiple kernels in wireless sensor networks.",
            "A Survey on Mobility in Wireless Sensor Networks.",
            "Survey on Enterprise Internet-of-Things systems (E-IoT): A security perspective.",
            "Efficient configuration for multi-objective QoS optimization in wireless sensor network.",
            "Experimental testbed evaluation of cell level indoor localization algorithm using Wi-Fi and LoRa protocols.",
            "Towards a robust FANET: Distributed node importance estimation-based connectivity maintenance for UAV swarms.",
            "Secure resource management in beyond 5G heterogeneous networks with decoupled access.",
            "A replication strategy for mobile opportunistic networks based on utility clustering.",
            "AI-enabled privacy-preservation phrase with multi-keyword ranked searching for sustainable edge-cloud networks in the era of industrial IoT.",
            "Analytical models for randomized neighbor discovery protocols based on collision detection in wireless ad hoc networks.",
            "Water quality prediction on a Sigfox-compliant IoT device: The road ahead of WaterS.",
            "Artificial intelligence-aided privacy preserving trustworthy computation and communication in 5G-based IoT networks.",
            "Distribution of multi-hop latency for probabilistic broadcasting protocols in grid-based Wireless Sensor Networks.",
            "A low-latency and reliable multihop D2D transmissions scheduling algorithm for guaranteed message dissemination.",
            "Charger and receiver deployment with delay constraint in mobile wireless rechargeable sensor networks.",
            "Deep embedded median clustering for routing misbehaviour and attacks detection in ad-hoc networks.",
            "Optimal IoT-based decision-making of smart grid dispatchable generation units using blockchain technology considering high uncertainty of system.",
            "Energy-efficient and balanced routing in low-power wireless sensor networks for data collection.",
            "A secure three-factor authentication scheme for multi-gateway wireless sensor networks based on elliptic curve cryptography.",
            "Dynamic Compressive Data Gathering using Angle-based Random Walk in Hybrid WSNs.",
            "Visibility graph entropy based radiometric feature for physical layer identification.",
            "An optimized message routing approach inspired by the landlord-peasants game in disruption-tolerant networks.",
            "A privacy-preserving authentication scheme based on Elliptic Curve Cryptography and using Quotient Filter in fog-enabled VANET.",
            "Performance evaluation of CNN-based pedestrian detectors for autonomous vehicles.",
            "Data analytics of social media 3.0: Privacy protection perspectives for integrating social media and Internet of Things (SM-IoT) systems.",
            "Covert communication in multi-hop UAV network.",
            "Knapsack Cipher-based metaheuristic optimization algorithms for cryptanalysis in blockchain-enabled internet of things systems.",
            "Positioning aerial relays to maintain connectivity during drone team missions.",
            "Deep convolutional recurrent model for region recommendation with spatial and temporal contexts.",
            "Connectivity invariant lightweight resiliency improvement strategies for CRT-subset scheme.",
            "Investigation on vulnerabilities, threats and attacks prohibiting UAVs charging and depleting UAVs batteries: Assessments & countermeasures.",
            "Channel assignment and users mobility influence on primary users QoE in Cognitive Radio Network."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2021",
        "info": "2021: Volumes\n110,\n111,\n112,\n113,\n114,\n115,\n116,\n117,\n118,\n119,\n120,\n121,\n122,\n123",
        "count": 164,
        "papers": [
            "A deep reinforcement learning-based on-demand charging algorithm for wireless rechargeable sensor networks.",
            "Dynamic directional routing for mobile wireless sensor networks.",
            "Differential privacy protection on weighted graph in wireless networks.",
            "Dynamically occluded samples via adversarial learning for person re-identification in sensor networks.",
            "Energy efficient cluster based routing protocol for WSN using butterfly optimization algorithm and ant colony optimization.",
            "Blockchain incentivized data forwarding in MANETs: Strategies and challenges.",
            "A city-wide experimental testbed for the next generation wireless networks.",
            "On migratable traffic risk estimation in urban sensing: A social sensing based deep transfer network approach.",
            "Special issue on \"performance evaluation, modeling and analysis of wireless Ad-Hoc networks\".",
            "A Comprehensive Review of Unmanned Aerial Vehicle Attacks and Neutralization Techniques.",
            "Unsupervised concept drift detection based on multi-scale slide windows.",
            "Improved unsupervised coloring algorithm for spectrum allocation in multiple wireless body area networks.",
            "An enhanced nonlinear iterative localization algorithm for DV_Hop with uniform calculation criterion.",
            "Adaptive multi-PHY IEEE802.15.4 TSCH in sub-GHz industrial wireless networks.",
            "Quality of information with minimum requirements for emergency communications.",
            "BSCF: Learning background suppressed correlation filter tracker for wireless multimedia sensor networks.",
            "Energy balancing in mobile opportunistic networks with wireless charging: Single and multi-hop approaches.",
            "Explaining the Behavior of Neuron Activations in Deep Neural Networks.",
            "HDDS: Hierarchical Data Dissemination Strategy for energy optimization in dynamic wireless sensor network under harsh environments.",
            "Multiplex Fourier ptychographic reconstruction with model-based neural network for Internet of Things.",
            "An overview of massive MIMO localization techniques in wireless cellular networks: Recent advances and outlook.",
            "Design and implementation of beamformed physical downlink control channel for 4G massive MIMO systems.",
            "Partner selection in self-organised wireless sensor networks for opportunistic energy negotiation: A multi-armed bandit based approach.",
            "An accurate and easy deployment array gain-phase error calibration method for DoA estimation in Wi-Fi network.",
            "M-GBDT2NN: A more generalized framework of GBDT2NN for online update.",
            "Salient object detection on hyperspectral images in wireless network using CNN and saliency optimization.",
            "Spatio-temporal multi-factor model for individual identification from biological motion.",
            "Channel characteristics aware zero knowledge proof based authentication scheme in body area networks.",
            "EnCoCo-RED: Enhanced congestion control mechanism for CoAP observe group communication.",
            "On-demand vehicle-assisted charging in wireless rechargeable sensor networks.",
            "CR-IoTNet: Machine learning based joint spectrum sensing and allocation for cognitive radio enabled IoT cellular networks.",
            "A decision-making scheme for UAV maximizes coverage of emergency indoor and outdoor users.",
            "Utilizing VANETs as supplementary communication infrastructure for delay-tolerant bulky data transportation.",
            "LTE-V2X Mode 3 scheduling based on adaptive spatial reuse of radio resources.",
            "Foreground-aware Siamese tracker with dynamic template in wireless sensor networks.",
            "VOCkit: A low-cost IoT sensing platform for volatile organic compound classification.",
            "Exploiting scene and body contexts in controlling continuous vision body cameras.",
            "VDARN: Video Disentangling Attentive Relation Network for Few-Shot and Zero-Shot Action Recognition.",
            "Recommending irregular regions using graph attentive networks.",
            "Disentangling style on dynamic aligned poses for individual identification.",
            "QoS-aware routing protocol for Cognitive Radio Ad Hoc Networks.",
            "Next generation opportunistic networking in beyond 5G networks.",
            "Energy efficient multipath ant colony based routing algorithm for mobile ad hoc networks.",
            "Low-light image joint enhancement optimization algorithm based on frame accumulation and multi-scale Retinex.",
            "TRFR: A ternary relation link prediction framework on Knowledge graphs.",
            "Range-free localization using Reliable Anchor Pair Selection and Quantum-behaved Salp Swarm Algorithm for anisotropic Wireless Sensor Networks.",
            "An efficient partial charging scheme using multiple mobile chargers in wireless rechargeable sensor networks.",
            "Trusted and secured D2D-aided communications in 5G networks.",
            "A comprehensive survey on LEACH-based clustering routing protocols in Wireless Sensor Networks.",
            "Investigation & Mitigation of the Energy Efficiency Impact of Node Resets in RPL.",
            "Relay selection in millimeter wave D2D communications through obstacle learning.",
            "ODeSe: On-Demand Selection for multi-path RPL networks.",
            "Outperforming RPL with scalable routing based on meaningful MAC addressing.",
            "Low data regimes in extreme climates: Foliage penetration personnel detection using a wireless network-based device-free sensing approach.",
            "Design and performance analysis of joint control and shared channel scheduler for downlink in 3GPP narrowband-IoT.",
            "Network lifetime enhancement of WSNs using correlation model and node selection algorithm.",
            "A new deep learning-based distance and position estimation model for range-based indoor localization systems.",
            "Differentially Private Double Auction with Reliability-Aware in Mobile Crowd Sensing.",
            "Quick and efficient network access schemes for IoT devices.",
            "Scalable and fair resource sharing among 5G D2D users and legacy 4G users: A game theoretic approach.",
            "Practical server-side WiFi-based indoor localization: Addressing cardinality & outlier challenges for improved occupancy estimation.",
            "An automated lightweight encryption scheme for secure and energy-efficient communication in wireless sensor networks.",
            "A Markov model for performance evaluation of channel bonding in IEEE 802.11.",
            "A Markov model for IEEE 802.15.4 MAC protocol with energy-efficient GTS utilization under saturated and unsaturated traffic conditions.",
            "A novel optimization method for WSN based on mixed matrix decomposition of NMF and 2-SVD-QR.",
            "Semi-supervised subject recognition in low-modal sensor data.",
            "Throughput-aware path planning for UAVs in D2D 5G networks.",
            "Geometric least square curve fitting method for localization of wireless sensor network.",
            "Gated recurrent unit-based parallel network traffic anomaly detection using subagging ensembles.",
            "Joint trajectory and transmission optimization for energy efficient UAV enabled eLAA network.",
            "A multi-hop routing protocol based on link state prediction for intra-body Wireless Nanosensor Networks.",
            "An enhanced energy proficient clustering (EEPC) algorithm for relay selection in heterogeneous WSNs.",
            "Cooperative Spectrum Sharing in Spectrum Domain with Discrete Time Energy Harvesting for Primary User.",
            "Human tracking and identification through a millimeter wave radar.",
            "Load balancing for RPL-based Internet of Things: A review.",
            "Energy-aware node selection scheme with friendly jamming technique for enhancing the secrecy of wireless powered sensor networks.",
            "Constructing virtual backbone with guaranteed routing cost in Wireless Sensor Networks.",
            "Transmission capacity analysis of relay-assisted D2D cellular networks with interference cancellation.",
            "A combined online-learning model with K-means clustering and GRU neural networks for trajectory prediction.",
            "Energy-efficient decentralized navigation of a team of solar-powered UAVs for collaborative eavesdropping on a mobile ground target in urban environments.",
            "Methods of improving Secrecy Transmission Capacity in wireless random networks.",
            "Robust and auditable distributed data storage with scalability in edge computing.",
            "A dynamic multi-sink routing protocol for static and mobile self-organizing wireless networks: A routing protocol for Internet of Things.",
            "Servo relays as distributed controllable-mobility network to maintain long-term stable links for mobile robot swarms.",
            "A blockchain-enabled relay selection for QoS-OLSR in urban VANET: A Stackelberg game model.",
            "Green internet of things using UAVs in B5G networks: A review of applications and strategies.",
            "GCS: Collaborative video cache management strategy in multi-access edge computing.",
            "On improving the cooperative localization performance for IoT WSNs.",
            "Energy-efficient and solar powered mission planning of UAV swarms to reduce the coverage gap in rural areas: The 3D case.",
            "An energy efficient IoD static and dynamic collision avoidance approach based on gradient optimization.",
            "Study of the influence of human subject on the indoor channel using compact UWB directive/omni-directional antennas for wireless sensor network applications.",
            "Physical layer secret key generation using discrete wavelet packet transform.",
            "Joint traffic-aware UAV placement and predictive routing for aerial networks.",
            "Adaptive time offset compensation for TDMA industrial wireless networks.",
            "IoT-based data-driven fault allocation in microgrids using advanced µPMUs.",
            "An optimized transaction verification method for trustworthy blockchain-enabled IIoT.",
            "A blockchain and deep neural networks-based secure framework for enhanced crop protection.",
            "ADAPT: An Adaptive Directional Antenna Protocol for medium access control in Terahertz communication networks.",
            "Privacy reinforcement learning for faults detection in the smart grid.",
            "Q-learning-Based Opportunistic Routing with an on-site architecture in UASNs.",
            "Task-driven charger placement and power allocation for wireless sensor networks.",
            "Interference management for coexisting Internet of Things networks over unlicensed spectrum.",
            "Joint service placement and request routing in mobile edge computing.",
            "An adaptive backoff and dynamic clear channel assessment mechanisms in IEEE 802.15.4 MAC for wireless body area networks.",
            "Effective malware detection scheme based on classified behavior graph in IIoT.",
            "Geographic Position based Hopless Opportunistic Routing for UAV networks.",
            "Developing novel low complexity models using received in-phase and quadrature-phase samples for interference detection and classification in Wireless Sensor Network and GPS edge devices.",
            "Maximum lifetime convergecast tree in wireless sensor networks.",
            "Deep Q-network based fog node offloading strategy for 5 G vehicular Adhoc Network.",
            "Federated learning for drone authentication.",
            "Trends and challenges in energy-efficient UAV networks.",
            "Editorial for special issue on \"D-Sense: Algorithms, systems and applications of distributed sensing\".",
            "Newly engineered energy-based features for supervised anomaly detection in a physical model of a water supply system.",
            "REFLOOD: Reactive routing protocol for wake-up radio in IoT.",
            "Buffer-aided relay selection for secure communication in two-hop wireless networks with limited packet lifetime.",
            "Robust Deep Identification using ECG and Multimodal Biometrics for Industrial Internet of Things.",
            "A novel Network Partitioning Attack against Routing Protocol in Internet of Things.",
            "SPY-BOT: Machine learning-enabled post filtering for Social Network-Integrated Industrial Internet of Things.",
            "Energy Efficient Routing for Wireless Mesh Networks with Directional Antennas: When Q-learning meets Ant systems.",
            "Joint robust 3D trajectory and communication design for dual-UAV enabled secure communications in probabilistic LoS channel.",
            "Multi-label active learning from crowds for secure IIoT.",
            "Resource management in UAV-assisted wireless networks: An optimization perspective.",
            "Anomaly detection framework to prevent DDoS attack in fog empowered IoT networks.",
            "Trustworthy authorization method for security in Industrial Internet of Things.",
            "Multimedia traffic classification with mixture of Markov components.",
            "Generative adversarial network to detect unseen Internet of Things malware.",
            "Adaptive priority-aware LoRaWAN resource allocation for Internet of Things applications.",
            "An extensive survey on the Internet of Drones.",
            "Dwell time estimation at intersections for improved vehicular micro cloud operations.",
            "DIVE: A distributed ID assignment and topology discovery protocol for underwater acoustic networks.",
            "High-integrity based cooperative file transmission at urban intersections using pure V2V communication.",
            "Modeling and simulation of secure connectivity and hop count of multi-hop ad-hoc wireless networks with colluding and non-colluding eavesdroppers.",
            "ECU-IoHT: A dataset for analyzing cyberattacks in Internet of Health Things.",
            "Energy-aware system design for batteryless LPWAN devices in IoT applications.",
            "Do not get fooled: Defense against the one-pixel attack to protect IoT-enabled Deep Learning systems.",
            "Travel Hopping Enabled Resource Allocation (THEResA) and delay tolerant networking through the use of UAVs in railroad networks.",
            "A novel auxiliary hole localization algorithm based on multidimensional scaling for wireless sensor networks in complex terrain with holes.",
            "Collaborative advanced machine learning techniques in optimal energy management of hybrid AC/DC IoT-based microgrids.",
            "Energy-efficient coverage optimization in wireless sensor networks based on Voronoi-Glowworm Swarm Optimization-K-means algorithm.",
            "An incentive mechanism based on a Stackelberg game for mobile crowdsensing systems with budget constraint.",
            "Deep learning-driven opportunistic spectrum access (OSA) framework for cognitive 5G and beyond 5G (B5G) networks.",
            "Swarm intelligence inspired meta-heuristics for solving multi-constraint QoS path problem in vehicular ad hoc networks.",
            "D2D routing aided networking for efficient energy consumption management of wireless IoT.",
            "UWB-MAC: MAC protocol for UWB localization using ultra-low power anchor nodes.",
            "A dynamic task offloading algorithm based on greedy matching in vehicle network.",
            "Explainable artificial intelligence to evaluate industrial internal security using EEG signals in IoT framework.",
            "A reliable deep learning-based algorithm design for IoT load identification in smart grid.",
            "Semi-Markov model for delivery delay prediction in multi-copy opportunistic networks with heterogeneous pairwise encounter rates.",
            "Newton-interpolation-based zk-SNARK for Artificial Internet of Things.",
            "Hybrid RNN-LSTM deep learning model applied to a fuzzy based wind turbine data uncertainty quantization method.",
            "Deep Learning-Based Reliable Routing Attack Detection Mechanism for Industrial Internet of Things.",
            "Routing in Delay-Tolerant Networks under uncertain contact plans.",
            "DIVINE: Data offloading in vehicular networks with QoS provisioning.",
            "Machine learning for 5G security: Architecture, recent advances, and challenges.",
            "An energy optimized and QoS concerned data gathering protocol for wireless sensor network using variable dimensional PSO.",
            "A privacy-preserving route planning scheme for the Internet of Vehicles.",
            "Physical layer authentication for extending battery life.",
            "Role of machine learning and deep learning in securing 5G-driven industrial IoT applications.",
            "Fair and smart spectrum allocation scheme for IIoT based on blockchain.",
            "Geographic location based secure, dynamic and opportunistic RPL for distributed networks.",
            "WiNE-Tap: Wireless LAN emulator with wireless network TAP devices.",
            "EEHCHR: Energy Efficient Hybrid Clustering and Hierarchical Routing for Wireless Sensor Networks.",
            "A hybrid coverage control for enhancing UWSN localizability using IBSO-VFA.",
            "LPC: A lightweight pseudonym changing scheme with robust forward and backward secrecy for V2X."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2020",
        "info": "2020: Volumes\n96,\n97,\n98,\n99,\n100,\n101,\n102,\n103,\n104,\n105,\n106,\n107,\n108,\n109",
        "count": 171,
        "papers": [
            "Maximization of the sensor network lifetime by activity schedule heuristic optimization.",
            "Design and performance evaluation of a LoRa-based mobile emergency management system (LOCATE).",
            "A comprehensive survey on enhancements and limitations of the RPL protocol: A focus on the objective function.",
            "Energy aware endurance framework for mission critical aerial networks.",
            "Optimal path planning strategies for monitoring coverage holes in Wireless Sensor Networks.",
            "Deep tensor fusion network for multimodal ground-based cloud classification in weather station networks.",
            "Uplink resource allocation for multicarrier grouping cognitive internet of things based on K-means Learning.",
            "Techno-economic framework for dynamic operator selection in a multi-tier heterogeneous network.",
            "Broadcast strategies and performance evaluation of IEEE 802.15.4 in wireless body area networks WBAN.",
            "Beyond beaconing: Emerging applications and challenges of BLE.",
            "Uplink/downlink decoupled energy efficient user association in heterogeneous cloud radio access networks.",
            "An efficient energy-aware routing scheme for cloud-assisted MANETs in 5G.",
            "An accurate UWB based localization system using modified leading edge detection algorithm.",
            "Person re-identification using Hybrid Task Convolutional Neural Network in camera sensor networks.",
            "Cross-domain person re-identification using Dual Generation Learning in camera sensor networks.",
            "Influence of node mobility, recharge, and path loss on the optimized lifetime of wireless rechargeable sensor networks.",
            "QoS-aware traffic scheduling framework in cognitive radio based smart grids using multi-objective optimization of latency and throughput.",
            "A hybrid secure routing and monitoring mechanism in IoT-based wireless sensor networks.",
            "Minimum connected dominating sets in heterogeneous 3D wireless ad hoc networks.",
            "On the distribution of nodal distances in random wireless ad hoc network with mobile node.",
            "Multihop full duplex relaying with coherent signaling: Outage probability analysis and power optimization.",
            "Peer-to-peer energy sharing in mobile networks: Applications, challenges, and open problems.",
            "LD2FA-PSO: A novel Learning Dynamic Deterministic Finite Automata with PSO algorithm for secured energy efficient routing in Wireless Sensor Network.",
            "Exploiting performance of two-way non-orthogonal multiple access networks: Joint impact of co-channel interference, full-duplex/half-duplex mode and SIC receiver.",
            "Fractional chaos based-cryptosystem for generating encryption keys in Ad Hoc networks.",
            "Matrix-based key management scheme for IoT networks.",
            "Authentication protocol in CTNs for a CWD-WPT charging system in a cloud environment.",
            "Attestation-enabled secure and scalable routing protocol for IoT networks.",
            "Energy minimization for delay constrained mobile edge computing with orthogonal and non-orthogonal multiple access.",
            "Optimal relay node selection in time-varying IoT networks using apriori contact pattern information.",
            "Performance analysis of cooperative NOMA at intersections for vehicular communications in the presence of interference.",
            "Maximizing network lifetime using coverage sets scheduling in wireless sensor networks.",
            "Environment-aware localization for wireless sensor networks using magnetic induction.",
            "Reliable congestion control mechanism for safety applications in urban VANETs.",
            "Buffer-aided relay selection for secure two-hop wireless networks with decode-and-forward relays and a diversity-combining eavesdropper.",
            "Rate and coverage analysis in multi-tier heterogeneous network using stochastic geometry approach.",
            "An intelligent Edge-IoT platform for monitoring livestock and crops in a dairy farming scenario.",
            "An efficient queries processing model based on Multi Broadcast Searchable Keywords Encryption (MBSKE).",
            "Intelligent jamming-aware routing in multi-hop IoT-based opportunistic cognitive radio networks.",
            "DistLog: A distributed logging scheme for IoT forensics.",
            "Join trajectory optimization and communication design for UAV-enabled OFDM networks.",
            "Multiagent approach for consensus control in the energy internet network.",
            "Rate satisfaction-based power allocation for NOMA-based cognitive Internet of Things.",
            "Directional modulation design under maximum and minimum magnitude constraints for weight coefficients.",
            "Few shot learning for multi-class classification based on nested ensemble DSVM.",
            "An efficient route planning model for mobile agents on the internet of things using Markov decision process.",
            "UAV-assisted wireless powered Internet of Things: Joint trajectory optimization and resource allocation.",
            "Communication and security in communicating things networks.",
            "A study of a one-turn circular patch antenna array and the influence of the human body on the characteristics of the antenna.",
            "Experimental evaluation of receive diversity techniques in distributed sensor networks.",
            "Indoor localization using time difference of arrival with UWB signals and unsynchronized devices.",
            "Methodologies for calculating decision-related event occurrence times, with applications to effective routing in diverse MANET environments.",
            "Design of the sleeping aid system based on face recognition.",
            "Vehicle density and signal to noise ratio based broadcast backoff algorithm for VANETs.",
            "Universal resource allocation framework for preventing pollution attacks in network-coded wireless mesh networks.",
            "Efficient provably-secure privacy-preserving signature-based key establishment protocol.",
            "A new provably secure certificateless signature scheme for Internet of Things.",
            "A simple, lightweight, and precise algorithm to defend against replica node attacks in mobile wireless networks using neighboring information.",
            "Data aggregation algorithms for wireless sensor network: A review.",
            "Increasing the lifetime of sensor networks by a data dissemination model based on a new approximation algorithm.",
            "A distributed coverage hole recovery approach based on reinforcement learning for Wireless Sensor Networks.",
            "An Asynchronous Distributed Algorithm for Minimum s-t Cut Detection in Wireless Multi-hop Networks.",
            "Optimizing communication and computational costs based on the edge participation probability and the evolved variational message passing algorithm in wireless sensor networks.",
            "Mobile wireless sensor network lifetime maximization by using evolutionary computing methods.",
            "Proposing a Secure RPL based Internet of Things Routing Protocol: A Review.",
            "Symbol-independent weight magnitude design for antenna array based directional modulation.",
            "End-to-end malware detection for android IoT devices using deep learning.",
            "Benign false-data injection as a moving-target defense to secure mobile wireless communications.",
            "A deep reinforcement learning for user association and power control in heterogeneous networks.",
            "Design of and research on industrial measuring devices based on Internet of Things technology.",
            "Context-aware self-adaptive routing for delay tolerant network in disaster scenarios.",
            "A multi-view CNN-based acoustic classification system for automatic animal species identification.",
            "Enhanced OLSR routing for airborne networks with multi-beam directional antennas.",
            "On delay performance study for cooperative multicast MANETs.",
            "APTEEN routing protocol optimization in wireless sensor networks based on combination of genetic algorithms and fruit fly optimization algorithm.",
            "WEDMS: An advanced mean shift clustering algorithm for LDoS attacks detection.",
            "Defense against primary user emulation attackers based on adaptive Bayesian learning automata in cognitive radio networks.",
            "A secure multipath reactive protocol for routing in IoT and HANETs.",
            "Cramér-Rao lower bound analysis of RSS/TDoA joint localization algorithms based on rigid graph theory.",
            "Recent advancements, review analysis, and extensions of the AODV with the illustration of the applied concept.",
            "Dynamic modeling and adaptive controlling in GPS-intelligent buoy (GIB) systems based on neural-fuzzy networks.",
            "Novel path similarity aware clustering and safety message dissemination via mobile gateway selection in cellular 5G-based V2X and D2D communication for urban environment.",
            "Wireless signal enhancement based on generative adversarial networks.",
            "Distributed perception and model inference with intelligent connected vehicles in smart cities.",
            "Novel AP association and fair channel access in high throughput WLAN for energy efficiency.",
            "An enhanced geographical routing protocol based on multi-criteria decision making method in mobile ad-hoc networks.",
            "Lightweight elliptic curve cryptography accelerator for internet of things applications.",
            "Analysis of compressive sensing and energy harvesting for wireless multimedia sensor networks.",
            "EAR: Energy-aware risk-averse routing for disaster response networks.",
            "CAPODAZ: A containerised authorisation and policy-driven architecture using microservices.",
            "Guaranteed lifetime protocol for IoT based wireless sensor networks with multiple constraints.",
            "Modularity based mobility aware community detection algorithm for broadcast storm mitigation in VANETs.",
            "A fair and distributed congestion control mechanism for smart grid neighborhood area networks.",
            "OCRNN: An orthogonal constrained recurrent neural network for sleep analysis based on EEG data.",
            "Age of information in wireless powered IoT networks: NOMA vs. TDMA.",
            "Erratum to Structure Health Monitoring Using Wireless Sensor Networks on Structural Elements [Ad Hoc Networks Vol. 82 (2019) 68-76].",
            "Malware detection in industrial internet of things based on hybrid image visualization and deep learning model.",
            "Optimal crowd-augmented spectrum mapping via an iterative Bayesian decision framework.",
            "Solution of network localization problem with noisy distances and its convergence.",
            "Experimental evaluation of RSSI-based positioning system with low-cost LoRa devices.",
            "Research on Crowdsourcing network indoor localization based on Co-Forest and Bayesian Compressed Sensing.",
            "IGAN-IDS: An imbalanced generative adversarial network towards intrusion detection system in ad-hoc networks.",
            "Congestion control model for securing internet of things data flow.",
            "Achieving per-flow satisfaction with multi-path D2D.",
            "Immigrant imperialist competitive algorithm to solve the multi-constraint node placement problem in target-based wireless sensor networks.",
            "Automatic QoE evaluation for asymmetric encoding of 3D videos for DASH streaming service.",
            "MSLG-RGSO: Movement score based limited grid-mobility approach using reverse Glowworm Swarm Optimization algorithm for mobile wireless sensor networks.",
            "Efficient strategy to optimize key devices positions in large-scale RF mesh networks.",
            "Evaluating and Modeling IEEE 802.15.4 TSCH Resilience against Wi-Fi Interference in New-Generation Highly-Dependable Wireless Sensor Networks.",
            "Multichannel spectrum access based on reinforcement learning in cognitive internet of things.",
            "A framework for multimodal wireless sensor networks.",
            "Energy efficient robust scheduling of periodic sensor packets for discrete rate based wireless networked control systems.",
            "Link utility aware geographic routing for urban VANETs using two-hop neighbor information.",
            "Secure cluster head election algorithm and misbehavior detection approach based on trust management technique for clustered wireless sensor networks.",
            "A joint optimization approach for distributed collaborative beamforming in mobile wireless sensor networks.",
            "Comparison of SUMO's vehicular demand generators in vehicular communications via graph-theory metrics.",
            "Impact of drone route geometry on information collection in wireless sensor networks.",
            "A performance modeling and analysis of a novel vehicular traffic flow prediction system using a hybrid machine learning-based model.",
            "Particle swarm optimization based energy efficient clustering and sink mobility in heterogeneous wireless sensor network.",
            "Collision decoding and reporting: A new collision resolution approach using full-duplex radio in WLANs.",
            "A flexible encryption technique for the internet of things environment.",
            "Drone assisted Flying Ad-Hoc Networks: Mobility and Service oriented modeling using Neuro-fuzzy.",
            "Mobile sink-based data gathering in wireless sensor networks with obstacles using artificial intelligence algorithms.",
            "Cooperative multipath routing with path bridging in wireless sensor network toward IoTs service.",
            "Non-cooperative game based congestion control for data rate optimization in vehicular ad hoc networks.",
            "Low latency and energy efficient routing-aware network coding-based data transmission in multi-hop and multi-sink WSN.",
            "UAV Mobility model for dynamic UAV-to-car communications in 3D environments.",
            "Energy-efficient user selection and resource allocation in mobile edge computing.",
            "Towards optimal convergecast in wireless ad hoc networks.",
            "Gait-Watch: A Gait-based context-aware authentication system for smart watch via sparse coding.",
            "A cost-efficient elastic UAV relay network construction method with guaranteed QoS.",
            "Joint resource allocation for cognitive OFDM-NOMA systems with energy harvesting in green IoT.",
            "A game theoretic approach for conflict resolution in argumentation enabled social IoT networks.",
            "ADVICE-LOC: An adaptive vehicle-centric location management scheme for intelligent connected cars.",
            "Beaconing-based networking for localized information exchange in emergency management.",
            "WiRelax: Towards real-time respiratory biofeedback during meditation using WiFi.",
            "Slotted ALOHA wireless networks with RF energy harvesting in Nakagami-m fading.",
            "EBEESU: ElectriBio-inspired Energy-Efficient Self-organization model for Unmanned Aerial Ad-hoc Network.",
            "Resilience through multicast - An optimization model for multi-hop wireless sensor networks.",
            "Analysis and adaptive optimization of vehicular safety message communications at intersections.",
            "Towards linking social media profiles with user's WiFi preferred network list.",
            "On receiver diversity for grant-free based machine type communications.",
            "Spectrum efficiency in CRNs using hybrid dynamic channel reservation and enhanced dynamic spectrum access.",
            "PWEND: Proactive wakeup based energy-efficient neighbor discovery for mobile sensor networks.",
            "Bio-inspired routing algorithm for MANETs based on fungi networks.",
            "Beamforming technique based on adaptive diagonal loading in wireless access networks.",
            "Stable positioning for mobile targets using distributed fusion correction strategy of heterogeneous data.",
            "Radio selection and data partitioning for energy-efficient wireless data transfer in real-time IoT applications.",
            "FLAT: Federated lightweight authentication for the Internet of Things.",
            "Evolutionary computation technique enhancing the performance of cognitive radio networks with energy harvesting.",
            "RSSI quantization and genetic algorithm based localization in wireless sensor networks.",
            "Displaying images on a plane of rotation via mutual inductance coupling wireless controls.",
            "Research on HEVC screen content coding and video transmission technology based on machine learning.",
            "A deep learning method based on an attention mechanism for wireless network traffic prediction.",
            "Relay selection in network coding assisted multi-pair D2D communications.",
            "Data delivery protocol using the trajectory information on a road map in VANETs.",
            "A cognitive radio-based fully blind multihop rendezvous protocol for unknown environments.",
            "Relay node placement for building wireless sensor networks with reconfigurability provision.",
            "Lifetime optimization for partial coverage in heterogeneous sensor networks.",
            "Enhancing intelligence in traffic management systems to aid in vehicle traffic congestion problems in smart cities.",
            "A residual network framework based on weighted feature channels for multispectral image compression.",
            "A novel dynamic confidence interval based secure channel prediction approach for stream-based multichannel wireless sensor networks.",
            "On energy efficient secure routing in multi-hop underlay D2D communications for IoT applications.",
            "A memory-oriented MAC-layer design for future IoT systems.",
            "A survey on congestion detection and control in connected vehicles.",
            "Fuzzy-based beaconless probabilistic broadcasting for information dissemination in urban VANET.",
            "A cognitive wireless networks access selection algorithm based on MADM.",
            "Distributed optimization via primal and dual decompositions for delay-constrained FANETs.",
            "GLRT-based spectrum sensing by exploiting Multitaper Spectral Estimation for cognitive radio network.",
            "Analysis of the interplay between RPL and the congestion control strategies for CoAP.",
            "Cross-layer adaptive multipath routing for multimedia Wireless Sensor Networks under duty cycle mode."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2019",
        "info": "2019: Volumes\n82,\n83,\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91,\n92,\n93,\n94,\n95",
        "count": 215,
        "papers": [
            "Routing protocols and architecture for disaster area network: A survey.",
            "Context-aware energy-efficient applications for cyber-physical systems.",
            "Optimizing floor reservation and contention resolution in wireless random access.",
            "On outage minimization in relay assisted cognitive radio networks with energy harvesting.",
            "Lifetime-aware information aggregation under uncertainty for advanced driver assistance systems.",
            "Structure health monitoring using wireless sensor networks on structural elements.",
            "MobiVNDN: A distributed framework to support mobility in vehicular named-data networking.",
            "Power allocation and routing for full-duplex multi hop wireless networks under full interference.",
            "6LowPSec: An end-to-end security protocol for 6LoWPAN.",
            "Secure and privacy-preserving orchestration and delivery of fog-enabled IoT services.",
            "Fast multi-hop broadcast of alert messages in VANETs: An analytical model.",
            "MARLIN-Q: Multi-modal communications for reliable and low-latency underwater data delivery.",
            "Data transmission plan adaptation complementing strategic time-network selection for connected vehicles.",
            "BPA-CRP: A balanced power-aware clustering and routing protocol for wireless sensor networks.",
            "Vehicular software-defined networking and fog computing: Integration and design principles.",
            "Optical-acoustic hybrid network toward real-time video streaming for mobile underwater sensors.",
            "Intelligent positive computing with mobile, wearable, and IoT devices: Literature review and research directions.",
            "ADTH: Bounded nodal delay for better performance in wireless Ad-hoc networks.",
            "Optimization of an integrated fronthaul/backhaul network under path and delay constraints.",
            "A prediction-based approach for features aggregation in Visual Sensor Networks.",
            "Software-defined unmanned aerial vehicles networking for video dissemination services.",
            "Use MU-MIMO at your own risk - Why we don't get Gb/s Wi-Fi.",
            "MAC-LEAP: Multi-antenna, cross layer, energy adaptive protocol.",
            "SKA-PS: Secure key agreement protocol using physiological signals.",
            "Traffic management and networking for autonomous vehicular highway systems.",
            "A new lossless neighborhood indexing sequence (NIS) algorithm for data compression in wireless sensor networks.",
            "Joint channel and power allocation for device-to-device underlay.",
            "Greedyflow: Distributed greedy packet routing between landmarks in DTNs.",
            "Broadcasting in dense linear networks: To cooperate or not to cooperate?",
            "Mobility-aware application protocols.",
            "Ad Hoc Networks Editorial for 2018.",
            "Security analysis for interference management in heterogeneous networks.",
            "BehaveSense: Continuous authentication for security-sensitive mobile apps using behavioral biometrics.",
            "GRNN and KF framework based real time target tracking using PSOC BLE and smartphone.",
            "Relay-pair selection in buffer-aided successive opportunistic relaying using a multi-antenna source.",
            "Reducing delay and prolonging the lifetime of wireless sensor network using efficient routing protocol based on mobile sink and virtual infrastructure.",
            "Anonymous two factor authentication protocol for roaming service in global mobility network with security beyond traditional limit.",
            "Energy-efficient multicast routing protocol based on SDN and fog computing for vehicular networks.",
            "Anomaly detection in ad-hoc networks based on deep learning model: A plug and play device.",
            "How to obfuscate execution of protocols in an ad hoc radio network?",
            "LANET: Visible-light ad hoc networks.",
            "A taxonomy and survey of cyber-physical intrusion detection approaches for vehicles.",
            "On the performance of non-orthogonal multiple access in the finite blocklength regime.",
            "EK-means: A new clustering approach for datasets classification in sensor networks.",
            "Clustering-based device-to-device cache placement.",
            "Performance enhancement for energy harvesting based two-way relay protocols in wireless ad-hoc networks with partial and full relay selection methods.",
            "Towards optimal resource allocation in wireless powered communication networks with non-orthogonal multiple access.",
            "Frame-based randomized scheduling of packets with random-deadlines for multi-flow wireless networks.",
            "Stable Throughput Region of the Two-User Interference Channel.",
            "Cruisers: An automotive sensing platform for smart cities using door-to-door garbage collecting trucks.",
            "A distributed coalition game model for cooperation in MANETs.",
            "Inter- and intra-cluster movement of mobile sink algorithms for cluster-based networks to enhance the network lifetime.",
            "Flexible SDN control in tactical ad hoc networks.",
            "New lightweight mitigation techniques for RPL version number attacks.",
            "Network control and rate optimization for multiuser MIMO communications.",
            "A graphical Bayesian game for secure sensor activation in internet of battlefield things.",
            "Distributed power control in mobile wireless sensor networks.",
            "Distributed multiple access with a general link layer channel.",
            "Learning algorithms for scheduling in wireless networks with unknown channel statistics.",
            "AP-initiated multi-user transmissions in IEEE 802.11ax WLANs.",
            "A Wireless Vehicle-based mobile network infrastructure designed for smarter cities.",
            "Seamless roaming and guaranteed communication using a synchronized single-hop multi-gateway 802.15.4e TSCH network.",
            "Age of Information with network coding.",
            "Cost-aware securing of IoT systems using attack graphs.",
            "Neuro-Dominating set scheme for a fast and efficient robot deployment in internet of robotic things.",
            "Dronemap Planner: A service-oriented cloud-based management system for the Internet-of-Drones.",
            "Information freshness over a Markov channel: The effect of channel state information.",
            "Security in networks of unmanned aerial vehicles for surveillance with an agent-based approach inspired by the principles of blockchain.",
            "Sensor and sink placement, scheduling and routing algorithms for connected coverage of wireless sensor networks.",
            "SeCARA: A security and cost-aware resource allocation method for mobile cloudlet systems.",
            "Adaptive beacon broadcast in opportunistic routing for VANETs.",
            "Multi-robot rendezvous based on bearing-aided hierarchical tracking of network topology.",
            "Portability, compatibility and reuse of MAC protocols across different IoT radio platforms.",
            "Trust management for secure cognitive radio vehicular ad hoc networks.",
            "A new CubeSat design with reconfigurable multi-band radios for dynamic spectrum satellite communication networks.",
            "Erratum to 'Drone Cellular Networks: Enhancing the Quality of Experience of Video Streaming Applications' [Adhoc 80 (2018) 130-141].",
            "A novel communication paradigm for high capacity and security via programmable indoor wireless environments in next generation wireless systems.",
            "Information sharing and bullwhip effect in smart destination network system.",
            "Use of a quantum genetic algorithm for coalition formation in large-scale UAV networks.",
            "Network lifetime improvement using landmark-assisted mobile sink scheduling for cyber-physical system applications.",
            "PPSHA: Privacy preserving secure handover authentication scheme for all application scenarios in LTE-A networks.",
            "QoS-based dynamic channel selection algorithm for cognitive radio based smart grid communication network.",
            "Novel strategies for path stability estimation under topology change using Hello messaging in MANETs.",
            "Analysis and evaluation of adaptive RSSI-based ranging in outdoor wireless sensor networks.",
            "A hierarchical fractional LMS prediction method for data reduction in a wireless sensor network.",
            "Lifetime improvement of wireless sensor network by information sensitive aggregation method for railway condition monitoring.",
            "Geometric aspects of probabilistic broadcasting in ad hoc networks.",
            "Performance analysis of a cooperative wireless network with adaptive relays.",
            "DACYCLEM: A decentralized algorithm for maximizing coverage and lifetime in a mobile wireless sensor network.",
            "A mixed-integer linear programming approach for energy-constrained mobile anchor path planning in wireless sensor networks localization.",
            "An IoT-based smart cities infrastructure architecture applied to a waste management scenario.",
            "Special issue: Advances and trends on cognitive cyber-physical systems.",
            "Efficient broadcast in opportunistic networks using optimal stopping theory.",
            "Quality enhancement with fault tolerant embedding in video transmission over WMSNs in 802.11e WLAN.",
            "Editorial.",
            "Network bottlenecks in OLSR based ad-hoc networks.",
            "Celebrating Professor Mario Gerla's 75th birthday.",
            "Personal tributes to Anthony Ephremides.",
            "Analytical models of floating content in a vehicular urban environment.",
            "Optimization and non-cooperative game of anonymity updating in vehicular networks.",
            "Machine learning based smart steering for wireless mesh networks.",
            "Decentralized and resource-efficient self-calibration of visual sensor networks.",
            "Collaborative Spatial Reuse in wireless networks via selfish Multi-Armed Bandits.",
            "Self-calibration methods for uncontrolled environments in sensor networks: A reference survey.",
            "Analysis of a S-TDMA distributed scheduler for ad-hoc cellular-V2X communication.",
            "Code-based physical layer secret key generation in passive optical networks.",
            "Distributed signal processing for dense 5G IoT platforms: Networking, synchronization, interference detection and radio sensing.",
            "Study about vehicles velocities using time causal Information Theory quantifiers.",
            "Efficient data collection and tracking with flying drones.",
            "Synchronization of data measurements in wireless sensor networks for IoT applications.",
            "Prominent unicast routing protocols for Mobile Ad hoc Networks: Criterion, classification, and key attributes.",
            "An automatic restoration scheme for switch-based networks.",
            "Enhanced cooperative group localization with identification of LOS/NLOS BSs in 5G dense networks.",
            "Light-weight hashing method for user authentication in Internet-of-Things.",
            "Distributed task allocation algorithm based on connected dominating set for WSANs.",
            "More efficient key establishment protocol for smart grid communications: Design and experimental evaluation on ARM-based hardware.",
            "Stochastic modeling of depth based routing in underwater sensor networks.",
            "Investigating physical security in stealthy lattice wireless sensor networks using k-barrier coverage.",
            "Time reversal communication using vertical particle velocity and pressure signals in shallow water.",
            "QoE-driven resource allocation for massive video distribution.",
            "Planning UAV activities for efficient user coverage in disaster areas.",
            "Exploiting frame aggregation and weighted round robin with beamforming smart antennas for directional MAC in MANET environments.",
            "Towards mobile radio access infrastructures for mobile users.",
            "HELPER: Heterogeneous Efficient Low Power Radio for enabling ad hoc emergency public safety networks.",
            "Minimizing end-to-end delay in multi-hop wireless networks with optimized transmission scheduling.",
            "Recent advances on security and privacy in intelligent transportation systems (ITSs).",
            "A Macroscopic Traffic Model-based Approach for Sybil Attack Detection in VANETs.",
            "An intrusion detection system for connected vehicles in smart cities.",
            "A review on safety failures, security attacks, and available countermeasures for autonomous vehicles.",
            "DoS-resilient cooperative beacon verification for vehicular communication systems.",
            "Network intrusion detection system for UAV ad-hoc communication: From methodology design to real test validation.",
            "The impact of ECDSA in a VANET routing service: Insights from real data traces.",
            "Pairing-based authentication protocol for V2G networks in smart grid.",
            "On trust models for communication security in vehicular ad-hoc networks.",
            "An efficient privacy-preserving protocol for database-driven cognitive radio networks.",
            "Efficient and privacy preserving supplier matching for electric vehicle charging.",
            "ACPC: Efficient revocation of pseudonym certificates using activation codes.",
            "Detection of jamming attack using timestamp for WSN.",
            "A novel group ownership transfer protocol for RFID systems.",
            "Performance analysis of spectrum handoff under heterogeneous spectrum environment in ad hoc and centralized CR networks.",
            "Vehicular fog gateways selection on the internet of vehicles: A fuzzy logic with ant colony optimization based approach.",
            "In-band LOS discovery using highly directional transceivers.",
            "TimeStream: Exploiting video streams for clock synchronization.",
            "Privacy-aware query processing in vehicular ad-hoc networks.",
            "A congestion control framework for delay- and disruption tolerant networks.",
            "Exploiting peer-to-peer wireless energy sharing for mobile charging relief.",
            "Pool resource management based on early collision detection in random access of massive MTC over LTE.",
            "Towards low-complexity wireless technology classification across multiple environments.",
            "Towards socially enabled internet of industrial things: Architecture, semantic model and relationship management.",
            "Design of network coding based reliable sensor networks.",
            "Efficient data handling in vehicular micro clouds.",
            "Q-SQUARE: A Q-learning approach to provide a QoE aware UAV flight path in cellular networks.",
            "Special issue on security of IoT-enabled infrastructures in smart cities.",
            "Apparatus: A framework for security analysis in internet of things systems.",
            "A secure and robust scheme for sharing confidential information in IoT systems.",
            "Efficient DCT-based secret key generation for the Internet of Things.",
            "Efficient certificate revocation management schemes for IoT-based advanced metering infrastructures in smart cities.",
            "Energy efficient cross-layer approach for object security of CoAP for IoT devices.",
            "An adaptive energy aware strategy based on game theory to add privacy in the physical layer for cognitive WSNs.",
            "5GinFIRE: An end-to-end open5G vertical network function ecosystem.",
            "Energy-efficient on-demand indoor localization platform based on wireless sensor networks using low power wake up receiver.",
            "Energy efficient multi-objective evolutionary routing scheme for reliable data gathering in Internet of underwater acoustic sensor networks.",
            "Neighbor Knowledge-based Rebroadcast algorithm for minimizing the routing overhead in Mobile Ad-hoc Networks.",
            "A survey on Bluetooth multi-hop networks.",
            "Machine learning for wireless communications in the Internet of Things: A comprehensive survey.",
            "A complete diagnosis of faulty sensor modules in a wireless sensor network.",
            "Software-Defined architecture for QoS-Aware IoT deployments in 5G systems.",
            "Dependability-based clustering in mobile ad-hoc networks.",
            "Interoperability network model for traffic forecast and full electric vehicles power supply management within the smart city.",
            "Experimental in-depth study of the dynamics of an indoor industrial low power lossy network.",
            "Uneven clustering routing algorithm based on glowworm swarm optimization.",
            "Emergency aware congestion control for smart grid neighborhood area networks.",
            "Optimized routers positions for large-scale RF mesh networks based on clustering algorithms.",
            "Cascading failures in wireless sensor networks with load redistribution of links and nodes.",
            "Towards green communication in wireless sensor network: GA enabled distributed zone approach.",
            "Stochastic computation resource allocation for mobile edge computing powered by wireless energy transfer.",
            "General and mixed linear regressions to estimate inter-contact times and contact duration in opportunistic networks.",
            "On the performance of social-based and location-aware forwarding strategies in urban vehicular networks.",
            "LoICen: A novel location-based and information-centric architecture for content distribution in vehicular networks.",
            "Multiple and replicated random walkers analysis for service discovery in fog computing IoT environments.",
            "Hybrid resource scheduling for aggregation in massive machine-type communication networks.",
            "Underwater optical wireless communications, networking, and localization: A survey.",
            "On semantic clustering and adaptive robust regression based energy-aware communication with true outliers detection in WSN.",
            "Deep reinforcement learning mechanism for dynamic access control in wireless networks handling mMTC.",
            "A primer on design aspects, recent advances, and challenges in cellular device-to-device communication.",
            "Using one class SVM to counter intelligent attacks against an SPRT defense mechanism.",
            "Enhanced authentication and key management scheme for securing data transmission in the internet of things.",
            "Virtual mesh networking for achieving multi-hop D2D communications in 5G networks.",
            "Full-duplex MAC protocol using buffer status reports during unused uplink periods in WLAN.",
            "Maximization of wireless sensor network lifetime using solar energy harvesting for smart agriculture monitoring.",
            "Maximizing full-view target coverage in camera sensor networks.",
            "Evaluation of a proposed minimum path impotence routing policy in wireless sensor networks.",
            "Narrowband hybrid PLC/wireless: Transceiver prototype, hardware resource usage and energy consumption.",
            "Priority and collision avoidance system for traffic lights.",
            "DYRP-VLC: A dynamic routing protocol for Wireless Ad-Hoc Visible Light Communication Networks.",
            "A two-tier machine learning-based handover management scheme for intelligent vehicular networks.",
            "Special issue on \"Performance evaluation, modeling and analysis of wireless ad-hoc networks\".",
            "A Secure Communicating Things Network Framework for Industrial IoT using Blockchain Technology.",
            "Preserving data security in distributed fog computing.",
            "A robust image-encryption approach against transmission errors in Communicating Things Networks.",
            "Flow/Interface Association for multi-connectivity in heterogeneous wireless networks: e-Health case.",
            "An efficient cyber defense framework for UAV-Edge computing network.",
            "Spectrum allocation by wave based adaptive differential evolution algorithm.",
            "Intelligent clustering cooperative spectrum sensing based on Bayesian learning for cognitive radio network.",
            "Towards scalable Community Networks topologies.",
            "The joint network/control design of platooning algorithms can enforce guaranteed safety constraints.",
            "Comparison of OFDM and OOK modulations for vehicle-to-vehicle visible light communication in real-world driving scenarios.",
            "UAVs that fly forever: Uninterrupted structural inspection through automatic UAV replacement.",
            "Network lifetime maximization in wireless mesh networks for machine-to-machine communication.",
            "A secure and efficient three-factor multi-gateway authentication protocol for wireless sensor networks.",
            "Intrusion detection system using deep learning for in-vehicle security.",
            "Advances and novel applications of mobile wireless networking.",
            "Compact Triplet Loss for person re-identification in camera sensor networks.",
            "Non-interactive zero knowledge proofs for the authentication of IoT devices in reduced connectivity environments.",
            "Secure data transmission framework for confidentiality in IoTs."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2018",
        "info": "2018: Volumes\n68,\n69,\n70,\n71,\n72,\n73,\n74,\n75-76,\n77,\n78,\n79,\n80,\n81",
        "count": 130,
        "papers": [
            "Advances in Wireless Communication and Networking for Cooperating Autonomous Systems.",
            "Drone networks: Communications, coordination, and sensing.",
            "Multi-subpopulation evolutionary algorithms for coverage deployment of UAV-networks.",
            "The CUSCUS simulator for distributed networked control systems: Architecture and use-cases.",
            "Interest-aware energy collection & resource management in machine to machine communications.",
            "Federated IoT services leveraging 5G technologies at the edge.",
            "Chain-Branch-Leaf: A clustering scheme for vehicular networks using only V2V communications.",
            "No-collision grid based broadcast scheme and ant colony system with victim lifetime window for navigating robot in first aid applications.",
            "Time-optimized management of IoT nodes.",
            "Heterogeneous fault diagnosis for wireless sensor networks.",
            "On the packet delivery delay study for three-dimensional mobile ad hoc networks.",
            "Directional MAC protocol for IEEE 802.11ad based wireless local area networks.",
            "Fast network joining algorithms in industrial IEEE 802.15.4 deployments.",
            "Device-to-Device assisted wireless video delivery with network coding.",
            "Multi-functional secure data aggregation schemes for WSNs.",
            "ReSF: Recurrent Low-Latency Scheduling in IEEE 802.15.4e TSCH networks.",
            "AD HOC NETWORKS EDITORIAL (2017).",
            "High density emulation platform for Wi-Fi performance testing.",
            "An accurate prediction method for moving target localization and tracking in wireless sensor networks.",
            "Survey on security in intra-body area network communication.",
            "A distributed multichannel MAC protocol for rendezvous establishment in cognitive radio ad hoc networks.",
            "Experimental evaluation of improved IoT middleware for flexible performance and efficient connectivity.",
            "A secure data collection scheme based on compressive sensing in wireless sensor networks.",
            "Security threats and countermeasures of MAC layer in cognitive radio networks.",
            "A cross-interface design for energy-efficient and delay-bounded multi-hop communications in IoT.",
            "FADS: Circular/Spherical Sector based Forwarding Area Division and Adaptive Forwarding Area Selection routing protocol in WSNs.",
            "Generalized analytical expressions for end-to-end throughput of IEEE 802.11 string-topology multi-hop networks.",
            "An enhanced authentication scheme in mobile RFID system.",
            "A very fast tags polling protocol for single and multiple readers RFID systems, and its applications.",
            "A scalable data dissemination protocol based on vehicles trajectories analysis.",
            "TROPHY: Trustworthy VANET routing with group authentication keys.",
            "Key establishment scheme for wireless sensor networks based on polynomial and random key predistribution scheme.",
            "An efficient provably-secure certificateless signature scheme for Internet-of-Things deployment.",
            "LEEF: Latency and energy efficient federation of disjoint wireless sensor segments.",
            "Connectivity analysis of underground sensors in wireless underground sensor networks.",
            "A comprehensive review on energy harvesting MAC protocols in WSNs: Challenges and tradeoffs.",
            "Cross-Layer Greedy position-based routing for multihop wireless sensor networks in a real environment.",
            "Dynamic multiple node failure recovery in distributed storage systems.",
            "An energy consumption model for IEEE 802.11ah WLANs.",
            "Intelligent slots allocation for dynamic differentiation in IEEE 802.15.6 CSMA/CA.",
            "Quality-aware incentive mechanism based on payoff maximization for mobile crowdsensing.",
            "Active data dissemination for mobile sink groups in wireless sensor networks.",
            "A heterogeneous network selection algorithm based on network attribute and user preference.",
            "Clustering routing based on mixed integer programming for heterogeneous wireless sensor networks.",
            "Joint virtual edge-clustering and spectrum allocation scheme for uplink interference mitigation in C-RAN.",
            "Exact secrecy throughput capacity study in mobile ad hoc networks.",
            "A novel self-adaptive content delivery protocol for vehicular networks.",
            "Privacy-preserving mobile crowd sensing in ad hoc networks.",
            "Improving network lifetime and reliability for machine type communications based on LOADng routing protocol.",
            "Key predistribution schemes for wireless sensor networks based on combinations of orthogonal arrays.",
            "Use 'em or lose 'em: On unidirectional links in reactive routing protocols.",
            "Flexible real-time transmission scheduling for wireless networks with non-deterministic workloads.",
            "Performance evaluation of IEEE 802.15.4 with real time queueing analysis.",
            "Quality-aware UAV coverage and path planning in geometrically complex environments.",
            "Continuous quorum-based multicast power-saving protocols in the asynchronous ad hoc network for burst traffics.",
            "3GPP C-V2X and IEEE 802.11p for Vehicle-to-Vehicle communications in highway platooning scenarios.",
            "Study of absorption-defined transmission windows in the terahertz band.",
            "A stochastic geometrical approach for full-duplex MIMO relaying model of high-density network.",
            "Secure localization using hypothesis testing in wireless networks.",
            "Toward efficient adaptive ad-hoc multi-robot network topologies.",
            "A robust mutual authentication protocol for WSN with multiple base-stations.",
            "Efficient data association to targets for tracking in passive wireless sensor networks.",
            "Traffic differentiation in dense collision-free WLANs using CSMA/ECA.",
            "Heterogeneous vehicular communications: A comprehensive study.",
            "A recharging distance analysis for wireless sensor networks.",
            "Localising crowds through Wi-Fi probes.",
            "On the lifetime analysis of energy harvesting sensor nodes in smart grid environments.",
            "ICN-based cache-aware routing scheme in MSN.",
            "Dynamic Neighbour Aware Power-controlled MAC for Multi-hop Ad-hoc networks.",
            "Sampling-based selection-decimation deployment approach for large-scale wireless sensor networks.",
            "Path planning for mobile-anchor based wireless sensor network localization: Static and dynamic schemes.",
            "Round-table negotiation for fast restoration of connectivity in partitioned wireless sensor networks.",
            "BAN-GZKP: Optimal Zero Knowledge Proof based Scheme for Wireless Body Area Networks.",
            "A proactive scalable approach for reliable cluster formation in wireless networks with D2D offloading.",
            "On heterogeneous duty cycles for neighbor discovery in wireless sensor networks.",
            "Where have all the MPRs gone? On the optimal selection of Multi-Point Relays.",
            "KM-based efficient algorithms for optimal packet scheduling problem in celluar/infostation integrated networks.",
            "A selective multipath routing protocol for ubiquitous networks.",
            "Low complexity resource allocation in the relay channels with energy harvesting transmitters.",
            "Maximization of multicast periodic traffic throughput in multi-hop wireless networks with broadcast transmissions.",
            "Drone Cellular Networks: Enhancing the Quality Of Experience of video streaming applications.",
            "Topology control game algorithm based on Markov lifetime prediction model for wireless sensor network.",
            "QoS-based distributed flow management in software defined ultra-dense networks.",
            "Node localization with AoA assistance in multi-hop underwater sensor networks.",
            "The charger positioning problem in clustered RF-power harvesting wireless sensor networks.",
            "Stop and forward: Opportunistic local information sharing under walking mobility.",
            "Vehicular micro cloud in action: On gateway selection and gateway handovers.",
            "Mobile Matrix: Routing under mobility in IoT, IoMT, and Social IoT.",
            "Optimal user association, backhaul routing and switching off in 5G heterogeneous networks with mesh millimeter wave backhaul links.",
            "IoT Based information and communication system for enhancing underground mines safety and productivity: Genesis, taxonomy and open issues.",
            "N-TWR: An accurate time-of-flight-based N-ary ranging protocol for Ultra-Wide band.",
            "Enabling individually entrusted routing security for open and decentralized community networks.",
            "A disjoint frame topology-independent TDMA MAC policy for safety applications in vehicular networks.",
            "On short-length error-correcting codes for 5G-NR.",
            "Energy-efficient modulation and physical layer design for low terahertz band communication channel in 5G femtocell Internet of Things.",
            "Privacy enabled disjoint and dynamic address auto-configuration protocol for 6Lowpan.",
            "Efficient medium access arbitration among interfering WBANs using Latin rectangles.",
            "QoS-based distributed flow management in Software Defined Ultra-Dense Networks.",
            "Security architectures in constrained environments: A survey.",
            "On vehicular safety message transmissions through LTE-Advanced networks.",
            "MeNTor: A wireless-mesh-network-aware data dissemination overlay based on BitTorrent.",
            "Group centric networking: A new approach for wireless multi-hop networking.",
            "AD3-GLaM: A cooperative distributed QoE-based approach for SVC video streaming over wireless mesh networks.",
            "K Privacy: Towards improving privacy strength while preserving utility.",
            "On route table computation strategies in Delay-Tolerant Satellite Networks.",
            "Continuous leakage-resilient access control for wireless sensor networks.",
            "Connectivity and coverage based protocols for wireless sensor networks.",
            "A policy-aware Service Oriented Architecture for secure machine-to-machine communications.",
            "Optimization of decode-and-forward multihop full duplex relay networks under residual-self-interference.",
            "DDA: A deep neural network-based cognitive system for IoT-aided dermatosis discrimination.",
            "Discovering communities of malapps on Android-based mobile cyber-physical systems.",
            "pCoCoA: A precise congestion control algorithm for CoAP.",
            "DUPLICATE: Drone cellular networks: Enhancing the quality of experience of video streaming applications.",
            "Internet congestion control using the power metric: Keep the pipe just full, but no fuller.",
            "Coverage and connectivity analysis of millimeter wave vehicular networks.",
            "Joint spatial multiplexing and transmit diversity in MIMO ad hoc networks.",
            "Energy-aware backbone formation in military multilayer ad hoc networks.",
            "Energy efficient tracking in uncertain sensor networks.",
            "Joint uplink/downlink fair power allocation for wireless backhaul of vehicular small cells.",
            "QoS guaranteed surveillance algorithms for directional wireless sensor networks.",
            "A collaborative task-oriented scheduling driven routing approach for industrial IoT based on mobile devices.",
            "Bandwidth efficient designated verifier proxy signature scheme for healthcare wireless sensor networks.",
            "FALCON: A new approach for the evaluation of opportunistic networks.",
            "Performance evaluation and comparative study of main VDTN routing protocols under small- and large-scale scenarios.",
            "Toward trust based protocols in a pervasive and mobile computing environment: A survey.",
            "Internet of underground things in precision agriculture: Architecture and technology aspects.",
            "Secure beamforming for cognitive cyber-physical systems based on cognitive radio with wireless energy harvesting.",
            "A dynamic skyline technique for a context-aware selection of the best sensors in an IoT architecture.",
            "On the impact of the physical layer model on the performance of D2D-offloading in vehicular environments.",
            "MUPF: Multiple unicast path forwarding in content-centric VANETs."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2017",
        "info": "2017: Volumes\n54,\n55,\n56,\n57,\n58,\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67",
        "count": 152,
        "papers": [
            "SINR diagram with interference cancellation.",
            "Neural networks and SDR modulation schemes for wireless mobile nodes: A synergic approach.",
            "Localization in wireless sensor networks: A Dempster-Shafer evidence theoretical approach.",
            "CodeDrip: Improving data dissemination for wireless sensor networks with network coding.",
            "DKEM: Secure and efficient Distributed Key Establishment Protocol for Wireless Mesh Networks.",
            "BMRF: Bidirectional Multicast RPL Forwarding.",
            "Enabling sustainable bulk transfer in environmentally-powered wireless sensor networks.",
            "Compressive sensing based random walk routing in wireless sensor networks.",
            "MobiBar: An autonomous deployment algorithm for barrier coverage with mobile sensors.",
            "An adaptive energy balanced and energy efficient approach for data gathering in wireless sensor networks.",
            "Secure and efficient user authentication scheme for multi-gateway wireless sensor networks.",
            "Self-organizing and smart protocols for heterogeneous ad hoc networks in the Internet of Things.",
            "RAMSES: A new reference architecture for self-adaptive middleware in Wireless Sensor Networks.",
            "Cost-efficient traffic-aware data collection protocol in VANET.",
            "A smart fairness mechanism for Concurrent multipath transfer in SCTP over wireless multi-hop networks.",
            "Obstacle-avoidance minimal exposure path for heterogeneous wireless sensor networks.",
            "Practical distributed scheduling for QoS-aware small cell mmWave mesh backhaul network.",
            "Softwarecast: A code-based delivery Manycast scheme in heterogeneous and Opportunistic Ad Hoc Networks.",
            "Analysis of event-driven warning message propagation in Vehicular Ad Hoc Networks.",
            "ICMDS: Secure inter-cluster multiple-key distribution scheme for wireless sensor networks.",
            "Using trust model to ensure reliable data acquisition in VANETs.",
            "BoDMaS: Bio-inspired Selfishness Detection and Mitigation in Data Management for Ad-hoc Social Networks.",
            "Fault-resilient localization for underwater sensor networks.",
            "Heterogeneous ad hoc networks: Architectures, advances and challenges.",
            "Performance analysis of the ZigBee networks in 5G environment and the nearest access routing for improvement.",
            "Efficient clock synchronization for clustered wireless sensor networks.",
            "Game theoretic path selection to support security in device-to-device communications.",
            "A novel node sinking algorithm for 3D coverage and connectivity in underwater sensor networks.",
            "D-LPCN: A distributed least polar-angle connected node algorithm for finding the boundary of a wireless sensor network.",
            "Barrier coverage in energy harvesting sensor networks.",
            "Lossless address data compression using quadtree clustering of the sensors in a grid based WSN.",
            "Energy-aware relay selection in cooperative wireless networks: An assignment game approach.",
            "Energy harvested roadside IEEE 802.15.4 wireless sensor networks for IoT applications.",
            "Understanding the Internet of Things: definition, potentials, and societal role of a fast evolving paradigm.",
            "Energy efficiency of MAC protocols in low data rate wireless multimedia sensor networks: A comparative study.",
            "Energy-aware distributed routing algorithm to tolerate network failure in wireless sensor networks.",
            "An adaptive cross-layer error control protocol for wireless multimedia sensor networks.",
            "Opportunistic network coding for secondary users in cognitive radio networks.",
            "Finding best and worst-case coverage paths in camera sensor networks for complex regions.",
            "Preface.",
            "Utilizing hash graphs for key distribution for mobile and replaceable interconnected sensors in the IoT context.",
            "Building the Internet of Things with bluetooth smart.",
            "Big data and semantics management system for computer networks.",
            "Network layer inter-operation of Device-to-Device communication technologies in Internet of Things (IoT).",
            "Hybrid Wireless Ad Hoc Networks.",
            "3D nested distributed massive MIMO: Modeling and performance analysis.",
            "An improved AODV routing for the zigbee heterogeneous networks in 5G environment.",
            "Vehicle-to-vehicle connectivity analysis for vehicular ad-hoc networks.",
            "Implementation and analysis of Wireless Flexible Time-Triggered protocol.",
            "Hybrid half-duplex/full-duplex multi-hop relaying schemes: Outage performance and power optimization.",
            "On the uplink outage throughput capacity of hybrid wireless networks with Massive MIMO.",
            "Classification of node degree based on deep learning and routing method applied for virtual route assignment.",
            "PMC2O: Mobile cloudlet networking and performance analysis based on computation offloading.",
            "On the successful transmission probability of cooperative cognitive radio ad hoc networks.",
            "A new hierarchical beam search algorithm for wireless ad hoc networks in multipath channel scenario.",
            "Energy efficient distributed compressed data gathering for sensor networks.",
            "Hybrid precoding for heterogeneous cloud radio access network based on nested array.",
            "Analytical framework for the characterization of the link properties in multi-hop mobile wireless networks.",
            "A heuristic data update mechanism in unstructured mobile P2P systems.",
            "Fuzzy clustering in radar sensor networks for target detection.",
            "Simultaneous pathway mapping and behavior understanding with crowdsourced sensing in WLAN environment.",
            "HRRP recognition in radar sensor network.",
            "Layered admission control algorithms with QoE in heterogeneous network.",
            "Joint beamforming and power control for auction-based spectrum allocation in CoMP systems.",
            "A binary artificial bee colony algorithm for constructing spanning trees in vehicular ad hoc networks.",
            "Local connectivity for heterogeneous overlaid wireless networks.",
            "A micro-artificial bee colony based multicast routing in vehicular ad hoc networks.",
            "A novel method of micro-Doppler parameter extraction for human monitoring terahertz radar network.",
            "Joint cooperative spectrum sensing and spectrum opportunity for satellite cluster communication networks.",
            "Group buying spectrum auction algorithm for fractional frequency reuse cognitive cellular systems.",
            "Performance analysis of multi-hop full-duplex decode-and-forward relaying.",
            "Information-centric mobile ad hoc networks and content routing: A survey.",
            "A spectrum auction algorithm for cognitive distributed antenna systems.",
            "Reverse spectrum auction algorithm for cellular network offloading.",
            "Approaching the capacity of K-user MIMO interference channel with interference counteraction scheme.",
            "A convex optimization model for topology control in network-coding-based-wireless-sensor networks.",
            "Probabilistic modeling to achieve load balancing in Expert Clouds.",
            "An adaptive sinkhole aware algorithm in wireless sensor networks.",
            "Enhancing privacy for ad hoc systems with predeployment key distribution.",
            "Topology design and cross-layer optimization for wireless body sensor networks.",
            "A maximum flow algorithm based on storage time aggregated graph for delay-tolerant networks.",
            "Optimizing privacy-preserving DSA for mobile clients.",
            "Benchmarking of Localization Solutions: Guidelines for the Selection of Evaluation Points.",
            "T-ROME: A simple and energy efficient tree routing protocol for low-power wake-up receivers.",
            "Real-time link quality estimation for industrial wireless sensor networks using dedicated nodes.",
            "Wireless charging for weighted energy balance in populations of mobile peers.",
            "Performance evaluation of unmanned aerial vehicles in automatic power meter readings.",
            "End to end delay modeling of heterogeneous traffic flows in software defined 5G networks.",
            "TCP performance evaluation over backpressure-based routing strategies for wireless mesh backhaul in LTE networks.",
            "Probability-based prediction query algorithm.",
            "On the design of an embedded wireless sensor network for aircraft vibration monitoring using efficient game theoretic based MAC protocol.",
            "Bypassing holes in sensor networks: Load-balance vs. latency.",
            "A survey of attacks and detection mechanisms on intelligent transportation systems: VANETs and IoV.",
            "C-Sync: Counter-based synchronization for duty-cycled wireless sensor networks.",
            "Optimized cost effective and energy efficient routing protocol for wireless body area networks.",
            "Securing multi-channel selection using distributed trust in cognitive radio ad hoc networks.",
            "Comparison between TCP scheduling strategies in IEEE 802.11ac based wireless networks.",
            "Distributed resource allocation in D2D communication networks with energy harvesting relays using stable matching.",
            "Multi-hop consensus time synchronization algorithm for sparse wireless sensor network: A distributed constraint-based dynamic programming approach.",
            "Maximizing the wireless sensor networks lifetime through energy efficient connected coverage.",
            "Predicting encounter and colocation events.",
            "Cognitive channel selection and scheduling for multi-channel dynamic spectrum access networks considering QoS levels.",
            "Capacity and contention-based joint routing and gateway selection for machine-type communications.",
            "Link selection strategies based on network analysis to determine stable and energy-efficient data gathering trees for mobile sensor networks.",
            "On the rate of successful transmissions in finite slotted Aloha MANETs.",
            "Temperature compensated Kalman distributed clock synchronization.",
            "Energy efficient context aware traffic scheduling for IoT applications.",
            "Estimating the medium access probability in large cognitive radio networks.",
            "A new maximum fault-tolerance barrier-coverage problem in hybrid sensor network and its polynomial time exact algorithm.",
            "Analysis of link asymmetry in virtual multiple-input-single-output (VMISO) systems.",
            "Reliable data dissemination protocol for VANET traffic safety applications.",
            "Channel quality aware cross-layer design based rate adaptive MAC for improving the throughput capacity of multi-hop ad hoc networks.",
            "Location based transmission using a neighbour aware with optimized EIFS MAC for ad hoc networks.",
            "Improving charging capacity for wireless sensor networks by deploying one mobile vehicle with multiple removable chargers.",
            "Lightweight power control for energy-utility optimization in wireless networks.",
            "An efficient protocol for load-balanced multipath routing in mobile ad hoc networks.",
            "Multi-constraints link stable multicast routing protocol in MANETs.",
            "Location-aware interest-related micro-cloud topology construction and bacteria foraging-based offloading strategy.",
            "On the using of discrete wavelet transform for physical layer key generation.",
            "Lightweight and efficient privacy-preserving data aggregation approach for the Smart Grid.",
            "PACK: Path coloring based k-connectivity detection algorithm for wireless sensor networks.",
            "A distributed multi-path routing algorithm to balance energy consumption in wireless sensor networks.",
            "Cost-effective barrier coverage formation in heterogeneous wireless sensor networks.",
            "Recent advances in RF-based passive device-free localisation for indoor applications.",
            "On the performance of adaptive coding schemes for energy efficient and reliable clustered wireless sensor networks.",
            "Cooperative resynchronization to improve the reliability of colocated IEEE 802.15.4 -TSCH networks in dense deployments.",
            "An adaptive stabilizing imposter detection scheme for distributed mobile wireless sensor networks.",
            "A review of broadcasting safety data in V2V: Weaknesses and requirements.",
            "Quantized feedback scheduling for MIMO-OFDM broadcast networks with subcarrier clustering.",
            "Spectrum access in cognitive smart-grid communication system with prioritized traffic.",
            "Performance of RF self-interference cancellation disturbed by fast-moving object in full-duplex wireless.",
            "Compressive detection and localization of multiple heterogeneous events in sensor networks.",
            "Design and analysis of RPL objective functions for multi-gateway ad-hoc low-power and lossy networks.",
            "Optimal energy aware clustering in circular wireless sensor networks.",
            "Performance analysis of superior selective reporting-based energy efficient cooperative spectrum sensing in cognitive radio networks.",
            "Simulation of control loops in wireless networks: Relating QoS with QoC.",
            "Interference aware bandwidth estimation for load balancing in EMHR-energy based with mobility concerns hybrid routing protocol for VANET-WSN communication.",
            "A location aided controlled spraying routing algorithm for Delay Tolerant Networks.",
            "IoT_ProSe: Exploiting 3GPP services for task allocation in the Internet of Things.",
            "Convergecast in Wireless Body Area Networks.",
            "Approximate Cardinality Estimation (ACE) in large-scale Internet of Things deployments.",
            "Flexible resource allocation adaptive to communication strategy selection for cellular clients using Stackelberg game.",
            "Reliable delay-sensitive spectrum handoff management for re-entrant secondary users.",
            "On state maintenance in cluster-based mobile ad-hoc networks.",
            "Geographic routing and hole bypass using long range sinks for wireless sensor networks.",
            "A distributed routing scheme for energy management in solar powered sensor networks.",
            "A secure and efficient group key agreement approach for mobile ad hoc networks.",
            "WA-MAC: A weather adaptive MAC protocol in survivability-heterogeneous wireless sensor networks.",
            "Design and performance analysis of a full-duplex MAC protocol for wireless local area networks.",
            "Recovery from simultaneous failures in a large scale wireless sensor network.",
            "Distributed sensor deployment using potential fields.",
            "Node localization over small world WSNs using constrained average path length reduction."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2016",
        "info": "2016: Volumes\n36,\n37,\n38,\n39,\n40,\n41,\n42,\n43,\n44,\n45,\n46,\n47,\n48,\n49,\n50,\n51,\n52,\n53",
        "count": 192,
        "papers": [
            "Decentralized robust spectrum allocation for cognitive radio wireless mesh networks.",
            "Rigorous and practical proportional-fair allocation for multi-rate Wi-Fi.",
            "On-demand beaconing: Periodic and adaptive policies for effective routing in diverse mobile topologies.",
            "A formal model and analysis of an IoT protocol.",
            "A secure light weight scheme for user authentication and key agreement in multi-gateway based wireless sensor networks.",
            "Efficient content delivery in mobile ad-hoc networks using CCN.",
            "A new packet scheduling algorithm for access points in crowded WLANs.",
            "Who stole my cheese?: Verifying intactness of anonymous RFID systems.",
            "GITAR: Generic extension for Internet-of-Things ARchitectures enabling dynamic updates of network and application modules.",
            "An efficient user authentication and key agreement scheme for heterogeneous wireless sensor network tailored for the Internet of Things environment.",
            "Modeling of rate-based congestion control schemes in cognitive radio sensor networks.",
            "A general model for MAC protocol selection in wireless sensor networks.",
            "An efficient adjustable grid-based data replication scheme for wireless sensor networks.",
            "Tag-based cooperative data gathering and energy recharging in wide area RFID sensor networks.",
            "Fast retry limit adaptation for video distortion/delay control in IEEE 802.11e distributed networks.",
            "Contact expectation based routing for delay tolerant networks.",
            "MCB - A multi-channel beaconing protocol.",
            "Security of electrostatic field persistent routing: Attacks and defense mechanisms.",
            "Maximum lifetime dependable barrier-coverage in wireless sensor networks.",
            "Performance evaluation of mobile agent based resource management protocol for MANETs.",
            "Deployment and reallocation in mobile survivability-heterogeneous wireless sensor networks for barrier coverage.",
            "Location and mobility-aware routing for multimedia streaming in disaster telemedicine.",
            "Opportunistic communications based on distributed width-controllable braided multipath routing in wireless sensor networks.",
            "Toward cluster-based weighted compressive data aggregation in wireless sensor networks.",
            "Integration of scheduling and network coding in multi-rate wireless mesh networks: Optimization models and algorithms.",
            "On the feasibility of synchronous, retransmission-based cognitive networks.",
            "Vehicular networking for mobile crowd sensing.",
            "Position based routing in crowd sensing vehicular networks.",
            "Geo-localized content availability in VANETs.",
            "Query-response geocast for vehicular crowd sensing.",
            "Clustering and sensing with decentralized detection in vehicular ad hoc networks.",
            "An adaptive vehicular epidemic routing method based on attractor selection model.",
            "Providing k-anonymity and revocation in ubiquitous VANETs.",
            "Special issue on advances in vehicular networks.",
            "Designing fail-safe and traffic efficient 802.11p-based rear-end collision avoidance.",
            "Balanced traffic routing: Design, implementation, and evaluation.",
            "Integration of congestion and awareness control in vehicular networks.",
            "Evaluation of MAC contention techniques for efficient geo-routing in vehicular networks.",
            "Analysis of a receiver-based reliable broadcast approach for vehicular networks.",
            "Bluetooth Low Energy performance and robustness analysis for Inter-Vehicular Communications.",
            "Scooter-to-X communications: Antenna placement, human body shadowing, and channel modeling.",
            "A resilient in-network aggregation mechanism for VANETs based on dissemination redundancy.",
            "Establishing location-privacy in decentralized long-distance geocast services.",
            "PUCA: A pseudonym scheme with strong privacy guarantees for vehicular ad-hoc networks.",
            "On the impact of primary traffic correlation in TV White Space.",
            "A mobility optimized SPRT based distributed security solution for replica node detection in mobile sensor networks.",
            "Link probability, node degree and coverage in three-dimensional networks.",
            "Deployment and evaluation of a fully applicable distributed event detection system in Wireless Sensor Networks.",
            "On power control in full duplex underlay cognitive radio networks.",
            "Key evolving RFID systems: Forward/backward privacy and ownership transfer of RFID tags.",
            "A secure and energy-efficient stochastic multipath routing for self-organized mobile ad hoc networks.",
            "A novel approach for scalable multi-hop data dissemination in vehicular ad hoc networks.",
            "An energy-efficient QoS routing for wireless sensor networks using self-stabilizing algorithm.",
            "WDFAD-DBR: Weighting depth and forwarding area division DBR routing protocol for UASNs.",
            "How to provide fair service for V2I communications in VANETs?",
            "Extended shortcut tree routing for ZigBee based wireless sensor network.",
            "Maximizing Wireless Sensor Network lifetime by communication/computation energy optimization of non-repudiation security service: Node level versus network level strategies.",
            "Modified access polynomial based self-healing key management schemes with broadcast authentication and enhanced collusion resistance in wireless sensor networks.",
            "A dual IEEE 802.11 and IEEE 802.15-4 network architecture for energy-efficient communications with low-demanding applications.",
            "On throughput capacity for a class of buffer-limited MANETs.",
            "Observing CoAP groups efficiently.",
            "Node selection optimization for collaborative beamforming in wireless sensor networks.",
            "CoCo+: Exploiting correlated core for energy efficient dissemination in wireless sensor networks.",
            "Context-aware opportunistic networking in multi-hop cellular networks.",
            "A fast and accurate performance analysis of beaconless IEEE 802.15.4 multi-hop networks.",
            "Distributed multi-objective cross-layer optimization with joint hyperlink and transmission mode scheduling in network coding-based wireless networks.",
            "CStorage: Decentralized compressive data storage in wireless sensor networks.",
            "GTS size adaptation algorithm for IEEE 802.15.4 wireless networks.",
            "Light commodity devices for building vehicular ad hoc networks: An experimental study.",
            "OSL: An optimization-based scheduler for RFID Dense-Reader Environments.",
            "Evaluation of available bandwidth as a routing metric for delay-sensitive IEEE 802.15.4-based ad-hoc networks.",
            "HierHybNET: Capacity scaling of ad hoc networks with cost-effective infrastructure.",
            "Ad Hoc Networks Editorial for 2015.",
            "Optimized bi-connected federation of multiple sensor network segments.",
            "Goodput maximization in opportunistic spectrum access networks under constraints on the inter-packet transmission waiting time.",
            "An adaptive wireless passive human detection via fine-grained physical layer information.",
            "Autonomous management of a recursive area hierarchy for large scale wireless sensor networks using multiple parents.",
            "Finding the optimal location and allocation of relay robots for building a rapid end-to-end wireless communication.",
            "Distributed channel selection scheme based on the number of interfering stations in WLAN.",
            "Fast convergecast for low-duty-cycled multi-channel wireless sensor networks.",
            "Energy-efficient coding for electromagnetic nanonetworks in the Terahertz band.",
            "Using data mules for sensor network data recovery.",
            "On the displacement for covering a d-dimensional cube with randomly placed sensors.",
            "On-site configuration of disaster recovery access networks made easy.",
            "Cooperative method for wireless sensor network localization.",
            "Cognitive radio based smart grid: The future of the traditional electrical grid.",
            "Opportunistic reliability for cognitive radio sensor actor networks in smart grid.",
            "Trust based reliable transmissions strategies for smart home energy consumption management in cognitive radio based smart grid.",
            "Resilient to shared spectrum noise scheme for protecting cognitive radio smart grid readings - BCH based steganographic approach.",
            "Flexible channel selection mechanism for cognitive radio based last mile smart grid communications.",
            "Maximizing the link throughput between smart meters and aggregators as secondary users under power and outage constraints.",
            "Communication time delay estimation for load frequency control in two-area power system.",
            "Application of Hierarchical and Distributed Cognitive Architecture Management for the Smart Grid.",
            "Iterative learning for optimal residential load scheduling in smart grid.",
            "A Priority based Cross Layer Routing Protocol for healthcare applications.",
            "Classification of Radio Channel disturbances for industrial wireless sensor networks.",
            "Performance analysis of Block ACK-Based Slotted ALOHA for wireless networks with long propagation delay.",
            "Wireless mobile DTN routing with the extended minimum estimated expected delay protocol.",
            "Construction of minimum connected dominating set in wireless sensor networks using pseudo dominating set.",
            "Smart Wireless Access Networks and Systems for Smart Cities.",
            "Virtual code resource allocation for energy-aware MTC access over 5G systems.",
            "Energy-efficient scheduling and grouping for machine-type communications over cellular networks.",
            "Green cell planning and deployment for small cell networks in smart cities.",
            "Opportunistic communication in smart city: Experimental insight with small-scale taxi fleets as data carriers.",
            "Credible and energy-aware participant selection with limited task budget for mobile crowd sensing.",
            "An intersection-to-intersection travel time estimation and route suggestion approach using vehicular ad-hoc network.",
            "Congestion control in disruption-tolerant networks: A comparative study for interplanetary and terrestrial networking applications.",
            "Provably secure anonymous authentication with batch verification for mobile roaming services.",
            "Graph invariants for unique localizability in cooperative localization of wireless sensor networks: Rigidity index and redundancy index.",
            "An efficient multi-channel MAC protocol for wireless ad hoc networks.",
            "Trust threshold based public key management in mobile ad hoc networks.",
            "Message fragmentation assessment in DTN nanosatellite-based sensor networks.",
            "Data communication in VANETs: Protocols, applications and challenges.",
            "An adaptive, energy-aware and distributed fault-tolerant topology-control algorithm for heterogeneous wireless sensor networks.",
            "A two-prong approach to energy-efficient WSNs: Wake-up receivers plus dedicated, model-based sensing.",
            "NCVCS: Network-coding-based video conference system for mobile devices in multicast networks.",
            "Mobile RFID tag reading with non-overlapping tandem readers on a conveyor belt.",
            "Opportunistic content diffusion in mobile ad hoc networks.",
            "An online approach for wireless network repair in partially-known environments.",
            "Maximal throughput scheduling based on the physical interference model using learning automata.",
            "Impact of hash value truncation on ID anonymity in Wireless Sensor Networks.",
            "Adaptive time varying doppler shift compensation algorithm for OFDM-based underwater acoustic communication systems.",
            "SoftWater: Software-defined networking for next-generation underwater communication systems.",
            "Dynamic deployment of randomly deployed mobile sensor nodes in the presence of obstacles.",
            "Optimal relay placement in multi-hop wireless networks.",
            "A distributed algorithm for Ad-hoc network partitioning based on Voronoi Tessellation.",
            "Spanning tree based topology control for data collecting in predictable delay-tolerant networks.",
            "Gravity gradient routing for information delivery in fog Wireless Sensor Networks.",
            "Real experimentation of probabilistic broadcasting algorithms based on dissimilarity metrics for multi-hop ad hoc networks.",
            "Energy efficient fuzzy adaptive selection of verification nodes in wireless sensor networks.",
            "Improving sensor network immunity under worm attacks: A software diversity approach.",
            "Traffic-aware contact plan design for disruption-tolerant space sensor networks.",
            "A survey on clustering techniques for cooperative wireless networks.",
            "Efficient and robust serial query processing approach for large-scale wireless sensor networks.",
            "Interference-aware multicast trees and meshes for wireless multihop networks.",
            "Extreme value theory for the study of probabilistic worst case delays in wireless networks.",
            "Improving load balancing, path length, and stability in low-cost wireless backhauls.",
            "Hypergraph matching for MU-MIMO user grouping in wireless LANs.",
            "Neighbor discovery in mobile sensing applications: A comprehensive survey.",
            "To send or to defer? Improving the IEEE 802.11p/1609.4 transmission scheme.",
            "Low-power neighbor discovery for mobility-aware wireless sensor networks.",
            "DAP-MAC: A delay-aware probability-based MAC protocol for underwater acoustic sensor networks.",
            "BETA random waypoint mobility model for wireless network simulation.",
            "A neural approach to synchronization in wireless networks with heterogeneous sources of noise.",
            "Weighted proportional fairness and pricing based resource allocation for uplink offloading using IP flow mobility.",
            "Wireless sensor node modelling for energy efficiency analysis in data-intensive periodic monitoring.",
            "A distributed virtual traffic light algorithm exploiting short range V2V communications.",
            "A learning approach to decentralised beacon scheduling.",
            "Feature selection for performance characterization in multi-hop wireless sensor networks.",
            "Neighbor oblivious and finite-state algorithms for circumventing local minima in geographic forwarding.",
            "Dynamic p-graphs for capturing the dynamics of distributed systems.",
            "On optimal resource allocation in virtual sensor networks.",
            "Time synchronization over heterogeneous network for smart grid application: Design and characterization of a real case.",
            "Secure and scalable aggregation in the smart grid resilient against malicious entities.",
            "CBA: A cluster-based client/server data aggregation routing protocol.",
            "Modeling and performance evaluation of security attacks on opportunistic routing protocols for multihop wireless networks.",
            "Task requirement aware pre-processing and Scheduling for IoT sensory environments.",
            "MeDrone: On the use of a medical drone to heal a sensor network infected by a malicious epidemic.",
            "Robust Ad-hoc Sensor Routing (RASeR) protocol for mobile wireless sensor networks.",
            "Gaussian Process Regression for Fingerprinting based Localization.",
            "A novel contention/reservation medium access control scheme for single-hop wireless networks.",
            "Realistic interference-free channel assignment for dynamic wireless mesh networks using beamforming.",
            "Energy-efficient mobile relay deployment scheme for cellular relay networks.",
            "A grid-based reliable routing protocol for wireless sensor networks with randomly distributed clusters.",
            "Enhancing barrier coverage with β quality of monitoring in wireless camera sensor networks.",
            "Special Issue on \"Modeling and Performance Evaluation of Wireless Ad-Hoc Networks\".",
            "The impact of malicious nodes positioning on vehicular alert messaging system.",
            "Analytically modeling data dissemination in vehicular ad hoc networks.",
            "An integrated VANET-based data dissemination and collection protocol for complex urban scenarios.",
            "Design and analysis of stochastic traffic flow models for vehicular clouds.",
            "A probabilistic approach for collision avoidance of uncertain moving objects within black zones.",
            "Mitigation of packet duplication in VANET unicast protocols.",
            "Performance of OPS-SAP technique for PAPR reduction in IEEE 802.11p scenarios.",
            "Simulation and experimental testbed for adaptive video streaming in ad hoc networks.",
            "Analytical modeling of self-pruning and an improved probabilistic broadcast for wireless multihop networks.",
            "Energy balanced position-based routing for lifetime maximization of wireless sensor networks.",
            "Evolutionary multi-path routing for network lifetime and robustness in wireless sensor networks.",
            "An efficient medium access control protocol for WSN-UAV.",
            "New approaches for characterizing inter-contact times in opportunistic networks.",
            "Performance evaluation of DTN protocols to deliver sms in dense mobile network : Empirical proofs.",
            "Experimental evaluation of congestion control for CoAP communications without end-to-end reliability.",
            "Fairness and high-throughput scheduling for multihop wireless ad hoc networks.",
            "A simple visualization and programming framework for wireless sensor networks: PROVIZ.",
            "FACID: A trust-based collaborative decision framework for intrusion detection networks.",
            "Data retrieval time for energy-harvesting wireless sensor networks.",
            "Design of a force-based controlled mobility on aerial vehicles for pest management.",
            "Spectrum sharing methods for the coexistence of multiple RF systems: A survey.",
            "Network-coded cooperative communications with multiple relay nodes: Achievable rate and network optimization.",
            "A location-aware power saving mechanism based on quorum systems for multi-hop mobile ad hoc networks.",
            "PrivHab: A privacy preserving georouting protocol based on a multiagent system for podcast distribution on disconnected areas.",
            "Throughput analysis of two-way relay networks with wireless energy harvesting capabilities.",
            "TrackT: Accurate tracking of RFID tags with mm-level accuracy using first-order taylor series approximation."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2015",
        "info": "2015: Volumes\n24,\n25,\n26,\n27,\n28,\n29,\n30,\n31,\n32,\n33,\n34,\n35",
        "count": 184,
        "papers": [
            "Connectivity restoration in a partitioned wireless sensor network with assured fault tolerance.",
            "Relational position location in ad-hoc networks.",
            "Data similarity aware dynamic node clustering in wireless sensor networks.",
            "A sociality-aware approach to computing backbone in mobile opportunistic networks.",
            "Taming epidemic outbreaks in mobile adhoc networks.",
            "Energy-Aware task scheduler for self-powered sensor nodes: From model to firmware.",
            "Adaptive time window linear regression algorithm for accurate time synchronization in wireless sensor networks.",
            "Source delay in mobile ad hoc networks.",
            "Deafness-aware MAC protocol for directional antennas in wireless ad hoc networks.",
            "Reliability of Bluetooth-based connectivity traces for the characterization of human interaction.",
            "Topology control for predictable delay-tolerant networks based on probability.",
            "Consensus rankings in prioritized converge-cast scheme for wireless sensor network.",
            "Towards prolonged lifetime for deployed WSNs in outdoor environment monitoring.",
            "Bridge protection algorithms - A technique for fault-tolerance in sensor networks.",
            "Full duplex random access for multi-user OFDMA communication systems.",
            "Balanced RF-circuit based self-interference cancellation for full duplex communications.",
            "MPAR: A movement pattern-aware optimal routing for social delay tolerant networks.",
            "Stimulating truth-telling and cooperation among nodes in VANETs through payment and punishment scheme.",
            "Security in the integration of low-power Wireless Sensor Networks with the Internet: A survey.",
            "A survey of broadcast authentication schemes for wireless networks.",
            "A performance evaluation of an efficient traffic congestion detection protocol (ECODE) for intelligent transportation systems.",
            "Traffic density estimation in vehicular ad hoc networks: A review.",
            "Special issue on \"Modeling and Performance Evaluation of Wireless Ad-Hoc Networks\".",
            "Evaluation of flooding schemes for real-time video transmission in VANETs.",
            "A thorough analysis of the performance of delay distribution models for IEEE 802.11 DCF.",
            "A centrality-based topology control protocol for wireless mesh networks.",
            "Improvement of range-free localization technology by a novel DV-hop protocol in wireless sensor networks.",
            "Performance evaluation of sender-assisted HTTP-based video streaming in wireless ad hoc networks.",
            "GeoCover: An efficient sparse coverage protocol for RSU deployment over urban VANETs.",
            "Experimental evaluation of self-organized backpressure routing in a wireless mesh backhaul of small cells.",
            "Exploiting content centric networking to develop topic-based, publish-subscribe MANET systems.",
            "Optimal data compression for lifetime maximization in wireless sensor networks operating in stealth mode.",
            "On bridging theory and practice of inter-session network coding for CSMA/CA based wireless multi-hop networks.",
            "Modelling mobile opportunistic networks - From mobility to structural and behavioural analysis.",
            "A week in the life of three large Wireless Community Networks.",
            "Performance analysis based on least squares and extended Kalman filter for localization of static target in wireless sensor networks.",
            "Energy efficient zone based routing protocol for MANETs.",
            "A hybrid clustering technique using quantitative and qualitative data for wireless sensor networks.",
            "DICSA: Distributed and concurrent link scheduling algorithm for data gathering in wireless sensor networks.",
            "Robust and continuous connectivity maintenance for vehicular dynamic spectrum access networks.",
            "Cell-level modeling of IEEE 802.11 WLANs.",
            "Energy efficient quality-of-service for WLAN-based D2D communications.",
            "Achieving weighted fairness in WLAN mesh networks: An analytical model.",
            "A self-organized backpressure routing scheme for dynamic small cell deployments.",
            "SecLooCI: A comprehensive security middleware architecture for shared wireless sensor networks.",
            "Distributed self fault diagnosis algorithm for large scale wireless sensor networks using modified three sigma edit test.",
            "N-body: A social mobility model with support for larger populations.",
            "An infrastructure-aided cooperative spectrum sensing scheme for vehicular ad hoc networks.",
            "Cooperative multicast with moving window network coding in wireless networks.",
            "Construction of higher spectral efficiency virtual backbone in wireless networks.",
            "Turning foes to allies in cognitive radio networks.",
            "WBAN data scheduling and aggregation under WBAN/WLAN healthcare network.",
            "A survey on probabilistic broadcast schemes for wireless ad hoc networks.",
            "Impact of human behavior on social opportunistic forwarding.",
            "Routing-aware fair contact plan design for predictable delay tolerant networks.",
            "Weak social ties improve content delivery in behavior-aware opportunistic networks.",
            "Interest-awareness in data dissemination for opportunistic networks.",
            "WLAN-Opp: Ad-hoc-less opportunistic networking on smartphones.",
            "JMS for opportunistic networks.",
            "Cost-Effective Multi-Mode Offloading with peer-assisted communications.",
            "Neighbour discovery in opportunistic networks.",
            "Quota-control routing in delay-tolerant networks.",
            "Designing delay constrained hybrid ad hoc network infrastructure for post-disaster communication.",
            "A delay and cost balancing protocol for message routing in mobile delay tolerant networks.",
            "Experimental assessment of the adequacy of Bluetooth for opportunistic networks.",
            "Differential evolution-based autonomous and disruption tolerant vehicular self-organization in MANETs.",
            "Adaptive multi-flow opportunistic routing using learning automata.",
            "A survey on congestion control for delay and disruption tolerant networks.",
            "Energy-aware data centers: Architecture, infrastructure, and communication.",
            "Automatic energy efficiency management of data center resources by load-dependent server activation and sleep modes.",
            "Plug4Green: A flexible energy-aware VM manager to fit data centre particularities.",
            "Matching renewable energy supply and demand in green datacenters.",
            "Energy-efficient, thermal-aware modeling and simulation of data centers: The CoolEmAll approach and evaluation results.",
            "Analysis of an energy proportional data center.",
            "On the feasibility of collaborative green data center ecosystems.",
            "Data centres' power profile selecting policies for Demand Response: Insights of Green Supply Demand Agreement.",
            "Designing energy-efficient link aggregation groups.",
            "LofoSwitch: An online policy for concerted server and disk power control in content distribution networks.",
            "Intelligent control of cognitive radio parameter adaption: Using evolutionary multi-objective algorithm based on user preference.",
            "mRPL: Boosting mobility in the Internet of Things.",
            "A joint power control and rate adaptation MAC protocol for underwater sensor networks.",
            "Device and operation mechanism for non-beacon IEEE802.15.4/Zigbee nodes running on harvested energy.",
            "Protecting data flow anonymity in mobile ad hoc networks that employ cooperative caching.",
            "Schedule-based multi-channel communication in wireless sensor networks: A complete design and performance evaluation.",
            "Maximizing precision for energy-efficient data aggregation in wireless sensor networks with lossy links.",
            "TDOCP: A two-dimensional optimization integrating channel assignment and power control for large-scale WLANs with dense users.",
            "Reliable link quality estimation in low-power wireless networks and its impact on tree-routing.",
            "A fast, reliable and lightweight distributed dissemination protocol for safety messages in Urban Vehicular Networks.",
            "Energy harvesting aware topology control with power adaptation in wireless sensor networks.",
            "A genetic approach on cross-layer optimization for cognitive radio wireless mesh network under SINR model.",
            "On the impact of interference models on channel assignment in multi-radio multi-channel wireless mesh networks.",
            "A hybrid wireless sensor network framework for range-free event localization.",
            "TOA-based joint synchronization and source localization with random errors in sensor positions and sensor clock biases.",
            "VirFID: A Virtual Force (VF)-based Interest-Driven moving phenomenon monitoring scheme using multiple mobile sensor nodes.",
            "Vehicle to Vehicle GeoNetworking using Wireless Sensor Networks.",
            "The Interplanetary Internet implemented on a terrestrial testbed.",
            "User authentication schemes for wireless sensor networks: A review.",
            "A survey of MAC issues for TV white space access.",
            "A model for the classification and survey of clock synchronization protocols in WSNs.",
            "Energy neutral clustering for energy harvesting wireless sensors networks.",
            "Multi-channel cooperative MAC protocol for wireless LANs.",
            "Cooperative image analysis in visual sensor networks.",
            "Lessons learned on solar powered wireless sensor network deployments in urban, desert environments.",
            "Choices for interaction with things on Internet and underlying issues.",
            "On mobility handling of sub-optimal timer-based CDS construction.",
            "Efficient global optimization of multi-parameter network problems on wireless testbeds.",
            "Simulated annealing for interface-constrained channel assignment in wireless mesh networks.",
            "Using multiparent routing in RPL to increase the stability and the lifetime of the network.",
            "Asymptotic analysis of cooperative censoring policies in sensor networks.",
            "Joint link rate allocation, routing and channel assignment in multi-rate multi-channel wireless networks.",
            "Joint power allocation and relay selection strategies for wireless multi-unicast network-coded systems.",
            "On cooperative transmission range extension in multi-hop wireless ad-hoc and sensor networks: A review.",
            "Joint effect of data rate and routing strategy on energy-efficiency of IEEE 802.11 DCF based multi-hop wireless networks under hidden terminal existence.",
            "Characterizing topological bottlenecks for data delivery in CTP using simulation-based stress testing with natural selection.",
            "Perfect link routing for energy efficient forwarding in geographic routing.",
            "A load-balancing routing algorithm for wireless sensor networks based on domain decomposition.",
            "Trust based routing mechanism for securing OSLR-based MANET.",
            "Cooperative Topology Control with Adaptation for improved lifetime in wireless sensor networks.",
            "How to choose an experimentation platform for wireless sensor networks? A survey on static and mobile wireless sensor network experimentation facilities.",
            "Dynamic provisioning and allocation in Cloud Radio Access Networks (C-RANs).",
            "Performance of polling disciplines for the receiver-initiated binary exponential backoff MAC protocol.",
            "Impact of the routing protocol choice on the Envelope-Based Admission Control scheme for ad hoc networks.",
            "Ez-Channel: A distributed MAC protocol for efficient channelization in wireless networks.",
            "Optimal routing with scheduling and channel assignment in multi-power multi-radio wireless sensor networks.",
            "A fuzzy rule-based path configuration method for LEAP in sensor networks.",
            "Internet of Things security and privacy: Design methods and optimization.",
            "OSCAR: Object security architecture for the Internet of Things.",
            "Survey on secure communication protocols for the Internet of Things.",
            "Providing destructive privacy and scalability in RFID systems using PUFs.",
            "Probabilistic yoking proofs for large scale IoT systems.",
            "Increasing base station anonymity using distributed beamforming.",
            "An integrated multimedia data reduction and content confidentiality approach for limited networked devices.",
            "A novel secure aggregation scheme for wireless sensor networks using stateful public key cryptography.",
            "Throughput analysis of cognitive wireless networks with Poisson distributed nodes based on location information.",
            "Improving network coding in wireless ad hoc networks.",
            "An approximation to the QoS aware throughput region of a tree network under IEEE 802.15.4 CSMA/CA with application to wireless sensor network design.",
            "Sensor node tracking using semi-supervised Hidden Markov Models.",
            "On the exact multicast delay in mobile ad hoc networks with f-cast relay.",
            "Internet of multimedia things: Vision and challenges.",
            "Improving dynamic and distributed congestion control in vehicular ad hoc networks.",
            "CoCoA+: An advanced congestion control mechanism for CoAP.",
            "QoS-aware sensor allocation for target tracking in sensor-cloud.",
            "Hierarchical trust management of community of interest groups in mobile ad hoc networks.",
            "A modified Manhattan distance with application for localization algorithms in ad-hoc WSNs.",
            "Multi-objective hierarchical algorithms for restoring Wireless Sensor Network connectivity in known environments.",
            "Spectrum Sensing in small-scale networks: Dealing with multiple mobile PUs.",
            "i-QCA: An intelligent framework for quality of service multicast routing in multichannel multiradio wireless mesh networks.",
            "Quality-of-service aware routing for static and mobile IPv6-based low-power and lossy sensor networks using RPL.",
            "Review of stateful address auto configuration protocols in MANETs.",
            "A survey of single and multi-hop link schedulers for mmWave wireless systems.",
            "Betweenness centrality in Delay Tolerant Networks: A survey.",
            "Editorial of the joint special issue on \"Advances in underwater communications and networks\".",
            "Effective mirror-mapping-based intercarrier interference cancellation for OFDM underwater acoustic communications.",
            "Improving channel estimation for rapidly time-varying correlated underwater acoustic channels by tracking the signal subspace.",
            "Redundancy allocation in time-varying channels with long propagation delays.",
            "Underwater electromagnetic communications using conduction - Channel characterization.",
            "Iterative estimation of doubly selective underwater acoustic channel using basis expansion models.",
            "Cross-layer analysis via Markov models of incremental redundancy hybrid ARQ over underwater acoustic channels.",
            "An efficient MAC protocol for underwater multi-user uplink communication networks.",
            "CARP: A Channel-aware routing protocol for underwater acoustic wireless networks.",
            "Utilizing kinematics and selective sweeping in reinforcement learning-based routing algorithms for underwater networks.",
            "An adaptive routing protocol in underwater sparse acoustic sensor networks.",
            "A novel void node recovery paradigm for long-term underwater sensor networks.",
            "Coverage and connectivity in three-dimensional networks with random node deployment.",
            "Self-deployment of mobile underwater acoustic sensor networks for maximized coverage and guaranteed connectivity.",
            "Modeling position uncertainty of networked autonomous underwater vehicles.",
            "Real-time collaborative tracking for underwater networked systems.",
            "ToA-TS: Time of arrival based joint time synchronization and tracking for mobile underwater systems.",
            "The SUNSET framework for simulation, emulation and at-sea testing of underwater wireless sensor networks.",
            "Design and evaluation of a low-cost, DIY-inspired, underwater platform to promote experimental research in UWSN.",
            "Software-defined underwater acoustic networking platform and its applications.",
            "Special issue on big data inspired data sensing, processing and networking technologies.",
            "Estimating online vacancies in real-time road traffic monitoring with traffic sensor data stream.",
            "Ensembles of incremental learners to detect anomalies in ad hoc sensor networks.",
            "An empirical study on implementing highly reliable stream computing systems with private cloud.",
            "A trustworthy access control model for mobile cloud computing based on reputation and mechanism design.",
            "Towards a Big Data system disaster recovery in a Private Cloud.",
            "GreeDi: An energy efficient routing algorithm for big data on cloud.",
            "A big data inspired chaotic solution for fuzzy feedback linearization model in cyber-physical systems.",
            "Efficient subspace skyline query based on user preference using MapReduce.",
            "A MapReduce based Parallel Niche Genetic Algorithm for contaminant source identification in water distribution network.",
            "Intelligent photovoltaic monitoring based on solar irradiance big data and wireless sensor networks.",
            "Distributed in-memory vocabulary tree for real-time retrieval of big data images.",
            "Residual energy-based adaptive data collection approach for periodic sensor networks."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2014",
        "info": "2014: Volumes\n12,\n13,\n14,\n15,\n16,\n17,\n18,\n19,\n20,\n21,\n22,\n23",
        "count": 172,
        "papers": [
            "Editorial from the SCENES Special Issue Guest Editors.",
            "Acquisition of human traces with Bluetooth technology: Challenges and proposals.",
            "Impact of human mobility on wireless ad hoc networking in entertainment parks.",
            "Facebook or Fakebook? The effects of simulated mobile applications on simulated mobile networks.",
            "Special Issue on Modelling and Simulation of Wireless and Mobile Systems.",
            "Latency-minimizing data aggregation in wireless sensor networks under physical interference model.",
            "A spatial correlation aware algorithm to perform efficient data collection in wireless sensor networks.",
            "Performance evaluation tools for QoS MAC protocol for wireless sensor networks.",
            "Low-dimensional signal-strength fingerprint-based positioning in wireless LANs.",
            "Throughput optimization in wireless local networks with inter-AP interference via a joint-association control, rate control, and contention resolution.",
            "On the need for a reputation system in mobile phone based sensing.",
            "Capacity scaling in free-space-optical mobile ad hoc networks.",
            "A Markovian approach for best-fit channel selection in cognitive radio networks.",
            "WISDoM-SD: Wireless IPTV service distribution over mesh mode via space diversity.",
            "Information security for sensors by overwhelming random sequences and permutations.",
            "Data transmission and base-station placement for optimizing the lifetime of wireless sensor networks.",
            "Decomposing broadcast algorithms using abstract MAC layers.",
            "Finding available parking spaces made easy.",
            "Direction election in flocking swarms.",
            "Reliable neighbor discovery for mobile ad hoc networks.",
            "Radio cover time in hyper-graphs.",
            "Reprint of \"Prioritized gossip in vehicular networks\".",
            "Editorial: Wireless Technologies for Humanitarian Relief.",
            "Design, development, and deployment of a wireless sensor network for detection of landslides.",
            "A joint routing and localization algorithm for emergency scenario.",
            "Numerical simulation of UWB impulse radar vital sign detection at an earthquake disaster site.",
            "Remote vital sign detection for rescue, security, and medical care by ultra-wideband pseudo-noise radar.",
            "An autonomous wireless sensor network deployment system using mobile robots for human existence detection in case of disasters.",
            "New technologies for the search of trapped victims.",
            "EpiMap: Towards quantifying contact networks for understanding epidemiology in developing countries.",
            "Dependable wireless sensor networks for reliable and secure humanitarian relief applications.",
            "Special issue on models and algorithms for wireless mesh networks.",
            "Combining stochastic geometry and statistical mechanics for the analysis and design of mesh networks.",
            "Robust resource allocation for multi-hop wireless mesh networks with end-to-end traffic specifications.",
            "On max-min fair flow optimization in wireless mesh networks.",
            "On channel-discontinuity-constraint routing in wireless networks.",
            "Multicast with cooperative gateways in multi-channel wireless mesh networks.",
            "An analytical framework for distributed coordinated scheduling in IEEE 802.16 wireless mesh networks.",
            "Analytical modeling of context-based multi-virtual wireless mesh networks.",
            "The robust joint solution for channel assignment and routing for wireless mesh networks with time partitioning.",
            "Probing-based anypath forwarding routing algorithms in wireless mesh networks.",
            "A theoretical analysis of multi-hop consensus algorithms for wireless networks: Trade off among reliability, responsiveness and delay tolerance.",
            "A channel-access protocol to utilize multiple heterogeneous channels for ad hoc networks.",
            "Adaptive energy-efficient spectrum probing in cognitive radio networks.",
            "Approaching the time lower bound on cloned-tag identification for large RFID systems.",
            "Optimal rate allocation in wireless networks with delay constraints.",
            "Smart Direct-LTE communication: An energy saving perspective.",
            "3D geometric routing without loops and dead ends in wireless sensor networks.",
            "RSSI-based relative localisation for mobile robots.",
            "Performance modeling and evaluation of IEEE 802.11 IBSS power save mode.",
            "Prediction free energy neutral power management for energy harvesting wireless sensor nodes.",
            "An intrusion detection & adaptive response mechanism for MANETs.",
            "Optimized network dimensioning and planning for WiMAX technology.",
            "Effects of transmit-based and receive-based slot allocation strategies on energy efficiency in WSN MACs.",
            "Fair packet scheduling in Wireless Mesh Networks.",
            "On the applicability of fair and adaptive data dissemination in traffic information systems.",
            "Harnessing cross-layer-design.",
            "An implementation design of a cross-layer handover method with multi-path transmission for VoIP communication.",
            "Improved geographic routing in sensor networks subjected to localization errors.",
            "Relay placement for restoring connectivity in partitioned wireless sensor networks under limited information.",
            "Location error estimation in wireless ad hoc networks.",
            "WCCP: A congestion control protocol for wireless multimedia communication in sensor networks.",
            "Clustering in Vehicular Ad Hoc Networks using Affinity Propagation.",
            "Delay monitoring for wireless sensor networks: An architecture using air sniffers.",
            "Optimal design of energy-efficient and cost-effective wireless body area networks.",
            "Agent-based Multi-Service Routing for Polar-orbit LEO broadband satellite networks.",
            "Editorial.",
            "A novel encounter-based metric for mobile ad-hoc networks routing.",
            "Mobile IPv6 in Internet of Things: Analysis, experimentations and optimizations.",
            "Implementation of enhanced fractionally spaced algorithm for blind equalization technology in WSNs.",
            "CooPNC: A cooperative multicast protocol exploiting physical layer network coding.",
            "A hybrid (N/M)CHO soft/hard vertical handover technique for heterogeneous wireless networks.",
            "IEEE 802.11 DoS attack detection and mitigation utilizing Cross Layer Design.",
            "A probabilistic framework for jammer identification in MANETs.",
            "Information theory and cryptography based secured communication scheme for cooperative MIMO communication in wireless sensor networks.",
            "Uncertainty-based information extraction in wireless sensor networks for control applications.",
            "A probabilistic routing by using multi-hop retransmission forecast with packet collision-aware constraints in vehicular networks.",
            "A special issue of ad hoc networks on \"Smart solutions for mobility supported distributed and embedded systems\".",
            "Performance analysis of CSMA-based opportunistic medium access protocol in cognitive radio sensor networks.",
            "Collision correction using a cross-layer design architecture for dedicated short range communications vehicle safety messaging.",
            "Efficient topology construction for RPL over IEEE 802.15.4 in wireless sensor networks.",
            "Hop count based distance estimation in mobile ad hoc networks - Challenges and consequences.",
            "Multi-party trust computation in decentralized environments in the presence of malicious adversaries.",
            "Distributed node placement algorithm utilizing controllable mobility in mobile ad hoc networks.",
            "Efficient distributed lifetime optimization algorithm for sensor networks.",
            "On the fly learning of mobility profiles for routing in pocket switched networks.",
            "A practical approach for provenance transmission in wireless sensor networks.",
            "A cognitive framework for WSN based on weighted cognitive maps and Q-learning.",
            "Wireless sensor networks mobility management using fuzzy logic.",
            "A novel MAC scheduler to minimize the energy consumption in a Wireless Sensor Network.",
            "Compressive data gathering using random projection for energy efficient wireless sensor networks.",
            "A fast binary feedback-based distributed adaptive carrier synchronisation for transmission among clusters of disconnected IoT nodes in smart spaces.",
            "Performance evaluation of network coding in IEEE 802.11 wireless ad hoc networks.",
            "A comprehensive analysis on the use of schedule-based asynchronous duty cycling in wireless sensor networks.",
            "A comprehensive analysis of IEEE 802.11 DCF heterogeneous traffic sources.",
            "Delay-sensitive content distribution via peer-to-peer collaboration in public safety vehicular ad-hoc networks.",
            "Modeling message diffusion in epidemical DTN.",
            "Reverse back-off mechanism for safety vehicular ad hoc networks.",
            "DECOR: Distributed construction of load balanced routing trees for many to one sensor networks.",
            "Fibonacci sequence based multipath load balancing approach for mobile ad hoc networks.",
            "Energy-aware sensor node relocation in mobile sensor networks.",
            "Deflating link buffers in a wireless mesh network.",
            "A receiver-based video dissemination solution for vehicular networks with content transmissions decoupled from relay node selection.",
            "Wireless sensor network lifetime maximization by optimal sensor deployment, activity scheduling, data routing and sink mobility.",
            "snapMac: A generic MAC/PHY architecture enabling flexible MAC design.",
            "A stochastic process model of the hop count distribution in wireless sensor networks.",
            "Collecting data in ad-hoc networks with reduced uncertainty.",
            "Multipoint relay selection for robust broadcast in ad hoc networks.",
            "A reinforcement learning based solution for cognitive network cooperation between co-located, heterogeneous wireless sensor networks.",
            "A MAC protocol with mobility support in cognitive radio ad hoc networks: Protocol design and analysis.",
            "Comparative performance analysis of evolutionary algorithm based parameter optimization in cognitive radio engine: A survey.",
            "From M2M communications to the Internet of Things: Opportunities and challenges.",
            "Machine-to-machine communications: Technologies and challenges.",
            "On alleviating MTC overload in EPS.",
            "Analysis of energy efficient distributed neighbour discovery mechanisms for Machine-to-Machine Networks.",
            "Context aware ad hoc network for mitigation of crowd disasters.",
            "Back pressure congestion control for CoAP/6LoWPAN networks.",
            "Efficient naming, addressing and profile services in Internet-of-Things sensory environments.",
            "Semantic enablers for dynamic digital-physical object associations in a federated node architecture for the Internet of Things.",
            "Smart things in the social loop: Paradigms, technologies, and potentials.",
            "A secure ECC-based RFID authentication scheme integrated with ID-verifier transfer protocol.",
            "S2DRP: Secure implementations of distributed reprogramming protocol for wireless sensor networks.",
            "On the implementation, deployment and evaluation of a networking protocol for VANETs: The VARON case.",
            "QoS-aware distributed adaptive cooperative routing in wireless sensor networks.",
            "LIPS: Link Prediction as a Service for data aggregation applications.",
            "Trust management in mobile ad hoc networks for bias minimization and application performance maximization.",
            "Image-based modeling and simulating physical channel for vehicle-to-vehicle communications.",
            "Data offloading in social mobile networks through VIP delegation.",
            "Stability-based and energy-efficient distributed data gathering algorithms for wireless mobile sensor networks.",
            "Comparison of QoS-aware single-path vs. multi-path routing protocols for image transmission in wireless multimedia sensor networks.",
            "An accurate and precise malicious node exclusion mechanism for ad hoc networks.",
            "Understanding security failures of two-factor authentication schemes for real-time applications in hierarchical wireless sensor networks.",
            "Design of a generic management system for wireless sensor networks.",
            "A novel range-free localization algorithm to turn connectivity traces and motion data into localization information.",
            "Link availability estimation based reliable routing for aeronautical ad hoc networks.",
            "Optimal channel assignment with aggregation in multi-channel systems: A resilient approach to adjacent-channel interference.",
            "A hybrid MAC protocol for emergency response wireless sensor networks.",
            "A novel user authentication and key agreement scheme for heterogeneous ad hoc wireless sensor networks, based on the Internet of Things notion.",
            "On convexification of range measurement based sensor and source localization problems.",
            "Network coding versus traditional routing in adversarial wireless networks.",
            "Economy driven content dissemination in Delay Tolerant Networks.",
            "A distributed routing for wireless sensor networks with mobile sink based on the greedy embedding.",
            "SKAIT: A parameterized key assignment scheme for confidential communication in resource constrained ad hoc wireless networks.",
            "Comparison of optimization algorithms in the sensor selection for predictive target tracking.",
            "Optimal sequential wireless relay placement on a random lattice path.",
            "Traffic-and-resource-aware intrusion detection in wireless mesh networks.",
            "Enhanced VANET broadcast throughput capacity via a dynamic backbone architecture.",
            "Closing the gap between traffic workload and channel occupancy models for 802.11 networks.",
            "Lifetime elongation of ad hoc networks under flooding attack using power-saving technique.",
            "Temporal coverage mechanism for distinct quality of monitoring in wireless mobile sensor networks.",
            "TOHIP: A topology-hiding multipath routing protocol in mobile ad hoc networks.",
            "Secrecy transmission capacity in noisy wireless ad hoc networks.",
            "Reliable geocasting for random-access underwater acoustic sensor networks.",
            "Editorial for the special issue on routing in smart grid communication networks.",
            "Two new multi-path routing algorithms for fault-tolerant communications in smart grid.",
            "Interference-aware QoS multicast routing for smart grid.",
            "The impact of scalable routing on lifetime of smart grid communication networks.",
            "Quality-of-service differentiation in single-path and multi-path routing for wireless sensor network-based smart grid applications.",
            "Emerging WiFi Direct technique in home area networks for Smart Grid: Power consumption and outage performance.",
            "Impacts of unreliable communication and modified regret matching based anti-jamming approach in smart microgrid.",
            "A four-way-handshake protocol for energy forwarding networks in the smart grid.",
            "OCPM: Ortho code privacy mechanism in smart grid using ring communication architecture.",
            "Local coverage measurement algorithm in GPS-free wireless sensor networks.",
            "Enhanced power saving mode for low-latency communication in multi-hop 802.11 networks.",
            "Routing on large scale mobile ad hoc networks using bloom filters.",
            "Scalable and efficient dual-region based mobility management for ad hoc networks.",
            "Improving response time in time critical Visual Sensor Network applications.",
            "Space for Internet and Internet for space.",
            "Performance evaluation of a WSN system for distributed event detection using fuzzy logic.",
            "Performance analysis of a cross-layered incremental redundancy hybrid automatic repeat request (CL IR-HARQ) mechanism.",
            "Proactive versus reactive routing in low power and lossy networks: Performance analysis and scalability improvements.",
            "A fault-tolerant relay placement algorithm for ensuring k vertex-disjoint shortest paths in wireless sensor networks."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2013",
        "info": "Volume 11: 2013",
        "count": 195,
        "papers": [
            "Rate management in multiuser detection based MAC design for ad hoc networks.",
            "An efficient reliable one-hop broadcast in mobile ad hoc networks.",
            "Multicast capacity scaling for inhomogeneous mobile ad hoc networks.",
            "An integrated system based on wireless sensor networks for patient monitoring, localization and tracking.",
            "Evaluating the impact of network density, hidden nodes and capture effect for throughput guarantee in multi-hop wireless networks.",
            "Optimised relay selection for route discovery in reactive routing.",
            "Improving path duration in high mobility vehicular ad hoc networks.",
            "Geo-casting of queries combined with coverage area reporting for wireless sensor networks.",
            "Evaluating inter-arrival time in general random waypoint mobility model.",
            "Cooperative localization in mobile networks using nonparametric variants of belief propagation.",
            "Implementing a hardware-embedded reactive agents platform based on a service-oriented architecture over heterogeneous wireless sensor networks.",
            "Packet-centric approach to distributed sparse-graph coding in wireless ad hoc networks.",
            "EIBAS: An efficient identity-based broadcast authentication scheme in wireless sensor networks.",
            "Energy efficient network coding-based MAC for cooperative ARQ wireless networks.",
            "Interference-free energy efficient scheduling in wireless ad hoc networks.",
            "CL-MAC: A Cross-Layer MAC protocol for heterogeneous Wireless Sensor Networks.",
            "Intrusion detection in MANET using classification algorithms: The effects of cost and model selection.",
            "Optimal trajectory determination of a single moving beacon for efficient localization in a mobile ad-hoc network.",
            "Hierarchical Tree Alternative Path (HTAP) algorithm for congestion control in wireless sensor networks.",
            "Energy-efficient location services for mobile ad hoc networks.",
            "SHAKE: Single HAsh key establishment for resource constrained devices.",
            "Design guidelines for quality of service support in Optimized Link State Routing-based mobile ad hoc networks.",
            "An efficient handover decision method based on frame retransmission and data rate for multi-rate WLANs.",
            "A cross-layer approach for real-time multimedia streaming on wireless peer-to-peer ad hoc network.",
            "An incremental deployment algorithm for wireless sensor networks using one or multiple autonomous agents.",
            "Distributed semi-synchronous channel coordination for multi-channel wireless networks.",
            "A practical quadratic residues based scheme for authentication and privacy in mobile RFID systems.",
            "Prioritized gossip in vehicular networks.",
            "A dual scheme for compression and restoration of sequentially transmitted images over Wireless Sensor Networks.",
            "A scalable joint routing and scheduling scheme for large-scale wireless sensor networks.",
            "Accurate time synchronization of ultrasonic TOF measurements in IEEE 802.15.4 based wireless sensor networks.",
            "GOAL: A parsimonious geographic routing protocol for large scale sensor networks.",
            "Enabling efficient reprogramming through reduction of executable modules in networked embedded systems.",
            "On combining network coding with duty-cycling in flood-based wireless sensor networks.",
            "Deterministic collision free communication despite continuous motion.",
            "A density-driven publish subscribe service for mobile ad-hoc networks.",
            "Flow-balanced routing for multi-hop clustered wireless sensor networks.",
            "Enhanced calibration technique for RSSI-based ranging in body area networks.",
            "Proportional fairness in MAC layer channel access of IEEE 802.11s EDCA based wireless mesh networks.",
            "Automatic realignment with electronic steering of free-space-optical transceivers in MANETs: A proof-of-concept prototype.",
            "A survey on in-network querying and tracking services for wireless sensor networks.",
            "Guest editorial for special issue on cross-layer design in ad hoc and sensor networks.",
            "Fast neighbor positioning and medium access in wireless networks with directional antennas.",
            "A new adaptive receiver-initiated scheme for mitigating starvation in wireless networks.",
            "On the scheduling, multiplexing and diversity trade-off in MIMO ad hoc networks: A unified framework.",
            "IRIS: Integrated data gathering and interest dissemination system for wireless sensor networks.",
            "Cross-layer network formation for energy-efficient IEEE 802.15.4/ZigBee Wireless Sensor Networks.",
            "UPS: Universal Protocol Stack for emerging wireless networks.",
            "A cross-layer framework for optimal delay-margin, network lifetime and utility tradeoff in wireless visual sensor networks.",
            "Cross-layer design and analysis of WSN-based mobile target detection systems.",
            "Ad Hoc Networks Editorial for 2012.",
            "DIBS: Efficient distributed information brokerage in large-scale sensor networks.",
            "BPC - A binary priority countdown protocol.",
            "Drift estimation using pairwise slope with minimum variance in wireless sensor networks.",
            "Sequential opportunistic spectrum access with imperfect channel sensing.",
            "An experimental study of wireless connectivity and routing in ad hoc sensor networks for real-time soccer player monitoring.",
            "Group communication on highways: An evaluation study of geocast protocols and applications.",
            "A sub-nanosecond Synchronized MAC - PHY cross-layer design for Wireless Sensor Networks.",
            "On the optimal random deployment of wireless sensor networks in non-homogeneous scenarios.",
            "MQ-Routing: Mobility-, GPS- and energy-aware routing protocol in MANETs for disaster relief scenarios.",
            "Alleviating contention-induced spurious timeouts in QoS-aware MANETs.",
            "Hierarchical Range Sectoring and Bidirectional Link Quality Estimation for on-demand collections in WSNs.",
            "An energy efficient middleware for an ad-hoc AAL wireless sensor network.",
            "An optimization framework for monitoring multi-channel multi-radio wireless mesh networks.",
            "Effective-SNR estimation for wireless sensor network using Kalman filter.",
            "Supporting bursty traffic in wireless sensor networks through a distributed advertisement-based TDMA protocol (ATMA).",
            "Topology control in large-scale wireless sensor networks: Between information source and sink.",
            "A dynamic ID management protocol for CSMA/IC in ad hoc networks.",
            "A genetic algorithm based exact approach for lifetime maximization of directional sensor networks.",
            "Cooperative spectrum sensing in cognitive radio network using multiobjective evolutionary algorithms and fuzzy decision making.",
            "Performance evaluation of packet aggregation scheme for VoIP service in wireless multi-hop network.",
            "A key management and secure routing integrated framework for Mobile Ad-hoc Networks.",
            "Distributed online outlier detection in wireless sensor networks using ellipsoidal support vector machine.",
            "Hybrid movement strategy in self-orienting directional sensor networks.",
            "Security of industrial sensor network-based remote substations in the context of the Internet of Things.",
            "CCA-Embedded TDMA enabling acyclic traffic in industrial wireless sensor networks.",
            "Throughput analysis in mobile ad hoc networks with directional antennas.",
            "Generic prediction assisted single-copy routing in underwater delay tolerant sensor networks.",
            "Opportunistic data collection for disconnected wireless sensor networks by mobile mules.",
            "Suitability of ad hoc routing in WNR: Performance evaluation and case studies.",
            "A hybrid reservation-based MAC protocol for underwater acoustic sensor networks.",
            "Energy efficient networking via dynamic relay node selection in wireless networks.",
            "Energy-neutral scheduling and forwarding in environmentally-powered wireless sensor networks.",
            "Survey and comparison of message authentication solutions on wireless sensor networks.",
            "Focal design issues affecting the deployment of wireless sensor networks for pipeline monitoring.",
            "Flying Ad-Hoc Networks (FANETs): A survey.",
            "Editorial for special issue: System and theoretical issues in designing and implementing scalable and sustainable wireless sensor networks.",
            "Distributed self-learning scheduling approach for wireless sensor network.",
            "Near optimal scheduling of data aggregation in wireless sensor networks.",
            "An adaptive CSMA/TDMA hybrid MAC for energy and throughput improvement of wireless sensor networks.",
            "Efficient broadcasting in multi-hop wireless networks with a realistic physical layer.",
            "On interference-aware gossiping in uncoordinated duty-cycled multi-hop wireless networks.",
            "Three-dimensional greedy routing in large-scale random wireless sensor networks.",
            "Localized and configurable topology control in lossy wireless sensor networks.",
            "A Bloom filters based dissemination protocol in wireless sensor networks.",
            "E2DTS: An energy efficiency distributed time synchronization algorithm for underwater acoustic mobile sensor networks.",
            "Barrier coverage with line-based deployed mobile sensors.",
            "Energy-synchronized computing for sustainable sensor networks.",
            "Adaptive algorithms for sensor activation in renewable energy based sensor systems.",
            "EFCon: Energy flow control for sustainable wireless sensor networks.",
            "Special Issue on Wireless Communications and Networking in Challenged Environments.",
            "IPool-ADELIN: An extended ADELIN based on IPool node for reliable transport of Underwater Acoustic Sensor Networks.",
            "A receiver synchronized slotted Aloha for underwater wireless networks with imprecise propagation delay information.",
            "SewerSnort: A drifting sensor for in situ Wastewater Collection System gas monitoring.",
            "Statistical wireless channel propagation characteristics in underground mines at 900 MHz: A comparative analysis with indoor channels.",
            "Real-time wireless multi-hop protocol in underground voice communication.",
            "A trust-based framework for data forwarding in opportunistic networks.",
            "Mitigating multi-path fading in a mobile mesh network.",
            "Polarization-based cooperative directional MAC protocol for ad hoc networks.",
            "Energy monitoring in residential spaces with audio sensor nodes: TinyEARS.",
            "EMS: Efficient mobile sink scheduling in wireless sensor networks.",
            "Clustering and power management for virtual MIMO communications in wireless sensor networks.",
            "A distributed data storage protocol for heterogeneous wireless sensor networks with mobile sinks.",
            "A network coding based protocol for reliable data transfer in underwater acoustic sensor.",
            "Soil Scouts: Description and performance of single hop wireless underground sensor nodes.",
            "Lightweight protocols and privacy for all-in-silicon objects.",
            "On co-channel and adjacent channel interference mitigation in cognitive radio networks.",
            "The rise and fall of spatio-temporal clusters in mobile ad hoc networks.",
            "An adaptive energy-efficient area coverage algorithm for wireless sensor networks.",
            "Maximum lifetime broadcast communications in cooperative multihop wireless ad hoc networks: Centralized and distributed approaches.",
            "Dynamic agent-based hierarchical multicast for wireless mesh networks.",
            "Best and worst-case coverage problems for arbitrary paths in wireless sensor networks.",
            "Energy minimization by exploiting data redundancy in real-time wireless sensor networks.",
            "Scheduling with interference decoding: Complexity and algorithms.",
            "Exploring geographic context awareness for data dissemination on mobile ad hoc networks.",
            "Efficient rate allocation, routing and channel assignment in wireless mesh networks supporting dynamic traffic flows.",
            "Using local conditions to reduce control overhead.",
            "Convergecast tree management from arbitrary node failure in sensor network.",
            "A delay-bounded event-monitoring and adversary-identification protocol in resource-constraint sensor networks.",
            "TFRC-CR: An equation-based transport protocol for cognitive radio networks.",
            "On the trade-off between energy efficiency and estimation error in compressive sensing.",
            "Dynamic spectrum sharing in cognitive radio networks using truthful mechanisms and virtual currency.",
            "Energy-accuracy trade-offs for hybrid localization using RSS and inertial measurements in wireless sensor networks.",
            "A special issue of Ad Hoc Networks on \"Theory, algorithms and applications of wireless networked robotics\".",
            "Ad hoc self-healing of OFDMA networks using UAV-based relays.",
            "Coverage strategy for periodic readings in robotic-assisted monitoring systems.",
            "Spatially constrained coordinated navigation for a multi-robot system.",
            "The effects of exploration strategies and communication models on the performance of cooperative exploration.",
            "An algorithm for fast rendezvous seeking of wireless networked robotic systems.",
            "Randomized carrier-based sensor relocation in wireless sensor and robot networks.",
            "An autonomous Wireless Networked Robotics System for backbone deployment in highly-obstructed environments.",
            "Autonomous precision agriculture through integration of wireless underground sensor networks with center pivot irrigation systems.",
            "Special Issue of Ad Hoc Networks on Recent Advances in Vehicular Communications and Networking.",
            "On-road video delivery with integrated heterogeneous wireless networks.",
            "Fast randomized algorithm for 2-hops clustering in vehicular ad-hoc networks.",
            "Cognitive multicast with partially overlapped channels in vehicular ad hoc networks.",
            "Complete architecture and demonstration design for a new combined WiMAX/DSRC system with improved vehicular networking efficiency.",
            "Context awareness beacon scheduling scheme for congestion control in vehicle to vehicle safety communication.",
            "A low latency path diversity mechanism for sender-oriented broadcast protocols in VANETs.",
            "Design and performance evaluation of a PMIPv6 solution for geonetworking-based VANETs.",
            "Data fusion with flexible message composition in Driver-in-the-Loop vehicular CPS.",
            "Trust prediction and trust-based source routing in mobile ad hoc networks.",
            "A study on traffic signal control at signalized intersections in vehicular ad hoc networks.",
            "GeoSVR: A map-based stateless VANET routing.",
            "Fast and reliable handoff for vehicular networks.",
            "A cross-layer framework for multiobjective performance evaluation of wireless ad hoc networks.",
            "Load balancing techniques for lifetime maximizing in wireless sensor networks.",
            "Impact of node distance on selfish replica allocation in a mobile ad-hoc network.",
            "Joint route selection and resource allocation in multihop wireless networks based on a game theoretic approach.",
            "On the tradeoff between altruism and selfishness in MANET trust management.",
            "Admission control on multipath routing in 802.11-based wireless mesh networks.",
            "Heuristic optimization techniques for self-orientation of directional antennas in long-distance point-to-point broadband networks.",
            "RFID-based localization with Non-Blocking tag scanning.",
            "Optimum node placement in wireless opportunistic routing networks.",
            "Multiple point of interest discovery and coverage with mobile wireless sensors.",
            "Towards efficient dynamic surface gateway deployment for underwater network.",
            "Lightweight routing with dynamic interests in wireless sensor and actor networks.",
            "Fast distributed multi-hop relative time synchronization protocol and estimators for wireless sensor networks.",
            "Void traversal for efficient non-planar geometric routing.",
            "Sensing clouds: A distributed cooperative target tracking with tiny binary noisy sensors.",
            "Detection of malicious users in cognitive radio ad hoc networks: A non-parametric statistical approach.",
            "VANET-based secure taxi service.",
            "An exploration of aggregation convergecast scheduling.",
            "Improving vehicular safety message delivery through the implementation of a cognitive vehicular network.",
            "Impacts of user-selfishness on cooperative content caching in social wireless networks.",
            "DistressNet: A disaster response system providing constant availability cloud-like services.",
            "Automated design algorithms for tactical wireless networks.",
            "Reliable data approximation in wireless sensor network.",
            "Onto scalable wireless ad hoc networks: Adaptive and location-aware clustering.",
            "One-way hash chain-based self-healing group key distribution scheme with collusion resistance capability in wireless sensor networks.",
            "Energy constraint clustering algorithms for wireless sensor networks.",
            "Improving scalability in vehicular communication using one-way hash chain method.",
            "Energy and spectrum-aware MAC protocol for perpetual wireless nanosensor networks in the Terahertz Band.",
            "Cooperative schemes for path establishment in mobile ad-hoc networks under shadow-fading.",
            "Improving the transport performance in delay tolerant networks by random linear network coding and global acknowledgments.",
            "A dual-mode energy efficient encryption protocol for wireless sensor networks.",
            "Passive wake-up radios: From devices to applications.",
            "AGREE: exploiting energy harvesting to support data-centric access control in WSNs.",
            "It measures like me: An IoTs algorithm in WSNs based on heuristics behavior and clustering methods.",
            "Spoofing detection in IEEE 802.15.4 networks based on received signal strength.",
            "SVELTE: Real-time intrusion detection in the Internet of Things.",
            "TC-BAC: A trust and centrality degree based access control model in wireless sensor networks.",
            "Privacy-preserving and accountable on-the-road prosecution of invalid vehicular mandatory authorizations.",
            "DTLS based security and two-way authentication for the Internet of Things.",
            "A novel batch-based group key management protocol applied to the Internet of Things."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2012",
        "info": "Volume 10: 2012",
        "count": 114,
        "papers": [
            "Neighbor discovery in wireless networks with sectored antennas.",
            "Quantitative analysis of the hidden terminal problem in preamble sampling WSNs.",
            "WSNSec: A scalable data link layer security protocol for WSNs.",
            "Responsive on-line gateway load-balancing for wireless mesh networks.",
            "Fault-tolerant monitor placement for out-of-band wireless sensor network monitoring.",
            "Graph-based criteria for spectrum-aware clustering in cognitive radio networks.",
            "A group-based channel assignment protocol for rate separation in IEEE 802.11-based multi-radio multi-rate ad hoc networks.",
            "Information dissemination in VANETs based upon a tree topology.",
            "Bounds and parameter optimization of medium access control coding for wireless ad hoc and sensor networks.",
            "Editorial for the special issue of Ad Hoc Networks journal on Recent advances in analysis and deployment of IEEE 802.11e and IEEE 802.11p protocol families.",
            "Enhancement of QoS support of HCCA schedulers using EDCA function in IEEE 802.11e networks.",
            "Stable operation of IEEE 802.11e EDCA: Interaction between offered load and MAC parameters.",
            "QoS provisioning for large-scale multi-ap WLANs.",
            "Assessing the IEEE 802.11e QoS effectiveness in multi-hop indoor scenarios.",
            "Doppler-resistant column-wise complementary coded CDMA technology for V2V communications.",
            "Improving RSU service time by Distributed Sorting Mechanism.",
            "Mobility impact in IEEE 802.11p infrastructureless vehicular networks.",
            "Provisioning QoS controlled media access in vehicular to infrastructure communications.",
            "Design of a lightweight authentication scheme for IEEE 802.11p vehicular networks.",
            "Enhancing IEEE 802.11p/WAVE to provide infotainment applications in VANETs.",
            "Editorial.",
            "Achieving distributed user access control in sensor networks.",
            "The design of a channel-access protocol for a wireless ad hoc network with sectored directional antennas.",
            "MrFair: Misbehavior-resistant fair scheduling in wireless mesh networks.",
            "TDMA frame design for a prototype underwater RF communication network.",
            "Securing sensor networks: A novel approach that combines encoding, uncorrelation and node disjoint transmission.",
            "Practical packet combining for use with cooperative and non-cooperative ARQ schemes in resource-constrained wireless sensor networks.",
            "An analytical study of the communication cost of data-centric storage in mobile ad hoc networks.",
            "Throughput and delay analysis of multi-channel wireless infrastructure networks.",
            "Eventually Byzantine Agreement on CDS-based mobile ad hoc network.",
            "On a joint temporal-spatial multi-channel assignment and routing scheme in resource-constrained wireless mesh networks.",
            "Modeling human mobility in obstacle-constrained ad hoc networks.",
            "EMLTrust: An enhanced Machine Learning based Reputation System for MANETs.",
            "InRout - A QoS aware route selection algorithm for industrial wireless sensor networks.",
            "ROAMER: Roadside Units as message routers in VANETs.",
            "RPB-MD: Providing robust message dissemination for vehicular ad hoc networks.",
            "Distributed detection of mobile malicious node attacks in wireless sensor networks.",
            "Characterizing pairwise contact patterns in human contact networks.",
            "Distributed point coordination function for IEEE 802.11 wireless ad hoc networks.",
            "On improving the representation of a region achieved by a sensor network.",
            "Link energy minimization for wireless networks.",
            "Analysis of TCP performance on multi-hop wireless networks: A cross layer approach.",
            "LIS: Localization based on an intelligent distributed fuzzy system applied to a WSN.",
            "Theoretic analysis of unique localization for wireless sensor networks.",
            "A survey of MAC layer solutions to the hidden node problem in ad-hoc networks.",
            "Advances in Ad Hoc Networks (II).",
            "Duty cycle learning algorithm (DCLA) for IEEE 802.15.4 beacon-enabled wireless sensor networks.",
            "QoS for wireless sensor networks: Enabling service differentiation at the MAC sub-layer using CoSenS.",
            "Reproducing consistent wireless protocol performance across environments.",
            "Using fuzzy logic for robust event detection in wireless sensor networks.",
            "Accelerating signature-based broadcast authentication for wireless sensor networks.",
            "Editorial for special issue on \"Cognitive radio ad hoc networks\".",
            "Distributed power control algorithm for cognitive radios with primary protection via spectrum sensing under user mobility.",
            "A dynamic and weighted spectrum decision mechanism based on SNR Tracking in CRAHNs.",
            "Nodes organization for channel assignment with topology preservation in multi-radio wireless mesh networks.",
            "Distributed channel selection in CRAHNs: A non-selfish scheme for mitigating spectrum fragmentation.",
            "Dynamic cooperator selection in cognitive radio networks.",
            "Reactive routing for mobile cognitive radio ad hoc networks.",
            "Delay-sensitive and multimedia communication in cognitive radio sensor networks.",
            "Detecting anomalous spectrum usage in dynamic spectrum access networks.",
            "Wireless distributed computing in cognitive radio networks.",
            "A spatial statistics approach to characterizing and modeling the structure of cognitive wireless networks.",
            "Network-coding based event diffusion for wireless networks using semi-broadcasting.",
            "Shortest route mobility assisted packet delivery with soft maximum delay guarantees in mobile ad hoc networks.",
            "A negotiation-based networking methodology to enable cooperation across heterogeneous co-located networks.",
            "ARDEN: Anonymous networking in delay tolerant networks.",
            "Bus switched networks: An ad hoc mobile platform enabling urban-wide communications.",
            "Practical and secure localization and key distribution for wireless sensor networks.",
            "Energy-efficient routing for correlated data in wireless sensor networks.",
            "ICARUS: hybrId inCentive mechAnism for coopeRation stimUlation in ad hoc networkS.",
            "Network coding and competitive approach for gradient based routing in wireless sensor networks.",
            "An efficient remote user authentication and key agreement protocol for mobile client-server environment from pairings.",
            "Extended sliding frame R-Aloha: Medium access control (MAC) protocol for mobile networks.",
            "Error control for multimedia communications in wireless sensor networks: A comparative performance analysis.",
            "An energy efficient channel assignment and routing algorithm for multi-radio wireless mesh networks.",
            "Estimating the channel capacity of multi-hop IEEE 802.11 wireless networks.",
            "Distributed resource allocation in cognitive radio networks with a game learning approach to improve aggregate system capacity.",
            "Auto-localization algorithm for local positioning systems.",
            "A new system for controlled testing of sensor network applications: architecture, prototype and experimental evaluation.",
            "Chains of Trust in vehicular networks: A secure Points of Interest dissemination strategy.",
            "Connectivity constrained wireless sensor deployment using multiobjective evolutionary algorithms and fuzzy decision making.",
            "Distance distributions in random networks.",
            "Towards a reputation-based routing protocol to contrast blackholes in a delay tolerant network.",
            "Secure neighbor discovery and wormhole localization in mobile ad hoc networks.",
            "On delay-minimized data harvesting with mobile elements in wireless sensor networks.",
            "Self-sustaining, efficient and forward-secure cryptographic constructions for Unattended Wireless Sensor Networks.",
            "Analysis of link lifetime in wireless mobile networks.",
            "An incrementally deployable energy efficient 802.15.4 MAC protocol (DEEP).",
            "Polynomial time solution to minimum forwarding set problem in wireless networks under disk coverage model.",
            "Node localization through physical layer network coding: Bootstrap, security, and accuracy.",
            "A secure broadcasting scheme to provide availability, reliability and authentication for wireless sensor networks.",
            "Secret swarm unit: Reactive k-secret sharing.",
            "Energy-delay tradeoff in wireless multihop networks with unreliable links.",
            "Efficient and adaptive congestion control for heterogeneous delay-tolerant networks.",
            "GMCAR: Grid-based multipath with congestion avoidance routing protocol in wireless sensor networks.",
            "Virtual access network embedding in wireless mesh networks.",
            "DECADE: Distributed Emergent Cooperation through ADaptive Evolution in mobile ad hoc networks.",
            "A virtual multiple message ferry backbone routing scheme for mobile ad-hoc networks.",
            "LNT: A logical neighbor tree secure group communication scheme for wireless sensor networks.",
            "MLAS: Multiple level authentication scheme for VANETs.",
            "Cross-layer optimization with cooperative communication for minimum power cost in packet error rate constrained wireless sensor networks.",
            "An energy-aware distributed clustering protocol in wireless sensor networks using fuzzy logic.",
            "Joint design and management of energy-aware Mesh Networks.",
            "Internet of things: Vision, applications and research challenges.",
            "Editorial for special issue on social-based routing in mobile and delay-tolerant networks.",
            "Human-mobility enabled networks in urban environments: Is there any (mobile wireless) small world out there?",
            "On the dynamics of human proximity for data diffusion in ad-hoc networks.",
            "Decentralised detection of periodic encounter communities in opportunistic networks.",
            "Context information prediction for social-based routing in opportunistic networks.",
            "Opportunistic social dissemination of micro-blogs.",
            "CSI: A paradigm for behavior-oriented profile-cast services in mobile networks.",
            "Dealing with dishonest recommendation: The trials in reputation management court.",
            "A routing protocol for socially selfish delay tolerant networks.",
            "Fair content dissemination in participatory DTNs."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2011",
        "info": "Volume 9: 2011",
        "count": 105,
        "papers": [
            "Robust and flexible Internet connectivity for mobile ad hoc networks.",
            "Optimal physical carrier sense in wireless networks.",
            "Multipath optimized link state routing for mobile ad hoc networks.",
            "MARS: Link-layer rate selection for multicast transmissions in wireless mesh networks.",
            "Performance evaluation of distributed localization techniques for mobile underwater acoustic sensor networks.",
            "MC-LMAC: A multi-channel MAC protocol for wireless sensor networks.",
            "Lattice routing: A 4D routing scheme for multiradio multichannel ad hoc networks.",
            "Advances in Ad Hoc Networks (I).",
            "Scalable max-min fairness in wireless ad hoc networks.",
            "Upper bounding service capacity in multi-hop wireless SSMA-based ad hoc networks.",
            "Connectivity-aware minimum-delay geographic routing with vehicle tracking in VANETs.",
            "Joint random access and power control game in ad hoc networks with noncooperative users.",
            "Contact time in random walk and random waypoint: Dichotomy in tail distribution.",
            "Performance analysis of slotted ALOHA and network coding for single-relay multi-user wireless networks.",
            "Graph marginalization for rapid assignment in wide-area surveillance.",
            "SPECS: Secure and privacy enhancing communications schemes for VANETs.",
            "Computationally efficient mutual entity authentication in wireless sensor networks.",
            "Editorial.",
            "MISE-PIPE: Magnetic induction-based wireless sensor networks for underground pipeline monitoring.",
            "Routing in cognitive radio networks: Challenges and solutions.",
            "Towards robustness and energy efficiency of cut detection in wireless sensor networks.",
            "Cross layer load balanced forwarding schemes for video sensor networks.",
            "On the reliability of ad hoc routing protocols for loss-and-delay sensitive applications.",
            "Design and performance analysis of MAC schemes for Wireless Sensor Networks Powered by Ambient Energy Harvesting.",
            "Non-intrusive aggregation in wireless sensor networks.",
            "G-STAR: Geometric STAteless Routing for 3-D wireless sensor networks.",
            "A routing layer-based hierarchical service advertisement and discovery for MANETs.",
            "Evaluation and design of beaconing in mobile wireless networks.",
            "Minimum cost localization problem in wireless sensor networks.",
            "Obstacles constrained group mobility models in event-driven wireless networks with movable base stations.",
            "LEAPER: A lightweight reliable and faithful data packet relaying framework for VANETs.",
            "A service-oriented approach to facilitate WSAN application development.",
            "Immediate neighbor scheduling (INS): An adaptive protocol for mobile ad hoc networks using direct-sequence spread-spectrum modulation.",
            "BorderSense: Border patrol through advanced wireless sensor networks.",
            "Multimedia Ad Hoc and Sensor Networks.",
            "Performance evaluation of the fractional wavelet filter: A low-memory image wavelet transform for multimedia sensor networks.",
            "Foresighted tree configuration games in resource constrained distributed stream mining sensors.",
            "Distributed collaborative camera actuation for redundant data elimination in wireless multimedia sensor networks.",
            "Optimal visual sensor placement for coverage based on target location profile.",
            "Wireless multimedia sensor and actor networks for the next generation power grid.",
            "Distributed audio sensing with homeostasis-inspired autonomous communication.",
            "Ferret: An RFID-enabled pervasive multimedia application.",
            "Distributed target localization using a progressive certainty map in visual sensor networks.",
            "Energy efficient and perceived QoS aware video routing over Wireless Multimedia Sensor Networks.",
            "A unified framework for distributed video rate allocation over wireless networks.",
            "Resource management for video streaming in ad hoc networks.",
            "Analytical performance of soft clustering protocols.",
            "The impact of interference-aware routing metrics on video streaming in Wireless Mesh Networks.",
            "A greedy-based stable multi-path routing protocol in mobile ad hoc networks.",
            "Wireless personal area networks architecture and protocols for multimedia applications.",
            "Trust management for multimedia P2P applications in autonomic networking.",
            "ABC-MC: A new multi-channel geographic forwarding scheme for wireless sensor networks.",
            "Adaptive cost efficient deployment strategy for homogeneous wireless camera sensors.",
            "A light-weight authentication scheme for wireless sensor networks.",
            "Netted radar: Network communications design and optimisation.",
            "Design and analysis of a propagation delay tolerant ALOHA protocol for underwater networks.",
            "Provably secure hybrid key agreement protocols in cluster-based wireless ad hoc networks.",
            "R-Code: Network coding-based reliable broadcast in wireless mesh networks.",
            "NetTopo: A framework of simulation and visualization for wireless sensor networks.",
            "Achieving Max-Min lifetime and fairness with rate allocation for data aggregation in sensor networks.",
            "Integrated topology control and routing in wireless sensor networks for prolonged network lifetime.",
            "An investigation of Bluetooth mergence with Ultra Wideband.",
            "Interference and traffic aware channel assignment in WiFi-based wireless mesh networks.",
            "ADV-MAC: Analysis and optimization of energy efficiency through data advertisements for wireless sensor networks.",
            "A Cooperative Channel Assignment protocol for multi-channel multi-rate wireless mesh networks.",
            "A QoS-aware routing mechanism for multi-channel multi-interface ad-hoc networks.",
            "Dynamic asymmetric group key agreement for ad hoc networks.",
            "Froms: A failure tolerant and mobility enabled multicast routing paradigm with reinforcement learning for WSNs.",
            "A survey of cross-layer design for VANETs.",
            "Preface for Special Issue \"Distributed Computing in Sensor Systems\".",
            "Minimalist counting in sensor networks (Noise helps).",
            "Modelling mobility: A discrete revolution.",
            "Distributed intrusion detection in the presence of correlated sensor readings: Signal-space and communication-complexity view-point.",
            "Power assignment problems in wireless communication: Covering points by disks, reaching few receivers quickly, and energy-efficient travelling salesman tours.",
            "Optimal data gathering paths and energy-balance mechanisms in wireless networks.",
            "An information-theoretic framework for field monitoring using autonomously mobile sensors.",
            "SAKE: Software attestation for key establishment in sensor networks.",
            "Interference-aware broadcast scheduling in wireless networks.",
            "Clustered Zigbee networks with data fusion: Characterization and performance analysis.",
            "A location prediction based routing protocol and its extensions for multicast and multi-path routing in mobile ad hoc networks.",
            "Adaptive power-controlled MAC protocols for improved throughput in hardware-constrained cognitive radio networks.",
            "Opportunistic large array concentric routing algorithm (OLACRA) for upstream routing in wireless sensor networks.",
            "Reliability and congestion control in cognitive radio sensor networks.",
            "RadiaLE: A framework for designing and assessing link quality estimators in wireless sensor networks.",
            "Parameterized key assignment for confidential communication in wireless networks.",
            "A2-MAKE: An efficient anonymous and accountable mutual authentication and key agreement protocol for WMNs.",
            "QuRiNet: A wide-area wireless mesh testbed for research and experimental evaluations.",
            "On coverage issues in directional sensor networks: A survey.",
            "Joint routing and scheduling optimization in arbitrary ad hoc networks: Comparison of cooperative and hop-by-hop forwarding.",
            "A dynamic reconfigurable routing framework for wireless sensor networks.",
            "Quality aware image transmission over underwater multimedia sensor networks.",
            "A study of subdividing hexagon-clustered WSN for power saving: Analysis and simulation.",
            "Connectivity management in mobile ad hoc networks using particle swarm optimization.",
            "A secure dynamic IP configuration scheme for mobile ad hoc networks.",
            "Comparative analysis of link quality metrics and routing protocols for optimal route construction in wireless mesh networks.",
            "Single phase admission control for QoS-routing protocol in ad hoc networks.",
            "Recent advances on practical aspects of Wireless Mesh Networks.",
            "Towards benchmarking routing protocols in wireless mesh networks.",
            "Interconnection of geographically distributed wireless mesh testbeds: Resource sharing on a large scale.",
            "Indoor deployment of IEEE 802.11s mesh networks: Lessons and guidelines.",
            "Making a mesh router/gateway from a smartphone: Is that a practical solution?",
            "Link quality analysis and measurement in wireless mesh networks.",
            "Improved network resilience of wireless mesh networks using MPLS and Fast Re-Routing techniques.",
            "LORD: Tracking mobile clients in a real mesh.",
            "Design and implementation of CLASS: A Cross-Layer ASSociation scheme for wireless mesh networks."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2010",
        "info": "Volume 8: 2010",
        "count": 63,
        "papers": [
            "Barter trade improves message delivery in opportunistic networks.",
            "Power-aware semi-beaconless 3D georouting algorithms using adjustable transmission ranges for wireless ad hoc and sensor networks.",
            "A consensus-based l-Exclusion algorithm for mobile ad hoc networks.",
            "Service differentiation mechanisms for WLANs.",
            "An ant colony optimization routing based on robustness for ad hoc networks with GPSs.",
            "Retransmission and backoff strategies for wireless broadcasting.",
            "Performance of the beacon-less routing protocol in realistic scenarios.",
            "Turning heterogeneity into an advantage in wireless ad-hoc network routing.",
            "Efficient rate adaptation with QoS support in wireless networks.",
            "Covert channels in ad-hoc wireless networks.",
            "UnMask: Utilizing neighbor monitoring for attack mitigation in multihop wireless sensor networks.",
            "Efficient broadcast for wireless ad hoc networks with a realistic physical layer.",
            "A protocol for data availability in Mobile Ad-Hoc Networks in the presence of insider attacks.",
            "CATCH: A protocol framework for cross-layer attacker traceback in mobile multi-hop networks.",
            "Cache consistency in Wireless Multimedia Sensor Networks.",
            "The challenges of disconnected delay-tolerant MANETs.",
            "Editorial.",
            "A distributed intrusion detection system for resource-constrained devices in ad-hoc networks.",
            "Efficient localization for large-scale underwater sensor networks.",
            "A new distributed topology control algorithm for wireless environments with non-uniform path loss and multipath propagation.",
            "Congestion-aware topology controls for wireless multi-hop networks.",
            "Stable energy-aware topology management in ad hoc networks.",
            "Using hierarchical agglomerative clustering in wireless sensor networks: An energy-efficient and flexible approach.",
            "A three-tier framework for intruder information sharing in sensor networks.",
            "ABC: A simple geographic forwarding scheme capable of bypassing routing holes in sensor networks.",
            "Placement of multiple mobile data collectors in wireless sensor networks.",
            "An analysis of the lifetime of OLSR networks.",
            "Solving coverage problems in wireless sensor networks using cover sets.",
            "A game theory based reputation mechanism to incentivize cooperation in wireless ad hoc networks.",
            "Common control channel design for cognitive radio wireless ad hoc networks using adaptive frequency hopping.",
            "Broadcast capacity of a WSN under communication and information coordination.",
            "Vehicular networks.",
            "Using wireless sensor networks to support intelligent transportation systems.",
            "GeoCross: A geographic routing protocol in the presence of loops in urban scenarios.",
            "PROMPT: A cross-layer position-based communication protocol for delay-aware vehicular access networks.",
            "On the feasibility of UMTS-based Traffic Information Systems.",
            "A probabilistic method for cooperative hierarchical aggregation of data in VANETs.",
            "Multiplayer games over Vehicular Ad Hoc Networks: A new application.",
            "Routing, scheduling and channel assignment in Wireless Mesh Networks: Optimization models and algorithms.",
            "Modeling and analysis of two-flow interactions in wireless networks.",
            "Prolonging network lifetime with multi-domain cooperation strategies in wireless sensor networks.",
            "Computationally secure self-healing key distribution with revocation in wireless ad hoc networks.",
            "Topology optimization for hybrid optical/wireless access networks.",
            "Implementation and experimental evaluation of multi-channel MAC protocols for 802.11 networks.",
            "Probabilistic proactive routing with active route trace-back for MANETs.",
            "An efficient heuristic for placement, scheduling and routing in wireless sensor networks.",
            "Secure key loss recovery for network broadcast in single-hop wireless sensor networks.",
            "Sleep/wake scheduling for multi-hop sensor networks: Non-convexity and approximation algorithm.",
            "A delay-aware reliable event reporting framework for wireless sensor-actuator networks.",
            "SDRT: A reliable data transport protocol for underwater sensor networks.",
            "Maximum lifetime continuous query processing in wireless sensor networks.",
            "Passive discovery of IEEE 802.15.4-based body sensor networks.",
            "Energy-efficient proactive routing in MANET: Energy metrics accuracy.",
            "Time-space backoff for fair node throughput in wireless networks using power control.",
            "Detecting misbehaviors in VANET with integrated root-cause analysis.",
            "Increasing base-station anonymity in wireless sensor networks.",
            "Simple ant routing algorithm strategies for a (Multipurpose) MANET model.",
            "DTN routing in body sensor networks with dynamic postural partitioning.",
            "An efficient and robust name resolution protocol for dynamic MANETs.",
            "A framework for route configurability in power-constrained wireless mesh networks.",
            "Smart bridges, smart tunnels: Transforming wireless sensor networks from research prototypes into robust engineering infrastructure.",
            "Scalable location estimation using smart antennas in wireless sensor networks.",
            "Erratum to \"On the feasibility of UMTS-based Traffic Information Systems\" [Ad Hoc Networks 8 (5) (2010) 506-517]."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2009",
        "info": "Volume 7: 2009",
        "count": 108,
        "papers": [
            "Partially controlled deployment strategies for wireless sensors.",
            "Energy-efficient neighbor discovery protocol for mobile wireless sensor networks.",
            "Efficient wireless reprogramming through reduced bandwidth usage and opportunistic sleeping.",
            "On-demand routing and channel assignment in multi-channel mobile ad hoc networks.",
            "Queuing network models for delay analysis of multihop wireless ad hoc networks.",
            "Throughput-oriented MAC for mobile ad hoc networks: A game-theoretic approach.",
            "Optimal placement and channel assignment of relay stations in heterogeneous wireless mesh networks by modified Bender's decomposition.",
            "Public key cryptography based privacy preserving multi-context RFID infrastructure.",
            "Urban pedestrian mobility for mobile wireless network simulation.",
            "LIDF: Layered intrusion detection framework for ad-hoc networks.",
            "Zone-based virtual backbone formation in wireless ad hoc networks.",
            "Combining on-demand and opportunistic routing for intermittently connected networks.",
            "Routing based on delivery distributions in predictable disruption tolerant networks.",
            "Minimizing spatial and time reservation with Collision-Aware DCF in mobile ad hoc networks.",
            "Interference aware cooperative routing for wireless ad hoc networks.",
            "Robust throughput and routing for mobile ad hoc wireless networks.",
            "Exploiting spatial multiplexing and reuse in multi-antenna wireless ad hoc networks.",
            "Random walk with long jumps for wireless ad hoc networks.",
            "Channel allocation and medium access control for wireless sensor networks.",
            "Energy efficiency in wireless sensor networks using sleep mode TDMA scheduling.",
            "Using group structures for efficient routing in delay tolerant networks.",
            "On construction of minimum energy k-fault resistant topologies.",
            "Comparison of two routing metrics in OLSR on a grid based mesh network.",
            "Quality of service through bandwidth reservation on multirate ad hoc wireless networks.",
            "Joint power control and rate adaptation in wireless sensor networks.",
            "Realistic mobility simulation of urban mesh networks.",
            "Load-balancing in MANET shortest-path routing protocols.",
            "Experimentation-oriented platform for development and evaluation of MANET cross-layer protocols.",
            "Embracing interference in ad hoc networks using joint routing and scheduling with multiple packet reception.",
            "End-to-end fair rate optimization in wired-cum-wireless networks.",
            "Power-aware ad hoc networks with directional antennas: Models and analysis.",
            "Hitting time analysis for a class of random packet forwarding schemes in ad hoc networks.",
            "RETT-gen: A globally efficient routing protocol for wireless sensor networks by equalising sensor energy and avoiding energy holes.",
            "Energy conservation in wireless sensor networks: A survey.",
            "Game theoretic approach in routing protocol for wireless ad hoc networks.",
            "Improving on-demand data access efficiency in MANETs with cooperative caching.",
            "Authentic delay bounded event detection in heterogeneous wireless sensor networks.",
            "A quadratic optimization method for connectivity and coverage control in backbone-based wireless networks.",
            "Multi-gateway association in wireless mesh networks.",
            "Enhanced tree routing for wireless sensor networks.",
            "Special Issue on Bio-inspired computing and communication in wireless Ad Hoc and sensor networks.",
            "A genetic approach to joint routing and link scheduling for wireless mesh networks.",
            "A genetic algorithm based approach for energy efficient routing in two-tiered sensor networks.",
            "Bio-inspired topology control for knowledge sharing mobile agents.",
            "HOPNET: A hybrid ant colony optimization routing algorithm for mobile ad hoc network.",
            "A circulatory system approach for wireless sensor networks.",
            "Bio-inspired multi-agent data harvesting in a proactive urban monitoring environment.",
            "Insect sensory systems inspired computing and communications.",
            "Editorial (for the special issue on underwater networks).",
            "Error propagation analysis for underwater cooperative multi-hop communications.",
            "Idle-time energy savings through wake-up modes in underwater acoustic networks.",
            "Three-dimensional and two-dimensional deployment analysis for underwater acoustic sensor networks.",
            "Efficient error recovery with network coding in underwater sensor networks.",
            "Underwater acoustic sensor networks: Target size detection and performance analysis.",
            "Editorial.",
            "CRAHNs: Cognitive radio ad hoc networks.",
            "Software-driven sensor networks for short-range shallow water applications.",
            "Towards an end-to-end delay analysis of wireless multihop networks.",
            "Optimal backpressure routing for wireless networks with multi-receiver diversity.",
            "LOHD: Location-Oblivious Hybrid data Diffusion in wireless sensor networks.",
            "A quality of service aware cross-layer approach for wireless ad hoc networks with smart antennas.",
            "Locally scheduled packet bursting for data collection in wireless sensor networks.",
            "Online energy aware routing in wireless networks.",
            "Exploring the design space of reliable multicast protocols for wireless mesh networks.",
            "Cluster head election techniques for coverage preservation in wireless sensor networks.",
            "Pushback: A hidden Markov model based scheme for energy efficient data transmission in sensor networks.",
            "UWB-based sensor networks for localization in mining environments.",
            "Failure detectors for wireless sensor-actuator systems.",
            "Querying sensor networks using ad hoc mobile devices: A two-layer networking approach.",
            "CORA: Correlation-based resilient aggregation in sensor networks.",
            "SeRWA: A secure routing protocol against wormhole attacks in sensor networks.",
            "CRUST: Implementation of clustering and routing functions for mobile ad hoc networks using reactive tuple-spaces.",
            "On the performance of two-hop message spreading in DTNs.",
            "SRDP: Secure route discovery for dynamic source routing in MANETs.",
            "Efficient route discovery in hybrid networks.",
            "Minimum energy hierarchical dynamic source routing for Mobile Ad Hoc Networks.",
            "The slow start power controlled MAC protocol for mobile ad hoc networks and its performance analysis.",
            "A review and performance comparison of QoS multicast routing protocols for MANETs.",
            "E-Hermes: A robust cooperative trust establishment scheme for mobile ad hoc networks.",
            "Adaptive per hop differentiation for end-to-end delay assurance in multihop wireless networks.",
            "Channel propagation characteristics of wireless MICAz sensor nodes.",
            "Distributed global ID assignment for wireless sensor networks.",
            "A Bayesian network approach to a biologically inspired motion strategy for mobile wireless sensor networks.",
            "Predistribution and local collaboration-based group rekeying for wireless sensor networks.",
            "On eliminating packet droppers in MANET: A modular solution.",
            "Localised alpha-shape computations for boundary recognition in sensor networks.",
            "Encounter-based message propagation in mobile ad-hoc networks.",
            "Modelisation and validation of a full deterministic medium access method for IEEE 802.15.4 WPAN.",
            "Bounds on coverage time and node density for multi-modality sensing.",
            "A survey on MAC protocols for cognitive radio networks.",
            "Detecting and connecting disjoint sub-networks in wireless sensor and actor networks.",
            "Evaluation of physical carrier sense based spanner construction and maintenance as well as broadcast and convergecast in ad hoc networks.",
            "Improving energy efficiency via probabilistic rate combination in 802.11 multi-rate wireless networks.",
            "Lightweight detection of node presence in MANETs.",
            "Energy-aware scheduling with probabilistic deadline constraints in wireless networks.",
            "Encounter-based worms: Analysis and defense.",
            "Editorial for special issue on privacy and security in wireless sensorand ad hoc networks.",
            "Rethinking security properties, threat models, and the design space in sensor networks: A case study in SCADA systems.",
            "Secure median computation in wireless sensor networks.",
            "Playing hide-and-seek with a focused mobile adversary in unattended wireless sensor networks.",
            "Distributed detection of replica node attacks with group deployment knowledge in wireless sensor networks.",
            "Self-propagating mal-packets in wireless sensor networks: Dynamics and defense implications.",
            "Privacy preservation in wireless sensor networks: A state-of-the-art survey.",
            "Defense against misbehavior in anonymous vehicular ad hoc networks.",
            "ASPE: attribute-based secure policy enforcement in vehicular ad hoc networks.",
            "ARMR: Anonymous routing protocol with multiple routes for communications in mobile ad hoc networks.",
            "Location safety protection in ad hoc networks.",
            "Secure group communication in wireless mesh networks."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2008",
        "info": "Volume 6: 2008",
        "count": 72,
        "papers": [
            "Mobile agent migration modeling and design for target tracking in wireless sensor networks.",
            "A localized certificate revocation scheme for mobile ad hoc networks.",
            "A study of different types of attacks on multicast in mobile ad hoc networks.",
            "Improved ID-based security framework for ad hoc network.",
            "On the impact of a more realistic physical layer on MANET simulations results.",
            "The polarized gossip protocol for path discovery in MANETs.",
            "Network configuration for optimal utilization efficiency of wireless sensor networks.",
            "JAVeLEN - An ultra-low energy ad hoc wireless network.",
            "Directional random access scheme for mobile ad hoc networking using beamforming antennas.",
            "Energy optimization in wireless broadcasting through power control.",
            "A cluster based mobility prediction scheme for ad hoc networks.",
            "Secure probabilistic location verification in randomly deployed wireless sensor networks.",
            "Ad hoc routing for multilevel power save protocols.",
            "Hybrid mobile backbone network routing with flow control and distance awareness (MBNR-FC/DA).",
            "An adaptive medium access control protocol using m-ary tree algorithms for quality-of-service support in single-cell ad hoc networks.",
            "Implicit hop-by-hop congestion control in wireless multihop networks.",
            "Power-efficient topology control for static wireless networks with switched beam directional antennas.",
            "Mobile ad hoc relaying for upward vertical handoff in hybrid WLAN/cellular systems.",
            "Asymptotic uniform data-rate guarantees in large wireless networks.",
            "MobiWorp: Mitigation of the wormhole attack in mobile multihop wireless networks.",
            "Defending against cache consistency attacks in wireless ad hoc networks.",
            "Data aggregated maximum lifetime routing for wireless sensor networks.",
            "A self-organization structure for hybrid networks.",
            "Increasing fairness and efficiency using the MadMac protocol in ad hoc networks.",
            "A MAC layer protocol for wireless networks with asymmetric links.",
            "Trust model for certificate revocation in ad hoc networks.",
            "Self-configurable fault monitoring in ad-hoc networks.",
            "Performance analysis of IEEE 802.11 ad hoc networks in the presence of exposed terminals.",
            "Editorial.",
            "Safari: A self-organizing, hierarchical architecture for scalable ad hoc networking.",
            "Collaborative techniques for intrusion detection in mobile ad-hoc networks.",
            "Adaptive audio streaming in mobile ad hoc networks using neural networks.",
            "Energy cost and error performance of range-aware, anchor-free localization algorithms.",
            "A secure group key management scheme for hierarchical mobile ad hoc networks.",
            "Threshold-based intrusion detection in ad hoc networks and secure AODV.",
            "MORA routing and capacity building in disruption-tolerant networks.",
            "Strategies and techniques for node placement in wireless sensor networks: A survey.",
            "Discovering long lifetime routes in mobile ad hoc networks.",
            "Variable power broadcast using local information in ad hoc networks.",
            "Minimum-energy broadcast and multicast in wireless networks: An integer programming approach and improved heuristic algorithms.",
            "Monte Carlo localization for mobile wireless sensor networks.",
            "3-Dimensional minimum energy broadcasting problem.",
            "On the stability of paths, Steiner trees and connected dominating sets in mobile ad hoc networks.",
            "A \"Group-Division Multiple Access\" framework for channel access to multiple destinations.",
            "Scalable synchronization of clocks in wireless sensor networks.",
            "Exploiting path diversity in the link layer in wireless ad hoc networks.",
            "On ant routing algorithms in ad hoc networks with critical connectivity.",
            "A short-term fair MAC protocol for WLANs.",
            "High-throughput multicast routing metrics in wireless mesh networks.",
            "Grid emulation for managing random sensor networks.",
            "Rapid design and evaluation framework for wireless sensor networks.",
            "Directional MAC and routing schemes for power controlled Wireless Mesh Networks with adaptive antennas.",
            "FP-MAC: A distributed MAC algorithm for 802.15.4-like wireless sensor networks.",
            "IEEE 802.11s wireless mesh networks: Framework and challenges.",
            "Robust medical ad hoc sensor networks (MASN) with wavelet-based ECG data mining.",
            "Balancing the tradeoffs between scalability and availability in mobile ad hoc networks with a flat hashing-based location service.",
            "Secure localization with phantom node detection.",
            "Protocols and architectures for channel assignment in wireless mesh networks.",
            "Location-unaware coverage in wireless sensor networks.",
            "TCP with delayed ack for wireless networks.",
            "Aging analysis in large-scale wireless sensor networks.",
            "HEAP: A packet authentication scheme for mobile ad hoc networks.",
            "Friend-assisted intrusion detection and response mechanisms for mobile ad hoc networks.",
            "On search sets of expanding ring search in wireless networks.",
            "Ad hoc networks: Special issue on energy efficient design in wireless ad hoc and sensor networks.",
            "Balancing computation and communication costs: The case for hybrid execution in sensor networks.",
            "RT-Link: A global time-synchronized link protocol for sensor networks.",
            "Impact of sensor-enhanced mobility prediction on the design of energy-efficient localization.",
            "MERLIN: Cross-layer integration of MAC and routing for low duty-cycle sensor networks.",
            "A new method for distributing power usage across a sensor network.",
            "Sacrificing a little coverage can substantially increase network lifetime.",
            "Design and evaluation of network reconfiguration protocols for mostly-off sensor networks."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2007",
        "info": "Volume 5: 2007",
        "count": 85,
        "papers": [
            "Editorial for the Special Issue of Ad hoc networks \"Security issues in sensor and Ad hoc networks\".",
            "Access control in wireless sensor networks.",
            "Self-healing group key distribution with time-limited node revocation for wireless sensor networks.",
            "An effective key management scheme for heterogeneous sensor networks.",
            "An improved key distribution mechanism for large-scale hierarchical wireless sensor networks.",
            "ECCE: Enhanced cooperative channel establishment for secure pair-wise communication in wireless sensor networks.",
            "Threshold cryptography in mobile ad hoc networks under minimal topology and setup assumptions.",
            "Secure position-based routing protocol for mobile ad hoc networks.",
            "SecMR - a secure multipath routing protocol for ad hoc networks.",
            "Secure data aggregation without persistent cryptographic operations in wireless sensor networks.",
            "Attack-resilient time synchronization for wireless sensor networks.",
            "Secure emergency communication of cellular phones in ad hoc mode.",
            "Implementation of security policy for clinical information systems over wireless sensor networks.",
            "Power-controlled medium access for ad hoc networks with directional antennas.",
            "SMORT: Scalable multipath on-demand routing for mobile ad hoc networks.",
            "Sociological orbit aware location approximation and routing (SOLAR) in MANET.",
            "Protocol-independent multicast packet delivery improvement service for mobile Ad hoc networks.",
            "Throughput guarantees for multi-priority traffic in ad hoc networks.",
            "An adaptive transmission-scheduling protocol for mobile ad hoc networks.",
            "On-line disjoint path routing for network capacity maximization in energy-constrained ad hoc networks.",
            "Editorial for 2006.",
            "Detecting unauthorized and compromised nodes in mobile ad hoc networks.",
            "An efficient reliable broadcasting protocol for wireless mobile ad hoc networks.",
            "Adaptive gossip protocols: Managing security and redundancy in dense ad hoc networks.",
            "A survey on real-world implementations of mobile ad-hoc networks.",
            "Hop count based optimization of Bluetooth scatternets.",
            "Analysis and evaluation of Secos, a protocol for energy efficient and secure communication in sensor networks.",
            "Performance benchmarking of wireless Web servers.",
            "Searching strategies for target discovery in wireless networks.",
            "Sufficient rate constraints for QoS flows in ad-hoc networks.",
            "Trading latency for energy in densely deployed wireless ad hoc networks using message ferrying.",
            "Sink-to-sensors congestion control.",
            "Hop-distance based addressing and routing for dense sensor networks without location information.",
            "Bounded-distance multi-clusterhead formation in wireless ad hoc networks.",
            "Hypergossiping: A generalized broadcast strategy for mobile ad hoc networks.",
            "A GPS-less, outdoor, self-positioning method for wireless sensor networks.",
            "Evaluating the limitations of and alternatives in beaconing.",
            "Improving routing performance in wireless ad hoc networks using cross-layer interactions.",
            "QoS multicast routing by using multiple paths/trees in wireless ad hoc networks.",
            "Analysis of area-congestion-based DDoS attacks in ad hoc networks.",
            "Spanning tree based algorithms for low latency and energy efficient data aggregation enhanced convergecast (DAC) in wireless sensor networks.",
            "A Special Issue on \"Wireless Mesh Networks\".",
            "\"MeshUp\": Self-organizing mesh-based topologies for next generation radio access networks.",
            "Mitigating the gateway bottleneck via transparent cooperative caching in wireless mesh networks.",
            "A resource-efficient and scalable wireless mesh routing protocol.",
            "Cross-layer adaptive control for wireless mesh networks.",
            "Sticky CSMA/CA: Implicit synchronization and real-time QoS in mesh networks.",
            "Stability and sensitivity for congestion control in wireless mesh networks with time varying link capacities.",
            "On the capacity of the single source multiple relay single destination mesh network.",
            "Modeling adaptive node capture attacks in multi-hop wireless networks.",
            "Editorial.",
            "Energy-aware routing in sensor networks: A large system approach.",
            "Minimum latency joint scheduling and routing in wireless sensor networks.",
            "Adaptive cross-layer MAC design for improved energy-efficiency in multi-channel wireless sensor networks.",
            "Modeling and analyzing the correctness of geographic face routing under realistic conditions.",
            "A MAC/Routing cross-layer approach to geographic forwarding in wireless sensor networks.",
            "Achieving maximum flow in interference-aware wireless sensor networks with smart antennas.",
            "On the cross-layer interactions between congestion and contention in wireless sensor and actor networks.",
            "Decentralized rate control for tracking and surveillance networks.",
            "Communication-efficient implementation of join in sensor networks.",
            "Time-critical underwater sensor diffusion with no proactive exchanges and negligible reactive floods.",
            "A joint scheduling, power control, and routing algorithm for ad hoc wireless networks.",
            "Power-aware single- and multipath geographic routing in sensor networks.",
            "An asynchronous neighbor discovery algorithm for wireless sensor networks.",
            "A cluster-based power-efficient MAC scheme for event-driven sensing applications.",
            "Electronic protection and routing optimization of MANETs operating in an electronic warfare environment.",
            "Threshold password authentication against guessing attacks in Ad hoc networks.",
            "An overlay approach to data security in ad-hoc networks.",
            "TinyPEDS: Tiny persistent encrypted data storage in asynchronous wireless sensor networks.",
            "Querying time indexed information in mobile Ad hoc networks.",
            "A self-healing On-demand Geographic Path Routing Protocol for mobile ad-hoc networks.",
            "Perceptive admission control for wireless network quality of service.",
            "A detailed study of a CDMA based approach to enhance ad hoc network performance.",
            "Non-Euclidian geographic routing in wireless networks.",
            "Non-interactive key establishment in mobile ad hoc networks.",
            "Recent research directions in wireless ad hoc networking.",
            "Interactions between the physical layer and upper layers in wireless networks.",
            "Instant collision resolution for tag identification in RFID networks.",
            "A carrier sense multiple access protocol with power backoff (CSMA/PB).",
            "Ensuring strong data guarantees in highly mobile ad hoc networks via quorum systems.",
            "Service capacity in vehicular networks: A resource dissemination analysis.",
            "Channelization for dynamic multi-frequency, multi-hop wireless cellular networks.",
            "A coverage-preserving scheme for wireless sensor network with irregular sensing range.",
            "Building trees based on aggregation efficiency in sensor networks.",
            "Threshold-related throughput - A new criterion for evaluation of sensor network performance."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2006",
        "info": "Volume 4: 2006",
        "count": 42,
        "papers": [
            "A framework for specification and performance evaluation of service discovery protocols in mobile ad-hoc networks.",
            "Power-conserving routing of ad hoc mobile wireless networks based on entropy-constrained algorithms.",
            "Efficient clustering algorithms for self-organizing wireless sensor networks.",
            "Using a new protocol to enhance path reliability and realize load balancing in mobile ad hoc networks.",
            "Radio range adjustment for energy efficient wireless sensor networks.",
            "Quality of service provisioning in ad hoc wireless networks: a survey of issues and solutions.",
            "An implementation framework for trajectory-based routing in ad hoc networks.",
            "Smart antenna based broadcasting in wireless ad hoc networks.",
            "Analysis of an agent-based metric-driven method for ad-hoc, on-demand routing.",
            "Dense cluster gateway based routing protocol for multi-hop mobile ad hoc networks.",
            "Load balancing and resource reservation in mobile ad hoc networks.",
            "Integrating service discovery with routing and session management for ad-hoc networks.",
            "A novel caching scheme for improving Internet-based mobile ad hoc networks performance.",
            "Positioning using local maps.",
            "The integration of ad hoc sensor and cellular networks for multi-class data transmission.",
            "Application versus network layer multicasting in ad hoc networks: the ALMA routing protocol.",
            "Editorial.",
            "Routing characteristics of ad hoc networks with unidirectional links.",
            "Medium Access Control protocols for ad hoc wireless networks: A survey.",
            "Energy considerations for topology-unaware TDMA MAC protocols.",
            "Bypass routing: An on-demand local recovery protocol for ad hoc networks.",
            "Reliable and efficient forwarding in ad hoc networks.",
            "Locating hot nodes and data routing for efficient decision fusion in sensor networks.",
            "Wireless sensor networks for underwater survelliance systems.",
            "Polygonal broadcast, secret maturity, and the firing sensors.",
            "Performance evaluation of single and multi-channel actor to actor communication for wireless sensor actor networks.",
            "Information for routing in energy-constrained ad hoc networks.",
            "Improving route discovery in on-demand routing protocols using two-hop connected dominating sets.",
            "Joint scheduling and power control supporting multicasting in wireless ad hoc networks.",
            "A hint-based probabilistic protocol for unicast communications in MANETs.",
            "LHAP: A lightweight network access control protocol for ad hoc networks.",
            "Hierarchical multicast techniques and scalability in mobile Ad Hoc networks.",
            "Mobility-capacity-delay trade-off in wireless ad hoc networks.",
            "A probabilistic algorithm for efficient and robust data propagation in wireless sensor networks.",
            "Expected k-coverage in wireless sensor networks.",
            "Impact of bursty error rates on the performance of wireless local area network (WLAN).",
            "Wireless underground sensor networks: Research challenges.",
            "Cross-layer congestion control in ad hoc wireless networks.",
            "OGHAM: On-demand global hosts for mobile ad-hoc multicast services.",
            "PPMA, a probabilistic predictive multicast algorithm for ad hoc networks.",
            "Deploying long-lived and cost-effective hybrid sensor networks.",
            "On efficient configurations for Bluetooth scatternets."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2005",
        "info": "Volume 3: 2005",
        "count": 44,
        "papers": [
            "Localized LMST and RNG based minimum-energy broadcast protocols in ad hoc networks.",
            "Estimating the value of co-operation approaches for multi-hop ad hoc networks.",
            "A distributed laxity-based priority scheduling scheme for time-sensitive traffic in mobile ad hoc networks.",
            "On-demand power management for ad hoc networks.",
            "Security considerations in ad hoc sensor networks.",
            "Active query forwarding in sensor networks.",
            "Ad hoc networking for pervasive systems.",
            "An enhanced and energy efficient communication architecture for Bluetooth wireless PANs.",
            "Adaptive interpiconet scheduling for multipurpose scatternet scenarios.",
            "Performance of ad hoc routing using directional antennas.",
            "Improving TCP performance in ad hoc networks using signal strength based link management.",
            "Analysis of coalition formation and cooperation strategies in mobile ad hoc networks.",
            "Lessons from experimental MANET research.",
            "Prediction-based energy map for wireless sensor networks.",
            "Underwater acoustic sensor networks: research challenges.",
            "Clock synchronization for wireless sensor networks: a survey.",
            "A survey on routing protocols for wireless sensor networks.",
            "A survey of Mobile IP in cellular and Mobile Ad-Hoc Network environments.",
            "Energy-efficiency clustering protocol in wireless sensor networks.",
            "Design and demonstration of policy-based management in a multi-hop ad hoc network.",
            "Bluetooth scatternet formation: A survey.",
            "Talk and let talk: performance of Bluetooth piconets with synchronous traffic.",
            "A wireless extension of Profibus DP based on the Bluetooth radio system.",
            "Contention-based MAC protocols with erasure coding for wireless data networks.",
            "Data communications and topology control in wireless ad hoc networks.",
            "The impact of MAC parameters on the performance of 802.15.4 PAN.",
            "A link-indexed statistical traffic prediction approach to improving IEEE 802.11 PSM.",
            "Robust position-based routing for wireless ad hoc networks.",
            "Planar graph routing on geographical clusters.",
            "OLSR performance measurement in a military mobile ad hoc network.",
            "Self-organization in spontaneous networks: the approach of DHT-based routing protocols.",
            "An ad hoc networking scheme in hybrid networks for emergency communications.",
            "Power efficient routing trees for ad hoc wireless networks using directional antenna.",
            "Maintaining weakly-connected dominating sets for clustering ad hoc networks.",
            "An optimised resource aware approach to information collection in ad hoc networks.",
            "Secure hosts auto-configuration in mobile ad hoc networks.",
            "Group key management scheme for large-scale sensor networks.",
            "Bandwidth guaranteed call admission in TDMA/CDMA ad hoc wireless networks.",
            "Unreliable sensor grids: coverage, connectivity and diameter.",
            "Infrastructure-based MAC in wireless mobile ad-hoc networks.",
            "Connectivity maintenance and coverage preservation in wireless sensor networks.",
            "Topology and mobility considerations in mobile ad hoc networks.",
            "Bluetooth scatternets: criteria, models and classification.",
            "How to misuse AODV: a case study of insider attacks against mobile ad-hoc routing protocols."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2004",
        "info": "Volume 2: 2004",
        "count": 28,
        "papers": [
            "A review of routing protocols for mobile ad hoc networks.",
            "Service discovery in mobile ad hoc networks: an overall perspective on architectural choices and network layer support issues.",
            "Design guidelines for wireless sensor networks: communication, clustering and aggregation.",
            "Location and calculation-free node-scheduling schemes in large wireless sensor networks.",
            "A routing framework for providing robustness to node failures in mobile ad hoc networks.",
            "IEEE 802.11 over multi-hop wireless networks: problems and new perspectives.",
            "Position and orientation in ad hoc networks.",
            "Extended message passing algorithm for inference in loopy Gaussian graphical models.",
            "Scalable team multicast in wireless ad hoc networks exploiting coordinated motion.",
            "Ad hoc networking with Bluetooth: key metrics and distributed protocols for scatternet formation.",
            "Quality of service in ad hoc networks.",
            "Power-aware ad hoc cognitive packet networks.",
            "QoS-aware minimum energy multicast tree construction in wireless ad hoc networks.",
            "Optimized priority based energy efficient routing algorithm for mobile ad hoc networks.",
            "QoS routing based on multi-class nodes for mobile ad hoc networks.",
            "Adhoc-like routing in wired networks with genetic algorithms.",
            "Quality of service support in IEEE 802.11 wireless ad hoc networks.",
            "Providing incentives in providerless networks.",
            "TIDS: threshold and identity-based security scheme for wireless ad hoc networks.",
            "Efficient identity-based security schemes for ad hoc network routing protocols.",
            "A reinforcement learning ticket-based probing path discovery scheme for MANETs.",
            "A routing protocol based on node density for ad hoc networks.",
            "Wireless sensor and actor networks: research challenges.",
            "Probabilistic reliable multicast in ad hoc networks.",
            "A distributed and adaptive signal processing approach to exploiting correlation in sensor networks.",
            "A column generation method for spatial TDMA scheduling in ad hoc networks.",
            "Distributed protocols for ad hoc wireless LANs: a learning-automata-based approach.",
            "Increasing the network performance using multi-path routing mechanism with load balance."
        ]
    },
    {
        "name": "Ad hoc Networks",
        "year": "2003",
        "info": "Volume 1: 2003",
        "count": 24,
        "papers": [
            "An Internet vision: the invisible global infrastructure.",
            "Mobile ad hoc networking: imperatives and challenges.",
            "Energy-efficient MAC in ad-hoc networks inspired by conflict resolution concepts.",
            "A hotspot mitigation protocol for ad hoc networks.",
            "Effectiveness of RTS/CTS handshake in IEEE 802.11 based ad hoc networks.",
            "Evolution and future directions of the ad hoc on-demand distance-vector routing protocol.",
            "Secure routing in mobile wireless ad hoc networks.",
            "SEAD: secure efficient distance vector routing for mobile wireless ad hoc networks.",
            "Secure message transmission in mobile ad hoc networks.",
            "Data MULEs: modeling and analysis of a three-tier architecture for sparse sensor networks.",
            "Sensor management policies to provide application QoS.",
            "Localized positioning in ad hoc networks.",
            "Target localization based on energy considerations in distributed sensor networks.",
            "Localized edge detection in sensor fields.",
            "Secure routing in wireless sensor networks: attacks and countermeasures.",
            "Aggregation in sensor networks: an energy-accuracy trade-off.",
            "DIFS: a distributed index for features in sensor networks.",
            "Contention-based forwarding for mobile ad hoc networks.",
            "Location tracking using quorums in mobile ad hoc networks.",
            "The IMPORTANT framework for analyzing the Impact of Mobility on Performance Of RouTing protocols for Adhoc NeTworks.",
            "Energy efficient routing in ad hoc disaster recovery networks.",
            "Prophet address allocation for large scale MANETs.",
            "Solving the near-far problem in CDMA-based ad hoc networks.",
            "Providing secrecy in key management protocols for large wireless sensors networks."
        ]
    }
]